{
  "id": "001c78083f01e8d632feab8468539224ac0ccf9b",
  "text": " You have nothing to feel ashamed of.\"  \"When they get near me --\" Harry stared at Lupin's desk, his throat tight. \"I can hear Voldemort murdering my mum.\"  Lupin made a sudden motion with his arm as though to grip Harry's shoulder, but thought better of it. There was a moment's Silence, then --  \"Why did they have to come to the match?\" said Harry bitterly.  \"They're getting hungry,\" said Lupin coolly, shutting his briefcase with a snap. \"Dumbledore won't let them into the school, so their supply of human prey has dried up.... I don't think they could resist the large crowd around the Quidditch field. All that excitement ... emotions running high... it was their idea of a feast.\"  \"Azkaban must be terrible,\" Harry muttered. Lupin nodded grimly.  \"The fortress is set on a tiny island, way out to sea, but they don't need walls and water to keep the prisoners in, not when they're all trapped inside their own heads, incapable of a single cheery thought. Most of them go mad within weeks.\"  \"But Sirius Black escaped from them,\" Harry said slowly. \"He got away...\"  Lupin's briefcase slipped from the desk; he had to stoop quickly to catch it.  \"Yes,\" he said, straightening up, \"Black must have found a way to fight them. I wouldn't have believed it possible.... Dementors are supposed to drain a wizard of his powers if he is left with them too long....\"  \"You made that dementor on the train back off,\" said Harry suddenly.  \"There are -- certain defenses one can use,\" said Lupin. \"But there was only one dementor on the train. The more there are, the more difficult it becomes to resist.\"  \"What defenses?\" said Harry at once. \"Can you teach me?\"  \"I don't pretend to be an expert at fighting dementors, Harry, quite the contrary...\"  \"But if the dementors come to another Quidditch match, I need to be able to fight them --\"  Lupin looked into Harry's determined face, hesitated, then said, \"Well... all right. I'll try and help. But it'll have to wait until next term, I'm afraid. I have a lot to do before the holidays. I chose a very inconvenient time to fall ill.\"  What with the promise of anti-dementor lessons from Lupin, the thought that he might never have to hear his mother's death again, and the fact that Ravenclaw flattened Hufflepuff in their Quidditch match at the end of November, Harry's mood took a definite upturn. Gryffindor were not out of the running after all, although they could not afford to lose another match. Wood became repossessed of his manic energy, and worked his team as hard as ever in the chilly haze of rain that persisted into December. Harry saw no hint of a dementor within the grounds. Dumbledore's anger seemed to be keeping them at their stations at the entrances.  Two weeks before the end of the term, the sky lightened suddenly to a dazzling, opaline white and the muddy grounds were revealed one morning covered in glittering frost. Inside the castle, there was a buzz of Christmas in the air. Professor Flitwick, the Charms teacher, had already decorated his classroom with shimmering lights that turned out to be real, fluttering fairies. The students were all happily discussing their plans for the holidays. Both Ron and Hermione had decided to remain at Hogwarts, and though Ron said it was because he couldn't stand two weeks with Percy, and Hermione insisted she needed to use the library, Harry wasn't fooled; they were doing it to keep him company, and he was very grateful.  To everyone's delight except Harry's, there was to be another Hogsmeade trip on the very last weekend of the term.  \"We can do all our Christmas shopping there!\" said Hermione. \"Mum and Dad would really love those Toothflossing Stringmints from Honeydukes!\"  Resigned to the fact that he would be the only third year staying behind again, Harry borrowed a copy of Which Broomstick from Wood, and decided to spend the day reading up on the different makes. He had been riding one of the school brooms at team practice, an ancient Shooting Star, which was very slow and jerky; he definitely needed a new broom of his own.  On the Saturday morning of the Hogsmeade trip, Harry bid good-bye to Ron and Hermione, who were wrapped in cloaks and scarves, then turned up the marble staircase alone, and headed back toward Gryffindor Tower. Snow had started to fall outside the windows, and the castle was very still and quiet.  \"Psst -- Harry!\"  He turned, halfway along the third-floor corridor, to see Fred and George peering out at him from behind a statue of a humpbacked, one-eyed witch.  \"What are you doing?\" said Harry curiously. \"How come you're not going to Hogsmeade?\"  \"We've come to give you a bit of festive cheer before we go,\" said Fred, with a mysterious wink. \"Come in here....\"  He nodded toward an empty classroom to the left of the one-eyed statue. Harry followed Fred and George inside. George closed the door quietly and then turned, beaming, to look at Harry.  \"Early Christmas present for you, Harry,\" he said.  Fred pulled something from inside his cloak with a flourish and laid it on one of the desks."
}