{
  "id": "0047f38903fa42e845af2d6cce4667286bd8ac1d",
  "text": " More’n half were women and children, and they were driving their animals before them, goats, sheep, even aurochs dragging sledges. They’d loaded up with bales of fur and sides of meat, cages of chickens, butter churns and spinning wheels, every damn thing they own. The mules and garrons was so heavy laden you’d think their backs would break. The women as well.    And they follow the Milkwater?  Lark the Sisterman asked.   I said so, didn’t I?   The Milkwater would take them past the Fist of the First Men, the ancient ringfort where the Night’s Watch had made its camp. Any man with a thimble of sense could see that it was time to pull up stakes and fall back on the Wall. The Old Bear had strengthened the Fist with spikes and pits and caltrops, but against such a host all that was pointless. If they stayed here, they would be engulfed and overwhelmed.  And Thoren Smallwood wanted to attack. Sweet Donnel Hill was squire to Ser Mallador Locke, and the night before last Smallwood had come to Locke’s tent. Ser Mallador had been of the same mind as old Ser Ottyn Wythers, urging a retreat on the Wall, but Smallwood wanted to convince him otherwise.  This King-beyond-the-Wall will never look for us so far north,  Sweet Donnel reported him saying.  And this great host of his is a shambling horde, full of useless mouths who won’t know what end of a sword to hold. One blow will take all the fight out of them and send them howling back to their hovels for another fifty years.   Three hundred against thirty thousand. Chett called that rank madness, and what was madder still was that Ser Mallador had been persuaded, and the two of them together were on the point of persuading the Old Bear.  If we wait too long this chance may be lost, never to come again,  Smallwood was saying to anyone who would listen. Against that, Ser Ottyn Wythers said,  We are the shield that guards the realms of men. You do not throw away your shield for no good purpose,  but to that Thoren Smallwood said,  In a swordfight, a man’s surest defense is the swift stroke that slays his foe, not cringing behind a shield.   Neither Smallwood nor Wythers had the command, though. Lord Mormont did, and Mormont was waiting for his other scouts, for Jarman Buckwell and the men who’d climbed the Giant’s Stair, and for Qhorin Halfhand and Jon Snow, who’d gone to probe the Skirling Pass. Buckwell and the Halfhand were late in returning, though. Dead, most like. Chett pictured Jon Snow lying blue and frozen on some bleak mountaintop with a wildling spear up his bastard’s arse. The thought made him smile. I hope they killed his bloody wolf as well.   There’s no bear here,  he decided abruptly.  Just an old print, that’s all. Back to the Fist.  The dogs almost yanked him off his feet, as eager to get back as he was. Maybe they thought they were going to get fed. Chett had to laugh. He hadn’t fed them for three days now, to turn them mean and hungry. Tonight, before slipping off into the dark, he’d turn them loose among the horse lines, after Sweet Donnel Hill and Clubfoot Karl cut the tethers. They’ll have snarling hounds and panicked horses all over the Fist, running through fires, jumping the ringwall, and trampling down tents. With all the confusion, it might be hours before anyone noticed that fourteen brothers were missing.  Lark had wanted to bring in twice that number, but what could you expect from some stupid fishbreath Sisterman? Whisper a word in the wrong ear and before you knew it you’d be short a head. No, fourteen was a good number, enough to do what needed doing but not so many that they couldn’t keep the secret. Chett had recruited most of them himself. Small Paul was one of his; the strongest man on the Wall, even if he was slower than a dead snail. He’d once broken a wildling’s back with a hug. They had Dirk as well, named for his favorite weapon, and the little grey man the brothers called Softfoot, who’d raped a hundred women in his youth, and liked to boast how none had never seen nor heard him until he shoved it up inside them.  The plan was Chett’s. He was the clever one; he’d been steward to old Maester Aemon for four good years before that bastard Jon Snow had done him out so his job could be handed to his fat pig of a friend. When he killed Sam Tarly tonight, he planned to whisper,  Give my love to Lord Snow,  right in his ear before he sliced Ser Piggy’s throat open to let the blood come bubbling out through all those layers of suet. Chett knew the ravens, so he wouldn’t have no trouble there, no more than he would with Tarly. One touch of the knife and that craven would piss his pants and start blubbering for his life. Let him beg, it won’t do him no good. After he opened his throat, he’d open the cages and shoo the birds away, so no messages reached the Wall. Softfoot and Small Paul would kill the Old Bear, Dirk would do Blane, and Lark and his cousins would silence Bannen and old Dywen, to keep them from sniffing after their trail. They’d been caching food for a fortnight, and Sweet Donnel and Clubfoot Karl would have the horses ready."
}