{
  "id": "005b1cabbc746ac4d9cf5995363407788539edb3",
  "text": " He remembered one of the Shadow Tower men shoving his spear through a wight’s pale soft belly and out his back, and how the thing staggered right up the shaft and reached out his black hands and twisted the brother’s head around until blood came out his mouth. That was when his bladder let go the first time, he was almost sure.  He did not remember running, but he must have, because the next he knew he was near the fire half a camp away, with old Ser Ottyn Wythers and some archers. Ser Ottyn was on his knees in the snow, staring at the chaos around them, until a riderless horse came by and kicked him in the face. The archers paid him no mind. They were loosing fire arrows at shadows in the dark. Sam saw one wight hit, saw the flames engulf it, but there were a dozen more behind it, and a huge pale shape that must have been the bear, and soon enough the bowmen had no arrows.  And then Sam found himself on a horse. It wasn’t his own horse, and he never recalled mounting up either. Maybe it was the horse that had smashed Ser Ottyn’s face in. The horns were still blowing, so he kicked the horse and turned him toward the sound.  In the midst of carnage and chaos and blowing snow, he found Dolorous Edd sitting on his garron with a plain black banner on a spear.  Sam,  Edd said when he saw him,  would you wake me, please? I am having this terrible nightmare.   More men were mounting up every moment. The warhorns called them back. Ahooo ahooo ahooooooooooooooooooo.  They’re over the west wall, m’lord,  Thoren Smallwood screamed at the Old Bear, as he fought to control his horse.  I’ll send reserves…    NO!  Mormont had to bellow at the top of his lungs to be heard over the horns.  Call them back, we have to cut our way out.  He stood in his stirrups, his black cloak snapping in the wind, the fire shining off his armor.  Spearhead!  he roared.  Form wedge, we ride. Down the south face, then east!    My lord, the south slope’s crawling with them!    The others are too steep,  Mormont said.  We have—   His garron screamed and reared and almost threw him as the bear came staggering through the snow. Sam pissed himself all over again. I didn’t think I had any more left inside me. The bear was dead, pale and rotting, its fur and skin all sloughed off and half its right arm burned to bone, yet still it came on. Only its eyes lived. Bright blue, just as Jon said. They shone like frozen stars. Thoren Smallwood charged, his longsword shining all orange and red from the light of the fire. His swing near took the bear’s head off. And then the bear took his.   RIDE!  the Lord Commander shouted, wheeling.  They were at the gallop by the time they reached the ring. Sam had always been too frightened to jump a horse before, but when the low stone wall loomed up before him he knew he had no choice. He kicked and closed his eyes and whimpered, and the garron took him over, somehow, somehow, the garron took him over. The rider to his right came crashing down in a tangle of steel and leather and screaming horseflesh, and then the wights were swarming over him and the wedge was closing up. They plunged down the hillside at a run, through clutching black hands and burning blue eyes and blowing snow. Horses stumbled and rolled, men were swept from their saddles, torches spun through the air, axes and swords hacked at dead flesh, and Samwell Tarly sobbed, clutching desperately to his horse with a strength he never knew he had.  He was in the middle of the flying spearhead with brothers on either side, and before and behind him as well. A dog ran with them for a ways, bounding down the snowy slope and in and out among the horses, but it could not keep up. The wights stood their ground and were ridden down and trampled underhoof. Even as they fell they clutched at swords and stirrups and the legs of passing horses. Sam saw one claw open a garron’s belly with its right hand while it clung to the saddle with its left.  Suddenly the trees were all about them, and Sam was splashing through a frozen stream with the sounds of slaughter dwindling behind. He turned, breathless with relief… until a man in black leapt from the brush and yanked him out of the saddle. Who he was, Sam never saw; he was up in an instant, and galloping away the next. When he tried to run after the horse, his feet tangled in a root and he fell hard on his face and lay weeping like a baby until Dolorous Edd found him there.  That was his last coherent memory of the Fist of the First Men. Later, hours later, he stood shivering among the other survivors, half mounted and half afoot. They were miles from the Fist by then, though Sam did not remember how. Dywen had led down five packhorses, heavy laden with food and oil and torches, and three had made it this far. The Old Bear made them redistribute the loads, so the loss of any one horse and its provisions would not be such a catastrophe. He took garrons from the healthy men and gave them to the wounded, organized the walkers, and set torches to guard their flanks and rear."
}