{
  "id": "01759716b3540aa4e0072396f8ce29e74b5bc5ec",
  "text": " Heed my words, my queen. The House of the Undying Ones was not made for mortal men. If you value your soul, take care and do just as I tell you.    I will do as you say,  Dany promised.   When you enter, you will find yourself in a room with four doors: the one you have come through and three others. Take the door to your right. Each time, the door to your right. If you should come upon a stairwell, climb. Never go down, and never take any door but the first door to your right.    The door to my right,  Dany repeated.  I understand. And when I leave, the opposite?    By no means,  Pyat Pree said.  Leaving and coming, it is the same. Always up. Always the door to your right. Other doors may open to you. Within, you will see many things that disturb you. Visions of loveliness and visions of horror, wonders and terrors. Sights and sounds of days gone by and days to come and days that never were. Dwellers and servitors may speak to you as you go. Answer or ignore them as you choose, but enter no room until you reach the audience chamber.    I understand.    When you come to the chamber of the Undying, be patient. Our little lives are no more than a flicker of a moth’s wing to them. Listen well, and write each word upon your heart.   When they reached the door—a tall oval mouth, set in a wall fashioned in the likeness of a human face—the smallest dwarf Dany had ever seen was waiting on the threshold. He stood no higher than her knee, his faced pinched and pointed, snoutish, but he was dressed in delicate livery of purple and blue, and his tiny pink hands held a silver tray. Upon it rested a slender crystal glass filled with a thick blue liquid: shade of the evening, the wine of warlocks.  Take and drink,  urged Pyat Pree.   Will it turn my lips blue?    One flute will serve only to unstop your ears and dissolve the caul from off your eyes, so that you may hear and see the truths that will be laid before you.   Dany raised the glass to her lips. The first sip tasted like ink and spoiled meat, foul, but when she swallowed it seemed to come to life within her. She could feel tendrils spreading through her chest, like fingers of fire coiling around her heart, and on her tongue was a taste like honey and anise and cream, like mother’s milk and Drogo’s seed, like red meat and hot blood and molten gold. It was all the tastes she had ever known, and none of them… and then the glass was empty.   Now you may enter,  said the warlock. Dany put the glass back on the servitor’s tray, and went inside.  She found herself in a stone anteroom with four doors, one on each wall. With never a hesitation, she went to the door on her right and stepped through. The second room was a twin to the first. Again she turned to the right-hand door. When she pushed it open she faced yet another small antechamber with four doors. I am in the presence of sorcery.  The fourth room was oval rather than square and walled in worm-eaten wood in place of stone. Six passages led out from it in place of four. Dany chose the rightmost, and entered a long, dim, high-ceilinged hall. Along the right hand was a row of torches burning with a smoky orange light, but the only doors were to her left. Drogon unfolded wide black wings and beat the stale air. He flew twenty feet before thudding to an undignified crash. Dany strode after him.  The mold-eaten carpet under her feet had once been gorgeously colored, and whorls of gold could still be seen in the fabric, glinting broken amidst the faded grey and mottled green. What remained served to muffle her footfalls, but that was not all to the good. Dany could hear sounds within the walls, a faint scurrying and scrabbling that made her think of rats. Drogon heard them too. His head moved as he followed the sounds, and when they stopped he gave an angry scream. Other sounds, even more disturbing, came through some of the closed doors. One shook and thumped, as if someone were trying to break through. From another came a dissonant piping that made the dragon lash his tail wildly from side to side. Dany hurried quickly past.  Not all the doors were closed. I will not look, Dany told herself, but the temptation was too strong.  In one room, a beautiful woman sprawled naked on the floor while four little men crawled over her. They had rattish pointed faces and tiny pink hands, like the servitor who had brought her the glass of shade. One was pumping between her thighs. Another savaged her breasts, worrying at the nipples with his wet red mouth, tearing and chewing.  Farther on she came upon a feast of corpses. Savagely slaughtered, the feasters lay strewn across overturned chairs and hacked trestle tables, asprawl in pools of congealing blood. Some had lost limbs, even heads. Severed hands clutched bloody cups, wooden spoons, roast fowl, heels of bread. In a throne above them sat a dead man with the head of a wolf. He wore an iron crown and held a leg of lamb in one hand as a king might hold a scepter, and his eyes followed Dany with mute appeal."
}