{
  "id": "063d0041fc5e17265e33153aa42ae5afb53df946",
  "text": "   Jon could hear the sounds of their feeding echoing off the rocks. It gave him an uneasy feeling. The warmth of the fire made him realize how bone-tired he was, but he dared not sleep. He had taken a captive, and it was on him to guard her.  Were they your kin?  he asked her quietly.  The two we killed?    No more than you are.    Me?  He frowned.  What do you mean?    You said you were the Bastard o’ Winterfell.    I am.    Who was your mother?    Some woman. Most of them are.  Someone had said that to him once. He did not remember who.  She smiled again, a flash of white teeth.  And she never sung you the song o’ the winter rose?    I never knew my mother. Or any such song.    Bael the Bard made it,  said Ygritte.  He was King-beyond-the-Wall a long time back. All the free folk know his songs, but might be you don’t sing them in the south.    Winterfell’s not in the south,  Jon objected.   Yes it is. Everything below the Wall’s south to us.   He had never thought of it that way.  I suppose it’s all in where you’re standing.    Aye,  Ygritte agreed.  It always is.    Tell me,  Jon urged her. It would be hours before Qhorin came up, and a story would help keep him awake.  I want to hear this tale of yours.    Might be you won’t like it much.    I’ll hear it all the same.    Brave black crow,  she mocked.  Well, long before he was king over the free folk, Bael was a great raider.   Stonesnake gave a snort.  A murderer, robber, and raper, is what you mean.    That’s all in where you’re standing too,  Ygritte said.  The Stark in Winterfell wanted Bael’s head, but never could take him, and the taste o’ failure galled him. One day in his bitterness he called Bael a craven who preyed only on the weak. When word o’ that got back, Bael vowed to teach the lord a lesson. So he scaled the Wall, skipped down the kingsroad, and walked into Winterfell one winter’s night with harp in hand, naming himself Sygerrik of Skagos. Sygerrik means ‘deceiver’ in the Old Tongue, that the First Men spoke, and the giants still speak.   North or south, singers always find a ready welcome, so Bael ate at Lord Stark’s own table, and played for the lord in his high seat until half the night was gone. The old songs he played, and new ones he’d made himself, and he played and sang so well that when he was done, the lord offered to let him name his own reward. ‘All I ask is a flower,’ Bael answered, ‘the fairest flower that blooms in the gardens o’ Winterfell.’   Now as it happened the winter roses had only then come into bloom, and no flower is so rare nor precious. So the Stark sent to his glass gardens and commanded that the most beautiful o’ the winter roses be plucked for the singer’s payment. And so it was done. But when morning come, the singer had vanished… and so had Lord Brandon’s maiden daughter. Her bed they found empty, but for the pale blue rose that Bael had left on the pillow where her head had lain.   Jon had never heard this tale before.  Which Brandon was this supposed to be? Brandon the Builder lived in the Age of Heroes, thousands of years before Bael. There was Brandon the Burner and his father Brandon the Shipwright, but—    This was Brandon the Daughterless,  Ygritte said sharply.  Would you hear the tale, or no?   He scowled.  Go on.    Lord Brandon had no other children. At his behest, the black crows flew forth from their castles in the hundreds, but nowhere could they find any sign o’ Bael or this maid. For most a year they searched, till the lord lost heart and took to his bed, and it seemed as though the line o’ Starks was at its end. But one night as he lay waiting to die, Lord Brandon heard a child’s cry. He followed the sound and found his daughter back in her bedchamber, asleep with a babe at her breast.    Bael had brought her back?    No. They had been in Winterfell all the time, hiding with the dead beneath the castle. The maid loved Bael so dearly she bore him a son, the song says… though if truth be told, all the maids love Bael in them songs he wrote. Be that as it may, what’s certain is that Bael left the child in payment for the rose he’d plucked unasked, and that the boy grew to be the next Lord Stark. So there it is—you have Bael’s blood in you, same as me.    It never happened,  Jon said.  She shrugged.  Might be it did, might be it didn’t. It is a good song, though. My mother used to sing it to me. She was a woman too, Jon Snow. Like yours.  She rubbed her throat where his dirk had cut her.  The song ends when they find the babe, but there is a darker end to the story. Thirty years later, when Bael was King-beyond-the-Wall and led the free folk south, it was young Lord Stark who met him at the Frozen Ford… and killed him, for Bael would not harm his own son when they met sword to sword.    So the son slew the father instead,  said Jon.   Aye,  she said,  but the gods hate kinslayers, even when they kill unknowing. When Lord Stark returned from the battle and his mother saw Bael’s head upon his spear, she threw herself from a tower in her grief."
}