{
  "id": "06523fa5ad6241ef81a96f9844385500b594e8d0",
  "text": "  Then  as  is  the  nature  of  folk  that  are  thoroughly  perplexed,  they began  to grumble at  the hobbit, blaming him  for what had at  first  so pleased them: for bringing away a cup and stirring up Smaug's wrath so soon.  \"What else do you suppose a burglar is to do?\" asked Bilbo angrily. \"I was not  engaged  to  kill  dragons,  that  is  warrior's  work,  but  to  steal  treasure.  I  made  the  best  beginning  I  could.  Did  you  expect  me  to  trot  back  with  the  whole  hoard  of  Thror  on  my  back?  If  there  is  any  grumbling  to  be  done,  I  think  I  might  have  a  say. You ought to have brought five hundred burglars not one. I am sure it reflects  great  credit  on  your  grandfather,  but  you  cannot  pretend  that  you  ever  made  the   ####-vast  extent  of  his  wealth  clear  to me.  I  should want  hundreds  of  years  to  bring  it  all up, if I was fifty times as big, and Smaug as tame as a rabbit.\"  After that of course the dwarves begged his pardon.  \"What  then  do  you  propose  we  should  do,  Mr.  Baggins?\"  asked  Thorin  politely.   \"I  have  no  idea  at  the  moment  –  if  you  mean  about  removing  the  treasure.  That  obviously  depends  entirely  on  some  new  turn  of  luck  and  the  getting  rid  of  Smaug.  Getting  rid  of  dragons  is  not  at  all  in  my  line,  but  I  will  do  my  best  to  think  about it. Personally I have no hopes at all, and wish I was safe back at home.\"  \"Never mind that for the moment! What are we to do now,  to-day?\"  \"Well,  if  you  really want my  advice,  I  should  say we  can  do  nothing  but  stay  where  we  are.  By  day  we  can  no  doubt  creep  out  safely  enough  to  take  the  air.  Perhaps before long one or two could be chosen to go back to the store by the river  and replenish our supplies. But in the meanwhile everyone ought to be well inside  the tunnel by night.  \"Now  I  will  make  you  an  offer.  I  have  got my  ring  and will  creep  down  this  very  noon-then  if  ever  Smaug  ought  to  be  napping-and  see  what  he  is  up  to.  Perhaps something will turn up. 'Every worm has his weak spot,' as my father used  to say, though I am sure it was not from personal experience.\"  Naturally  the  dwarves  accepted  the  offer  eagerly.  Already  they  had  come  to  respect little Bilbo. Now he had become the real leader in their adventure. He had  begun  to  have  ideas  and  plans  of  his  own. When  midday  came  he  got  ready  for  another  journey  down  into  the Mountain. He  did  not  like  it  of  course,  but  it was  not  so  bad  now  he  knew, more  or  less, what was  in  front  of  him. Had  he  known  more about dragons and  their wily ways, he might have  teen more  frightened and  less hopeful of catching this one napping.  The sun was shining when he started, but it was as dark as night in the tunnel.  The light from the door, almost closed, soon faded as he went down. So silent was  his going  that smoke on a gentle wind could hardly have surpasses  it, and he was  inclined  to  feel  a  bit  proud  of  himself  as  he  drew  near  the  lower  door. There was  only the very fainter glow to be seen.  \"Old Smaug  is weary and asleep,\" he  thought.  \"He can't,  see me and he won't  hear  me.  Cheer  up  Bilbo!\"  He  had  forgotten  or  had  never  heard  about  dragons'  sense of smell.  It is also an awkward fact that they keep half an eye open watching while they  sleep,  if  they are  suspicious. Smaug certainly  looked  fast asleep, almost dead and   ####-dark, with scarcely a snore more than a whiff of unseen steam, when Bilbo peeped  once more from the entrance. He was just about to step out on to the floor when he  caught  a  sudden  thin  and  piercing  ray  of  red  from  under  the  drooping  lid.  of  Smaug's  left  eye.  He  was  only  pretending  to  sleep!  He  was  watching  the  tunnel  entrance!  Hurriedly  Bilbo  stepped  back  and  blessed  the  luck  of  his  ring.  Then  Smaug spoke.    \"Well,  thief!  I  smell  you  and  I  feel  your  air.  I  hear  your  breath. Come  along!  Help yourself again, there is plenty and to spare!\"  But Bilbo was  not  quite  so  unlearned  in  dragon-lore as all  that, and  if Smaug  hoped to get him to come nearer so easily he was disappointed.  \"No  thank  you,  O  Smaug  the.  Tremendous!\"  he  replied.  \"I  did  not  come  for  presents. I only wished  to have a  look at you and see  if you were  truly as great as  tales say. I did not believe them.\"  \"Do  you  now?\"  said  the  dragon  somewhat  flattered,  even  though  he  did  not  believe a word of it.                   j  \"Truly  songs  and  tales  fall  utterly  short  of  the  reality,  O  Smaug  the  Chiefest  and Greatest of Calamities,\" replied Bilbo.                                               I  You  have  nice  manners  for  a  thief  and  a  liar,\"  said  the  dragon.  \"You  seem  familiar with my  name,  but  I  don't  seem  to  remember  smelling  you  before."
}