{
  "id": "0735010b93dd0a74aa0fce1fdf783a935872d812",
  "text": " Old Nan told me. The holdfast has a golden crown, see?  He pointed across the lake. You could see patches of flaking gold paint up around the crenellations.  Queen Alysanne slept there, so they painted the merlons gold in her honor.    A causeway?  Joien studied the lake.  You are certain?    Certain,  said Bran.  Meera found the foot of it easily enough, once she knew to look; a stone pathway three feet wide, leading right out into the lake. She took them out step by careful step, probing ahead with her frog spear. They could see where the path emerged again, climbing from the water onto the island and turning into a short flight of stone steps that led to the holdfast door.  Path, steps, and door were in a straight line, which made you think the causeway ran straight, but that wasn’t so. Under the lake it zigged and zagged, going a third of a way around the island before jagging back. The turns were treacherous, and the long path meant that anyone approaching would be exposed to arrow fire from the tower for a long time. The hidden stones were slimy and slippery too; twice Hodor almost lost his footing and shouted  HODOR!  in alarm before regaining his balance. The second time scared Bran badly. If Hodor fell into the lake with him in his basket, he could well drown, especially if the huge stableboy panicked and forgot that Bran was there, the way he did sometimes. Maybe we should have stayed at the inn, under the apple tree, he thought, but by then it was too late.  Thankfully there was no third time, and the water never got up past Hodor’s waist, though the Reeds were in it up to their chests. And before long they were on the island, climbing the steps to the holdfast. The door was still stout, though its heavy oak planks had warped over the years and it could no longer be closed completely. Meera shoved it open all the way, the rusted iron hinges screaming. The lintel was low.  Duck down, Hodor,  Bran said, and he did, but not enough to keep Bran from hitting his head.  That hurt,  he complained.   Hodor,  said Hodor, straightening.  They found themselves in a gloomy strongroom, barely large enough to hold the four of them. Steps built into the inner wall of the tower curved away upward to their left, downward to their right, behind iron grates. Bran looked up and saw another grate just above his head. A murder hole. He was glad there was no one up there now to pour boiling oil down on them.  The grates were locked, but the iron bars were red with rust. Hodor grabbed hold of the lefthand door and gave it a pull, grunting with effort. Nothing happened. He tried pushing with no more success. He shook the bars, kicked, shoved against them and rattled them and punched the hinges with a huge hand until the air was filled with flakes of rust, but the iron door would not budge. The one down to the undervault was no more accommodating.  No way in,  said Meera, shrugging.  The murder hole was just above Bran’s head, as he sat in his basket on Hodor’s back. He reached up and grabbed the bars to give them a try. When he pulled down the grating came out of the ceiling in a cascade of rust and crumbling stone.  HODOR!  Hodor shouted. The heavy iron grate gave Bran another bang in the head, and crashed down near Jojen’s feet when he shoved it off of him. Meera laughed.  Look at that, my prince,  she said,  you’re stronger than Hodor.  Bran blushed.  With the grate gone, Hodor was able to boost Meera and Jojen up through the gaping murder hole. The crannogmen took Bran by the arms and drew him up after them. Getting Hodor inside was the hard part. He was too heavy for the Reeds to lift the way they’d lifted Bran. Finally Bran told him to go look for some big rocks. The island had no lack of those, and Hodor was able to pile them high enough to grab the crumbling edges of the hole and climb through.  Hodor,  he panted happily, grinning at all of them.  They found themselves in a maze of small cells, dark and empty, but Meera explored until she found the way back to the steps. The higher they climbed, the better the light; on the third story the thick outer wall was pierced by arrow slits, the fourth had actual windows, and the fifth and highest was one big round chamber with arched doors on three sides opening onto small stone balconies. On the fourth side was a privy chamber perched above a sewer chute that dropped straight down into the lake.  By the time they reached the roof the sky was completely overcast, and the clouds to the west were black. The wind was blowing so strong it lifted up Bran’s cloak and made it flap and snap.  Hodor,  Hodor said at the noise.  Meera spun in a circle.  I feel almost a giant, standing high above the world.    There are trees in the Neck that stand twice as tall as this,  her brother reminded her.   Aye, but they have other trees around them just as high,  said Meera.  The world presses close in the Neck, and the sky is so much smaller. Here… feel that wind, Brother? And look how large the world has grown."
}