{
  "id": "08ddfde705fceaf096b389f51493c3b6cc2cf54f",
  "text": "...  \"Herrnione, think of something happy!\" Harry yelled, raising his wand, blinking furiously to try and clear his vision, shaking his head to rid it of the faint screaming that had started inside it --  I'm going to live with my godfather. I'm leaving the Dursleys.  He forced himself to think of Black, and only Black, and began to chant: \"Expecto patronum! Expecto patronum!\"  Black gave a shudder, rolled over, and lay motionless on the ground, pale as death.  He'll be all right. I'm going to go and live with him.  \"Expecto patronum! Hermione, help me! Expecto patronum!\"  \"Expecto --\" Hermione whispered, \"expecto -- expecto --\"  But she couldn't do it. The dementors were closing in, barely ten feet from them. They formed a solid wall around Harry and Hermione, and were getting closer....  \"EXPECTO PATRONUM!\" Harry yelled, trying to blot the screaming from his ears. \"EXPECTO PATRONUM!\"  A thin wisp of silver escaped his wand and hovered like mist before him. At the same moment, Harry felt Hermione collapse next to him. He was alone... completely alone....  \"Expecto -- expecto patronum --\"  Harry felt his knees hit the cold grass. Fog was clouding his eyes. With a huge effort, he fought to remember -- Sirius was innocent -- innocent -- We'll be okay -- I' mgoing to live with him --  \"Ex ecto patronum!\" he gasped.  By the feeble light of his formless Patronus, He saw a dementor halt, very close to him. It couldn't walk through the cloud of silver mist Harry had conjured. A dead, slimy hand slid out from under the cloak. It made a gesture as though to sweep the Patronus aside.  \"No -- no --\" Harry gasped. \"He's innocent... expecto expecto patronum --\"  He could feet them watching him, hear their rattling breath like an evil wind around him. The nearest dementor seemed to be considering him. Then it raised both its rotting hands -- and lowered its hood.  Where there should have been eyes, there was only thin, gray scabbed skin, stretched blankly over empty sockets. But there was a mouth... a gaping, shapeless hole, sucking the air with the sound of a death rattle.  A paralyzing terror filled Harry so that he couldn't move or speak. His Patronus flickered and died.  White fog was blinding him. He had to fight... expecto patronum ... he couldn't see... and in the distance, he heard the familiar screaming... expecto patronum... he groped in the mist for Sirius, and found his arm... they weren't going to take him....  But a pair of strong, clammy hands suddenly attached themselves around Harry's neck. They were forcing his face upward.... He could feel its breath.... It was going to get rid of him first.... He could feel its putrid breath.... His mother was screaming in his ears.... She was going to be the last thing he ever heard --  And then, through the fog that was drowning him, he thought he saw a silvery light growing brighter and brighter... He felt himself fall forward onto the grass.... Facedown, too weak to move, sick and shaking, Harry opened his eyes. The dementor must have released him. The blinding light was illuminating the grass around him.... The screaming had stopped, the cold was ebbing away...  Something was driving the dementors back.... It was circling around him and Black and Hermione.... They were leaving....  The air was warm again....  With every ounce of strength he could muster, Harry raised his head a few inches and saw an animal amid the light, galloping away across the lake.... Eyes blurred with sweat, Harry tried to make out what it was.... It was as bright as a unicorn.... Fighting to stay conscious, Harry watched it canter to a halt as it reached the opposite shore. For a moment, Harry saw, by its brightness, somebody welcoming it back... raising his hand to pat it... someone who looked strangely familiar ... but it couldn't be...  Harry didn't understand. He couldn't think anymore. He felt the last of his strength leave him, and his head hit the ground as he fainted.  CHAPTER TWENTY-ONE  HERMIONE'S SECRET  Shocking business... shocking... miracle none of them died... never heard the like... by thunder, it was lucky you were there, Snape....\"  \"Thank you, Minister.\"  \"Order of Merlin, Second Class, I'd say. First Class, if I can wangle it!\"  \"Thank you very much indeed, Minister.\"  \"Nasty cut you've got there.... Black's work, I suppose?\"  \"As a matter of fact, it was Potter, Weasley, and Granger, Minister....\"  \"No!\"  \"Black had bewitched them, I saw it immediately. A Confundus Charm, to judge by their behavior. They seemed to think there was a possibility he was innocent. They weren't responsible for their actions. On the other hand, their interference might have permitted Black to escape.... They obviously thought they were going to catch Black single-handed. They've got away with a great deal before now... I'm afraid it's given them a rather high opinion of themselves... and of course Potter has always been allowed an extraordinary amount of license by the headmaster --\"  \"Ah, well, Snape."
}