{
  "id": "0a8d0335afecba0c9906aa5dc6faf492dae4bf01",
  "text": "  That’s the one I want.    Drink it,  Brienne said, unsmiling, and he did.  It was half an hour before he felt strong enough to stand. After the dim wet warmth of the bathhouse, the air outside was a slap across the face.  M’lord will be looking for him by now,  a guard told Qyburn.  Her too. Do I need to carry him?    I can still walk. Brienne, give me your arm.   Clutching her, Jaime let them herd him across the yard to a vast draughty hall, larger even than the throne room in King’s Landing. Huge hearths lined the walls, one every ten feet or so, more than he could count, but no fires had been lit, so the chill between the walls went bone-deep. A dozen spearmen in fur cloaks guarded the doors and the steps that led up to the two galleries above. And in the center of that immense emptiness, at a trestle table surrounded by what seemed like acres of smooth slate floor, the Lord of the Dreadfort waited, attended only by a cupbearer.   My lord,  said Brienne, when they stood before him.  Roose Bolton’s eyes were paler than stone, darker than milk, and his voice was spider soft.  I am pleased that you are strong enough to attend me, ser. My lady, do be seated.  He gestured at the spread of cheese, bread, cold meat, and fruit that covered the table.  Will you drink red or white? Of indifferent vintage, I fear. Ser Amory drained Lady Whent’s cellars nearly dry.    I trust you killed him for it.  Jaime slid into the offered seat quickly, so Bolton could not see how weak he was.  White is for Starks. I’ll drink red like a good Lannister.    I would prefer water,  said Brienne.   Elmar, the red for Ser Jaime, water for the Lady Brienne, and hippocras for myself.  Bolton waved a hand at their escort, dismissing them, and the men beat a silent retreat.  Habit made Jaime reach for his wine with his right hand. His stump rocked the goblet, spattering his clean linen bandages with bright red spots and forcing him to catch the cup with his left hand before it fell, but Bolton pretended not to notice his clumsiness. The northman helped himself to a prune and ate it with small sharp bites.  Do try these, Ser Jaime. They are most sweet, and help move the bowels as well. Lord Vargo took them from an inn before he burnt it.    My bowels move fine, that goat’s no lord, and your prunes don’t interest me half so much as your intentions.    Regarding you?  A faint smile touched Roose Bolton’s lips.  You are a perilous prize, ser. You sow dissension wherever you go. Even here, in my happy house of Harrenhal.  His voice was a whisker above a whisper.  And in Riverrun as well, it seems. Do you know, Edmure Tully has offered a thousand golden dragons for your recapture?   Is that all?  My sister will pay ten times as much.    Will she?  That smile again, there for an instant, gone as quick.  Ten thousand dragons is a formidable sum. Of course, there is Lord Karstark’s offer to consider as well. He promises the hand of his daughter to the man who brings him your head.    Leave it to your goat to get it backward,  said Jaime.  Bolton gave a soft chuckle.  Harrion Karstark was captive here when we took the castle, did you know? I gave him all the Karhold men still with me and sent him off with Glover. I do hope nothing ill befell him at Duskendale… else Alys Karstark would be all that remains of Lord Rickard’s progeny.  He chose another prune.  Fortunately for you, I have no need of a wife. I wed the Lady Walda Frey whilst I was at the Twins.    Fair Walda?  Awkwardly, Jaime tried to hold the bread with his stump while tearing it with his left hand.   Fat Walda. My lord of Frey offered me my bride’s weight in silver for a dowry, so I chose accordingly. Elmar, break off some bread for Ser Jaime.   The boy tore a fist-sized chunk off one end of the loaf and handed it to Jaime. Brienne tore her own bread.  Lord Bolton,  she asked,  it’s said you mean to give Harrenhal to Vargo Hoat.    That was his price,  Lord Bolton said.  The Lannisters are not the only men who pay their debts. I must take my leave soon in any case. Edmure Tully is to wed the Lady Roslin Frey at the Twins, and my king commands my attendance.    Edmure weds?  said Jaime.  Not Robb Stark?    His Grace King Robb is wed.  Bolton spit a prune pit into his hand and put it aside.  To a Westerling of the Crag. I am told her name is Jeyne. No doubt you know her, ser. Her father is your father’s bannerman.    My father has a good many bannermen, and most of them have daughters.  Jaime groped one-handed for his goblet, trying to recall this Jeyne. The Westerlings were an old house, with more pride than power.   This cannot be true,  Brienne said stubbornly.  King Robb was sworn to wed a Frey. He would never break faith, he—    His Grace is a boy of sixteen,  said Roose Bolton mildly.  And I would thank you not to question my word, my lady.   Jaime felt almost sorry for Robb Stark. He won the war on the battlefield and lost it in a bedchamber, poor fool.  How does Lord Walder relish dining on trout in place of wolf?  he asked."
}