{
  "id": "0d799cbcd29916415742eaa832bd877f3ffbd43f",
  "text": "   The king’s tourney,  Ned corrected, wincing.  I assure you, the Hand wants no part of it.    Call it what you will, my lord. Knights have been arriving from all over the realm, and for every knight we get two freeriders, three craftsmen, six men-at-arms, a dozen merchants, two dozen whores, and more thieves than I dare guess. This cursed heat had half the city in a fever to start, and now with all these visitors… last night we had a drowning, a tavern riot, three knife fights, a rape, two fires, robberies beyond count, and a drunken horse race down the Street of the Sisters. The night before a woman’s head was found in the Great Sept, floating in the rainbow pool. No one seems to know how it got there or who it belongs to.    How dreadful,  Varys said with a shudder.  Lord Renly Baratheon was less sympathetic.  If you cannot keep the king’s peace, Janos, perhaps the City Watch should be commanded by someone who can.   Stout, jowly Janos Slynt puffed himself up like an angry frog, his bald pate reddening.  Aegon the Dragon himself could not keep the peace, Lord Renly. I need more men.    How many?  Ned asked, leaning forward. As ever, Robert had not troubled himself to attend the council session, so it fell to his Hand to speak for him.   As many as can be gotten, Lord Hand.    Hire fifty new men,  Ned told him.  Lord Baelish will see that you get the coin.    I will?  Littlefinger said.   You will. You found forty thousand golden dragons for a champion’s purse, surely you can scrape together a few coppers to keep the king’s peace.  Ned turned back to Janos Slynt.  I will also give you twenty good swords from my own household guard, to serve with the Watch until the crowds have left.    All thanks, Lord Hand,  Slynt said, bowing.  I promise you, they shall be put to good use.   When the Commander had taken his leave, Eddard Stark turned to the rest of the council.  The sooner this folly is done with, the better I shall like it.  As if the expense and trouble were not irksome enough, all and sundry insisted on salting Ned’s wound by calling it  the Hand’s tourney,  as if he were the cause of it. And Robert honestly seemed to think he should feel honored!   The realm prospers from such events, my lord,  Grand Maester Pycelle said.  They bring the great the chance of glory, and the lowly a respite from their woes.    And put coins in many a pocket,  Littlefinger added.  Every inn in the city is full, and the whores are walking bowlegged and jingling with each step.   Lord Renly laughed.  We’re fortunate my brother Stannis is not with us. Remember the time he proposed to outlaw brothels? The king asked him if perhaps he’d like to outlaw eating, shitting, and breathing while he was at it. If truth be told, I ofttimes wonder how Stannis ever got that ugly daughter of his. He goes to his marriage bed like a man marching to a battlefield, with a grim look in his eyes and a determination to do his duty.   Ned had not joined the laughter.  I wonder about your brother Stannis as well. I wonder when he intends to end his visit to Dragonstone and resume his seat on this council.    No doubt as soon as we’ve scourged all those whores into the sea,  Littlefinger replied, provoking more laughter.   I have heard quite enough about whores for one day,  Ned said, rising.  Until the morrow.   Harwin had the door when Ned returned to the Tower of the Hand.  Summon Jory to my chambers and tell your father to saddle my horse,  Ned told him, too brusquely.   As you say, my lord.   The Red Keep and the  Hand’s tourney  were chafing him raw, Ned reflected as he climbed. He yearned for the comfort of Catelyn’s arms, for the sounds of Robb and Jon crossing swords in the practice yard, for the cool days and cold nights of the north.  In his chambers he stripped off his council silks and sat for a moment with the book while he waited for Jory to arrive. The Lineages and Histories of the Great Houses of the Seven Kingdoms, With Descliptions of Many High Lords and Noble Ladies and Their Children, by Grand Maester Malleon. Pycelle had spoken truly; it made for ponderous reading. Yet Jon Arryn had asked for it, and Ned felt certain he had reasons. There was something here, some truth buried in these brittle yellow pages, if only he could see it. But what? The tome was over a century old. Scarcely a man now alive had yet been born when Malleon had compiled his dusty lists of weddings, births, and deaths.  He opened to the section on House Lannister once more, and turned the pages slowly, hoping against hope that something would leap out at him. The Lannisters were an old family, tracing their descent back to Lann the Clever, a trickster from the Age of Heroes who was no doubt as legendary as Bran the Builder, though far more beloved of singers and taletellers. In the songs, Lann was the fellow who winkled the Casterlys out of Casterly Rock with no weapon but his wits, and stole gold from the sun to brighten his curly hair. Ned wished he were here now, to winkle the truth out of this damnable book."
}