{
  "id": "0e1d9fa14b013d5e4a4b44ac077cbf0f86d0c5eb",
  "text": " Bronn opened the door for him. Lord Tywin Lannister was seated beneath the window, writing by the glow of an oil lamp. He raised his eyes at the sound of the latch.  Tyrion.  Calmly, he laid his quill aside.   I’m pleased you remember me, my lord.  Tyrion released his grip on Pod, leaned his weight on the stick, and waddled closer. Something is wrong, he knew at once.   Ser Bronn,  Lord Tywin said,  Podrick. Perhaps you had best wait without until we are done.   The look Bronn gave the Hand was little less than insolent; nonetheless, he bowed and withdrew, with Pod on his heels. The heavy door swung shut behind them, and Tyrion Lannister was alone with his father. Even with the windows of the solar shuttered against the night, the chill in the room was palpable. What sort of lies has Cersei been telling him?  The Lord of Casterly Rock was as lean as a man twenty years younger, even handsome in his austere way. Stiff blond whiskers covered his cheeks, framing a stern face, a bald head, a hard mouth. About his throat he wore a chain of golden hands, the fingers of each clasping the wrist of the next.  That’s a handsome chain,  Tyrion said. Though it looked better on me.  Lord Tywin ignored the sally.  You had best be seated. Is it wise for you to be out of your sickbed?    I am sick of my sickbed.  Tyrion knew how much his father despised weakness. He claimed the nearest chair.  Such pleasant chambers you have. Would you believe it, while I was dying, someone moved me to a dark little cell in Maegor’s?    The Red Keep is overcrowded with wedding guests. Once they depart, we will find you more suitable accommodations.    I rather liked these accommodations. Have you set a date for this great wedding?    Joffrey and Margaery shall marry on the first day of the new year, which as it happens is also the first day of the new century. The ceremony will herald the dawn of a new era.   A new Lannister era, thought Tyrion.  Oh, bother, I fear I’ve made other plans for that day.    Did you come here just to complain of your bedchamber and make your lame japes? I have important letters to finish.    Important letters. To be sure.    Some battles are won with swords and spears, others with quills and ravens. Spare me these coy reproaches, Tyrion. I visited your sickbed as often as Maester Ballabar would allow it, when you seemed like to die.  He steepled his fingers under his chin.  Why did you dismiss Ballabar?   Tyrion shrugged.  Maester Frenken is not so determined to keep me insensate.    Ballabar came to the city in Lord Redwyne’s retinue. A gifted healer, it’s said. It was kind of Cersei to ask him to look after you. She feared for your life.   Feared that I might keep it, you mean.  Doubtless that’s why she’s never once left my bedside.    Don’t be impertinent. Cersei has a royal wedding to plan, I am waging a war, and you have been out of danger for at least a fortnight.  Lord Tywin studied his son’s disfigured face, his pale green eyes unflinching.  Though the wound is ghastly enough, I’ll grant you. What madness possessed you?    The foe was at the gates with a battering ram. If Jaime had led the sortie, you’d call it valor.    Jaime would never be so foolish as to remove his helm in battle. I trust you killed the man who cut you?    Oh, the wretch is dead enough.  Though it had been Podrick Payne who’d killed Ser Mandon, shoving him into the river to drown beneath the weight of his armor.  A dead enemy is a joy forever,  Tyrion said blithely, though Ser Mandon was not his true enemy. The man had no reason to want him dead. He was only a catspaw, and I believe I know the cat. She told him to make certain I did not survive the battle. But without proof Lord Tywin would never listen to such a charge.  Why are you here in the city, Father?  he asked.  Shouldn’t you be off fighting Lord Stannis or Robb Stark or someone?  And the sooner the better.   Until Lord Redwyne brings his fleet up, we lack the ships to assail Dragonstone. It makes no matter. Stannis Baratheon’s sun set on the Blackwater. As for Stark, the boy is still in the west, but a large force of northmen under Helman Tallhart and Robett Glover are descending toward Duskendale. I’ve sent Lord Tarly to meet them, while Ser Gregor drives up the kingsroad to cut off their retreat. Tallhart and Glover will be caught between them, with a third of Stark’s strength.    Duskendale?  There was nothing at Duskendale worth such a risk. Had the Young Wolf finally blundered?   It’s nothing you need trouble yourself with. Your face is pale as death, and there’s blood seeping through your dressings. Say what you want and take yourself back to bed.    What I want…  His throat felt raw and tight. What did he want? More than you can ever give me, Father.  Pod tells me that Littlefinger’s been made Lord of Harrenhal.    An empty title, so long as Roose Bolton holds the castle for Robb Stark, yet Lord Baelish was desirous of the honor. He did us good service in the matter of the Tyrell marriage."
}