{
  "id": "1164905c25f7f4c89f79253855e48302a210d362",
  "text": " Scorched fields and poisoned wells had greeted her at every hand. Worst of all, they had nailed a slave child up on every milepost along the coast road from Yunkai, nailed them up still living with their entrails hanging out and one arm always outstretched to point the way to Meereen. Leading her van, Daario had given orders for the children to be taken down before Dany had to see them, but she had countermanded him as soon as she was told.  I will see them,  she said.  I will see every one, and count them, and look upon their faces. And I will remember.   By the time they came to Meereen sitting on the salt coast beside her river, the count stood at one hundred and sixty-three. I will have this city, Dany pledged to herself once more.  The pink-and-white hero taunted the besiegers for an hour, mocking their manhood, mothers, wives, and gods. Meereen’s defenders cheered him on from the city walls.  His name is Oznak zo Pahl,  Brown Ben Plumm told her when he arrived for the war council. He was the new commander of the Second Sons, chosen by a vote of his fellow sellswords.  I was bodyguard to his uncle once, before I joined the Second Sons. The Great Masters, what a ripe lot o’ maggots. The women weren’t so bad, though it was worth your life to look at the wrong one the wrong way. I knew a man, Scarb, this Oznak cut his liver out. Claimed to be defending a lady’s honor, he did, said Scarb had raped her with his eyes. How do you rape a wench with eyes, I ask you? But his uncle is the richest man in Meereen and his father commands the city guard, so I had to run like a rat before he killed me too.   They watched Oznak zo Pahl dismount his white charger, undo his robes, pull out his manhood, and direct a stream of urine in the general direction of the olive grove where Dany’s gold pavilion stood among the burnt trees. He was still pissing when Daario Naharis rode up, arakh in hand.  Shall I cut that off for you and stuff it down his mouth, Your Grace?  His tooth shone gold amidst the blue of his forked beard.   It’s his city I want, not his meager manhood.  She was growing angry, however. If I ignore this any longer, my own people will think me weak. Yet who could she send? She needed Daario as much as she did her bloodriders. Without the flamboyant Tyroshi, she had no hold on the Stormcrows, many of whom had been followers of Prendahl na Ghezn and Sallor the Bald.  High on the walls of Meereen, the jeers had grown louder, and now hundreds of the defenders were taking their lead from the hero and pissing down through the ramparts to show their contempt for the besiegers. They are pissing on slaves, to show how little they fear us, she thought. They would never dare such a thing if it were a Dothraki khalasar outside their gates.   This challenge must be met,  Arstan said again.   It will be.  Dany said, as the hero tucked his penis away again.  Tell Strong Belwas I have need of him.   They found the huge brown eunuch sitting in the shade of her pavilion, eating a sausage. He finished it in three bites, wiped his greasy hands clean on his trousers, and sent Arstan Whitebeard to fetch him his steel. The aged squire honed Belwas’s arakh every evening and rubbed it down with bright red oil.  When Whitebeard brought the sword, Strong Belwas squinted down the edge, grunted, slid the blade back into its leather sheath, and tied the swordbelt about his vast waist. Arstan had brought his shield as well: a round steel disk no larger than a pie plate, which the eunuch grasped with his off hand rather than strapping to his forearm in the manner of Westeros.  Find liver and onions, Whitebeard,  Belwas said.  Not for now, for after. Killing makes Strong Belwas hungry.  He did not wait for a reply, but lumbered from the olive grove toward Oznak zo Pahl.   Why that one, Khaleesi?  Rakharo demanded of her.  He is fat and stupid.    Strong Belwas was a slave here in the fighting pits. If this highborn Oznak should fall to such the Great Masters will be shamed, while if he wins… well, it is a poor victory for one so noble, one that Meereen can take no pride in.  And unlike Ser Jorah, Daario, Brown Ben, and her three bloodriders, the eunuch did not lead troops, plan battles, or give her counsel. He does nothing but eat and boast and bellow at Arstan. Belwas was the man she could most easily spare. And it was time she learned what sort of protector Magister Illyrio had sent her.  A thrum of excitement went through the siege lines when Belwas was seen plodding toward the city, and from the walls and towers of Meereen came shouts and jeers. Oznak zo Pahl mounted up again, and waited, his striped lance held upright. The charger tossed his head impatiently and pawed the sandy earth. As massive as he was, the eunuch looked small beside the hero on his horse.   A chivalrous man would dismount,  said Arstan.  Oznak zo Pahl lowered his lance and charged.  Belwas stopped with legs spread wide. In one hand was his small round shield, in the other the curved arakh that Arstan tended with such care."
}