{
  "id": "12f62ec1250139098e9d06f1262dbcb60964f4bc",
  "text": " It is enough and more to give an old man such terrors that sometimes he can scarcely find the strength to eat.   Melisandre. Davos shivered.  The red woman did this to him,  he said.  She sent the fire to consume us, to punish Stannis for setting her aside, to teach him that he could not hope to win without her sorceries.   The Lyseni chose a plump olive from the bowl between them.  You are not the first to be saying this, my friend. But if I am you, I am not saying it so loudly. Dragonstone crawls with these queen’s men, oh yes, and they have sharp ears and sharper knives.  He popped the olive into his mouth.   I have a knife myself. Captain Khorane made me a gift of it.  He pulled out the dirk and laid it on the table between them.  A knife to cut out Melisandre’s heart. If she has one.   Salladhor Saan spit out an olive pit.  Davos, good Davos, you must not be saying such things, even in jest.    No jest. I mean to kill her.  If she can be killed by mortal weapons. Davos was not certain that she could. He had seen old Maester Cressen slip poison into her wine, with his own eyes he had seen it, but when they both drank from the poisoned cup it was the maester who died, not the red priestess. A knife in the heart, though… even demons can be killed by cold iron, the singers say.   These are dangerous talkings, my friend,  Salladhor Saan warned him.  I am thinking you are still sick from the sea. The fever has cooked your wits, yes. Best you are taking to your bed for a long resting, until you are stronger.   Until my resolve weakens, you mean. Davos got to his feet. He did feel feverish and a little dizzy, but it did not matter.  You are a treacherous old rogue, Salladhor Saan, but a good friend all the same.   The Lyseni stroked his pointed silver beard.  So with this great friend you will be staying, yes?    No, I will be going.  He coughed.   Go? Look at you! You cough, you tremble, you are thin and weak. Where will you be going?    To the castle. My bed is there, and my son.    And the red woman,  Salladhor Saan said suspiciously.  She is in the castle also.    Her too.  Davos slid the dirk back into its sheath.   You are an onion smuggler, what do you know of skulkings and stabbings? And you are ill, you cannot even hold the dirk. Do you know what will be happening to you, if you are caught? While we were burning on the river, the queen was burning traitors. Servants of the dark, she named them, poor men, and the red woman sang as the fires were lit.   Davos was unsurprised. I knew, he thought, I knew before he told me.  She took Lord Sunglass from the dungeons,  he guessed,  and Hubard Rambton’s sons.    Just so, and burned them, as she will burn you. If you kill the red woman, they will burn you for revenge, and if you fail to kill her, they will burn you for the trying. She will sing and you will scream, and then you will die. And you have only just come back to life!    And this is why,  said Davos.  To do this thing. To make an end of Melisandre of Asshai and all her works. Why else would the sea have spit me out? You know Blackwater Bay as well as I do, Salla. No sensible captain would ever take his ship through the spears of the merling king and risk ripping out his bottom. Shayala’s Dance should never have come near me.    A wind,  insisted Salladhor Saan loudly,  an ill wind, is all. A wind drove her too far to the south.    And who sent the wind? Salla, the Mother spoke to me.   The old Lyseni blinked at him.  Your mother is dead…    The Mother. She blessed me with seven sons, and yet I let them burn her. She spoke to me. We called the fire, she said. We called the shadows too. I rowed Melisandre into the bowels of Storm’s End and watched her birth a horror.  He saw it still in his nightmares, the gaunt black hands pushing against her thighs as it wriggled free of her swollen womb.  She killed Cressen and Lord Renly and a brave man named Cortnay Penrose, and she killed my sons as well. Now it is time someone killed her.    Someone,  said Salladhor Saan.  Yes, just so, someone. But not you. You are weak as a child, and no warrior. Stay, I beg you, we will talk more and you will eat, and perhaps we will sail to Braavos and hire a Faceless Man to do this thing, yes? But you, no, you must sit and eat.   He is making this much harder, thought Davos wearily, and it was perishingly hard to begin with.  I have vengeance in my belly, Salla. It leaves no room for food. Let me go now. For our friendship, wish me luck and let me go.   Salladhor Saan pushed himself to his feet.  You are no true friend, I am thinking. When you are dead, who will be bringing your ashes and bones back to your lady wife and telling her that she has lost a husband and four sons? Only sad old Salladhor Saan. But so be it, brave ser knight, go rushing to your grave. I will gather your bones in a sack and give them to the sons you leave behind, to wear in little bags around their necks.  He waved an angry hand, with rings on every finger."
}