{
  "id": "13c7e7cdfdcd53bb831bc4bd92e6fd75c70f8122",
  "text": " Then Professor McGonagall's voice called, \"Champions over here, please!\" Parvati readjusted her bangles, beaming; she and Harry said, \"See you in a minute\" to Ron and Padma and walked forward, the chattering crowd parting to let them through. Professor McGonagall, who was wearing dress robes of red tartan and had arranged a rather ugly wreath of thistles around the brim other hat, told them to wait on one side of the doors while everyone else went inside; they were to enter the Great Hall in procession when the rest of the students had sat down. Fleur Delacour and Roger Davies stationed themselves nearest the doors; Davies looked so stunned by his good fortune in having Fleur for a partner that he could hardly take his eyes off her.  Cedric and Cho were close to Harry too; he looked away from them so he wouldn't have to talk to them.  His eyes fell instead on the girl next to Krum. His jaw dropped. It was Hermione. But she didn't look like Hermione at all.  She had done something with her hair; it was no longer bushy but sleek and shiny, and twisted up into an elegant knot at the back of her head.  She was wearing robes made of a floaty, periwinkle-blue material, and she was holding herself differently, somehow - or maybe it was merely the absence of the twenty or so books she usually had slung over her back.  She was also smiling - rather nervously, it was true - but the reduction in the size of her front teeth was more noticeable than ever; Harry couldn't understand how he hadn't spotted it before. \"Hi, Harry!\" she said. \"Hi, Parvati!\" Parvati was gazing at Hermione in unflattering disbelief.  She wasn't the only one either; when the doors to the Great Hall opened, Krum's fan club from the library stalked past, throwing Hermione looks of deepest loathing.  Pansy Parkinson gaped at her as she walked by with Malfoy, and even he didn't seem to be able to find an insult to throw at her.  Ron, however, walked right past Hermione without looking at her. Once everyone else was settled in the Hall, Professor McGonagall told the champions and their partners to get in line in pairs and to follow her.  They did so, and everyone in the Great Hall applauded as they entered and started walking up toward a large round table at the top of the Hall, where the judges were sitting. The walls of the Hall had all been covered in sparkling silver frost, with hundreds of garlands of mistletoe and ivy crossing the starry black ceiling.  The House tables had vanished; instead, there were about a hundred smaller, lantern-lit ones, each seating about a dozen people. Harry concentrated on not tripping over his feet. Parvati seemed to be enjoying herself; she was beaming around at everybody, steering Harry so forcefully that he felt as though he were a show dog she was putting through its paces.  He caught sight of Ron and Padma as he neared the top table.  Ron was watching Hermione pass with narrowed eyes.  Padma was looking sulky. Dumbledore smiled happily as the champions approached the top table, but Karkaroff wore an expression remarkably like Ron's as he watched Krum and Hermione draw nearer. Ludo Bagman, tonight in robes of bright purple with large yellow stars, was clapping as enthusiastically as any of the students; and Madame Maxime, who had changed her usual uniform of black satin for a flowing gown of lavender silk, was applauding them politely. But Mr. Crouch, Harry suddenly realized, was not there.  The fifth seat at the table was occupied by Percy Weasley. When the champions and their partners reached the table, Percy drew out the empty chair beside him, staring pointedly at Harry.  Harry took the hint and sat down next to Percy, who was wearing brand-new, navy-blue dress robes and an expression of such smugness that Harry thought it ought to be fined. \"I've been promoted,\" Percy said before Harry could even ask, and from his tone, he might have been announcing his election as supreme ruler of the universe.  \"I'm now Mr. Crouch's personal assistant, and I'm here representing him.\" \"Why didn't he come?\" Harry asked. He wasn't looking forward to being lectured on cauldron bottoms all through dinner. \"I'm afraid to say Mr. Crouch isn't well, not well at all. Hasn't been right since the World Cup. Hardly surprising - overwork. He's not as young as he was - though still quite brilliant, of course, the mind remains as great as it ever was.  But the World Cup was a fiasco for the whole Ministry, and then, Mr. Crouch suffered a huge personal shock with the misbehavior of that house-elf of his, Blinky, or whatever she was called.  Naturally, he dismissed her immediately afterward, but - well, as I say, he's getting on, he needs looking after, and I think he's found a definite drop in his home comforts since she left.  And then we had the tournament to arrange, and the aftermath of the Cup to deal with - that revolting Skeeter woman buzzing around - no, poor man, he's having a well earned, quiet Christmas.  I'm just glad he knew he had someone he could rely upon to take his place."
}