{
  "id": "13dc7751cba1a0cf6e84179b5bf73a21305b29c3",
  "text": "\" He took out his wand and gave a great sweeping wave with it; at once, all the candles except those inside the carved pumpkins were extinguished, plunging them into a state of semidarkness.  The Goblet of Fire now shone more brightly than anything in the whole Hall, the sparkling bright, bluey-whiteness of the flames almost painful on the eyes. Everyone watched, waiting. . . . A few people kept checking their watches. . . \"Any second,\" Lee Jordan whispered, two seats away from Harry.  The flames inside the goblet turned suddenly red again.  Sparks began to fly from it. Next moment, a tongue of flame shot into the air, a charred piece of parchment fluttered out of it - the whole room gasped. Dumbledore caught the piece of parchment and held it at arm's length, so that he could read it by the light of the flames, which had turned back to blue-white. \"The champion for Durmstrang,\" he read, in a strong, clear voice, \"will be Viktor Krum.\" \"No surprises there!\"  yelled Ron as a storm of applause and cheering swept the Hall. Harry saw Viktor Krum rise from the Slytherin table and slouch up toward Dumbledore; he turned right, walked along the staff table, and disappeared through the door into the next chamber. \"Bravo, Viktor!\" boomed Karkaroff, so loudly that everyone could hear him, even over all the applause.  \"Knew you had it in you!\" The clapping and chatting died down.  Now everyone's attention was focused again on the goblet, which, seconds later, turned red once more.  A second piece of parchment shot out of it, propelled by the flames. \"The champion for Beauxbatons,\" said Dumbledore, \"is Fleur Delacour!\" \"It's her, Ron!\"  Harry shouted as the girl who so resembled a veela got gracefully to her feet, shook back her sheet of silvery blonde hair, and swept up between the Ravenclaw and Hufflepuff tables. \"Oh look, they're all disappointed,\" Hermione said over the noise, nodding toward the remainder of the Beauxbatons party.  \"Disappointed\" was a bit of an understatement, Harry thought.  Two of the girls who had not been selected had dissolved into tears and were sobbing with their heads on their arms. When Fleur Delacour too had vanished into the side chamber, silence fell again, but this time it was a silence so stiff with excitement you could almost taste it.  The Hogwarts champion next... And the Goblet of Fire turned red once more; sparks showered out of it; the tongue of flame shot high into the air, and from its tip Dumbledore pulled the third piece of parchment. \"The Hogwarts champion,\" he called, \"is Cedric Diggory!\" \"No! \" said Ron loudly, but nobody heard him except Harry; the uproar from the next table was too great.  Every single Hufflepuff had jumped to his or her feet, screaming and stamping, as Cedric made his way past them, grinning broadly, and headed off toward the chamber behind the teachers' table.  Indeed, the applause for Cedric went on so long that it was some time before Dumbledore could make himself heard again. \"Excellent!\" Dumbledore called happily as at last the tumult died down.  \"Well, we now have our three champions.  I am sure I can count upon all of you, including the remaining students from Beauxbatons and Durmstrang, to give your champions every ounce of support you can muster.  By cheering your champion on, you will contribute in a very real --\" But Dumbledore suddenly stopped speaking, and it was apparent to everybody what had distracted him. The fire in the goblet had just turned red again. Sparks were flying out of it. A long flame shot suddenly into the air, and borne upon it was another piece of parchment. Automatically, it seemed, Dumbledore reached out a long hand and seized the  parchment.  He held it out and stared at the name written upon it.  There was a long pause, during which Dumbledore stared at the slip in his hands, and everyone in the room stared at Dumbledore.  And then Dumbledore cleared his throat and read out - \"Harry Potter.\"  CHAPTER SEVENTEEN - THE FOUR CHAMPIONS    Harry sat there, aware that every head in the Great Hall had turned to look at him.  He was stunned.  He felt numb.  He was surely dreaming.  He had not heard correctly.   There was no applause.  A buzzing, as though of angry bees, was starting to fill the Hall; some students were standing up to get a better look at Harry as he sat, frozen, in his seat.   Up at the top table, Professor McGonagall had got to her feet and swept past Ludo Bagman and Professor Karkaroff to whisper urgently to Professor Dumbledore, who bent his ear toward her, frowning slightly.   Harry turned to Ron and Hermione; beyond them, he saw the long Gryffindor table all watching him, openmouthed.   \"I didn't put my name in,\" Harry said blankly. \"You know I didn't.\"   Both of them stared just as blankly back.   At the top table, Professor Dumbledore had straightened up, nodding to Professor McGonagall.   \"Harry Potter!\"  he called again.  \"Harry!  Up here, if you please!\"   \"Go on,\" Hermione whispered, giving Harry a slight push."
}