{
  "id": "1662365d2f499828b1fb0b45df14b0c5eec8fd2e",
  "text": " \"I've met him and I'm calling him by his name. Please cheer up, Hagrid, we saved the Stone, it's gone, he can't use it. Have a Chocolate Frog, I've got loads....\"  Hagrid wiped his nose on the back of his hand and said, \"That reminds me. I've got yeh a present.\"  \"It's not a stoat sandwich, is it?\" said Harry anxiously, and at last Hagrid gave a weak chuckle. \"Nah. Dumbledore gave me the day off yesterday ter fix it. 'Course, he shoulda sacked me instead -- anyway, got yeh this...\"  It seemed to be a handsome, leather-covered book. Harry opened it curiously. It was full of wizard photographs. Smiling and waving at him from every page were his mother and father.  \"Sent owls off ter all yer parents' old school friends, askin' fer photos... knew yeh didn' have any... d'yeh like it?\"  Harry couldn't speak, but Hagrid understood.  Harry made his way down to the end-of-year feast alone that night. He had been held up by Madam Pomfrey's fussing about, insisting on giving him one last checkup, so the Great Hall was already full. It was decked out in the Slytherin colors of green and silver to celebrate Slytherin's winning the house cup for the seventh year in a row. A huge banner showing the Slytherin serpent covered the wall behind the High Table.  When Harry walked in there was a sudden hush, and then everybody started talking loudly at once. He slipped into a seat between Ron and Hermione at the Gryffindor table and tried to ignore the fact that people were standing up to look at him.  Fortunately, Dumbledore arrived moments later. The babble died away.  \"Another year gone!\" Dumbledore said cheerfully. \"And I must trouble you with an old man's wheezing waffle before we sink our teeth into our delicious feast. What a year it has been! Hopefully your heads are all a little fuller than they were... you have the whole summer ahead to get them nice and empty before next year starts....  \"Now, as I understand it, the house cup here needs awarding, and the points stand thus: In fourth place, Gryffindor, with three hundred and twelve points; in third, Hufflepuff, with three hundred and fifty-two; Ravenclaw has four hundred and twenty-six and Slytherin, four hundred and seventy- two.\"  A storm of cheering and stamping broke out from the Slytherin table. Harry could see Draco Malfoy banging his goblet on the table. It was a sickening sight.  \"Yes, Yes, well done, Slytherin,\" said Dumbledore. \"However, recent events must be taken into account.\"  The room went very still. The Slytherins' smiles faded a little.  \"Ahem,\" said Dumbledore. \"I have a few last-minute points to dish out. Let me see. Yes...  \"First -- to Mr. Ronald Weasley...\"  Ron went purple in the face; he looked like a radish with a bad sunburn.  \"...for the best-played game of chess Hogwarts has seen in many years, I award Gryffindor house fifty points.\"  Gryffindor cheers nearly raised the bewitched ceiling; the stars overhead seemed to quiver. Percy could be heard telling the other prefects, \"My brother, you know! My youngest brother! Got past McGonagall's giant chess set!\"  At last there was silence again.  \"Second -- to Miss Hermione Granger... for the use of cool logic in the face of fire, I award Gryffindor house fifty points.\"  Hermione buried her face in her arms; Harry strongly suspected she had burst into tears. Gryffindors up and down the table were beside themselves -- they were a hundred points up. \"Third -- to Mr. Harry Potter...\" said Dumbledore. The room went deadly quiet for pure nerve and outstanding courage, I award Gryffindor house sixty points.\"  The din was deafening. Those who could add up while yelling themselves hoarse knew that Gryffindor now had four hundred and seventy-two points -- exactly the same as Slytherin. They had tied for the house cup -- if only Dumbledore had given Harry just one more point.  Dumbledore raised his hand. The room gradually fell silent.  \"There are all kinds of courage,\" said Dumbledore, smiling. \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends. I therefore award ten points to Mr. Neville Longbottom.\"  Someone standing outside the Great Hall might well have thought some sort of explosion had taken place, so loud was the noise that erupted from the Gryffindor table. Harry, Ron, and Hermione stood up to yell and cheer as Neville, white with shock, disappeared under a pile of people hugging him. He had never won so much as a point for Gryffindor before. Harry, still cheering, nudged Ron in the ribs and pointed at Malfoy, who couldn't have looked more stunned and horrified if he'd just had the Body-Bind Curse put on him.  \"Which means, Dumbledore called over the storm of applause, for even Ravenclaw and Hufflepuff were celebrating the downfall of Slytherin, \"we need a little change of decoration.\"  He clapped his hands. In an instant, the green hangings became scarlet and the silver became gold; the huge Slytherin serpent vanished and a towering Gryffindor lion took its place."
}