{
  "id": "16cc1ed199a4c38af8bb114b12e237b301e21269",
  "text": "  Harry would have screamed, but he couldn't make a sound. Where there should have been a back to Quirrell's head, there was a face, the most terrible face Harry had ever seen. It was chalk white with glaring red eyes and slits for nostrils, like a snake.  \"Harry Potter...\" it whispered.  Harry tried to take a step backward but his legs wouldn't move.  \"See what I have become?\" the face said. \"Mere shadow and vapor ... I have form only when I can share another's body... but there have always been those willing to let me into their hearts and minds.... Unicorn blood has strengthened me, these past weeks... you saw faithful Quirrell drinking it for me in the forest... and once I have the Elixir of Life, I will be able to create a body of my own.... Now... why don't you give me that Stone in your pocket?\"  So he knew. The feeling suddenly surged back into Harry's legs. He stumbled backward.  \"Don't be a fool,\" snarled the face. \"Better save your own life and join me... or you'll meet the same end as your parents.... They died begging me for mercy...\"  \"LIAR!\" Harry shouted suddenly.  Quirrell was walking backward at him, so that Voldemort could still see him. The evil face was now smiling.  \"How touching...\" it hissed. \"I always value bravery... Yes, boy, your parents were brave.... I killed your father first; and he put up a courageous fight... but your mother needn't have died... she was trying to protect you.... Now give me the Stone, unless you want her to have died in vain.\"  \"NEVER!\"  Harry sprang toward the flame door, but Voldemort screamed \"SEIZE HIM!\" and the next second, Harry felt Quirrell's hand close on his wrist. At once, a needle-sharp pain seared across Harry's scar; his head felt as though it was about to split in two; he yelled, struggling with all his might, and to his surprise, Quirrell let go of him. The pain in his head lessened -- he looked around wildly to see where Quirrell had gone, and saw him hunched in pain, looking at his fingers -- they were blistering before his eyes.  \"Seize him! SEIZE HIM!\" shrieked Voldemort again, and Quirrell lunged, knocking Harry clean off his feet' landing on top of him, both hands around Harry's neck -- Harry's scar was almost blinding him with pain, yet he could see Quirrell howling in agony.  \"Master, I cannot hold him -- my hands -- my hands!\"  And Quirrell, though pinning Harry to the ground with his knees, let go of his neck and stared, bewildered, at his own palms -- Harry could see they looked burned, raw, red, and shiny.  \"Then kill him, fool, and be done!\" screeched Voldemort.  Quirrell raised his hand to perform a deadly curse, but Harry, by instinct, reached up and grabbed Quirrell's face --  \"AAAARGH!\"  Quirrell rolled off him, his face blistering, too, and then Harry knew: Quirrell couldn't touch his bare skin, not without suffering terrible pain -- his only chance was to keep hold of Quirrell, keep him in enough pain to stop him from doing a curse.  Harry jumped to his feet, caught Quirrell by the arm, and hung on as tight as he could. Quirrell screamed and tried to throw Harry off -- the pain in Harry's head was building -- he couldn't see -- he could only hear Quirrell's terrible shrieks and Voldemort's yells of, \"KILL HIM! KILL HIM!\" and other voices, maybe in Harry's own head, crying, \"Harry! Harry!\"  He felt Quirrell's arm wrenched from his grasp, knew all was lost, and fell into blackness, down ... down... down...  Something gold was glinting just above him. The Snitch! He tried to catch it, but his arms were too heavy.  He blinked. It wasn't the Snitch at all. It was a pair of glasses. How strange.  He blinked again. The smiling face of Albus Dumbledore swam into view above him.  \"Good afternoon, Harry,\" said Dumbledore. Harry stared at him. Then he remembered: \"Sir! The Stone! It was Quirrell! He's got the Stone! Sir, quick --\"  \"Calm yourself, dear boy, you are a little behind the times,\" said Dumbledore. \"Quirrell does not have the Stone.\"  \"Then who does? Sir, I --\"  \"Harry, please relax, or Madam Pomfrey will have me thrown out.  Harry swallowed and looked around him. He realized he must be in the hospital wing. He was lying in a bed with white linen sheets, and next to him was a table piled high with what looked like half the candy shop.  \"Tokens from your friends and admirers,\" said Dumbledore, beaming. \"What happened down in the dungeons between you and Professor Quirrell is a complete secret, so, naturally, the whole school knows. I believe your friends Misters Fred and George Weasley were responsible for trying to send you a toilet seat. No doubt they thought it would amuse you. Madam Pomfrey, however, felt it might not be very hygienic, and confiscated it.\"  \"How long have I been in here?\"  \"Three days. Mr. Ronald Weasley and Miss Granger will be most relieved you have come round, they have been extremely worried.\"  \"But sit, the Stone  I see you are not to be distracted. Very well, the Stone. Professor Quirrell did not manage to take it from you."
}