{
  "id": "178fd0702b68f8872620b2afd9da98ff1a6df9ec",
  "text": " A frightened man is a beaten man. And perhaps she can do more. I mean to find out.   When I was a lad I found an injured goshawk and nursed her back to health. Proudwing, I named her. She would perch on my shoulder and flutter from room to room after me and take food from my hand, but she would not soar. Time and again I would take her hawking, but she never flew higher than the treetops. Robert called her Weakwing. He owned a gyrfalcon named Thunderclap who never missed her strike. One day our great-uncle Ser Harbert told me to try a different bird. I was making a fool of myself with Proudwing, he said, and he was right.  Stannis Baratheon turned away from the window, and the ghosts who moved upon the southern sea.  The Seven have never brought me so much as a sparrow. It is time I tried another hawk, Davos. A red hawk.       THEON  There was no safe anchorage at Pyke, but Theon Greyjoy wished to look on his father’s castle from the sea, to see it as he had seen it last, ten years before, when Robert Baratheon’s war galley had borne him away to be a ward of Eddard Stark. On that day he had stood beside the rail, listening to the stroke of the oars and the pounding of the master’s drum while he watched Pyke dwindle in the distance. Now he wanted to see it grow larger, to rise from the sea before him.  Obedient to his wishes, the Myraham beat her way past the point with her sails snapping and her captain cursing the wind and his crew and the follies of highborn lordlings. Theon drew the hood of his cloak up against the spray, and looked for home.  The shore was all sharp rocks and glowering cliffs, and the castle seemed one with the rest, its towers and walls and bridges quarried from the same grey-black stone, wet by the same salt waves, festooned with the same spreading patches of dark green lichen, speckled by the droppings of the same seabirds. The point of land on which the Greyjoys had raised their fortress had once thrust like a sword into the bowels of the ocean, but the waves had hammered at it day and night until the land broke and shattered, thousands of years past. All that remained were three bare and barren islands and a dozen towering stacks of rock that rose from the water like the pillars of some sea god’s temple, while the angry waves foamed and crashed among them.  Drear, dark, forbidding, Pyke stood atop those islands and pillars, almost a part of them, its curtain wall closing off the headland around the foot of the great stone bridge that leapt from the clifftop to the largest islet, dominated by the massive bulk of the Great Keep. Farther out were the Kitchen Keep and the Bloody Keep, each on its own island. Towers and outbuildings clung to the stacks beyond, linked to each other by covered archways when the pillars stood close, by long swaying walks of wood and rope when they did not.  The Sea Tower rose from the outmost island at the point of the broken sword, the oldest part of the castle, round and tall, the sheer-sided pillar on which it stood half-eaten through by the endless battering of the waves. The base of the tower was white from centuries of salt spray, the upper stories green from the lichen that crawled over it like a thick blanket, the jagged crown black with soot from its nightly watchfire.  Above the Sea Tower snapped his father’s banner. The Myraham was too far off for Theon to see more than the cloth itself, but he knew the device it bore: the golden kraken of House Greyjoy, arms writhing and reaching against a black field. The banner streamed from an iron mast, shivering and twisting as the wind gusted, like a bird struggling to take flight. And here at least the direwolf of Stark did not fly above, casting its shadow down upon the Greyjoy kraken.  Theon had never seen a more stirring sight. In the sky behind the castle, the fine red tail of the comet was visible through thin, scuttling clouds. All the way from Riverrun to Seagard, the Mallisters had argued about its meaning. It is my comet, Theon told himself, sliding a hand into his fur-lined cloak to touch the oilskin pouch snug in its pocket. Inside was the letter Robb Stark had given him, paper as good as a crown.   Does the castle look as you remember it, milord?  the captain’s daughter asked as she pressed herself against his arm.   It looks smaller,  Theon confessed,  though perhaps that is only the distance.  The Myraham was a fat-bellied southron merchanter up from Oldtown, carrying wine and cloth and seed to trade for iron ore. Her captain was a fat-bellied southron merchanter as well, and the stony sea that foamed at the feet of the castle made his plump lips quiver, so he stayed well out, farther than Theon would have liked. An ironborn captain in a longship would have taken them along the cliffs and under the high bridge that spanned the gap between the gatehouse and the Great Keep, but this plump Oldtowner had neither the craft, the crew, nor the courage to attempt such a thing. So they sailed past at a safe distance, and Theon must content himself with seeing Pyke from afar."
}