{
  "id": "19ab5ba302f99df81f9c9fb6ae29abffcf8c4218",
  "text": "   They were talking about Father, Bran realized. He wanted to hear more. A few more feet… but they would see him if he swung out in front of the window.   We will have to watch him carefully,  the woman said.   I would sooner watch you,  the man said. He sounded bored.  Come back here.    Lord Eddard has never taken any interest in anything that happened south of the Neck,  the woman said.  Never. I tell you, he means to move against us. Why else would he leave the seat of his power?    A hundred reasons. Duty. Honor. He yearns to write his name large across the book of history, to get away from his wife, or both. Perhaps he just wants to be warm for once in his life.    His wife is Lady Arryn’s sister. It’s a wonder Lysa was not here to greet us with her accusations.   Bran looked down. There was a narrow ledge beneath the window, only a few inches wide. He tried to lower himself toward it. Too far. He would never reach.   You fret too much. Lysa Arryn is a frightened cow.    That frightened cow shared Jon Arryn’s bed.    If she knew anything, she would have gone to Robert before she fled King’s Landing.    When he had already agreed to foster that weakling son of hers at Casterly Rock? I think not. She knew the boy’s life would be hostage to her silence. She may grow bolder now that he’s safe atop the Eyrie.    Mothers.  The man made the word sound like a curse.  I think birthing does something to your minds. You are all mad.  He laughed. It was a bitter sound.  Let Lady Arryn grow as bold as she likes. Whatever she knows, whatever she thinks she knows, she has no proof.  He paused a moment.  Or does she?    Do you think the king will require proof?  the woman said.  I tell you, he loves me not.    And whose fault is that, sweet sister?   Bran studied the ledge. He could drop down. It was too narrow to land on, but if he could catch hold as he fell past, pull himself up… except that might make a noise, draw them to the window. He was not sure what he was hearing, but he knew it was not meant for his ears.   You are as blind as Robert,  the woman was saying.   If you mean I see the same thing, yes,  the man said.  I see a man who would sooner die than betray his king.    He betrayed one already, or have you forgotten?  the woman said.  Oh, I don’t deny he’s loyal to Robert, that’s obvious. What happens when Robert dies and Joff takes the throne? And the sooner that comes to pass, the safer we’ll all be. My husband grows more restless every day. Having Stark beside him will only make him worse. He’s still in love with the sister, the insipid little dead sixteen-year-old. How long till he decides to put me aside for some new Lyanna?   Bran was suddenly very frightened. He wanted nothing so much as to go back the way he had come, to find his brothers. Only what would he tell them? He had to get closer, Bran realized. He had to see who was talking.  The man sighed.  You should think less about the future and more about the pleasures at hand.    Stop that!  the woman said. Bran heard the sudden slap of flesh on flesh, then the man’s laughter.  Bran pulled himself up, climbed over the gargoyle, crawled out onto the roof. This was the easy way. He moved across the roof to the next gargoyle, right above the window of the room where they were talking.   All this talk is getting very tiresome, sister,  the man said.  Come here and be quiet.   Bran sat astride the gargoyle, tightened his legs around it, and swung himself around, upside down. He hung by his legs and slowly stretched his head down toward the window. The world looked strange upside down. A courtyard swam dizzily below him, its stones still wet with melted snow.  Bran looked in the window.  Inside the room, a man and a woman were wrestling. They were both naked. Bran could not tell who they were. The man’s back was to him, and his body screened the woman from view as he pushed her up against a wall.  There were soft, wet sounds. Bran realized they were kissing. He watched, wide-eyed and frightened, his breath tight in his throat. The man had a hand down between her legs, and he must have been hurting her there, because the woman started to moan, low in her throat.  Stop it,  she said,  stop it, stop it. Oh, please…  But her voice was low and weak, and she did not push him away. Her hands buried themselves in his hair, his tangled golden hair, and pulled his face down to her breast.  Bran saw her face. Her eyes were closed and her mouth was open, moaning. Her golden hair swung from side to side as her head moved back and forth, but still he recognized the queen.  He must have made a noise. Suddenly her eyes opened, and she was staring right at him. She screamed.  Everything happened at once then. ‘ The woman pushed the man away wildly, shouting and pointing. Bran tried to pull himself up, bending double as he reached for the gargoyle. He was in too much of a hurry. His hand scraped uselessly across smooth stone, and in his panic his legs slipped, and suddenly he was failing."
}