{
  "id": "1ab376fad9e1ba0105ace204896a17b536798e52",
  "text": "  She knew the hymn; her mother had taught it to her once, a long time ago in Winterfell. She joined her voice to theirs.  Gentle Mother, font of mercy,  save our sons from war, we pray,  stay the swords and stay the arrows,  let them know a better day.  Gentle Mother, strength of women,  help our daughters through this fray,  soothe the wrath and tame the fury,  teach us all a kinder way.  Across the city, thousands had jammed into the Great Sept of Baelor on Visenya’s Hill, and they would be singing too, their voices swelling out over the city, across the river, and up into the sky. Surely the gods must hear us, she thought.  Sansa knew most of the hymns, and followed along on those she did not know as best she could. She sang along with grizzled old serving men and anxious young wives, with serving girls and soldiers, cooks and falconers, knights and knaves, squires and spit boys and nursing mothers. She sang with those inside the castle walls and those without, sang with all the city. She sang for mercy, for the living and the dead alike, for Bran and Rickon and Robb, for her sister Arya and her bastard brother Jon Snow, away off on the Wall. She sang for her mother and her father, for her grandfather Lord Hoster and her uncle Edmure Tully, for her friend Jeyne Poole, for old drunken King Robert, for Septa Mordane and Ser Dontos and Jory Cassel and Maester Luwin, for all the brave knights and soldiers who would die today, and for the children and the wives who would mourn them, and finally, toward the end, she even sang for Tyrion the Imp and for the Hound. He is no true knight but he saved me all the same, she told the Mother. Save him if you can, and gentle the rage inside him.  But when the septon climbed on high and called upon the gods to protect and defend their true and noble king, Sansa got to her feet. The aisles were jammed with people. She had to shoulder through while the septon called upon the Smith to lend strength to Joffrey’s sword and shield, the Warrior to give him courage, the Father to defend him in his need. Let his sword break and his shield shatter, Sansa thought coldly as she shoved out through the doors, let his courage fail him and every man desert him.  A few guards paced along on the gatehouse battlements, but otherwise the castle seemed empty. Sansa stopped and listened. Away off, she could hear the sounds of battle. The singing almost drowned them out, but the sounds were there if you had the ears to hear: the deep moan of warhorns, the creak and thud of catapults flinging stones, the splashes and splinterings, the crackle of burning pitch and thrum of scorpions loosing their yard-long iron-headed shafts… and beneath it all, the cries of dying men.  It was another sort of song, a terrible song. Sansa pulled the hood of her cloak up over her ears, and hurried toward Maegor’s Holdfast, the castle-within-a-castle where the queen had promised they would all be safe. At the foot of the drawbridge, she came upon Lady Tanda and her two daughters. Falyse had arrived yesterday from Castle Stokeworth with a small troop of soldiers. She was trying to coax her sister onto the bridge, but Lollys clung to her maid, sobbing,  I don’t want to, I don’t want to, I don’t want to.    The battle is begun,  Lady Tanda said in a brittle voice.   I don’t want to, I don’t want to.   There was no way Sansa could avoid them. She greeted them courteously.  May I be of help?   Lady Tanda flushed with shame.  No, my lady, but we thank you kindly. You must forgive my daughter, she has not been well.    I don’t want to.  Lollys clutched at her maid, a slender, pretty girl with short dark hair who looked as though she wanted nothing so much as to shove her mistress into the dry moat, onto those iron spikes.  Please, please, I don’t want to.   Sansa spoke to her gently.  We’ll all be thrice protected inside, and there’s to be food and drink and song as well.   Lollys gaped at her, mouth open. She had dull brown eyes that always seemed to be wet with tears.  I don’t want to.    You have to,  her sister Falyse said sharply,  and that is the end of it. Shae, help me.  They each took an elbow, and together half dragged and half carried Lollys across the bridge. Sansa followed with their mother.  She’s been sick,  Lady Tanda said. If a babe can be termed a sickness, Sansa thought. It was common gossip that Lollys was with child.  The two guards at the door wore the lion-crested helms and crimson cloaks of House Lannister, but Sansa knew they were only dressed-up sellswords. Another sat at the foot of the stair—a real guard would have been standing, not sitting on a step with his halberd across his knees—but he rose when he saw them and opened the door to usher them inside.  The Queen’s Ballroom was not a tenth the size of the castle’s Great Hall, only half as big as the Small Hall in the Tower of the Hand, but it could still seat a hundred, and it made up in grace what it lacked in space. Beaten silver mirrors backed every wall sconce, so the torches burned twice as bright; the walls were paneled in richly carved wood, and sweet-smelling rushes covered the floors."
}