{
  "id": "1af872535b70e3deebec373b4e81dddf214158f3",
  "text": " If he must perish, let it be with a sword in his hand, fighting his father’s killers. He was no true Stark, had never been one… but he could die like one. Let them say that Eddard Stark had fathered four sons, not three.  Ghost kept pace with them for almost half a mile, red tongue lolling from his mouth. Man and horse alike lowered their heads as he asked the mare for more speed. The wolf slowed, stopped, watching, his eyes glowing red in the moonlight. He vanished behind, but Jon knew he would follow, at his own pace.  Scattered lights flickered through the trees ahead of him, on both sides of the road: Mole’s Town. A dog barked as he rode through, and he heard a mule’s raucous haw from the stable, but otherwise the village was still. Here and there the glow of hearth fires shone through shuttered windows, leaking between wooden slats, but only a few.  Mole’s Town was bigger than it seemed, but three quarters of it was under the ground, in deep warm cellars connected by a maze of tunnels. Even the whorehouse was down there, nothing on the surface but a wooden shack no bigger than a privy, with a red lantern hung over the door. On the Wall, he’d heard men call the whores  buried treasures.  He wondered whether any of his brothers in black were down there tonight, mining. That was oathbreaking too, yet no one seemed to care.  Not until he was well beyond the village did Jon slow again. By then both he and the mare were damp with sweat. He dismounted, shivering, his burned hand aching. A bank of melting snow lay under the trees, bright in the moonlight, water trickling off to form small shallow pools. Jon squatted and brought his hands together, cupping the runoff between his fingers. The snowmelt was icy cold. He drank, and splashed some on his face, until his cheeks tingled. His fingers were throbbing worse than they had in days, and his head was pounding too. I am doing the right thing, he told himself, so why do I feel so bad?  The horse was well lathered, so Jon took the lead and walked her for a while. The road was scarcely wide enough for two riders to pass abreast, its surface cut by tiny streams and littered with stone. That run had been truly stupid, an invitation to a broken neck. Jon wondered what had gotten into him. Was he in such a great rush to die?  Off in the trees, the distant scream of some frightened animal made him look up. His mare whinnied nervously. Had his wolf found some prey? He cupped his hands around his mouth.  Ghost!  he shouted.  Ghost, to me.  The only answer was a rush of wings behind him as an owl took flight.  Frowning, Jon continued on his way. He led the mare for half an hour, until she was dry. Ghost did not appear. Jon wanted to mount up and ride again, but he was concerned about his missing wolf.  Ghost,  he called again.  Where are you? To me! Ghost!  Nothing in these woods could trouble a direwolf, even a half-grown direwolf, unless… no, Ghost was too smart to attack a bear, and if there was a wolf pack anywhere close Jon would have surely heard them howling.  He should eat, he decided. Food would settle his stomach and give Ghost the chance to catch up. There was no danger yet; Castle Black still slept. In his saddlebag, he found a biscuit, a piece of cheese, and a small withered brown apple. He’d brought salt beef as well, and a rasher of bacon he’d filched from the kitchens, but he would save the meat for the morrow. After it was gone he’d need to hunt, and that would slow him.  Jon sat under the trees and ate his biscuit and cheese while his mare grazed along the kingsroad. He kept the apple for last. It had gone a little soft, but the flesh was still tart and juicy. He was down to the core when he heard the sounds: horses, and from the north. Quickly Jon leapt up and strode to his mare. Could he outrun them? No, they were too close, they’d hear him for a certainty, and if they were from Castle Black…  He led the mare off the road, behind a thick stand of grey-green sentinels.  Ouiet now,  he said in a hushed voice, crouching down to peer through the branches. If the gods were kind, the riders would pass by. Likely as not, they were only smallfolk from Mole’s Town, farmers on their way to their fields, although what they were doing out in the middle of the night…  He listened to the sound of hooves growing steadily louder as they trotted briskly down the kingsroad. From the sound, there were five or six of them at the least. Their voices drifted through the trees.   …certain he came this way?    We can’t be certain.    He could have ridden east, for all you know. Or left the road to cut through the woods. That’s what I’d do.    In the dark? Stupid. If you didn’t fall off your horse and break your neck, you’d get lost and wind up back at the Wall when the sun came up.    I would not.  Grenn sounded peeved.  I’d just ride south, you can tell south by the stars.    What if the sky was cloudy?  Pyp asked.   Then I wouldn’t go.   Another voice broke in.  You know where I’d be if it was me? I’d be in Mole’s Town, digging for buried treasure."
}