{
  "id": "1daf756b606ffb3b25d05fe6efa7b5ece9dfe18f",
  "text": " Arya covered her mouth in shock. Theon Greyjoy seized Robb’s arm to keep him away from the prince. Ser Rodrik tugged at his whiskers in dismay.  Joffrey feigned a yawn and turned to his younger brother.  Come, Tommen,  he said.  The hour of play is done. Leave the children to their frolics.   That brought more laughter from the Lannisters, more curses from Robb. Ser Rodrik’s face was beet-red with fury under the white of his whiskers. Theon kept Robb locked in an iron grip until the princes and their party were safely away.  Jon watched them leave, and Arya watched Jon. His face had grown as still as the pool at the heart of the godswood. Finally he climbed down off the window.  The show is done,  he said. He bent to scratch Ghost behind the ears. The white wolf rose and rubbed against him.  You had best run back to your room, little sister. Septa Mordane will surely be lurking. The longer you hide, the sterner the penance. You’ll be sewing all through winter. When the spring thaw comes, they will find your body with a needle still locked tight between your frozen fingers.   Arya didn’t think it was funny.  I hate needlework!  she said with passion.  It’s not fair!    Nothing is fair,  Jon said. He messed up her hair again and walked away from her, Ghost moving silently beside him. Nymeria started to follow too, then stopped and came back when she saw that Arya was not coming.  Reluctantly she turned in the other direction.  It was worse than Jon had thought. It wasn’t Septa Mordane waiting in her room. It was Septa Mordane and her mother.      BRAN  The hunt left at dawn. The king wanted wild boar at the feast tonight. Prince Joffrey rode with his father, so Robb had been allowed to join the hunters as well. Uncle Benjen, Jory, Theon Greyjoy, Ser Rodrik, and even the queen’s funny little brother had all ridden out with them. It was the last hunt, after all. On the morrow they left for the south.  Bran had been left behind with Jon and the girls and Rickon. But Rickon was only a baby and the girls were only girls and Jon and his wolf were nowhere to be found. Bran did not look for him very hard. He thought Jon was angry at him. Jon seemed to be angry at everyone these days. Bran did not know why. He was going with Uncle Ben to the Wall, to join the Night’s Watch. That was almost as good as going south with the king. Robb was the one they were leaving behind, not Jon.  For days, Bran could scarcely wait to be off. He was going to ride the kingsroad on a horse of his own, not a pony but a real horse. His father would be the Hand of the King, and they were going to live in the red castle at King’s Landing, the castle the Dragonlords had built. Old Nan said there were ghosts there, and dungeons where terrible things had been done, and dragon heads on the walls. It gave Bran a shiver just to think of it, but he was not afraid. How could he be afraid? His father would be with him, and the king with all his knights and sworn swords.  Bran was going to be a knight himself someday, one of the Kingsguard. Old Nan said they were the finest swords in all the realm. There were only seven of them, and they wore white armor and had no wives or children, but lived only to serve the king. Bran knew all the stories. Their names were like music to him. Serwyn of the Mirror Shield. Ser Ryam Redwyne. Prince Aemon the Dragonknight. The twins Ser Erryk and Ser Arryk, who had died on one another’s swords hundreds of years ago, when brother fought sister in the war the singers called the Dance of the Dragons. The White Bull, Gerold Hightower. Ser Arthur Dayne, the Sword of the Morning. Barristan the Bold.  Two of the Kingsguard had come north with King Robert. Bran had watched them with fascination, never quite daring to speak to them. Ser Boros was a bald man with a jowly face, and Ser Meryn had droopy eyes and a beard the color of rust. Ser Jaime Lannister looked more like the knights in the stories, and he was of the Kingsguard too, but Robb said he had killed the old mad king and shouldn’t count anymore. The greatest living knight was Ser Barristan Selmy, Barristan the Bold, the Lord Commander of the Kingsguard. Father had promised that they would meet Ser Barristan when they reached King’s Landing, and Bran had been marking the days on his wall, eager to depart, to see a world he had only dreamed of and begin a life he could scarcely imagine.  Yet now that the last day was at hand, suddenly Bran felt lost. Winterfell had been the only home he had ever known. His father had told him that he ought to say his farewells today, and he had tried. After the hunt had ridden out, he wandered through the castle with his wolf at his side, intending to visit the ones who would be left behind, Old Nan and Gage the cook, Mikken in his smithy, Hodor the stableboy who smiled so much and took care of his pony and never said anything but  Hodor,  the man in the glass gardens who gave him a blackberry when he came to visit…  But it was no good. He had gone to the stable first, and seen his pony there in its stall, except it wasn’t his pony anymore, he was getting a real horse and leaving the pony behind, and all of a sudden Bran just wanted to sit down and cry."
}