{
  "id": "1f908dd25347917a9ca106b764a7f7f2a1733de9",
  "text": " And two cups.  Theon picked one up and sniffed at the dregs of wine in the bottom.  Squint was up on the wallwalk, no?    Aye,  said Lorren.  Theon flung the cup into the hearth.  I’d say Drennan was pulling down his breeches to stick it in the woman when she stuck it in him. His own cheese knife, by the look of it. Someone find a pike and fish the other fool out of the moat.   The other fool was in a deal worse shape than Drennan. When Black Lorren drew him out of the water, they saw that one of his arms had been wrenched off at the elbow, half of his neck was missing, and there was a ragged hole where his navel and groin once had been. The pike tore through his bowels as Lorren was pulling him in. The stench was awful.   The direwolves,  Theon said.  Both of them, at a guess.  Disgusted, he walked back to the drawbridge. Winterfell was encircled by two massive granite walls, with a wide moat between them. The outer wall stood eighty feet high, the inner more than a hundred. Lacking men, Theon had been forced to abandon the outer defenses and post his guards along the higher inner walls. He dared not risk having them on the wrong side of the moat should the castle rise against him.  There had to be two or more, he decided. While the woman was entertaining Drennan, the others freed the wolves.  Theon called for a torch and led them up the steps to the wallwalk. He swept the flame low before him, looking for… there. On the inside of the rampart and in the wide crenel between two upthrust merlons.  Blood,  he announced,  clumsily mopped up. At a guess, the woman killed Drennan and lowered the drawbridge. Squint heard the clank of chains, came to have a look, and got this far. They pushed the corpse through the crenel into the moat so he wouldn’t be found by another sentry.   Urzen peered along the walls.  The other watch turrets are not far. I see torches burning—    Torches, but no guards,  Theon said testily.  Winterfell has more turrets than I have men.    Four guards at the main gate,  said Black Lorren,  and five walking the walls beside Squint.   Urzen said,  If he had sounded his horn—   I am served by fools.  Try and imagine it was you up here, Urzen. It’s dark and cold. You have been walking sentry for hours, looking forward to the end of your watch. Then you hear a noise and move toward the gate, and suddenly you see eyes at the top of the stair, glowing green and gold in the torchlight. Two shadows come rushing toward you faster than you can believe. You catch a glimpse of teeth, start to level your spear, and they slam into you and open your belly, tearing through leather as if it were cheesecloth.  He gave Urzen a hard shove.  And now you’re down on your back, your guts are spilling out, and one of them has his teeth around your neck.  Theon grabbed the man’s scrawny throat, tightened his fingers, and smiled.  Tell me, at what moment during all of this do you stop to blow your fucking horn?  He shoved Urzen away roughly, sending him stumbling back against a merlon. The man rubbed his throat. I should have had those beasts put down the day we took the castle, he thought angrily. I’d seen them kill, I knew how dangerous they were.   We must go after them,  Black Lorren said.   Not in the dark.  Theon did not relish the idea of chasing direwolves through the wood by night; the hunters could easily become the hunted.  We’ll wait for daylight. Until then, I had best go speak with my loyal subjects.   Down in the yard, a uneasy crowd of men, women, and children had been pushed up against the wall. Many had not been given time to dress; they covered themselves with woolen blankets, or huddled naked under cloaks or bedrobes. A dozen ironmen hemmed them in, torches in one hand and weapons in the other. The wind was gusting, and the flickering orange light reflected dully off steel helms, thick beards, and unsmiling eyes.  Theon walked up and down before the prisoners, studying the faces. They all looked guilty to him.  How many are missing?    Six.  Reek stepped up behind him, smelling of soap, his long hair moving in the wind.  Both Starks, that bog boy and his sister, the halfwit from the stables, and your wildling woman.   Osha. He had suspected her from the moment he saw that second cup. I should have known better than to trust that one. She’s as unnatural as Asha. Even their names sound alike.   Has anyone had a look at the stables?    Aggar says no horses are missing.    Dancer is still in his stall?    Dancer?  Reek frowned.  Aggar says the horses are all there. Only the halfwit is missing.   They’re afoot, then. That was the best news he’d heard since he woke. Bran would be riding in his basket on Hodor’s back, no doubt. Osha would need to carry Rickon; his little legs wouldn’t take him far on their own. Theon was confident that he’d soon have them back in his hands.  Bran and Rickon have fled,  he told the castle folk, watching their eyes.  Who knows where they’ve gone?  No one answered.  They could not have escaped without help,  Theon went on."
}