{
  "id": "249d47efb3e61dcbec2144d3e2ffde456bb91751",
  "text": " So as cold and death filled the earth, the last hero determined to seek out the children, in the hopes that their ancient magics could win back what the armies of men had lost. He set out into the dead lands with a sword, a horse, a dog, and a dozen companions. For years he searched, until he despaired of ever finding the children of the forest in their secret cities. One by one his friends died, and his horse, and finally even his dog, and his sword froze so hard the blade snapped when he tried to use it. And the Others smelled the hot blood in him, and came silent on his trail, stalking him with packs of pale white spiders big as hounds—   The door opened with a bang, and Bran’s heart leapt up into his mouth in sudden fear, but it was only Maester Luwin, with Hodor looming in the stairway behind him.  Hodor!  the stableboy announced, as was his custom, smiling hugely at them all.  Maester Luwin was not smiling.  We have visitors,  he announced,  and your presence is required, Bran.    I’m listening to a story now,  Bran complained.   Stories wait, my little lord, and when you come back to them, why, there they are,  Old Nan said.  Visitors are not so patient, and ofttimes they bring stories of their own.    Who is it?  Bran asked Maester Luwin.   Tyrion Lannister, and some men of the Night’s Watch, with word from your brother Jon. Robb is meeting with them now. Hodor, will you help Bran down to the hall?    Hodor!  Hodor agreed happily. He ducked to get his great shaggy head under the door. Hodor was nearly seven feet tall. It was hard to believe that he was the same blood as Old Nan. Bran wondered if he would shrivel up as small as his great-grandmother when he was old. It did not seem likely, even if Hodor lived to be a thousand.  Hodor lifted Bran as easy as if he were a bale of hay, and cradled him against his massive chest. He always smelled faintly of horses, but it was not a bad smell. His arms were thick with muscle and matted with brown hair.  Hodor,  he said again. Theon Greyjoy had once commented that Hodor did not know much, but no one could doubt that he knew his name. Old Nan had cackled like a hen when Bran told her that, and confessed that Hodor’s real name was Walder. No one knew where  Hodor  had come from, she said, but when he started saying it, they started calling him by it. It was the only word he had.  They left Old Nan in the tower room with her needles and her memories. Hodor hummed tunelessly as he carried Bran down the steps and through the gallery, with Maester Luwin following behind, hurrying to keep up with the stableboy’s long strides.  Robb was seated in Father’s high seat, wearing ringmail and boiled leather and the stern face of Robb the Lord. Theon Greyjoy and Hallis Mollen stood behind him. A dozen guardsmen lined the grey stone walls beneath tall narrow windows. In the center of the room the dwarf stood with his servants, and four strangers in the black of the Night’s Watch. Bran could sense the anger in the hall the moment that Hodor carried him through the doors.   Any man of the Night’s Watch is welcome here at Winterfell for as long as he wishes to stay,  Robb was saying with the voice of Robb the Lord. His sword was across his knees, the steel bare for all the world to see. Even Bran knew what it meant to greet a guest with an unsheathed sword.   Any man of the Night’s Watch,  the dwarf repeated,  but not me, do I take your meaning, boy?   Robb stood and pointed at the little man with his sword.  I am the lord here while my mother and father are away, Lannister. I am not your boy.    If you are a lord, you might learn a lord’s courtesy,  the little man replied, ignoring the sword point in his face.  Your bastard brother has all your father’s graces, it would seem.    Jon,  Bran gasped out from Hodor’s arms.  The dwarf turned to look at him.  So it is true, the boy lives. I could scarce believe it. You Starks are hard to kill.    You Lannisters had best remember that,  Robb said, lowering his sword.  Hodor, bring my brother here.    Hodor,  Hodor said, and he trotted forward smiling and set Bran in the high seat of the Starks, where the Lords of Winterfell had sat since the days when they called themselves the Kings in the North. The seat was cold stone, polished smooth by countless bottoms; the carved heads of direwolves snarled on the ends of its massive arms. Bran clasped them as he sat, his useless legs dangling. The great seat made him feel half a baby.  Robb put a hand on his shoulder.  You said you had business with Bran. Well, here he is, Lannister.   Bran was uncomfortably aware of Tyrion Lannister’s eyes. One was black and one was green, and both were looking at him, studying him, weighing him.  I am told you were quite the climber, Bran,  the little man said at last.  Tell me, how is it you happened to fall that day?    I never,  Bran insisted. He never fell, never never never.   The child does not remember anything of the fall, or the climb that came before it,  said Maester Luwin gently."
}