{
  "id": "2712dc00491ad6d21141d59263fbedfbda7fe831",
  "text": "  We heard the Death Eaters.  The ones who had never been to Azkaban.  The ones who had never suffered for my master.  They had turned their backs on him.  They were not enslaved, as I was.  They were free to seek him, but they did not.  They were merely making sport of Muggles.  The sound of their voices awoke me.  My mind was clearer than it had been in years.  I was angry.  I had the wand. I wanted to attack them for their disloyalty to my master.  My father had left the tent; he had gone to free the Muggles.  Winky was afraid to see me so angry.  She used her own brand of magic to bind me to her.  She pulled me from the tent, pulled me into the forest, away from the Death Eaters.  I tried to hold her back.  I wanted to return to the campsite.  I wanted to show those Death Eaters what loyalty to the Dark Lord meant, and to punish them for their lack of it.  I used the stolen wand to cast the Dark Mark into the sky. \"Ministry wizards arrived.  They shot Stunning Spells everywhere.  One of the spells came through the trees where Winky and I stood.  The bond connecting us was broken.  We were both Stunned. \"When Winky was discovered, my father knew I must be nearby.  He searched the bushes where she had been found and felt me lying there.  He waited until the other Ministry members had left the forest.  He put me back under the Imperius Curse and took me home.  He dismissed Winky.  She had failed him.  She had let me acquire a wand.  She had almost let me escape.\" Winky let out a wail of despair. \"Now it was just Father and I, alone in the house.  And then . . . and then . . .\" Crouch's head rolled on his neck, and an insane grin spread across his face.  \"My master came for me. \"He arrived at our house late one night in the arms of his servant Wormtail.  My master had found out that I was still alive.  He had captured Bertha Jorkins in Albania.  He had tortured her.  She told him a great deal.  She told him about the Triwizard Tournament.  She told him the old Auror, Moody, was going to teach at Hogwarts.  He tortured her until he broke through the Memory Charm my father had placed upon her.  She told him I had escaped from Azkaban. She told him my father kept me imprisoned to prevent me from seeking my master.  And so my master knew that I was still his faithful servant - perhaps the most faithful of all.  My master conceived a plan, based upon the information Bertha had given him.  He needed me.  He arrived at our house near midnight.  My father answered the door.\" The smile spread wider over Crouch's face, as though recalling the sweetest memory of his life.  Winky's petrified brown eyes were visible through her fingers.  She seemed too appalled to speak. \"It was very quick.  My father was placed under the Imperius Curse by my master. Now my father was the one imprisoned, controlled.  My master forced him to go about his business as usual, to act as though nothing was wrong.  And I was released.  I awoke.  I was myself again, alive as I hadn't been in years. \"And what did Lord Voldemort ask you to do?\"  said Dumbledore. \"He asked me whether I was ready to risk everything for him.  I was ready.  It was my dream, my greatest ambition, to serve him, to prove myself to him.  He told me he needed to place a faithful servant at Hogwarts.  A servant who would guide Harry Potter through the Triwizard Tournament without appearing to do so.  A servant who would watch over Harry Potter.  Ensure he reached the Triwizard Cup.  Turn the cup into a Portkey, which would take the first person to touch it to my master.  But first -\" \"You needed Alastor Moody,\" said Dumbledore.  His blue eyes were blazing, though his voice remained calm. \"Wormtail and I did it.  We had prepared the Polyjuice Potion beforehand.  We journeyed to his house.  Moody put up a struggle.  There was a commotion.  We managed to subdue him just in time.  Forced him into a compartment of his own magical trunk.  Took some of his hair and added it to the potion.  I drank it; I became Moody's double.  I took his leg and his eye.  I was ready to face Arthur Weasley when he arrived to sort out the Muggles who had heard a disturbance.  I made the dustbins move around the yard.  I told Arthur Weasley I had heard intruders in my yard, who had set off the dustbins.  Then I packed up Moody's clothes and Dark detectors, put them in the trunk with Moody, and set off for Hogwarts.  I kept him alive, under the Imperius Curse.  I wanted to be able to question him.  To find out about his past, learn his habits, so that I could fool even Dumbledore.  I also needed his hair to make the Polyjuice Potion.  The other ingredients were easy.  I stole boom-slang skin from the dungeons. When the Potions master found me in his office, I said I was under orders to search it.\" \"And what became of Wormtail after you attacked Moody?\"  said Dumbledore. \"Wormtail returned to care for my master, in my father's house, and to keep watch over my father.\" \"But your father escaped,\" said Dumbledore."
}