{
  "id": "27aab445630c4f3e7da3411885728cbd322c0f86",
  "text": " Some had already gone  to haul  on  the  ropes  which  pulled  up  the  portcullis  at  the  water-gate  so  as  to  let  out  the  barrels as soon as they were all afloat below.      Down the swift dark stream you go  Back to lands you once did know!  Leave the halls and caverns deep,  Leave the northern mountains steep,  Where the forest wide and dim  Stoops in shadow grey and grim!  Float beyond the world of trees  Out into the whispering breeze,  Past the rushes, past the reeds,  Past the marsh's waving weeds,  Through the mist that riseth white  Up from mere and pool at night!  Follow, follow stars that leap  Up the heavens cold and steep;  Turn when dawn comes over land,  Over rapid, over sand,  South away! and South away!  Seek the sunlight and the day,   Back to pasture, back to mead,  Where the kine and oxen feed!   ####-Back to gardens on the hills  Where the berry swells and fills  Under sunlight, under day!  South away! and South away!  Down the swift dark stream you go  Back to lands you once did know!     Now  the  very  last  barrel  was  being  rolled  to  the  doors!  In  despair  and  not  knowing what  else  to  do,  poor  little Bilbo  caught hold of  it  and was pushed over  the edge with it. Down into the water he fell, splash! into the cold dark water with  the  barrel  on  top  of  him. He  came  up  again  spluttering  and  clinging  to  the wood  like a  rat, but  for all his efforts he could not scramble on top. Every time he tried,  the  barrel  rolled  round  and  ducked  him  under  again.  It  was  really  empty,  and  floated light as a cork. Though his ears were full of water, he could hear the elves  still  singing  in  the  cellar  above.  Then  suddenly  the  trapdoors  fell  to with a boom  and  their  voices  faded  away. He was  in  the  dark  tunnel,  floating  in  icy water,  all  alone-for you cannot count friends that are all packed up in barrels.  Very  soon a grey patch came up  in  the darkness ahead. He heard  the creak of  the water-gate being hauled up, and he found that he was in the midst of a bobbing  and  bumping mass  of  casks  and  tubs  all  pressing  together  to  pass  under  the  arch  and  get  out  into  the  open  stream.  He  had  as  much  as  he  could  do  to  prevent  himself  from  being  hustled  and  battered  to  bits;  but  at  last  the  jostling  crowd  began to break up and swing off, one by one, under the stone arch and away. Then  he saw  that  it would have been no good even  if he had managed  to get astride his  barrel,  for  there was  no  room  to  spare, not  even  for  a hobbit, between  its  top  and  the suddenly stooping roof where the gate was.    Out  they  went  under  the  overhanging  branches  of  the  trees  on  either  bank.  Bilbo  wondered  what  the  dwarves  were  feeling  and  whether  a  lot  of  water  was  getting  into  their  tubs.  Some  of  those  that  bobbed  along  by  him  in  the  gloom  seemed pretty low in the water, and he guessed that these had dwarves inside.  \"I do hope  I put  the  lids on  tight enough!\" he  thought, but before  long he was  worrying  too much  about  himself  to remember  the dwarves. He managed  to keep  his head  above  the water, but he was  shivering with  the  cold,  and he wondered  if  he would die of  it before  the  luck  turned, and how much  longer he would be able  to hang on, and whether he should risk the chance of  letting go and trying to swim  to the bank.   ####-The  luck  turned  all  right  before  long:  the  eddying  current  carried  several  barrels  close  ashore  at  one  point  and  there  for  a  while  they  stuck  against  some  hidden  root.  Then  Bilbo  took  the  opportunity  of  scrambling  up  the  side  of  his  barrel while it was held steady against another. Up he crawled like a drowned rat,  and lay on the top spread out to keep the balance as best he could. The breeze was  cold  but  better  than  the water,  and  he  hoped  he would  not  suddenly  roll off again  when  they  started  off  once  more.  Before  long  the  barrels  broke  free  again  and  turned  and  twisted  off  down  the  stream,  and  out  into  the  main  current  Then  he  found it quite as difficult to stick on as he had feared; but he managed it somehow,  though  it was miserably uncomfortable. Luckily he was very  light, and  the barrel  was  a  good  big  one  and  being  rather  leaky  had  now  shipped  a  small  amount  of  water. All  the  same  it was  like  trying  to  ride, without  bridle  or  stirrups,  a  round- bellied  pony  that  was  always  thinking  of  rolling  on  the  grass.  In  this  way  at  last  Mr. Baggins came to a place where the trees on either hand grew thinner. He could  see the paler sky between them. The dark river opened suddenly wide, and there it  was  joined  to  the  main  water of  the Forest River  flowing down  in haste  from  the  king's  great  doors.  There was  a  dim  sheet  of water  no  longer  overshadowed,  and  on  its  sliding  surface  there were  dancing  and  broken  reflections  of  clouds  and  of  stars."
}