{
  "id": "2b194ca54232c340797f1f05db9f798f3d10a306",
  "text": "  \"Go away, Ginny,\" said Ron.  \"Oh, that's nice,\" said Ginny huffily, and she stalked off.  Harry, Ron, and Hermione set off down the corridor, looking for an empty compartment, but all were full except for the one at the very end of the train.  This had only one occupant, a man sitting fast asleep next to the window. Harry, Ron, and Hermione checked on the threshold. The Hogwarts Express was usually reserved for students and they had never seen an adult there before, except for the witch who pushed the food cart.  The stranger was wearing an extremely shabby set of wizard's robes that had been darned in several places. He looked ill and exhausted. Though quite young, his light brown hair was flecked with gray.  \"Who d'you reckon he is?\" Ron hissed as they sat down and slid the door shut, taking the seats farthest away from the window.  \"Professor R. J. Lupin,\" whispered Hermione at once.  \"How d'you know that?\"  \"It's on his case,\" she replied, pointing at the luggage rack over the man's head, where there was a small, battered case held together with a large quantity of neatly knotted string. The name Professor R. J. Lupin was stamped across one corner in peeling letters.  \"Wonder what he teaches?\" said Ron, frowning at Professor Lupin's pallid profile.  \"That's obvious,\" whispered Hermione. \"There's only one vacancy, isn't there? Defense Against the Dark Arts.\"  Harry, Ron, and Hermione had already had two Defense Against the Dark Arts teachers, both of whom had lasted only one year. There were rumors that the job was jinxed.  \"well, I hope he's up to it,\" said Ron doubtfully. \"He looks like on, good hex would finish him off, doesn't he? Anyway...\" He turned to Harry. \"What were you going to tell us?\"  Harry explained all about Mr. and Mrs. Weasley's argument and the warning Mr. Weasley had just given him. \\When he'd finished, Ron looked thunderstruck, and Hermione had her hands over her mouth. She finally lowered them to say, \"Sirius Black escaped to come after you? Oh, Harry... you'll have to be really, really careful. don't go looking for trouble, Harry --\"  \"I Don't go looking for trouble,\" said Harry, nettled. \"Trouble usually finds me.\"  \"How thick would Harry have to be, to go looking for a nutter who wants to kill him?\" said Ron shakily.  They were taking the news worse than Harry had expected. Both Ron and Hermione seemed to be much more frightened of Black than he was.  \"No one knows how he got out of Azkaban,\" said Ron uncomfortably. \"No one's ever done it before. And he was a top-security prisoner too.\"  \"But they'll catch him, won't they?\" said Hermione earnestly. \"I Mean, they've got all the Muggles looking out for him too....\" \"What's that noise?\" said Ron suddenly.  A faint, tinny sort of whistle was coming from somewhere. The, looked all around the compartment.  \"It's coming from your trunk, Harry,\" said Ron, standing UP and reaching into the luggage rack. A moment later he had pulled the Pocket Sneakoscope out from between Harry's robes. It was spinning very fast in the palm of Ron's hand and glowing brilliantly.  \"Is that a Sneakoscope?\" said Hermione interestedly, standing up for a better look.  \"Yeah... mind you, it's a very cheap one,\" Ron said. \"It went haywire just as I was tying it to Errol's leg to send it to Harry.\"  \"Were you doing anything untrustworthy at the time?\" said Hermione shrewdly.  \"No! Well... I wasn't supposed to be using Errol. You know he's not really up to long journeys... but how else was I supposed to get Harry's present to him?\"  \"Stick it back in the trunk,\" Harry advised as the Sneakoscope whistled piercingly, \"or it'll wake him up.\"  He nodded toward Professor Lupin. Ron stuffed the Sneakoscope into a particularly horrible pair of Uncle Vernon's old socks, which deadened the sound, then closed the lid of the trunk on it.  \"We could get it checked in Hogsmeade,\" said Ron, sitting back down. \"They sell that sort of thing in Dervish and Banges, magical instruments and stuff. Fred and George told me.\"  \"Do you know much about Hogsmeade?\" asked Hermione keenly. \"I've read it's the only entirely non-Muggle settlement in Britain --\"  \"Yeah, I think it is,\" said Ron in an offhand sort of way.  \"But that's not Why I want to go. I just want to get inside Honey Dukes.\"  \"What's that?\" said Hermione.  \"It's this sweetshop,\" said Ron, a dreamy look coming over his face, \"where they've got everything... Pepper Imps -- they make you smoke at the mouth -- and great fat Chocoballs full of strawberry mousse and clotted cream, and really excellent sugar quills, which you can suck in class and just look like you're thinking what to write next --\"  \"But Hogsmeade's a very interesting place, isn't it?\" Hermione pressed on eagerly. \"In Sites of Historical Sorcery it says the inn was the headquarters for the 1612 goblin rebellion, and the Shrieking Shades supposed to be the most severely haunted building in Britain --\"  \"-- and massive sherbert balls that make you levitate a few inches off the ground while you're sucking them,\" said Ron, who was plainly not listening to a word Hermione was saying."
}