{
  "id": "2b33217727845480651b47603f2c2d9d1ba058a9",
  "text": "  The prospect of returning to his cell did not appeal to Jaime. Tyrion could think of something clever now, but all that occurs to me is to go at them with a sword.  For the good part of an hour they played peek-and-seek with the pursuers, sweeping around bends and between small wooded isles. Just when they were starting to hope that somehow they might have left behind the pursuit, the distant sail became visible again. Ser Cleos paused in his stroke.  The Others take them.  He wiped sweat from his brow.   Row!  Brienne said.   That is a river galley coming after us,  Jaime announced after he’d watched for a while. With every stroke, it seemed to grow a little larger.  Nine oars on each side, which means eighteen men. More, if they crowded on fighters as well as rowers. And larger sails than ours. We cannot outrun her.   Ser Cleos froze at his oars.  Eighteen, you said?    Six for each of us. I’d want eight, but these bracelets hinder me somewhat.  Jaime held up his wrists.  Unless the Lady Brienne would be so kind as to unshackle me?   She ignored him, putting all her effort into her stroke.   We had half a night’s start on them,  Jaime said.  They’ve been rowing since dawn, resting two oars at a time. They’ll be exhausted. Just now the sight of our sail has given them a burst of strength, but that will not last. We ought to be able to kill a good many of them.   Ser Cleos gaped.  But… There are eighteen.    At the least. More likely twenty or twenty-five.   His cousin groaned.  We can’t hope to defeat eighteen.    Did I say we could? The best we can hope for is to die with swords in our hands.  He was perfectly sincere. Jaime Lannister had never been afraid of death.  Brienne broke off rowing. Sweat had stuck strands of her flax-colored hair to her forehead, and her grimace made her look homelier than ever.  You are under my protection,  she said, her voice so thick with anger that it was almost a growl.  He had to laugh at such fierceness. She’s the Hound with teats, he thought. Or would be, if she had any teats to speak of.  Then protect me, wench. Or free me to protect myself.   The galley was skimming downriver, a great wooden dragonfly. The water around her was churned white by the furious action of her oars. She was gaining visibly, the men on her deck crowding forward as she came on. Metal glinted in their hands, and Jaime could see bows as well. Archers. He hated archers.  At the prow of the onrushing galley stood a stocky man with a bald head, bushy grey eyebrows, and brawny arms. Over his mail he wore a soiled white surcoat with a weeping willow embroidered in pale green, but his cloak was fastened with a silver trout. Riverrun’s captain of guards. In his day Ser Robin Ryger had been a notably tenacious fighter, but his day was done; he was of an age with Hoster Tully, and had grown old with his lord.  When the boats were fifty yards apart, Jaime cupped his hands around his mouth and shouted back over the water.  Come to wish me godspeed, Ser Robin?    Come to take you back, Kingslayer,  Ser Robin Ryger bellowed.  How is it that you’ve lost your golden hair?    I hope to blind my enemies with the sheen off my head. It’s worked well enough for you.   Ser Robin was unamused. The distance between skiff and galley had shrunk to forty yards.  Throw your oars and your weapons into the river, and no one need be harmed.   Ser Cleos twisted around.  Jaime, tell him we were freed by Lady Catelyn… An exchange of captives, lawful…   Jaime told him, for all the good it did.  Catelyn Stark does not rule in Riverrun,  Ser Robin shouted back. Four archers crowded into position on either side of him, two standing and two kneeling.  Cast your swords into the water.    I have no sword,  he returned,  but if I did, I’d stick it through your belly and hack the balls off those four cravens.   A flight of arrows answered him. One thudded into the mast, two pierced the sail, and the fourth missed Jaime by a foot.  Another of the Red Fork’s broad loops loomed before them. Brienne angled the skiff across the bend. The yard swung as they turned, their sail cracking as it filled with wind. Ahead a large island sat in midstream. The main channel flowed right. To the left a cutoff ran between the island and the high bluffs of the north shore. Brienne moved the tiller and the skiff sheared left, sail rippling. Jaime watched her eyes. Pretty eyes, he thought, and calm. He knew how to read a man’s eyes. He knew what fear looked like. She is determined, not desperate.  Thirty yards behind, the galley was entering the bend.  Ser Cleos, take the tiller,  the wench commanded.  Kingslayer, take an oar and keep us off the rocks.    As my lady commands.  An oar was not a sword, but the blade could break a man’s face if well swung, and the shaft could be used to parry.  Ser Cleos shoved the oar into Jaime’s hand and scrambled aft. They crossed the head of the island and turned sharply down the cutoff, sending a wash of water against the face of the bluff as the boat tilted."
}