{
  "id": "2bda1af3efa2a7625edbdcbfc7d480888d0845c2",
  "text": " There was Harma Dogshead, a squat keg of a woman with cheeks like slabs of white meat, who hated dogs and killed one every fortnight to make a fresh head for her banner; earless Styr, Magnar of Thenn, whose own people thought him more god than lord; Varamyr Sixskins, a small mouse of a man whose steed was a savage white snow bear that stood thirteen feet tall on its hind legs. And wherever the bear and Varamyr went, three wolves and a shadowcat came following. Jon had been in his presence only once, and once had been enough; the mere sight of the man had made him bristle, even as the fur on the back of Ghost’s neck had bristled at the sight of the bear and that long black-and-white ’cat.  And there were folks fiercer even than Varamyr, from the northernmost reaches of the haunted forest, the hidden valleys of the Frostfangs, and even queerer places: the men of the Frozen Shore who rode in chariots made of walrus bones pulled along by packs of savage dogs, the terrible ice-river clans who were said to feast on human flesh, the cave dwellers with their faces dyed blue and purple and green. With his own eyes Jon had beheld the Hornfoot men trotting along in column on bare soles as hard as boiled leather. He had not seen any snarks or grumpkins, but for all he knew Tormund would be having some to supper.  Half the wildling host had lived all their lives without so much as a glimpse of the Wall, Jon judged, and most of those spoke no word of the Common Tongue. It did not matter. Mance Rayder spoke the Old Tongue, even sang in it, fingering his lute and filling the night with strange wild music.  Mance had spent years assembling this vast plodding host, talking to this clan mother and that magnar, winning one village with sweet words and another with a song and a third with the edge of his sword, making peace between Harma Dogshead and the Lord o’ Bones, between the Hornfoots and the Nightrunners, between the walrus men of the Frozen Shore and the cannibal clans of the great ice rivers, hammering a hundred different daggers into one great spear, aimed at the heart of the Seven Kingdoms. He had no crown nor scepter, no robes of silk and velvet, but it was plain to Jon that Mance Rayder was a king in more than name.  Jon had joined the wildlings at Qhorin Halfhand’s command.  Ride with them, eat with them, fight with them,  the ranger had told him, the night before he died.  And watch.  But all his watching had learned him little. The Halfhand had suspected that the wildlings had gone up into the bleak and barren Frostfangs in search of some weapon, some power, some fell sorcery with which to break the Wall… but if they had found any such, no one was boasting of it openly, or showing it to Jon. Nor had Mance Rayder confided any of his plans or strategies. Since that first night, he had hardly seen the man save at a distance.  I will kill him if I must. The prospect gave Jon no joy; there would be no honor in such a killing, and it would mean his own death as well. Yet he could not let the wildlings breach the Wall, to threaten Winterfell and the north, the barrowlands and the Rills, White Harbor and the Stony Shore, even the Neck. For eight thousand years the men of House Stark had lived and died to protect their people against such ravagers; and reavers… and bastard-born or no, the same blood ran in his veins. Bran and Rickon are still at Winterfell besides. Maester Luwin, Ser Rodrik, Old Nan, Farlen the kennelmaster, Mikken at his forge and Gage by his ovens… everyone I ever knew, everyone I ever loved. If Jon must slay a man he half admired and almost liked to save them from the mercies of Rattleshirt and Harma Dogshead and the earless Magnar of Thenn, that was what he meant to do.  Still, he prayed his father’s gods might spare him that bleak task. The host moved but slowly, burdened as it was by all the wildlings’ herds and children and mean little treasures, and the snows had slowed its progress even more. Most of the column was out of the foothills now, oozing down along the west bank of the Milkwater like honey on a cold winter’s morning, following the course of the river into the heart of the haunted forest.  And somewhere close ahead, Jon knew, the Fist of the First Men loomed above the trees, home to three hundred black brothers of the Night’s Watch, armed, mounted, and waiting. The Old Bear had sent out other scouts besides the Halfhand, and surely Jarman Buckwell or Thoren Smallwood would have returned by now with word of what was coming down out of the mountains.  Mormont will not run, Jon thought. He is too old and he has come too far. He will strike, and damn the numbers. One day soon he would hear the sound of warhorns, and see a column of riders pounding down on them with black cloaks flapping and cold steel in their hands. Three hundred men could not hope to kill a hundred times their number, of course, but Jon did not think they would need to. He need not slay a thousand, only one. Mance is all that keeps them together."
}