{
  "id": "2d611a760062ba6ea83cac809ad264a44394c0c1",
  "text": ".. It wasn't the Grim at all ... it was a cat.... Harry clutched the window ledge in relief as he recognized the bottlebrush tail. It was only Crookshanks....  Or was it only Crookshanks? Harry squinted, pressing his nose flat against the glass. Crookshanks seemed to have come to a halt. Harry was sure he could see something else moving in the shadow of the trees too.  And just then, it emerged -- a gigantic, shaggy black dog, moving stealthily across the lawn, Crookshanks trotting at its side. Harry stared. What did this mean? If Crookshanks could see the dog as well, how could it be an omen of Harry's death?  \"Ron!\" Harry hissed. \"Ron! Wake up!\"  \"Huh?\"  I need you to tell me if you can see something!\"  \"S'all dark, Harry,\" Ron muttered thickly. \"What're you or, about?\"  \"Down here --\"  Harry looked quickly back out of the window.  Crookshanks and the dog had vanished. Harry climbed onto the windowsill to look right down into the shadows of the castle, but they weren't there. Where had they gone?  A loud snore told him Ron had fallen asleep again.  Harry and the rest of the Gryffindor team entered the Great Hall the next day to enormous applause. Harry couldn't help grinning broadly as he saw that both the Ravenclaw and Hufflepuff tables were applauding them too. The Slytherin table hissed loudly as they passed. Harry noticed that Malfoy looked even paler than usual.  Wood spent the whole of breakfast urging his team to eat, while touching nothing himself Then he hurried them off to the field before anyone else had finished, so they could get an idea of the conditions. As they left the Great Hall, everyone applauded again.  \"Good luck, Harry!\" called Cho. Harry felt himself blushing.  \"Okay -- no wind to speak of -- sun's a bit bright, that could impair your vision, watch out for it -- ground's fairly hard, good, that'll give us a fast kickoff --\"  Wood paced the field, staring around with the team behind him. Finally, they saw the front doors of the castle open in the distance and the rest of the school spilling onto the lawn.  \"Locker rooms,\" said Wood tersely.  None of them spoke as they changed into their scarlet robes. Harry wondered if they were feeling like he was: as though he'd eaten something extremely wriggly for breakfast. In what seemed like no time at all, Wood was saying, \"Okay, it's time, let's go --\"  They walked out onto the field to a tidal wave of noise. Threequarters of the crowd was wearing scarlet rosettes, waving scarlet flags with the Gryffindor lion upon them, or brandishing banners with slogans like \"GO GRYFFINDOR!\" and \"LIONS FOR THE CUK' Behind the Slytherin goal posts, however, two hundred people were wearing green; the silver serpent of Slytherin glittered on their flags, and Professor Snape sat in the very front row, wearing green like everyone else, and a very grim smile.  \"And here are the Gryffindors!\" yelled Lee Jordan, who was acting as commentator as usual. \"Potter, Bell, Johnson, Spinnet, Weasley, Weasley, and Wood. Widely acknowledged as the best team Hogwarts has seen in a good few years --\"  Lee's comments were drowned by a tide of \"boos\" from the Slytherin end.  \"And here come the Slytherin team, led by Captain Flint. He's Made some changes in the lineup and seems to be going for size rather than skill --\"  More boos from the Slytherin crowd. Harry, however, thought Lee had a point. Malfoy was easily the smallest person On the Slytherin team; the rest of them were enormous.  \"Captains, shake hands!\" said Madam Hooch.  Flint and Wood approached each other and grasped each other's hand very tightly; it looked as though each was trying to break the other's fingers.  \"Mount your brooms!\" said Madam Hooch. \"Three... two... one...\"  The sound of her whistle was lost in the roar from the crowd as fourteen brooms rose into the air. Harry felt his hair fly back off his forehead; his nerves left him in the thrill of the flight; he glanced around, saw Malfoy on his tail, and sped off in search of the Snitch.  \"And it's Gryffindor in possession, Alicia Spinner of Gryffindor with the Quaffle, heading straight for the Slytherin goal posts, looking good, Alicia! Argh, no -- Quaffle intercepted by Warrington, Warrington of Slytherin tearing UP the field -- WHAM! -- nice Bludger work there by George Weasley, Warrington drops the Quaffle, it's caught by -- Johnson, Gryffindor back in possession, come on, Angelina -- nice swerve around Montague -- duck, Angelina, that's a Bludger!- SHE SCORES! TEN-ZERO TO GRYFFINDOR!\"  Angelina punched the air as she soared around the end of the field; the sea of scarlet below was screaming its delight  \"OUCH!\"  Angelina was nearly thrown from her broom as Marcus Flint went smashing into her.  \"Sorry!\" said Flint as the crowd below booed. \"Sorry, didn't see her!\"  A moment later, Fred Weasley chucked his Beater's club at the back of Flint's head. Flint's nose smashed into the handle of his broom and began to bleed.  \"That will do!\" shrieked Madam Hooch, zooming between then."
}