{
  "id": "31b36799ffa55256fca8ce9aef058c3d640321fb",
  "text": " It was often said (in other families) that  long  ago  one  of  the  Took  ancestors  must  have  taken  a  fairy  wife.  That  was,  of  course,  absurd,  but  certainly  there  was  still  something  not  entirely  hobbit-like  about  them,  -  and  once  in  a while members  of  the  Took-clan would go and have  adventures. They discreetly disappeared, and  the  family hushed  it up; but  the  fact  remained  that  the  Tooks  were  not  as  respectable  as  the  Bagginses,  though  they  were undoubtedly richer. Not that Belladonna Took ever had any adventures after  she  became  Mrs.  Bungo  Baggins.  Bungo,  that  was  Bilbo's  father,  built  the  most  luxurious  hobbit-hole  for  her  (and  partly  with  her  money)  that  was  to  be  found  either  under  The  Hill  or  over  The  Hill  or  across  The  Water,  and  there  they  remained  to  the  end  of  their  days.  Still  it  is  probable  that  Bilbo,  her  only  son,  although  he  looked  and  behaved  exactly  like  a  second  edition  of  his  solid  and  comfortable  father,  got  something  a  bit  queer  in  his makeup  from  the Took  side,  something  that  only  waited  for  a  chance  to  come  out.  The  chance  never  arrived,  until Bilbo Baggins was grown up, being about fifty years old or so, and living in  the  beautiful  hobbit-hole  built  by  his  father,  which  I  have  just described  for you,  until he had in fact apparently settled down immovably.   By some curious chance one morning long ago in the quiet of the world, when  there  was  less  noise  and  more  green,  and  the  hobbits  were  still  numerous  and  prosperous,  and  Bilbo  Baggins  was  standing  at  his  door  after  breakfast  smoking  an  enormous  long  wooden  pipe  that  reached  nearly  down  to  his  woolly  toes  (neatly brushed)  - Gandalf  came  by. Gandalf!  If  you  had  heard  only  a  quarter  of  what  I  have  heard  about  him,  and  I  have  only  heard  very  little  of  all  there  is  to  hear,  you  would  be  prepared  for  any  sort  I  of  remarkable  tale.  Tales  and  adventures  sprouted  up  all  over  the  place  wherever  he  went,  in  the  most  extraordinary  fashion.  He  had  not  been  down  that  way  under  The  Hill  for  ages  and  ages,  not  since  his  friend  the  Old  Took  died,  in  fact,  and  the  hobbits  had  almost forgotten what he looked like. He had been away over The Hill and across  The  Water  on  business  of  his  own  since  they  were  all  small  hobbit-boys  and  hobbit-girls.   ####-All that the unsuspecting Bilbo saw that morning was an old man with a staff.  He had a tall pointed blue hat, a long grey cloak, a silver scarf over which a white  beard hung down below his waist, and immense black boots.  \"Good  morning!\"  said  Bilbo,  and  he  meant  it.  The  sun  was  shining,  and  the  grass was very green. But Gandalf looked at him from under long bushy eyebrows  that  stuck  out  further  than  the  brim  of  his  shady  hat.  \"What  do  you  mean?\"  be  said. \"Do you wish me a good morning, or mean that it is a good morning whether  I  want  not;  or  that  you  feel  good  this  morning;  or  that  it  is  morning  to  be  good  on?\"  \"All  of  them  at  once,\"  said  Bilbo.  \"And  a  very  fine  morning  for  a  pipe  of  tobacco out of doors, into the bargain. If you have a pipe about you, sit down  and  have  a  fill of mine! There's no hurry, we have  all  the day before us!\" Then Bilbo  sat down on a seat by his door, crossed his legs, and blew out a beautiful grey ring  of  smoke  that  sailed  up  into  the  air without  breaking  and  floated  away  over  The  Hill.  \"Very  pretty!\"  said  Gandalf.  \"But  I  have  no  time  to  blow  smoke-rings  this  morning.  I  am  looking  for  someone  to  share  in  an  adventure  that  I  am  arranging,  and it's very difficult to find anyone.\"  «I should think so  - in these parts! We are plain quiet folk and have no use for  adventures.  Nasty  .disturbing  uncomfortable  things! Make  you  late  for  dinner!  I  can’t  think  what  anybody  sees  in  them,»  said  our  Mr.  Baggins,  and  stuck  one  thumb  behind  his  braces,  and  blew  out  another  even  bigger  smoke-ring. Then he  took out his morning  letters, and begin  to  read, pretending  to  take no more notice  of  the old man. He had decided  that he was not quite his  sort,  and wanted him  to  go away. But  the old man did not move. He stood  leaning on his stick and gazing  at the hobbit without saying anything, till Bilbo got quite uncomfortable and even  a little cross.  \"Good  morning!\"  he  said  at  last.  \"We  don't  want  any  adventures  here,  thank  you! You might try over The Hill or across The Water.\" By this he meant that the  conversation was at an end.  \"What a lot of things you do use Good morning for!\" said Gandalf. \"Now you  mean that you want to get rid of me, and that it won't be good till I move off.\"  \"Not  at  all,  not  at  all,  my  dear  sir!  Let  me  see,  I  don't  think  I  know  your  name?\"  \"Yes,  yes,  my  dear  sir  -  and  I  do  know  your  name, Mr."
}