{
  "id": "32b1786609be18c6f7734188cbe43799730e5c5b",
  "text": " As the train doors opened, there was a rumble of thunder overhead. Hermione bundled up Crookshanks in her cloak and Ron left his dress robes over Pigwidgeon as they left the train, heads bent and eyes narrowed against the downpour. The rain was now coming down so thick and fast that it was as though buckets of ice-cold water were being emptied repeatedly over their heads. \"Hi, Hagrid!\"  Harry yelled, seeing a gigantic silhouette at the far end of the platform. \"All righ', Harry?\"  Hagrid bellowed back, waving. \"See yeh at the feast if we don' drown!\" First years traditionally reached Hogwarts Castle by sailing across the lake with Hagrid. \"Oooh, I wouldn't fancy crossing the lake in this weather,\" said Hermione fervently, shivering as they inched slowly along the dark platform with the rest of the crowd. A hundred horseless carriages stood waiting for them outside the station.  Harry, Ron, Hermione, and Neville climbed gratefully into one of them, the door shut with a snap, and a few moments later, with a great lurch, the long procession of carriages was rumbling and splashing its way up the track toward Hogwarts Castle.  CHAPTER TWELVE - THE TRIWIZARD TOURNAMENT    Through the gates, flanked with statues of winged boars, and up the sweeping drive the carriages trundled, swaying dangerously in what was fast becoming a gale. Leaning against the window, Harry could see Hogwarts coming nearer, its many lighted windows blurred and shimmering behind the thick curtain of rain. Lightning flashed across the sky as their carriage came to a halt before the great oak front doors, which stood at the top of a flight of stone steps. People who had occupied the carriages in front were already hurrying up the stone steps into the castle. Harry, Ron, Hermione, and Neville jumped down from their carriage and dashed up the steps too, looking up only when they were safely inside the cavernous, torch-lit entrance hall, with its magnificent marble staircase.   \"Blimey,\" said Ron, shaking his head and sending water everywhere, \"if that keeps up the lake's going to overflow. I'm soak - ARRGH!\"  A large, red, water-filled balloon had dropped from out of the ceiling onto Ron's head and exploded.  Drenched and sputtering, Ron staggered sideways into Harry, just as a second water bomb dropped - narrowly missing Hermione, it burst at Harry's feet, sending a wave of cold water over his sneakers into his socks.  People all around them shrieked and started pushing one another in their efforts to get out of the line of fire.  Harry looked up and saw, floating twenty feet above them, Peeves the Poltergeist, a little man in a bell-covered hat and orange bow tie, his wide, malicious face contorted with concentration as he took aim again. \"PEEVES!\"  yelled an angry voice. \"Peeves, come down here at ONCE!\" Professor McGonagall, Deputy Headmistress and head of Gryffindor House, had come dashing out of the Great Hall; she skidded on the wet floor and grabbed Hermione around the neck to stop herself from falling. \"Ouch - sorry, Miss Granger -\" \"That's all right, Professor!\"  Hermione gasped, massaging her throat. \"Peeves, get down here NOW!\" barked Professor McGonagall, straightening her pointed hat and glaring upward through her square-rimmed spectacles. \"Not doing nothing!\"  cackled Peeves, lobbing a water bomb at several fifth-year girls, who screamed and dived into the Great Hall.  \"Already wet, aren't they?  Little squirts!  Wheeeeeeeeee!\"  And he aimed another bomb at a group of second years who had just arrived. \"I shall call the headmaster!\" shouted Professor McGonagall.  \"I'm warning you, Peeves -\" Peeves stuck out his tongue, threw the last of his water bombs into the air, and zoomed off up the marble staircase, cackling insanely. \"Well, move along, then!\"  said Professor McGonagall sharply to the bedraggled crowd.  \"Into the Great Hall, come on!\" Harry, Ron, and Hermione slipped and slid across the entrance hall and through the double doors on the right, Ron muttering furiously under his breath as he pushed his sopping hair off his face. The Great Hall looked its usual splendid self, decorated for the start-of-term feast. Golden plates and goblets gleamed by the light of hundreds and hundreds of candles, floating over the tables in midair.  The four long House tables were packed with chattering students; at the top of the Hall, the staff sat along one side of a fifth table, facing their pupils.  It was much warmer in here.  Harry, Ron, and Hermione walked past the Slytherins, the Ravenclaws, and the Hufflepuffs, and sat down with the rest of the Gryffindors at the far side of the Hall, next to Nearly Headless Nick, the Gryffindor ghost.  Pearly white and semitransparent, Nick was dressed tonight in his usual doublet, but with a particularly large ruff, which served the dual purpose of looking extra-festive, and insuring that his head didn't wobble too much on his partially severed neck. \"Good evening,\" he said, beaming at them. \"Says who?\"  said Harry, taking off his sneakers and emptying them of water."
}