{
  "id": "335fa4696ba329a892402ace1da2428b2c998857",
  "text": " \"Excellent! I haven't seen one that convincing in years!  I'd pay five Galleons for that!\" Percy froze in an attitude of stunned disapproval. \"Boys,\" said Mr. Weasley under his breath, \"I don't want you betting.... That's all your savings .... Your mother -\" \"Don't be a spoilsport, Arthur!\"  boomed Ludo Bagman, rattling his pockets excitedly. \"They're old enough to know what they want!  You reckon Ireland will win but Krum'll get the Snitch?  Not a chance, boys, not a chance.... I'll give you excellent odds on that one .... We'll add five Galleons for the funny wand, then, shall we....\" Mr. Weasley looked on helplessly as Ludo Bagman whipped out a notebook and quill and began jotting down the twins' names. \"Cheers,\" said George, taking the slip of parchment Bagman handed him and tucking it away into the front of his robes.  Bagman turned most cheerfully back to Mr. Weasley. \"Couldn't do me a brew, I suppose?  I'm keeping an eye out for Barty Crouch.  My Bulgarian opposite number's making difficulties, and I can't understand a word he's saying. Barty'll be able to sort it out.  He speaks about a hundred and fifty languages.\" \"Mr. Crouch?\" said Percy, suddenly abandoning his look of poker-stiff disapproval and positively writhing with excitement.  \"He speaks over two hundred!  Mermish and Gobbledegook and Troll. . .\" \"Anyone can speak Troll,\" said Fred dismissively.  \"All you have to do is point and grunt.\" Percy threw Fred an extremely nasty look and stoked the fire vigorously to bring the kettle back to the boil. \"Any news of Bertha Jorkins yet, Ludo?\"  Mr. Weasley asked as Bagman settled himself down on the grass beside them all. \"Not a dicky bird,\" said Bagman comfortably.  \"But she'll turn up.  Poor old Bertha ... memory like a leaky cauldron and no sense of direction.  Lost, you take my word for it.  She'll wander back into the office sometime in October, thinking it's still July.\" \"You don't think it might be time to send someone to look for her?\"  Mr. Weasley suggested tentatively as Percy handed Bagman his tea. \"Barty Crouch keeps saying that,\" said Bagman, his round eyes widening innocently, \"but we really can't spare anyone at the moment.  Oh - talk of the devil!  Barty!\" A wizard had just Apparated at their fireside, and he could not have made more of a contrast with Ludo Bagman, sprawled on the grass in his old Wasp robes.  Barty Crouch was a stiff, upright, elderly man, dressed in an impeccably crisp suit and tie.  The parting in his short gray hair was almost unnaturally straight, and his narrow toothbrush mustache looked as though he trimmed it using a slide rule.  His shoes were very highly polished.  Harry could see at once why Percy idolized him.  Percy was a great believer in rigidly following rules, and Mr. Crouch had complied with the rule about Muggle dressing so thoroughly that he could have passed for a bank manager; Harry doubted even Uncle Vernon would have spotted him for what he really was. \"Pull up a bit of grass, Barry,\" said Ludo brightly, patting the ground beside him. \"No thank you, Ludo,\" said Crouch, and there was a bite of impatience in his voice. \"I've been looking for you everywhere.  The Bulgarians are insisting we add another twelve seats to the Top Box.\" \"Oh is that what they're after?\"  said Bagman.  I thought the chap was asking to borrow a pair of tweezers.  Bit of a strong accent.\" \"Mr. Crouch!\"  said Percy breathlessly, sunk into a kind of halfbow that made him look like a hunchback.  \"Would you like a cup of tea?\" \"Oh,\" said Mr. Crouch, looking over at Percy in mild surprise.  \"Yes - thank you, Weatherby.\" Fred and George choked into their own cups. Percy, very pink around the ears, busied himself with the kettle. \"Oh and I've been wanting a word with you too, Arthur,\" said Mr. Crouch, his sharp eyes falling upon Mr. Weasley.  \"Ali Bashir's on the warpath.  He wants a word with you about your embargo on flying carpets.\" Mr. Weasley heaved a deep sigh. \"I sent him an owl about that just last week.  If I've told him once I've told him a hundred times:  Carpets are defined as a Muggle Artifact by the Registry of Proscribed Charmable Objects, but will he listen?\" \"I doubt it,\" said Mr. Crouch, accepting a cup from Percy.  \"He's desperate to export here.\" \"Well, they'll never replace brooms in Britain, will they?\"  said Bagman. \"Ali thinks there's a niche in the market for a family vehicle, said Mr. Crouch.  \"I remember my grandfather had an Axminster that could seat twelve - but that was before carpets were banned, of course.\" He spoke as though he wanted to leave nobody in any doubt that all his ancestors had abided strictly by the law. \"So, been keeping busy, Barty?\"  said Bagman breezily. \"Fairly,\" said Mr. Crouch dryly.  \"Organizing Portkeys across five continents is no mean feat, Ludo.\" \"I expect you'll both be glad when this is over?\"  said Mr. Weasley. Ludo Bagman looked shocked. \"Glad!  Don't know when I've had more fun.... Still, it's not as though we haven't got anything to took forward to, eh, Barty?  Eh?  Plenty left to organize, eh?\" Mr."
}