{
  "id": "33c896c60fc535938c49b35a8251c424f8a93506",
  "text": " . . . One in the morning. . . two in the morning . . . the only way he could keep going was to tell himself, over and over again, next book. . . in the next one. . . the next one. . .  The mermaid in the painting in the prefects' bathroom was laughing.  Harry was bobbing like a cork in bubbly water next to her rock, while she held his Firebolt over his head. \"Come and get it!\" she giggled maliciously. \"Come on, jump!\" \"I can't,\" Harry panted, snatching at the Firebolt, and struggling not to sink.  \"Give it to me!\" But she just poked him painfully in the side with the end of the broomstick, laughing at him. \"That hurts - get off- ouch -\" \"Harry Potter must wake up, sir!\" \"Stop poking me -\" \"Dobby must poke Harry Potter, sir, he must wake up!\" Harry opened his eyes.  He was still in the library; the Invisibility Cloak had slipped off his head as he'd slept, and the side of his face was stuck to the pages of Where There's a Wand, There's a Way.  He sat up, straightening his glasses, blinking in the bright daylight. \"Harry Potter needs to hurry!\"  squeaked Dobby.  \"The second task starts in ten minutes, and Harry Potter -\" \"Ten minutes?\" Harry croaked. \"Ten - ten minutes?\" He looked down at his watch.  Dobby was right.  It was twenty past nine.  A large, dead weight seemed to fall through Harry's chest into his stomach. \"Hurry, Harry Potter!\" squeaked Dobby, plucking at Harry's sleeve.  \"You is supposed to be down by the lake with the other champions, sir!\" \"It's too late, Dobby,\" Harry said hopelessly.  \"I'm not doing the task, I don't know how-\" \"Harry Potter will do the task!\"  squeaked the elf.  \"Dobby knew Harry had not found the right book, so Dobby did it for him!\" \"What?\"  said Harry. \"But you don't know what the second task is -\" \"Dobby knows, sir!  Harry Potter has to go into the lake and find his Wheezy -\" \"Find my what?\" \"- and take his Wheezy back from the merpeople!\" \"What's a Wheezy?\" \"Your Wheezy, sir, your Wheezy-Wheezy who is giving Dobby his sweater!\" Dobby plucked at the shrunken maroon sweater he was now wearing over his shorts. \"What?\" Harry gasped. \"They've got. . . they've got Ron?\" \"The thing Harry Potter will miss most, sir!\" squeaked Dobby.  \"'But past an hour-'\" \"- 'the prospect's black,'\" Harry recited, staring, horror-struck, at the elf. \" 'Too late, it's gone, it won't come back.'  Dobby - what've I got to do?\" \"You has to eat this, sir!\" s queaked the elf, and he put his hand in the pocket of his shorts and drew out a ball of what looked like slimy, grayish-green rat tails.  \"Right before you go into the lake, sir - gillyweed!\" \"What's it do?\" said Harry, staring at the gillyweed. \"It will make Harry Potter breathe underwater, sir!\" \"Dobby,\" said Harry frantically, \"listen - are you sure about this?\" He couldn't quite forget that the last time Dobby had tried to \"help\" him, he had ended up with no bones in his right arm. \"Dobby is quite sure, sir!\"  said the elf earnestly.  \"Dobby hears things, sir, he is a house-elf, he goes all over the castle as he lights the fires and mops the floors.  Dobby heard Professor McGonagall and Professor Moody in the staffroom, talking about the next task. . . . Dobby cannot let Harry Potter lose his Wheezy!\" Harrys doubts vanished.  Jumping to his feet he pulled off the Invisibility Cloak, stuffed it into his bag, grabbed the gillyweed, and put it into his pocket, then tore out of the library with Dobby at his heels. \"Dobby is supposed to be in the kitchens, sir!\"  Dobby squealed as they burst into the corridor.  \"Dobby will be missed - good luck, Harry Potter, sir, good luck!\" \"See you later, Dobby!\"  Harry shouted, and he sprinted along the corridor and down the stairs, three at a time. The entrance hall contained a few last-minute stragglers, all leaving the Great Hall after breakfast and heading through the double oak doors to watch the second task.  They stared as Harry flashed past, sending Colin and Dennis Creevey flying as he leapt down the stone steps and out onto the bright, chilly grounds. As he pounded down the lawn he saw that the seats that had encircled the dragons' enclosure in November were now ranged along the opposite bank, rising in stands that were packed to the bursting point and reflected in the lake below.  The excited babble of the crowd echoed strangely across the water as Harry ran flat-out around the other side of the lake toward the judges, who were sitting at another gold-draped table at the water's edge.  Cedric, Fleur, and Krum were beside the judges' table, watching Harry sprint toward them. \"I'm . .. here ...\" Harry panted, skidding to a halt in the mud and accidentally splattering Fleurs robes. \"Where have you been?\" said a bossy, disapproving voice.  \"The task's about to start!\" Harry looked around. Percy Weasley was sitting at the judges' table - Mr. Crouch had failed to turn up again. \"Now, now, Percy!\"  said Ludo Bagman, who was looking intensely relieved to see Harry.  \"Let him catch his breath!\" Dumbledore smiled at Harry, but Karkaroff and Madame Maxime didn't look at all pleased to see him."
}