{
  "id": "33f63f751d8e35003e169db2fad1fbfa89fa2eac",
  "text": " She sent Missandei to find a certain Yunkish freedman renowned for his skill in the healing arts. Belwas howled and complained, but Dany scolded him and called him a big bald baby until he let the healer stanch the wound with vinegar, sew it shut, and bind his chest with strips of linen soaked in fire wine. Only then did she lead her captains and commanders inside her pavilion for their council.   I must have this city,  she told them, sitting crosslegged on a pile of cushions, her dragons all about her. Irri and Jhiqui poured wine.  Her granaries are full to bursting. There are figs and dates and olives growing on the terraces of her pyramids, and casks of salt fish and smoked meat buried in her cellars.    And fat chests of gold, silver, and gemstones as well,  Daario reminded them.  Let us not forget the gemstones.    I’ve had a look at the landward walls, and I see no point of weakness,  said Ser Jorah Mormont.  Given time, we might be able to mine beneath a tower and make a breach, but what do we eat while we’re digging? Our stores are all but exhausted.    No weakness in the landward walls?  said Dany. Meereen stood on a jut of sand and stone where the slow brown Skahazadhan flowed into Slaver’s Bay. The city’s north wall ran along the riverbank, its west along the bay shore.  Does that mean we might attack from the river or the sea?     With three ships? We’ll want to have Captain Groleo take a good look at the wall along the river, but unless it’s crumbling that’s just a wetter way to die.    What if we were to build siege towers? My brother Viserys told tales of such, I know they can be made.    From wood, Your Grace,  Ser Jorah said.  The slavers have burnt every tree within twenty leagues of here. Without wood, we have no trebuchets to smash the walls, no ladders to go over them, no siege towers, no turtles, and no rams. We can storm the gates with axes, to be sure, but…    Did you see them bronze heads above the gates?  asked Brown Ben Plumm.  Rows of harpy heads with open mouths? The Meereenese can squirt boiling oil out them mouths, and cook your axemen where they stand.   Daario Naharis gave Grey Worm a smile.  Perhaps the Unsullied should wield the axes. Boiling oil feels like no more than a warm bath to you, I have heard.    This is false.  Grey Worm did not return the smile.  These ones do not feel burns as men do, yet such oil blinds and kills. The Unsullied do not fear to die, though. Give these ones rams, and we will batter down these gates or die in the attempt.    You would die,  said Brown Ben. At Yunkai, when he took command of the Second Sons, he claimed to be the veteran of a hundred battles.  Though I will not say I fought bravely in all of them. There are old sellswords and bold sellswords, but no old bold sellswords.  She saw that it was true.  Dany sighed.  I will not throw away Unsullied lives, Grey Worm. Perhaps we can starve the city out.   Ser Jorah looked unhappy.  We’ll starve long before they do, Your Grace. There’s no food here, nor fodder for our mules and horses. I do not like this river water either. Meereen shits into the Skahazadhan but draws its drinking water from deep wells. Already we’ve had reports of sickness in the camps, fever and brownleg and three cases of the bloody flux. There will be more if we remain. The slaves are weak from the march.    Freedmen,  Dany corrected.  They are slaves no longer.    Slave or free, they are hungry and they’ll soon be sick. The city is better provisioned than we are, and can be resupplied by water. Your three ships are not enough to deny them access to both the river and the sea.    Then what do you advise, Ser Jorah?    You will not like it.    I would hear it all the same.    As you wish. I say, let this city be. You cannot free every slave in the world, Khaleesi. Your war is in Westeros.    I have not forgotten Westeros.  Dany dreamt of it some nights, this fabled land that she had never seen.  If I let Meereen’s old brick walls defeat me so easily, though, how will I ever take the great stone castles of Westeros?    As Aegon did,  Ser Jorah said,  with fire. By the time we reach the Seven Kingdoms, your dragons will be grown. And we will have siege towers and trebuchets as well, all the things we lack here… but the way across the Lands of the Long Summer is long and grueling, and there are dangers we cannot know. You stopped at Astapor to buy an army, not to start a war. Save your spears and swords for the Seven Kingdoms, my queen. Leave Meereen to the Meereenese and march west for Pentos.    Defeated?  said Dany, bristling.   When cowards hide behind great walls, it is they who are defeated, Khaleesi,  Ko Jhogo said.  Her other bloodriders concurred.  Blood of my blood,  said Rakharo,  when cowards hide and burn the food and fodder, great khals must seek for braver foes. This is known.    It is known,  Jhiqui agreed, as she poured.   Not to me.  Dany set great store by Ser Jorah’s counsel, but to leave Meereen untouched was more than she could stomach."
}