{
  "id": "376db0c7a834e64603dc059c68345aaba88f2597",
  "text": "  That  would  have  been  the  time  for  Bilbo  to  have  left. But his poor  little  feet had been very  squashed  in Bert's big paw,  and he had  no  breath  in  his  body,  and  his  head was  going  round;  so  there  he  lay  for  a while  panting, just outside the circle of firelight.  Right  in  the middle of  the  fight up  came Balin. The dwarves had heard noises  from  a  distance,  and  after  wait-ing  for  some  time  for  Bilbo  to  come  back,  or  to  hoot  like  an  owl,  they  started  off  one  by  one  to  creep  towards  the  light  as  quietly  as  they  could.  No  sooner  did  Tom  see  Balin  come  into  the  light  than he gave an   ####-awful  howl.  Trolls  simply  detest  the  very  sight  of  dwarves  (uncooked).  Bert  and  Bill  stopped  fighting  immediately,  and  \"a  sack,  Tom,  quick!\"  they  said,  before  Balin,  who  was  wondering  where  in  all  this  commotion  Bilbo  was,  knew  what  was happening, a sack was over his head, and he was down.  \"There's more  to come yet,\" said Tom, \"or I'm mighty mistook. Lots and none  at  all,  it  is,\"  said  he.  \"No  burra-  hobbits,  but  lots  of  these  here  dwarves.  That's  about the shape of it!\"  \"I reckon you 're right,\" said Bert, \"and we'd best get out of the light.\"  And  so  they  did.  With  sacks  in  their  hands,  that  they  used  for  carrying  off  mutton and other plunder, they waited in the shadows. As each dwarf came up and  looked  at  the  fire,  and  the  spilled  jugs,  and  the  gnawed mutton,  in  surprise,  pop!  went  a  nasty  smelly  sack  over  his  head,  and  he  was  down.  Soon  Dwalin  lay  by  Balin, and Fili and Kili together, and Dori and Nori and Ori all in a heap, and Oin  and Gloin and Bifur and Bofur and Bombur piled uncomfortably near the fire.  \"That'll teach 'em,\" said Tom; for Bifur and Bombur had given a lot of trouble,  and fought like mad, as dwarves will when cornered.  Thorin  came  last-and  he  was  not  caught  unawares.  He  came  expecting  mischief,  and  didn't  need  to  see  his  friends'  legs  sticking  out  of  sacks  to  tell  him  that  things were  not  all well. He  stood  outside  in  the  shadows  some way  off,  and  said: \"What's all this trouble? Who has been knocking my people about?\"  \"It's  trolls!\"  said  Bilbo  from  behind  a  tree.  They  had  forgotten  all  about him.  \"They're hiding in the bushes with sacks,\" said he.  \"O!  are  they?\"  said  Thorin,  and  he  jumped  forward  to  the  fire,  before  they  could  leap on him. He caught up a big branch all on fire at one end; and Bert got  that  end  in  his  eye before he could step aside. That put him out of  the battle  for a  bit.  Bilbo  did  his  best.  He  caught  hold  of  Tom's  leg-as  well  as  he  could,  it  was  thick  as  a  young  tree-trunk  -but  he  was  sent  spinning  up  into  the  top  of  some  bushes, when Tom kicked the sparks up in Thorin's face.  Tom got the branch in his teeth for that, and lost one of the front ones. It made  him  howl,  I  can  tell  you.  But  just  at  that  moment  William  came  up  behind  and  popped  a  sack  right  over  Thorin's  head  and  down  to  his  toes.  And  so  the  fight  ended. A  nice  pickle  they were  all  in  now:  all  neatly  tied  up  in  sacks, with  three  angry trolls (and two with burns and bashes to remember) sitting by them, arguing  whether  they  should  roast  them  slowly,  or mince  them  fine  and  boil  them,  or  just  sit on them one by one and squash them into jelly: and Bilbo up in a bush, with his  clothes and his skin torn, not daring to move for fear they should hear him.     ####-It was  just  then  that Gandalf  came  back. But  no  one  saw  him. The  trolls  had  just  decided  to  roast  the dwarves now and eat  them  later-that was Bert's idea, and  after a lot of argument they had all agreed to it.  \"No  good  roasting  'em  now,  it’d  take  all  night,\"  said  a  voice.  Bert  thought  it  was William's.  \"Don't  start  the  argument  all  over-again.  Bill,\"  he  said,  \"or  it  will  take  all  night.\"  \"Who's a-arguing?\" said William, who thought it was. Bert that had spoken.  \"You are,\" said Bert.  \"You're  a  liar,\"  said William;  and  so  the  argument  beg  all  over  again.  In  the  end  they  decided  to  mince  them  fine  and  boil  them. So  they got  a black pot,  and  they took out their knives.  \"No  good  boiling  'em! We  ain't  got  no  water,  and  it's  a  long  way  to  the  well  and all,\" said a voice. Bert and William thought it was Tom's.  \"Shut  up!\"  said  they,  \"or  we'll  never  have  done.  And  yer  can  fetch  the water  yerself, if yer say any more.\"  \"Shut  up  yerself!\"  said  Tom,  who  thought  it  was  William's  voice.  \"Who's  arguing but you. I'd like to know.\"  \"You're a booby,\" said William.  \"Booby yerself!\" said Tom.  And  so  the  argument  began  all  over again, and went on hotter than ever, until  at last they decided to sit on the sacks one by one and squash them, and boil them  next time."
}