{
  "id": "37d91bf908f35d59aa08a8bff3ef43bf04b80c6f",
  "text": " Buckbeak the hippogriff was lying in the corner, chomping on something that was oozing blood all over the floor.  \"I couldn' leave him tied up out there in the snow!\" choked Hagrid. \"All on his own! At Christmas.\"  Harry, Ron, and Hermione looked at one another. They had never seen eye to eye with Hagrid about what he called \"interesting creatures\" and other people called \"terrifying monsters.\" Or' the other hand, there didn't seem to be any particular harm in Buckbeak. In fact, by Hagrid's usual standards, he was positively cute.  \"You'll have to put up a good strong defense, Hagrid,\" said Hermione, sitting down and laying a hand on Hagrid's massive forearm. \"I'm sure you can prove Buckbeak is safe.\"  \"Won't make no diff'rence!\" sobbed Hagrid. \"Them Disposal devils, they're all in Lucius Malfoy's pocket! Scared o' him! Ad if I lose the case, Buckbeak --\"  Hagrid drew his finger swiftly across his throat, then gave a great wail and lurched forward, his face in his arms.  \"What about Dumbledore, Hagrid?\" said Harry.  \"He's done more'n enough fer me already,\" groaned Hagrid. \"Got enough on his plate what with keepin' them dementors outta the castle, an' Sirius Black lurkin' around --\"  Ron and Hermione looked quickly at Harry, as though expecting him to start berating Hagrid for not telling him the truth about Black. But Harry couldn't bring himself to do it, not now that he saw Hagrid so miserable and scared.  \"Listen, Hagrid,\" he said, \"you can't give up. Hermione's right, You just need a good defense. You can call us as witnesses --\"  \"I'm sure I've read about a case of hippogriff-baiting,\" said Hermione thoughtfully, \"where the hippogriff got off I'll look it up for you, Hagrid, and see exactly what happened.\"  Hagrid howled still more loudly. Harry and Hermione looked at Ron to help them.  \"Er -- shall I make a cup of tea?\" said Ron.  Harry stared at him.  \"It's what my mum does whenever someone's upset,\" Ron muttered, shrugging.  At last, after many more assurances of help, with a steaming mug of tea in front of him, Hagrid blew his nose on a handkerchief the size of a tablecloth and said, \"Yer right. I can' afford to go ter pieces. Gotta pull meself together.....  Fang the boarhound came timidly out from under the table and laid his head on Hagrid's knee.  \"I've not bin meself lately,\" said Hagrid, stroking Fang with one hand and mopping his face with the other. \"Worried abou' Buckbeak, an' no one likin' me classes --\"  \"We do like them!\" lied Hermione at once.  \"Yeah, they're great!\" said Ron, crossing his fingers under the table. \"Er -- how are the flobberworms?\"  \"Dead,\" said Hagrid gloomily. \"Too much lettuce.\"  \"Oh no!\" said Ron, his lip twitching.  \"An' them dementors make me feel ruddy terrible an' all,\" said Hagrid, with a sudden shudder. \"Gotta walk past 'em ev'ry time I want a drink in the Three Broomsticks. 'S like bein' back in Azkaban --\"  He fell silent, gulping his tea. Harry, Ron, and Hermione watched him breathlessly. They had never heard Hagrid talk about his brief spell in Azkaban before. After a pause, Hermione said timidly, \"Is it awful in there, Hagrid?\"  \"Yeh've no idea,\" said Hagrid quietly. \"Never bin anywhere like it. Thought I was goin' mad. Kep' goin' over horrible stuff in me mind... the day I got expelled from Hogwarts... day me dad died... day I had ter let Norbert go....\"  His eyes filled with tears. Norbert was the baby dragon Hagrid had once won in a game of cards.  \"Yeh can' really remember who yeh are after a while. An' yeh can' really see the point o' livin' at all. I used ter hope I'd jus' die in me sleep. When they let me out, it was like bein' born again, ev'rythin' I came floodin' back, it was the bes' feelin' in the world. Mind, the dementors weren't keen on lettin' me go.\"  \"But you were innocent!\" said Hermione.  Hagrid snorted.  \"Think that matters to them? They don' care. Long as they've got a couple o' hundred humans stuck there with 'em, so they can leech all the happiness out of 'em, they don' give a damn who's guilty an' who's not.\"  Hagrid went quiet for a moment, staring into his tea. Then he said quietly, \"Thought o' jus' letting Buckbeak go... tryin' ter make him fly away... but how d'yeh explain ter a hippogriff it's gotta go inter hidin'? An' -an' I'm scared o' breakin' the law....\" He looked up at them, tears leaking down his face again. \"I don' ever want ter go back ter Azkaban.\"  The trip to Hagrid's, though far from fun, had nevertheless had the effect Ron and Hermione had hoped. Though Harry had by no means forgotten about Black, he couldn't brood constantly on revenge if he wanted to help Hagrid win his case against the Committee for the Disposal of Dangerous Creatures. He, Ron, and Hermione went to the library the next day and returned to the empty common room laden with books that might help prepare a defense for Buckbeak. The three of them sat in front of the roaring fire, slowly turning the pages of dusty volumes about famous cases If marauding beasts, speaking occasionally when they ran across something relevant."
}