{
  "id": "3b8d54009b139292131839ceef015f7938177fdd",
  "text": "  He turned back to the weirwood and studied the carved face a moment. It is not the face we saw, he admitted to himself. The tree’s not half as big as the one at Whitetree. The red eyes wept blood, and he didn’t remember that either. Clumsily, Sam sank to his knees.  Old gods, hear my prayer. The Seven were my father’s gods but I said my words to you when I joined the Watch. Help us now. I fear we might be lost. We’re hungry too, and so cold. I don’t know what gods I believe in now, but… please, if you’re there, help us. Gilly has a little son.  That was all that he could think to say. The dusk was deepening, the leaves of the weirwood rustling softly, waving like a thousand blood-red hands. Whether Jon’s gods had heard him or not he could not say.  By the time he returned to the longhall, Gilly had the fire going. She sat close to it with her furs opened, the babe at her breast. He’s as hungry as we are, Sam thought. The old women had smuggled out food for them from Craster’s, but they had eaten most of it by now. Sam had been a hopeless hunter even at Horn Hill, where game was plentiful and he had hounds and huntsmen to help him; here in this endless empty forest, the chances of him catching anything were remote. His efforts at fishing the lakes and half-frozen streams had been dismal failures as well.   How much longer, Sam?  Gilly asked.  Is it far, still?    Not so far. Not so far as it was.  Sam shrugged out of his pack, eased himself awkwardly to the floor, and tried to cross his legs. His back ached so abominably from the walking that he would have liked to lean up against one of the carved wooden pillars that supported the roof, but the fire was in the center of the hall beneath the smoke hole and he craved warmth even more than comfort.  Another few days should see us there.   Sam had his maps, but if this wasn’t Whitetree then they weren’t going to be much use. We went too far east to get around that lake, he fretted, or maybe too far west when I tried to double back. He was coming to hate lakes and rivers. Up here there was never a ferry or bridge, which meant walking all the way around the lakes and searching for places to ford the rivers. It was easier to follow a game trail than to struggle through the brush, easier to circle a ridge instead of climbing it. If Bannen or Dywen were with us we’d be at Castle Black by now, warming our feet in the common room. Bannen was dead, though, and Dywen gone with Grenn and Dolorous Edd and the others.  The Wall is three hundred miles long and seven hundred feet high, Sam reminded himself. If they kept going south, they had to find it, sooner or later. And he was certain that they had been going south. By day he took directions from the sun, and on clear nights they could follow the Ice Dragon’s tail, though they hadn’t traveled much by night since the second horse had died. Even when the moon was full it was too dark beneath the trees, and it would have been so easy for Sam or the last garron to break a leg. We have to be well south by now, we have to be.  What he wasn’t so certain of was how far east or west they might have strayed. They would reach the Wall, yes… in a day or a fortnight, it couldn’t be farther than that, surely, surely… but where? It was the gate at Castle Black they needed to find; the only way through the Wall for a hundred leagues.   Is the Wall as big as Craster used to say?  Gilly asked.   Bigger.  Sam tried to sound cheerful.  So big you can’t even see the castles hidden behind it. But they’re there, you’ll see. The Wall is all ice, but the castles are stone and wood. There are tall towers and deep vaults and a huge longhall with a great fire burning in the hearth, day and night. It’s so hot in there, Gilly, you’ll hardly believe it.    Could I stand by the fire? Me and the boy? Not for a long time, just till we’re good and warm?    You can stand by the fire as long as you like. You’ll have food and drink, too. Hot mulled wine and a bowl of venison stewed with onions, and Hobb’s bread right out of the oven, so hot it will burn your fingers.  Sam peeled a glove off to wriggle his own fingers near the flames, and soon regretted it. They had been numb with cold, but as feeling returned they hurt so much he almost cried.  Sometimes one of the brothers will sing,  he said, to take his mind off the pain.  Dareon sang best, but they sent him to Eastwatch. There’s still Halder, though. And Toad. His real name is Todder, but he looks like a toad, so we call him that. He likes to sing, but he has an awful voice.    Do you sing?  Gilly rearranged her furs, and she moved the babe from one breast to the other.  Sam blushed.  I… I know some songs. When I was little I liked to sing. I danced too, but my lord father never liked me to. He said if I wanted to prance around I should do it in the yard with a sword in my hand.    Could you sing some southron song? For the babe?    If you like.  Sam thought for a moment.  There’s a song our septon used to sing to me and my sisters, when we were little and it was time for us to go to sleep."
}