{
  "id": "3bdc79800493292121e8ecd396f779911507eb21",
  "text": " Bran rode with his brothers, well ahead of the main party, his pony struggling hard to keep up with their horses.   The deserter died bravely,  Robb said. He was big and broad and growing every day, with his mother’s coloring, the fair skin, red-brown hair, and blue eyes of the Tullys of Riverrun.  He had courage, at the least.    No,  Jon Snow said quietly.  It was not courage. This one was dead of fear. You could see it in his eyes, Stark.  Jon’s eyes were a grey so dark they seemed almost black, but there was little they did not see. He was of an age with Robb, but they did not look alike. Jon was slender where Robb was muscular, dark where Robb was fair, graceful and quick where his half brother was strong and fast.  Robb was not impressed.  The Others take his eyes,  he swore.  He died well. Race you to the bridge?    Done,  Jon said, kicking his horse forward. Robb cursed and followed, and they galloped off down the trail, Robb laughing and hooting, Jon silent and intent. The hooves of their horses kicked up showers of snow as they went.  Bran did not try to follow. His pony could not keep up. He had seen the ragged man’s eyes, and he was thinking of them now. After a while, the sound of Robb’s laughter receded, and the woods grew silent again.  So deep in thought was he that he never heard the rest of the party until his father moved up to ride beside him.  Are you well, Bran?  he asked, not unkindly.   Yes, Father,  Bran told him. He looked up. Wrapped in his furs and leathers, mounted on his great warhorse, his lord father loomed over him like a giant.  Robb says the man died bravely, but Jon says he was afraid.    What do you think?  his father asked.  Bran thought about it.  Can a man still be brave if he’s afraid?    That is the only time a man can be brave,  his father told him.  Do you understand why I did it?    He was a wildling,  Bran said.  They carry off women and sell them to the Others.   His lord father smiled.  Old Nan has been telling you stories again. In truth, the man was an oathbreaker, a deserter from the Night’s Watch. No man is more dangerous. The deserter knows his life is forfeit if he is taken, so he will not flinch from any crime, no matter how vile. But you mistake me. The question was not why the man had to die, but why I must do it.   Bran had no answer for that.  King Robert has a headsman,  he said, uncertainly.   He does,  his father admitted.  As did the Targaryen kings before him. Yet our way is the older way. The blood of the First Men still flows in the veins of the Starks, and we hold to the belief that the man who passes the sentence should swing the sword. If you would take a man’s life, you owe it to him to look into his eyes and hear his final words. And if you cannot bear to do that, then perhaps the man does not deserve to die.   One day, Bran, you will be Robb’s bannerman, holding a keep of your own for your brother and your king, and justice will fall to you. When that day comes, you must take no pleasure in the task, but neither must you look away. A ruler who hides behind paid executioners soon forgets what death is.   That was when Jon reappeared on the crest of the hill before them. He waved and shouted down at them.  Father, Bran, come quickly, see what Robb has found!  Then he was gone again.  Jory rode up beside them.  Trouble, my lord?    Beyond a doubt,  his lord father said.  Come, let us see what mischief my sons have rooted out now.  He sent his horse into a trot. Jory and Bran and the rest came after.  They found Robb on the riverbank north of the bridge, with Jon still mounted beside him. The late summer snows had been heavy this moonturn. Robb stood knee-deep in white, his hood pulled back so the sun shone in his hair. He was cradling something in his arm, while the boys talked in hushed, excited voices.  The riders picked their way carefully through the drifts, groping for solid footing on the hidden, uneven ground. Jory Cassel and Theon Greyjoy were the first to reach the boys. Greyjoy was laughing and joking as he rode. Bran heard the breath go out of him.  Gods!  he exclaimed, struggling to keep control of his horse as he reached for his sword.  Jory’s sword was already out.  Robb, get away from it!  he called as his horse reared under him.  Robb grinned and looked up from the bundle in his arms.  She can’t hurt you,  he said.  She’s dead, Jory.   Bran was afire with curiosity by then. He would have spurred the pony faster, but his father made them dismount beside the bridge and approach on foot. Bran jumped off and ran.  By then Jon, Jory, and Theon Greyjoy had all dismounted as well.  What in the seven hells is it?  Greyjoy was saying.   A wolf,  Robb told him.   A freak,  Greyjoy said.  Look at the size of it.   Bran’s heart was thumping in his chest as he pushed through a waist-high drift to his brothers’ side.  Half-buried in bloodstained snow, a huge dark shape slumped in death. Ice had formed in its shaggy grey fur, and the faint smell of corruption clung to it like a woman’s perfume."
}