{
  "id": "3fb881ebe4de16f91c336e81d980a31451c1da5f",
  "text": " erm. . \"Lose a treasured possession,\" said Harry, who was flicking through Unfogging the Future for ideas. \"Good one,\" said Ron, copying it down.  \"Because of... erm. . . Mercury.  Why don't you get stabbed in the back by someone you thought was a friend?\" \"Yeah. . . cool. . .\" said Harry, scribbling it down, \"because... Venus is in the twelfth house.\" \"And on Wednesday, I think I'll come off worst in a fight.\" \"Aaah, I was going to have a fight. Okay, I'll lose a bet.\" \"Yeah, you'll be betting I'll win my fight. .. They continued to make up predictions (which grew steadily more tragic) for another hour, while the common room around them slowly emptied as people went up to bed. Crookshanks wandered over to them, leapt lightly into an empty chair, and stared inscrutably at Harry, rather as Hermione might look if she knew they weren't doing their homework properly. Staring around the room, trying to think of a kind of misfortune he hadn't yet used, Harry saw Fred and George sitting together against the opposite wall, heads together, quills out, poring over a single piece of parchment. It was most unusual to see Fred and George hidden away in a corner and working silently; they usually liked to be in the thick of things and the noisy center of attention.  There was something secretive about the way they were working on the piece of parchment, and Harry was reminded of how they had sat together writing something back at the Burrow.  He had thought then that it was another order form for Weasleys' Wizard Wheezes, but it didn't look like that this time; if it had been, they would surely have let Lee Jordan in on the joke.  He wondered whether it had anything to do with entering the Triwizard Tournament. As Harry watched, George shook his head at Fred, scratched out something with his quill, and said, in a very quiet voice that nevertheless carried across the almost deserted room, \"No - that sounds like we're accusing him.  Got to be careful. . .\" Then George looked over and saw Harry watching him.  Harry grinned and quickly returned to his predictions - he didn't want George to think he was eavesdropping.  Shortly after that, the twins rolled up their parchment, said good night, and went off to bed. Fred and George had been gone ten minutes or so when the portrait hole opened and Hermione climbed into the common room carrying a sheaf of parchment in one hand and a box whose contents rattled as she walked in the other.  Crookshanks arched his back, purring. \"Hello,\" she said, \"I've just finished!\" \"So have I!\" said Ron triumphantly, throwing down his quill. Hermione sat down, laid the things she was carrying in an empty armchair, and pulled Ron's predictions toward her. \"Not going to have a very good month, are you?\" she said sardonically as Crookshanks curled up in her lap. \"Ah well, at least I'm forewarned,\" Ron yawned. \"You seem to be drowning twice,\" said Hermione. \"Oh am I?\"  said Ron, peering down at his predictions.  \"I'd better change one of them to getting trampled by a rampaging hippogriff.\" \"Don't you think it's a bit obvious you've made these up?\" said Hermione. \"How dare you!\" said Ron, in mock outrage.  \"We've been working like house-elves here!\" Hermione raised her eyebrows. \"It's just an expression,\" said Ron hastily. Harry laid down his quill too, having just finished predicting his own death by decapitation. \"What's in the box?\" he asked, pointing at it. \"Funny you should ask,\" said Hermione, with a nasty look at Ron.  She took off the lid and showed them the contents. Inside were about fifty badges, all of different colors, but all bearing the same letters: S. P. E .W. \"Spew?\"  said Harry, picking up a badge and looking at it. \"What's this about?\" \"Not spew,\" said Hermione impatiently.  \"It's S-P-E-W.  Stands for the Society for the Promotion of Elfish Welfare.\" \"Never heard of it,\" said Ron. \"Well, of course you haven't,\" said Hermione briskly, \"I've only just started it.\" \"Yeah?\" said Ron in mild surprise. \"How many members have you got?\" \"Well - if you two join - three,\" said Hermione. \"And you think we want to walk around wearing badges saying 'spew,' do you?\" said Ron. \"S-P-E-W!\" said Hermione hotly.  \"I was going to put Stop the Outrageous Abuse of Our Fellow Magical Creatures and Campaign for a Change in Their Legal Status - but it wouldn't fit. So that's the heading of our manifesto.\" She brandished the sheaf of parchment at them. \"I've been researching it thoroughly in the library.  Elf enslavement goes back centuries. I can't believe no one's done anything about it before now.\" \"Hermione - open your ears,\" said Ron loudly. \"They.  Like.  It.  They like being enslaved!\" \"Our short-term aims,\" said Hermione, speaking even more loudly than Ron, and acting as though she hadn't heard a word, \"are to secure house-elves fair wages and working conditions.  Our long-term aims include changing the law about non-wand use, and trying to get an elf into the Department for the Regulation and Control of Magical Creatures, because they're shockingly underrepresented."
}