{
  "id": "4030bdad906b606ea8b53bb38ea9eb1bc2615078",
  "text": "  \"Supercool,\" said the twins' best friend, Lee Jordan, sliding into the seat beside George.  \"We had him this afternoon,\" he told Harry and Ron. \"What was it like?\" said Harry eagerly. Fred, George, and Lee exchanged looks full of meaning. \"Never had a lesson like it,\" said Fred. \"He knows, man,\" said Lee. \"Knows what?\" said Ron, leaning forward. \"Knows what it's like to be out there doing it,\" said George impressively. \"Doing what?\" said Harry. \"Fighting the Dark Arts,\" said Fred. \"He's seen it all,\" said George. \"Mazing,\" said Lee. Ron dived into his bag for his schedule. \"We haven't got him till Thursday!\"  he said in a disappointed voice.   CHAPTER FOURTEEN - THE UNFORGIVABLE CURSES    The next two days passed without great incident, unless you counted Neville melting his sixth cauldron in Potions.  Professor Snape, who seemed to have attained new levels of vindictiveness over the summer, gave Nevihle detention, and Neville returned from it in a state of nervous collapse, having been made to disembowel a barrel full of horned toads.   \"You know why Snape's in such a foul mood, don't you?\" said Ron to Harry as they watched Hermione teaching Neville a Scouring Charm to remove the frog guts from under his fingernails.    \"Yeah,\" said Harry.  \"Moody.\"   It was common knowledge that Snape really wanted the Dark Arts job, and he had now failed to get it for the fourth year running.  Snape had disliked all of their previous Dark Arts teachers, and shown it - but he seemed strangely wary of displaying overt animosity to Mad-Eye Moody.  Indeed, whenever Harry saw the two of them together - at mealtimes, or when they passed in the corridors - he had the distinct impression that Snape was avoiding Moody's eye, whether magical or normal. \"I reckon Snape's a bit scared of him, you know,\" Harry said thoughtfully. \"Imagine if Moody turned Snape into a horned toad,\" said Ron, his eyes misting over, \"and bounced him all around his dungeon...\" The Gryffindor fourth years were looking forward to Moody's first lesson so much that they arrived early on Thursday lunchtime and queued up outside his classroom before the bell had even rung.  The only person missing was Hermione, who turned up just in time for the lesson. \"Been in the -\" \"Library.\"  Harry finished her sentence for her.  \"C'mon, quick, or we won't get decent seats.\" They hurried into three chairs right in front of the teacher's desk, took out their copies of The Dark Forces:  A Guide to Self-Protection, and waited, unusually quiet.  Soon they heard Moody's distinctive clunking footsteps coming down the corridor, and he entered the room, looking as strange and frightening as ever.  They could just see his clawed, wooden foot protruding from underneath his robes. \"You can put those away,\" he growled, stumping over to his desk and sitting down, \"those books.  You won't need them.\" They returned the books to their bags, Ron looking excited. Moody took out a register, shook his long mane of grizzled gray hair out of his twisted and scarred face, and began to call out names, his normal eye moving steadily down the list while his magical eye swiveled around, fixing upon each student as he or she answered.  \"Right then,\" he said, when the last person had declared themselves present, \"I've had a letter from Professor Lupin about this class.  Seems you've had a pretty thorough grounding in tackling Dark creatures - you've covered boggarts, Red Caps, hinkypunks, grindylows, Kappas, and werewolves, is that right?\" There was a general murmur of assent. \"But you're behind - very behind - on dealing with curses,\" said Moody.  \"So I'm here to bring you up to scratch on what wizards can do to each other.  I've got one year to teach you how to deal with Dark -\" \"What, aren't you staying?\"  Ron blurted out. Moody's magical eye spun around to stare at Ron; Ron looked extremely apprehensive, but after a moment Moody smiled - the first time Harry had seen him do so.  The effect was to make his heavily scarred face look more twisted and contorted than ever, but it was nevertheless good to know that he ever did anything as friendly as smile.  Ron looked deeply relieved. \"You'll be Arthur Weasley's son, eh?\"  Moody said.  \"Your father got me out of a very tight corner a few days ago. .. . Yeah, I'm staying just the one year.  Special favor to Dumbledore. . . . One year, and then back to my quiet retirement.\" He gave a harsh laugh, and then clapped his gnarled hands together. \"So - straight into it. Curses.  They come in many strengths and forms.  Now, according to the Ministry of Magic, I'm supposed to teach you countercurses and leave it at that.  I'm not supposed to show you what illegal Dark curses look like until you're in the sixth year.  You're not supposed to be old enough to deal with it till then.  But Professor Dumbledore's got a higher opinion of your nerves, he reckons you can cope, and I say, the sooner you know what you're up against, the better.  How are you supposed to defend yourself against something you've never seen?  A wizard who's about to put an illegal curse on you isn't going to tell you what he's about to do."
}