{
  "id": "40eeebb77e4765fee604eb30de2fa00754682457",
  "text": " And your soul is gone forever... lost.\"  Lupin drank a little more butterbeer, then said, \"It's the fate that awaits Sirius Black. It was in the Daily Prophet this morning. The Ministry have given the dementors permission to perform it if they find him.\"  Harry sat stunned for a moment at the idea of someone having their soul sucked out through their mouth. But then he thought of Black.  \"He deserves it,\" he said suddenly.  \"You think so?\" said Lupin lightly. \"Do you really think anyone deserves that?\"  \"Yes,\" said Harry defiantly. \"For... for some things...\"  He would have liked to have told Lupin about the conversation he'd overheard about Black in the Three Broomsticks, about Black betraying his mother and father, but it would have involved revealing that he'd gone to Hogsmeade without permission, and he knew Lupin wouldn't be very impressed by that. So he finished his butterbeer, thanked Lupin, and left the History of Magic classroom.  Harry half wished that he hadn't asked what was under a dementor's hood, the answer had been so horrible, and he was so lost in unpleasant thoughts of what it would feel like to have your soul sucked out of you that he walked headlong into Professor McGonagall halfway up the stairs.  \"Do watch where you're going, Potter!\"  \"Sorry, Professor --\"  \"I've just been looking for you in the Gryffindor common room, Well, here it is, we've done everything we could think of, and there doesn't seem to be anything wrong with it at all. You've got a very good friend somewhere, Potter....\"  Harry's jaw dropped. She was holding out his Firebolt, and it looked as magnificent as ever.  \"I can have it back?\" Harry said weakly. \"Seriously?\"  \"Seriously,\" said Professor McGonagall, and she was actually smiling. \"I daresay you'll need to get the feel of it before Saturday's match, won't you? And Potter -- do try and win, won't you? Or we'll be out of the running for the eighth year. in a row, as Professor Snape was kind enough to remind me only last night....\"  Speechless, Harry carried the Firebolt back upstairs toward Gryffindor Tower. As he turned a corner, he saw Ron dashing toward him, grinning from ear to ear.  \"She gave it to You? Excellent! Listen, can I still have a go on it? Tomorrow?\"  \"Yeah... anything,\" said Harry, his heart lighter than it had been in a month. \"You know what -- we should make up with Hermione.... She was only trying to help....\"  \"Yeah, all right,\" said Ron. \"She's in the common room how working, for a change --\"  They turned into the corridor to Gryffindor Tower and saw Neville Longbottom, pleading with Sir Cadogan, who seemed to be refusing him entrance.  \"I wrote them down!\" Neville was saying tearfully. \"But I must've dropped them somewhere!\"  \"A likely tale!\" roared Sir Cadogan. Then, spotting Harry and Ron: \"Good even, my fine young yeomen! Come clap this loon in irons. He is trying to force entry to the chambers within!\"  \"Oh, shut up,\" said Ron as he and Harry drew level with Neville.  \"I've lost the passwords!\" Neville told them miserably. \"I made him tell me what passwords he was going to use this week, because he keeps changing them, and now I don't know what I've done with them!\"  \"Oddsbodikins,\" said Harry to Sir Cadogan, who looked extremely disappointed and reluctantly swung forward to let them into the common room. There was a sudden, excited murmur as every head turned and the next moment, Harry was surrounded by people exclaiming over his Firebolt.  \"Where'd you get it, Harry?\"  \"Will you let me have a go?\" \"Have you ridden it yet, Harry?\"  \"Ravenclaw'll have no chance, they're all on Cleansweep Sevens!\"  \"Can I just hold it, Harry?\"  After ten minutes or so, during which the Firebolt was Passed around and admired from every angle, the crowd dispersed and Harry and Ron had a clear view of Hermione, the only person who hadn't rushed over to them, bent over her work and carefully avoiding their eyes. Harry and Ron approached her table and at last, she looked up.  \"I got it back,\" said Harry, grinning at her and holding up the Firebolt.  \"See, Hermione? There wasn't anything wrong with it!\" said Ron.  \"Well -- there might have been!\" said Hermione. \"I mean, at least you know now that it's safe!\"  \"Yeah, I suppose so,\" said Harry. \"Id better put it upstairs.\"  \"I'll take it!\" said Ron eagerly. \"I've got to give Scabbers his rat tonic.\"  He took the Firebolt and, holding it as if it were made of glass, carried it away up the boys' staircase.  \"Can I sit down, then?\" Harry asked Hermione.  \"I suppose so,\" said Hermione, moving a great stack of parchment off a chair.  Harry looked around at the cluttered table, at the long Arithmancy essay on which the ink was still glistening, at the even longer Muggle Studies essay (\"Explain Why Muggles Need Electricity\" and at the rune translation Hermione was now poring over.  \"How are you getting through all this stuff?\" Harry asked her.  \"Oh, well -- you know -- working hard,\" said Hermione. Close-up, Harry saw that she looked almost as tired as Lupin."
}