{
  "id": "41810e8cce63a9cb4b9a2eabe4054866cc0b8343",
  "text": " As  the  light faded Bilbo  thought he saw away  to  the  right,  or  to  the  left,  the  shadowy  form  of  a  great  bear  prowling  along  in  the  same  direction.  But  if  he  dared  to  mention  it  to  Gandalf,  the  wizard  only  said:  \"Hush! Take no notice!\"   ####-Next day they started before dawn, though their night had been short. As soon  as it was light they could see the forest coming as it were to meet them, or waiting  for  them  like a black and  frowning wall before  them. The  land began  to  slope up  and  up,  and  it  seemed  to  the  hobbit  that  a  silence  began  to  draw  in  upon  them.  Birds  began  to  sing  less.  There  were  no  more  deer;  not  even  rabbits  were  to  be  seen. By  the  afternoon they had reached the eaves of Mirkwood, and were resting  almost beneath  the great overhanging boughs of  its outer  trees. Their  trunks were  huge  and  gnarled,  their  branches  twisted,  their  leaves  were  dark  and  long.  Ivy  grew on them and trailed along the ground.  \"Well,  here  is  Mirkwood!\"  said  Gandalf.  \"The  greatest  of  the  forests  of  the  Northern  world.  I  hope  you  like  the  look  of  it.  Now  you  must  send  back  these  excellent ponies you have borrowed.\"  The  dwarves  were  inclined  to  grumble  at  this,  but  the  wizard  told  them  they  were  fools. \"Beorn  is not as  far off as you seem  to  think, and you had better keep  your promises  anyway,  for he  is  a bad  enemy. Mr. Baggins'  eyes  are  sharper  than  yours,  if you have not seen each night after dark a great bear going along with us  or sitting far of in the moon watching our camps. Not only to guard you and guide  you, but to keep an eye on the ponies too. Beorn may be your friend, but he loves  his animals as his children. You do not guess what kindness he has  shown you  in  letting dwarves ride them so far and so fast, nor what would happen to you, if you  tried to take them into the forest.\"  \"What  about  the  horse,  then?\"  said  Thorin.  \"You  don't  mention  sending  that  back.\"  \"I don't, because I am not sending it.\"  \"What about your promise then?\"  \"I will look after that. I am not sending the horse back, I am riding it!\"  Then  they  knew  that  Gandalf  was  going  to  leave  them  at  the  very  edge  of  Mirkwood, and they were in despair.   But nothing they could say would change his mind.  \"Now we had this all out before, when we landed on the Carrock,\" he said. \"It  is no use arguing. I have, as I  told you, some pressing business away south; and I  am already late through bothering with you people. We may meet again before all  is  over,  and  then  again of  course we may not. That depends on your  luck  and on  your courage and  sense; and  I am  sending Mr. Baggins with you.  I have  told you  before  that  he  has  more  about  him  than  you  guess,  and  you  will  find  that  out  before  long.  So  cheer  up  Bilbo  and  don't  look  so  glum.  Cheer  up  Thorin  and   ####-Company! This  is  your  expedition  after  all. Think  of  the  treasure  at  the  end,  and  forget the forest and the dragon, at any rate until tomorrow morning!\"  When tomorrow morning came he still said the same.  So  now  there  was  nothing  left  to  do  but  to  fill  their  water-skins  at  a  clear  spring they found close to the forest-gate, and unpack the ponies. They distributed  the  packages  as  fairly  as  they  could,  though  Bilbo  thought  his  lot  was  wearisomely heavy, and did not at all like  the idea of trudging for miles and miles  with all that on his back.  \"Don't you worry!\" said Thorin. \"It will get  lighter all  too soon. Before  long  I  expect we shall all wish our packs heavier, when the food begins to run short.\"  Then  at  last  they  said  good-bye  to  their  ponies  and  turned  their  heads  for  home.  Off  they  trotted  gaily,  seeming  very  glad  to  put  their  tails  towards  the  shadow of Mirkwood. As they went away Bilbo could have sworn that a thing like  a bear left the shadow of the trees and shambled off quickly after them.  Now Gandalf  too  said  farewell. Bilbo  sat on  the ground  feeling very unhappy  and wishing he was beside the wizard on his tall horse. He had gone just inside the  forest  after  breakfast  (a  very  poor  one),  and  it  had  seemed  as  dark  in  there  in  the  morning  as  at  night,  and  very  secret:  \"a  sort  of watching  and waiting  feeling,\"  he  said to himself.  \"Good-bye!\"  said  Gandalf  to  Thorin.  \"And  good-bye  to  you  all,  good-bye!  Straight through the forest is your way now. Don't stray off the track!-if you do, it  is  a  thousand  to one you will never  find  it  again  and never get out of Mirkwood;  and then I don't suppose I, or any one else, will ever see you again.\"  \"Do we really have to go through?\" groaned the hobbit.  \"Yes, you do!\" said the wizard, \"if  you want to get to the other side. You must  either go through or give up your quest. And I am not going to allow you to back  out  now,  Mr."
}