{
  "id": "422557f5b9df0859bd49ce0d8386c4ec46e5c4b3",
  "text": " He listened to Jon Arryn instead. I was still at Storm’s End, under siege and unconsulted.  He turned abruptly, to give Davos a hard shrewd look.  The truth, now. Why did you wish to murder Lady Melisandre?   So he does know. Davos could not lie to him.  Four of my sons burned on the Blackwater. She gave them to the flames.    You wrong her. Those fires were no work of hers. Curse the Imp, curse the pyromancers, curse that fool of Florent who sailed my fleet into the jaws of a trap. Or curse me for my stubborn pride, for sending her away when I needed her most. But not Melisandre. She remains my faithful servant.    Maester Cressen was your faithful servant. She slew him, as she killed Ser Cortnay Penrose and your brother Renly.    Now you sound a fool,  the king complained.  She saw Renly’s end in the flames, yes, but she had no more part in it than I did. The priestess was with me. Your Devan would tell you so. Ask him, if you doubt me. She would have spared Renly if she could. It was Melisandre who urged me to meet with him, and give him one last chance to amend his treason. And it was Melisandre who told me to send for you when Ser Axell wished to give you to R’hllor.  He smiled thinly.  Does that surprise you?    Yes. She knows I am no friend to her or her red god.    But you are a friend to me. She knows that as well.  He beckoned Davos closer.  The boy is sick. Maester Pylos has been leeching him.    The boy?  His thoughts went to his Devan, the king’s squire.  My son, sire?    Devan? A good boy. He has much of you in him. It is Robert’s bastard who is sick, the boy we took at Storm’s End.   Edric Storm.  I spoke with him in Aegon’s Garden.    As she wished. As she saw.  Stannis sighed.  Did the boy charm you? He has that gift. He got it from his father, with the blood. He knows he is a king’s son, but chooses to forget that he is bastard-born. And he worships Robert, as Renly did when he was young. My royal brother played the fond father on his visits to Storm’s End, and there were gifts… swords and ponies and fur-trimmed cloaks. The eunuch’s work, every one. The boy would write the Red Keep full of thanks, and Robert would laugh and ask Varys what he’d sent this year. Renly was no better. He left the boy’s upbringing to castellans and maesters, and every one fell victim to his charm. Penrose chose to die rather than give him up.  The king ground his teeth together.  It still angers me. How could he think I would hurt the boy? I chose Robert, did I not? When that hard day came. I chose blood over honor.   He does not use the boy’s name. That made Davos very uneasy.  I hope young Edric will recover soon.   Stannis waved a hand, dismissing his concern.  It is a chill, no more. He coughs, he shivers, he has a fever. Maester Pylos will soon set him right. By himself the boy is nought, you understand, but in his veins flows my brother’s blood. There is power in a king’s blood, she says.   Davos did not have to ask who she was.  Stannis touched the Painted Table.  Look at it, onion knight. My realm, by rights. My Westeros.  He swept a hand across it.  This talk of Seven Kingdoms is a folly. Aegon saw that three hundred years ago when he stood where we are standing. They painted this table at his command. Rivers and bays they painted, hills and mountains, castles and cities and market towns, lakes and swamps and forests… but no borders. It is all one. One realm, for one king to rule alone.    One king,  agreed Davos.  One king means peace.    I shall bring justice to Westeros. A thing Ser Axell understands as little as he does war. Claw Isle would gain me naught… and it was evil, just as you said. Celtigar must pay the traitor’s price himself, in his own person. And when I come into my kingdom, he shall. Every man shall reap what he has sown, from the highest lord to the lowest gutter rat. And some will lose more than the tips off their fingers, I promise you. They have made my kingdom bleed, and I do not forget that.  King Stannis turned from the table.  On your knees, Onion Knight.    Your Grace?    For your onions and fish, I made you a knight once. For this, I am of a mind to raise you to lord.   This? Davos was lost.  I am content to be your knight, Your Grace. I would not know how to begin being lordly.    Good. To be lordly is to be false. I have learned that lesson hard. Now, kneel. Your king commands.   Davos knelt, and Stannis drew his longsword. Lightbringer, Melisandre had named it; the red sword of heroes, drawn from the fires where the seven gods were consumed. The room seemed to grow brighter as the blade slid from its scabbard. The steel had a glow to it; now orange, now yellow, now red. The air shimmered around it, and no jewel had ever sparkled so brilliantly. But when Stannis touched it to Davos’s shoulder, it felt no different than any other longsword.  Ser Davos of House Seaworth,  the king said,  are you my true and honest liege man, now and forever?    I am, Your Grace.    And do you swear to serve me loyally all your days, to give me honest counsel and swift obedience, to defend my rights and my realm against all foes in battles great and small, to protect my people and punish my enemies?    I do, Your Grace."
}