{
  "id": "424ad68bdea3bc618bbd5251d26dcf609dfe443b",
  "text": " . . somewhere around here. . . . \"Viktor?\"  Harry shouted. No one answered. \"They were here,\" Harry said to Dumbledore.  \"They were definitely somewhere around here. ...\" \"Lumos,\" Dumbledore said, lighting his wand and holding it up. Its narrow beam traveled from black trunk to black trunk, illuminating the ground.  And then it fell upon a pair of feet. Harry and Dumbledore hurried forward.  Krum was sprawled on the forest floor.  He seemed to be unconscious.  There was no sign at all of Mr. Crouch.  Dumbledore bent over Krum and gently lifted one of his eyelids. \"Stunned,\" he said softly. His half-moon glasses glittered in the wandlight as he peered around at the surrounding trees. \"Should I go and get someone?\"  said Harry.  \"Madam Pomfrey?\" \"No,\" said Dumbledore swiftly.  \"Stay here.\" He raised his wand into the air and pointed it in the direction of Hagrid's cabin.  Harry saw something silvery dart out of it and streak away through the trees like a ghostly bird.  Then Dumbledore bent over Krum again, pointed his wand at him, and muttered, \"Ennervate.\" Krum opened his eyes.  He looked dazed.  When he saw Dumbledore, he tried to sit up, but Dumbledore put a hand on his shoulder and made him lie still. \"He attacked me!\" Krum muttered, putting a hand up to his head.  \"The old madman attacked me!  I vos looking around to see vare Potter had gone and he attacked from behind!\" \"Lie still for a moment,\" Dumbledore said. The sound of thunderous footfalls reached them, and Hagrid came panting into sight with Fang at his heels.  He was carrying his crossbow. \"Professor Dumbledore!\" he said, his eyes widening. \"Harry - what the - ?\" \"Hagrid, I need you to fetch Professor Karkaroff,\" said Dumbledore. \"His student has been attacked.  When you've done that, kindly alert Professor Moody -\" \"No need, Dumbledore,\" said a wheezy growl. \"I'm here.\" Moody was limping toward them, leaning on his staff, his wand lit. \"Damn leg,\" he said furiously.  \"Would've been here quicker . . . what's happened? Snape said something about Crouch -\" \"Crouch?\"  said Hagrid blankly. \"Karkaroff, please, Hagrid!\"  said Dumbledore sharply. \"Oh yeah . .'. right y'are, Professor. . .\" said Hagrid, and he turned and disappeared into the dark trees, Fang trotting after him. \"I don't know where Barty Crouch is,\" Dumbledore told Moody, \"but it is essential that we find him.\" \"I'm onto it,\" growled Moody, and he pulled out his wand and limped off into the forest. Neither Dumbledore nor Harry spoke again until they heard the unmistakable sounds of Hagrid and Fang returning.  Karkaroff was hurrying along behind them.  He was wearing his sleek silver furs, and he looked pale and agitated. \"What is this?\" he cried when he saw Krum on the ground and Dumbledore and Harry beside him.  \"What's going on?\" \"I vos attacked!\" said Krum, sitting up now and rubbing his head.  \"Mr. Crouch or votever his name -\" \"Crouch attacked you?  Crouch attacked you?  The Triwizard judge?\" \"Igor,\" Dumbledore began, but Karkaroff had drawn himself up, clutching his furs around him, looking livid. \"Treachery!\" he bellowed, pointing at Dumbledore.  \"It is a plot!  You and your Ministry of Magic have lured me here under false pretenses, Dumbledore!  This is not an equal competition!  First you sneak Potter into the tournament, though he is underage!  Now one of your Ministry friends attempts to put my champion out of action!  I smell double-dealing and corruption in this whole affair, and you, Dumbledore, you, with your talk of closer international wizarding links, of rebuilding old ties, of forgetting old differences - here's what I think of you!\" Karkaroff spat onto the ground at Dumbledore's feet.  In one swift movement, Hagrid seized the front of Karkaroff's furs, lifted him into the air, and slammed him against a nearby tree. \"Apologize!\" Hagrid snarled as Karkaroff gasped for breath, Hagrid's massive fist at his throat, his feet dangling in midair. \"Hagrid, no!\" Dumbledore shouted, his eyes flashing. Hagrid removed the hand pinning Karkaroff to the tree, and Karkaroff slid all the way down the trunk and slumped in a huddle at its roots; a few twigs and leaves showered down upon his head. \"Kindly escort Harry back up to the castle, Hagrid,\"  said Dumbledore sharply. Breathing heavily, Hagrid gave Karkaroff a glowering look. \"Maybe I'd better stay here. Headmaster. . . .\" \"You will take Harry back to school, Hagrid,\" Dumbledore repeated firmly.  \"Take him right up to Gryffindor Tower.  And Harry - I want you to stay there.  Anything you might want to do - any owls you might want to send - they can wait until morning, do you understand me?\" \"Er - yes,\" said Harry, staring at him.  How had Dumbledore known that, at that very moment, he had been thinking about sending Pigwidgeon straight to Sirius, to tell him what had happened? \"I'll leave Fang with yeh. Headmaster,\" Hagrid said, staring menacingly at Karkaroff, who was still sprawled at the foot of the tree, tangled in furs and tree roots."
}