{
  "id": "441475cd2485ab31daf323fa9e71cec3589563a9",
  "text": " His visor had been removed from his helm, to better show his dour face; pouchy bags under his eyes, a wide sour mouth, rusty hair spotted with grey.  My lady,  he said, bowing, as if he had not beaten her bloody only three hours past.  His Grace has instructed me to escort you to the throne room.    Did he instruct you to hit me if I refused to come?    Are you refusing to come, my lady?  The look he gave her was without expression. He did not so much as glance at the bruise he had left her.  He did not hate her, Sansa realized; neither did he love her. He felt nothing for her at all. She was only a… a thing to him.  No,  she said, rising. She wanted to rage, to hurt him as he’d hurt her, to warn him that when she was queen she would have him exiled if he ever dared strike her again… but she remembered what the Hound had told her, so all she said was,  I shall do whatever His Grace commands.    As I do,  he replied.   Yes… but you are no true knight, Ser Meryn.   Sandor Clegane would have laughed at that, Sansa knew. Other men might have cursed her, warned her to keep silent, even begged for her forgiveness. Ser Meryn Trant did none of these. Ser Meryn Trant simply did not care.  The balcony was deserted save for Sansa. She stood with her head bowed, fighting to hold back her tears, while below Joffrey sat on his Iron Throne and dispensed what it pleased him to call justice. Nine cases out of ten seemed to bore him; those he allowed his council to handle, squirming restlessly while Lord Baelish, Grand Maester Pycelle, or Queen Cersei resolved the matter. When he did choose to make a ruling, though, not even his queen mother could sway him.  A thief was brought before him and he had Ser Ilyn chop his hand off, right there in court. Two knights came to him with a dispute about some land, and he decreed that they should duel for it on the morrow.  To the death,  he added. A woman fell to her knees to plead for the head of a man executed as a traitor. She had loved him, she said, and she wanted to see him decently buried.  If you loved a traitor, you must be a traitor too,  Joffrey said. Two gold cloaks dragged her off to the dungeons.  Frog-faced Lord Slynt sat at the end of the council table wearing a black velvet doublet and a shiny cloth-of-gold cape, nodding with approval every time the king pronounced a sentence. Sansa stared hard at his ugly face, remembering how he had thrown down her father for Ser Ilyn to behead, wishing she could hurt him, wishing that some hero would throw him down and cut off his head. But a voice inside her whispered, There are no heroes, and she remembered what Lord Petyr had said to her, here in this very hall.  Life is not a song, sweetling,  he’d told her.  You may learn that one day to your sorrow.  In life, the monsters win, she told herself, and now it was the Hound’s voice she heard, a cold rasp, metal on stone.  Save yourself some pain, girl, and give him what he wants.   The last case was a plump tavern singer, accused of making a song that ridiculed the late King Robert. Joff commanded them to fetch his woodharp and ordered him to perform the song for the court. The singer wept and swore he would never sing that song again, but the king insisted. It was sort of a funny song, all about Robert fighting with a pig. The pig was the boar who’d killed him, Sansa knew, but in some verses it almost sounded as if he were singing about the queen. When the song was done, Joffrey announced that he’d decided to be merciful. The singer could keep either his fingers or his tongue. He would have a day to make his choice. Janos Slynt nodded.  That was the final business of the afternoon, Sansa saw with relief, but her ordeal was not yet done. When the herald’s voice dismissed the court, she fled the balcony, only to find Joffrey waiting for her at the base of the curving stairs. The Hound was with him, and Ser Meryn as well. The young king examined her critically, top to bottom.  You look much better than you did.    Thank you, Your Grace,  Sansa said. Hollow words, but they made him nod and smile.   Walk with me,  Joffrey commanded, offering her his arm. She had no choice but to take it. The touch of his hand would have thrilled her once; now it made her flesh crawl.  My name day will be here soon,  Joffrey said as they slipped out the rear of the throne room.  There will be a great feast, and gifts. What are you going to give me?    I… I had not thought, my lord.    Your Grace,  he said sharply.  You truly are a stupid girl, aren’t you? My mother says so.    She does?  After all that had happened, his words should have lost their power to hurt her, yet somehow they had not. The queen had always been so kind to her.   Oh, yes. She worries about our children, whether they’ll be stupid like you, but I told her not to trouble herself.  The king gestured, and Ser Meryn opened a door for them.   Thank you, Your Grace,  she murmured. The Hound was right, she thought, I am only a little bird, repeating the words they taught me."
}