{
  "id": "4583615d2b5e402336a089ea8966ac876583f788",
  "text": " The slaves erected Khal Drogo’s tent beneath a jagged outcrop of black rock whose shadow gave some relief from the heat of the afternoon sun. Even so, it was stifling under the sandsilk as Irri and Doreah helped Dany walk Drogo inside. Thick patterned carpets had been laid down over the ground, and pillows scattered in the corners. Eroeh, the timid girl Dany had rescued outside the mud walls of the Lamb Men, set up a brazier. They stretched Drogo out on a woven mat.  No,  he muttered in the Common Tongue.  No, no.  It was all he said, all he seemed capable of saying.  Doreah unhooked his medallion belt and stripped off his vest and leggings, while Jhiqui knelt by his feet to undo the laces of his riding sandals. Irri wanted to leave the tent flaps open to let in the breeze, but Dany forbade it. She would not have any see Drogo this way, in delirium and weakness. When her khas came up, she posted them outside at guard.  Admit no one without my leave,  she told Jhogo.  No one.   Eroeh stared fearfully at Drogo where he lay.  He dies,  she whispered.  Dany slapped her.  The khal cannot die. He is the father of the stallion who mounts the world. His hair has never been cut. He still wears the bells his father gave him.    Khaleesi,  Jhiqui said,  he fell from his horse.   Trembling, her eyes full of sudden tears, Dany turned away from them. He fell from his horse! It was so, she had seen it, and the bloodriders, and no doubt her handmaids and the men of her khas as well. And how many more? They could not keep it secret, and Dany knew what that meant. A khal who could not ride could not rule, and Drogo had fallen from his horse.   We must bathe him,  she said stubbornly. She must not allow herself to despair.  Irri, have the tub brought at once. Doreah, Eroeh, find water, cool water, he’s so hot.  He was a fire in human skin.  The slaves set up the heavy copper tub in the corner of the tent. When Doreah brought the first jar of water, Dany wet a length of silk to lay across Drogo’s brow, over the burning skin. His eyes looked at her, but he did not see. When his lips opened, no words escaped them, only a moan.  Where is Mirri Maz Duur?  she demanded, her patience rubbed raw with fear.   Qotho will find her,  Irri said.  Her handmaids filled the tub with tepid water that stank of sulfur, sweetening it with jars of bitter oil and handfuls of crushed mint leaves. While the bath was being prepared, Dany knelt awkwardly beside her lord husband, her belly great with their child within. She undid his braid with anxious fingers, as she had on the night he’d taken her for the first time, beneath the stars. His bells she laid aside carefully, one by one. He would want them again when he was well, she told herself.  A breath of air entered the tent as Aggo poked his head through the silk.  Khaleesi,  he said,  the Andal is come, and begs leave to enter.    The Andal  was what the Dothraki called Ser Jorah.  Yes,  she said, rising clumsily,  send him in.  She trusted the knight. He would know what to do if anyone did.  Ser Jorah Mormont ducked through the door flap and waited a moment for his eyes to adjust to the dimness. In the fierce heat of the south, he wore loose trousers of mottled sandsilk and open-toed riding sandals that laced up to his knee. His scabbard hung from a twisted horsehair belt. Under a bleached white vest, he was bare-chested, skin reddened by the sun.  Talk goes from mouth to ear, all over the khalasar,  he said.  It is said Khal Drogo fell from his horse.    Help him,  Dany pleaded.  For the love you say you bear me, help him now.   The knight knelt beside her. He looked at Drogo long and hard, and then at Dany.  Send your maids away.   Wordlessly, her throat tight with fear, Dany made a gesture. Irri herded the other girls from the tent.  When they were alone, Ser Jorah drew his dagger. Deftly, with a delicacy surprising in such a big man, he began to scrape away the black leaves and dried blue mud from Drogo’s chest. The plaster had caked hard as the mud walls of the Lamb Men, and like those walls it cracked easily. Ser Jorah broke the dry mud with his knife, pried the chunks from the flesh, peeled off the leaves one by one. A foul, sweet smell rose from the wound, so thick it almost choked her. The leaves were crusted with blood and pus, Drogo’s breast black and glistening with corruption.   No,  Dany whispered as tears ran down her cheeks.  No, please, gods hear me, no.   Khal Drogo thrashed, fighting some unseen enemy. Black blood ran slow and thick from his open wound.   Your khal is good as dead, Princess.    No, he can’t die, he mustn’t, it was only a cut.  Dany took his large callused hand in her own small ones, and held it tight between them.  I will not let him die…   Ser Jorah gave a bitter laugh.  Khaleesi or queen, that command is beyond your power. Save your tears, child. Weep for him tomorrow, or a year from now. We do not have time for grief. We must go, and quickly, before he dies."
}