{
  "id": "48c6df5e899315b71295c52fe8ba11211504fdcd",
  "text": " Naked and wet, they seemed such little things, so still it was hard to remember them living.  The blond boy had been trying to grow a beard. Pale yellow peach fuzz covered his cheeks and jaw above the red ruin the knife had made of his throat. His long golden hair was still wet, as if he had been pulled from a bath. By the look of him, he had died peacefully, perhaps in sleep, but his brown-haired cousin had fought for life. His arms bore slashes where he’d tried to block the blades, and red still trickled slowly from the stab wounds that covered his chest and belly and back like so many tongueless mouths, though the rain had washed him almost clean.  Robb had donned his crown before coming to the hall, and the bronze shone darkly in the torchlight. Shadows hid his eyes as he looked upon the dead. Does he see Bran and Rickon as well? She might have wept, but there were no tears left in her. The dead boys were pale from long imprisonment, and both had been fair; against their smooth white skin, the blood was shockingly red, unbearable to look upon. Will they lay Sansa down naked beneath the Iron Throne after they have killed her? Will her skin seem as white, her blood as red? From outside came the steady wash of rain and the restless howling of a wolf.  Her brother Edmure stood to Robb’s right, one hand upon the back of his father’s seat, his face still puffy from sleep. They had woken him as they had her, pounding on his door in the black of night to yank him rudely from his dreams. Were they good dreams, brother? Do you dream of sunlight and laughter and a maiden’s kisses? I pray you do. Her own dreams were dark and laced with terrors.  Robb’s captains and lords bannermen stood about the hall, some mailed and armed, others in various states of dishevelment and undress. Ser Raynald and his uncle Ser Rolph were among them, but Robb had seen fit to spare his queen this ugliness. The Crag is not far from Casterly Rock, Catelyn recalled. Leyne may well have played with these boys when all of them were children.  She looked down again upon the corpses of the squires Tion Frey and Willem Lannister, and waited for her son to speak.  It seemed a very long time before Robb lifted his eyes from the bloody dead.  Smalljon,  he said,  tell your father to bring them in.  Wordless, Smalljon Umber turned to obey, his steps echoing in the great stone hall.  As the Greatjon marched his prisoners through the doors, Catelyn made note of how some other men stepped back to give them room, as if treason could somehow be passed by a touch, a glance, a cough. The captors and the captives looked much alike; big men, every one, with thick beards and long hair. Two of the Greatjon’s men were wounded, and three of their prisoners. Only the fact that some had spears and others empty scabbards served to set them apart. All were clad in mail hauberks or shirts of sewn rings, with heavy boots and thick cloaks, some of wool and some of fur. The north is hard and cold, and has no mercy, Ned had told her when she first came to Winterfell a thousand years ago.   Five,  said Robb when the prisoners stood before him, wet and silent.  Is that all of them?    There were eight,  rumbled the Greatjon.  We killed two taking them, and a third is dying now.   Robb studied the faces of the captives.  It required eight of you to kill two unarmed squires.   Edmure Tully spoke up.  They murdered two of my men as well, to get into the tower. Delp and Elwood.    It was no murder, ser,  said Lord Rickard Karstark, no more discomfited by the ropes about his wrists than by the blood that trickled down his face.  Any man who steps between a father and his vengeance asks for death.   His words rang against Catelyn’s ears, harsh and cruel as the pounding of a war drum. Her throat was dry as bone. I did this. These two boys died so my daughters might live.   I saw your sons die, that night in the Whispering Wood,  Robb told Lord Karstark.  Tion Frey did not kill Torrhen. Willem Lannister did not slay Eddard. How then can you call this vengeance? This was folly, and bloody murder. Your sons died honorably on a battlefield, with swords in their hands.    They died,  said Rickard Karstark, yielding no inch of ground.  The Kingslayer cut them down. These two were of his ilk. Only blood can pay for blood.    The blood of children?  Robb pointed at the corpses.  How old were they? Twelve, thirteen? Squires.    Squires die in every battle.    Die fighting, yes. Tion Frey and Willem Lannister gave up their swords in the Whispering Wood. They were captives, locked in a cell, asleep, unarmed… boys. Look at them!   Lord Karstark looked instead at Catelyn.  Tell your mother to look at them,  he said.  She slew them, as much as L   Catelyn put a hand on the back of Robb’s seat. The hall seemed to spin about her. She felt as though she might retch.   My mother had naught to do with this,  Robb said angrily.  This was your work. Your murder. Your treason.    How can it be treason to kill Lannisters, when it is not treason to free them?  asked Karstark harshly."
}