{
  "id": "48dd53190f3c17a383bafac2149728deff549da8",
  "text": " She bit down hard into his palm. The man grunted in pain. She ground her teeth together and tore at him, and all of a sudden he let go. The taste of his blood filled her mouth. She sucked in air and screamed, and he grabbed her hair and pulled her away from him, and she stumbled and went down, and then he was standing over her, breathing hard, shaking. The dagger was still clutched tightly in his right hand, slick with blood.  You weren’t s’posed to be here,  he repeated stupidly.  Catelyn saw the shadow slip through the open door behind him. There was a low rumble, less than a snarl, the merest whisper of a threat, but he must have heard something, because he started to turn just as the wolf made its leap. They went down together, half sprawled over Catelyn where she’d fallen. The wolf had him under the jaw. The man’s shriek lasted less than a second before the beast wrenched back its head, taking out half his throat.  His blood felt like warm rain as it sprayed across her face.  The wolf was looking at her. Its jaws were red and wet and its eyes glowed golden in the dark room. It was Bran’s wolf, she realized. Of course it was.  Thank you,  Catelyn whispered, her voice faint and tiny. She lifted her hand, trembling. The wolf padded closer, sniffed at her fingers, then licked at the blood with a wet rough tongue. When it had cleaned all the blood off her hand, it turned away silently and jumped up on Bran’s bed and lay down beside him. Catelyn began to laugh hysterically.  That was the way they found them, when Robb and Maester Luwin and Ser Rodrik burst in with half the guards in Winterfell. When the laughter finally died in her throat, they wrapped her in warm blankets and led her back to the Great Keep, to her own chambers. Old Nan undressed her and helped her into a scalding hot bath and washed the blood off her with a soft cloth.  Afterward Maester Luwin arrived to dress her wounds. The cuts in her fingers went deep, almost to the bone, and her scalp was raw and bleeding where he’d pulled out a handful of hair. The maester told her the pain was just starting now, and gave her milk of the poppy to help her sleep.  Finally she closed her eyes.  When she opened them again, they told her that she had slept four days. Catelyn nodded and sat up in bed. It all seemed like a nightmare to her now, everything since Bran’s fall, a terrible dream of blood and grief, but she had the pain in her hands to remind her that it was real. She felt weak and light-headed, yet strangely resolute, as if a great weight had lifted from her.   Bring me some bread and honey,  she told her servants,  and take word to Maester Luwin that my bandages want changing.  They looked at her in surprise and ran to do her bidding.  Catelyn remembered the way she had been before, and she was ashamed. She had let them all down, her children, her husband, her House. It would not happen again. She would show these northerners how strong a Tully of Riverrun could be.  Robb arrived before her food. Rodrik Cassel came with him, and her husband’s ward Theon Greyjoy, and lastly Hallis Mollen, a muscular guardsman with a square brown beard. He was the new captain of the guard, Robb said. Her son was dressed in boiled leather and ringmail, she saw, and a sword hung at his waist.   Who was he?  Catelyn asked them.   No one knows his name,  Hallis Mollen told her.  He was no man of Winterfell, m’lady, but some says they seen him here and about the castle these past few weeks.    One of the king’s men, then,  she said,  or one of the Lannisters’. He could have waited behind when the others left.    Maybe,  Hal said.  With all these strangers filling up Winterfell of late, there’s no way of saying who he belonged to.    He’d been hiding in your stables,  Greyjoy said.  You could smell it on him.    And how could he go unnoticed?  she said sharply.  Hallis Mollen looked abashed.  Between the horses Lord Eddard took south and them we sent north to the Night’s Watch, the stalls were half-empty. It were no great trick to hide from the stableboys. Could be Hodor saw him, the talk is that boy’s been acting queer, but simple as he is…  Hal shook his head.   We found where he’d been sleeping,  Robb put in.  He had ninety silver stags in a leather bag buried beneath the straw.    It’s good to know my son’s life was not sold cheaply,  Catelyn said bitterly.  Hallis Mollen looked at her, confused.  Begging your grace, m’lady, you saying he was out to kill your boy?   Greyjoy was doubtful.  That’s madness.    He came for Bran,  Catelyn said.  He kept muttering how I wasn’t supposed to be there. He set the library fire thinking I would rush to put it out, taking any guards with me. If I hadn’t been half-mad with grief, it would have worked.    Why would anyone want to kill Bran?  Robb said.  Gods, he’s only a little boy, helpless, sleeping…   Catelyn gave her firstborn a challenging look.  If you are to rule in the north, you must think these things through, Robb. Answer your own question."
}