{
  "id": "498b0f3e8be45993607e4bc6723a88b72705a4b9",
  "text": "    The boy is innocent.    The boy defiled your marriage bed, else you would surely have sons of your own. He shamed you.    Robert did that. Not the boy. My daughter has grown fond of him. And he is mine own blood.    Your brother’s blood,  Melisandre said.  A king’s blood. Only a king’s blood can wake the stone dragon.   Stannis ground his teeth.  I’ll hear no more of this. The dragons are done. The Targaryens tried to bring them back half a dozen times. And made fools of themselves, or corpses. Patchface is the only fool we need on this godsforsaken rock. You have the leeches. Do your work.   Melisandre bowed her head stiffly, and said,  As my king commands.  Reaching up her left sleeve with her right hand, she flung a handful of powder into the brazier. The coals roared. As pale flames writhed atop them, the red woman retrieved the silver dish and brought it to the king. Davos watched her lift the lid. Beneath were three large black leeches, fat with blood.  The boy’s blood, Davos knew. A king’s blood.  Stannis stretched forth a hand, and his fingers closed around one of the leeches.   Say the name,  Melisandre commanded.  The leech was twisting in the king’s grip, trying to attach itself to one of his fingers.  The usurper,  he said.  Joffrey Baratheon.  When he tossed the leech into the fire, it curled up like an autumn leaf amidst the coals, and burned.  Stannis grasped the second.  The usurper,  he declared, louder this time.  Balon Greyjoy.  He flipped it lightly onto the brazier, and its flesh split and cracked. The blood burst from it, hissing and smoking.  The last was in the king’s hand. This one he studied a moment as it writhed between his fingers.  The usurper,  he said at last.  Robb Stark.  And he threw it on the flames.      Jaime   Harrenhal’s bathhouse was a dim, steamy, low-ceilinged room filled with great stone tubs. When they led Jaime in, they found Brienne seated in one of them, scrubbing her arm almost angrily.   Not so hard, wench,  he called.  You’ll scrub the skin off.  She dropped her brush and covered her teats with hands as big as Gregor Clegane’s. The pointy little buds she was so intent on hiding would have looked more natural on some ten-year-old than they did on her thick muscular chest.   What are you doing here?  she demanded.   Lord Bolton insists I sup with him, but he neglected to invite my fleas.  Jaime tugged at his guard with his left hand.  Help me out of these stinking rags.  One-handed, he could not so much as unlace his breeches. The man obeyed grudgingly, but he obeyed.  Now leave us,  Jaime said when his clothes lay in a pile on the wet stone floor.  My lady of Tarth doesn’t want the likes of you scum gaping at her teats.  He pointed his stump at the hatchet-faced woman attending Brienne.  You too. Wait without. There’s only the one door, and the wench is too big to try and shinny up a chimney.   The habit of obedience went deep. The woman followed his guard out, leaving the bathhouse to the two of them. The tubs were large enough to hold six or seven, after the fashion of the Free Cities, so Jaime climbed in with the wench, awkward and slow. Both his eyes were open, though the right remained somewhat swollen, despite Qyburn’s leeches. Jaime felt a hundred and nine years old, which was a deal better than he had been feeling when he came to Harrenhal.  Brienne shrunk away from him.  There are other tubs.    This one suits me well enough.  Gingerly, he immersed himself up to the chin in the steaming water.  Have no fear, wench. Your thighs are purple and green, and I’m not interested in what you’ve got between them.  He had to rest his right arm on the rim, since Qyburn had warned him to keep the linen dry. He could feel the tension drain from his legs, but his head spun.  If I faint, pull me out. No Lannister has ever drowned in his bath and I don’t mean to be the first.    Why should I care how you die?    You swore a solemn vow.  He smiled as a red flush crept up the thick white column of her neck. She turned her back to him.  Still the shy maiden? What is it that you think I haven’t seen?  He groped for the brush she had dropped, caught it with his fingers, and began to scrub himself desultorily. Even that was difficult, awkward. My left hand is good for nothing.  Still, the water darkened as the caked dirt dissolved off his skin. The wench kept her back to him, the muscles in her great shoulders hunched and hard.   Does the sight of my stump distress you so?  Jaime asked.  You ought to be pleased. I’ve lost the hand I killed the king with. The hand that flung the Stark boy from that tower. The hand I’d slide between my sister’s thighs to make her wet.  He thrust his stump at her face.  No wonder Renly died, with you guarding him.   She jerked to her feet as if he’d struck her, sending a wash of hot water across the tub. Jaime caught a glimpse of the thick blonde bush at the juncture of her thighs as she climbed out. She was much hairier than his sister. Absurdly, he felt his cock stir beneath the bathwater."
}