{
  "id": "4998a791d74adcd34314405e3f8ac5e3c31765b1",
  "text": "  Mayhaps… the king’s council…   Tyrion tapped his wooden spoon against the edge of the bowl.  The council exists to advise the king, Maester.    Just so,  said Pycelle,  and the king—    —is a boy of thirteen. I speak with his voice.    So you do. Indeed. The King’s Own Hand. Yet… your most gracious sister, our Queen Regent, she…    …bears a great weight upon those lovely white shoulders of hers. I have no wish to add to her burdens. Do you?  Tyrion cocked his head and gave the Grand Maester an inquiring stare.  Pycelle dropped his gaze back to his food. Something about Tyrion’s mismatched green-and-black eyes made men squirm; knowing that, he made good use of them.  Ah,  the old man muttered into his plums.  Doubtless you have the right of it, my lord. It is most considerate of you to… spare her this… burden.    That’s just the sort of fellow I am.  Tyrion returned to the unsatisfactory porridge.  Considerate. Cersei is my own sweet sister, after all.    And a woman, to be sure,  Grand Maester Pycelle said.  A most uncommon woman, and yet… it is no small thing, to tend to all the cares of the realm, despite the frailty of her sex…   Oh, yes, she’s a frail dove, just ask Eddard Stark.  I’m pleased you share my concern. And I thank you for the hospitality of your table. But a long day awaits.  He swung his legs out and clambered down from his chair.  Be so good as to inform me at once should we receive a reply from Dorne?     As you say, my lord.    And only me?    Ah… to be sure.  Pycelle’s spotted hand was clutching at his beard the way a drowning man clutches for a rope. It made Tyrion’s heart glad. One, he thought.  He waddled out into the lower bailey; his stunted legs complained of the steps. The sun was well up now, and the castle was stirring. Guardsmen walked the walls, and knights and men-at-arms were training with blunted weapons. Nearby, Bronn sat on the lip of a well. A pair of comely serving girls sauntered past carrying a wicker basket of rushes between them, but the sellsword never looked.  Bronn, I despair of you.  Tyrion gestured at the wenches.  With sweet sights like that before you, all you see is a gaggle of louts raising a clangor.    There are a hundred whorehouses in this city where a clipped copper will buy me all the cunt I want,  Bronn answered,  but one day my life may hang on how close I’ve watched your louts.  He stood.  Who’s the boy in the checkered blue surcoat with the three eyes on his shield?    Some hedge knight. Tallad, he names himself. Why?   Bronn pushed a fall of hair from his eyes.  He’s the best of them. But watch him, he falls into a rhythm, delivering the same strokes in the same order each time he attacks.  He grinned.  That will be the death of him, the day he faces me.    He’s pledged to Joffrey; he’s not like to face you.  They set off across the bailey, Bronn matching his long stride to Tyrion’s short one. These days the sellsword was looking almost respectable. His dark hair was washed and brushed, he was freshly shaved, and he wore the black breastplate of an officer of the City Watch. From his shoulders trailed a cloak of Lannister crimson patterned with golden hands. Tyrion had made him a gift of it when he named him captain of his personal guard.  How many supplicants do we have today?  he inquired.   Thirty odd,  answered Bronn.  Most with complaints, or wanting something, as ever. Your pet was back.   He groaned.  Lady Tanda?    Her page. She invites you to sup with her again. There’s to be a haunch of venison, she says, a brace of stuffed geese sauced with mulberries, and—    —her daughter,  Tyrion finished sourly. Since the hour he had arrived in the Red Keep, Lady Tanda had been stalking him, armed with a never-ending arsenal of lamprey pies, wild boars, and savory cream stews. Somehow she had gotten the notion that a dwarf lordling would be the perfect consort for her daughter Lollys, a large, soft, dim-witted girl who rumor said was still a maid at thirty-and-three.  Send her my regrets.    No taste for stuffed goose?  Bronn grinned evilly.   Perhaps you should eat the goose and marry the maid. Or better still, send Shagga.    Shagga’s more like to eat the maid and marry the goose,  observed Bronn.  Anyway, Lollys outweighs him.    There is that,  Tyrion admitted as they passed under the shadow of a covered walkway between two towers.  Who else wants me?   The sellsword grew more serious.  There’s a moneylender from Braavos, holding fancy papers and the like, requests to see the king about payment on some loan.    As if Joff could count past twenty. Send the man to Littlefinger, he’ll find a way to put him off. Next?    A lordling down from the Trident, says your father’s men burned his keep, raped his wife, and killed all his peasants.    I believe they call that war.  Tyrion smelled Gregor Clegane’s work, or that of Ser Amory Lorch or his father’s other pet hellhound, the Qohorik.  What does he want of Joffrey?    New peasants,  Bronn said.  He walked all this way to sing how loyal he is and beg for recompense."
}