{
  "id": "4ad83ab209bfdfa07d80c1deb7e01dc1cf0039f1",
  "text": " Father had always said that most sellswords would betray anyone for enough gold.  Then one morning she spied three women in the cowled grey robes of the silent sisters loading a corpse into their wagon. The body was sewn into a cloak of the finest silk, decorated with a battle-axe sigil. When Arya asked who it was, one of the guards told her that Lord Cerwyn had died. The words felt like a kick in the belly. He could never have helped you anyway, she thought as the sisters drove the wagon through the gate. He couldn’t even help himself, you stupid mouse.  After that it was back to scrubbing and scurrying and listening at doors. Lord Tywin would soon march on Riverrun, she heard. or he would drive south to Highgarden, no one would ever expect that. No, he must defend King’s Landing, Stannis was the greatest threat. He’d sent Gregor Clegane and Vargo Hoat to destroy Roose Bolton and remove the dagger from his back. He’d sent ravens to the Eyrie, he meant to wed the Lady Lysa Arryn and win the Vale. He’d bought a ton of silver to forge magic swords that would slay the Stark wargs. He was writing Lady Stark to make a peace, the Kingslayer would soon be freed.  Though ravens came and went every day, Lord Tywin himself spent most of his days behind closed doors with his war council. Arya caught glimpses of him, but always from afar—once walking the walls in the company of three maesters and the fat captive with the bushy mustache, once riding out with his lords bannermen to visit the encampments, but most often standing in an arch of the covered gallery watching men at practice in the yard below. He stood with his hands locked together on the gold pommel of his longsword. They said Lord Tywin loved gold most of all; he even shit gold, she heard one squire jest. The Lannister lord was strong-looking for an old man, with stiff golden whiskers and a bald head. There was something in his face that reminded Arya of her own father, even though they looked nothing alike. He has a lord’s face, that’s all, she told herself. She remembered hearing her lady mother tell Father to put on his lord’s face and go deal with some matter. Father had laughed at that. She could not imagine Lord Tywin ever laughing at anything.  One afternoon, while she was waiting her turn to draw a pail of water from the well, she heard the hinges of the east gate groaning. A party of men rode under the portcullis at a walk. When she spied the manticore crawling across the shield of their leader, a stab of hate shot through her.  In the light of day, Ser Amory Lorch looked less frightening than he had by torchlight, but he still had the pig’s eyes she recalled. One of the women said that his men had ridden all the way around the lake chasing Beric Dondarrion and slaying rebels. We weren’t rebels, Arya thought. We were the Night’s Watch; the Night’s Watch takes no side. Ser Amory had fewer men than she remembered, though, and many wounded. I hope their wounds fester. I hope they all die.  Then she saw the three near the end of the column.  Rorge had donned a black halfhelm with a broad iron nasal that made it hard to see that he did not have a nose. Biter rode ponderously beside him on a destrier that looked ready to collapse under his weight. Half-healed burns covered his body, making him even more hideous than before.  But Jaqen H’ghar still smiled. His garb was still ragged and filthy, but he had found time to wash and brush his hair. It streamed down across his shoulders, red and white and shiny, and Arya heard the girls giggling to each other in admiration.  I should have let the fire have them. Gendry said to, I should have listened. If she hadn’t thrown them that axe they’d all be dead. For a moment she was afraid, but they rode past her without a flicker of interest. Only Jaqen H’ghar so much as glanced in her direction, and his eyes passed right over her. He does not know me, she thought. Arry was a fierce little boy with a sword, and I’m just a grey mouse girl with a pail.  She spent the rest of that day scrubbing steps inside the Wailing Tower. By evenfall her hands were raw and bleeding and her arms so sore they trembled when she lugged the pail back to the cellar. Too tired even for food, Arya begged Weese’s pardons and crawled into her straw to sleep.  Weese,  she yawned.  Dunsen, Chiswyck, Polliver, Raff the Sweetling. The Tickler and the Hound. Ser Gregor, Ser Amory, Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei.  She thought she might add three more names to her prayer, but she was too tired to decide tonight.  Arya was dreaming of wolves running wild through the wood when a strong hand clamped down over her mouth like smooth warm stone, solid and unyielding. She woke at once, squirming and struggling.  A girl says nothing,  a voice whispered close behind her ear.  A girl keeps her lips closed, no one hears, and friends may talk in secret. Yes?   Heart pounding, Arya managed the tiniest of nods.  Jaqen H’ghar took his hand away. The cellar was black as pitch and she could not see his face, even inches away."
}