{
  "id": "4b347efa8433ede35de3fe1ccfc421d1f7395753",
  "text": " Now I know I have been too long away from Cersei. He averted his eyes, troubled by his body’s response.  That was unworthy,  he mumbled.  I’m a maimed man, and bitter. Forgive me, wench. You protected me as well as any man could have, and better than most.   She wrapped her nakedness in a towel.  Do you mock me?   That pricked him back to anger.  Are you as thick as a castle wall? That was an apology. I am tired of fighting with you. What say we make a truce?    Truces are built on trust. Would you have me trust—    The Kingslayer, yes. The oathbreaker who murdered poor sad Aerys Targaryen.  Jaime snorted.  It’s not Aerys I rue, it’s Robert. ‘I hear they’ve named you Kingslayer’ he said to me at his coronation feast. ‘Just don’t think to make it a habit.’ And he laughed. Why is it that no one names Robert oathbreaker? He tore the realm apart, yet I am the one with shit for honor.    Robert did all he did for love.  Water ran down Brienne’s legs and pooled beneath her feet.   Robert did all he did for pride, a cunt, and a pretty face.  He made a fist… or would have, if he’d had a hand. Pain lanced up his arm, cruel as laughter.   He rode to save the realm,  she insisted.  To save the realm.  Did you know that my brother set the Blackwater Rush afire? Wildfire will burn on water. Aerys would have bathed in it if he’d dared. The Targaryens were all mad for fire.  Jaime felt lightheaded. It is the heat in here, the poison in my blood, the last of my fever. I am not myself. He eased himself down until the water reached his chin.  Soiled my white cloak… I wore my gold armor that day, but…    Gold armor?  Her voice sounded far off, faint.  He floated in heat, in memory.  After dancing griffins lost the Battle of the Bells, Aerys exiled him.  Why am I telling this absurd ugly child?  He had finally realized that Robert was no mere outlaw lord to be crushed at whim, but the greatest threat House Targaryen had faced since Daemon Blackfyre. The king reminded Lewyn Martell gracelessly that he held Elia and sent him to take command of the ten thousand Dornishmen coming up the kingsroad. Jon Darry and Barristan Selmy rode to Stoney Sept to rally what they could of griffins’ men, and Prince Rhaegar returned from the south and persuaded his father to swallow his pride and summon my father. But no raven returned from Casterly Rock, and that made the king even more afraid. He saw traitors everywhere, and Varys was always there to point out any he might have missed. So His Grace commanded his alchemists to place caches of wildfire all over King’s Landing. Beneath Baelor’s Sept and the hovels of Flea Bottom, under stables and storehouses, at all seven gates, even in the cellars of the Red Keep itself.   Everything was done in the utmost secrecy by a handful of master pyromancers. They did not even trust their own acolytes to help. The queen’s eyes had been closed for years, and Rhaegar was busy marshaling an army. But Aerys’s new mace-and-dagger Hand was not utterly stupid, and with Rossart, Belis, and Garigus coming and going night and day, he became suspicious. Chelsted, that was his name, Lord Chelsted.  It had come back to him suddenly, with the telling.  I’d thought the man craven, but the day he confronted Aerys he found some courage somewhere. He did all he could to dissuade him. He reasoned, he jested, he threatened, and finally he begged. When that failed he took off his chain of office and flung it down on the floor. Aerys burnt him alive for that, and hung his chain about the neck of Rossart, his favorite pyromancer. The man who had cooked Lord Rickard Stark in his own armor. And all the time, I stood by the foot of the Iron Throne in my white plate, still as a corpse, guarding my liege and all his sweet secrets.   My Sworn Brothers were all away, you see, but Aerys liked to keep me close. I was my father’s son, so he did not trust me. He wanted me where Varys could watch me, day and night. So I heard it all.  He remembered how Rossart’s eyes would shine when he unrolled his maps to show where the substance must be placed. Garigus and Belis were the same.  Rhaegar met Robert on the Trident, and you know what happened there. When the word reached court, Aerys packed the queen off to Dragonstone with Prince Viserys. Princess Elia would have gone as well, but he forbade it. Somehow he had gotten it in his head that Prince Lewyn must have betrayed Rhaegar on the Trident, but he thought he could keep Dorne loyal so long as he kept Elia and Aegon by his side. The traitors want my city, I heard him tell Rossart, but I’ll give them naught but ashes. Let Robert be king over charred bones and cooked meat. The Targaryens never bury their dead, they burn them. Aerys meant to have the greatest funeral pyre of them all. Though if truth be told, I do not believe he truly expected to die. Like Aerion Brightfire before him, Aerys thought the fire would transform him… that he would rise again, reborn as a dragon, and turn all his enemies to ash."
}