{
  "id": "4c50be44033286ecfc970c83181d462e61968e3d",
  "text": "  He looked contrite. The look brought back vivid memories for Catelyn. He had been a sly child, but after his mischiefs he always looked contrite; it was a gift he had. The years had not changed him much. Petyr had been a small boy, and he had grown into a small man, an inch or two shorter than Catelyn, slender and quick, with the sharp features she remembered and the same laughing grey-green eyes. He had a little pointed chin beard now, and threads of silver in his dark hair, though he was still shy of thirty. They went well with the silver mockingbird that fastened his cloak. Even as a child, he had always loved his silver.   How did you know I was in the city?  she asked him.   Lord Varys knows all,  Petyr said with a sly smile.  He will be joining us shortly, but I wanted to see you alone first. It has been too long, Cat. How many years?   Catelyn ignored his familiarity. There were more important questions.  So it was the King’s Spider who found me.   Littlefinger winced.  You don’t want to call him that. He’s very sensitive. Comes of being an eunuch, I imagine. Nothing happens in this city without Varys knowing. Oftimes he knows about it before it happens. He has informants everywhere. His little birds, he calls them. One of his little birds heard about your visit. Thankfully, Varys came to me first.    Why you?   He shrugged.  Why not me? I am master of coin, the king’s own councillor. Selmy and Lord Renly rode north to meet Robert, and Lord Stannis is gone to Dragonstone, leaving only Maester Pycelle and me. I was the obvious choice. I was ever a friend to your sister Lysa, Varys knows that.    Does Varys know about…    Lord Varys knows everything… except why you are here.  He lifted an eyebrow.  Why are you here?    A wife is allowed to yearn for her husband, and if a mother needs her daughters close, who can tell her no?   Littlefinger laughed.  Oh, very good, my lady, but please don’t expect me to believe that. I know you too well. What were the Tully words again?   Her throat was dry.  Family, Duty, Honor,  she recited stiffly. He did know her too well.   Family, Duty, Honor,  he echoed.  All of which required you to remain in Winterfell, where our Hand left you. No, my lady, something has happened. This sudden trip of yours bespeaks a certain urgency. I beg of you, let me help. Old sweet friends should never hesitate to rely upon each other.  There was a soft knock on the door.  Enter,  Littlefinger called out.  The man who stepped through the door was plump, perfumed, powdered, and as hairless as an egg. He wore a vest of woven gold thread over a loose gown of purple silk, and on his feet were pointed slippers of soft velvet.  Lady Stark,  he said, taking her hand in both of his,  to see you again after so many years is such a joy.  His flesh was soft and moist, and his breath smelled of lilacs.  Oh, your poor hands. Have you burned yourself, sweet lady? The fingers are so delicate… Our good Maester Pycelle makes a marvelous salve, shall I send for a jar?   Catelyn slid her fingers from his grasp.  I thank you, my lord, but my own Maester Luwin has already seen to my hurts.   Varys bobbed his head.  I was grievous sad to hear about your son. And him so young. The gods are cruel.    On that we agree, Lord Varys,  she said. The title was but a courtesy due him as a council member; Varys was lord of nothing but the spiderweb, the master of none but his whisperers.  The eunuch spread his soft hands.  On more than that, I hope, sweet lady. I have great esteem for your husband, our new Hand, and I know we do both love King Robert.    Yes,  she was forced to say.  For a certainty.    Never has a king been so beloved as our Robert,  quipped Littlefinger. He smiled slyly.  At least in Lord Varys’s hearing.    Good lady,  Varys said with great solicitude.  There are men in the Free Cities with wondrous healing powers. Say only the word, and I will send for one for your dear Bran.    Maester Luwin is doing all that can be done for Bran,  she told him. She would not speak of Bran, not here, not with these men. She trusted Littlefinger only a little, and Varys not at all. She would not let them see her grief.  Lord Baelish tells me that I have you to thank for bringing me here.   Varys giggled like a little girl.  Oh, yes. I suppose I am guilty. I hope you forgive me, kind lady.  He eased himself down into a seat and put his hands together.  I wonder if we might trouble you to show us the dagger?   Catelyn Stark stared at the eunuch in stunned disbelief. He was a spider, she thought wildly, an enchanter or worse. He knew things no one could possibly know, unless… What have you done to Ser Rodrik?  she demanded.  Littlefinger was lost.  I feel rather like the knight who arrives at the battle without his lance. What dagger are we talking about? Who is Ser Rodrik?    Ser Rodrik Cassel is master-at-arms at Winterfell,  Varys informed him.  I assure you, Lady Stark, nothing at all has been done to the good knight."
}