{
  "id": "4c7ce49e6c6b88871abb8d2c5cc68193e09cff41",
  "text": " Jaime held up the hand in question for his father’s inspection.  Four fingers, a thumb, much like the other. Why shouldn’t it work as well?    Good.  His father sat.  That is good. I have a gift for you. For your return. After Varys told me…    Unless it’s a new hand, let it wait.  Jaime took the chair across from him.  How did Joffrey die?    Poison. It was meant to appear as though he choked on a morsel of food, but I had his throat slit open and the maesters could find no obstruction.    Cersei claims that Tyrion did it.    Your brother served the king the poisoned wine, with a thousand people looking on.    That was rather foolish of him.    I have taken Tyrion’s squire into custody. His wife’s maids as well. We shall see if they have anything to tell us. Ser Addam’s gold cloaks are searching for the Stark girl, and Varys has offered a reward. The king’s justice will be done.   The king’s justice.  You would execute your own son?    He stands accused of regicide and kinslaying. If he is innocent, he has nothing to fear. First we must needs consider the evidence for and against him.   Evidence. In this city of liars, Jaime knew what sort of evidence would be found.  Renly died strangely as well, when Stannis needed him to.    Lord Renly was murdered by one of his own guards, some woman from Tarth.    That woman from Tarth is the reason I’m here. I tossed her into a cell to appease Ser Loras, but I’ll believe in Renly’s ghost before I believe she did him any harm. But Stannis—    It was poison that killed Joffrey, not sorcery.  Lord Tywin glanced at Jaime’s stump again.  You cannot serve in the Kingsguard without a sword hand—    I can,  he interrupted.  And I will. There’s precedent. I’ll look in the White Book and find it, if you like. Crippled or whole, a knight of the Kingsguard serves for life.    Cersei ended that when she replaced Ser Barristan on grounds of age. A suitable gift to the Faith will persuade the High Septon to release you from your vows. Your sister was foolish to dismiss Selmy, admittedly, but now that she has opened the gates—    —someone needs to close them again.  Jaime stood.  I am tired of having highborn women kicking pails of shit at me, Father. No one ever asked me if I wanted to be Lord Commander of the Kingsguard, but it seems I am. I have a duty—    You do.  Lord Tywin rose as well.  A duty to House Lannister. You are the heir to Casterly Rock. That is where you should be. Tommen should accompany you, as your ward and squire. The Rock is where he’ll learn to be a Lannister, and I want him away from his mother. I mean to find a new husband for Cersei. Oberyn Martell perhaps, once I convince Lord Tyrell that the match does not threaten Highgarden. And it is past time you were wed. The Tyrells are now insisting that Margaery be wed to Tommen, but if I were to offer you instead—    NO!  Jaime had heard all that he could stand. No, more than he could stand. He was sick of it, sick of lords and lies, sick of his father, his sister, sick of the whole bloody business.  No. No. No. No. No. How many times must I say no before you’ll hear it? Oberyn Martell? The man’s infamous, and not just for poisoning his sword. He has more bastards than Robert, and beds with boys as well. And if you think for one misbegotten moment that I would wed Joffrey’s widow…    Lord Tyrell swears the girl’s still maiden.    She can die a maiden as far as I’m concerned. I don’t want her, and I don’t want your Rock!    You are my son—    I am a knight of the Kingsguard. The Lord Commander of the Kingsguard! And that’s all I mean to be!   Firelight gleamed golden in the stiff whiskers that framed Lord Tywin’s face. A vein pulsed in his neck, but he did not speak. And did not speak. And did not speak.  The strained silence went on until it was more than Jaime could endure.  Father…  he began.   You are not my son.  Lord Tywin turned his face away.  You say you are the Lord Commander of the Kingsguard, and only that. Very well, ser. Go do your duty.       Davos   Their voices rose like cinders, swirling up into purple evening sky.  Lead us from the darkness, O my Lord. Fill our hearts with fire, so we may walk your shining path.   The nightfire burned against the gathering dark, a great bright beast whose shifting orange light threw shadows twenty feet tall across the yard. All along the walls of Dragonstone the army of gargoyles and grotesques seemed to stir and shift.  Davos looked down from an arched window in the gallery above. He watched Melisandre lift her arms, as if to embrace the shivering flames.  R’hllor,  she sang in a voice loud and clear,  you are the light in our eyes, the fire in our hearts, the heat in our loins. Yours is the sun that warms our days, yours the stars that guard us in the dark of night.    Lord of Light, defend us. The night is dark and full of terrors.  Queen Selyse led the responses, her pinched face full of fervor. King Stannis stood beside her, jaw clenched hard, the points of his red-gold crown shimmering whenever he moved his head."
}