{
  "id": "4d3e419892f01cef3930624fba019ba67bf987ac",
  "text": " Her oars slid down into the water.  Then he heard a short sharp woof, as if someone had blown in his ear. Half a heartbeat later came the roar. The deck vanished beneath him, and black water smashed him across the face, filling his nose and mouth. He was choking, drowning. Unsure which way was up, Davos wrestled the river in blind panic until suddenly he broke the surface. He spat out water, sucked in air, grabbed hold of the nearest chunk of debris, and held on.  Swordfish and the hulk were gone, blackened bodies were floating downstream beside him, and choking men clinging to bits of smoking wood. Fifty feet high, a swirling demon of green flame danced upon the river. It had a dozen hands, in each a whip, and whatever they touched burst into fire. He saw Black Betha burning, and White Hart and Loyal Man to either side. Piety, Cat, Courageous, Sceptre, Red Raven, Harridan, Faithful, Fury, they had all gone up, Kingslander and Godsgrace as well, the demon was eating his own. Lord Velaryon’s shining Pride of Driftmark was trying to turn, but the demon ran a lazy green finger across her silvery oars and they flared up like so many tapers. For an instant she seemed to be stroking the river with two banks of long bright torches.  The current had him in its teeth by then, spinning him around and around. He kicked to avoid a floating patch of wildfire. My sons, Davos thought, but there was no way to look for them amidst the roaring chaos. Another hulk heavy with wildfire went up behind him. The Blackwater itself seemed to boil in its bed, and burning spars and burning men and pieces of broken ships filled the air.  I’m being swept out into the bay. It wouldn’t be as bad there; he ought to be able to make shore, he was a strong swimmer. Salladhor Saan’s galleys would be out in the bay as well, Ser Imry had commanded them to stand off…  And then the current turned him about again, and Davos saw what awaited him downstream.  The chain. Gods save us, they’ve raised the chain.  Where the river broadened out into Blackwater Bay, the boom stretched taut, a bare two or three feet above the water. Already a dozen galleys had crashed into it, and the current was pushing others against them. Almost all were aflame, and the rest soon would be. Davos could make out the striped hulls of Salladhor Saan’s ships beyond, but he knew he would never reach them. A wall of red-hot steel, blazing wood, and swirling green flame stretched before him. The mouth of the Blackwater Rush had turned into the mouth of hell.      TYRION  Motionless as a gargoyle, Tyrion Lannister hunched on one knee atop a merlon. Beyond the Mud Gate and the desolation that had once been the fishmarket and wharves, the river itself seemed to have taken fire. Half of Stannis’s fleet was ablaze, along with most of Joffrey’s. The kiss of wildfire turned proud ships into funeral pyres and men into living torches. The air was full of smoke and arrows and screams.  Downstream, commoners and highborn captains alike could see the hot green death swirling toward their rafts and carracks and ferries, borne on the current of the Blackwater. The long white oars of the Myrish galleys flashed like the legs of maddened centipedes as they fought to come about, but it was no good. The centipedes had no place to run.  A dozen great fires raged under the city walls, where casks of burning pitch had exploded, but the wildfire reduced them to no more than candles in a burning house, their orange and scarlet pennons fluttering insignificantly against the jade holocaust. The low clouds caught the color of the burning river and roofed the sky in shades of shifting green, eerily beautiful. A terrible beauty. Like dragonfire. Tyrion wondered if Aegon the Conqueror had felt like this as he flew above his Field of Fire.  The furnace wind lifted his crimson cloak and beat at his bare face, yet he could not turn away. He was dimly aware of the gold cloaks cheering from the hoardings. He had no voice to join them. It was a half victory. It will not be enough.  He saw another of the hulks he’d stuffed full of King Aerys’s fickle fruits engulfed by the hungry flames. A fountain of burning jade rose from the river the blast so bright he had to shield his eyes. Plumes of fire thirty and forty feet high danced upon the waters, crackling and hissing. For a few moments they washed out the screams. There were hundreds in the water, drowning or burning or doing a little of both.  Do you hear them shrieking, Stannis? Do you see them burning? This is your work as much as mine. Somewhere in that seething mass of men south of the Blackwater, Stannis was watching too, Tyrion knew. He’d never had his brother Robert’s thirst for battle. He would command from the rear, from the reserve, much as Lord Tywin Lannister was wont to do. Like as not, he was sitting a warhorse right now, clad in bright armor, his crown upon his head. A crown of red gold, Varys says, its points fashioned in the shapes of flames.   My ships."
}