{
  "id": "4da32d9540007780cf09ef2a7f76f24b63802e38",
  "text": " But  Bessa the Barmaid  won them back with its ribald lyrics. Peacocks were served in their plumage, roasted whole and stuffed with dates, while Collio summoned a drummer, bowed low before Lord Tywin, and launched into  The Rains of Castamere.   If I have to hear seven versions of that, I may go down to Flea Bottom and apologize to the stew. Tyrion turned to his wife.  So which did you prefer?   Sansa blinked at him.  My lord?    The singers. Which did you prefer?    I… I’m sorry, my lord. I was not listening.   She was not eating, either.  Sansa, is aught amiss?  He spoke without thinking, and instantly felt the fool. All her kin are slaughtered and she’s wed to me, and I wonder what’s amiss.   No, my lord.  She looked away from him, and feigned an unconvincing interest in Moon Boy pelting Ser Dontos with dates.  Four master pyromancers conjured up beasts of living flame to tear at each other with fiery claws whilst the serving men ladeled out bowls of blandissory, a mixture of beef broth and boiled wine sweetened with honey and dotted with blanched almonds and chunks of capon. Then came some strolling pipers and clever dogs and sword swallowers, with buttered pease, chopped nuts, and slivers of swan poached in a sauce of saffron and peaches. ( Not swan again,  Tyrion muttered, remembering his supper with his sister on the eve of battle.) A juggler kept a half-dozen swords and axes whirling through the air as skewers of blood sausage were brought sizzling to the tables, a juxtaposition that Tyrion thought passing clever, though not perhaps in the best of taste.  The heralds blew their trumpets.  To sing for the golden lute,  one cried,  we give you Galyeon of Cuy.   Galyeon was a big barrel-chested man with a black beard, a bald head, and a thunderous voice that filled every corner of the throne room. He brought no fewer than six musicians to play for him.  Noble lords and ladies fair, I sing but one song for you this night,  he announced.  It is the song of the Blackwater, and how a realm was saved.  The drummer began a slow ominous beat.   The dark lord brooded high in his tower,  Galyeon began,  in a castle as black as the night.    Black was his hair and black was his soul,  the musicians chanted in unison. A flute came in.   He feasted on bloodlust and envy, and filled his cup full up with spite,  sang Galyeon.  My brother once ruled seven kingdoms, he said to his harridan wife. I’ll take what was his and make it all mine. Let his son feel the point of my knife.    A brave young boy with hair of gold,  his players chanted, as a woodharp and a fiddle began to play.   if I am ever Hand again, the first thing I’ll do is hang all the singers,  said Tyrion, too loudly.  Lady Leonette laughed lightly beside him, and Ser Garlan leaned over to say,  A valiant deed unsung is no less valiant.    The dark lord assembled his legions, they gathered around him like crows. And thirsty for blood they boarded their ships…    …and cut off poor Tyrion’s nose,  Tyrion finished.  Lady Leonette giggled.  Perhaps you should be a singer, my lord. You rhyme as well as this Galyeon.    No, my lady,  Ser Garlan said.  My lord of Lannister was made to do great deeds, not to sing of them. But for his chain and his wildfire, the foe would have been across the river. And if Tyrion’s wildlings had not slain most of Lord Stannis’s scouts, we would never have been able to take him unawares.   His words made Tyrion feel absurdly grateful, and helped to mollify him as Galyeon sang endless verses about the valor of the boy king and his mother, the golden queen.   She never did that,  Sansa blurted out suddenly.   Never believe anything you hear in a song, my lady.  Tyrion summoned a serving man to refill their wine cups.  Soon it was full night outside the tall windows, and still Galyeon sang on. His song had seventy-seven verses, though it seemed more like a thousand. One for every guest in the hall. Tyrion drank his way through the last twenty or so, to help resist the urge to stuff mushrooms in his ears. By the time the singer had taken his bows, some of the guests were drunk enough to begin providing unintentional entertainments of their own. Grand Maester Pycelle fell asleep while dancers from the Summer Isles swirled and spun in robes made of bright feathers and smoky silk. Roundels of elk stuffed with ripe blue cheese were being brought out when one of Lord Rowan’s knights stabbed a Dornishman. The gold cloaks dragged them both away, one to a cell to rot and the other to get sewn up by Maester Ballabar.  Tyrion was toying with a leche of brawn, spiced with cinnamon, cloves, sugar, and almond milk, when King Joffrey lurched suddenly to his feet.  Bring on my royal jousters!  he shouted in a voice thick with wine, clapping his hands together.  My nephew is drunker than I am, Tyrion thought as the gold cloaks opened the great doors at the end of the hall. From where he sat, he could only see the tops of two striped lances as a pair of riders entered side by side."
}