{
  "id": "4fda9848b7bd423a5e7f21d4dd78fbb981d69097",
  "text": " Then came lamprey pie, honeyed ham, buttered carrots, white beans and bacon, and roast swan stuffed with mushrooms and oysters. Tyrion was exceedingly courteous; he offered his sister the choice portions of every dish, and made certain he ate only what she did. Not that he truly thought she’d poison him, but it never hurt to be careful.  The news about the Starks had soured her, he could see.  We’ve had no word from Bitterbridge?  she asked anxiously as she speared a bit of apple on the point of her dagger and ate it with small, delicate bites.   None.    I’ve never trusted Littlefinger. For enough coin, he’d go over to Stannis in a heartbeat.    Stannis Baratheon is too bloody righteous to buy men. Nor would he make a comfortable lord for the likes of Petyr. This war has made for some queer bedfellows, I agree, but those two? No.   As he carved some slices off the ham, she said,  We have Lady Tanda to thank for the pig.    A token of her love?    A bribe. She begs leave to return to her castle. Your leave as well as mine. I suspect she fears you’ll arrest her on the road, as you did Lord Gyles.    Does she plan to make off with the heir to the throne?  Tyrion served his sister a cut of ham and took one for himself.  I’d sooner she remain. If she wants to feel safe, tell her to bring down her garrison from Stokeworth. As many men as she has.    If we need men so badly, why did you send away your savages?  A certain testiness crept into Cersei’s voice.   It was the best use I could have made of them,  he told her truthfully.  They’re fierce warriors, but not soldiers. In formal battle, discipline is more important than courage. They’ve already done us more good in the kingswood than they would ever have done us on the city walls.   As the swan was being served, the queen questioned him about the conspiracy of the Antler Men. She seemed more annoyed than afraid.  Why are we plagued with so many treasons? What injury has House Lannister ever done these wretches?    None,  said Tyrion,  but they think to be on the winning side… which makes them fools as well as traitors.    Are you certain you’ve found them all?    Varys says so.  The swan was too rich for his taste.  A line appeared on Cersei’s pale white brow, between those lovely eyes.  You put too much trust in that eunuch.    He serves me well.    Or so he’d have you believe. You think you’re the only one he whispers secrets to? He gives each of us just enough to convince us that we’d be helpless without him. He played the same game with me, when I first wed Robert. For years, I was convinced I had no truer friend at court, but now…  She studied his face for a moment.  He says you mean to take the Hound from Joffrey.   Damn Varys.  I need Clegane for more important duties.    Nothing is more important than the life of the king.    The life of the king is not at risk. Joff will have brave Ser Osmund guarding him, and Meryn Trant as well.  They’re good for nothing better.  I need Balon Swann and the Hound to lead sorties, to make certain Stannis gets no toehold on our side of the Blackwater.    Jaime would lead the sorties himself.    From Riverrun? That’s quite a sortie.    Joff’s only a boy.    A boy who wants to be part of this battle, and for once he’s showing some sense. I don’t intend to put him in the thick of the fighting, but he needs to be seen. Men fight more fiercely for a king who shares their peril than one who hides behind his mother’s skirts.    He’s thirteen, Tyrion.    Remember Jaime at thirteen? If you want the boy to be his father’s son, let him play the part. Joff wears the finest armor gold can buy, and he’ll have a dozen gold cloaks around him at all times. If the city looks to be in the least danger of falling, I’ll have him escorted back to the Red Keep at once.   He had thought that might reassure her, but he saw no sign of pleasure in those green eyes.  Will the city fall?    No.  But if it does, pray that we can hold the Red Keep long enough for our lord father to march to our relief.   You’ve lied to me before, Tyrion.    Always with good reason, sweet sister. I want amity between us as much as you do. I’ve decided to release Lord Gyles.  He had kept Gyles safe for just this gesture.  You can have Ser Boros Blount back as well.   The queen’s mouth tightened.  Ser Boros can rot at Rosby,  she said,  but Tommen—    —stays where he is. He’s safer under Lord Jacelyn’s protection than he would ever have been with Lord Gyles.   Serving men cleared away the swan, hardly touched. Cersei beckoned for the sweet.  I hope you like blackberry tarts.    I love all sorts of tarts.    Oh, I’ve known that a long while. Do you know why Varys is so dangerous?    Are we playing at riddles now? No.    He doesn’t have a cock.    Neither do you.  And don’t you just hate that, Cersei?   Perhaps I’m dangerous too. You, on the other hand, are as big a fool as every other man. That worm between your legs does half your thinking.   Tyrion licked the crumbs off his fingers."
}