{
  "id": "513b03b79485f06927b529b0ce0f1dae2d3e8ccf",
  "text": "       He rose clumsily and bowed  in dwarf-fashion, saying: `Yet more fair is  the living land of  Lurien, and the Lady Galadriel is above  all the  jewels  that lie beneath the earth! '       There was  a silence.  At length Celeborn spoke again. `I did  not know  that your plight was so evil,' he said. `Let Gimli  forget my harsh words: I  spoke in  the trouble of  my heart. I will do what I  can  to aid you,  each  according  to his wish and need, but especially  that one of the little folk   who bears the burden.'       'Your quest is known to us,' said Galadriel, looking at Frodo. `But  we  will not here speak of it more openly. Yet not in vain will it prove, maybe,  that you came to this land seeking aid, as Gandalf himself plainly purposed.   For  the  Lord of  the  Galadhrim is  accounted the wisest of  the Elves  of  Middle-earth, and a giver of  gifts beyond  the power of kings. He has dwelt   in  the  West  since  the days of  dawn, and  I have dwelt  with  him  years  uncounted;  for  ere the fall of Nargothrond or Gondolin  I  passed over the  mountains, and together through ages  of  the world we have fought  the long  defeat.       'I it was who first summoned  the White Council. And  if my designs had  not  gone amiss, it would  have been  governed by Gandalf the Grey, and then  mayhap things would have  gone otherwise. But even now there is hope left. I  will not give you  counsel, saying do this,  or do that. For not in doing or   contriving, nor  in  choosing between this course and another, can  I avail;  but  only in knowing what was  and is, and in part also  what shall  be. But  this I will  say to you: your Quest  stands upon the edge of a knife.  Stray  but a little and it will fail, to the ruin  of  all. Yet hope remains  while  all the Company is true.'       And  with that word  she held them with her eyes, and in silence looked  searchingly at  each  of them  in turn. None save  Legolas and Aragorn could  long endure her glance. Sam quickly blushed and hung his head.       At  length  the  Lady Galadriel  released them from her  eyes,  and she  smiled. `Do not let your hearts be troubled,' she said. 'Tonight  you  shall  sleep in peace.' Then they sighed and felt suddenly weary, as those who have  been questioned long and deeply, though no words had been spoken openly.        `Go now! ' said Celeborn. `You are worn with sorrow and much toil. Even  if  your Quest did  not concern us  closely, you should  have refuge in this  City, until you were  healed and refreshed. Now  you shall rest, and we will   ####-not speak of your further road for a while.'       That night the Company slept upon the ground, much  to the satisfaction  of the hobbits. The Elves spread for them a pavilion  among  the trees  near  the fountain, and in it they laid soft couches; then speaking words of peace  with fair  elvish voices they left  them.  For a little while the travellers  talked of their night  before in the tree-tops, and of  their day's journey,  and of the Lord and  Lady;  for they had not yet the  heart to  look further   back.       `What  did you  blush for, Sam?  ' said  Pippin. `You soon  broke down.  Anyone would have thought you had a guilty conscience. I hope it was nothing  worse than a wicked plot to steal one of my blankets.'       `I never thought no such thing,' answered Sam, in no mood for jest. 'If  you  want to know, I felt as if I hadn't  got nothing on,  and I didn't like  it. She seemed to be looking inside  me and asking me what I would do if she  gave me the chance of  flying back home to the Shire to a nice  little  hole  with-with a bit of garden of my own.'       `That's funny,' said Merry. 'Almost  exactly what I felt  myself; only,  only well, I don't think I'II say any more,' he ended lamely.       All  of them, it seemed, had fared  alike:  each  had felt that  he was  offered a choice between a shadow full of fear that lay ahead, and something  that he greatly  desired: clear before his mind it lay, and to get it he had  only to  turn  aside from the road and  leave the Quest and  the war against  Sauron to others.        `And it seemed  to me, too,'  said Gimli, `that my choice  would remain  secret and known only to myself.'       'To me it seemed exceedingly strange,' said Boromir. `Maybe it was only  a test,  and she thought to read our thoughts  for her own good purpose; but  almost I  should  have said that she was tempting us, and offering  what she  pretended to have the power to give. It  need not be  said that I refused to  listen. The Men of Minas Tirith are true to their word.' But what he thought  that the Lady had offered him Boromir did not tell.       And as for Frodo, he would  not speak, though  Boromir pressed him with  questions. `She held you long in her gaze, Ring-bearer,' he said.       `Yes,'  said Frodo; `but whatever  came into my  mind  then I will keep  there.'       `Well, have a care!  ' said  Boromir.  `I do not feel too sure  of this  Elvish Lady and her purposes."
}