{
  "id": "5185cc6c24e349da754b85730e644adc75e33b4f",
  "text": "  You must have a new husband in your bed, to father children on you.    Three children is quite sufficient. I am Queen of the Seven Kingdoms, not a brood mare! The Queen Regent!    You are my daughter, and will do as I command.   She stood.  I will not sit here and listen to this—    You will if you wish to have any voice in the choice of your next husband,  Lord Tywin said calmly.  When she hesitated, then sat, Tyrion knew she was lost, despite her loud declaration of,  I will not marry again!    You will marry and you will breed. Every child you birth makes Stannis more a liar.  Their father’s eyes seemed to pin her to her chair.  Mace Tyrell, Paxter Redwyne, and Doran Martell are wed to younger women likely to outlive them. Balon Greyjoy’s wife is elderly and failing, but such a match would commit us to an alliance with the Iron Islands, and I am still uncertain whether that would be our wisest course.    No,  Cersei said from between white lips.  No, no, no.   Tyrion could not quite suppress the grin that came to his lips at the thought of packing his sister off to Pyke. Just when I was about to give up praying, some sweet god gives me this.  Lord Tywin went on.  Oberyn Martell might suit, but the Tyrells would take that very ill. So we must look to the sons. I assume you do not object to wedding a man younger than yourself?    I object to wedding any—    I have considered the Redwyne twins, Theon Greyjoy, Quentyn Martell, and a number of others. But our alliance with Highgarden was the sword that broke Stannis. It should be tempered and made stronger. Ser Loras has taken the white and Ser Garlan is wed to one of the Fossoways, but there remains the eldest son, the boy they scheme to wed to Sansa Stark.   Willas Tyrell. Tyrion was taking a wicked pleasure in Cersei’s helpless fury.  That would be the cripple,  he said.  Their father chilled him with a look.  Willas is heir to Highgarden, and by all reports a mild and courtly young man, fond of reading books and looking at the stars. He has a passion for breeding animals as well, and owns the finest hounds, hawks, and horses in the Seven Kingdoms.   A perfect match, mused Tyrion. Cersei also has a passion for breeding. He pitied poor Willas Tyrell, and did not know whether he wanted to laugh at his sister or weep for her.   The Tyrell heir would be my choice,  Lord Tywin concluded,  but if you would prefer another, I will hear your reasons.    That is so very kind of you, Father,  Cersei said with icy courtesy.  It is such a difficult choice you give me. Who would I sooner take to bed, the old squid or the crippled dog boy? I shall need a few days to consider. Do I have your leave to go?   You are the queen, Tyrion wanted to tell her. He ought to be begging leave of you.   Go,  their father said.  We shall talk again after you have composed yourself. Remember your duty.   Cersei swept stiffly from the room, her rage plain to see. Yet in the end she will do as Father bid. She had proved that with Robert. Though there is Jaime to consider. Their brother had been much younger when Cersei wed the first time; he might not acquiesce to a second marriage quite so easily. The unfortunate Willas Tyrell was like to contract a sudden fatal case of sword-through-bowels, which could rather sour the alliance between Highgarden and Casterly Rock. I should say something, but what? Pardon me, Father, but it’s our brother she wants to marry?   Tyrion.   He gave a resigned smile.  Do I hear the herald summoning me to the lists?    Your whoring is a weakness in you,  Lord Tywin said without preamble,  but perhaps some share of the blame is mine. Since you stand no taller than a boy, I have found it easy to forget that you are in truth a man grown, with all of a man’s baser needs. It is past time you were wed.   I was wed, or have you forgotten? Tyrion’s mouth twisted, and the noise emerged that was half laugh and half snarl.   Does the prospect of marriage amuse you?    Only imagining what a bugger-all handsome bridegroom I’ll make.  A wife might be the very thing he needed. If she brought him lands and a keep, it would give him a place in the world apart from Joffrey’s court… and away from Cersei and their father.  On the other hand, there was Shae. She will not like this, for all she swears that she is content to be my whore.  That was scarcely a point to sway his father, however, so Tyrion squirmed higher in his seat and said,  You mean to wed me to Sansa Stark. But won’t the Tyrells take the match as an affront, if they have designs on the girl?    Lord Tyrell will not broach the matter of the Stark girl until after Joffrey’s wedding. If Sansa is wed before that, how can he take offense, when he gave us no hint of his intentions?    Quite so,  said Ser Kevan,  and any lingering resentments should be soothed by the offer of Cersei for his Willas.   Tyrion rubbed at the raw stub of his nose. The scar tissue itched abominably sometimes.  His Grace the royal pustule has made Sansa’s life a misery since the day her father died, and now that she is finally rid of Joffrey you propose to marry her to me."
}