{
  "id": "526631ec2373f4d79bfc2fc89c113a8d93a28c10",
  "text": "  Hoping  desperately  that Bilbo  had  not  been  caught  the  dwarves went  on. Not  fast enough, though. They were sick and weary, and they could not go much better  than a hobble and a wobble, though many of the spiders were close behind. Every  now  and  then  they  had  to  turn  and  fight  the  creatures  that were  overtaking  them  and  already  some  spiders  were  in  the  trees  above  them  and  throwing  down  their  long clinging threads.  Things  were  looking  pretty  bad  again,  when  suddenly  Bilbo  appeared  and  charged into the astonished spiders unexpectedly from the side.   ####-\"Go  on!  Go  on!\"  he  shouted.  \"I  will  do  the  stinging!\"  And  he did. He darted  backwards  and  forwards,  slashing  at  spider-threads,  hacking  at  their  legs,  and  stabbing  at  their  fat  bodies  if  they  came  too  near.  The  spiders  swelled  with  rage,  and  spluttered  and  frothed,  and  hissed  out  horrible  curses;  but  they  had  become  mortally afraid of Sting, and dared not come very near, now that it had come back.  So curse as  they would,  their prey moved slowly but steadily away. It was a most  terrible business, and seemed to take hours. But at last, just when Bilbo felt that he  could  not  lift  his  hand  for  a  single  stroke  more,  the  spiders  suddenly  gave  it  up,  and followed them no more, but went back disappointed to their dark colony.   The  dwarves  then  noticed  that  they  had  come  to  the  edge  of  a  ring where  elf- fires  had  been.  Whether  it  was  one  of  those  they  had  seen  the  night  before,  they  could  not  tell. But  it  seemed  that  some  good magic  lingered  in  such  spots, which  the spiders did not like. At any rate here the light was greener, and the boughs less  thick and threatening, and they had a chance to rest and draw breath.  There they lay for some time, puffing and panting. put very soon they began to  ask questions. They had to have the whole vanishing business carefully explained,  and  the  finding  of  the  ring  interested  them  so  much  that  for  a  while  they  forgot  their own troubles. Balin in particular insisted on having the Gollum story, riddles  and  all,  told  all  over  again, with  the  ring  in  its  proper  place. But  after  a  time  the  light  began  to  fail,  and  then  other  questions  were  asked.  Where  were  they,  and  where was their path, and where was there any food, and what were they going to  do  next?  These  questions  they  asked  over  and  over  again,  and  it  was  from  little  Bilbo  that  they seemed  to expect  to get  the answers. From which you can see  that  they had changed their opinion of Mr. Baggins very much, and had begun to have  a  great  respect  for  him  (as  Gandalf  had  said  they  would).  Indeed  they  really  expected  him  to  think  of  some  wonderful  plan  for  helping  them,  and  were  not  merely  grumbling.  They  knew  only  too  well  that  they  would  soon  all  have  been  dead, if it had not been for the hobbit; and they thanked him many times. Some of  them even got up and bowed right to the ground before him, though they fell over  with  the  effort,  and  could  not  get  on  their  legs  again  for  some  time. Knowing  the  truth about  the vanishing did not  lessen  their opinion of Bilbo at all;  for  they saw  that  he  had  some  wits,  as  well  as  luck  and  a  magic  ring-and  all  three  are  very  useful possessions. In fact they praised him so much that Bilbo began to feel there  really  was  something  of  a  bold  adventurer  about  himself  after  all,  though  he  I  would have felt a lot bolder still, if there had been anything to eat.  But there was nothing, nothing at all; and none of them Were fit to go and look  for  anything,  or  to  search  for  the  lost  path.  The  lost  path!  No  other  idea  would   ####-come into Bilbo's tired head. He just sat staring in front of him at the endless trees;  and  after  a while  they  all  fell  silent  again. All  except Balin. Long  after  the others  had  stopped  talking  and  shut  their  eyes,  he  kept  on  muttering  and  chuckling  to  himself.  \"Gollum! Well I'm blest! So that's how he sneaked past me is it? Now I know!  Just  crept  quietly  along  did  you,  Mr.  Baggins?  Buttons  all  over  the  doorstep?  Good  old  Bilbo-Bilbo-Bilbo-bo-bo-bo–\"  And  then  he  fell  asleep,  and  there  was  complete silence for a long time.  All  of  a  sudden Dwalin  opened  an  eye,  and  looked  round  at  them.  \"Where  is  Thorin?\"  he  asked.  It  was  a  terrible  shock.  Of  course  there  were  only  thirteen of  them,  twelve dwarves and  the hobbit. Where  indeed was Thorin? They wondered  what  evil  fate  had  befallen  him,  magic  or  dark  monsters;  and  shuddered  as  they  lay  lost  in  the  forest. There  they dropped off one by one  into uncomfortable  sleep  full  of  horrible  dreams,  as  evening wore  to  black  night;  and  there we must  leave  them for the present, too sick and weary to set guards or take turns watching."
}