{
  "id": "526968971689512ff51a56a4f0fdef8ad13dc440",
  "text": "    They rode down my ’prentice boy,  said a squat man with a smith’s muscles and a bandage around his head. He had put on his finest clothes to come to court, but his breeches were patched, his cloak travel-stained and dusty.  Chased him back and forth across the fields on their horses, poking at him with their lances like it was a game, them laughing and the boy stumbling and screaming till the big one pierced him clean through.   The girl on her knees craned her head up at Ned, high above her on the throne.  They killed my mother too, Your Grace. And they… they…  Her voice trailed off, as if she had forgotten what she was about to say. She began to sob.  Ser Raymun Darry took up the tale.  At Wendish Town, the people sought shelter in their holdfast, but the walls were timbered. The raiders piled straw against the wood and burnt them all alive. When the Wendish folk opened their gates to flee the fire, they shot them down with arrows as they came running out, even women with suckling babes.    Oh, dreadful,  murmured Varys.  How cruel can men be?    They would of done the same for us, but the Sherrer holdfast’s made of stone,  Joss said.  Some wanted to smoke us out, but the big one said there was riper fruit upriver, and they made for the Mummer’s Ford.   Ned could feel cold steel against his fingers as he leaned forward. Between each finger was a blade, the points of twisted swords fanning out like talons from arms of the throne. Even after three centuries, some were still sharp enough to cut. The Iron Throne was full of traps for the unwary. The songs said it had taken a thousand blades to make it, heated white-hot in the furnace breath of Balerion the Black Dread. The hammering had taken fifty-nine days. The end of it was this hunched black beast made of razor edges and barbs and ribbons of sharp metal; a chair that could kill a man, and had, if the stories could be believed.  What Eddard Stark was doing sitting there he would never comprehend, yet there he sat, and these people looked to him for justice.  What proof do you have that these were Lannisters?  he asked, trying to keep his fury under control.  Did they wear crimson cloaks or fly a lion banner?    Even Lannisters are not so blind stupid as that,  Ser Marq Piper snapped. He was a swaggering bantam rooster of a youth, too young and too hot-blooded for Ned’s taste, though a fast friend of Catelyn’s brother, Edmure Tully.   Every man among them was mounted and mailed, my lord,  Ser Karyl answered calmly.  They were armed with steel-tipped lances and longswords, with battle-axes for the butchering.  He gestured toward one of the ragged survivors.  You. Yes, you, no one’s going to hurt you. Tell the Hand what you told me.   The old man bobbed his head.  Concerning their horses,  he said,  it were warhorses they rode. Many a year I worked in old Ser Willum’s stables, so I knows the difference. Not a one of these ever pulled a plow, gods bear witness if I’m wrong.    Well-mounted brigands,  observed Littlefinger.  Perhaps they stole the horses from the last place they raided.    How many men were there in this raiding party?  Ned asked.   A hundred, at the least,  Joss answered, in the same instant as the bandaged smith said,  Fifty,  and the grandmother behind him,  Hunnerds and hunnerds, m’lord, an army they was.    You are more right than you know, goodwoman,  Lord Eddard told her.  You say they flew no banners. What of the armor they wore? Did any of you note ornaments or decorations, devices on shield or helm?   The brewer, Joss, shook his head.  It grieves me, m’lord, but no, the armor they showed us was plain, only… the one who led them, he was armored like the rest, but there was no mistaking him all the same. It was the size of him, m’lord. Those as say the giants are all dead never saw this one, I swear. Big as an ox he was, and a voice like stone breaking.    The Mountain!  Ser Marq said loudly.  Can any man doubt it? This was Gregor Clegane’s work.   Ned heard muttering from beneath the windows and the far end of the hall. Even in the galley, nervous whispers were exchanged. High lords and smallfolk alike knew what it could mean if Ser Marq was proved right. Ser Gregor Clegane stood bannerman to Lord Tywin Lannister.  He studied the frightened faces of the villagers. Small wonder they had been so fearful; they had thought they were being dragged here to name Lord Tywin a red-handed butcher before a king who was his son by marriage. He wondered if the knights had given them a choice.  Grand Maester Pycelle rose ponderously from the council table, his chain of office clinking.  Ser Marq, with respect, you cannot know that this outlaw was Ser Gregor. There are many large men in the realm.    As large as the Mountain That Rides?  Ser Karyl said.  I have never met one.    Nor has any man here,  Ser Raymun added hotly.  Even his brother is a pup beside him. My lords, open your eyes. Do you need to see his seal on the corpses? It was Gregor.    Why should Ser Gregor turn brigand?  Pycelle asked."
}