{
  "id": "55f3cc107a51555f17c59a97f39377216364ec9e",
  "text": " One day he stumbled, and the hilt went up his nose.   Sam was stumbling himself. There were rocks beneath the snow, and the roots of trees, and sometimes deep holes in the frozen ground. Black Bernarr had stepped in one and broken his ankle three days past, or maybe four, or… he did not know how long it had been, truly. The Lord Commander had put Bernarr on a horse after that.  Sobbing, Sam took another step. It felt more like he was falling down than walking, falling endlessly but never hitting the ground, just falling forward and forward. I have to stop, it hurts too much. I’m so cold and tired, I need to sleep, just a little sleep beside a fire, and a bite to eat that isn’t frozen.  But if he stopped he died. He knew that. They all knew that, the few who were left. They had been fifty when they fled the Fist, maybe more, but some had wandered off in the snow, a few wounded had bled to death… and sometimes Sam heard shouts behind him, from the rear guard, and once an awful scream. When he heard that he had run, twenty yards or thirty, as fast and as far as he could, his half-frozen feet kicking up the snow, He would be running still if his legs were stronger. They are behind us, they are still behind us, they are taking us one by one.  Sobbing, Sam took another step. He had been cold so long he was forgetting what it was like to feel warm. He wore three pairs of hose, two layers of smallclothes beneath a double lambswool tunic, and over that a thick quilted coat that padded him against the cold steel of his chainmail. Over the hauberk he had a loose surcoat, over that a triple-thick cloak with a bone button that fastened tight under his chins. Its hood flopped forward over his forehead. Heavy fur mitts covered his hands over thin wool-and-leather gloves, a scarf was wrapped snugly about the lower half of his face, and he had a tight-fitting fleece-lined cap to pull down over his ears beneath the hood. And still the cold was in him. His feet especially. He couldn’t even feel them now, but only yesterday they had hurt so bad he could hardly bear to stand on them, let alone walk. Every step made him want to scream. Was that yesterday? He could not remember. He had not slept since the Fist, not once since the horn had blown. Unless it was while he was walking. Could a man walk while he was sleeping? Sam did not know, or else he had forgotten.  Sobbing, he took another step. The snow swirled down around him. Sometimes it fell from a white sky, and sometimes from a black, but that was all that remained of day and night. He wore it on his shoulders like a second cloak, and it piled up high atop the pack he carried and made it even heavier and harder to bear. The small of his back hurt abominably, as if someone had shoved a knife in there and was wiggling it back and forth with every step. His shoulders were in agony from the weight of the mail. He would have given most anything to take it off, but he was afraid to. Anyway he would have needed to remove his cloak and surcoat to get at it, and then the cold would have him.  If only I was stronger… he wasn’t, though, and it was no good wishing. Sam was weak, and fat, so very fat, he could hardly bear his own weight, the mail was much too much for him. It felt as though it was rubbing his shoulders raw, despite the layers of cloth and quilt between the steel and skin. The only thing he could do was cry, and when he cried the tears froze on his cheeks.  Sobbing, he took another step. The crust was broken where he set his feet, otherwise he did not think he could have moved at all. Off to the left and right, half-seen through the silent trees, torches turned to vague orange haloes in the falling snow. When he turned his head he could see them, slipping silent through the wood, bobbing up and down and back and forth. The Old Bear’s ring of fire, he reminded himself, and woe to him who leaves it. As he walked, it seemed as if he were chasing the torches ahead of him, but they had legs as well, longer and stronger than his, so he could never catch them.  Yesterday he begged for them to let him be one of the torchbearers, even if it meant walking outside of the column with the darkness pressing close. He wanted the fire, dreamed of the fire. If I had the fire, I would not be cold. But someone reminded him that he’d had a torch at the start, but he’d dropped it in the snow and snuffed the fire out. Sam didn’t remember dropping any torch, but he supposed it was true. He was too weak to hold his arm up for long. Was it Edd who reminded him about the torch, or Grenn? He couldn’t remember that either. Fat and weak and useless, even my wits are freezing now. He took another step.  He had wrapped his scarf over his nose and mouth, but it was covered with snot now, and so stiff he feared it must be frozen to his face. Even breathing was hard, and the air was so cold it hurt to swallow it.  Mother have mercy,  he muttered in a hushed husky voice beneath the frozen mask.  Mother have mercy, Mother have mercy, Mother have mercy."
}