{
  "id": "56145691d801a28d7639a1d1580899ed1b77f2c8",
  "text": " It could not be today.  Her fingers seemed more clumsy than usual as she fumbled on her clothes. She supposed she ought to be grateful that she had any use of her hands at all. The dagger had been Valyrian steel, and Valyrian steel bites deep and sharp. She had only to look at the scars to remember.  Outside, Shadd was stirring oats into a kettle, while Ser Wendel Manderly sat stringing his bow.  My lady,  he said when Catelyn emerged.  There are birds in this grass. Would you fancy a roast quail to break your fast this morning?    Oats and bread are sufficient… for all of us, I think. We have many leagues yet to ride, Ser Wendel.    As you will, my lady.  The knight’s moon face looked crestfallen, the tips of his great walrus mustache twitching with disappointment.  Oats and bread, and what could be better?  He was one of the fattest men Catelyn had ever known, but howevermuch he loved his food, he loved his honor more.   Found some nettles and brewed a tea,  Shadd announced.  Will m’lady take a cup?    Yes, with thanks.   She cradled the tea in her scarred hands and blew on it to cool it. Shadd was one of the Winterfell men. Robb had sent twenty of his best to see her safely to Renly. He had sent five lordlings as well, whose names and high birth would add weight and honor to her mission. As they made their way south, staying well clear of towns and holdfasts, they had seen bands of mailed men more than once, and glimpsed smoke on the eastern horizon, but none had dared molest them. They were too weak to be a threat, too many to be easy prey. Once across the Blackwater, the worst was behind. For the past four days, they had seen no signs of war.  Catelyn had never wanted this. She had told Robb as much, back in Riverrun.  When last I saw Renly, he was a boy no older than Bran. I do not know him. Send someone else. My place is here with my father, for whatever time he has left.   Her son had looked at her unhappily.  There is no one else. I cannot go myself. Your father’s too ill. The Blackfish is my eyes and ears, I dare not lose him. Your brother I need to hold Riverrun when we march—    March?  No one had said a word to her of marching.   I cannot sit at Riverrun waiting for peace. It makes me look as if I were afraid to take the field again. When there are no battles to fight, men start to think of hearth and harvest, Father told me that. Even my northmen grow restless.   My northmen, she thought. He is even starting to talk like a king.  No one has ever died of restlessness, but rashness is another matter. We’ve planted seeds, let them grow.   Robb shook his head stubbornly.  We’ve tossed some seeds in the wind, that’s all. if your sister Lysa was coming to aid us, we would have heard by now. How many birds have we sent to the Eyrie, four? I want peace too, but why should the Lannisters give me anything if all I do is sit here while my army melts away around me swift as summer snow?    So rather than look craven, you will dance to Lord Tywin’s pipes?  she threw back.  He wants you to march on Harrenhal, ask your uncle Brynden if—    I said nothing of Harrenhal,  Robb said.  Now, will you go to Renly for me, or must I send the Greatjon?   The memory brought a wan smile to her face. Such an obvious ploy, that, yet deft for a boy of fifteen. Robb knew how ill-suited a man like Greatjon Umber would be to treat with a man like Renly Baratheon, and he knew that she knew it as well. What could she do but accede, praying that her father would live until her return? Had Lord Hoster been well, he would have gone himself, she knew. Still, that leavetaking was hard, hard. He did not even know her when she came to say farewell.  Minisa,  he called her,  where are the children? My little Cat, my sweet Lysa…  Catelyn had kissed him on the brow and told him his babes were well.  Wait for me, my lord,  she said as his eyes closed.  I waited for you, oh, so many times. Now you must wait for me.   Fate drives me south and south again, Catelyn thought as she sipped the astringent tea, when it is north I should be going, north to home. She had written to Bran and Rickon, that last night at Riverrun. I do not forget you, my sweet ones, you must believe that. It is only that your brother needs me more.   We ought to reach the upper Mander today, my lady,  Ser Wendel announced while Shadd spooned out the porridge.  Lord Renly will not be far, if the talk be true.   And what do I tell him when I find him? That my son holds him no true king? She did not relish this meeting. They needed friends, not more enemies, yet Robb would never bend the knee in homage to a man he felt had no claim to the throne.  Her bowl was empty, though she could scarce remember tasting the porridge. She laid it aside.  It is time we were away.  The sooner she spoke to Renly, the sooner she could turn for home. She was the first one mounted, and she set the pace for the column. Hal Mollen rode beside her, bearing the banner of House Stark, the grey direwolf on an ice-white field."
}