{
  "id": "5622c54e7664c99525ff284dedfbc30b252c838b",
  "text": " Lame Lothar rose clumsily when he saw her.  Lady Catelyn, I thought you would be resting. How may I be of service?    Are these your brothers?  she asked.   Brothers half-brothers, good brothers, and nephews. Raymund and I shared a mother. Lord Lucias Vypren is my half-sister Lythene’s husband, and Ser Damon is their son. My half-brother Ser Hosteen I believe you know. And this is Ser Leslyn Haigh and his sons, Ser Harys and Ser Donnel.    Well met, sers. Is Ser Perwyn about? He helped escort me to Storm’s End and back, when Robb sent me to speak with Lord Renly. I was looking forward to seeing him again.    Perwyn is away,  Lame Lothar said.  I shall give him your regards. I know he will regret having missed you.    Surely he will return in time for Lady Roslin’s wedding?    He had hoped to,  said Lame Lothar,  but with this rain… you saw how the rivers ran, my lady.    I did indeed,  said Catelyn.  I wonder if you would be so good as to direct me to your maester?    Are you unwell, my lady?  asked Ser Hosteen, a powerful man with a square strong jaw.   A woman’s complaint. Nothing to concern you, ser.   Lothar, ever gracious, escorted her from the hall, up some steps, and across a covered bridge to another stair.  You should find Maester Brenett in the turret on the top, my lady.   Catelyn half expected that the maester would be yet another son of Walder Frey’s, but Brenett did not have the look. He was a great fat man, bald and double-chinned and none too clean, to judge from the raven droppings that stained the sleeves of his robes, yet he seemed amiable enough. When she told him of Edmure’s concerns about Lady Roslin’s fertility, he chuckled.  Your lord brother need have no fear, Lady Catelyn. She’s small, I’ll grant you, and narrow in the hips, but her mother was the same, and Lady Bethany gave Lord Walder a child every year.    How many lived past infancy?  she asked bluntly.   Five.  He ticked them off on fingers plump as sausages.  Ser Perwyn. Ser Benfrey. Maester Willamen, who took his vows last year and now serves Lord Hunter in the Vale. Olyvar, who squired for your son. And Lady Roslin, the youngest. Four boys to one girl. Lord Edmure will have more sons than he knows what to do with.    I am sure that will please him.  So the girl was like to be fertile as well as fair of face. That should put Edmure’s mind at ease. Lord Walder had left her brother no cause for complaint, so far as she could see.  Catelyn did not return to her own room after leaving the maester; instead she went to Robb. She found Robin Flint and Ser Wendel Manderly with him, along with the Greatjon and his son, who was still called the Smalljon though he threatened to overtop his father. They were all damp. Another man, still wetter, stood before the fire in a pale pink cloak trimmed with white fur.  Lord Bolton,  she said.   Lady Catelyn,  he replied, his voice faint,  it is a pleasure to look on you again, even in such trying times.    You are kind to say so.  Catelyn could feel gloom in the room. Even the Greatjon seemed somber and subdued. She looked at their grim faces and said,  What’s happened?    Lannisters on the Trident,  said Ser Wendel unhappily.  My brother is taken again.    And Lord Bolton has brought us further word of Winterfell,  Robb added.  Ser Rodrik was not the only good man to die. Cley Cerwyn and Leobald Tallhart were slain as well.    Cley Cerwyn was only a boy,  she said, saddened.  Is this true, then? All dead, and Winterfell gone?   Bolton’s pale eyes met her own.  The ironmen burned both castle and winter town. Some of your people were taken back to the Dreadfort by my son, Ramsay.    Your bastard was accused of grievous crimes,  Catelyn reminded him sharply.  Of murder, rape, and worse.    Yes,  Roose Bolton said.  His blood is tainted, that cannot be denied. Yet he is a good fighter, as cunning as he is fearless. When the ironmen cut down Ser Rodrik, and Leobald Tallhart soon after, it fell to Ramsay to lead the battle, and he did. He swears that he shall not sheathe his sword so long as a single Greyjoy remains in the north. Perhaps such service might atone in some small measure for whatever crimes his bastard blood has led him to commit.  He shrugged.  Or not. When the war is done, His Grace must weigh and judge. By then I hope to have a trueborn son by Lady Walda.   This is a cold man, Catelyn realized, not for the first time.   Did Ramsay mention Theon Greyjoy?  Robb demanded.  Was he slain as well, or did he flee?   Roose Bolton removed a ragged strip of leather from the pouch at his belt.  My son sent this with his letter.   Ser Wendel turned his fat face away. Robin Flint and Smalljon Umber exchanged a look, and the Greatjon snorted like a bull.  Is that… skin?  said Robb.   The skin from the little finger of Theon Greyjoy’s left hand. My son is cruel, I confess it. And yet… what is a little skin, against the lives of two young princes? You were their mother, my lady. May I offer you this… small token of revenge?   Part of Catelyn wanted to clutch the grisly trophy to her heart, but she made herself resist."
}