{
  "id": "566b2c9145a4833a47520feead932e206646499c",
  "text": "  He was such a coward. Lord Randyll, his father, had always said so, and he had been right. Sam was his heir, but he had never been worthy, so his father had sent him away to the Wall. His little brother Dickon would inherit the Tarly lands and castle, and the greatsword Heartsbane that the lords of Horn Hill had borne so proudly for centuries. He wondered whether Dickon would shed a tear for his brother who died in the snow, somewhere off beyond the edge of the world. Why should he? A coward’s not worth weeping over. He had heard his father tell his mother as much, half a hundred times. The Old Bear knew it too.   Fire arrows,  the Lord Commander roared that night on the Fist, when he appeared suddenly astride his horse,  give them flame.  It was then he noticed Sam there quaking.  Tarly! Get out of here! Your place is with the ravens.    I… I… I got the messages away.    Good.  On Mormont’s shoulder his own raven echoed,  Good, good.   The Lord Commander looked huge in fur and mail. Behind his black iron visor, his eyes were fierce.  You’re in the way here. Go back to your cages. If I need to send another message, I don’t want to have to find you first. See that the birds are ready.  He did not wait for a response, but turned his horse and trotted around the ring, shouting,  Fire! Give them fire!   Sam did not need to be told twice. He went back to the birds, as fast as his fat legs could carry him. I should write the message ahead of time, he thought, so we can get the birds away as fast as need be. It took him longer than it should have to light his little fire, to warm the frozen ink. He sat beside it on a rock with quill and parchment, and wrote his messages.  Attacked amidst snow and cold, but we’ve thrown them back with fire arrows, he wrote, as he heard Thoren Smallwood’s voice ring out with a command of,  Notch, draw… loose.  The flight of arrows made a sound as sweet as a mother’s prayer.  Burn, you dead bastards, burn,  Dywen sang out, cackling. The brothers cheered and cursed. All safe, he wrote. We remain on the Fist of the First Men. Sam hoped they were better archers than him.  He put that note aside and found another blank parchment. Still fighting on the Fist, amidst heavy snow, he wrote when someone shouted,  They’re still coming.  Result uncertain.  Spears,  someone said. It might have been Ser Mallador, but Sam could not swear to it. Wights attacked us on the Fist, in snow, he wrote, but we drove them off with fire. He turned his head. Through the drifting snow, all he could see was the huge fire at the center of the camp, with mounted men moving restlessly around it. The reserve, he knew, ready to ride down anything that breached the ringwall. They had armed themselves with torches in place of swords, and were lighting them in the flames.  Wights all around us, he wrote, when he heard the shouts from the north face. Coming up from north and south at once. Spears and swords don’t stop them, only fire.  Loose, loose, loose,  a voice screamed in the night, and another shouted,  Bloody huge,  and a third voice said,  A giant!  and a fourth insisted,  A bear, a bear!  A horse shrieked and the hounds began to bay, and there was so much shouting that Sam couldn’t make out the voices anymore. He wrote faster, note after note. Dead wildlings, and a giant, or maybe a bear, on us, all around. He heard the crash of steel on wood, which could only mean one thing. Wights over the ringwall. Fighting inside the camp. A dozen mounted brothers pounded past him toward the east wall, burning brands streaming flames in each rider’s hand. Lord Commander Mormont is meeting them with fire. We’ve won. We’re winning. We’re holding our own. We’re cutting our way free and retreating for the Wall. We’re trapped on the Fist, hard pressed.  One of the Shadow Tower men came staggering out of the darkness to fall at Sam’s feet. He crawled within a foot of the fire before he died. Lost, Sam wrote, the battle’s lost. We’re all lost.  Why must he remember the fight at the Fist? He didn’t want to remember. Not that. He tried to make himself remember his mother, or his little sister Talla, or that girl Gilly at Craster’s Keep. Someone was shaking him by the shoulder.  Get up,  a voice said.  Sam, you can’t go to sleep here. Get up and keep walking.   I wasn’t asleep, I was remembering.  Go away,  he said, his words frosting in the cold air.  I’m well. I want to rest.    Get up.  Grenn’s voice, harsh and husky. He loomed over Sam, his blacks crusty with snow.  There’s no resting, the Old Bear said. You’ll die.    Grenn.  He smiled.  No, truly, I’m good here. You just go on. I’ll catch you after I’ve rested a bit longer.    You won’t.  Grenn’s thick brown beard was frozen all around his mouth. It made him look like some old man.  You’ll freeze, or the Others will get you. Sam, get up!   The night before they left the Wall, Pyp had teased Grenn the way he did, Sam remembered, smiling and saying how Grenn was a good choice for the ranging, since he was too stupid to be terrified."
}