{
  "id": "59d646c942d1eb48dccb55602e34cdd594b15c49",
  "text": "  Your brother Benjen came to me about Jon a few days ago. It seems the boy aspires to take the black.   Ned looked shocked.  He asked to join the Night’s Watch?   Catelyn said nothing. Let Ned work it out in his own mind; her voice would not be welcome now. Yet gladly would she have kissed the maester just then. His was the perfect solution. Benjen Stark was a Sworn Brother. Jon would be a son to him, the child he would never have. And in time the boy would take the oath as well. He would father no sons who might someday contest with Catelyn’s own grandchildren for Winterfell.  Maester Luwin said,  There is great honor in service on the Wall, my lord.    And even a bastard may rise high in the Night’s Watch,  Ned reflected. Still, his voice was troubled.  Jon is so young. If he asked this when he was a man grown, that would be one thing, but a boy of fourteen…    A hard sacrifice,  Maester Luwin agreed.  Yet these are hard times, my lord. His road is no crueler than yours or your lady’s.   Catelyn thought of the three children she must lose. It was not easy keeping silent then.  Ned turned away from them to gaze out the window, his long face silent and thoughtful. Finally he sighed, and turned back.  Very well,  he said to Maester Luwin.  I suppose it is for the best. I will speak to Ben.    When shall we tell Jon?  the maester asked.   When I must. Preparations must be made. It will be a fortnight before we are ready to depart. I would sooner let Jon enjoy these last few days. Summer will end soon enough, and childhood as well. When the time comes, I will tell him myself.       ARYA  Arya’s stitches were crooked again.  She frowned down at them with dismay and glanced over to where her sister Sansa sat among the other girls. Sansa’s needlework was exquisite. Everyone said so.  Sansa’s work is as pretty as she is,  Septa Mordane told their lady mother once.  She has such fine, delicate hands.  When Lady Catelyn had asked about Arya, the septa had sniffed.  Arya has the hands of a blacksmith.   Arya glanced furtively across the room, worried that Septa Mordane might have read her thoughts, but the septa was paying her no attention today. She was sitting with the Princess Myrcella, all smiles and admiration. It was not often that the septa was privileged to instruct a royal princess in the womanly arts, as she had said when the queen brought Myrcella to join them. Arya thought that Myrcella’s stitches looked a little crooked too, but you would never know it from the way Septa Mordane was cooing.  She studied her own work again, looking for some way to salvage it, then sighed and put down the needle. She looked glumly at her sister. Sansa was chatting away happily as she worked. Beth Cassel, Ser Rodrik’s little girl, was sitting by her feet, listening to every word she said, and Jeyne Poole was leaning over to whisper something in her ear.   What are you talking about?  Arya asked suddenly.  Jeyne gave her a startled look, then giggled. Sansa looked abashed. Beth blushed. No one answered.   Tell me,  Arya said.  Jeyne glanced over to make certain that Septa Mordane was not listening. Myrcella said something then, and the septa laughed along with the rest of the ladies.   We were talking about the prince,  Sansa said, her voice soft as a kiss.  Arya knew which prince she meant: Jofftey, of course. The tall, handsome one. Sansa got to sit with him at the feast. Arya had to sit with the little fat one. Naturally.   Joffrey likes your sister,  Jeyne whispered, proud as if she had something to do with it. She was the daughter of Winterfell’s steward and Sansa’s dearest friend.  He told her she was very beautiful.    He’s going to marry her,  little Beth said dreamily, hugging herself.  Then Sansa will be queen of all the realm.   Sansa had the grace to blush. She blushed prettily. She did everything prettily, Arya thought with dull resentment.  Beth, you shouldn’t make up stories,  Sansa corrected the younger girl, gently stroking her hair to take the harshness out of her words. She looked at Arya.  What did you think of Prince Joff, sister? He’s very gallant, don’t you think?    Jon says he looks like a girl,  Arya said.  Sansa sighed as she stitched.  Poor Jon,  she said.  He gets jealous because he’s a bastard.    He’s our brother,  Arya said, much too loudly. Her voice cut through the afternoon quiet of the tower room.  Septa Mordane raised her eyes. She had a bony face, sharp eyes, and a thin lipless mouth made for frowning. It was frowning now.  What are you talking about, children?    Our half brother,  Sansa corrected, soft and precise. She smiled for the septa.  Arya and I were remarking on how pleased we were to have the princess with us today,  she said.  Septa Mordane nodded.  Indeed. A great honor for us all.  Princess Myrcella smiled uncertainly at the compliment.  Arya, why aren’t you at work?  the septa asked. She rose to her feet, starched skirts rustling as she started across the room.  Let me see your stitches."
}