{
  "id": "59e3641b5832f6c019c3064c8a2237e93a67fe7e",
  "text": "  \"Even the Hogwarts ghosts avoid it,\" said Ron as they leaned on the fence, looking up at it. \"I asked Nearly Headless Nick... he says he's heard a very rough crowd lives here. No one can get in. Fred and George tried, obviously, but all the entrances are sealed shut....\"  Harry, feeling hot from their climb, was just considering taking off the cloak for a few minutes when they heard voices nearby. Someone was climbing toward the house from the other side of the hill; moments later, Malfoy had appeared, followed closely by Crabbe and Goyle. Malfoy was speaking.  \"... should have an owl from Father any time now. He had to go to the hearing to tell them about my arm... about how I couldn't use it for three months....\"  Crabbe and Goyle sniggered.  \"I really wish I could hear that great hairy moron trying to defend himself... 'There's no 'arm in 'im, 'onest that hippogriff's as good as dead --\"  Malfoy suddenly caught sight of Ron. His pale face split in a malevolent grin.  \"What are you doing, Weasley?\"  Malfoy looked up at the crumbling house behind Ron.  \"Suppose You'd love to live here, wouldn't you, Weasley? Dreaming about having your own bedroom? I heard your family all sleep in one room -- is that true?\"  Harry seized the back of Ron's robes to stop him from leaping on Malfoy. \"Leave him to me,\" he hissed in Ron's ear.  The opportunity was too perfect to miss. Harry crept silently around behind Malfoy, Crabbe, and Goyle, bent down, and scooped a large handful of mud out of the path.  \"We were just discussing your friend Hagrid,\" Malfoy said to Ron. \"Just trying to imagine what he's saying to the Committee for the Disposal of Dangerous Creatures. D'you think he'll cry when they cut off his hippogriff's  SPLAT.  Malfoy's head jerked forward as the mud hit him; his silverblond hair was suddenly dripping in muck.  \"What the --?\"  Ron had to hold onto the fence to keep himself standing, he was laughing so hard. Malfoy, Crabbe, and Goyle spun stupidly on the spot, staring wildly around, Malfoy trying to wipe his hair clean.  \"What was that? 'Who did that?\"  \"Very haunted up here, isn't it?\" said Ron, with the air of one commenting on the weather.  Crabbe and Goyle were looking scared. Their bulging muscles were no use against ghosts. Malfoy was staring madly around at the deserted landscape.  Harry sneaked along the path, where a particularly sloppy puddle yielded some foul-smelling, green sludge.  SPLATTER.  Crabbe and Goyle caught some this time. Goyle hopped furiously on the spot, trying to rub it out of his small, dull eyes.  \"It came from over there!\" said Malfoy, wiping his face, and staring at a spot some six feet to the left of Harry.  Crabbe blundered forward, his long arms outstretched like a zombie. Harry dodged around him, picked up a stick, and lobbed it at Crabbe's back. Harry doubled up with silent laughter as Crabbe did a kind of pirouette in midair, trying to see who had thrown it. As Ron was the only person Crabbe could see, it was Ron he started toward, but Harry stuck out his leg. Crabbe stumbled -- and his huge, flat foot caught the hem of Harry's cloak. Harry felt a great tug, then the cloak slid off his face.  For a split second, Malfoy stared at him.  \"AAARGH!\" he yelled, pointing at Harry's head. Then he turned tail and ran, at breakneck speed, back down the hill, Crabbe and Goyle behind him.  Harry tugged the cloak up again, but the damage was done.  \"Harry!\" Ron said, stumbling forward and staring hopelessly at the point where Harry had disappeared, \"you'd better run for it! If Malfoy tells anyone -- you'd better get back to the castle, quick --\" \"See you later,\" said Harry, and without another word, he tore back down the path toward Hogsmeade.  Would Malfoy believe what he had seen? Would anyone believe  Malfoy? Nobody knew about the Invisibility Cloak -- nobody except Dumbledore. Harry's stomach turned over -- Dumbledore would know exactly what had happened, if Malfoy said any- thing --  Back into Honeydukes, back down the cellar steps, across the stone floor, through the trapdoor -- Harry pulled off the cloak, tucked it under his arm, and ran, flat out, along the passage.... Malfoy would get back first... how long would it take him to find a teacher? Panting, a sharp pain in his side, Harry didn't slow down until he reached the stone slide. He would have to leave the cloak where it was, it was too much of a giveaway in case Malfoy had tipped off a teacher -- he hid it in a shadowy corner, then started to climb, fast as he could, his sweaty hands slipping on the sides of the chute. He reached the inside of the witch's hump, tapped it with his wand, stuck his head through, and hoisted himself out; the hump closed, and just as Harry jumped out from behind the statue, he heard quick footsteps approaching.  It was Snape. He approached Harry at a swift walk, his black robes swishing, then stopped in front of him.  \"So,\" he said.  There was a look of surpressed triumph about him. Harry tried to look innocent, all too aware of his sweaty face and his muddy hands, which he quickly hid in his pockets."
}