{
  "id": "5a53240e571a8f7c3fcc6fe2bd8a3d911b470a56",
  "text": " What of the Stormcrows, is there any hope there?    No,  Ser Jorah said bluntly.  That Prendahl is Ghiscari by blood. Likely he had kin in Astapor.    A pity. Well, perhaps we will not need to fight. Let us wait and hear what the Yunkai’i have to say.   The envoys from Yunkai arrived as the sun was going down; fifty men on magnificent black horses and one on a great white camel. Their helms were twice as tall as their heads, so as not to crush the bizarre twists and towers and shapes of their oiled hair beneath. They dyed their linen skirts and tunics a deep yellow, and sewed copper disks to their cloaks.  The man on the white camel named himself Grazdan mo Eraz. Lean and hard, he had a white smile such as Kraznys had worn until Drogon burned off his face. His hair was drawn up in a unicorn’s horn that jutted from his brow, and his tokar was fringed with golden Myrish lace.  Ancient and glorious is Yunkai, the queen of cities,  he said when Dany welcomed him to her tent.  Our walls are strong, our nobles proud and fierce, our common folk without fear. Ours is the blood of ancient Ghis, whose empire was old when Valyria was yet a squalling child. You were wise to sit and speak, Khaleesi. You shall find no easy conquest here.     Good. My Unsullied will relish a bit of a fight.  She looked to Grey Worm, who nodded.  Grazdan shrugged expansively.  If blood is what you wish, let it flow. I am told you have freed your eunuchs. Freedom means as much to an Unsullied as a hat to a haddock.  He smiled at Grey Worm, but the eunuch might have been made of stone.  Those who survive we shall enslave again, and use to retake Astapor from the rabble. We can make a slave of you as well, do not doubt it. There are pleasure houses in Lys and Tyrosh where men would pay handsomely to bed the last Targaryen.    It is good to see you know who I am,  said Dany mildly.   I pride myself on my knowledge of the savage senseless west.  Grazdan spread his hands, a gesture of conciliation.  And yet, why should we speak thus harshly to one another? It is true that you committed savageries in Astapor, but we Yunkai’i are a most forgiving people. Your quarrel is not with us, Your Grace. Why squander your strength against our mighty walls when you will need every man to regain your father’s throne in far Westeros? Yunkai wishes you only well in that endeavor. And to prove the truth of that, I have brought you a gift.  He clapped his hands, and two of his escort came forward bearing a heavy cedar chest bound in bronze and gold. They set it at her feet.  Fifty thousand golden marks,  Grazdan said smoothly.  Yours, as a gesture of friendship from the Wise Masters of Yunkai. Gold given freely is better than plunder bought with blood, surely? So I say to you, Daenerys Targaryen, take this chest, and go.   Dany pushed open the lid of the chest with a small slippered foot. It was full of gold coins, just as the envoy said. She grabbed a handful and let them run through her fingers. They shone brightly as they tumbled and fell; new minted, most of them, stamped with a stepped pyramid on one face and the harpy of Ghis on the other.  Very pretty. I wonder how many chests like this I shall find when I take your city?   He chuckled.  None, for that you shall never do.    I have a gift for you as well.  She slammed the chest shut.  Three days. On the morning of the third day, send out your slaves. All of them. Every man, woman, and child shall be given a weapon, and as much food, clothing, coin, and goods as he or she can carry. These they shall be allowed to choose freely from among their masters’ possessions, as payment for their years of servitude. When all the slaves have departed, you will open your gates and allow my Unsullied to enter and search your city, to make certain none remain in bondage. If you do this, Yunkai will not be burned or plundered, and none of your people shall be molested. The Wise Masters will have the peace they desire, and will have proved themselves wise indeed. What say you?    I say, you are mad.    Am I?  Dany shrugged, and said,  Dracarys.   The dragons answered. Rhaegal hissed and smoked, Viserion snapped, and Drogon spat swirling red-black flame. It touched the drape of Grazdan’s tokar, and the silk caught in half a heartbeat. Golden marks spilled across the carpets as the envoy stumbled over the chest, shouting curses and beating at his arm until Whitebeard flung a flagon of water over him to douse the flames.  You swore I should have safe conduct!  the Yunkish envoy wailed.   Do all the Yunkai’i whine so over a singed tokar? I shall buy you a new one… if you deliver up your slaves within three days. Elsewise, Drogon shall give you a warmer kiss.  She wrinkled her nose.  You’ve soiled yourself. Take your gold and go, and see that the Wise Masters hear my message.   Grazdan mo Eraz pointed a finger.  You shall rue this arrogance, whore. These little lizards will not keep you safe, I promise you. We will fill the air with arrows if they come within a league of Yunkai."
}