{
  "id": "5a57feb5f2f7e2481cf1e079f0a2bf40ca1c0c1e",
  "text": "  I’m…    She’s my sister.  Gendry put a heavy hand on the old man’s shoulder, and squeezed.  Leave her be.   The man turned, spoiling for a quarrel, but when he saw Gendry’s size he thought better of it.  Your sister, is she? What kind of brother are you? I’d never bring no sister of mine to the Peach, that I wouldn’t.  He got up from the bench and moved off muttering, in search of a new friend.   Why did you say that?  Arya hopped to her feet.  You’re not my brother.    That’s right,  he said angrily.  I’m too bloody lowborn to be kin to m’lady high.   Arya was taken aback by the fury in his voice.  That’s not the way I meant it.    Yes it is.  He sat down on the bench, cradling a cup of wine between his hands.  Go away. I want to drink this wine in peace. Then maybe I’ll go find that black-haired girl and ring her bell for her.    But…    I said, go away. M’lady.   Arya whirled and left him there. A stupid bullheaded bastard boy, that’s all he is. He could ring all the bells he wanted, it was nothing to her.  Their sleeping room was at the top of the stairs, under the eaves. Maybe the Peach had no lack of beds, but there was only one to spare for the likes of them. It was a big bed, though. It filled the whole room, just about, and the musty straw-stuffed mattress looked large enough for all of them. Just now, though, she had it to herself. Her real clothes were hanging from a peg on the wall, between Gendry’s stuff and Lem’s. Arya took off the linen and lace, pulled her tunic over her head, climbed up into the bed, and burrowed under the blankets.  Queen Cersei,  she whispered into the pillow.  King Joffrey, Ser Ilyn, Ser Meryn. Dunsen, Raff, and Polliver. The Tickler, the Hound, and Ser Gregor the Mountain.  She liked to mix up the order of the names sometimes. It helped her remember who they were and what they’d done. Maybe some of them are dead, she thought. Maybe they’re in iron cages someplace, and the crows are picking out their eyes.  Sleep came as quick as she closed her eyes. She dreamed of wolves that night, stalking through a wet wood with the smell of rain and rot and blood thick in the air. Only they were good smells in the dream, and Arya knew she had nothing to fear. She was strong and swift and fierce, and her pack was all around her, her brothers and her sisters. They ran down a frightened horse together, tore its throat out, and feasted. And when the moon broke through the clouds, she threw back her head and howled.  But when the day came, she woke to the barking of dogs.  Arya sat up yawning. Gendry was stirring on her left and Lem Lemoncloak snoring loudly to her right, but the baying outside all but drowned him out. There must be half a hundred dogs out there. She crawled from under the blankets and hopped over Lem, Tom, and Jack-Be-Lucky to the window. When she opened the shutters wide, wind and wet and cold all came flooding in together. The day was grey and overcast. Down below, in the square, the dogs were barking, running in circles, growling and howling. There was a pack of them, great black mastiffs and lean wolfhounds and black-and-white sheepdogs and kinds Arya did not know, shaggy brindled beasts with long yellow teeth. Between the inn and the fountain, a dozen riders sat astride their horses, watching the townsmen open the fat man’s cage and tug his arm until his swollen corpse spilled out onto the ground. The dogs were at him at once, tearing chunks of flesh off his bones.  Arya heard one of the riders laugh.  Here’s your new castle, you bloody Lannister bastard,  he said.  A little snug for the likes o’ you, but we’ll squeeze you in, never fret.  Beside him a prisoner sat sullen, with coils of hempen rope tight around his wrists. Some of the townsmen were throwing dung at him, but he never flinched.  You’ll rot in them cages,  his captor was shouting.  The crows will be picking out your eyes while we’re spending all that good Lannister gold o’ yours! And when them crows are done, we’ll send what’s left o’ you to your bloody brother. Though I doubt he’ll know you.   The noise had woken half the Peach. Gendry squeezed into the window beside Arya, and Tom stepped up behind them naked as his name day.  What’s all that bloody shouting?  Lem complained from bed.  A man’s trying to get some bloody sleep.    Where’s Greenbeard?  Tom asked him.   Abed with Tansy,  Lem said.  Why?    Best find him. Archer too. The Mad Huntsman’s come back, with another man for the cages.    Lannister,  said Arya.  I heard him say Lannister.    Have they caught the Kingslayer?  Gendry wanted to know.  Down in the square, a thrown stone caught the captive on the cheek, turning his head. Not the Kingslayer, Arya thought, when she saw his face. The gods had heard her prayers after all.      Jon   Ghost was gone when the wildlings led their horses from the cave. Did he understand about Castle Black? Jon took a breath of the crisp morning air and allowed himself to hope. The eastern sky was pink near the horizon and pale grey higher up."
}