{
  "id": "5b4a4825771a9b07786d9ed1dcabe75a9ab3edb0",
  "text": "  Why, the realm, my good lord, how ever could you doubt that? I swear it by my lost manhood. I serve the realm, and the realm needs peace.  He finished the last swallow of wine, and tossed the empty skin aside.  So what is your answer, Lord Eddard? Give me your word that you’ll tell the queen what she wants to hear when she comes calling.    If I did, my word would be as hollow as an empty suit of armor. My life is not so precious to me as that.    Pity.  The eunuch stood.  And your daughter’s life, my lord? How precious is that?   A chill pierced Ned’s heart.  My daughter…    Surely you did not think I’d forgotten about your sweet innocent, my lord? The queen most certainly has not.    No,  Ned pleaded, his voice cracking.  Varys, gods have mercy, do as you like with me, but leave my daughter out of your schemes. Sansa’s no more than a child.    Rhaenys was a child too. Prince Rhaegar’s daughter. A precious little thing, younger than your girls. She had a small black kitten she called Balerion, did you know? I always wondered what happened to him. Rhaenys liked to pretend he was the true Balerion, the Black Dread of old, but I imagine the Lannisters taught her the difference between a kitten and a dragon quick enough, the day they broke down her door.  Varys gave a long weary sigh, the sigh of a man who carried all the sadness of the world in a sack upon his shoulders.  The High Septon once told me that as we sin, so do we suffer. If that’s true, Lord Eddard, tell me… why is it always the innocents who suffer most, when you high lords play your game of thrones? Ponder it, if you would, while you wait upon the queen. And spare a thought for this as well: The next visitor who calls on you could bring you bread and cheese and the milk of the poppy for your pain… or he could bring you Sansa’s head.   The choice, my dear lord Hand, is entirely yours.       CATELYN  As the host trooped down the causeway through the black bogs of the Neck and spilled out into the riverlands beyond, Catelyn’s apprehensions grew. She masked her fears behind a face kept still and stern, yet they were there all the same, growing with every league they crossed. Her days were anxious, her nights restless, and every raven that flew overhead made her clench her teeth.  She feared for her lord father, and wondered at his ominous silence. She feared for her brother Edmure, and prayed that the gods would watch over him if he must face the Kingslayer in battle. She feared for Ned and her girls, and for the sweet sons she had left behind at Winterfell. And yet there was nothing she could do for any of them, and so she made herself put all thought of them aside. You must save your strength for Robb, she told herself. He is the only one you can help. You must be as fierce and hard as the north, Catelyn Tully. You must be a Stark for true now, like your son.  Robb rode at the front of the column, beneath the flapping white banner of Winterfell. Each day he would ask one of his lords to join him, so they might confer as they marched; he honored every man in turn, showing no favorites, listening as his lord father had listened, weighing the words of one against the other. He has learned so much from Ned, she thought as she watched him, but has he learned enough?  The Blackfish had taken a hundred picked men and a hundred swift horses and raced ahead to screen their movements and scout the way. The reports Ser Brynden’s riders brought back did little to reassure her. Lord Tywin’s host was still many days to the south… but Walder Frey, Lord of the Crossing, had assembled a force of near four thousand men at his castles on the Green Fork.   Late again,  Catelyn murmured when she heard. It was the Trident all over, damn the man. Her brother Edmure had called the banners; by rights, Lord Frey should have gone to join the Tully host at Riverrun, yet here he sat.   Four thousand men,  Robb repeated, more perplexed than angry.  Lord Frey cannot hope to fight the Lannisters by himself. Surely he means to join his power to ours.    Does he?  Catelyn asked. She had ridden forward to join Robb and Robett Glover, his companion of the day. The vanguard spread out behind them, a slow-moving forest of lances and banners and spears.  I wonder. Expect nothing of Walder Frey, and you will never be surprised.    He’s your father’s bannerman.    Some men take their oaths more seriously than others, Robb. And Lord Walder was always friendlier with Casterly Rock than my father would have liked. One of his sons is wed to Tywin Lannister’s sister. That means little of itself, to be sure. Lord Walder has sired a great many children over the years, and they must needs marry someone. Still…    Do you think he means to betray us to the Lannisters, my lady?  Robett Glover asked gravely.  Catelyn sighed.  If truth be told, I doubt even Lord Frey knows what Lord Frey intends to do. He has an old man’s caution and a young man’s ambition, and has never lacked for cunning.    We must have the Twins, Mother,  Robb said heatedly."
}