{
  "id": "5eb4ce637b1a053943658c91e95d9faffd12fb44",
  "text": " But then he would open his eyes.   I understand you had a visitor last night,  said Qyburn.  I trust that you enjoyed her?   Jaime gave him a cool look.  She did not say who sent her.   The maester smiled modestly.  Your fever was largely gone, and I thought you might enjoy a bit of exercise. Pia is quite skilled, would you not agree? And so… willing.   She had been that, certainly. She had slipped in his door and out of her clothes so quickly that Jaime had thought he was still dreaming.  It hadn’t been until the woman slid in under his blankets and put his good hand on her breast that he roused. She was a pretty little thing, too.  I was a slip of a girl when you came for Lord Whent’s tourney and the king gave you your cloak,  she confessed.  You were so handsome all in white, and everyone said what a brave knight you were. Sometimes when I’m with some man, I close my eyes and pretend it’s you on top of me, with your smooth skin and gold curls. I never truly thought I’d have you, though.   Sending her away had not been easy after that, but Jaime had done it all the same. I have a woman, he reminded himself.  Do you send girls to everyone you leech?  he asked Qyburn.   More often Lord Vargo sends them to me. He likes me to examine them, before… well, suffice it to say that once he loved unwisely, and he has no wish to do so again. But have no fear, Pia is quite healthy. As is your maid of Tarth.   Jaime gave him a sharp look.  Brienne?    Yes. A strong girl, that one. And her maidenhead is still intact. As of last night, at least.  Qyburn gave a chuckle.   He sent you to examine her?    To be sure. He is… fastidious, shall we say?    Does this concern the ransom?  Jaime asked.  Does her father require proof she is still maiden?    You have not heard?  Qyburn gave a shrug.  We had a bird from Lord Selwyn. In answer to mine. The Evenstar offers three hundred dragons for his daughter’s safe return. I had told Lord Vargo there were no sapphires on Tarth, but he will not listen. He is convinced the Evenstar intends to cheat him.    Three hundred dragons is a fair ransom for a knight. The goat should take what he can get.    The goat is Lord of Harrenhal, and the Lord of Harrenhal does not haggle.   The news irritated him, though he supposed he should have seen it coming. The lie spared you awhile, wench. Be grateful for that much.  If her maidenhead’s as hard as the rest of her, the goat will break his cock off trying to get in,  he jested. Brienne was tough enough to survive a few rapes, Jaime judged, though if she resisted too vigorously Vargo Hoat might start lopping off her hands and feet. And if he does, why should I care? I might still have a hand if she had let me have my cousin’s sword without getting stupid. He had almost taken off her leg himself with that first stroke of his, but after that she had given him more than he wanted. Hoat may not know how freakish strong she is. He had best be careful, or she’ll snap that skinny neck of his, and wouldn’t that be sweet?  Qyburn’s companionship was wearing on him. Jaime trotted toward the head of the column. A round little tick of a northman name of Nage went before Steelshanks with the peace banner; a rainbow-striped flag with seven long tails, on a staff topped by a seven-pointed star.  Shouldn’t you northmen have a different sort of peace banner?  he asked Walton.  What are the Seven to you?    Southron gods,  the man said,  but it’s a southron peace we need, to get you safe to your father.   My father. Jaime wondered whether Lord Tywin had received the goat’s demand for ransom, with or without his rotted hand. What is a swordsman worth without his sword hand? Half the gold in Casterly Rock? Three hundred dragons? Or nothing? His father had never been unduly swayed by sentiment. Tywin Lannister’s own father Lord Tytos had once imprisoned an unruly bannerman, Lord Tarbeck. The redoubtable Lady Tarbeck responded by capturing three Lannisters, including young Stafford, whose sister was betrothed to cousin Tywin.  Send back my lord and love, or these three shall answer for any harm that comes him,  she had written to Casterly Rock. Young Tywin suggested his father oblige by sending back Lord Tarbeck in three pieces. Lord Tytos was a gentler sort of lion, however, so Lady Tarbeck won a few more years for her muttonheaded lord, and Stafford wed and bred and blundered on till Oxcross. But Tywin Lannister endured, eternal as Casterly Rock. And now you have a cripple for a son as well as a dwarf, my lord. How you will hate that…  The road led them through a burned village. It must have been a year or more since the place had been put to torch. The hovels stood blackened and roofless, but weeds were growing waist high in all the surrounding fields. Steelshanks called a halt to allow them to water the horses. I know this place too, Jaime thought as he waited by the well. There had been a small inn where only a few foundation stones and a chimney now stood, and he had gone in for a cup of ale."
}