{
  "id": "5fc182b5df0a98d9dda960e3f17d63de41e3cc0b",
  "text": " Now.   For a moment he did not think they were going to obey, but in the end old habit asserted itself. They followed sullenly, but they followed. The Frey boy was as jumpy as those rabbits he’d flushed earlier. Theon put men on either bank and followed the current. They rode for miles, going slow and careful, dismounting to lead the horses over treacherous ground, letting the good-for-bear-bait hounds sniff at every bush. Where a fallen tree dammed the flow, the hunters were forced to loop around a deep green pool, but if the direwolves had done the same they’d left neither print nor spoor. The beasts had taken to swimming, it seemed. When I catch them, they’ll have all the swimming they can stomach. I’ll give them both to the Drowned God.  When the woods began to darken, Theon Greyjoy knew he was beaten. Either the crannogmen did know the magic of the children of the forest, or else Osha had deceived them with some wildling trick. He made them press on through the dusk, but when the last light faded Joseth finally worked up the courage to say,  This is fruitless, my lord. We will lame a horse, break a leg.    Joseth has the right of it,  said Maester Luwin.  Groping through the woods by torchlight will avail us nothing.   Theon could taste bile at the back of his throat, and his stomach was a nest of snakes twining and snapping at each other. If he crept back to Winterfell empty-handed, he might as well dress in motley henceforth and wear a pointed hat; the whole north would know him for a fool. And when my father hears, and Asha…   M’lord prince.  Reek urged his horse near.  Might be them Starks never came this way. If I was them, I would have gone north and east, maybe. To the Umbers. Good Stark men, they are. But their lands are a long way. The boys will shelter someplace nearer. Might be I know where.   Theon looked at him suspiciously.  Tell me.    You know that old mill, sitting lonely on the Acorn Water? We stopped there when I was being dragged to Winterfell a captive. The miller’s wife sold us hay for our horses while that old knight clucked over her brats. Might be the Starks are hiding there.   Theon knew the mill. He had even tumbled the miller’s wife a time or two. There was nothing special about it, or her.  Why there? There are a dozen villages and holdfasts just as close.   Amusement shone in those pale eyes.  Why? Now that’s past knowing. But they’re there, I have a feeling.   He was growing sick of the man’s sly answers. His lips look like two worms fucking.  What are you saying? If you’ve kept some knowledge from me—    M’lord prince?  Reek dismounted, and beckoned Theon to do the same. When they were both afoot, he pulled open the cloth sack he’d fetched from Winterfell.  Have a look here.   It was growing hard to see. Theon thrust his hand into the sack impatiently, groping amongst soft fur and rough scratchy wool. A sharp point pricked his skin, and his fingers closed around something cold and hard. He drew out a wolf’s-head brooch, silver and jet. Understanding came suddenly. His hand closed into a fist.  Gelmarr,  he said, wondering whom he could trust. None of them.  Aggar. Rednose. With us. The rest of you may return to Winterfell with the hounds. I’ll have no further need of them. I know where Bran and Rickon are hiding now.    Prince Theon,  Maester Luwin entreated,  you will remember your promise? Mercy, you said.    Mercy was for this morning,  said Theon. It is better to be feared than laughed at.  Before they made me angry.       JON  They could see the fire in the night, glimmering against the side of the mountain like a fallen star. It burned redder than the other stars, and did not twinkle, though sometimes it flared up bright and sometimes dwindled down to no more than a distant spark, dull and faint.  Half a mile ahead and two thousand feet up, Jon judged, and perfectly placed to see anything moving in the pass below.   Watchers in the Skirling Pass,  wondered the oldest among them. In the spring of his youth, he had been squire to a king, so the black brothers still called him Squire Dalbridge.  What is it Mance Rayder fears, I wonder?    If he knew they’d lit a fire, he’d flay the poor bastards,  said Ebben, a squat bald man muscled like a bag of rocks.   Fire is life up here,  said Qhorin Halfhand,  but it can be death as well.  By his command, they’d risked no open flames since entering the mountains. They ate cold salt beef, hard bread, and harder cheese, and slept clothed and huddled beneath a pile of cloaks and furs, grateful for each other’s warmth. It made Jon remember cold nights long ago at Winterfell, when he’d shared a bed with his brothers. These men were brothers too, though the bed they shared was stone and earth.   They’ll have a horn,  said Stonesnake.  The Halfhand said,  A horn they must not blow.    That’s a long cruel climb by night,  Ebben said as he eyed the distant spark through a cleft in the rocks that sheltered them. The sky was cloudless, the jagged mountains rising black on black until the very top, where their cold crowns of snow and ice shone palely in the moonlight."
}