{
  "id": "60e8a720c81fba3328920ad56079a046d525da1b",
  "text": "\"  \"It didn't make any difference,\" said Harry bitterly. \"Pettigrew got away.\"  \"Didn't make any difference?\" said Dumbledore quietly, \"It made all the difference in the world, Harry. You helped uncover the truth. You saved an innocent man from a terrible fate.\"  Terrible. Something stirred in Harry's memory. Greater and more terrible than ever before... Professor Trelawney's prediction!  \"Professor Dumbledore -- yesterday, when I was having my Divination exam, Professor Trelawney went very -- very strange.\"  \"Indeed?\" said Dumbledore. \"Er -- stranger than usual, you mean?\"  \"Yes... her voice went all deep and her eyes rolled and she said ... she said Voldemort's servant was going to set out to return to him before midnight.... She said the servant would help him come back to power.\" Harry stared up at Dumbledore. \"And then she sort of became normal again, and she couldn't remember anything she'd said. Was it -- was she making a real prediction?\"  Dumbledore looked mildly impressed.  \"Do you know, Harry, I think she might have been.\" he said thoughtfully. \"Who'd have thought it? That brings her total of real predictions up to two. I should offer her a pay raise....\"  \"But --\" Harry looked at him, aghast. How could Dumbledore take this so calmly?  \"But -- I stopped Sirius and Professor Lupin from killing Pettigrew! That makes it my fault if Voldemort comes back!\"  \"It does not,\" said Dumbledore quietly. \"Hasn't your experience with the Time-Turner taught you anything, Harry? The consequences of our actions are always so complicated, so diverse, that predicting the future is a very difficult business indeed.... Professor Trelawney, bless her, is living proof of that.... You did a very noble thing, in saving Pettigrew's life.\"  \"But if he helps Voldemort back to power  \"Pettigrew owes his life to you. You have sent Voldemort a deputy who is in your debt.... When one wizard saves another wizard's life, it creates a certain bond between them... and I'm much mistaken if Voldemort wants his servant in the debt of Harry Potter.\"  \"I don't want a connection with Pettigrew!\" said Harry. \"He betrayed my parents!\"  \"This is magic at its deepest, its most impenetrable, Harry. But trust me... the time may come when you will be very glad you saved Pettigrew's life.\"  Harry couldn't imagine when that would be. Dumbledore looked as though he knew what Harry was thinking.  \"I knew your father very well, both at Hogwarts and later, Harry,\" he said gently. \"He would have saved Pettigrew too, I am sure of it.\"  Harry looked up at him. Dumbledore wouldn't laugh -- he could tell Dumbledore...  \"I thought it was my dad who'd conjured my Patronus. I mean, when I saw myself across the lake ... I thought I was seeing him.\" \"An easy mistake to make,\" said Dumbledore softly. \"I expect you'll tire of hearing it, but you do look extraordinarily like James. Except for the eyes... you have your mother's eyes.  Harry shook his head.  \"It was stupid, thinking it was him,\" he muttered. \"I mean, I knew he was dead.\"  \"You think the dead we loved ever truly leave us? You think that we don't recall them more clearly than ever in times of great trouble? Your father is alive in you, Harry, and shows himself most plainly when you have need of him. How else could you produce that particular Patronus? Prongs rode again last night.\"  It took a moment for Harry to realize what Dumblefore had said.  Last night Sirius told me all about how they became Animagi,\" said Dumbledore, smiling. \"An extraordinary achievement -- not least, keeping it quiet from me. And then I remembered the most unusual form your Patronus took, when it charged Mr. Malfoy down at your Quidditch match against Ravenclaw. You know, Harry, in a way, you did see your father last night.... You found him inside yourself.\"  And Dumbledore left the office, leaving Harry to his very confused thoughts.  Nobody at Hogwarts now knew the truth of what had happened the night that Sirius, Buckbeak, and Pettigrew had vanished except Harry, Ron, Hermione, and Professor Dumbledore. As the end of term approached, Harry heard many different theories about what had really happened, but none of them came close to the truth.  Malfoy was furious about Buckbeak. He was convinced that Hagrid had found a way of smuggling the hippogriff to safety, and seemed outraged that he and his father had been outwitted by a gamekeeper. Percy Weasley, meanwhile, had much to say on the subject of Sirius's escape.  \"If I manage to get into the Ministry, I'll have a lot of proposals to make about Magical Law Enforcement!\" he told the only person who would listen -- his girlfriend, Penelope.  Though the weather was perfect, though the atmosphere was so  cheerful, though he knew they had achieved the near impossible in helping Sirius to freedom, Harry had never approached the end of a school year in worse spirits.  He certainly wasn't the only one who was sorry to see Professor Lupin go. The whole of Harry's Defense Against the Dark Arts class was miserable about his resignation."
}