{
  "id": "610281f4cb76b41e8d82c7a69e7de1b880f00598",
  "text": "  Jusst one more  quesstion to guess, yes, yess,\" said Gollum.  But  Bilbo  simply  could  not  think  of  any  question  with  that  nasty  wet  cold  thing  sitting  next  to  him,  and  pawing  and  poking  him.  He  scratched  himself,  he  pinched himself; still he could not think of anything.  \"Ask us! ask us!\" said Gollum.  Bilbo  pinched  himself  and  slapped  himself;  he  gripped  on  his  little  sword;  he  even felt  in his pocket with his other hand. There he found  the ring he had picked  up in the passage and forgotten about.  \"What have I got in my pocket?\" he said aloud. He was talking to himself, but  Gollum thought it was a riddle, and he was frightfully upset.  \"Not fair! not fair!\" he hissed. \"It isn't fair, my precious, is it, to ask us what it's  got in its nassty little pocketses?\"  Bilbo seeing what had happened and having nothing better  to ask stuck  to his  question. \"What have I got in my pocket?\" he said louder.   \"S-s-s-s-s,\"  hissed  Gollum.  \"It  must  give  us  three  guesseses,  my  preciouss,  three guesseses.\"  \"Very well! Guess away!\" said Bilbo.  \"Handses!\" said Gollum.  \"Wrong,\" said Bilbo, who had luckily just taken his hand  out again. \"Guess again!\"  \"S-s-s-s-s,\"  said Gollum more  upset  than  ever. He  thought  of  all  the  things  he  kept  in  his  own  pockets:  fishbones,  goblins'  teeth, wet  shells,  a  bit  of  bat-wing, a  sharp stone to sharpen his fangs on, and other nasty things. He tried to think what  other people kept in their pockets.  \"Knife!\" he said at last.  \"Wrong!\" said Bilbo, who had lost his some time ago. \"Last guess!\"  Now Gollum was  in  a much worse  state  than when  Bilbo  had  asked  him  the  egg-question.  He  hissed  and  spluttered  and  rocked  himself  backwards  and  forwards, and slapped his feet on the floor, and wriggled and squirmed; but still he  did not dare to waste his last guess.   ####-\"Come  on!\"  said  Bilbo.  \"I  am waiting!\" He  tried  to  sound  bold  and  cheerful,  but  he  did  not  feel  at  all  sure  how  the  game  was  going  to  end,  whether  Gollum  guessed right or not.  \"Time's up!\" he said.  \"String,  or  nothing!\"  shrieked  Gollum,  which  was  not  quite  fair-working  in  two guesses at once.  \"Both  wrong,\"  cried  Bilbo  very much  relieved;  and  he  jumped  at  once  to  his  feet,  put  his  back  to  the  nearest  wall,  and  held  out  his  little  sword.  He  knew,  of  course,  that  the  riddle-game  was  sacred  and  of  immense  antiquity,  and  even  wicked creatures were afraid  to cheat when  they played at  it. But he  felt he could  not trust this slimy thing to keep any promise at a pinch. Any excuse would do for  him to slide out of it. And after all that last question had not been a genuine riddle  according to the ancient laws.  But at any  rate Gollum did not at once attack him. He could  see  the  sword  in  Bilbo's  hand.  He  sat  still,  shivering  and  whispering.  At  last  Bilbo  could  wait  no  longer.   \"Well?\" he said. \"What about your  promise? I want to go. You must show me  the way.\"  \"Did we say so, precious? Show the nassty little Baggins the way out, yes, yes.  But what has  it got  in  its pocketses, eh? Not string, precious, but not nothing. Oh  no! gollum!\"  \"Never you mind,\" said Bilbo. \"A promise is a promise.\"  \"Cross  it  is,  impatient,  precious,\"  hissed  Gollum.  \"But  it  must  wait,  yes  it  must. We  can't  go  up  the  tunnels  so  hasty. We must  go  and  get  some  things  first,  yes, things to help us.\"  \"Well,  hurry  up!\"  said  Bilbo,  relieved  to  think  of  Gollum  going  away.  He  thought he was just making an excuse and did not mean to come back. What was  Gollum talking about? What useful thing could he keep out on the dark lake? But  he  was  wrong.  Gollum  did  mean  to  come  back.  He  was  angry  now  and  hungry.   And he was a miserable wicked creature, and already he had a plan.  Not  far  away  was  his  island,  of  which  Bilbo  knew  nothing,  and  there  in  his  hiding-place he kept a few wretched oddments, and one very beautiful thing, very  beautiful, very wonderful. He had a ring, a golden ring, a precious ring.  \"My  birthday-present!\"  he  whispered  to  himself,  as  he  had  often  done  in  the  endless dark days. \"That's what we wants now, yes; we wants it!\"   ####-He  wanted  it  because  it  was  a  ring  of  power,  and  if  you  slipped  that  ring on  your  finger,  you  were  invisible;  only  in  the  full  sunlight  could  you  be  seen,  and  then only by your shadow, and that would be shaky and faint.  \"My  birthday-present! It came to me on my birthday, my precious,\" So he had  always  said  to  himself.  But  who  knows  how Gollum  came  by  that  present,  ages  ago  in  the old days when such rings were still at  large  in  the world? Perhaps even  the Master who ruled them could not have said. Gollum used to wear it at first, till  it tired him; and then he kept it in a pouch next his skin, till it galled him; and now  usually he hid it in a hole in the rock on his island, and was always going back to  look  at  it."
}