{
  "id": "61ae326dc33406c29cb13d3ffe7488f6711f2859",
  "text": "  Thorin  had  been  caught  much  faster  than  they  had.  You  remember  Bilbo  falling  like  a  log  into  sleep,  as  he  stepped  into  a  circle  of  light?  The  next  time  it  had  been  Thorin  who  stepped  forward,  and  as  the  lights  went  out  he  fell  like  a  stone  enchanted.  All  the  noise  of  the  dwarves  lost  in  the  night,  their  cries  as  the  spiders caught them and bound them, and all the sounds of the battle next day, had  passed over him unheard. Then the Wood-elves had come to him, and bound him,  and carried him away. The feasting people were Wood-elves, of course. These are  not wicked folk. If they have a fault it is distrust of strangers. Though their magic  was strong, even in those days they were wary. They differed from the High Elves  of  the West,  and were more  dangerous  and  less wise.  For most  of  them  (together  with  their  scattered  relations  in  the hills  and mountains) were  descended from the  ancient  tribes  that never went  to Faerie  in  the West. There  the Light-elves and the  Deep-elves  and  the  Sea-elves  went  and  lived  for  ages,  and  grew  fairer  and  wiser  and more learned, and invented their magic and their cunning craft, in the making  of  beautiful  and marvellous  things,  before  some  came  back  into  the Wide World.  In  the Wide World  the Wood-elves  lingered  in  the  twilight of  our Sun  and Moon  but  loved  best  the  stars;  and  they  wandered  in  the  great  forests  that  grew  tall  in  lands  that  are  now  lost.  They  dwelt  most  often  by  the  edges  of  the  woods,  from  which they could escape at times to hunt, or to ride and run over the open lands by  moonlight or starlight; and after the coming of Men they took ever more and more  to  the  gloaming  and  the  dusk. Still  elves  they were  and  remain,  and  that  is Good  People.   ####-In  a  great  cave  some  miles  within  the  edge  of  Mirkwood  on  its  eastern  side  there  lived  at  this  time  their  greatest  king. Before  his  huge  doors  of  stone  a  river  ran  out  of  the  heights  of  the  forest  and  flowed on  and out  into  the marshes  at  the  feet of the high wooded lands. This great cave, from which countless smaller ones  opened  out  on  every  side,  wound  far  underground  and  had  many  passages  and  wide  halls;  but  it was  lighter  and more wholesome  than  any  goblin-dwelling, and  neither so deep nor so dangerous. In fact the subjects of the king mostly lived and  hunted  in  the  open  woods,  and  had  houses  or  huts  on  the  ground  and  in  the  branches. The  beeches were  their  favourite  trees. The  king's  cave  was his palace,  and  the  strong  place  of  his  treasure,  and  the  fortress  of  his  people  against  their  enemies.  It was  also  the  dungeon  of  his  prisoners.  So  to  the  cave  they  dragged Thorin- not  too  gently,  for  they  did  not  love  dwarves,  and  thought  he  was  an  enemy.  In  ancient days  they had had wars with some of  the dwarves, whom  they accused of  stealing  their  treasure.  It  is  only  fair  to  say  that  the  dwarves  gave  a  different  account, and said that they only took what was their due, for the elf-king had bar-  gained with  them  to  shape  his  raw  gold  and  silver,  and  had  afterwards  refused  to  give  them  their  pay.  If  the  elf-king had  a weakness  it was  for  treasure,  especially  for  silver  and  white  gems;  and  though  his  hoard  was  rich,  he  was  ever  eager  for  more, since he  had not yet  as great  a  treasure  as other  elf-lords of old. His people  neither mined nor worked metals or jewels, nor did they bother much with trade or  with  tilling  the  earth.  All  this  was  well  known  to  every  dwarf,  though  Thorin's  family had had nothing  to do with the old quarrel I have spoken of. Consequently  Thorin was angry at their treatment of him, when they took their spell off him and  he came  to his senses; and also he was determined  that no word of gold or  jewels  should be dragged out of him.  The  king  looked  sternly  on  Thorin,  when  he  was  brought  before  him,  and  asked him many questions. But Thorin would only say that he was starving.  \"Why  did  you  and  your  folk  three  times  try  to  attack  my  people  at  their  merrymaking?\" asked the king.  \"We  did  not  attack  them,\"  answered  Thorin;  \"we  came  to  beg,  because  we  were starving.\"  \"Where are your friends now, and what are they doing?\"  \"I don't know, but I expect starving in the forest.\"  \"What were you doing in the forest?\"  \"Looking for food and drink, because we were starving.\"  \"But what brought you into the forest at all?\" asked the king angrily.    ####-At that Thorin shut his mouth and would not say another word.  \"Very well!\"  said  the  king.  \"Take  him  away  and  keep  him  safe,  until  he  feels  inclined to tell the truth, even if he waits a hundred years.'\"  Then the elves put thongs on him, and shut him in one of the inmost caves with  strong wooden doors, and left him."
}