{
  "id": "62ba867653ce0cf22b969d974d19ba9c53626977",
  "text": " He took off his helm, and he said to me, ‘Have no fear, Stark. I was only keeping it warm for our friend Robert. It’s not a very comfortable seat, I’m afraid.’   The king threw back his head and roared. His laughter startled a flight of crows from the tall brown grass. They took to the air in a wild beating of wings.  You think I should mistrust Lannister because he sat on my throne for a few moments?  He shook with laughter again.  Jaime was all of seventeen, Ned. Scarce more than a boy.    Boy or man, he had no right to that throne.    Perhaps he was tired,  Robert suggested.  Killing kings is weary work. Gods know, there’s no place else to rest your ass in that damnable room. And he spoke truly, it is a monstrous uncomfortable chair. In more ways than one.  The king shook his head.  Well, now I know Jaime’s dark sin, and the matter can be forgotten. I am heartily sick of secrets and squabbles and matters of state, Ned. It’s all as tedious as counting coppers. Come, let’s ride, you used to know how. I want to feel the wind in my hair again.  He kicked his horse back into motion and galloped up over the barrow, raining earth down behind him.  For a moment Ned did not follow. He had run out of words, and he was filled with a vast sense of helplessness. Not for the first time, he wondered what he was doing here and why he had come. He was no Jon Arryn, to curb the wildness of his king and teach him wisdom. Robert would do what he pleased, as he always had, and nothing Ned could say or do would change that. He belonged in Winterfell. He belonged with Catelyn in her grief, and with Bran.  A man could not always be where he belonged, though. Resigned, Eddard Stark put his boots into his horse and set off after the king.      TYRION  The north went on forever.  Tyrion Lannister knew the maps as well as anyone, but a fortnight on the wild track that passed for the kingsroad up here had brought home the lesson that the map was one thing and the land quite another.  They had left Winterfell on the same day as the king, amidst all the commotion of the royal departure, riding out to the sound of men shouting and horses snorting, to the rattle of wagons and the groaning of the queen’s huge wheelhouse, as a light snow flurried about them. The kingsroad was just beyond the sprawl of castle and town. There the banners and the wagons and the columns of knights and freeriders turned south, taking the tumult with them, while Tyrion turned north with Benjen Stark and his nephew.  It had grown colder after that, and far more quiet.  West of the road were flint hills, grey and rugged, with tall watchtowers on their stony summits. To the east the land was lower, the ground flattening to a rolling plain that stretched away as far as the eye could see. Stone bridges spanned swift, narrow rivers, while small farms spread in rings around holdfasts walled in wood and stone. The road was well trafficked, and at night for their comfort there were rude inns to be found.  Three days ride from Winterfell, however, the farmland gave way to dense wood, and the kingsroad grew lonely. The flint hills rose higher and wilder with each passing mile, until by the fifth day they had turned into mountains, cold blue-grey giants with jagged promontories and snow on their shoulders. When the wind blew from the north, long plumes of ice crystals flew from the high peaks like banners.  With the mountains a wall to the west, the road veered north by northeast through the wood, a forest of oak and evergreen and black brier that seemed older and darker than any Tyrion had ever seen.  The wolfswood,  Benjen Stark called it, and indeed their nights came alive with the howls of distant packs, and some not so distant. Jon Snow’s albino direwolf pricked up his ears at the nightly howling, but never raised his own voice in reply. There was something very unsettling about that animal, Tyrion thought.  There were eight in the party by then, not counting the wolf. Tyrion traveled with two of his own men, as befit a Lannister. Benjen Stark had only his bastard nephew and some fresh mounts for the Night’s Watch, but at the edge of the wolfswood they stayed a night behind the wooden walls of a forest holdfast, and there joined up with another of the black brothers, one Yoren. Yoren was stooped and sinister, his features hidden behind a beard as black as his clothing, but he seemed as tough as an old root and as hard as stone. With him were a pair of ragged peasant boys from the Fingers.  Rapers,  Yoren said with a cold look at his charges. Tyrion understood. Life on the Wall was said to be hard, but no doubt it was preferable to castration.  Five men, three boys, a direwolf, twenty horses, and a cage of ravens given over to Benjen Stark by Maester Luwin. No doubt they made a curious fellowship for the kingsroad, or any road.  Tyrion noticed Jon Snow watching Yoren and his sullen companions, with an odd cast to his face that looked uncomfortably like dismay. Yoren had a twisted shoulder and a sour smell, his hair and beard were matted and greasy and full of lice, his clothing old, patched, and seldom washed."
}