{
  "id": "64bbddf3845b75dbab8a0bc8d7a272ef57611bca",
  "text": " Under these circumstances knighthood was out of the question, Lord Sumner told him, not unkindly. He was sent back to the Twins to face Lord Walder’s poisonous disdain.  After that, Merrett’s luck had only grown worse. His father had managed to make a good marriage for him, somehow; he wed one of Lord Darry’s daughters, back when the Darrys stood high in King Aerys’s favor. But it seemed as if he no sooner had deflowered his bride than Aerys lost his throne. Unlike the Freys, the Darrys had been prominent Targaryen loyalists, which cost them half their lands, most of their wealth, and almost all their power. As for his lady wife, she found him a great disappointment from the first, and insisted on popping out nothing but girls for years; three live ones, a stillbirth, and one that died in infancy before she finally produced a son. His eldest daughter had turned out to be a slut, his second a glutton. When Ami was caught in the stables with no fewer than three grooms, he’d been forced to marry her off to a bloody hedge knight. That situation could not possibly get any worse, he’d thought… until Ser Pate decided he could win renown by defeating Ser Gregor Clegane. Ami had come running back a widow, to Merrett’s dismay and the undoubted delight of every stablehand in the Twins.  Merrett had dared to hope that his luck was finally changing when Roose Bolton chose to wed his Walda instead of one of her slimmer, comelier cousins. The Bolton alliance was important for House Frey and his daughter had helped secure it; he thought that must surely count for something. The old man had soon disabused him.  He picked her because she’s fat,  Lord Walder said.  You think Bolton gave a mummer’s fart that she was your whelp? Think he sat about thinking, ‘Heh, Merrett Muttonhead, that’s the very man I need for a good-father’? Your Walda’s a sow in silk, that’s why he picked her, and I’m not like to thank you for it. We’d have had the same alliance at half the price if your little porkling put down her spoon from time to time.   The final humiliation had been delivered with a smile, when Lame Lothar had summoned him to discuss his role in Roslin’s wedding.  We must each play our part, according to our gifts,  his half-brother told him.  You shall have one task and one task only, Merrett, but I believe you are well suited to it. I want you to see to it that Greatjon Umber is so bloody drunk that he can hardly stand, let alone fight.   And even that I failed at. He’d cozened the huge northman into drinking enough wine to kill any three normal men, yet after Roslin had been bedded the Greatjon still managed to snatch the sword of the first man to accost him and break his arm in the snatching. It had taken eight of them to get him into chains, and the effort had left two men wounded, one dead, and poor old Ser Leslyn Haigh short half a ear. When he couldn’t fight with his hands any longer, Umber had fought with his teeth.  Merrett paused a moment and closed his eyes. His head was throbbing like that bloody drum they’d played at the wedding, and for a moment it was all he could do to stay in the saddle. I have to go on, he told himself. If he could bring back Petyr Pimple, surely it would put him in Ser Ryman’s good graces. Petyr might be a whisker on the hapless side, but he wasn’t as cold as Edwyn, nor as hot as Black Walder. The boy will be grateful for my part, and his father will see that I’m loyal, a man worth having about.  But only if he was there by sunset with the gold. Merrett glanced at the sky. Right on time, He needed something to steady his hands. He pulled up the waterskin hung from his saddle, uncorked it, and took a long swallow. The wine was thick and sweet, so dark it was almost black, but gods it tasted good.  The curtain wall of Oldstones had once encircled the brow of the hill like the crown on a king’s head. Only the foundation remained, and a few waist-high piles of crumbling stone spotted with lichen. Merrett rode along the line of the wall until he came to the place where the gatehouse would have stood. The ruins were more extensive here, and he had to dismount to lead his palfrey through them. In the west, the sun had vanished behind a bank of low clouds. Gorse and bracken covered the slopes, and once inside the vanished walls the weeds were chest high. Merrett loosened his sword in its scabbard and looked about warily, but saw no outlaws. Could I have come on the wrong day? He stopped and rubbed his temples with his thumbs, but that did nothing to ease the pressure behind his eyes. Seven bloody hells…  From somewhere deep within the castle, faint music came drifting through the trees.  Merrett found himself shivering, despite his cloak. He pulled open his waterskin and had another drink of wine. I could just get back on my horse, ride to Oldtown, and drink the gold away. No good ever came from dealing with outlaws. That vile little bitch Wenda had burned a fawn into the cheek of his arse while she had him captive."
}