{
  "id": "64c107024e4896966f983b96fac560419c9d8093",
  "text": " I like the ring of that, Bronn. You almost sound a proper courtier. Next you’ll be kneeling.    Fuck you, dwarf.    That’s Shae’s task.  Tyrion heard Lady Tanda calling to him merrily from the top of the serpentine steps. Pretending not to notice her, he waddled a bit faster.  See that my litter is readied, I’ll be leaving the castle as soon as I’m done here.  Two of the Moon Brothers had the door guard. Tyrion greeted them pleasantly, and grimaced before starting up the stairs. The climb to his bedchamber made his legs ache.  Within he found a boy of twelve laying out clothing on the bed; his squire, such that he was. Podrick Payne was so shy he was furtive. Tyrion had never quite gotten over the suspicion that his father had inflicted the boy on him as a joke.   Your garb, my lord,  the boy mumbled when Tyrion entered, staring down at his boots. Even when he worked up the courage to speak, Pod could never quite manage to look at you.  For the audience. And your chain. The Hand’s chain.    Very good. Help me dress.  The doublet was black velvet covered with golden studs in the shape of lions’ heads, the chain a loop of solid gold hands, the fingers of each clasping the wrist of the next. Pod brought him a cloak of crimson silk fringed in gold, cut to his height. On a normal man, it would be no more than a half cape.  The Hand’s private audience chamber was not so large as the king’s, nor a patch on the vastness of the throne room, but Tyrion liked its Myrish rugs, wall hangings, and sense of intimacy. As he entered, his steward cried out,  Tyrion Lannister, Hand of the King.  He liked that too. The gaggle of smiths, armorers, and ironmongers that Bronn had collected fell to their knees.  He hoisted himself up into the high seat under the round golden window and bid them rise.  Goodmen, I know you are all busy, so I will be succinct. Pod, if you please.  The boy handed him a canvas sack. Tyrion yanked the drawstring and upended the bag. Its contents spilled onto the rug with a muffled thunk of metal on wool.  I had these made at the castle forge. I want a thousand more just like them.   One of the smiths knelt to inspect the object: three immense steel links, twisted together.  A mighty chain.    Mighty, but short,  the dwarf replied.  Somewhat like me. I fancy one a good deal longer. Do you have a name?    They call me Ironbelly, m’lord.  The smith was squat and broad, plainly dressed in wool and leather, but his arms were as thick as a bull’s neck.   I want every forge in King’s Landing turned to making these links and joining them. All other work is to be put aside. I want every man who knows the art of working metal set to this task, be he master, journeyman, or apprentice. When I ride up the Street of Steel, I want to hear hammers ringing, night or day. And I want a man, a strong man, to see that all this is done. Are you that man, Goodman Ironbelly?    Might be I am, m’lord. But what of the mail and swords the queen was wanting?   Another smith spoke up.  Her Grace commanded us to make chainmail and armor, swords and daggers and axes, all in great numbers. For arming her new gold cloaks, m’lord.    That work can wait,  Tyrion said.  The chain first.    M’lord, begging your pardon, Her Grace said those as didn’t meet their numbers would have their hands crushed,  the anxious Smith persisted.  Smashed on their own anvils, she said.   Sweet Cersei, always striving to make the smallfolk love us.  No one will have their hands smashed. You have my word on it.    Iron is grown dear,  Ironbelly declared,  and this chain will be needing much of it, and coke beside, for the fires.    Lord Baelish will see that you have coin as you need it,  Tyrion promised. He could count on Littlefinger for that much, he hoped.  I will command the City Watch to help you find iron. Melt down every horseshoe in this city if you must.   An older man moved forward, richly dressed in a damask tunic with silver fastenings and a cloak lined with foxfur. He knelt to examine the great steel links Tyrion had dumped on the floor.  My lord,  he announced gravely,  this is crude work at best. There is no art to it. Suitable labor for common smiths, no doubt, for men who bend horseshoes and hammer out kettles, but I am a master armorer, as it please my lord. This is no work for me, nor my fellow masters. We make swords as sharp as song, armor such as a god might wear. Not this.   Tyrion tilted his head to the side and gave the man a dose of his mismatched eyes.  What is your name, master armorer?    Salloreon, as it please my lord. If the King’s Hand will permit, I should be most honored to forge him a suit of armor suitable to his House and high office.  Two of the others sniggered, but Salloreon plunged ahead, heedless.  Plate and scale, I think. The scales gilded bright as the sun, the plate enameled a deep Lannister crimson. I would suggest a demon’s head for a helm, crowned with tall golden horns. When you ride into battle, men will shrink away in fear."
}