{
  "id": "64d537426177639caecbc2f904cad189542222b9",
  "text": " `I asked you the same  question once before-it   seems a very long while ago; but you have seen more  of them since then.'       'I  have  indeed!  ' said Sam. 'And I reckon  there's  Elves and Elves.   They're  all  elvish enough,  but they're not all the same. Now  these  folk   aren't wanderers or homeless, and seem a bit nearer to the likes of us: they  seem to belong here, more even than Hobbits do in the Shire. Whether they've  made the land, or  the  land's  made them, it's hard to say,  if you take my  meaning. It's  wonderfully  quiet here.  Nothing seems to  be going on,  and  nobody  seems to  want it to. If  there's any magic  about,  it's right down  deep, where I can't lay my hands on it, in a manner of speaking.'       'You can see and feel it everywhere,' said Frodo.       'Well,' said Sam, 'you can't  see nobody working  it. No  fireworks like  poor Gandalf used to  show. I  wonder  we  don't see nothing of the Lord and  Lady in all these days. I fancy now that she could do some wonderful things,  if she had a mind. I'd dearly love to see some Elf-magic, Mr. Frodo!  '       'I  wouldn't,' said Frodo.  `I am content.  And I don't  miss Gandalf's  fireworks, but his bushy eyebrows, and his quick temper, and his voice.'       `You're right,'  said  Sam.  `And don't think I'm  finding  fault. I've  often wanted to  see a  bit of magic like what it tells of in old tales, but  I've never heard of a  better land than this. It's like being at home and on  a holiday at the same time, if you understand me. I don't want to leave. All   ####-the same,  I'm beginning to feel that if we've got to go on,  then we'd best  get it over.       'It's the  job that's never started as takes longest  to finish, as  my  old gaffer used to say. And I don't reckon that these folk  can do much more  to  help us, magic or no. It's  when we leave  this land that we shall  miss  Gandalf worse, I'm thinking.'       'I  am afraid that's only too  true, Sam,' said Frodo. `Yet I hope very  much that before we leave we shall see the Lady of the Elves again.'       Even as he spoke, they saw,  as if she  came in answer to their  words,   the  Lady Galadriel  approaching. Tall and white and fair she walked beneath  the trees. She spoke no word, but beckoned to them.       Turning aside, she led them  toward  the southern slopes of the hill of  Caras Galadhon,  and passing through  a high green  hedge they  came into an  enclosed  garden. No trees  grew there,  and it  lay open  to the  sky.  The  evening star had risen and  was  shining with white  fire above  the western  woods.  Down a long flight of steps the Lady went into   a deep green hollow,  through which ran murmuring the silver stream that issued from the  fountain  on  the hill.  At the bottom, upon a  low  pedestal  carved like a branching  tree, stood a basin  of silver.  wide  and shallow, and beside  it  stood  a   si lver ewer.       With water from the stream Galadriel  filled the basin to the brim, and  breathed  on it, and when the water  was still again she spoke. `Here is the  Mirror  of Galadriel,'  she said.  'I have  brought you here so that you may  look in it, if you will.'       The air was very still, and the dell  was dark, and the Elf-lady beside  him was tall and pale. 'What shall we  look  for,  and what shall we  see? '  asked Frodo, filled with awe.       `Many things I can command the Mirror to reveal,' she a nswered, `and to   some I can  show  what  they desire  to see. But the  Mirror will  also show  things unbidden,  and those  are  often stranger  and more  profitable  than  things which we  wish  to behold. What you will see, if you leave the Mirror   free to work, I cannot tell.  For it shows things that were, and things that  are,  things  that yet may be. But which it is that he sees, even the wisest   cannot always tell. Do you wish to look? '       Frodo did not answer.       `And you? ' she said, turning to Sam.  'For this is what your folk would  call magic. I  believe;  though I  do not understand clearly what they mean;   ####-and  they seem also to use  the  same word of the  deceits of the Enemy. But  this, if you will, is  the  magic of Galadriel. Did  you not  say  that  you   wished to see Elf-magic?  '       'I did,' said Sam, trembling a little between fear and curiosity. `I'll  have a peep, Lady, if you're willing.'       `And I'd not mind  a glimpse of what's going on at home,' he said in an  aside to  Frodo.  'It seems a terrible  long time that  I've been  away. But  there, like  as  not I'll only  see the  stars,  or something that  I  won't   understand.'       'Like as not,' said the Lady with a gentle laugh. `But come,  you shall  look and see what you may. Do not touch the water! '       Sam climbed up  on  the foot of the pedestal and leaned over the basin.  The water looked hard and dark. Stars were reflected in it.       `There's only stars, as I thought,'  he said. Then he gave a  low gasp,  for  the stars went out."
}