{
  "id": "65a0e1048f155195e08695990ad5a7a54f15e96d",
  "text": "  They  moved to a clump of trees, and though it was drier under them, the wind shook the  rain  off  the  leaves,  and  the  drip,  drip,  was  most  annoying.  Also  the  mischief  seemed to have got into the fire. Dwarves can make a fire almost anywhere out of  almost anything, wind or no wind; but they could not do it that night, not even Oin  and Gloin, who were specially good at it.  Then one of  the ponies  took  fright at nothing and bolted. He got  into  the  river  before they could catch him; and before they could get him out again, Fili and Kili  were  nearly  drowned,  and  all  the  baggage  that  he  carried  was  washed  away  off  him. Of course it was mostly food, and there was mighty little left for supper, and  less  for  breakfast.  There  they  all  sat  glum  and wet  and muttering, while Oin  and  Gloin  went  on  trying  to  light  the  fire,  and  quarrelling  about  it.  Bilbo  was  sadly  reflecting  that  adventures  are  not  all  pony-rides  in  May-sunshine,  when  Balin,  who was  always  their  look-out man, said:  \"There's a light over there!\" There was  a hill  some way off with  trees on  it, pretty  thick  in parts. Out of  the dark mass of  the  trees  they  could  now  see  a  light  shining,  a  reddish  comfortable-looking light,  as  it  might  be  a  fire  or  torches  twinkling.  When  they  had  looked  at  it  for  some  while,  they  fell  to  arguing.  Some  said  \"no\"  and  some  said  \"yes.\"  Some  said  they  could but go and see, and anything was better than little supper, less breakfast, and  wet  clothes  all  the  night. Others  said:  \"These  parts  are  none  too well known, and  are  too  near  the mountains. Travellers  seldom  come  this way  now. The  old maps  are  no  use:  things  have  changed  for  the  worse  and  the  road  is  unguarded.    They  have seldom even heard of the king round here, and the less inquisitive you are as  you  go  along,  the  less  trouble  you  are  likely  to  find.\"  Some  said:  \"After  all  there  are  fourteen  of  us.\"  Others  said:  \"Where  has  Gandalf  got  to?\"  This  remark  was  repeated  by  everybody.  Then  the  rain  began  to  pour  down  worse  than  ever,  and  Oin and Gloin began to fight. That settled it. \"After all we have got a burglar with   ####-us,\"  they said; and so  they made off,  leading  their ponies (with all due and proper  caution)  in  the  direction  of  the  light.  They  came  to  the  hill  and  were  soon  in  the  wood.  Up  the  hill  they  went;  but  there  was  no  proper  path  to  be  seen,  such  as  might  lead  to  a  house  or  a  farm;  and  do  what  they  could  they  made  a  deal  of  rustling  and  crackling  and  creaking  (and  a good deal of grumbling  and drafting),  as they went through the trees in the pitch dark.  Suddenly  the  red  light  shone  out  very  bright  through  the  tree-trunks  not  far  ahead.  \"Now  it  is  the  burglar's  turn,\"  they  said, meaning Bilbo.  \"You must  go  on  and  find  out  all  about  that  light,  and what  it  is  for,  and  if  all  is  perfectly  safe and  canny,\" said Thorin to the hobbit. \"Now scuttle off, and come back quick, if all is  well.  If  not,  come  back  if  you  can!  It  you  can't,  hoot  twice  like  a  barn-owl and  once like a screech-owl, and we will do what we can.\"  Off Bilbo had  to go, before he  could explain that he could not hoot even once  like  any  kind  of  owl  any  more  than  fly  like  a  bat.  But  at  any  rate  hobbits  can  move quietly  in woods,  absolutely quietly. They  take  a pride  in  it,  and Bilbo had  sniffed  more  than  once  at  what  he  called  \"all  this dwarvish  racket,\" as  they went  along,  though  I  don't  sup-pose  you  or  I  would  notice  anything  at  all  on  a  windy  night,  not  if  the  whole  cavalcade  had  passed  two  feet  off.  As  for  Bilbo  walking  primly  towards  the  red  light,  I  don't  suppose  even  a  weasel  would  have  stirred  a  whisker  at  it.  So,  naturally,  he  got  right  up  to  the  fire-for  fire  it  was  without  disturbing anyone. And this is what he saw. Three very large persons sitting round  a  very  large  fire  of  beech-logs. They were  toasting mutton  on  long  spits of wood,  and  licking  the  gravy  off  their  fingers.  There  was  a  fine  toothsome  smell.  Also  there was a barrel of good drink at hand, and  they were drinking out of  jugs. But  they were  trolls. Obviously  trolls.  Even Bilbo,  in  spite  of  his  sheltered  life,  could  see  that:  from  the great heavy  faces of  them, and  their size, and  the shape of  their  legs, not to mention their language, which was not drawing-room fashion at all, at  all.  \"Mutton yesterday, mutton today, and blimey, if it don't look like mutton again  tomorrer,\" said one of the trolls.  \"Never  a  blinking  bit  of  manflesh  have  we  had  for  long  enough,\"  said  a  second.  \"What  the  'ell William was  a-thinkin' of to bring us into these parts at all,  beats me  - and  the drink  runnin'  short, what's more,\" he  said  jogging the elbow of  William, who was taking a pull at his jug."
}