{
  "id": "65a1c13258d58f3fa01d62844f2e1fd29bedbce6",
  "text": " That fool singer might make a lay of it. The Freys would report back to their lord, and the gods only knew what he might do. Lord Walder Frey might be sworn to Riverrun, but he was a cautious man who had lived a long time by making certain he was always on the winning side. At the very least he would send his birds winging south to King’s Landing, and he might well dare more than that.  Catelyn Stark wasted no time.  We must ride at once. We’ll want fresh mounts, and provisions for the road. You men, know that you have the eternal gratitude of House Stark. If any of you choose to help us guard our captives and get them safe to Winterfell, I promise you shall be well rewarded.  That was all it took; the fools came rushing forward. Tyrion studied their faces; they would indeed be well rewarded, he vowed to himself, but perhaps not quite as they imagined.  Yet even as they were bundling him outside, saddling the horses in the rain, and tying his hands with a length of coarse rope, Tyrion Lannister was not truly afraid. They would never get him to Winterfell, he would have given odds on that. Riders would be after them within the day, birds would take wing, and surely one of the river lords would want to curry favor with his father enough to take a hand. Tyrion was congratulating himself on his subtlety when someone pulled a hood down over his eyes and lifted him up onto a saddle.  They set out through the rain at a hard gallop, and before long Tyrion’s thighs were cramped and aching and his butt throbbed with pain. Even when they were safely away from the inn, and Catelyn Stark slowed them to a trot, it was a miserable pounding journey over rough ground, made worse by his blindness. Every twist and turn put him in danger of falling off his horse. The hood muffled sound, so he could not make out what was being said around him, and the rain soaked through the cloth and made it cling to his face, until even breathing was a struggle. The rope chafed his wrists raw and seemed to grow tighter as the night wore on. I was about to settle down to a warm fire and a roast fowl, and that wretched singer had to open his mouth, he thought mournfully. The wretched singer had come along with them.  There is a great song to be made from this, and I’m the one to make it,  he told Catelyn Stark when he announced his intention of riding with them to see how the  splendid adventure  turned out. Tyrion wondered whether the boy would think the adventure quite so splendid once the Lannister riders caught up with them.  The rain had finally stopped and dawn light was seeping through the wet cloth over his eyes when Catelyn Stark gave the command to dismount. Rough hands pulled him down from his horse, untied his wrists, and yanked the hood off his head. When he saw the narrow stony road, the foothills rising high and wild all around them, and the jagged snowcapped peaks on the distant horizon, all the hope went out of him in a rush.  This is the high road,  he gasped, looking at Lady Stark with accusation.  The eastern road. You said we were riding for Winterfell!   Catelyn Stark favored him with the faintest of smiles.  Often and loudly,  she agreed.  No doubt your friends will ride that way when they come after us. I wish them good speed.   Even now, long days later, the memory filled him with a bitter rage. All his life Tyrion had prided himself on his cunning, the only gift the gods had seen fit to give him, and yet this seven-times-damned she-wolf Catelyn Stark had outwitted him at every turn. The knowledge was more galling than the bare fact of his abduction.  They stopped only as long as it took to feed and water the horses, and then they were off again. This time Tyrion was spared the hood. After the second night they no longer bound his hands, and once they had gained the heights they scarcely bothered to guard him at all. It seemed they did not fear his escape. And why should they? Up here the land was harsh and wild, and the high road little more than a stony track. If he did run, how far could he hope to go, alone and without provisions? The shadowcats would make a morsel of him, and the clans that dwelt in the mountain fastnesses were brigands and murderers who bowed to no law but the sword.  Yet still the Stark woman drove them forward relentlessly. He knew where they were bound. He had known it since the moment they pulled off his hood. These mountains were the domain of House Arryn, and the late Hand’s widow was a Tully, Catelyn Stark’s sister… and no friend to the Lannisters. Tyrion had known the Lady Lysa slightly during her years at King’s Landing, and did not look forward to renewing the acquaintance.  His captors were clustered around a stream a short ways down the high road. The horses had drunk their fill of the icy cold water, and were grazing on clumps of brown grass that grew from clefts in the rock. Jyck and Morrec huddled close, sullen and miserable. Mohor stood over them, leaning on his spear and wearing a rounded iron cap that made him look as if he had a bowl on his head."
}