{
  "id": "688e43d001954ea23b36b8e7a4710e1395471f5c",
  "text": " No doubt the maester has some work you can do.   Sam swallowed, stepped back, and scurried out so quickly he almost tripped over the rushes.   Is that boy as big a fool as he seems?  the Lord Commander asked when he’d gone.  Fool,  the raven complained. Mormont did not wait for Jon to answer.  His lord father stands high in King Renly’s councils, and I had half a notion to dispatch him… no, best not. Renly is not like to heed a quaking fat boy. I’ll send Ser Arnell. He’s a deal steadier, and his mother was one of the green-apple Fossoways.    If it please my lord, what would you have of King Renly?    The same things I’d have of all of them, lad. Men, horses, swords, armor, grain, cheese, wine, wool, nails… the Night’s Watch is not proud, we take what is offered.  His fingers drummed against the roughhewn planks of the table.  If the winds have been kind, Ser Alliser should reach King’s Landing by the turn of the moon, but whether this boy Joffrey will pay him any heed, I do not know. House Lannister has never been a friend to the Watch.    Thorne has the wight’s hand to show them.  A grisly pale thing with black fingers, it was, that twitched and stirred in its jar as if it were still alive.   Would that we had another hand to send to Renly.    Dywen says you can find anything beyond the Wall.    Aye, Dywen says. And the last time he went ranging, he says he saw a bear fifteen feet tall.  Mormont snorted.  My sister is said to have taken a bear for her lover. I’d believe that before I’d believe one fifteen feet tall. Though in a world where dead come walking… ah, even so, a man must believe his eyes. I have seen the dead walk. I’ve not seen any giant bears.  He gave Jon a long, searching look.  But we were speaking of hands. How is yours?    Better.  Jon peeled off his moleskin glove and showed him. Scars covered his arm halfway to the elbow, and the mottled pink flesh still felt tight and tender, but it was healing.  It itches, though. Maester Aemon says that’s good. He gave me a salve to take with me when we ride.    You can wield Longclaw despite the pain?    Well enough.  Jon flexed his fingers, opening and closing his fist the way the maester had shown him.  I’m to work the fingers every day to keep them nimble, as Maester Aemon said.    Blind he may be, but Aemon knows what he’s about. I pray the gods let us keep him another twenty years. Do you know that he might have been king?   Jon was taken by surprise.  He told me his father was king, but not… I thought him perhaps a younger son.    So he was. His father’s father was Daeron Targaryen, the Second of His Name, who brought Dorne into the realm. Part of the pact was that he wed a Dornish princess. She gave him four sons. Aemon’s father Maekar was the youngest of those, and Aemon was his third son. Mind you, all this happened long before I was born, ancient as Smallwood would make me.    Maester Aemon was named for the Dragonknight.    So he was. Some say Prince Aemon was King Daeron’s true father, not Aegon the Unworthy. Be that as it may, our Aemon lacked the Dragonknight’s martial nature. He likes to say he had a slow sword but quick wits. Small wonder his grandfather packed him off to the Citadel. He was nine or ten, I believe… and ninth or tenth in the line of succession as well.   Maester Aemon had counted more than a hundred name days, Jon knew. Frail, shrunken, wizened, and blind, it was hard to imagine him as a little boy no older than Arya.  Mormont continued.  Aemon was at his books when the eldest of his uncles, the heir apparent, was slain in a tourney mishap. He left two sons, but they followed him to the grave not long after, during the Great Spring Sickness. King Daeron was also taken, so the crown passed to Daeron’s second son, Aerys.    The Mad King?  Jon was confused. Aerys had been king before Robert, that wasn’t so long ago.   No, this was Aerys the First. The one Robert deposed was the second of that name.    How long ago was this?    Eighty years or close enough,  the Old Bear said,  and no, I still hadn’t been born, though Aemon had forged half a dozen links of his maester’s chain by then. Aerys wed his own sister, as the Targaryens were wont to do, and reigned for ten or twelve years. Aemon took his vows and left the Citadel to serve at some lordling’s court… until his royal uncle died without issue. The Iron Throne passed to the last of King Daeron’s four sons. That was Maekar, Aemon’s father. The new king summoned all his sons to court and would have made Aemon part of his councils, but he refused, saying that would usurp the place rightly belonging to the Grand Maester. Instead he served at the keep of his eldest brother, another Daeron. Well, that one died too, leaving only a feeble-witted daughter as heir. Some pox he caught from a whore, I believe. The next brother was Aerion.    Aerion the Monstrous?  Jon knew that name.  The Prince Who Thought He Was a Dragon  was one of Old Nan’s more gruesome tales. His little brother Bran had loved it."
}