{
  "id": "6c4c72f4e211238eda2ca65fbbb41616e8babbe4",
  "text": "  I think not.   Now the lad looked lost.  My lord?    You heard me. My father told you to obey my sister? Very well, obey her. Stay close to her side, keep her trust, pleasure her as often as she requires it. No one need ever know… so long as you keep faith with me. I want to know what Cersei is doing. Where she goes, who she sees, what they talk of, what plans she is hatching. All. And you will be the one to tell me, won’t you?    Yes, my lord.  Lancel spoke without a moment’s hesitation. Tyrion liked that.  I will. I swear it. As you command.    Rise.  Tyrion filled the second cup and pressed it on him.  Drink to our understanding. I promise, there are no boars in the castle that I know of.  Lancel lifted the cup and drank, albeit stiffly.  Smile, cousin. My sister is a beautiful woman, and it’s all for the good of the realm. You could do well out of this. Knighthood is nothing. If you’re clever, you’ll have a lordship from me before you’re done.  Tyrion swirled the wine in his cup.  We want Cersei to have every faith in you. Go back and tell her I beg her forgiveness. Tell her that you frightened me, that I want no conflict between us, that henceforth I shall do nothing without her consent.    But… her demands…    Oh, I’ll give her Pycelle.    You will?  Lancel seemed astonished.  Tyrion smiled.  I’ll release him on the morrow. I could swear that I hadn’t harmed a hair on his head, but it wouldn’t be strictly true. In any case, he’s well enough, though I won’t vouch for his vigor. The black cells are not a healthy place for a man his age. Cersei can keep him as a pet or send him to the Wall, I don’t care which, but I won’t have him on the council.    And Ser Jacelyn?    Tell my sister you believe you can win him away from me, given time. That ought to content her for a while.    As you say.  Lancel finished his wine.   One last thing. With King Robert dead, it would be most embarrassing should his grieving widow suddenly grow great with child.    My lord, I… we… the queen has commanded me not to…  His ears had turned Lannister crimson.  I spill my seed on her belly, my lord.    A lovely belly, I have no doubt. Moisten it as often as you wish… but see that your dew falls nowhere else. I want no more nephews, is that clear?   Ser Lancel made a stiff bow and took his leave.  Tyrion allowed himself a moment to feel sorry for the boy. Another fool, and a weakling as well, but he does not deserve what Cersei and I are doing to him. It was a kindness that his uncle Kevan had two other sons; this one was unlikely to live out the year. Cersei would have him killed out of hand if she learned he was betraying her, and if by some grace of the gods she did not, Lancel would never survive the day Jaime Lannister returned to King’s Landing. The only question would be whether Jaime cut him down in a jealous rage, or Cersei murdered him first to keep Jaime from finding out. Tyrion’s silver was on Cersei.  A restlessness was on him, and Tyrion knew full well he would not get back to sleep tonight. Not here, in any case. He found Podrick Payne asleep in a chair outside the door of the solar, and shook him by the shoulder.  Summon Bronn, and then run down to the stables and have two horses saddled.   The squire’s eyes were cloudy with sleep.  Horses.    Those big brown animals that love apples, I’m sure you’ve seen them. Four legs and a tail. But Bronn first.   The sellsword was not long in appearing.  Who pissed in your soup?  he demanded.   Cersei, as ever. You’d think I’d be used to the taste by now, but never mind. My gentle sister seems to have mistaken me for Ned Stark.    I hear he was taller.    Not after Joff took off his head. You ought to have dressed more warmly, the night is chill.    Are we going somewhere?    Are all sellswords as clever as you?   The city streets were dangerous, but with Bronn beside him Tyrion felt safe enough. The guards let him out a postern gate in the north wall, and they rode down Shadowblack Lane to the foot of Aegon’s High Hill, and thence onto Pigrun Alley, past rows of shuttered windows and tall timber-and-stone buildings whose upper stories leaned out so far over the street they almost kissed. The moon seemed to follow them as they went, playing peek-and-sneak among the chimneys. They encountered no one but a lone old crone, carrying a dead cat by the tail. She gave them a fearful look, as if she were afraid they might try to steal her dinner, and slunk off into the shadows without a word.  Tyrion reflected on the men who had been Hand before him, who had proved no match for his sister’s wiles. How could they be? Men like that… too honest to live, too noble to shit, Cersei devours such fools every morning when she breaks her fast. The only way to defeat my sister is to play her own game, and that was something the Lords Stark and Arryn would never do. Small wonder that both of them were dead, while Tyrion Lannister had never felt more alive. His stunted legs might make him a comic grotesque at a harvest ball, but this dance he knew."
}