{
  "id": "701b09295321ca8edf60e6d37f00471dc8087ec5",
  "text": "  When the old man came, she was curled up inside her hrakkar pelt, whose musty smell still reminded her of Drogo.  I cannot sleep when men are dying for me, Whitebeard,  she said.  Tell me more of my brother Rhaegar, if you would. I liked the tale you told me on the ship, of how he decided that he must be a warrior.    Your Grace is kind to say so.    Viserys said that our brother won many tourneys.   Arstan bowed his white head respectfully.  It is not meet for me to deny His Grace’s words…    But?  said Dany sharply.  Tell me. I command it.    Prince Rhaegar’s prowess was unquestioned, but he seldom entered the lists. He never loved the song of swords the way that Robert did, or Jaime Lannister. It was something he had to do, a task the world had set him. He did it well, for he did everything well. That was his nature. But he took no joy in it. Men said that he loved his harp much better than his lance.    He won some tourneys, surely,  said Dany, disappointed.   When he was young, His Grace rode brilliantly in a tourney at Storm’s End, defeating Lord Steffon Baratheon, Lord Jason Mallister, the Red Viper of Dorne, and a mystery knight who proved to be the infamous Simon Toyne, chief of the kingswood outlaws. He broke twelve lances against Ser Arthur Dayne that day.    Was he the champion, then?    No, Your Grace. That honor went to another knight of the Kingsguard, who unhorsed Prince Rhaegar in the final tilt.   Dany did not want to hear about Rhaegar being unhorsed.  But what tourneys did my brother win?    Your Grace.  The old man hesitated.  He won the greatest tourney of them all.    Which was that?  Dany demanded.   The tourney Lord Whent staged at Harrenhal beside the Gods Eye, in the year of the false spring. A notable event. Besides the jousting, there was a mêlée in the old style fought between seven teams of knights, as well as archery and axe-throwing, a horse race, a tournament of singers, a mummer show, and many feasts and frolics. Lord Whent was as open handed as he was rich. The lavish purses he proclaimed drew hundreds of challengers. Even your royal father came to Harrenhal, when he had not left the Red Keep for long years. The greatest lords and mightiest champions of the Seven Kingdoms rode in that tourney, and the Prince of Dragonstone bested them all.    But that was the tourney when he crowned Lyanna Stark as queen of love and beauty!  said Dany.  Princess Elia was there, his wife, and yet my brother gave the crown to the Stark girl, and later stole her away from her betrothed. How could he do that? Did the Dornish woman treat him so ill?    It is not for such as me to say what might have been in your brother’s heart, Your Grace. The Princess Elia was a good and gracious lady, though her health was ever delicate.   Dany pulled the lion pelt tighter about her shoulders.  Viserys said once that it was my fault, for being born too late.  She had denied it hotly, she remembered, going so far as to tell Viserys that it was his fault for not being born a girl. He beat her cruelly for that insolence.  If I had been born more timely, he said, Rhaegar would have married me instead of Elia, and it would all have come out different. If Rhaegar had been happy in his wife, he would not have needed the Stark girl.    Perhaps so, Your Grace.  Whitebeard paused a moment.  But I am not certain it was in Rhaegar to be happy.    You make him sound so sour,  Dany protested.   Not sour, no, but… there was a melancholy to Prince Rhaegar, a sense…  The old man hesitated again.   Say it,  she urged.  A sense…?    …of doom. He was born in grief, my queen, and that shadow hung over him all his days.   Viserys had spoken of Rhaegar’s birth only once. Perhaps the tale saddened him too much.  It was the shadow of Summerhall that haunted him, was it not?    Yes. And yet Summerhall was the place the prince loved best. He would go there from time to time, with only his harp for company. Even the knights of the Kingsguard did not attend him there. He liked to sleep in the ruined hall, beneath the moon and stars, and whenever he came back he would bring a song. When you heard him play his high harp with the silver strings and sing of twilights and tears and the death of kings, you could not but feel that he was singing of himself and those he loved.    What of the Usurper? Did he play sad songs as well?   Arstan chuckled.  Robert? Robert liked songs that made him laugh, the bawdier the better. He only sang when he was drunk, and then it was like to be ‘A Cask of Ale’ or ‘Fifty-Four Tuns’ or ‘The Bear and the Maiden Fair.’ Robert was much—   As one, her dragons lifted their heads and roared.   Horses!  Dany leapt to her feet, clutching the lion pelt. Outside, she heard Strong Belwas bellow something, and then other voices, and the sounds of many horses.  Irri, go see who…   The tent flap pushed open, and Ser Jorah Mormont entered. He was dusty, and spattered with blood, but otherwise none the worse for battle. The exile knight went to one knee before Dany and said,  Your Grace, I bring you victory."
}