{
  "id": "7197a2bc0b29b755e973a99c9800945099764c77",
  "text": " But Littlefinger only smiled at Sansa as they marched him up to the bedchamber where his lady wife was waiting.  Lady Lysa and Lord Petyr had the third-story bedchamber to themselves, but the tower was small… and true to her word, her aunt screamed. It had begun to rain outside, driving the feasters into the hall one floor below, so they heard most every word.  Petyr,  her aunt moaned.  Oh, Petyr, Petyr, sweet Petyr, oh oh oh. There, Petyr, there. That’s where you belong.  Lady Lysa’s singer launched into a bawdy version of  Milady’s Supper,  but even his singing and playing could not drown out Lysa’s cries.  Make me a baby, Petyr,  she screamed,  make me another sweet little baby. Oh, Petyr, my precious, my precious, PEEEEEETYR!  Her last shriek was so loud that it set the dogs to barking, and two of her aunt’s ladies could scarce contain their mirth.  Sansa went down the steps and out into the night. A light rain was falling on the remains of the feast, but the air smelled fresh and clean. The memory of her own wedding night with Tyrion was much with her. In the dark, I am the Knight of Flowers, he had said. I could be good to you. But that was only another Lannister lie. A dog can smell a lie, you know, the Hound had told her once. She could almost hear the rough rasp of his voice. Look around you, and take a good whiff. They’re all liars here, and every one better than you. She wondered what had become of Sandor Clegane. Did he know that they’d killed Joffrey? Would he care? He had been the prince’s sworn shield for years.  She stayed outside for a long time. When at last she sought her own bed, wet and chilled, only the dim glow of a peat fire lit the darkened hall. There was no sound from above. The young singer sat in a corner, playing a slow song to himself. One of her aunt’s maids was kissing a knight in Lord Petyr’s chair, their hands busy beneath each other’s clothing. Several men had drunk themselves to sleep, and one was in the privy, being noisily sick. Sansa found Bryen’s old blind dog in her little alcove beneath the steps, and lay down next to him. He woke and licked her face.  You sad old hound,  she said, ruffling his fur.   Alayne.  Her aunt’s singer stood over her.  Sweet Alayne. I am Marillion. I saw you come in from the rain. The night is chill and wet. Let me warm you.   The old dog raised his head and growled, but the singer gave him a cuff and sent him slinking off, whimpering.   Marillion?  she said, uncertain.  You are… kind to think of me, but… pray forgive me. I am very tired.    And very beautiful. All night I have been making songs for you in my head. A lay for your eyes, a ballad for your lips, a duet to your breasts. I will not sing them, though. They were poor things, unworthy of such beauty.  He sat on her bed and put his hand on her leg.  Let me sing to you with my body instead.   She caught a whiff of his breath.  You’re drunk.    I never get drunk. Mead only makes me merry. I am on fire.  His hand slipped up to her thigh.  And you as well.    Unhand me. You forget yourself.    Mercy. I have been singing love songs for hours. My blood is stirred. And yours, I know… there’s no wench half so lusty as one bastard born. Are you wet for me?    I’m a maiden,  she protested.   Truly? Oh, Alayne, Alayne, my fair maid, give me the gift of your innocence. You will thank the gods you did. I’ll have you singing louder than the Lady Lysa.   Sansa jerked away from him, frightened.  If you don’t leave me, my au—my father will hang you. Lord Petyr.    Littlefinger?  He chuckled.  Lady Lysa loves me well, and I am Lord Robert’s favorite. If your father offends me, I will destroy him with a verse.  He put a hand on her breast, and squeezed.  Let’s get you out of these wet clothes. You wouldn’t want them ripped, I know. Come, sweet lady, heed your heart—   Sansa heard the soft sound of steel on leather.  Singer,  a rough voice said,  best go, if you want to sing again.  The light was dim, but she saw a faint glimmer of a blade.  The singer saw it too.  Find your own wench—  The knife flashed, and he cried out.  You cut me!    I’ll do worse, if you don’t go.   And quick as that, Marillion was gone. The other remained, looming over Sansa in the darkness.  Lord Petyr said watch out for you.  It was Lothor Brune’s voice, she realized. Not the Hound’s, no, how could it be? Of course it had to be Lothor…  That night Sansa scarcely slept at all, but tossed and turned just as she had aboard the Merling King. She dreamt of Joffrey dying, but as he clawed at his throat and the blood ran down across his fingers she saw with horror that it was her brother Robb. And she dreamed of her wedding night too, of Tyrion’s eyes devouring her as she undressed. Only then he was bigger than Tyrion had any right to be, and when he climbed into the bed his face was scarred only on one side.  I’ll have a song from you,  he rasped, and Sansa woke and found the old blind dog beside her once again.  I wish that you were Lady,  she said."
}