{
  "id": "7247add741485de5f9f8c7dff4628460cb4ce00f",
  "text": " . . .\"  \"Sit down,\" said Harry politely, pointing at the bed.  To his horror, the elf burst into tears - very noisy tears.  \"S-sit down!\" he wailed. \"Never ... never ever. . . \"  Harry thought he heard the voices downstairs falter.  \"I'm sorry,\" he whispered, \"I didn't mean to offend you or anything -\"  \"Offend Dobby!\" choked the elf. \"Dobby has never been asked to sit down by a wizard - like an equal-\"  Harry, trying to say \"Shh!\" and look comforting at the same time, ushered Dobby back onto the bed where he sat hiccoughing, looking like a large and very ugly doll. At last he managed to control himself, and sat with his great eyes fixed on Harry in an expression of watery adoration.  \"You can't have met many decent wizards,\" said Harry, trying to cheer him up.  Dobby shook his head. Then, without warning, he leapt up and started banging his head furiously on the window, shouting, \"Bad Dobby! Bad Dobby!\"  \"Don't - what are you doing?\" Harry hissed, springing up and pulling Dobby back onto the bed - Hedwig had woken up with a particularly loud screech and was beating her wings wildly against the bars of her cage.  \"Dobby had to punish himself, sir,\" said the elf, who had gone slightly cross-eyed. \"Dobby almost spoke ill of his family, sir . . . .\"  \"Your family?\"  \"The wizard family Dobby serves, sir... DOBBY'S is a houseelf - bound to serve one house and one family forever . .....  \"Do they know you're here?\" asked Harry curiously.  Dobby shuddered.  \"Oh, no, sir, no ... Dobby will have to punish himself most grievously for coming to see you, sir. Dobby will have to shut his ears in the oven door for this. If they ever knew, sir _\"  \"But won't they notice if you shut your ears in the oven door?\"  \"Dobby doubts it, sir. Dobby is always having to punish himself for something, sir. They lets Dobby get on with it, sir. Sometimes they reminds me to do extra punishments ......  \"But why don't you leave? Escape?\"  \"A house-elf must be set free, sir. And the family will never set Dobby free ... Dobby will serve the family until he dies, sir . . . .\"  Harry stared.  \"And I thought I had it bad staying here for another four weeks,\"  he said. \"This makes the Dursleys sound almost human. Can't anyone help you? Can't I?\"  Almost at once, Harry wished he hadn't spoken. Dobby dissolved again into wails of gratitude.  \"Please,\" Harry whispered frantically, \"please be quiet. If the Dursleys hear anything, if they know you're here -\"  \"Harry Potter asks if he can help Dobby ... Dobby has heard of your greatness, sir, but of your goodness, Dobby never knew . .....  Harry, who was feeling distinctly hot in the face, said, \"Whatever you've heard about my greatness is a load of rubbish. I'm not even top of my year at Hogwarts; that's Hermione, she -\"  But he stopped quickly, because thinking about Hermione was painful.  \"I-Tarry Potter is humble and modest,\" said Dobby reverently, his orb- like eyes aglow. \"Harry Potter speaks not of his triumph over He-Who- Must-Not-Be-Named -\"  \"Voldemort?\" said Harry.  Dobby clapped his hands over his bat ears and moaned, \"Ah, speak not the name, sir! Speak not the name!\"  \"Sorry\" said Harry quickly. \"I know lots of people don't like it. My friend Ron -\"  He stopped again. Thinking about Ron was painful, too.  Dobby leaned toward Harry, his eyes wide as headlights.  'Dobby heard tell,\" he said hoarsely, \"that Harry Potter met the Dark Lord for a second time just weeks ago ... that Harry Potter escaped Yet again. \"  Harry nodded and Dobby's eyes suddenly shone with tears.  ,Ah, sir,\" he gasped, dabbing his face with a corner of the grubby  pillowcase he was wearing. \"Harry Potter is valiant and bold! He has braved so many dangers already! But Dobby has come to protect Harry Potter, to warn him, even if he does have to shut his ears in the oven door later... Harry Potter must notgo back to Hogwarts.\"  There was a silence broken only by the chink of knives and forks from downstairs and the distant rumble of Uncle Vernon's voice.  \"W-what?\" Harry stammered. \"But I've got to go back - term starts on September first. It's all that's keeping me going. You don't know what it's like here. I don't belong here. I belong in your world - at Hogwarts.\"  \"No, no, no,\" squeaked Dobby, shaking his head so hard his ears flapped. \"Harry Potter must stay where he is safe. He is too great, too good, to lose. If Harry Potter goes back to Hogwarts, he will be in mortal danger.\"  \"Why?\" said Harry in surprise.  \"There is a plot, Harry Potter. A plot to make most terrible things happen at Hogwarts School of Witchcraft and Wizardry this year,\" whispered Dobby, suddenly trembling all over. \"Dobby has known it for months, sir. Harry Potter must not put himself in peril. He is too important, sir!\"  \"What terrible things?\" said Harry at once. \"Who's plotting them?\"  Dobby made a funny choking noise and then banged his head frantically against the wall.  \"All right!\" cried Harry, grabbing the elf's arm to stop him. \"You can't tell me."
}