{
  "id": "7427c7bc8bbfe38003d7452ca0f4b02c2759ac53",
  "text": "   Every night when they made camp, Ygritte threw her sleeping skins down beside his own, no matter if he was near the fire or well away from it. Once he woke to find her nestled against him, her arm across his chest. He lay listening to her breathe for a long time, trying to ignore the tension in his groin. Rangers often shared skins for warmth, but warmth was not all Ygritte wanted, he suspected. After that he had taken to using Ghost to keep her away. Old Nan used to tell stories about knights and their ladies who would sleep in a single bed with a blade between them for honor’s sake, but he thought this must be the first time where a direwolf took the place of the sword.  Even then, Ygritte persisted. The day before last, Jon had made the mistake of wishing he had hot water for a bath.  Cold is better,  she had said at once,  if you’ve got someone to warm you up after. The river’s only part ice yet, go on.   Jon laughed.  You’d freeze me to death.    Are all crows afraid of gooseprickles? A little ice won’t kill you. I’ll jump in with you t’prove it so.    And ride the rest of the day with wet clothes frozen to our skins?  he objected.   Jon Snow, you know nothing. You don’t go in with clothes.    I don’t go in at all,  he said firmly, just before he heard Tormund Thunderfist bellowing for him (he hadn’t, but never mind).  The wildlings seemed to think Ygritte a great beauty because of her hair; red hair was rare among the free folk, and those who had it were said to be kissed by fire, which was supposed to be lucky. Lucky it might be, and red it certainly was, but Ygritte’s hair was such a tangle that Jon was tempted to ask her if she only brushed it at the changing of the seasons.  At a lord’s court the girl would never have been considered anything but common, he knew. She had a round peasant face, a pug nose, and slightly crooked teeth, and her eyes were too far apart. Jon had noticed all that the first time he’d seen her, when his dirk had been at her throat. Lately, though, he was noticing some other things. When she grinned, the crooked teeth didn’t seem to matter. And maybe her eyes were too far apart, but they were a pretty blue-grey color, and lively as any eyes he knew. Sometimes she sang in a low husky voice that stirred him. And sometimes by the cookfire when she sat hugging her knees with the flames waking echoes in her red hair, and looked at him, just smiling… well, that stirred some things as well.  But he was a man of the Night’s Watch, he had taken a vow. I shall take no wife, hold no lands, father no children. He had said the words before the weirwood, before his father’s gods. He could not unsay them… no more than he could admit the reason for his reluctance to Tormund Thunderfist, Father to Bears.   Do you mislike the girl?  Tormund asked him as they passed another twenty mammoths, these bearing wildlings in tall wooden towers instead of giants.   No, but I…  What can I say that he will believe?  I am still too young to wed.    Wed?  Tormund laughed.  Who spoke of wedding? In the south, must a man wed every girl he beds?   Jon could feel himself turning red again.  She spoke for me when Rattleshirt would have killed me. I would not dishonor her.    You are a free man now, and Ygritte is a free woman. What dishonor if you lay together?    I might get her with child.    Aye, I’d hope so. A strong son or a lively laughing girl kissed by fire, and where’s the harm in that?   Words failed him for a moment.  The boy… the child would be a bastard.    Are bastards weaker than other children? More sickly, more like to fail?    No, but—    You’re bastard-born yourself. And if Ygritte does not want a child, she will go to some woods witch and drink a cup o’ moon tea. You do not come into it, once the seed is planted.    I will not father a bastard.   Tormund shook his shaggy head.  What fools you kneelers be. Why did you steal the girl if you don’t want her?    Steal? I never…    You did,  said Tormund.  You slew the two she was with and carried her off, what do you call it?    I took her prisoner.    You made her yield to you.    Yes, but… Tormund, I swear, I’ve never touched her.    Are you certain they never cut your member off?  Tormund gave a shrug, as if to say he would never understand such madness.  Well, you are a free man now, but if you will not have the girl, best find yourself a she-bear. If a man does not use his member it grows smaller and smaller, until one day he wants to piss and cannot find it.   Jon had no answer for that. Small wonder that the Seven Kingdoms thought the free folk scarcely human. They have no laws, no honor, not even simple decency. They steal endlessly from each other, breed like beasts, prefer rape to marriage, and fill the world with baseborn children. Yet he was growing fond of Tormund Giantsbane, great bag of wind and lies though he was. Longspear as well. And Ygritte… no, I will not think about Ygritte.  Along with the Tormunds and the Longspears rode other sorts of wildlings, though; men like Rattleshirt and the Weeper who would as soon slit you as spit on you."
}