{
  "id": "74766a1ce4f663c81dab4bfb1692e795c8504bcf",
  "text": " To east and west, the flanks of the wildling host had reached the Wall unopposed. The chariots drew in or turned while the horsemen milled aimlessly beneath the looming cliff of ice.  At the gate!  a shout came. Spare Boot, maybe.  Mammoth at the gate!    Fire,  Jon barked.  Grenn, Pyp.   Grenn thrust his bow aside, wrestled a barrel of oil onto its side, and rolled it to the edge of the Wall, where Pyp hammered out the plug that sealed it, stuffed in a twist of cloth, and set it alight with a torch. They shoved it over together. A hundred feet below it struck the Wall and burst, filling the air with shattered staves and burning oil. Grenn was rolling a second barrel to the precipice by then, and Kegs had one as well. Pyp lit them both.  Got him!  Satin shouted, his head sticking out so far that Jon was certain he was about to fall.  Got him, got him, GOT him!  He could hear the roar of fire. A flaming giant lurched into view, stumbling and rolling on the ground.  Then suddenly the mammoths were fleeing, running from the smoke and flames and smashing into those behind them in their terror. Those went backward too, the giants and wildlings behind them scrambling to get out of their way. In half a heartbeat the whole center was collapsing. The horsemen on the flanks saw themselves being abandoned and decided to fall back as well, not one so much as blooded. Even the chariots rumbled off, having done nothing but look fearsome and make a lot of noise. When they break, they break hard, Jon Snow thought as he watched them reel away. The drums had all gone silent. How do you like that music, Mance? How do you like the taste of the Dornishman’s wife?  Do we have anyone hurt?  he asked.   The bloody buggers got my leg.  Spare Boot plucked the arrow out and waved it above his head.  The wooden one!   A ragged cheer went up. Zei grabbed Owen by the hands, spun him around in a circle, and gave him a long wet kiss right there for all to see. She tried to kiss Jon too, but he held her by the shoulder and pushed her gently but firmly away.  No,  he said. I am done with kissing. Suddenly he was too weary to stand, and his leg was agony from knee to groin. He fumbled for his crutch.  Pyp, help me to the cage. Grenn, you have the Wall.    Me?  said Grenn.  Him?  said Pyp. It was hard to tell which of them was more horrified.  But,  Grenn stammered,  b-but what do I do if the wildlings attack again?    Stop them,  Jon told him.  As they rode down in the cage, Pyp took off his helm and wiped his brow.  Frozen sweat. Is there anything as disgusting as frozen sweat?  He laughed.  Gods, I don’t think I have ever been so hungry. I could eat an aurochs whole, I swear it. Do you think Hobb will cook up Grenn for us?  When he saw Jon’s face, his smile died.  What’s wrong? Is it your leg?    My leg,  Jon agreed. Even the words were an effort.   Not the battle, though? We won the battle.    Ask me when I’ve seen the gate,  Jon said grimly. I want a fire, a hot meal, a warm bed, and something to make my leg stop hurting, he told himself. But first he had to check the tunnel and find what had become of Donal Noye.  After the battle with the Thenns it had taken them almost a day to clear the ice and broken beams away from the inner gate. Spotted Pate and Kegs and some of the other builders had argued heatedly that they ought just leave the debris there, another obstacle for Mance. That would have meant abandoning the defense of the tunnel, though, and Noye was having none of it. With men in the murder holes and archers and spears behind each inner grate, a few determined brothers could hold off a hundred times as many wildlings and clog the way with corpses. He did not mean to give Mance Rayder free passage through the ice. So with pick and spade and ropes, they had moved the broken steps aside and dug back down to the gate.  Jon waited by the cold iron bars while Pyp went to Maester Aemon for the spare key. Surprisingly, the maester himself returned with him, and Clydas with a lantern.  Come see me when we are done,  the old man told Jon while Pyp was fumbling with the chains.  I need to change your dressing and apply a fresh poultice, and you will want some more dreamwine for the pain.   Jon nodded weakly. The door swung open. Pyp led them in, followed by Clydas and the lantern. It was all Jon could do to keep up with Maester Aemon. The ice pressed close around them, and he could feel the cold seeping into his bones, the weight of the Wall above his head. It felt like walking down the gullet of an ice dragon. The tunnel took a twist, and then another. Pyp unlocked a second iron gate. They walked farther, turned again, and saw light ahead, faint and pale through the ice. That’s bad, Jon knew at once. That’s very bad.  Then Pyp said,  There’s blood on the floor.   The last twenty feet of the tunnel was where they’d fought and died. The outer door of studded oak had been hacked and broken and finally torn off its hinges, and one of the giants had crawled in through the splinters."
}