{
  "id": "7a87994508785a71c78521091365a59a25a38a01",
  "text": " Dudley, meanwhile, was counting his presents. His face fell.  \"Thirty-six,\" he said, looking up at his mother and father. \"That's two less than last year.\"  \"Darling, you haven't counted Auntie Marge's present, see, it's here under this big one from Mommy and Daddy.\"  \"All right, thirty-seven then,\" said Dudley, going red in the face. Harry, who could see a huge Dudley tantrum coming on, began wolfing down his bacon as fast as possible in case Dudley turned the table over.  Aunt Petunia obviously scented danger, too, because she said quickly, \"And we'll buy you another two presents while we're out today. How's that, popkin? Two more presents. Is that all right''  Dudley thought for a moment. It looked like hard work. Finally he said slowly, \"So I'll have thirty ... thirty...\"  \"Thirty-nine, sweetums,\" said Aunt Petunia.  \"Oh.\" Dudley sat down heavily and grabbed the nearest parcel. \"All right then.\"  Uncle Vernon chuckled. \"Little tyke wants his money's worth, just like his father. 'Atta boy, Dudley!\" He ruffled Dudley's hair.  At that moment the telephone rang and Aunt Petunia went to answer it while Harry and Uncle Vernon watched Dudley unwrap the racing bike, a video camera, a remote control airplane, sixteen new computer games, and a VCR. He was ripping the paper off a gold wristwatch when Aunt Petunia came back from the telephone looking both angry and worried.  \"Bad news, Vernon,\" she said. \"Mrs. Figg's broken her leg. She can't take him.\" She jerked her head in Harry's direction.  Dudley's mouth fell open in horror, but Harry's heart gave a leap. Every year on Dudley's birthday, his parents took him and a friend out for the day, to adventure parks, hamburger restaurants, or the movies. Every year, Harry was left behind with Mrs. Figg, a mad old lady who lived two streets away. Harry hated it there. The whole house smelled of cabbage and Mrs. Figg made him look at photographs of all the cats she'd ever owned.  \"Now what?\" said Aunt Petunia, looking furiously at Harry as though he'd planned this. Harry knew he ought to feel sorry that Mrs. Figg had broken her leg, but it wasn't easy when he reminded himself it would be a whole year before he had to look at Tibbles, Snowy, Mr. Paws, and Tufty again.  \"We could phone Marge,\" Uncle Vernon suggested.  \"Don't be silly, Vernon, she hates the boy.\"  The Dursleys often spoke about Harry like this, as though he wasn't there -- or rather, as though he was something very nasty that couldn't understand them, like a slug.  \"What about what's-her-name, your friend -- Yvonne?\"  \"On vacation in Majorca,\" snapped Aunt Petunia.  \"You could just leave me here,\" Harry put in hopefully (he'd be able to watch what he wanted on television for a change and maybe even have a go on Dudley's computer).  Aunt Petunia looked as though she'd just swallowed a lemon.  \"And come back and find the house in ruins?\" she snarled.  \"I won't blow up the house,\" said Harry, but they weren't listening.  \"I suppose we could take him to the zoo,\" said Aunt Petunia slowly, \"... and leave him in the car....\"  \"That car's new, he's not sitting in it alone....\"  Dudley began to cry loudly. In fact, he wasn't really crying -- it had been years since he'd really cried -- but he knew that if he screwed up his face and wailed, his mother would give him anything he wanted.  \"Dinky Duddydums, don't cry, Mummy won't let him spoil your special day!\" she cried, flinging her arms around him.  \"I... don't... want... him... t-t-to come!\" Dudley yelled between huge, pretend sobs. \"He always sp- spoils everything!\" He shot Harry a nasty grin through the gap in his mother's arms.  Just then, the doorbell rang -- \"Oh, good Lord, they're here!\" said Aunt Petunia frantically -- and a moment later, Dudley's best friend, Piers Polkiss, walked in with his mother. Piers was a scrawny boy with a face like a rat. He was usually the one who held people's arms behind their backs while Dudley hit them. Dudley stopped pretending to cry at once.  Half an hour later, Harry, who couldn't believe his luck, was sitting in the back of the Dursleys' car with Piers and Dudley, on the way to the zoo for the first time in his life. His aunt and uncle hadn't been able to think of anything else to do with him, but before they'd left, Uncle Vernon had taken Harry aside.  \"I'm warning you,\" he had said, putting his large purple face right up close to Harry's, \"I'm warning you now, boy -- any funny business, anything at all -- and you'll be in that cupboard from now until Christmas.\"  \"I'm not going to do anything,\" said Harry, \"honestly..  But Uncle Vernon didn't believe him. No one ever did.  The problem was, strange things often happened around Harry and it was just no good telling the Dursleys he didn't make them happen.  Once, Aunt Petunia, tired of Harry coming back from the barbers looking as though he hadn't been at all, had taken a pair of kitchen scissors and cut his hair so short he was almost bald except for his bangs, which she left \"to hide that horrible scar."
}