{
  "id": "7ba91fdf6a72c0fba3c5d0ba442b5a8d1051f5c7",
  "text": " It was a black night, with a thin sliver of moon appearing and disappearing as the clouds blew past. Silent as a shadow, she told herself as she moved through the trees. In this darkness she dared not run, for fear of tripping on some unseen root or losing her way. On her left Gods Eye lapped calmly against its shores. on her right a wind sighed through the branches, and leaves rustled and stirred. Far off, she heard the howling of wolves.  Lommy and Hot Pie almost shit themselves when she stepped out of the trees behind them.  Quiet,  she told them, putting an arm around Weasel when the little girl came running up.  Hot Pie stared at her with big eyes.  We thought you left us.  He had his shortsword in hand, the one Yoren had taken off the gold cloak.  I was scared you was a wolf.    Where’s the Bull?  asked Lommy.   They caught him,  Arya whispered.  We have to get him out. Hot Pie, you got to help. We’ll sneak up and kill the guards, and then I’ll open the door.   Hot Pie and Lommy exchanged a look.  How many?    I couldn’t count,  Arya admitted.  Twenty at least, but only two on the door.   Hot Pie looked as if he were going to cry.  We can’t fight twenty.    You only need to fight one. I’ll do the other and we’ll get Gendry out and run.    We should yield,  Lommy said.  Just go in and yield.   Arya shook her head stubbornly.   Then just leave him, Arry,  Lommy pleaded.  They don’t know about the rest of us. If we hide, they’ll go away, you know they will. It’s not our fault Gendry’s captured.    You’re stupid, Lommy,  Arya said angrily.  You’ll die if we don’t get Gendry out. Who’s going to carry you?    You and Hot Pie.    All the time, with no one else to help? We’ll never do it. Gendry was the strong one. Anyhow, I don’t care what you say, I’m going back for him.  She looked at Hot Pie.  Are you coming?   Hot Pie glanced at Lommy, at Arya, at Lommy again.  I’ll come,  he said reluctantly.   Lommy, you keep Weasel here.   He grabbed the little girl by the hand and pulled her close.  What if the wolves come?    Yield,  Arya suggested.  Finding their way back to the village seemed to take hours. Hot Pie kept stumbling in the dark and losing his way, and Arya had to wait for him and double back. Finally she took him by the hand and led him along through the trees.  Just be quiet and follow.  When they could make out the first faint glow of the village fires against the sky, she said,  There’s dead men hanging on the other side of the hedge, but they’re nothing to be scared of, just remember fear cuts deeper than swords. We have to go real quiet and slow.  Hot Pie nodded.  She wriggled under the briar first and waited for him on the far side, crouched low. Hot Pie emerged pale and panting, face and arms bloody with long scratches. He started to say something, but Arya put a finger to his lips. On hands and knees, they crawled along the gibbet, beneath the swaying dead. Hot Pie never once looked up, nor made a sound.  Until the crow landed on his back, and he gave a muffled gasp.  Who’s there?  a voice boomed suddenly from the dark.  Hot Pie leapt to his feet.  I yield!  He threw away his sword as dozens of crows rose shrieking and complaining to flap about the corpses. Arya grabbed his leg and tried to drag him back down, but he wrenched loose and ran forward, waving his arms.  I yield, I yield.   She bounced up and drew Needle, but by then men were all around her. Arya slashed at the nearest, but he blocked her with a steel-clad arm, and someone else slammed into her and dragged her to the ground, and a third man wrenched the sword from her grasp. When she tried to bite, her teeth snapped shut on cold dirty chainmail.  Oho, a fierce one,  the man said, laughing. The blow from his iron-clad fist near knocked her head off.  They talked over her as she lay hurting, but Arya could not seem to understand the words. Her ears rang. When she tried to crawl off, the earth moved beneath her. They took Needle. The shame of that hurt worse than the pain, and the pain hurt a lot. Jon had given her that sword. Syrio had taught her to use it.  Finally someone grabbed the front of her jerkin, yanked her to her knees. Hot Pie was kneeling too, before the tallest man Arya had ever seen, a monster from one of Old Nan’s stories. She never saw where the giant had come from. Three black dogs raced across his faded yellow surcoat, and his face looked as hard as if it had been cut from stone. Suddenly Arya knew where she had seen those dogs before. The night of the tourney at King’s Landing, all the knights had hung their shields outside their pavilions.  That one belongs to the Hound’s brother,  Sansa had confided when they passed the black dogs on the yellow field.  He’s even bigger than Hodor, you’ll see. They call him the Mountain That Rides.   Arya let her head droop, only half aware of what was going on around her. Hot Pie was yielding some more. The Mountain said,  You’ll lead us to these others,  and walked off. Next she was stumbling past the dead men on their gibbet, while Hot Pie told their captors he’d bake them pies and tarts if they didn’t hurt him."
}