{
  "id": "7dd8452a1e2d533f3168118d99b38b122a7ded5e",
  "text": " Ashamed of  his terror, while Beregond of the Guard thought first of the captain whom he  loved,  Pippin got up and peered out.  At that  moment he caught  a flash of  white and silver coming from the  North, like a small star down on the dusky  fields. It moved with the speed of an arrow and grew as it came,  converging   swiftly with  the flight of  the four men  towards the  Gate.  It seemed  to  Pippin that a  pale light was spread about it and the heavy shadows gave way  before it; and then as  it drew near he thought that he heard, like  an echo  in the walls, a great voice calling.       'Gandalf!' he  cried. 'Gandalf!  He always  turns  up  when things  are  darkest.  Go on!  Go on,  White Rider! Gandalf, Gandalf!' he shouted wildly,  like  an  onlooker  at  a  great race urging on a runner who is  far  beyond  encouragement.       But now  the dark  swooping shadows  were  aware  of  the newcomer. One  wheeled towards  him; but it seemed to Pippin that he raised  his hand,  and  from  it a  shaft of  white light  stabbed upwards.  The Nazgyl  gave a long  wailing  cry  and swerved away; and with  that the  four others wavered, and  then rising in swift spirals they  passed away  eastward  vanishing into the  lowering cloud  above; and down  on the Pelennor it seemed for a  while less  dark.       Pippin watched,  and he  saw the  horseman and the White Rider meet and  halt, waiting for those on foot. Men now hurried out to them from the  City;   and soon they all passed from sight under the  outer walls, and he knew that  they were  entering the Gate. Guessing  that they would  come at once to the  Tower and the Steward, he  hurried to the entrance of the citadel.  There he  was  joined by  many others who had watched the race and the rescue from the  high walls.        It was not long before a clamour  was heard  in the streets leading  up  from the outer circles, and there was much cheering and crying of  the names  of Faramir  and Mithrandir. Presently Pippin saw torches, and followed by  a  press of people two horsemen riding slowly:  one was in white but shining no  longer, pale in the twilight as if his  fire was spent  or veiled; the other   was dark  and his  head  was  bowed.  They  dismounted, and  as  grooms took    ####-Shadowfax and the  other  horse,  they walked forward to the sentinel at the  gate: Gandalf  steadily,  his  grey  cloak  flung  back,  and  a fire  still  smouldering in his eyes; the  other,  clad all in green, slowly,  swaying  a   little as a weary or a wounded man.       Pippin pressed  forward  as  they passed  under the  lamp  beneath  the  gate-arch, and when he saw the pale face of Faramir he caught his breath. It   was the face  of one who has been assailed by a great fear  or anguish,  but  has  mastered it and now is quiet. Proud and grave he stood for  a moment as  he spoke to the guard, and Pippin gazing at him saw how closely he resembled  his brother  Boromir - whom Pippin had liked from  the  first,  admiring the  great man's lordly but kindly manner. Yet suddenly for Faramir his heart was  strangely moved with a feeling that  he had  not known before. Here was  one  with  an  air of high nobility such as  Aragorn at times revealed, less high  perhaps, yet also less incalculable and remote: one of the Kings of Men born  into a  later time,  but touched with the  wisdom  and sadness of  the Elder   Race. He knew  now  why Beregond spoke his name with love. He was a   captain  that  men would follow, that he would follow, even under  the shadow  of the  black wings.       'Faramir!'  he  cried aloud  with the others.  'Faramir!'  And  Faramir  catching his strange voice among the clamour  of the men of the City, turned   and looked down at him and was amazed.       'Whence  come  you?'  he said. 'A halfling,  and in the  livery  of the  Tower! Whence...? '       But  with that Gandalf stepped  to his side and spoke. 'He came with me  from  the land of the Halflings,' he said. 'He came with  me. But let us not  tarry here. There is much to say and to do, and you are weary. He shall come  with  us. Indeed  he  must,  for if he  does not forget his new  duties more  easily than I do, he must attend on his  lord  again within this hour. Come,  Pippin, follow us!'       So at length they came to the private chamber of the Lord of the  City.  There deep seats were set about a brazier of charcoal; and wine was brought;  and there Pippin,  hardly noticed, stood behind  the  chair of Denethor  and  felt his weariness little, so eagerly did he listen to all that was said.       When Faramir had  taken white bread and drunk a draught of wine, he sat  upon a low chair  at his father's left hand. Removed a little upon the other   side sat Gandalf in a  chair of  carven  wood; and he seemed  at first to be   ####-asleep. For at the beginning Faramir spoke only of the errand  upon which he  had been sent out ten days before, and he brought tidings of Ithilien and of  movements of the Enemy and his allies; and he told of the  fight on the road  when  the  men of Harad  and their  great beast were overthrown:  a  captain  reporting  to his master  such matters as had often been heard before, small  things of  border -war that  now seemed useless  and  petty,  shorn of  their  renown."
}