{
  "id": "7f06b37852a4817f0a6d801d807a293ec37b33c3",
  "text": " Catelyn had not realized how hungry she was. She ate standing in the yard, as stablehands moved their saddles to fresh mules. The hot juices ran down her chin and dripped onto her cloak, but she was too famished to care.  Then it was up onto a new mule and out again into the starlight. The second part of the ascent seemed more treacherous to Catelyn. The trail was steeper, the steps more worn, and here and there littered with pebbles and broken stone. Mya had to dismount a half-dozen times to move fallen rocks from their path.  You don’t want your mule to break a leg up here,  she said. Catelyn was forced to agree. She could feel the altitude more now. The trees were sparser up here, and the wind blew more vigorously, sharp gusts that tugged at her clothing and pushed her hair into her eyes. From time to time the steps doubled back on themselves, and she could see Stone below them, and the Gates of the Moon farther down, its torches no brighter than candles.  Snow was smaller than Stone, a single fortified tower and a timber keep and stable hidden behind a low wall of unmortared rock. Yet it nestled against the Giant’s Lance in such a way as to command the entire stone stair above the lower waycastle. An enemy intent on the Eyrie would have to fight his way from Stone step by step, while rocks and arrows rained down from Snow above. The commander, an anxious young knight with a pockmarked face, offered bread and cheese and the chance to warm themselves before his fire, but Mya declined.  We ought to keep going, my lady,  she said.  If it please you.  Catelyn nodded.  Again they were given fresh mules. Hers was white. Mya smiled when she saw him.  Whitey’s a good one, my lady. Sure of foot, even on ice, but you need to be careful. He’ll kick if he doesn’t like you.   The white mule seemed to like Catelyn; there was no kicking, thank the gods. There was no ice either, and she was grateful for that as well.  My mother says that hundreds of years ago, this was where the snow began,  Mya told her.  It was always white above here, and the ice never melted.  She shrugged.  I can’t remember ever seeing snow this far down the mountain, but maybe it was that way once, in the olden times.   So young, Catelyn thought, trying to remember if she had ever been like that. The girl had lived half her life in summer, and that was all she knew. Winter is coming, child, she wanted to tell her. The words were on her lips; she almost said them. Perhaps she was becoming a Stark at last.  Above Snow, the wind was a living thing, howling around them like a wolf in the waste, then falling off to nothing as if to lure them into complacency. The stars seemed brighter up here, so close that she could almost touch them, and the horned moon was huge in the clear black sky. As they climbed, Catelyn found it was better to look up than down. The steps were cracked and broken from centuries of freeze and thaw and the tread of countless mules, and even in the dark the heights put her heart in her throat. When they came to a high saddle between two spires of rock, Mya dismounted.  It’s best to lead the mules over,  she said.  The wind can be a little scary here, my lady.   Catelyn climbed stiffly from the shadows and looked at the path ahead; twenty feet long and close to three feet wide, but with a precipitous drop to either side. She could hear the wind shrieking. Mya stepped lightly out, her mule following as calmly as if they were crossing a bailey. It was her turn. Yet no sooner had she taken her first step than fear caught Catelyn in its jaws. She could feel the emptiness, the vast black gulfs of air that yawned around her. She stopped, trembling, afraid to move. The wind screamed at her and wrenched at her cloak, trying to pull her over the edge. Catelyn edged her foot backward, the most timid of steps, but the mule was behind her, and she could not retreat. I am going to die here, she thought. She could feel cold sweat trickling down her back.   Lady Stark,  Mya called across the gulf. The girl sounded a thousand leagues away.  Are you well?   Catelyn Tully Stark swallowed what remained of her pride.  I… I cannot do this, child,  she called out.   Yes you can,  the bastard girl said.  I know you can. Look how wide the path is.    I don’t want to look.  The world seemed to be spinning around her, mountain and sky and mules, whirling like a child’s top. Catelyn closed her eyes to steady her ragged breathing.   I’ll come back for you,  Mya said.  Don’t move, my lady.   Moving was about the last thing Catelyn was about to do. She listened to the skirling of the wind and the scuffling sound of leather on stone. Then Mya was there, taking her gently by the arm.  Keep your eyes closed if you like. Let go of the rope now, Whitey will take care of himself. Very good, my lady. I’ll lead you over, it’s easy, you’ll see. Give me a step now. That’s it, move your foot, just slide it forward. See. Now another. Easy. You could run across. Another one, go on."
}