{
  "id": "7f4137b794500f8712156375a11a804cd622a710",
  "text": "    My father believed the same,  said the Old Bear.  Let me have a look at that skull.   Jon dismounted. Slung across his back in a black leather shoulder sheath was Longclaw, the hand-and-a-half bastard blade the Old Bear had given him for saving his life. A bastard sword for a bastard, the men joked. The hilt had been fashioned new for him, adorned with a wolf’s-head pommel in pale stone, but the blade itself was Valyrian steel, old and light and deadly sharp.  He knelt and reached a gloved hand down into the maw. The inside of the hollow was red with dried sap and blackened by fire. Beneath the skull he saw another, smaller, the jaw broken off. It was half-buried in ash and bits of bone.  When he brought the skull to Mormont, the Old Bear lifted it in both hands and stared into the empty sockets.  The wildlings burn their dead. We’ve always known that. Now I wished I’d asked them why, when there were still a few around to ask.   Jon Snow remembered the wight rising, its eyes shining blue in the pale dead face. He knew why, he was certain.   Would that bones could talk,  the Old Bear grumbled.  This fellow could tell us much. How he died. Who burned him, and why. Where the wildlings have gone.  He sighed.  The children of the forest could speak to the dead, it’s said. But I can’t.  He tossed the skull back into the mouth of the tree, where it landed with a puff of fine ash.  Go through all these houses. Giant, get to the top of this tree, have a look. I’ll have the hounds brought up too. Perchance this time the trail will be fresher.  His tone did not suggest that he held out much hope of the last.  Two men went through each house, to make certain nothing was missed. Jon was paired with dour Eddison Tollett, a squire grey of hair and thin as a pike, whom the other brothers called Dolorous Edd.  Bad enough when the dead come walking,  he said to Jon as they crossed the village,  now the Old Bear wants them talking as well? No good will come of that, I’ll warrant. And who’s to say the bones wouldn’t lie? Why should death make a man truthful, or even clever? The dead are likely dull fellows, full of tedious complaints—the ground’s too cold, my gravestone should be larger, why does he get more worms than I do…   Jon had to stoop to pass through the low door. Within he found a packed dirt floor. There were no furnishings, no sign that people had lived here but for some ashes beneath the smoke hole in the roof.  What a dismal place to live,  he said.   I was born in a house much like this,  declared Dolorous Edd.  Those were my enchanted years. Later I fell on hard times.  A nest of dry straw bedding filled one corner of the room. Edd looked at it with longing.  I’d give all the gold in Casterly Rock to sleep in a bed again.    You call that a bed?    If it’s softer than the ground and has a roof over it, I call it a bed.  Dolorous Edd sniffed the air.  I smell dung.   The smell was very faint.  Old dung,  said Jon. The house felt as though it had been empty for some time. Kneeling, he searched through the straw with his hands to see if anything had been concealed beneath, then made a round of the walls. It did not take very long.  There’s nothing here.   Nothing was what he had expected; Whitetree was the fourth village they had passed, and it had been the same in all of them. The people were gone, vanished with their scant possessions and whatever animals they may have had. None of the villages showed any signs of having been attacked. They were simply… empty.  What do you think happened to them all?  Jon asked.   Something worse than we can imagine,  suggested Dolorous Edd.  Well, I might be able to imagine it, but I’d sooner not. Bad enough to know you’re going to come to some awful end without thinking about it aforetime.   Two of the hounds were sniffing around the door as they reemerged. Other dogs ranged through the village. Chett was cursing them loudly, his voice thick with the anger he never seemed to put aside. The light filtering through the red leaves of the weirwood made the boils on his face look even more inflamed than usual. When he saw Jon his eyes narrowed; there was no love lost between them.  The other houses had yielded no wisdom.  Gone,  cried Mormont’s raven, flapping up into the weirwood to perch above them.  Gone, gone, gone.    There were wildlings at Whitetree only a year ago.  Thoren Smallwood looked more a lord than Mormont did, clad in Ser Jaremy Rykker’s gleaming black mail and embossed breastplate. His heavy cloak was richly trimmed with sable, and clasped with the crossed hammers of the Rykkers, wrought in silver. Ser Jaremy’s cloak, once… but the wight had claimed Ser Jaremy, and the Night’s Watch wasted nothing.   A year ago Robert was king, and the realm was at peace,  declared Jarman Buckwell, the square stolid man who commanded the scouts.  Much can change in a year’s time.    One thing hasn’t changed,  Ser Mallador Locke insisted.  Fewer wildlings means fewer worries. I won’t mourn, whatever’s become of them."
}