{
  "id": "7fbe1eae76336722919f753958cfcca15659f480",
  "text": " With so many siblings, she was not like to be a stranger to the custom, but it was different when you were the one being bedded. On Catelyn’s own wedding night, Jory Cassell had torn her gown in his haste to get her out of it, and drunken Desmond Grell kept apologizing for every bawdy joke, only to make another. When Lord Dustin had beheld her naked, he’d told Ned that her breasts were enough to make him wish he’d never been weaned. Poor man, she thought. He had ridden south with Ned, never to return. Catelyn wondered how many of the men here tonight would be dead before the year was done. Too many, I fear.  Robb raised a hand.  if you think the time is meet, Lord Walder, by all means let us bed them.   A roar of approval greeted his pronouncement. Up in the gallery the musicians took up their pipes and horns and fiddles again, and began to play  The Queen Took Off Her Sandal, the King Took Off His Crown.  Jinglebell hopped from foot to foot, his own crown ringing.  I hear Tully men have trout between their legs instead of cocks,  Alyx Frey called out boldly.  Does it take a worm to make them rise?  To which Ser Marq Piper threw back,  I hear that Frey women have two gates in place of one!  and Alyx said,  Aye, but both are closed and barred to little things like you!  A gust of laughter followed, until Patrek Mallister climbed up onto a table to propose a toast to Edmure’s one-eyed fish.  And a mighty pike it is!  he proclaimed.  Nay, I’ll wager it’s a minnow,  Fat Walda Bolton shouted out from Catelyn’s side. Then the general cry of  Bed them! Bed them!  went up again.  The guests swarmed the dais, the drunkest in the forefront as ever. The men and boys surrounded Roslin and lifted her into the air whilst the maids and mothers in the hall pulled Edmure to his feet and began tugging at his clothing. He was laughing and shouting bawdy jokes back at them, though the music was too loud for Catelyn to hear. She heard the Greatjon, though.  Give this little bride to me,  he bellowed as he shoved through the other men and threw Roslin over one shoulder.  Look at this little thing! No meat on her at all!   Catelyn felt sorry for the girl. Most brides tried to return the banter, or at least pretended to enjoy it, but Roslin was stiff with terror, clutching the Greatjon as if she feared he might drop her. She’s crying too, Catelyn realized as she watched Ser Marq Piper pull off one of the bride’s shoes. I hope Edmure is gentle with the poor child. Jolly, bawdy music still poured down from the gallery; the queen was taking off her kirtle now, and the king his tunic.  She knew she should join the throng of women round her brother, but she would only ruin their fun. The last thing she felt just now was bawdy. Edmure would forgive her absence, she did not doubt; much jollier to be stripped and bedded by a score of lusty, laughing Freys than by a sour, stricken sister.  As man and maid were carried from the hall, a trail of clothing behind them, Catelyn saw that Robb had also remained. Walder Frey was prickly enough to see some insult to his daughter in that. He should join in Roslin’s bedding, but is it my place to tell him so? She tensed, until she saw that others had stayed as well. Petyr Pimple and Ser Whalen Frey slept on, their heads on the table. Merrett Frey poured himself another cup of wine, while Jinglebell wandered about stealing bites off the plates of those who’d left. Ser Wendel Manderly was lustily attacking a leg of lamb. And of course Lord Walder was far too feeble to leave his seat without help. He will expect Robb to go, though. She could almost hear the old man asking why His Grace did not want to see his daughter naked. The drums were pounding again, pounding and pounding and pounding.  Dacey Mormont, who seemed to be the only woman left in the hall besides Catelyn, stepped up behind Edwyn Frey, and touched him lightly on the arm as she said something in his ear. Edwyn wrenched himself away from her with unseemly violence.  No,  he said, too loudly.  I’m done with dancing for the nonce.  Dacey paled and turned away. Catelyn got slowly to her feet. What just happened there? Doubt gripped her heart, where an instant before had been only weariness. It is nothing, she tried to tell herself, you are seeing grumkins in the woodpile, you are become an old silly woman sick with grief and fear. But something must have shown on her face. Even Ser Wendel Manderly took note.  Is something amiss?  he asked, the leg of lamb in his hands.  She did not answer him. Instead she went after Edwyn Frey. The players in the gallery had finally gotten both king and queen down to their name-day suits. With scarcely a moment’s respite, they began to play a very different sort of song. No one sang the words, but Catelyn knew  The Rains of Castamere  when she heard it. Edwyn was hurrying toward a door. She hurried faster, driven by the music. Six quick strides and she caught him. And who are you, the proud lord said, that I must bow so low? She grabbed Edwyn by the arm to turn him and went cold all over when she felt the iron rings beneath his silken sleeve."
}