{
  "id": "813239d1b4c6ea3cd1cdba53ba2167c1dd1b0bb4",
  "text": "  Instead of killing the small boy, the curse had rebounded upon Voldemort.  Harry had survived with nothing but a lightning-shaped cut on his forehead, and Voldemort had been reduced to something barely alive.  His powers gone, his life almost extinguished, Voldemort had fled; the terror in which the secret community of witches and wizards had lived for so long had lifted, Voldemort's followers had disbanded, and Harry Potter had become famous.  It had been enough of a shock for Harry to discover, on his eleventh birthday, that he was a wizard; it had been even more disconcerting to find out that everyone in the hidden wizarding world knew his name.  Harry had arrived at Hogwarts to find that heads turned and whispers followed him wherever he went.  But he was used to it now:  At the end of this summer, he would be starting his fourth year at Hogwarts, and Harry was already counting the days until he would be back at the castle again.  But there was still a fortnight to go before he went back to school.  He looked hopelessly around his room again, and his eye paused on the birthday cards his two best friends had sent him at the end of July.  What would they say if Harry wrote to them and told them about his scar hurting?  At once, Hermione Granger's voice seemed to fill his head, shrill and panicky.  \"Your scar hurt?  Harry, that's really serious.... Write to Professor Dumbledore! And I'll go and check Common Magical Ailments and Afflictions.... Maybe there's something in there about curse scars. . . .\"  Yes, that would be Hermione's advice:  Go straight to the headmaster of Hogwarts, and in the meantime, consult a book.  Harry stared out of the window at the inky blue-black sky. He doubted very much whether a book could help him now.  As far as he knew, he was the only living person to have survived a curse like Voldemort's; it was highly unlikely, therefore, that he would find his symptoms listed in Common Magical Ailments and Afflictions.  As for informing the headmaster, Harry had no idea where Dumbledore went during the summer holidays.  He amused himself for a moment, picturing Dumbledore, with his long silver beard, full length wizard's robes, and pointed hat, stretched out on a beach somewhere, rubbing suntan lotion onto his long crooked nose.  Wherever Dumbledore was, though, Harry was sure that Hedwig would be able to find him; Harry's owl had never yet failed to deliver a letter to anyone, even without an address.  But what would he write?  Dear Professor Dumbledore, Sorry to bother you, but my scar hurt this morning.  Yours sincerely, Harry Potter.  Even inside his head the words sounded stupid.  And so he tried to imagine his other best friend, Ron Weasley's, reaction, and in a moment, Ron's red hair and long-nosed, freckled face seemed to swim before Harry, wearing a bemused expression.  \"Your scar hurt? But ... but You-Know-Who can't be near you now, can he? I mean ... you'd know, wouldn't you? He'd be trying to do you in again, wouldn't be? I dunno, Harry, maybe curse scars always twinge a bit... I'll ask Dad. . . .\"  Mr. Weasley was a fully qualified wizard who worked in the Misuse of Muggle Artifacts Office at the Ministry of Magic, but he didn't have any particular expertise in the matter of curses, as far as Harry knew.  In any case, Harry didn't like the idea of the whole Weasley family knowing that he, Harry, was getting jumpy about a few moments' pain.  Mrs. Weasley would fuss worse than Hermione, and Fred and George, Ron's sixteen- year-old twin brothers, might think Harry was losing his nerve.  The Weasleys were Harry's favorite family in the world; he was hoping that they might invite him to stay any time now (Ron had mentioned something about the Quidditch World Cup), and he somehow didn't want his visit punctuated with anxious inquiries about his scar.  Harry kneaded his forehead with his knuckles. What he really wanted (and it felt almost shameful to admit it to himself) was someone like - someone like a parent: an adult wizard whose advice he could ask without feeling stupid, someone who cared about him, who had had experience with Dark Magic....  And then the solution came to him. It was so simple, and so obvious, that he couldn't believe it had taken so long - Sirius.  Harry leapt up from the bed, hurried across the room, and sat down at his desk; he pulled a piece of parchment toward him, loaded his eagle-feather quill with ink, wrote Dear Sirius, then paused, wondering how best to phrase his problem, still marveling at the fact that he hadn't thought of Sirius straight away.  But then, perhaps it wasn't so surprising - after all, he had only found out that Sirius was his godfather two months ago.  There was a simple reason for Sirius's complete absence from Harry's life until then - Sirius had been in Azkaban, the terrifying wizard jail guarded by creatures called dementors, sightless, soul-sucking fiends who had come to search for Sirius at Hogwarts when he had escaped.  Yet Sirius had been innocent - the murders for which he had been convicted had been committed by Wormtail, Voldemort's supporter, whom nearly everybody now believed dead."
}