{
  "id": "81a2e93d02a1980a3645e497e8661a52fa131bcd",
  "text": " His  eyes,  filled with anger  and  disgust,  were  fixed  on the  wretched  creature as  he  now  began  to  move again,  still whispering and  hissing to himself.        At last he wa s no more than a  dozen  feet from the ground, right above  their  heads. From that  point  there  was a sheer  drop, for  the cliff was  slightly undercut,  and  even Gollum could not find a hold of any  kind.  He  seemed to be trying to twist round, so  as to go legs  first, when  suddenly  with a shrill whistling shriek he fell. As he did so, he curled his legs and  arms up round him, like a spider whose descending thread is snapped.       Sam was out of his hiding in a flash and crossed the  space between him  and the cliff foot in  a couple of leaps. Before Gollum could get up, he was  on top of him.  But he  found Gollum more than he bargained for, even  taken  like that,  suddenly, off  his guard after  a  fall. Before Sam  could get a   hold, long legs  and arms  were  wound round  him  pinning  his  arms, and a   clinging grip, soft  but  horribly  strong, was  squeezing  him  like slowly   tightening  cords;  clammy fingers were feeling for  his throat.  Then sharp  teeth bit into his shoulder. All he could do was to butt his hard round head  sideways into  the creature's face. Gollum hissed and spat, but  he did  not  let go.       Things  would have gone  ill with  Sam, if he had been alone. But Frodo  sprang  up, and drew  Sting from its sheath. With his left hand he drew back   Gollum's head by his thin lank hair, stretching  his long neck, and  forcing  his pale venomous eyes to stare up at the sky.       `Let go! Gollum,' he said. `This is Sting. You have seen it before once   ####-upon a time. Let go, or you'll feel it this time! I'll cut your throat.'       Gollum collapsed and went as loose as wet string. Sam got up, fingering  his  shoulder.  His eyes  smouldered  with  anger, but  he could  not avenge  himself: his miserable enemy lay grovelling on the stones whimpering.       `Don't hurt  us! Don't let them hurt us,  precious! They won't hurt  us  will they, nice little hobbitses?  We didn't mean no harm, but they jumps on  us like cats on poor mices, they did, precious. And we're so lonely, gollum.  We'll be nice to them, very nice, if they'll be  nice to  us, won't we, yes,  yess.'       `Well, what's to be done with it? '  said  Sam.  `Tie  it up, so  as it  can't come sneaking after us no more, I say.'       `But  that would kill  us, kill  us,'  whimpered  Gollum. `Cruel little  hobbitses. Tie us up in the cold hard lands  and leave us,  gollum, gollum. '  Sobs welled up in his gobbling throat.       `No,'  said Frodo. `If we kill him, we  must kill him outright. But  we  can't do that, not as things are. Poor wretch! He has done us no harm.'       `Oh hasn't  he! ' said Sam rubbing his  shoulder.  `Anyway he meant to,  and he means to, I'll warrant. Throttle us in our sleep, that's his plan.'       'I daresay,' said Frodo. `But what he means  to  do is another matter.'  He paused for  a while in thought. Gollum lay still, but stopped whimpering.  Sam stood glowering over him.       It seemed  to Frodo  then  that he  heard,  quite  plainly but far off,   voices out of the past:       What a pity Bilbo did not stub the vile creature, when he had a chance!       Pity? It was Pity that stayed his hand. Pity, and  Mercy: not to strike  without need.       I do not feel any pity for Gollum. He deserves death.       Deserves  death! I daresay  he does. Many that live  deserve death. And  some die that deserve life. Can you give that to them? Then be not too eager  to  deal out death in the name of justice, fearing for your own safety. Even  the wise cannot see all ends.       `Very well,' he answered aloud, lowering  his  sword. 'But  still  I am  afraid. And yet, as you see,  I will not touch  the creature. For now that I  see him, I do pity him.'       Sam stared at his master, who seemed to be speaking to some one who was  not there. Gollum lifted his head.       'Yess,  wretched we are,  precious,' he whined. 'Misery misery! Hobbits   ####-won't kill us, nice hobbits.'       'No,  we won't,'  said Frodo. `But we won't  let you go, either. You're  full  of  wickedness and  mischief, Gollum. You will  have to come with  us,   that's all, while we keep an eye on you. But you must help us, if  you  can.  One good turn deserves another.'       'Yess, yes indeed,' said Gollum sitting up. 'Nice hobbits! We will come  with them. Find them safe paths in the dark, yes we will. And where are they  going in these cold hard  lands, we  wonders, yes we wonders? ' He looked up  at them, and a faint  light of cunning  and eagerness flickered for a second  in his pale blinking eyes.       Sam scowled at him,  and sucked his  teeth; but he seemed to sense that  there was  something  odd  about his master's  mood and that the  matter was  beyond argument. All the same he was amazed at Frodo's reply.       Frodo  looked straight into Gollum's eyes  which  flinched  and twisted  away."
}