{
  "id": "866b09f50a2bd83df19fd323207a0687487cd3d0",
  "text": " Edmure had given commands, and a headsman’s block had been set up before the heart tree. Rain and leaves fell all around them as the Greatjon’s men led Lord Rickard Karstark through the press, hands still bound. His men already hung from Riverrun’s high walls, slumping at the end of long ropes as the rain washed down their darkening faces.  Long Lew waited beside the block, but Robb took the poleaxe from his hand and ordered him to step aside.  This is my work,  he said.  He dies at my word. He must die by my hand.   Lord Rickard Karstark dipped his head stiffly.  For that much, I thank you. But for naught else.  He had dressed for death in a long black wool surcoat emblazoned with the white sunburst of his House.  The blood of the First Men flows in my veins as much as yours, boy. You would do well to remember that. I was named for your grandfather. I raised my banners against King Aerys for your father, and against King Joffrey for you. At Oxcross and the Whispering Wood and in the Battle of the Camps, I rode beside you, and I stood with Lord Eddard on the Trident. We are kin, Stark and Karstark.    This kinship did not stop you from betraying me,  Robb said.  And it will not save you now. Kneel, my lord.   Lord Rickard had spoken truly, Catelyn knew. The Karstarks traced their descent to Karlon Stark, a younger son of Winterfell who had put down a rebel lord a thousand years ago, and been granted lands for his valor. The castle he built had been named Karl’s Hold, but that soon became Karhold, and over the centuries the Karhold Starks had become Karstarks.   Old gods or new, it makes no matter,  Lord Rickard told her son,  no man is so accursed as the kinslayer.    Kneel, traitor,  Robb said again.  Or must I have them force your head onto the block?   Lord Karstark knelt.  The gods shall judge you, as you have judged me.  He laid his head upon the block.   Rickard Karstark, Lord of Karhold.  Robb lifted the heavy axe with both hands.  Here in sight of gods and men, I judge you guilty of murder and high treason. In mine own name I condemn you. With mine own hand I take your life. Would you speak a final word?    Kill me, and be cursed. You are no king of mine.   The axe crashed down. Heavy and well-honed, it killed at a single blow, but it took three to sever the man’s head from his body, and by the time it was done both living and dead were drenched in blood. Robb flung the poleaxe down in disgust, and turned wordless to the heart tree. He stood shaking with his hands half-clenched and the rain running down his cheeks. Gods forgive him, Catelyn prayed in silence. He is only a boy, and he had no other choice.  That was the last she saw of her son that day. The rain continued all through the morning, lashing the surface of the rivers and turning the godswood grass into mud and puddles. The Blackfish assembled a hundred men and rode out after Karstarks, but no one expected he would bring back many.  I only pray I do not need to hang them,  he said as he departed. When he was gone, Catelyn retreated to her father’s solar, to sit once more beside Lord Hoster’s bed.   It will not be much longer,  Maester Vyman warned her, when he came that afternoon.  His last strength is going, though still he tries to fight.    He was ever a fighter,  she said.  A sweet stubborn man.    Yes,  the maester said,  but this battle he cannot win. It is time he lay down his sword and shield. Time to yield.   To yield, she thought, to make a peace. Was it her father the maester was speaking of, or her son?  At evenfall, Jeyne Westerling came to see her. The young queen entered the solar timidly.  Lady Catelyn, I do not mean to disturb you…    You are most welcome here, Your Grace.  Catelyn had been sewing, but she put the needle aside now.   Please. Call me Jeyne. I don’t feel like a Grace.    You are one, nonetheless. Please, come sit, Your Grace.    Jeyne.  She sat by the hearth and smoothed her skirt out anxiously.   As you wish. How might I serve you, Jeyne?    It’s Robb,  the girl said.  He’s so miserable, so… so angry and disconsolate. I don’t know what to do.    It is a hard thing to take a man’s life.    I know. I told him, he should use a headsman. When Lord Tywin sends a man to die, all he does is give the command. It’s easier that way, don’t you think?    Yes,  said Catelyn,  but my lord husband taught his sons that killing should never be easy.    Oh.  Queen Jeyne wet her lips.  Robb has not eaten all day. I had Rollam bring him a nice supper, boar’s ribs and stewed onions and ale, but he never touched a bite of it. He spent all morning writing a letter and told me not to disturb him, but when the letter was done he burned it. Now he is sitting and looking at maps. I asked him what he was looking for, but he never answered. I don’t think he ever heard me. He wouldn’t even change out of his clothes. They were damp all day, and bloody. I want to be a good wife to him, I do, but I don’t know how to help. To cheer him, or comfort him."
}