{
  "id": "87b29baf7e97611416021074fd0a3c1938222436",
  "text": " Evening will follow day.       Tom's going home again water-lilies bringing.       Hey! Come derry dol! Can you hear me singing?        Frodo  and Sam stood as if enchanted. The wind puffed  out. The  leaves  hung silently again on stiff branches. There was  another burst of song, and  then suddenly, hopping and dancing along the path, there  appeared above the  reeds an old battered hat with a tall crown and a long blue feather stuck in  the band. With another hop and a bound there came into  view a man, or so it  seemed.  At any rate he wa s  too large and heavy for a hobbit, if not  quite  tall enough for one of the Big People, though he made noise enough for  one,  slumping along with  great yellow  boots on  his  thick legs,  and  charging  through grass and rushes like a cow going down to  drink. He had a blue coat  and a long brown beard; his eyes  were blue and bright, and his face was red  as  a ripe apple, but creased into a hundred  wrinkles of laughter.  In  his  hands  he carried  on a  large  leaf  as  on a tray  a  small pile  of white  water -lilies.        'Help!' cried  Frodo  and  Sam  running  towards  him with their  hands  stretched out.       'Whoa! Whoa! steady there!' cried the old man, holding up one hand, and  they  stopped  short, as  if  they  had been  struck stiff. 'Now,  my little  fellows, where be you a -going to, puffing like a  bellows? What's the matter   here  then?  Do  you  know who I am? I'm  Tom Bombadil.  Tell me what's  your   ####-trouble! Tom's in a hurry now. Don't you crush my lilies!'       'My friends are caught in the willow-tree,' cried Frodo breathlessly.       'Master Merry's being squeezed in a crack!' cried Sam.       'What?' shouted Tom Bombadil,  leaping up  in the air. 'Old Man Willow?  Naught  worse than that, eh? That  can soon  be mended. I know the  tune for  him.  Old  grey Willow-man! I'll freeze his  marrow cold, if he don't behave  himself. I'll  sing his roots off. I'll sing a  wind up  and blow  leaf  and  branch  away.  Old Man  Willow!' Setting down his  lilies carefully  on  the  grass, he  ran to  the tree. There he saw Merry's feet  still sticking out  -  the rest had already  been  drawn further inside. Tom  put his mouth to  the  crack  and  began singing  into it in a  low voice. They could not catch the  words, but  evidently Merry was aroused. His legs began to kick.  Tom sprang  away,  and breaking off a hanging branch smote  the side of the  willow with   it. 'You  let  them  out  again, Old  Man Willow!'  he  said. 'What  be  you   a-thinking  of? You  should not be waking. Eat earth! Dig deep! Drink water!  Go to sleep! Bombadil is talking!' He then seized  Merry's feet and drew him  out of the suddenly widening crack.       There was a tearing creak and the other crack split open, and out of it  Pippin sprang, as if he had been kicked. Then  with  a loud snap both cracks  closed fast again.  A shudder ran  through  the tree  from root to  tip, and  complete silence fell.       'Thank you!' said the hobbits, one after the other.       Tom Bombadil burst out  laughing.  'Well,  my little fellows!' said he,  stooping  so that he peered into their  faces. 'You shall come home with me!   The  table is  all laden with  yellow cream, honeycomb, and white bread  and  butter. Goldberry is  waiting. Time  enough  for questions around the supper   table. You follow after me as quick as you are able!' With that he picked up  his  lilies, and then with a beckoning  wave  of  his hand  went hopping and  dancing along the path eastward, still singing loudly and nonsensically.       Too surprised and too relieved to talk, the hobbits followed  a fter him  as fast as they could. But that was not fast enough. Tom soon disappeared in  front  of them,  and the noise of his singing got fainter  and further away.  Suddenly his voice came floating back to them in a loud halloo!        Hop along, my little friends, up the Withywindle!       Tom's going on ahead candles for to kindle.       Down west sinks the Sun: soon you will be groping.       When the night-shadows fall, then the door will open,   ####-     Out of the window-panes light will twinkle yellow.        Fear no alder black! Heed no hoary willow!       Fear neither root nor bough! Tom goes on before you.       Hey now! merry dot! We'll be waiting for you!       After that the hobbits heard  no more. Almost at once the sun seemed to  sink  into  the  trees  behind them. They thought of the slanting  light  of  evening glittering on the  Brandywine River, and  the windows  of Bucklebury  beginning  to gleam with hundreds of lights. Great shadows fell across them;  trunks and branches of trees hung  dark and threatening over the path. White   mists began to rise and curl on the surface of the river and stray about the  roots  of the trees upon its borders. Out of the very ground at their feet a   shadowy steam arose and mingled with the swiftly falling dusk.       It became difficult to follow the path, and they were very tired."
}