{
  "id": "88e00553677fbc3901fd4bd547df97e18ca1a9f2",
  "text": " Raiders and murderers, the lot of them.   Jon heard a rustling from the red leaves above. Two branches parted, and he glimpsed a little man moving from limb to limb as easily as a squirrel. Bedwyck stood no more than five feet tall, but the grey streaks in his hair showed his age. The other rangers called him Giant. He sat in a fork of the tree over their heads and said,  There’s water to the north. A lake, might be. A few flint hills rising to the west, not very high. Nothing else to see, my lords.    We might camp here tonight,  Smallwood suggested.  The Old Bear glanced up, searching for a glimpse of sky through the pale limbs and red leaves of the weirwood.  No,  he declared.  Giant, how much daylight remains to us?    Three hours, my lord.    We’ll press on north,  Mormont decided.  If we reach this lake, we can make camp by the shore, perchance catch a few fish. Jon, fetch me paper, it’s past time I wrote Maester Aemon.   Jon found parchment, quill, and ink in his saddlebag and brought them to the Lord Commander. At Whitetree, Mormont scrawled. The fourth village. All empty. The wildlings are gone.  Find Tarly and see that he gets this on its way,  he said as he handed Jon the message. When he whistled, his raven came flapping down to land on his horse’s head.  Corn,  the raven suggested, bobbing. The horse whickered.  Jon mounted his garron, wheeled him about, and trotted off. Beyond the shade of the great weirwood the men of the Night’s Watch stood beneath lesser trees, tending their horses, chewing strips of salt beef, pissing, scratching, and talking. When the command was given to move out again, the talk died, and they climbed back into their saddles. Jarman Buckwell’s scouts rode out first, with the vanguard under Thoren Smallwood heading the column proper. Then came the Old Bear with the main force, Ser Mallador Locke with the baggage train and packhorses, and finally Ser Ottyn Wythers and the rear guard. Two hundred men all told, with half again as many mounts.  By day they followed game trails and streambeds, the  ranger’s roads  that led them ever deeper into the wilderness of leaf and root. At night they camped beneath a starry sky and gazed up at the comet. The black brothers had left Castle Black in good spirits, joking and trading tales, but of late the brooding silence of the wood seemed to have sombered them all. Jests had grown fewer and tempers shorter. No one would admit to being afraid—they were men of the Night’s Watch, after all—but Jon could feel the unease. Four empty villages, no wildlings anywhere, even the game seemingly fled. The haunted forest had never seemed more haunted, even veteran rangers agreed.  As he rode, Jon peeled off his glove to air his burned fingers. Ugly things. He remembered suddenly how he used to muss Arya’s hair. His little stick of a sister. He wondered how she was faring. It made him a little sad to think that he might never muss her hair again. He began to flex his hand, opening and closing the fingers. If he let his sword hand stiffen and grow clumsy, it well might be the end of him, he knew. A man needed his sword beyond the Wall.  Jon found Samwell Tarly with the other stewards, watering his horses. He had three to tend: his own mount, and two packhorses, each bearing a large wire-and-wicker cage full of ravens. The birds flapped their wings at Jon’s approach and screamed at him through the bars. A few shrieks sounded suspiciously like words.  Have you been teaching them to talk?  he asked Sam.   A few words. Three of them can say snow.    One bird croaking my name was bad enough,  said Jon,  and snow’s nothing a black brother wants to hear about.  Snow often meant death in the north.   Was there anything in Whitetree?    Bones, ashes, and empty houses.  Jon handed Sam the roll of parchment.  The Old Bear wants word sent back to Aemon.   Sam took a bird from one of the cages, stroked its feathers, attached the message, and said,  Fly home now, brave one. Home.  The raven quorked something unintelligible back at him, and Sam tossed it into the air. Flapping, it beat its way skyward through the trees.  I wish he could carry me with him.    Still?    Well,  said Sam,  yes, but… I’m not as frightened as I was, truly. The first night, every time I heard someone getting up to make water, I thought it was wildlings creeping in to slit my throat. I was afraid that if I closed my eyes, I might never open them again, only… well… dawn came after all.  He managed a wan smile.  I may be craven, but I’m not stupid. I’m sore and my back aches from riding and from sleeping on the ground, but I’m hardly scared at all. Look.  He held out a hand for Jon to see how steady it was.  I’ve been working on my maps.   The world is strange, Jon thought. Two hundred brave men had left the Wall, and the only one who was not growing more fearful was Sam, the self-confessed coward.  We’ll make a ranger of you yet,  he joked.  Next thing, you’ll want to be an outrider like Grenn."
}