{
  "id": "88ee647d3bbaa57b207bfc548ab3e7ed69a0a55c",
  "text": "  He would  not eat any of  their food, but  he  drank  a little water and  then crawled about under the  bushes, sniffing and muttering. Then. suddenly he disappeared.       `Off hunting, I suppose,' said Sam and yawned. It was his turn to sleep  first, and  he  was soon deep in a dream. He thought he was back in the  Bag  End garden looking for something; but he had a heavy pack on his back, which  made him stoop.  It  all seemed very weedy and rank  somehow, and thorns and   ####-bracken were invading the beds down near the bottom hedge.       `A job of work for me, I can see; but I'm so tired,' he kept on saying.  Presently  he remembered what he was looking  for. `My  pipe!'  he said, and  with that he woke up.       `Silly!' he said  to himself, as he opened his eyes and wondered why he  was lying  down under the hedge. `It's in  your pack all the time!'  Then he  realized, first that the pipe might  be in his pack but he had  no leaf, and  next that he was hundreds of miles from  Bag End. He sat up. It seemed to be  almost dark. Why had his master let him sleep  on out of turn, right on till  evening?        `Haven't you had no sleep, Mr. Frodo?' he said. 'What's the time? Seems  to be getting late!'       'No it isn't,' said Frodo.  `But  the day is getting darker instead  of  lighter: darker and  darker. As far as I  can tell, it isn't midday yet, and  you've only slept for about three hours.'       'I wonder what's up,' said  Sam. 'Is there  a storm coming? If  so it's  going  to  be the  worst there ever was. We shall  wish  we were down a deep  hole, not just stuck  under a hedge.' He listened. `What's that? Thunder, or   drums, or what is it? '       'I don't know,' said  Frodo. `It's been going on for a good while  now.   Sometimes the ground seems  to  tremble, sometimes it seems to be  the heavy  air throbbing in your ears.'       Sam looked  round.  `Where's Gollum?  ' he said. 'Hasn't he  come  back   yet?'       `No,' said Frodo. `There's not been a sign or sound of him.'       `Well,  I  can't abide  him,'  said  Sam.  `In fact,  I've  never taken  anything on a journey that I'd have been less sorry to lose  on the way. But  it  would be just like him, after coming all these miles, to go and get lost   now, just when we shall need him most  --  that is, if he's ever going  to be  any use, which I doubt.'       `You forget the Marshes,' said Frodo.  `I hope nothing has happened  to  him.'       `And I hope he's  up to  no  tricks. And anyway I  hope he doesn't fall  into other hands, as you might say. Because if he does, we  shall soon be in  for trouble.'       At that moment a rolling and rumbling noise was heard again, louder now  and deeper. The ground seemed to quiver under their feet. 'I think we are in   ####-for trouble anyhow,' said Frodo. `I'm  afraid our journey  is  drawing to an  end.'       'Maybe,' said Sam;  `but  where there's life there's hope, as my Gaffer   used to say;  and need of vittles, as he  mostways used to  add. You  have a   bite, Mr. Frodo, and then a bit of sleep.'       The  afternoon, as Sam supposed it must be called, wore on. Looking out  from the  covert he  could see only a dun, shadowless  world,  fading slowly  into a featureless,  colourless gloom.  It felt stifling but not warm. Frodo  slept  unquietly,  turning and  tossing,  and sometimes murmuring. Twice Sam  thought  he heard him speaking  Gandalf's  name.  The  time  seemed  to drag  interminably. Suddenly Sam heard a hiss behind him, and  there was Gollum  on  all fours, peering at them with gleaming eyes.        `Wake up, wake up! Wake up, sleepies!' he whispered. `Wake up!  No time  to lose. We must go, yes, we must go at once. No time to lose!'       Sam stared  at him suspiciously: he  seemed frightened or excited.  `Go  now? What's your little game?  It isn't time yet. It can't be tea -time even,  leastways not in decent places where there is tea -time.'       `Silly!  ' hissed Gollum. `We're not in  decent places.  Time's running  short, yes, running fast. No time to lose. We must go. Wake up. Master, wake  u He clawed at Frodo; and  Frodo, startled out of sleep, sat up suddenly and  seized him by the arm. Gollum tore h imself loose and backed away.       'They mustn't  be silly,' he hissed. `We must go. No time to lose!' And  nothing more could  they  get  out of him. Where he  had been, and  what  he  thought was brewing to make  him in  such a hurry, he would not say. Sam was  filled with deep suspicion,  and showed it; but  Frodo gave no sign  of what  was passing in his mind. He sighed, hoisted his pack, and prepared to go out  into the ever -gathering darkness.        Very stealthily  Gollum led them down the hillside, keeping under cover   wherever it was possible, and running, almost bent to the ground, across any  open space; but the light was now so dim that even  a keen-eyed beast of the  wild could scarcely have seen the hobbits, hooded, in their grey cloaks, nor   heard them,  walking as warily as the little people can."
}