{
  "id": "893f4af710a984e642b5df80a7ccf62fbb15bb14",
  "text": "  The  cheering  stopped  and  the  joy was  turned  to  dread.  So  it was  that  the  dragon  did  not  find  them  quite  unprepared.  Before  long,  so  great was  his  speed,   ####-they  could  see  him  as  a  spark  of  fire  rushing  towards  them  and  growing  ever  huger  and more  bright,  and  not  the most  foolish  doubted  that  the  prophecies  had  gone  rather wrong. Still  they had a  little  time. Every vessel  in  the town was filled  with  water,  every  warrior  was  armed,  every  arrow  and  dart  was  ready,  and  the  bridge  to  the  land  was  thrown  down  and  destroyed,  before  the  roar  of  Smaug's  terrible  approach  grew  loud,  and  the  lake  rippled  red  as  fire  beneath  the  awful  beating of his wings.  Amid  shrieks  and  wailing  and  the  shouts  of  men  he  came  over  them,  swept  towards the bridges and was foiled! The bridge was gone, and his enemies were on  an  island  in  deep  water-too  deep  and  dark  and  cool  for  his  liking.  If  he  plunged  into  it, a vapour and a steam would arise enough  to cover all  the  land with a mist  for days; but  the  lake was mightier  than he,  it would quench him before he could  pass through.  Roaring  he  swept  back  over  the  town.  A  hail  of  dark  arrows  leaped  up  and  snapped and  rattled on his  scales and  jewels, and  their  shafts  fell back kindled by  his  breath  burning  and  hissing  into  the  lake.  No  fireworks  you  ever  imagined  equalled the sights that night. At the twanging of the bows and the shrilling of the  trumpets  the  dragon's wrath blazed to its height, till he was blind and mad with it.  No  one  had  dared  to  give  battle  to  him  for  many  an  age;  nor  would  they  have  dared  now,  if  it  had  not  been  for  the  grim-voiced man  (Bard was his name), who  ran to and fro cheering on the archers and urging the Master to order them to fight  to the last arrow.   Fire leaped from the dragon's jaws. He circled for a while high in the air above  them lighting all the lake; the trees by the shores shone like copper and like blood  with  leaping shadows of dense black at their feet. Then down he swooped straight  through  the  arrow-storm,  reckless  in  his  rage,  taking  no  heed  to  turn  his  scaly  sides towards his foes, seeking only to set their town ablaze.  Fire  leaped  from  thatched  roofs  and  wooden  beam-ends  as  he  hurtled  down  and  past  and  round  again,  though  all  had  been  drenched  with  water  before  he  came. Once more water was flung by a hundred hands wherever a spark appeared.  Back  swirled  the  dragon.  A  sweep  of  his  tail  and  the  roof  of  the  Great  House  crumbled  and  smashed  down.  Flames  unquenchable  sprang  high  into  the  night.  Another  swoop and another, and another house and  then another  sprang afire and  fell;  and  still  no  arrow  hindered  Smaug  or  hurt  him  more  than  a  fly  from  the  marshes.  Already  men  were  jumping  into  the  water  on  every  side.  Women  and  children  were  being  huddled  into  laden  boats  in  the  market-pool. Weapons were  flung down. There was mourning and weeping, where but a little time ago the old   ####-songs  of mirth  to  come  had  been  sung  about  the  dwarves. Now men cursed  their  names.  The  Master  himself  was  turning  to  his  great  gilded  boat,  hoping  to  row  away  in  the confusion and save himself. Soon all  the  town would be deserted and  burned down to the surface of the lake. That was the dragon's hope. They could all  get  into  boats  for  all  he  cared.  There  he  could  have  fine  sport  hunting  them,  or  they could stop till they starved. Let them try to get to land and he would be ready.  Soon  he  would  set  all  the  shoreland  woods  ablaze  and  wither  every  field  and  pasture.  Just  now  he  was  enjoying  the  sport  of  town-baiting  more  than  he  had  enjoyed anything for years. But there was still a company of archers that held their  ground among the burning houses. Their captain was Bard, grim-voiced and grim- faced,  whose  friends  had  accused  him  of  prophesying  floods  and  poisoned  fish,  though  they  knew  his  worth  and  courage.  He  was  a  descendant  in  long  line  of  Girion, Lord of Dale, whose wife and child had escaped down  the Running River  from  the  ruin  long  ago. Now  he  shot with  a  great yew bow,  till all his arrows but  one were spent. The flames were near him. His companions were leaving him. He  bent his bow for  the  last  time. Suddenly out of  the dark something fluttered  to his  shoulder.  He  started-but  it was  only  an  old  thrush. Unafraid  it perched by his ear  and it brought him news. Marvelling he found he could understand its tongue, for  he was of the race of Dale.  \"Wait! Wait!\"  it  said  to  him.  \"The moon  is  rising.  Look  for  the  hollow  of  the  left  breast  as  he  flies  and  turns  above  you!\" And while Bard paused  in wonder  it  told  him  of  tidings  up  in  the  Mountain  and  of  all  that  it  had  heard."
}