{
  "id": "8d4a69a2b70e36e3ed519a4099c4fdeeaea6e75e",
  "text": "  Arya thought that was stupid. Harren and his sons had died in Kingspyre Tower, that was why it had that name, so why should they cross the yard to haunt her? The Wailing Tower only wailed when the wind blew from the north, and that was just the sound the air made blowing through the cracks in the stones where they had fissured from the heat. if there were ghosts in Harrenhal, they never troubled her. It was the living men she feared, Weese and Ser Gregor Clegane and Lord Tywin Lannister himself, who kept his apartments in Kingspyre Tower, still the tallest and mightiest of all, though lopsided beneath the weight of the slagged stone that made it look like some giant half-melted black candle.  She wondered what Lord Tywin would do if she marched up to him and confessed to being Arya Stark, but she knew she’d never get near enough to talk to him, and anyhow he’d never believe her if she did, and afterward Weese would beat her bloody.  In his own small strutting way, Weese was nearly as scary as Ser Gregor. The Mountain swatted men like flies, but most of the time he did not even seem to know the fly was there. Weese always knew you were there, and what you were doing, and sometimes what you were thinking. He would hit at the slightest provocation, and he had a dog who was near as bad as he was, an ugly spotted bitch that smelled worse than any dog Arya had ever known. Once she saw him set the dog on a latrine boy who’d annoyed him. She tore a big chunk out of the boy’s calf while Weese laughed.  It took him only three days to earn the place of honor in her nightly prayers.  Weese,  she would whisper, first of all.  Dunsen, Chiswyck, Polliver, Raff the Sweetling. The Tickler and the Hound. Ser Gregor, Ser Amory, Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei.  If she let herself forget even one of them, how would she ever find him again to kill him?  On the road Arya had felt like a sheep, but Harrenbal turned her into a mouse. She was grey as a mouse in her scratchy wool shift, and like a mouse she kept to the crannies and crevices and dark holes of the castle, scurrying out of the way of the mighty.  Sometimes she thought they were all mice within those thick walls, even the knights and the great lords. The size of the castle made even Gregor Clegane seem small. Harrenhal covered thrice as much ground as Winterfell, and its buildings were so much larger they could scarcely be compared. Its stables housed a thousand horses, its godswood covered twenty acres, its kitchens were as large as Winterfell’s Great Hall, and its own great hall, grandly named the Hall of a Hundred Hearths even though it only had thirty and some (Arya had tried to count them, twice, but she came up with thirty-three once and thirty-five the other time) was so cavernous that Lord Tywin could have feasted his entire host, though he never did. Walls, doors, halls, steps, everything was built to an inhuman scale that made Arya remember the stories Old Nan used to tell of the giants who lived beyond the Wall.  And as lords and ladies never notice the little grey mice under their feet, Arya heard all sorts of secrets just by keeping her ears open as she went about her duties. Pretty Pia from the buttery was a slut who was working her way through every knight in the castle. The wife of the gaoler was with child, but the real father was either Ser Alyn Stackspear or a singer called Whitesmile Wat. Lord Lefford made mock of ghosts at table, but always kept a candle burning by his bed. Ser Dunaver’s squire Jodge could not hold his water when he slept. The cooks despised Ser Harys Swyft and spit in all his food. once she even overheard Maester Tothmure’s serving girl confiding to her brother about some message that said Joffrey was a bastard and not the rightful king at all.  Lord Tywin told him to burn the letter and never speak such filth again,  the girl whispered.  King Robert’s brothers Stannis and Renly had joined the fighting, she heard.  And both of them kings now,  Weese said.  Realm’s got more kings than a castle’s got rats.  Even Lannister men questioned how long Joffrey would hold the Iron Throne.  The lad’s got no army but them gold cloaks, and he’s ruled by a eunuch, a dwarf, and a woman,  she heard a lordling mutter in his cups.  What good will the likes of them be if it comes to battle?  There was always talk of Beric Dondarrion. A fat archer once said the Bloody Mummers had slain him, but the others only laughed.  Lorch killed the man at Rushing Falls, and the Mountain’s slain him twice. Got me a silver stag says he don’t stay dead this time neither.   Arya did not know who Bloody Mummers were until a fortnight later, when the queerest company of men she’d ever seen arrived at Harrenhal. Beneath the standard of a black goat with bloody horns rode copper men with bells in their braids; lancers astride striped black-and-white horses; bowmen with powdered cheeks; squat hairy men with shaggy shields; brown-skinned men in feathered cloaks; a wispy fool in green-and-pink motley; swordsmen with fantastic forked beards dyed green and purple and silver; spearmen with colored scars that covered their cheeks; a slender man in septon’s robes, a fatherly one in maester’s grey, and a sickly one whose leather cloak was fringed with long blond hair."
}