{
  "id": "93654db7f901bde50a5167598bc73e30ebae41d9",
  "text": " The power of Casterly Rock was far away, and there were no friends of the Lannisters in the Vale of Arryn. Submission and silence would have been his best defenses.  But Tyrion’s mood had been too foul for sense. To his shame, he had faltered during the last leg of their day-long climb up to the Eyrie, his stunted legs unable to take him any higher. Bronn had carried him the rest of the way, and the humiliation poured oil on the flames of his anger.  It would seem I’ve been a busy little fellow,  he said with bitter sarcasm.  I wonder when I found the time to do all this slaying and murdering.   He ought to have remembered who he was dealing with. Lysa Arryn and her half-sane weakling son had not been known at court for their love of wit, especially when it was directed at them.   Imp,  Lysa said coldly,  you will guard that mocking tongue of yours and speak to my son politely, or I promise you will have cause to regret it. Remember where you are. This is the Eyrie, and these are knights of the Vale you see around you, true men who loved Jon Arryn well. Every one of them would die for me.    Lady Arryn, should any harm come to me, my brother Jaime will be pleased to see that they do.  Even as he spat out the words, Tyrion knew they were folly.   Can you fly, my lord of Lannister?  Lady Lysa asked.  Does a dwarf have wings? If not, you would be wiser to swallow the next threat that comes to mind.    I made no threats,  Tyrion said.  That was a promise.   Little Lord Robert hopped to his feet at that, so upset he dropped his doll.  You can’t hurt us,  he screamed.  No one can hurt us here. Tell him, Mother, tell him he can’t hurt us here.  The boy began to twitch.   The Eyrie is impregnable,  Lysa Arryn declared calmly. She drew her son close, holding him safe in the circle of her plump white arms.  The Imp is trying to frighten us, sweet baby. The Lannisters are all liars. No one will hurt my sweet boy.   The hell of it was, she was no doubt right. Having seen what it took to get here, Tyrion could well imagine how it would be for a knight trying to fight his way up in armor, while stones and arrows poured down from above and enemies contested with him for every step. Nightmare did not begin to describe it. Small wonder the Eyrie had never been taken.  Still, Tyrion had been unable to silence himself.  Not impregnable,  he said,  merely inconvenient.   Young Robert pointed down, his hand trembling.  You’re a liar. Mother, I want to see him fly.  Two guardsmen in sky-blue cloaks seized Tyrion by the arms, lifting him off his floor.  The gods only know what might have happened then were it not for Catelyn Stark.  Sister,  she called out from where she stood below the thrones,  I beg you to remember, this man is my prisoner. I will not have him harmed.   Lysa Arryn glanced at her sister coolly for a moment, then rose and swept down on Tyrion, her long skirts trailing after her. For an instant he feared she would strike him, but instead she commanded them to release him. Her men shoved him to the floor, his legs went out from under him, and Tyrion fell.  He must have made quite a sight as he struggled to his knees, only to feel his right leg spasm, sending him sprawling once more. Laughter boomed up and down the High Hall of the Arryns.   My sister’s little guest is too weary to stand,  Lady Lysa announced.  Ser Vardis, take him down to the dungeon. A rest in one of our sky cells will do him much good.   The guardsmen jerked him upright. Tyrion Lannister dangled between them, kicking feebly, his face red with shame.  I will remember this,  he told them all as they carried him off.  And so he did, for all the good it did him.  At first he had consoled himself that this imprisonment could not last long. Lysa Arryn wanted to humble him, that was all. She would send for him again, and soon. If not her, then Catelyn Stark would want to question him. This time he would guard his tongue more closely. They dare not kill him out of hand; he was still a Lannister of Casterly Rock, and if they shed his blood, it would mean war. Or so he had told himself.  Now he was not so certain.  Perhaps his captors only meant to let him rot here, but he feared he did not have the strength to rot for long. He was growing weaker every day, and it was only a matter of time until Mord’s kicks and blows did him serious harm, provided the gaoler did not starve him to death first. A few more nights of cold and hunger, and the blue would start calling to him too.  He wondered what was happening beyond the walls (such as they were) of his cell. Lord Tywin would surely have sent out riders when the word reached him. Jaime might be leading a host through the Mountains of the Moon even now… unless he was riding north against Winterfell instead. Did anyone outside the Vale even suspect where Catelyn Stark had taken him? He wondered what Cersei would do when she heard. The king could order him freed, but would Robert listen to his queen or his Hand? Tyrion had no illusions about the king’s love for his sister."
}