{
  "id": "94e540fbdfe6b483e558f2a5ddb80e0bb910a896",
  "text": " The Watch had once manned seventeen castles along the hundred leagues of the Wall, but they had been abandoned one by one as the brotherhood dwindled. Only three were now garrisoned, a fact that Mance Rayder knew as well as they did.  Ser Alliser Thorne will bring back fresh levies from King’s Landing, we can hope. If we man Greyguard from the Shadow Tower and the Long Barrow from Eastwatch…    Greyguard has largely collapsed. Stonedoor would serve better, if the men could be found. Icemark and Deep Lake as well, mayhaps. With daily patrols along the battlements between.    Patrols, aye. Twice a day, if we can. The Wall itself is a formidable obstacle. Undefended, it cannot stop them, yet it will delay them. The larger the host, the longer they’ll require. From the emptiness they’ve left behind, they must mean to bring their women with them. Their young as well, and beasts… have you ever seen a goat climb a ladder? A rope? They will need to build a stair, or a great ramp… it will take a moon’s turn at the least, perhaps longer. Mance will know his best chance is to pass beneath the Wall. Through a gate, or…    A breach.   Mormont’s head came up sharply.  What?    They do not plan to climb the Wall nor to burrow beneath it, my lord. They plan to break it.    The Wall is seven hundred feet high, and so thick at the base that it would take a hundred men a year to cut through it with picks and axes.    Even so.   Mormont plucked at his beard, frowning.  How?    How else? Sorcery.  Qhorin bit the egg in half.  Why else would Mance choose to gather his strength in the Frostfangs? Bleak and hard they are, and a long weary march from the Wall.    I’d hoped he chose the mountains to hide his muster from the eyes of my rangers.    Perhaps,  said Qhorin, finishing the egg,  but there is more, I think. He is seeking something in the high cold places. He is searching for something he needs.    Something?  Mormont’s raven lifted its head and screamed. The sound was sharp as a knife in the closeness of the tent.   Some power. What it is, our captive could not say. He was questioned perhaps too sharply, and died with much unsaid. I doubt he knew in any case.   Jon could hear the wind outside. It made a high thin sound as it shivered through the stones of the ringwall and tugged at the tent ropes. Mormont rubbed his mouth thoughtfully.  Some power,  he repeated.  I must know.    Then you must send scouts into the mountains.    I am loath to risk more men.    We can only die. Why else do we don these black cloaks, but to die in defense of the realm? I would send fifteen men, in three parties of five. One to probe the Milkwater, one the Skirling Pass, one to climb the Giant’s Stair. Jarman Buckwell, Thoren Smallwood, and myself to command. To learn what waits in those mountains.    Waits,  the raven cried.  Waits.   Lord Commander Mormont sighed deep in his chest.  I see no other choice,  he conceded,  but if you do not return…    Someone will come down out of the Frostfangs, my lord,  the ranger said.  If us, all well and good. If not, it will be Mance Rayder, and you sit square in his path. He cannot march south and leave you behind, to follow and harry his rear. He must attack. This is a strong place.    Not that strong,  said Mormont.   Belike we shall all die, then. Our dying will buy time for our brothers on the Wall. Time to garrison the empty castles and freeze shut the gates, time to summon lords and kings to their aid, time to hone their axes and repair their catapults. Our lives will be coin well spent.    Die,  the raven muttered, pacing along Mormont’s shoulders.  Die, die, die, die.  The old Bear sat slumped and silent, as if the burden of speech had grown too heavy for him to bear. But at last he said,  May the gods forgive me. Choose your men.   Qhorin Halfhand turned his head. His eyes met Jon’s, and held them for a long moment.  Very well. I choose Jon Snow.   Mormont blinked.  He is hardly more than a boy. And my steward besides. Not even a ranger.    Tollett can care for you as well, my lord.  Qhorin lifted his maimed, two-fingered hand.  The old gods are still strong beyond the Wall. The gods of the First Men… and the Starks.   Mormont looked at Jon.  What is your will in this?    To go,  he said at once.  The old man smiled sadly.  I thought it might be.   Dawn had broken when Jon stepped from the tent beside Qhorin Halfhand. The wind swirled around them, stirring their black cloaks and sending a scatter of red cinders flying from the fire.   We ride at noon,  the ranger told him.  Best find that wolf of yours.       TYRION   The queen intends to send Prince Tommen away.  They knelt alone in the hushed dimness of the sept, surrounded by shadows and flickering candles, but even so Lancel kept his voice low.  Lord Gyles will take him to Rosby, and conceal him there in the guise of a page. They plan to darken his hair and tell everyone that he is the son of a hedge knight.    Is it the mob she fears? Or me?    Both,  said Lancel."
}