{
  "id": "95a966ea1a9831703e6438db94831b4dd41c4914",
  "text": "  There’s much to be said for taking people unawares. You never know what you might learn.    You won’t learn anything from me,  Jon told him. He had seen little of the dwarf since their journey ended. As the queen’s own brother, Tyrion Lannister had been an honored guest of the Night’s Watch. The Lord Commander had given him rooms in the King’s Tower—so-called, though no king had visited it for a hundred years—and Lannister dined at Mormont’s own table and spent his days riding the Wall and his nights dicing and drinking with Ser Alliser and Bowen Marsh and the other high officers.   Oh, I learn things everywhere I go.  The little man gestured up at the Wall with a gnarled black walking stick.  As I was saying… why is it that when one man builds a wall, the next man immediately needs to know what’s on the other side?  He cocked his head and looked at Jon with his curious mismatched eyes.  You do want to know what’s on the other side, don’t you?    It’s nothing special,  Jon said. He wanted to ride with Benjen Stark on his rangings, deep into the mysteries of the haunted forest, wanted to fight Mance Rayder’s wildlings and ward the realm against the Others, but it was better not to speak of the things you wanted.  The rangers say it’s just woods and mountains and frozen lakes, with lots of snow and ice.    And the grumkins and the snarks,  Tyrion said.  Let us not forget them, Lord Snow, or else what’s that big thing for?    Don’t call me Lord Snow.   The dwarf lifted an eyebrow.  Would you rather be called the Imp? Let them see that their words can cut you, and you’ll never be free of the mockery. If they want to give you a name, take it, make it your own. Then they can’t hurt you with it anymore.  He gestured with his stick.  Come, walk with me. They’ll be serving some vile stew in the common hall by now, and I could do with a bowl of something hot.   Jon was hungry too, so he fell in beside Lannister and slowed his pace to match the dwarf’s awkward, waddling steps. The wind was rising, and they could hear the old wooden buildings creaking around them, and in the distance a heavy shutter banging, over and over, forgotten. Once there was a muffled thump as a blanket of snow slid from a roof and landed near them.   I don’t see your wolf,  Lannister said as they walked.   I chain him up in the old stables when we’re training. They board all the horses in the east stables now, so no one bothers him. The rest of the time he stays with me. My sleeping cell is in Hardin’s Tower.    That’s the one with the broken battlement, no? Shattered stone in the yard below, and a lean to it like our noble king Robert after a long night’s drinking? I thought all those buildings had been abandoned.   Jon shrugged.  No one cares where you sleep. Most of the old keeps are empty, you can pick any cell you want.  Once Castle Black had housed five thousand fighting men with all their horses and servants and weapons. Now it was home to a tenth that number, and parts of it were falling into ruin.  Tyrion Lannister’s laughter steamed in the cold air.  I’ll be sure to tell your father to arrest more stonemasons, before your tower collapses.   Jon could taste the mockery there, but there was no denying the truth. The Watch had built nineteen great strongholds along the Wall, but only three were still occupied: Eastwatch on its grey windswept shore, the Shadow Tower hard by the mountains where the Wall ended, and Castle Black between them, at the end of the kingsroad. The other keeps, long deserted, were lonely, haunted places, where cold winds whistled through black windows and the spirits of the dead manned the parapets.   It’s better that I’m by myself,  Jon said stubbornly.  The rest of them are scared of Ghost.    Wise boys,  Lannister said. Then he changed the subject.  The talk is, your uncle is too long away.   Jon remembered the wish he’d wished in his anger, the vision of Benjen Stark dead in the snow, and he looked away quickly. The dwarf had a way of sensing things, and Jon did not want him to see the guilt in his eyes.  He said he’d be back by my name day,  he admitted. His name day had come and gone, unremarked, a fortnight past.  They were looking for Ser Waymar Royce, his father is bannerman to Lord Arryn. Uncle Benjen said they might search as far as the Shadow Tower. That’s all the way up in the mountains.    I hear that a good many rangers have vanished of late,  Lannister said as they mounted the steps to the common hall. He grinned and pulled open the door.  Perhaps the grumkins are hungry this year.   Inside, the hall was immense and drafty, even with a fire roaring in its great hearth. Crows nested in the timbers of its lofty ceiling. Jon heard their cries overhead as he accepted a bowl of stew and a heel of black bread from the day’s cooks. Grenn and Toad and some of the others were seated at the bench nearest the warmth, laughing and cursing each other in rough voices. Jon eyed them thoughtfully for a moment. Then he chose a spot at the far end of the hall, well away from the other diners."
}