{
  "id": "985ff9dd13bac5dac61101ce6b45583deaaf5bb1",
  "text": "   Captiths. Rooth Bolton thought to croth the river, but my Brafe Companions cut his van to pieceth. Killed many, and thent Bolton running. Thith ith their lord commander, Glover, and the one behind ith Ther Aenyth Frey.   Ser Amory Lorch stared down at the roped captives with his little pig eyes. Arya did not think he was pleased. Everyone in the castle knew that he and Vargo Hoat hated each other.  Very well,  he said.  Ser Cadwyn, take these men to the dungeons.   The lord with the mailed fist on his surcoat raised his eyes.  We were promised honorable treatment—  he began.   Silenth!  Vargo Hoat screamed at him, spraying spittle.  Ser Amory addressed the captives.  What Hoat promised you is nothing to me. Lord Tywin made me the castellan of Harrenhal, and I shall do with you as I please.  He gestured to his guards.  The great cell under the Widow’s Tower ought to hold them all. Any who do not care to go are free to die here.   As his men herded off the captives at spearpoint, Arya saw Pinkeye emerge from the stairwell, blinking at the torchlight. If he found her missing, he would shout and threaten to whip the bloody hide off her, but she was not afraid. He was no Weese. He was forever threatening to whip the bloody hide off this one or that one, but Arya never actually knew him to hit. Still, it would be better if he never saw her. She glanced around. The oxen were being unharnessed, the carts unloaded, while the Brave Companions clamored for drink and the curious gathered around the caged bear. In the commotion, it was not hard to slip off unseen. She went back the way she had come, wanting to be out of sight before someone noticed her and thought to put her to work.  Away from the gates and the stables, the great castle was largely deserted. The noise dwindled behind her. A swirling wind gusted, drawing a high shivery scream from the cracks in the Wailing Tower. Leaves had begun to fall from the trees in the godswood, and she could hear them moving through the deserted courtyards and between the empty buildings, making a faint skittery sound as the wind drove them across the stones. Now that Harrenhal was near empty once again, sound did queer things here. Sometimes the stones seemed to drink up noise, shrouding the yards in a blanket of silence. Other times, the echoes had a life of their own, so every footfall became the tread of a ghostly army, and every distant voice a ghostly feast. The funny sounds were one of the things that bothered Hot Pie, but not Arya.  Quiet as a shadow, she flitted across the middle bailey, around the Tower of Dread, and through the empty mews, where people said the spirits of dead falcons stirred the air with ghostly wings. She could go where she would. The garrison numbered no more than a hundred men, so small a troop that they were lost in Harrenhal. The Hall of a Hundred Hearths was closed off, along with many of the lesser buildings, even the Wailing Tower. Ser Amory Lorch resided in the castellan’s chambers in Kingspyre, themselves as spacious as a lord’s, and Arya and the other servants had moved to the cellars beneath him so they would be close at hand. While Lord Tywin had been in residence, there was always a man-at-arms wanting to know your business. But now there were only a hundred men left to guard a thousand doors, and no one seemed to know who should be where, or care much.  As she passed the armory, Arya heard the ring of a hammer. A deep orange glow shone through the high windows. She climbed to the roof and peeked down. Gendry was beating out a breastplate. When he worked, nothing existed for him but metal, bellows, fire. The hammer was like part of his arm. She watched the play of muscles in his chest and listened to the steel music he made. He’s strong, she thought. As he took up the long-handled tongs to dip the breastplate into the quenching trough, Arya slithered through the window and leapt down to the floor beside him.  He did not seem surprised to see her.  You should be abed, girl.  The breastplate hissed like a cat as he dipped it in the cold water.  What was all that noise?    Vargo Hoat’s come back with prisoners. I saw their badges. There’s a Glover, from Deepwood Motte, he’s my father’s man. The rest too, mostly.  All of a sudden, Arya knew why her feet had brought her here.  You have to help me get them out.   Gendry laughed.  And how do we do that?    Ser Amory sent them down to the dungeon. The one under the Widow’s Tower, that’s just one big cell. You could smash the door open with your hammer—    While the guards watch and make bets on how many swings it will take me, maybe?   Arya chewed her lips.  We’d need to kill the guards.    How are we supposed to do that?    Maybe there won’t be a lot of them.    If there’s two, that’s too many for you and me. You never learned nothing in that village, did you? You try this and Vargo Hoat will cut off your hands and feet, the way he does.  Gendry took up the tongs again.   You’re afraid.    Leave me alone, girl."
}