{
  "id": "99886f73edb54c08c7d6b73c44d2e0fc81c00d93",
  "text": "  Harry strode over to the barn owl, took the letter off its leg, and unrolled it.  Harry -    I can't say everything I would like to in a letter, it's too risky in case the owl is intercepted - we need to talk face-to-face.  Can you ensure that you are alone by the fire in Gryffindor Tower at one o'clock in the morning on the 22nd ofNovember?  I know better than anyone that you can look after yourself and while you're around Dumbledore and Moody I don't think anyone will be able to hurt you.  However, someone seems to be having a good try. Entering you in that tournament would have been very risky, especially right under Dumbkdore's nose.  Be on the watch, Harry. I still want to hear about anything unusual. Let me know about the 22nd ofNovember as quickly as you can.  Sirius   CHAPTER NINETEEN - THE HUNGARIAN HORNTAIL    The prospect of talking face-to-face with Sirius was all that sustained Harry over the next fortnight, the only bright spot on a horizon that had never looked darker.  The shock of finding himself school champion had worn off slightly now, and the fear of what was facing him had started to sink in.  The first task was drawing steadily nearer; he felt as though it were crouching ahead of him hike some horrific monster, barring his path.  He had never suffered nerves like these; they were way beyond anything he had experienced before a Quidditch match, not even his last one against Slytherin, which had decided who would win the Quidditch Cup.  Harry was finding it hard to think about the future at all; he felt as though his whole life had been heading up to, and would finish with, the first task. Admittedly, he didn't see how Sirius was going to make him feel any better about having to perform an unknown piece of difficult and dangerous magic in front of hundreds of people, but the mere sight of a friendly face would be something at the moment.  Harry wrote back to Sirius saying that he would be beside the common room fire at the time Sirius had suggested; and he and Hermione spent a long time going over plans for forcing any stragglers out of the common room on the night in question.  If the worst came to the worst, they were going to drop a bag of Dungbombs, but they hoped they wouldn't have to resort to that - Filch would skin them alive. In the meantime, life became even worse for Harry within the confines of the castle, for Rita Skeeter had published her piece about the Triwizard Tournament, and it had turned out to be not so much a report on the tournament as a highly colored life story of Harry. Much of the front page had been given over to a picture of Harry; the article (continuing on pages two, six, and seven) had been all about Harry, the names of the Beauxbatons and Durmstrang champions (misspelled) had been squashed into the last line of the article, and Cedric hadn't been mentioned at all. The article had appeared ten days ago, and Harry still got a sick, burning feeling of shame in his stomach every time he thought about it.  Rita Skeeter had reported him saying an awful lot of things that he couldn't remember ever saying in his life, let alone in that broom cupboard.  I suppose I get my strength from my parents.  I know they'd be very proud of me if they could see me now. . . . Yes, sometimes at night I still cry about them, I'm not ashamed to admit it. . . . I know nothing will hurt me during the tournament, because they're watching over me. . .   But Rita Skeeter had gone even further than transforming his \"er's\" into long, sickly sentences:  She had interviewed other people about him too.  Harry has at last found love at Hogwarts. His close friend, Colin Creevey, says that Harry is rarely seen out of the company of one Hermione Granger, a stunningly pretty Muggle-born girl who, like Harry, is one of the top students in the school.  From the moment the article had appeared, Harry had had to endure people --Slytherins, mainly -- quoting it at him as he passed and making sneering comments. \"Want a hanky, Potter, in case you start crying in Transfiguration?\" \"Since when have you been one of the top students in the school, Potter?  Or is this a school you and Longbottom have set up together?\" \"Hey - Harry!\" \"Yeah, that's right!\"  Harry found himself shouting as he wheeled around in the corridor, having had just about enough.  \"I've just been crying my eyes out over my dead mum, and I'm just off to do a bit more. . . \"No - it was just - you dropped your quill.\" It was Cho.  Harry felt the color rising in his face. \"Oh - right - sorry,\" he muttered, taking the quill back. \"Er. . . good luck on Tuesday,\" she said.  \"I really hope you do well.\"  Which left Harry feeling extremely stupid. Hermione had come in for her fair share of unpleasantness too, but she hadn't yet started yelling at innocent bystanders; in fact, Harry was full of admiration for the way she was handling the situation. \"Stunningly pretty? Her?\"  Pansy Parkinson had shrieked the first time she had come face-to-face with Hermione after Rita's article had appeared."
}