{
  "id": "9a7014368b0db05b1656e7ae23168e944488c09a",
  "text": " \"It was not we who found him. It was little Peter Pettigrew -- another of the Potters' friends. Maddened by grief, no doubt, and knowing that Black had been the Potters' Secret-Keeper, he went after Black himself.\"  \"Pettigrew... that fat little boy who was always tagging around after them at Hogwarts?\" said Madam Rosmerta.  \"Hero-worshipped Black and Potter,\" said Professor McGonagall. \"Never quite in their league, talent-wise. I was often rather ,harp with him. You can imagine how I -how I regret that now...\" She sounded as though she had a sudden head cold.  \"There, now, Minerva,\" said Fudge kindly, \"Pettigrew died a hero's death. Eyewitnesses -- Muggles, of course, we wiped their, memories later -- told us how Pettigrew cornered Black. They say he was sobbing, 'Lily and James, Sirius! How could you?' And then he went for his wand. Well, of course, Black was quicker. Blew Pettigrew to smithereens....\"  Professor McGonagall blew her nose and said thickly, \"Stupid boy ... foolish boy... he was always hopeless at dueling... should have left it to the Ministry....\"  \"I tell yeh, if I'd got ter Black before little Pettigrew did, I wouldn't 've messed around with wands -- I'd 've ripped him limb -- from -- limb,\" Hagrid growled.  \"You don't know what you're talking about, Hagrid,\" said Fudge sharply. \"Nobody but trained Hit Wizards from the Magical Law Enforcement Squad would have stood a chance against Black once he was cornered. I was Junior Minister in the Department of Magical Catastrophes at the time, and I was one of the first on the scene after Black murdered all those people. I -- I will never forget it. I still dream about it sometimes. A crater in the middle of the street, so deep it had cracked the sewer below. Bodies everywhere. Muggles screaming. And Black standing there laughing, with what was left of Pettigrew in front of him... a heap of bloodstained robes and a few -- a few fragments --\"  Fudge's voice stopped abruptly. There was the sound of five noses being blown.  \"Well, there you have it, Rosmerta,\" said Fudge thickly. \"Black was taken away by twenty members of the Magical Law Enforcement 'Squad and Pettigrew received the Order of Merlin, First Class, which I think was some comfort to his poor mother. Blades been in Azkaban ever since.\"  Madam Rosmerta let out a long sigh.  \"Is it true he's mad, Minister?\"  \"I wish I could say that he was,\" said Fudge slowly. \"I certainly believe his master's defeat unhinged him for a while. The murder of Pettigrew and all those Muggles was the action of a cornered and desperate man -- cruel... pointless. Yet I met Black on my last inspection of Azkaban. You know, most of the prisoners in there sit muttering to themselves in the dark; there's no sense in them... but I was shocked at how normal Black seemed. He spoke quite rationally to me. It was unnerving. You'd have thought he was merely bored -- asked if I'd finished with my newspaper, cool as you please, said he missed doing the crossword. Yes, I was astounded at how little effect the dementors seemed to be having on him -- and he was one of the most heavily guarded in the place, you know. Dementors outside his door day and night.\"  \"But what do you think he's broken out to do?\" said Madam Rosmerta. \"Good gracious, Minister, he isn't trying to rejoin You-Know-Who, is he?\"  I daresay that is his -- er -- eventual plan,\" said Fudge evasively. \"But we hope to catch Black long before that. I must say, You-Know-Who alone and friendless is one thing... but give him back his most devoted servant, and I shudder to think how quickly he'll rise again....\"  There was a small chink of glass on wood. Someone had set down their glass.  \"You know, Cornelius, if you're dining with the headmaster, he'd better head back up to the castle,\" said Professor McGonagall.  One by one, the pairs of feet in front of Harry took the weight of their owners once more; hems of cloaks swung into sight, and Madam Rosemerta's glittering heels disappeared behind the bar. The door of the Three Broomsticks opened again, there was another flurry of snow, and the teachers had disappeared.  \"Harry?\"  Ron's and Hermione's faces appeared under the table. They were both staring at him, lost for words.  CHAPTER ELEVEN  THE FIREBOLT  Harry didn't have a very clear idea of how he had managed to get back into the Honeydukes cellar, through the tunnel, and into the castle once more. All he knew was that the return trip seemed to take no time at all, and that he hardly noticed what he was doing, because his head was still pounding with the conversation he had just heard.  Why had nobody ever told him? Dumbledore, Hagrid, Mr. Weasley, Cornelius Fudge... why hadn't anyone ever mentioned the fact that Harry's parents had died because their best friend had betrayed them?  Ron and Herinione watched Harry nervously all through dintier, not daring to talk about what they'd overheard, because Percy was sitting close by them. When they went upstairs to the crowded common room, it was to find Fred and George had set off half a dozen Dungbombs in a fit of end- of-term high spirits."
}