{
  "id": "9b04fd89e9b98d6dc5d1459ae1b324a3bfeb786c",
  "text": "  M’lord.    He’s the butcher’s boy,  Sansa said.   He’s my friend,  Arya said sharply.  You leave him alone.    A butcher’s boy who wants to be a knight, is it?  Joffrey swung down from his mount, sword in hand.  Pick up your sword, butcher’s boy,  he said, his eyes bright with amusement.  Let us see how good you are.   Mycah stood there, frozen with fear.  Joffrey walked toward him.  Go on, pick it up. Or do you only fight little girls?    She ast me to, m’lord,  Mycah said.  She ast me to.   Sansa had only to glance at Arya and see the flush on her sister’s face to know the boy was telling the truth, but Joffrey was in no mood to listen. The wine had made him wild.  Are you going to pick up your sword?   Mycah shook his head.  It’s only a stick, m’lord. It’s not no sword, it’s only a stick.    And you’re only a butcher’s boy, and no knight.  Joffrey lifted Lion’s Tooth and laid its point on Mycah’s cheek below the eye, as the butcher’s boy stood trembling.  That was my lady’s sister you were hitting, do you know that?  A bright bud of blood blossomed where his sword pressed into Mycah’s flesh, and a slow red line trickled down the boy’s cheek.   Stop it!  Arya screamed. She grabbed up her fallen stick.  Sansa was afraid.  Arya, you stay out of this.    I won’t hurt him… much,  Prince Joffrey told Arya, never taking his eyes off the butcher’s boy.  Arya went for him.  Sansa slid off her mare, but she was too slow. Arya swung with both hands. There was a loud crack as the wood split against the back of the prince’s head, and then everything happened at once before Sansa’s horrified eyes. Joffrey staggered and whirled around, roaring curses. Mycah ran for the trees as fast as his legs would take him. Arya swung at the prince again, but this time Joffrey caught the blow on Lion’s Tooth and sent her broken stick flying from her hands. The back of his head was all bloody and his eyes were on fire. Sansa was shrieking,  No, no, stop it, stop it, both of you, you’re spoiling it,  but no one was listening. Arya scooped up a rock and hurled it at Joffrey’s head. She hit his horse instead, and the blood bay reared and went galloping off after Mycah.  Stop it, don’t, stop it!  Sansa screamed. Joffrey slashed at Arya with his sword, screaming obscenities, terrible words, filthy words. Arya darted back, frightened now, but Joffrey followed, hounding her toward the woods, backing her up against a tree. Sansa didn’t know what to do. She watched helplessly, almost blind from her tears.  Then a grey blur flashed past her, and suddenly Nymeria was there, leaping, jaws closing around Joffrey’s sword arm. The steel fell from his fingers as the wolf knocked him off his feet, and they rolled in the grass, the wolf snarling and ripping at him, the prince shrieking in pain.  Get it off,  he screamed.  Get it off!   Arya’s voice cracked like a whip.  Nymeria!   The direwolf let go of Joffrey and moved to Arya’s side. The prince lay in the grass, whimpering, cradling his mangled arm. His shirt was soaked in blood. Arya said,  She didn’t hurt you… much.  She picked up Lion’s Tooth where it had fallen, and stood over him, holding the sword with both hands.  Jofftey made a scared whimpery sound as he looked up at her.  No,  he said,  don’t hurt me. I’ll tell my mother.    You leave him alone!  Sansa screamed at her sister.  Arya whirled and heaved the sword into the air, putting her whole body into the throw. The blue steel flashed in the sun as the sword spun out over the river. It hit the water and vanished with a splash. Joffrey moaned. Arya ran off to her horse, Nymeria loping at her heels.  After they had gone, Sansa went to Prince Joffrey. His eyes were closed in pain, his breath ragged. Sansa knelt beside him.  Joffrey,  she sobbed.  Oh, look what they did, look what they did. My poor prince. Don’t be afraid. I’ll ride to the holdfast and bring help for you.  Tenderly she reached out and brushed back his soft blond hair.  His eyes snapped open and looked at her, and there was nothing but loathing there, nothing but the vilest contempt.  Then go,  he spit at her.  And don’t touch me.       EDDARD   They’ve found her, my lord.   Ned rose quickly.  Our men or Lannister’s?    It was Jory,  his steward Vayon Poole replied.  She’s not been harmed.    Thank the gods,  Ned said. His men had been searching for Arya for four days now, but the queen’s men had been out hunting as well.  Where is she? Tell Jory to bring her here at once.    I am sorry, my lord,  Poole told him.  The guards on the gate were Lannister men, and they informed the queen when Jory brought her in. She’s being taken directly before the king…    Damn that woman!  Ned said, striding to the door.  Find Sansa and bring her to the audience chamber. Her voice may be needed.  He descended the tower steps in a red rage. He had led searches himself for the first three days, and had scarcely slept an hour since Arya had disappeared. This morning he had been so heartsick and weary he could scarcely stand, but now his fury was on him, filling him with strength."
}