{
  "id": "9c9e6f125f39dc03a9328496b3bfcaa03acf10dd",
  "text": " Oliver Wood's enthusiasm for regular training sessions, however, was not dampened, which was why Harry was to be found, late one stormy Saturday afternoon a few days before Halloween, returning to Gryffindor Tower, drenched to the skin and splattered with mud..   123 Even aside from the rain and wind it hadn't been a happy practice session. Fred and George, who had been spying on the Slytherin team, had seen for themselves the speed of those new Nimbus Two Thousand and Ones. They reported that the Slytherin team was no more than seven greenish blurs, shooting through the air like missiles. As Harry squelched along the deserted corridor he came across somebody who looked just as preoccupied as he was. Nearly Headless Nick, the ghost of Gryffindor Tower, was staring morosely out of a window, muttering under his breath, \". . . don't fulfill their requirements . . . half an inch, if that . . .\" \"Hello, Nick,\" said Harry. \"Hello, hello,\" said Nearly Headless Nick, starting and looking round. He wore a dashing, plumed hat on his long curly hair, and a tunic with a ruff, which concealed the fact that his neck was almost completely severed. He was pale as smoke, and Harry could see right through him to the dark sky and torrential rain outside. \"You look troubled, young Potter,\" said Nick, folding a transparent letter as he spoke and tucking it inside his doublet. \"So do you,\" said Harry. \"Ah,\" Nearly Headless Nick waved an elegant hand, \"a matter of no importance. . . . It's not as though I really wanted to join. . . . Thought I'd apply, but apparently I 'don't fulfill requirements' -\" In spite of his airy tone, there was a look of great bitterness on his face. \"But you would think, wouldn't you,\" he erupted suddenly, pulling the letter back out of his pocket, \"that getting hit forty-five times in the neck with a blunt axe would qualify you to join the Headless Hunt?\"   124 \"Oh - yes,\" said Harry, who was obviously supposed to agree. \"I mean, nobody wishes more than I do that it had all been quick and clean, and my head had come off properly, I mean, it would have saved me a great deal of pain and ridicule. However -\" Nearly Headless Nick shook his letter open and read furiously: \"'We can only accept huntsmen whose heads have parted company with their bodies. You will appreciate that it would be impossible otherwise for members to participate in hunt activities such as Horseback Head-Juggling and Head Polo. It is with the greatest regret, therefore, that I must inform you that you do not fulfill our requirements. With very best wishes, Sir Patrick Delaney-Podmore.'\" Fuming, Nearly Headless Nick stuffed the letter away. \"Half an inch of skin and sinew holding my neck on, Harry! Most people would think that's good and beheaded, but oh, no, it's not enough for Sir Properly Decapitated-Podmore.\" Nearly Headless Nick took several deep breaths and then said, in a far calmer tone, \"So - what's bothering you? Anything I can do?\" \"No,\" said Harry. \"Not unless you know where we can get seven free Nimbus Two Thousand and Ones for our match against Sly -\" The rest of Harry's sentence was drowned out by a high-pitched mewling from somewhere near his ankles. He looked down and found himself gazing into a pair of lamp-like yellow eyes. It was Mrs. Norris, the skeletal gray cat who was used by the caretaker, Argus Filch, as a sort of deputy in his endless battle against students. \"You'd better get out of here, Harry,\" said Nick quickly. \"Filch isn't in a good mood - he's got the flu and some third years accidentally plastered frog brains all over the ceiling in dungeon five. He's been cleaning all morning, and if he sees you dripping mud all over the place -\"  .125 \"Right,\" said Harry, backing away from the accusing stare of Mrs. Norris, but not quickly enough. Drawn to the spot by the mysterious power that seemed to connect him with his foul cat, Argus Filch burst suddenly through a tapestry to Harry's right, wheezing and looking wildly about for the rule-breaker. There was a thick tartan scarf bound around his head, and his nose was unusually purple. \"Filth!\" he shouted, his jowls aquiver, his eyes popping alarmingly as he pointed at the muddy puddle that had dripped from Harry's Quidditch robes. \"Mess and muck everywhere! I've had enough of it, I tell you! Follow me, Potter!\" So Harry waved a gloomy good-bye to Nearly Headless Nick and followed Filch back downstairs, doubling the number of muddy footprints on the floor. Harry had never been inside Filch's office before; it was a place most students avoided. The room was dingy and windowless, lit by a single oil lamp dangling from the low ceiling. A faint smell of fried fish lingered about the place. Wooden filing cabinets stood around the walls; from their labels, Harry could see that they contained details of every pupil Filch had ever punished. Fred and George Weasley had an entire drawer to themselves. A highly polished collection of chains and manacles hung on the wall behind Filch's desk."
}