{
  "id": "9da5ce73b197390f4a0488d3589d6e9e1e4486fd",
  "text": "..  But it was visible only for a split second. As though the creature beneath the cloak sensed Harry's gaze, the hand was suddenly withdrawn into the folds of its black cloak.  And then the thing beneath the hood, whatever it was, drew a long, slow, rattling breath, as though it were trying to suck something more than air from its surroundings.  An intense cold swept over them all. Harry felt his own breath catch in his chest. The cold went deeper than his skin. It was inside his chest, it was inside his very heart....  Harry's eyes rolled up into his head. He couldn't see. He was drowning in cold. There was a rushing in his ears as though of water. He was being dragged downward, the roaring growing louder. .  And then, from far away, he heard screaming, terrible, terrified, pleading screams. He wanted to help whoever it was, he tried to move his arms, but couldn't... a thick white fog was swirling around him, inside him -  \"Harry! Harry! Are you all right?\"  Someone was slapping his face.  \"W -- what?\"  Harry opened his eyes; there were lanterns above him, and the floor was shaking -- the Hogwarts Express was moving again and the lights had come back on. He seemed to have slid out of his seat onto the floor. Ron and Hermione were kneeling next to him, and above them he could see Neville and Professor Lupin watching. Harry felt very sick; when he put up his hand to push his glasses back on, he felt cold sweat on his face.  Ron and Hermione heaved him back onto his seat.  \"Are you okay?\" Ron asked nervously.  \"Yeah,\" said Harry, looking quickly toward the door. The hooded creature had vanished. \"What happened? Where's that -- that thing? Who screamed?\"  \"No one screamed,\" said Ron, more nervously still.  Harry looked around the bright compartment. Ginny and Neville looked back at him, both very pale.  \"But I heard screaming --\"  A loud snap made them all jump. Professor Lupin was breaking an enormous slab of chocolate into pieces.  \"Here,\" he said to Harry, handing him a particularly large piece. \"Eat it. It'll help.\"  Harry took the chocolate but didn't eat it.  \"What was that thing?\" he asked Lupin.  \"A dementor,\" said Lupin, who was now giving chocolate to everyone else. \"One of the dementors of Azkaban.\"  Everyone stared at him. Professor Lupin crumpled up the empty chocolate wrapper and put it in his pocket.  \"Eat,\" he repeated. \"It'll help. I need to speak to the driver, excuse me...  He strolled past Harry and disappeared into the corridor.  \"Are you sure you're okay, Harry?\" said Hermione, watching Harry anxiously.  \"I Don't get it.... What happened?\" said Harry, wiping more sweat off his face.  \"Well -- that thing -- the dementor -- stood there and looked around (I mean, I think it did, I couldn't see its face) -- and you -- you  \"I thought you were having a fit or something,\" said Ron, who still looked scared. \"You went sort of rigid and fell out of your seat and started twitching -- 11  \"And Professor Lupin stepped over you, and walked toward the dementor, and pulled out his wand,\" said Hermione, \"and he said, 'None of us is hiding Sirius Black under our cloaks. Go.' But the dementor didn't move, so Lupin muttered something, and a silvery thing shot out of his wand at it, and it turned around and sort of glided away.... \"  \"It was horrible,\" said Neville, in a higher voice than usual. \"Did YOU feel how cold it got when it came in?\"  I felt weird,\" said Ron, shifting his shoulders uncomfortably. \"Like I'd never be cheerful again....\"  Ginny, who was huddled in her corner looking nearly as bad as Harry felt, gave a small sob; Hermione went over and put a comforting arm around her.  \"But didn't any of you -- fall off your seats?\" said Harry awkwardly.  \"No,\" said Ron, looking anxiously at Harry again. \"Ginny was shaking like mad, though....\"  Harry didn't understand. He felt weak and shivery, as though he were recovering from a bad bout of flu; he also felt the beginnings of shame. Why had he gone to pieces like that, when no one else had?  Professor Lupin had come back. He paused as he entered, looked around, and said, with a small smile, \"I haven't poisoned that chocolate, you know....\"  Harry took a bite and to his great surprise felt warmth spread suddenly to the tips of his fingers and toes.  \"We'll be at Hogwarts in ten minutes,\" said Professor Lupin. \"Are you all right, Harry?\"  Harry didn't ask how Professor Lupin knew his name.  \"Fine,\" he muttered, embarrassed.  They didn't talk much during the remainder of the journey. At long last, the train stopped at Hogsmeade station, and there was a great scramble to get outside; owls hooted, cats meowed, and Neville's pet toad croaked loudly from under his hat. It was freezing on the tiny platform; rain was driving down in icy sheets.  \"Firs' years this way!\" called a familiar voice. Harry, Ron, and Hermione turned and saw the gigantic outline of Hagrid at the other end of the platform, beckoning the terrified-looking new students forward for their traditional journey across the lake."
}