{
  "id": "9db4404a478018254d385de5535e44240551589e",
  "text": " Cedric and Fheur were in conversation.  Fheur looked a good deal happier than Harry had seen her so far; she kept throwing back her head so that her long silvery hair caught the light.  A paunchy man, holding a large black camera that was smoking slightly, was watching Fleur out of the corner of his eye. Bagman suddenly spotted Harry, got up quickly, and bounded forward.  \"Ah, here he is!  Champion number four!  In you come, Harry, in you come.. . nothing to worry about, it's just the wand weighing ceremony, the rest of the judges will be here in a moment -\" \"Wand weighing?\" Harry repeated nervously. \"We have to check that your wands are fully functional, no problems, you know, as they're your most important tools in the tasks ahead,\" said Bagman.  \"The expert's upstairs now with Dumbledore.  And then there's going to be a little photo shoot.  This is Rita Skeeter,\" he added, gesturing toward the witch in magenta robes.  \"She's doing a small piece on the tournament for the Daily Prophet. .. .\" \"Maybe not that small, Ludo,\" said Rita Skeeter, her eyes on Harry. Her hair was set in elaborate and curiously rigid curls that contrasted oddly with her heavy-jawed face.  She wore jeweled spectacles.  The thick fingers clutching her crocodile-skin handbag ended in two-inch nails, painted crimson. \"I wonder if I could have a little word with Harry before we start?\"  she said to Bagman, but still gazing fixedly at Harry.  \"The youngest champion, you know. . . to add a bit of color?\" \"Certainly!\" cried Bagman. \"That is - if Harry has no objection?\" \"Er -\" said Harry. \"Lovely,\" said Rita Skeeter, and in a second, her scarlet-taloned fingers had Harry's upper arm in a surprisingly strong grip, and she was steering him out of the room again and opening a nearby door. \"We don't want to be in there with all that noise,\" she said. \"Let's see . . . ah, yes, this is nice and cozy.\" It was a broom cupboard.  Harry stared at her. \"Come along, dear - that's right - lovely,\" said Rita Skeeter again, perching herself precariously upon an upturned bucket, pushing Harry down onto a cardboard box, and closing the door, throwing them into darkness.  \"Let's see now. .\" She unsnapped her crocodile-skin handbag and pulled out a handful of candles, which she lit with a wave of her wand and magicked into midair, so that they could see what they were doing. \"You won't mind, Harry, if I use a Quick-Quotes Quill?  It leaves me free to talk to you normally. ..\" \"A what?\" said Harry. Rita Skeeter's smile widened.  Harry counted three gold teeth.  She reached again into her crocodile bag and drew out a long acid-green quill and a roll of parchment, which she stretched out between them on a crate of Mrs. Skower's All-Purpose Magical Mess Remover. She put the tip of the green quill into her mouth, sucked it for a moment with apparent relish, then placed it upright on the parchment, where it stood balanced on its point, quivering slightly. \"Testing. . . my name is Rita Skeeter, Daily Prophet reporter.\" Harry hooked down quickly at the quill. The moment Rita Skeeter had spoken, the green quill had started to scribble, skidding across the parchment:  Attractive blonde Rita Skeeter, forty-three, who's savage quill has punctured many inflated reputations -   \"Lovely,\" said Rita Skeeter, yet again, and she ripped the top piece of parchment off, crumpled it up, and stuffed it into her handbag.  Now she leaned toward Harry and said, \"So, Harry... what made you decide to enter the Triwizard Tournament?\" \"Er -\" said Harry again, but he was distracted by the quill.  Even though he wasn't speaking, it was dashing across the parchment, and in its wake he could make out a fresh sentence:  An ugly scar, souvenier of a tragic past, disfigures the otherwise charming face of Harry Potter, whose eyes --   \"Ignore the quill, Harry,\" said Rita Skeeter firmly.  Reluctantly Harry looked up at her instead.  \"Now -- why did you decide to enter the tournament, Harry?\" \"I didn't,\" said Harry.  \"I don't know how my name got into the Goblet of Fire.  I didn't put it in there.\" Rita Skeeter raised one heavily penciled eyebrow. \"Come now, Harry, there's no need to be scared of getting into trouble.  We all know you shouldn't really have entered at all.  But don't worry about that.  Our readers hove a rebel.\" \"But I didn't enter,\" Harry repeated.  \"I don't know who -\" \"How do you feel about the tasks ahead?\"  said Rita Skeeter.  \"Excited?  Nervous?\" \"I haven't really thought. . . yeah, nervous, I suppose,\" said Harry.  His insides squirmed uncomfortably as he spoke. \"Champions have died in the past, haven't they?\"  said Rita Skeeter briskly.  \"Have you thought about that at all?\" \"Well. . . they say it's going to be a lot safer this year,\" said Harry. The quill whizzed across the parchment between them, back and forward as though it were skating. \"Of course, you've looked death in the face before, haven't you?\"  said Rita Skeeter, watching him closely.  \"How would you say that's affected you?\" \"Er,\" said Harry, yet again."
}