{
  "id": "a01ae70e614a26f8418080ae1480ab6e745f18f8",
  "text": " Malfoy seized the package from Harry and felt it.  \"That's a broomstick,\" he said, throwing it back to Harry with a mixture of jealousy and spite on his face. \"You'll be in for it this time, Potter, first years aren't allowed them.\"  Ron couldn't resist it.  \"It's not any old broomstick,\" he said, \"it's a Nimbus Two Thousand. What did you say you've got at home, Malfoy, a Comet Two Sixty?\" Ron grinned at Harry. \"Comets look flashy, but they're not in the same league as the Nimbus.\"  \"What would you know about it, Weasley, you couldn't afford half the handle,\" Malfoy snapped back. \"I suppose you and your brothers have to save up twig by twig.\"  Before Ron could answer, Professor Flitwick appeared at Malfoy's elbow.  \"Not arguing, I hope, boys?\" he squeaked.  \"Potter's been sent a broomstick, Professor,\" said Malfoy quickly.  \"Yes, yes, that's right,\" said Professor Flitwick, beaming at Harry. \"Professor McGonagall told me all about the special circumstances, Potter. And what model is it?\"  \"A Nimbus Two Thousand, sit,\" said Harry, fighting not to laugh at the look of horror on Malfoy's face. \"And it's really thanks to Malfoy here that I've got it,\" he added.  Harry and Ron headed upstairs, smothering their laughter at Malfoy's obvious rage and confusion. \"Well, it's true,\" Harry chortled as they reached the top of the marble staircase, \"If he hadn't stolen Neville's Remembrall I wouln't be on the team....\"  \"So I suppose you think that's a reward for breaking rules?\" came an angry voice from just behind them. Hermione was stomping up the stairs, looking disapprovingly at the package in Harry's hand.  \"I thought you weren't speaking to us?\" said Harry.  \"Yes, don't stop now,\" said Ron, \"it's doing us so much good.\"  Hermione marched away with her nose in the air.  Harry had a lot of trouble keeping his mind on his lessons that day. It kept wandering up to the dormitory where his new broomstick was lying under his bed, or straying off to the Quidditch field where he'd be learning to play that night. He bolted his dinner that evening without noticing what he was eating, and then rushed upstairs with Ron to unwrap the Nimbus Two Thousand at last.  \"Wow,\" Ron sighed, as the broomstick rolled onto Harry's bedspread.  Even Harry, who knew nothing about the different brooms, thought it looked wonderful. Sleek and shiny, with a mahogany handle, it had a long tail of neat, straight twigs and Nimbus Two Thousand written in gold near the top.  As seven o'clock drew nearer, Harry left the castle and set off in the dusk toward the Quidditch field. Held never been inside the stadium before. Hundreds of seats were raised in stands around the field so that the spectators were high enough to see what was going on. At either end of the field were three golden poles with hoops on the end. They reminded Harry of the little plastic sticks Muggle  children blew bubbles through, except that they were fifty feet high.  Too eager to fly again to wait for Wood, Harry mounted his broomstick and kicked off from the ground. What a feeling -- he swooped in and out of the goal posts and then sped up and down the field. The Nimbus Two Thousand turned wherever he wanted at his lightest touch.  \"Hey, Potter, come down!'  Oliver Wood had arrived. fie was carrying a large wooden crate under his arm. Harry landed next to him.  \"Very nice,\" said Wood, his eyes glinting. \"I see what McGonagall meant... you really are a natural. I'm just going to teach you the rules this evening, then you'll be joining team practice three times a week.\"  He opened the crate. Inside were four different-sized balls.  \"Right,\" said Wood. \"Now, Quidditch is easy enough to understand, even if it's not too easy to play. There are seven players on each side. Three of them are called Chasers.\"  \"Three Chasers,\" Harry repeated, as Wood took out a bright red ball about the size of a soccer ball.  \"This ball's called the Quaffle,\" said Wood. \"The Chasers throw the Quaffle to each other and try and get it through one of the hoops to score a goal. Ten points every time the Quaffle goes through one of the hoops. Follow me?\"  \"The Chasers throw the Quaffle and put it through the hoops to score,\" Harry recited. \"So -- that's sort of like basketball on broomsticks with six hoops, isn't it?\"  \"What's basketball?\" said Wood curiously. \"Never mind,\" said Harry quickly.  \"Now, there's another player on each side who's called the Keeper -I'm Keeper for Gryffindor. I have to fly around our hoops and stop the other team from scoring.\"  \"Three Chasers, one Keeper,\" said Harry, who was determined to remember it all. \"And they play with the Quaffle. Okay, got that. So what are they for?\" He pointed at the three balls left inside the box.  \"I'll show you now,\" said Wood. \"Take this.\"  He handed Harry a small club, a bit like a short baseball bat.  \"I'm going to show you what the Bludgers do,\" Wood said. \"These two are the Bludgers.\"  He showed Harry two identical balls, jet black and slightly smaller than the red Quaffle."
}