{
  "id": "a116758e5a30d6e05738f5d0246937291bdcab01",
  "text": "    This soil is too stony for digging,  Ser Willis said.   Then we shall gather stones for cairns.    Gather all the stones you want,  Bronn told her,  but do it without me or Chiggen. I’ve better things to do than pile rocks on dead men… breathing, for one.  He looked over the rest of the survivors.  Any of you who hope to be alive come nightfall, ride with us.    My lady, I fear he speaks the truth,  Ser Rodrik said wearily. The old knight had been wounded in the fight, a deep gash in his left arm and a spear thrust that grazed his neck, and he sounded his age.  If we linger here, they will be on us again for a certainty, and we may not live through a second attack.   Tyrion could see the anger in Catelyn’s face, but she had no choice.  May the gods forgive us, then. We will ride at once.   There was no shortage of horses now. Tyrion moved his saddle to Jyck’s spotted gelding, who looked strong enough to last another three or four days at least. He was about to mount when Lharys stepped up and said,  I’ll take that dirk now, dwarf.    Let him keep it.  Catelyn Stark looked down from her horse.  And see that he has his axe back as well. We may have need of it if we are attacked again.    You have my thanks, lady,  Tyrion said, mounting up.   Save them,  she said curtly.  I trust you no more than I did before.  She was gone before he could frame a reply.  Tyrion adjusted his stolen helm and took the axe from Bronn. He remembered how he had begun the journey, with his wrists bound and a hood pulled down over his head, and decided that this was a definite improvement. Lady Stark could keep her trust; so long as he could keep the axe, he would count himself ahead in the game.  Ser Willis Wode led them out. Bronn took the rear, with Lady Stark safely in the middle, Ser Rodrik a shadow beside her. Marillion kept throwing sullen looks back at Tyrion as they rode. The singer had broken several ribs, his woodharp, and all four fingers on his playing hand, yet the day had not been an utter loss to him; somewhere he had acquired a magnificent shadowskin cloak, thick black fur slashed by stripes of white. He huddled beneath its folds silently, and for once had nothing to say.  They heard the deep growls of shadowcats behind them before they had gone half a mile, and later the wild snarling of the beasts fighting over the corpses they had left behind. Marillion grew visibly pale. Tyrion trotted up beside him.  Craven,  he said,  rhymes nicely with raven.  He kicked his horse and moved past the singer, up to Ser Rodrik and Catelyn Stark.  She looked at him, lips pressed tightly together.   As I was saying before we were so rudely interrupted,  Tyrion began,  there is a serious flaw in Littlefinger’s fable. Whatever you may believe of me, Lady Stark, I promise you this—I never bet against my family.       ARYA  The one-eared black tom arched his back and hissed at her.  Arya padded down the alley, balanced lightly on the balls of her bare feet, listening to the flutter of her heart, breathing slow deep breaths. Quiet as a shadow, she told herself, light as a feather. The tomcat watched her come, his eyes wary.  Catching cats was hard. Her hands were covered with half-healed scratches, and both knees were scabbed over where she had scraped them raw in tumbles. At first even the cook’s huge fat kitchen cat had been able to elude her, but Syrio had kept her at it day and night. When she’d run to him with her hands bleeding, he had said,  So slow? Be quicker, girl. Your enemies will give you more than scratches.  He had dabbed her wounds with Myrish fire, which burned so bad she had had to bite her lip to keep from screaming. Then he sent her out after more cats.  The Red Keep was full of cats: lazy old cats dozing in the sun, cold-eyed mousers twitching their tails, quick little kittens with claws like needles, ladies’ cats all combed and trusting, ragged shadows prowling the midden heaps. One by one Arya had chased them down and snatched them up and brought them proudly to Syrio Forel… all but this one, this one-eared black devil of a tomcat.  That’s the real king of this castle right there,  one of the gold cloaks had told her.  Older than sin and twice as mean. One time, the king was feasting the queen’s father, and that black bastard hopped up on the table and snatched a roast quail right out of Lord Tywin’s fingers. Robert laughed so hard he like to burst. You stay away from that one, child.   He had run her halfway across the castle; twice around the Tower of the Hand, across the inner bailey, through the stables, down the serpentine steps, past the small kitchen and the pig yard and the barracks of the gold cloaks, along the base of the river wall and up more steps and back and forth over Traitor’s Walk, and then down again and through a gate and around a well and in and out of strange buildings until Arya didn’t know where she was.  Now at last she had him. High walls pressed close on either side, and ahead was a blank windowless mass of stone."
}