{
  "id": "a31b79ba959eb68dd22c2b030bf994191892ddb9",
  "text": "\"  \"Now what?\" Ron whispered.  \"We separate it into three glasses and add the hairs.\"  Hermione ladled large dollops of the potion into each of the glasses. Then, her hand trembling, she shook Millicent Bulstrode's hair out of its bottle into the first glass.  *215*  The potion hissed loudly like a boiling kettle and frothed madly. A second later, it had turned a sick sort of yellow.  \"Urgh - essence of Millicent Bulstrode,\" said Ron, eyeing it with loathing. \"Bet it tastes disgusting.\"  \"Add yours, then,\" said Hermione.  Harry dropped Goyle's hair into the middle glass and Ron put Crabbe's into the last one. Both glasses hissed and frothed: Goyle's turned the khaki color of a booger, Crabbe's a dark, murky brown.  \"Hang on,\" said Harry as Ron and Hermione reached for their glasses. \"We'd better not all drink them in here .... Once we turn into Crabbe and Goyle we won't fit. And Millicent Bulstrode's no pixie.  \"Good thinking,\" said Ron, unlocking the door. \"We'll take separate stalls.\"  Careful not to spill a drop of his Polyjuice Potion, Harry slipped into the middle stall.  \"Ready?\" he called.  \"Ready,\" came Ron's and Hermione's voices.  \"One - two - three -\"  Pinching his nose, Harry drank the potion down in two large gulps. It tasted like overcooked cabbage.  Immediately, his insides started writhing as though he'd just swallowed live snakes - doubled up, he wondered whether he was going to be sick - then a burning sensation spread rapidly from his stomach to the very ends of his fingers and toes - next, bringing him gasping to all fours, came a horrible melting feeling, as the skin all over his body bubbled like hot wax - and before his eyes, his hands began to grow, the fingers thickened, the nails broadened,  * 2116 *  the knuckles were bulging like bolts -his shoulders stretched painfully and a prickling on his forehead told him that hair was creeping down toward his eyebrows - his robes ripped as his chest expanded like a barrel bursting its hoops - his feet were agony in shoes four sizes too small  As suddenly as it had started, everything stopped. Harry lay facedown on the stone-cold floor, listening to Myrtle gurgling morosely in the end toilet. With difficulty, he kicked off his shoes and stood up. So this was what it felt like, being Goyle. His large hand trembling, he pulled off his old robes, which were hanging a foot above his ankles, pulled on the spare ones, and laced up Goyle's boatlike shoes. He reached up to brush his hair out of his eyes and met only the short growth of wiry bristles, low on his forehead. Then he realized that his glasses were clouding his eyes because Goyle obviously didn't need them - he took them off and called, \"Are you two okay?\" Goyle's low rasp of a voice issued from his mouth.  \"Yeah,\" came the deep grunt of Crabbe from his right.  Harry unlocked his door and stepped in front of the cracked mirror. Goyle stared back at him out of dull, deepset eyes. Harry scratched his ear. So did Goyle.  Ron's door opened. They stared at each other. Except that he looked pale and shocked, Ron was indistinguishable from Crabbe, from the pudding-bowl haircut to the long, gorilla arms.  \"This is unbelievable,\" said Ron, approaching the mirror and prodding Crabbe's flat nose. \"Unbelievable. \"  \"We'd better get going,\" said Harry, loosening the watch that was cutting into Goyle's thick wrist. \"We've still got to find out  * 217*  where the Slytherin common room is. I only hope we can find someone to follow. . .\"  Ron, who had been gazing at Harry, said, \"You don't know how bizarre it is to see Goyle thinking.\" He banged on Hermione's door. \"C'mon, we need to go -\"  A high-pitched voice answered him.  \"I - I don't think I'm going to come after all. You go on without me.  \"Hermione, we know Millicent Bulstrode's ugly, no one's going to know it's you -\"  \"No - really - I don't think I'll come. You two hurry up, you re wasting time  Harry looked at Ron, bewildered.  \"That looks more like Goyle,\" said Ron. \"That's how he looks every time a teacher asks him a question.\"  \"Hermione, are you okay?\" said Harry through the door.  \"Fine - I'm fine - go on -\"  Harry looked at his watch. Five of their precious sixty minutes had already passed.  \"We'll meet you back here, all right?\" he said.  Harry and Ron opened the door of the bathroom carefully, checked that the coast was clear, and set off.  \"Don't swing your arms like that,\" Harry muttered to Ron.  \"Eh?\"  \"Crabbe holds them sort of stiff . . . .\"  \"How's this?\"  \"Yeah, that's better . . . .\"  They went down the marble staircase. All they needed now was  *218*  a Slytherin that they could follow to the Slytherin common room, but there was nobody around.  \"Any ideas?\" muttered Harry.  \"The Slytherins always come up to breakfast from over there,\" said Ron, nodding at the entrance to the dungeons. The words had barely left his mouth when a girl with long, curly hair emerged from the entrance.  \"Excuse me,\" said Ron, hurrying up to her. \"We've forgotten the way to our common room."
}