{
  "id": "a358c667cb8fc5b19f0e2883ef18753fdf0a3a4a",
  "text": "  And if we do make peace with King Joffrey, are we not then traitors to King Renly? What if the stag should prevail against the lion, where would that leave us?    Whatever you may decide for yourselves, I shall never call a Lannister my king,  declared Marq Piper.   Nor I!  yelled the little Darry boy.  I never will!   Again the shouting began. Catelyn sat despairing. She had come so close, she thought. They had almost listened, almost… but the moment was gone. There would be no peace, no chance to heal, no safety. She looked at her son, watched him as he listened to the lords debate, frowning, troubled, yet wedded to his war. He had pledged himself to marry a daughter of Walder Frey, but she saw his true bride plain before her now: the sword he had laid on the table.  Catelyn was thinking of her girls, wondering if she would ever see them again, when the Greatjon lurched to his feet.   MY LORDS!  he shouted, his voice booming off the rafters.  Here is what I say to these two kings!  He spat.  Renly Baratheon is nothing to me, nor Stannis neither. Why should they rule over me and mine, from some flowery seat in Highgarden or Dorne? What do they know of the Wall or the wolfswood or the barrows of the First Men? Even their gods are wrong. The Others take the Lannisters too, I’ve had a bellyful of them.  He reached back over his shoulder and drew his immense two-handed greatsword.  Why shouldn’t we rule ourselves again? It was the dragons we married, and the dragons are all dead!  He pointed at Robb with the blade.  There sits the only king I mean to bow my knee to, m’lords,  he thundered.  The King in the North!   And he knelt, and laid his sword at her son’s feet.   I’ll have peace on those terms,  Lord Karstark said.  They can keep their red castle and their iron chair as well.  He eased his longsword from its scabbard.  The King in the North!  he said, kneeling beside the Greatjon.  Maege Mormont stood.  The King of Winter!  she declared, and laid her spiked mace beside the swords. And the river lords were rising too, Blackwood and Bracken and Mallister, houses who had never been ruled from Winterfell, yet Catelyn watched them rise and draw their blades, bending their knees and shouting the old words that had not been heard in the realm for more than three hundred years, since Aegon the Dragon had come to make the Seven Kingdoms one… yet now were heard again, ringing from the timbers of her father’s hall:   The King in the North!    The King in the North!    THE KING IN THE NORTH!       DAENERYS  The land was red and dead and parched, and good wood was hard to come by. Her foragers returned with gnarled cottonwoods, purple brush, sheaves of brown grass. They took the two straightest trees, hacked the limbs and branches from them, skinned off their bark, and split them, laying the logs in a square. Its center they filled with straw, brush, bark shavings, and bundles of dry grass. Rakharo chose a stallion from the small herd that remained to them; he was not the equal of Khal Drogo’s red, but few horses were. In the center of the square, Aggo fed him a withered apple and dropped him in an instant with an axe blow between the eyes.  Bound hand and foot, Mirri Maz Duur watched from the dust with disquiet in her black eyes.  It is not enough to kill a horse,  she told Dany.  By itself, the blood is nothing. You do not have the words to make a spell, nor the wisdom to find them. Do you think bloodmagic is a game for children? You call me maegi as if it were a curse, but all it means is wise. You are a child, with a child’s ignorance. Whatever you mean to do, it will not work. Loose me from these bonds and I will help you.    I am tired of the maegi’s braying,  Dany told Jhogo. He took his whip to her, and after that the godswife kept silent.  Over the carcass of the horse, they built a platform of hewn logs; trunks of smaller trees and limbs from the greater, and the thickest straightest branches they could find. They laid the wood east to west, from sunrise to sunset. On the platform they piled Khal Drogo’s treasures: his great tent, his painted vests, his saddles and harness, the whip his father had given him when he came to manhood, the arakh he had used to slay Khal Ogo and his son, a mighty dragonbone bow. Aggo would have added the weapons Drogo’s bloodriders had given Dany for bride gifts as well, but she forbade it.  Those are mine,  she told him,  and I mean to keep them.  Another layer of brush was piled about the khal’s treasures, and bundles of dried grass scattered over them.  Ser Jorah Mormont drew her aside as the sun was creeping toward its zenith.  Princess…  he began.   Why do you call me that?  Dany challenged him.  My brother Viserys was your king, was he not?    He was, my lady.    Viserys is dead. I am his heir, the last blood of House Targaryen. Whatever was his is mine now.    My… queen,  Ser Jorah said, going to one knee.  My sword that was his is yours, Dacnerys. And my heart as well, that never belonged to your brother."
}