{
  "id": "a733d73794be370a7c1789b47856cf5093e6f758",
  "text": " Of  loftier mould these two were made: reverend and  wise. It was inevitable that they should make alliance. Gandalf would ascend  into  the  tower, to discuss  deep  things beyond their comprehension in the  high chambers of  Orthanc. The door would be closed, and they would  be left   outside, dismissed to await allotted work or punishment. Even in the mind of  Thjoden the thought took shape, like a shadow of doubt: 'He will betray  us;   he will go -- we shall be lost.'       Then Gandalf laughed. The fantasy vanished like a puff of smoke.       'Saruman, Saruman!' said Gandalf still  laughing.  'Saruman, you  missed  your path  in life. You  should have been the king's jester  and earned your  bread, and stripes  too, by  mimicking  his counsellors. Ah me!'  he paused,  getting the better of his mirth. 'Understand one another? I fear I am beyond  your comprehension. But you, Saruman, I understand  now too well.  I keep  a    ####-clearer memory of your arguments, and deeds, than  you  suppose. When last I  visited you, you were the jailor of Mordor, and there I was to be sent. Nay,  the guest who has escaped from the roof,  will think  twice  before he comes  back  in  by the door.  Nay,  I do  not think  I  will come  up. But listen,  Saruman, for the last time! Will you not come down? Isengard has proved less  strong than  your hope  and fancy made it. So may other  things in which you  still have trust.  Would it not be well to leave it for  a while? To turn to  new things, perhaps? Think well, Saruman! Will you not come down?'       A shadow passed over Saruman's face; then it went deathly white. Before  he could  conceal  it, they saw  through the mask the anguish of  a  mind in  doubt, loathing to  stay and dreading to leave  its refuge. For a second  he  hesitated, and no one breathed. Then he spoke,  and his voice was shrill and   cold. Pride and hate were conquering him.       'Will I come down?' he mocked. 'Does an unarmed man come down to   speak  with  robbers out of doors? I can  hear you w ell enough here. I am no fool,  and I do not trust you, Gandalf. They  do not stand openly on my stairs, but  I know where the wild wood-demons are lurking, at your command.'       'The treacherous are ever distrustful,' answered  Gandalf wearily. 'But  you need not fear for your skin.  I do not wish to kill you, or hurt you, as  you would know, if you really understood me. And I have the power to protect  you. I  am giving you  a last chance. You can leave Orthanc, free --  if you   choose.'       'That sounds  well,' sneered Saruman.  'Very  much  in  the  manner  of  Gandalf  the Grey: so condescending, and  so very  kind. I do not doubt that  you would find Orthanc  commodious,  and  my  departure convenient. But   why  should  I  wish  to  leave?  And  what  do you  mean  by  'free'?  There are  conditions, I presume?'       'Reasons for leaving you can see from your  windows.' answered Gandalf.  'Others  will  occur to  your  thought.  Your  servants  are  destroyed  and  scattered; your neighbours you have made your enemies; and you  have cheated  your new  master. or tried to do so. When his eye turns  hither,  it will be  the red eye of wrath. But when I say  'free',  I mean  'free': free from bond,  of chain or command: to go where you will, even, even to Mordor, Saruman, if  you desire. But  you will first surrender to me the Key of Orthanc, and your  staff. They shall be pledges of your conduct, to be returned later,  if  you    ####-merit them.'       Saruman's face  grew  livid, twisted  with rage,  and a  red light  was  kindled in his eyes.  He  laughed wildly. 'Later!' he  cried, and his  voice  rose to a scream.  'Later! Yes,  when you  also  have the Keys  of Barad-dyr  itself, I suppose; and the crowns of  seven kings. and the rods of  the Five  Wizards, and have purchased yourself a pair  of boots many sizes larger than  those  that you  wear now.  A modest plan.  Hardly one in which  my help  is  needed! I have other things to do. Do not be a fool. If you  wish  to  treat  with me, while you have a chance, go away, and come back when you are  sober!  And leave behind  these cut-throats and small  rag-tag that  dangle at  your  tail! Good day!' He turned and left the balcony.       'Come back,  Saruman!' said  Gandalf  in  a  commanding  voice. To  the   amazement of the others, Saruman turned again. and as if dragged against his  will, he  came slowly back to the  iron rail, leaning on it, breathing hard.  His  face was lined and  shrunken.  His hand clutched  his heavy black staff  like a claw.       'I did  not give you leave to  go,'  said Gandalf sternly. 'I have  not  finished. You have become a fool, Saruman, and yet pitiable. You might still  have turned away  from  folly and  evil, and  have been of  service. But you   choose to  stay  and gnaw the ends of your old plots. Stay then!  But I warn  you. you will not easily come out again.  Not  unless the  dark hands of the  East stretch out to  take you."
}