{
  "id": "ac720e343cc5b36a239db9f4689972384dc95228",
  "text": "  Plainly he did not care for the subject.   Did his lordship say where he was bound, milady?  asked Harwin.   Lord Beric never shares his plans, but there’s hunger down near Stoney Sept and the Threepenny Wood. I should look for him there.  She took a sip of wine.  You’d best know, I’ve had less pleasant callers as well. A pack of wolves came howling around my gates, thinking I might have Jaime Lannister in here.   Tom stopped his plucking.  Then it’s true, the Kingslayer is loose again?  Lady Smallwood gave him a scornful look.  I hardly think they’d be hunting him if he was chained up under Riverrun.    What did m’lady tell them?  asked Jack-Be-Lucky.   Why, that I had Ser Jaime naked in my bed, but I’d left him much too exhausted to come down. One of them had the effrontery to call me a liar, so we saw them off with a few quarrels. I believe they made for Blackbottom Bend.   Arya squirmed restlessly in her seat.  What northmen was it, who came looking after the Kingslayer?   Lady Smallwood seemed surprised that she’d spoken.  They did not give their names, child, but they wore black, with the badge of a white sun on the breast.   A white sun on black was the sigil of Lord Karstark, Arya thought. Those were Robb’s men. She wondered if they were still close. If she could give the outlaws the slip and find them, maybe they would take her to her mother at Riverrun…   Did they say how Lannister came to escape?  Lem asked.   They did,  said Lady Smallwood.  Not that I believe a word of it. They claimed that Lady Catelyn set him free.   That startled Tom so badly he snapped a string.  Go on with you,  he said.  That’s madness.   It’s not true, thought Arya. It couldn’t be true.   I thought the same,  said Lady Smallwood.  That was when Harwin remembered Arya.  Such talk is not for your ears, milady.    No, I want to hear.   The outlaws were adamant.  Go on with you, skinny squirrel,  said Greenbeard.  Be a good little lady and go play in the yard while we talk, now.   Arya stalked away angry, and would have slammed the door if it hadn’t been so heavy. Darkness had settled over Acorn Hall. A few torches burned along the walls, but that was all. The gates of the little castle were closed and barred. She had promised Harwin that she would not try and run away again, she knew, but that was before they started telling lies about her mother.   Arya?  Gendry had followed her out.  Lady Smallwood said there’s a smithy. Want to have a look?    If you want.  She had nothing else to do.   This Thoros,  Gendry said as they walked past the kennels,  is he the same Thoros who lived in the castle at King’s Landing? A red priest, fat, with a shaved head?    I think so.  Arya had never spoken to Thoros at King’s Landing that she could recall, but she knew who he was. He and Jalabhar Xho had been the most colorful figures at Robert’s court, and Thoros was a great friend of the king as well.   He won’t remember me, but he used to come to our forge.  The Smallwood forge had not been used in some time, though the smith had hung his tools neatly on the wall. Gendry lit a candle and set it on the anvil while he took down a pair of tongs.  My master always scolded him about his flaming swords. It was no way to treat good steel, he’d say, but this Thoros never used good steel. He’d just dip some cheap sword in wildfire and set it alight. It was only an alchemist’s trick, my master said, but it scared the horses and some of the greener knights.   She screwed up her face, trying to remember if her father had ever talked about Thoros.  He isn’t very priestly, is he?    No,  Gendry admitted.  Master Mott said Thoros could outdrink even King Robert. They were pease in a pod, he told me, both gluttons and sots.    You shouldn’t call the king a sot.  Maybe King Robert had drunk a lot, but he’d been her father’s friend.   I was talking about Thoros.  Gendry reached out with the tongs as if to pinch her face, but Arya swatted them away.  He liked feasts and tourneys, that was why King Robert was so fond of him. And this Thoros was brave. When the walls of Pyke crashed down, he was the first through the breach. He fought with one of his flaming swords, setting ironmen afire with every slash.    I wish I had a flaming sword.  Arya could think of lots of people she’d like to set on fire.   It’s only a trick, I told you. The wildfire ruins the steel. My master sold Thoros a new sword after every tourney. Every time they would have a fight about the price.  Gendry hung the tongs back up and took down the heavy hammer.  Master Mott said it was time I made my first longsword. He gave me a sweet piece of steel, and I knew just how I wanted to shape the blade. Only Yoren came, and took me away for the Night’s Watch.    You can still make swords if you want,  said Arya.  You can make them for my brother Robb when we get to Riverrun.    Riverrun.  Gendry put the hammer down and looked at her.  You look different now. Like a proper little girl.    I look like an oak tree, with all these stupid acorns."
}