{
  "id": "adb0a2af757d2b25c18db11887a4b195a2904b7d",
  "text": " \"I suppose there's always Moaning Myrtle,\" he said gloomily, referring to the ghost who haunted the girls' toilets on the second floor. \"Harry - we've just got to grit our teeth and do it,\" said Ron on Friday morning, in a tone that suggested they were planning the storming of an impregnable fortress.  \"When we get back to the common room tonight, we'll both have partners - agreed?\" \"Er . . . okay,\" said Harry. But every time he glimpsed Cho that day - during break, and then lunchtime, and once on the way to History of Magic - she was surrounded by friends.  Didn't she ever go anywhere alone?  Could he perhaps ambush her as she was going into a bathroom?  But no - she even seemed to go there with an escort of four or five girls.  Yet if he didn't do it soon, she was bound to have been asked by somebody else. He found it hard to concentrate on Snape's Potions test, and consequently forgot to add the key ingredient - a bezoar - meaning that he received bottom marks.  He didn't care, though; he was too busy screwing up his courage for what he was about to do.  When the bell rang, he grabbed his bag, and hurried to the dungeon door. \"I'll meet you at dinner,\" he said to Ron and Hermione, and he dashed off upstairs. He'd just have to ask Cho for a private word, that was all. ... He hurried off through the packed corridors looking for her, and (rather sooner than he had expected) he found her, emerging from a Defense Against the Dark Arts lesson. \"Er - Cho? Could I have a word with you?\" Giggling should be made illegal. Harry thought furiously, as all the girls around Cho started doing it.  She didn't, though.  She said, \"Okay,\" and followed him out of earshot other classmates. Harry turned to look at her and his stomach gave a weird lurch as though he had missed a step going downstairs. \"Er,\" he said. He couldn't ask her.  He couldn't.  But he had to.  Cho stood there looking puzzled, watching him.  The words came out before Harry had quite got his tongue around them. \"Wangoballwime?\" \"Sorry?\"  said Cho. \"D'you - d'you want to go to the ball with me?\"  said Harry.  Why did he have to go red now? Why? \"Oh!\" s aid Cho, and she went red too.  \"Oh Harry, I'm really sorry,\" and she truly looked it.  \"I've already said I'll go with someone else.\" \"Oh,\" said Harry. It was odd; a moment before his insides had been writhing like snakes, but suddenly he didn't seem to have any insides at all. \"Oh okay,\" he said, \"no problem.\" \"I'm really sorry,\" she said again. \"That's okay,\" said Harry. They stood there looking at each other, and then Cho said, \"Well-\" \"Yeah,\" said Harry. \"Well, 'bye,\" said Cho, still very red.  She walked away. Harry called after her, before he could stop himself. \"Who're you going with?\" \"Oh - Cedric,\" she said. \"Cedric Diggory.\" \"Oh right,\" said Harry. His insides had come back again.  It felt as though they had been filled with lead in their absence. Completely forgetting about dinner, he walked slowly back up to Gryffindor Tower, Cho's voice echoing in his ears with every step he took. \"Cedric - Cedric Diggory.\"  He had been starting to quite like Cedric - prepared to overlook the fact that he had once beaten him at Quidditch, and was handsome, and popular, and nearly everyone's favorite champion.  Now he suddenly realized that Cedric was in fact a useless pretty boy who didn't have enough brains to fill an eggcup. \"Fairy lights,\" he said dully to the Fat Lady - the password had been changed the previous day. \"Yes, indeed, dear!\"  she trilled, straightening her new tinsel hair band as she swung forward to admit him. Entering the common room, Harry looked around, and to his surprise he saw Ron sitting ashen-faced in a distant corner.  Ginny was sitting with him, talking to him in what seemed to be a low, soothing voice. \"What's up, Ron?\" said Harry, joining them. Ron looked up at Harry, a sort of blind horror in his face. \"Why did I do it?\" he said wildly.  \"I don't know what made me do it! \"What?\" said Harry. \"He - er - just asked Fleur Delacour to go to the ball with him,\" said Ginny.  She looked as though she was fighting back a smile, but she kept patting Ron's arm sympathetically. \"You what?' said Harry. \"I don't know what made me do it!\"  Ron gasped again.  \"What was I playing at? There were people - all around - I've gone mad - everyone watching!  I was just walking past her in the entrance hall - she was standing there talking to Diggory - and it sort of came over me - and I asked her!\" Ron moaned and put his face in his hands.  He kept talking, though the words were barely distinguishable. \"She looked at me like I was a sea slug or something.  Didn't even answer.  And then - I dunno - I just sort of came to my senses and ran for it.\" \"She's part veela,\" said Harry.  \"You were right - her grandmother was one.  It wasn't your fault, I bet you just walked past when she was turning on the old charm for Diggory and got a blast of it - but she was wasting her time.  He's going with Cho Chang.\" Ron looked up."
}