{
  "id": "b388889d61430b7fb118c43bd40e1f4913cd5ed9",
  "text": " Crouch. \"But I've told you, I had no idea!\"  Bagman called earnestly over the crowd's babble, his round blue eyes widening.  \"None at all! Old Rookwood was a friend of my dad's . . . never crossed my mind he was in with You-Know-Who!  I thought I was collecting information for our side!  And Rookwood kept talking about getting me a job in the Ministry later on ... once my Quidditch days are over, you know ... I mean, I can't keep getting hit by Bludgers for the rest of my life, can I?\" There were titters from the crowd. \"It will be put to the vote,\" said Mr. Crouch coldly.  He turned to the right-hand side of the dungeon.  \"The jury will please raise their hands . . . those in favor of imprisonment...\" Harry looked toward the right-hand side of the dungeon.  Not one person raised their hand.  Many of the witches and wizards around the walls began to clap.  One of the witches on the jury stood up. \"Yes?\" barked Crouch. \"We'd just like to congratulate Mr. Bagman on his splendid performance for England in the Quidditch match against Turkey last Saturday,\" the witch said breathlessly. Mr. Crouch looked furious.  The dungeon was ringing with applause now.  Bagman got to his feet and bowed, beaming. \"Despicable,\" Mr. Crouch spat at Dumbledore, sitting down as Bagman walked out of the dungeon.  \"Rookwood get him a job indeed. . . . The day Ludo Bagman joins us will be a sad day indeed for the Ministry. . . .\" And the dungeon dissolved again.  When it had returned, Harry looked around.  He and Dumbledore were still sitting beside Mr. Crouch, but the atmosphere could not have been more different.  There was total silence, broken only by the dry sobs of a frail, wispy-looking witch in the seat next to Mr. Crouch.  She was clutching a handkerchief to her mouth with trembling hands. Harry looked up at Crouch and saw that he looked gaunter and grayer than ever before.  A nerve was twitching in his temple. \"Bring them in,\" he said, and his voice echoed through the silent dungeon. The door in the corner opened yet again.  Six dementors entered this time, flanking a group of four people.  Harry saw the people in the crowd turn to look up at Mr. Crouch.  A few of them whispered to one another. The dementors placed each of the four people in the four chairs with chained arms that now stood on the dungeon floor.  There was a thickset man who stared blankly up at Crouch; a thinner and more nervous-looking man, whose eyes were darting around the crowd; a woman with thick, shining dark hair and heavily hooded eyes, who was sitting in the chained chair as though it were a throne; and a boy in his late teens, who looked nothing short of petrified.  He was shivering, his straw-colored hair all over his face, his freckled skin milk-white.  The wispy little witch beside  Crouch began to rock backward and forward in her seat, whimpering into her handkerchief. Crouch stood up.  He looked down upon the four in front of him, and there was pure hatred in his face. \"You have been brought here before the Council of Magical Law,\" he said clearly, \"so that we may pass judgment on you, for a crime so heinous -\" \"Father,\" said the boy with the straw-colored hair. \"Father. . .please . . . \"- that we have rarely heard the like of it within this court,\" said Crouch, speaking more loudly, drowning out his son's voice. \"We have heard the evidence against you.  The four of you stand accused of capturing an Auror - Frank Longbottom - and subjecting him to the Cruciatus Curse, believing him to have knowledge of the present whereabouts of your exiled master, He-Who-Must-Not-Be-Named -\" \"Father, I didn't!\"  shrieked the boy in chains below.  \"I didn't, I swear it.  Father, don't send me back to the dementors -\" \"You are further accused,\" bellowed Mr. Crouch, \"of using the Cruciatus Curse on Frank Longbottom's wife, when he would not give you information.  You planned to restore He-Who-Must-Not-Be-Named to power, and to resume the lives of violence you presumably led while he was strong. I now ask the jury -\" \"Mother!\" screamed the boy below, and the wispy little witch beside Crouch began to sob, rocking backward and forward.  \"Mother, stop him.  Mother, I didn't do it, it wasn't me!\" \"I now ask the jury,\" shouted Mr. Crouch, \"to raise their hands if they believe, as I do, that these crimes deserve a life sentence in Azkaban!\" In unison, the witches and wizards along the right-hand side of the dungeon raised their hands.  The crowd around the walls began to clap as it had for Bagman, their faces full of savage triumph.  The boy began to scream. \"No!  Mother, no!  I didn't do it, I didn't do it, I didn't know!  Don't send me there, don't let him!\" The dementors were gliding back into the room.  The boys' three companions rose quietly from their seats; the woman with the heavy-lidded eyes looked up at Crouch and called, \"The Dark Lord will rise again, Crouch!  Throw us into Azkaban; we will wait!  He will rise again and will come for us, he will reward us beyond any of his other supporters!  We alone were faithful!  We alone tried to find him!\" But the boy was trying to fight off the dementors, even though Harry could see their cold, draining power starting to affect him."
}