{
  "id": "b4c6b148326bdefafd6d1712379b8ecfecb3563c",
  "text": "  Why would anyone kill Jory?   Robb shook his head numbly, the pain plain in his eyes.  I don’t know, and… Bran, that’s not the worst of it. Father was caught beneath a falling horse in the fight. Alyn says his leg was shattered, and… Maester Pycelle has given him the milk of the poppy, but they aren’t sure when… when he…  The sound of hoofbeats made him glance down the road, to where Theon and the others were coming up.  When he will wake,  Robb finished. He laid his hand on the pommel of his sword then, and went on in the solemn voice of Robb the Lord.  Bran, I promise you, whatever might happen, I will not let this be forgotten.   Something in his tone made Bran even more fearful.  What will you do?  he asked as Theon Greyjoy reined in beside them.   Theon thinks I should call the banners,  Robb said.   Blood for blood.  For once Greyjoy did not smile. His lean, dark face had a hungry look to it, and black hair fell down across his eyes.   Only the lord can call the banners,  Bran said as the snow drifted down around them.   If your father dies,  Theon said,  Robb will be Lord of Winterfell.    He won’t die!  Bran screamed at him.  Robb took his hand.  He won’t die, not Father,  he said calmly.  Still… the honor of the north is in my hands now. When our lord father took his leave of us, he told me to be strong for you and for Rickon. I’m almost a man grown, Bran.   Bran shivered.  I wish Mother was back,  he said miserably. He looked around for Maester Luwin; his donkey was visible in the far distance, trotting over a rise.  Does Maester Luwin say to call the banners too?    The maester is timid as an old woman,  said Theon.   Father always listened to his counsel,  Bran reminded his brother.  Mother too.    I listen to him,  Robb insisted.  I listen to everyone.   The joy Bran had felt at the ride was gone, melted away like the snowflakes on his face. Not so long ago, the thought of Robb calling the banners and riding off to war would have filled him with excitement, but now he felt only dread.  Can we go back now?  he asked.  I’m cold.   Robb glanced around.  We need to find the wolves. Can you stand to go a bit longer?    I can go as long as you can.  Maester Luwin had warned him to keep the ride short, for fear of saddle sores, but Bran would not admit to weakness in front of his brother. He was sick of the way everyone was always fussing over him and asking how he was.   Let’s hunt down the hunters, then,  Robb said. Side by side, they urged their mounts off the kingsroad and struck out into the wolfswood. Theon dropped back and followed well behind them, talking and joking with the guardsmen.  It was nice under the trees. Bran kept Dancer to a walk, holding the reins lightly and looking all around him as they went. He knew this wood, but he had been so long confined to Winterfell that he felt as though he were seeing it for the first time. The smells filled his nostrils; the sharp fresh tang of pine needles, the earthy odor of wet rotting leaves, the hints of animal musk and distant cooking fires. He caught a glimpse of a black squirrel moving through the snow-covered branches of an oak, and paused to study the silvery web of an empress spider.  Theon and the others fell farther and farther behind, until Bran could no longer hear their voices. From ahead came the faint sound of rushing waters. It grew louder until they reached the stream. Tears stung his eyes.   Bran?  Robb asked.  What’s wrong?   Bran shook his head.  I was just remembering,  he said.  Jory brought us here once, to fish for trout. You and me and Jon. Do you remember?    I remember,  Robb said, his voice quiet and sad.   I didn’t catch anything,  Bran said,  but Jon gave me his fish on the way back to Winterfell. Will we ever see Jon again?    We saw Uncle Benjen when the king came to visit,  Robb pointed out.  Jon will visit too, you’ll see.   The stream was running high and fast. Robb dismounted and led his gelding across the ford. In the deepest part of the crossing, the water came up to midthigh. He tied his horse to a tree on the far side, and waded back across for Bran and Dancer. The current foamed around rock and root, and Bran could feel the spray on his face as Robb led him over. It made him smile. For a moment he felt strong again, and whole. He looked up at the trees and dreamed of climbing them, right up to the very top, with the whole forest spread out beneath him.  They were on the far side when they heard the howl, a long rising wail that moved through the trees like a cold wind. Bran raised his head to listen.  Summer,  he said. No sooner had he spoken than a second voice joined the first.   They’ve made a kill,  Robb said as he remounted.  I’d best go and bring them back. Wait here, Theon and the others should be along shortly.    I want to go with you,  Bran said.   I’ll find them faster by myself.  Robb spurred his gelding and vanished into the trees.  Once he was gone, the woods seemed to close in around Bran. The snow was falling more heavily now."
}