{
  "id": "b4cccde307c5a70898b7b0add48a1ccbca7bad42",
  "text": "  The evening’s rain had woken a hundred sleeping smells and made them ripe and strong again. Grass and thorns, blackberries broken on the ground, mud, worms, rotting leaves, a rat creeping through the bush. He caught the shaggy black scent of his brother’s coat and the sharp coppery tang of blood from the squirrel he’d killed. Other squirrels moved through the branches above, smelling of wet fur and fear, their little claws scratching at the bark. The noise had sounded something like that.  And he heard it again, clink and scrape. It brought him to his feet. His ears pricked and his tail rose. He howled, a long deep shivery cry, a howl to wake the sleepers, but the piles of man-rock were dark and dead. A still wet night, a night to drive men into their holes. The rain had stopped, but the men still hid from the damp, huddled by the fires in their caves of piled stone.  His brother came sliding through the trees, moving almost as quiet as another brother he remembered dimly from long ago, the white one with the eyes of blood. This brother’s eyes were pools of shadow, but the fur on the back of his neck was bristling. He had heard the sounds as well, and known they meant danger.  This time the clink and scrape were followed by a slithering and the soft swift patter of skinfeet on stone. The wind brought the faintest whiff of a man-smell he did not know. Stranger. Danger. Death.  He ran toward the sound, his brother racing beside him. The stone dens rose before them, walls slick and wet. He bared his teeth, but the man-rock took no notice. A gate loomed up, a black iron snake coiled tight about bar and post. When he crashed against it, the gate shuddered and the snake clanked and slithered and held. Through the bars he could look down the long stone burrow that ran between the walls to the stony field beyond, but there was no way through. He could force his muzzle between the bars, but no more. Many a time his brother had tried to crack the black bones of the gate between his teeth, but they would not break. They had tried to dig under, but there were great flat stones beneath, half-covered by earth and blown leaves.  Snarling, he paced back and forth in front of the gate, then threw himself at it once more. It moved a little and slammed him back. Locked, something whispered. Chained. The voice he did not hear, the scent without a smell. The other ways were closed as well. Where doors opened in the walls of man-rock, the wood was thick and strong. There was no way out.  There is, the whisper came, and it seemed as if he could see the shadow of a great tree covered in needles, slanting up out of the black earth to ten times the height of a man. Yet when he looked about, it was not there. The other side of the godswood, the sentinel, hurry, hurry…  Through the gloom of night came a muffled shout, cut short.  Swiftly, swiftly, he whirled and bounded back into the trees, wet leaves rustling beneath his paws, branches whipping at him as he rushed past. He could hear his brother following close. They plunged under the heart tree and around the cold pool, through the blackberry bushes, under a tangle of oaks and ash and hawthorn scrub, to the far side of the wood… and there it was, the shadow he’d glimpsed without seeing, the slanting tree pointing at the rooftops. Sentinel, came the thought.  He remembered how it was to climb it then. The needles everywhere, scratching at his bare face and falling down the back of his neck, the sticky sap on his hands, the sharp piney smell of it. It was an easy tree for a boy to climb, leaning as it did, crooked, the branches so close together they almost made a ladder, slanting right up to the roof.  Growling, he sniffed around the base of the tree, lifted a leg and marked it with a stream of urine. A low branch brushed his face, and he snapped at it, twisting and pulling until the wood cracked and tore. His mouth was full of needles and the bitter taste of the sap. He shook his head and snarled.  His brother sat back on his haunches and lifted his voice in a ululating howl, his song black with mourning. The way was no way. They were not squirrels, nor the cubs of men, they could not wriggle up the trunks of trees, clinging with soft pink paws and clumsy feet. They were runners, hunters, prowlers.  Off across the night, beyond the stone that hemmed them close, the dogs woke and began to bark. One and then another and then all of them, a great clamor. They smelled it too; the scent of foes and fear.  A desperate fury filled him, hot as hunger. He sprang away from the wall loped off beneath the trees, the shadows of branch and leaf dappling his grey fur… and then he turned and raced back in a rush. His feet flew kicking up wet leaves and pine needles, and for a little time he was a hunter and an antlered stag was fleeing before him and he could see it, smell it, and he ran full out in pursuit. The smell of fear made his heart thunder and slaver ran from his jaws, and he reached the falling tree in stride and threw himself up the trunk, claws scrabbling at the bark for purchase."
}