{
  "id": "b5088dfad64a40787de4208ec435bc0e02c3dba6",
  "text": " He managed to wrench the axe free and lurch clumsily out of the way. Marillion was less fortunate. Horse and rider crashed to the ground in a tangle on top of the singer. Tyrion danced back in while the brigand’s leg was still pinned beneath his fallen mount, and buried the axe in the man’s neck, just above the shoulder blades.  As he struggled to yank the blade loose, he heard Marillion moaning under the bodies.  Someone help me,  the singer gasped.  Gods have mercy, I’m bleeding.    I believe that’s horse blood,  Tyrion said. The singer’s hand came crawling out from beneath the dead animal, scrabbling in the dirt like a spider with five legs. Tyrion put his heel on the grasping fingers and felt a satisfying crunch.  Close your eyes and pretend you’re dead,  he advised the singer before he hefted the axe and turned away.  After that, things ran together. The dawn was full of shouts and screams and heavy with the scent of blood, and the world had turned to chaos. Arrows hissed past his ear and clattered off the rocks. He saw Bronn unhorsed, fighting with a sword in each hand. Tyrion kept on the fringes of the fight, sliding from rock to rock and darting out of the shadows to hew at the legs of passing horses. He found a wounded clansman and left him dead, helping himself to the man’s halfhelm. It fit too snugly, but Tyrion was glad of any protection at all. Jyck was cut down from behind while he sliced at a man in front of him, and later Tyrion stumbled over Kurleket’s body. The pig face had been smashed in with a mace, but Tyrion recognized the dirk as he plucked it from the man’s dead fingers. He was sliding it through his belt when he heard a woman’s scream.  Catelyn Stark was trapped against the stone face of the mountain with three men around her, one still mounted and the other two on foot. She had a dagger clutched awkwardly in her maimed hands, but her back was to the rock now and they had penned her on three sides. Let them have the bitch, Tyrion thought, and welcome to her, yet somehow he was moving. He caught the first man in the back of the knee before they even knew he was there, and the heavy axehead split flesh and bone like rotten wood. Logs that bleed, Tyrion thought inanely as the second man came for him. Tyrion ducked under his sword, lashed out with the axe, the man reeled backward… and Catelyn Stark stepped up behind him and opened his throat. The horseman remembered an urgent engagement elsewhere and galloped off suddenly.  Tyrion looked around. The enemy were all vanquished or vanished. Somehow the fighting had ended when he wasn’t looking. Dying horses and wounded men lay all around, screaming or moaning. To his vast astonishment, he was not one of them. He opened his fingers and let the axe thunk to the ground. His hands were sticky with blood. He could have sworn they had been fighting for half a day, but the sun seemed scarcely to have moved at all.   Your first battle?  Bronn asked later as he bent over Jyck’s body, pulling off his boots. They were good boots, as befit one of Lord Tywin’s men; heavy leather, oiled and supple, much finer than what Bronn was wearing.  Tyrion nodded.  My father will be so proud,  he said. His legs were cramping so badly he could scarcely stand. Odd, he had never once noticed the pain during the battle.   You need a woman now,  Bronn said with a glint in his black eyes. He shoved the boots into his saddlebag.  Nothing like a woman after a man’s been blooded, take my word.   Chiggen stopped looting the corpses of the brigands long enough to snort and lick his lips.  Tyrion glanced over to where Lady Stark was dressing Ser Rodrik’s wounds.  I’m willing if she is,  he said. The freeriders broke into laughter, and Tyrion grinned and thought, There’s a start.  Afterward he knelt by the stream and washed the blood off his face in water cold as ice. As he limped back to the others, he glanced again at the slain. The dead clansmen were thin, ragged men, their horses scrawny and undersized, with every rib showing. What weapons Bronn and Chiggen had left them were none too impressive. Mauls, clubs, a scythe… He remembered the big man in the shadowskin cloak who had dueled Ser Rodrik with a two-handed greatsword, but when he found his corpse sprawled on the stony ground, the man was not so big after all, the cloak was gone, and Tyrion saw that the blade was badly notched, its cheap steel spotted with rust. Small wonder the clansmen had left nine bodies on the ground.  They had only three dead; two of Lord Bracken’s men-at-arms, Kurleket and Mohor, and his own man Jyck, who had made such a bold show with his bareback charge. A fool to the end, Tyrion thought.   Lady Stark, I urge you to press on, with all haste,  Ser Willis Wode said, his eyes scanning the ridgetops warily through the slit in his helm.  We drove them off for the moment, but they will not have gone far.    We must bury our dead, Ser Willis,  she said.  These were brave men. I will not leave them to the crows and shadowcats."
}