{
  "id": "b57a4c6d1d6545e2c47e6308df3d02e0a0abe366",
  "text": " The door opened as he was lifting his hand to knock.   Varys?  Tyrion slipped inside.  Are you there?  A single candle lit the gloom, spicing the air with the scent of jasmine.   My lord.  A woman sidled into the light; plump, soft, matronly, with a round pink moon of a face and heavy dark curls. Tyrion recoiled.  Is something amiss?  she asked.  Varys, he realized with annoyance.  For one horrid moment I thought you’d brought me Lollys instead of Shae. Where is she?    Here, m’lord.  She put her hands over his eyes from behind.  Can you guess what I’m wearing?    Nothing?    Oh, you’re so smart,  she pouted, snatching her hands away.  How did you know?    You’re very beautiful in nothing.    Am I?  she said.  Am I truly?    Oh yes.    Then shouldn’t you be fucking me instead of talking?    We need to rid ourselves of Lady Varys first. I am not the sort of dwarf who likes an audience.    He’s gone,  Shae said.  Tyrion turned to look. It was true. The eunuch had vanished, skirts and all. The hidden doors are here somewhere, they have to be. That was as much as he had time to think, before Shae turned his head to kiss him. Her mouth was wet and hungry, and she did not even seem to see his scar, or the raw scab where his nose had been. Her skin was warm silk beneath his fingers. When his thumb brushed against her left nipple, it hardened at once.  Hurry,  she urged, between kisses, as his fingers went to his laces,  oh, hurry, hurry, I want you in me, in me, in me.  He did not even have time to undress properly. Shae pulled his cock out of his breeches, then pushed him down onto the floor and climbed atop him. She screamed as he pushed past her lips, and rode him wildly, moaning,  My giant, my giant, my giant,  every time she slammed down on him. Tyrion was so eager that he exploded on the fifth stroke, but Shae did not seem to mind. She smiled wickedly when she felt him spurting, and leaned forward to kiss the sweat from his brow.  My giant of Lannister,  she murmured.  Stay inside me, please. I like to feel you there.   So Tyrion did not move, except to put his arms around her. It feels so good to hold her, and to be held, he thought. How can something this sweet be a crime worth hanging her for?  Shae,  he said,  sweetling, this must be our last time together. The danger is too great. If my lord father should find you…    I like your scar.  She traced it with her finger.  It makes you look very fierce and strong.   He laughed.  Very ugly, you mean.    M’lord will never be ugly in my eyes.  She kissed the scab that covered the ragged stub of his nose.   It’s not my face that need concern you, it’s my father—    He does not frighten me. Will m’lord give me back my jewels and silks now? I asked Varys if I could have them when you were hurt in the battle, but he wouldn’t give them to me. What would have become of them if you’d died?    I didn’t die. Here I am.    I know.  Shae wriggled atop him, smiling.  Just where you belong.  Her mouth turned pouty.  But how long must I go on with Lollys, now that you’re well?    Have you been listening?  Tyrion said.  You can stay with Lollys if you like, but it would be best if you left the city.    I don’t want to leave. You promised you’d move me into a manse again after the battle.  Her cunt gave him a little squeeze, and he started to stiffen again inside her.  A Lannister always pays his debts, you said.    Shae, gods be damned, stop that. Listen to me. You have to go away. The city’s full of Tyrells just now, and I am closely watched. You don’t understand the dangers.    Can I come to the king’s wedding feast? Lollys won’t go. I told her no one’s like to rape her in the king’s own throne room, but she’s so stupid.  When Shae rolled off, his cock slid out of her with a soft wet sound.  Symon says there’s to be a singers’ tourney, and tumblers, even a fools’ joust.   Tyrion had almost forgotten about Shae’s thrice-damned singer.  How is it you spoke to Symon?    I told Lady Tanda about him, and she hired him to play for Lollys. The music calms her when the baby starts to kick. Symon says there’s to be a dancing bear at the feast, and wines from the Arbor. I’ve never seen a bear dance.    They do it worse than I do.  It was the singer who concerned him, not the bear. One careless word in the wrong ear, and Shae would hang.   Symon says there’s to be seventy-seven courses and a hundred doves baked into a great pie,  Shae gushed.  When the crust’s opened, they’ll all burst out and fly.    After which they will roost in the rafters and rain down birdshit on the guests.  Tyrion had suffered such wedding pies before. The doves liked to shit on him especially, or so he had always suspected.   Couldn’t I dress in my silks and velvets and go as a lady instead of a maidservant? No one would know I wasn’t.   Everyone would know you weren’t, thought Tyrion.  Lady Tanda might wonder where Lollys’s bedmaid found so many jewels.    There’s to be a thousand guests, Symon says. She’d never even see me."
}