{
  "id": "b6ae568ab8cd997f8774c5f686de7485ac2783b9",
  "text": " Yes. I know them all. The Imp Tyrion Lannister stole them from my chambers, when he had me falsely imprisoned.    Pycelle,  Tyrion called out, risking his father’s wrath,  could any of these poisons choke off a man’s breath?    No. For that, you must turn to a rarer poison. When I was a boy at the Citadel, my teachers named it simply the strangler.    But this rare poison was not found, was it?    No, my lord.  Pycelle blinked at him.  You used it all to kill the noblest child the gods ever put on this good earth.   Tyrion’s anger overwhelmed his sense.  Joffrey was cruel and stupid, but I did not kill him. Have my head off if you like, I had no hand in my nephew’s death.    Silence!  Lord Tywin said.  I have told you thrice. The next time, you shall be gagged and chained.   After Pycelle came the procession, endless and wearisome. Lords and ladies and noble knights, highborn and humble alike, they had all been present at the wedding feast, had all seen Joffrey choke, his face turning as black as a Dornish plum. Lord Redwyne, Lord Celtigar, and Ser Flement Brax had heard Tyrion threaten the king; two serving men, a juggler, Lord Gyles, Ser Hobber Redwyne, and Ser Philip Foote had observed him fill the wedding chalice; Lady Merryweather swore that she had seen the dwarf drop something into the king’s wine while Joff and Margaery were cutting the pie; old Estermont, young Peckledon, the singer Galyeon of Cuy, and the squires Morros and Jothos Slynt told how Tyrion had picked up the chalice as Joff was dying and poured out the last of the poisoned wine onto the floor.  When did I make so many enemies? Lady Merryweather was all but a stranger. Tyrion wondered if she was blind or bought. At least Galyeon of Cuy had not set his account to music, or else there might have been seventy-seven bloody verses to it.  When his uncle called that night after supper, his manner was cold and distant. He thinks I did it too.  Do you have witnesses for us?  Ser Kevan asked him.   Not as such, no. Unless you’ve found my wife.   His uncle shook his head.  It would seem the trial is going very badly for you.    Oh, do you think so? I hadn’t noticed.  Tyrion fingered his scar.  Varys has not come.    Nor will he. On the morrow he testifies against you.   Lovely.  I see.  He shifted in his seat.  I am curious. You were always a fair man, Uncle. What convinced you?    Why steal Pycelle’s poisons, if not to use them?  Ser Kevan said bluntly.  And Lady Merryweather saw—    —nothing! There was nothing to see. But how do I prove that? How do I prove anything, penned up here?    Perhaps the time has come for you to confess.   Even through the thick stone walls of the Red Keep, Tyrion could hear the steady wash of rain.  Say that again, Uncle? I could swear you urged me to confess.    If you were to admit your guilt before the throne and repent of your crime, your father would withhold the sword. You would be permitted to take the black.   Tyrion laughed in his face.  Those were the same terms Cersei offered Eddard Stark. We all know how that ended.    Your father had no part in that.   That much was true, at least.  Castle Black teems with murderers, thieves and rapists,  Tyrion said,  but I don’t recall meeting many regicides while I was there. You expect me to believe that if I admit to being a kinslayer and kingslayer, my father will simply nod, forgive me, and pack me off to the Wall with some warm woolen smallclothes.  He hooted rudely.   Naught was said of forgiveness,  Ser Kevan said sternly.  A confession would put this matter to rest. It is for that reason your father sends me with this offer.    Thank him kindly for me, Uncle,  said Tyrion,  but tell him I am not presently in a confessing mood.    Were I you, I’d change my mood. Your sister wants your head, and Lord Tyrell at least is inclined to give it to her.    So one of my judges has already condemned me, without hearing a word in my defense?  It was no more than he expected.  Will I still be allowed to speak and present witnesses?    You have no witnesses,  his uncle reminded him.  Tyrion, if you are guilty of this enormity, the Wall is a kinder fate than you deserve. And if you are blameless… there is fighting in the north, I know, but even so it will be a safer place for you than King’s Landing, whatever the outcome of this trial. The mob is convinced of your guilt. Were you so foolish as to venture out into the streets, they would tear you limb from limb.    I can see how much that prospect upsets you.    You are my brother’s son.    You might remind him of that.    Do you think he would allow you to take the black if you were not his own blood, and Joanna’s? Tywin seems a hard man to you, I know, but he is no harder than he’s had to be. Our own father was gentle and amiable, but so weak his bannermen mocked him in their cups. Some saw fit to defy him openly. Other lords borrowed our gold and never troubled to repay it. At court they japed of toothless lions. Even his mistress stole from him."
}