{
  "id": "b8f2405dbb4c647cc2ecee9ab4acc3cce913b2ae",
  "text": " Snape was shaking Professor McGonagall's hand, with a horrible, forced smile. He caught Harry's eye and Harry knew at once that Snape's feelings toward him hadn't changed one jot. This didn't worry Harry. It seemed as though life would be back to normal next year, or as normal as it ever was at Hogwarts.  It was the best evening of Harry's life, better than winning at Quidditch, or Christmas, or knocking out mountain trolls... he would never, ever forget tonight.  Harry had almost forgotten that the exam results were still to come, but come they did. To their great surprise, both he and Ron passed with good marks; Hermione, of course, had the best grades of the first years. Even Neville scraped through, his good Herbology mark making up for his abysmal Potions one. They had hoped that Goyle, who was almost as stupid as he was mean, might be thrown out, but he had passed, too. It was a shame, but as Ron said, you couldn't have everything in life.  And suddenly, their wardrobes were empty, their trunks were packed, Neville's toad was found lurking in a corner of the toilets; notes were handed out to all students, warning them not to use magic over the holidays (\"I always hope they'll forget to give us these,\" said Fred Weasley sadly); Hagrid was there to take them down to the fleet of boats that sailed across the lake; they were boarding the Hogwarts Express; talking and laughing as the countryside became greener and tidier; eating Bettie Bott's Every Flavor Beans as they sped past Muggle towns; pulling off their wizard robes and putting on jackets and coats; pulling into platform nine and three-quarters at King's Cross Station.  It took quite a while for them all to get off the platform. A wizened old guard was up by the ticket barrier, letting them go through the gate in twos and threes so they didn't attract attention by all bursting out of a solid wall at once and alarming the Muggles.  \"You must come and stay this summer,\" said Ron, \"both of you -- I'll send you an owl.\"  \"Thanks,\" said Harry, \"I'll need something to look forward to.\" People jostled them as they moved forward toward the gateway back to the Muggle world. Some of them called:  \"Bye, Harry!\"  \"See you, Potter!\"  \"Still famous,\" said Ron, grinning at him.  \"Not where I'm going, I promise you,\" said Harry.  He, Ron, and Hermione passed through the gateway together. \"There he is, Mom, there he is, look!\"  It was Ginny Weasley, Ron's younger sister, but she wasn't pointing at Ron.  \"Harry Potter!\" she squealed. \"Look, Mom! I can see  \"Be quiet, Ginny, and it's rude to point.\"  Mrs. Weasley smiled down at them.  \"Busy year?\" she said.  \"Very,\" said Harry. \"Thanks for the fudge and the sweater, Mrs. Weasley.\"  \"Oh, it was nothing, dear.\"  \"Ready, are you?\"  It was Uncle Vernon, still purple-faced, still mustached, still looking furious at the nerve of Harry, carrying an owl in a cage in a station full of ordinary people. Behind him stood Aunt Petunia and Dudley, looking terrified at the very sight of Harry.  \"You must be Harry's family!\" said Mrs. Weasley.  \"In a manner of speaking,\" said Uncle Vernon. \"Hurry up, boy, we haven't got all day.\" He walked away.  Harry hung back for a last word with Ron and Hermione.  \"See you over the summer, then.\"  \"Hope you have -- er -- a good holiday,\" said Hermione, looking uncertainly after Uncle Vernon, shocked that anyone could be so unpleasant.  \"Oh, I will,\" said Harry, and they were surprised at the grin that was spreading over his face. \"They don't know we're not allowed to use magic at home. I'm going to have a lot of fun with Dudley this summer....\"  THE END   HARRY POTTER AND THE CHAMBER OF SECRETS by J. K. Rowling  (this is BOOK 2 in the Harry Potter series)  Original Scanned/OCR: Friday, April 07, 2000 v1.0 (edit where needed, change version number by 0.1)   C H A P T E RR  O N E  THE WORST BIRTHDAY  Not for the first time, an argument had broken out over breakfast at number four, Privet Drive. Mr. Vernon Dursley had been woken in the early hours of the morning by a loud, hooting noise from his nephew Harry's room.  \"Third time this week!\" he roared across the table. \"If you can't control that owl, it'll have to go!\"  Harry tried, yet again, to explain.  \"She's bored,\" he said. \"She's used to flying around outside. If I could just let her out at night -\"  \"Do I look stupid?\" snarled Uncle Vernon, a bit of fried egg dangling from his bushy mustache. \"I know what'll happen if that owl's let out.\"  He exchanged dark looks with his wife, Petunia.  Harry tried to argue back but his words were drowned by a long, loud belch from the Dursleys' son, Dudley.  1    \"I want more bacon.\"  \"There's more in the frying pan, sweetums,\" said Aunt Petunia, turning misty eyes on her massive son. \"We must build you up while we've got the chance .... I don't like the sound of that school food ......  \"Nonsense, Petunia, I never went hungry when I was at Smeltings,\" said Uncle Vernon heartily. \"Dudley gets enough, don't you, son?\"  Dudley, who was so large his bottom drooped over either side of the kitchen chair, grinned and turned to Harry."
}