{
  "id": "b965383870e0cf0a181cbbf82a3d039df996f108",
  "text": " It was Dragonstone where she had been born. In her mind’s eye they burned with a thousand lights, a fire blazing in every window. In her mind’s eye, all the doors were red.   My brother will never take back the Seven Kingdoms,  Dany said. She had known that for a long time, she realized. She had known it all her life. Only she had never let herself say the words, even in a whisper, but now she said them for Jorah Mormont and all the world to hear.  Ser Jorah gave her a measuring look.  You think not.    He could not lead an army even if my lord husband gave him one,  Dany said.  He has no coin and the only knight who follows him reviles him as less than a snake. The Dothraki make mock of his weakness. He will never take us home.    Wise child.  The knight smiled.   I am no child,  she told him fiercely. Her heels pressed into the sides of her mount, rousing the silver to a gallop. Faster and faster she raced, leaving Jorah and Irri and the others far behind, the warm wind in her hair and the setting sun red on her face. By the time she reached the khalasar, it was dusk.  The slaves had erected her tent by the shore of a spring-fed pool. She could hear rough voices from the woven grass palace on the hill. Soon there would be laughter, when the men of her khas told the story of what had happened in the grasses today. By the time Viserys came limping back among them, every man, woman, and child in the camp would know him for a walker. There were no secrets in the khalasar.  Dany gave the silver over to the slaves for grooming and entered her tent. It was cool and dim beneath the silk. As she let the door flap close behind her, Dany saw a finger of dusty red light reach out to touch her dragon’s eggs across the tent. For an instant a thousand droplets of scarlet flame swam before her eyes. She blinked, and they were gone.  Stone, she told herself. They are only stone, even Illyrio said so, the dragons are all dead. She put her palm against the black egg, fingers spread gently across the curve of the shell. The stone was warm. Almost hot.  The sun,  Dany whispered.  The sun warmed them as they rode.   She commanded her handmaids to prepare her a bath. Doreah built a fire outside the tent, while Irri and Jhiqui fetched the big copper tub—another bride gift—from the packhorses and carried water from the pool. When the bath was steaming, Irri helped her into it and climbed in after her.   Have you ever seen a dragon?  she asked as Irri scrubbed her back and Jhiqui sluiced sand from her hair. She had heard that the first dragons had come from the east, from the Shadow Lands beyond Asshai and the islands of the Jade Sea. Perhaps some were still living there, in realms strange and wild.   Dragons are gone, Khaleesi,  Irri said.   Dead,  agreed Jhiqui.  Long and long ago.   Viserys had told her that the last Targaryen dragons had died no more than a century and a half ago, during the reign of Aegon III, who was called the Dragonbane. That did not seem so long ago to Dany.  Everywhere?  she said, disappointed.  Even in the east?  Magic had died in the west when the Doom fell on Valyria and the Lands of the Long Summer, and neither spell-forged steel nor stormsingers nor dragons could hold it back, but Dany had always heard that the east was different. It was said that manticores prowled the islands of the Jade Sea, that basilisks infested the jungles of Yi Ti, that spellsingers, warlocks, and aeromancers practiced their arts openly in Asshai, while shadowbinders and bloodmages worked terrible sorceries in the black of night. Why shouldn’t there be dragons too?   No dragon,  Irri said.  Brave men kill them, for dragon terrible evil beasts. It is known.    It is known,  agreed Jhiqui.   A trader from Qarth once told me that dragons came from the moon,  blond Doreah said as she warmed a towel over the fire. Jhiqui and Irri were of an age with Dany, Dothraki girls taken as slaves when Drogo destroyed their father’s khalasar. Doreah was older, almost twenty. Magister Illyrio had found her in a pleasure house in Lys.  Silvery-wet hair tumbled across her eyes as Dany turned her head, curious.  The moon?    He told me the moon was an egg, Khaleesi,  the Lysene girl said.  Once there were two moons in the sky, but one wandered too close to the sun and cracked from the heat. A thousand thousand dragons poured forth, and drank the fire of the sun. That is why dragons breathe flame. One day the other moon will kiss the sun too, and then it will crack and the dragons will return.   The two Dothraki girls giggled and laughed.  You are foolish strawhead slave,  Irri said.  Moon is no egg. Moon is god, woman wife of sun. It is known.    It is known,  Jhiqui agreed.  Dany’s skin was flushed and pink when she climbed from the tub. Jhiqui laid her down to oil her body and scrape the dirt from her pores. Afterward Irri sprinkled her with spiceflower and cinnamon. While Doreah brushed her hair until it shone like spun silver, she thought about the moon, and eggs, and dragons."
}