{
  "id": "c6a8774e5aeddb51e70132de90d67dcf39b9b986",
  "text": "  And Ghost is different. The dogs and the horses won’t go near them.   The rangers exchanged glances; they could see it was true, every man of them. Mormont frowned, glancing from the corpses to the dogs.  Chett, bring the hounds closer.   Chett tried, cursing, yanking on the leashes, giving one animal a lick of his boot. Most of the dogs just whimpered and planted their feet. He tried dragging one. The bitch resisted, growling and squirming as if to escape her collar. Finally she lunged at him. Chett dropped the leash and stumbled backward. The dog leapt over him and bounded off into the trees.   This… this is all wrong,  Sam Tarly said earnestly.  The blood… there’s bloodstains on their clothes, and… and their flesh, dry and hard, but… there’s none on the ground, or… anywhere. With those… those… those…  Sam made himself swallow, took a deep breath.  With those wounds… terrible wounds… there should be blood all over. Shouldn’t there?   Dywen sucked at his wooden teeth.  Might be they didn’t die here. Might be someone brought ’em and left ’em for us. A warning, as like.  The old forester peered down suspiciously.  And might be I’m a fool, but I don’t know that Othor never had no blue eyes afore.   Ser Jaremy looked startled.  Neither did Flowers,  he blurted, turning to stare at the dead man.  A silence fell over the wood. For a moment all they heard was Sam’s heavy breathing and the wet sound of Dywen sucking on his teeth. Jon squatted beside Ghost.   Burn them,  someone whispered. One of the rangers; Jon could not have said who.  Yes, burn them,  a second voice urged.  The Old Bear gave a stubborn shake of his head.  Not yet. I want Maester Aemon to have a look at them. We’ll bring them back to the Wall.   Some commands are more easily given than obeyed. They wrapped the dead men in cloaks, but when Hake and Dywen tried to tie one onto a horse, the animal went mad, screaming and rearing, lashing out with its hooves, even biting at Ketter when he ran to help. The rangers had no better luck with the other garrons; not even the most placid wanted any part of these burdens. In the end they were forced to hack off branches and fashion crude slings to carry the corpses back on foot. It was well past midday by the time they started back.   I will have these woods searched,  Mormont commanded Ser Jaremy as they set out.  Every tree, every rock, every bush, and every foot of muddy ground within ten leagues of here. Use all the men you have, and if you do not have enough, borrow hunters and foresters from the stewards. If Ben and the others are out here, dead or alive, I will have them found. And if there is anyone else in these woods, I will know of it. You are to track them and take them, alive if possible. Is that understood?    It is, my lord,  Ser Jaremy said.  It will be done.   After that, Mormont rode in silence, brooding. Jon followed close behind him; as the Lord Commander’s steward, that was his place. The day was grey, damp, overcast, the sort of day that made you wish for rain. No wind stirred the wood; the air hung humid and heavy, and Jon’s clothes clung to his skin. It was warm. Too warm. The Wall was weeping copiously, had been weeping for days, and sometimes Jon even imagined it was shrinking.  The old men called this weather spirit summer, and said it meant the season was giving up its ghosts at last. After this the cold would come, they warned, and a long summer always meant a long winter. This summer had lasted ten years. Jon had been a babe in arms when it began.  Ghost ran with them for a time and then vanished among the trees. Without the direwolf, Jon felt almost naked. He found himself glancing at every shadow with unease. Unbidden, he thought back on the tales that Old Nan used to tell them, when he was a boy at Winterfell. He could almost hear her voice again, and the click-click-click of her needles. In that darkness, the Others came riding, she used to say, dropping her voice lower and lower. Cold and dead they were, and they hated iron and fire and the touch of the sun, and every living creature with hot blood in its veins. Holdfasts and cities and kingdoms of men all fell before them, as they moved south on pale dead horses, leading hosts of the slain. They fed their dead servants on the flesh of human children…  When he caught his first glimpse of the Wall looming above the tops of an ancient gnarled oak, Jon was vastly relieved. Mormont reined up suddenly and turned in his saddle.  Tarly,  he barked,  come here.   Jon saw the start of fright on Sam’s face as he lumbered up on his mare; doubtless he thought he was in trouble.  You’re fat but you’re not stupid, boy,  the Old Bear said gruffly.  You did well back there. And you, Snow.   Sam blushed a vivid crimson and tripped over his own tongue as he tried to stammer out a courtesy. Jon had to smile.  When they emerged from under the trees, Mormont spurred his tough little garron to a trot. Ghost came streaking out from the woods to meet them, licking his chops, his muzzle red from prey."
}