{
  "id": "c7b57fa834fa714957d0723d72d61126ed82f989",
  "text": "    Woman?  She chuckled.  Is that meant to insult me? I would return the slap, if I took you for a man.  Dany met his stare.  I am Daenerys Stormborn of House Targaryen, the Unburnt, Mother of Dragons, khaleesi to Drogo’s riders, and queen of the Seven Kingdoms of Westeros.    What you are,  said Prendahl na Ghezn,  is a horselord’s whore. When we break you, I will breed you to my stallion.   Strong Belwas drew his arakh.  Strong Belwas will give his ugly tongue to the little queen, if she likes.    No, Belwas. I have given these men my safe conduct.  She smiled.  Tell me this—are the Stormcrows slave or free?    We are a brotherhood of free men,  Sallor declared.   Good.  Dany stood.  Go back and tell your brothers what I said, then. It may be that some of them would sooner sup on gold and glory than on death. I shall want your answer on the morrow.   The Stormcrow captains rose in unison.  Our answer is no,  said Prendahl na Ghezn. His fellows followed him out of the tent… but Daario Naharis glanced back as he left, and inclined his head in polite farewell.  Two hours later the commander of the Second Sons arrived alone. He proved to be a towering Braavosi with pale green eyes and a bushy red-gold beard that reached nearly to his belt. His name was Mero, but he called himself the Titan’s Bastard.  Mero tossed down his wine straightaway, wiped his mouth with the back of his hand, and leered at Dany.  I believe I fucked your twin sister in a pleasure house back home. Or was it you?    I think not. I would remember a man of such magnificence, I have no doubt.    Yes, that is so. No woman has ever forgotten the Titan’s Bastard.  The Braavosi held out his cup to Jhiqui.  What say you take those clothes off and come sit on my lap? If you please me, I might bring the Second Sons over to your side.    If you bring the Second Sons over to my side, I might not have you gelded.   The big man laughed.  Little girl, another woman once tried to geld me with her teeth. She has no teeth now, but my sword is as long and thick as ever. Shall I take it out and show you?    No need. After my eunuchs cut it off, I can examine it at my leisure.  Dany took a sip of wine.  It is true that I am only a young girl, and do not know the ways of war. Explain to me how you propose to defeat ten thousand Unsullied with your five hundred. Innocent as I am, these odds seem poor to me.    The Second Sons have faced worse odds and won.    The Second Sons have faced worse odds and run. At Qohor, when the Three Thousand made their stand. Or do you deny it?    That was many and more years ago, before the Second Sons were led by the Titan’s Bastard.    So it is from you they get their courage?  Dany turned to Ser Jorah.  When the battle is joined, kill this one first.   The exile knight smiled.  Gladly, Your Grace.    Of course,  she said to Mero,  you could run again. We will not stop you. Take your Yunkish gold and go.    Had you ever seen the Titan of Braavos, foolish girl, you would know that it has no tail to turn.    Then stay, and fight for me.    You are worth fighting for, it is true,  the Braavosi said,  and I would gladly let you kiss my sword, if I were free. But I have taken Yunkai’s coin and pledged my holy word.    Coins can be returned,  she said.  I will pay you as much and more. I have other cities to conquer, and a whole kingdom awaiting me half a world away. Serve me faithfully, and the Second Sons need never seek hire again.   The Braavosi tugged on his thick red beard.  As much and more, and perhaps a kiss besides, eh? Or more than a kiss? For a man as magnificent as me?    Perhaps.    I will like the taste of your tongue, I think.   She could sense Ser Jorah’s anger. My black bear does not like this talk of kissing.  Think on what I’ve said tonight. Can I have your answer on the morrow?    You can.  The Titan’s Bastard grinned.  Can I have a flagon of this fine wine to take back to my captains?    You may have a tun. It is from the cellars of the Good Masters of Astapor, and I have wagons full of it.    Then give me a wagon. A token of your good regard.    You have a big thirst.    I am big all over. And I have many brothers. The Titan’s Bastard does not drink alone, Khaleesi.    A wagon it is, if you promise to drink to my health.    Done!  he boomed.  And done, and done! Three toasts we’ll drink you, and bring you an answer when the sun comes up.   But when Mero was gone, Arstan Whitebeard said,  That one has an evil reputation, even in Westeros. Do not be misled by his manner, Your Grace. He will drink three toasts to your health tonight, and rape you on the morrow.    The old man’s right for once,  Ser Jorah said.  The Second Sons are an old company, and not without valor, but under Mero they’ve turned near as bad as the Brave Companions. The man is as dangerous to his employers as to his foes. That’s why you find him out here. None of the Free Cities will hire him any longer.    It is not his reputation that I want, it’s his five hundred horse."
}