{
  "id": "c7ce13896a5d65f4203b15051fcac23f214b2091",
  "text": " I’m done with their city, done with their Kingsguard, done with Lannisters. What’s a dog to do with lions, I ask you?  He reached for his waterskin, took a long pull. As he wiped his mouth, he offered the skin to Arya and said,  The river was the Trident, girl. The Trident, not the Blackwater. Make the map in your head, if you can. On the morrow we should reach the kingsroad. We’ll make good time after that, straight up to the Twins. It’s going to be me who hands you over to that mother of yours. Not the noble lightning lord or that flaming fraud of a priest, the monster.  He grinned at the look on her face.  You think your outlaw friends are the only ones can smell a ransom? Dondarrion took my gold, so I took you. You’re worth twice what they stole from me, I’d say. Maybe even more if I sold you back to the Lannisters like you fear, but I won’t. Even a dog gets tired of being kicked. If this Young Wolf has the wits the gods gave a toad, he’ll make me a lordling and beg me to enter his service. He needs me, though he may not know it yet. Maybe I’ll even kill Gregor for him, he’d like that.    He’ll never take you,  she spat back.  Not you.    Then I’ll take as much gold as I can carry, laugh in his face, and ride off. If he doesn’t take me, he’d be wise to kill me, but he won’t. Too much his father’s son, from what I hear. Fine with me. Either way I win. And so do you, she-wolf. So stop whimpering and snapping at me, I’m sick of it. Keep your mouth shut and do as I tell you, and maybe we’ll even be in time for your uncle’s bloody wedding.       Jon   The mare was blown, but Jon could not let up on her. He had to reach the Wall before the Magnar. He would have slept in the saddle if he’d had one; lacking that, it was hard enough to stay ahorse while awake. His wounded leg grew ever more painful. He dare not rest long enough to let it heal. Instead he ripped it open anew each time he mounted up.  When he crested a rise and saw the brown rutted kingsroad before him wending its way north through hill and plain, he patted the mare’s neck and said,  Now all we need do is follow the road, girl. Soon the Wall.  His leg had gone as stiff as wood by then, and fever had made him so light-headed that twice he found himself riding in the wrong direction.  Soon the Wall. He pictured his friends drinking mulled wine in the common hall. Hobb would be with his kettles, Donal Noye at his forge, Maester Aemon in his rooms beneath the rookery. And the Old Bear? Sam, Grenn, Dolorous Edd, Dywen with his wooden teeth… Jon could only pray that some had escaped the Fist.  Ygritte was much in his thoughts as well. He remembered the smell of her hair, the warmth of her body… and the look on her face as she slit the old man’s throat. You were wrong to love her, a voice whispered. You were wrong to leave her, a different voice insisted. He wondered if his father had been torn the same way, when he’d left Jon’s mother to return to Lady Catelyn. He was pledged to Lady Stark, and I am pledged to the Night’s Watch.  He almost rode through Mole’s Town, so feverish that he did not know where he was. Most of the village was hidden underground, only a handful of small hovels to be seen by the light of the waning moon. The brothel was a shed no bigger than a privy, its red lantern creaking in the wind, a bloodshot eye peering through the blackness. Jon dismounted at the adjoining stable, half-stumbling from the mare’s back as he shouted two boys awake.  I need a fresh mount, with saddle and bridle,  he told them, in a tone that brooked no argument. They brought him that; a skin of wine as well, and half a loaf of brown bread.  Wake the village,  he told them.  Warn them. There are wildlings south of the Wall. Gather your goods and make for Castle Black.  He pulled himself onto the black gelding they’d given him, gritting his teeth at the pain in his leg, and rode hard for the north.  As the stars began to fade in the eastern sky, the Wall appeared before him, rising above the trees and the morning mists. Moonlight glimmered pale against the ice. He urged the gelding on, following the muddy slick road until he saw the stone towers and timbered halls of Castle Black huddled like broken toys beneath the great cliff of ice. By then the Wall glowed pink and purple with the first light of dawn.  No sentries challenged him as he rode past the outbuildings. No one came forth to bar his way. Castle Black seemed as much a ruin as Greyguard. Brown brittle weeds grew between cracks in the stones of the courtyards. Old snow covered the roof of the Flint Barracks and lay in drifts against the north side of Hardin’s Tower, where Jon used to sleep before being made the Old Bear’s steward. Fingers of soot streaked the Lord Commander’s Tower where the smoke had boiled from the windows. Mormont had moved to the King’s Tower after the fire, but Jon saw no lights there either. From the ground he could not tell if there were sentries walking the Wall seven hundred feet above, but he saw no one on the huge switchback stair that climbed the south face of the ice like some great wooden thunderbolt."
}