{
  "id": "c8b091c95ac36d9a0b7440d0277faccb28e2d341",
  "text": "   And a longer fall,  said Qhorin Halfhand.  Two men, I think. There are like to be two up there, sharing the watch.    Me.  The ranger they called Stonesnake had already shown that he was the best climber among them. It would have to be him.   And me,  said Jon Snow.  Qhorin Halfhand looked at him. Jon could hear the wind keening as it shivered through the high pass above them. One of the garrons whickered and pawed at the thin stony soil of the hollow where they had taken shelter.  The wolf will remain with us,  Qhorin said.  White fur is seen too easily by moonlight.  He turned to Stonesnake.  When it’s done, throw down a burning brand. We’ll come when we see it fall.    No better time to start than now,  said Stonesnake.  They each took a long coil of rope. Stonesnake carried a bag of iron spikes as well, and a small hammer with its head wrapped in thick felt. Their garrons they left behind, along with their helms, mail, and Ghost. Jon knelt and let the direwolf nuzzle him before they set off.  Stay,  he commanded.  I’ll be back for you.   Stonesnake took the lead. He was a short wiry man, near fifty and grey of beard but stronger than he seemed, and he had the best night eyes of anyone Jon had ever known. He needed them tonight. By day the mountains were blue-grey, brushed with frost, but once the sun vanished behind the jagged peaks they turned black. Now the rising moon had linmed them in white and silver.  The black brothers moved through black shadows amidst black rocks, working their way up a steep, twisting trail as their breath frosted in the black air. Jon felt almost naked without his mail, but he did not miss its weight. This was hard going, and slow. To hurry here was to risk a broken ankle or worse. Stonesnake seemed to know where to put his feet as if by instinct, but Jon needed to be more careful on the broken, uneven ground.  The Skirling Pass was really a series of passes, a long twisting course that went up around a succession of icy wind-carved peaks and down through hidden valleys that seldom saw the sun. Apart from his companions, Jon had glimpsed no living man since they’d left the wood behind and begun to make their way upward. The Frostfangs were as cruel as any place the gods had made, and as inimical to men. The wind cut like a knife up here, and shrilled in the night like a mother mourning her slain children. What few trees they saw were stunted, grotesque things growing sideways out of cracks and fissures. Tumbled shelves of rock often overhung the trail, fringed with hanging icicles that looked like long white teeth from a distance.  Yet even so, Jon Snow was not sorry he had come. There were wonders here as well. He had seen sunlight flashing on icy thin waterfalls as they plunged over the lips of sheer stone cliffs, and a mountain meadow full of autumn wildflowers, blue coldsnaps and bright scarlet frostfires and stands of piper’s grass in russet and gold. He had peered down ravines so deep and black they seemed certain to end in some hell, and he had ridden his garron over a wind-eaten bridge of natural stone with nothing but sky to either side. Eagles nested in the heights and came down to hunt the valleys, circling effortlessly on great blue-grey wings that seemed almost part of the sky. Once he had watched a shadowcat stalk a ram, flowing down the mountainside like liquid smoke until it was ready to pounce.  Now it is our turn to pounce. He wished he could move as sure and silent as that shadowcat, and kill as quickly. Longclaw was sheathed across his back, but he might not have room to use it. He carried dirk and dagger for closer work. They will have weapons as well, and I am not armored. He wondered who would prove the shadowcat by night’s end, and who the ram.  For a long way they stayed to the trail, following its twists and turns as it snaked along the side of the mountain, upward, ever upward. Sometimes the mountain folded back on itself and they lost sight of the fire, but soon or late it would always reappear. The path Stonesnake chose would never have served for the horses. In places Jon had to put his back to the cold stone and shuffle along sideways like a crab, inch by inch. Even where the track widened it was treacherous; there were cracks big enough to swallow a man’s leg, rubble to stumble over, hollow places where the water pooled by day and froze hard by night. One step and then another, Jon told himself. One step and then another, and I will not fall.  He had not shaved since leaving the Fist of the First Men, and the hair on his lip was soon stiff with frost. Two hours into the climb, the wind kicked up so fiercely that it was all he could do to hunch down and cling to the rock, praying he would not be blown off the mountain. One step and then another, he resumed when the gale subsided. One step and then another, and I will not fall.  Soon they were high enough so that looking down was best not considered. There was nothing below but yawning blackness, nothing above but moon and stars."
}