{
  "id": "ca980ab1a892b30ec5e9c9528977ee603d7f678a",
  "text": " In seconds, he had managed to fling one leg over Buckbeak's back and pull himself onto the hippogriff behind Hermione.  \"Okay, Buckbeak, up!\" said Harry, shaking the rope. \"Up to the tower -- come on.  The hippogriff gave one sweep of its mighty wings and they were soaring upward again, high as the top of the West Tower. Buckbeak landed with a clatter on the battlements, and Harry and Hermione slid off him at once.  \"Sirius, you'd better go, quick,\" Harry panted. \"They'll reach Flitwick's office any moment, they'll find out you're gone.\"  Buckbeak pawed the ground, tossing his sharp head.  \"What happened to the other boy? Ron?\" croaked Sirius.  \"He's going to be okay. He's still out of it, but Madam Pomfrey says she'll be able to make him better. Quick -- go --\"  But Black was still staring down at Harry.  \"How can I ever thank --\"  \"GO!\" Harry and Hermione shouted together.  Black wheeled Buckbeak around, facing the open sky.  \"We'll see each other again,\" he said. \"You are -- truly your father's son, Harry....\"  He squeezed Buckbeak's sides with his heels. Harry and Hermione jumped back as the enormous wings rose once more.... The hippogriff took off into the air.... He and his rider became smaller and smaller as Harry gazed after them... then a cloud drifted across the moon.... They were gone.  CHAPTER TWENTY-TWO  OWL POST AGAIN  Harry!\"  Hermione was tugging at his sleeve, staring at her watch. \"We've got exactly ten minutes to get back down to the hospital wing without anybody seeing us -- before Dumbledore locks the door --\"  \"Okay,\" said Harry, wrenching his gaze from the sky, \"let's go....\"  They slipped through the doorway behind them and down a tightly spiraling stone staircase. As they reached the bottom of it, they heard voices. They flattened themselves against the wall and listened. It sounded like Fudge and Snape. They were walking quickly along the corridor at the foot of the staircase.  \"... only hope Dumbledore's not going to make difficulties,\" Snape was saying. \"The Kiss will be performed immediately?\"  \"As soon as Macnair returns with the dementors. This whole Black affair has been highly embarrassing. I can't tell you how much I'm looking forward to informing the Daily Prophet that we've got him at last.... I daresay they'll want to interview you, Snape... and once young Harry's back in his right mind, I expect he'll want to tell the Prophet exactly how you saved him....\"  Harry clenched his teeth. He caught a glimpse of Snape's smirk as he and Fudge passed Harry and Hermione's hiding place. Their footsteps died away. Harry and Hermione waited a few moments to make sure they'd really gone, then started to run in the opposite direction. Down one staircase, then another, along a new ,corridor -- then they heard a cackling ahead.  \"Peeves!\" Harry muttered, grabbing Hermione's wrist. \"In here!\"  They tore into a deserted classroom to their left just in time. Peeves seemed to be bouncing along the corridor in boisterous good spirits, laughing his head off.  \"Oh, he's horrible,\" whispered Hermione, her ear to the door. \"I bet he's all excited because the dementors are going to finish off Sirius....\" She checked her watch. \"Three minutes, Harry!\"  They waited until Peeves's gloating voice had faded into the distance, then slid back out of the room and broke into a run again.  \"Hermione -- what'll happen -- if we don't get back inside before Dumbledore locks the door?\" Harry panted.  I don't want to think about it!\" Hermione moaned, checking her watch again. \"One minute!\"  They had reached the end of the corridor with the hospital wing entrance. \"Okay -- I can hear Dumbledore,\" said Hermione tensely. \"Come on, Harry!\"  They crept along the corridor. The door opened. Dumbledore's back appeared.  \"I am going to lock you in,\" they heard him saying. \"it is five minutes to midnight. Miss Granger, three turns should do It. Good luck.\"  Dumbledore backed out of the room, closed the door, and took out his wand to magically lock it. Panicking, Harry and Hermione ran forward. Dumbledore looked up, and a wide smile appeared under the long silver mustache. \"Well?\" he said quietly.  \"We did it!\" said Harry breathlessly. \"Sirius has gone, on Buckbeak....\"  Dumbledore beamed at them.  \"Well done. I think --\" He listened intently for any sound within the hospital wing. \"Yes, I think you've gone too -- get inside -- I'll lock you in --\"  Harry and Hermione slipped back inside the dormitory. It was empty except for Ron, who was still lying motionless in the end bed. As the lock clicked behind them, Harry and Hermione crept back to their own beds, Hermione tucking the Time-Turner back under her robes. A moment later, Madam Pomfrey came striding back out of her office.  \"Did I hear the headmaster leaving? Am I allowed to look after my patients now?\"  She was in a very bad mood. Harry and Hermione thought it best to accept their chocolate quietly. Madam Pomfrey stood over them, making sure they ate it. But Harry could hardly swallow."
}