{
  "id": "cb5819bc5e40b245c7f487ccb87e4ec8e6342ec3",
  "text": " This Ser Cleos Frey was a son of the Lady Genna who was sister to Lord Tywin Lannister, but he had none of the fabled Lannister beauty, the fair hair and green eyes. Instead he had inherited the stringy brown locks, weak chin, and thin face of his sire, Ser Emmon Frey, old Lord Walder’s second son. His eyes were pale and watery and he could not seem to stop blinking, but perhaps that was only the light. The cells below Riverrun were dark and damp… and these days crowded as well.   Rise, Ser Cleos.  Her son’s voice was not as icy as his father’s would have been, but he did not sound a boy of fifteen either. War had made a man of him before his time. Morning light glimmered faintly against the edge of the steel across his knees.  Yet it was not the sword that made Ser Cleos Frey anxious; it was the beast. Grey Wind, her son had named him. A direwolf large as any elkhound, lean and smoke-dark, with eyes like molten gold. When the beast padded forward and sniffed at the captive knight, every man in that hall could smell the scent of fear. Ser Cleos had been taken during the battle in the Whispering Wood, where Grey Wind had ripped out the throats of half a dozen men.  The knight scrambled up, edging away with such alacrity that some of the watchers laughed aloud.  Thank you, my lord.    Your Grace,  barked Lord Umber, the Greatjon, ever the loudest of Robb’s northern bannermen… and the truest and fiercest as well, or so he insisted. He had been the first to proclaim her son King in the North, and he would brook no slight to the honor of his new-made sovereign.   Your Grace,  Ser Cleos corrected hastily.  Pardons.   He is not a bold man, this one, Catelyn thought. More of a Frey than a Lannister, in truth. His cousin the Kingslayer would have been a much different matter. They would never have gotten that honorific through Ser Jaime Lannister’s perfect teeth.   I brought you from your cell to carry my message to your cousin Cersei Lannister in King’s Landing. You’ll travel under a peace banner, with thirty of my best men to escort you.   Ser Cleos was visibly relieved.  Then I should be most glad to bring His Grace’s message to the queen.    Understand,  Robb said,  I am not giving you your freedom. Your grandfather Lord Walder pledged me his support and that of House Frey. Many of your cousins and uncles rode with us in the Whispering Wood, but you chose to fight beneath the lion banner. That makes you a Lannister, not a Frey. I want your pledge, on your honor as a knight, that after you deliver my message you’ll return with the queen’s reply, and resume your captivity.   Ser Cleos answered at once.  I do so vow.    Every man in this hall has heard you,  warned Catelyn’s brother Ser Edmure Tully, who spoke for Riverrun and the lords of the Trident in the place of their dying father.  If you do not return, the whole realm will know you forsworn.    I will do as I pledged,  Ser Cleos replied stiffly.  What is this message?     An offer of peace.  Robb stood, longsword in hand. Grey Wind moved to his side. The hall grew hushed.  Tell the Queen Regent that if she meets my terms, I will sheath this sword, and make an end to the war between us.   In the back of the hall, Catelyn glimpsed the tall, gaunt figure of Lord Rickard Karstark shove through a rank of guards and out the door. No one else moved. Robb paid the disruption no mind.  Olyvar, the paper,  he commanded. The squire took his longsword and handed up a rolled parchment.  Robb unrolled it.  First, the queen must release my sisters and provide them with transport by sea from King’s Landing to White Harbor. It is to be understood that Sansa’s betrothal to Joffrey Baratheon is at an end. When I receive word from my castellan that my sisters have returned unharmed to Winterfell, I will release the queen’s cousins, the squire Willem Lannister and your brother Tion Frey, and give them safe escort to Casterly Rock or wheresoever she desires them delivered.   Catelyn Stark wished she could read the thoughts that hid behind each face, each furrowed brow and pair of tightened lips.   Secondly, my lord father’s bones will be returned to us, so he may rest beside his brother and sister in the crypts beneath Winterfell, as he would have wished. The remains of the men of his household guard who died in his service at King’s Landing must also be returned.   Living men had gone south, and cold bones would return. Ned had the truth of it, she thought. His place was at Winterfell, he said as much, but would I hear him? No. Go, I told him, you must be Robert’s Hand, for the good of our House, for the sake of our children… my doing, mine, no other…   Third, my father’s greatsword Ice will be delivered to my hand, here at Riverrun.   She watched her brother Ser Edmure Tully as he stood with his thumbs hooked over his swordbelt, his face as still as stone.   Fourth, the queen will command her father Lord Tywin to release those knights and lords bannermen of mine that he took captive in the battle on the Green Fork of the Trident."
}