{
  "id": "cd17264da8ff90bdbb3df5c187a7cf66f8ea3b9c",
  "text": "       Sam  felt that he  could sit like that in endless happiness; but it was  not allowed. It was not  enough for him to find his master, he  had still to  try and save him. He kissed Frodo's forehead. `Come!  Wake up Mr. Frodo!' he  said, trying to sound as cheerful  as he had when  he drew back the curtains  at Bag End on a summer's morning.       Frodo sighed and sat up. `Where are we? How did I get here?' he asked.       'There's no time for tales till we get somewhere else, Mr. Frodo,' said  Sam. `But you're in the top of that tower you and me saw from away  down  by  the tunnel before the orcs got you. How long ago that wa s I don't know. More  than a day, I guess.'       `Only that?' said  Frodo. `It seems weeks. You  must  tell me all about  it,  if  we get  a  chance. Something  hit me, didn't  it?  And I fell  into  darkness and foul dreams,  and  woke and found that  waking was worse.  Orcs  were all round me. I think they had just been  pouring some horrible burning   drink  down my throat. My head grew clear, but I was  aching and weary. They  stripped me of everything; and then two great brutes came and questioned me,  questioned  me until I thought I should go mad, standing  over me, gloating,   fingering their knives. I'll never forget their claws and eyes.'       `You won't,  if you talk about them, Mr.  Frodo,' said Sam.  'And if we  don't want to see them  again, the sooner we   get going  the better. Can you   walk?'       `Yes,  I can walk,' said Frodo, getting up slowly. 'I am not hurt  Sam.  Only  I feel very tired, and I've a pain here.' He put  his hand to the back   of his neck above his left shoulder. He stood up, and it looked to Sam as if  he was clothed in flame: his naked skin was scarlet in the light of the lamp  above. Twice he paced across the floor.       `That's better!' he said,  his spirits rising a  little. `I didn't dare  to move when I was left alone, or  one of the guards came. Until the yelling  and fighting began. The two big  brutes:  they quarrelled, I think. Over  me  and my  things. I lay  here  terrified. And then all  went deadly quiet, and  that was worse.'       `Yes, they  quarrelled, seemingly,'  said Sam. (There must  have been a   couple  of  hundred of the dirty creatures  in  this place.  A bit of a tall  order for Sam Gamgee, as  you might say. But they've done all the killing of  themselves. That's lucky, but it's too long to make a song about, till we're   ####-out of  here. Now what's to be done? You can't go walking  in the Black Land  in naught but your skin, Mr. Frodo.'       `They've  taken everything, Sam,' said Frodo. `Everything I had. Do you   understand?  Everything!'  He cowered on the floor again with bowed head, as  his own words brought home to  him the fullness of the disaster, and despair   overwhelmed him.  'The quest  has failed Sam. Even if we get out of here, we  can't escape. Only  Elves  can escape. Away,  away out  of Middle-earth, far   away over the Sea. If even that is wide enough to keep the Shadow out.'       `No,  not everything, Mr. Frodo. And it  hasn't failed, not yet. I took   it, Mr. Frodo, begging your pardon.  And I've kept  it safe.  It's round  my  neck  now, and a terrible  burden it is, too.'  Sam fumbled for the Ring and  its chain. `But I suppose you must take it back.' Now it had come to it, Sam  felt reluctant to give up the Ring and burden his master with it again.       `You've  got it?' gasped  Frodo. `You've  got  it  here? Sam, you're  a   marvel!'  Then quickly and strangely his tone changed. `Give it to  me!'  he  cried, standing up, holding out  a trembling hand. `Give it  me at once! You   can't have it!'       'All right, Mr. Frodo,' said Sam, rather startled. 'Here it is!' Slowly  he drew the Ring out and passed the chain over his head.  `But you're in the  land of Mordor now, sir; and when you get out, you'll see the Fiery Mountain  and all. You'll find the Ring very dangerous now, and very hard to bear.  If  it's too hard a job, I could share it with you, maybe?'       `No, no!'  cried Frodo, snatching the  Ring and chain from Sam's hands.   `No you won't,  you thief!'  He panted, staring at Sam  with eyes wide  with  fear and enmity. Then  suddenly, clasping the Ring in one clenched  fist, he  stood aghast. A mist seemed  to  clear from his eyes, and  he passed a  hand  over  his  aching brow. The hideous vision had  seemed so real to  him, half  bemused as he was still with wound and fear. Sam had changed before his very  eyes  into an orc again, leering and pawing  at his  treasure, a foul little  creature with  greedy  eyes  and  slobbering  mouth. But  now the vision had  passed.  There was Sam kneeling before him, his face wrung with pain,  as if  he had been stabbed in the heart; tears welled from his eyes.       'O Sam!' cried Frodo. `What have I said? What have I done? Forgive  me!  After all you have done. It is the horrible power of the Ring. I wish it had  never, never, been found."
}