{
  "id": "ce1806837c7ec6d017177b10b75f70aca1cbdeb2",
  "text": " Through Jeor Mormont we have had nine hundred and ninety-seven Lords Commander in unbroken succession, each chosen by the men he would lead, a tradition many thousands of years old.   Stannis ground his teeth.  It is not my wish to tamper with your rights and traditions. As to royal guidance, Janos, if you mean that I ought to tell your brothers to choose you, have the courage to say so.   That took Lord Janos aback. He smiled uncertainly and began to sweat, but Bowen Marsh beside him said,  Who better to command the black cloaks than a man who once commanded the gold, sire?    Any of you, I would think. Even the cook.  The look the king gave Slynt was cold.  Janos was hardly the first gold cloak ever to take a bribe, I grant you, but he may have been the first commander to fatten his purse by selling places and promotions. By the end he must have had half the officers in the City Watch paying him part of their wages. Isn’t that so, Janos?   Slynt’s neck was purpling.  Lies, all lies! A strong man makes enemies, Your Grace knows that, they whisper lies behind your back. Naught was ever proven, not a man came forward…    Two men who were prepared to come forward died suddenly on their rounds.  Stannis narrowed his eyes.  Do not trifle with me, my lord. I saw the proof Jon Arryn laid before the small council. If I had been king you would have lost more than your office, I promise you, but Robert shrugged away your little lapses. ‘They all steal,’ I recall him saying. ‘Better a thief we know than one we don’t, the next man might be worse.’ Lord Petyr’s words in my brother’s mouth, I’ll warrant. Littlefinger had a nose for gold, and I’m certain he arranged matters so the crown profited as much from your corruption as you did yourself.   Lord Slynt’s jowls were quivering, but before he could frame a further protest Maester Aemon said,  Your Grace, by law a man’s past crimes and transgressions are wiped clean when he says his words and becomes a Sworn Brother of the Night’s Watch.    I am aware of that. If it happens that Lord Janos here is the best the Night’s Watch can offer, I shall grit my teeth and choke him down. It is naught to me which man of you is chosen, so long as you make a choice. We have a war to fight.    Your Grace,  said Ser Denys Mallister, in tones of wary courtesy.  If you are speaking of the wildlings…    I am not. And you know that, ser.    And you must know that whilst we are thankful for the aid you rendered us against Mance Rayder, we can offer you no help in your contest for the throne. The Night’s Watch takes no part in the wars of the Seven Kingdoms. For eight thousand years—    I know your history, Ser Denys,  the king said brusquely.  I give you my word, I shall not ask you to lift your swords against any of the rebels and usurpers who plague me. I do expect that you will continue to defend the Wall as you always have.    We’ll defend the Wall to the last man,  said Cotter Pyke.   Probably me,  said Dolorous Edd, in a resigned tone.  Stannis crossed his arms.  I shall require a few other things from you as well. Things that you may not be so quick to give. I want your castles. And I want the Gift.   Those blunt words burst among the black brothers like a pot of wildfire tossed onto a brazier. Marsh, Mallister, and Pyke all tried to speak at once. King Stannis let them talk. When they were done, he said,  I have three times the men you do. I can take the lands if I wish, but I would prefer to do this legally, with your consent.    The Gift was given to the Night’s Watch in perpetuity, Your Grace,  Bowen Marsh insisted.   Which means it cannot be lawfully seized, attainted, or taken from you. But what was given once can be given again.    What will you do with the Gift?  demanded Cotter Pyke.   Make better use of it than you have. As to the castles, Eastwatch, Castle Black, and the Shadow Tower shall remain yours. Garrison them as you always have, but I must take the others for my garrisons if we are to hold the Wall.    You do not have the men,  objected Bowen Marsh.   Some of the abandoned castles are scarce more than ruins,  said Othell Yarwyck, the First Builder.   Ruins can be rebuilt.    Rebuilt?  Yarwyck said.  But who will do the work?    That is my concern. I shall require a list from you, detailing the present state of every castle and what might be required to restore it. I mean to have them all garrisoned again within the year, and nightfires burning before their gates.    Nightfires?  Bowen Marsh gave Melisandre an uncertain look.  We’re to light nightfires now?    You are.  The woman rose in a swirl of scarlet silk, her long copper-bright hair tumbling about her shoulders.  Swords alone cannot hold this darkness back. Only the light of the Lord can do that. Make no mistake, good sers and valiant brothers, the war we’ve come to fight is no petty squabble over lands and honors. Ours is a war for life itself, and should we fail the world dies with us.   The officers did not know how to take that, Sam could see."
}