{
  "id": "d67e71fc71e03c10125da4fe01b066725189a587",
  "text": "  \"He didn'!\" he growled at Hermione.  \"He did,\" she said. \"But I don't know what it means. I could tell it was really rude, of course -\"  \"It's about the most insulting thing he could think of,\" gasped Ron, coming back up. \"Mudblood's a really foul name for someone who is Muggle-born - you know, non-magic parents. There are  *115*  some wizards - like Malfoy's family - who think they're better than everyone else because they're what people call pure-blood.\" He gave a small burp, and a single slug fell into his outstretched hand. He threw it into the basin and continued, \"I mean, the rest of us know it doesn't make any difference at all. Look at Neville Longbottom - he's pure-blood and he can hardly stand a cauldron the right way up.\"  \"An' they haven't invented a spell our Hermione can' do,\" said Hagrid proudly, making Hermione go a brilliant shade of magenta.  \"It's a disgusting thing to call someone,\" said Ron, wiping his sweaty brow with a shaking hand. \"Dirty blood, see. Common blood. It's ridiculous. Most wizards these days are half-blood anyway. If we hadn't married Muggles we'd've died out.\"  He retched and ducked out of sight again.  \"Well, I don' blame yeh fer tryin' ter curse him, Ron,\" said Hagrid loudly over the thuds of more slugs hitting the basin. \"Bu' maybe it was a good thing yer wand backfired. 'Spect Lucius Malfoy would've come marchin' up ter school if yeh'd cursed his son. Least yer not in trouble.\"  Harry would have pointed out that trouble didn't come much worse than having slugs pouring out of your mouth, but he couldn't; Hagrid's treacle fudge had cemented his jaws together.  \"Harry,\" said Hagrid abruptly as though struck by a sudden thought. \"Gotta bone ter pick with yeh. I've heard you've bin givin' out signed photos. How come I haven't got one?\"  Furious, Harry wrenched his teeth apart.  \"I have not been giving out signed photos,\" he said hotly. \"If Lockhart's still spreading that around -\"  *116*  But then he saw that Hagrid was laughing.  \"I'm on'y jokin',\" he said, patting Harry genially on the back and sending him face first into the table. \"I knew yeh hadn't really. I told Lockhart yeh didn' need teh. Yer more famous than him without tryin'.\"  \"Bet he didn't like that,\" said Harry, sitting up and rubbing his chin.  \"Don' think he did,\" said Hagrid, his eyes twinkling. \"An' then I told him Id never read one o' his books an' he decided ter go. Treacle fudge, Ron?\" he added as Ron reappeared.  \"No thanks,\" said Ron weakly. \"Better not risk it.\"  \"Come an' see what I've bin growin',\" said Hagrid as Harry and Hermione finished the last of their tea.  In the small vegetable patch behind Hagrid's house were a dozen of the largest pumpkins Harry had ever seen. Each was the size of a large boulder.  \"Gettin' on well, aren't they?\" said Hagrid happily. \"Fer the Halloween feast ... should be big enough by then.\"  \"What've you been feeding them?\" said Harry.  Hagrid looked over his shoulder to check that they were alone.  \"Well, I've bin givin' them - you know - a bit o' help -\"  Harry noticed Hagrid's flowery pink umbrella leaning against the back wall of the cabin. Harry had had reason to believe before now that this umbrella was not all it looked; in fact, he had the strong impression that Hagrid's old school wand was concealed inside it. Hagrid wasn't supposed to use magic. He had been expelled from Hogwarts in his third year, but Harry had never found out why -any mention of the matter and Hagrid would clear his  *117*  throat loudly and become mysteriously deaf until the subject was changed.  \"An Engorgement Charm, I suppose?\" said Hermione, halfway between disapproval and amusement. \"Well, you've done a good job on them.\"  \"That's what yer little sister said,\" said Hagrid, nodding at Ron. \"Met her jus' yesterday.\" Hagrid looked sideways at Harry, his beard twitching. \"Said she was jus' lookin' round the grounds, but I reckon she was hopin' she might run inter someone else at my house.\" He winked at Harry. \"If yeh ask me, she wouldn' say no ter a signed -\"  \"Oh, shut up,\" said Harry. Ron snorted with laughter and the ground was sprayed with slugs.  \"Watch it!\" Hagrid roared, pulling Ron away from his precious pumpkins.  It was nearly lunchtime and as Harry had only had one bit of treacle fudge since dawn, he was keen to go back to school to eat. They said good-bye to Hagrid and walked back up to the castle, Ron hiccoughing occasionally, but only bringing up two very small slugs.  They had barely set foot in the cool entrance hall when a voice rang out, \"There you are, Potter - Weasley.\" Professor McGonagall was walking toward them, looking stern. \"You will both do your detentions this evening.\"  \"What're we doing, Professor?\" said Ron, nervously suppressing a burp.  \"You will be polishing the silver in the trophy room with Mr. Filch,\" said Professor McGonagall. \"And no magic, Weasley - elbow grease.\"  *118*  Ron gulped. Argus Filch, the caretaker, was loathed by every student in the school."
}