{
  "id": "d798492cf9fce2624cc50dce0c229b72e31a4c7f",
  "text": "   The Old Bear’s raven,  Small Paul said.  if we kill him, who’s going to feed his bird?    Who bloody well cares? Kill the bird too if you like.    I don’t want to hurt no bird,  the big man said.  But that’s a talking bird. What if it tells what we did?   Lark the Sisterman laughed.  Small Paul, thick as a castle wall,  he mocked.   You shut up with that,  said Small Paul dangerously.   Paul,  said Chett, before the big man got too angry,  when they find the old man lying in a pool of blood with his throat slit, they won’t need no bird to tell them someone killed him.   Small Paul chewed on that a moment.  That’s true,  he allowed.  Can I keep the bird, then? I like that bird.    He’s yours,  said Chett, just to shut him up.   We can always eat him if we get hungry,  offered Lark.  Small Paul clouded up again.  Best not try and eat my bird, Lark. Best not.   Chett could hear voices drifting through the trees.  Close your bloody mouths, both of you. We’re almost to the Fist.   They emerged near the west face of the hill, and walked around south where the slope was gentler. Near the edge of the forest a dozen men were taking archery practice. They had carved outlines on the trunks of trees, and were loosing shafts at them.  Look,  said Lark.  A pig with a bow.   Sure enough, the nearest bowman was Ser Piggy himself, the fat boy who had stolen his place with Maester Aemon. Just the sight of Samwell Tarly filled him with anger. Stewarding for Maester Aemon had been as good a life as he’d ever known. The old blind man was undemanding, and Clydas had taken care of most of his wants anyway. Chett’s duties were easy: cleaning the rookery, a few fires to build, a few meals to fetch… And Aemon never once hit him. Thinks he can just walk in and shove me out, on account of being highborn and knowing how to read. Might be I’ll ask him to read my knife before I open his throat with it.  You go on,  he told the others,  I want to watch this.  The dogs were pulling, anxious to go with them, to the food they thought would be waiting at the top. Chett kicked the bitch with the toe of his boot, and that settled them down some.  He watched from the trees as the fat boy wrestled with a longbow as tall as he was, his red moon face screwed up with concentration. Three arrows stood in the ground before him. Tarly nocked and drew, held the draw a long moment as he tried to aim, and let fly. The shaft vanished into the greenery. Chett laughed loudly, a snort of sweet disgust.   We’ll never find that one, and I’ll be blamed,  announced Edd Tollett, the dour grey-haired squire everyone called Dolorous Edd.  Nothing ever goes missing that they don’t look at me, ever since that time I lost my horse. As if that could be helped. He was white and it was snowing, what did they expect?    The wind took that one,  said Grenn, another friend of Lord Snow’s.  Try to hold the bow steady, Sam.    It’s heavy,  the fat boy complained, but he pulled the second arrow all the same. This one went high, sailing through the branches ten feet above the target.   I believe you knocked a leaf off that tree,  said Dolorous Edd.  Fall is falling fast enough, there’s no need to help it.  He sighed.  And we all know what follows fall. Gods, but I am cold. Shoot the last arrow, Samwell, I believe my tongue is freezing to the roof of my mouth.   Ser Piggy lowered the bow, and Chett thought he was going to start bawling.  It’s too hard.    Notch, draw, and loose,  said Grenn.  Go on.   Dutifully, the fat boy plucked his final arrow from the earth, notched it to his longbow, drew, and released. He did it quickly, without squinting along the shaft painstakingly as he had the first two times. The arrow struck the charcoal outline low in the chest and hung quivering.  I hit him.  Ser Piggy sounded shocked.  Grenn, did you see? Edd, look, I hit him!    Put it between his ribs, I’d say,  said Grenn.   Did I kill him?  the fat boy wanted to know.  Tollett shrugged.  Might have punctured a lung, if he had a lung. Most trees don’t, as a rule.  He took the bow from Sam’s hand.  I’ve seen worse shots, though. Aye, and made a few.   Ser Piggy was beaming. To look at him you’d think he’d actually done something. But when he saw Chett and the dogs, his smile curled up and died squeaking.   You hit a tree,  Chett said.  Let’s see how you shoot when it’s Mance Rayder’s lads. They won’t stand there with their arms out and their leaves rustling, oh no. They’ll come right at you, screaming in your face, and I bet you’ll piss those breeches. One o’ them will plant his axe right between those little pig eyes. The last thing you’ll hear will be the thunk it makes when it bites into your skull.   The fat boy was shaking. Dolorous Edd put a hand on his shoulder.  Brother,  he said solemnly,  just because it happened that way for you doesn’t mean Samwell will suffer the same.    What are you talking about, Tollett?    The axe that split your skull. Is it true that half your wits leaked out on the ground and your dogs ate them?   The big lout Grenn laughed, and even Samwell Tarly managed a weak little smile."
}