{
  "id": "daf3f42b36092abb2bb96df78511625ec78a2f93",
  "text": " He’ll be a long time dying, though.   The boy didn’t seemed to hear him.  I came for the girls,  he whimpered.  …make me a man, Polly said… oh, gods, please, take me to a castle… a maester, take me to a maester, my father’s got gold… it was only for the girls… mercy, ser.   The Hound gave him a crack across the face that made him scream again.  Don’t call me ser.  He turned back to Arya.  This one is yours, she-wolf. You do it.   She knew what he meant. Arya went to Polliver and knelt in his blood long enough to undo his swordbelt. Hanging beside his dagger was a slimmer blade, too long to be a dirk, too short to be a man’s sword… but it felt just right in her hand.   You remember where the heart is?  the Hound asked.  She nodded. The squire rolled his eyes.  Mercy.   Needle slipped between his ribs and gave it to him.   Good.  Sandor’s voice was thick with pain.  If these three were whoring here, Gregor must hold the ford as well as Harrenhal. More of his pets could ride up any moment, and we’ve killed enough of the bloody buggers for one day.    Where will we go?  she asked.   Saltpans.  He put a big hand on her shoulder to keep from falling.  Get some wine, she-wolf. And take whatever coin they have as well, we’ll need it. If there’s ships at Saltpans, we can reach the Vale by sea.  His mouth twitched at her, as more blood ran down from where his ear had been.  Maybe Lady Lysa will marry you to her little Robert. There’s a match I’d like to see.  He started to laugh, then groaned instead.  When the time came to leave, he needed Arya’s help to get back up on Stranger. He had tied a strip of cloth about his neck and another around his thigh, and taken the squire’s cloak off its peg by the door. The cloak was green, with a green arrow on a white bend, but when the Hound wadded it up and pressed it to his ear it soon turned red. Arya was afraid he would collapse the moment they set out, but somehow he stayed in the saddle.  They could not risk meeting whoever held the ruby ford, so instead of following the kingsroad they angled south by east, through weedy fields, woods, and marshes. It was hours before they reached the banks of the Trident. The river had returned meekly to its accustomed channel, Arya saw, all its wet brown rage vanished with the rains. It’s tired too, she thought.  Close by the water’s edge, they found some willows rising from a jumble of weathered rocks. Together the rocks and trees formed a sort of natural fort where they could hide from both river and trail.  Here will do,  the Hound said.  Water the horses and gather some deadwood for a fire.  When he dismounted, he had to catch himself on a tree limb to keep from falling.   Won’t the smoke be seen?    Anyone wants to find us, all they need to do is follow my blood. Water and wood. But bring me that wineskin first.   When he got the fire going, Sandor propped up his helm in the flames, emptied half the wineskin into it, and collapsed back against a jut of moss-covered stone as if he never meant to rise again. He made Arya wash out the squire’s cloak and cut it into strips. Those went into his helm as well.  If I had more wine, I’d drink till I was dead to the world. Maybe I ought to send you back to that bloody inn for another skin or three.     No,  Arya said. He wouldn’t, would he? If he does, I’ll just leave him and ride off.  Sandor laughed at the fear on her face.  A jest, wolf girl. A bloody jest. Find me a stick, about so long and not too big around. And wash the mud off it. I hate the taste of mud.   He didn’t like the first two sticks she brought him. By the time she found one that suited him, the flames had scorched his dog’s snout black all the way to the eyes. Inside the wine was boiling madly.  Get the cup from my bedroll and dip it half full,  he told her.  Be careful. You knock the damn thing over, I will send you back for more. Take the wine and pour it on my wounds. Think you can do that?  Arya nodded.  Then what are you waiting for?  he growled.  Her knuckles brushed the steel the first time she filled the cup, burning her so badly she got blisters. Arya had to bite her lip to keep from screaming. The Hound used the stick for the same purpose, clamping it between his teeth as she poured. She did the gash in his thigh first, then the shallower cut on the back of his neck. Sandor coiled his right hand into a fist and beat against the ground when she did his leg. When it came to his neck, he bit the stick so hard it broke, and she had to find him a new one. She could see the terror in his eyes.  Turn your head.  She trickled the wine down over the raw red flesh where his ear had been, and fingers of brown blood and red wine crept over his jaw. He did scream then, despite the stick. Then he passed out from the pain.  Arya figured the rest out by herself. She fished the strips they’d made of the squire’s cloak out of the bottom of the helm and used them to bind the cuts. When she came to his ear, she had to wrap up half his head to stop the bleeding."
}