{
  "id": "ddf9f9a3b815bcc4c4ec29143dea89f4df9a2b11",
  "text": " Lord Caswell has shut himself up in his castle.   Tyrion threw back his head and laughed.  Varys reined up, nonplussed.  My lord?    Don’t you see the jest, Lord Varys?  Tyrion waved a hand at the shuttered windows, at all the sleeping city.  Storm’s End is fallen and Stannis is coming with fire and steel and the gods alone know what dark powers, and the good folk don’t have Jaime to protect them, nor Robert nor Renly nor Rhaegar nor their precious Knight of Flowers. Only me, the one they hate.  He laughed again.  The dwarf, the evil counselor, the twisted little monkey demon. I’m all that stands between them and chaos.       CATELYN   Tell Father I have gone to make him proud.  Her brother swung up into his saddle, every inch the lord in his bright mail and flowing mud-and-water cloak. A silver trout ornamented the crest of his greathelm, twin to the one painted on his shield.   He was always proud of you, Edmure. And he loves you fiercely. Believe that.    I mean to give him better reason than mere birth.  He wheeled his warhorse about and raised a hand. Trumpets sounded, a drum began to boom, the drawbridge descended in fits and starts, and Ser Edmure Tully led his men out from Riverrun with lances raised and banners streaming.  I have a greater host than yours, brother, Catelyn thought as she watched them go. A host of doubts and fears.  Beside her, Brienne’s misery was almost palpable. Catelyn had ordered garments sewn to her measure, handsome gowns to suit her birth and sex, yet still she preferred to dress in oddments of mail and boiled leather, a swordbelt cinched around her waist. She would have been happier riding to war with Edmure, no doubt, but even walls as strong as Riverrun’s required swords to hold them. Her brother had taken every able-bodied man for the fords, leaving Ser Desmond Grell to command a garrison made up of the wounded, the old, and the sick, along with a few squires and some untrained peasant boys still shy of manhood. This, to defend a castle crammed full of women and children.  When the last of Edmure’s foot had shuffled under the portcullis, Brienne asked,  What shall we do now, my lady?    Our duty.  Catelyn’s face was drawn as she started across the yard. I have always done my duty, she thought. Perhaps that was why her lord father had always cherished her best of all his children. Her two older brothers had both died in infancy, so she had been son as well as daughter to Lord Hoster until Edmure was born. Then her mother had died and her father had told her that she must be the lady of Riverrun now, and she had done that too. And when Lord Hoster promised her to Brandon Stark, she had thanked him for making her such a splendid match.  I gave Brandon my favor to wear, and never comforted Petyr once after he was wounded, nor bid him farewell when Father sent him off. And when Brandon was murdered and Father told me I must wed his brother, I did so gladly, though I never saw Ned’s face until our wedding day. I gave my maidenhood to this solemn stranger and sent him off to his war and his king and the woman who bore him his bastard, because I always did my duty.  Her steps took her to the sept, a seven-sided sandstone temple set amidst her mother’s gardens and filled with rainbow light. It was crowded when they entered; Catelyn was not alone in her need for prayer. She knelt before the painted marble image of the Warrior and lit a scented candle for Edmure and another for Robb off beyond the hills. Keep them safe and help them to victory, she prayed, and bring peace to the souls of the slain and comfort to those they leave behind.  The septon entered with his censer and crystal while she was at her prayers, so Catelyn lingered for the celebration. She did not know this septon, an earnest young man close to Edmure’s age. He performed his office well enough, and his voice was rich and pleasant when he sang the praises to the Seven, but Catelyn found herself yearning for the thin quavering tones of Septon Osmynd, long dead. Osmynd would have listened patiently to the tale of what she had seen and felt in Renly’s pavilion, and he might have known what it meant as well, and what she must do to lay to rest the shadows that stalked her dreams. Osmynd, my father, Uncle Brynden, old Maester Kym, they always seemed to know everything, but now there is only me, and it seems I know nothing, not even my duty. How can I do my duty if I do not know where it lies?  Catelyn’s knees were stiff by the time she rose, though she felt no wiser. Perhaps she would go to the godswood tonight, and pray to Ned’s gods as well. They were older than the Seven.  Outside, she found song of a very different sort. Rymund the Rhymer sat by the brewhouse amidst a circle of listeners, his deep voice ringing as he sang of Lord Deremond at the Bloody Meadow.  And there he stood with sword in hand,  the last of Darry’s ten…  Brienne paused to listen for a moment, broad shoulders hunched and thick arms crossed against her chest."
}