{
  "id": "de53b70a5f964e7997214b5dce70f2ebffc437d7",
  "text": " He and Hermione were waiting, listening, their nerves jangling.... And then, as they both took a fourth piece of chocolate from Madam Pomfrey, they heard a distant roar of fury echoing from somewhere above them....  \"What was that?\" said Madam Pomfrey in alarm.  Now they could hear angry voices, growing louder and louder. Madam Pomfrey was staring at the door.  \"Really -- they'll wake everybody up! What do they think they're doing?\"  Harry was trying to hear what the voices were saying. They were drawing nearer --  \"He must have Disapparated, Severus. We should have left somebody in the room with him. When this gets out --\"  \"HE DIDN'T DISAPPARATE!\" Snape roared, now very close at hand. \"YOU CAN'T APPARATE OR DISAPPARATE INSIDE THIS CASTLE! THIS -- HAS -- SOMETHING -- TO -- DO -- WITH -- POTTER!\"  \"Severus -- be reasonable -- Harry has been locked up --\"  BAM.  The door of the hospital wing burst open.  Fudge, Snape, and Dumbledore came striding into the ward. Dumbledore alone looked calm. Indeed, he looked as though he was quite enjoying himself. Fudge appeared angry. But Snape was beside himself.  \"OUT WITH IT, POTTER!\" he bellowed. \"WHAT DID YOU DO?\"  \"Professor Snape!\" shrieked Madam Pomfrey. \"Control yourself!\"  \"See here, Snape, be reasonable,\" said Fudge. \"This door's been locked, we just saw --\"  \"THEY HELPED HIM ESCAPE, I KNOW IT!\" Snape howled, pointing at Harry and Hermione. His face was twisted; spit was flying from his mouth.  \"Calm down, man!\" Fudge barked. \"You're talking nonsense!\"  \"YOU DON'T KNOW POTTER!\" shrieked Snape. \"HE DID IT, I KNOW HE DID IT --\"  \"That will do, Severus,\" said Dumbledore quietly. \"Think about what you are saying. This door has been locked since I left the ward ten minutes ago. Madam Pomfrey, have these students left their beds?\"  \"Of course not!\" said Madam Pomfrey, bristling. \"I would have heard them!\"  \"Well, there you have it, Severus,\" said Dumbledore calmly. \"Unless you are suggesting that Harry and Hermione are able to be in two places at once, I'm afraid I don't see any point in troubling them further.\"  Snape stood there, seething, staring from Fudge, who looked thoroughly shocked at his behavior, to Dumbledore, whose eyes were twinkling behind his glasses. Snape whirled about, robes swishing behind him, and stormed out of the ward.  \"Fellow seems quite unbalanced,\" said Fudge, staring after him. \"I'd watch out for him if I were you, Dumbledore.\"  \"Oh, he's not unbalanced,\" said Dumbledore quietly. \"He's just suffered a severe disappointment.\"  \"He's not the only one!\" puffed Fudge. \"The Daily Prophet's going to have a field day! We had Black cornered and he slipped through our fingers yet again! All it needs now is for the story of that hippogriff's escape to get out, and I'll be a laughingstock! Well... I'd better go and notify the Ministry.....  \"And the dementors?\" said Dumbledore. \"They'll be removed from the school, I trust?\"  \"Oh yes, they'll have to go,\" said Fudge, running his fingers  distractedly through his hair. \"Never dreamed they'd attempt to administer the Kiss on an innocent boy... Completely out of control... no, I'll have them packed off back to Azkaban tonight.... Perhaps we should think about dragons at the school entrance....\"  \"Hagrid would like that,\" said Dumbledore, smiling at Harry and Hermione. As he and Fudge left the dormitory, Madam Pomfrey hurried to the door and locked it again. Muttering angrily to herself, she headed back to her office.  There was a low moan from the other end of the ward. Ron had woken up. They could see him sitting up, rubbing his head, looking around.  \"What -- what happened?\" he groaned. \"Harry? Why are we in here? Where's Sirius? Where's Lupin? What's going on?\"  Harry and Hermione looked at each other.  \"You explain,\" said Harry, helping himself to some more chocolate.  When Harry, Ron, and Hermione left the hospital wing at noon the next day, it was to find an almost deserted castle. The sweltering, heat and the end of the exams meant that everyone was taking full advantage of another Hogsmeade visit. Neither Ron nor Hermione felt like going, however, so they and Harry wandered onto the grounds, still talking about the extraordinary events of the previous night and wondering where Sirius and Buckbeak were now. Sitting near the lake, watching the giant squid waving its tentacles lazily above the water, Harry lost the thread of the conversation as he looked across to the opposite bank. The stag had galloped toward him from there just last night....  A shadow fell across them and they looked 'tip to see a very bleary-eyed Hagrid, mopping his sweaty face with one of his tablecloth-sized handkerchiefs and beaming down at them.  \"Know I shouldn' feel happy, after wha' happened las' night,\" he said. \"I mean, Black escapin' again, an, everythin' -- but guess what?\"  \"What?\" they said, pretending to look curious.  \"Beaky! He escaped! He's free! Bin celebratin' all night!\"  \"That's wonderful!\" said Hermione, giving Ron a reproving look because he looked as though he was close to laughing."
}