{
  "id": "def013cc0700aa53c7741d5e31855a214b933808",
  "text": "  He laughed bitterly.   Why did you come here?    You promised me a song, little bird. Have you forgotten?   She didn’t know what he meant. She couldn’t sing for him now, here, with the sky aswirl with fire and men dying in their hundreds and their thousands.  I can’t,  she said.  Let me go, you’re scaring me.    Everything scares you. Look at me. Look at me.   The blood masked the worst of his scars, but his eyes were white and wide and terrifying. The burnt corner of his mouth twitched and twitched again. Sansa could smell him; a stink of sweat and sour wine and stale vomit, and over it all the reek of blood, blood, blood.   I could keep you safe,  he rasped.  They’re all afraid of me. No one would hurt you again, or I’d kill them.  He yanked her closer, and for a moment she thought he meant to kiss her. He was too strong to fight. She closed her eyes, wanting it to be over, but nothing happened.  Still can’t bear to look, can you?  she heard him say. He gave her arm a hard wrench, pulling her around and shoving her down onto the bed.  I’ll have that song. Florian and Jonquil, you said.  His dagger was out, poised at her throat.  Sing, little bird. Sing for your little life.   Her throat was dry and tight with fear, and every song she had ever known had fled from her mind. Please don’t kill me, she wanted to scream, please don’t. She could feel him twisting the point, pushing it into her throat, and she almost closed her eyes again, but then she remembered. It was not the song of Florian and Jonquil, but it was a song. Her voice sounded small and thin and tremulous in her ears.  Gentle Mother, font of mercy,  save our sons from war, we pray,  stay the swords and stay the arrows,  let them know a better day.  Gentle Mother, strength of women,  help our daughters through this fray,  soothe the wrath and tame the fury,  teach us all a kinder way.  She had forgotten the other verses. When her voice trailed off, she feared he might kill her, but after a moment the Hound took the blade from her throat, never speaking.  Some instinct made her lift her hand and cup his cheek with her fingers. The room was too dark for her to see him, but she could feel the stickiness of the blood, and a wetness that was not blood.  Little bird,  he said once more, his voice raw and harsh as steel on stone. Then he rose from the bed. Sansa heard cloth ripping, followed by the softer sound of retreating footsteps.  When she crawled out of bed, long moments later, she was alone. She found his cloak on the floor, twisted up tight, the white wool stained by blood and fire. The sky outside was darker by then, with only a few pale green ghosts dancing against the stars. A chill wind was blowing, banging the shutters. Sansa was cold. She shook out the torn cloak and huddled beneath it on the floor, shivering.  How long she stayed there she could not have said, but after a time she heard a bell ringing, far off across the city. The sound was a deep-throated bronze booming, coming faster with each knell. Sansa was wondering what it might mean when a second bell joined in, and a third, their voices calling across the hills and hollows, the alleys and towers, to every corner of King’s Landing. She threw off the cloak and went to her window.  The first faint hint of dawn was visible in the east, and the Red Keep’s own bells were ringing now, joining in the swelling river of sound that flowed from the seven crystal towers of the Great Sept of Baelor. They had rung the bells when King Robert died, she remembered, but this was different, no slow dolorous death knell but a joyful thunder. She could hear men shouting in the streets as well, and something that could only be cheers.  It was Ser Dontos who brought her the word. He staggered through her open door, wrapped her in his flabby arms, and whirled her around and around the room, whooping so incoherently that Sansa understood not a word of it. He was as drunk as the Hound had been, but in him it was a dancing happy drunk. She was breathless and dizzy when he let her down.  What is it?  She clutched at a bedpost.  What’s happened? Tell me!    It’s done! Done! Done! The city is saved. Lord Stannis is dead , Lord Stannis is fled, no one knows, no one cares, his host is broken, the danger’s done. Slaughtered, scattered, or gone over, they say. Oh, the bright banners! The banners, Jonquil, the banners! Do you have any wine? We ought to drink to this day, yes. It means you’re safe, don’t you see?    Tell me what’s happened!  Sansa shook him.  Ser Dontos laughed and hopped from one leg to the other, almost falling.  They came up through the ashes while the river was burning. The river, Stannis was neck deep in the river, and they took him from the rear. Oh, to be a knight again, to have been part of it! His own men hardly fought, they say. Some ran but more bent the knee and went over, shouting for Lord Renly! What must Stannis have thought when he heard that? I had it from Osney Kettleblack who had it from Ser Osmund, but Ser Balon’s back now and his men say the same, and the gold cloaks as well."
}