{
  "id": "dfa270aef8128df009dfe9029e35d71d6bea77b8",
  "text": " \"Do you think that the trauma in your past might have made you keen to prove yourself? To live up to your name?  Do you think that perhaps you were tempted to enter the Triwizard Tournament because - \" \"I didn't enter,\" said Harry, starting to feel irritated.   \"Can you remember your parents at all?\"  said Rita Skeeter, talking over him. \"No,\" said Harry. \"How do you think they'd feel if they knew you were competing in the Triwizard Tournament?  Proud?  Worried?  Angry?\" Harry was feeling really annoyed now.  How on earth was he to know how his parents would feel if they were alive?  He could feel Rita Skeeter watching him very intently.  Frowning, he avoided her gaze and hooked down at words the quill had just written:  Tears fill those startlingly green eyes as our conversation turns to the parents he can barely remember.  \"I have NOT got tears in my eyes!\"  said Harry loudly. Before Rita Skeeter could say a word, the door of the broom cupboard was pulled open.  Harry looked around, blinking in the bright light.  Albus Dumbledore stood there, looking down at both of them, squashed into the cupboard. \"Dumbledore!\"  cried Rita Skeeter, with every appearance of delight - but Harry noticed that her quill and the parchment had suddenly vanished from the box of Magical Mess Remover, and Rita's clawed fingers were hastily snapping shut the clasp of her crocodile-skin bag.  \"How are you?\" she said, standing up and holding out one of her large, mannish hands to Dumbledore.  \"I hope you saw my piece over the summer about the International Confederation of Wizards' Conference?\" \"Enchantingly nasty,\" said Dumbledore, his eyes twinkling. \"I particularly enjoyed your description of me as an obsolete dingbat.\" Rita Skeeter didn't look remotely abashed. \"I was just making the point that some of your ideas are a little old-fashioned, Dumbhedore, and that many wizards in the street -\" \"I will be delighted to hear the reasoning behind the rudeness, Rita,\" said Dumbledore, with a courteous bow and a smile, \"but I'm afraid we will have to discuss the matter later.  The Weighing of the Wands is about to start, and it cannot take place if one of our champions is hidden in a broom cupboard.\" Very glad to get away from Rita Skeeter, Harry hurried back into the room.  The other champions were now sitting in chairs near the door, and he sat down quickly next to Cedric, hooking up at the velvet-covered table, where four of the five judges were now sitting - Professor Karkaroff, Madame Maxime, Mr. Crouch, and Ludo Bagman.  Rita Skeeter settled herself down in a corner; Harry saw her slip the parchment out of her bag again, spread it on her knee, suck the end of the Quick-Quotes Quill, and place it once more on the parchment. \"May I introduce Mr. Ollivander?\"  said Dumbledore, taking his place at the judges' table and talking to the champions.  \"He will be checking your wands to ensure that they are in good condition before the tournament.\"  Harry hooked around, and with a jolt of surprise saw an old wizard with large, pale eyes standing quietly by the window.  Harry had met Mr. Ollivander before - he was the wand-maker from whom Harry had bought his own wand over three years ago in Diagon Alley. \"Mademoiselle Delacour, could we have you first, please?\" said Mr. Ollivander, stepping into the empty space in the middle of the room. Fleur Delacour swept over to Mr. Olhivander and handed him her wand. \"Hmm...\" he said. He twirled the wand between his long fingers like a baton and it emitted a number of pink and gold sparks.  Then he held it chose to his eyes and examined it carefully. \"Yes,\" he said quietly, \"nine and a half inches. . . inflexible.. rosewood.. . and containing. . . dear me. . .\" \"An 'air from ze 'ead of a veela,\" said Fleur.  \"One of my grandmuzzer's.\" So Fleur was part veela, thought Harry, making a mental note to tell Ron. . . then he remembered that Ron wasn't speaking to him. \"Yes,\" said Mr. Ollivander, \"yes, I've never used veela hair myself, of course.  I find it makes for rather temperamental wands...however, to each his own, and if this suits you..\" Mr. Ollivander ran his fingers along the wand, apparently checking for scratches or bumps; then he muttered, \"Orchideous!\"  and a bunch of flowers burst from the wand tip. \"Very well, very well, it's in fine working order,\" said Mr. Ollivander, scooping up the flowers and handing them to Fleur with her wand.  \"Mr. Diggory, you next.\" Fleur glided back to her seat, smiling at Cedric as he passed her.  \"Ah, now, this is one of mine, isn't it?\" said Mr. Ollivander, with much more enthusiasm, as Cedric handed over his wand.  \"Yes, I remember it well.  Containing a single hair from the tail of a particularly fine male unicorn. . . must have been seventeen hands; nearly gored me with his horn after I plucked his tail.  Twelve and a quarter inches. . . ash. . . pleasantly springy.  It's in fine condition...You treat it regularly?\" \"Polished it last night,\" said Cedric, grinning."
}