{
  "id": "e0428c2c12dc2a4bb9c205bc9cc3b2b50dda809e",
  "text": " It is bloody cold on the Wall, but at least I would be shut of Cersei. He did not think he would make much of a ranger, but the Night’s Watch needed clever men as well as strong ones. Lord Commander Mormont had said as much, when Tyrion had visited Castle Black. There are those inconvenient vows, though. It would mean the end of his marriage and whatever claim he might ever have made for Casterly Rock, but he did not seem destined to enjoy either in any case. And he seemed to recall that there was a brothel in a nearby village.  It was not a life he’d ever dreamed of, but it was life. And all he had to do to earn it was trust in his father, stand up on his little stunted legs, and say,  Yes, I did it, I confess.  That was the part that tied his bowels in knots. He almost wished he had done it, since it seemed he must suffer for it anyway.   My lord?  said Podrick Payne.  They’re here, my lord. Ser Addam. And the gold cloaks. They wait without.    Pod, tell me true… do you think I did it?   The boy hesitated. When he tried to speak, all he managed to produce was a weak sputter.  I am doomed. Tyrion sighed.  No need to answer. You’ve been a good squire to me. Better than I deserved. Whatever happens, I thank you for your leal service.   Ser Addam Marbrand waited at the door with six gold cloaks. He had nothing to say this morning, it seemed. Another good man who thinks me a kinslayer. Tyrion summoned all the dignity he could find and waddled down the steps. He could feel them all watching him as he crossed the yard; the guards on the walls, the grooms by the stables, the scullions and washerwomen and serving girls. Inside the throne room, knights and lordlings moved aside to let them through, and whispered to their ladies.  No sooner had Tyrion taken his place before the judges than another group of gold cloaks led in Shae.  A cold hand tightened round his heart. Varys betrayed her, he thought. Then he remembered. No. I betrayed her myself. I should have left her with Lollys. Of course they’d question Sansa’s maids, I’d do the same. Tyrion rubbed at the slick scar where his nose had been, wondering why Cersei had bothered. Shae knows nothing that can hurt me.   They plotted it together,  she said, this girl he’d loved.  The Imp and Lady Sansa plotted it after the Young Wolf died. Sansa wanted revenge for her brother and Tyrion meant to have the throne. He was going to kill his sister next, and then his own lord father, so he could be Hand for Prince Tommen. But after a year or so, before Tommen got too old, he would have killed him too, so as to take the crown for his own head.    How could you know all this?  demanded Prince Oberyn.  Why would the Imp divulge such plans to his wife’s maid?    I overheard some, m’lord,  said Shae,  and m’lady let things slip too. But most I had from his own lips. I wasn’t only Lady Sansa’s maid. I was his whore, all the time he was here in King’s Landing. On the morning of the wedding, he dragged me down where they keep the dragon skulls and fucked me there with the monsters all around. And when I cried, he said I ought to be more grateful, that it wasn’t every girl who got to be the king’s whore. That was when he told me how he meant to be king. He said that poor boy Joffrey would never know his bride the way he was knowing me.  She started sobbing then.  I never meant to be a whore, m’lords. I was to be married. A squire, he was, and a good brave boy, gentle born. But the Imp saw me at the Green Fork and put the boy I meant to marry in the front rank of the van, and after he was killed he sent his wildlings to bring me to his tent. Shagga, the big one, and Timett with the burned eye. He said if I didn’t pleasure him, he’d give me to them, so I did. Then he brought me to the city, so I’d be close when he wanted me. He made me do such shameful things…   Prince Oberyn looked curious.  What sorts of things?    Unspeakable things.  As the tears rolled slowly down that pretty face, no doubt every man in the hall wanted to take Shae in his arms and comfort her.  With my mouth and… other parts, m’lord. All my parts. He used me every way there was, and… he used to make me tell him how big he was. My giant, I had to call him, my giant of Lannister.   Oswald Kettleblack was the first to laugh. Boros and Meryn joined in, then Cersei, Ser Loras, and more lords and ladies than he could count. The sudden gale of mirth made the rafters ring and shook the Iron Throne.  It’s true,  Shae protested.  My giant of Lannister.  The laughter swelled twice as loud. Their mouths were twisted in merriment, their bellies shook. Some laughed so hard that snot flew from their nostrils.  I saved you all, Tyrion thought. I saved this vile city and all your worthless lives. There were hundreds in the throne room, every one of them laughing but his father. Or so it seemed. Even the Red Viper chortled, and Mace Tyrell looked like to bust a gut, but Lord Tywin Lannister sat between them as if made of stone, his fingers steepled beneath his chin."
}