{
  "id": "e126ccfdad041071db77d10c924ac2859e328dc9",
  "text": "  Very soon the chief guard nodded his head, then he laid it on the table and fell  fast asleep. The butler went on talking and laughing to himself for a while without  seeming to notice, but soon his head too nodded to the table, and he fell asleep and  snored  beside  his  friend.  Then  in  crept  the  hobbit.  Very  soon  the chief guard had   ####-no  keys,  but Bilbo was  trotting  as  fast  as  he  could  along  the  passage  towards  the  cells. The  great  bunch  seemed  very  heavy  to  his  arms,  and  his  heart was  often  in  his  mouth,  in  spite  of  his  ring,  for  he  could  not  prevent  the  keys  from  making  every now and then a loud clink and clank, which put him all in a tremble.  First  he  unlocked  Balin's  door,  and  locked  it  again  carefully  as  soon  as  the  dwarf was  outside. Balin was most  surprised,  as  you  can  imagine;  but  glad  as  he  was  to  get  out  of  his  wearisome  little  stone  room,  he  wanted  to  stop  and  ask  questions, and know what Bilbo was going to do, and all about it.  \"No  time  now!\"  said  the  hobbit.  \"You  must  follow  me!  We  must  all  keep  together  and not  risk getting  separated. All of us must  escape or none,  and  this  is  our  last  chance.  If  this  is  found out, goodness knows where  the king will put you  next, with chains on your hands and feet  too, I expect. Don't argue,  there's a good  fellow!\"  Then  off  he went  from  door  to  door,  until  his  following  had  grown  to  twelve- none  of  them  any  too  nimble,  what  with  the  dark,  and  what  with  their  long  imprisonment. Bilbo's heart thumped every time one of them bumped into another,  or  grunted  or  whispered  in  the  dark.  \"Drat  this  dwarvish  racket!\"  he  said  to  himself. But all went well, and they met no guards. As a matter of fact there was a  great  autumn  feast  in  the woods  that night,  and  in  the halls  above. Nearly  all  the  king's  folks  were  merrymaking.  At  last  after  much  blundering  they  came  to  Thorin's  dungeon,  far  down  in  a  deep  place  and  fortunately  not  far  from  the  cellars.  \"Upon my word!\"  said Thorin, when Bilbo whispered to him to come out and  join his  friends,  \"Gandalf  spoke  true,  as usual. A pretty  fine burglar you make,  it  seems,  when  the  time  comes.  I  am  sure  we  are  all  for  ever  at  your  service,  whatever happens after this. But what comes next?\"  Bilbo saw that the time had come to explain his idea, as far as he could; but he  did  not  feel  at  all  sure  bow  the  dwarves  would  take  it.  His  fears  were  quite  justified, for they did not like it a bit, and started grumbling loudly in spite of their  danger.   \"We  shall  be  bruised  and  battered  to  pieces,  and  drowned  too,  for  certain!\"  they muttered. \"We thought you had got some sensible notion, when you managed  to get hold of the keys. This is a mad idea!\"  \"Very well!\" said Bilbo very downcast, and also rather annoyed. \"Come  along  back  to  your  nice  cells,  and  I  will  lock  you  all  in  again,  and  you  can  sit  there  comfortably  and  think  of  a  better  plan-but  I don't suppose  I shall ever get hold of  the keys again, even if I feel inclined to try.\"   ####-\"That  was  too  much  for  them,  and  they  calmed  down.  In  the  end,  of  course,  they had to do just what Bilbo suggested, because it was obviously impossible for  them  to  try  and  find  their  way  into  the  upper  halls,  or  to  fight  their  way  out  of  gates  that  closed  by  magic;  and  it  was  no  good  grumbling  in  the  passages  until  they were caught again. So following the hobbit, down into the lowest cellars they  crept.  They  passed  a  door  through which  the  chief  guard  and  the  butler  could  be  seen  still  happily  snoring  with  smiles  upon  their  faces.  The  wine  of Dorwinion  brings  deep  and  pleasant  dreams.  There  would  be  a  different  expression  on  the  face of  the  chief guard next day,  even  though Bilbo, before  they went on,  stole  in  and kindheartedly put the keys back on his belt.  \"That  will  save  him  some  of  the  trouble  he  is  in  for,\"  said  Mr.  Baggins  to  himself.  \"He wasn't  a  bad  fellow,  and  quite  decent  to  the  prisoners.  It will  puzzle  them all too. They will think we had a very strong magic to pass through all those  locked doors and disappear. Disappear! We have got to get busy very quick, if that  is to happen!\"    Balin was  told  off  to watch  the  guard  and  the  butler  and  give warning  if  they  stirred. The rest went  into  the adjoining cellar with  the  trapdoors. There was  little  time  to  lose.  Before  long,  as  Bilbo  knew,  some  elves were  under  orders  to  come  down and help  the butler get  the empty barrels  through  the doors  into  the  stream.  These were in fact already standing in rows in the middle of the floor waiting to be  pushed off. Some of them were wine-barrels, and these were not much use, as they  could not easily be opened at the end without a deal of noise, nor could they easily  be  secured  again."
}