{
  "id": "e540a576cd92c6c29db5caf1e380b070598c9d0c",
  "text": "  As  quick  as  lightning  they  came  running  and  swinging  towards  the  hobbit,  flinging  out  their  long  threads  in  all  directions,  till  the  air  seemed  full  of waving  snares. Bilbo,  however,  soon  slipped  away to a different place. The idea came to him to lead the furious spiders further  and further away from the dwarves, if he could; to make them curious, excited and  angry  all  at  once. When  about  fifty  had  gone  off  to  the  place where  he  had  stood  before, he threw some more stones at these, and at others that had stopped behind;  then dancing among  the  trees he began  to  sing a  song  to  infuriate  them and bring  them all after him, and also to let the dwarves hear his voice.  This is what he sang:     Old fat spider spinning in a tree!  Old fat spider can't see me!  Attercop! Attercop!  Won't you stop,  Stop your spinning and look for me!    Old Tomnoddy, all big body,   Old Tomnoddy can't spy me!  Attercop! Attercop!  Down you drop!  You'll never catch me up your tree!     Not very good perhaps, but then you must remember that he had to make it up  himself, on  the  spur of  a very  awkward moment.  It did what he wanted  any way.  As he  sang he  threw  some more  stones  and  stamped. Practically  all  the  spiders  in  the  place  came  after  him:  some  dropped  to  the  ground,  others  raced  along  the  branches, swung  from  tree  to  tree, or cast new  ropes across  the dark spaces. They  made  for his noise  far quicker  than he had expected. They were  frightfully angry.  Quite  apart  from  the  stones  no  spider  has  ever  liked  being  called  Attercop,  and  Tomnoddy of course is insulting to anybody.   Off  Bilbo  scuttled  to  a  fresh  place,  but  several  of  the  spiders  had  run  now  to  different points in the glade where they lived, and were busy spinning webs across  all  the  spaces  between  the  tree-stems.  Very  soon  the  hobbit would be  caught  in  a   ####-thick fence of them all round him-that at least was the spiders' idea. Standing now  in  the  middle  of  the  hunting  and  spinning  insects  Bilbo  plucked  up  his  courage  and began a new song:     ####-Lazy Lob and crazy Cob  are weaving webs to wind me.  I am far more sweet than other meat,  but still they cannot find me!    Here am I, naughty little fly;  you are fat and lazy.   You cannot trap me, though you try,  in your cobwebs crazy.      With  that  he  turned  and  found  that  the  last  space  between  two  tall  trees  had  been closed with a web-but luckily not a proper web, only great strands of double- thick  spider-rope  run  hastily  backwards  and  forwards  from  trunk  to  trunk.  Out  came his little' sword. He slashed the threads to pieces and went off singing.  The spiders saw the sword, though I don't suppose they knew what it was, and  at once the whole lot of them came hurrying after the hobbit along the ground and  the branches, hairy legs waving, nippers and spinners snapping, eyes popping, full  of froth and rage. They followed him into the forest until Bilbo had gone as far as  he dared.  Then quieter than a mouse he stole back. He had precious little time, he knew,  before  the  spiders were disgusted and came back  to  their  trees where  the dwarves  were hung. In the meanwhile he had to rescue them. The worst part of the job was  getting up on to the long branch where the bundles were dangling. I don't suppose  he would  have managed  it,  if  a  spider  had  not  luckily  left  a  rope  hanging  down;  with  its  help,  though  it  stuck  to  his  hand  and  hurt  him,  he  scrambled  up-only  to  meet  an old  slow wicked  fat-bodied spider who had remained behind to guard the  prisoners, and had been busy pinching them to see which was the juiciest to eat. It  had  thought of starting  the feast while  the others were away, but Mr. Baggins was  in  a  hurry,  and  before  the  spider  knew  what  was  happening  it  felt  his  sting  and  rolled off  the branch dead. Bilbo's next  job was  to  loose  a dwarf. What was he  to  do?  If  he  cut  the  string  which  hung  him  up,  the  wretched  dwarf  would  tumble  thump to the ground a good way below. Wriggling along the branch (which made  all the poor dwarves dance and dangle like ripe fruit) he reached the first bundle.  \"Fili  or  Kili,\"  he  thought  by  the  tip  of  a  blue  hood  sticking  out  at  the  top.  \"Most  likely Fili,\" he  thought by  the  tip of a  long nose poking out of  the winding  threads. He managed by  leaning over  to cut most of  the strong sticky  threads  that  bound  him  round,  and  then,  sure  enough, with  a  kick  and  a  struggle most  of  Fili  emerged.  I  am  afraid  Bilbo  actually  laughed  at  the  sight  of  him  jerking  his  stiff   ####-arms and  legs as he danced on  the  spider-string under his armpits, just like one of  those funny toys bobbing on a wire.  Somehow  or  other  Fili  was  got  on  to  the  branch,  and  then  he  did  his  best  to  help  the hobbit,  although he was  feeling very  sick  and  ill  from  spider-poison, and  from  hanging  most  of  the  night  and  the  next  day  wound  round  and  round  with  only his nose to breathe through."
}