{
  "id": "e59b84e6065ff2fd6ce44317d106df7664574146",
  "text": "  Across rain-sodden flelds and stony ridges, she could see the great castle of Storm’s End rearing up against the sky, its back to the unseen sea. Beneath that mass of pale grey stone, the encircling army of Lord Stannis Baratheon looked as small and insignificant as mice with banners.  The songs said that Storm’s End had been raised in ancient days by Durran, the first Storm King, who had won the love of the fair Elenei, daughter of the sea god and the goddess of the wind. On the night of their wedding, Elenei had yielded her maidenhood to a mortal’s love and thus doomed herself to a mortal’s death, and her grieving parents had unleashed their wrath and sent the winds and waters to batter down Durran’s hold. His friends and brothers and wedding guests were crushed beneath collapsing walls or blown out to sea, but Elenei sheltered Durran within her arms so he took no harm, and when the dawn came at last he declared war upon the gods and vowed to rebuild.  Five more castles he built, each larger and stronger than the last, only to see them smashed asunder when the gale winds came howling up Shipbreaker Bay, driving great walls of water before them. His lords pleaded with him to build inland; his priests told him he must placate the gods by giving Elenei back to the sea; even his smallfolk begged him to relent. Durran would have none of it. A seventh castle he raised, most massive of all. Some said the children of the forest helped him build it, shaping the stones with magic; others claimed that a small boy told him what he must do, a boy who would grow to be Bran the Builder. No matter how the tale was told, the end was the same. Though the angry gods threw storm after storm against it, the seventh castle stood defiant, and Durran Godsgrief and fair Elenei dwelt there together until the end of their days.  Gods do not forget, and still the gales came raging up the narrow sea. Yet Storm’s End endured, through centuries and tens of centuries, a castle like no other. Its great curtain wall was a hundred feet high, unbroken by arrow slit or postern, everywhere rounded, curving, smooth, its stones fit so cunningly together that nowhere was crevice nor angle nor gap by which the wind might enter. That wall was said to be forty feet thick at its narrowest, and near eighty on the seaward face, a double course of stones with an inner core of sand and rubble. Within that mighty bulwark, the kitchens and stables and yards sheltered safe from wind and wave. Of towers, there was but one, a colossal drum tower, windowless where it faced the sea, so large that it was granary and barracks and feast hall and lord’s dwelling all in one, crowned by massive battlements that made it look from afar like a spiked flst atop an upthrust arm.   My lady,  Hal Mollen called. Two riders had emerged from the tidy little camp beneath the castle, and were coming toward them at a slow walk.  That will be King Stannis.    No doubt.  Catelyn watched them come. Stannis it must be, yet that is not the Baratheon banner. It was a bright yellow, not the rich gold of Renly’s standards, and the device it bore was red, though she could not make out its shape.  Renly would be last to arrive. He had told her as much when she set out. He did not propose to mount his horse until he saw his brother well on his way. The first to arrive must wait on the other, and Renly would do no waiting. It is a sort of game kings play, she told herself. Well, she was no king, so she need not play it. Catelyn was practiced at waiting.  As he neared, she saw that Stannis wore a crown of red gold with points fashioned in the shape of flames. His belt was studded with garnets and yellow topaz, and a great square-cut ruby was set in the hilt of the sword he wore. Otherwise his dress was plain: studded leather jerkin over quilted doublet, worn boots, breeches of brown roughspun. The device on his sun-yellow banner showed a red heart surrounded by a blaze of orange fire. The crowned stag was there, yes… shrunken and enclosed within the heart. Even more curious was his standard bearer—a woman, garbed all in reds, face shadowed within the deep hood of her scarlet cloak. A red priestess, Catelyn thought, wondering. The sect was numerous and powerful in the Free Cities and the distant east, but there were few in the Seven Kingdoms.   Lady Stark,  Stannis Baratheon said with chill courtesy as he reined up. He inclined his head, balder than she remembered.   Lord Stannis,  she returned.  Beneath the tight-trimmed beard his heavy jaw clenched hard, yet he did not hector her about titles. For that she was duly grateful.  I had not thought to find you at Storm’s End.    I had not thought to be here.   His deepset eyes regarded her uncomfortably. This was not a man made for easy courtesies.  I am sorry for your lord’s death,  he said,  though Eddard Stark was no friend to me.    He was never your enemy, my lord. When the Lords Tyrell and Redwyne held you prisoned in that castle, starving, it was Eddard Stark who broke the siege."
}