{
  "id": "e81b1575abe63069d3c41af9dc735faf159e57dd",
  "text": " People were laughing. The melon flew to pieces. Laugh, Joffrey, she prayed as the juice ran down her face and the front of her blue silk gown. Laugh and be satisfied.  Joffrey did not so much as snigger.  Boros. Meryn.   Ser Meryn Trant seized Dontos by the arm and flung him brusquely away. The red-faced fool went sprawling, broomstick, melon, and all. Ser Boros seized Sansa.   Leave her face,  Joffrey commanded.  I like her pretty.   Boros slammed a fist into Sansa’s belly, driving the air out of her. When she doubled over, the knight grabbed her hair and drew his sword, and for one hideous instant she was certain he meant to open her throat. As he laid the flat of the blade across her thighs, she thought her legs might break from the force of the blow. Sansa screamed. Tears welled in her eyes. It will be over soon. She soon lost count of the blows.   Enough,  she heard the Hound rasp.   No it isn’t,  the king replied.  Boros, make her naked.   Boros shoved a meaty hand down the front of Sansa’s bodice and gave a hard yank. The silk came tearing away, baring her to the waist. Sansa covered her breasts with her hands. She could hear sniggers, far off and cruel.  Beat her bloody,  Joffrey said,  we’ll see how her brother fancies—    What is the meaning of this?   The Imp’s voice cracked like a whip, and suddenly Sansa was free. She stumbled to her knees, arms crossed over her chest, her breath ragged.  Is this your notion of chivalry, Ser Boros?  Tyrion Lannister demanded angrily. His pet sellsword stood with him, and one of his wildlings, the one with the burned eye.  What sort of knight beats helpless maids?    The sort who serves his king, Imp.  Ser Boros raised his sword, and Ser Meryn stepped up beside him, his blade scraping clear of its scabbard.   Careful with those,  warned the dwarf’s sellsword.  You don’t want to get blood all over those pretty white cloaks.    Someone give the girl something to cover herself with,  the Imp said. Sandor Clegane unfastened his cloak and tossed it at her. Sansa clutched it against her chest, fists bunched hard in the white wool. The coarse weave was scratchy against her skin, but no velvet had ever felt so fine.   This girl’s to be your queen,  the Imp told Joffrey.  Have you no regard for her honor?    I’m punishing her.    For what crime? She did not fight her brother’s battle.    She has the blood of a wolf.    And you have the wits of a goose.    You can’t talk to me that way. The king can do as he likes.    Aerys Targaryen did as he liked. Has your mother ever told you what happened to him?   Ser Boros Blount harrumphed.  No man threatens His Grace in the presence of the Kingsguard.   Tyrion Lannister raised an eyebrow.  I am not threatening the king, ser, I am educating my nephew. Bronn, Timett, the next time Ser Boros opens his mouth, kill him.  The dwarf smiled.  Now that was a threat, ser. See the difference?   Ser Boros turned a dark shade of red.  The queen will hear of this!    No doubt she will. And why wait? Joffrey, shall we send for your mother?    The king flushed.   Nothing to say, Your Grace?  his uncle went on.  Good. Learn to use your ears more and your mouth less, or your reign will be shorter than I am. Wanton brutality is no way to win your people’s love… or your queen’s.    Fear is better than love, Mother says.  Joffrey pointed at Sansa.  She fears me.   The Imp sighed.  Yes, I see. A pity Stannis and Renly aren’t twelve-year-old girls as well. Bronn, Timett, bring her.   Sansa moved as if in a dream. She thought the Imp’s men would take her back to her bedchamber in Maegor’s Holdfast, but instead they conducted her to the Tower of the Hand. She had not set foot inside that place since the day her father fell from grace, and it made her feel faint to climb those steps again.  Some serving girls took charge of her, mouthing meaningless comforts to stop her shaking. One stripped off the ruins of her gown and smallclothes, and another bathed her and washed the sticky juice from her face and her hair. As they scrubbed her down with soap and sluiced warm water over her head, all she could see were the faces from the bailey. Knights are sworn to defend the weak, protect women, and fight for the right, but none of them did a thing. Only Ser Dontos had tried to help, and he was no longer a knight, no more than the Imp was, nor the Hound… the Hound hated knights… I hate them too, Sansa thought. They are no true knights, not one of them.  After she was clean, plump ginger-headed Maester Frenken came to see her. He bid her lie facedown on the mattress while he spread a salve across the angry red welts that covered the backs of her legs. Afterward he mixed her a draught of dreamwine, with some honey so it might go down easier.  Sleep a bit, child. When you wake, all this will seem a bad dream.   No it won’t, you stupid man, Sansa thought, but she drank the drearnwine anyway, and slept.  It was dark when she woke again, not quite knowing where she was, the room both strange and strangely familiar."
}