{
  "id": "e8eb0d4a9e6c70572e89865770e108d9423c1fa7",
  "text": " By then dusk was settling over the Trident. She let the horses graze, then hobbled them for the night and made herself as comfortable as she could in a niche between two rocks. The fire burned a while and died. Arya watched the moon through the branches overhead.   Ser Gregor the Mountain,  she said softly.  Dunsen, Raff the Sweetling, Ser Ilyn, Ser Meryn, Queen Cersei.  It made her feel queer to leave out Polliver and the Tickler. And Joffrey too. She was glad he was dead, but she wished she could have been there to see him die, or maybe kill him herself. Polliver said that Sansa killed him, and the Imp. Could that be true? The Imp was a Lannister, and Sansa… I wish I could change into a wolf and grow wings and fly away.  If Sansa was gone too, there were no more Starks but her. Jon was on the Wall a thousand leagues away, but he was a Snow, and these different aunts and uncles the Hound wanted to sell her to, they weren’t Starks either. They weren’t wolves.  Sandor moaned, and she rolled onto her side to look at him. She had left his name out too, she realized. Why had she done that? She tried to think of Mycah, but it was hard to remember what he’d looked like. She hadn’t known him long. All he ever did was play at swords with me.  The Hound,  she whispered, and,  Valar morghulis.  Maybe he’d be dead by morning…  But when the pale dawn light came filtering through the trees, it was him who woke her with the toe of his boot. She had dreamed she was a wolf again, chasing a riderless horse up a hill with a pack behind her, but his foot brought her back just as they were closing for the kill.  The Hound was still weak, every movement slow and clumsy. He slumped in the saddle, and sweated, and his ear began to bleed through the bandage. He needed all his strength just to keep from falling off Stranger. Had the Mountain’s men come hunting them, she doubted if he would even be able to lift a sword. Arya glanced over her shoulder, but there was nothing behind them but a crow flitting from tree to tree. The only sound was the river.  Long before noon, Sandor Clegane was reeling. There were hours of daylight still remaining when he called a halt.  I need to rest,  was all he said. This time when he dismounted he did fall. Instead of trying to get back up he crawled weakly under a tree, and leaned up against the trunk.  Bloody hell,  he cursed.  Bloody hell.  When he saw Arya staring at him, he said,  I’d skin you alive for a cup of wine, girl.   She brought him water instead. He drank a little of it, complained that it tasted of mud, and slid into a noisy fevered sleep. When she touched him, his skin was burning up. Arya sniffed at his bandages the way Maester Luwin had done sometimes when treating her cut or scrape. His face had bled the worst, but it was the wound on his thigh that smelled funny to her.  She wondered how far this Saltpans was, and whether she could find it by herself. I wouldn’t have to kill him. If I just rode off and left him, he’d die all by himself. He’ll die of fever, and lie there beneath that tree until the end of days. But maybe it would be better if she killed him herself. She had killed the squire at the inn and he hadn’t done anything except grab her arm. The Hound had killed Mycah. Mycah and more. I bet he’s killed a hundred Mycahs. He probably would have killed her too, if not for the ransom.  Needle glinted as she drew it. Polliver had kept it nice and sharp, at least. She turned her body sideways in a water dancer’s stance without even thinking about it. Dead leaves crunched beneath her feet. Quick as a snake, she thought. Smooth as summer silk.  His eyes opened.  You remember where the heart is?  he asked in a hoarse whisper.  As still as stone she stood.  I… I was only…    Don’t lie,  he growled.  I hate liars. I hate gutless frauds even worse. Go on, do it.  When Arya did not move, he said,  I killed your butcher’s boy. I cut him near in half, and laughed about it after.  He made a queer sound, and it took her a moment to realize he was sobbing.  And the little bird, your pretty sister, I stood there in my white cloak and let them beat her. I took the bloody song, she never gave it. I meant to take her too. I should have. I should have fucked her bloody and ripped her heart out before leaving her for that dwarf.  A spasm of pain twisted his face.  Do you mean to make me beg, bitch? Do it! The gift of mercy… avenge your little Michael…    Mycah.  Arya stepped away from him.  You don’t deserve the gift of mercy.   The Hound watched her saddle Craven through eyes bright with fever. Not once did he attempt to rise and stop her. But when she mounted, he said,  A real wolf would finish a wounded animal.   Maybe some real wolves will find you, Arya thought. Maybe they’ll smell you when the sun goes down. Then he would learn what wolves did to dogs.  You shouldn’t have hit me with an axe,  she said.  You should have saved my mother.  She turned her horse and rode away from him, and never looked back once."
}