{
  "id": "e9056da1c0e0d8f34041446adce58c20be48eac3",
  "text": " \"Did you find him?\"  Harry asked without preamble.  \"Mr. Crouch?\" \"No,\" said Moody.  He moved over to his desk, sat down, stretched out his wooden leg with a slight groan, and pulled out his hip flask. \"Did you use the map?\" Harry said. \"Of course,\" said Moody, taking a swig from his flask. \"Took a leaf out of your book, Potter.  Summoned it from my office into the forest.  He wasn't anywhere on there.\" \"So he did Disapparate?\"  said Ron. \"You can't Disapparate on the grounds, Ron!\" said Hermione. \"There are other ways he could have disappeared, aren't there, Professor?\" Moody's magical eye quivered as it rested on Hermione. \"You're another one who might think about a career as an Auror,\" he told her.  \"Mind works the right way. Granger.\" Hermione flushed pink with pleasure. \"Well, he wasn't invisible,\" said Harry.  \"The map shows invisible people.  He must've left the grounds, then.\" \"But under his own steam?\"  said Hermione eagerly, \"or because someone made him?\" \"Yeah, someone could've - could've pulled him onto a broom and flown off with him, couldn't they?\"  said Ron quickly, looking hopefully at Moody as if he too wanted to be told he had the makings of an Auror. \"We can't rule out kidnap,\" growled Moody. \"So,\" said Ron, \"d'you reckon he's somewhere in Hogsmeade?\" \"Could be anywhere,\" said Moody, shaking his head.  \"Only thing we know for sure is that he's not here.\" He yawned widely, so that his scars stretched, and his lopsided mouth revealed a number of missing teeth.  Then he said, \"Now, Dumbledore's told me you three fancy yourselves as investigators, but there's nothing you can do for Crouch.  The Ministry'll be looking for him now, Dumbledore's notified them.  Potter, you just keep your mind on the third task.\" \"What?\" said Harry.  \"Oh yeah . . .\" He hadn't given the maze a single thought since he'd left it with Krum the previous night. \"Should be right up your street, this one,\" said Moody, looking up at Harry and scratching his scarred and stubbly chin.  \"From what Dumbledore's said, you've managed to get through stuff like this plenty of times.  Broke your way through a series of obstacles guarding the Sorcerers Stone in your first year, didn't you?\" \"We helped,\" Ron said quickly.  \"Me and Hermione helped.\" Moody grinned. \"Well, help him practice for this one, and I'll be very surprised if he doesn't win,\" said Moody.  \"In the meantime .. . constant vigilance, Potter.  Constant vigilance.\"  He took another long draw from his hip flask, and his magical eye swiveled onto the window.  The topmost sail of the Durmstrang ship was visible through it. \"You two,\" counseled Moody, his normal eye on Ron and Hermione, \"you stick close to Potter, all right? I'm keeping an eye on things, but all the same . . . you can never have too many eyes out.\"  Sirius sent their owl back the very next morning.  It fluttered down beside Harry at the same moment that a tawny owl landed in front of Hermione, clutching a copy of the Daily Prophet in its beak.  She took the newspaper, scanned the first few pages, said, \"Ha!  She hasn't got wind of Crouch!\"  then joined Ron and Harry in reading what Sirius had to say on the mysterious events of the night before last.  Harry - what do you think you are playing at, walking off into the forest with Viktor Krum?  I want you to swear, by return owl, that you are not going to go walking with anyone else at night.  There is somebody highly dangerous at Hogwarts.  It is clear to me that they wanted to stop Crouch from seeing Dumbledore and you were probably feet away from them in the dark.  You could have been killed. Your name didn't get into the Goblet of Fire by accident.  If someone's trying to attack you, they're on their last chance.  Stay close to Ron and Hermione, do not leave Gryffindor Tower after hours, and arm yourself for the third task.  Practice Stunning and Disarming.  A few hexes wouldn't go amiss either.  There's nothing you can do about Crouch.  Keep your head down and look after yourself.  I'm waiting for your letter giving me your word you won't stray out-of-bounds again.     Sirius  \"Who's he, to lecture me about being out-of-bounds?\"  said Harry in mild indignation as he folded up Sirius's letter and put it inside his robes.  \"After all the stuff he did at school!\" \"He's worried about you!\"  said Hermione sharply.  \"Just like Moody and Hagrid!  So listen to them!\" \"No one's tried to attack me all year,\" said Harry. \"No one's done anything to me at  all-\" \"Except put your name in the Goblet of Fire,\" said Hermione.  \"And they must've done that for a reason.  Harry.  Snuffles is right.  Maybe they've been biding their time.  Maybe this is the task they're going to get you.\" \"Look,\" said Harry impatiently, \"let's say Sirius is right, and someone Stunned Krum to kidnap Crouch.  Well, they would've been in the trees near us, wouldn't they?  But they waited till I was out of the way until they acted, didn't they?  So it doesn't look like I'm their target, does it?\" \"They couldn't have made it look like an accident if they'd murdered you in the forest!\" said Hermione."
}