{
  "id": "eaeca3691af87e653c0fc698a008b383f5e10446",
  "text": " I saved Bran’s life with this bow, he reminded himself. Would that I could save my own. Women came to the well, but did not linger; whatever they saw on Theon’s face sent them away quickly.  Behind him the broken tower stood, its summit as jagged as a crown where fire had collapsed the upper stories long ago. As the sun moved, the shadow of the tower moved as well, gradually lengthening, a black arm reaching out for Theon Greyjoy. By the time the sun touched the wall, he was in its grasp. If I hang the girl, the northmen will attack at once, he thought as he loosed a shaft. If I do not hang her, they will know my threats are empty. He knocked another arrow to his bow. There is no way out, none.   If you had a hundred archers as good as yourself, you might have a chance to hold the castle,  a voice said softly.  When he turned, Maester Luwin was behind him.  Go away,  Theon told him.  I have had enough of your counsel.    And life? Have you had enough of that, my lord prince?   He raised the bow.  One more word and I’ll put this shaft through your heart.    You won’t.   Theon bent the bow, drawing the grey goose feathers back to his cheek.  Care to make a wager?    I am your last hope, Theon.   I have no hope, he thought. Yet he lowered the bow half an inch and said,  I will not run.    I do not speak of running. Take the black.    The Night’s Watch?  Theon let the bow unbend slowly and pointed the arrow at the ground.   Ser Rodrik has served House Stark all his life, and House Stark has always been a friend to the Watch. He will not deny you. Open your gates, lay down your arms, accept his terms, and he must let you take the black.   A brother of the Night’s Watch. It meant no crown, no sons, no wife… but it meant life, and life with honor. Ned Stark’s own brother had chosen the Watch, and Jon Snow as well.  I have black garb aplenty, once I tear the krakens off. Even my horse is black. I could rise high in the Watch—chief of rangers, likely even Lord Commander. Let Asha keep the bloody islands, they’re as dreary as she is. If I served at Eastwatch, I could command my own ship, and there’s fine hunting beyond the Wall. As for women, what wildling woman wouldn’t want a prince in her bed? A slow smile crept across his face, A black cloak can’t be turned. I’d be as good as any man…   PRINCE THEON!  The sudden shout shattered his daydream. Kromm was loping across the ward.  The northmen—   He felt a sudden sick sense of dread.  Is it the attack?   Maester Luwin clutched his arm.  There’s still time. Raise a peace banner—    They’re fighting,  Kromm said urgently.  More men came up, hundreds of them, and at first they made to join the others. But now they’ve fallen on them!    Is it Asha?  Had she come to save him after all?  But Kromm gave a shake of his head.  No. These are northmen, I tell you. With a bloody man on their banner.   The flayed man of the Dreadfort. Reek had belonged to the Bastard of Bolton before his capture, Theon recalled. It was hard to believe that a vile creature like him could sway the Boltons to change their allegiance, but nothing else made sense.  I’ll see this for myself,  Theon said.  Maester Luwin trailed after him. By the time they reached the battlements, dead men and dying horses were strewn about the market square outside the gates. He saw no battle lines, only a swirling chaos of banners and blades. Shouts and screams rang through the cold autumn air. Ser Rodrik seemed to have the numbers, but the Dreadfort men were better led, and had taken the others unawares. Theon watched them charge and wheel and charge again, chopping the larger force to bloody pieces every time they tried to form up between the houses. He could hear the crash of iron axeheads on oaken shields over the terrified trumpeting of a maimed horse. The inn was burning, he saw.  Black Lorren appeared beside him and stood silently for a time. The sun was low in the west, painting the fields and houses all a glowing red. A thin wavering cry of pain drifted over the walls, and a warhorn sounded off beyond the burning houses. Theon watched a wounded man drag himself painfully across the ground, smearing his life’s blood in the dirt as he struggled to reach the well that stood at the center of the market square. He died before he got there. He wore a leather jerkin and conical halfhelm, but no badge to tell which side he’d fought on.  The crows came in the blue dust, with the evening stars.  The Dothraki believe the stars are spirits of the valiant dead,  Theon said. Maester Luwin had told him that, a long time ago.   Dothraki?    The horselords across the narrow sea.    Oh. Them.  Black Lorren frowned through his beard.  Savages believe all manner of foolish things.   As the night grew darker and the smoke spread it was harder to make out what was happening below, but the din of steel gradually diminished to nothing, and the shouts and warhorns gave way to moans and piteous wailing. Finally a column of mounted men rode out of the drifting smoke."
}