{
  "id": "ed6495b071619cbada58c86b21c2b5e2a24ee4b0",
  "text": " When Doreah looked longingly at a fertility charm at a magician’s booth, Dany took that too and gave it to the handmaid, thinking that now she should find something for Irri and Jhiqui as well.  Turning a corner, they came upon a wine merchant offering thimble-sized cups of his wares to the passersby.  Sweet reds,  he cried in fluent Dothraki,  I have sweet reds, from Lys and Volantis and the Arbor. Whites from Lys, Tyroshi pear brandy, firewine, pepperwine, the pale green nectars of Myr. Smokeberry browns and Andalish sours, I have them, I have them.  He was a small man, slender and handsome, his flaxen hair curled and perfumed after the fashion of Lys. When Dany paused before his stall, he bowed low.  A taste for the khaleesi? I have a sweet red from Dorne, my lady, it sings of plums and cherries and rich dark oak. A cask, a cup, a swallow? One taste, and you will name your child after me.   Dany smiled.  My son has his name, but I will try your summerwine,  she said in Valyrian, Valyrian as they spoke it in the Free Cities. The words felt strange on her tongue, after so long.  Just a taste, if you would be so kind.   The merchant must have taken her for Dothraki, with her clothes and her oiled hair and sun-browned skin. When she spoke, he gaped at her in astonishment.  My lady, you are… Tyroshi? Can it be so?    My speech may be Tyroshi, and my garb Dothraki, but I am of Westeros, of the Sunset Kingdoms,  Dany told him.  Doreah stepped up beside her.  You have the honor to address Daenerys of the House Targaryen, Daenerys Stormborn, khaleesi of the riding men and princess of the Seven Kingdoms.   The wine merchant dropped to his knees.  Princess,  he said, bowing his head.   Rise,  Dany commanded him.  I would still like to taste that summerwine you spoke of.   The man bounded to his feet.  That? Dornish swill. It is not worthy of a princess. I have a dry red from the Arbor, crisp and delectable. Please, let me give you a cask.   Khal Drogo’s visits to the Free Cities had given him a taste for good wine, and Dany knew that such a noble vintage would please him.  You honor me, ser,  she murmured sweetly.   The honor is mine.  The merchant rummaged about in the back of his stall and produced a small oaken cask. Burned into the wood was a cluster of grapes.  The Redwyne sigil,  he said, pointing,  for the Arbor. There is no finer drink.    Khal Drogo and I will share it together. Aggo, take this back to my litter, if you’d be so kind.  The wineseller beamed as the Dothraki hefted the cask.  She did not realize that Ser Jorah had returned until she heard the knight say,  No.  His voice was strange, brusque.  Aggo, put down that cask.   Aggo looked at Dany. She gave a hesitant nod.  Ser Jorah, is something wrong?    I have a thirst. Open it, wineseller.   The merchant frowned.  The wine is for the khaleesi, not for the likes of you, ser.   Ser Jorah moved closer to the stall.  If you don’t open it, I’ll crack it open with your head.  He carried no weapons here in the sacred city, save his hands—yet his hands were enough, big, hard, dangerous, his knuckles covered with coarse dark hairs. The wineseller hesitated a moment, then took up his hammer and knocked the plug from the cask.   Pour,  Ser Jorah commanded. The four young warriors of Dany’s khas arrayed themselves behind him, frowning, watching with their dark, almond-shaped eyes.   It would be a crime to drink this rich a wine without letting it breathe.  The wineseller had not put his hammer down.  Jhogo reached for the whip coiled at his belt, but Dany stopped him with a light touch on the arm.  Do as Ser Jorah says,  she said. People were stopping to watch.  The man gave her a quick, sullen glance.  As the princess commands.  He had to set aside his hammer to lift the cask. He filled two thimble-sized tasting cups, pouring so deftly he did not spill a drop.  Ser Jorah lifted a cup and sniffed at the wine, frowning.   Sweet, isn’t it?  the wineseller said, smiling.  Can you smell the fruit, ser? The perfume of the Arbor. Taste it, my lord, and tell me it isn’t the finest, richest wine that’s ever touched your tongue.   Ser Jorah offered him the cup.  You taste it first.    Me?  The man laughed.  I am not worthy of this vintage, my lord. And it’s a poor wine merchant who drinks up his own wares.  His smile was amiable, yet she could see the sheen of sweat on his brow.   You will drink,  Dany said, cold as ice.  Empty the cup, or I will tell them to hold you down while Ser Jorah pours the whole cask down your throat.   The wineseller shrugged, reached for the cup… and grabbed the cask instead, flinging it at her with both hands. Ser Jorah bulled into her, knocking her out of the way. The cask bounced off his shoulder and smashed open on the ground. Dany stumbled and lost her feet.  No,  she screamed, thrusting her hands out to break her fall… and Doreah caught her by the arm and wrenched her backward, so she landed on her legs and not her belly.  The trader vaulted over the stall, darting between Aggo and Rakharo."
}