{
  "id": "f18b14b96d6bf95a69e0b2e569854fad02d1be10",
  "text": " Robb looked startled.  Grey Wind, to me. To me!   Instead the direwolf leapt forward, snarling.  Ser Ryman’s palfrey shied off with a whinny of fear, and Petyr Pimple’s reared and threw him. Only Black Walder kept his mount in hand. He reached for the hilt of his sword.  No!  Robb was shouting.  Grey Wind, here. Here.  Catelyn spurred between the direwolf and the horses. Mud spattered from the hooves of her mare as she cut in front of Grey Wind. The wolf veered away, and only then seemed to hear Robb calling.   Is this how a Stark makes amends?  Black Walder shouted, with naked steel in hand.  A poor greeting I call it, to set your wolf upon us. Is this why you’ve come?   Ser Ryman had dismounted to help Petyr Pimple back to his feet. The lad was muddy, but unhurt.   I’ve come to make my apology for the wrong I did your House, and to see my uncle wed.  Robb swung down from the saddle.  Petyr, take my horse. Yours is almost back to the stable.   Petyr looked to his father and said,  I can ride behind one of my brothers.   The Freys made no sign of obeisance.  You come late,  Ser Ryman declared.   The rains delayed us,  said Robb.  I sent a bird.    I do not see the woman.   By the woman Ser Ryman meant Jeyne Westerling, all knew. Lady Catelyn smiled apologetically.  Queen Jeyne was weary after so much travel, sers. No doubt she will be pleased to visit when times are more settled.    My grandfather will be displeased.  Though Black Walder had sheathed his sword, his tone was no friendlier.  I’ve told him much of the lady, and he wished to behold her with his own eyes.   Edwyn cleared his throat.  We have chambers prepared for you in the Water Tower, Your Grace,  he told Robb with careful courtesy,  as well as for Lord Tully and Lady Stark. Your lords bannermen are also welcome to shelter under our roof and partake of the wedding feast.    And my men?  asked Robb.   My lord grandfather regrets that he cannot feed nor house so large a host. We have been sore pressed to find fodder and provender for our own levies. Nonetheless, your men shall not be neglected. If they will cross and set up their camp beside our own, we will bring out enough casks of wine and ale for all to drink the health of Lord Edmure and his bride. We have thrown up three great feast tents on the far bank, to provide them with some shelter from the rains.    Your lord father is most kind. My men will thank him. They have had a long wet ride.   Edmure Tully edged his horse forward.  When shall I meet my betrothed?    She waits for you within,  promised Edwyn Frey.  You will forgive her if she seems shy, I know. She has been awaiting this day most anxiously, poor maid. But perhaps we might continue this out of the rain?    Truly.  Ser Ryman mounted up again, pulling Petyr Pimple up behind him.  If you would follow me, my father awaits.  He turned the palfrey’s head back toward the Twins.  Edmure fell in beside Catelyn.  The Late Lord Frey might have seen fit to welcome us in person,  he complained.  I am his liege lord as well as his son-to-be, and Robb’s his king.    When you are one-and-ninety, Brother, see how eager you are to go riding in the rain.  Yet she wondered if that was the whole truth of it. Lord Walder normally went about in a covered litter, which would have kept the worst of the rain off him. A deliberate slight? If so, it might be the first of many yet to come.  There was more trouble at the gatehouse. Grey Wind balked in the middle of the drawbridge, shook the rain off, and howled at the portcullis. Robb whistled impatiently.  Grey Wind. What is it? Grey Wind, with me.  But the direwolf only bared his teeth. He does not like this place, Catelyn thought. Robb had to squat and speak softly to the wolf before he would consent to pass beneath the portcullis. By then Lame Lothar and Walder Rivers had come up.  It’s the sound of the water he fears,  Rivers said.  Beasts know to avoid the river in flood.    A dry kennel and a leg of mutton will see him right again,  said Lothar cheerfully.  Shall I summon our master of hounds?    He’s a direwolf, not a dog,  said Robb,  and dangerous to men he does not trust. Ser Raynald, stay with him. I won’t take him into Lord Walder’s hall like this.   Deftly done, Catelyn decided. Robb keeps the Westerling out of Lord Walder’s sight as well.  Gout and brittle bones had taken their toll of old Walder Frey. They found him propped up in his high seat with a cushion beneath him and an ermine robe across his lap. His chair was black oak, its back carved into the semblance of two stout towers joined by an arched bridge, so massive that its embrace turned the old man into a grotesque child. There was something of the vulture about Lord Walder, and rather more of the weasel. His bald head, spotted with age, thrust out from his scrawny shoulders on a long pink neck. Loose skin dangled beneath his receding chin, his eyes were runny and clouded, and his toothless mouth moved constantly, sucking at the empty air as a babe sucks at his mother’s breast."
}