{
  "id": "f23c78aa0fa9f7d6e94f28647ff378d3bbb10eec",
  "text": " Hagrid had Norbert packed and ready in a large crate.  \"He's got lots o' rats an' some brandy fer the journey,\" said Hagrid in a muffled voice. \"An' I've packed his teddy bear in case he gets lonely.\"  From inside the crate came ripping noises that sounded to Harry as though the teddy was having his head torn off.  \"Bye-bye, Norbert!\" Hagrid sobbed, as Harry and Hermione covered the crate with the invisibility cloak and stepped underneath it themselves. \"Mommy will never forget you!\"  How they managed to get the crate back up to the castle, they never knew. Midnight ticked nearer as they heaved Norbert up the marble staircase in the entrance hall and along the dark corridors. UP another staircase, then another -- even one of Harry's shortcuts didn't make the work much easier.  \"Nearly there!\" Harry panted as they reached the corridor beneath the tallest tower.  Then a sudden movement ahead of them made them almost drop the crate. Forgetting that they were already invisible, they shrank into the shadows, staring at the dark outlines of two people grappling with each other ten feet away. A lamp flared.  Professor McGonagall, in a tartan bathrobe and a hair net, had Malfoy by the ear.  \"Detention!\" she shouted. \"And twenty points from Slytherin! Wandering around in the middle of the night, how dare you --\"  \"You don't understand, Professor. Harry Potter's coming -- he's got a dragon!\"  \"What utter rubbish! How dare you tell such lies! Come on -- I shall see Professor Snape about you, Malfoy!\"  The steep spiral staircase up to the top of the tower seemed the easiest thing in the world after that. Not until they'd stepped out into the cold night air did they throw off the cloak, glad to be able to breathe properly again. Hermione did a sort of jig.  \"Malfoy's got detention! I could sing!\"  \"Don't,\" Harry advised her.  Chuckling about Malfoy, they waited, Norbert thrashing about in his crate. About ten minutes later, four broomsticks came swooping down out of the darkness.  Charlie's friends were a cheery lot. They showed Harry and Hermione the harness they'd rigged up, so they could suspend Norbert between them. They all helped buckle Norbert safely into it and then Harry and Hermione shook hands with the others and thanked them very much.  At last, Norbert was going... going... gone.  They slipped back down the spiral staircase, their hearts as light as their hands, now that Norbert was off them. No more dragon -- Malfoy in detention -- what could spoil their happiness?  The answer to that was waiting at the foot of the stairs. As they stepped into the corridor, Filch's face loomed suddenly out of the darkness.  \"Well, well, well,\" he whispered, \"we are in trouble.\"  They'd left the invisibility cloak on top of the tower.   CHAPTER FIFTEEN  THE FORIBIDDEN FOREST  Things couldn't have been worse.  Filch took them down to Professor McGonagall's study on the first floor, where they sat and waited without saying a word to each other. Hermione was trembling. Excuses, alibis, and wild cover- up stories chased each other around Harry's brain, each more feeble than the last. He couldn't see how they were going to get out of trouble this time. They were cornered. How could they have been so stupid as to forget the cloak? There was no reason on earth that Professor McGonagall would accept for their being out of bed and creeping around the school in the dead of night, let alone being up the tallest astronomy tower, which was out-of-bounds except for classes. Add Norbert and the invisibility cloak, and they might as well be packing their bags already.  Had Harry thought that things couldn't have been worse? He was wrong. When Professor McGonagall appeared, she was leading Neville.  \"Harry!\" Neville burst Out, the moment he saw the other two. \"I was trying to find you to warn you, I heard Malfoy saying he was going to catch you, he said you had a drag --\"  Harry shook his head violently to shut Neville up, but Professor McGonagall had seen. She looked more likely to breathe fire than Norbert as she towered over the three of them.  \"I would never have believed it of any of you. Mr. Filch says you were up in the astronomy tower. It's one o'clock in the morning. Explain yourselves.\"  It was the first time Hermione had ever failed to answer a teacher's question. She was staring at her slippers, as still as a statue.  \"I think I've got a good idea of what's been going on,\" said Professor McGonagall. \"It doesn't take a genius to work it out. You fed Draco Malfoy some cock-and-bull story about a dragon, trying to get him out of bed and into trouble. I've already caught him. I suppose you think it's funny that Longbottom here heard the story and believed it, too?\"  Harry caught Neville's eye and tried to tell him without words that this wasn't true, because Neville was looking stunned and hurt. Poor, blundering Neville -- Harry knew what it must have cost him to try and find them in the dark, to warn them.  \"I'm disgusted,\" said Professor McGonagall."
}