{
  "id": "f5fb364adf865192b4d9eb82affd46e547e4b166",
  "text": " Jon Snow smiled. Stark shot a baffled look at Yoren. The old man grunted, shrugged, and went back to his bloody work.  The squirrel gave some body to the stew, and they ate it with black bread and hard cheese that night around their fire. Tyrion shared around his skin of wine until even Yoren grew mellow. One by one the company drifted off to their shelters and to sleep, all but Jon Snow, who had drawn the night’s first watch.  Tyrion was the last to retire, as always. As he stepped into the shelter his men had built for him, he paused and looked back at Jon Snow. The boy stood near the fire, his face still and hard, looking deep into the flames.  Tyrion Lannister smiled sadly and went to bed.      CATELYN  Ned and the girls were eight days gone when Maester Luwin came to her one night in Bran’s sickroom, carrying a reading lamp and the books of account.  It is past time that we reviewed the figures, my lady,  he said.  You’ll want to know how much this royal visit cost us.   Catelyn looked at Bran in his sickbed and brushed his hair back off his forehead. It had grown very long, she realized. She would have to cut it soon.  I have no need to look at figures, Maester Luwin,  she told him, never taking her eyes from Bran.  I know what the visit cost us. Take the books away.    My lady, the king’s party had healthy appetites. We must replenish our stores before—   She cut him off.  I said, take the books away. The steward will attend to our needs.    We have no steward,  Maester Luwin reminded her. Like a little grey rat, she thought, he would not let go.  Poole went south to establish Lord Eddard’s household at King’s Landing.   Catelyn nodded absently.  Oh, yes. I remember.  Bran looked so pale. She wondered whether they might move his bed under the window, so he could get the morning sun.  Maester Luwin set the lamp in a niche by the door and fiddled with its wick.  There are several appointments that require your immediate attention, my lady. Besides the steward, we need a captain of the guards to fill Jory’s place, a new master of horse—   Her eyes snapped around and found him.  A master of horse?  Her voice was a whip.  The maester was shaken.  Yes, my lady. Hullen rode south with Lord Eddard, so—    My son lies here broken and dying, Luwin, and you wish to discuss a new master of horse? Do you think I care what happens in the stables? Do you think it matters to me one whit? I would gladly butcher every horse in Winterfell with my own hands if it would open Bran’s eyes, do you understand that? Do you?   He bowed his head.  Yes, my lady, but the appointments—    I’ll make the appointments,  Robb said.  Catelyn had not heard him enter, but there he stood in the doorway, looking at her. She had been shouting, she realized with a sudden flush of shame. What was happening to her? She was so tired, and her head hurt all the time.  Maester Luwin looked from Catelyn to her son.  I have prepared a list of those we might wish to consider for the vacant offices,  he said, offering Robb a paper plucked from his sleeve.  Her son glanced at the names. He had come from outside, Catelyn saw; his cheeks were red from the cold, his hair shaggy and windblown.  Good men,  he said.  We’ll talk about them tomorrow.  He handed back the list of names.   Very good, my lord.  The paper vanished into his sleeve.   Leave us now,  Robb said. Maester Luwin bowed and departed. Robb closed the door behind him and turned to her. He was wearing a sword, she saw.  Mother, what are you doing?   Catelyn had always thought Robb looked like her; like Bran and Rickon and Sansa, he had the Tully coloring, the auburn hair, the blue eyes. Yet now for the first time she saw something of Eddard Stark in his face, something as stern and hard as the north.  What am I doing?  she echoed, puzzled.  How can you ask that? What do you imagine I’m doing? I am taking care of your brother. I am taking care of Bran.    Is that what you call it? You haven’t left this room since Bran was hurt. You didn’t even come to the gate when Father and the girls went south.    I said my farewells to them here, and watched them ride out from that window.  She had begged Ned not to go, not now, not after what had happened; everything had changed now, couldn’t he see that? It was no use. He had no choice, he had told her, and then he left, choosing.  I can’t leave him, even for a moment, not when any moment could be his last. I have to be with him, if… if…  She took her son’s limp hand, sliding his fingers through her own. He was so frail and thin, with no strength left in his hand, but she could still feel the warmth of life through his skin.  Robb’s voice softened.  He’s not going to die, Mother. Maester Luwin says the time of greatest danger has passed.    And what if Maester Luwin is wrong? What if Bran needs me and I’m not here?    Rickon needs you,  Robb said sharply.  He’s only three, he doesn’t understand what’s happening. He thinks everyone has deserted him, so he follows me around all day, clutching my leg and crying."
}