{
  "id": "f65a9781a1846fe5e22ae9a16b34823b7200ed14",
  "text": " He held it high over his head, and the pebble-dashed walls of number two suddenly sparkled; the garage door gleamed, and between them Harry saw, quite distinctly, the hulking outline of something very big, with wide, gleaming eyes.  Harry stepped backward. His legs hit his trunk and he tripped. His wand flew out of his hand as he flung out an arm to break his fall, and he landed, hard, in the gutter --  There was a deafening BANG, and Harry threw up his hands to shield his eyes against a sudden blinding light --  With a yell, he rolled back onto the pavement, just in time. A second later, a gigantic pair of wheels and headlights screeched to a halt exactly where Harry had just been lying. They belonged, as Harry saw when he raised his head, to a triple-decker, violently purple bus, which had appeared out of thin air. Gold lettering over the windshield spelled The Knight Bus.  For a Split second, Harry wondered if he had been knocked silly by his fall. Then a conductor in a purple uniform leapt out of the bus and began to speak loudly to the night.  \"Welcome to the Knight Bus, emergency transport for the stranded witch or wizard. just stick out your wand hand, step on board) and we can take you anywhere you want to go. My name is Stan Shunpike, and I will be your conductor this eve --\"  The conductor stopped abruptly. He had just caught sight of \"Harry, who was still sitting on the ground. Harry snatched up his wand again and scrambled to his feet. Close up, he saw that Stan Shunpike was only a few years older than he was, eighteen or nineteen at most, with large, protruding ears and quite a few pimples.  \"What were you doin' down there?\" said Stan, dropping his professional manner.  \"Fell over,\" said Harry.  \"'Choo fall over for?\" sniggered Stan.  \"I didn't do it on purpose,\" said Harry, annoyed. One of the knees in his jeans was torn, and the hand he had thrown out to break his fall was bleeding. He suddenly remembered why he had fallen over and turned around quickly to stare at the alleyway between the garage and fence. The Knight Bus's headlamps were flooding it with light, and it was empty.  \"'Choo lookin' at?\" said Stan.  \"There was a big black thing,\" said Harry, pointing uncertainly into the gap. \"Like a dog... but massive...\"  He looked a-round at Stan, whose mouth was slightly open. With a feeling of unease, Harry saw Stan's eyes move to the scar on Harry's forehead.  \"Woss that on your 'ead?\" said Stan abruptly.  \"Nothing,\" said Harry quickly, flattening his hair over his scar. If the Ministry of Magic was looking for him, he didn't want to make it too easy for them.  \"Woss your name?\" Stan persisted.  \"Neville Longbottom,\" said Harry, saying the first name that came into his head. \"So -- so this bus,\" he went on quickly, hoping to distract Stan, \"did you say it goes anywhere?\"  \"Yep,\" said Stan proudly, \"anywhere you like, long's it's on land. Can't do nuffink underwater. 'Ere,\" he said, looking suspicious again, ,You did flag us down, dincha? Stuck out your wand 'and, dincha?\"  \"Yes,\" said Harry quickly. \"Listen, how much would it be to get to London?\"  \"Eleven Sickles,\" said Stan, \"but for fifteen you get 'or chocolate, and for fifteen you get an 'ot water bottle an' a toofbrush in the color of your choice.\"  Harry rummaged once more in his trunk, extracted his money bag, and shoved some gold into Stan's hand. He and Stan then lifted his trunk, with Hedwig's cage balanced on top, up the steps of the bus.  There were no seats; instead, half a dozen brass bedsteads stood beside the curtained windows. Candles were burning in brackets beside each bed, illuminating the wood-paneled walls. A tiny wizard in a nightcap at the rear of the bus muttered, \"Not now, thanks, I'm pickling some slugs\" and rolled over in his sleep.  \"You 'ave this one,\" Stan whispered, shoving Harry's trunk under the bed right behind the driver, who was sitting in an armchair in front of the steering wheel. \"This is our driver, Ernie Prang. This ,is Neville Longbottom, Ern. \"  Ernie Prang, an elderly wizard wearing very thick glasses, nodded to Harry, who nervously flattened his bangs again and sat down on his bed.  \"Take 'er away, Ern,\" said Stan, sitting down in the armchair next to Ernie's.  There was another tremendous BANG, and the next moment Harry found himself flat on his bed, thrown backward by the speed of the Knight Bus. Pulling himself up, Harry stared out of the dark window and saw that they were now bowling along a completely different street. Stan was watching Harry's stunned face with great enjoyment.  \"This is where we was before you flagged us down,\" he said. \"Where are we, Ern? Somewhere in Wales?\"  \"Ar,\" said Ernie.  \"How come the Muggles don't hear the bus?\" said Harry.  \"Them!\" said Stan contemptuously. \"Don' listen properly, do they? Don' look properly either. Never notice nuffink, they don'.\"  \"Best go wake up Madam Marsh, Stan,\" said Ern. \"We'll be in Abergavenny in a minute.\"  Stan passed Harry's bed and disappeared up a narrow wooden staircase."
}