{
  "id": "f680bc7c78ee1d7a978ffdc70274dd2d144c9acd",
  "text": "  And beneath this, a single word had been written, in a hand Harry recognized as Hermione's. Pipes.  It was as though somebody had just flicked a light on in his brain.  \"Ron,\" he breathed. \"This is it. This is the answer. The monster in the Chamber's a basilisk - a giant serpent! That why I've been hearing that voice all over the place, and nobody else has heard it. It's because I understand Parseltongue . . . .\"  Harry looked up at the beds around him.  \"The basilisk kills people by looking at them. But no one's died - because no one looked it straight in the eye. Colin saw it through his camera. The basilisk burned up all the film inside it, but Colin just got Petrified. Justin . . . Justin must've seen the basilisk through Nearly Headless Nick! Nick got the full blast of it, but he couldn't die again . . . and Hermione and that Ravenclaw prefect were found with a mirror next to them. Hermione had just realized the monster was a basilisk. I bet you anything she warned the first person she met to look around corners with a mirror first! And that girl pulled out her mirror - and -\"  Rods jaw had dropped.  \"And Mrs. Norris?\" he whispered eagerly.  Harry thought hard, picturing the scene on the night of Halloween.  \"The water. . .\" he said slowly. \"The flood from Moaning Myrtle's bathroom. I bet you Mrs. Norris only saw the reflection . . . .\"  He scanned the page in his hand eagerly. The more he looked at it, the more it made sense.  `: . . The crowing of the rooster . . . is fatal to it\"! he read aloud. \"Hagrid's roosters were killed! The Heir of Slytherin didn't want one anywhere near the castle once the Chamber was opened! Spidersflee before it.! It all fits!\"  \"But how's the basilisk been getting around the place?\" said Ron. \"A giant snake . . . Someone would've seen. . .\"  Harry, however, pointed at the word Hermione had scribbled at the foot of the page.  \"Pipes,\" he said. \"Pipes . . . Ron, it's been using the plumbing. I've been hearing that voice inside the walls . . . .\"  291*  Ron suddenly grabbed Harry's arm. \"The entrance to the Chamber of Secrets!\" he said hoarsely. \"What if it's a bathroom? What if it's in -\" `= Moaning Myrtle's bathroom, \"said Harry. They sat there, excitement coursing through them, hardly able to believe it. \"This means,\" said Harry, \"I can't be the only Parselmouth in the school. The Heir of Slytherin's one, too. That's how he's been controlling the basilisk.\" \"What're we going to do?\" said Ron, whose eyes were flashing. \"Should we go straight to McGonagall?\" \"Let's go to the staff room,\" said Harry, jumping up. \"She'll be there in ten minutes. It's nearly break.\" They ran downstairs. Not wanting to be discovered hanging around in another corridor, they went straight into the deserted staff room. It was a large, paneled room full of dark, wooden chairs. Harry and Ron paced around it, too excited to sit down. But the bell to signal break never came. Instead, echoing through the corridors came Professor McGon agall's voice, magically magnified. `All students to return to their House dormitories at once. All teach ers return to the staff room. Immediately, please. \"  Harry wheeled around to stare at Ron. \"Not another attack? Not now?\" \"What'll we do?\" said Ron, aghast. \"Go back to the dormitory?\" \"No,\" said Harry, glancing around. There was an ugly sort of wardrobe to his left, full of the teachers' cloaks. \"In here. Let's hear what it's all about. Then we can tell them what we've found out.\"  They hid themselves inside it, listening to the rumbling of hundreds of people moving overhead, and the staff room door banging open. From between the musty folds of the cloaks, they watched the teachers filtering into the room. Some of them were looking puzzled, others downright scared. Then Professor McGonagall arrived.  \"It has happened,\" she told the silent staff room. \"A student has been taken by the monster. Right into the Chamber itself.\"  Professor Flitwick let out a squeal. Professor Sprout clapped her hands over her mouth. Snape gripped the back of a chair very hard and said, \"How can you be sure?\"  \"The Heir of Slytherin,\" said Professor McGonagall, who was very white, \"left another message. Right underneath the first one. `Her skeleton will lie in the Chamber forever. \"'  Professor Flitwick burst into tears.  \"Who is it?\" said Madam Hooch, who had sunk, weak-kneed, into a chair. \"Which student?\"  \"Ginny Weasley,\" said Professor McGonagall.  Harry felt Ron slide silently down onto the wardrobe floor beside him.  \"We shall have to send all the students home tomorrow,\" said Professor McGonagall. \"This is the end of Hogwarts. Dumbledore always said. . .\"  The staffroom door banged open again. For one wild moment, Harry was sure it would be Dumbledore. But it was Lockhart, and he was beaming.  \"So sorry - dozed off - what have I missed?\"  He didn't seem to notice that the other teachers were looking at him with something remarkably like hatred. Snape stepped forward.  \"Just the man,\" he said."
}