{
  "id": "f6e3d47461f0c1125bc0f5cfb0653a8933acdbff",
  "text": " How would Arry know lords and such?   Are you blind, man?  Yoren waved his staff back and forth, making the cloak ripple.  You see a bloody lightning bolt?    By night all banners look black,  the knight in the spiked helm observed.  Open, or we’ll know you for outlaws in league with the king’s enemies.   Yoren spat.  Who’s got your command?    I do.  The reflections of burning houses glimmered dully on the armor of his warhorse as the others parted to let him pass. He was a stout man with a manticore on his shield, and ornate scrollwork crawling across his steel breastplate. Through the open visor of his helm, a face pale and piggy peered up.  Ser Amory Lorch, bannerman to Lord Tywin Lannister of Casterly Rock, the Hand of the King. The true king, Joffrey.  He had a high, thin voice.  In his name, I command you to open these gates.   All around them, the town burned. The night air was full of smoke, and the drifting red embers outnumbered the stars. Yoren scowled.  Don’t see the need. Do what you want to the town, it’s naught to me, but leave us be. We’re no foes to you.   Look with your eyes, Arya wanted to shout at the men below.  Can’t they see we’re no lords or knights?  she whispered.   I don’t think they care, Arry,  Gendry whispered back.  And she looked at Ser Amory’s face, the way Syrio had taught her to look, and she saw that he was right.   If you are no traitors, open your gates,  Ser Amory called.  We’ll make certain you’re telling it true and be on our way.   Yoren was chewing sourleaf.  Told you, no one here but us. You got my word on that.   The knight in the spiked helm laughed.  The crow gives us his word.    You lost, old man?  mocked one of the spearmen.  The Wall’s a long way north o’ here.    I command you once more, in King Joffrey’s name, to prove the loyalty you profess and open these gates,  said Ser Amory.  For a long moment Yoren considered, chewing. Then he spat.  Don’t think I will.    So be it. You defy the king’s command, and so proclaim yourselves rebels, black cloaks or no.    Got me young boys in here,  Yoren shouted down.   Young boys and old men die the same.  Ser Amory raised a lanquid fist, and a spear came hurtling from the fire-bright shadows behind. Yoren must have been the target, but it was Woth beside him who was hit. The spearhead went in his throat and exploded out the back of his neck, dark and wet. Woth grabbed at the shaft, and fell boneless from the walk.   Storm the walls and kill them all,  Ser Amory said in a bored voice. More spears flew. Arya yanked down Hot Pie by the back of his tunic. From outside came the rattle of armor, the scrape of swords on scabbards, the banging of spears on shields, mingled with curses and the hoofbeats of racing horses. A torch sailed spinning above their heads, trailing fingers of fire as it thumped down in the dirt of the yard.   Blades!  Yoren shouted.  Spread apart, defend the wall wherever they hit. Koss, Urreg, hold the postern. Lommy, pull that spear out of Woth and get up where he was.   Hot Pie dropped his shortsword when he tried to unsheath it. Arya shoved the blade back into his hand.  I don’t know how to swordfight,  he said, white-eyed.   It’s easy,  Arya said, but the lie died in her throat as a hand grasped the top of the parapet. She saw it by the light of the burning town, so clear that it was as if time had stopped. The fingers were blunt, callused, wiry black hairs grew between the knuckles, there was dirt under the nail of the thumb. Fear cuts deeper than swords, she remembered as the top of a pothelm loomed up behind the hand.  She slashed down hard, and Needle’s castle-forged steel bit into the grasping fingers between the knuckles.  Winterfell!  she screamed. Blood spurted, fingers flew, and the helmed face vanished as suddenly as it had appeared.  Behind!  Hot Pie yelled. Arya whirled. The second man was bearded and helmetless, his dirk between his teeth to leave both hands free for climbing. As he swung his leg over the parapet, she drove her point at his eyes. Needle never touched him; he reeled backward and fell. I hope he falls on his face and cuts off his tongue.  Watch them, not me!  she screamed at Hot Pie. The next time someone tried to climb their part of the wall, the boy hacked at his hands with his swordshort until the man dropped away.  Ser Amory had no ladders, but the holdfast walls were rough-cut and unmortared, easy to climb, and there seemed to be no end to the foes. For each one Arya cut or stabbed or shoved back, another was coming over the wall. The knight in the spiked helm reached the rampart, but Yoren tangled his black banner around his spike, and forced the point of his dirk through his armor while the man was fighting the cloth. Every time Arya looked up, more torches were flying, trailing long tongues of flame that lingered behind her eyes. She saw a gold lion on a red banner and thought of Joffrey, wishing he was here so she could drive Needle through his sneery face. When four men assaulted the gate with axes, Koss shot them down with arrows, one by one."
}