{
  "id": "f7a768e6eb97d706365810ee38b3ba2586f4a439",
  "text": " And you  can tell me  nothing of the cleaving of the horn? '       'No, I did not know of it,' said Frodo. `But the day when you  heard it  blowing, if your reckoning is true, was  the day when we parted, when  I and   my servant left the Company.  And now your  tale fills me with dread. For if  Boromir was then in peril and was slain, I  must fear that all my companions  perished too. And they were my kindred and my friends.       `Will you not put aside your dou bt of me and let me go? I am weary, and  full of grief, and  afraid. But I have a deed to do, or to attempt, before I  too am slain. And the more need of haste, if  we two halflings are  all that  remain of our fellowship.       'Go back, Faramir,  valiant Captain of  Gondor,  and  defend  your city  while you may, and let me go where my doom takes me.'       `For me there is no comfort in our speech together,' said Faramir; `but  you surely draw from it more dread than need be. Unless the people of Lurien  themselves came  to him,  who arrayed Boromir  as for a funeral? Not Orcs or   servants of the Nameless. Some of your Company, I guess, live still.       `But whatever befell on the North March, you, Frodo, I doubt no longer.   ####-If  hard days  have made  me  any judge of Men's words and faces, then I may  make a guess at Halflings! Though,' and  now he  smiled, `there is something  strange about you, Frodo, an elvish air, maybe. But more lies upon our words  together than I thought at first. I should now take you back to Minas Tirith  to answer  there to Denethor, and my  life will justly be forfeit, if  I now  choose a course that  proves ill for my city. So I will not  decide in haste  what is to be done. Yet we must move hence without more delay.'       He  sprang to his feet and issued some orders. At once the men who were  gathered round  him broke up into small  groups, and went off  this way  and   that, vanishing quickly into the shadows of the  rocks and  trees. Soon only  Mablung and Damrod remained.       'Now you,  Frodo  and Samwise, will come  with me  and my guards,' said  Faramir. `You cannot go along the road southwards, if that was your purpose.  It will be unsafe for some days, and always more closely watched after  this  affray than it has been yet. And  you cannot,  I  think, go far today in any  case, for you are weary. And so are we.  We are going  now to a secret place   we  have, somewhat less than ten  miles from here. The Orcs and spies of the  Enemy have not found  it yet, and if they did, we  could  hold  it long even  against many. There we may lie up and rest for  a while, and you with us. In  the morning I will decide what is best for me to do, and for you.'       There was nothing for Frodo to do but to  fall in with this request, or   order. It seemed in any case a  wise course for the moment, since this  foray  of the men  of  Gondor had made a  journey  in Ithilien more  dangerous than  ever.       They set out  at once: Mablung and  Damrod  a little ahead, and Faramir  with Frodo  and Sam  behind.  Skirting the hither  side of the pool where the  hobbits had bathed, they crossed the stream, climbed a long bank, and passed  into  green-shadowed woodlands that marched  ever downwards  and   westwards.   While they walked, as swiftly as the hobbits could go, they talked in hushed  voices.       'I broke off our speech together,' said Faramir, 'not only because time  pressed, as Master Samwise had reminded me, but also because we were  drawing  near to matters that were better not debated openly  before many men. It was  for that  reason that I turned rather to the matter of my brother and let be  Isildur's Bane. You were not wholly frank with me, Frodo.'   ####-     `I told no lies, and of the truth all I could,' said Frodo.       `I do  not blame you,'  said Faramir. 'You spoke  with skill  in  a hard  place, and wisely,  it seemed to me. But I learned or  guessed more from you   than your words said. You  were  not friendly with Boromir, or  you  did not   part  in  friendship.  You, and  Master  Samwise,  too,  I  guess have  some  grievance. Now I  loved him dearly, and would gladly avenge his death, yet I  knew  him well. Isildur's  Bane  -- I would hazard that  Isildur's Bane  lay  between you and was a cause of contention in  your Company. Clearly it is  a  mighty  heirloom  of some sort,  and such  things do not  breed  peace among  confederates, not if aught may be  learned from  ancient tales. Do I not hit  near the mark?'       `Near,' said Frodo,  'but  not in the gold.  There was no contention in  our Company, though there was doubt: doubt which way we should take from  the  Emyn  Muil. But be that as it may, ancient  tales teach us also the peril of  rash words concerning such things as  -- heirlooms.'       'Ah,  then it is as I  thought: your trouble was with Boromir alone. He  wished this  thing  brou ght to Minas Tirith. Alas! it is a crooked fate that  seals  your lips who saw him  last, and holds from me that  which I  long to  know: what  was  in his  heart and  thought  in his latest hours."
}