{
  "id": "f7d11043971aca054c471ed87e3136092cba2536",
  "text": " But I agree that we can go no further tonight.'       'What is the matter with my  master?' asked Sam in a low voice, looking  appealingly  at Strider.  'His  wound was small, and it is  already  closed.  There's nothing to be seen but a cold white mark on his shoulder.'       'Frodo  has been  touched  by the weapons of  the Enemy,' said Strider,  'and there is some poison  or evil at work that is beyond my  skill to drive  out. But do not give up hope, Sam!'       Night was cold up on the  high ridge. They lit a small fire  down under  the gnarled roots of an old pine, that hung over a shallow pit: it looked as  if stone had once been  quarried there. They sat  huddled together. The wind  blew chill through the pass, and they heard the tree-tops lower down moaning  and  sighing.  Frodo lay half in a dream, imagining that endless dark  wings  were sweeping by above him, and that on the wings rode pursuers that  sought  him in all the hollows of the hills.        The  morning dawned bright  and fair; the air  was clean, and the light  pale and clear  in a rain-washed sky. Their hearts were encouraged, but (hey  longed for the  sun to warm their cold stiff limbs. As soon as it was light,  Strider took Merry  with him and went to survey the country from  the height  to the east of the pass. The sun had risen and was shining  brightly when he  returned  with more comforting news. They were now going more or less in the  right direction. If they went on, down the  further side of the ridge,  they  would have the Mountains on their left. Some way  ahead Strider had caught a   glimpse  of the Loudwater again, and he knew that, though it was hidden from   ####-view, the Road to the  Ford was not far from the River  and  lay on the side  nearest to them.       'We must make for  the  Road again,' he said. 'We cannot hope to find a   path through these hills. Whatever danger may beset it, the Road is our only  way to the Ford.'       As soon as they had eaten they set out again. They climbed  slowly down  the southern side  of the ridge; but the way  was much easier  than they had  expected, for the slope  was  far less steep on  this side, and before  long  Frodo was able  to  ride again. Bill Ferny's poor old pony was developing an  unexpected talent  for picking out a path, and for sparing its rider as many  jolts as possible. The  spirits of the  party  rose  again. Even  Frodo felt  better in  the  morning  light, but every  now  and again  a mist seemed  to  obscure his sight, and he pa ssed his hands over his eyes.        Pippin was a little  ahead of the  others. Suddenly he turned round and  called to them. 'There is a path here!' he cried.       When they came up with him, they saw that he had made no mistake:       there were clearly  the beginnings of  a  path, that climbed  with many  windings  out of  the woods  below and faded away on the hill-top behind. In  places it was  now faint and overgrown,  or choked  with fallen  stones  and  trees; but at one time it seemed to have been much used.  It was a path made  by strong arms  and heavy feet. Here and  there old trees  had  been cut  or   broken down, and large rocks cloven or heaved aside to make a way.       They followed the track for some while, for it offered much the easiest   way down, but they went cautiously, and their anxiety increased as they came  into the dark  woods, and the path grew plainer and broader. Suddenly coming  out  of a belt of fir-trees  it ran steeply down a slope, and turned sharply  to the left round the comer  of a rocky shoulder of the hill. When they came  to the comer they  looked round and  saw  that the path ran on  over a level  strip  under the face of a low  cliff overhung with trees. In the stony wall  there was a door hanging crookedly ajar upon one great hinge.       Outside the door they all  halted. There was  a  cave  or  rock -chamber   behind, but  in the gloom  inside nothing  could be  seen. Strider, Sam, and  Merry  pushing with all  their  strength managed  to open  the door a little  wider, and then Strider  and Merry  went in. They did not go far, for on the  floor lay many old bones, and nothing else was to be seen  near the entrance  except some great empty jars and broken pots.       'Surely  this  is a troll-hole, if ever there  was one!'  said  Pippin.   ####-'Come out, you two, and let us get away. Now we know  who made the path  - and  we had better get off it quick.'       'There  is  no  need, I think,'  said  Strider,  coining  out.  'It  is  certainly a troll-hole,  but it seems  to have  been  long forsaken. I don't  think we need be afraid. But let us go on down warily, and we shall see.'       The  path  went on again from the door, and turning to the right  again  across the level space plunged down a thick wooded slope. Pippin, not liking  to show Strider that he was still afraid, went on ahead  with Merry. Sam and  Strider came behind, one on each side of  Frodo's pony, for the path was now  broad enough for four or five hobbits to walk abreast."
}