{
  "id": "f88ff2eb02047b5590b1a8829bd2eb8ede01c57b",
  "text": ".. we will recall the banished giants ... I shall have all my devoted servants returned to me, and an army of creatures whom all fear. ...\" He walked on. Some of the Death Eaters he passed in silence, but he paused before others and spoke to them. \"Macnair . . . destroying dangerous beasts for the Ministry of Magic now, Wormtail tells me?  You shall have better victims than that soon, Macnair.  Lord Voldemort will provide. ...\" \"Thank you, Master . . . thank you,\" murmured Macnair. \"And here\" - Voldemort moved on to the two largest hooded figures - \"we have Crabbe . . . you will do better this time, will you not, Crabbe?  And you, Goyle?\" They bowed clumsily, muttering dully. \"Yes, Master ...\" \"We will, Master....\" \"The same goes for you, Nott,\" said Voldemort quietly as he walked past a stooped figure in Mr. Goyles shadow. \"My Lord, I prostrate myself before you, I am your most faithful -\" \"That will do,\" said Voldemort. He had reached the largest gap of all, and he stood surveying it with his blank, red eyes, as though he could see people standing there. \"And here we have six missing Death Eaters . . . three dead in my service. One, too cowardly to return ... he will pay.  One, who I believe has left me forever ... he will be killed, of course . . . and one, who remains my most faithful servant, and who has already reentered my service.\" The Death Eaters stirred, and Harry saw their eyes dart sideways at one another through their masks. \"He is at Hogwarts, that faithful servant, and it was through his efforts that our young friend arrived here tonight. . . . \"Yes,\" said Voldemort, a grin curling his lipless mouth as the eyes of the circle flashed in Harry's direction.  \"Harry Potter has kindly joined us for my rebirthing party.  One might go so far as to call him my guest of honor.\" There was a silence.  Then the Death Eater to the right of Wormtail stepped forward, and Lucius Malfoy's voice spoke from under the mask. \"Master, we crave to know ... we beg you to tell us ... how you have achieved this . . . this miracle . . . how you managed to return to us. .. .\" \"Ah, what a story it is, Lucius,\" said Voldemort.  \"And it begins - and ends - with my young friend here.\" He walked lazily over to stand next to Harry, so that the eyes of the whole circle were upon the two of them.  The snake continued to circle. \"You know, of course, that they have called this boy my downfall?\"  Voldemort said softly, his red eyes upon Harry, whose scar began to burn so fiercely that he almost screamed in agony.  \"You all know that on the night I lost my powers and my body, I tried to kill him.  His mother died in the attempt to save him - and unwittingly provided him with a protection I admit I had not foreseen. ... I could not touch the boy.\" Voldemort raised one of his long white fingers and put it very close to Harry's cheek. \"His mother left upon him the traces other sacrifice. . . . This is old magic, I should have remembered it, I was foolish to overlook it... but no matter. I can touch him now.\" Harry felt the cold tip of the long white finger touch him, and thought his head would burst with the pain. Voldemort laughed softly in his ear, then took the finger away and continued addressing the Death Eaters. \"I miscalculated, my friends, I admit it.  My curse was deflected by the woman's foolish sacrifice, and it rebounded upon myself.  Aaah . . . pain beyond pain, my friends; nothing could have prepared me for it.  I was ripped from my body, I was less than spirit, less than the meanest ghost. . . but still, I was alive.  What I was, even I do not know... I, who have gone further than anybody along the path that leads to immortality.  You know my goal - to conquer death.  And now, I was tested, and it appeared that one or more of my experiments had worked ... for I had not been killed, though the curse should have done it.  Nevertheless, I was as powerless as the weakest creature alive, and without the means to help myself... for I had no body, and every spell that might have helped me required the use of a wand. . . . \"I remember only forcing myself, sleeplessly, endlessly, second by second, to exist. ... I settled in a faraway place, in a forest, and I waited. . . . Surely, one of my faithful Death Eaters would try and find me. . . one of them would come and perform the magic I could not, to restore me to a body . . , but I waited in vain. ...\" The shiver ran once more around the circle of listening Death Eaters.  Voldemort let the silence spiral horribly before continuing. \"Only one power remained to me.  I could possess the bodies of others.  But I dared not go where other humans were plentiful, for I knew that the Aurors were still abroad and searching for me. I sometimes inhabited animals - snakes, of course, being my preference - but I was little better off inside them than as pure spirit, for their bodies were ill adapted to perform magic . . . and my possession of them shortened their lives; none of them lasted long."
}