{
  "id": "f94a6a702baf9d2a33fce0ca923442a6d52aa192",
  "text": " He lay and watched his birthday tick nearer, wondering if the Dursleys would remember at all, wondering where the letter writer was now.  Five minutes to go. Harry heard something creak outside. He hoped the roof wasn't going to fall in, although he might be warmer if it did. Four minutes to go. Maybe the house in Privet Drive would be so full of letters when they got back that he'd be able to steal one somehow.  Three minutes to go. Was that the sea, slapping hard on the rock like that? And (two minutes to go) what was that funny crunching noise? Was the rock crumbling into the sea?  One minute to go and he'd be eleven. Thirty seconds... twenty ... ten... nine -- maybe he'd wake Dudley up, just to annoy him -- three... two... one...  BOOM.  The whole shack shivered and Harry sat bolt upright, staring at the door. Someone was outside, knocking to come in.   CHAPTER FOUR  THE KEEPER OF THE KEYS  BOOM. They knocked again. Dudley jerked awake. \"Where's the cannon?\" he said stupidly.  There was a crash behind them and Uncle Vernon came skidding into the room. He was holding a rifle in his hands -- now they knew what had been in the long, thin package he had brought with them.  \"Who's there?\" he shouted. \"I warn you -- I'm armed!\"  There was a pause. Then --  SMASH!  The door was hit with such force that it swung clean off its hinges and with a deafening crash landed flat on the floor.  A giant of a man was standing in the doorway. His face was almost completely hidden by a long, shaggy mane of hair and a wild, tangled beard, but you could make out his eyes, glinting like black beetles under all the hair.  The giant squeezed his way into the hut, stooping so that his head just brushed the ceiling. He bent down, picked up the door, and fitted it easily back into its frame. The noise of the storm outside dropped a little. He turned to look at them all.  \"Couldn't make us a cup o' tea, could yeh? It's not been an easy journey...\"  He strode over to the sofa where Dudley sat frozen with fear.  \"Budge up, yeh great lump,\" said the stranger.  Dudley squeaked and ran to hide behind his mother, who was crouching, terrified, behind Uncle Vernon.  \"An' here's Harry!\" said the giant.  Harry looked up into the fierce, wild, shadowy face and saw that the beetle eyes were crinkled in a smile.  \"Las' time I saw you, you was only a baby,\" said the giant. \"Yeh look a lot like yet dad, but yeh've got yet mom's eyes.\"  Uncle Vernon made a funny rasping noise.  I demand that you leave at once, sit!\" he said. \"You are breaking and entering!\"  \"Ah, shut up, Dursley, yeh great prune,\" said the giant; he reached over the back of the sofa, jerked the gun out of Uncle Vernon's hands, bent it into a knot as easily as if it had been made of rubber, and threw it into a corner of the room.  Uncle Vernon made another funny noise, like a mouse being trodden on.  \"Anyway -- Harry,\" said the giant, turning his back on the Dursleys, \"a very happy birthday to yeh. Got summat fer yeh here -- I mighta sat on it at some point, but it'll taste all right.\"  From an inside pocket of his black overcoat he pulled a slightly squashed box. Harry opened it with trembling fingers. Inside was a large, sticky chocolate cake with Happy Birthday Harry written on it in green icing.  Harry looked up at the giant. He meant to say thank you, but the words got lost on the way to his mouth, and what he said instead was, \"Who are you?\"  The giant chuckled.  \"True, I haven't introduced meself. Rubeus Hagrid, Keeper of Keys and Grounds at Hogwarts.\"  He held out an enormous hand and shook Harry's whole arm.  \"What about that tea then, eh?\" he said, rubbing his hands together. \"I'd not say no ter summat stronger if yeh've got it, mind.\"  His eyes fell on the empty grate with the shriveled chip bags in it and he snorted. He bent down over the fireplace; they couldn't see what he was doing but when he drew back a second later, there was a roaring fire there. It filled the whole damp hut with flickering light and Harry felt the warmth wash over him as though he'd sunk into a hot bath.  The giant sat back down on the sofa, which sagged under his weight, and began taking all sorts of things out of the pockets of his coat: a copper kettle, a squashy package of sausages, a poker, a teapot, several chipped mugs, and a bottle of some amber liquid that he took a swig from before starting to make tea. Soon the hut was full of the sound and smell of sizzling sausage. Nobody said a thing while the giant was working, but as he slid the first six fat, juicy, slightly burnt sausages from the poker, Dudley fidgeted a little. Uncle Vernon said sharply, \"Don't touch anything he gives you, Dudley.\"  The giant chuckled darkly.  \"Yet great puddin' of a son don' need fattenin' anymore, Dursley, don' worry.\"  He passed the sausages to Harry, who was so hungry he had never tasted anything so wonderful, but he still couldn't take his eyes off the giant. Finally, as nobody seemed about to explain anything, he said, \"I'm sorry, but I still don't really know who you are."
}