{
  "id": "f96af3229c4298fcfa6c2b8f66acf9672b1c16fa",
  "text": "  C H A P T X IR  N I N E  THE WRTITING ON THE WALL  What's going on here? What's going on?\" Attracted no doubt by Malfoy's shout, Argus Filch came shouldering his way through the crowd. Then he saw Mrs. Norris and fell back, clutching his face in horror.  \"My cat! My cat! What's happened to Mrs. Norris?\" he shrieked.  And his popping eyes fell on Harry.  \"You!\"he screeched. \"You! You've murdered my cat! You've killed her! I'll kill you! I'll -\"  \"Argus!\"  Dumbledore had arrived on the scene, followed by a number of other teachers. In seconds, he had swept past Harry, Ron, and Hermione and detached Mrs. Norris from the torch bracket.  \"Come with me, Argus,\" he said to Filch. \"You, too, Mr. Potter, Mr. Weasley, Miss Granger.\"  Lockhart stepped forward eagerly.  *140*    \"My office is nearest, Headmaster - just upstairs - please feel free -\"  \"Thank you, Gilderoy,\" said Dumbledore.  The silent crowd parted to let them pass. Lockhart, looking excited and important, hurried after Dumbledore; so did Professors McGonagall and Snape.  As they entered Lockhart's darkened office there was a flurry of movement across the walls; Harry saw several of the Lockharts in the pictures dodging out of sight, their hair in rollers. The real Lockhart lit the candles on his desk and stood back. Dumbledore lay Mrs. Norris on the polished surface and began to examine her. Harry, Ron, and Hermione exchanged tense looks and sank into chairs outside the pool of candlelight, watching.  The tip of Dumbledore's long, crooked nose was barely an inch from Mrs. Norris's fur. He was looking at her closely through his half-moon spectacles, his long fingers gently prodding and poking. Professor McGonagall was bent almost as close, her eyes narrowed. Snape loomed behind them, half in shadow, wearing a most peculiar expression: It was as though he was trying hard not to smile. And Lockhart was hovering around all of them, making suggestions.  \"It was definitely a curse that killed her - probably the Transmogrifian Torture - I've seen it used many times, so unlucky I wasn't there, I know the very countercurse that would have saved her . .....  Lockhart's comments were punctuated by Filch's dry, racking sobs. He was slumped in a chair by the desk, unable to look at Mrs. Norris, his face in his hands. Much as he detested Filch, Harry  *141*  couldn't help feeling a bit sorry for him, though not nearly as sorry as he felt for himself If Dumbledore believed Filch, he would be expelled for sure.  Dumbledore was now muttering strange words under his breath and tapping Mrs. Norris with his wand but nothing happened: She continued to look as though she had been recently stuffed.  \". . . I remember something very similar happening in Ouagadogou,\" said Lockhart, \"a series of attacks, the full story's in my autobiography, I was able to provide the townsfolk with various amulets, which cleared the matter up at once ......  The photographs of Lockhart on the walls were all nodding in agreement as he talked. One of them had forgotten to remove his hair net.  At last Dumbledore straightened up.  \"She's not dead, Argus,\" he said softly.  Lockhart stopped abruptly in the middle of counting the number of murders he had prevented.  \"Not dead?\" choked Filch, looking through his fingers at Mrs. Norris. \"But why's she all - all stiff and frozen?\"  \"She has been Petrified,\" said Dumbledore (\"Ah! I thought so!\" said Lockhart). \"But how, I cannot say . . . .\"  \"Ask him!\" shrieked Filch, turning his blotched and tearstained face to Harry.  \"No second year could have done this,\" said Dumbledore firmly. \"it would take Dark Magic of the most advanced -\"  \"He did it, he did it!\" Filch spat, his pouchy face purpling. \"You saw what he wrote on the wall! He found - in my office - he knows I'm a - I'm a -\" Filch's face worked horribly. \"He knows I'm a Squib!\" he finished.  142  \"I never touched Mrs. Norris!\" Harry said loudly, uncomfortably aware of everyone looking at him, including all the Lockharts on the walls. \"And I don't even know what a Squib is.\"  \"Rubbish!\" snarled Filch. \"He saw my Kwikspell letter!\"  \"If I might speak, Headmaster,\" said Snape from the shadows, and Harry's sense of forboding increased; he was sure nothing Snape had to say was going to do him any good.  \"Potter and his friends may have simply been in the wrong place at the wrong time,\" he said, a slight sneer curling his mouth as though he doubted it. \"But we do have a set of suspicious circumstances here. Why was he in the upstairs corridor at all? Why wasn't he at the Halloween feast?\"  Harry, Ron and Hermione all launched into an explanation about the deathday party. \". . . there were hundreds of ghosts, theyll tell you we were there -\"  \"But why not join the feast afterward?\" said Snape, his black eyes glittering in the candlelight. \"Why go up to that corridor?\"  Ron and Hermione looked at Harry.  \"Because - because -\" Harry said, his heart thumping very fast; something told him it would sound very far-fetched if he told them he had been led there by a bodiless voice no one but he could hear, \"because we were tired and wanted to go to bed,\" he said."
}