{
  "id": "fc62143a82d99df0e41ea1e1a82d641648e306fa",
  "text": " What troubles you?   Tyrion could not see his fingers in front of his face, but he ticked his woes off on them all the same.  My wife. My sister. My nephew. My father. The Tyrells.  He had to move to his other hand.  Varys. Pycelle. Littlefinger. The Red Viper of Dorne.  He had come to his last finger.  The face that stares back out of the water when I wash.   Shae kissed his maimed scarred nose.  A brave face. A kind and good face. I wish I could see it now.   All the sweet innocence of the world was in her voice. Innocence? Fool, she’s a whore, all she knows of men is the bit between their legs. Fool, fool.  Better you than me.  Tyrion sat.  We have a long day before us, both of us. You shouldn’t have blown out that taper. How are we to find our clothing?   She laughed.  Maybe we’ll have to go naked.   And if we’re seen, my lord father will hang you. Hiring Shae as one of Sansa’s maids had given him an excuse to be seen talking with her, but Tyrion did not delude himself that they were safe. Varys had warned him.  I gave Shae a false history, but it was meant for Lollys and Lady Tanda. Your sister is of a more suspicious mind. If she should ask me what I know…    You will tell her some clever lie.    No. I will tell her that the girl is a common camp follower that you acquired before the battle on the Green Fork and brought to King’s Landing against your lord father’s express command. I will not lie to the queen.    You have lied to her before. Shall I tell her that?   The eunuch sighed.  That cuts more deeply than a knife, my lord. I have served you loyally, but I must also serve your sister when I can. How long do you think she would let me live if I were of no further use to her whatsoever? I have no fierce sellsword to protect me, no valiant brother to avenge me, only some little birds who whisper in my ear. With those whisperings I must buy my life anew each day.    Pardon me if I do not weep for you.    I shall, but you must pardon me if I do not weep for Shae. I confess, I do not understand what there is in her to make a clever man like you act such a fool.    You might, if you were not a eunuch.    Is that the way of it? A man may have wits, or a bit of meat between his legs, but not both?  Varys tittered.  Perhaps I should be grateful I was cut, then.   The Spider was right. Tyrion groped through the dragon-haunted darkness for his smallclothes, feeling wretched. The risk he was taking left him tight as a drumhead, and there was guilt as well. The Others can take my guilt, he thought as he slipped his tunic over his head. Why should I be guilty? My wife wants no part of me, and most especially not the part that seems to want her. Perhaps he ought to tell her about Shae. It was not as though he was the first man ever to keep a concubine. Sansa’s own oh-so-honorable father had given her a bastard brother. For all he knew, his wife might be thrilled to learn that he was fucking Shae, so long as it spared her his unwelcome touch.  No, I dare not. Vows or no, his wife could not be trusted. She might be maiden between the legs, but she was hardly innocent of betrayal; she had once spilled her own father’s plans to Cersei. And girls her age were not known for keeping secrets.  The only safe course was to rid himself of Shae. I might send her to Chataya, Tyrion reflected, reluctantly. In Chataya’s brothel, Shae would have all the silks and gems she could wish for, and the gentlest highborn patrons. It would be a better life by far than the one she had been living when he’d found her.  Or, if she was tired of earning her bread on her back, he might arrange a marriage for her. Bronn, perhaps? The sellsword had never balked at eating off his master’s plate, and he was a knight now, a better match than she could elsewise hope for. Or Ser Tallad? Tyrion had noticed that one gazing wistfully at Shae more than once. Why not? He’s tall, strong, not hard to look upon, every inch the gifted young knight. Of course, Tallad knew Shae only as a pretty young lady’s maid in service at the castle. If he wed her and then learned she was a whore…   M’lord, where are you? Did the dragons eat you up?    No. Here.  He groped at a dragon skull.  I have found a shoe, but I believe it’s yours.    M’lord sounds very solemn. Have I displeased you?    No,  he said, too curtly.  You always please me.  And therein is our danger. He might dream of sending her away at times like this, but that never lasted long. Tyrion saw her dimly through the gloom, pulling a woolen sock up a slender leg. I can see. A vague light was leaking through the row of long narrow windows set high in the cellar wall. The skulls of the Targaryen dragons were emerging from the darkness around them, black amidst grey.  Day comes too soon.  A new day. A new year. A new century. I survived the Green Fork and the Blackwater, I can bloody well survive King Joffrey’s wedding.  Shae snatched her dress down off the dragon’s tooth and slipped it over her head.  I’ll go up first."
}