{
  "id": "fd0dfbd96c10baf7efc6853f65e593f8f0bfa5f9",
  "text": "  Baggins  was  still  officially  their  expert  burglar  and  investigator.  If  he  liked  to  risk  a  light,  that was  his  affair.  They would wait  in  the  tunnel  for  his  report. So  they  sat near  the door and watched.  They  saw  the  little  dark  shape  of  the  hobbit  start  across  the  floor  holding  his  tiny  light aloft. Every now and again, while he was still near enough,  they caught   ####-a  glint  and  a  tinkle  as  he  stumbled  on  some  golden  thing. The  light grew  smaller  as  he wandered  away  into  the  vast  hall;  then  it  began  to  rise  dancing  into  the  air.  Bilbo was climbing  the great mound of  treasure. Soon he stood upon  the  top, and  still  went  on.  Then  they  saw  him  halt  and  stoop  for  a  moment;  but  they  did  not  know  the  reason.  It  was  the  Arkenstone,  the  Heart  of  the  Mountain.  So  Bilbo  guessed  from  Thorin's  description;  but  indeed  there  could  not  be  two  such  gems,  even in so marvellous a hoard, even in all the world. Ever as he climbed, the same  white gleam had shone before him and drawn his feet towards Slowly it grew to a  little  globe  of  pallid  light.  Now  as  came  near,  it  was  tinged  with  a  flickering  sparkle  of man  colours  at  the  surface,  reflected  and  splintered  from  the wavering  light  of  his  torch.  At  last  he  looked  down  upon  it  and  he  caught  his  breath.  The  great  jewel  shone before he  feet of  its own  inner  light,  and yet,  cut  and  fashioned  by  the  dwarves, who  had  dug  it  from  the  heart  of  the mountain  long  ago,  it  took  all light that fell upon it and-changes it into ten thousand sparks of white radiance  shot with glints of the rainbow.   Suddenly  Bilbo's  arm  went  towards  it  drawn  by  it  enchantment.  His  small  hand  would  not  close  about  it  for  it  was  a  large  and  heavy  gem;  but  he  lifted  it,  shut his eyes, and put it in his deepest pocket.  \"Now  I  am  a  burglar  indeed!\"  thought  he.  \"But  I  suppose  I  must  tell  the  dwarves  about  it-some  time. The  did  say  I  could  pick  and  choose my  own  share;  and  I  think  I would  choose  this,  if  they  took  all  the  rest!\" All  the same he had an  uncomfortable  feeling  that  the picking and choosing had not  really been meant  to  include  this marvellous gem, and  that  trouble would yet come of  it. Now he went  on again. Down the other side of the great mound he climbed, and the spark of his  torch  vanished  from  the  sight  of  the  watching  dwarves.  But  soon  they  saw  it  far  away in the distance again. Bilbo was crossing the floor of the hall.  He  went  on,  until  he  came  to  the  great  doors  at  the  further  side,  and  there  a  draught  of  air  refreshed him, but  it almost puffed out his  light. He peeped  timidly  through and caught a glimpse of great passages and of the dim beginnings of wide  stairs  going  up  into  the  gloom. And  still  there was  no  sight  nor  sound  of  Smaug.  He was  just  going  to  turn  and  go back, when  a black  shape  swooped  at him  and  brushed his face. He squeaked and started, stumbled backwards and fell. His torch  dropped head downwards and went out!  \"Only  a  bat,  I  suppose  and  hope!\"  he  said  miserably.  But  now  what  am  I  to  do? Which is East, South, North West?\"   ####-\"Thorin! Balin! Oin! Gloin! Fill! Kili!\"  he  cried  as  loud  he  could-it seemed a  thin  little  noise  in  the wide  blackness.  \"The  light's  gone  out!  Someone  come  and  find and help me!\" For the moment his courage had failed together.   Faintly  the  dwarves  heard  his  small  cries,  though  the  only  word  they  could  catch was 'help!'  \"Now what on earth or under it has happened?\" said Thorin. \"Certainly not the  dragon, or he would not go on squeaking.\"  They waited a moment or two, and still there were no dragon-noises, no sound  at  all  in  fact  but  Bilbo's  distant  voice.  \"Come,  one  of  you,  get  another  light  or  two!\" Thorin ordered. \"It seems we have got to go and help our burglar.\"  \"It  is  about  our  turn  to  help,\"  said  Balin,  \"and  I  am  quite  willing  to  go.  Anyway I expect it is safe for the moment.\"  Gloin  lit  several  more  torches,  and  then  they  all  crept  out,  one  by  one,  and  went  along  the  wall  as  hurriedly  as  they  could.  It  was  not  long  before  they  met  Bilbo  himself  coming  back  towards  them.  His  wits  had  quickly returned soon as  he saw the twinkle of their lights.  \"Only  a  bat  and  a  dropped  torch,  nothing  worse!\"  he  said  in  answer  to  their  questions.  Though  they  were  much  relieved,  they  were  inclined  to  be  grumpy  at  being frightened for nothing; but what they would have said, if he had told them at  that  moment  about  the  Arkenstone,  I  don't  know.  The  mere  fleeting  glimpses  of  treasure  which  they  had  caught  as  they  went  along  had  rekindled  all  the  fire  of  their dwarvish hearts; and when the heart of a dwarf, even the most respectable, is  wakened  by  gold  and  by  jewels,  he  grows  suddenly  bold,  and  he  may  become  fierce."
}