{
  "id": "fdc49d9d8ce6cc9f10c88a3df67532c826f921c3",
  "text": " He hissed.  She hit him. Hard, right between his little eyes.  Screaming, Biter reeled back, and then threw all his weight against his chains. The links slithered and turned and grew taut, and Arya heard the creak of old dry wood as the great iron rings strained against the floorboards of the wagon. Huge pale hands groped for her while veins bulged along Biter’s arms, but the bonds held, and finally the man collapsed backward. Blood ran from the weeping sores on his cheeks.   A boy has more courage than sense,  the one who had named himself Jaqen H’ghar observed.  Arya edged backward away from the wagon. When she felt the hand on her shoulder, she whirled, bringing up her stick sword again, but it was only the Bull.  What are you doing?   He raised his hands defensively.  Yoren said none of us should go near those three.    They don’t scare me,  Arya said.   Then you’re stupid. They scare me.  The Bull’s hand fell to the hilt of his sword, and Rorge began to laugh.  Let’s get away from them.   Arya scuffed at the ground with her foot, but she let the Bull lead her around to the front of the inn. Rorge’s laughter and Biter’s hissing followed them.  Want to fight?  she asked the Bull. She wanted to hit something.  He blinked at her, startled. Strands of thick black hair, still wet from the bathhouse, fell across his deep blue eyes.  I’d hurt you.    You would not.    You don’t know how strong I am.    You don’t know how quick I am.    You’re asking for it, Arry.  He drew Praed’s longsword.  This is cheap steel, but it’s a real sword.   Arya unsheathed Needle.  This is good steel, so it’s realer than yours.   The Bull shook his head.  Promise not to cry if I cut you?    I’ll promise if you will.  She turned sideways, into her water dancer’s stance, but the Bull did not move. He was looking at something behind her.  What’s wrong?    Gold cloaks.  His face closed up tight.  It couldn’t be, Arya thought, but when she glanced back, they were riding up the kingsroad, six in the black ringmail and golden cloaks of the City Watch. One was an officer; he wore a black enamel breastplate ornamented with four golden disks. They drew up in front of the inn. Look with your eyes, Syrio’s voice seemed to whisper. Her eyes saw white lather under their saddles; the horses had been ridden long and hard. Calm as still water, she took the Bull by the arm and drew him back behind a tall flowering hedge.   What is it?  he asked.  What are you doing? Let go.    Quiet as a shadow,  she whispered, pulling him down.  Some of Yoren’s other charges were sitting in front of the bathhouse, waiting their turn at a tub.  You men,  one of the gold cloaks shouted.  You the ones left to take the black?    We might be,  came the cautious answer.   We’d rather join you boys,  old Reysen said.  We hear it’s cold on that Wall.   The gold cloak officer dismounted.  I have a warrant for a certain boy—   Yoren stepped out of the inn, fingering his tangled black beard.  Who is it wants this boy?   The other gold cloaks were dismounting to stand beside their horses.  Why are we hiding?  the Bull whispered.   It’s me they want,  Arya whispered back. His ear smelled of soap.  You be quiet.    The queen wants him, old man, not that it’s your concern,  the officer said, drawing a ribbon from his belt.  Here, Her Grace’s seal and warrant.   Behind the hedge, the Bull shook his head doubtfully.  Why would the queen want you, Arry?   She punched his shoulder.  Be quiet!   Yoren fingered the warrant ribbon with its blob of golden wax.  Pretty.  He spit.  Thing is, the boy’s in the Night’s Watch now. What he done back in the city don’t mean piss-all.    The queen’s not interested in your views, old man, and neither am I,  the officer said.  I’ll have the boy.   Arya thought about running, but she knew she wouldn’t get far on her donkey when the gold cloaks had horses. And she was so tired of running. She’d run when Ser Meryn came for her, and again when they killed her father. If she was a real water dancer, she would go out there with Needle and kill all of them, and never run from anyone ever again.   You’ll have no one,  Yoren said stubbornly.  There’s laws on such things.   The gold cloak drew a shortsword.  Here’s your law.   Yoren looked at the blade.  That’s no law, just a sword. Happens I got one too.   The officer smiled.  Old fool. I have five men with me.   Yoren spat.  Happens I got thirty.   The gold cloak laughed.  This lot?  said a big lout with a broken nose.  Who’s first?  he shouted, showing his steel.  Tarber plucked a pitchfork out of a bale of hay.  I am.    No, I am,  called Cutjack, the plump stonemason, pulling his hammer off the leather apron he always wore.   Me.  Kurz came up off the ground with his skinning knife in hand.   Me and him.  Koss strung his longbow.   All of us,  said Reysen, snatching up the tall hardwood walking staff he carried.  Dobber stepped naked out of the bathhouse with his clothes in a bundle, saw what was happening, and dropped everything but his dagger."
}