{
  "id": "fed48e52006f2c743e3c649aa7f2b467fb623235",
  "text": " They popped out of the walls and tables to do a bit of formation gliding; Nearly Headless Nick, the Gryffindor ghost, had a great success with a reenactment of his own botched beheading.  It had been such a pleasant evening that Harry's good mood couldn't even be spoiled by Malfoy, who shouted through the crowd as they all left the hall, \"The dementors send their love, Potter!\"  Harry, Ron, and Hermione followed the rest of the Gryffindors along the usual path to Gryffindor Tower, but when they reached the corridor that ended with the portrait of the Fat Lady, they found it jammed with students.  \"Why isn't anyone going in?\" said Ron curiously.  Harry peered over the heads in front of him. The portrait seemed to be closed.  \"Let me through, please,\" came Percy's voice, and he came bustling importantly through the crowd. \"What's the holdup here? You can't all have forgotten the password -- excuse me, I'm Head Boy --\"  And then a silence fell over the crowd, from the front first, so that a chill seemed to spread down the corridor. They heard Percy say, in a suddenly sharp voice, \"Somebody get Professor Dumbledore. Quick.\"  People's heads turned; those at the back were standing on tiptoe.  \"What's going on?\" said Ginny, who had just arrived.  A moment later, Professor Dumbledore was there, sweeping toward the portrait; the Gryffindors squeezed together to let him through, and Harry, Ron, and Hermione moved closer to see what the trouble was.  \"Oh, my --\" Hermione grabbed Harry's arm.  The Fat Lady had vanished from her portrait, which had been slashed so viciously that strips of canvas littered the floor; great chunks of it had been torn away completely.  Dumbledore took one quick look at the ruined painting and turned, his eyes somber, to see Professors McGonagall, Lupin, and Snape hurrying toward him.  \"We need to find her,\" said Dumbledore. \"Professor McGonagall, please go to Mr. Filch at once and tell him to search every painting in the castle for the Fat Lady.\"  \"You'll be lucky!\" said a cackling voice.  It was Peeves the Poltergeist, bobbing over the crowd and looking delighted, as he always did, at the sight of wreckage or worry.  \"What do you mean, Peeves?\" said Dumbledore calmly, and Peeves's grin faded a little. He didn't dare taunt Dumbledore. Instead he adopted an oily voice that was no better than his cackle. \"Ashamed, Your Headship, sit. Doesn't want to be seen. She's a horrible mess. Saw her running through the landscape up on the fourth floor, sir, dodging between the trees. Crying something dreadful,\" he said happily. \"Poor thing,\" he added unconvincingly.  \"Did she say who did it?\" said Dumbledore quietly.  \"Oh yes, Professorhead,\" said Peeves, with the air of one cradling a large bombshell in his arms. \"He got very angry when she wouldn't let him in, you see.\" Peeves flipped over and grinned at Dumbledore from between his own legs. \"Nasty temper he's got, that Sirius Black.\"  CHAPTER NINE  GRIM DEFEAT  Professor Dumbledore sent all the Gryffindors back to the Great Hall, where they were joined ten minutes later by the students from Hufflepuff, Ravenclaw, and Slytherin, who all looked extremely confused.  \"The teachers and I need to conduct a thorough search of the castle,\" Professor Dumbledore told them as Professors McGonagall and Flitwick closed all doors into the hall. \"I'm afraid that, for your own safety, you will have to spend the night here. I want the prefects to stand guard over the entrances to the hall and I am leaving the Head Boy and Girl in charge. Any disturbance should be reported to me immediately,\" he added to Percy, who was looking immensely proud and important. \"Send word with one of the ghosts.\"  Professor Dumbledore paused, about to leave the hall, and said, \"Oh, yes, you'll be needing...\"  One casual wave of his wand and the long tables flew to the edges of the hall and stood themselves against the walls; another wave, and the floor was covered with hundreds of squashy purple sleeping bags.  \"Sleep well,\" said Professor Dumbledore, closing the door behind him.  The hall immediately began to buzz excitedly; the Gryffindors were telling the rest of the school what had just happened.  \"Everyone into their sleeping bags!\" shouted Percy. \"Come on, now, no more talking! Lights out in ten minutes!\"  \"C'mon,\" Ron said to Harry and Hermione; they seized three sleeping bags and dragged them into a corner.  \"Do you think Black's still in the castle?\" Hermione whispered anxiously.  \"Dumbledore obviously thinks he might be,\" said Ron.  \"It's very lucky he picked tonight, you know,\" said Hermione as they climbed fully dressed into their sleeping bags and propped themselves on their elbows to talk. \"The one night we weren't in the tower....\"  I reckon he's lost track of time, being on the run,\" said Ron. \"Didn't realize it was Halloween. Otherwise he'd have come bursting in here.\"  Hermione shuddered.  All around them, people were asking one another the same question: \"How did he get in?\"  \"Maybe he knows how to Apparate,\" said a Ravenclaw a few feet away, \"Just appear out of thin air, you know."
}