{
  "id": "feef210c9d9e6520e030cbdd8c8387c94f8a14a9",
  "text": " Crouch - 535  TWENTY-NINE The Dream - 564  THIRTY The Pensive - 581  THIRTY-ONE The Third Task - 605  THIRTY-TWO Flesh, Blood, and Bone - 636  THIRTY-THREE The Death Eaters - 644  THIRTY-FOUR Priori Incantatem - 659  THIRTY-FIVE Veritaserum - 670  THIRTY-SIX The Parting of the Ways - 692  THIRTY-SEVEN The Beginning - 716   HARRY POTTER AND THE GOBLET OF FIRE  CHAPTER ONE - THE RIDDLE HOUSE   The villagers of Little Hangleron still called it \"the Riddle House,\" even though it had been many years since the Riddle family had lived there.  It stood on a hill overlooking the village, some of its windows boarded, tiles missing from its roof, and ivy spreading unchecked over its face.  Once a fine-looking manor, and easily the largest and grandest building for miles around, the Riddle House was now damp, derelict, and unoccupied.  The Little Hagletons all agreed that the old house was \"creepy.\"  Half a century ago, something strange and horrible had happened there, something that the older inhabitants of the village still liked to discuss when topics for gossip were scarce.  The story had been picked over so many times, and had been embroidered in so many places, that nobody was quite sure what the truth was anymore.  Every version of the tale, however, started in the same place:  Fifty years before, at daybreak on a fine summer's morning when the Riddle House had still been well kept and impressive, a maid had entered the drawing room to find all three Riddles dead.    The maid had run screaming down the hill into the village and roused as many people as she could.  \"Lying there with their eyes wide open!  Cold as ice!  Still in their dinner things!\"  The police were summoned, and the whole of Little Hangleton had seethed with shocked curiosity and ill-disguised excitement.  Nobody wasted their breath pretending to feel very sad about the Riddles, for they had been most unpopular.  Elderly Mr. and Mrs. Riddle had been rich, snobbish, and rude, and their grown-up son, Tom, had been, if anything, worse.  All the villagers cared about was the identity of their murderer -- for plainly, three apparently healthy people did not all drop dead of natural causes on the same night.  The Hanged Man, the village pub, did a roaring trade that night; the whole village seemed to have turned out to discuss the murders.  They were rewarded for leaving their firesides when the Riddles' cook arrived dramatically in their midst and announced to the suddenly silent pub that a man called Frank Bryce had just  been arrested.  \"Frank!\" cried several people.  \"Never!\"  Frank Bryce was the Riddles' gardener.  He lived alone in a run-down cottage on the grounds of the Riddle House.  Frank had come back from the war with a very stiff leg and a great dislike of crowds and loud noises, and had been working for the Riddles ever since.  There was a rush to buy the cook drinks and hear more details.  \"Always thought he was odd,\" she told the eagerly listening villagers, after her fourth sherry.  \"Unfriendly, like.  I'm sure if I've offered him a cuppa once, I've offered it a hundred times.  Never wanted to mix, he didn't.\"  \"Ah, now,\" said a woman at the bar, \"he had a hard war, Frank.  He likes the quiet life.  That's no reason to --\"  \"Who else had a key to the back door, then?\" barked the cook.  \"There's been a spare key hanging in the gardener's cottage far back as I can remember!  Nobody forced the door last night!  No broken windows!  All Frank had to do was creep up to the big house while we was all sleeping...\"  The villagers exchanged dark looks.  \"I always thought that he had a nasty look about him, right enough,\" grunted a man at the bar.  \"War turned him funny, if you ask me,\" said the landlord.  \"Told you I wouldn't like to get on the wrong side of Frank, didn't I, Dot?\" said an excited woman in the corner.  \"Horrible temper,\" said Dot, nodding fervently.  \"I remember, when he was a kid...\"  By the following morning, hardly anyone in Little Hangleton doubted that Frank Bryce had killed the Riddles.  But over in the neighboring town of Great Hangleton, in the dark and dingy police station, Frank was stubbornly repeating, again and again, that he was innocent, and that the only person he had seen near the house on the day of the Riddles' deaths had been a teenage boy, a stranger, dark-haired and pale.  Nobody else in the village had seen any such boy, and the police were quite sure Frank had invented him.  Then, just when things were looking very serious for Frank, the report on the Riddles' bodies came back and changed everything.  The police had never read an odder report.  A team of doctors had examined the bodies and had concluded that none of the Riddles had been poisoned, stabbed, shot, strangles, suffocated, or (as far as they could tell) harmed at all.  In fact (the report continued, in a tone of unmistakable bewilderment), the Riddles all appeared to be in perfet health -- apart from the fact that they were all dead.  The doctors did note (as though determined to find something wrong with the bodies) that each of the Riddles had a look of terror upon his or her face -- but as the frustrated police said, whoever heard of three people being frightened to death?  As there was no proof that the Riddles had been murdered at all, the police were forced to let Frank go."
}