{
  "id": "ff2d88b97734ebccad6db22eebe5cec63ebc41a1",
  "text": " Robert wanted to be loved. My brother Tyrion has the same disease. Do you want to be loved, Sansa?    Everyone wants to be loved.    I see flowering hasn’t made you any brighter,  said Cersei.  Sansa, permit me to share a bit of womanly wisdom with you on this very special day. Love is poison. A sweet poison, yes, but it will kill you all the same.       JON  It was dark in the Skirling Pass. The great stone flanks of the mountains hid the sun for most of the day, so they rode in shadow, the breath of man and horse steaming in the cold air. Icy fingers of water trickled down from the snowpack above into small frozen pools that cracked and broke beneath the hooves of their garrons. Sometimes they would see a few weeds struggling from some crack in the rock or a splotch of pale lichen, but there was no grass, and they were above the trees now.  The track was as steep as it was narrow, wending its way ever upward. Where the pass was so constricted that rangers had to go single file, Squire Dalbridge would take the lead, scanning the heights as he went, his longbow ever close to hand. It was said he had the keenest eyes in the Night’s Watch.  Ghost padded restlessly by Jon’s side. From time to time he would stop and turn, his ears pricked, as if he heard something behind them. Jon did not think the shadowcats would attack living men, not unless they were starving, but he loosened Longclaw in its scabbard even so.  A wind-carved arch of grey stone marked the highest point of the pass. Here the way broadened as it began its long descent toward the valley of the Milkwater. Qhorin decreed that they would rest here until the shadows began to grow again.  Shadows are friends to men in black,  he said.  Jon saw the sense of that. It would be pleasant to ride in the light for a time, to let the bright mountain sun soak through their cloaks and chase the chill from their bones, but they dared not. Where there were three watchers there might be others, waiting to sound the alarm.  Stonesnake curled up under his ragged fur cloak and was asleep almost at once. Jon shared his salt beef with Ghost while Ebben and Squire Dalbridge fed the horses. Qhorin Halfhand sat with his back to a rock, honing the edge of his longsword with long slow strokes. Jon watched the ranger for a few moments, then summoned his courage and went to him.  My lord,  he said,  you never asked me how it went. With the girl.    I am no lord, Jon Snow.  Qhorin slid the stone smoothly along the steel with his two-fingered hand.   She told me Mance would take me, if I ran with her.    She told you true.    She even claimed we were kin. She told me a story…    …of Bael the Bard and the rose of Winterfell. So Stonesnake told me. It happens I know the song. Mance would sing it of old, when he came back from a ranging. He had a passion for wildling music. Aye, and for their women as well.    You knew him?    We all knew him.  His voice was sad.  They were friends as well as brothers, Jon realized, and now they are sworn foes.  Why did he desert?    For a wench, some say. For a crown, others would have it.  Qhorin tested the edge of his sword with the ball of his thumb.  He liked women, Mance did, and he was not a man whose knees bent easily, that’s true. But it was more than that. He loved the wild better than the Wall. It was in his blood. He was wildling born, taken as a child when some raiders were put to the sword. When he left the Shadow Tower he was only going home again.    Was he a good ranger?    He was the best of us,  said the Halfhand,  and the worst as well. Only fools like Thoren Smallwood despise the wildlings. They are as brave as we are, Jon. As strong, as quick, as clever. But they have no discipline. They name themselves the free folk, and each one thinks himself as good as a king and wiser than a maester. Mance was the same. He never learned how to obey.    No more than me,  said Jon quietly.  Qhorin’s shrewd grey eyes seemed to see right through him.  So you let her go?  He did not sound the least surprised.   You know?    Now. Tell me why you spared her.   It was hard to put into words.  My father never used a headsman. He said he owed it to men he killed to look into their eyes and hear their last words. And when I looked into Ygritte’s eyes, I…  Jon stared down at his hands helplessly.  I know she was an enemy, but there was no evil in her.    No more than in the other two.    It was their lives or ours Jon said.  If they had seen us, if they had sounded that horn…    The wildlings would hunt us down and slay us, true enough.    Stonesnake has the horn now, though, and we took Ygritte’s knife and axe. She’s behind us, afoot, unarmed…    And not like to be a threat,  Qhorin agreed.  If I had needed her dead, I would have left her with Ebben, or done the thing myself.    Then why did you command it of me?    I did not command it. I told you to do what needed to be done, and left you to decide what that would be.  Qhorin stood and slid his longsword back into its scabbard."
}