{
  "id": "05c9814ea6d99ab09feefa68e9bd00b81a247345",
  "text": " She pressed her heels into her horse and left them both. Anguy the Archer was riding a few yards ahead. When she caught up with him, she said,  Dornishmen lie, don’t they?    They’re famous for it.  The bowman grinned.  Of course, they say the same of us marchers, so there you are. What’s the trouble now? Ned’s a good lad…    He’s just a stupid liar.  Arya left the trail, leapt a rotten log and splashed across a streambed, ignoring the shouts of the outlaws behind her. They just want to tell me more lies. She thought about trying to get away from them, but there were too many and they knew these lands too well. What was the use of running if they caught you?  It was Harwin who rode up beside her, in the end.  Where do you think you’re going, milady? You shouldn’t run off. There are wolves in these woods, and worse things.    I’m not afraid,  she said.  That boy Ned said…    Aye, he told me. Lady Ashara Dayne. It’s an old tale, that one. I heard it once at Winterfell, when I was no older than you are now.  He took hold of her bridle firmly and turned her horse around.  I doubt there’s any truth to it. But if there is, what of it? When Ned met this Dornish lady, his brother Brandon was still alive, and it was him betrothed to Lady Catelyn, so there’s no stain on your father’s honor. There’s nought like a tourney to make the blood run hot, so maybe some words were whispered in a tent of a night, who can say? Words or kisses, maybe more, but where’s the harm in that? Spring had come, or so they thought, and neither one of them was pledged.    She killed herself, though,  said Arya uncertainly.  Ned says she jumped from a tower into the sea.    So she did,  Harwin admitted, as he led her back,  but that was for grief, I’d wager. She’d lost a brother, the Sword of the Morning.  He shook his head.  Let it lie, my lady. They’re dead, all of them. Let it lie… and please, when we come to Riverrun, say naught of this to your mother.   The village was just where Notch had promised it would be. They took shelter in a grey stone stable. Only half a roof remained, but that was half a roof more than any other building in the village. It’s not a village, it’s only black stones and old bones.  Did the Lannisters kill the people who lived here?  Arya asked as she helped Anguy dry the horses.   No.  He pointed.  Look at how thick the moss grows on the stones. No one’s moved them for a long time. And there’s a tree growing out of the wall there, see? This place was put to the torch a long time ago.    Who did it, then?  asked Gendry.   Hoster Tully.  Notch was a stooped thin grey-haired man, born in these parts.  This was Lord Goodbrook’s village. When Riverrun declared for Robert, Goodbrook stayed loyal to the king, so Lord Tully came down on him with fire and sword. After the Trident, Goodbrook’s son made his peace with Robert and Lord Hoster, but that didn’t help the dead none.   A silence fell. Gendry gave Arya a queer look, then turned away to brush his horse. Outside the rain came down and down.  I say we need a fire,  Thoros declared.  The night is dark and full of terrors. And wet too, eh? Too very wet.   Jack-Be-Lucky hacked some dry wood from a stall, while Notch and Merrit gathered straw for kindling. Thoros himself struck the spark, and Lem fanned the flames with his big yellow cloak until they roared and swirled. Soon it grew almost hot inside the stable. Thoros sat before it crosslegged, devouring the flames with his eyes just as he had atop High Heart. Arya watched him closely, and once his lips moved, and she thought she heard him mutter,  Riverrun.  Lem paced back and forth, coughing, a long shadow matching him stride for stride, while Tom o’ Sevens pulled off his boots and rubbed his feet.  I must be mad, to be going back to Riverrun,  the singer complained.  The Tullys have never been lucky for old Tom. It was that Lysa sent me up the high road, when the moon men took my gold and my horse and all my clothes as well. There’s knights in the Vale still telling how I came walking up to the Bloody Gate with only my harp to keep me modest. They made me sing ‘The Name Day Boy’and The King Without Courage’ before they opened that gate. My only solace was that three of them died laughing. I haven’t been back to the Eyrie since, and I won’t sing’The King Without Courage’ either, not for all the gold in Casterly—    Lannisters,  Thoros said.  Roaring red and gold.  He lurched to his feet and went to Lord Beric. Lem and Tom wasted no time joining them. Arya could not make out what they were saying, but the singer kept glancing at her, and one time Lem got so angry he pounded a fist against the wall. That was when Lord Beric gestured for her to come closer. It was the last thing she wanted to do, but Harwin put a hand in the small of her back and pushed her forward. She took two steps and hesitated, full of dread.  My lord.  She waited to hear what Lord Beric would say.   Tell her,  the lightning lord commanded Thoros.  The red priest squatted down beside her."
}