{
  "id": "065ca750eec9bba997f9690d5c323856d95e296c",
  "text": "  \"You're the only one who knows how to get past Fluffy. aren't you, Hagrid?\" said Harry anxiously. \"And you wouldn't tell anyone, would you? Not even one of the teachers?\"  \"Not a soul knows except me an' Dumbledore,\" said Hagrid proudly.  \"Well, that's something,\" Harry muttered to the others. \"Hagrid, can we have a window open? I'm boiling.\"  \"Can't, Harry, sorry,\" said Hagrid. Harry noticed him glance at the fire. Harry looked at it, too.  \"Hagrid -- what's that?\"  But he already knew what it was. In the very heart of the fire, underneath the kettle, was a huge, black egg.  \"Ah,\" said Hagrid, fiddling nervously with his beard, \"That's er...\"  \"Where did you get it, Hagrid?\" said Ron, crouching over the fire to get a closer look at the egg. \"It must've cost you a fortune.\"  \"Won it,\" said Hagrid. \"Las' night. I was down in the village havin' a few drinks an' got into a game o' cards with a stranger. Think he was quite glad ter get rid of it, ter be honest.\"  \"But what are you going to do with it when it's hatched?\" said Hermione.  \"Well, I've bin doin' some readin' , said Hagrid, pulling a large book from under his pillow. \"Got this outta the library -- Dragon Breeding for Pleasure and Profit -- it's a bit outta date, o' course, but it's all in here. Keep the egg in the fire, 'cause their mothers breathe on I em, see, an' when it hatches, feed it on a bucket o' brandy mixed with chicken blood every half hour. An' see here -- how ter recognize diff'rent eggs -- what I got there's a Norwegian Ridgeback. They're rare, them.\"  He looked very pleased with himself, but Hermione didn't.  \"Hagrid, you live in a wooden house,\" she said.  But Hagrid wasn't listening. He was humming merrily as he stoked the fire.  So now they had something else to worry about: what might happen to Hagrid if anyone found out he was hiding an illegal dragon in his hut. \"Wonder what it's like to have a peaceful life,\" Ron sighed, as evening after evening they struggled through all the extra homework they were getting. Hermione had now started making study schedules for Harry and Ron, too. It was driving them nuts.  Then, one breakfast time, Hedwig brought Harry another note from Hagrid. He had written only two words: It's hatching.  Ron wanted to skip Herbology and go straight down to the hut. Hermione wouldn't hear of it.  \"Hermione, how many times in our lives are we going to see a dragon hatching?\"  \"We've got lessons, we'll get into trouble, and that's nothing to what Hagrid's going to be in when someone finds out what he's doing --\"  \"Shut up!\" Harry whispered.  Malfoy was only a few feet away and he had stopped dead to listen. How much had he heard? Harry didn't like the look on Malfoy's face at all.  Ron and Hermione argued all the way to Herbology and in the end, Hermione agreed to run down to Hagrid's with the other two during morning break. When the bell sounded from the castle at the end of their lesson, the three of them dropped their trowels at once and hurried through the grounds to the edge of the forest. Hagrid greeted them, looking flushed and excited.  \"It's nearly out.\" He ushered them inside.  The egg was lying on the table. There were deep cracks in it. Something was moving inside; a funny clicking noise was coming from it.  They all drew their chairs up to the table and watched with bated breath.  All at once there was a scraping noise and the egg split open. The baby dragon flopped onto the table. It wasn't exactly pretty; Harry thought it looked like a crumpled, black umbrella. Its spiny wings were huge compared to its skinny jet body, it had a long snout with wide nostrils, the stubs of horns and bulging, orange eyes.  It sneezed. A couple of sparks flew out of its snout.  \"Isn't he beautiful?\" Hagrid murmured. He reached out a hand to stroke the dragon's head. It snapped at his fingers, showing pointed fangs.  \"Bless him, look, he knows his mommy!\" said Hagrid.  \"Hagrid,\" said Hermione, \"how fast do Norwegian Ridgebacks grow, exactly?\"  Hagrid was about to answer when the color suddenly drained from his face -- he leapt to his feet and ran to the window.  \"What's the matter?\"  \"Someone was lookin' through the gap in the curtains -- it's a kid -- he's runnin' back up ter the school.\"  Harry bolted to the door and looked out. Even at a distance there was no mistaking him.  Malfoy had seen the dragon.  Something about the smile lurking on Malfoy's face during the next week made Harry, Ron, and Hermione very nervous. They spent most of their free time in Hagrid's darkened hut, trying to reason with him.  \"Just let him go,\" Harry urged. \"Set him free.\"  \"I can't,\" said Hagrid. \"He's too little. He'd die.\"  They looked at the dragon. It had grown three times in length in just a week. Smoke kept furling out of its nostrils. Hagrid hadn't been doing his gamekeeping duties because the dragon was keeping him so busy. There were empty brandy bottles and chicken feathers all over the floor.  \"I've decided to call him Norbert,\" said Hagrid, looking at the dragon with misty eyes."
}