{
  "id": "06f05912731c751ff3b8384462962d011fc10993",
  "text": "  \"Nagini has interesting news, Wormtail,\" it said.  \"In-indeed, My Lord?\"  said Wormtail.  \"Indeed, yes,\" said the voice, \"According to Nagini, there is an old Muggle standing right outside this room, listening to every word we say.\"  Frank didn't have a chance to hide himself.  There were footsteps and then the door of the room was flung wide open.  A short, balding man with graying hair, a pointed nose, and small, watery eyes stood before Frank, a mixture of fear and alarm in his face.  \"Invite him inside, Wormtail.  Where are your manners?\"  The cold voice was coming from the ancient armchair before the fire, but Frank couldn't see the speaker.  the snake, on the other hand, was curled up on the rotting hearth rug, like some horrible travesty of a pet dog.  Wormtail beckoned Frank into the room.  Though still deeply shaken, Frank took a firmer grip on his walking stick and limped over the threshold.  The fire was the only source of light in the room; it cast long, spidery shadows upon the walls.  Frank stared at the back of the armchair; the man inside it seemed to be even smaller than his servant, for Frank couldn't even see the back of his head.  \"You heard everything, Muggle?\"  said the cold voice.  \"What's that you're calling me?\"  said Frank defiantly, for now that he was inside the room, now that the time had come for some sort of action, he felt braver; it had always been so in the war.  \"I am calling you a Muggle,\" said the voice coolly.  \"It means that you are not a wizard.\"  \"I don't know what you mean by wizard,\" said Frank, his voice growing steadier.  \"All I know is I've heard enough to interest the police tonight, I have.  You've done murder and you're planning more!  And I'll tell youthis too,\" he added, on a sudden inspiration, \"my wife knows I'm up here, and if I don't come back --\"  \"You have no wife,\" said te cold voice, very quietly.  \"Nobody knows you are here.  You told nobody that you were coming.  Do not lie to Lord Voldemort, Muggle, for he knows...he always knows...\"  \"Is that right?\"  said Frank roughly.  \"Lord, is it?  Well, I don't think much of your manners, My Lord.  Turn 'round and face me like a man, why don't you?\"  \"But I am not a man, Muggle,\" said the cold voice, barely audible now over the crackling of the flames.  \"I am much, much more than a man.  However...why not?  I will face you...Wormtail, come turn my chair around.\"  The servant gave a whimper.  \"You heard me, Wormtail.\"  Slowly, with his face screwed up, as though he would rather have done anything than approach his master and the hearth rug where the snake lay, the small man walked forward and began to turn the chair.  The snake lifted its ugly triangular head and hissed slightly as the legs of the chair snagged on its rug.  And then the chair was facing Frank, and he saw what was sitting in it.  His walking stick fell to the floor with a clatter.  He opened his mouth and let out a scream.  He was screaming so loudly that he never heard the words the thing in the chair spoke as it raised a wand.  There was a flash of green light, a rushing sound, and Frank Bryce crumpled.  He was dead before he hit the floor.  Two hundred miles away, the boy called Harry Potter woke with a start.  CHAPTER TWO - THE SCAR   Harry lay flat on his back, breathing hard as though he had been running.  He had awoken from a vivid dream with his hands pressed over his face.  The old scar on his forehead, which was shaped like a bolt of lightning, was burning beneath his fingers as though someone had just pressed a white-hot wire to his skin.  He sat up, one hand still on his scar, the other hand reaching out in the darkness for his glasses, which were on the bedside table.  He put them on and his bedroom came into clearer focus, lit by a faint, misty orange light that was filtering through the curtains from the street lamp outside the window.  Harry ran his fingers over the scar again.  It was still painful.  He turned on the lamp beside him, scrambled out of bed, crossed the room, opened his wardrobe, and peered into the mirror on the inside of the door.  A skinny boy of fourteen looked back at him, his bright green eyes puzzled under his untidy black hair.  He examined the lightning-bolt scar of his reflection more closely.  It looked normal, but it was still stinging.  harry tried to recall what he had been dreaming about before he had awoken.  It had seemed so real...There had been two people he knew and one he didn't ...He concentrated hard, frowning, trying to remember...  The dim picture of a darkened room came to him...There had been a snake on a hearth rug...a small man called Peter, nicknamed Wormtail...and a cold, high voice...the voice of Lord Voldemort.  Harry felt as though an ice cube had slipped down into his stomach at the very thought...  He closed his eyes tightly and tried to remember what Voldemort had looked like, but it was impossible...All Harry knew was that at the moment when Voldemort's chair had swung around, and he, Harry, had seen what was sitting in it, he had felt a spasm of horror, which had awoken him."
}