{
  "id": "08a29ada17831231e2547f1bc6cdf9953a28b4d1",
  "text": " Ygritte said the Thenns were savage fighters, and that their Magnar was a god to them. Jon could believe that. Unlike Jarl and Harma and Rattleshirt, Styr commanded absolute obedience from his men, and that discipline was no doubt part of why Mance had chosen him to go over the Wall.  He walked past the Thenns, sitting atop their rounded bronze helms about their cookfires. Where did Ygrette get herself to? He found her gear and his together, but no sign of the girl herself.  She took a torch and went off that way,  Grigg the Goat told him, pointing toward the back of the cavern.  Jon followed his finger, and found himself in a dim back room wandering through a maze of columns and stalactites. She can’t be here, he was thinking, when he heard her laugh. He turned toward the sound, but within ten paces he was in a dead end, facing a blank wall of rose and white flowstone. Baffled, he made his way back the way he’d come, and then he saw it: a dark hole under an outthrust of wet stone. He knelt, listened, heard the faint sound of water.  Ygritte?    In here,  her voice came back, echoing faintly.  Jon had to crawl a dozen paces before the cave opened up around him. When he stood again, it took his eyes a moment to adjust. Ygritte had brought a torch, but there was no other light. She stood beside a little waterfall that fell from a cleft in the rock down into a wide dark pool. The orange and yellow flames shone against the pale green water.   What are you doing here?  he asked her.   I heard water. I wanted t’see how deep the cave went.  She pointed with the torch.  There’s a passage goes down further. I followed it a hundred paces before I turned back.    A dead end?    You know nothing, Jon Snow. It went on and on and on. There are hundreds o’ caves in these hills, and down deep they all connect. There’s even a way under your Wall. Gorne’s Way.    Gorne,  said Jon.  Gorne was King-beyond-the-Wall.    Aye,  said Ygritte.  Together with his brother Gendel, three thousand years ago. They led a host o’ free folk through the caves, and the Watch was none the wiser. But when they come out, the wolves o’ Winterfell fell upon them.    There was a battle,  Jon recalled.  Gorne slew the King in the North, but his son picked up his banner and took the crown from his head, and cut down Gorne in turn.    And the sound o’ swords woke the crows in their castles, and they rode out all in black to take the free folk in the rear.    Yes. Gendel had the king to the south, the Umbers to the east, and the Watch to the north of him. He died as well.    You know nothing, Jon Snow. Gendel did not die. He cut his way free, through the crows, and led his people back north with the wolves howling at their heels. Only Gendel did not know the caves as Gorne had, and took a wrong turn.  She swept the torch back and forth, so the shadows jumped and moved.  Deeper he went, and deeper, and when he tried t’ turn back the ways that seemed familiar ended in stone rather than sky. Soon his torches began t’ fail, one by one, till finally there was naught but dark. Gendel’s folk were never seen again, but on a still night you can hear their children’s children’s children sobbing under the hills, still looking for the way back up. Listen? Do you hear them?   All Jon could hear was the falling water and the faint crackle of flames.  This way under the Wall was lost as well?    Some have searched for it. Them that go too deep find Gendel’s children, and Gendel’s children are always hungry.  Smiling, she set the torch carefully in a notch of rock, and came toward him.  There’s naught to eat in the dark but flesh,  she whispered, biting at his neck.  Jon nuzzled her hair and filled his nose with the smell of her.  You sound like Old Nan, telling Bran a monster story.   Ygritte punched his shoulder.  An old woman, am I?    You’re older than me.    Aye, and wiser. You know nothing, Jon Snow.  She pushed away from him, and shrugged out of her rabbitskin vest.   What are you doing?    Showing you how old I am.  She unlaced her doeskin shirt, tossed it aside, pulled her three woolen undershirts up over her head all at once.  I want you should see me.    We shouldn’t—    We should.  Her breasts bounced as she stood on one leg to pull one boot, then hopped onto her other foot to attend to the other. Her nipples were wide pink circles.  You as well,  Ygritte said as she yanked down her sheepskin breeches.  If you want to look you have to show. You know nothing, Jon Snow.    I know I want you,  he heard himself say, all his vows and all his honor forgotten. She stood before him naked as her name day, and he was as hard as the rock around them. He had been in her half a hundred times by now, but always beneath the furs, with others all around them. He had never seen how beautiful she was. Her legs were skinny but well muscled, the hair at the juncture of her thighs a brighter red than that on her head. Does that make it even luckier? He pulled her close.  I love the smell of you,  he said."
}