{
  "id": "08a5a10fa6282f4859a701bc9b53f223c263469f",
  "text": "    Gendry, there’s a hundred northmen. Maybe more, I couldn’t count them all. That’s as many as Ser Amory has. Well, not counting the Bloody Mummers. We just have to get them out and we can take over the castle and escape.    Well, you can’t get them out, no more’n you could save Lommy.  Gendry turned the breastplate with the tongs to look at it closely.  And if we did escape, where would we go?    Winterfell,  she said at once.  I’d tell Mother how you helped me, and you could stay—    Would m’lady permit? Could I shoe your horses for you, and make swords for your lordly brothers?   Sometimes he made her so angry.  You stop that!    Why should I wager my feet for the chance to sweat in Winterfell in place of Harrenhal? You know old Ben Blackthumb? He came here as a boy. Smithed for Lady Whent and her father before her and his father before him, and even for Lord Lothston who held Harrenhal before the Whents. Now he smiths for Lord Tywin, and you know what he says? A sword’s a sword, a helm’s a helm, and if you reach in the fire you get burned, no matter who you’re serving. Lucan’s a fair enough master. I’ll stay here.    The queen will catch you, then. She didn’t send gold cloaks after Ben Blackthumb!    Likely it wasn’t even me they wanted.    It was too, you know it. You’re somebody.    I’m a ’prentice smith, and one day might be I’ll make a master armorer… if I don’t run off and lose my feet or get myself killed.  He turned away from her, picked up his hammer once more, and began to bang.  Arya’s hands curled into helpless fists.  The next helm you make, put mule’s ears on it in place of bull’s horns!  She had to flee, or else she would have started hitting him. He probably wouldn’t even feel it if I did. When they find who he is and cut off his stupid mulehead, he’ll be sorry he didn’t help. She was better off without him anyhow. He was the one who got her caught at the village.  But thinking of the village made her remember the march, and the storeroom, and the Tickler. She thought of the little boy who’d been hit in the face with the mace, of stupid old All-for-Joffrey, of Lommy Greenhands. I was a sheep, and then I was a mouse, I couldn’t do anything but hide. Arya chewed her lip and tried to think when her courage had come back. Jaqen made me brave again. He made me a ghost instead of a mouse.  She had been avoiding the Lorathi since Weese’s death. Chiswyck had been easy, anyone could push a man off the wallwalk, but Weese had raised that ugly spotted dog from a pup, and only some dark magic could have turned the animal against him. Yoren found Jaqen in a black cell, the same as Rorge and Biter, she remembered. Jaqen did something horrible and Yoren knew, that’s why he kept him in chains. If the Lorathi was a wizard, Rorge and Biter could be demons he called up from some hell, not men at all.  Jaqen still owed her one death. In Old Nan’s stories about men who were given magic wishes by a grumkin, you had to be especially careful with the third wish, because it was the last. Chiswyck and Weese hadn’t been very important. The last death has to count, Arya told herself every night when she whispered her names. But now she wondered if that was truly the reason she had hesitated. So long as she could kill with a whisper, Arya need not be afraid of anyone… but once she used up the last death, she would only be a mouse again.  With Pinkeye awake, she dared not go back to her bed. Not knowing where else to hide, she made for the godswood. She liked the sharp smell of the pines and sentinels, the feel of grass and dirt between her toes, and the sound the wind made in the leaves. A slow little stream meandered through the wood, and there was one spot where it had eaten the ground away beneath a deadfall.  There, beneath rotting wood and twisted splintered branches, she found her hidden sword.  Gendry was too stubborn to make one for her, so she had made her own by breaking the bristles off a broom. Her blade was much too light and had no proper grip, but she liked the sharp jagged splintery end.  Whenever she had a free hour she stole away to work at the drills Syrio had taught her, moving barefoot over the fallen leaves, slashing at branches and whacking down leaves. Sometimes she even climbed the trees and danced among the upper branches, her toes gripping the limbs as she moved back and forth, teetering a little less every day as her balance returned to her. Night was the best time; no one ever bothered her at night.  Arya climbed. Up in the kingdom of the leaves, she unsheathed and for a time forgot them all, Ser Amory and the Mummers and her father’s men alike, losing herself in the feel of rough wood beneath the soles of her feet and the swish of sword through air. A broken branch became Joffrey. She struck at it until it fell away. The queen and Ser Ilyn and Ser Meryn and the Hound were only leaves, but she killed them all as well, slashing them to wet green ribbons. When her arm grew weary, she sat with her legs over a high limb to catch her breath in the cool dark air, listening to the squeak of bats as they hunted."
}