{
  "id": "08ae82c3e162547068f1184fe593e58467579e25",
  "text": " \"Read it aloud!\"  Dear Harry,  I hope this finds you before you reach your aunt and uncle. I don't know whether they're used to owl post.  Buckbeak and I are in hiding. I won't tell you where, in case this owl falls into the wrong hands. I have some doubt about his reliability, but he is the best I could find, and he did seem eager for the job.  I believe the dementors are still searching for me, but they haven't a hope of finding me here. I am planning to allow some Muggles to glimpse me soon, a long way from Hogwarts, so that the security on the castle will be lifted.  There is something I never got around to telling you during our brief meeting. It was I who sent you the Firebolt --  \"Ha!\" said Hermione triumphantly. \"See! I told you it was from him!\"  \"Yes, but he hadn't jinxed it, had he?\" said Ron. \"Ouch!\" The tiny owl, now hooting happily in his hand, had nibbled one of his fingers in what it seemed to think was an affectionate way.  Crookshanks took the order to the Owl Office for me. I used your name but told them to take the gold from my own Gringotts vault. Please consider it as thirteen birthdays' worth of presents from your godfather.  I would also like to apologize for the fright I think I gave you that night last year when you left your uncle's house. I had only hoped to get a glimpse of you before starting my journey north, but I think the sight of me alarmed you.  I am enclosing something else for you, which I think will make your next year at Hogwarts more enjoyable.  If ever you need me, send word. Your owl will find me.  I'll write again soon.  Sirius  Harry looked eagerly inside the envelope. There was another piece of parchment in there. He read it through quickly and felt suddenly as warm and contented as though he'd swallowed a bottle of hot butterbeer in one gulp.  I, Sirius Black, Harry Potter's godfather, hereby give him permission to visit Hogsmeade on weekends.  \"That'll be good enough for Dumbledore!\" said Harry happily. He looked back at Sirius's letter. \"Hang on, there's a RS....\"  I thought your ftiend Ron might like to keep this owl, as it's my fault he no longer has a rat.  Ron's eyes widened. The minute owl was still hooting excitedly. \"Keep him?\" he said uncertainly. He looked closely at the owl for a moment; then, to Harry's and Hermione's great surprise, he held him out for Crookshanks to sniff.  \"What do you reckon?\" Ron asked the cat. \"Definitely an owl?\"  Crookshanks purred.  \"That's good enough for me,\" said Ron happily. \"He's mine.\"  Harry read and reread the letter from Sirius all the way back into King's Cross station. It was still clutched tightly in his hand as he, Ron, and Hermione stepped back through the barrier of platform nine an(' three-quarters. Harry spotted Uncle Vernon at once. He was standing a good distance from Mr. and Mrs. Weasley, eyeing them suspiciously, and when Mrs. Weasley hugged Harry in greeting, his worst suspicions about them seemed confirmed.  \"I'll call about the World Cup!\" Ron yelled after Harry as Harry bid him and Hermione good-bye, then wheeled the trolley bearing his trunk and Hedwig's cage toward Uncle Vernon, who greeted him in his usual fashion.  \"What's that?\" he snarled, staring at the envelope Harry was still clutching in his hand. \"If it's another form for me to sign, you've got another ---\"  \"It's not,\" said Harry cheerfully. \"It's a letter from my godfather.\"  \"Godfather?\" sputtered Uncle Vernon. \"You haven't got a godfather!\"  \"Yes, I have,\" said Harry brightly. \"He was my mum and dad's best friend. He's a convicted murderer, but he's broken out of wizard prison and he's on the run. He likes to keep in touch with me, though... keep up with my news... check if I'm happy...\"  And, grinning broadly at the look of horror on Uncle Vernon's face, Harry set off toward the station exit, Hedwig rattling along in front of him, for what looked like a much better summer than the last.  THE END  Harry Potter and the Goblet of Fire by J.K. Rowling  THIS E-TEXT WAS NOT PRODUCED FOR PROFIT AND IS NOT FOR SALE.  we all know this is a copyright protected book....blah, blah, blah. no reproduction by any means...blah, blah, blah. enjoy.  To Peter Rowling. In Memory of Mr. Ridley. And to Susan Sladden. Who Helped Harry Out of His Cupboard.  CONTENTS  ONE The Riddle House - 1  TWO The Scar - 16  THREE The Invitation - 26  FOUR Back to the Burrow - 39  FIVE Weasleys' Wizard Wheezes - 51  SIX The Portkey - 65  SEVEN Bagman and Crouch - 75  EIGHT The Quidditch World Cup - 95  NINE The Dark Mark - 117  TEN Mayhem at the Ministry - 145  ELEVEN Aboard the Hogwarts Express - 158  TWELVE The Triwizard Tournament - 171  THIRTEEN Mad-Eye Moody - 193  FOURTEEN The Unforgivable Curses - 209  FIFTEEN Beauxbatons and Durmstrang - 228  SIXTEEN The Goblet of Fire - 248  SEVENTEEN The Four Champions -272  EIGHTEEN The Weighing of the Wands -288  NINTEEN The Hungarian Horntail -313  TWENTY The First Task - 337  TWENTY-ONE The House-Elf Liberation Front - 363  TWENTY-TWO The Unexpected Task - 385  TWENTY-THREE The Yule Ball - 403  TWENTY-FOUR Rita Skeeter's Scoop - 433  TWENTY-FIVE The Egg and the Eye - 458  TWENTY-SIX The Second Task - 479  TWENTY-SEVEN Padfoot Returns - 509  TWENTY-EIGHT The Madness of Mr."
}