{
  "id": "0baf14f3d4fa1451fde0ad080fe3e009b5846730",
  "text": " A strange thought.  Cersei could not have been pleased by her lord husband’s by-blows, yet in the end it mattered little whether the king had one bastard or a hundred. Law and custom gave the baseborn few rights. Gendry, the girl in the Vale, the boy at Storm’s End, none of them could threaten Robert’s trueborn children…  His musings were ended by a soft rap on his door.  A man to see you, my lord,  Harwin called.  He will not give his name.    Send him in,  Ned said, wondering.  The visitor was a stout man in cracked, mud-caked boots and a heavy brown robe of the coarsest roughspun, his features hidden by a cowl, his hands drawn up into voluminous sleeves.   Who are you?  Ned asked.   A friend,  the cowled man said in a strange, low voice.  We must speak alone, Lord Stark.   Curiosity was stronger than caution.  Harwin, leave us,  he commanded. Not until they were alone behind closed doors did his visitor draw back his cowl.   Lord Varys?  Ned said in astonishment.   Lord Stark,  Varys said politely, seating himself.  I wonder if I might trouble you for a drink?   Ned filled two cups with summerwine and handed one to Varys.  I might have passed within a foot of you and never recognized you,  he said, incredulous. He had never seen the eunuch dress in anything but silk and velvet and the richest damasks, and this man smelled of sweat instead of lilacs.   That was my dearest hope,  Varys said.  It would not do if certain people learned that we had spoken in private. The queen watches you closely. This wine is very choice. Thank you.    How did you get past my other guards?  Ned asked. Porther and Cayn had been posted outside the tower, and Alyn on the stairs.   The Red Keep has ways known only to ghosts and spiders.  Varys smiled apologetically.  I will not keep you long, my lord. There are things you must know. You are the King’s Hand, and the king is a fool.  The eunuch’s cloying tones were gone; now his voice was thin and sharp as a whip.  Your friend, I know, yet a fool nonetheless… and doomed, unless you save him. Today was a near thing. They had hoped to kill him during the melee.   For a moment Ned was speechless with shock.  Who?   Varys sipped his wine.  If I truly need to tell you that, you are a bigger fool than Robert and I am on the wrong side.    The Lannisters,  Ned said.  The queen… no, I will not believe that, not even of Cersei. She asked him not to fight!    She forbade him to fight, in front of his brother, his knights, and half the court. Tell me truly, do you know any surer way to force King Robert into the melee? I ask you.   Ned had a sick feeling in his gut. The eunuch had hit upon a truth; tell Robert Baratheon he could not, should not, or must not do a thing, and it was as good as done.  Even if he’d fought, who would have dared to strike the king?   Varys shrugged.  There were forty riders in the melee. The Lannisters have many friends. Amidst all that chaos, with horses screaming and bones breaking and Thoros of Myr waving that absurd firesword of his, who could name it murder if some chance blow felled His Grace?  He went to the flagon and refilled his cup.  After the deed was done, the slayer would be beside himself with grief. I can almost hear him weeping. So sad. Yet no doubt the gracious and compassionate widow would take pity, lift the poor unfortunate to his feet, and bless him with a gentle kiss of forgiveness. Good King Joffrey would have no choice but to pardon him.  The eunuch stroked his cheek.  Or perhaps Cersei would let Ser Ilyn strike off his head. Less risk for the Lannisters that way, though quite an unpleasant surprise for their little friend.   Ned felt his anger rise.  You knew of this plot, and yet you did nothing.    I command whisperers, not warriors.    You might have come to me earlier.    Oh, yes, I confess it. And you would have rushed straight to the king, yes? And when Robert heard of his peril, what would he have done? I wonder.   Ned considered that.  He would have damned them all, and fought anyway, to show he did not fear them.   Varys spread his hands.  I will make another confession, Lord Eddard. I was curious to see what you would do. Why not come to me? you ask, and I must answer, Why, because I did not trust you, my lord.    You did not trust me?  Ned was frankly astonished.   The Red Keep shelters two sorts of people, Lord Eddard,  Varys said.  Those who are loyal to the realm, and those who are loyal only to themselves. Until this morning, I could not say which you might be… so I waited to see… and now I know, for a certainty.  He smiled a plump tight little smile, and for a moment his private face and public mask were one.  I begin to comprehend why the queen fears you so much. Oh, yes I do.    You are the one she ought to fear,  Ned said.   No. I am what I am. The king makes use of me, but it shames him. A most puissant warrior is our Robert, and such a manly man has little love for sneaks and spies and eunuchs. If a day should come when Cersei whispers, ‘Kill that man,’ Ilyn Payne will snick my head off in a twinkling, and who will mourn poor Varys then? North or south, they sing no songs for spiders."
}