{
  "id": "0bfb8bece1003d90db93305cfd5ab0e869acca30",
  "text": "  Apple in its mouth, skin seared crisp. Eat the bastard. Don’t care if you choke on him. Promise me, Ned.    I promise.  Promise me, Ned, Lyanna’s voice echoed.   The girl,  the king said.  Daenerys. Let her live. If you can, if it… not too late… talk to them… Varys, Littlefinger… don’t let them kill her. And help my son, Ned. Make him be… better than me.  He winced.  Gods have mercy.    They will, my friend,  Ned said.  They will.   The king closed his eyes and seemed to relax.  Killed by a pig,  he muttered.  Ought to laugh, but it hurts too much.   Ned was not laughing.  Shall I call them back?   Robert gave a weak nod.  As you will. Gods, why is it so cold in here?   The servants rushed back in and hurried to feed the fires. The queen had gone; that was some small relief, at least. If she had any sense, Cersei would take her children and fly before the break of day, Ned thought. She had lingered too long already.  King Robert did not seem to miss her. He bid his brother Renly and Grand Maester Pycelle to stand in witness as he pressed his seal into the hot yellow wax that Ned had dripped upon his letter.  Now give me something for the pain and let me die.   Hurriedly Grand Maester Pycelle mixed him another draught of the milk of the poppy. This time the king drank deeply. His black beard was beaded with thick white droplets when he threw the empty cup aside.  Will I dream?   Ned gave him his answer.  You will, my lord.    Good,  he said, smiling.  I will give Lyanna your love, Ned. Take care of my children for me.   The words twisted in Ned’s belly like a knife. For a moment he was at a loss. He could not bring himself to lie. Then he remembered the bastards: little Barra at her mother’s breast, Mya in the Vale, Gendry at his forge, and all the others.  I shall… guard your children as if they were my own,  he said slowly.  Robert nodded and closed his eyes. Ned watched his old friend sag softly into the pillows as the milk of the poppy washed the pain from his face. Sleep took him.  Heavy chains jangled softly as Grand Maester Pycelle came up to Ned.  I will do all in my power, my lord, but the wound has mortified. It took them two days to get him back. By the time I saw him, it was too late. I can lessen His Grace’s suffering, but only the gods can heal him now.    How long?  Ned asked.   By rights, he should be dead already. I have never seen a man cling to life so fiercely.    My brother was always strong,  Lord Renly said.  Not wise, perhaps, but strong.  In the sweltering heat of the bedchamber, his brow was slick with sweat. He might have been Robert’s ghost as he stood there, young and dark and handsome.  He slew the boar. His entrails were sliding from his belly, yet somehow he slew the boar.  His voice was full of wonder.   Robert was never a man to leave the battleground so long as a foe remained standing,  Ned told him.  Outside the door, Ser Barristan Selmy still guarded the tower stairs.  Maester Pycelle has given Robert the milk of the poppy,  Ned told him.  See that no one disturbs his rest without leave from me.    It shall be as you command, my lord.  Ser Barristan seemed old beyond his years.  I have failed my sacred trust.    Even the truest knight cannot protect a king against himself,  Ned said.  Robert loved to hunt boar. I have seen him take a thousand of them.  He would stand his ground without flinching, his legs braced, the great spear in his hands, and as often as not he would curse the boar as it charged, and wait until the last possible second, until it was almost on him, before he killed it with a single sure and savage thrust.  No one could know this one would be his death.    You are kind to say so, Lord Eddard.    The king himself said as much. He blamed the wine.   The white-haired knight gave a weary nod.  His Grace was reeling in his saddle by the time we flushed the boar from his lair, yet he commanded us all to stand aside.    I wonder, Ser Barristan,  asked Varys, so quietly,  who gave the king this wine?   Ned had not heard the eunuch approach, but when he looked around, there he stood. He wore a black velvet robe that brushed the floor, and his face was freshly powdered.   The wine was from the king’s own skin,  Ser Barristan said.   Only one skin? Hunting is such thirsty work.    I did not keep count. More than one, for a certainty. His squire would fetch him a fresh skin whenever he required it.    Such a dutiful boy,  said Varys,  to make certain His Grace did not lack for refreshment.   Ned had a bitter taste in his mouth. He recalled the two fair-haired boys Robert had sent chasing after a breastplate stretcher. The king had told everyone the tale that night at the feast, laughing until he shook.  Which squire?    The elder,  said Ser Barristan.  Lancel.    I know the lad well,  said Varys.  A stalwart boy, Ser Kevan Lannister’s son, nephew to Lord Tywin and cousin to the queen. I hope the dear sweet lad does not blame himself. Children are so vulnerable in the innocence of their youth, how well do I remember."
}