{
  "id": "0dbdc2f1d9a967a935b3786d745ee4dcd296a5bd",
  "text": " Hagrid whooped and clapped and Mr. Ollivander cried, \"Oh, bravo! Yes, indeed, oh, very good. Well, well, well... how curious... how very curious... \"  He put Harry's wand back into its box and wrapped it in brown paper, still muttering, \"Curious... curious..  \"Sorry,\" said Harry, \"but what's curious?\"  Mr. Ollivander fixed Harry with his pale stare.  \"I remember every wand I've ever sold, Mr. Potter. Every single wand. It so happens that the phoenix whose tail feather is in your wand, gave another feather -- just one other. It is very curious indeed that you should be destined for this wand when its brother why, its brother gave you that scar.\"  Harry swallowed.  \"Yes, thirteen-and-a-half inches. Yew. Curious indeed how these things happen. The wand chooses the wizard, remember.... I think we must expect great things from you, Mr. Potter.... After all, He- Who-Must-Not-Be-Named did great things -- terrible, yes, but great.\"  Harry shivered. He wasn't sure he liked Mr. Ollivander too much. He paid seven gold Galleons for his wand, and Mr. Ollivander bowed them from his shop.  The late afternoon sun hung low in the sky as Harry and Hagrid made their way back down Diagon Alley, back through the wall, back through the Leaky Cauldron, now empty. Harry didn't speak at all as they walked down the road; he didn't even notice how much people were gawking at them on the Underground, laden as they were with all their funny-shaped packages, with the snowy owl asleep in its cage on Harry's lap. Up another escalator, out into Paddington station; Harry only realized where they were when Hagrid tapped him on the shoulder.  \"Got time fer a bite to eat before yer train leaves,\" he said.  He bought Harry a hamburger and they sat down on plastic seats to eat them. Harry kept looking around. Everything looked so strange, somehow.  \"You all right, Harry? Yer very quiet,\" said Hagrid.  Harry wasn't sure he could explain. He'd just had the best birthday of his life -- and yet -- he chewed his hamburger, trying to find the words.  \"Everyone thinks I'm special,\" he said at last. \"All those people in the Leaky Cauldron, Professor Quirrell, Mr. Ollivander... but I don't know anything about magic at all. How can they expect great things? I'm famous and I can't even remember what I'm famous for. I don't know what happened when Vol-, sorry -- I mean, the night my parents died.\"  Hagrid leaned across the table. Behind the wild beard and eyebrows he wore a very kind smile.  \"Don' you worry, Harry. You'll learn fast enough. Everyone starts at the beginning at Hogwarts, you'll be just fine. just be yerself. I know it's hard. Yeh've been singled out, an' that's always hard. But yeh'll have a great time at Hogwarts -- I did -- still do, 'smatter of fact.\"  Hagrid helped Harry on to the train that would take him back to the Dursleys, then handed him an envelope.  \"Yer ticket fer Hogwarts, \" he said. \"First o' September -- King's Cross -- it's all on yer ticket. Any problems with the Dursleys, send me a letter with yer owl, she'll know where to find me.... See yeh soon, Harry.\"  The train pulled out of the station. Harry wanted to watch Hagrid until he was out of sight; he rose in his seat and pressed his nose against the window, but he blinked and Hagrid had gone.   CHAPTER SIX  THE JOURNEY FROM PLATFORM NINE AND THREE-QUARTERS  Harry's last month with the Dursleys wasn't fun. True, Dudley was now so scared of Harry he wouldn't stay in the same room, while Aunt Petunia and Uncle Vernon didn't shut Harry in his cupboard, force him to do anything, or shout at him -- in fact, they didn't speak to him at all. Half terrified, half furious, they acted as though any chair with Harry in it were empty. Although this was an improvement in many ways, it did become a bit depressing after a while.  Harry kept to his room, with his new owl for company. He had decided to call her Hedwig, a name he had found in A History of Magic. His school books were very interesting. He lay on his bed reading late into the night, Hedwig swooping in and out of the open window as she pleased. It was lucky that Aunt Petunia didn't come in to vacuum anymore, because Hedwig kept bringing back dead mice. Every night before he went to sleep, Harry ticked off another day on the piece of paper he had pinned to the wall, counting down to September the first.  On the last day of August he thought he'd better speak to his aunt and uncle about getting to King's Cross station the next day, so he went down to the living room where they were watching a quiz show on television. He cleared his throat to let them know he was there, and Dudley screamed and ran from the room.  \"Er -- Uncle Vernon?\"  Uncle Vernon grunted to show he was listening.  \"Er -- I need to be at King's Cross tomorrow to -- to go to Hogwarts.\"  Uncle Vernon grunted again.  \"Would it be all right if you gave me a lift?\"  Grunt. Harry supposed that meant yes.  \"Thank you.\"  He was about to go back upstairs when Uncle Vernon actually spoke."
}