{
  "id": "0eb09c720c7d96220346c073717942a75ddc0961",
  "text": " Despite the heat of the day, Ser Jorah wore his green wool surcoat over chainmail, the black bear of Mormont sewn on his chest.  But neither her beauty nor his size and strength would serve with the men whose ships they needed.   You require passage for a hundred Dothraki, all their horses, yourself and this knight, and three dragons?  said the captain of the great cog Ardent Friend before he walked away laughing. When she told a Lyseni on the Trumpeteer that she was Daenerys Stormborn, Queen of the Seven Kingdoms, he gave her a deadface look and said,  Aye, and I’m Lord Tywin Lannister and shit gold every night.  The cargomaster of the Myrish galley Silken Spirit opined that dragons were too dangerous at sea, where any stray breath of flame might set the rigging afire. The owner of Lord Faro’s Belly would risk dragons, but not Dothraki.  I’ll have no such godless savages in my Belly, I’ll not.  The two brothers who captained the sister ships Quicksilver and Greyhound seemed sympathetic and invited them into the cabin for a glass of Arbor red. They were so courteous that Dany was hopeful for a time, but in the end the price they asked was far beyond her means, and might have been beyond Xaro’s. Pinchbottom Petto and Sloe-Eyed Maid were too small for her needs, Bravo was bound for the Jade Sea, and Magister Manolo scarce looked seaworthy.  As they made their way toward the next quay, Ser Jorah laid a hand against the small of her back.  Your Grace. You are being followed. No, do not turn.  He guided her gently toward a brass-seller’s booth.  This is a noble work, my queen,  he proclaimed loudly, lifting a large platter for her inspection.  See how it shines in the sun?   The brass was polished to a high sheen. Dany could see her face in it… and when Ser Jorah angled it to the right, she could see behind her.  I see a fat brown man and an older man with a staff. Which is it?    Both of them,  Ser Jorah said.  They have been following us since we left Quicksilver.   The ripples in the brass stretched the strangers queerly, making one man seem long and gaunt, the other immensely squat and broad.  A most excellent brass, great lady,  the merchant exclaimed.  Bright as the sun! And for the Mother of Dragons, only thirty honors.   The platter was worth no more than three.  Where are my guards?  Dany declared.  This man is trying to rob me!  For Jorah, she lowered her voice and spoke in the Common Tongue.  They may not mean me ill. Men have looked at women since time began, perhaps it is no more than that.   The brass-seller ignored their whispers.  Thirty? Did I say thirty? Such a fool I am. The price is twenty honors.    All the brass in this booth is not worth twenty honors,  Dany told him as she studied the reflections. The old man had the look of Westeros about him, and the brown-skinned one must weigh twenty stone. The Usurper offered a lordship to the man who kills me, and these two are far from home. Or could they be creatures of the warlocks, meant to take me unawares?   Ten, Khaleesi, because you are so lovely. Use it for a looking glass. Only brass this fine could capture such beauty.    It might serve to carry nightsoil. If you threw it away, I might pick it up, so long as I did not need to stoop. But pay for it?  Dany shoved the platter back into his hands.  Worms have crawled up your nose and eaten your wits.    Eight honors,  he cried.  My wives will beat me and call me fool, but I am a helpless child in your hands. Come, eight, that is less than it is worth.    What do I need with dull brass when Xaro Xhoan Daxos feeds me off plates of gold?  As she turned to walk off, Dany let her glance sweep over the strangers. The brown man was near as wide as he’d looked in the platter, with a gleaming bald head and the smooth cheeks of a eunuch. A long curving arakh was thrust through the sweat-stained yellow silk of his bellyband. Above the silk, he was naked but for an absurdly tiny iron-studded vest. Old scars crisscrossed his tree-trunk arms, huge chest, and massive belly, pale against his nut-brown skin.  The other man wore a traveler’s cloak of undyed wool, the hood thrown back. Long white hair fell to his shoulders, and a silky white beard covered the lower half of his face. He leaned his weight on a hardwood staff as tall as he was. Only fools would stare so openly if they meant me harm. All the same, it might be prudent to head back toward Jhogo and Aggo.  The old man does not wear a sword,  she said to Jorah in the Common Tongue as she drew him away.  The brass merchant came hopping after them.  Five honors, for five it is yours, it was meant for you.   Ser Jorah said,  A hardwood staff can crack a skull as well as any mace.    Four! I know you want it!  He danced in front of them, scampering backward as he thrust the platter at their faces.   Do they follow?    Lift that up a little higher,  the knight told the merchant.  Yes. The old man pretends to linger at a potter’s stall, but the brown one has eyes only for you."
}