{
  "id": "106341d851d2881cd09d69877bead7b989896712",
  "text": " If it turns out it wasn't Hagrid, he'll be back and no more said. But I've got to take him. Got to. Wouldn't be doing my duty -\"  \"Take me?\" said Hagrid, who was trembling. \"Take me where?\"  \"For a short stretch only,\" said Fudge, not meeting Hagrid's eyes. \"Not a punishment, Hagrid, more a precaution. If someone else is caught, you'll be let out with a full apology -\"    \"Not Azkaban?\" croaked Hagrid.  Before Fudge could answer, there was another loud rap on the door.  Dumbledore answered it. It was Harry's turn for an elbow in the ribs; he'd let out an audible gasp.  Mr. Lucius Malfoy strode into Hagrid's hut, swathed in a long black traveling cloak, smiling a cold and satisfied smile. Fang started to growl.  \"Already here, Fudge,\" he said approvingly. \"Good, good. . .\"  \"What're you doin' here?\" said Hagrid furiously. \"Get outta my house!\"  \"My dear man, please believe me, I have no pleasure at all in being inside your - er - d'you call this a house?\" said Lucius Malfoy, sneering as he looked around the small cabin. \"I simply called at the school and was told that the headmaster was here.\"  \"And what exactly did you want with me, Lucius?\" said Dumbledore. He spoke politely, but the fire was still blazing in his blue eyes.  \"Dreadful thing, Dumbledore,\" said Malfoy lazily, taking out a long roll of parchment, \"but the governors feel it's time for you to step aside. This is an Order of Suspension - you'll find all twelve signatures on it. I'm afraid we feel you're losing your touch. How many attacks have there been now? Two more this afternoon, wasn't it? At this rate, there'll be no Muggle-borns left at Hogwarts, and we all know what an awful loss that would be to the school.\"  \"Oh, now, see here, Lucius,\" said Fudge, looking alarmed, \"Dumbledore suspended - no, no - last thing we want just now  262  \"The appointment - or suspension - of the headmaster is a matter for the governors, Fudge,\" said Mr. Malfoy smoothly. \"And as Dumbledore has failed to stop these attacks -\"  \"See here, Malfoy, if Dumbledore can't stop them,\" said Fudge, whose upper lip was sweating now, \"I mean to say, who can?\"  \"That remains to be seen,\" said Mr. Malfoy with a nasty smile. \"But as all twelve of us have voted -\"  Hagrid leapt to his feet, his shaggy black head grazing the ceiling.  'An' how many did yeh have ter threaten an' blackmail before they agreed, Malfoy, eh?\" he roared.  \"Dear, dear, you know, that temper of yours will lead you into trouble one of these days, Hagrid,\" said Mr. Malfoy. \"I would advise you not to shout at the Azkaban guards like that. They won't like it at all.\"  \"Yeh can' take Dumbledore!\" yelled Hagrid, making Fang the boarhound cower and whimper in his basket. \"Take him away, an' the Muggle-borns won' stand a chance! There'll be killin' next!\"  \"Calm yourself, Hagrid,\" said Dumbledore sharply. He looked at Lucius Malfoy.  \"If the governors want my removal, Lucius, I shall of course step aside -\"  \"But -\" stuttered Fudge.  \"No!\"growled Hagrid.  Dumbledore had not taken his bright blue eyes off Lucius Malfoy's cold gray ones.  \"However,\" said Dumbledore, speaking very slowly and clearly so that none of them could miss a word, \"you will find that I will  * 26$*  ummer was creeping over the grounds around the castle; sky and lake alike turned periwinkle blue and flowers large as cabbages burst into bloom in the greenhouses. But with no Hagrid visible from the castle windows, striding the grounds with Fang at his heels, the scene didn't look right to Harry; no better, in fact, than the inside of the castle, where things were so horribly wrong.  Harry and Ron had tried to visit Hermione, but visitors were now barred from the hospital wing.  \"We're taking no more chances,\" Madam Pomfrey told them severely through a crack in the infirmary door. \"No, I'm sorry, there's every chance the attacker might come back to finish these people off . . .\"  With Dumbledore gone, fear had spread as never before, so that the sun warming the castle walls outside seemed to stop at the mullioned windows. There was barely a face to be seen in the school  * 265*    that didn't look worried and tense, and any laughter that rang through the corridors sounded shrill and unnatural and was quickly stifled.  Harry constantly repeated Dumbledore's final words to himself \"I will only truly have left this school when none here are loyal to me... Help will always be given at Hogwarts to those who ask for it.\" But what good were these words? Who exactly were they supposed to ask for help, when everyone was just as confused and scared as they were?  Hagrid's hint about the spiders was far easier to understand the trouble was, there didn't seem to be a single spider left in the castle to follow. Harry looked everywhere he went, helped (rather reluctantly) by Ron. They were hampered, of course, by the fact that they weren't allowed to wander off on their own but had to move around the castle in a pack with the other Gryffindors. Most of their fellow students seemed glad that they were being shepherded from class to class by teachers, but Harry found it very irksome."
}