{
  "id": "10a0d96ab7e96bf0ee3c627c7dd9bf9209462e49",
  "text": "       Those days,  the Third Age of Middle-earth, are now long past, and  the  shape  of all lands has  been changed; but the regions in which Hobbits then   lived were doubtless  the  same  as  those  in which  they still linger: the  North-West  of the  Old World, east of  the Sea. Of their original home  the  Hobbits in Bilbo's time preserved no  knowledge. A  love  of learning (other   than genealogical lore) was far from general among them,  but there remained  still a few  in  the  older families  who  studied their own books, and even  gathered reports  of old times and distant lands  from Elves,  Dwarves,  and  Men. Their own  records  began only  after the settlement of the  Shire, and  their most ancient  legends hardly looked further  back than their Wandering   Days. It is clear, nonetheless, from these legends, and from the evidence of  their peculiar words  and customs, that like many other  folk Hobbits had in  the distant past moved westward. Their earliest tales seem to glimpse a time  when they dwelt in the upper vales of Anduin, between the eaves of  Greenwood  the Great  and the Misty Mountains. Why they  later undertook  the hard  and  perilous crossing of the mountains into Eriador is no longer  certain. Their  own  accounts speak  of the multiplying of Men in  the land, and of a shadow  that fell on the forest,  so that it became  darkened  and its new  name was  Mirkwood.       Before the  crossing  of the  mountains the Hobbits had  already become  divided  into  three  somewhat   different  breeds:  Harfoots,  Stoors,  and  Fallohides. The Harfoots were  browner  of skin, smaller,  and  shorter, and  they were beardless and bootless; their hands and feet were neat and nimble;   and they preferred highlands and hillsides. The Stoors were broader, heavier   in build; their feet  and hands were larger,  and they preferred flat  lands  and riversides.  The Fallohides  were fairer of  skin and also of  hair, and  they were taller and slimmer than the others; they were lovers of  trees and  of woodlands.        The  Harfoots had  much  to do  with Dwarves in ancient times, and long  lived in the  foothills  of  the  mountains. They moved westward early,  and  roamed over Eriador as far as Weathertop while the  others were still in the  Wilderland. They were the most normal  and representative variety of Hobbit,  and  far  the most  numerous. They  were the most inclined to settle  in one  place, and longest preserved their ancestral habit of living in  tunnels and  holes.   ####-     The Stoors lingered long by  the  banks of  the Great River Anduin, and  were less shy of Men.  They came west after  the  Harfoots and  followed the  course of the  Loudwater  southwards;  and  there  many of  them  long dwelt  between Tharbad and the borders of Dunland before they moved north again.       The  Fallohides, the least numerous, were a northerly branch. They were  more friendly with Elves  than the other Hobbits were, and had more skill in  language  and song than in handicrafts; and of old they preferred hunting to  tilling.  They  crossed the mountains north of Rivendell  and came  down the   River Hoarwell. In  Eriador they soon  mingled with the other kinds that had  preceded them,  but being somewhat  bolder  and more adventurous, they  were  often found as leaders or chieftains among clans of Harfoots or Stoors. Even  in Bilbo's time the strong Fallohidish strain could still be noted among the  greater families, such as the Tooks and the Masters of Buckland.       In the  westlands  of Eriador, between  the  Misty  Mountains  and  the  Mountains of  Lune, the Hobbits found both Men and Elves. Indeed, a  remnant  still dwelt there of the D®nedain, the kings of Men that  came over the  Sea   out of  Westernesse; but  they were  dwindling fast and  the  lands of their  North Kingdom were falling far and  wide into waste. There was  room and  to  spare for  incomers, and ere long  the Hobbits began  to  settle in  ordered  communities. Most of their earlier settlements had long disappeared and been  forgotten in Bilbo's time;  but  one of the  first to become important still  endured, though reduced in  size; this  was at Bree and in the Chetwood that  lay round about, some forty miles east of the Shire.       It was in these  early days,  doubtless, that the Hobbits learned their  letters and  began to write  after  the  manner  of the D®nedain, who had in  their  turn long before learned  the art from  the Elves. And in  those days  also they  forgot  whatever languages  they had used before,  and spoke ever   after the  Common  Speech, the  Westron as it  was  named, that was  current  through all the lands of the kings  from Arnor to  Gondor, and about all the  coasts of the Sea from Belfalas to Lune. Yet they kept  a few words of their  own,  as  well as their own names of months  and days, and  a great store of  personal names out of the past.       About this time legend among  the Hobbits first  becomes history with a   reckoning  of years."
}