{
  "id": "115f981e66cc14407d2f5bd5966422da9c667f29",
  "text": " \"There,\" said Snape harshly.  \"There.  The Dark Mark.  It is not as clear as it was an hour or so ago, when it burned black, but you can still see it.  Every Death Eater had the sign burned into him by the Dark Lord.  It was a means of distinguishing one another, and his means of summoning us to him.  When he touched the Mark of any Death Eater, we were to Disapparate, and Apparate, instantly, at his side.  This Mark has been growing clearer all year. Karkaroff s too.  Why do you think Karkaroff fled tonight?  We both felt the Mark burn.  We both knew he had returned.  Karkaroff fears the Dark Lord's vengeance.  He betrayed too many of his fellow Death Eaters to be sure of a welcome back into the fold.\" Fudge stepped back from Snape too.  He was shaking his head.  He did not seem to have taken in a word Snape had said.  He stared, apparently repelled by the ugly mark on Snape's arm, then looked up at Dumbledore and whispered, \"I don't know what you and your staff are playing at, Dumbledore, but I have heard enough.  I have no more to add.  I will be in touch with you tomorrow, Dumbledore, to discuss the running of this school.  I must return to the Ministry.\" He had almost reached the door when he paused.  He turned around, strode back down the dormitory, and stopped at Harry's bed. \"Your winnings,\" he said shortly, taking a large bag of gold out of his pocket and dropping it onto Harrys bedside table.  \"One thousand Galleons.  There should have been a presentation ceremony, but under the circumstances .. .\" He crammed his bowler hat onto his head and walked out of the room, slamming the door behind him.  The moment he had disappeared, Dumbledore turned to look at the group around Harry's bed. \"There is work to be done,\" he said.  \"Molly... am I right in thinking that I can count on you and Arthur?\" \"Of course you can,\" said Mrs. Weasley.  She was white to the lips, but she looked resolute.  \"We know what Fudge is.  It's Arthur's fondness for Muggles that has held him back at the Ministry all these years.  Fudge thinks he lacks proper wizarding pride.\" \"Then I need to send a message to Arthur,\" said Dumbledore.  \"All those that we can persuade of the truth must be notified immediately, and he is well placed to contact those at the Ministry who are not as shortsighted as Cornelius.\" \"I'll go to Dad,\" said Bill, standing up.  \"I'll go now.\" \"Excellent,\" said Dumbledore.  \"Tell him what has happened.  Tell him I will be in direct contact with him shortly.  He will need to be discreet, however.  If Fudge thinks I am interfering at the Ministry -\" \"Leave it to me,\" said Bill. He clapped a hand on Harry's shoulder, kissed his mother on the cheek, pulled on his cloak, and strode quickly from the room. \"Minerva,\" said Dumbledore, turning to Professor McGonagall, \"I want to see Hagrid in my office as soon as possible.  Also - if she will consent to come - Madame Maxime.\" Professor McGonagall nodded and left without a word. \"Poppy,\" Dumbledore said to Madam Pomfrey, \"would you be very kind and go down to Professor Moodys office, where I think you will find a house-elf called Winky in considerable distress?  Do what you can for her, and take her back to the kitchens.  I think Dobby will look after her for us.\" \"Very - very well,\" said Madam Pomfrey, looking startled, and she too left. Dumbledore made sure that the door was closed, and that Madam Pomfrey's footsteps had died away, before he spoke again. \"And now,\" he said, \"it is time for two of our number to recognize each other for what they are.  Sirius ... if you could resume your usual form.\" The great black dog looked up at Dumbledore, then, in an instant, turned back into a man. Mrs. Weasley screamed and leapt back from the bed. \"Sirius Black!\"  she shrieked, pointing at him. \"Mum, shut up!\"  Ron yelled.  \"It's okay!\" Snape had not yelled or jumped backward, but the look on his face was one of mingled fury and horror. \"Him!\"  he snarled, staring at Sirius, whose face showed equal dislike.  \"What is he doing here?\" \"He is here at my invitation,\" said Dumbledore, looking between them, \"as are you, Severus.  I trust you both.  It is time for you to lay aside your old differences and trust each other.\" Harry thought Dumbledore was asking for a near miracle.  Sirius and Snape were eyeing each other with the utmost loathing. \"I will settle, in the short term,\" said Dumbledore, with a bite of impatience in his voice, \"for a lack of open hostility.  You will shake hands.  You are on the same side now.  Time is short, and unless the few of us who know the truth do not stand united, there is no hope for any us. Very slowly - but still glaring at each other as though each wished the other nothing but ill - Sirius and Snape moved toward each other and shook hands.  They let go extremely quickly.    \"That will do to be going on with,\" said Dumbledore, stepping between them once more.  \"Now I have work for each of you.  Fudge's attitude, though not unexpected, changes everything."
}