{
  "id": "1185d97738fd4adbe0eafd3af75d63ad66644486",
  "text": " He loves Muggle-borns. A decent headmaster would never've let slime like that Creevey in.\"  *222*  Malfoy started taking pictures with an imaginary camera and did a cruel but accurate impression of Colin: \"`Potter, can I have your picture, Potter? Can I have your autograph? Can I lick your shoes, please, Potter?\"'  He dropped his hands and looked at Harry and Ron.  \"What's the matter with you two?\"  Far too late, Harry and Ron forced themselves to laugh, but Malfoy seemed satisfied; perhaps Crabbe and Goyle were always slow on the uptake.  \"Saint Potter, the Mudbloods' friend,\" said Malfoy slowly. \"He's another one with no proper wizard feeling, or he wouldn't go around with that jumped up Granger Mudblood. And people think he's Slytherin's heir!\"  Harry and Ron waited with bated breath: Malfoy was surely seconds away from telling them it was him - but then  \"I wish I knew who it is,\" said Malfoy petulantly. \"I could help them.\"  Ron's jaw dropped so that Crabbe looked even more clueless than usual. Fortunately, Malfoy didn't notice, and Harry, thinking fast, said, \"You must have some idea who's behind it all ......  \"You know I haven't, Goyle, how many times do I have to tell you?\" snapped Malfoy. \"And Father won't tell me anything about the last time the Chamber was opened either. Of course, it was fifty years ago, so it was before his time, but he knows all about it, and he says that it was all kept quiet and it'll look suspicious if I know too much about it. But I know one thing - last time the Chamber of Secrets was opened, a Mudblood died. So I bet it's a matter of time before one of them's killed this time .... I hope it's Granger,\" he said with relish.  Ron was clenching Crabbe's gigantic fists. Feeling that it would be a bit of a giveaway if Ron punched Malfoy, Harry shot him a warning look and said, \"D'you know if the person who opened the Chamber last time was caught?\"  \"Oh, yeah ... whoever it was was expelled,\" said Malfoy. \"They're probably still in Azkaban.\"  \"Azkaban?\" said Harry, puzzled.  \"Azkaban - the wizard prison, Goyle,\" said Malfoy, looking at him in disbelief \"Honestly, if you were any slower, you'd be going backward.\"  He shifted restlessly in his chair and said, \"Father says to keep my head down and let the Heir of Slytherin get on with it. He says the school needs ridding of all the Mudblood filth, but not to get mixed up in it. Of course, he's got a lot on his plate at the moment. You know the Ministry of Magic raided our manor last week?\"  Harry tried to force Goyle's dull face into a look of concern.  \"Yeah. . .\" said Malfoy. \"Luckily, they didn't find much. Father's got some very valuable Dark Arts stuff. But luckily, we've got our own secret chamber under the drawing-room floor  -\"  \"Ho!\" said Ron.  Malfoy looked at him. So did Harry. Ron blushed. Even his hair was turning red. His nose was also slowly lengthening - their hour was up, Ron was turning back into himself, and from the look of horror he was suddenly giving Harry, he must be, too.  They both jumped to their feet.  \"Medicine for my stomach,\" Ron grunted, and without further ado they sprinted the length of the Slytherin common room, hurled themselves at the stone wall, and dashed up the passage, hoping against hope that Malfoy hadn't noticed anything. Harry  224  could feel his feet slipping around in Goyle's huge shoes and had to hoist up his robes as he shrank; they crashed up the steps into the dark entrance hall, which was full of a muffled pounding coming from the closet where they'd locked Crabbe and Goyle. Leaving their shoes outside the closet door, they sprinted in their socks up the marble staircase toward Moaning Myrtle's bathroom.  \"Well, it wasn't a complete waste of time,\" Ron panted, closing the bathroom door behind them. \"I know we still haven't found out who's doing the attacks, but I'm going to write to Dad tomorrow and tell him to check under the Malfoys' drawing room.\"  Harry checked his face in the cracked mirror. He was back to normal. He put his glasses on as Ron hammered on the door of Hermione's stall.  \"Hermione, come out, we've got loads to tell you -\"  \"Go away!\" Hermione squeaked.  Harry and Ron looked at each other.  \"What's the matter?\" said Ron. \"You must be back to normal by now, we are  But Moaning Myrtle glided suddenly through the stall door. Harry had never seen her looking so happy.  \"Ooooooh, wait till you see,\" she said. \"It's awful-\"  They heard the lock slide back and Hermione emerged, sobbing, her robes pulled up over her head.  \"What's up?\" said Ron uncertainly. \"Have you still got Millicent's nose or something?\"  Hermione let her robes fall and Ron backed into the sink.  Her face was covered in black fur. Her eyes had turned yellow and there were long, pointed ears poking through her hair.  \"It was a c-cat hair!\" she howled. \"M-Millicent Bulstrode  *225*  m-must have a cat! And the p-potion isn't supposed to be used for animal transformations!\"  \"Uh-oh,\" said Ron.  \"You'll be teased something dreadful,\" said Myrtle happily."
}