{
  "id": "126e27fe525abd9b8a3ebe8969b237c12ed3cab2",
  "text": " Instead, he read passages from his books to them, and sometimes reenacted some of the more dramatic bits. He usually picked Harry to help him with these reconstructions; so far, Harry had been forced to play a simple Transylvanian villager whom Lockhart had cured of a Babbling Curse, a yeti with a head cold, and a vampire who had been unable to eat anything except lettuce since Lockhart had dealt with him.  Harry was hauled to the front of the class during their very next Defense Against the Dark Arts lesson, this time acting a werewolf If he hadn't had a very good reason for keeping Lockhart in a good mood, he would have refused to do it.  \"Nice loud howl, Harry - exactly - and then, if you'll believe it, I pounced - like this - slammed him to the floor - thus with one hand, I managed to hold him down - with my other, I  *161*    put my wand to his throat -I then screwed up my remaining strength and performed the immensely complex Homorphus Charm - he let out a piteous moan - go on, Harry - higher than that - good - the fur vanished - the fangs shrank - and he turned back into a man. Simple, yet effective - and another village will remember me forever as the hero who delivered them from the monthly terror of werewolf attacks.\"  The bell rang and Lockhart got to his feet.  \"Homework - compose a poem about my defeat of the Wagga Wagga Werewolf! Signed copies of Magical Me to the author of the best one!\"  The class began to leave. Harry returned to the back of the room, where Ron and Hermione were waiting.  \"Ready?\" Harry muttered.  \"Wait till everyone's gone,\" said Hermione nervously. \"All right . . . \"  She approached Lockhart's desk, a piece of paper clutched tightly in her hand, Harry and Ron right behind her.  \"Er - Professor Lockhart?\" Hermione stammered. \"I wanted to - to get this book out of the library. Just for background reading.\" She held out the piece of paper, her hand shaking slightly. \"But the thing is, it's in the Restricted Section of the library, so I need a teacher to sign for it - I'm sure it would help me understand what you say in Gadding with Ghouls about slow-acting venoms  \"Ah, Gadding with Ghouls!\" said Lockhart, taking the note from Hermione and smiling widely at her. \"Possibly my very favorite book. You enjoyed it?\"  -162  \"Oh, yes,\" said Hermione eagerly. \"So clever, the way you trapped that last one with the tea-strainer -\"  \"Well, I'm sure no one will mind me giving the best student of the year a little extra help,\" said Lockhart warmly, and he pulled out an enormous peacock quill. \"Yes, nice, isn't it?\" he said, misreading the revolted look on Ron's face. \"I usually save it for book-signings.\"  He scrawled an enormous loopy signature on the note and handed it back to Hermione.  \"So, Harry,\" said Lockhart, while Hermione folded the note with fumbling fingers and slipped it into her bag. \"Tomorrow's the first Quidditch match of the season, I believe? Gryffindor against Slytherin, is it not? I hear you're a useful player. I was a Seeker, too. I was asked to try for the National Squad, but preferred to dedicate my life to the eradication of the Dark Forces. Still, if ever you feel the need for a little private training, don't hesitate to ask. Always happy to pass on my expertise to less able players ......  Harry made an indistinct noise in his throat and then hurried off after Ron and Hermione.  \"I don't believe it,\" he said as the three of them examined the signature on the note. \"He didn't even look at the book we wanted.\"  \"That's because he's a brainless git,\" said Ron. \"But who cares, we've got what we needed -\"  \"He is not a brainless git,\" said Hermione shrilly as they half ran toward the library.  \"Just because he said you were the best student of the year -\"  They dropped their voices as they entered the muffled stillness of the library. Madam Pince, the librarian, was a thin, irritable woman who looked like an underfed vulture.  *163*  \"Moste Potente Potions?\" she repeated suspiciously, trying to take the note from Hermione; but Hermione wouldn't let go.  \"I was wondering if I could keep it,\" she said breathlessly.  \"Oh, come on,\" said Ron, wrenching it from her grasp and thrusting it at Madam Pince. \"We'll get you another autograph. Lockhart'll sign anything if it stands still long enough.\"  Madam Pince held the note up to the light, as though determined to detect a forgery, but it passed the test. She stalked away between the lofty shelves and returned several minutes later carrying a large and moldy-looking book. Hermione put it carefully into her bag and they left, trying not to walk too quickly or look too guilty.  Five minutes later, they were barricaded in Moaning Myrtle's out-of- order bathroom once again. Hermione had overridden Ron's objections by pointing out that it was the last place anyone in their right minds would go, so they were guaranteed some privacy. Moaning Myrtle was crying noisily in her stall, but they were ignoring her, and she them.  Hermione opened Moste Potente Potions carefully, and the three of them bent over the damp-spotted pages."
}