{
  "id": "13697bcd006e640d3f8a3a14e9a0bc907f429bb4",
  "text": " Their footsteps echoed off the damp stones, and the water sounds grew louder.  Should we have brought torches?  Jojen asked.   Your eyes will adjust,  said Sam.  Keep one hand on the wall and you won’t fall.   The well grew darker and colder with every turn. When Bran finally lifted his head around to look back up the shaft, the top of the well was no bigger than a half-moon.  Hodor,  Hodor whispered,  Hodorhodorhodorhodorhodorhodor,  the well whispered back. The water sounds were close, but when Bran peered down he saw only blackness.  A turn or two later Sam stopped suddenly. He was a quarter of the way around the well from Bran and Hodor and six feet farther down, yet Bran could barely see him. He could see the door, though. The Black Gate, Sam had called it, but it wasn’t black at all.  It was white weirwood, and there was a face on it.  A glow came from the wood, like milk and moonlight, so faint it scarcely seemed to touch anything beyond the door itself, not even Sam standing right before it. The face was old and pale, wrinkled and shrunken. It looks dead. Its mouth was closed, and its eyes; its cheeks were sunken, its brow withered, its chin sagging. If a man could live for a thousand years and never die but just grow older, his face might come to look like that.  The door opened its eyes.  They were white too, and blind.  Who are you?  the door asked, and the well whispered,  Who-who-who-who-who-who-who.    I am the sword in the darkness,  Samwell Tarly said.  I am the watcher on the walls. I am the fire that burns against the cold, the light that brings the dawn, the horn that wakes the sleepers. I am the shield that guards the realms of men.    Then pass,  the door said. Its lips opened, wide and wider and wider still, until nothing at all remained but a great gaping mouth in a ring of wrinkles. Sam stepped aside and waved Jojen through ahead of him. Summer followed, sniffing as he went, and then it was Bran’s turn. Hodor ducked, but not low enough. The door’s upper lip brushed softly against the top of Bran’s head, and a drop of water fell on him and ran slowly down his nose. It was strangely warm, and salty as a tear.      Daenerys   Meereen was as large as Astapor and Yunkai combined. Like her sister cities she was built of brick, but where Astapor had been red and Yunkai yellow, Meereen was made with bricks of many colors. Her walls were higher than Yunkai’s and in better repair, studded with bastions and anchored by great defensive towers at every angle. Behind them, huge against the sky, could be seen the top of the Great Pyramid, a monstrous thing eight hundred feet tall with a towering bronze harpy at its top.   The harpy is a craven thing,  Daario Naharis said when he saw it.  She has a woman’s heart and a chicken’s legs. Small wonder her sons hide behind their walls.   But the hero did not hide. He rode out the city gates, armored in scales of copper and jet and mounted upon a white charger whose striped pink-and-white barding matched the silk cloak flowing from the hero’s shoulders. The lance he bore was fourteen feet long, swirled in pink and white, and his hair was shaped and teased and lacquered into two great curling ram’s horns. Back and forth he rode beneath the walls of multicolored bricks, challenging the besiegers to send a champion forth to meet him in single combat.  Her bloodriders were in such a fever to go meet him that they almost came to blows.  Blood of my blood,  Dany told them,  your place is here by me. This man is a buzzing fly, no more. Ignore him, he will soon be gone.  Aggo, Jhogo, and Rakharo were brave warriors, but they were young, and too valuable to risk. They kept her khalasar together, and were her best scouts too.   That was wisely done,  Ser Jorah said as they watched from the front of her pavilion.  Let the fool ride back and forth and shout until his horse goes lame. He does us no harm.    He does,  Arstan Whitebeard insisted.  Wars are not won with swords and spears alone, ser. Two hosts of equal strength may come together, but one will break and run whilst the other stands. This hero builds courage in the hearts of his own men and plants the seeds of doubt in ours.   Ser Jorah snorted.  And if our champion were to lose, what sort of seed would that plant?    A man who fears battle wins no victories, ser.    We’re not speaking of battle. Meereen’s gates will not open if that fool falls. Why risk a life for naught?    For honor, I would say.    I have heard enough.  Dany did not need their squabbling on top of all the other troubles that plagued her. Meereen posed dangers far more serious than one pink-and-white hero shouting insults, and she could not let herself be distracted. Her host numbered more than eighty thousand after Yunkai, but fewer than a quarter of them were soldiers. The rest… well, Ser Jorah called them mouths with feet, and soon they would be starving.  The Great Masters of Meereen had withdrawn before Dany’s advance, harvesting all they could and burning what they could not harvest."
}