{
  "id": "1397aad50ceb093c27d88bc13e5b898e4b432d1f",
  "text": "  \"See you next summer!\" Harry yelled.  The Weasleys roared with laughter and Harry settled back in his seat, grinning from ear to ear.  \"Let Hedwig out,\" he told Ron. \"She can fly behind us. She hasn't had a chance to stretch her wings for ages.\"  George handed the hairpin to Ron and, a moment later, Hedwig soared joyfully out of the window to glide alongside them like a ghost.  \"So - what's the story, Harry?\" said Ron impatiently. \"What's been happening?\"  Harry told them all about Dobby, the warning he'd given Harry and the fiasco of the violet pudding. There was a long, shocked silence when he had finished.  \"Very fishy,\" said Fred finally.  \"Definitely dodgy\" agreed George. \"So he wouldn't even tell you who's supposed to be plotting all this stuff?\"  \"I don't think he could,\" said Harry. \"I told you, every time he got close to letting something slip, he started banging his head against the wall.\"  He saw Fred and George look at each other.  \"What, you think he was lying to me?\" said Harry.  \"Well,\" said Fred, \"put it this way - house-elves have got powerful magic of their own, but they can't usually use it without their master's permission. I reckon old Dobby was sent to stop you com  ing back to Hogwarts. Someone's idea of a joke. Can you think of anyone at school with a grudge against you?\"  \"Yes,\" said Harry and Ron together, instantly.  \"Draco Malfoy,\" Harry explained. \"He hates me.\"  \"Draco Malfoy?\" said George, turning around. \"Not Lucius Malfoy's son?\"  \"Must be, it's not a very common name, is it?\" said Harry.  Y.  \"I've heard Dad talking about him,\" said George. \"He was a big supporter of You-Know-Who.\"  \"And when You-Know-Who disappeared,\" said Fred, craning around to look at Harry, \"Lucius Malfoy came back saying he'd never meant any of it. Load of dung - Dad reckons he was right in You- Know-Who's inner circle.\"  Harry had heard these rumors about Malfoy's family before, and they didn't surprise him at all. Malfoy made Dudley Dursley look   like a kind, thoughtful, and sensitive boy.  \"I don't know whether the Malfoys own a house-elf  said  Harry.  \"Well, whoever owns him will be an old wizarding family, and they'll be rich,\" said Fred.  \"Yeah, Mum's always wishing we had a house-elf to do the ironing,\" said George. \"But all we've got is a lousy old ghoul in the attic and gnomes all over the garden. House-elves come with big old manors and castles and places like that; you wouldn't catch one in our house . . . .\"  Harry was silent. Judging by the fact that Draco Malfoy usually had the best of everything, his family was rolling in wizard gold; he  could just see Malfoy strutting around a large manor house. Sending the family servant to stop Harry from going back to Hogwarts also sounded exactly like the sort of thing Malfoy would do. Had Harry been stupid to take Dobby seriously?  \"I'm glad we came to get you, anyway,\" said Ron. \"I was getting really worried when you didn't answer any of my letters. I thought it was Errol's fault at first  -\"  \"Who's Errol?\"  \"Our owl. He's ancient. It wouldn't be the first time he'd collapsed on a delivery. So then I tried to borrow Hermes -\"  \"Who?\"  \"The owl Mum and Dad bought Percy when he was made prefect,\" said Fred from the front.  \"But Percy wouldn't lend him to me,\" said Ron. \"Said he needed him.\"  \"Percy's been acting very oddly this summer,\" said George, frowning. \"And he has been sending a lot of letters and spending a load of time shut up in his room .... I mean, there's only so many times you can polish a prefect badge .... You're driving too far west, Fred,\" he added, pointing at a compass on the dashboard. Fred twiddled the steering wheel.  \"So, does your dad know you've got the car?\" said Harry, guessing the answer.  \"Er, no,\" said Ron, \"he had to work tonight. Hopefully we'll be able to get it back in the garage without Mum noticing we flew it.\"  \"What does your dad do at the Ministry of Magic, anyway?\"  \"He works in the most boring department,\" said Ron. \"The Misuse of Muggle Artifacts Office.\"  \"The what?\"  \"It's all to do with bewitching things that are Muggle-made, you know, in case they end up back in a Muggle shop or house. Like, last year, some old witch died and her tea set was sold to an antiques shop. This Muggle woman bought it, took it home, and tried to serve her friends tea in it. It was a nightmare - Dad was working overtime for weeks.\"  \"What happened?\"  \"The teapot went berserk and squirted boiling tea all over the place and one man ended up in the hospital with the sugar tongs clamped to his nose. Dad was going frantic - it's only him and an old warlock called Perkins in the office -and they had to do Memory Charms and all sorts of stuff to cover it up -\"  \"But your dad - this car -\"  Fred laughed. \"Yeah, Dad's crazy about everything to do with Muggles; our shed's full of Muggle stuff. He takes it apart, puts spells on it, and puts it back together again. If he raided our house he'd have to put himself under arrest. It drives Mum mad."
}