{
  "id": "1500b3a7ecd076b0d8a260afd4f3d3047cc52cba",
  "text": "  But it would be years before her dragons were large enough to ride. And when they are, who shall ride them? The dragon has three heads, but I have only one. She thought of Daario. If ever there was a man who could rape a woman with his eyes…  To be sure, she was just as guilty. Dany found herself stealing looks at the Tyroshi when her captains came to council, and sometimes at night she remembered the way his gold tooth glittered when he smiled. That, and his eyes. His bright blue eyes. On the road from Yunkai, Daario had brought her a flower or a sprig of some plant every evening when he made his report… to help her learn the land, he said. Waspwillow, dusky roses, wild mint, lady’s lace, daggerleaf, broom, prickly ben, harpy’s gold… He tried to spare me the sight of the dead children too. He should not have done that, but he meant it kindly. And Daario Naharis made her laugh, which Ser Jorah never did.  Dany tried to imagine what it would be like if she allowed Daario to kiss her, the way Jorah had kissed her on the ship. The thought was exciting and disturbing, both at once. It is too great a risk. The Tyroshi sellsword was not a good man, no one needed to tell her that. Under the smiles and the jests he was dangerous, even cruel. Sallor and Prendahl had woken one morning as his partners; that very night he’d given her their heads. Khal Drogo could be cruel as well, and there was never a man more dangerous. She had come to love him all the same. Could I love Daario? What would it mean, if I took him into my bed? Would that make him one of the heads of the dragon? Ser Jorah would be angry, she knew, but he was the one who’d said she had to take two husbands. Perhaps I should marry them both and be done with it.  But these were foolish thoughts. She had a city to take, and dreaming of kisses and some sellsword’s bright blue eyes would not help her breach the walls of Meereen. I am the blood of the dragon, Dany reminded herself. Her thoughts were spinning in circles, like a rat chasing its tail. Suddenly she could not stand the close confines of the pavilion another moment. I want to feel the wind on my face, and smell the sea.  Missandei,  she called,  have my silver saddled. Your own mount as well.   The little scribe bowed.  As Your Grace commands. Shall I summon your bloodriders to guard you?    We’ll take Arstan. I do not mean to leave the camps.  She had no enemies among her children. And the old squire would not talk too much as Belwas would, or look at her like Daario.  The grove of burnt olive trees in which she’d raised her pavilion stood beside the sea, between the Dothraki camp and that of the Unsullied. When the horses had been saddled, Dany and her companions set out along the shoreline, away from the city. Even so, she could feel Meereen at her back, mocking her. When she looked over one shoulder, there it stood, the afternoon sun blazing off the bronze harpy atop the Great Pyramid. Inside Meereen the slavers would soon be reclining in their fringed tokars to feast on lamb and olives, unborn puppies, honeyed dormice and other such delicacies, whilst outside her children went hungry. A sudden wild anger filled her. I will bring you down, she swore.  As they rode past the stakes and pits that surrounded the eunuch encampment, Dany could hear Grey Worm and his sergeants running one company through a series of drills with shield, shortsword, and heavy spear. Another company was bathing in the sea, clad only in white linen breechclouts. The eunuchs were very clean, she had noticed. Some of her sellswords smelled as if they had not washed or changed their clothes since her father lost the Iron Throne, but the Unsullied bathed each evening, even if they’d marched all day. When no water was available they cleansed themselves with sand, the Dothraki way.  The eunuchs knelt as she passed, raising clenched fists to their breasts. Dany returned the salute. The tide was coming in, and the surf foamed about the feet of her silver. She could see her ships standing out to sea. Balerion floated nearest; the great cog once known as Saduleon, her sails furled. Further out were the galleys Meraxes and Vhagar, formerly Joso’s Prank and Summer Sun. They were Magister Illyrio’s ships, in truth, not hers at all, and yet she had given them new names with hardly a thought. Dragon names, and more; in old Valyria before the Doom, Balerion, Meraxes, and Vhagar had been gods.  South of the ordered realm of stakes, pits, drills, and bathing eunuchs lay the encampments of her freedmen, a far noisier and more chaotic place. Dany had armed the former slaves as best she could with weapons from Astapor and Yunkai, and Ser Jorah had organized the fighting men into four strong companies, yet she saw no one drilling here. They passed a driftwood fire where a hundred people had gathered to roast the carcass of a horse. She could smell the meat and hear the fat sizzling as the spit boys turned, but the sight only made her frown.  Children ran behind their horses, skipping and laughing."
}