{
  "id": "16a7f76cf097f3921101be562ba973bfe9b997e4",
  "text": "  Between the verses, Rymund threw back his head and howled, and by the end, half of the hall was howling along with him, even Desmond Grell, who was well in his cups. Their voices rang off the rafters.  Let them have their songs, if it makes them brave, Catelyn thought, toying with her silver goblet.   There was always a singer at Evenfall Hall when I was a girl,  Brienne said quietly.  I learned all the songs by heart.    Sansa did the same, though few singers ever cared to make the long journey north to Winterfell.  I told her there would be singers at the king’s court, though. I told her she would hear music of all sorts, that her father could find some master to help her learn the high harp. Oh, gods forgive me…  Brienne said,  I remember a woman… she came from some place across the narrow sea. I could not even say what language she sang in, but her voice was as lovely as she was. She had eyes the color of plums and her waist was so tiny my father could put his hands around it. His hands were almost as big as mine.  She closed her long, thick fingers, as if to hide them.   Did you sing for your father?  Catelyn asked.  Brienne shook her head, staring down at her trencher as if to find some answer in the gravy.   For Lord Renly?   The girl reddened.  Never, I… his fool, he made cruel japes sometimes, and I…    Someday you must sing for me.    I… please, I have no gift.  Brienne pushed back from the table.  Forgive me, my lady. Do I have your leave to go?   Catelyn nodded. The tall, ungainly girl left the hall with long strides, almost unnoticed amidst the revelry. May the gods go with her, she thought as she returned listlessly to her supper.  It was three days later when the hammer blow that Brienne had foretold fell, and five days before they heard of it. Catelyn was sitting with her father when Edmure’s messenger arrived. The man’s armor was dinted, his boots dusty, and he had a ragged hole in his surcoat, but the look on his face as he knelt was enough to tell her that the news was good.  Victory, my lady.  He handed her Edmure’s letter. Her hand trembled as she broke the seal.  Lord Tywin had tried to force a crossing at a dozen different fords, her brother wrote, but every thrust had been thrown back. Lord Lefford had been drowned, the Crakehall knight called Strongboar taken captive, Ser Addam Marbrand thrice forced to retreat… but the fiercest battle had been fought at Stone Mill, where Ser Gregor Clegane had led the assault. So many of his men had fallen that their dead horses threatened to dam the flow. In the end the Mountain and a handful of his best had gained the west bank, but Edmure had thrown his reserve at them, and they had shattered and reeled away bloody and beaten. Ser Gregor himself had lost his horse and staggered back across the Red Fork bleeding from a dozen wounds while a rain of arrows and stones fell all around him.  They shall not cross, Cat,  Edmure scrawled,  Lord Tywin is marching to the southeast. A feint perhaps, or full retreat, it matters not. They shall not cross.   Ser Desmond Grell had been elated.  Oh, if only I might have been with him,  the old knight said when she read him the letter.  Where is that fool Rymund? There’s a song in this, by the gods, and one that even Edmure will want to hear. The mill that ground the Mountain down, I could almost make the words myself, had I the singer’s gift.    I’ll hear no songs until the fighting’s done,  Catelyn said, perhaps too sharply. Yet she allowed Ser Desmond to spread the word, and agreed when he suggested breaking open some casks in honor of Stone Mill. The mood within Riverrun had been strained and somber; they would all be better for a little drink and hope.  That night the castle rang to the sounds of celebration.  Riverrun!  the smallfolk shouted, and  Tully! Tully!  They’d come frightened and helpless, and her brother had taken them in when most lords would have closed their gates. Their voices floated in through the high windows, and seeped under the heavy redwood doors. Rymund played his harp, accompanied by a pair of drummers and a youth with a set of reed pipes. Catelyn listened to girlish laughter, and the excited chatter of the green boys her brother had left her for a garrison. Good sounds… and yet they did not touch her. She could not share their happiness.  In her father’s solar she found a heavy leatherbound book of maps and opened it to the riverlands. Her eyes found the path of the Red Fork and traced it by flickering candlelight. Marching to the southeast, she thought. By now they had likely reached the headwaters of the Blackwater Rush, she decided.  She closed the book even more uneasy than before. The gods had granted them victory after victory. At Stone Mill, at Oxcross, in the Battle of the Camps, at the Whispering Wood…  But if we are winning, why am I so afraid?      BRAN  The sound was the faintest of clinks, a scraping of steel over stone. He lifted his head from his paws, listening, sniffing at the night."
}