{
  "id": "16bbad4741a8ef663585f9448b369744c60d8852",
  "text": "       At  first  men laughed and did   not greatly fear  such devices. For the  main  wall of  the City was of great height and  marvellous thickness, built  ere the power and craft of N®menor waned in exile; and its outward  face was  like  to the Tower  of  Orthanc,  hard and dark and smooth, unconquerable by  steel or  fire, unbreakable except  by some  convulsion that would rend  the  very earth on which it stood.       'Nay,'  they said,  'not if  the Nameless One himself should come,  not  even he could enter here while  we yet live.'  But some answered: 'While  we  yet live? How long? He has  a weapon that has brought low many strong places  since the world began. Hunger. The roads are cut. Rohan will not come.'       But the engines did not waste shot upon the indomitable wall. It was no  brigand or orc-chieftain that ordered the assault upon the Lord  of Mordor's  greatest  foe. A  power and mind of malice guided  it. As soon as  the great  catapults were set, with many yells and the creaking of rope and winch, they  began to throw  missiles marvellou sly high, so that they passed  right above  the  battlement and fell thudding  within the first circle of  the City; and  many of them by some secret art burst into flame as they came toppling down.       Soon there  was great peril of fire behind the wall,  and all who could  be spared  were busy quelling the flames that sprang up in many places. Then  among the greater casts  there  fell  another hail, less  ruinous  but  more  horrible. All about the streets and lanes behind the Gate  it tumbled  down,  small round shot that did not burn. But when men ran  to learn what it might   be, they cried aloud or wept.  For the enemy was flinging into  the City all  the heads of  those who had  fallen fighting at Osgiliath, or on the Rammas,   or  in the fields. They were grim to look on; for though some  were  crushed  and shapeless, and some had  been cruelly hewn, yet  many had  features that  could be told,  and  it  seemed that  they  had  died in pain;  and all were  branded with  the foul token of the Lidless Eye. But marred  and dishonoured  as  they were, it often chanced  that thus a man would see again the face of  someone  that he had known, who had  walked proudly once in arms,  or tilled   ####-the fields, or ridden in upon a holiday from the green vales in the hills.        In vain men shook  their fists at the pitiless foes that swarmed before  the Gate. Curses they heeded not, nor understood the tongues of western men;  crying with harsh voices like beasts and  carrion-birds. But soon there were  few left in Minas Tirith who had the heart to stand up and defy the hosts of  Mordor.  For yet another weapon, swifter than hunger,  the Lord of the  Dark  Tower had: dread and despair.       The Nazgyl came again, and  as  their  Dark Lord now grew and put forth   his strength, so their voices, which uttered only his  will and  his malice,  were filled with  evil and  horror. Ever they circled  above the  City, like  vultures that expect their fill of doomed men's flesh. Out of sight and shot  they  flew, and yet were ever present, and their deadly voices rent the air.  More unbearable they became, not  less, at each new cry.  At length even the  stout-hearted would  fling  themselves to the  ground as the  hidden  menace  passed  over  them,  or they would  stand, letting  their  weapons fall from  nerveless hands while into their minds a blackness came, and they thought no  more of war, but only of hiding and of crawling, and of death.       During all this black day Faramir  lay  upon his bed  in the chamber of  the White Tower, wandering  in  a  desperate fever; dying someone  said, and  soon  'dying' all men were saying upon  the walls and in the streets. And by  him his father sat, and said nothing, but watched, and gave  no  longer  any  heed to the defence.       No  hours  so dark had  Pippin known, not  even in the clutches  of the  Uruk-hai. It was  his duty to wait upon the Lord, and wait he did, forgotten  it seemed, standing by  the  door of the unlit  chamber, mastering  his  own  fears as best he could. And as  he  watched, it seemed to him that  Denethor   grew old before his eyes, as if something had snapped in his proud will, and  his stern mind was  overthrown. Grief maybe had wrought it, and  remorse. He  saw tears on that once tearless face, more unbearable than wrath.       'Do not weep, lord,' he stammered. 'Perhaps he will get well. Have  you   asked Gandalf?'       'Comfort me  not  with wizards!' said Denethor.  'The  fool's  hope has  failed.  The Enemy has  found it, and now his power waxes; he sees  our very  thoughts, and all we do is ruinous.       'I sent my  son forth,  unthanked, unblessed, out  into needless peril,  and here he lies with poison in his veins. Nay, nay, whatever may now betide  in war, my line too is  ending, even the House  of the Stewards  has failed.   ####-Mean  folk shall rule  the last remnant of the Kings of Men, lurking in  the  hills until all are hounded out."
}