{
  "id": "175ab1e89b5d437a5ea6678b0ea1761a10247494",
  "text": " He hesitated.  These honors are all so unexpected. May I have some time to consider? I need to tell my wife…    Yes, yes, of course, tell Catelyn, sleep on it if you must.  The king reached down, clasped Ned by the hand, and pulled him roughly to his feet.  Just don’t keep me waiting too long. I am not the most patient of men.   For a moment Eddard Stark was filled with a terrible sense of foreboding. This was his place, here in the north. He looked at the stone figures all around them, breathed deep in the chill silence of the crypt. He could feel the eyes of the dead. They were all listening, he knew. And winter was coming.      JON  There were times—not many, but a few—when Jon Snow was glad he was a bastard. As he filled his wine cup once more from a passing flagon, it struck him that this might be one of them.  He settled back in his place on the bench among the younger squires and drank. The sweet, fruity taste of summerwine filled his mouth and brought a smile to his lips.  The Great Hall of Winterfell was hazy with smoke and heavy with the smell of roasted meat and fresh-baked bread. Its grey stone walls were draped with banners. White, gold, crimson: the direwolf of Stark, Baratheon’s crowned stag, the lion of Lannister. A singer was playing the high harp and reciting a ballad, but down at this end of the hall his voice could scarcely be heard above the roar of the fire, the clangor of pewter plates and cups, and the low mutter of a hundred drunken conversations.  It was the fourth hour of the welcoming feast laid for the king. Jon’s brothers and sisters had been seated with the royal children, beneath the raised platform where Lord and Lady Stark hosted the king and queen. In honor of the occasion, his lord father would doubtless permit each child a glass of wine, but no more than that. Down here on the benches, there was no one to stop Jon drinking as much as he had a thirst for.  And he was finding that he had a man’s thirst, to the raucous delight of the youths around him, who urged him on every time he drained a glass. They were fine company, and Jon relished the stories they were telling, tales of battle and bedding and the hunt. He was certain that his companions were more entertaining than the king’s offspring. He had sated his curiosity about the visitors when they made their entrance. The procession had passed not a foot from the place he had been given on the bench, and Jon had gotten a good long look at them all.  His lord father had come first, escorting the queen. She was as beautiful as men said. A jeweled tiara gleamed amidst her long golden hair, its emeralds a perfect match for the green of her eyes. His father helped her up the steps to the dais and led her to her seat, but the queen never so much as looked at him. Even at fourteen, Jon could see through her smile.  Next had come King Robert himself, with Lady Stark on his arm. The king was a great disappointment to Jon. His father had talked of him often: the peerless Robert Baratheon, demon of the Trident, the fiercest warrior of the realm, a giant among princes. Jon saw only a fat man, red-faced under his beard, sweating through his silks. He walked like a man half in his cups.  After them came the children. Little Rickon first, managing the long walk with all the dignity a three-year-old could muster. Jon had to urge him on when he stopped to visit. Close behind came Robb, in grey wool trimmed with white, the Stark colors. He had the Princess Myrcella on his arm. She was a wisp of a girl, not quite eight, her hair a cascade of golden curls under a jeweled net. Jon noticed the shy looks she gave Robb as they passed between the tables and the timid way she smiled at him. He decided she was insipid. Robb didn’t even have the sense to realize how stupid she was; he was grinning like a fool.  His half sisters escorted the royal princes. Arya was paired with plump young Tommen, whose white-blond hair was longer than hers. Sansa, two years older, drew the crown prince, Joffrey Baratheon. He was twelve, younger than Jon or Robb, but taller than either, to Jon’s vast dismay. Prince Joffrey had his sister’s hair and his mother’s deep green eyes. A thick tangle of blond curls dripped down past his golden choker and high velvet collar. Sansa looked radiant as she walked beside him, but Jon did not like Joffrey’s pouty lips or the bored, disdainful way he looked at Winterfell’s Great Hall.  He was more interested in the pair that came behind him: the queen’s brothers, the Lannisters of Casterly Rock. The Lion and the Imp; there was no mistaking which was which. Ser Jaime Lannister was twin to Queen Cersei; tall and golden, with flashing green eyes and a smile that cut like a knife. He wore crimson silk, high black boots, a black satin cloak. On the breast of his tunic, the lion of his House was embroidered in gold thread, roaring its defiance. They called him the Lion of Lannister to his face and whispered  Kingslayer  behind his back.  Jon found it hard to look away from him."
}