{
  "id": "1762e35bc01393035832a63f308246d22c04634f",
  "text": "  Their thick gray armor; their powerful, scuttling legs; their fire-blasting ends; their stings and their suckers, combined to make the skrewts the most repulsive things Harry had ever seen.  The class looked dispiritedly at the enormous boxes Hagrid had brought out, all lined with pillows and fluffy blankets. \"We'll jus' lead 'em in here,\" Hagrid said, \"an' put the lids on, and we'll see what happens.\" But the skrewts, it transpired, did not hibernate, and did not appreciate being forced into pillow-lined boxes and nailed in.  Hagrid was soon yelling, \"Don panic, now, don' panic!\" while the skrewts rampaged around the pumpkin patch, now strewn with the smoldering wreckage of the boxes.  Most of the class - Malfoy, Crabbe, and Goyle in the lead - had fled into Hagrid's cabin through the back door and barricaded themselves in; Harry, Ron, and Hermione, however, were among those who remained outside trying to help Hagrid.  Together they managed to restrain and tie up nine of the skrewts, though at the cost of numerous burns and cuts; finally, only one skrewt was left. \"Don' frighten him, now!\"  Hagrid shouted as Ron and Harry used their wands to shoot jets of fiery sparks at the skrewt, which was advancing menacingly on them, its sting arched, quivering, over its back.  \"Jus' try an slip the rope 'round his sting, so he won hurt any o' the others!\" \"Yeah, we wouldn't want that!\" Ron shouted angrily as he and Harry backed into the wall of Hagrid's cabin, still holding the skrewt off with their sparks. \"Well, well, well. . . this does look like fun.\" Rita Skeeter was leaning on Hagrid's garden fence, looking in at the mayhem.  She was wearing a thick magenta cloak with a furry purple collar today, and her crocodile-skin handbag was over her arm. Hagrid launched himself forward on top of the skrewt that was cornering Harry and Ron and flattened it; a blast of fire shot out of its end, withering the pumpkin plants nearby. \"Who're you?\"  Hagrid asked Rita Skeeter as he slipped a loop of rope around the skrewt's sting and tightened it. \"Rita Skeeter, Daily Prophet reporter,\" Rita replied, beaming at him. Her gold teeth glinted. \"Thought Dumbledore said you weren' allowed inside the school anymore,\" said Hagrid, frowning slightly as he got off the slightly squashed skrewt and started tugging it over to its fellows. Rita acted as though she hadn't heard what Hagrid had said. \"What are these fascinating creatures called?\" she asked, beaming still more widely. \"Blast-Ended Skrewts,\" grunted Hagrid. \"Really?\"  said Rita, apparently full of lively interest.  \"I've never heard of them before...where do they come from?\" Harry noticed a dull red flush rising up out of Hagrid's wild black beard, and his heart sank.  Where had Hagrid got the skrewts from?  Hermione, who seemed to be thinking along these lines, said quickly, \"They're very interesting, aren't they?  Aren't they. Harry?\" \"What? Oh yeah . . . ouch . . . interesting,\" said Harry as she stepped on his foot. \"Ah, you're here.  Harry!\"  said Rita Skeeter as she looked around.  \"So you like Care of Magical Creatures, do you?  One of your favorite lessons?\" \"Yes,\" said Harry stoutly. Hagrid beamed at him. \"Lovely,\" said Rita. \"Really lovely.  Been teaching long?\" she added to Hagrid. Harry noticed her eyes travel over Dean (who had a nasty cut across one cheek). Lavender (whose robes were badly singed), Seamus (who was nursing several burnt fingers), and then to the cabin windows, where most of the class stood, their noses pressed against the glass waiting to see if the coast was clear. \"This is o'ny me second year,\" said Hagrid. \"Lovely... I don't suppose you'd like to give an interview, would you?  Share some of your experience of magical creatures?  The Prophet does a zoological column every Wednesday, as I'm sure you know.  We could feature these - er - Bang-Ended Scoots.\" \"Blast-Ended Skrewts,\" Hagrid said eagerly.  \"Er - yeah, why not?\" Harry had a very bad feeling about this, but there was no way of communicating it to Hagrid without Rita Skeeter seeing, so he had to stand and watch in silence as Hagrid and Rita Skeeter made arrangements to meet in the Three Broomsticks for a good long interview later that week.  Then the bell rang up at the castle, signaling the end of the lesson. \"Well, good-bye, Harry!\" Rita Skeeter called merrily to him as he set off with Ron and Hermione.  \"Until Friday night, then, Hagrid!\" \"She'll twist everything he says,\" Harry said under his breath. \"Just as long as he didn't import those skrewts illegally or anything,\" said Hermione desperately.  They looked at one another - it was exactly the sort of thing Hagrid might do. \"Hagrids been in loads of trouble before, and Dumbledores never sacked him,\" said Ron consolingly.  \"Worst that can happen is Hagrid'll have to get rid of the skrewts.  Sorry . . . did I say worst?  I meant best.\" Harry and Hermione laughed, and, feeling slightly more cheerful, went off to lunch. Harry thoroughly enjoyed double Divination that afternoon; they were still doing star charts and predictions, but now that he and Ron were friends once more, the whole thing seemed very funny again."
}