{
  "id": "176d0a407c3a83fb30e4a4b54714bf2cfff2c132",
  "text": " It’s said his green armor took a ghostly glow from the wildfire, and his antlers ran with golden flames.   Renly’s shade. Davos wondered if his sons would return as shades as well. He had seen too many queer things on the sea to say that ghosts did not exist.  Did none keep faith?  he asked.   Some few,  the captain said.  The queen’s kin, them in chief. We took off many who wore the fox-and-flowers, though many more were left ashore, with all manner of badges. Lord Florent is the King’s Hand on Dragonstone now.   The mountain grew taller, crowned all in pale smoke. The sail sang, the drum beat, the oars pulled smoothly, and before very long the mouth of the harbor opened before them. So empty, Davos thought, remembering how it had been before, with the ships crowding every quay and rocking at anchor off the breakwater. He could see Salladhor Saan’s flagship Valyrian moored at the quay where Fury and her sisters had once tied up. The ships on either side of her had striped Lysene hulls as well. In vain he looked for any sign of Lady Marya or Wraith.  They pulled down the sail as they entered the harbor, to dock on oars alone. The captain came to Davos as they were tying up.  My prince will wish to see you at once.   A fit of coughing seized Davos as he tried to answer. He clutched the rail for support and spat over the side.  The king,  he wheezed.  I must go to the king.  For where the king is, I will find Melisandre.   No one goes to the king,  Khorane Sathmantes replied firmly.  Salladhor Saan will tell you. Him first.   Davos was too weak to defy him. He could only nod.  Salladhor Saan was not aboard his Valyrian. They found him at another quay a quarter mile distant, down in the hold of a big-bellied Pentoshi cog named Bountiful Harvest, counting cargo with two eunuchs. One held a lantern, the other a wax tablet and stylus.  Thirty-seven, thirty-eight, thirty-nine,  the old rogue was saying when Davos and the captain came down the hatch. Today he wore a wine-colored tunic and high boots of bleached white leather inlaid with silver scrollwork. Pulling the stopper from a jar, he sniffed, sneezed, and said,  A coarse grind, and of the second quality, my nose declares. The bill of lading is saying forty-three jars. Where have the others gotten to, I am wondering? These Pentoshi, do they think I am not counting?  When he saw Davos he stopped suddenly.  Is it pepper stinging my eyes, or tears? Is this the knight of the onions who stands before me? No, how can it be, my dear friend Davos died on the burning river, all agree. Why has he come to haunt me?    I am no ghost, Salla.    What else? My onion knight was never so thin or so pale as you.  Salladhor Saan threaded his way between the jars of spice and bolts of cloth that filled the hold of the merchanter, wrapped Davos in a fierce embrace, then kissed him once on each cheek and a third time on his forehead.  You are still warm, ser, and I feel your heart thumpety-thumping. Can it be true? The sea that swallowed you has spit you up again.   Davos was reminded of Patchface, Princess Shireen’s lackwit fool. He had gone into the sea as well, and when he came out he was mad. Am I mad as well? He coughed into a gloved hand and said,  I swam beneath the chain and washed ashore on a spear of the merling king. I would have died there, if Shayala’s Dance had not come upon me.   Salladhor Saan threw an arm around the captain’s shoulders.  This was well done, Khorane. You will be having a fine reward, I am thinking. Meizo Mahr, be a good eunuch and take my friend Davos to the owner’s cabin. Fetch him some hot wine with cloves, I am misliking the sound of that cough. Squeeze some lime in it as well. And bring white cheese and a bowl of those cracked green olives we counted earlier! Davos, I will join you soon, once I have bespoken our good captain. You will be forgiving me, I know. Do not eat all the olives, or I must be cross with you!   Davos let the elder of the two eunuchs escort him to a large and lavishly furnished cabin at the stem of the ship. The carpets were deep, the windows stained glass, and any of the great leather chairs would have seated three of Davos quite comfortably. The cheese and olives arrived shortly, and a cup of steaming hot red wine. He held it between his hands and sipped it gratefully. The warmth felt soothing as it spread through his chest.  Salladhor Saan appeared not long after.  You must be forgiving me for the wine, my friend. These Pentoshi would drink their own water if it were purple.    It will help my chest,  said Davos.  Hot wine is better than a compress, my mother used to say.    You shall be needing compresses as well, I am thinking. Sitting on a spear all this long time, oh my. How are you finding that excellent chair? He has fat cheeks, does he not?    Who?  asked Davos, between sips of hot wine.   Illyrio Mopatis. A whale with whiskers, I am telling you truly. These chairs were built to his measure, though he is seldom bestirring himself from Pentos to sit in them."
}