{
  "id": "17c7fc6b48ef35bafc91a8066cafdc1a802334f6",
  "text": "   He'd already bought Sandyman's mill before he came to Bag End, seemingly.       'Of course he started with a lot of property in the Southfarthing which  he had from his dad; and it seems he'd been selling a  lot o' the best leaf,   and sending it away quietly for a year or two.  But at the end o'  last year  he began sending away  loads of  stuff,  not only leaf. Things  began to get  short, and winter coming on, too. Folk got angry, but  he had his answer.  A  lot of Men, ruffians mostly,  came with great waggons, some to carry off the  goods south-away,  and  others  to stay. And  more came.  And before we knew  where we were they were planted here  and there all over the Shire, and were  felling trees  and digging and building themselves sheds and houses just  as  they liked. At first goods and damage was paid  for by Pimple; but soon they  began lording it around and taking what they wanted.       'Then there was a bit  of trouble,  but not  enough. Old Will the Mayor   set off for  Bag End to protest, but he never got there. Ruffians laid hands  on him  and took and locked him up in a hole in Michel Delving, and there he  is  now.  And after that, it  would bc soon after New Year,  there wasn't no  more Mayor, and Pimple called himself Chief Shirriff, or just Chief, and did   ####-as  he liked; and  if anyone  got \"uppish\" as  they called it, they followed  Will. So things went from bad to worse. There wasn't no smoke left, save for  the Men;  and the  Chief didn't hold with beer, save for his Men, and closed  all the inns;  and everything except Rules got  shorter and  shorter, unless  one could hide a bit  of one's own  when the ruffians  went  round gathering  stuff  up \"for fair  distribution\": which meant  they got it  and we didn't,  except for the leavings which you could have at the Shirriff-houses,  if you   could  stomach them.  All  very bad.  But since Sharkey came it's been plain   ruination.'       'Who is this Sharkey?'  said Merry. 'I heard  one of the ruffians speak  of him.'       'The biggest  ruffian o' the lot, seemingly,' answered  Cotton. 'It was  about last harvest,  end o'  September maybe,  that  we first heard of  him.  We've never seen him, but he's up at Bag End; and he's the real Chief now, I   guess.  All the ruffians  do what he says; and what he says is mostly  hack,  burn, and ruin; and now it s come to killing. There s  no longer even any bad  sense in it. They cut down trees and let 'em lie, they burn houses and build  no more.       'Take Sandyman's mill now. Pimple  knocked it down almost as soon as he  came to Bag End. Then he  brought in a lot o' dirty-looking Men  to  build a   bigger one and fill it full o' wheels and outlandish contraptions. Only that  fool Ted was pleased by  that, and he works  there  cleaning  wheels for the  Men, where his dad was the  Miller and his own master.  Pimple's idea was to  grind  more  and faster, or  so he said. He's got other mills  like  it. But  you've got to have grist before you can grind; and there was no more for the  new mill to do than for the  old. But since Sharkey came they don't grind no  more corn at all. They're always a -hammering and a -letting out a smoke and a   stench, and there isn't no peace even at night  in  Hobbiton.  And they pour  out filth a  purpose; they've  fouled all  the lower Water  and it's getting  down into Brandywine. If they want to make the Shire into a desert,  they're  going the right way about it. I don't believe that fool of a Pimple's behind  all this. It's Sharkey, I say.'       'That's right!' put in Young Tom. 'Why, they even took Pimple's old ma,  that  Lobelia, and he was  fond  of her,  if no one  else was.  Some  of the  Hobbiton folk, they  saw it. She  comes down the lane with her old umbrella.  Some of the ruffians were going up with a big cart.       ' \"Where be you a -going?\" says she.   ####-     ' \"To Bag End,\" says they.       ' \"What for?\" says she.       ' \"To put up some sheds for Sharkey,\" says they.       ' \"Who said you could?\" says she.       ' \"Sharkey,\" says they. \"So get out o' the road, old hagling!\"       '  \"I'll give you Sharkey, you dirty thieving ruffians!\" says  she, and  ups with  her umbrella and goes for the leader. near twice her size. So they  took  her. Dragged her off  to the Lockholes, at her age  too.  They've took   others we miss more, but  there's no  denying she  showed  more  spirit than  most.'       Into the middle of this talk came Sam, bursting in with his gaffer. Old  Gamgee did not look much older, but he was a little deafer.       'Good evening. Mr. Baggins!' he said. 'Glad indeed I am to see you safe  back. But  I've  a bone to pick with you, in a manner  o' speaking, if I may  make so bold. You didn't never ought  to  have a' sold Bag End, as  I always  said. That's what started all the mischief. And while you're been trapessing  in foreign parts, chasing  Black Men  up  mountains from  what my  Sam says,   though what for he don't make clear, they've been and dug up Bagshot Row and  ruined my taters!'       'I  am very  sorry, Mr."
}