{
  "id": "184393944f9294e0a9284436fb696df0ea91dce4",
  "text": " How small the difference between victory and defeat, between life and death.  He drew out a fresh sheet of paper and dipped his quill in the inkpot. To His Grace, Stannis of the House Baratheon, he wrote. By the time you receive this letter, your brother Robert, our King these past fifteen years, will be dead. He was savaged by a boar whilst hunting in the kingswood…  The letters seemed to writhe and twist on the paper as his hand trailed to a stop. Lord Tywin and Ser Jaime were not men to suffer disgrace meekly; they would fight rather than flee. No doubt Lord Stannis was wary, after the murder of Jon Arryn, but it was imperative that he sail for King’s Landing at once with all his power, before the Lannisters could march.  Ned chose each word with care. When he was done, he signed the letter Eddard Stark, Lord of Winterfell, Hand of the King, and Protector of the Realm, blotted the paper, folded it twice, and melted the sealing wax over the candle flame.  His regency would be a short one, he reflected as the wax softened. The new king would choose his own Hand. Ned would be free to go home. The thought of Winterfell brought a wan smile to his face. He wanted to hear Bran’s laughter once more, to go hawking with Robb, to watch Rickon at play. He wanted to drift off to a dreamless sleep in his own bed with his arms wrapped tight around his lady, Catelyn.  Cayn returned as he was pressing the direwolf seal down into the soft white wax. Desmond was with him, and between them Littlefinger. Ned thanked his guards and sent them away.  Lord Petyr was clad in a blue velvet tunic with puffed sleeves, his silvery cape patterned with mockingbirds.  I suppose congratulations are in order,  he said as he seated himself.  Ned scowled.  The king lies wounded and near to death.    I know,  Littlefinger said.  I also know that Robert has named you Protector of the Realm.   Ned’s eyes flicked to the king’s letter on the table beside him, its seal unbroken.  And how is it you know that, my lord?    Varys hinted as much,  Littlefinger said,  and you have just confirmed it.   Ned’s mouth twisted in anger.  Damn Varys and his little birds. Catelyn spoke truly, the man has some black art. I do not trust him.    Excellent. You’re learning.  Littlefinger leaned forward.  Yet I’ll wager you did not drag me here in the black of night to discuss the eunuch.    No,  Ned admitted.  I know the secret Jon Arryn was murdered to protect. Robert will leave no trueborn son behind him. Joffrey and Tommen are Jaime Lannister’s bastards, born of his incestuous union with the queen.   Littlefinger lifted an eyebrow.  Shocking,  he said in a tone that suggested he was not shocked at all.  The girl as well? No doubt. So when the king dies…    The throne by rights passes to Lord Stannis, the elder of Robert’s two brothers.   Lord Petyr stroked his pointed beard as he considered the matter.  So it would seem. Unless…    Unless, my lord? There is no seeming to this. Stannis is the heir. Nothing can change that.    Stannis cannot take the throne without your help. If you’re wise, you’ll make certain Joffrey succeeds.   Ned gave him a stony stare.  Have you no shred of honor?    Oh, a shred, surely,  Littlefinger replied negligently.  Hear me out. Stannis is no friend of yours, nor of mine. Even his brothers can scarcely stomach him. The man is iron, hard and unyielding. He’ll give us a new Hand and a new council, for a certainty. No doubt he’ll thank you for handing him the crown, but he won’t love you for it. And his ascent will mean war. Stannis cannot rest easy on the throne until Cersei and her bastards are dead. Do you think Lord Tywin will sit idly while his daughter’s head is measured for a spike? Casterly Rock will rise, and not alone. Robert found it in him to pardon men who served King Aerys, so long as they did him fealty. Stannis is less forgiving. He will not have forgotten the siege of Storm’s End, and the Lords Tyrell and Redwyne dare not. Every man who fought beneath the dragon banner or rose with Balon Greyjoy will have good cause to fear. Seat Stannis on the Iron Throne and I promise you, the realm will bleed.   Now look at the other side of the coin. Joffrey is but twelve, and Robert gave you the regency, my lord. You are the Hand of the King and Protector of the Realm. The power is yours, Lord Stark. All you need do is reach out and take it. Make your peace with the Lannisters. Release the Imp. Wed Joffrey to your Sansa. Wed your younger girl to Prince Tommen, and your heir to Myrcella. It will be four years before Joffrey comes of age. By then he will look to you as a second father, and if not, well… four years is a good long while, my lord. Long enough to dispose of Lord Stannis. Then, should Joffrey prove troublesome, we can reveal his little secret and put Lord Renly on the throne.    We?  Ned repeated.  Littlefinger gave a shrug.  You’ll need someone to share your burdens. I assure you, my price would be modest.    Your price."
}