{
  "id": "18b3bd913cf235acd9731b2ebb95b51cd1247805",
  "text": "  I should have let Lysa push him out her Moon Door. My poor sweet Sansa… why would anyone do this to her?    For Winterfell,  Robb said at once.  With Bran and Rickon dead, Sansa is my heir. If anything should happen to me…   She clutched tight at his hand.  Nothing will happen to you. Nothing. I could not stand it. They took Ned, and your sweet brothers. Sansa is married, Arya is lost, my father’s dead… if anything befell you, I would go mad, Robb. You are all I have left. You are all the north has left.    I am not dead yet, Mother.   Suddenly Catelyn was full of dread.  Wars need not be fought until the last drop of blood.  Even she could hear the desperation in her voice.  You would not be the first king to bend the knee, nor even the first Stark.   His mouth tightened.  No. Never.    There is no shame in it. Balon Greyjoy bent the knee to Robert when his rebellion failed. Torrhen Stark bent the knee to Aegon the Conqueror rather than see his army face the fires.    Did Aegon kill King Torrhen’s father?  He pulled his hand from hers.  Never, I said.   He is playing the boy now, not the king.  The Lannisters do not need the north. They will require homage and hostages, no more… and the Imp will keep Sansa no matter what we do, so they have their hostage. The ironmen will prove a more implacable enemy, I promise you. To have any hope of holding the north, the Greyjoys must leave no single sprig of House Stark alive to dispute their right. Theon’s murdered Bran and Rickon, so now all they need do is kill you… and Jeyne, yes. Do you think Lord Balon can afford to let her live to bear you heirs?   Robb’s face was cold.  Is that why you freed the Kingslayer? To make a peace with the Lannisters?    I freed Jaime for Sansa’s sake… and Arya’s, if she still lives. You know that. But if I nurtured some hope of buying peace as well, was that so ill?    Yes,  he said.  The Lannisters killed my father.    Do you think I have forgotten that?    I don’t know. Have you?   Catelyn had never struck her children in anger, but she almost struck Robb then. It was an effort to remind herself how frightened and alone he must feel.  You are King in the North, the choice is yours. I only ask that you think on what I’ve said. The singers make much of kings who die valiantly in battle, but your life is worth more than a song. To me at least, who gave it to you.  She lowered her head.  Do I have your leave to go?    Yes.  He turned away and drew his sword. What he meant to do with it, she could not say. There was no enemy there, no one to fight. Only her and him, amongst tall trees and fallen leaves. There are fights no sword can win, Catelyn wanted to tell him, but she feared the king was deaf to such words.  Hours later, she was sewing in her bedchamber when young Rollam Westerling came running with the summons to supper. Good, Catelyn thought, relieved. She had not been certain that her son would want her there, after their quarrel.  A dutiful squire,  she said to Rollam gravely. Bran would have been the same.  If Robb seemed cool at table and Edmure surly, Lame Lothar made up for them both. He was the model of courtesy, reminiscing warmly about Lord Hoster, offering Catelyn gentle condolences on the loss of Bran and Rickon, praising Edmure for the victory at Stone Mill, and thanking Robb for the  swift sure justice  he had meted out to Rickard Karstark. Lothar’s bastard brother Walder Rivers was another matter; a harsh sour man with old Lord Walder’s suspicious face, he spoke but seldom and devoted most of his attention to the meat and mead that was set before him.  When all the empty words were said, the queen and the other Westerlings excused themselves, the remains of the meal were cleared away, and Lothar Frey cleared his throat.  Before we turn to the business that brings us here, there is another matter,  he said solemnly.  A grave matter, I fear. I had hoped it would not fall to me to bring you these tidings, but it seems I must. My lord father has had a letter from his grandsons.   Catelyn had been so lost in grief for her own that she had almost forgotten the two Freys she had agreed to foster. No more, she thought. Mother have mercy, how many more blows can we bear? Somehow she knew the next words she heard would plunge yet another blade into her heart.  The grandsons at Winterfell?  she made herself ask.  My wards?    Walder and Walder, yes. But they are presently at the Dreadfort, my lady. I grieve to tell you this, but there has been a battle. Winterfell is burned.    Burned?  Robb’s voice was incredulous.   Your northern lords tried to retake it from the ironmen. When Theon Greyjoy saw that his prize was lost, he put the castle to the torch.    We have heard naught of any battle,  said Ser Brynden.   My nephews are young, I grant you, but they were there. Big Walder wrote the letter, though his cousin signed as well. It was a bloody bit of business, by their account. Your castellan was slain. Ser Rodrik, was that his name?    Ser Rodrik Cassel,  said Catelyn numbly."
}