{
  "id": "190d0aef938b0e567ec8c15aa8f58408db903311",
  "text": "    He was no true king,  Dany said scornfully.  He did no justice. Justice… that’s what kings are for.   Ser Jorah had no answer. He only smiled, and touched her hair, so lightly. It was enough.  That night she dreamt that she was Rhaegar, riding to the Trident. But she was mounted on a dragon, not a horse. When she saw the Usurper’s rebel host across the river they were armored all in ice, but she bathed them in dragonfire and they melted away like dew and turned the Trident into a torrent. Some small part of her knew that she was dreaming, but another part exulted. This is how it was meant to be. The other was a nightmare, and I have only now awakened.  She woke suddenly in the darkness of her cabin, still flush with triumph. Balerion seemed to wake with her, and she heard the faint creak of wood, water lapping against the hull, a footfall on the deck above her head. And something else.  Someone was in the cabin with her.   Irri? Jhiqui? Where are you?  Her handmaids did not respond. It was too black to see, but she could hear them breathing.  Jorah, is that you?    They sleep,  a woman said.  They all sleep.  The voice was very close.  Even dragons must sleep.   She is standing over me.  Who’s there?  Dany peered into the darkness. She thought she could see a shadow, the faintest outline of a shape.  What do you want of me?    Remember. To go north, you must journey south. To reach the west, you must go east. To go forward you must go back, and to touch the light you must pass beneath the shadow.    Quaithe?  Dany sprung from the bed and threw open the door. Pale yellow lantern light flooded the cabin, and Irri and Jhiqui sat up sleepily.  Khaleesi?  murmured Jhiqui, rubbing her eyes. Viserion woke and opened his jaws, and a puff of flame brightened even the darkest corners. There was no sign of a woman in a red lacquer mask.  Khaleesi, are you unwell?  asked Jhiqui.   A dream.  Dany shook her head.  I dreamed a dream, no more. Go back to sleep. All of us, go back to sleep.  Yet try as she might, sleep would not come again.  If I look back I am lost, Dany told herself the next morning as she entered Astapor through the harbor gates. She dared not remind herself how small and insignificant her following truly was, or she would lose all courage. Today she rode her silver, clad in horsehair pants and painted leather vest, a bronze medallion belt about her waist and two more crossed between her breasts. Irri and Jhiqui had braided her hair and hung it with a tiny silver bell whose chime sang of the Undying of Qarth, burned in their Palace of Dust.  The red brick streets of Astapor were almost crowded this morning. Slaves and servants lined the ways, while the slavers and their women donned their tokars to look down from their stepped pyramids. They are not so different from Qartheen after all, she thought. They want a glimpse of dragons to tell their children of, and their children’s children. It made her wonder how many of them would ever have children.  Aggo went before her with his great Dothraki bow. Strong Belwas walked to the right of her mare, the girl Missandei to her left. Ser Jorah Mormont was behind in mail and surcoat, glowering at anyone who came too near. Rakharo and Jhogo protected the litter. Dany had commanded that the top be removed, so her three dragons might be chained to the platform. Irri and Jhiqui rode with them, to try and keep them calm. Yet Viserion’s tail lashed back and forth, and smoke rose angry from his nostrils. Rhaegal could sense something wrong as well. Thrice he tried to take wing, only to be pulled down by the heavy chain in Jhiqui’s hand. Drogon coiled into a ball, wings and tail tucked tight. Only his eyes remained to tell that he was not asleep.  The rest of her people followed: Groleo and the other captains and their crews, and the eighty-three Dothraki who remained to her of the hundred thousand who had once ridden in Drogo’s khalasar. She put the oldest and weakest on the inside of the column, with the nursing women and those with child, and the little girls, and the boys too young to braid their hair. The rest—her warriors, such as they were—rode outside and moved their dismal herd along, the hundred-odd gaunt horses that had survived both red waste and black salt sea.  I ought to have a banner sewn, she thought as she led her tattered band up along Astapor’s meandering river. She closed her eyes to imagine how it would look: all flowing black silk, and on it the red three-headed dragon of Targaryen, breathing golden flames. A banner such as Rhaegar might have borne. The river’s banks were strangely tranquil. The Worm, the Astapori called the stream. It was wide and slow and crooked, dotted with tiny wooded islands. She glimpsed children playing on one of them, darting amongst elegant marble statues. On another island two lovers kissed in the shade of tall green trees, with no more shame than Dothraki at a wedding. Without clothing, she could not tell if they were slave or free."
}