{
  "id": "190ec9b83f9dd60a0f17242e405ff8f7e77b06ca",
  "text": "  Qyburn was taken aback.  There will be pain.    I’ll scream.    A great deal of pain.    I’ll scream very loudly.    Will you take some wine at least?    Does the High Septon ever pray?    Of that I am not certain. I shall bring the wine. Lie back, I must needs strap down your arm.   With a bowl and a sharp blade, Qyburn cleaned the stump while Jaime gulped down strongwine, spilling it all over himself in the process. His left hand did not seem to know how to find his mouth, but there was something to be said for that. The smell of wine in his sodden beard helped disguise the stench of pus.  Nothing helped when the time came to pare away the rotten flesh. Jaime did scream then, and pounded his table with his good fist, over and over and over again. He screamed again when Qyburn poured boiling wine over what remained of his stump. Despite all his vows and all his fears, he lost consciousness for a time. When he woke, the maester was sewing at his arm with needle and catgut.  I left a flap of skin to fold back over your wrist.    You have done this before,  muttered Jaime, weakly. He could taste blood in his mouth where he’d bitten his tongue.   No man who serves with Vargo Hoat is a stranger to stumps. He makes them wherever he goes.   Qyburn did not look a monster, Jaime thought. He was spare and soft-spoken, with warm brown eyes.  How does a maester come to ride with the Brave Companions?    The Citadel took my chain.  Qyburn put away his needle.  I should do something about that wound above your eye as well. The flesh is badly inflamed.   Jaime closed his eyes and let the wine and Qyburn do their work.  Tell me of the battle.  As keeper of Harrenhal’s ravens, Qyburn would have been the first to hear the news.   Lord Stannis was caught between your father and the fire. It’s said the Imp set the river itself aflame.   Jaime saw green flames reaching up into the sky higher than the tallest towers, as burning men screamed in the streets. I have dreamed this dream before. It was almost funny, but there was no one to share the joke.   Open your eye.  Qyburn soaked a cloth in warm water and dabbed at the crust of dried blood. The eyelid was swollen, but Jaime found he could force it open halfway. Qyburn’s face loomed above.  How did you come by this one?  the maester asked.   A wench’s gift.    Rough wooing, my lord?    This wench is bigger than me and uglier than you. You’d best see to her as well. She’s still limping on the leg I pricked when we fought.    I will ask after her. What is this woman to you?    My protector.  Jaime had to laugh, no matter how it hurt.   I’ll grind some herbs you can mix with wine to bring down your fever. Come back on the morrow and I’ll put a leech on your eye to drain the bad blood.    A leech. Lovely.    Lord Bolton is very fond of leeches,  Qyburn said primly.   Yes,  said Jaime.  He would be.       Tyrion   Nothing remained beyond the King’s Gate but mud and ashes and bits of burned bone, yet already there were people living in the shadow of the city walls, and others selling fish from barrows and barrels. Tyrion felt their eyes on him as he rode past; chilly eyes, angry and unsympathetic. No one dared speak to him, or try to bar his way; not with Bronn beside him in oiled black mail. If I were alone, though, they would pull me down and smash my face in with a cobblestone, as they did for Preston Greenfield.   They come back quicker than the rats,  he complained.  We burned them out once, you’d think they’d take that as a lesson.    Give me a few dozen gold cloaks and I’ll kill them all,  said Bronn.  Once they’re dead they don’t come back.    No, but others come in their places. Leave them be… but if they start throwing up hovels against the wall again, pull them down at once. The war’s not done yet, no matter what these fools may think.  He spied the Mud Gate up ahead.  I have seen enough for now. We’ll return on the morrow with the guild masters to go over their plans.  He sighed. Well, I burned most of this, I suppose it’s only just that I rebuild it.  That task was to have been his uncle’s, but solid, steady, tireless Ser Kevan Lannister had not been himself since the raven had come from Riverrun with word of his son’s murder. Willem’s twin Martyn had been taken captive by Robb Stark as well, and their elder brother Lancel was still abed, beset by an ulcerating wound that would not heal. With one son dead and two more in mortal danger, Ser Kevan was consumed by grief and fear. Lord Tywin had always relied on his brother, but now he had no choice but to turn again to his dwarf son.  The cost of rebuilding was going to be ruinous, but there was no help for that. King’s Landing was the realm’s principal harbor, rivaled only by Oldtown. The river had to be reopened, and the sooner the better. And where am I going to find the bloody coin? It was almost enough to make him miss Littlefinger, who had sailed north a fortnight past. While he beds Lysa Arryn and rules the Vale beside her, I get to clean up the mess he left behind him."
}