{
  "id": "1a0644a0b34c35f17fd7013cf4b943f686699c68",
  "text": "  The Huntsman had turned out to be a stocky man in patched tan leathers, balding and weak-chinned and quarrelsome. At Stoney Sept she had thought that Lem and Greenbeard might be torn to pieces when they faced him at the crow cages to claim his captive for the lightning lord. The hounds had been all around them, sniffing and snarling. But Tom o’ Sevens soothed them with his playing, Tansy marched across the square with her apron full of bones and fatty mutton, and Lem pointed out Anguy in the brothel window, standing with an arrow notched. The Mad Huntsman had cursed them all for lickspittles, but finally he had agreed to take his prize to Lord Beric for judgment.  They had bound his wrists with hempen rope, strung a noose around his neck, and pulled a sack down over his head, but even so there was danger in the man. Arya could feel it across the cave. Thoros—if that was Thoros—met captor and captive halfway to the fire.  How did you take him?  the priest asked.   The dogs caught the scent. He was sleeping off a drunk under a willow tree, if you believe it.    Betrayed by his own kind.  Thoros turned to the prisoner and yanked his hood off.  Welcome to our humble hall, dog. It is not so grand as Robert’s throne room, but the company is better.   The shifting flames painted Sandor Clegane’s burned face with orange shadows, so he looked even more terrible than he did in daylight. When he pulled at the rope that bound his wrists, flakes of dry blood fell off. The Hound’s mouth twitched.  I know you,  he said to Thoros.   You did. In mêlées, you’d curse my flaming sword, though thrice I overthrew you with it.    Thoros of Myr. You used to shave your head.    To betoken a humble heart, but in truth my heart was vain. Besides, I lost my razor in the woods.  The priest slapped his belly.  I am less than I was, but more. A year in the wild will melt the flesh off a man. Would that I could find a tailor to take in my skin. I might look young again, and pretty maids would shower me with kisses.    Only the blind ones, priest.   The outlaws hooted, none so loud as Thoros.  Just so. Yet I am not the false priest you knew. The Lord of Light has woken in my heart. Many powers long asleep are waking, and there are forces moving in the land. I have seen them in my flames.   The Hound was unimpressed.  Bugger your flames. And you as well.  He looked around at the others.  You keep queer company for a holy man.    These are my brothers,  Thoros said simply.  Lem Lemoncloak pushed forward. He and Greenbeard were the only men there tall enough to look the Hound in the eye.  Be careful how you bark, dog. We hold your life in our hands.    Best wipe the shit off your fingers, then.  The Hound laughed.  How long have you been hiding in this hole?   Anguy the Archer bristled at the suggestion of cowardice.  Ask the goat if we’ve hidden, Hound. Ask your brother. Ask the lord of leeches. We’ve bloodied them all.    You lot? Don’t make me laugh. You look more swineherds than soldiers.    Some of us was swineherds,  said a short man Arya did not know.  And some was tanners or singers or masons. But that was before the war come.    When we left King’s Landing we were men of Winterfell and men of Darry and men of Blackhaven, Mallery men and Wylde men. We were knights and squires and men-at-arms, lords and commoners, bound together only by our purpose.  The voice came from the man seated amongst the weirwood roots halfway up the wall.  Six score of us set out to bring the king’s justice to your brother.  The speaker was descending the tangle of steps toward the floor.  Six score brave men and true, led by a fool in a starry cloak.  A scarecrow of a man, he wore a ragged black cloak speckled with stars and an iron breastplate dinted by a hundred battles. A thicket of red-gold hair hid most of his face, save for a bald spot above his left ear where his head had been smashed in.  More than eighty of our company are dead now, but others have taken up the swords that fell from their hands.  When he reached the floor, the outlaws moved aside to let him pass. One of his eyes was gone, Arya saw, the flesh about the socket scarred and puckered, and he had a dark black ring all around his neck.  With their help, we fight on as best we can, for Robert and the realm.    Robert?  rasped Sandor Clegane, incredulous.   Ned Stark sent us out,  said pothelmed Jack-Be-Lucky,  but he was sitting the Iron Throne when he gave us our commands, so we were never truly his men, but Robert’s.    Robert is the king of the worms now. Is that why you’re down in the earth, to keep his court for him?    The king is dead,  the scarecrow knight admitted,  but we are still king’s men, though the royal banner we bore was lost at the Mummer’s Ford when your brother’s butchers fell upon us.  He touched his breast with a fist.  Robert is slain, but his realm remains. And we defend her.    Her?  The Hound snorted.  Is she your mother, Dondarrion? Or your whore?   Dondarrion? Beric Dondarrion had been handsome; Sansa’s friend Jeyne had fallen in love with him."
}