{
  "id": "1a4be2ccc79f14ed908507678126a5682ea8d626",
  "text": " The next day  they began to steer a steady  course eastwards; and  still all was quiet and  peaceful. On  the third day out from Bree they came   out of  the  Chetwood. The  land  had been falling steadily, ever since they  turned aside from the  Road,  and they  now  entered a wide flat expanse  of  country, much more difficult to manage. They were  far beyond the borders of  the Bree-land,  out in the  pathless  wilderness, and  drawing  near  to the  Midge-water Marshes.        The ground now became damp, and in places boggy and here and there they  came  upon pools, and  wide  stretches of reeds  and rushes filled with  the  warbling of little hidden  birds. They  had to pick their  way  carefully to   ####-keep  both  dry-footed and  on  their  proper  course.  At  first  they made  fan-progress,  but as  they  went on, their passage  became slower  and more  dangerous.  The marshes were bewildering and  treacherous, and there was  no  permanent trail even for Rangers  to find through their shifting  quagmires.   The  flies began  to torment them, and the air was full  of  clouds of  tiny  midges that crept up their sleeves and breeches and into their hair.       'I  am being eaten alive!'  cried  Pippin. 'Midgewater!  There are more  midges than water!'       'What  do  they live  on  when  they  can't  get  hobbit?'  asked  Sam,  scratching his neck.       They spent a miserable day in this lonely and unpleasant country. Their  camping-place  was  damp, cold,  and uncomfortable;  and the  biting insects  would not let  them sleep. There were also abominable creatures haunting the  reeds  and tussocks that from  the sound  of them were evil relatives of the  cricket.  There  were  thousands  of  them,  and  they  squeaked all  round,  neek-breek,  breek-neek, unceasingly all the night, until the  hobbits  were  nearly frantic.       The  next day,  the fourth, was little  better, and the night almost as  comfortless. Though  the Neekerbreekers (as Sam called them)  had been  left   behind, the midges still pursued them.       As Frodo lay, tired but unable to close his eyes, it seemed to him that  far away  there came  a light in the eastern sky: it  flashed and faded many  times. It was not the dawn, for that was still some hours off.        'What is the  light?'  he said  to  Strider,  who had  risen,  and  was  standing, gazing ahead into the night.       'I do  not know,' Strider answered. 'It is too distant to make  out. It  is like lightning that leaps up from the hill -tops.'       Frodo lay down again, but for a long while he could still see the white  flashes, and against them the tall dark figure  of Strider,  standing silent  and watchful. At last he passed into uneasy sleep.       They had not  gone  far  on  the  fifth day  when  they  left  the last   straggling pools and  reed-beds of the marshes  behind them. The land before  them began steadily  to rise again. Away in the distance eastward they could  now  see a line of hills. The highest of them was at the  right of  the line  and  a little  separated from the  others. It  had a  conical top,  slightly  flattened at the summit.       'That  is Weathertop,' said Strider. 'The Old Road,  which we have left    ####-far  away on our right, runs to the south  of it and passes not far from its  foot. We  might  reach it by noon tomorrow, if we  go straight towards it. I  suppose we had better do so.'       'What do you mean?' asked Frodo.       'I mean: when we do get there, it is not certain what we shall find. It  is close to the Road.'       'But surely we wer e hoping to find Gandalf there?'       'Yes; but the hope is faint.  If he comes  this way at  all, he may not  pass through  Bree, and so  he may not know  what we  are doing. And anyway,  unless by luck we arrive almost together, we shall miss one another; it will  not be safe for him or for us to wait there long. If the Riders fail to find  us in the wilderness,  they are likely to make for Weathertop themselves. It  commands a wide view all round. Indeed, there  are many birds and  beasts in  this country that  could see us,  as we stand here, from that hill-top.  Not  all the  birds are to be trusted,  and there are other spies more  evil than  they are.'       The hobbits looked  anxiously at  the distant hills. Sam looked up into  the pale sky, fearing to see hawks  or eagles hovering over them with bright   unfriendly eyes. 'You do make me feel uncomfortable  and lonesome, Strider!'  he said.       'What do you advise us to do?' asked Frodo.       'I  think,' answered Strider  slowly, as  if he was not quite sure,  'I  think the best thing is to  go as straight eastward from  here as we can, to  make for the line of hills, not for Weathertop. There we can strike a path I  know that runs at their feet; it will  bring us to Weathertop from the north  and less openly. Then we shall see what we shall see.'       All that day they plodded along, until the cold  and early evening came  down."
}