{
  "id": "1abbce47d6e7f503d7c5b9fb52416f387557e28a",
  "text": " He turned his head to howl at the guard.  Oooooooo. Oo-oo-oooooooooooo.   Hayhead screwed up his face.  Now you stop that there.    Ooo-ooo-Oooooo. Ooo-Ooo-Ooooooooooooooooo.   The guardsman retreated. When he came back, Maester Luwin was with him, all in grey, his chain tight about his neck.  Bran, those beasts make sufficient noise without your help.  He crossed the room and put his hand on the boy’s brow.  The hour grows late, you ought to be fast asleep.    I’m talking to the wolves.  Bran brushed the hand away.   Shall I have Hayhead carry you to your bed?    I can get to bed myself.  Mikken had hammered a row of iron bars into the wall, so Bran could pull himself about the room with his arms. It was slow and hard and it made his shoulders ache, but he hated being carried.  Anyway, I don’t have to sleep if I don’t want to.    All men must sleep, Bran. Even princes.    When I sleep I turn into a wolf.  Bran turned his face away and looked back out into the night.  Do wolves dream?    All creatures dream, I think, yet not as men do.    Do dead men dream?  Bran asked, thinking of his father. In the dark crypts below Winterfell, a stonemason was chiseling out his father’s likeness in granite.   Some say yes, some no,  the maester answered.  The dead themselves are silent on the matter.    Do trees dream?    Trees? No…    They do,  Bran said with sudden certainty.  They dream tree dreams. I dream of a tree sometimes. A weirwood, like the one in the godswood. It calls to me. The wolf dreams are better. I smell things, and sometimes I can taste the blood.   Maester Luwin tugged at his chain where it chafed his neck.  If you would only spend more time with the other children—    I hate the other children,  Bran said, meaning the Walders.  I commanded you to send them away.   Luwin grew stern.  The Freys are your lady mother’s wards, sent here to be fostered at her express command. It is not for you to expel them, nor is it kind. If we turned them out, where would they go?    Home. It’s their fault you won’t let me have Summer.    The Frey boy did not ask to be attacked,  the maester said,  no more than I did.    That was Shaggydog.  Rickon’s big black wolf was so wild he even frightened Bran at times.  Summer never bit anyone.    Summer ripped out a man’s throat in this very chamber, or have you forgotten? The truth is, those sweet pups you and your brothers found in the snow have grown into dangerous beasts. The Frey boys are wise to be wary of them.    We should put the Walders in the godswood. They could play lord of the crossing all they want, and Summer could sleep with me again. If I’m the prince, why won’t you heed me? I wanted to ride Dancer, but Alebelly wouldn’t let me past the gate.    And rightly so. The wolfswood is full of danger; your last ride should have taught you that. Would you want some outlaw to take you captive and sell you to the Lannisters?    Summer would save me,  Bran insisted stubbornly.  Princes should be allowed to sail the sea and hunt boar in the wolfswood and joust with lances.    Bran, child, why do you torment yourself so? One day you may do some of these things, but now you are only a boy of eight.    I’d sooner be a wolf. Then I could live in the wood and sleep when I wanted, and I could find Arya and Sansa. I’d smell where they were and go save them, and when Robb went to battle I’d fight beside him like Grey Wind. I’d tear out the Kingslayer’s throat with my teeth, rip, and then the war would be over and everyone would come back to Winterfell. If I was a wolf…  He howled.  Ooo-ooo-oooooooooooo.   Luwin raised his voice.  A true prince would welcome—    AAHOOOOOOO,  Bran howled, louder.  AAHOOOOOOOOOOOO.   The maester surrendered.  As you will, child.  With a look that was part grief and part disgust, he left the bedchamber.  Howling lost its savor once Bran was alone. After a time he quieted. I did welcome them, he told himself, resentful. I was the lord in Winterfell, a true lord, he can’t say I wasn’t. When the Walders had arrived from the Twins, it had been Rickon who wanted them gone. A baby of four, he had screamed that he wanted Mother and Father and Robb, not these strangers. It had been up to Bran to soothe him and bid the Freys welcome. He had offered them meat and mead and a seat by the fire, and even Maester Luwin had said afterward that he’d done well.  Only that was before the game.  The game was played with a log, a staff, a body of water, and a great deal of shouting. The water was the most important, Walder and Walder assured Bran. You could use a plank or even a series of stones, and a branch could be your staff. You didn’t have to shout. But without water, there was no game. As Maester Luwin and Ser Rodrik were not about to let the children go wandering off into the wolfswood in search of a stream, they made do with one of the murky pools in the godswood. Walder and Walder had never seen hot water bubbling from the ground before, but they both allowed how it would make the game even better."
}