{
  "id": "1bd2a8167c21b2f283b0d5bd890750b41c1827da",
  "text": " The trap had teeth. With Maester Aemon insisting on Jon’s innocence, Lord Janos had not dared to leave him in the ice to die. This was better.  Our honor means no more than our lives, so long as the realm is safe,  Qhorin Halfhand had said in the Frostfangs. He must remember that. Whether he slew Mance or only tried and failed, the free folk would kill him. Even desertion was impossible, if he’d been so inclined; to Mance he was a proven liar and betrayer.  When the cage jerked to a halt, Jon swung down onto the ground and rattled Longclaw’s hilt to loosen the bastard blade in its scabbard. The gate was a few yards to his left, still blocked by the splintered ruins of the turtle, the carcass of a mammoth ripening within. There were other corpses too, strewn amidst broken barrels, hardened pitch, and patches of burnt grass, all shadowed by the Wall. Jon had no wish to linger here. He started walking toward the wildling camp, past the body of a dead giant whose head had been crushed by a stone. A raven was pulling out bits of brain from the giant’s shattered skull. It looked up as he walked by.  Snow,  it screamed at him.  Snow, snow.  Then it opened its wings and flew away.  No sooner had he started out than a lone rider emerged from the wildling camp and came toward him. He wondered if Mance was coming out to parley in no-man’s-land. That might make it easier, though nothing will make it easy. But as the distance between them diminished Jon saw that the horseman was short and broad, with gold rings glinting on thick arms and a white beard spreading out across his massive chest.   Har!  Tormund boomed when they came together.  Jon Snow the crow. I feared we’d seen the last o’ you.    I never knew you feared anything, Tormund.   That made the wildling grin.  Well said, lad. I see your cloak is black. Mance won’t like that. If you’ve come to change sides again, best climb back on that Wall o’ yours.    They’ve sent me to treat with the King-beyond-the-Wall.    Treat?  Tormund laughed.  Now there’s a word. Har! Mance wants to talk, that’s true enough. Can’t say he’d want to talk with you, though.    I’m the one they’ve sent.    I see that. Best come along, then. You want to ride?    I can walk.    You fought us hard here.  Tormund turned his garron back toward the wildling camp.  You and your brothers. I give you that. Two hundred dead, and a dozen giants. Mag himself went in that gate o’ yours and never did come out.    He died on the sword of a brave man named Donal Noye.    Aye? Some great lord was he, this Donal Noye? One of your shiny knights in their steel smallclothes?    A blacksmith. He only had one arm.    A one-armed smith slew Mag the Mighty? Har! That must o’ been a fight to see. Mance will make a song of it, see if he don’t.  Tormund took a waterskin off his saddle and pulled the cork.  This will warm us some. To Donal Noye, and Mag the Mighty.  He took a swig, and handed it down to Jon.   To Donal Noye, and Mag the Mighty.  The skin was full of mead, but a mead so potent that it made Jon’s eyes water and sent tendrils of fire snaking through his chest. After the ice cell and the cold ride down in the cage, the warmth was welcome.  Tormund took the skin back and downed another swig, then wiped his mouth.  The Magnar of Thenn swore t’us that he’d have the gate wide open, so all we’d need to do was stroll through singing. He was going to bring the whole Wall down.    He brought down part,  Jon said.  On his head.    Har!  said Tormund.  Well, I never had much use for Styr. When a man’s got no beard nor hair nor ears, you can’t get a good grip on him when you fight.  He kept his horse at a slow walk so Jon could limp beside him.  What happened to that leg?    An arrow. One of Ygritte’s, I think.    That’s a woman for you. One day she’s kissing you, the next she’s filling you with arrows.    She’s dead.    Aye?  Tormund gave a sad shake of the head.  A waste. If I’d been ten years younger, I’d have stolen her meself. That hair she had. Well, the hottest fires burn out quickest,  He lifted the skin of mead.  To Ygritte, kissed by fire!  He drank deep.   To Ygritte, kissed by fire,  Jon repeated when Tormund handed him back the skin. He drank even deeper.   Was it you killed her?    My brother.  Jon had never learned which one, and hoped he never would.   You bloody crows.  Tormund’s tone was gruff, yet strangely gentle.  That Longspear stole me daughter. Munda, me little autumn apple. Took her right out o’ my tent with all four o’ her brothers about. Toregg slept through it, the great lout, and Torwynd… well, Torwynd the Tame, that says all that needs saying, don’t it? The young ones gave the lad a fight, though.    And Munda?  asked Jon.   She’s my own blood,  said Tormund proudly.  She broke his lip for him and bit one ear half off, and I hear he’s got so many scratches on his back he can’t wear a cloak. She likes him well enough, though. And why not? He don’t fight with no spear, you know. Never has."
}