{
  "id": "1c33ab5eb9f5ab030b193442c551c8598606b8df",
  "text": "  Come the morning, Grisel climbed up to the bedchamber to serve the lord and lady a tray of morning bread, with butter, honey, fruit, and cream. She returned to say that Alayne was wanted. Sansa was still drowsy from sleep. It took her a moment to remember that she was Alayne.  Lady Lysa was still abed, but Lord Petyr was up and dressed.  Your aunt wishes to speak with you,  he told Sansa, as he pulled on a boot.  I’ve told her who you are.   Gods be good.  I… I thank you, my lord.   Petyr yanked on the other boot.  I’ve had about as much home as I can stomach. We’ll leave for the Eyrie this afternoon.  He kissed his lady wife and licked a smear of honey off her lips, then headed down the steps.  Sansa stood by the foot of the bed while her aunt ate a pear and studied her.  I see it now,  the Lady Lysa said, as she set the core aside.  You look so much like Catelyn.    It’s kind of you to say so.    It was not meant as flattery. If truth be told, you look too much like Catelyn. Something must be done. We shall darken your hair before we bring you back to the Eyrie, I think.   Darken my hair?  If it please you, Aunt Lysa.    You must not call me that. No word of your presence here must be allowed to reach King’s Landing. I do not mean to have my son endangered.  She nibbled the corner of a honeycomb.  I have kept the Vale out of this war. Our harvest has been plentiful, the mountains protect us, and the Eyrie is impregnable. Even so, it would not do to draw Lord Tywin’s wroth down upon us.  Lysa set the comb down and licked honey from her fingers.  You were wed to Tyrion Lannister, Petyr says. That vile dwarf.    They made me marry him. I never wanted it.    No more than I did,  her aunt said.  Jon Arryn was no dwarf, but he was old. You may not think so to see me now, but on the day we wed I was so lovely I put your mother to shame. But all Jon desired was my father’s swords, to aid his darling boys. I should have refused him, but he was such an old man, how long could he live? Half his teeth were gone, and his breath smelled like bad cheese. I cannot abide a man with foul breath. Petyr’s breath is always fresh… he was the first man I ever kissed, you know. My father said he was too lowborn, but I knew how high he’d rise. Jon gave him the customs for Gulltown to please me, but when he increased the incomes tenfold my lord husband saw how clever he was and gave him other appointments, even brought him to King’s Landing to be master of coin. That was hard, to see him every day and still be wed to that old cold man. Jon did his duty in the bedchamber, but he could no more give me pleasure than he could give me children. His seed was old and weak. All my babies died but Robert, three girls and two boys. All my sweet little babies dead, and that old man just went on and on with his stinking breath. So you see, I have suffered too.  Lady Lysa sniffed.  You do know that your poor mother is dead?    Tyrion told me,  said Sansa.  He said the Freys murdered her at The Twins, with Robb.   Tears welled suddenly in Lady Lysa’s eyes.  We are women alone now, you and I. Are you afraid, child? Be brave. I would never turn away Cat’s daughter. We are bound by blood.  She beckoned Sansa closer.  You may come kiss my cheek, Alayne.   Dutifully she approached and knelt beside the bed. Her aunt was drenched in sweet scent, though under that was a sour milky smell. Her cheek tasted of paint and powder.  As Sansa stepped back, Lady Lysa caught her wrist.  Now tell me,  she said sharply.  Are you with child? The truth now, I will know if you lie.    No,  she said, startled by the question.   You are a woman flowered, are you not?    Yes.  Sansa knew the truth of her flowering could not be long hidden in the Eyrie.  Tyrion didn’t… he never…  She could feel the blush creeping up her cheeks.  I am still a maid.    Was the dwarf incapable?    No. He was only… he was…  Kind? She could not say that, not here, not to this aunt who hated him so.  He… he had whores, my lady. He told me so.    Whores.  Lysa released her wrist.  Of course he did. What woman would bed such a creature, but for gold? I should have killed the Imp when he was in my power, but he tricked me. He is full of low cunning, that one. His sellsword slew my good Ser Vardis Egen. Catelyn should not have brought him here, I told her that. She made off with our uncle too. That was wrong of her. The Blackfish was my Knight of the Gate, and since he left us the mountain clans are growing very bold. Petyr will soon set all that to rights, though. I shall make him Lord Protector of the Vale.  Her aunt smiled for the first time, almost warmly.  He may not look as tall or strong as some, but he is worth more than all of them. Trust in him and do as he says.    I shall, Aunt… my lady.   Lady Lysa seemed pleased by that.  I knew that boy Joffrey. He used to call my Robert cruel names, and once he slapped him with a wooden sword. A man will tell you poison is dishonorable, but a woman’s honor is different."
}