{
  "id": "1d6f8df2d50be1c32963f3e9aeb75b784e6d99da",
  "text": " Perhaps she does not even see ugliness.  Even so, Tyrion would sooner have used some of his mountain clansmen to guard the manse; Chella’s Black Ears perhaps, or the Moon Brothers. He had more faith in their iron loyalties and sense of honor than in the greed of sellswords. The risk was too great, however. All King’s Landing knew the wildlings were his. If he sent the Black Ears here, it would only be a matter of time until the whole city knew the King’s Hand was keeping a concubine.  One of the Ibbenese took his horse.  Have you woken her?  Tyrion asked him.   No, m’lord.    Good.   The fire in the bedchamber had burned down to embers, but the room was still warm. Shae had kicked off her blankets and sheets as she slept. She lay nude atop the featherbed, the soft curves of her young body limned in the faint glow from the hearth. Tyrion stood in the door and drank in the sight of her. Younger than Marei, sweeter than Dancy, more beautiful than Alayaya, she’s all I need and more. How could a whore look so clean and sweet and innocent, he wondered?  He had not intended to disturb her, but the sight of her was enough to make him hard. He let his garments fall to the floor, then crawled onto the bed and gently pushed her legs apart and kissed her between the thighs. Shae murmured in her sleep. He kissed her again, and licked at her secret sweetness, on and on until his beard and her cunt were both soaked. When she gave a soft moan and shuddered, he climbed up and thrust himself inside her and exploded almost at once.  Her eyes were open. She smiled and stroked his head and whispered,  I just had the sweetest dream, m’lord.   Tyrion nipped at her small hard nipple and nestled his head on her shoulder. He did not pull out of her; would that he never had to pull out of her.  This is no dream,  he promised her. It is real, all of it, he thought, the wars, the intrigues, the great bloody game, and me in the center of it… me, the dwarf, the monster, the one they scorned and laughed at, but now I hold it all, the power, the city, the girl. This was what I was made for, and gods forgive me, but I do love it…  And her. And her.      ARYA  Whatever names Harren the Black had meant to give his towers were long forgotten. They were called the Tower of Dread, the Widow’s Tower, the Wailing Tower, the Tower of Ghosts, and Kingspyre Tower. Arya slept in a shallow niche in the cavernous vaults beneath the Wailing Tower, on a bed of straw. She had water to wash in whenever she liked, a chunk of soap. The work was hard, but no harder than walking miles every day. Weasel did not need to find worms and bugs to eat, as Arry had; there was bread every day, and barley stews with bits of carrot and turnip, and once a fortnight even a bite of meat.  Hot Pie ate even better; he was where he belonged, in the kitchens, a round stone building with a domed roof that was a world unto itself. Arya took her meals at a trestle table in the undercroft with Weese and his other charges, but sometimes she would be chosen to help fetch their food, and she and Hot Pie could steal a moment to talk. He could never remember that she was now Weasel and kept calling her Arry, even though he knew she was a girl. Once he tried to slip her a hot apple tart, but he made such a clumsy job of it that two of the cooks saw. They took the tart away and beat him with a big wooden spoon.  Gendry had been sent to the forge; Arya seldom saw him. As for those she served with, she did not even want to know their names. That only made it hurt worse when they died. Most of them were older than she was and content to let her alone.  Harrenhal was vast, much of it far gone in decay. Lady Whent had held the castle as bannerman to House Tully, but she’d used only the lower thirds of two of the five towers, and let the rest go to ruin. Now she was fled, and the small household she’d left could not begin to tend the needs of all the knights, lords, and highborn prisoners Lord Tywin had brought, so the Lannisters must forage for servants as well as for plunder and provender. The talk was that Lord Tywin planned to restore Harrenhal to glory, and make it his new seat once the war was done.  Weese used Arya to run messages, draw water, and fetch food, and sometimes to serve at table in the Barracks Hall above the armory, where the men-at-arms took their meals. But most of her work was cleaning. The ground floor of the Wailing Tower was given over to storerooms and granaries, and two floors above housed part of the garrison, but the upper stories had not been occupied for eighty years. Now Lord Tywin had commanded that they be made fit for habitation again. There were floors to be scrubbed, grime to be washed off windows, broken chairs and rotted beds to be carried off. The topmost story was infested with nests of the huge black bats that House Whent had used for its sigil, and there were rats in the cellars as well… and ghosts, some said, the spirits of Harren the Black and his sons."
}