{
  "id": "1d91271438edc2b444469392efde1c760b61c6f4",
  "text": "  Tonight it was Sam’s turn to give his results first.  Two hundred and three for Ser Denys Mallister,  he said.  One hundred and sixty-nine for Cotter Pyke. One hundred and thirty-seven for Lord Janos Slynt, seventy-two for Othell Yarwyck, five for Three-Finger Hobb, and two for Dolorous Edd.    I had one hundred and sixty-eight for Pyke,  Clydas said.  We are two votes short by my count, and one by Sam’s.    Sam’s count is correct,  said Maester Aemon.  Jon Snow did not cast a token. It makes no matter. No one is close.   Sam was more relieved than disappointed. Even with Bowen Marsh’s support, Lord Janos was still only third.  Who are these five who keep voting for Three-Finger Hobb?  he wondered.   Brothers who want him out of the kitchens?  said Clydas.   Ser Denys is down ten votes since yesterday,  Sam pointed out.  And Cotter Pyke is down almost twenty. That’s not good.    Not good for their hopes of becoming Lord Commander, certainly,  said Maester Aemon.  Yet it may be good for the Night’s Watch, in the end. That is not for us to say. Ten days is not unduly long. There was once a choosing that lasted near two years, some seven hundred votes. The brothers will come to a decision in their own time.   Yes, Sam thought, but what decision?  Later, over cups of watered wine in the privacy of Pyp’s cell, Sam’s tongue loosened and he found himself thinking aloud.  Cotter Pyke and Ser Denys Mallister have been losing ground, but between them they still have almost two-thirds,  he told Pyp and Grenn.  Either one would be fine as Lord Commander. Someone needs to convince one of them to withdraw and support the other.    Someone?  said Grenn, doubtfully.  What someone?    Grenn is so dumb he thinks someone might be him,  said Pyp.  Maybe when someone is done with Pyke and Mallister, he should convince King Stannis to marry Queen Cersei too.    King Stannis is married,  Grenn objected.   What am I going to do with him, Sam?  sighed Pyp.   Cotter Pyke and Ser Denys don’t like each other much,  Grenn argued stubbornly.  They fight about everything.    Yes, but only because they have different ideas about what’s best for the Watch,  said Sam.  If we explained—    We?  said Pyp.  How did someone change to we? I’m the mummer’s monkey, remember? And Grenn is, well, Grenn.  He smiled at Sam, and wiggled his ears.  You, now… you’re a lord’s son, and the maester’s steward…    And Sam the Slayer,  said Grenn.  You slew an Other.    It was the dragonglass that killed it,  Sam told him for the hundredth time.   A lord’s son, the maester’s steward, and Sam the Slayer,  Pyp mused.  You could talk to them, might be…    I could,  said Sam, sounding as gloomy as Dolorous Edd,  if I wasn’t too craven to face them.       Jon   Jon prowled around Satin in a slow circle, sword in hand, forcing him to turn.  Get your shield up,  he said.   It’s too heavy,  the Oldtown boy complained.   It’s as heavy as it needs to be to stop a sword,  Jon said.  Now get it up.  He stepped forward, slashing. Satin jerked the shield up in time to catch the sword on its rim, and swung his own blade at Jon’s ribs.  Good,  Jon said, when he felt the impact on his own shield.  That was good. But you need to put your body into it. Get your weight behind the steel and you’ll do more damage than with arm strength alone. Come, try it again, drive at me, but keep the shield up or I’ll ring your head like a bell…   Instead Satin took a step backward and raised his visor.  Jon,  he said, in an anxious voice.  When he turned, she was standing behind him, with half a dozen queen’s men around her. Small wonder the yard grew so quiet. He had glimpsed Melisandre at her nightfires, and coming and going about the castle, but never so close. She’s beautiful, he thought… but there was something more than a little unsettling about red eyes.  My lady.    The king would speak with you, Jon Snow.   Jon thrust the practice sword into the earth.  Might I be allowed to change? I am in no fit state to stand before a king.    We shall await you atop the Wall,  said Melisandre. We, Jon heard, not he. It’s as they say. This is his true queen, not the one he left at Eastwatch.  He hung his mail and plate inside the armory, returned to his own cell, discarded his sweat-stained clothes, and donned a fresh set of blacks. It would be cold and windy in the cage, he knew, and colder and windier still on top of the ice, so he chose a heavy hooded cloak. Last of all he collected Longclaw, and slung the bastard sword across his back.  Melisandre was waiting for him at the base of the Wall. She had sent her queen’s men away.  What does His Grace want of me?  Jon asked her as they entered the cage.   All you have to give, Jon Snow. He is a king.   He shut the door and pulled the bell cord. The winch began to turn. They rose. The day was bright and the Wall was weeping, long fingers of water trickling down its face and glinting in the sun. In the close confines of the iron cage, he was acutely aware of the red woman’s presence."
}