{
  "id": "1de88d7c3d3e5e1558b6f1132aecc31281d3556b",
  "text": " His mouth twisted, and he could almost feel the boils that covered his cheeks and neck growing red and angry. I should be safe back at the Wall, tending the bloody ravens and making fires for old Maester Aemon. It was the bastard Jon Snow who had taken that from him, him and his fat friend Sam Tarly. It was their fault he was here, freezing his bloody balls off with a pack of hounds deep in the haunted forest.   Seven hells.  He gave the leashes a hard yank to get the dogs’ attention.  Track, you bastards. That’s a bear print. You want some meat or no? Find!  But the hounds only huddled closer, whining. Chett snapped his short lash above their heads, and the black bitch snarled at him.  Dog meat would taste as good as bear,  he warned her, his breath frosting with every word.  Lark the Sisterman stood with his arms crossed over his chest and his hands tucked up into his armpits. He wore black wool gloves, but he was always complaining how his fingers were frozen.  It’s too bloody cold to hunt,  he said.  Bugger this bear, he’s not worth freezing over.    We can’t go back emptyhand, Lark,  rumbled Small Paul through the brown whiskers that covered most of his face.  The Lord Commander wouldn’t like that.  There was ice under the big man’s squashed pug nose, where his snot had frozen. A huge hand in a thick fur glove clenched tight around the shaft of a spear.   Bugger that Old Bear too,  said the Sisterman, a thin man with sharp features and nervous eyes.  Mormont will be dead before daybreak, remember? Who cares what he likes?   Small Paul blinked his black little eyes. Maybe he had forgotten, Chett thought; he was stupid enough to forget most anything.  Why do we have to kill the Old Bear? Why don’t we just go off and let him be?    You think he’ll let us be?  said Lark.  He’ll hunt us down. You want to be hunted, you great muttonhead?    No,  said Small Paul.  I don’t want that. I don’t.    So you’ll kill him?  said Lark.   Yes.  The huge man stamped the butt of his spear on the frozen riverbank.  I will. He shouldn’t hunt us.   The Sisterman took his hands from his armpits and turned to Chett.  We need to kill all the officers, I say.   Chett was sick of hearing it.  We been over this. The Old Bear dies, and Blane from the Shadow Tower. Grubbs and Aethan as well, their ill luck for drawing the watch, Dywen and Barmen for their tracking, and Ser Piggy for the ravens. That’s all. We kill them quiet, while they sleep. One scream and we’re wormfood, every one of us.  His boils were red with rage.  Just do your bit and see that your cousins do theirs. And Paul, try and remember, it’s third watch, not second.    Third watch,  the big man said, through hair and frozen snot.  Me and Softfoot. I remember, Chett.   The moon would be black tonight, and they had jiggered the watches so as to have eight of their own standing sentry, with two more guarding the horses. It wasn’t going to get much riper than that. Besides, the wildlings could be upon them any day now. Chett meant to be well away from here before that happened. He meant to live.  Three hundred sworn brothers of the Night’s Watch had ridden north, two hundred from Castle Black and another hundred from the Shadow Tower. It was the biggest ranging in living memory, near a third of the Watch’s strength. They meant to find Ben Stark, Ser Waymar Royce, and the other rangers who’d gone missing, and discover why the wildlings were leaving their villages. Well, they were no closer to Stark and Royce than when they’d left the Wall, but they’d learned where all the wildlings had gone—up into the icy heights of the godsforsaken Frostfangs. They could squat up there till the end of time and it wouldn’t prick Chett’s boils none.  But no. They were coming down. Down the Milkwater.  Chett raised his eyes and there it was. The river’s stony banks were bearded by ice, its pale milky waters flowing endlessly down out of the Frostfangs. And now Mance Rayder and his wildlings were flowing down the same way. Thoren Smallwood had returned in a lather three days past. While he was telling the Old Bear what his scouts had seen, his man Kedge Whiteye told the rest of them.  They’re still well up the foothills, but they’re coming,  Kedge said, warming his hands over the fire.  Harma the Dogshead has the van, the poxy bitch. Goady crept up on her camp and saw her plain by the fire. That fool Tumberjon wanted to pick her off with an arrow, but Smallwood had better sense.   Chett spat.  How many were there, could you tell?    Many and more. Twenty, thirty thousand, we didn’t stay to count. Harma had five hundred in the van, every one ahorse.   The men around the fire exchanged uneasy looks. It was a rare thing to find even a dozen mounted wildlings, and five hundred…   Smallwood sent Bannen and me wide around the van to catch a peek at the main body,  Kedge went on.  There was no end of them. They’re moving slow as a frozen river, four, five miles a day, but they don’t look like they mean to go back to their villages neither."
}