{
  "id": "1e18be812278c769c87f480a69c702018cccbfd1",
  "text": "  The children will help him,  he blurted,  the children of the forest!   Theon Greyjoy sniggered, and Maester Luwin said,  Bran, the children of the forest have been dead and gone for thousands of years. All that is left of them are the faces in the trees.    Down here, might be that’s true, Maester,  Yoren said,  but up past the Wall, who’s to say? Up there, a man can’t always tell what’s alive and what’s dead.   That night, after the plates had been cleared, Robb carried Bran up to bed himself. Grey Wind led the way, and Summer came close behind. His brother was strong for his age, and Bran was as light as a bundle of rags, but the stairs were steep and dark, and Robb was breathing hard by the time they reached the top.  He put Bran into bed, covered him with blankets, and blew out the candle. For a time Robb sat beside him in the dark. Bran wanted to talk to him, but he did not know what to say.  We’ll find a horse for you, I promise,  Robb whispered at last.   Are they ever coming back?  Bran asked him.   Yes,  Robb said with such hope in his voice that Bran knew he was hearing his brother and not just Robb the Lord.  Mother will be home soon. Maybe we can ride out to meet her when she comes. Wouldn’t that surprise her, to see you ahorse?  Even in the dark room, Bran could feel his brother’s smile.  And afterward, we’ll ride north to see the Wall. We won’t even tell Jon we’re coming, we’ll just be there one day, you and me. It will be an adventure.    An adventure,  Bran repeated wistfully. He heard his brother sob. The room was so dark he could not see the tears on Robb’s face, so he reached out and found his hand. Their fingers twined together.      EDDARD   Lord Arryn’s death was a great sadness for all of us, my lord,  Grand Maester Pycelle said.  I would be more than happy to tell you what I can of the manner of his passing. Do be seated. Would you care for refreshments? Some dates, perhaps? I have some very fine persimmons as well. Wine no longer agrees with my digestion, I fear, but I can offer you a cup of iced milk, sweetened with honey. I find it most refreshing in this heat.   There was no denying the heat; Ned could feel the silk tunic clinging to his chest. Thick, moist air covered the city like a damp woolen blanket, and the riverside had grown unruly as the poor fled their hot, airless warrens to jostle for sleeping places near the water, where the only breath of wind was to be found.  That would be most kind,  Ned said, seating himself.  Pycelle lifted a tiny silver bell with thumb and forefinger and tinkled it gently. A slender young serving girl hurried into the solar.  Iced milk for the King’s Hand and myself, if you would be so kind, child. Well sweetened.   As the girl went to fetch their drinks, the Grand Maester knotted his fingers together and rested his hands on his stomach.  The smallfolk say that the last year of summer is always the hottest. It is not so, yet ofttimes it feels that way, does it not? On days like this, I envy you northerners your summer snows.  The heavy jeweled chain around the old man’s neck chinked softly as he shifted in his seat.  To be sure, King Maekar’s summer was hotter than this one, and near as long. There were fools, even in the Citadel, who took that to mean that the Great Summer had come at last, the summer that never ends, but in the seventh year it broke suddenly, and we had a short autumn and a terrible long winter. Still, the heat was fierce while it lasted. Oldtown steamed and sweltered by day and came alive only by night. We would walk in the gardens by the river and argue about the gods. I remember the smells of those nights, my lord—perfume and sweat, melons ripe to bursting, peaches and pomegranates, nightshade and moonbloom. I was a young man then, still forging my chain. The heat did not exhaust me as it does now.  Pycelle’s eyes were so heavily lidded he looked half-asleep.  My pardons, Lord Eddard. You did not come to hear foolish meanderings of a summer forgotten before your father was born. Forgive an old man his wanderings, if you would. Minds are like swords, I do fear. The old ones go to rust. Ah, and here is our milk.  The serving girl placed the tray between them, and Pycelle gave her a smile.  Sweet child.  He lifted a cup, tasted, nodded.  Thank you. You may go.   When the girl had taken her leave, Pycelle peered at Ned through pale, rheumy eyes.  Now where were we? Oh, yes. You asked about Lord Arryn…    I did.  Ned sipped politely at the iced milk. It was pleasantly cold, but oversweet to his taste.   If truth be told, the Hand had not seemed quite himself for some time,  Pycelle said.  We had sat together on council many a year, he and I, and the signs were there to read, but I put them down to the great burdens he had borne so faithfully for so long. Those broad shoulders were weighed down by all the cares of the realm, and more besides. His son was ever sickly, and his lady wife so anxious that she would scarcely let the boy out of her sight."
}