{
  "id": "1e23d4c34773e2899d225fc2443eb06eca4814e2",
  "text": "  Harry drank deeply. It was the most delicious thing he'd ever tasted and seemed to heat every bit of him from the inside.  A sudden breeze ruffled his hair. The door of the Three Broomsticks had opened again. Harry looked over the rim of his tankard and choked.  Professors McGonagall and Flitwick had just entered the pub with a flurry of snowflakes, shortly followed by Hagrid, who was deep in conversation with a portly man in a lime-green bowler hat and a pinstriped cloak -- Cornelius Fudge, Minister of Magic.  In an instant, Ron and Hermione had both placed hands on the top of Harry's head and forced him off his stool and under the table. Dripping with butterbeer and crouching out of sight, Harry clutched his empty tankard and watched the teachers' and Fudge's feet move toward the bar, pause, then turn and walk right toward him.  Somewhere above him, Hermione whispered, Mobiliarbus!\"  The Christmas tree beside their table rose a few inches off the ground, drifted sideways, and landed with a soft thump right in front of their table, hiding them from view. Staring through the dense lower branches, Harry saw four sets of chair legs move back from the table right beside theirs, then heard the grunts and sighs If the teachers and minister as they sat down.  Next he saw another pair of feet, wearing sparkly turquoise high heels, and heard a woman's voice. \"A small gillywater --\"  \"Mine,\" said Professor McGonagall's voice.  \"Four pints of mulled mead --\"  \"Ta, Rosmerta,\" said Hagrid.  \"A cherry syrup and soda with ice and umbrella --\"  \"Mmm!\" said Professor Flitwick, smacking his lips.  \"So you'll be the red currant rum, Minister.\"  \"Thank you, Rosmerta, m'dear,\" said Fudge's voice. \"Lovely to see you again, I must say. Have one yourself, won't you? Come and join us....\"  \"Well, thank you very much, Minister.\"  Harry watched the glittering heels march away and back again. His heart was pounding uncomfortably in his throat. Why hadn't it occurred to him that this was the last weekend of term for the teachers to& And how long were they going to sit there? He needed time to sneak back into Honeydukes if he wanted to return to school tonight.... Hermione's leg gave a nervous twitch next to him.  \"So, what brings you to this neck of the woods, Minister?\" came Madam Rosmerta's voice.  Harry saw the lower part of Fudge's thick body twist in his chair as though he were checking for eavesdroppers. Then he said in a quiet voice, \"What else, m'dear, but Sirius Black? I daresay you heard what happened up at the school at Halloween?\"  I did hear a rumor,\" admitted Madam Rosmerta.  \"Did you tell the whole pub, Hagrid?\" said Professor McGonagall exasperatedly.  \"Do you think Blacks still in the area, Minister?\" whispered Madam Rosmerta.  \"I'm sure of it,\" said Fudge shortly.  \"You know that the dementors have searched the whole village twjce?\" said Madam Rosmerta, a slight edge to her voice. \"Scared all my customers away... It's very bad for business, Minister.\"  \"Rosmerta, dear, I don't like them any more than you do,\" said Fudge uncomfortably. \"Necessary precaution... unfortunate, but there YOU are.... I've just met some of them. They're in a fury against Dumbledore -- he won't let them inside the castle grounds.\"  \"I should think not,\" said Professor McGonagall sharply. \"How are we supposed to teach with those horrors floating around?\"  \"Hear, hear!\" squeaked tiny Professor Flitwick, whose feet were dangling a foot from the ground.  \"All the same,\" demurred Fudge, \"they are here to protect you all from something much worse.... We all know what Black's capable of...\"  \"Do you know, I still have trouble believing it,\" said Madam Rosmerta thoughtfully. \"Of all the people to go over to the Dark Side, Sirius Black was the last I'd have thought... I mean, I remember him when he was a boy at Hogwarts. If you'd told me then what he was going to become, I'd have said you'd had too much mead.\"  \"You don't know the half of it, Rosmerta,\" said Fudge gruffly. \"The worst he did isn't widely known.\"  \"The worst?\" said Madam Rosmerta, her voice alive with curiosity, \"Worse than murdering all those poor people, you mean?\"  \"I certainly do,\" said Fudge.  \"I ca'A believe that. What could possibly be worse?\" \"You say you remember him at Hogwarts, Rosmerta,\" mur- mured Professor McGonagall. \"Do you remember who his-best friend was?\"  \"Naturally,\" said Madam Rosmerta, with a small laugh. \"Never saw one without the other, did you? The number of times I had them in here -- ooh, they used to make me laugh. Quite the double act, Sirius Black and James Potter!\"  Harry dropped his tankard with a loud clunk. Ron kicked him.  \"Precisely,\" said Professor McGonagall. \"Black and Potter. Ringleaders of their little gang. Both very bright, of course -- exceptionally bright, in fact -- but I don't think we've ever had such a pair of troublemakers --\"  \"I dunno,\" chuckled Hagrid. \"Fred and George Weasley could give 'em a run fer their money.\"  \"You'd have thought Black and Potter were brothers!\" chimed in Professor Flitwick."
}