{
  "id": "1e808df1470e48c476591d0d7110f38c8ffd17a7",
  "text": "  Harry couldn't sit down. He paced up and down in front of the fire. He was still shaking.  \"Snape wants the stone for Voldemort... and Voldemort's waiting in the forest... and all this time we thought Snape just wanted to get rich....\"  \"Stop saying the name!\" said Ron in a terrified whisper, as if he thought Voldemort could hear them.  Harry wasn't listening.  \"Firenze saved me, but he shouldn't have done so.... Bane was furious... he was talking about interfering with what the planets say is going to happen.... They must show that Voldemort's coming back.... Bane thinks Firenze should have let Voldemort kill me.... I suppose that's written in the stars as well.\"  \"Will you stop saying the name!\" Ron hissed.  \"So all I've got to wait for now is Snape to steal the Stone,\" Harry went on feverishly, \"then Voldemort will be able to come and finish me off... Well, I suppose Bane'll be happy.\"  Hermione looked very frightened, but she had a word of comfort.  \"Harry, everyone says Dumbledore's the only one You-Know-Who was ever afraid of With Dumbledore around, You-Know-Who won't touch you. Anyway, who says the centaurs are right? It sounds like fortune-telling to me, and Professor McGonagall says that's a very imprecise branch of magic.\"  The sky had turned light before they stopped talking. They went to bed exhausted, their throats sore. But the night's surprises weren't over.  When Harry pulled back his sheets, he found his invisibility cloak folded neatly underneath them. There was a note pinned to it:  Just in case.   CHAPTER SIXTEEN  THROUGH THE TRAPDOOR  In years to come, Harry would never quite remember how he had managed to get through his exams when he half expected Voldemort to come bursting through the door at any moment. Yet the days crept by, and there could be no doubt that Fluffy was still alive and well behind the locked door.  It was sweltering hot, especially in the large classroom where they did their written papers. They had been given special, new quills for the exams, which had been bewitched with an AntiCheating spell.  They had practical exams as well. Professor Flitwick called them one by one into his class to see if they could make a pineapple tapdance across a desk. Professor McGonagall watched them turn a mouse into a snuffbox -- points were given for how pretty the snuffbox was, but taken away if it had whiskers. Snape made them all nervous, breathing down their necks while they tried to remember how to make a Forgetfulness potion.  Harry did the best he could, trying to ignore the stabbing pains in his forehead, which had been bothering him ever since his trip into the forest. Neville thought Harry had a bad case of exam nerves because Harry couldn't sleep, but the truth was that Harry kept being woken by his old nightmare, except that it was now worse than ever because there was a hooded figure dripping blood in it.  Maybe it was because they hadn't seen what Harry had seen in the forest, or because they didn't have scars burning on their foreheads, but Ron and Hermione didn't seem as worried about the Stone as Harry. The idea of Voldemort certainly scared them, but he didn't keep visiting them in dreams, and they were so busy with their studying they didn't have much time to fret about what Snape or anyone else might be up to.  Their very last exam was History of Magic. One hour of answering questions about batty old wizards who'd invented selfstirring cauldrons and they'd be free, free for a whole wonderful week until their exam results came out. When the ghost of Professor Binns told them to put down their quills and roll up their parchment, Harry couldn't help cheering with the rest.  \"That was far easier than I thought it would be,\" said Hermione as they joined the crowds flocking out onto the sunny grounds. \"I needn't have learned about the 1637 Werewolf Code of Conduct or the uprising of Elfric the Eager.\"  Hermione always liked to go through their exam papers afterward, but Ron said this made him feel ill, so they wandered down to the lake and flopped under a tree. The Weasley twins and Lee Jordan were tickling the tentacles of a giant squid, which was basking in the warm shallows. \"No more studying,\" Ron sighed happily, stretching out on the grass. \"You could look more cheerful, Harry, we've got a week before we find out how badly we've done, there's no need to worry yet.\"  Harry was rubbing his forehead.  \"I wish I knew what this means!\" he burst out angrily. \"My scar keeps hurting -- it's happened before, but never as often as this.\"  \"Go to Madam Pomfrey,\" Hermione suggested.  \"I'm not ill,\" said Harry. \"I think it's a warning... it means danger's coming....\"  Ron couldn't get worked up, it was too hot.  \"Harry, relax, Hermione's right, the Stone's safe as long as Dumbledore's around. Anyway, we've never had any proof Snape found out how to get past Fluffy. He nearly had his leg ripped off once, he's not going to try it again in a hurry. And Neville will play Quidditch for England before Hagrid lets Dumbledore down."
}