{
  "id": "1f2a1edcc6c5dbf6dd5fe21b374e248115dc2a67",
  "text": " \"I happen to know that this map was confiscated by Mr. Filch many years ago. Yes, I know it' s a map,\" he said as Harry and Ron looked amazed. \"I don't want to know how it fell into your possession. I am, however, astounded that you didn't hand it in. Particularly after what happened the last time a student left information about the castle lying around. And I can't let you have it back, Harry.\"  Harry had expected that, and was too keen for explanations to protest.  \"Why did Snape think I'd got it from the manufacturers?\"  \"Because...,\" Lupin hesitated, \"because these mapmakers would have wanted to lure you out of school. They'd think it extremely entertaining.\"  \"Do you know them?\" said Harry, impressed.  \"We've met,\" he said shortly. He was looking at Harry more seriously than ever before.  \"Don't expect me to cover up for you again, Harry. I cannot make you take Sirius Black seriously. But I would have thought that what you have heard when the dementors draw near you would have had more of an effect on you. Your parents gave their lives to keep you alive, Harry. A poor way to repay them -- gambling their sacrifice for a bag of magic tricks.\"  He walked away, leaving Harry feeling worse by far than he had at any point in Snape's office. Slowly, he and Ron mounted the marble staircase. As Harry passed the one-eyed witch, he remembered the Invisibility Cloak -- it was still down there, but he didn't dare go and get it.  \"It's my fault,\" said Ron abruptly. \"I persuaded you to go. Lupin's right, it was stupid, we shouldn't've done it --\"  He broke off; they reached the corridor where the security trolls were pacing, and Hermione was walking toward them. One look at her face convinced Harry that she had heard what had happened. His heart plummeted -- had she told Professor McGonagall?  \"Come to have a good gloat?\" said Ron savagely as she stopped in front of them. \"Or have you just been to tell on us?\"  \"No,\" said Hermione. She was holding a letter in her hands and her lip was trembling. \"I just thought you ought to know... Hagrid lost his case. Buckbeak is going to be executed.\"  CHAPTER FIFTEEN  THE QUIDDITCH FINAL  He sent me this,\" Hermione said, holding out the letter.  Harry took it. The parchment was damp, and enormous teardrops had smudged the ink so badly in places that it was very difficult to read.  Dear Hermione, We lost. I'm allowed to bring him back to Hogwarts. Execution date to be fixed. Beaky has enjoyed London. I won't forget all the help you gave us.  Hagrid  \"They can't do this,\" said Harry. \"They can't. Buckbeak isn't dangerous.\"  \"Malfoy's dad's frightened the Committee into it,\" said Hermione, wiping her eyes. \"You know what he's like. They're a bunch of doddery old fools, and they were scared. There'll be an appeal, though, there always is. Only I can't see any hope.... Nothing will have changed.\"  \"Yeah, it will,\" said Ron fiercely. \"You won't have to do all the work alone this time, Hermione. I'll help.\"  \"Oh, Ron!\"  Hermione flung her arms around Ron's neck and broke down completely. Ron, looking quite terrified, patted her very awkwardly on the top of the head. Finally, Hermione drew away.  \"Ron, I'm really, really sorry about Scabbers...\" she sobbed.  \"Oh -- well -- he was old,\" said Ron, looking thoroughly relieved that she had let go of him. \"And he was a bit useless. You never know, Mum and Dad might get me an owl now.\"  The safety measures imposed on the students since Black's second break-in made it impossible for Harry, Ron, and Hermione to go and visit Hagrid in the evenings. Their only chance of talking to him was during Care of Magical Creatures lessons.  He seemed numb with shock at the verdict.  \"S'all my fault. Got all tongue-tied. They was all sittin' there in black robes an' I kep' droppin' me notes and forgettin' all them dates yeh looked up fer me, Hermione. An' then Lucius Malfoy stood up an' said his bit, and the Committee jus' did exac'ly what he told 'em....\"  \"There's still the appeal!\" said Ron fiercely. \"Don't give up Yet, we're working on it!\"  They were walking back up to the castle with the rest of the class. Ahead they could see Malfoy, who was walking with Crabbe and Goyle, and kept looking back, laughing derisively.  \"S'no good, Ron,\" said Hagrid sadly as they reached the castle steps. \"That Committee's in Lucius Malfoy's pocket. I'm jus' gonna make sure the rest o' Beaky's time is the happiest he's ever had. I owe him that....\"  Hagrid turned around and hurried back toward his cabin, his face buried in his handkerchief.  \"Look at him blubber!\"  Malfoy, Crabbe, and Goyle had been standing just inside the castle doors, listening.  \"Have you ever seen anything quite as pathetic?\" said Malfoy. \"And he's supposed to be our teacher!\"  Harry and Ron both made furious moves toward Malfoy, but Hermione got there first -- SMACK!  She had slapped Malfoy across the face with all the strength she could muster. Malfoy staggered. Harry, Ron, Crabbe, and Goyle stood flabbergasted as Hermione raised her hand again."
}