{
  "id": "20109e9b310745b838f0f5370d53e1d4c25aa3ad",
  "text": " When his bowels were empty, Tyrion slipped on a bedrobe and roughed his thin flaxen hair with his fingers, all the more to look as if he had wakened from sleep.  Lancel was pacing before the ashes of the hearth, garbed in slashed red velvet with black silk undersleeves, a jeweled dagger and a gilded scabbard hanging from his swordbelt.  Cousin,  Tyrion greeted him.  Your visits are too few. To what do I owe this undeserved pleasure?    Her Grace the Queen Regent has sent me to command you to release Grand Maester Pycelle.  Ser Lancel showed Tyrion a crimson ribbon, bearing Cersei’s lion seal impressed in golden wax.  Here is her warrant.    So it is.  Tyrion waved it away.  I hope my sister is not overtaxing her strength, so soon after her illness. it would be a great pity if she were to suffer a relapse.    Her Grace is quite recovered,  Ser Lancel said curtly.   Music to my ears.  Though not a tune I’m fond of. I should have given her a larger dose. Tyrion had hoped for a few more days without Cersei’s interference, but he was not too terribly surprised by her return to health. She was Jaime’s twin, after all. He made himself smile pleasantly.  Pod, build us a fire, the air is too chilly for my taste. Will you take a cup with me, Lancel? I find that mulled wine helps me sleep.    I need no help sleeping,  Ser Lancel said.  I am come at Her Grace’s behest, not to drink with you, Imp.   Knighthood had made the boy bolder, Tyrion reflected—that, and the sorry part he had played in murdering King Robert.  Wine does have its dangers.  He smiled as he poured.  As to Grand Maester Pycelle… if my sweet sister is so concerned for him, I would have thought she’d come herself. Instead she sends you. What am I to make of that?    Make of it what you will, so long as you release your prisoner. The Grand Maester is a staunch friend to the Queen Regent, and under her personal protection.  A hint of a sneer played about the lad’s lips; he was enjoying this. He takes his lessons from Cersei.  Her Grace will never consent to this outrage. She reminds you that she is Joffrey’s regent.    As I am Joffrey’s Hand.    The Hand serves,  the young knight informed him airily.  The regent rules until the king is of age.    Perhaps you ought write that down so I’ll remember it better.  The fire was crackling merrily.  You may leave us, Pod,  Tyrion told his squire. Only when the boy was gone did he turn back to Lancel.  There is more?    Yes. Her Grace bids me inform you that Ser Jacelyn Bywater defied a command issued in the king’s own name.   Which means that Cersei has already ordered Bywater to release Pycelle, and been rebuffed.  I see.    She insists that the man be removed from his office and placed under arrest for treason. I warn you—   He set aside his wine cup.  I’ll hear no warnings from you, boy.    Ser,  Lancel said stiffly. He touched his sword, perhaps to remind Tyrion that he wore one.  Have a care how you speak to me, Imp.  Doubtless he meant to sound threatening, but that absurd wisp of a mustache ruined the effect.   Oh, unhand your sword. One cry from me and Shagga will burst in and kill you. With an axe, not a wineskin.   Lancel reddened; was he such a fool as to believe his part in Robert’s death had gone unnoted?  I am a knight—    So I’ve noted. Tell me—did Cersei have you knighted before or after she took you into her bed?   The flicker in Lancel’s green eyes was all the admission Tyrion needed. So Varys told it true. Well, no one can ever claim that my sister does not love her family.  What, nothing to say? No more warnings for me, ser?    You will withdraw these filthy accusations or—    Please. Have you given any thought to what Joffrey will do when I tell him you murdered his father to bed his mother?    It was not like that!  Lancel protested, horrified.   No? What was it like, pray?    The queen gave me the strongwine! Your own father Lord Tywin, when I was named the king’s squire, he told me to obey her in everything.    Did he tell you to fuck her too?  Look at him. Not quite so tall, his features not so fine, and his hair is sand instead of spun gold, yet still… even a poor copy of Jaime is sweeter than an empty bed, I suppose.  No, I thought not.    I never meant… I only did as I was bid, I…    …hated every instant of it, is that what you would have me believe? A high place at court, knighthood, my sister’s legs opening for you at night, oh, yes, it must have been terrible for you.  Tyrion pushed himself to his feet.  Wait here. His Grace will want to hear this.   The defiance went from Lancel all at once. The young knight fell to his knees a frightened boy.  Mercy, my lord, I beg you.    Save it for Joffrey. He likes a good beg.    My lord, it was your sister’s bidding, the queen, as you said, but His Grace… he’d never understand…    Would you have me keep the truth from the king?    For my father’s sake! I’ll leave the city, it will be as if it never happened! I swear, I will end it…   It was hard not to laugh."
}