{
  "id": "212560897e638e267632da8837fc74bdcb5c7d6b",
  "text": "  I staged a loud conversation with Professor McGonagall about the hostages who had been taken, and whether Potter would think to use gillyweed.  And your little elf friend ran straight to Snape's office and then hurried to find you...\" Moodys wand was still pointing directly at Harry's heart.  Over his shoulder, foggy shapes were moving in the Foe-Glass on the wall. \"You were so long in that lake, Potter, I thought you had drowned.  But luckily, Dumbledore took your idiocy for nobility, and marked you high for it.  I breathed again. \"You had an easier time of it than you should have in that maze tonight, of course,\" said Moody.  \"I was patrolling around it, able to see through the outer hedges, able to curse many obstacles out of your way.  I Stunned Fleur Delacour as she passed.  I put the Imperius Curse on Krum, so that he would finish Diggory and leave your path to the cup clear.\" Harry stared at Moody.  He just didn't see how this could be. ... Dumbledore's friend, the famous Auror. . . the one who had caught so many Death Eaters ... It made no sense ... no sense at all. ... The foggy shapes in the Foe-Glass were sharpening, had become more distinct.  Harry could see the outlines of three people over Moody's shoulder, moving closer and closer.  But Moody wasn't watching them.  His magical eye was upon Harry. \"The Dark Lord didn't manage to kill you. Potter, and he so wanted to,\" whispered Moody.  \"Imagine how he will reward me when he finds I have done it for him.  I gave you to him - the thing he needed above all to regenerate - and then I killed you for him.  I will be honored beyond all other Death Eaters.  I will be his dearest, his closest supporter . . . closer than a son. ...\" Moody's normal eye was bulging, the magical eye fixed upon Harry.  The door was barred, and Harry knew he would never reach his own wand in time. . . . \"The Dark Lord and I,\" said Moody, and he looked completely insane now, towering over Harry, leering down at him, \"have much in common.  Both of us, for instance, had very disappointing fathers . . . very disappointing indeed.  Both of us suffered the indignity, Harry, of being named after those fathers.  And both of us had the pleasure . . . the very great pleasure ... of killing our fathers to ensure the continued rise of the Dark Order!\" \"You're mad,\" Harry said - he couldn't stop himself- \"you're mad!\" \"Mad, am I?\" said Moody, his voice rising uncontrollably.  \"We'll see!  We'll see who's mad, now that the Dark Lord has returned, with me at his side!  He is back, Harry Potter, you did not conquer him - and now - I conquer you!\" Moody raised his wand, he opened his mouth; Harry plunged his own hand into his robes - \"Stupefy!\"  There was a blinding flash of red light, and with a great splintering and crashing, the door of Moody's office was blasted apart - Moody was thrown backward onto the office floor.  Harry, still staring at the place where Moody's face had been, saw Albus Dumbledore, Professor Snape, and Professor McGonagall looking back at him out of the Foe-Glass.  He looked around and saw the three of them standing in the doorway, Dumbledore in front, his wand outstretched. At that moment, Harry fully understood for the first time why people said Dumbledore was the only wizard Voldemort had ever feared.  The look upon Dumbledore's face as he stared down at the unconscious form of Mad-Eye Moody was more terrible than Harry could have ever imagined.  There was no benign smile upon Dumbledore's face, no twinkle in the eyes behind the spectacles.  There was cold fury in every line of the ancient face; a sense of power radiated from Dumbledore as though he were giving off burning heat. He stepped into the office, placed a foot underneath Moodys unconscious body, and kicked him over onto his back, so that his face was visible.  Snape followed him, looking into the Foe-Glass, where his own face was still visible, glaring into the room.  Professor McGonagall went straight to Harry. \"Come along, Potter,\" she whispered.  The thin line of her mouth was twitching as though she was about to cry.  \"Come along . . . hospital wing ...\" \"No,\" said Dumbledore sharply. \"Dumbledore, he ought to - look at him - he's been through enough tonight -\" \"He will stay, Minerva, because he needs to understand,\" said Dumbledore curtly. \"Understanding is the first step to acceptance, and only with acceptance can there be recovery. He needs to know who has put him through the ordeal he has suffered tonight, and why,\" \"Moody,\" Harry said.  He was still in a state of complete disbelief.  \"How can it have been Moody?\" \"This is not Alastor Moody,\" said Dumbledore quietly.  \"You have never known Alastor Moody.  The real Moody would not have removed you from my sight after what happened tonight.  The moment he took you, I knew - and I followed.\" Dumbledore bent down over Moody's limp form and put a hand inside his robes.  He pulled out Moody's hip flask and a set of keys on a ring.  Then he turned to Professors McGonagall and Snape."
}