{
  "id": "2155aaa47a08f7ac34f5daa0c409fab5eb6df20c",
  "text": " And ever since that  day  the race  of N®menor has decayed,  and  the  span of  their  years  has  lessened.       'In the North after the war and the slaughter of the Gladden Fields the  Men  of Westernesse were diminished, and their city of Ann®minas beside  Lake  Evendim fell  into ruin; and  the heirs  of Valandil  removed and  dwelt  at  Fornost on the high North Downs, and  that now too is desolate. Men call  it   Deadmen's  Dike,  and  they  fear  to  tread there.  For the  folk of  Arnor    ####-dwindled, and their  foes devoured them, and their lordship passed,  leaving   only green mounds in the grassy hills.       'In  the South  the  realm of Gondor long endured; and for a while  its  splendour grew, recalling  somewhat of the might  of N®menor,  ere it  fell.  High towers  that people built, and strong places. and havens of many ships;   and the  winged crown of the Kings of  Men was  held in awe by folk of  many  tongues. Their chief city wa s  Osgiliath, Citadel of the Stars. through  the  midst of which  the River  flowed. And Minas Ithil they built, Tower  of the   Rising  Moon,  eastward  upon  a shoulder of the  Mountains  of  Shadow; and  westward at the feet of the White  Mountains Minas Anor they made, Tower  of  the Setting Sun. There in the courts of the King grew a white tree, from the  seed of that tree which Isildur  brought over the  deep waters, and the seed  of that tree before came from Eressla, and before that  out of the Uttermost   West in the Day before days when the world was young.       `But  in the  wearing of the  swift years  of Middle-earth the line  of  Meneldil son of Anbrion failed, and the  Tree withered, and the blood of the  N®menoreans became  mingled with that of lesser men. Then the watch upon  the  walls of  Mordor slept, and  dark  things crept back to  Gorgoroth. And on a   time evil things came  forth, and they took Minas Ithil and abode in it, and  they made it into a place of dread; and it is called Minas Morgul, the Tower   of Sorcery. Then Minas Anor was named anew Minas Tirith, the Tower of  Guard;  and these two cities  were ever at war, but Osgiliath  which lay between was  deserted and in its ruins shadows walked.       'So it has been  for many lives of men. But  the  Lords of Minas Tirith  still  fight on, defying our enemies, keeping the passage  of the River from  Argonath  to the  Sea.  And now that part of the tale that  I shall tell  is  drawn to its close. For in the days of Isildur the Ruling Ring passed out of  all knowledge, and the  Three  were  released from  its dominion. But now in  this latter day they  are  in peril once more, for to our sorrow the One has  been  found. Others shall speak of its finding,  for  in that I played small  part.'       He ceased, but  at once Boromir  stood up, tall and proud, before them.  Give  me leave, Master  Elrond, said  he, first  to  say more of Gondor; for   verily from the land of Gondor I  am come. And  it would  be well for all to  know what passes there. For few,  I deem, know of  our deeds, and  therefore   ####-guess little of their peril, if we should fail at last.       `Believe  not that in the land of Gondor the blood of N®menor is spent,  nor all its pride  and dignity forgotten. By our valour the wild folk of the  East are still restrained,  and the terror of Morgul  kept at bay; and  thus  alone are peace and freedom maintained in the lands behind  us,  bulwark  of  the West. But if the passages of the River should be won, what then?        `Yet  that hour, maybe, is not now far away.  The  Nameless  Enemy  has  arisen again.  Smoke  rises once more from Orodruin that we call Mount  Doom.  The power  of the Black  Land  grows and we are  hard beset. When the   Enemy  returned  our folk were driven from  Ithilien, our fair  domain east of  the  River, though we kept a  foothold there and  strength of arms. But this very  year,  in  the days of  June, sudden war came  upon us out of Mordor, and we  were swept away. We were  outnumbered, for Mordor has allied itself with the  Easterlings  and the cruel Haradrim; but it was not by numbers that we  were  defeated. A power was there that we have not felt before.       `Some said  that it could be seen, like a great  black horseman, a dark  shadow under the moon. Wherever he came a  madness filled our foes,  but fear  fell on our boldest, so that horse and man gave way and fled. Only a remnant  of our eastern force came back, destroying the last bridge that still  stood  amid the ruins of Osgiliath.       'I was in  the company  that  held the  bridge, until it was cast  down  behind us. Four  only were saved by swimming: my brother and myself and   two  others. But still we  fight on, holding all  the  west shores of Anduin; and   those who shelter behind us give us praise, if ever they hear our name: much   praise but little help. Only from Rohan  now will any men ride to us when we  call.       `In this evil hour I have come on an errand over many dangerous leagues  to Elrond: a hundred and ten days I have journeyed all alone."
}