{
  "id": "215a95bfc34a35844fe8ba3a0eb06e28216254e7",
  "text": " If yeh think yer father'd rather you were expelled, then get back off ter the castle an' pack. Go on\"'  Malfoy didn't move. He looked at Hagrid furiously, but then dropped his gaze.  \"Right then,\" said Hagrid, \"now, listen carefully, 'cause it's dangerous what we're gonna do tonight, an' I don' want no one takin' risks. Follow me over here a moment.\"  He led them to the very edge of the forest. Holding his lamp up high, he pointed down a narrow, winding earth track that disappeared into the thick black trees. A light breeze lifted their hair as they looked into the forest.  \"Look there,\" said Hagrid, \"see that stuff shinin' on the ground? Silvery stuff? That's unicorn blood. There's a unicorn in there bin hurt badly by summat. This is the second time in a week. I found one dead last Wednesday. We're gonna try an' find the poor thing. We might have ter put it out of its misery.\"  \"And what if whatever hurt the unicorn finds us first?\" said Malfoy, unable to keep the fear out of his voice.  \"There's nothin' that lives in the forest that'll hurt yeh if yer with me or Fang,\" said Hagrid. \"An' keep ter the path. Right, now, we're gonna split inter two parties an' follow the trail in diff'rent directions. There's blood all over the place, it must've bin staggerin' around since last night at least.\"  \"I want Fang,\" said Malfoy quickly, looking at Fang's long teeth.  \"All right, but I warn yeh, he's a coward,\" said Hagrid. \" So me, Harry, an' Hermione'll go one way an' Draco, Neville, an' Fang'll go the other. Now, if any of us finds the unicorn, we'll send up green sparks, right? Get yer wands out an' practice now -- that's it -- an' if anyone gets in trouble, send up red sparks, an' we'll all come an' find yeh -- so, be careful -- let's go.\"  The forest was black and silent. A little way into it they reached a fork in the earth path, and Harry, Hermione, and Hagrid took the left path while Malfoy, Neville, and Fang took the right.  They walked in silence, their eyes on the ground. Every now and then a ray of moonlight through the branches above lit a spot of silver-blue blood on the fallen leaves.  Harry saw that Hagrid looked very worried.  \"Could a werewolf be killing the unicorns?\" Harry asked.  \"Not fast enough,\" said Hagrid. \"It's not easy ter catch a unicorn, they're powerful magic creatures. I never knew one ter be hurt before.\"  They walked past a mossy tree stump. Harry could hear running water; there must be a stream somewhere close by. There were still spots of unicorn blood here and there along the winding path.  \"You all right, Hermione?\" Hagrid whispered. \"Don' worry, it can't've gone far if it's this badly hurt, an' then we'll be able ter -- GET BEHIND THAT TREE!\"  Hagrid seized Harry and Hermione and hoisted them off the path behind a towering oak. He pulled out an arrow and fitted it into his crossbow, raising it, ready to fire. The three of them listened. Something was slithering over dead leaves nearby: it sounded like a cloak trailing along the ground. Hagrid was squinting up the dark path, but after a few seconds, the sound faded away.  \"I knew it, \" he murmured. \"There's summat in here that shouldn' be.\"  \"A werewolf?\" Harry suggested.  \"That wasn' no werewolf an' it wasn' no unicorn, neither,\" said Hagrid grimly. \"Right, follow me, but careful, now.\"  They walked more slowly, ears straining for the faintest sound. Suddenly, in a clearing ahead, something definitely moved.  \"Who's there?\" Hagrid called. \"Show yerself -- I'm armed!\"  And into the clearing came -- was it a man, or a horse? To the waist, a man, with red hair and beard, but below that was a horse's gleaming chestnut body with a long, reddish tail. Harry and Hermione's jaws dropped.  \"Oh, it's you, Ronan,\" said Hagrid in relief. \"How are yeh?\"  He walked forward and shook the centaur's hand.  \"Good evening to you, Hagrid,\" said Ronan. He had a deep, sorrowful voice. \"Were you going to shoot me?\"  \"Can't be too careful, Ronan,\" said Hagrid, patting his crossbow. \"There's summat bad loose in this forest. This is Harry Potter an' Hermione Granger, by the way. Students up at the school. An' this is Ronan, you two. He's a centaur.))  \"We'd noticed,\" said Hermione faintly.  \"Good evening,\" said Ronan. \"Students, are you? And do you learn much, up at the school?\"  \"Erm --\"  \"A bit,\" said Hermione timidly.  \"A bit. Well, that's something.\" Ronan sighed. He flung back his head and stared at the sky. \"Mars is bright tonight.\"  \"Yeah,\" said Hagrid, glancing up, too. \"Listen, I'm glad we've run inter yeh, Ronan, 'cause there's a unicorn bin hurt -- you seen anythin'?\"  Ronan didn't answer immediately. He stared unblinkingly upward, then sighed again.  \"Always the innocent are the first victims,\" he said. \"So it has been for ages past, so it is now.\"  \"Yeah,\" said Hagrid, \"but have yeh seen anythin', Ronan? Anythin' unusual?\"  \"Mars is bright tonight,\" Ronan repeated, while Hagrid watched him impatiently. \"Unusually bright.\"  \"Yeah, but I was meanin' anythin' unusual a bit nearer home, said Hagrid."
}