{
  "id": "2188cf764cb0149e511ffaf202bde6ff29b9e764",
  "text": "  Hermione looked around at Harry.  \"Won't it be nice to get out of school for a bit and explore Hogsmeade?\"  \"'Spect it will,\" said Harry heavily. \"You'll have to tell me when You've found out.\"  \"What d'you mean?\" said Ron.  \"I can't go. The Dursleys didn't sign my permission form, and Fudge wouldn't either.\"  Ron looked horrified.  \"\"You're not allowed to come? But -- no way -- McGonagall or someone will give you permission -- \" musclely; Crabbe was taller, with a pudding-bowl haircut and a very thick neck; Goyle had short, bristly hair and long, gorilla-ish arms.  \"Well, look who it is,\" said Malfoy in his usual lazy drawl, pulling open the compartment door. \"Potty and the Weasel.\"  Crabbe and Goyle chuckled trollishly.  \"I heard your father finally got his hands on some gold this summer, Weasley,\" said Malfoy. \"Did your mother die of shock?\"  Ron stood up so quickly he knocked Crookshanks's basket to the floor. Professor Lupin gave a snort.  \"Who's that?\" said Malfoy, taking an automatic step backward as he spotted Lupin.  \"New teacher,\" said Harry, who got to his feet, too, in case he needed to hold Ron back. \"What were you saying, Malfoy?\"  Malfoy's pale eyes narrowed; he wasn't fool enough to pick a fight right under a teacher's nose.  \"C'mon,\" he muttered resentfully to Crabbe and Goyle, and they disappeared.  Harry and Ron sat down again, Ron massaging his knuckles.  \"I'm not going to take any crap from Malfoy this year,\" he said angrily. \"I mean it. If he makes one more crack about my family, I'm going to get hold of his head and --\"  Ron made a violent gesture in midair.  \"Ron,\" hissed Hermione, pointing at Professor Lupin, \"be careful...\"  But Professor Lupin was still fast asleep.  The rain thickened as the train sped yet farther north; the windows were now a solid, shimmering gray, which graduily darkened until lanterns flickered into life all along the corridors and over the luggage racks. The train rattled, the rain hammered, the ind roared, but still, Professor Lupin slept.  \"We must be nearly there,\" said Ron, leaning forward to look past Professor Lupin at the now completely black window.  The words had hardly left him when the train started to slow down.  \"Great,\" said Ron, getting up and walking carefully past Professor Lupin to try and see outside. \"I'm starving. I want to get to the feast....  \"We can't be there yet,\" said Hermione, checking her watch.  \"So why're we stopping?\"  The train was getting slower and slower. As the noise of the pistons fell away, the wind and rain sounded louder than ever against the windows.  Harry, who was nearest the door, got up to look into the corridor. All along the carriage, heads were sticking curiously out of their compartments.  The train came to a stop with a jolt, and distant thuds and bangs told them that luggage had fallen out of the racks. Then, without warning, all the lamps went out and they were plunged into total darkness.  \"'What's going on?\" said Ron's voice from behind Harry.  \"Ouch!\" gasped Hermione. \"Ron, that was my foot!\"  Harry felt his way back to his seat.  \"D'you think we've broken down?\"  \"Dunno...\"  There was a squeaking sound, and Harry saw the dim black outline of Ron, wiping a patch clean on the window and peering out.  \"There's something moving out there,\" Ron said. \"I think people are coming aboard....\"  The compartment door suddenly opened and someone fell painfully over Harry's legs.  \"Sorry -- d'you know what's going on? -- Ouch -- sorry  \"Hullo, Neville,\" said Harry, feeling around in the dark and pulling Neville up by his cloak.  \"Harry? Is that you? What's happening?\"  \"No idea -- sit down --\"  There was a loud hissing and a yelp of pain; Neville had tried to sit on Crookshanks.  \"I'm going to go and ask the driver what's going on,\" came Hermione's voice. Harry felt her pass him, heard the door slide open again, and then a thud and two loud squeals of pain.  \"Who's that?\"  \"Who's that?\"  \"Ginny?\"  \"Hermione?\"  \"What are you doing?\"  \"I was looking for Ron --\" \"Come in and sit down --\"  \"Not here!\" said Harry hurriedly. \"I'm here!\"  \"Ouch!\" said Neville.  \"Quiet!\" said a hoarse voice suddenly.  Professor Lupin appeared to have woken up at last. Harry could hear movements in his corner.  None of them spoke.  There was a soft, crackling noise, and a shivering light filled the compartment. Professor Lupin appeared to be holding a handful of flames. They illuminated his tired, gray face, but his eyes looked alert and wary.  \"Stay where you are,\" he said in the same hoarse voice, and he got slowly to his feet with his handful of fire held out in front of him.  But the door slid slowly open before Lupin could reach it.  Standing in the doorway, illuminated by the shivering flames in Lupin's hand, was a cloaked figure that towered to the ceiling. Its face was completely hidden beneath its hood. Harry's eyes darted downward, and what he saw made his stomach contract. There was a hand protruding from the cloak and it was glistening, grayish, slimy-looking, and scabbed, like something dead that had decayed in water."
}