{
  "id": "2362991bcfdd2e0192f5f1ecd3e3f23b5dac8ac3",
  "text": " Most of them were smallfolk: crofters, fieldhands, fishermen, sheepherders, the sons of innkeeps and traders and tanners, leavened with a smattering of sellswords and freeriders hungry for plunder. When their lords called, they came… but not forever.  Marching is all very well,  she said to her son,  but where, and to what purpose? What do you mean to do?   Robb hesitated.  The Greatjon thinks we should take the battle to Lord Tywin and surprise him,  he said,  but the Glovers and the Karstarks feel we’d be wiser to go around his army and join up with Uncle Ser Edmure against the Kingslayer.  He ran his fingers through his shaggy mane of auburn hair, looking unhappy.  Though by the time we reach Riverrun… I’m not certain…    Be certain,  Catelyn told her son,  or go home and take up that wooden sword again. You cannot afford to seem indecisive in front of men like Roose Bolton and Rickard Karstark. Make no mistake, Robb—these are your bannermen, not your friends. You named yourself battle commander. Command.   Her son looked at her, startled, as if he could not credit what he was hearing.  As you say, Mother.    I’ll ask you again. What do you mean to do?   Robb drew a map across the table, a ragged piece of old leather covered with lines of faded paint. One end curled up from being rolled; he weighed it down with his dagger.  Both plans have virtues, but… look, if we try to swing around Lord Tywin’s host, we take the risk of being caught between him and the Kingslayer, and if we attack him… by all reports, he has more men than I do, and a lot more armored horse. The Greatjon says that won’t matter if we catch him with his breeches down, but it seems to me that a man who has fought as many battles as Tywin Lannister won’t be so easily surprised.    Good,  she said. She could hear echoes of Ned in his voice, as he sat there, puzzling over the map.  Tell me more.    I’d leave a small force here to hold Moat Cailin, archers mostly, and march the rest down the causeway,  he said,  but once we’re below the Neck, I’d split our host in two. The foot can continue down the kingsroad, while our horsemen cross the Green Fork at the Twins.  He pointed.  When Lord Tywin gets word that we’ve come south, he’ll march north to engage our main host, leaving our riders free to hurry down the west bank to Riverrun.  Robb sat back, not quite daring to smile, but pleased with himself and hungry for her praise.  Catelyn frowned down at the map.  You’d put a river between the two parts of your army.    And between Jaime and Lord Tywin,  he said eagerly. The smile came at last.  There’s no crossing on the Green Fork above the ruby ford, where Robert won his crown. Not until the Twins, all the way up here, and Lord Frey controls that bridge. He’s your father’s bannerman, isn’t that so?   The Late Lord Frey, Catelyn thought.  He is,  she admitted,  but my father has never trusted him. Nor should you.    I won’t,  Robb promised.  What do you think?   She was impressed despite herself. He looks like a Tully, she thought, yet he’s still his father’s son, and Ned taught him well.  Which force would you command?    The horse,  he answered at once. Again like his father; Ned would always take the more dangerous task himself.   And the other?    The Greatjon is always saying that we should smash Lord Tywin. I thought I’d give him the honor.   It was his first misstep, but how to make him see it without wounding his fledgling confidence?  Your father once told me that the Greatjon was as fearless as any man he had ever known.   Robb grinned.  Grey Wind ate two of his fingers, and he laughed about it. So you agree, then?    Your father is not fearless,  Catelyn pointed out.  He is brave, but that is very different.   Her son considered that for a moment.  The eastern host will be all that stands between Lord Tywin and Winterfell,  he said thoughtfully.  Well, them and whatever few bowmen I leave here at the Moat. So I don’t want someone fearless, do I?    No. You want cold cunning, I should think, not courage.    Roose Bolton,  Robb said at once.  That man scares me.    Then let us pray he will scare Tywin Lannister as well.   Robb nodded and rolled up the map.  I’ll give the commands, and assemble an escort to take you home to Winterfell.   Catelyn had fought to keep herself strong, for Ned’s sake and for this stubborn brave son of theirs. She had put despair and fear aside, as if they were garments she did not choose to wear… but now she saw that she had donned them after all.   I am not going to Winterfell,  she heard herself say, surprised at the sudden rush of tears that blurred her vision.  My father may be dying behind the walls of Riverrun. My brother is surrounded by foes. I must go to them.       TYRION  Chella daughter of Cheyk of the Black Ears had gone ahead to scout, and it was she who brought back word of the army at the crossroads.  By their fires I call them twenty thousand strong,  she said.  Their banners are red, with a golden lion."
}