{
  "id": "23972e56ac2d75412fbafc88e7642deda7f938e5",
  "text": "    It has always been so. I am not… I am not a cruel man, Ser Davos. You know me. Have known me long. This is not my decree. It has always been so, since Aegon’s day and before. Daemon Blackfyre, the brothers Toyne, the Vulture King, Grand Maester Hareth… traitors have always paid with their lives… even Rhaenyra Targaryen. She was daughter to one king and mother to two more, yet she died a traitor’s death for trying to usurp her brother’s crown. It is law. Law, Davos. Not cruelty.    Yes, Your Grace.  He does not speak of me. Davos felt a moment’s pity for his cellmate down in the dark. He knew he should keep silent, but he was tired and sick of heart, and he heard himself say,  Sire, Lord Florent meant no treason.    Do smugglers have another name for it? I made him Hand, and he would have sold my rights for a bowl of pease porridge. He would even have given them Shireen. Mine only child, he would have wed to a bastard born of incest.  The king’s voice was thick with anger.  My brother had a gift for inspiring loyalty. Even in his foes. At Summerhall he won three battles in a single day, and brought Lords Grandison and Cafferen back to Storm’s End as prisoners. He hung their banners in the hall as trophies. Cafferen’s white fawns were spotted with blood and Grandison’s sleeping lion was torn near in two. Yet they would sit beneath those banners of a night, drinking and feasting with Robert. He even took them hunting. ‘These men meant to deliver you to Aerys to be burned’ I told him after I saw them throwing axes in the yard. ‘You should not be putting axes in their hands.’ Robert only laughed. I would have thrown Grandison and Cafferen into a dungeon, but he turned them into friends. Lord Cafferen died at Ashford Castle, cut down by Randyll Tarly whilst fighting for Robert. Lord Grandison was wounded on the Trident and died of it a year after. My brother made them love him, but it would seem that I inspire only betrayal. Even in mine own blood and kin. Brother, grandfather, cousins, good uncle…    Your Grace,  said Ser Axell,  I beg you, give me the chance to prove to you that not all Florents are so feeble.    Ser Axell would have me resume the war,  King Stannis told Davos.  The Lannisters think I am done and beaten, and my sworn lords have forsaken me, near every one. Even Lord Estermont, my own mother’s father, has bent his knee to Joffrey. The few loyal men who remain to me are losing heart. They waste their days drinking and gambling, and lick their wounds like beaten curs.    Battle will set their hearts ablaze once more, Your Grace,  Ser Axell said.  Defeat is a disease, and victory is the cure.    Victory.  The king’s mouth twisted.  There are victories and victories, ser. But tell your plan to Ser Davos. I would hear his views on what you propose.   Ser Axell turned to Davos, with a look on his face much like the look that proud Lord Belgrave must have worn, the day King Baelor the Blessed had commanded him to wash the beggar’s ulcerous feet. Nonetheless, he obeyed.  The plan Ser Axell had devised with Salladhor Saan was simple. A few hours’ sail from Dragonstone lay Claw Isle, ancient sea-girt seat of House Celtigar. Lord Ardrian Celtigar had fought beneath the flery heart on the Blackwater, but once taken, he had wasted no time in going over to Joffrey. He remained in King’s Landing even now.  Too frightened of His Grace’s wrath to come near Dragonstone, no doubt,  Ser Axell declared.  And wisely so. The man has betrayed his rightful king.   Ser Axell proposed to use Salladhor Saan’s fleet and the men who had escaped the Blackwater—Stannis still had some fifteen hundred on Dragonstone, more than half of them Florents—to exact retribution for Lord Celtigar’s defection. Claw Isle was but lightly garrisoned, its castle reputedly stuffed with Myrish carpets, Volantene glass, gold and silver plate, jeweled cups, magnificent hawks, an axe of Valyrian steel, a horn that could summon monsters from the deep, chests of rubies, and more wines than a man could drink in a hundred years. Though Celtigar had shown the world a niggardly face, he had never stinted on his own comforts.  Put his castle to the torch and his people to the sword, I say,  Ser Axell concluded.  Leave Claw Isle a desolation of ash and bone, fit only for carrion crows, so the realm might see the fate of those who bed with Lannisters.   Stannis listened to Ser Axell’s recitation in silence, grinding his jaw slowly from side to side. When it was done, he said,  It could be done, I believe. The risk is small. Joffrey has no strength at sea until Lord Redwyne sets sail from the Arbor. The plunder might serve to keep that Lysene pirate Salladhor Saan loyal for a time. By itself Claw Isle is worthless, but its fall would serve notice to Lord Tywin that my cause is not yet done.  The king turned back to Davos.  Speak truly, ser. What do you make of Ser Axell’s proposal?   Speak truly, ser. Davos remembered the dark cell he had shared with Lord Alester, remembered Lamprey and Porridge."
}