{
  "id": "24d47ac4d66af2e5b7109fa43192cd7034025059",
  "text": " He filled another spoon, brought it to Bannen’s mouth, and tried to ease it between his lips.   Food and fire,  Giant was saying,  that was all we asked of you. And you grudge us the food.    Be glad I didn’t grudge you fire too.  Craster was a thick man made thicker by the ragged smelly sheepskins he wore day and night. He had a broad flat nose, a mouth that drooped to one side, and a missing ear. And though his matted hair and tangled beard might be grey going white, his hard knuckly hands still looked strong enough to hurt.  I fed you what I could, but you crows are always hungry. I’m a godly man, else I would have chased you off. You think I need the likes of him, dying on my floor? You think I need all your mouths, little man?  The wildling spat.  Crows. When did a black bird ever bring good to a man’s hall, I ask you? Never. Never.   More broth ran from the corner of Bannen’s mouth. Sam dabbed it away with a corner of his sleeve. The ranger’s eyes were open but unseeing.  I’m cold,  he said again, so faintly. A maester might have known how to save him, but they had no maester. Kedge Whiteye had taken Bannen’s mangled foot off nine days past, in a gout of pus and blood that made Sam sick, but it was too little, too late.  I’m so cold,  the pale lips repeated.  About the hall, a ragged score of black brothers squatted on the floor or sat on rough-hewn benches, drinking cups of the same thin onion broth and gnawing on chunks of hardbread. A couple were wounded worse than Bannen, to look at them. Fornio had been delirious for days, and Ser Byam’s shoulder was oozing a foul yellow pus. When they’d left Castle Black, Brown Bernarr had been carrying bags of Myrish fire, mustard salve, ground garlic, tansy, poppy, kingscopper, and other healing herbs. Even sweetsleep, which gave the gift of painless death. But Brown Bernarr had died on the Fist and no one had thought to search for Maester Aemon’s medicines. Hake had known some herblore as well, being a cook, but Hake was also lost. So it was left to the surviving stewards to do what they could for the wounded, which was little enough. At least they are dry here, with a fire to warm them. They need more food, though.  They all needed more food. The men had been grumbling for days. Clubfoot Karl kept saying how Craster had to have a hidden larder, and Garth of Oldtown had begun to echo him, when he was out of the Lord Commander’s hearing. Sam had thought of begging for something more nourishing for the wounded men at least, but he did not have the courage. Craster’s eyes were cold and mean, and whenever the wildling looked his way his hands twitched a little, as if they wanted to curl up into fists. Does he know I spoke to Gilly, the last time we were here? he wondered. Did she tell him I said we’d take her? Did he beat it out of her?   I’m cold,  said Bannen.  Please. I’m cold.   For all the heat and smoke in Craster’s hall, Sam felt cold himself. And tired, so tired. He needed sleep, but whenever he closed his eyes he dreamed of blowing snow and dead men shambling toward him with black hands and bright blue eyes.  Up in the loft, Gilly let out a shuddering sob that echoed down the long low windowless hall.  Push,  he heard one of Craster’s older wives tell her.  Harder. Harder. Scream if it helps.  She did, so loud it made Sam wince.  Craster turned his head to glare.  I’ve had a bellyful o’ that shrieking,  he shouted up.  Give her a rag to bite down on, or I’ll come up there and give her a taste o’ my hand.   He would too, Sam knew. Craster had nineteen wives, but none who’d dare interfere once he started up that ladder. No more than the black brothers had two nights past, when he was beating one of the younger girls. There had been mutterings, to be sure.  He’s killing her,  Garth of Greenaway had said, and Clubfoot Karl laughed and said,  If he don’t want the little sweetmeat he could give her to me.  Black Bernarr cursed in a low angry voice, and Alan of Rosby got up and went outside so he wouldn’t have to hear.  His roof, his rule,  the ranger Ronnel Harclay had reminded them.  Craster’s a friend to the Watch.   A friend, thought Sam, as he listened to Gilly’s muffled shrieks. Craster was a brutal man who ruled his wives and daughters with an iron hand, but his keep was a refuge all the same.  Frozen crows,  Craster sneered when they straggled in, those few who had survived the snow, the wights, and the bitter cold.  And not so big a flock as went north, neither.  Yet he had given them space on his floor, a roof to keep the snow off, a fire to dry them out, and his wives had brought them cups of hot wine to put some warmth in their bellies.  Bloody crows,  he called them, but he’d fed them too, meager though the fare might be.  We are guests, Sam reminded himself. Gilly is his. His daughter, his wife. His roof, his rule.  The first time he’d seen Craster’s Keep, Gilly had come begging for help, and Sam had lent her his black cloak to conceal her belly when she went to find Jon Snow."
}