{
  "id": "24d656ab90dff0d0bebf2976e140856ddd187725",
  "text": " Bran watched long enough to be polite, and then had Hodor summoned. He was hot and tired, flushed from the wine, and the dancing made him sad. it was something else he could never do.  I want to go.    Hodor,  Hodor shouted back, kneeling. Maester Luwin and Hayhead lifted him into his basket. The folk of Winterfell had seen this sight half a hundred times, but doubtless it looked queer to the guests, some of whom were more curious than polite. Bran felt the stares.  They went out the rear rather than walk the length of the hall, Bran ducking his head as they passed through the lord’s door. In the dim-lit gallery outside the Great Hall, they came upon Joseth the master of horse engaged in a different sort of riding. He had some woman Bran did not know shoved up against the wall, her skirts around her waist. She was giggling until Hodor stopped to watch. Then she screamed.  Leave them be, Hodor,  Bran had to tell him.  Take me to my bedchamber.   Hodor carried him up the winding steps to his tower and knelt beside one of the iron bars that Mikken had driven into the wall. Bran used the bars to move himself to the bed, and Hodor pulled off his boots and breeches.  You can go back to the feast now, but don’t go bothering Joseth and that woman,  Bran said.   Hodor,  Hodor replied, bobbing his head.  When he blew out his bedside candle, darkness covered him like a soft, familiar blanket. The faint sound of music drifted through his shuttered window.  Something his father had told him once when he was little came back to him suddenly. He had asked Lord Eddard if the Kingsguard were truly the finest knights in the Seven Kingdoms.  No longer,  he answered,  but once they were a marvel, a shining lesson to the world.    Was there one who was best of all?    The finest knight I ever saw was Ser Arthur Dayne, who fought with a blade called Dawn, forged from the heart of a fallen star. They called him the Sword of the Morning, and he would have killed me but for Howland Reed.  Father had gotten sad then, and he would say no more. Bran wished he had asked him what he meant.  He went to sleep with his head full of knights in gleaming armor, fighting with swords that shone like starfire, but when the dream came he was in the godswood again. The smells from the kitchen and the Great Hall were so strong that it was almost as if he had never left the feast. He prowled beneath the trees, his brother close behind him. This night was wildly alive, full of the howling of the man-pack at their play. The sounds made him restless. He wanted to run, to hunt, he wanted to—  The rattle of iron made his ears prick up. His brother heard it too. They raced through the undergrowth toward the sound. Bounding across the still water at the foot of the old white one, he caught the scent of a stranger, the man-smell well mixed with leather and earth and iron.  The intruders had pushed a few yards into the wood when he came upon them; a female and a young male, with no taint of fear to them, even when he showed them the white of his teeth. His brother growled low in his throat, yet still they did not run.   Here they come,  the female said. Meera, some part of him whispered, some wisp of the sleeping boy lost in the wolf dream.  Did you know they would be so big?    They will be bigger still before they are grown,  the young male said, watching them with eyes large, green, and unafraid.  The black one is full of fear and rage, but the grey is strong… stronger than he knows… can you feel him, sister?    No,  she said, moving a hand to the hilt of the long brown knife she wore.  Go careful, Joien.    He won’t hurt me. This is not the day I die.  The male walked toward them, unafraid, and reached out for his muzzle, a touch as light as a summer breeze. Yet at the brush of those fingers the wood dissolved and the very ground turned to smoke beneath his feet and swirled away laughing, and then he was spinning and falling, falling, falling…      CATELYN  As she slept amidst the rolling grasslands, Catelyn dreamt that Bran was whole again, that Arya and Sansa held hands, that Rickon was still a babe at her breast. Robb, crownless, played with a wooden sword, and when all were safe asleep, she found Ned in her bed, smiling.  Sweet it was, sweet and gone too soon. Dawn came cruel, a dagger of light. She woke aching and alone and weary; weary of riding, weary of hurting, weary of duty. I want to weep, she thought. I want to be comforted. I’m so tired of being strong. I want to be foolish and frightened for once. Just for a small while, that’s all… a day… an hour…  Outside her tent, men were stirring. She heard the whicker of horses, Shadd complaining of stiffness in his back, Ser Wendel calling for his bow. Catelyn wished they would all go away. They were good men, loyal, yet she was tired of them all. It was her children she yearned after. One day, she promised herself as she lay abed, one day she would allow herself to be less than strong.  But not today."
}