{
  "id": "24dddde1111c40fb706d5c0bcae2843a3b63651f",
  "text": "   Harry got to his feet, trod on the hem of his robes, and stumbled slightly.  He set off up the gap between the Gryffindor and Hufflepuff tables.  It felt like an immensely long walk; the top table didn't seem to be getting any nearer at all, and he could feel hundreds and hundreds of eyes upon him, as though each were a searchlight.  The buzzing grew louder and louder.  After what seemed like an hour, he was right in front of Dumbledore, feeling the stares of all the teachers upon him.   \"Well.. . through the door, Harry,\" said Dumbledore. He wasn't smiling.   Harry moved off along the teachers' table.  Hagrid was seated right at the end.  He did not wink at Harry, or wave, or give any of his usual signs of greeting.  He looked completely astonished and stared at Harry as he passed like everyone else.  Harry went through the door out of the Great Hall and found himself in a smaller room, lined with paintings of witches and wizards.  A handsome fire was roaring in the fireplace opposite him.   The faces in the portraits turned to look at him as he entered.  He saw a wizened witch flit out of the frame of her picture and into the one next to it, which contained a wizard with a walrus mustache.  The wizened witch started whispering in his ear. Viktor Krum, Cedric Diggory, and Fleur Delacour were grouped around the fire.  They looked strangely impressive, silhouetted against the flames. Krum, hunched-up and brooding, was leaning against the mantelpiece, slightly apart from the other two.  Cedric was standing with his hands behind his back, staring into the fire.  Fleur Delacour looked around when Harry walked in and threw back her sheet of long, silvery hair. \"What is it?\"  she said.  \"Do zey want us back in ze Hall?\" She thought he had come to deliver a message.  Harry didn't know how to explain what had just happened.  He just stood there, looking at the three champions.  It struck him how very tall all of them were. There was a sound of scurrying feet behind him, and Ludo Bagman entered the room. He took Harry by the arm and led him forward. \"Extraordinary!\"  he muttered, squeezing Harry's arm.  \"Absolutely extraordinary! Gentlemen. . . lady,\" he added, approaching the fireside and addressing the other three.  \"May I introduce - incredible though it may seem - the fourth Triwizard champion?\" Viktor Krum straightened up.  His surly face darkened as he surveyed Harry.  Cedric looked nonplussed.  He looked from Bagman to Harry and back again as though sure he must have misheard what Bagman had said.  Fleur Delacour, however, tossed her hair, smiling, and said, \"Oh, vairy funny joke, Meester Bagman.\" \"Joke?\" Bagman repeated, bewildered.  \"No, no, not at all!  Harry's name just came out of the Goblet of Fire!\" Krum's thick eyebrows contracted slightly.  Cedric was still looking politely bewildered. Fleur frowned. \"But evidently zair 'as been a mistake,\" she said contemptuously to Bagman.  \"E cannot compete. 'E is too young.\" \"Well. . . it is amazing,\" said Bagman, rubbing his smooth chin and smiling down at Harry.  \"But, as you know, the age restriction was only imposed this year as an extra safety measure.  And as his name's come out of the goblet.. . I mean, I don't think there can be any ducking out at this stage. . . . It's down in the rules, you're obliged. . . Harry will just have to do the best he --\" The door behind them opened again, and a large group of people came in: Professor Dumbledore, followed closely by Mr. Crouch, Professor Karkaroff, Madame Maxime, Professor McGonagall, and Professor Snape. Harry heard the buzzing of the hundreds of students on the other side of the wall, before Professor McGonagall closed the door. \"Madame Maxime!\"  said Fleur at once, striding over to her headmistress.  \"Zey are saying zat zis little boy is to compete also!\" Somewhere under Harry's numb disbelief he felt a ripple of anger.  Little boy? Madame Maxime had drawn herself up to her full, and considerable, height.  The top of her handsome head brushed the candle-filled chandelier, and her gigantic black-satin bosom swelled. \"What is ze meaning of zis, Dumbly-dorr?\"  she said imperiously.  \"I'd rather like to know that myself, Dumbledore,\" said Professor Karkaroff.  He was wearing a steely smile, and his blue eyes were like chips of ice.  \"Two Hogwarts champions?  I don't remember anyone telling me the host school is allowed two champions - or have I not read the rules carefully enough?\" He gave a short and nasty laugh. \"C'est impossible,\" said Madame Maxime, whose enormous hand with its many superb opals was resting upon Fleur's shoulder.  \"Ogwarts cannot 'ave two champions.  It is most injust.\" \"We were under the impression that your Age Line would keep out younger contestants, Dumbledore,\" said Karkaroff, his steely smile still in place, though his eyes were colder than ever.  \"Otherwise, we would, of course, have brought along a wider selection of candidates from our own schools.\" \"It's no one's fault but Potter's, Karkaroff,\" said Snape softly."
}