{
  "id": "26399d0a618081070fa4422c06d800e79fba8370",
  "text": " Perhaps Ser Boros will prove braver in future. He will no doubt remain very loyal.    To my father,  said Tyrion pointedly.   While we are on the subject of the Kingsguard… I wonder, could this delightfully unexpected visit of yours happen to concern Ser Boros’s fallen brother, the gallant Ser Mandon Moore?  The eunuch stroked a powdered cheek.  Your man Bronn seems most interested in him of late.   Bronn had turned up all he could on Ser Mandon, but no doubt Varys knew a deal more… should he choose to share it.  The man seems to have been quite friendless,  Tyrion said carefully.   Sadly,  said Varys,  oh, sadly. You might find some kin if you turned over enough stones back in the Vale, but here… Lord Arryn brought him to King’s Landing and Robert gave him his white cloak, but neither loved him much, I fear. Nor was he the sort the smallfolk cheer in tourneys, despite his undoubted prowess. Why, even his brothers of the Kingsguard never warmed to him. Ser Barristan was once heard to say that the man had no friend but his sword and no life but duty… but you know, I do not think Selmy meant it altogether as praise. Which is queer when you consider it, is it not? Those are the very qualities we seek in our Kingsguard, it could be said—men who live not for themselves, but for their king. By those lights, our brave Ser Mandon was the perfect white knight. And he died as a knight of the Kingsguard ought, with sword in hand, defending one of the king’s own blood.  The eunuch gave him a slimy smile and watched him sharply.  Trying to murder one of the king’s own blood, you mean. Tyrion wondered if Varys knew rather more than he was saying. Nothing he’d just heard was new to him; Bronn had brought back much the same reports. He needed a link to Cersei, some sign that Ser Mandon had been his sister’s catspaw. What we want is not always what we get, he reflected bitterly, which reminded him…   It is not Ser Mandon who brings me here.    To be sure.  The eunuch crossed the room to his flagon of water.  May I serve you, my lord?  he asked as he filled a cup.   Yes. But not with water.  He folded his hands together.  I want you to bring me Shae.   Varys took a drink.  Is that wise, my lord? The dear sweet child. It would be such a shame if your father hanged her.   It did not surprise him that Varys knew.  No, it’s not wise, it’s bloody madness. I want to see her one last time, before I send her away. I cannot abide having her so close.    I understand.   How could you? Tyrion had seen her only yesterday, climbing the serpentine steps with a pail of water. He had watched as a young knight had offered to carry the heavy pail. The way she had touched his arm and smiled for him had tied Tyrion’s guts into knots. They passed within inches of each other, him descending and her climbing, so close that he could smell the clean fresh scent of her hair.  M’lord,  she’d said to him, with a little curtsy, and he wanted to reach out and grab her and kiss her right there, but all he could do was nod stiffly and waddle on past.  I have seen her several times,  he told Varys,  but I dare not speak to her. I suspect that all my movements are being watched.    You are wise to suspect so, my good lord.    Who?  He cocked his head.   The Kettleblacks report frequently to your sweet sister.    When I think of how much coin I paid those wretched… do you think there’s any chance that more gold might win them away from Cersei?    There is always a chance, but I should not care to wager on the likelihood. They are knights now, all three, and your sister has promised them further advancement.  A wicked little titter burst from the eunuch’s lips.  And the eldest, Ser Osmund of the Kingsguard, dreams of certain other… favors… as well. You can match the queen coin for coin, I have no doubt, but she has a second purse that is quite inexhaustible.   Seven hells, thought Tyrion.  Are you suggesting that Cersei’s fucking Osmund Kettleblack?    Oh, dear me, no, that would be dreadfully dangerous, don’t you think? No, the queen only hints… perhaps on the morrow, or when the wedding’s done… and then a smile, a whisper, a ribald jest… a breast brushing lightly against his sleeve as they pass… and yet it seems to serve. But what would a eunuch know of such things?  The tip of his tongue ran across his lower lip like a shy pink animal.  If I could somehow push them beyond sly fondling, arrange for Father to catch them abed together… Tyrion fingered the scab on his nose. He did not see how it could be done, but perhaps some plan would come to him later.  Are the Kettleblacks the only ones?    Would that were true, my lord. I fear there are many eyes upon you. You are… how shall we say? Conspicuous? And not well loved, it grieves me to tell you. Janos Slynt’s sons would gladly inform on you to avenge their father, and our sweet Lord Petyr has friends in half the brothels of King’s Landing. Should you be so unwise as to visit any of them, he will know at once, and your lord father soon thereafter."
}