{
  "id": "263dc05f2b568cfb7bb7d60118152600602b4138",
  "text": "  Such a dutiful son. And such a very feeble lie. It was Lord Tywin who presented my sister’s children to King Robert all wrapped up in crimson Lannister cloaks.    Perhaps you ought to have this discussion with my father. He was there. I was at the Rock, and still so young that I thought the thing between my legs was only good for pissing.    Yes, but you are here now, and in some difficulty, I would say. Your innocence may be as plain as the scar on your face, but it will not save you. No more than your father will.  The Dornish prince smiled.  But I might.    You?  Tyrion studied him.  You are one judge in three. How could you save me?    Not as your judge. As your champion.       Jaime   A white book sat on a white table in a white room.  The room was round, its walls of whitewashed stone hung with white woolen tapestries. It formed the first floor of White Sword Tower, a slender structure of four stories built into an angle of the castle wall overlooking the bay. The undercroft held arms and armor, the second and third floors the small spare sleeping cells of the six brothers of the Kingsguard.  One of those cells had been his for eighteen years, but this morning he had moved his things to the topmost floor, which was given over entirely to the Lord Commander’s apartments. Those rooms were spare as well, though spacious; and they were above the outer walls, which meant he would have a view of the sea. I will like that, he thought. The view, and all the rest.  As pale as the room, Jaime sat by the book in his Kingsguard whites, waiting for his Sworn Brothers. A longsword hung from his hip. From the wrong hip. Before he had always wom his sword on his left, and drawn it across his body when he unsheathed. He had shifted it to his right hip this morning, so as to be able to draw it with his left hand in the same manner, but the weight of it felt strange there, and when he had tried to pull the blade from the scabbard the whole motion seemed clumsy and unnatural. His clothing fit badly as well. He had donned the winter raiment of the Kingsguard, a tunic and breeches of bleached white wool and a heavy white cloak, but it all seemed to hang loose on him.  Jaime had spent his days at his brother’s trial, standing well to the back of the hall. Either Tyrion never saw him there or he did not know him, but that was no surprise. Half the court no longer seemed to know him. I am a stranger in my own House. His son was dead, his father had disowned him, and his sister… she had not allowed him to be alone with her once, after that first day in the royal sept where Joffrey lay amongst the candles. Even when they bore him across the city to his tomb in the Great Sept of Baelor, Cersei kept a careful distance.  He looked about the Round Room once more. White wool hangings covered the walls, and there was a white shield and two crossed longswords mounted above the hearth. The chair behind the table was old black oak, with cushions of blanched cowhide, the leather worn thin. Worn by the bony arse of Barristan the Bold and Ser Gerold Hightower before him, by Prince Aemon the Dragonknight, Ser Ryam Redwyne, and the Demon of Darry, by Ser Duncan the Tall and the Pale Griffin Alyn Connington. How could the Kingslayer belong in such exalted company?  Yet here he was.  The table itself was old weirwood, pale as bone, carved in the shape of a huge shield supported by three white stallions. By tradition the Lord Commander sat at the top of the shield, and the brothers three to a side, on the rare occasions when all seven were assembled. The book that rested by his elbow was massive; two feet tall and a foot and a half wide, a thousand pages thick, fine white vellum bound between covers of bleached white leather with gold hinges and fastenings. The Book of the Brothers was its formal name, but more often it was simply called the White Book.  Within the White Book was the history of the Kingsguard. Every knight who’d ever served had a page, to record his name and deeds for all time. On the top left-hand corner of each page was drawn the shield the man had carried at the time he was chosen, inked in rich colors. Down in the bottom right corner was the shield of the Kingsguard; snow-white, empty, pure. The upper shields were all different; the lower shields were all the same. In the space between were written the facts of each man’s life and service. The heraldic drawings and illuminations were done by septons sent from the Great Sept of Baelor three times a year, but it was the duty of the Lord Commander to keep the entries up to date.  My duty, now. Once he learned to write with his left hand, that is. The White Book was well behind. The deaths of Ser Mandon Moore and Ser Preston Greenfield needed to be entered, and the brief bloody Kingsguard service of Sandor Clegane as well. New pages must be started for Ser Balon Swann, Ser Osmund Kettleblack, and the Knight of Flowers. I will need to summon a septon to draw their shields.  Ser Barristan Selmy had preceded Jaime as Lord Commander."
}