{
  "id": "26750171e58b9a932fee8064ee55c7ed8e5cd13d",
  "text": " They can preach to each other in the dungeons.    And count themselves lucky that they have such a gentle queen,  added Lancel.  I would have had their tongues out.    One even dared to say that the gods were punishing us because Jaime murdered the rightful king,  Cersei declared.  It will not be borne, Tyrion. I gave you ample opportunity to deal with these lice, but you and your Ser Jacelyn did nothing, so I commanded Vylarr to attend to the matter.    And so he did.  Tyrion had been annoyed when the red cloaks had dragged a half dozen of the scabrous prophets down to the dungeons without consulting him, but they were not important enough to battle over.  No doubt we will all be better off for a little quiet in the streets. That is not why I came. I have tidings I know you will be anxious to hear, sweet sister, but they are best spoken of privily.    Very well.  The harpist and the piper bowed and hurried out, while Cersei kissed her cousin chastely on the cheek.  Leave us, Lancel. My brother’s harmless when he’s alone. If he’d brought his pets, we’d smell them.   The young knight gave his cousin a baleful glance and pulled the door shut forcefully behind him.  I’ll have you know I make Shagga bathe once a fortnight,  Tyrion said when he was gone.   You’re very pleased with yourself, aren’t you? Why?    Why not?  Tyrion said. Every day, every night, hammers rang along the Street of Steel, and the great chain grew longer. He hopped up onto the great canopied bed.  Is this the bed where Robert died? I’m surprised you kept it.    It gives me sweet dreams,  she said.  Now spit out your business and waddle away, Imp.   Tyrion smiled.  Lord Stannis has sailed from Dragonstone.   Cersei bolted to her feet.  And yet you sit there grinning like a harvest-day pumpkin? Has Bywater called out the City Watch? We must send a bird to Harrenhal at once.  He was laughing by then. She seized him by the shoulders and shook him.  Stop it. Are you mad, or drunk? Stop it!   It was all he could do to get out the words.  I can’t,  he gasped.  It’s too… gods, too funny… Stannis…    What?    He hasn’t sailed against us,  Tyrion managed.  He’s laid siege to Storm’s End. Renly is riding to meet him.   His sister’s nails dug painfully into his arms. For a moment she stared incredulous, as if he had begun to gibber in an unknown tongue.  Stannis and Renly are fighting each other?  When he nodded, Cersei began to chuckle.  Gods be good,  she gasped,  I’m starting to believe that Robert was the clever one.   Tyrion threw back his head and roared. They laughed together. Cersei pulled him off the bed and whirled him around and even hugged him, for a moment as giddy as a girl. By the time she let go of him, Tyrion was breathless and dizzy. He staggered to her sideboard and put out a hand to steady himself.   Do you think it will truly come to battle between them? If they should come to some accord—    They won’t,  Tyrion said.  They are too different and yet too much alike, and neither could ever stomach the other.    And Stannis has always felt he was cheated of Storm’s End,  Cersei said thoughtfully.  The ancestral seat of House Baratheon, his by rights… if you knew how many times he came to Robert singing that same dull song in that gloomy aggrieved tone he has. When Robert gave the place to Renly, Stannis clenched his jaw so tight I thought his teeth would shatter.    He took it as a slight.    It was meant as a slight,  Cersei said.   Shall we raise a cup to brotherly love?    Yes,  she answered, breathless.  Oh, gods, yes.   His back was to her as he filled two cups with sweet Arbor red. It was the easiest thing in the world to sprinkle a pinch of fine powder into hers.  To Stannis!  he said as he handed her the wine. Harmless when I’m alone, am I?   To Renly!  she replied, laughing.  May they battle long and hard, and the Others take them both!   Is this the Cersei that Jaime sees? When she smiled, you saw how beautiful she was, truly. I loved a maid as fair as summer, with sunlight in her hair. He almost felt sorry for poisoning her.  It was the next morning as he broke his fast that her messenger arrived. The queen was indisposed and would not be able to leave her chambers. Not able to leave her privy, more like. Tyrion made the proper sympathetic noises and sent word to Cersei to rest easy, he would treat with Ser Cleos as they’d planned.  The Iron Throne of Aegon the Conqueror was a tangle of nasty barbs and jagged metal teeth waiting for any fool who tried to sit too comfortably, and the steps made his stunted legs cramp as he climbed up to it, all too aware of what an absurd spectacle he must be. Yet there was one thing to be said for it. It was high.  Lannister guardsmen stood silent in their crimson cloaks and lioncrested halfhelms. Ser Jacelyn’s gold cloaks faced them across the hall. The steps to the throne were flanked by Bronn and Ser Preston of the Kingsguard. Courtiers filled the gallery while supplicants clustered near the towering oak-and-bronze doors."
}