{
  "id": "27efe6e57656eb749b205325d965d86374de4475",
  "text": " So Catelyn waited. The river wind moved through the high branches, and she could see the Wheel Tower to her right, ivy crawling up its side. As she stood there, all the memories came flooding back to her. Her father had taught her to ride amongst these trees, and that was the elm that Edmure had fallen from when he broke his arm, and over there, beneath that bower, she and Lysa had played at kissing with Petyr.  She had not thought of that in years. How young they all had been—she no older than Sansa, Lysa younger than Arya, and Petyr younger still, yet eager. The girls had traded him between them, serious and giggling by turns. It came back to her so vividly she could almost feel his sweaty fingers on her shoulders and taste the mint on his breath. There was always mint growing in the godswood, and Petyr had liked to chew it. He had been such a bold little boy, always in trouble.  He tried to put his tongue in my mouth,  Catelyn had confessed to her sister afterward, when they were alone.  He did with me too,  Lysa had whispered, shy and breathless.  I liked it.   Robb got to his feet slowly and sheathed his sword, and Catelyn found herself wondering whether her son had ever kissed a girl in the godswood. Surely he must have. She had seen Jeyne Poole giving him moist-eyed glances, and some of the serving girls, even ones as old as eighteen… he had ridden in battle and killed men with a sword, surely he had been kissed. There were tears in her eyes. She wiped them away angrily.   Mother,  Robb said when he saw her standing there.  We must call a council. There are things to be decided.    Your grandfather would like to see you,  she said.  Robb, he’s very sick.    Ser Edmure told me. I am sorry, Mother… for Lord Hoster and for you. Yet first we must meet. We’ve had word from the south. Renly Baratheon has claimed his brother’s crown.    Renly?  she said, shocked.  I had thought, surely it would be Lord Stannis…    So did we all, my lady,  Galbart Glover said.  The war council convened in the Great Hall, at four long trestle tables arranged in a broken square. Lord Hoster was too weak to attend, asleep on his balcony, dreaming of the sun on the rivers of his youth. Edmure sat in the high seat of the Tullys, with Brynden Blackfish at his side, and his father’s bannermen arrayed to right and left and along the side tables. Word of the victory at Riverrun had spread to the fugitive lords of the Trident, drawing them back. Karyl Vance came in, a lord now, his father dead beneath the Golden Tooth. Ser Marq Piper was with him, and they brought a Darry, Ser Raymun’s son, a lad no older than Bran. Lord Jonos Bracken arrived from the ruins of Stone Hedge, glowering and blustering, and took a seat as far from Tytos Blackwood as the tables would permit.  The northern lords sat opposite, with Catelyn and Robb facing her brother across the tables. They were fewer. The Greatjon sat at Robb’s left hand, and then Theon Greyjoy; Galbart Glover and Lady Mormont were to the right of Catelyn. Lord Rickard Karstark, gaunt and hollow-eyed in his grief, took his seat like a man in a nightmare, his long beard uncombed and unwashed. He had left two sons dead in the Whispering Wood, and there was no word of the third, his eldest, who had led the Karstark spears against Tywin Lannister on the Green Fork.  The arguing raged on late into the night. Each lord had a right to speak, and speak they did… and shout, and curse, and reason, and cajole, and jest, and bargain, and slam tankards on the table, and threaten, and walk out, and return sullen or smiling. Catelyn sat and listened to it all.  Roose Bolton had re-formed the battered remnants of their other host at the mouth of the causeway. Ser Helman Tallhart and Walder Frey still held the Twins. Lord Tywin’s army had crossed the Trident, and was making for Harrenhal. And there were two kings in the realm. Two kings, and no agreement.  Many of the lords bannermen wanted to march on Harrenhal at once, to meet Lord Tywin and end Lannister power for all time. Young, hot-tempered Marq Piper urged a strike west at Casterly Rock instead. Still others counseled patience. Riverrun sat athwart the Lannister supply lines, Jason Mallister pointed out; let them bide their time, denying Lord Tywin fresh levies and provisions while they strengthened their defenses and rested their weary troops. Lord Blackwood would have none of it. They should finish the work they began in the Whispering Wood. March to Harrenhal and bring Roose Bolton’s army down as well. What Blackwood urged, Bracken opposed, as ever; Lord Jonos Bracken rose to insist they ought pledge their fealty to King Renly, and move south to join their might to his.   Renly is not the king,  Robb said. It was the first time her son had spoken. Like his father, he knew how to listen.   You cannot mean to hold to Joffrey, my lord,  Galbart Glover said.  He put your father to death.    That makes him evil,  Robb replied.  I do not know that it makes Renly king."
}