{
  "id": "28d341e013a003d231c65a9902bbd40a97ad7902",
  "text": " The wildlings were stripping the dead horses of every scrap of steel and leather, even prying the horseshoes off their hooves. A few were going through packs they’d turned up, looking for weapons and food. Jon passed one of Chett’s dogs, or what remained of him, lying in a sludgy pool of half-frozen blood.  A few tents were still standing on the far side of the camp, and it was there they found Mance Rayder. Beneath his slashed cloak of black wool and red silk he wore black ringmail and shaggy fur breeches, and on his head was a great bronze-and-iron helm with raven wings at either temple. Jarl was with him, and Harma the Dogshead; Styr as well, and Varamyr Sixskins with his wolves and his shadowcat.  The look Mance gave Jon was grim and cold.  What happened to your face?   Ygritte said,  Orell tried to take his eye out.    It was him I asked. Has he lost his tongue? Perhaps he should, to spare us further lies.   Styr the Magnar drew a long knife.  The boy might see more clear with one eye, instead of two.    Would you like to keep your eye, Jon?  asked the King-beyond-the-Wall.  If so, tell me how many they were. And try and speak the truth this time, Bastard of Winterfell.   Jon’s throat was dry.  My lord… what…    I am not your lord,  said Mance.  And the what is plain enough. Your brothers died. The question is, how many?   Jon’s face was throbbing, the snow kept coming down, and it was hard to think. You must not balk, whatever is asked of you, Qhorin had told him. The words stuck in his throat, but he made himself say,  There were three hundred of us.    Us?  Mance said sharply.   Them. Three hundred of them.  Whatever is asked, the Halfhand said. So why do I feel so craven?  Two hundred from Castle Black, and one hundred from the Shadow Tower.    There’s a truer song than the one you sang in my tent.  Mance looked to Harma Dogshead.  How many horses have we found?    More’n a hundred,  that huge woman replied,  less than two. There’s more dead to the east, under the snow, hard t’ know how many.  Behind her stood her banner bearer, holding a pole with a dog’s head on it, fresh enough to still be leaking blood.   You should never have lied to me, Jon Snow,  said Mance.   I… I know that.  What could he say?  The wildling king studied his face.  Who had the command here? And tell me true. Was it Rykker? Smallwood? Not Wythers, he’s too feeble. Whose tent was this?   I have said too much.  You did not find his body?   Harma snorted, her disdain frosting from her nostrils.  What fools these black crows be.    The next time you answer me with a question, I will give you to my Lord of Bones,  Mance Rayder promised Jon. He stepped closer.  Who led here?   One more step, thought Jon. Another foot. He moved his hand closer to Longclaw’s hilt. If I hold my tongue…   Reach up for that bastard sword and I’ll have your bastard head off before it clears the scabbard,  said Mance.  I am fast losing patience with you, crow.    Say it,  Ygritte urged.  He’s dead, whoever he was.   His frown cracked the blood on his cheek. This is too hard, Jon thought in despair. How do I play the turncloak without becoming one? Qhorin had not told him that. But the second step is always easier than the first.  The Old Bear.    That old man?  Harma’s tone said she did not believe it.  He came himself? Then who commands at Castle Black?    Bowen Marsh.  This time Jon answered at once. You must not balk, whatever is asked of you.  Mance laughed.  If so, our war is won. Bowen knows a deal more about counting swords than he’s ever known about using them.    The Old Bear commanded,  said Jon.  This place was high and strong, and he made it stronger. He dug pits and planted stakes, laid up food and water. He was ready for…    …Me?  finished Mance Rayder.  Aye, he was. Had I been fool enough to storm this hill, I might have lost five men for every crow I slew and still counted myself lucky.  His mouth grew hard.  But when the dead walk, walls and stakes and swords mean nothing. You cannot fight the dead, Jon Snow. No man knows that half so well as me.  He gazed up at the darkening sky and said,  The crows may have helped us more than they know. I’d wondered why we’d suffered no attacks. But there’s still a hundred leagues to go, and the cold is rising. Varamyr, send your wolves sniffing after the wights, I won’t have them taking us unawares. My Lord of Bones, double all the patrols, and make certain every man has torch and flint. Styr, Jarl, you ride at first light.    Mance,  Rattleshirt said,  I want me some crow bones.   Ygritte stepped in front of Jon.  You can’t kill a man for lying to protect them as was his brothers.    They are still his brothers,  declared Styr.   They’re not,  insisted Ygritte.  He never killed me, like they told him. And he slew the Halfhand, we all saw.   Jon’s breath misted the air. If I lie to him, he’ll know. He looked Mance Rayder in the eyes, opened and closed his burned hand.  I wear the cloak you gave me, Your Grace."
}