{
  "id": "28d96dbfff13b32eb78ce9f3df59b43ef730bbf1",
  "text": " No garb could disguise her plainness, though; the huge freckled hands, the wide flat face, the thrust of her teeth. Out of armor, her body seemed ungainly, broad of hip and thick of limb, with hunched muscular shoulders but no bosom to speak of. And it was clear from her every action that Brienne knew it, and suffered for it. She spoke only in answer, and seldom lifted her gaze from her food.  Of food there was plenty. The war had not touched the fabled bounty of Highgarden. While singers sang and tumblers tumbled, they began with pears poached in wine, and went on to tiny savory fish rolled in salt and cooked crisp, and capons stuffed with onions and mushrooms. There were great loaves of brown bread, mounds of turnips and sweetcorn and pease, immense hams and roast geese and trenchers dripping full of venison stewed with beer and barley. For the sweet, Lord Caswell’s servants brought down trays of pastries from his castle kitchens, cream swans and spun-sugar unicorns, lemon cakes in the shape of roses, spiced honey biscuits and blackberry tarts, apple crisps and wheels of buttery cheese.  The rich foods made Catelyn queasy, but it would never do to show frailty when so much depended on her strength. She ate sparingly, while she watched this man who would be king. Renly sat with his young bride on his left hand and her brother on the right. Apart from the white linen bandage around his brow, Ser Loras seemed none the worse for the day’s misadventures. He was indeed as comely as Catelyn had suspected he might be. When not glazed, his eyes were lively and intelligent, his hair an artless tumble of brown locks that many a maid might have envied. He had replaced his tattered tourney cloak with a new one; the same brilliantly striped silk of Renly’s Rainbow Guard, clasped with the golden rose of Highgarden.  From time to time, King Renly would feed Margaery some choice morsel off the point of his dagger, or lean over to plant the lightest of kisses on her cheek, but it was Ser Loras who shared most of his jests and confidences. The king enjoyed his food and drink, that was plain to see, yet he seemed neither glutton nor drunkard. He laughed often, and well, and spoke amiably to highborn lords and lowly serving wenches alike.  Some of his guests were less moderate. They drank too much and boasted too loudly, to her mind. Lord Willum’s sons Josua and Elyas disputed heatedly about who would be first over the walls of King’s Landing. Lord Varner dandled a serving girl on his lap, nuzzling at her neck while one hand went exploring down her bodice. Guyard the Green, who fancied himself a singer, diddled a harp and gave them a verse about tying lions’ tails in knots, parts of which rhymed. Ser Mark Mullendore brought a black-and-white monkey and fed him morsels from his own plate, while Ser Tanton of the red-apple Fossoways climbed on the table and swore to slay Sandor Clegane in single combat. The vow might have been taken more solemnly if Ser Tanton had not had one foot in a gravy boat when he made it.  The height of folly was reached when a plump fool came capering out in gold-painted tin with a cloth lion’s head, and chased a dwarf around the tables, whacking him over the head with a bladder. Finally King Renly demanded to know why he was beating his brother.  Why, Your Grace, I’m the Kinslayer,  the fool said.   It’s Kingslayer, fool of a fool,  Renly said, and the hall rang with laughter.  Lord Rowan beside her did not join the merriment.  They are all so young,  he said.  It was true. The Knight of Flowers could not have reached his second name day when Robert slew Prince Rhaegar on the Trident. Few of the others were very much older. They had been babes during the Sack of King’s Landing, and no more than boys when Balon Greyjoy raised the Iron Islands in rebellion. They are still unblooded, Catelyn thought as she watched Lord Bryce goad Ser Robar into juggling a brace of daggers. It is all a game to them still, a tourney writ large, and all they see is the chance for glory and honor and spoils. They are boys drunk on song and story, and like all boys, they think themselves immortal.   War will make them old,  Catelyn said,  as it did us.  She had been a girl when Robert and Ned and Jon Arryn raised their banners against Aerys Targaryen, a woman by the time the fighting was done.  I pity them.    Why?  Lord Rowan asked her.  Look at them. They’re young and strong, full of life and laughter. And lust, aye, more lust than they know what to do with. There will be many a bastard bred this night, I promise you. Why pity?    Because it will not last,  Catelyn answered, sadly.  Because they are the knights of summer, and winter is coming.    Lady Catelyn, you are wrong.  Brienne regarded her with eyes as blue as her armor.  Winter will never come for the likes of us. Should we die in battle, they will surely sing of us, and it’s always summer in the songs. In the songs all knights are gallant, all maids are beautiful, and the sun is always shining."
}