{
  "id": "29ab8fd30981373c37c72cdf4fc56fd3d7fa1021",
  "text": " Seven remained as of last night. Ser Denys Mallister had collected two hundred and thirteen tokens, Cotter Pyke one hundred and eighty-seven, Lord Slynt seventy-four, Othell Yarwyck sixty, Bowen Marsh forty-nine, Three-Finger Hobb five, and Dolorous Edd Tollett one. Pyp and his stupid japes. Sam shuffled through the earlier counts. Ser Denys, Cotter Pyke, and Bowen Marsh had all been falling since the third day, Othell Yarwyck since the sixth. Only Lord Janos Slynt was climbing, day after day after day.  He could hear the birds quorking in the rookery, so he put the papers away and climbed the steps to feed them. Three more ravens had come in, he saw with pleasure.  Snow,  they cried at him.  Snow, snow, snow.  He had taught them that. Even with the newcomers, the ravenry seemed dismally empty. Few of the birds that Aemon had sent off had returned as yet. One reached Stannis, though. One found Dragonstone, and a king who still cared. A thousand leagues south, Sam knew, his father had joined House Tarly to the cause of the boy on the Iron Throne, but neither King Joffrey nor little King Tommen had bestirred himself when the Watch cried out for help. What good is a king who will not defend his realm? he thought angrily, remembering the night on the Fist of the First Men and the terrible trek to Craster’s Keep through darkness, fear, and falling snow. The queen’s men made him uneasy, it was true, but at least they had come.  That night at supper Sam looked for Jon Snow, but did not see him anywhere in the cavernous stone vault where the brothers now took their meals. He finally took a place on the bench near his other friends. Pyp was telling Dolorous Edd about the contest they’d had to see which of the straw soldiers could collect the most wildling arrows.  You were leading most of the way, but Watt of Long Lake got three in the last day and passed you.    I never win anything,  Dolorous Edd complained.  The gods always smiled on Watt, though. When the wildlings knocked him off the Bridge of Skulls, somehow he landed in a nice deep pool of water. How lucky was that, missing all those rocks?    Was it a long fall?  Grenn wanted to know.  Did landing in the pool of water save his life?    No,  said Dolorous Edd.  He was dead already, from that axe in his head. Still, it was pretty lucky, missing the rocks.   Three-Finger Hobb had promised the brothers roast haunch of mammoth that night, maybe in hopes of cadging a few more votes. If that was his notion, he should have found a younger mammoth, Sam thought, as he pulled a string of gristle out from between his teeth. Sighing, he pushed the food away.  There would be another vote shortly, and the tensions in the air were thicker than the smoke. Cotter Pyke sat by the fire, surrounded by rangers from Eastwatch. Ser Denys Mallister was near the door with a smaller group of Shadow Tower men. Janos Slynt has the best place, Sam realized, halfway between the flames and the drafts. He was alarmed to see Bowen Marsh beside him, wan-faced and haggard, his head still wrapped in linen, but listening to all that Lord Janos had to say. When he pointed that out to his friends, Pyp said,  And look down there, that’s Ser Alliser whispering with Othell Yarwyck.   After the meal Maester Aemon rose to ask if any of the brothers wished to speak before they cast their tokens. Dolorous Edd got up, stone-faced and glum as ever.  I just want to say to whoever is voting for me that I would certainly make an awful Lord Commander. But so would all these others.  He was followed by Bowen Marsh, who stood with one hand on Lord Slynt’s shoulder.  Brothers and friends, I am asking that my name be withdrawn from this choosing. My wound still troubles me, and the task is too large for me, I fear… but not for Lord Janos here, who commanded the gold cloaks of King’s Landing for many years. Let us all give him our support.   Sam heard angry mutters from Cotter Pyke’s end of the room, and Ser Denys looked at one of his companions and shook his head. It is too late, the damage is done. He wondered where Jon was, and why he had stayed away.  Most of the brothers were unlettered, so by tradition the choosing was done by dropping tokens into a big potbellied iron kettle that Three-Finger Hobb and Owen the Oaf had dragged over from the kitchens. The barrels of tokens were off in a corner behind a heavy drape, so the voters could make their choice unseen. You were allowed to have a friend cast your token if you had duty, so some men took two tokens, three, or four, and Ser Denys and Cotter Pyke voted for the garrisons they had left behind.  When the hall was finally empty, save for them, Sam and Clydas upended the kettle in front of Maester Aemon. A cascade of seashells, stones, and copper pennies covered the table. Aemon’s wrinkled hands sorted with surprising speed, moving the shells here, the stones there, the pennies to one side, the occasional arrowhead, nail, and acorn off to themselves. Sam and Clydas counted the piles, each of them keeping his own tally."
}