{
  "id": "29c5ef6d1d86f93867fbca0514bae61e60a95ede",
  "text": " And so he had.  The Greatjon had drunk another of Lord Walder’s brood under the table, Petyr Pimple this time. The lad has a third his capacity, what did he expect? Lord Umber wiped his mouth, stood, and began to sing.  A bear there was, a bear, a BEAR! All black and brown and covered with hair!  His voice was not at all bad, though somewhat thick from drink. Unfortunately the fiddlers and drummers and flutists up above were playing  Flowers of Spring,  which suited the words of  The Bear and the Maiden Fair  as well as snails might suit a bowl of porridge. Even poor Jinglebell covered his ears at the cacophony.  Roose Bolton murmured some words too soft to hear and went off in search of a privy. The cramped hall was in a constant uproar of guests and servants coming and going. A second feast, for knights and lords of somewhat lesser rank, was roaring along in the other castle, she knew. Lord Walder had exiled his baseborn children and their offspring to that side of the river, so that Robb’s northmen had taken to referring to it as  the bastard feast.  Some guests were no doubt stealing off to see if the bastards were having a better time than they were. Some might even be venturing as far as the camps. The Freys had provided wagons of wine, ale and mead, so the common soldiers could drink to the wedding of Riverrun and the Twins.  Robb sat down in Bolton’s vacant place.  A few more hours and this farce is done, Mother,  he said in a low voice, as the Greatjon sang of the maid with honey in her hair.  Black Walder’s been mild as a lamb for once. And Uncle Edmure seems well content in his bride.  He leaned across her.  Ser Ryman?   Ser Ryman Frey blinked and said,  Sire. Yes?    I’d hoped to ask Olyvar to squire for me when we march north,  said Robb,  but I do not see him here. Would he be at the other feast?    Olyvar?  Ser Ryman shook his head.  No. Not Olyvar. Gone… gone from the castles. Duty.    I see.  Robb’s tone suggested otherwise. When Ser Ryman offered nothing more, the king got to his feet again.  Would you care for a dance, Mother?    Thank you, but no.  A dance was the last thing she needed, the way her head was throbbing.  No doubt one of Lord Walder’s daughters would be pleased to partner you.    Oh, no doubt.  His smile was resigned.  The musicians were playing  Iron Lances  by then, while the Greatjon sang  The Lusty Lad.  Someone should acquaint them with each other, it might improve the harmony. Catelyn turned back to Ser Ryman.  I had heard that one of your cousins was a singer.    Alesander. Symond’s son. Alyx is his sister.  He raised a cup toward where she danced with Robin Flint.   Will Alesander be playing for us tonight?   Ser Ryman squinted at her.  Not him. He’s away.  He wiped sweat from his brow and lurched to his feet.  Pardons, my lady. Pardons.  Catelyn watched him stagger toward the door.  Edmure was kissing Roslin and squeezing her hand. Elsewhere in the hall, Ser Marq Piper and Ser Danwell Frey played a drinking game, Lame Lothar said something amusing to Ser Hosteen, one of the younger Freys juggled three daggers for a group of giggly girls, and Jinglebell sat on the floor sucking wine off his fingers. The servers were bringing out huge silver platters piled high with cuts of juicy pink lamb, the most appetizing dish they’d seen all evening. And Robb was leading Dacey Mormont in a dance.  When she wore a dress in place of a hauberk, Lady Maege’s eldest daughter was quite pretty; tall and willowy, with a shy smile that made her long face light up. It was pleasant to see that she could be as graceful on the dance floor as in the training yard. Catelyn wondered if Lady Maege had reached the Neck as yet. She had taken her other daughters with her, but as one of Robb’s battle companions Dacey had chosen to remain by his side. He has Ned’s gift for inspiring loyalty. Olyvar Frey had been devoted to her son as well. Hadn’t Robb said that Olyvar wanted to remain with him even after he’d married Jeyne?  Seated betwixt his black oak towers, the Lord of the Crossing clapped his spotted hands together. The noise they made was so faint that even those on the dais scarce heard it, but Ser Aenys and Ser Hosteen saw and began to pound their cups on the table. Lame Lothar joined them, then Marq Piper and Ser Danwell and Ser Raymund. Half the guests were soon pounding. Finally even the mob of musicians in the gallery took note. The piping, drumming, and fiddling trailed off into quiet.   Your Grace,  Lord Walder called out to Robb,  the septon has prayed his prayers, some words have been said, and Lord Edmure’s wrapped my sweetling in a fish cloak, but they are not yet man and wife. A sword needs a sheath, heh, and a wedding needs a bedding. What does my sire say? Is it meet that we should bed them?   A score or more of Walder Frey’s sons and grandsons began to bang their cups again, shouting,  To bed! To bed! To bed with them!  Roslin had gone white. Catelyn wondered whether it was the prospect of losing her maidenhead that frightened the girl, or the bedding itself."
}