{
  "id": "29f610eefdc03abcb10ca0cb64c9bfc1942896bb",
  "text": "'  'Have   you often  been to Rivendell?' said  Frodo. 'I have,' said Strider. 'I dwelt  there once, and still I return when I may.       There my heart is;  but  it is not my fate to sit in peace, even in the  fair house of Elrond.'       The hills now began to shut them in. The Road behind held on its way to   the River Bruinen, but both were  now hidden  from view. The travellers came  into a long valley; narrow, deeply cloven, dark  and silent.  Trees with old  and twisted roots hung over cliffs, and piled up behind into mounting slopes  of pine-wood.       The hobbits grew very weary. They advanced slowly, for they had to pick  their way through a pathless country, encumbered by fallen trees and tumbled  rocks. As long as they could they avoided  climbing  for  Frodo's  sake, and  because it was in fact difficult to find any way up out of the narrow dales.   They had been two days in this country when the weather turned wet. The wind  began  to blow steadily  out  of  the West and pour the water of the distant  seas  on the  dark  heads of the hills in fine  drenching rain. By nightfall  they  were all soaked,  and their camp was cheerless, for they could not get  any  fire  to burn. The next  day the  hills rose still  higher  and steeper   before  them, and  they were forced to  turn away  northwards out  of  their   ####-course. Strider seemed to  be getting anxious: they were nearly ten days out  from Weathertop, and their stock of  provisions was beginning to run low. It   went on raining.       That night they camped on  a stony shelf with a rock -wall  behind them,  in which  there was a shallow cave,  a  mere scoop in the  cliff.  Frodo was  restless. The  cold and wet had  made his wound more painful  than ever, and  the ache and sense of deadly chill took  away all sleep.  He lay tossing and  turning and listening fearfully to the stealthy night-noises: wind in chinks  of  rock, water  dripping, a crack, the sudden rattling  fall of  a loosened  stone. He felt that black shapes  were advancing to smother him; but when he  sat up he saw  nothing but  the back of  Strider  sitting hunched up, smoking  his pipe, and watching.  He lay down again and passed into an uneasy  dream,  in  which he  walked on the grass in his garden in the Shire,  but it seemed  faint  and dim, less clear  than the  tall black shadows that  stood looking  over the hedge.       In  the morning he  woke to  find that the rain had stopped. The clouds  were still thick,  but they were breaking, and pale strips of  blue appeared  between them.  The  wind was  shifting  again.  They  did  not start  early.   Immediately after  their cold  and  comfortless  breakfast Strider  went off  alone, telling the others to remain under the shelter of the cliff, until he  came  back. He was going to climb up, if he could, and get a look at the lie  of the land.       When  he returned he was not reassuring.  'We have come too  far to the  north,' he said, 'and we must find  some way to  turn back southwards again.   If we  keep on as we are going we shall get up into the Ettendales far north  of  Rivendell.  That is  troll -country,  and  little known  to  me. We could  perhaps find our way through and come round to Rivendell from the north; but  it would take  too long,  for I  do not know the way, and our food would not   last. So somehow or other we must find the Ford of Bruinen.'       The  rest of that day they  spent  scrambling over  rocky  ground. They  found  a passage between  two  hills that  led them into  a  valley  running  south-east, the  direction that they wished  to take; but towards the end of  the day they found their road again barred by a ridge of high land; its dark  edge  against  the  sky was  broken  into many bare points like teeth  of  a   blunted saw. They had a choice between going back or climbing over it.       They decided to attempt the climb, but it proved very difficult. Before  long Frodo was obliged to dismount and struggle along on foot. Even so  they   ####-often  despaired of  getting their pony up, or  indeed of finding a path for   themselves, burdened as  they were. The light was nearly gone, and they were  all exhausted, when at last they reached the top. They  had climbed on to  a   narrow  saddle  between two  higher points, and the  land fell  steeply away  again, only a short distance ahead. Frodo threw himself down, and lay on the  ground shivering. His left arm was lifeless, and his side and shoulder  felt  as if icy claws were  laid upon them.  The trees  and rocks about him seemed  shadowy and dim.       'We  cannot go any further,' said  Merry to Strider. 'I am  afraid this  has been too much for Frodo. I am dreadfully  anxious about him. What are we  to do? Do you think they  will be able to cure him in Rivendell,  if we ever  get there?'       'We shall see,'  answered Strider. 'There is nothing more that I can do  in  the  wilderness;  and  it is chiefly because of  his wound that I am  so  anxious to press on."
}