{
  "id": "2bc5b577a3855c2a0869b7bc397abc494eb98f0a",
  "text": "  Perhaps we might begin soon,  the Grand Maester said, hands knitting together atop his broad stomach.  I fear I shall fall asleep if we wait much longer.    As you will.  The king’s seat sat empty at the head of the table, the crowned stag of Baratheon embroidered in gold thread on its pillows. Ned took the chair beside it, as the right hand of his king.  My lords,  he said formally,  I am sorry to have kept you waiting.    You are the King’s Hand,  Varys said.  We serve at your pleasure, Lord Stark.   As the others took their accustomed seats, it struck Eddard Stark forcefully that he did not belong here, in this room, with these men. He remembered what Robert had told him in the crypts below Winterfell. I am surrounded by flatterers and fools, the king had insisted. Ned looked down the council table and wondered which were the flatterers and which the fools. He thought he knew already.  We are but five,  he pointed out.   Lord Stannis took himself to Dragonstone not long after the king went north,  Varys said,  and our gallant Ser Barristan no doubt rides beside the king as he makes his way through the city, as befits the Lord Commander of the Kingsguard.    Perhaps we had best wait for Ser Barristan and the king to join us,  Ned suggested.  Renly Baratheon laughed aloud.  If we wait for my brother to grace us with his royal presence, it could be a long sit.    Our good King Robert has many cares,  Varys said.  He entrusts some small matters to us, to lighten his load.    What Lord Varys means is that all this business of coin and crops and justice bores my royal brother to tears,  Lord Renly said,  so it falls to us to govern the realm. He does send us a command from time to time.  He drew a tightly rolled paper from his sleeve and laid it on the table.  This morning he commanded me to ride ahead with all haste and ask Grand Maester Pycelle to convene this council at once. He has an urgent task for us.   Littlefinger smiled and handed the paper to Ned. It bore the royal seal. Ned broke the wax with his thumb and flattened the letter to consider the king’s urgent command, reading the words with mounting disbelief. Was there no end to Robert’s folly? And to do this in his name, that was salt in the wound.  Gods be good,  he swore.   What Lord Eddard means to say,  Lord Renly announced,  is that His Grace instructs us to stage a great tournament in honor of his appointment as the Hand of the King.    How much?  asked Littlefinger, mildly.  Ned read the answer off the letter.  Forty thousand golden dragons to the champion. Twenty thousand to the man who comes second, another twenty to the winner of the melee, and ten thousand to the victor of the archery competition.    Ninety thousand gold pieces,  Littlefinger sighed.  And we must not neglect the other costs. Robert will want a prodigious feast. That means cooks, carpenters, serving girls, singers, jugglers, fools…    Fools we have in plenty,  Lord Renly said.  Grand Maester Pycelle looked to Littlefinger and asked,  Will the treasury bear the expense?    What treasury is that?  Littlefinger replied with a twist of his mouth.  Spare me the foolishness, Maester. You know as well as I that the treasury has been empty for years. I shall have to borrow the money. No doubt the Lannisters will be accommodating. We owe Lord Tywin some three million dragons at present, what matter another hundred thousand?   Ned was stunned.  Are you claiming that the Crown is three million gold pieces in debt?    The Crown is more than six million gold pieces in debt, Lord Stark. The Lannisters are the biggest part of it, but we have also borrowed from Lord Tyrell, the Iron Bank of Braavos, and several Tyroshi trading cartels. Of late I’ve had to turn to the Faith. The High Septon haggles worse than a Dornish fishmonger.   Ned was aghast.  Aerys Targaryen left a treasury flowing with gold. How could you let this happen?   Littlefinger gave a shrug.  The master of coin finds the money. The king and the Hand spend it.    I will not believe that Jon Arryn allowed Robert to beggar the realm,  Ned said hotly.  Grand Maester Pycelle shook his great bald head, his chains clinking softly.  Lord Arryn was a prudent man, but I fear that His Grace does not always listen to wise counsel.    My royal brother loves tournaments and feasts,  Renly Baratheon said,  and he loathes what he calls ‘counting coppers.’    I will speak with His Grace,  Ned said.  This tourney is an extravagance the realm cannot afford.    Speak to him as you will,  Lord Renly said,  we had still best make our plans.    Another day,  Ned said. Perhaps too sharply, from the looks they gave him. He would have to remember that he was no longer in Winterfell, where only the king stood higher; here, he was but first among equals.  Forgive me, my lords,  he said in a softer tone.  I am tired. Let us call a halt for today and resume when we are fresher.  He did not ask for their consent, but stood abruptly, nodded at them all, and made for the door."
}