{
  "id": "2c06023d53fb85b545ca043f06abc8bff16b8d85",
  "text": "    So much for guest right.    The blood is on Walder Frey’s hands, not mine.    Walder Frey is a peevish old man who lives to fondle his young wife and brood over all the slights he’s suffered. I have no doubt he hatched this ugly chicken, but he would never have dared such a thing without a promise of protection.    I suppose you would have spared the boy and told Lord Frey you had no need of his allegiance? That would have driven the old fool right back into Stark’s arms and won you another year of war. Explain to me why it is more noble to kill ten thousand men in battle than a dozen at dinner.  When Tyrion had no reply to that, his father continued.  The price was cheap by any measure. The crown shall grant Riverrun to Ser Emmon Frey once the Blackfish yields. Lancel and Daven must marry Frey girls, Joy is to wed one of Lord Walder’s natural sons when she’s old enough, and Roose Bolton becomes Warden of the North and takes home Arya Stark.    Arya Stark?  Tyrion cocked his head.  And Bolton? I might have known Frey would not have the stomach to act alone. But Arya… Varys and Ser Jacelyn searched for her for more than half a year. Arya Stark is surely dead.    So was Renly, until the Blackwater.    What does that mean?    Perhaps Littlefinger succeeded where you and Varys failed. Lord Bolton will wed the girl to his bastard son. We shall allow the Dreadfort to fight the ironborn for a few years, and see if he can bring Stark’s other bannermen to heel. Come spring, all of them should be at the end of their strength and ready to bend the knee. The north will go to your son by Sansa Stark… if you ever find enough manhood in you to breed one. Lest you forget, it is not only Joffrey who must needs take a maidenhead.   I had not forgotten, though I’d hoped you had.  And when do you imagine Sansa will be at her most fertile?  Tyrion asked his father in tones that dripped acid.  Before or after I tell her how we murdered her mother and her brother?       Davos   For a moment it seemed as though the king had not heard. Stannis showed no pleasure at the news, no anger, no disbelief, not even relief. He stared at his Painted Table with teeth clenched hard.  You are certain?  he asked.   I am not seeing the body, no, Your Kingliness,  said Salladhor Saan.  Yet in the city, the lions prance and dance. The Red Wedding, the smallfolk are calling it. They swear Lord Frey had the boy’s head hacked off, sewed the head of his direwolf in its place, and nailed a crown about his ears. His lady mother was slain as well, and thrown naked in the river.   At a wedding, thought Davos. As he sat at his slayer’s board, a guest beneath his roof. These Freys are cursed. He could smell the burning blood again, and hear the leech hissing and spitting on the brazier’s hot coals.   It was the Lord’s wrath that slew him,  Ser Axell Florent declared.  It was the hand of R’hllor!    Praise the Lord of Light!  sang out Queen Selyse, a pinched thin hard woman with large ears and a hairy upper lip.   Is the hand of R’hllor spotted and palsied?  asked Stannis.  This sounds more Walder Frey’s handiwork than any god’s.    R’hllor chooses such instruments as he requires.  The ruby at Melisandre’s throat shone redly.  His ways are mysterious, but no man may withstand his fiery will.    No man may withstand him!  the queen cried.   Be quiet, woman. You are not at a nightfire now.  Stannis considered the Painted Table.  The wolf leaves no heirs, the kraken too many. The lions will devour them unless… Saan, I will require your fastest ships to carry envoys to the Iron Islands and White Harbor. I shall offer pardons.  The way he snapped his teeth showed how little he liked that word.  Full pardons, for all those who repent of treason and swear fealty to their rightful king. They must see…    They will not.  Melisandre’s voice was soft.  I am sorry, Your Grace. This is not an end. More false kings will soon rise to take up the crowns of those who’ve died.    More?  Stannis looked as though he would gladly have throttled her.  More usurpers? More traitors?    I have seen it in the flames.   Queen Selyse went to the king’s side.  The Lord of Light sent Melisandre to guide you to your glory. Heed her, I beg you. R’hllor’s holy flames do not lie.    There are lies and lies, woman. Even when these flames speak truly, they are full of tricks, it seems to me.    An ant who hears the words of a king may not comprehend what he is saying,  Melisandre said,  and all men are ants before the fiery face of god. If sometimes I have mistaken a warning for a prophecy or a prophecy for a warning, the fault lies in the reader, not the book. But this I know for a certainty—envoys and pardons will not serve you now, no more than leeches. You must show the realm a sign. A sign that proves your power!    Power?  The king snorted.  I have thirteen hundred men on Dragonstone, another three hundred at Storm’s End.  His hand swept over the Painted Table.  The rest of Westeros is in the hands of my foes."
}