{
  "id": "2c38e44f9b5c2f0955fa74183882cb4366f589be",
  "text": "  Lysa had named Cersei in the letter she had sent to Winterfell, but now she seemed certain that Tyrion was the killer… perhaps because the dwarf was here, while the queen was safe behind the walls of the Red Keep, hundreds of leagues to the south. Catelyn almost wished she had burned her sister’s letter before reading it.  Ser Rodrik tugged at his whiskers.  Poison, well… that could be the dwarf’s work, true enough. Or Cersei’s. It’s said poison is a woman’s weapon, begging your pardons, my lady. The Kingslayer, now… I have no great liking for the man, but he’s not the sort. Too fond of the sight of blood on that golden sword of his. Was it poison, my lady?   Catelyn frowned, vaguely uneasy.  How else could they make it look a natural death?  Behind her, Lord Robert shrieked with delight as one of the puppet knights sliced the other in half, spilling a flood of red sawdust onto the terrace. She glanced at her nephew and sighed.  The boy is utterly without discipline. He will never be strong enough to rule unless he is taken away from his mother for a time.    His lord father agreed with you,  said a voice at her elbow. She turned to behold Maester Colemon, a cup of wine in his hand.  He was planning to send the boy to Dragonstone for fostering, you know… oh, but I’m speaking out of turn.  The apple of his throat bobbed anxiously beneath the loose maester’s chain.  I fear I’ve had too much of Lord Hunter’s excellent wine. The prospect of bloodshed has my nerves all a-fray…    You are mistaken, Maester,  Catelyn said.  It was Casterly Rock, not Dragonstone, and those arrangements were made after the Hand’s death, without my sister’s consent.   The maester’s head jerked so vigorously at the end of his absurdly long neck that he looked half a puppet himself.  No, begging your forgiveness, my lady, but it was Lord Jon who—   A bell tolled loudly below them. High lords and serving girls alike broke off what they were doing and moved to the balustrade. Below, two guardsmen in sky-blue cloaks led forth Tyrion Lannister. The Eyrie’s plump septon escorted him to the statue in the center of the garden, a weeping woman carved in veined white marble, no doubt meant to be Alyssa.   The bad little man,  Lord Robert said, giggling.  Mother, can I make him fly? I want to see him fly.    Later, my sweet baby,  Lysa promised him.   Trial first,  drawled Ser Lyn Corbray,  then execution.   A moment later the two champions appeared from opposite sides of the garden. The knight was attended by two young squires, the sellsword by the Eyrie’s master-at-arms.  Ser Vardis Egen was steel from head to heel, encased in heavy plate armor over mail and padded surcoat. Large circular rondels, enameled cream-and-blue in the moon-and-falcon sigil of House Arryn, protected the vulnerable juncture of arm and breast. A skirt of lobstered metal covered him from waist to midthigh, while a solid gorget encircled his throat. Falcon’s wings sprouted from the temples of his helm, and his visor was a pointed metal beak with a narrow slit for vision.  Bronn was so lightly armored he looked almost naked beside the knight. He wore only a shirt of black oiled ringmail over boiled leather, a round steel halfhelm with a noseguard, and a mail coif. High leather boots with steel shinguards gave some protection to his legs, and discs of black iron were sewn into the fingers of his gloves. Yet Catelyn noted that the sellsword stood half a hand taller than his foe, with a longer reach… and Bronn was fifteen years younger, if she was any judge.  They knelt in the grass beneath the weeping woman, facing each other, with Lannister between them. The septon removed a faceted crystal sphere from the soft cloth bag at his waist. He lifted it high above his head, and the light shattered. Rainbows danced across the Imp’s face. In a high, solemn, singsong voice, the septon asked the gods to look down and bear witness, to find the truth in this man’s soul, to grant him life and freedom if he was innocent, death if he was guilty. His voice echoed off the surrounding towers.  When the last echo had died away, the septon lowered his crystal and made a hasty departure. Tyrion leaned over and whispered something in Bronn’s ear before the guardsmen led him away. The sellsword rose laughing and brushed a blade of grass from his knee.  Robert Arryn, Lord of the Eyrie and Defender of the Vale, was fidgeting impatiently in his elevated chair.  When are they going to fight?  he asked plaintively.  Ser Vardis was helped back to his feet by one of his squires. The other brought him a triangular shield almost four feet tall, heavy oak dotted with iron studs. They strapped it to his left forearm. When Lysa’s master-at-arms offered Bronn a similar shield, the sellsword spat and waved it away. Three days growth of coarse black beard covered his jaw and cheeks, but if he did not shave it was not for want of a razor; the edge of his sword had the dangerous glimmer of steel that had been honed every day for hours, until it was too sharp to touch."
}