{
  "id": "2dddc6741b5511cfdbb4a769524ffc0f933a5308",
  "text": " And the dragons were everywhere. The Great Hall was a dragon lying on its belly. Men entered through its open mouth. The kitchens were a dragon curled up in a ball, with the smoke and steam of the ovens vented through its nostrils. The towers were dragons hunched above the walls or poised for flight; the Windwyrm seemed to scream defiance, while Sea Dragon Tower gazed serenely out across the waves. Smaller dragons framed the gates. Dragon claws emerged from walls to grasp at torches, great stone wings enfolded the smith and armory, and tails formed arches, bridges, and exterior stairs.  Davos had often heard it said that the wizards of Valyria did not cut and chisel as common masons did, but worked stone with fire and magic as a potter might work clay. But now he wondered. What if they were real dragons, somehow turned to stone?   If the red woman brings them to life, the castle will come crashing down, I am thinking. What kind of dragons are full of rooms and stairs and furniture? And windows. And chimneys. And privy shafts.   Davos turned to find Salladhor Saan beside him.  Does this mean you have forgiven my treachery, Salla?   The old pirate wagged a finger at him.  Forgiving, yes. Forgetting, no. All that good gold on Claw Isle that might have been mine, it makes me old and tired to think of it. When I die impoverished, my wives and concubines will curse you, Onion Lord. Lord Celtigar had many fine wines that now I am not tasting, a sea eagle he had trained to fly from the wrist, and a magic horn to summon krakens from the deep. Very useful such a horn would be, to pull down Tyroshi and other vexing creatures. But do I have this horn to blow? No, because the king made my old friend his Hand.  He slipped his arm through Davos’s and said,  The queen’s men love you not, old friend. I am hearing that a certain Hand has been making friends of his own. This is true, yes?   You hear too much, you old pirate. A smuggler had best know men as well as tides, or he would not live to smuggle long. The queen’s men might remain fervent followers of the Lord of Light, but the lesser folk of Dragonstone were drifting back to the gods they’d known all their lives. They said Stannis was ensorceled, that Melisandre had turned him away from the Seven to bow before some demon out of shadow, and… worst sin of all… that she and her god had failed him. And there were knights and lordlings who felt the same. Davos had sought them out, choosing them with the same care with which he’d once picked his crews. Ser Gerald Gower fought stoutly on the Blackwater, but afterward had been heard to say that R’hllor must be a feeble god to let his followers be chased off by a dwarf and a dead man. Ser Andrew Estermont was the king’s cousin, and had served as his squire years ago. The Bastard of Nightsong had commanded the rearguard that allowed Stannis to reach the safety of Salladhor Saan’s galleys, but he worshiped the Warrior with a faith as fierce as he was. King’s men, not queen’s men. But it would not do to boast of them.   A certain Lysene pirate once told me that a good smuggler stays out of sight,  Davos replied carefully.  Black sails, muffled oars, and a crew that knows how to hold their tongues.   The Lyseni laughed.  A crew with no tongues is even better. Big strong mutes who cannot read or write.  But then he grew more somber.  But I am glad to know that someone watches your back, old friend. Will the king give the boy to the red priestess, do you think? One little dragon could end this great big war.   Old habit made him reach for his luck, but his fingerbones no longer hung about his neck, and he found nothing.  He will not do it,  said Davos.  He could not harm his own blood.    Lord Renly will be glad to hear this.    Renly was a traitor in arms. Edric Storm is innocent of any crime. His Grace is a just man.   Salla shrugged.  We shall be seeing. Or you shall. For myself, I am returning to sea. Even now, rascally smugglers may be sailing across the Blackwater Bay, hoping to avoid paying their lord’s lawful duties.  He slapped Davos on the back.  Take care. You with your mute friends. You are grown so very great now, yet the higher a man climbs the farther he has to fall.   Davos reflected on those words as he climbed the steps of Sea Dragon Tower to the maester’s chambers below the rookery. He did not need Salla to tell him that he had risen too high. I cannot read, I cannot write, the lords despise me, I know nothing of ruling, how can I be the King’s Hand? I belong on the deck of a ship, not in a castle tower.  He had said as much to Maester Pylos.  You are a notable captain,  the maester replied.  A captain rules his ship, does he not? He must navigate treacherous waters, set his sails to catch the rising wind, know when a storm is coming and how best to weather it. This is much the same.   Pylos meant it kindly, but his assurances rang hollow.  It is not at all the same!  Davos had protested.  A kingdom’s not a ship… and a good thing, or this kingdom would be sinking."
}