{
  "id": "2dfb152b42405ce04af4d0d3f7f0a1d22ca65651",
  "text": "  The smallfolk hereabouts shunned the place, Tom told her; it was said to be haunted by the ghosts of the children of the forest who had died here when the Andal king named Erreg the Kinslayer had cut down their grove. Arya knew about the children of the forest, and about the Andals too, but ghosts did not frighten her. She used to hide in the crypts of Winterfell when she was little, and play games of come-into-my-castle and monsters and maidens amongst the stone kings on their thrones.  Yet even so, the hair on the back of her neck stood up that night. She had been asleep, but the storm woke her. The wind pulled the coverlet right off her and sent it swirling into the bushes. When she went after it she heard voices.  Beside the embers of their campfire, she saw Tom, Lem, and Greenbeard talking to a tiny little woman, a foot shorter than Arya and older than Old Nan, all stooped and wrinkled and leaning on a gnarled black cane. Her white hair was so long it came almost to the ground. When the wind gusted it blew about her head in a fine cloud. Her flesh was whiter, the color of milk, and it seemed to Arya that her eyes were red, though it was hard to tell from the bushes.  The old gods stir and will not let me sleep,  she heard the woman say.  I dreamt I saw a shadow with a burning heart butchering a golden stag, aye. I dreamt of a man without a face, waiting on a bridge that swayed and swung. On his shoulder perched a drowned crow with seaweed hanging from his wings. I dreamt of a roaring river and a woman that was a fish. Dead she drifted, with red tears on her cheeks, but when her eyes did open, oh, I woke from terror. All this I dreamt, and more. Do you have gifts for me, to pay me for my dreams?    Dreams,  grumbled Lem Lemoncloak,  what good are dreams? Fish women and drowned crows. I had a dream myself last night. I was kissing this tavern wench I used to know. Are you going to pay me for that, old woman?    The wench is dead,  the woman hissed.  Only worms may kiss her now.  And then to Tom Sevenstrings she said,  I’ll have my song or I’ll have you gone.   So the singer played for her, so soft and sad that Arya only heard snatches of the words, though the tune was half-familiar. Sansa would know it, I bet. Her sister had known all the songs, and she could even play a little, and sing so sweetly. All I could ever do was shout the words.  The next morning the little white woman was nowhere to be seen. As they saddled their horses, Arya asked Tom Sevenstrings if the children of the forest still dwelled on High Heart. The singer chuckled.  Saw her, did you?    Was she a ghost?    Do ghosts complain of how their joints creak? No, she’s only an old dwarf woman. A queer one, though, and evil-eyed. But she knows things she has no business knowing, and sometimes she’ll tell you if she likes the look of you.    Did she like the looks of you?  Arya asked doubtfully.  The singer laughed.  The sound of me, at least. She always makes me sing the same bloody song, though. Not a bad song, mind you, but I know others just as good.  He shook his head.  What matters is, we have the scent now. You’ll soon be seeing Thoros and the lightning lord, I’ll wager.    If you’re their men, why do they hide from you?   Tom Sevenstrings rolled his eyes at that, but Harwin gave her an answer.  I wouldn’t call it hiding, milady, but it’s true, Lord Beric moves about a lot, and seldom lets on what his plans are. That way no one can betray him. By now there must be hundreds of us sworn to him, maybe thousands, but it wouldn’t do for us all to trail along behind him. We’d eat the country bare, or get butchered in a battle by some bigger host. The way we’re scattered in little bands, we can strike in a dozen places at once, and be off somewhere else before they know. And when one of us is caught and put to the question, well, we can’t tell them where to find Lord Beric no matter what they do to us.  He hesitated.  You know what it means, to be put to the question?   Arya nodded.  Tickling, they called it. Polliver and Raff and all.  She told them about the village by the Gods Eye where she and Gendry had been caught, and the questions that the Tickler had asked.  Is there gold hidden in the village?  he would always begin.  Silver, gems? Is there food? Where is Lord Beric? Which of you village folk helped him? Where did he go? How many men did he have with him? How many knights? How many bowmen? How many were horsed? How are they armed? How many wounded? Where did they go, did you say?  Just thinking of it, she could hear the shrieks again, and smell the stench of blood and shit and burning flesh.  He always asked the same questions,  she told the outlaws solemnly,  but he changed the tickling every day.    No child should be made to suffer that,  Harwin said when she was done.  The Mountain lost half his men at the Stone Mill, we hear. Might be this Tickler’s floating down the Red Fork even now, with fish biting at his face. If not, well, it’s one more crime they’ll answer for."
}