{
  "id": "303d2c1fda15369a823bf2d3a9d8624d5435a4ef",
  "text": " They might not love the Tyrells half so well if they could see us now.  Sansa tasted a spoonful of soup and pushed the bowl away.  Not to your liking, my lady?  Tyrion asked.   There’s to be so much, my lord. I have a little tummy.  She fiddled nervously with her hair and looked down the table to where Joffrey sat with his Tyrell queen.  Does she wish it were her in Margaery’s place? Tyrion frowned. Even a child should have better sense. He turned away, wanting distraction, but everywhere he looked were women, fair fine beautiful happy women who belonged to other men. Margaery, of course, smiling sweetly as she and Joffrey shared a drink from the great seven-sided wedding chalice. Her mother Lady Alerie, silver-haired and handsome, still proud beside Mace Tyrell. The queen’s three young cousins, bright as birds. Lord Merryweather’s dark-haired Myrish wife with her big black sultry eyes. Ellaria Sand among the Dornishmen (Cersei had placed them at their own table, just below the dais in a place of high honor but as far from the Tyrells as the width of the hall would allow), laughing at something the Red Viper had told her.  And there was one woman, sitting almost at the foot of the third table on the left… the wife of one of the Fossoways, he thought, and heavy with his child. Her delicate beauty was in no way diminished by her belly, nor was her pleasure in the food and frolics. Tyrion watched as her husband fed her morsels off his plate. They drank from the same cup, and would kiss often and unpredictably. Whenever they did, his hand would gently rest upon her stomach, a tender and protective gesture.  He wondered what Sansa would do if he leaned over and kissed her right now. Flinch away, most likely. Or be brave and suffer through it, as was her duty. She is nothing if not dutiful, this wife of mine. If he told her that he wished to have her maidenhead tonight, she would suffer that dutifully as well, and weep no more than she had to.  He called for more wine. By the time he got it, the second course was being served, a pastry coffyn filled with pork, pine nuts, and eggs. Sansa ate no more than a bite of hers, as the heralds were summoning the first of the seven singers.  Grey-bearded Hamish the Harper announced that he would perform  for the ears of gods and men, a song ne’er heard before in all the Seven Kingdoms.  He called it  Lord Renly’s Ride.   His fingers moved across the strings of the high harp, filling the throne room with sweet sound.  From his throne of bones the Lord of Death looked down on the murdered lord,  Hamish began, and went on to tell how Renly, repenting his attempt to usurp his nephew’s crown, had defied the Lord of Death himself and crossed back to the land of the living to defend the realm against his brother.  And for this poor Symon wound up in a bowl of brown, Tyrion mused. Queen Margaery was teary-eyed by the end, when the shade of brave Lord Renly flew to Highgarden to steal one last look at his true love’s face.  Renly Baratheon never repented of anything in his life,  the Imp told Sansa,  but if I’m any judge, Hamish just won himself a gilded lute.   The Harper also gave them several more familiar songs.  A Rose of Gold  was for the Tyrells, no doubt, as  The Rains of Castamere  was meant to flatter his father.  Maiden, Mother, and Crone  delighted the High Septon, and  My Lady Wife  pleased all the little girls with romance in their hearts, and no doubt some little boys as well. Tyrion listened with half a ear, as he sampled sweetcorn fritters and hot oatbread baked with bits of date, apple, and orange, and gnawed on the rib of a wild boar.  Thereafter dishes and diversions succeeded one another in a staggering profusion, buoyed along upon a flood of wine and ale. Hamish left them, his place taken by a smallish elderly bear who danced clumsily to pipe and drum while the wedding guests ate trout cooked in a crust of crushed almonds. Moon Boy mounted his stilts and strode around the tables in pursuit of Lord Tyrell’s ludicrously fat fool Butterbumps, and the lords and ladies sampled roast herons and cheese-and-onion pies. A troupe of Pentoshi tumblers performed cartwheels and handstands, balanced platters on their bare feet, and stood upon each other’s shoulders to form a pyramid. Their feats were accompanied by crabs boiled in fiery eastern spices, trenchers filled with chunks of chopped mutton stewed in almond milk with carrots, raisins, and onions, and fish tarts fresh from the ovens, served so hot they burned the fingers.  Then the heralds summoned another singer; Collio Quaynis of Tyrosh, who had a vermilion beard and an accent as ludicrous as Symon had promised. Collio began with his version of  The Dance of the Dragons,  which was more properly a song for two singers, male and female. Tyrion suffered through it with a double helping of honey-ginger partridge and several cups of wine. A haunting ballad of two dying lovers amidst the Doom of Valyria might have pleased the hall more if Collio had not sung it in High Valyrian, which most of the guests could not speak."
}