{
  "id": "32ca715863c0153b7f6724c23e426388dc77ec67",
  "text": " \"Harry Potter set Dobby free!\"  \"Least I could do, Dobby,\" said Harry, grinning. \"Just promise never to try and save my life again.\"  The elf's ugly brown face split suddenly into a wide, toothy smile.  \"I've just got one question, Dobby,\" said Harry as Dobby pulled on Harry's sock with shaking hands. \"You told me all this had nothing to do with He-Who-Must-Not-Be-Named, remember? Well --\"  \"It was a clue, sir,\" said Dobby, his eyes widening, as though this was obvious. \"Was giving you a clue. The Dark Lord, before he changed his name, could be freely named, you see?\"  \"Right,\" said Harry weakly. \"Well, Id better go. There's a feast, and my friend Hermione should be awake by now .....  Dobby threw his arms around Harry's middle and hugged him.  \"Harry Potter is greater by far than Dobby knew!\" he sobbed. \"Farewell, Harry Potter!\"  And with a final loud crack, Dobby disappeared.  Harry had been to several Hogwarts feasts, but never one quite like this. Everybody was in their pajamas, and the celebration lasted all night. Harry didn't know whether the best bit was Hermione running toward him, screaming \"You solved it! You solved it!\" or Justin hurrying over from the Hufflepuff table to wring. his hand and apologize endlessly for suspecting him, or Hagrid turning up at half past three, cuffing Harry and Ron so hard on the shoulders that they were knocked into their plates of trifle, or his and Ron's four hundred points for Gryffindor securing the House Cup for the second year running, or Professor McGonagall standing up to  *339*  tell them all that the exams had been canceled as a school treat (\"Oh, no!\" said Hermione), or Dumbledore announcing that, unfortunately, Professor Lockhart would be unable to return next year, owing to the fact that he needed to go away and get his memory back. Quite a few of the teachers joined in the cheering that greeted this news.  \"Shame,\" said Ron, helping himself to a jam doughnut. \"He was starting to grow on me.\"  The rest of the final term passed in a haze of blazing sunshine. Hogwarts was back to normal with only a few, small differences - Defense Against the Dark Arts classes were canceled (\"but we've had plenty of practice at that anyway,\" Ron told a disgruntled Hermione) and Lucius Malfoy had been sacked as a school governor. Draco was no longer strutting around the school as though he owned the place. On the contrary, he looked resentful and sulky. On the other hand, Ginny Weasley was perfectly happy again.  Too soon, it was time for the journey home on the Hogwarts Express. Harry, Ron, Hermione, Fred, George, and Ginny got a compartment to themselves. They made the most of the last few hours in which they were allowed to do magic before the holidays. They played Exploding Snap, set off the very last of Fred and George's Filibuster fireworks, and practiced disarming each other by magic. Harry was getting very good at it.  They were almost at King's Cross when Harry remembered something.  \"Ginny - what did you see Percy doing, that he didn't want you to tell anyone?\"  *340*  \"Oh, that,\" said Ginny, giggling. \"Well - Percy's got a girlfriend.\" Fred dropped a stack of books on George's head.  \"What?\"  \"It's that Ravenclaw prefect, Penelope Clearwater,\" said Ginny. \"That's who he was writing to all last summer. He's been meeting her all over the school in secret. I walked in on them kissing in an empty classroom one day. He was so upset when she was -- you know - attacked. You won't tease him, will you?\" she added anxiously.  \"Wouldn't dream of it,\" said Fred, who was looking like his birthday had come early.  \"Definitely not,\" said George, sniggering.  The Hogwarts Express slowed and finally stopped.  Harry pulled out his quill and a bit of parchment and turned to Ron and Hermione.  \"This is called a telephone number,\" he told Ron, scribbling it twice, tearing the parchment in two, and handing it to them. \"I told your dad how to use a telephone last summer - he'll know. Call me at the Dursleys', okay? I can't stand another two months with only Dudley to talk to ......  \"Your aunt and uncle will be proud, though, won't they?\" said Hermione as they got off the train and joined the crowd thronging toward the enchanted barrier. \"When they hear what you did this year?\"  \"Proud?\" said Harry. \"Are you crazy? All those times I could've died, and I didn't manage it? They'll be furious ......  And together they walked back through the gateway to the Muggle world. '  *341*  Harry Potter and the Prisoner of Azkaban  by J.K. Rowling  CHAPTER ONE  OWL POST  Harry Potter was a highly unusual boy in many ways. For one thing, he hated the summer holidays more than any other time of year. For another, he really wanted to do his homework but was forced to do it in secret, in the dead of night. And he also happened to be a wizard.  It was nearly midnight, and he was lying on his stomach in bed, the blankets drawn right over his head like a tent, a flashlight in one hand and a large leather-bound book (A History of Magic by Bathilda Bagshot) propped open against the pillow."
}