{
  "id": "32e4c77b586db8c26ad4e3ac27744f20eb8d9eb2",
  "text": " They tore across the vegetable gardens to the greenhouses, paused for a moment behind them, then set off again, fast as they could, skirting around the Whomping Willow, tearing toward the shelter of the forest....  Safe in the shadows of the trees, Harry turned around; seconds later, Hermione arrived beside him, panting.  \"Right,\" she gasped. \"We need to sneak over to Hagrid's.... Keep out of sight, Harry....\"  They made their way silently through the trees, keeping to the very edge of the forest. Then, as they glimpsed the front of Hagrid's house, they heard a knock upon his door. They moved quickly behind a wide oak trunk and peered out from either side. Hagrid had appeared in his doorway, shaking and white, looking around to see who had knocked. And Harry heard his own voice.  \"It's us. We're wearing the Invisibility Cloak. Let us in and we can take it off.\"  \"Yeh shouldn've come!\" Hagrid whispered. He stood back, then shut the door quickly.  \"This is the weirdest thing we've ever done,\" Harry said fervently.  \"Let's move along a bit,\" Hermione whispered. \"We need to get nearer to Buckbeak!\"  They crept through the trees until they saw the nervous hippogriff, tethered to the fence around Hagrid's pumpkin patch.  \"Now?\" Harry whispered.  \"No!\" said Hermione. \"If we steal him now, those Committee people will think Hagrid set him free! We've got to wait until they've seen he's tied outside!\"  \"That's going to give us about sixty seconds,\" said Harry. This was starting to seem impossible.  At that moment, there was a crash of breaking china from inside Hagrid's cabin.  \"That's Hagrid breaking the milk jug,\" Hermione whispered. \"I'm going to find Scabbers in a moment --\"  Sure enough, a few minutes later, they heard Hermione's shriek of surprise.  \"Hermione,\" said Harry suddenly, \"what if we -- we just run in there and grab Pettigrew --\"  \"No!\" said Hermione in a terrified whisper. \"Don't you understand? We're breaking one of the most important wizarding laws! Nobody's supposed to change time, nobody! You heard Dumbledore, if we're seen --\"  \"We'd only be seen by ourselves and Hagrid!\"  \"Harry, what do you think you'd do if you saw yourself bursting into Hagrid's house?\" said Hermione.  \"I'd -- I'd think I'd gone mad,\" said Harry, \"or I'd think there was some Dark Magic going on --\"  \"Exactly! You wouldn't understand, you might even attack yourself! Don't you see? Professor McGonagall told me what awful things have happened when wizards have meddled with time.... Loads of them ended up killing their past or future selves by mistake!\"  \"Okay!\" said Harry. \"It was just an idea, I just thought  But Hermione nudged him and pointed toward the castle. Harry moved his head a few inches to get a clear view of the distant front doors. Dumbledore, Fudge, the old Committee member, and Macnair the executioner were coming down the steps.  \"We're about to come out!\" Hermione breathed.  And sure enough, moments later, Hagrid's back door opened, and Harry saw himself, Ron, and Hermione walking out of it with Hagrid. It was, without a doubt, the strangest sensation of his life, standing behind the tree, and watching himself in the pumpkin patch.  \"It's Okay, Beaky, it's okay...\" Hagrid said to Buckbeak. Then he turned to Harry, Ron, and Hermione. \"Go on. Get goin'.\"  \"Hagrid, we can't --\"  \"We'll tell them what really happened  \"They can't kill him --\"  \"Go! It's bad enough without you lot in trouble an' all!\"  Harry watched the Hermione in the pumpkin patch throw the Invisibility Cloak over him and Ron.  \"Go quick. Don' listen....\"  There was a knock on Hagrid's front door. The execution party had arrived. Hagrid turned, around and headed back into his cabin, leaving the back door ajar. Harry watched the grass flatten in patches all around the cabin and heard three pairs of feet retreating. He, Ron, and Hermione had gone... but the Harry and Hermione hidden in the trees could now hear what was happening inside the cabin through the back door.  \"Where is the beast?\" came the cold voice of Macnair.  \"Out -- outside,\" Hagrid croaked.  Harry pulled his head out of sight as Macnair's face appeared at Hagrid's window, staring out at Buckbeak. Then they heard Fudge.  \"We -- er -- have to read you the official notice of execution, Hagrid. I'll make it quick. And then you and Macnair need to sign it. Macnair, You're supposed to listen too, that's procedure --\"  Macnair's face vanished from the window. It was now or never.  \"Wait here,\" Harry whispered to Hermione. \"I'll do it.\"  As Fudge's voice started again, Harry darted out from behind his tree, vaulted the fence into the pumpkin patch, and approached Buckbeak.  \"It is the decision of the Committee for the Disposal of Dangerous Creatures that the hippogriff Buckbeak, hereafter called the condemned, shall he executed on the sixth of June at sundown --\"  Careful not to blink, Harry stared up into Buckbeak's fierce orange eyes once more and bowed. Buckbeak sank to his scaly knees and then stood up again."
}