{
  "id": "3307510affe77922391d78a96253d9eba0dfef85",
  "text": " Weasley....\" He consulted his parchment list.  \"About a quarter of a mile's walk over there, first field you come to.  Site manager's called Mr. Roberts.  Diggory ... second field ... ask for Mr. Payne.\" \"Thanks, Basil,\" said Mr. Weasley, and he beckoned everyone to follow him. They set off across the deserted moor, unable to make out much through the mist.  After about twenty minutes, a small stone cottage next to a gate swam into view.  Beyond it, Harry could just make out the ghostly shapes of hundreds and hundreds of tents, rising up the gentle slope of a large field toward a dark wood on the horizon.  They said good-bye to the Diggorys and approached the cottage door. A man was standing in the doorway, looking out at the tents.  Harry knew at a glance that this was the only real Muggle for several acres.  When he heard their footsteps, he turned his head to look at them. \"Morning!\" said Mr. Weasley brightly. \"Morning,\" said the Muggle. \"Would you be Mr. Roberts?\" \"Aye, I would,\" said Mr. Roberts. \"And who're you?\" \"Weasley - two tents, booked a couple of days ago?\" \"Aye,\" said Mr. Roberts, consulting a list tacked to the door.  \"You've got a space up by the wood there.  Just the one night?\" \"That's it,\" said Mr. Weasley. \"You'll be paying now, then?\" said Mr. Roberts. \"Ah - right - certainly -\" said Mr. Weasley.  He retreated a short distance from the cottage and beckoned Harry toward him.  \"Help me, Harry,\" he muttered, pulling a roll of Muggle money from his pocket and starting to peel the notes apart.  \"This one's a - a - a ten?  Ah yes, I see the little number on it now... So this is a five?\" \"A twenty,\" Harry corrected him in an undertone, uncomfortably aware of Mr. Roberts trying to catch every word. \"Ah yes, so it is.... I don't know, these little bits of paper...\" \"You foreign?\" said Mr. Roberts as Mr. Weasley returned with the correct notes. \"Foreign?\" repeated Mr. Weasley, puzzled. \"You're not the first one who's had trouble with money,\" said Mr. Roberts, scrutinizing Mr. Weasley closely. \"I had two try and pay me with great gold coins the size of hubcaps ten minutes ago.\" \"Did you really?\" said Mr. Weasley nervously. Mr. Roberts rummaged around in a tin for some change. \"Never been this crowded,\" he said suddenly, looking out over the misty field again. \"Hundreds of pre-bookings.  People usually just turn up....\" \"Is that right?\" said Mr. Weasley, his hand held out for his change, but Mr. Roberts didn't give it to him. \"Aye,\" he said thoughtfully. \"People from all over.  Loads of foreigners.  And not just foreigners.  Weirdos, you know?  There's a bloke walking 'round in a kilt and a poncho.\" \"Shouldn't he?\"  said Mr. Weasley anxiously \"It's like some sort of... I dunno ... like some sort of rally,\" said Mr. Roberts.  \"They all seem to know each other.  Like a big party.\" At that moment, a wizard in plus-fours appeared out of thin air next to Mr. Roberts's front door. \"Obliviate!\" he said sharply, pointing his wand at Mr. Roberts. Instantly, Mr. Roberts's eyes slid out of focus, his brows unknitted, and a took of dreamy unconcern fell over his face.  Harry recognized the symptoms of one who had just had his memory modified. \"A map of the campsite for you,\" Mr. Roberts said placidly to Mr. Weasley.  \"And your change.\" \"Thanks very much,\" said Mr. Weasley. The wizard in plus-fours accompanied them toward the gate to the campsite.  He looked exhausted:  His chin was blue with stubble and there were deep purple shadows under his eyes.  Once out of earshot of Mr. Roberts, he muttered to Mr. Weasley, \"Been having a lot of trouble with him.  Needs a Memory Charm ten times a day to keep him happy.  And Ludo Bagman's not helping.  Trotting around talking about Bludgers and Quaffles at the top of his voice, not a worry about anti-Muggle security Blimey, I'll be glad when this is over.  See you later, Arthur.\" He Disapparated. \"I thought Mr. Bagman was Head of Magical Games and Sports,\" said Ginny, looking surprised.  \"He should know better than to talk about Bludgers near Muggles, shouldn't he?\" \"He should,\" said Mr. Weasley, smiling, and leading them through the gates into the campsite, \"but Ludo's always been a bit ... well . . . lax about security.  You couldn't wish for a more enthusiastic head of the sports department though.  He played Quidditch for England himself, you know.  And he was the best Beater the Wimbourne Wasps ever had.\" They trudged up the misty field between long rows of tents.  Most looked almost ordinary; their owners had clearly tried to make them as Muggle-like as possible, but had slipped up by adding chimneys, or bellpulls, or weather vanes.  However, here and there was a tent so obviously magical that Harry could hardly be surprised that Mr. Roberts was getting suspicious.  Halfway up the field stood an extravagant confection of striped silk like a miniature palace, with several live peacocks tethered at the entrance.  A little farther on they passed a tent that had three floors and several turrets; and a short way beyond that was a tent that had a front garden attached, complete with birdbath, sundial, and fountain."
}