{
  "id": "331a5930d55fa482b2c9a54c2ebd60ff11091a84",
  "text": " Brella will want help with the bathwater.  She bent over to give him one last kiss, upon the brow.  My giant of Lannister. I love you so.   And I love you as well, sweetling. A whore she might well be, but she deserved better than what he had to give her. I will wed her to Ser Tallad. He seems a decent man. And tall…      Sansa   That was such a sweet dream, Sansa thought drowsily. She had been back in Winterfell, running through the godswood with her Lady. Her father had been there, and her brothers, all of them warm and safe. If only dreaming could make it so…  She threw back the coverlets. I must be brave. Her torments would soon be ended, one way or the other. If Lady was here, I would not be afraid. Lady was dead, though; Robb, Bran, Rickon, Arya, her father, her mother, even Septa Mordane. All of them are dead but me. She was alone in the world now.  Her lord husband was not beside her, but she was used to that. Tyrion was a bad sleeper and often rose before the dawn. Usually she found him in the solar, hunched beside a candle, lost in some old scroll or leatherbound book. Sometimes the smell of the morning bread from the ovens took him to the kitchens, and sometimes he would climb up to the roof garden or wander all alone down Traitor’s Walk.  She threw back the shutters and shivered as gooseprickles rose along her arms. There were clouds massing in the eastern sky, pierced by shafts of sunlight. They look like two huge castles afloat in the morning sky. Sansa could see their walls of tumbled stone, their mighty keeps and barbicans. Wispy banners swirled from atop their towers and reached for the fast-fading stars. The sun was coming up behind them, and she watched them go from black to grey to a thousand shades of rose and gold and crimson. Soon the wind mushed them together, and there was only one castle where there had been two.  She heard the door open as her maids brought the hot water for her bath. They were both new to her service; Tyrion said the women who’d tended to her previously had all been Cersei’s spies, just as Sansa had always suspected.  Come see,  she told them.  There’s a castle in the sky.   They came to have a look.  It’s made of gold.  Shae had short dark hair and bold eyes. She did all that was asked of her, but sometimes she gave Sansa the most insolent looks.  A castle all of gold, there’s a sight I’d like to see.    A castle, is it?  Brella had to squint.  That tower’s tumbling over, looks like. It’s all ruins, that is.   Sansa did not want to hear about falling towers and ruined castles. She closed the shutters and said,  We are expected at the queen’s breakfast. Is my lord husband in the solar?    No, m’lady,  said Brella.  I have not seen him.    Might be he went to see his father,  Shae declared.  Might be the King’s Hand had need of his counsel.   Brella gave a sniff.  Lady Sansa, you’ll be wanting to get into the tub before the water gets too cool.   Sansa let Shae pull her shift up over her head and climbed into the big wooden tub. She was tempted to ask for a cup of wine, to calm her nerves. The wedding was to be at midday in the Great Sept of Baelor across the city. And come evenfall the feast would be held in the throne room; a thousand guests and seventy-seven courses, with singers and jugglers and mummers. But first came breakfast in the Queen’s Ballroom, for the Lannisters and the Tyrell men—the Tyrell women would be breaking their fast with Margaery—and a hundred odd knights and lordlings. They have made me a Lannister, Sansa thought bitterly.  Brella sent Shae to fetch more hot water while she washed Sansa’s back.  You are trembling, m’lady.    The water is not hot enough,  Sansa lied.  Her maids were dressing her when Tyrion appeared, Podrick Payne in tow.  You look lovely, Sansa.  He turned to his squire.  Pod, be so good as to pour me a cup of wine.    There will be wine at the breakfast, my lord,  Sansa said.   There’s wine here. You don’t expect me to face my sister sober, surely? It’s a new century, my lady. The three hundredth year since Aegon’s Conquest.  The dwarf took a cup of red from Podrick and raised it high.  To Aegon. What a fortunate fellow. Two sisters, two wives, and three big dragons, what more could a man ask for?  He wiped his mouth with the back of his hand.  The Imp’s clothing was soiled and unkempt, Sansa noticed; it looked as though he’d slept in it.  Will you be changing into fresh garb, my lord? Your new doublet is very handsome.    The doublet is handsome, yes.  Tyrion put the cup aside.  Come, Pod, let us see if we can find some garments to make me look less dwarfish. I would not want to shame my lady wife.   When the Imp returned a short time later, he was presentable enough, and even a little taller. Podrick Payne had changed as well, and looked almost a proper squire for once, although a rather large red pimple in the fold beside his nose spoiled the effect of his splendid purple, white, and gold raiment. He is such a timid boy."
}