{
  "id": "332c62b6303f1424c12251965bd3fcd4cfb5402c",
  "text": "  She took his hands in hers and looked up into his dark suspicious eyes. Sometimes he thinks of me as a child he must protect, and sometimes as a woman he would like to bed, but does he ever truly see me as his queen?  I am not the frightened girl you met in Pentos. I have counted only fifteen name days, true… but I am as old as the crones in the dosh khaleen and as young as my dragons, Jorah. I have borne a child, burned a khal, and crossed the red waste and the Dothraki sea. Mine is the blood of the dragon.    As was your brother’s,  he said stubbornly.   I am not Viserys.    No,  he admitted.  There is more of Rhaegar in you, I think, but even Rhaegar could be slain. Robert proved that on the Trident, with no more than a warhammer. Even dragons can die.    Dragons die.  She stood on her toes to kiss him lightly on an unshaven cheek.  But so do dragonslayers.       BRAN  Meera moved in a wary circle, her net dangling loose in her left hand, the slender three-pronged frog spear poised in her right. Summer followed her with his golden eyes, turning, his tail held stiff and tall. Watching, watching…   Yai!  the girl shouted, the spear darting out. The wolf slid to the left and leapt before she could draw back the spear. Meera cast her net, the tangles unfolding in the air before her. Summer’s leap carried him into it. He dragged it with him as he slammed into her chest and knocked her over backward. Her spear went spinning away. The damp grass cushioned her fall but the breath went out of her in an  Oof.  The wolf crouched atop her.  Bran hooted.  You lose.    She wins,  her brother Jojen said.  Summer’s snared.   He was right, Bran saw. Thrashing and growling at the net, trying to rip free, Summer was only ensnaring himself worse. Nor could he bite through.  Let him out.   Laughing, the Reed girl threw her arms around the tangled wolf and rolled them both. Summer gave a piteous whine, his legs kicking against the cords that bound them. Meera knelt, undid a twist, pulled at a corner, tugged deftly here and there, and suddenly the direwolf was bounding free.   Summer, to me.  Bran spread his arms.  Watch,  he said, an instant before the wolf bowled into him. He clung with all his strength as the wolf dragged him bumping through the grass. They wrestled and rolled and clung to each other, one snarling and yapping, the other laughing. In the end it was Bran sprawled on top, the mud-spattered direwolf under him.  Good wolf,  he panted. Summer licked him across the ear.  Meera shook her head.  Does he never grow angry?    Not with me.  Bran grabbed the wolf by his ears and Summer snapped at him fiercely, but it was all in play.  Sometimes he tears my garb but he’s never drawn blood.    Your blood, you mean. If he’d gotten past my net…    He wouldn’t hurt you. He knows I like you.  All of the other lords and knights had departed within a day or two of the harvest feast, but the Reeds had stayed to become Bran’s constant companions. Jojen was so solemn that Old Nan called him  little grandfather,  but Meera reminded Bran of his sister Arya. She wasn’t scared to get dirty, and she could run and fight and throw as good as a boy. She was older than Arya, though; almost sixteen, a woman grown. They were both older than Bran, even though his ninth name day had finally come and gone, but they never treated him like a child.   I wish you were our wards instead of the Walders.  He began to struggle toward the nearest tree. His dragging and wriggling was unseemly to watch, but when Meera moved to lift him he said,  No, don’t help me.  He rolled clumsily and pushed and squirmed backward, using the strength of his arms, until he was sitting with his back to the trunk of a tall ash.  See, I told you.  Summer lay down with his head in Bran’s lap.  I never knew anyone who fought with a net before,  he told Meera while he scratched the direwolf between the ears.  Did your master-at-arms teach you net-fighting?    My father taught me. We have no knights at Greywater. No master-at-arms, and no maester.    Who keeps your ravens?   She smiled.  Ravens can’t find Greywater Watch, no more than our enemies can.    Why not?    Because it moves,  she told him.  Bran had never heard of a moving castle before. He looked at her uncertainly, but he couldn’t tell whether she was teasing him or not.  I wish I could see it. Do you think your lord father would let me come visit when the war is over?    You would be most welcome, my prince. Then or now.    Now?  Bran had spent his whole life at Winterfell. He yearned to see far places.  I could ask Ser Rodrik when he returns.  The old knight was off east, trying to set to rights the trouble there. Roose Bolton’s bastard had started it by seizing Lady Hornwood as she returned from the harvest feast, marrying her that very night even though he was young enough to be her son. Then Lord Manderly had taken her castle. To protect the Hornwood holdings from the Boltons, he had written, but Ser Rodrik had been almost as angry with him as with the bastard."
}