{
  "id": "3481696f17563e44f4fe2a85aba2db72d25224a0",
  "text": " I wish to goodness you had not lost him.\"  The  dwarves  wanted  to  know  why  he  had  ever  been  brought  at  all,  why  he  could not  stick  to his  friends  and  come  along with  them,  and why  the wizard had  not chosen someone with more sense. \"He has been more trouble than use so far,\"  said  one.  \"If  we  have  got  to'  go  back  now  into  those  abominable  tunnels  to  look  for him, then drat him, I say.\"  Gandalf answered angrily: \"I brought him, and  I don't bring  things  that are of  no use. Either you help me to look for him, or I go and leave you here to get out of  the mess as best you can yourselves. If we can only find him again, you will thank  me before all is over. Whatever did you want to go and drop him for, Dori?\"  \"You would  have  dropped  him,\"  said Dori,  \"if a goblin had suddenly grabbed  your  leg  from  behind  in  the  dark,  tripped  up  your  feet,  and  kicked  you  in  the  back!\"  \"Then why didn't you pick him up again?\"  \"Good  heavens!  Can  you  ask!  Goblins  fighting  and  biting  in  the  dark,  everybody falling over bodies  and hitting one another! You nearly chopped off my  head  with  Glamdring,  and  Thorin Was  stabbing  here  there  and  everywhere  with  Orcrist.  All  of  a  sudden  you  gave  one  of  your  blinding  flashes,  and  we  saw  the  goblins running back yelping. You shouted 'follow me everybody!' and everybody  ought  to  have  followed. We  thought  everybody  had. There was  no  time  to  count,  as  you  know  quite  well,  till  we  had  dashed  through  the  gate-guards,  out  of  the  lower  door,  and  helter-skelter  down  here.  And  here  we  are-without  the  burglar,  confusticate him!\"  \"And  here's  the  burglar!\"  said  Bilbo  stepping  down  into  the  middle  of  them,  and slipping off the ring.  Bless  me,  how  they  jumped!  Then  they  shouted  with  surprise  and  delight.  Gandalf was as astonished as any of  them, but probably more pleased than all the  others. He called to Balin and told him what he thought of a look-out man who let  people  walk  right  into  them  like  that  without  warning.  It  is  a  fact  that  Bilbo's  reputation  went  up  a  very  great  deal  with  the  dwarves  after  this.  If  they had  still  doubted  that  he  was  really  a  first-class  burglar,  in  spite  of Gandalf's words,  they  doubted  no  longer. Balin was  the most  puzzled  of  all;  but  everyone  said  it was  a  very clever bit of work.  Indeed Bilbo was  so  pleased with  their  praise  that he just chuckled inside and  said nothing whatever about  the  ring; and when  they asked him how he did  it, he  said: \"O, just crept along, you know-very carefully and quietly.\"   ####-\"Well,  it  is  the  first  time  that  even  a  mouse  has  crept  along  carefully  and  quietly  under my  very  nose  and  not  been  spotted,\"  said Balin,  \"and  I  take  off my  hood to you.\" Which he did.  \"Balin at your service,\" said he.  \"Your servant, Mr. Baggins,\" said Bilbo.  Then  they  wanted  to  know  all  about  his  adventures  after  they  had  lost  him,  and  he  sat  down  and  told  them  everything-except  about  the  finding  of  the  ring  (\"not  just  now\"  he  thought).  They  were  particularly  interested  in  the  riddle- competition, and shuddered most appreciatively at his description of Gollum.  \"And  then  I  couldn't  think  of  any  other  question with  him  sitting  beside me,\"  ended Bilbo; \"so I said  'what's in my pocket?' And he couldn't guess in three goes.  So I said: 'what about your promise? Show me the way out!' But he came at me to  kill  me,  and  I  ran,  and  fell  over,  and  he missed me  in  the  dark.  Then  I  followed  him,  because  I  heard  him  talking  to  himself.  He  thought  I  really  knew  the  way  out,  and  so  he  was  making  for  it.  And  then  he  sat  down  in  the  entrance,  and  I  could not get by. So I jumped over him and escaped, and ran down to the gate.\"  \"What about guards?\" they asked. \"Weren't there any?\"  \"O yes! lots of them; but I dodged 'em. I got stuck in the door, which was only  open a crack, and  I  lost  lots of buttons,\" he  said  sadly  looking at his  torn clothes.  \"But I squeezed through all right-and here I am.\"  The  dwarves  looked  at  him  with  quite  a  new  respect,  when  he  talked  about  dodging  guards,  jumping  over  Gollum,  and  squeezing  through,  as  if  it  was  not  very difficult or very alarming.  \"What  did  I  tell  you?\"  said  Gandalf  laughing.  \"Mr.  Baggins  has more  about  him than you guess.\" He gave Bilbo a queer look from under his bushy eyebrows,  as he said this, and the hobbit wondered if he guessed at the part of his tale that he  had left out.  Then he had questions of his own to ask, for if Gandalf had explained it all by  now  to  the  dwarves,  Bilbo  had  not  heard  it.  He  wanted  to  know  how  the  wizard  had turned up again, and where they had all got to now.   The wizard, to tell the truth, never minded explaining his cleverness more than  once, so now he had told Bilbo that both he and Elrond had been well aware of the  presence of evil goblins  in  that part of  the mountains."
}