{
  "id": "3515e2bbad32f848b78022f51bb1c71bbffa1200",
  "text": "  \"I was saying that Saturn was surely in a position of power in the heavens at the moment of your birth. . . . Your dark hair. . . your mean stature...tragic losses so young in life. . . I think I am right in saying, my dear, that you were born in midwinter?\" \"No,\" said Harry, \"I was born in July.\" Ron hastily turned his laugh into a hacking cough. Half an hour later, each of them had been given a complicated circular chart, and was attempting to fill in the position of the planets at their moment of birth.  It was dull work, requiring much consultation of timetables and calculation of angles. \"I've got two Neptunes here,\" said Harry after a while, frowning down at his piece of parchment, \"that can't be right, can it?\" \"Aaaaah,\" said Ron, imitating Professor Trelawney's mystical whisper, \"when two Neptunes appear in the sky, it is a sure sign that a midget in glasses is being born, Harry. . . .\" Seamus and Dean, who were working nearby, sniggered loudly, though not loudly enough to mask the excited squeals from Lavender Brown - \"Oh Professor, look! I think I've got an unaspected planet! Oooh, which one's that, Professor?\" \"It is Uranus, my dear,\" said Professor Trelawney, peering down at the chart. \"Can I have a look at Uranus too, Lavender?\" said Ron. Most unfortunately, Professor Trelawney heard him, and it was this, perhaps, that made her give them so much homework at the end of the class. \"A detailed analysis of the way the planetary movements in the coming month will affect you, with reference to your personal chart,\" she snapped, sounding much more like Professor McGonagall than her usual airy-fairy self.  \"I want it ready to hand in next Monday, and no excuses!\" \"Miserable old bat,\" said Ron bitterly as they joined the crowds descending the staircases back to the Great Hall and dinner.  \"That'll take all weekend, that will. . .\" \"Lots of homework?\" said Hermione brightly, catching up with them. \"Professor Vector didn't give us any at all!\" \"Well, bully for Professor Vector,\" said Ron moodily. They reached the entrance hall, which was packed with people queuing for dinner. They had just joined the end of the line, when a loud voice rang out behind them. \"Weasley!  Hey, Weasley!\" Harry, Ron, and Hermione turned.  Malfoy, Crabbe, and Goyle were standing there, each looking thoroughly pleased about something. \"What?\" said Ron shortly. \"Your dad's in the paper, Weasley!\"  said Malfoy, brandishing a copy of the Daily Prophet and speaking very loudly, so that everyone in the packed entrance hall could hear. \"Listen to this!  FURTHER MISTAKES AT THE MINISTRY OF MAGIC  It seems as though the Ministry of Magic's troubles are not yet at an end, writes Rita Skeeter, Special Correspondent. Recently under fire for its poor crowd control at the Quidditch World Cup, and still unable to account for the disappearance of one of its witches, the Ministry was plunged into fresh embarrassment yesterday by the antics of Arnold Weasley, of the Misuse of Muggle Artifacts Office.\"   Malfoy looked up.  \"Imagine them not even getting his name right, Weasley.  It's almost as though he's a complete nonentity, isn't it?\"  he crowed.  Everyone in the entrance hall was listening now.  Malfoy straightened the paper with a flourish and read on:  Arnold Weasley, who was charged with possession of a flying car two years ago, was yesterday involved in a tussle with several Muggle law-keepers (\"policemen\") over a number of highly aggressive dustbins. Mr. Weasley appears to have rushed to the aid of \"Mad-Eye\" Moody, the aged ex-Auror who retired from the Ministry when no longer able to tell the difference between a handshake and attempted murder. Unsurprisingly, Mr. Weasley found, upon arrival at Mr. Moody's heavily guarded house, that Mr. Moody had once again raised a false alarm. Mr. Weasley was forced to modify several memories before he could escape from the policemen, but refused to answer Daily Prophet questions about why he had involved the Ministry in such an undignified and potentially embarrassing scene.   \"And there's a picture, Weasley!\"  said Malfoy, flipping the paper over and holding it up.  \"A picture of your parents outside their house - if you can call it a house!  Your mother could do with losing a bit of weight, couldn't she?\" Ron was shaking with fury.  Everyone was staring at him. \"Get stuffed, Malfoy,\" said Harry.  \"C'mon, Ron. . .\"  \"Oh yeah, you were staying with them this summer, weren't you, Potter?\"  sneered Malfoy.  \"So tell me, is his mother really that porky, or is it just the picture?\" \"You know your mother, Malfoy?\"  said Harry - both he and Hermione had grabbed the back of Ron's robes to stop him from launching himself at Malfoy - \"that expression she's got, like she's got dung under her nose?  Has she always looked like that, or was it just because you were with her?\" Malfoy's pale face went slightly pink. \"Don't you dare insult my mother, Potter.\" \"Keep your fat mouth shut, then,\" said Harry, turning away."
}