{
  "id": "35cc63bc37d4a32bc8a28191e7db70806d5b83f4",
  "text": " George reckons he had a booger- flavored one once.\"  Ron picked up a green bean, looked at it carefully, and bit into a corner.  \"Bleaaargh -- see? Sprouts.\"  They had a good time eating the Every Flavor Beans. Harry got toast, coconut, baked bean, strawberry, curry, grass, coffee, sardine, and was even brave enough to nibble the end off a funny gray one Ron wouldn't touch, which turned out to be pepper.  The countryside now flying past the window was becoming wilder. The neat fields had gone. Now there were woods, twisting rivers, and dark green hills.  There was a knock on the door of their compartment and the round-faced boy Harry had passed on platform nine and threequarters came in. He looked tearful.  \"Sorry,\" he said, \"but have you seen a toad at all?\"  When they shook their heads, he wailed, \"I've lost him! He keeps getting away from me!\"  \"He'll turn up,\" said Harry.  \"Yes,\" said the boy miserably. \"Well, if you see him...\"  He left.  \"Don't know why he's so bothered,\" said Ron. \"If I'd brought a toad I'd lose it as quick as I could. Mind you, I brought Scabbers, so I can't talk.\"  The rat was still snoozing on Ron's lap.  \"He might have died and you wouldn't know the difference,\" said Ron in disgust. \"I tried to turn him yellow yesterday to make him more interesting, but the spell didn't work. I'll show you, look...\"  He rummaged around in his trunk and pulled out a very battered-looking wand. It was chipped in places and something white was glinting at the end.  \"Unicorn hair's nearly poking out. Anyway  He had just raised his 'wand when the compartment door slid open again. The toadless boy was back, but this time he had a girl with him. She was already wearing her new Hogwarts robes.  \"Has anyone seen a toad? Neville's lost one,\" she said. She had a bossy sort of voice, lots of bushy brown hair, and rather large front teeth.  \"We've already told him we haven't seen it,\" said Ron, but the girl wasn't listening, she was looking at the wand in his hand.  \"Oh, are you doing magic? Let's see it, then.\"  She sat down. Ron looked taken aback.  \"Er -- all right.\"  He cleared his throat.  \"Sunshine, daisies, butter mellow, Turn this stupid, fat rat yellow.\"  He waved his wand, but nothing happened. Scabbers stayed gray and fast asleep.  \"Are you sure that's a real spell?\" said the girl. \"Well, it's not very good, is it? I've tried a few simple spells just for practice and it's all worked for me. Nobody in my family's magic at all, it was ever such a surprise when I got my letter, but I was ever so pleased, of course, I mean, it's the very best school of witchcraft there is, I've heard -- I've learned all our course books by heart, of course, I just hope it will be enough -- I'm Hermione Granger, by the way, who are you.  She said all this very fast.  Harry looked at Ron, and was relieved to see by his stunned face that he hadn't learned all the course books by heart either.  \"I'm Ron Weasley,\" Ron muttered.  \"Harry Potter,\" said Harry.  \"Are you really?\" said Hermione. \"I know all about you, of course -- I got a few extra books. for background reading, and you're in Modern Magical History and The Rise and Fall of the Dark Arts and Great Wizarding Events of the Twentieth Century.  \"Am I?\" said Harry, feeling dazed.  \"Goodness, didn't you know, I'd have found out everything I could if it was me,\" said Hermione. \"Do either of you know what house you'll be in? I've been asking around, and I hope I'm in Gryffindor, it sounds by far the best; I hear Dumbledore himself was in it, but I suppose Ravenclaw wouldn't be too bad.... Anyway, we'd better go and look for Neville's toad. You two had better change, you know, I expect we'll be there soon.\"  And she left, taking the toadless boy with her.  \"Whatever house I'm in, I hope she's not in it,\" said Ron. He threw his wand back into his trunk. \"Stupid spell -- George gave it to me, bet he knew it was a dud.\"  \"What house are your brothers in?\" asked Harry.  \"Gryffindor,\" said Ron. Gloom seemed to be settling on him again. \"Mom and Dad were in it, too. I don't know what they'll say if I'm not. I don't suppose Ravenclaw would be too bad, but imagine if they put me in Slytherin.\"  \"That's the house Vol-, I mean, You-Know-Who was in?\"  \"Yeah,\" said Ron. He flopped back into his seat, looking depressed.  \"You know, I think the ends of Scabbers' whiskers are a bit lighter,\" said Harry, trying to take Ron's mind off houses. \"So what do your oldest brothers do now that they've left, anyway?\"  Harry was wondering what a wizard did once he'd finished school.  \"Charlie's in Romania studying dragons, and Bill's in Africa doing something for Gringotts,\" said Ron. \"Did you hear about  Gringotts? It's been all over the Daily Prophet, but I don't suppose you get that with the Muggles -- someone tried to rob a high security vault.\"  Harry stared.  \"Really? What happened to them?\"  \"Nothing, that's why it's such big news. They haven't been caught. My dad says it must've been a powerful Dark wizard to get round Gringotts, but they don't think they took anything, that's what's odd."
}