{
  "id": "35f261524c6e9a2105a3e260f2d04802635be42a",
  "text": "    You are too kind, my lady,  said Sansa,  but my place is with my lord husband.   Lady Olenna gave Tyrion a wrinkled, toothless smile.  Oh? Forgive a silly old woman, my lord, I did not mean to steal your lovely wife. I assumed you would be off leading a Lannister host against some wicked foe.    A host of dragons and stags. The master of coin must remain at court to see that all the armies are paid for.    To be sure. Dragons and stags, that’s very clever. And dwarf’s pennies as well. I have heard of these dwarf’s pennies. No doubt collecting those is such a dreadful chore.    I leave the collecting to others, my lady.    Oh, do you? I would have thought you might want to tend to it yourself. We can’t have the crown being cheated of its dwarf’s pennies, now. Can we?    Gods forbid.  Tyrion was beginning to wonder whether Lord Luthor Tyrell had ridden off that cliff intentionally.  If you will excuse us, Lady Olenna, it is time we were in our places.    Myself as well. Seventy-seven courses, I daresay. Don’t you find that a bit excessive, my lord? I shan’t eat more than three or four bites myself, but you and I are very little, aren’t we?  She patted Sansa’s hair again and said,  Well, off with you, child, and try to be merrier. Now where have my guardsmen gone? Left, Right, where are you? Come help me to the dais.   Although evenfall was still an hour away, the throne room was already a blaze of light, with torches burning in every sconce. The guests stood along the tables as heralds called out the names and titles of the lords and ladies making their entrance. Pages in the royal livery escorted them down the broad central aisle. The gallery above was packed with musicians; drummers and pipers and fiddlers, strings and horns and skins.  Tyrion clutched Sansa’s arm and made the walk with a heavy waddling stride. He could feel their eyes on him, picking at the fresh new scar that had left him even uglier than he had been before. Let them look, he thought as he hopped up onto his seat. Let them stare and whisper until they’ve had their fill, I will not hide myself for their sake. The Queen of Thorns followed them in, shuffling along with tiny little steps. Tyrion wondered which of them looked more absurd, him with Sansa or the wizened little woman between her seven-foot-tall twin guardsmen.  Joffrey and Margaery rode into the throne room on matched white chargers. Pages ran before them, scattering rose petals under their hooves. The king and queen had changed for the feast as well. Joffrey wore striped black-and-crimson breeches and a cloth-of-gold doublet with black satin sleeves and onyx studs. Margaery had exchanged the demure gown that she had worn in the sept for one much more revealing, a confection in pale green samite with a tight-laced bodice that bared her shoulders and the tops of her small breasts. Unbound, her soft brown hair tumbled over her white shoulders and down her back almost to her waist. Around her brows was a slim golden crown. Her smile was shy and sweet. A lovely girl, thought Tyrion, and a kinder fate than my nephew deserves.  The Kingsguard escorted them onto the dais, to the seats of honor beneath the shadow of the Iron Throne, draped for the occasion in long silk streamers of Baratheon gold, Lannister crimson, and Tyrell green. Cersei embraced Margaery and kissed her cheeks. Lord Tywin did the same, and then Lancel and Ser Kevan. Joffrey received loving kisses from the bride’s father and his two new brothers, Loras and Garlan. No one seemed in any great rush to kiss Tyrion. When the king and queen had taken their seats, the High Septon rose to lead a prayer. At least he does not drone as badly as the last one, Tyrion consoled himself.  He and Sansa had been seated far to the king’s right, beside Ser Garlan Tyrell and his wife, the Lady Leonette. A dozen others sat closer to Joffrey, which a pricklier man might have taken for a slight, given that he had been the King’s Hand only a short time past. Tyrion would have been glad if there had been a hundred.   Let the cups be filled!  Joffrey proclaimed, when the gods had been given their due. His cupbearer poured a whole flagon of dark Arbor red into the golden wedding chalice that Lord Tyrell had given him that morning. The king had to use both hands to lift it.  To my wife the queen!    Margaery!  the hall shouted back at him.  Margaery! Margaery! To the queen!  A thousand cups rang together, and the wedding feast was well and truly begun. Tyrion Lannister drank with the rest, emptying his cup on that first toast and signaling for it to be refilled as soon as he was seated again.  The first dish was a creamy soup of mushrooms and buttered snails, served in gilded bowls. Tyrion had scarcely touched the breakfast, and the wine had already gone to his head, so the food was welcome. He finished quickly. One done, seventy-six to come. Seventy-seven dishes, while there are still starving children in this city, and men who would kill for a radish."
}