{
  "id": "36090f813ddfa0e0063f3f844bd8d9deb68bfb7d",
  "text": " Ron and Hermione were standing underneath it, examining a tray of blood-flavored lollipops. Harry sneaked up behind them.  \"Ugh, no, Harry won't want one of those, they're for vampires, I expect,\" Hermione was saying.  \"How about these?\" said Ron, shoving a jar of Cockroach Clusters under Hermione's nose.  \"Definitely not,\" said Harry.  Ron nearly dropped the jar.  \"Harry!\" squealed Hermione. \"What are you doing here? How -- how did you --?\"  \"Wow!\" said Ron, looking very impressed, \"you've learned to Apparate!\"  \"'Course I haven't,\" said Harry. He dropped his voice so that none of the sixth years could hear him and told them all about the Marauder's Map.  \"How come Fred and George never gave it to me!\" said Ron, outraged. \"I'm their brother!\"  \"But Harry isn't going to keep it!\" said Hermione, as though the idea were ludicrous. \"He's going to hand it in to Professor McGonagall, aren't you, Harry?\"  \"No, I'm not!\" said Harry.  \"Are you mad?\" said Ron, goggling at Hermione. \"Hand in something that good?\"  \"If I hand it in, I'll have to say where I got it! Filch would know Fred and George had nicked it!\"  \"But what about Sirius Black?\" Hermione hissed. \"He could be using one of the passages on that map to get into the castle! The teachers have got to know!\"  \"He can't be getting in through a passage,\" said Harry quickly. \"There are seven secret tunnels on the map, right? Fred and George reckon Filch already knows about four of them. And of the other three -- one of them's caved in, so no one can get through it. one of them's got the Whomping Willow planted over the entrance, so you can't get out of it. And the one I just came through -well - - it's really hard to see the entrance to it down in the cellar, so unless he knew it was there...\"  Harry hesistated. What if Black did know the passage was there?  Ron, however, cleared his throat significantly, and pointed to a notice pasted on the inside of the sweetshop door.  --------BY ORDER OF -------- THE MINISTRY OF MAGIC  Customers are reminded that until further notice, dementors will be patrolling the streets of Hogsmeade every night after sundown. This measure has been put in place for the safety of Hogsmeade residents and will be lifted upon the recapture of Sirius Black. It is therefore advisable that you complete your shopping well before nightfall.  Merry Christmas!  \"See?\" said Ron quietly. \"I'd like to see Black try and break into Honeydukes with dementors swarming all over the village. Anyway, Hermione, the Honeydukes owners would hear a break-in, wouldn't they? They live over the shop!\"  \"Yes, but but --\" Hermoine seemed to be struggling to find another problem. \"Look, Harry still shouldn't be coming into Hogsmeade. He hasn't got a signed form! If anyone finds out, he'll be in so much trouble! And it's not nightfall yet -- what if Sirius Black turns up today? Now?\"  \"He'd have a job spotting Harry in this,\" said Ron, nodding through the mullioned windows at the thick, swirling snow. \"Come on, Hermione, it's Christmas. Harry deserves a break.\"  Hermione bit her lip, looking extremely worried.  \"Are you going to report me?\" Harry asked her, grinning.  \"Oh -- of course not -- but honestly, Harry --\"  \"Seen the Fizzing Whizbees, Harry?\" said Ron, grabbing him and leading him over to their barrel. \"And the Jelly Slugs? And the Acid Pops? Fred gave me one of those when I was seven -- it burnt a hole right through my tongue. I remember Mum walloping him with her broomstick.\" Ron stared broodingly into the Acid Pop box. \"Reckon Fred'd take a bit of Cockroach Cluster if I told him they were peanuts?\"  When Ron and Hermione had paid for all their sweets, the three of them left Honeydukes for the blizzard outside.  Hogsmeade looked like a Christmas card; the little thatched cottages and shops were all covered in a layer of crisp snow; there were holly wreaths on the doors and strings of enchanted candles hanging in the trees.  Harry shivered; unlike the other two, he didn't have his cloak. They headed up the street, heads bowed against the wind, Ron and Hermione shouting through their scarves.  \"That's the post office  \"Zonko's is up there --\"  \"We could go up to the Shrieking Shack  \"Tell you what,\" said Ron, his teeth chattering, \"shall we go for a butterbeer in the Three Broomsticks?\"  Harry was more than willing; the wind was fierce and his hands were freezing, so they crossed the road, and in a few minutes were entering the tiny inn.  It was extremely crowded, noisy, warm, and smoky. A curvy sort of woman with a pretty face was serving a bunch of rowdy warlock' up at the bar.  \"That's Madam Rosmerta,\" said Ron. \"I'll get the drinks, shall I?\" he added, going slightly red.  Harry and Hermione made their way to the back of the room, ,,her, there was a small, vacant table between the window and a handsome Christmas tree, which stood next to the fireplace. Ron came back five minutes later, carrying three foaming tankards of hot butterbeer.  \"Merry Christmas!\" he said happily, raising his tankard."
}