{
  "id": "364862205bbefb75ad7004d1f2e42fc8cfea2bed",
  "text": "  Can I, Father? All my things are packed.    A short lesson, and make certain you leave yourself time to bathe and change. I want you ready to leave by midday, is that understood?    By midday,  Arya said.  Sansa looked up from her food.  If she can have a dancing lesson, why won’t you let me say farewell to Prince Joffrey?    I would gladly go with her, Lord Eddard,  Septa Mordane offered.  There would be no question of her missing the ship.    It would not be wise for you to go to Joffrey right now, Sansa. I’m sorry.   Sansa’s eyes filled with tears.  But why?    Sansa, your lord father knows best,  Septa Mordane said.  You are not to question his decisions.    It’s not fair!  Sansa pushed back from her table, knocked over her chair, and ran weeping from the solar.  Septa Mordane rose, but Ned gestured her back to her seat.  Let her go, Septa. I will try to make her understand when we are all safely back in Winterfell.  The septa bowed her head and sat down to finish her breakfast.  It was an hour later when Grand Maester Pycelle came to Eddard Stark in his solar. His shoulders slumped, as if the weight of the great maester’s chain around his neck had become too great to bear.  My lord,  he said,  King Robert is gone. The gods give him rest.    No,  Ned answered.  He hated rest. The gods give him love and laughter, and the joy of righteous battle.  It was strange how empty he felt. He had been expecting the visit, and yet with those words, something died within him. He would have given all his titles for the freedom to weep… but he was Robert’s Hand, and the hour he dreaded had come.  Be so good as to summon the members of the council here to my solar,  he told Pycelle. The Tower of the Hand was as secure as he and Tomard could make it; he could not say the same for the council chambers.   My lord?  Pycelle blinked.  Surely the affairs of the kingdom will keep till the morrow, when our grief is not so fresh.   Ned was quiet but firm.  I fear we must convene at once.   Pycelle bowed.  As the Hand commands.  He called his servants and sent them running, then gratefully accepted Ned’s offer of a chair and a cup of sweet beer.  Ser Barristan Selmy was the first to answer the summons, immaculate in white cloak and enameled scales.  My lords,  he said,  my place is beside the young king now. Pray give me leave to attend him.    Your place is here, Ser Barristan,  Ned told him.  Littlefinger came next, still garbed in the blue velvets and silver mockingbird cape he had worn the night previous, his boots dusty from riding.  My lords,  he said, smiling at nothing in particular before he turned to Ned.  That little task you set me is accomplished, Lord Eddard.   Varys entered in a wash of lavender, pink from his bath, his plump face scrubbed and freshly powdered, his soft slippers all but soundless.  The little birds sing a grievous song today,  he said as he seated himself.  The realm weeps. Shall we begin?    When Lord Renly arrives,  Ned said.  Varys gave him a sorrowful look.  I fear Lord Renly has left the city.    Left the city?  Ned had counted on Renly’s support.   He took his leave through a postern gate an hour before dawn, accompanied by Ser Loras Tyrell and some fifty retainers,  Varys told them.  When last seen, they were galloping south in some haste, no doubt bound for Storm’s End or Highgarden.   So much for Renly and his hundred swords. Ned did not like the smell of that, but there was nothing to be done for it. He drew out Robert’s last letter.  The king called me to his side last night and commanded me to record his final words. Lord Renly and Grand Maester Pycelle stood witness as Robert sealed the letter, to be opened by the council after his death. Ser Barristan, if you would be so kind?   The Lord Commander of the Kingsguard examined the paper.  King Robert’s seal, and unbroken.  He opened the letter and read.  Lord Eddard Stark is herein named Protector of the Realm, to rule as regent until the heir comes of age.   And as it happens, he is of age, Ned reflected, but he did not give voice to the thought. He trusted neither Pycelle nor Varys, and Ser Barristan was honor-bound to protect and defend the boy he thought his new king. The old knight would not abandon Joffrey easily. The need for deceit was a bitter taste in his mouth, but Ned knew he must tread softly here, must keep his counsel and play the game until he was firmly established as regent. There would be time enough to deal with the succession when Arya and Sansa were safely back in Winterfell, and Lord Stannis had returned to King’s Landing with all his power.   I would ask this council to confirm me as Lord Protector, as Robert wished,  Ned said, watching their faces, wondering what thoughts hid behind Pycelle’s half-closed eyes, Littlefinger’s lazy half-smile, and the nervous flutter of Varys’s fingers.  The door opened. Fat Tom stepped into the solar.  Pardon, my lords, the king’s steward insists…   The royal steward entered and bowed."
}