{
  "id": "3679c7370860700e13466160d01bef141452ddd4",
  "text": " A thousand years of humus lay thick upon the godswood floor, swallowing the sound of her feet, but the red eyes of the weirwood seemed to follow her as she came.  Ned,  she called softly.  He lifted his head to look at her.  Catelyn,  he said. His voice was distant and formal.  Where are the children?   He would always ask her that.  In the kitchen, arguing about names for the wolf pups.  She spread her cloak on the forest floor and sat beside the pool, her back to the weirwood. She could feel the eyes watching her, but she did her best to ignore them.  Arya is already in love, and Sansa is charmed and gracious, but Rickon is not quite sure.    Is he afraid?  Ned asked.   A little,  she admitted.  He is only three.   Ned frowned.  He must learn to face his fears. He will not be three forever. And winter is coming.    Yes,  Catelyn agreed. The words gave her a chill, as they always did. The Stark words. Every noble house had its words. Family mottoes, touchstones, prayers of sorts, they boasted of honor and glory, promised loyalty and truth, swore faith and courage. All but the Starks. Winter is coming, said the Stark words. Not for the first time, she reflected on what a strange people these northerners were.   The man died well, I’ll give him that,  Ned said. He had a swatch of oiled leather in one hand. He ran it lightly up the greatsword as he spoke, polishing the metal to a dark glow.  I was glad for Bran’s sake. You would have been proud of Bran.    I am always proud of Bran,  Catelyn replied, watching the sword as he stroked it. She could see the rippling deep within the steel, where the metal had been folded back on itself a hundred times in the forging. Catelyn had no love for swords, but she could not deny that Ice had its own beauty. It had been forged in Valyria, before the Doom had come to the old Freehold, when the ironsmiths had worked their metal with spells as well as hammers. Four hundred years old it was, and as sharp as the day it was forged. The name it bore was older still, a legacy from the age of heroes, when the Starks were Kings in the North.   He was the fourth this year,  Ned said grimly.  The poor man was half-mad. Something had put a fear in him so deep that my words could not reach him.  He sighed.  Ben writes that the strength of the Night’s Watch is down below a thousand. It’s not only desertions. They are losing men on rangings as well.    Is it the wildlings?  she asked.   Who else?  Ned lifted Ice, looked down the cool steel length of it.  And it will only grow worse. The day may come when I will have no choice but to call the banners and ride north to deal with this King-beyond-the-Wall for good and all.    Beyond the Wall?  The thought made Catelyn shudder.  Ned saw the dread on her face.  Mance Rayder is nothing for us to fear.    There are darker things beyond the Wall.  She glanced behind her at the heart tree, the pale bark and red eyes, watching, listening, thinking its long slow thoughts.  His smile was gentle.  You listen to too many of Old Nan’s stories. The Others are as dead as the children of the forest, gone eight thousand years. Maester Luwin will tell you they never lived at all. No living man has ever seen one.    Until this morning, no living man had ever seen a direwolf either,  Catelyn reminded him.   I ought to know better than to argue with a Tully,  he said with a rueful smile. He slid Ice back into its sheath.  You did not come here to tell me crib tales. I know how little you like this place. What is it, my lady?   Catelyn took her husband’s hand.  There was grievous news today, my lord. I did not wish to trouble you until you had cleansed yourself.  There was no way to soften the blow, so she told him straight.  I am so sorry, my love. Jon Arryn is dead.   His eyes found hers, and she could see how hard it took him, as she had known it would. In his youth, Ned had fostered at the Eyrie, and the childless Lord Arryn had become a second father to him and his fellow ward, Robert Baratheon. When the Mad King Aerys II Targaryen had demanded their heads, the Lord of the Eyrie had raised his moon-and-falcon banners in revolt rather than give up those he had pledged to protect.  And one day fifteen years ago, this second father had become a brother as well, as he and Ned stood together in the sept at Riverrun to wed two sisters, the daughters of Lord Hoster Tully.   Jon…  he said.  Is this news certain?    It was the king’s seal, and the letter is in Robert’s own hand. I saved it for you. He said Lord Arryn was taken quickly. Even Maester Pycelle was helpless, but he brought the milk of the poppy, so Jon did not linger long in pain.    That is some small mercy, I suppose,  he said. She could see the grief on his face, but even then he thought first of her.  Your sister,  he said.  And Jon’s boy. What word of them?    The message said only that they were well, and had returned to the Eyrie,  Catelyn said.  I wish they had gone to Riverrun instead. The Eyrie is high and lonely, and it was ever her husband’s place, not hers."
}