{
  "id": "37646cda4e48c2952e7ad45e5d855a9e6ef89a29",
  "text": " His great brown stomach and sagging chest were bare above the yellow silk sash knotted about his waist, and he wore no armor but his studded leather vest, so absurdly small that it did not even cover his nipples.  We should have given him chainmail,  Dany said, suddenly anxious.   Mail would only slow him,  said Ser Jorah.  They wear no armor in the fighting pits. It’s blood the crowds come to see.   Dust flew from the hooves of the white charger. Oznak thundered toward Strong Belwas, his striped cloak streaming from his shoulders. The whole city of Meereen seemed to be screaming him on. The besiegers’ cheers seemed few and thin by comparison; her Unsullied stood in silent ranks, watching with stone faces. Belwas might have been made of stone as well. He stood in the horse’s path, his vest stretched tight across his broad back. Oznak’s lance was leveled at the center of his chest. Its bright steel point winked in the sunlight. He’s going to be impaled, she thought… as the eunuch spun sideways. And quick as the blink of an eye the horseman was beyond him, wheeling, raising the lance. Belwas made no move to strike at him. The Meereenese on the walls screamed even louder.  What is he doing?  Dany demanded.   Giving the mob a show,  Ser Jorah said.  Oznak brought the horse around Belwas in a wide circle, then dug in with his spurs and charged again. Again Belwas waited, then spun and knocked the point of the lance aside. She could hear the eunuch’s booming laughter echoing across the plain as the hero went past him.  The lance is too long,  Ser Jorah said.  All Belwas needs do is avoid the point. Instead of trying to spit him so prettily, the fool should ride right over him.   Oznak zo Pahl charged a third time, and now Dany could see plainly that he was riding past Belwas, the way a Westerosi knight might ride at an opponent in a tilt, rather than at him, like a Dothraki riding down a foe. The flat level ground allowed the charger to get up a good speed, but it also made it easy for the eunuch to dodge the cumbersome fourteen-foot lance.  Meereen’s pink-and-white hero tried to anticipate this time, and swung his lance sideways at the last second to catch Strong Belwas when he dodged. But the eunuch had anticipated too, and this time he dropped down instead of spinning sideways. The lance passed harmlessly over his head. And suddenly Belwas was rolling, and bringing the razor-sharp arakh around in a silver arc. They heard the charger scream as the blade bit into his legs, and then the horse was falling, the hero tumbling from the saddle.  A sudden silence swept along the brick parapets of Meereen. Now it was Dany’s people who were screaming and cheering.  Oznak leapt clear of his horse and managed to draw his sword before Strong Belwas was on him. Steel sang against steel, too fast and furious for Dany to follow the blows. It could not have been a dozen heartbeats before Belwas’s chest was awash in blood from a slice below his breasts, and Oznak zo Pahl had an arakh planted right between his ram’s horns. The eunuch wrenched the blade loose and parted the hero’s head from his body with three savage blows to the neck. He held it up high for the Meereenese to see, then flung it toward the city gates and let it bounce and roll across the sand.   So much for the hero of Meereen,  said Daario, laughing.   A victory without meaning,  Ser Jorah cautioned.  We will not win Meereen by killing its defenders one at a time.    No,  Dany agreed,  but I’m pleased we killed this one.   The defenders on the walls began firing their crossbows at Belwas, but the bolts fell short or skittered harmlessly along the ground. The eunuch turned his back on the steel-tipped rain, lowered his trousers, squatted, and shat in the direction of the city. He wiped himself with Oznak’s striped cloak, and paused long enough to loot the hero’s corpse and put the dying horse out of his agony before trudging back to the olive grove.  The besiegers gave him a raucous welcome as soon as he reached the camp. Her Dothraki hooted and screamed, and the Unsullied sent up a great clangor by banging their spears against their shields.  Well done,  Ser Jorah told him, and Brown Ben tossed the eunuch a ripe plum and said,  A sweet fruit for a sweet fight.  Even her Dothraki handmaids had words of praise.  We would braid your hair and hang a bell in it, Strong Belwas,  said Jhiqui,  but you have no hair to braid.    Strong Belwas needs no tinkly bells.  The eunuch ate Brown Ben’s plum in four big bites and tossed aside the stone.  Strong Belwas needs liver and onions.    You shall have it,  said Dany.  Strong Belwas is hurt.  His stomach was red with the blood sheeting down from the meaty gash beneath his breasts.   It is nothing. I let each man cut me once, before I kill him.  He slapped his bloody belly.  Count the cuts and you will know how many Strong Belwas has slain.   But Dany had lost Khal Drogo to a similar wound, and she was not willing to let it go untreated."
}