{
  "id": "37ffe47de13c8df73940c8c1c809d2ddc7c41f0e",
  "text": " \"Ivanova!\" A second scarlet-robed player zoomed out. \"Zograf! Levski! Vulchanov! Volkov! Aaaaaaand - Krum!\" \"That's him, that's him!\" yelled Ron, following Krum with his Omnioculars. Harry quickly focused his own. Viktor Krum was thin, dark, and sallow-skinned, with a large curved nose and thick black eyebrows. He looked like an overgrown bird of prey. It was hard to believe he was only eighteen. \"And now, please greet - the Irish National Quidditch Team!\"  yelled Bagman. \"Presenting - Connolly!  Ryan!  Troy!  Mullet!  Moran!  Quigley!  Aaaaaand - Lynch!\" Seven green blurs swept onto the field; Harry spun a small dial on the side of his Omnioculars and slowed the players down enough to read the word \"Firebolt\" on each of their brooms and see their names, embroidered in silver, upon their backs. \"And here, all the way from Egypt, our referee, acclaimed Chairwizard of the International Association of Quidditch, Hassan Mostafa!\" A small and skinny wizard, completely bald but with a mustache to rival Uncle Vernon's, wearing robes of pure gold to match the stadium, strode out onto the field. A silver whistle was protruding from under the mustache, and he was carrying a large wooden crate under one arm, his broomstick under the other.  Harry spun the speed dial on his Omnioculars back to normal, watching closely as Mostafa mounted his broomstick and kicked the crate open - four balls burst into the air: the scarlet Quaffle, the two black Bludgers, and (Harry saw it for the briefest moment, before it sped out of sight) the minuscule, winged Golden Snitch.  With a sharp blast on his whistle, Mostafa shot into the air after the balls. \"Theeeeeeeey're OFF!\"  screamed Bagman. \"And it's Mullet! Troy! Moran! Dimitrov! Back to Mullet! Troy! Levski! Moran!\" It was Quidditch as Harry had never seen it played before. He was pressing his Omnioculars so hard to his glasses that they were cutting into the bridge of his nose. The speed of the players was incredible - the Chasers were throwing the Quaffle to one another so fast that Bagman only had time to say their names.  Harry spun the slow dial on the right of his Omnioculars again, pressed the play-by-play button on the top, and he was immediately watching in slow motion, while glittering purple lettering flashed across the lenses and the noise of the crowd pounded against his eardrums. HAWKSHEAD ATTACKING FORMATION, he read as he watched the three Irish Chasers zoom closely together, Troy in the center, slightly ahead of Mullet and Moran, bearing down upon the Bulgarians.  PORSKOFF PLOY flashed up next, as Troy made as though to dart upward with the Quaffle, drawing away the Bulgarian Chaser Ivanova and dropping the Quaffle to Moran.  One of the Bulgarian Beaters, Volkov, swung hard at a passing Bludger with his small club, knocking it into Moran's path; Moran ducked to avoid the Bludger and dropped the Quaffle; and Levski, soaring beneath, caught it - \"TROY SCORES!\" roared Bagman, and the stadium shuddered with a roar of applause and cheers. \"Ten zero to Ireland!\" \"What?\"  Harry yelled, looking wildly around through his Omnioculars. \"But Levski's got the Quaffle!\" \"Harry, if you're not going to watch at normal speed, you're going to miss things!\" shouted Hermione, who was dancing up and down, waving her arms in the air while Troy did a lap of honor around the field. Harry looked quickly over the top of his Omnioculars and saw that the leprechauns watching from the sidelines had all risen into the air again and formed the great, glittering shamrock. Across the field, the veela were watching them sulkily. Furious with himself, Harry spun his speed dial back to normal as play resumed. Harry knew enough about Quidditch to see that the Irish Chasers were superb. They worked as a seamless team, their movements so well coordinated that they appeared to be reading one another's minds as they positioned themselves, and the rosette on Harry's chest kept squeaking their names: \"Troy - Mullet - Mo ran!\" And within ten minutes, Ireland had scored twice more, bringing their lead to thirty-zero and causing a thunderous tide of roars and applause from the green-clad supporters. The match became still faster, but more brutal. Volkov and Vulchanov, the Bulgarian Beaters, were whacking the Bludgers as fiercely as possible at the Irish Chasers, and were starting to prevent them from using some of their best moves; twice they were forced to scatter, and then, finally, Ivanova managed to break through their ranks; dodge the Keeper, Ryan; and score Bulgaria's first goal. \"Fingers in your ears!\" bellowed Mr. Weasley as the veela started to dance in celebration. Harry screwed up his eyes too; he wanted to keep his mind on the game. After a few seconds, he chanced a glance at the field.  The veela had stopped dancing, and Bulgaria was again in possession of the Quaffle. \"Dimitrov! Levski! Dimitrov! Ivanova - oh I say!\"  roared Bagman. One hundred thousand wizards gasped as the two Seekers, Krum and Lynch, plummeted through the center of the Chasers, so fast that it looked as though they had just jumped from airplanes without parachutes."
}