{
  "id": "38329866bda90133ea820ba2b0e7b230155c4e95",
  "text": " It reached down with two bone-white hands to pull out the knife, but where its fingers touched the obsidian they smoked.  Sam rolled onto his side, eyes wide as the Other shrank and puddled, dissolving away. In twenty heartbeats its flesh was gone, swirling away in a fine white mist. Beneath were bones like milkglass, pale and shiny, and they were melting too. Finally only the dragonglass dagger remained, wreathed in steam as if it were alive and sweating. Grenn bent to scoop it up and flung it down again at once.  Mother, that’s cold.    Obsidian.  Sam struggled to his knees.  Dragonglass, they call it. Dragonglass. Dragon glass.  He giggled, and cried, and doubled over to heave his courage out onto the snow.  Grenn pulled Sam to his feet, checked Small Paul for a pulse and closed his eyes, then snatched up the dagger again. This time he was able to hold it.   You keep it,  Sam said.  You’re not craven like me.    So craven you killed an Other.  Grenn pointed with the knife.  Look there, through the trees. Pink light. Dawn, Sam. Dawn. That must be east. If we head that way, we should catch Mormont.    If you say.  Sam kicked his left foot against a tree, to knock off all the snow. Then the right.  I’ll try.  Grimacing, he took a step.  I’ll try hard.  And then another.      Tyrion   Lord Tywin’s chain of hands made a golden glitter against the deep wine velvet of his tunic. The Lords Tyrell, Redwyne, and Rowan gathered round him as he entered. He greeted each in turn, spoke a quiet word to Varys, kissed the High Septon’s ring and Cersei’s cheek, clasped the hand of Grand Maester Pycelle, and seated himself in the king’s place at the head of the long table, between his daughter and his brother.  Tyrion had claimed Pycelle’s old place at the foot, propped up by cushions so he could gaze down the length of the table. Dispossessed, Pycelle had moved up next to Cersei, about as far from the dwarf as he could get without claiming the king’s seat. The Grand Maester was a shambling skeleton, leaning heavily on a twisted cane and shaking as he walked, a few white hairs sprouting from his long chicken’s neck in place of his once-luxuriant white beard. Tyrion gazed at him without remorse.  The others had to scramble for seats: Lord Mace Tyrell, a heavy, robust man with curling brown hair and a spade-shaped beard well salted with white; Paxter Redwyne of the Arbor, stoop-shouldered and thin, his bald head fringed by tufts of orange hair; Mathis Rowan, Lord of Goldengrove, clean-shaven, stout, and sweating; the High Septon, a frail man with wispy white chin hair. Too many strange faces, Tyrion thought, too many new players. The game changed while I lay rotting in my bed, and no one will tell me the rules.  Oh, the lords had been courteous enough, though he could tell how uncomfortable it made them to look at him.  That chain of yours, that was cunning,  Mace Tyrell had said in a jolly tone, and Lord Redwyne nodded and said,  Quite so, quite so, my lord of Highgarden speaks for all of us,  and very cheerfully too.  Tell it to the people of this city, Tyrion thought bitterly. Tell it to the bloody singers, with their songs of Renly’s ghost.  His uncle Kevan had been the warmest, going so far as to kiss his cheek and say,  Lancel has told me how brave you were, Tyrion. He speaks very highly of you.   He’d better, or I’ll have a few things to say of him. He made himself smile and say,  My good cousin is too kind. His wound is healing, I trust?   Ser Kevan frowned.  One day he seems stronger, the next… it is worrisome. Your sister often visits his sickbed, to lift his spirits and pray for him.   But is she praying that he lives, or dies? Cersei had made shameless use of their cousin, both in and out of bed; a little secret she no doubt hoped Lancel would carry to his grave now that Father was here and she no longer had need of him. Would she go so far as to murder him, though? To look at her today, you would never suspect Cersei was capable of such ruthlessness. She was all charm, flirting with Lord Tyrell as they spoke of Joffrey’s wedding feast, complimenting Lord Redwyne on the valor of his twins, softening gruff Lord Rowan with jests and smiles, making pious noises at the High Septon.  Shall we begin with the wedding arrangements?  she asked as Lord Tywin took his seat.   No,  their father said.  With the war. Varys.   The eunuch smiled a silken smile.  I have such delicious tidings for you all, my lords. Yesterday at dawn our brave Lord Randyll caught Robett Glover outside Duskendale and trapped him against the sea. Losses were heavy on both sides, but in the end our loyal men prevailed. Ser Helman Tallhart is reported dead, with a thousand others. Robett Glover leads the survivors back toward Harrenhal in bloody disarray, little dreaming he will find valiant Ser Gregor and his stalwarts athwart his path.    Gods be praised!  said Paxter Redwyne.  A great victory for King Joffrey!    What did Joffrey have to do with it? thought Tyrion."
}