{
  "id": "38ec971bfe9544e2ba8641a643ecb337a12821a0",
  "text": " Lord Stannis and a small garrison had held the castle for close to a year, against the great host of the Lords Tyrell and Redwyne. Even the sea was closed against them, watched day and night by Redwyne galleys flying the burgundy banners of the Arbor. Within Storm’s End, the horses had long since been eaten, the dogs and cats were gone, and the garrison was down to roots and rats. Then came a night when the moon was new and black clouds hid the stars. Cloaked in that darkness, Davos the smuggler had dared the Redwyne cordon and the rocks of Shipbreaker Bay alike. His little ship had a black hull, black sails, black oars, and a hold crammed with onions and salt fish. Little enough, yet it had kept the garrison alive long enough for Eddard Stark to reach Storm’s End and break the siege.  Lord Stannis had rewarded Davos with choice lands on Cape Wrath, a small keep, and a knight’s honors… but he had also decreed that he lose a joint of each finger on his left hand, to pay for all his years of smuggling. Davos had submitted, on the condition that Stannis wield the knife himself; he would accept no punishment from lesser hands. The lord had used a butcher’s cleaver, the better to cut clean and true. Afterward, Davos had chosen the name Seaworth for his new-made house, and he took for his banner a black ship on a pale grey field—with an onion on its sails. The onetime smuggler was fond of saying that Lord Stannis had done him a boon, by giving him four less fingernails to clean and trim.  No, Cressen thought, a man like that would give no false hope, nor soften a hard truth.  Ser Davos, truth can be a bitter draught, even for a man like Lord Stannis. He thinks only of returning to King’s Landing in the fullness of his power, to tear down his enemies and claim what is rightfully his. Yet now…    If he takes this meager host to King’s Landing, it will be only to die. He does not have the numbers. I told him as much, but you know his pride.  Davos held up his gloved hand.  My fingers will grow back before that man bends to sense.   The old man sighed.  You have done all you could. Now I must add my voice to yours.  Wearily, he resumed his climb.  Lord Stannis Baratheon’s refuge was a great round room with walls of bare black stone and four tall narrow windows that looked out to the four points of the compass. In the center of the chamber was the great table from which it took its name, a massive slab of carved wood fashioned at the command of Aegon Targaryen in the days before the Conquest. The Painted Table was more than fifty feet long, perhaps half that wide at its widest point, but less than four feet across at its narrowest. Aegon’s carpenters had shaped it after the land of Westeros, sawing out each bay and peninsula until the table nowhere ran straight. On its surface, darkened by near three hundred years of varnish, were painted the Seven Kingdoms as they had been in Aegon’s day; rivers and mountains, castles and cities, lakes and forests.  There was a single chair in the room, carefully positioned in the precise place that Dragonstone occupied off the coast of Westeros, and raised up to give a good view of the tabletop. Seated in the chair was a man in a tight-laced leather jerkin and breeches of roughspun brown wool. When Maester Cressen entered, he glanced up.  I knew you would come, old man, whether I summoned you or no.  There was no hint of warmth in his voice; there seldom was.  Stannis Baratheon, Lord of Dragonstone and by the grace of the gods rightful heir to the Iron Throne of the Seven Kingdoms of Westeros, was broad of shoulder and sinewy of limb, with a tightness to his face and flesh that spoke of leather cured in the sun until it was as tough as steel. Hard was the word men used when they spoke of Stannis, and hard he was. Though he was not yet five-and-thirty, only a fringe of thin black hair remained on his head, circling behind his ears like the shadow of a crown. His brother, the late King Robert, had grown a beard in his final years. Maester Cressen had never seen it, but they said it was a wild thing, thick and flerce. As if in answer, Stannis kept his own whiskers cropped tight and short. They lay like a blue-black shadow across his square jaw and the bony hollows of his cheeks. His eyes were open wounds beneath his heavy brows, a blue as dark as the sea by night. His mouth would have given despair to even the drollest of fools; it was a mouth made for frowns and scowls and sharply worded commands, all thin pale lips and clenched muscles, a mouth that had forgotten how to smile and had never known how to laugh. Sometimes when the world grew very still and silent of a night, Maester Cressen fancied he could hear Lord Stannis grinding his teeth half a castle away.   Once you would have woken me,  the old man said.   Once you were young. Now you are old and sick, and need your sleep.  Stannis had never learned to soften his speech, to dissemble or flatter; he said what he thought, and those that did not like it could be damned."
}