{
  "id": "3b8ae5147dca203eb1525b825c30c4a9e39413eb",
  "text": " 'The weed is  better than I thought. It reminds me  of the  roses of Imloth Melui when I was a lass, and no king could ask for better.'       Suddenly Faramir  stirred, and he  opened  his eyes,  and he looked  on  Aragorn who  bent over him; and a light of knowledge and love was kindled in  his  eyes, and he spoke softly.  'My  lord, you called  me. I come. What does  the king command?'       'Walk no more in the shadows, but awake!' said Aragorn. 'You are weary.  Rest a while, and take food, and be ready when I return.'       'I will, lord,' said Faramir. 'For who would lie idle when the king has  returned?'       'Farewell then  for a while!' said Aragorn.  'I must go  to  others who  need me.' And he left the chamber with Gandalf and Imrahil; but Beregond and  his son remained behind, unable to contain their joy. As he followed Gandalf   ####-and shut the door Pippin heard Ioreth exclaim:       'King! Did you hear  that? What  did I say? The  hands  of  a healer, I  said.'  And  soon the word had  gone  out  from the House  that the king was  indeed  come among  them, and after war he brought healing; and the news ran  through the City.       But Aragorn came to Jowyn, and he said: 'Here there is a  grievous hurt  and a  heavy blow. The arm that  was broken  has been tended with due skill,  and it will  mend in time, if she  ha s  the  strength  to live:  It  is  the  shield-arm  that is maimed; but the chief evil comes through the  sword-arm.   In that there now seems no life, although it is unbroken.       'Alas! For she was pitted against a foe beyond the strength of her mind  or body. And those who  will take a weapon to such an enemy must  be sterner  than  steel,  if the very shock shall  not destroy them. It was an evil doom  that set her in his path. For she is a fair maiden, fairest  lady of a house  of queens. And yet I know not how I should speak of her. When I first looked  on her  and  perceived  her unhappiness, it seemed to me that I saw a  white  flower standing straight and proud, shapely as a lily, and yet knew  that it  was  hard, as if  wrought by elf-wrights out of steel. Or  was  it, maybe, a   frost that had turned  its sap to ice, and  so it stood, bitter-sweet, still  fair to see, but stricken, soon  to fall and die? Her malady begins far back   before this day, does it not, Jomer?'       'I marvel that you should  ask me,  lord,' he answered. 'For I hold you   blameless  in  this  matter, as in  all else; yet  I knew not that Jowyn, my  sister, was touched by any  frost, until  she first looked on you.  Care and  dread she had,  and shared with me, in the days of Wormtongue and the king's  bewitchment; and she tended the king in growing fear. But that did not bring   her to this pass!'       'My friend,' said Gandalf,  'you had horses, and deeds of arms, and the  free fields; but she, born  in the body of a maid, had  a spirit and courage  at least the match of yours.  Yet  she  was doomed to wait  upon an old man,  whom she  loved as a father, and watch him falling  into a  mean dishonoured  dotage; and her part seemed to her more ignoble  than that  of the  staff he  leaned on.       'Think you that Wormtongue  had poison only for Thjoden's ears? Dotard!  What is the  house of Eorl but a thatched barn where brigands  drink  in the  reek, and their brats roll on the floor among their dogs? Have you not heard   ####-those words before? Saruman spoke them, the teacher of Wormtongue. Though   I  do  not doubt that Wormtongue at home  wrapped their  meaning in terms   more  cunning. My lord,  if your sister's love for you, and her will still bent to  her duty, had not restrained her lips; you might have heard even such things  as these  escape them. But who knows what she spoke to  the darkness, alone,  in the bitter watches of the night, when all her  life seemed shrinking, and  the walls of her bower closing in  about her,  a hutch  to trammel some wild   thing in? '       Then Jomer was  silent, and looked on  his sister, as if pondering anew  all the days of their past life together. But Aragorn said: 'I saw also what  you saw,  Jomer. Few other  griefs amid the  ill  chances of this world have  more  bitterness and shame for a man's heart than  to  behold the  love of a   lady so fair and brave that cannot be returned Sorrow and pity have followed  me ever since I left her desperate in Dunharrow and rode to the Paths of the  Dead;  and no  fear upon  that way was so present as the fear for what might   befall her. And yet, Jomer, I  say to you that she loves you more truly than  me; for you she loves and knows; but  in me  she loves  only a shadow and  a  thought: a hope of glory and  great deeds, and lands far from  the fields of  Rohan.       'I have, maybe, the power to heal her body, and to recall  her from the  dark valley. But to what she will awake: hope, or forgetfulness, or despair,  I do  not know. And if to despair, then  she will die, unless  other healing  comes  which  I cannot bring."
}