{
  "id": "3be0217327f0a865a522b2048095160570732ab9",
  "text": " That had been close, very close. It was a few seconds before he noticed anything about the room he had hidden in.  It looked like an unused classroom. The dark shapes of desks and chairs were piled against the walls, and there was an upturned wastepaper basket -- but propped against the wall facing him was something that didn't look as if it belonged there, something that looked as if someone had just put it there to keep it out of the way.  It was a magnificent mirror, as high as the ceiling, with an ornate gold frame, standing on two clawed feet. There was an inscription carved around the top: Erised stra ehru oyt ube cafru oyt on wohsi. His panic fading now that there was no sound of Filch and Snape, Harry moved nearer to the mirror, wanting to look at himself but see no reflection again. He stepped in front of it.  He had to clap his hands to his mouth to stop himself from screaming. He whirled around. His heart was pounding far more furiously than when the book had screamed -- for he had seen not only himself in the mirror, but a whole crowd of people standing right behind him.  But the room was empty. Breathing very fast, he turned slowly back to the mirror.  There he was, reflected in it, white and scared-looking, and there, reflected behind him, were at least ten others. Harry looked over his shoulder -- but still, no one was there. Or were they all invisible, too? Was he in fact in a room full of invisible people and this mirror's trick was that it reflected them, invisible or not?  He looked in the mirror again. A woman standing right behind his reflection was smiling at him and waving. He reached out a hand and felt the air behind him. If she was really there, he'd touch her, their reflections were so close together, but he felt only air -- she and the others existed only in the mirror.  She was a very pretty woman. She had dark red hair and her eyes -- her eyes are just like mine, Harry thought, edging a little closer to the glass. Bright green -- exactly the same shape, but then he noticed that she was crying; smiling, but crying at the same time. The tall, thin, black-haired man standing next to her put his arm around her. He wore glasses, and his hair was very untidy. It stuck up at the back, just as Harry's did.  Harry was so close to the mirror now that his nose was nearly touching that of his reflection.  \"Mom?\" he whispered. \"Dad?\"  They just looked at him, smiling. And slowly, Harry looked into the faces of the other people in the mirror, and saw other pairs of green eyes like his, other noses like his, even a little old man who looked as though he had Harry's knobbly knees -- Harry was looking at his family, for the first time in his life.  The Potters smiled and waved at Harry and he stared hungrily back at them, his hands pressed flat against the glass as though he was hoping to fall right through it and reach them. He had a powerful kind of ache inside him, half joy, half terrible sadness.  How long he stood there, he didn't know. The reflections did not fade and he looked and looked until a distant noise brought him back to his senses. He couldn't stay here, he had to find his way back to bed. He tore his eyes away from his mother's face, whispered, \"I'll come back,\" and hurried from the room.  \"You could have woken me up,\" said Ron, crossly.  \"You can come tonight, I'm going back, I want to show you the mirror.  \"I'd like to see your mom and dad,\" Ron said eagerly.  \"And I want to see all your family, all the Weasleys, you'll be able to show me your other brothers and everyone.\"  \"You can see them any old time,\" said Ron. \"Just come round my house this summer. Anyway, maybe it only shows dead people. Shame about not finding Flamel, though. Have some bacon or something, why aren't you eating anything?\"  Harry couldn't eat. He had seen his parents and would be seeing them again tonight. He had almost forgotten about Flamel. It didn't seem very important anymore. Who cared what the three headed dog was guarding? What did it matter if Snape stole it, really?  \"Are you all right?\" said Ron. \"You look odd.\"  What Harry feared most was that he might not be able to find the mirror room again. With Ron covered in the cloak, too, they had to walk much more slowly the next night. They tried retracing Harry's route from the library, wandering around the dark passageways for nearly an hour.  \"I'm freezing,\" said Ron. \"Let's forget it and go back.\"  \"No!\" Harry hissed. I know it's here somewhere.\"  They passed the ghost of a tall witch gliding in the opposite direction, but saw no one else. just as Ron started moaning that his feet were dead with cold, Harry spotted the suit of armor.  \"It's here -- just here -- yes!\"  They pushed the door open. Harry dropped the cloak from around his shoulders and ran to the mirror.  There they were. His mother and father beamed at the sight of him.  \"See?\" Harry whispered.  \"I can't see anything.\"  \"Look! Look at them all... there are loads of them....\"  \"I can only see you."
}