{
  "id": "3cb1faf6c78a6e281fbb33508790d36669f864c4",
  "text": " `This  stone I  gave to Celebrnan my daughter, and she to  hers; and now it comes to you as a token of hope. In this hour take the name  that was foretold for you, Elessar, the Elfstone of the house of Elendil! '       Then Aragorn took  the stone and pinned the brooch upon his breast, and  those  who  saw  him wondered; for they  had  not marked before how tall and  kingly  he stood, and it seemed to  them that many years of toil  had  fallen  from his shoulders. `For the  gifts that you have  given me I thank you,' he  said, 'O Lady of  Lurien of whom were sprung Celebrnan  and Arwen   Evenstar.  What praise could I say more? '       The Lady bowed her hea d, and she turned then to Boromir, and to him she  gave a belt of gold; and to  Merry  and Pippin  she gave small silver belts,  each  with a  clasp wrought like a golden flower. To Legolas she  gave a bow  such as  the Galadhrim used,  longer and  stouter than the bows of Mirkwood,  and strung with a string of elf-hair. With it went a quiver of arrows.        `For you little gardener and lover of trees,' she said to  Sam, `I have  only a small gift.' She put into his hand a little box of plain  grey  wood,  unadorned save for  a single silver rune upon the lid.  `Here  is set  G for   Galadriel,' she said; `but  also it may stand  for garden in your tongue. In  this box there is earth from my orchard, and such blessing  as Galadriel has  still to bestow  is upon it. It will not keep  you on your  road, nor defend  you  against any peril; but if you keep it and see your  home again at last,  then perhaps it may reward  you.  Though you should find all barren and laid  waste, there will be  few gardens in  Middle-earth that will bloom like your  garden, if you sprinkle this earth there. Then you may  remember  Galadriel,  and catch a glimpse  far off  of Lurien,  that you  have  seen  only  in our  winter.  For our spring and our summer are gone  by,  and they will never be  seen  on earth again save in memory.'       Sam  went  red  to  the  ears  and muttered something inaudible, as  he  clutched the box and bowed as well as he could.       `And what gift would a Dwarf ask of the Elves? ' said Galadriel turning  to Gimli.       `None,   Lady,' answered Gimli. `It is  enough for  me  to have seen the  Lady of the Galadhrim, and to have heard her gentle words.'       `Hear all ye Elves! ' she cried to those about her. `Let none say again  that Dwarves  are grasping  and ungracious! Yet surely, Gimli son of  Gluin,   ####-you desire something that I could give? Name it, I bid you! You shall not be  the only guest without a gift.'       `There  is  nothing,  Lady  Galadriel,'  said  Gimli,  bowing  low  and  stammering. `Nothing, unless it might be-unless it is permitted to ask. nay,  to name a single strand of your hair, which  surpasses the gold of the earth  as the stars surpass the gems of the mine. I do not ask for such a gift. But  you commanded me to name my desire.'       The Elves stirred and murmured with astonishment, and Celeborn gazed at  the Dwarf in wonder, but the Lady smiled. 'It is said that the  skill of the  Dwarves is in their hands rather than in their tongues ' she said; `yet that  is not true of Gimli. For  none have ever  made to me a request  so bold and  yet so  courteous. And  how shall I  refuse, since I commanded him to speak?  But tell me, what would you do with such a gift? '       `Treasure it, Lady,' he answered, `in memory of your words to me at our  first meeting. And if ever I return to the  smithies of my home, it shall be  set in imperishable crystal to  be an heirloom of my house, and a  pledge of  good will between the Mountain and the Wood until the end of days.'       Then the  Lady unbraided  one  of her long tresses, and  cut o ff  three  golden hairs, and laid them in Gimli's hand. `These words shall  go with the  gift,' she said. `I do not foretell, for all foretelling is now vain: on the  one hand lies darkness, and on the other only hope. But if  hope  should not  fail, then I sa y to you, Gimli son of Gluin, that your hands shall flow with  gold, and yet over you gold shall have no dominion.       `And you, Ring-bearer,' she said, turning to Frodo. `I come to you last  who are not last in my thoughts. For you I have prepared  this.'  She held up  a small crystal phial: it glittered as she moved it, and rays of white light  sprang from  her hand.  'In this  phial,' she said, `is  caught the light of  Edrendil's  star,  set amid  the  waters of my fountain. It will shine still  brighter when night is  about you. May it be a  light to you in dark places,  when all other lights go out. Remember Galadriel and her Mirror! '       Frodo took the phial, and for a moment as it shone between them, he saw  her  again  standing  like a  queen,  great and  beautiful,  but  no  longer   terrible. He bowed, but found no words to say.       Now the Lady arose, and Celeborn led them back to  the  hythe. A yellow  noon lay  on the  green land  of  the Tongue, and  the water  glittered with  silver."
}