{
  "id": "3cef3889eca1c8e8758190a8e2802dfee9c5bcb3",
  "text": " Come, look now! '       He  stepped  up beside the silent sentinel on the dark  edge. and Frodo  followed.  Sam  hung back. He already felt insecure enough on this high  wet  platform. Faramir and Frodo looked down. Far below them they  saw  the white  waters pour into  a foaming  bowl, and then  swirl darkly about  a deep oval  basin in the rocks. until they found  their  way out  again through a narrow  gate, and  flowed away, fuming  and  chattering, into  calmer and more level  reaches. The moonlight still slanted down to the  fall's foot and gleamed on  the ripples of the basin. Presently Frodo was aware of a small dark thing on  the  near bank,  but  even as he  looked at  it, it  dived and vanished just   beyond the boil and bubble of the fall, cleaving the  black  water as neatly  as an arrow or an edgewise stone.       Faramir turned to the man at his side. `Now what would you  say that it  is,  Anborn? A squirrel, or a kingfisher? Are there black kingfishers in the  night-pools of Mirkwood?  '       `'Tis not a bird, whatever else it  be,' answered  Anborn. `It has four  limbs and  dives manwise; a pretty mastery of the craft it  shows, too. What  is it at? Seeking a way  up behind  the Curtain to our hidings?  It seems we   ####-are discovered at last. I have my bow here, and I have posted other archers,  nigh  as good  marksmen  as myself, on  either bank.  We  wait only for your  command to shoot , Captain.'       `Shall we shoot? ' said Faramir, turning quickly to Frodo.       Frodo did not answer  for a moment. Then `No! ' he said. `No! I beg you   not to.' If Sam had dared, he  would have said `Yes,' quicker and louder. He  could not see, but  he guessed well  enough from  their words what they were  looking at.       'You  know,  then, what this thing is? '  said Faramir.  `Come, now you   have  seen,  tell me why it should be  spared. In all our words together you   have not once  spoken  of your gangrel companion, and I  let him be for  the  time.  He could  wait till he  was  caught and  brought before me. I sent my  keenest huntsmen to seek  him, but he slipped them, and they had no sight of  him till now, save Anborn here, once  at dusk yesterevening. But now  he has  done worse trespass than  only  to go  coney-snaring in the uplands: he  has  dared to come to Henneth  Annyn,  and his life is forfeit.  I marvel at  the  creature: so secret and so sly as he is, to come sporting in the pool before  our very window. Does he think  that men sleep without watch all  night? Why  does he so?'       'There are two answers, I think,' said  Frodo. `For one thing, he knows  little of Men, and sly though he  is, your refuge is so  hidden that perhaps  he  does  not know that Men are concealed here.  For another, I think  he is  allured here by a mastering desire, stronger than his caution.'       `He is lured here, you  say? ' said  Faramir in  a low voice. `Can  he,  does he then know of your burden? '       `Indeed yes. He bore it himself for many years.'       'He  bore  it? ' said Faramir, breathing sharply in  his wonder.  `This  matter winds itself ever in new riddles. Then he is pursuing it? '       'Maybe. It is precious to him. But I did not speak of that.'       `What then does the creature seek? '       `Fish,' said Frodo. `Look! '       They peered down at the dark pool. A little black head  appeared at the  far end of the basin,  just out of the deep shadow of the rocks. There was a   brief silver glint, and a swirl  of tiny ripples. It swam to  the side,  and  then with  marvellous agility a froglike figure climbed out of the water and  up the bank. At once it sat down and began to gnaw at the small silver thing   that glittered  as it  turned:  the  last rays of the moon  were now  falling   ####-behind the stony wall at the pool's end.       Faramir  laughed softly.  `Fish! '  he said.  `It  is  a less  perilous  hunger. Or maybe not: fish from  the pool of Henneth Annyn  may cost him all  he has to give.'       `Now I have him at the arrow-point,' said Anborn. `Shall  I not  shoot,  Captain? For coming unbidden to this place death is our law.'       `Wait, Anborn,'  said Faramir.  `This is a harder matter than it seems.  What have you to say now, Frodo? Why should we spare? '       `The creature is wretched and hungry,' said Frodo, `and unaware of  his  danger. And Gandalf, your Mithrandir, he  would have  bidden you not to slay  him for that reason, and for others. He forbade the Elves to do so. I do not  know clearly why, and  of what I guess I cannot  speak openly out  here. But  this creature is in some way bound up with my errand. Until you found us and  took us, he was my guide.'       `Your guide! ' said Faramir. `The matter becomes ever stranger. I would  do much for you, Frodo, but this I cannot grant: to let this sly wanderer go  free at his own will from here, to join you later if it please him, or to be  caught by  Orcs and tell all he knows under threat of pain. He must be slain  or taken."
}