{
  "id": "3e8ac5cd8b77ed5792cc3de48846c1bb134766dd",
  "text": " This village was one of the places where she stopped. Afterward the smallfolk painted the top of their holdfast to look like the golden crown she’d worn when she spent the night among them.    I have never seen a dragon.    No one has. The last dragons died a hundred years ago or more. But this was before that.    Queen Alysanne, you say?    Good Queen Alysanne, they called her later. One of the castles on the Wall was named for her as well. Queensgate. Before her visit they called it Snowgate.    If she was so good, she should have torn that Wall down.   No, he thought. The Wall protects the realm. From the Others… and from you and your kind as well, sweetling.  I had another friend who dreamed of dragons. A dwarf. He told me—    JON SNOW!  One of the Thenns loomed above them, frowning.  Magnar wants.  Jon thought it might have been the same man who’d found him outside the cave, the night before they climbed the Wall, but he could not be sure. He got to his feet. Ygritte came with him, which always made Styr frown, but whenever he tried to dismiss her she would remind him that she was a free woman, not a kneeler. She came and went as she pleased.  They found the Magnar standing beneath the tree that grew through the floor of the common room. His captive knelt before the hearth, encircled by wooden spears and bronze swords. He watched Jon approach, but did not speak. The rain was running down the walls and pattering against the last few leaves that still clung to the tree, while smoke swirled thick from the fire.   He must die,  Styr the Magnar said.  Do it, crow.   The old man said no word. He only looked at Jon, standing amongst the wildlings. Amidst the rain and smoke, lit only by the fire, he could not have seen that Jon was all in black, but for his sheepskin cloak. Or could he?  Jon drew Longclaw from its sheath. Rain washed the steel, and the firelight traced a sullen orange line along the edge. Such a small fire, to cost a man his life. He remembered what Qhorin Halfhand had said when they spied the fire in the Skirling Pass. Fire is life up here, he told them, but it can be death as well. That was high in the Frostfangs, though, in the lawless wild beyond the Wall. This was the Gift, protected by the Night’s Watch and the power of Winterfell. A man should have been free to build a fire here, without dying for it.   Why do you hesitate?  Styr said.  Kill him, and be done.   Even then the captive did not speak.  Mercy,  he might have said, or  You have taken my horse, my coin, my food, let me keep my life,  or  No, please, I have done you no harm.  He might have said a thousand things, or wept, or called upon his gods. No words would save him now, though. Perhaps he knew that. So he held his tongue, and looked at Jon in accusation and appeal.  You must not balk, whatever is asked of you. Ride with them, eat with them, fight with them… but this old man had offered no resistance. He had been unlucky, that was all. Who he was, where he came from, where he meant to go on his sorry sway-backed horse… none of it mattered.  He is an old man, Jon told himself. Fifty, maybe even sixty. He lived a longer life than most. The Thenns will kill him anyway, nothing I can say or do will save him. Longclaw seemed heavier than lead in his hand, too heavy to lift. The man kept staring at him, with eyes as big and black as wells. I will fall into those eyes and drown. The Magnar was looking at him too, and he could almost taste the mistrust. The man is dead. What matter if it is my hand that slays him? One cut would do it, quick and clean. Longclaw was forged of Valyrian steel. Like Ice. Jon remembered another killing; the deserter on his knees, his head rolling, the brightness of blood on snow… his father’s sword, his father’s words, his father’s face…   Do it, Jon Snow,  Ygritte urged.  You must. T’ prove you are no crow, but one o’ the free folk.    An old man sitting by a fire?    Orell was sitting by a fire too. You killed him quick enough.  The look she gave him then was hard.  You meant t’ kill me too, till you saw I was a woman. And I was asleep.    That was different. You were soldiers… sentries.    Aye, and you crows didn’t want t’ be seen. No more’n we do, now. It’s just the same. Kill him.   He turned his back on the man.  No.   The Magnar moved closer, tall, cold, and dangerous.  I say yes. I command here.    You command Thenns,  Jon told him,  not free folk.    I see no free folk. I see a crow and a crow wife.    I’m no crow wife!  Ygritte snatched her knife from its sheath. Three quick strides, and she yanked the old man’s head back by the hair and opened his throat from ear to ear. Even in death, the man did not cry out.  You know nothing, Jon Snow!  she shouted at him, and flung the bloody blade at his feet.  The Magnar said something in the Old Tongue. He might have been telling the Thenns to kill Jon where he stood, but he would never know the truth of that. Lightning crashed down from the sky, a searing blue-white bolt that touched the top of the tower in the lake."
}