{
  "id": "3ec2e4bcb06034d666bdeb1868434d11a767bbed",
  "text": "  \"No, sir, nor with me, sir,\" said Mr. Borgin, with a deep bow.  \"In that case, perhaps we can return to my list,\" said Mr. Malfoy shortly. \"I am in something of a hurry, Borgin, I have important business elsewhere today -\"  They started to haggle. Harry watched nervously as Draco drew nearer and nearer to his hiding place, examining the objects for sale. Draco paused to examine a long coil of hangman's rope and to read, smirking, the card propped on a magnificent necklace of opals, Caution: Do Not Touch. Cursed - Has Claimed the Lives of Nineteen Muggle Owners to Date.  * 52  Draco turned away and saw the cabinet right in front of him. He walked forward - he stretched out his hand for the handle  \"Done,\" said Mr. Malfoy at the counter. \"Come, Draco -\"  Harry wiped his forehead on his sleeve as Draco turned away.  \"Good day to you, Mr. Borgin. I'll expect you at the manor tomorrow to pick up the goods.\"  The moment the door had closed, Mr. Borgin dropped his oily manner.  \"Good day yourself, Mister Malfoy, and if the stories are true, you haven't sold me half of what's hidden in your manor ......  Muttering darkly, Mr. Borgin disappeared into a back room. Harry waited for a minute in case he came back, then, quietly as he could, slipped out of the cabinet, past the glass cases, and out of the shop door.  Clutching his broken glasses to his face, Harry stared around. He had emerged into a dingy alleyway that seemed to be made up entirely of shops devoted to the Dark Arts. The one he'd just left, Borgin and Burkes, looked like the largest, but opposite was a nasty window display of shrunken heads and, two doors down, a large cage was alive with gigantic black spiders. Two shabby-looking wizards were watching him from the shadow of a doorway, muttering to each other. Feeling jumpy, Harry set off, trying to hold his glasses on straight and hoping against hope he'd be able to find a way out of here.  An old wooden street sign hanging over a shop selling poisonous candles told him he was in Knockturn Alley. This didn't help, as Harry had never heard of such a place. He supposed he hadn't spoken clearly enough through his mouthful of ashes    back in the Weasleys' fire. Trying to stay calm, he wondered what to do.  \"Not lost are you, my dear?\" said a voice in his ear, making him jump.  An aged witch stood in front of him, holding a tray of what looked horribly like whole human fingernails. She leered at him, showing mossy teeth. Harry backed away.  \"I'm fine, thanks,\" he said. \"I'm just -\"  \"HARRY! What d'yeh think yer doin' down there?\"  Harry's heart leapt. So did the witch; a load of fingernails cascaded down over her feet and she cursed as the massive form of Hagrid, the Hogwarts gamekeeper, came striding toward them, beetle-black eyes flashing over his great bristling beard.  \"Hagrid!\" Harry croaked in relief. \"I was lost - Floo powder -\"  Hagrid seized Harry by the scruff of the neck and pulled him away from the witch, knocking the tray right out of her hands. Her shrieks followed them all the way along the twisting alleyway out into bright sunlight. Harry saw a familiar, snow-white marble building in the distance - Gringotts Bank. Hagrid had steered him right into Diagon Alley.  \"Yer a mess!\" said Hagrid gruffly, brushing soot off Harry so forcefully he nearly knocked him into a barrel of dragon dung outside an apothecary. \"Skulkin' around Knockturn Alley, I dunno dodgy place, Harry - don' want no one ter see yeh down there -\"  \"I realized that,\" said Harry, ducking as Hagrid made to brush him off again. \"I told you, I was lost - what were you doing down there, anyway?\"  * 54  \"I was lookin' fer a Flesh-Eatin' Slug Repellent,\" growled Hagrid. \"They're ruinin' the school cabbages. Yer not on yer own?\"  \"I'm staying with the Weasleys but we got separated,\" Harry explained. \"I've got to go and find them . . . .\"  They set off together down the street.  \"How come yeh never wrote back ter me?\" said Hagrid as Harry jogged alongside him (he had to take three steps to every stride of Hagrid's enormous boots). Harry explained all about Dobby and the Dursleys.  \"Lousy Muggles,\" growled Hagrid. \"If I'd've known -\"  \"Harry! Harry! Over here!\"  Harry looked up and saw Hermione Granger standing at the top of the white flight of steps to Gringotts. She ran down to meet them, her bushy brown hair flying behind her.  \"What happened to your glasses? Hello, Hagrid - Oh, it's wonderful to see you two again - Are you coming into Gringotts, Harry?\"  \"As soon as I've found the Weasleys,\" said Harry.  \"Yeh won't have long ter wait,\" Hagrid said with a grin.  Harry and Hermione looked around: Sprinting up the crowded street were Ron, Fred, George, Percy, and Mr. Weasley.  \"Harry,\" Mr. Weasley panted. \"We hoped you'd only gone one   grate too far .  He mopped his glistening bald patch. \"Molly's  frantic - she's coming now -\"  \"Where did you come out?\" Ron asked.  \"Knockturn Alley,\" said Hagrid grimly.  \"Excellent.\" said Fred and George together."
}