{
  "id": "3fafc43f0956bf75113f98015eddb13ca7844e14",
  "text": "   ####-\"It  looks  as  if  my  dreams  were  coming  true,\"  gasped  Bombur  puffing  up  behind. He wanted to rush straight off into the wood after the lights. But the others  remembered  only  too  well  the  warnings  of  the  wizard  and  of  Beorn.  \"A  feast  would be no good, if we never got back alive from it,\" said Thorin.  \"But  without  a  feast  we  shan't  remain  alive  much  longer  anyway,\"  said  Bombur, and Bilbo heartily agreed with him. They argued about it backwards and  forwards for a long while, until they agreed at length to send out a couple of spies,  to  creep  near  the  lights  and  find  out  more  about  them.  But  then  they  could  not  agree  on  who  was  to  be  sent:  no  one  seemed  anxious  to  run  the  chance  of  being  lost  and  never  finding  his  friends  again.  In  the  end,  in  spite  of  warnings,  hunger  decided  them,  because  Bombur  kept  on  describing  all  the  good  things  that  were  being eaten, according to his dream, in the woodland feast; so they all left the path  and plunged into the forest together.   After  a  good  deal  of  creeping  and  crawling  they  peered  round  the  trunks  and  looked  into  a  clearing where  some  trees  had  been  felled  and  the  ground  levelled.  There were many people there, elvish-looking folk, all dressed in green and brown  and  sitting  on  sawn  rings  of  the  felled  trees  in  a  great  circle.  There was  a  fire  in  their midst  and  there were  torches  fastened  to  some  of  the  trees  round  about;  but  most splendid sight of all: they were eating and drinking and laughing merrily.   The smell of the roast meats was so enchanting that, without waiting to consult  one  another,  every  one  of  them  got  up  and  scrambled  forwards  into  the  ring with  the  one  idea  of  begging  for  some  food.  No  sooner  had  the  first  stepped  into  the  clearing  than all  the  lights went out as  if by magic. Somebody kicked the fire and  it  went  up  in  rockets  of  glittering  sparks  and  vanished.  They  were  lost  in  a  completely  lightless dark and  they could not even find one another, not for a  long  time  at  any  rate.  After  blundering  frantically  in  the  gloom,  falling  over  logs,  bumping  crash  into  trees,  and  shouting  and  calling  till  they  must  have  waked  everything  in  the  forest  for miles,  at  last  they managed  to  gather  themselves  in  a  bundle  and  count  themselves  by  touch.  By  that  time  they  had,  of  course,  quite  forgotten  in what direction  the path  lay,  and  they were  all hopelessly  lost,  at  least  till morning.  There was nothing for it but to settle down for the night where they were; they  did not  even dare  to  search on  the ground  for  scraps of  food  for  fear of becoming  separated again. But they had not been lying long, and Bilbo was only just getting  drowsy, when Dori, whose turn it was to watch first, said in a loud whisper:  \"The  lights  are  coming  out  again  over  there,  and  there  are more  than  ever  of  them.\"   ####-Up they all jumped. There, sure enough, not far away were scores of twinkling  lights, and  they heard  the voices and  the  laughter quite plainly. They crept slowly  towards  them,  in  a  single  line,  each  touching  the  back  of  the  one  in  front. When  they  got  near Thorin  said:  \"No  rushing  forward  this  time! No  one  is  to  stir  from  hiding till I say. I shall send Mr. Baggins alone first to talk to them. They won't be  frightened  of  him-('What  about me  of  them?'  thought  Bilbo)-and any way  I hope  they won't do anything nasty to him.\"  When  they  got  to  the  edge  of  the  circle  of  lights  they  pushed  Bilbo  suddenly  from behind. Before he had  time  to  slip on his  ring, he  stumbled  forward  into  the  full blaze of the fire and torches. It was no good. Out went all the lights again and  complete darkness fell. If  it had been difficult collecting  themselves before,  it was  far  worse  this  time.  And  they  simply  could  not  find  the  hobbit.  Every  time  they  counted  themselves  it  only  made  thirteen.  They  shouted  and  called:  \"Bilbo  Baggins!  Hobbit!  You  dratted  hobbit!  Hi!  hobbit,  confusticate  you,  where  are  you?\" and other things of that sort, but there was no answer.   They were just giving up hope, when Dori stumbled across him by sheer luck.  In the dark he fell over what he thought was a log, and he found it was the hobbit  curled  up  fast  asleep.  It  took  a  deal  of  shaking  to  wake  him,  and  when  he  was  awake he was not pleased at all.  \"I  was  having  such  a  lovely  dream,\"  he  grumbled,  \"all  about  having  a  most  gorgeous dinner.\"  \"Good  heavens!  he  has  gone  like  Bombur,\"  they  said.  \"Don't  tell  us  about  dreams. Dream-dinners aren't any good, and we can't share them.\"  \"They  are  the best  I  am  likely  to get  in  this beastly place,\" he muttered,  as he  lay  down  beside  the  dwarves  and  tried  to  go  back  to  sleep  and  find  his  dream  again."
}