{
  "id": "3fd0b595225fc9306ce8ae2463a0f47e6b493eb9",
  "text": " This. All.  His breathing was very shallow now, his voice a whisper.  Tell my son. Jorah. Tell him, take the black. My wish. Dying wish.    Wish?  The raven cocked its head, beady black eyes shining.  Corn?  the bird asked.   No corn,  said Mormont feebly.  Tell Jorah. Forgive him. My son. Please. Go.    It’s too far,  said Sam.  I’ll never reach the Wall, my lord.  He was so very tired. All he wanted was to sleep, to sleep and sleep and never wake, and he knew that if he just stayed here soon enough Dirk or Ollo Lophand or Clubfoot Karl would get angry with him and grant his wish, just to see him die.  I’d sooner stay with you. See, I’m not frightened anymore. Of you, or… of anything.    You should be,  said a woman’s voice.  Three of Craster’s wives were standing over them. Two were haggard old women he did not know, but Gilly was between them, all bundled up in skins and cradling a bundle of brown and white fur that must have held her baby.  We’re not supposed to talk to Craster’s wives,  Sam told them.  We have orders.    That’s done now,  said the old woman on the right.   The blackest crows are down in the cellar, gorging,  said the old woman on the left,  or up in the loft with the young ones. They’ll be back soon, though. Best you be gone when they do. The horses run off, but Dyah’s caught two.    You said you’d help me,  Gilly reminded him.   I said Jon would help you. Jon’s brave, and he’s a good fighter, but I think he’s dead now. I’m a craven. And fat. Look how fat I am. Besides, Lord Mormont’s hurt. Can’t you see? I couldn’t leave the Lord Commander.    Child,  said the other old woman,  that old crow’s gone before you. Look.   Mormont’s head was still in his lap, but his eyes were open and staring and his lips no longer moved. The raven cocked its head and squawked, then looked up at Sam.  Corn?    No corn. He has no corn.  Sam closed the Old Bear’s eyes and tried to think of a prayer, but all that came to mind was,  Mother have mercy. Mother have mercy. Mother have mercy.    Your mother can’t help you none,  said the old woman on the left.  That dead old man can’t neither. You take his sword and you take that big warm far cloak o’ his and you take his horse if you can find him. And you go.    The girl don’t lie,  the old woman on the right said.  She’s my girl, and I beat the lying out of her early on. You said you’d help her. Do what Ferny says, boy. Take the girl and be quick about it.    Quick,  the raven said.  Quick quick quick.    Where?  asked Sam, puzzled.  Where should I take her?    Someplace warm,  the two old women said as one.  Gilly was crying.  Me and the babe. Please. I’ll be your wife, like I was Craster’s. Please, ser crow. He’s a boy, just like Nella said he’d be. If you don’t take him, they will.    They?  said Sam, and the raven cocked its black head and echoed,  They. They. They.    The boy’s brothers,  said the old woman on the left.  Craster’s sons. The white cold’s rising out there, crow. I can feel it in my bones. These poor old bones don’t lie. They’ll be here soon, the sons.       Arya   Her eyes had grown accustomed to blackness. When Harwin pulled the hood off her head, the ruddy glare inside the hollow hill made Arya blink like some stupid owl.  A huge firepit had been dug in the center of the earthen floor, and its flames rose swirling and crackling toward the smoke-stained ceiling. The walls were equal parts stone and soil, with huge white roots twisting through them like a thousand slow pale snakes. People were emerging from between those roots as she watched; edging out from the shadows for a look at the captives, stepping from the mouths of pitch-black tunnels, popping out of crannies and crevices on all sides. In one place on the far side of the fire, the roots formed a kind of stairway up to a hollow in the earth where a man sat almost lost in the tangle of weirwood.  Lem unhooded Gendry.  What is this place?  he asked.   An old place, deep and secret. A refuge where neither wolves nor lions come prowling.   Neither wolves nor lions. Arya’s skin prickled. She remembered the dream she’d had, and the taste of blood when she tore the man’s arm from his shoulder.  Big as the fire was, the cave was bigger; it was hard to tell where it began and where it ended. The tunnel mouths might have been two feet deep or gone on two miles. Arya saw men and women and little children, all of them watching her warily.  Greenbeard said,  Here’s the wizard, skinny squirrel. You’ll get your answers now.  He pointed toward the fire, where Tom Sevenstrings stood talking to a tall thin man with oddments of old armor buckled on over his ratty pink robes. That can’t be Thoros of Myr. Arya remembered the red priest as fat, with a smooth face and a shiny bald head. This man had a droopy face and a full head of shaggy grey hair. Something Tom said made him look at her, and Arya thought he was about to come over to her. Only then the Mad Huntsman appeared, shoving his captive down into the light, and she and Gendry were forgotten."
}