{
  "id": "3feb4bb909ca9bfc08afc60190ca7e4f083cabab",
  "text": " 'It will be  quicker so.  The ground is firmer in the Eastemnet, where the chief northward track lies,   across the river, but Shadowfax knows the way through every fen and hollow.'       For many hours they rode on through the meads and riverlands. Often the   grass was so high  that it  reached above the knees of the riders, and their   ####-steeds seemed to be swimming in a grey-green sea. They came upon many  hidden  pools, and broad acres of sedge waving above wet and  treacherous bogs;  but  Shadowfax found the way, and the  other horses followed in his swath. Slowly  the sun  fell from the sky down into the  West. Looking  out  over the great  plain,  far away the riders saw it for a moment like a red fire sinking into  the grass. Low upon the edge of sight shoulders of the mountains glinted red  upon either side. A smoke seemed to rise up and darken the sun's disc to the  hue of blood, as if it had kindled the grass as it passed down under the rim  of earth.       'There lies the Gap of Rohan,' said Gandalf. 'It is now almost due west   of us. That way lies Isengard.'       'I see a great smoke,' said Legolas. 'What may that be?'       'Battle and war!' said  Gandalf. 'Ride on!'     ####-   Chapter 6. The King of the Golden Hall            They rode on  through sunset,  and slow dusk, and gathering night. When  at last they  halted  and  dismounted,  even  Aragorn  was stiff and  weary.  Gandalf only allowed  them a few  hou rs' rest. Legolas and  Gimli  slept and   Aragorn lay flat, stretched upon his back; but Gandalf stood, leaning on his  staff, gazing  into the darkness, east and  west.  All was silent, and there  was no sign or sound of living thing. The night was barred with long clouds,   fleeting on a  chill wind, when  they  arose again. Under the cold moon they  went on once more, as swift as by the light of day.       Hours passed and still they rode on. Gimli nodded and would have fallen  from his seat, if Gandalf had not clutched and shaken him. Hasufel and Arod,  weary but proud, followed their  tireless leader, a grey shadow before  them  hardly to he seen. The miles went by. The waxing moon  sank into the  cloudy  West.       A bitter chill came into the air. Slowly in the East the dark  faded to  a  cold grey. Red  shafts of light leapt  above  the black walls of the Emyn  Muil  far  away upon  their  left. Dawn came clear and bright; a wind  swept   across  their path,  rushing through the  bent  grasses.  Suddenly Shadowfax  stood still and neighed. Gandalf pointed ahead.       'Look!' he  cried, and  they lifted their tired eyes. Before them stood  the mountains  of  the South:  white-tipped  and  streaked  with black.  The  grass-lands  rolled against  the  hills  that clustered  at their feet,  and  flowed up into many valleys still  dim and  dark, untouched  by the light of  dawn,  winding  their way into the heart of the great mountains. Immediately  before  the travellers the widest of these  glens  opened  like a  long gulf  among the hills. Far inward they  glimpsed a tumbled mountain -mass with  one  tall peak;  at the mouth of  the  vale there  stood  like  sentinel a lonely  height. About its feet  there flowed, as a thread of silver, the stream that  issued from the dale; upon its brow they caught, still  far away, a glint in  the rising sun, a  glimmer of gold. 'Speak, Legolas!' said Gandalf. 'Tell us  what you see there before us!'       Legolas  gazed  ahead, shading  his eyes from the  level shafts  of the  new-risen  sun. 'I see a  white stream  that comes down from  the snows,' he   said. 'Where it issues  from the shadow  of the vale a green hill rises upon   ####-the east. A dike and mighty wall and thorny fence encircle it. Within  there  rise the  roofs of houses; and in the midst, set upon a green terrace, there  stands  aloft  a  great  hall of Men. And it  seems to  my eyes  that it  is  thatched with gold. The light  of it shines  far over the land. Golden, too,  are the posts of its  doors. There men  in bright  mail stand; but all  else  within the courts are yet asleep.'       'Edoras  those courts are called,' said Gandalf, 'and Meduseld  is that  golden hall. There dwells Thjoden son of Thengel, King of the Mark of Rohan.  We  are come  with the  rising  of  the day.  Now the road lies plain to see  before us.  But  we  must  ride  more  warily; for  war  is abroad,  and the  Rohirrim, the Horse-lords, do not sleep, even if it seem so from afar.  Draw  no  weapon, speak no  haughty  word,  I  counsel you all, until we  are come  before Thjoden's seat.'       The  morning was  bright and clear about them, and birds were  singing,  when the  travellers came to the stream. It ran down swiftly into the plain,  and beyond the feet  of  the hills  turned across their path in a wide bend,  flowing away east to  feed the Entwash far off in  its reed-choked beds. The  land was green: in the wet meads and along  the grassy borders of the stream  grew many willow-trees."
}