{
  "id": "3fffc66543dd802ac548e3e3da6cd75ac7155c0a",
  "text": " You'll be back with your dear Mudblood mother soon, Harry... She bought you twelve years of borrowed time ... but Lord Voldemort got you in the end, as you knew he must . . . .\"  If this is dying, thought Harry, it's not so bad.  Even the pain was leaving him ....  But was this dying? Instead of going black, the Chamber seemed to be coming back into focus. Harry gave his head a little shake and there was Fawkes, still resting his head on Harry's arm. A pearly patch of tears was shining all around the wound -- except that there was no wound  \"Get away, bird,\" said Riddle's voice suddenly. \"Get away from him - I said, get away --\"  Harry raised his head. Riddle was pointing Harry's wand at  Fawkes; there was a bang like a gun, and Fawkes took flight again in a whirl of gold and scarlet.  \"Phoenix tears. - .\" said Riddle quietly, staring at Harry's arm. \"Of course ... healing powers ... I forgot. . .\"  He looked into Harry's face. \"But it makes no difference. In fact, I prefer it this way. Just you and me, Harry Potter ... you and me....  He raised the wand  Then, in a rush of wings, Fawkes had soared back overhead and something fell into Harry's lap -- the diary.  For a split second, both Harry and Riddle, wand still raised, stared at it. Then, without thinking, without considering, as though he had meant to do it all along, Harry seized the basilisk fang on the floor next to him and plunged it straight into the heart of the book.  There was a long, dreadful, piercing scream. Ink spurted out of the diary in torrents, streaming over Harry's hands, flooding the floor. Riddle was writhing and twisting, screaming and flailing and then  He had gone. Harry's wand fell to the floor with a clatter and there was silence. Silence except for the steady drip drip of ink still oozing from the diary. The basilisk venom had burned a sizzling hole right through it.  Shaking all over, Harry pulled himself up. His head was spinning as though he'd just traveled miles by Floo powder. Slowly, he gathered together his wand and the Sorting Hat, and, with a huge tug, retrieved the glittering sword from the roof of the basilisk's mouth.  Then came a faint moan from the end of the Chamber. Ginny was stirring. As Harry hurried toward her, she sat up. Her bemused  1,522  eyes traveled from the huge form of the dead basilisk, over Harry, in his blood-soaked robes, then to the diary in his hand. She drew a great, shuddering gasp and tears began to pour down her face.  \"Harry -- oh, Harry -- I tried to tell you at b-breakfast, but I c-couldn't say it in front of Percy -- it was me, Harry -- but I -- I s-swear I d- diddt mean to -- R-Riddle made me, he t-took me over -- and - how did you kill that -- that thing? W-where's Riddle? The last thing I r- remember is him coming out of the diary --\"  \" It's all right,\" said Harry, holding up the diary, and showing Ginny the fang hole, \"Riddle's finished. Look! Him and the basilisk. C'mon, Ginny, let's get out of here --\"  \"I'm going to be expelled!\" Ginny wept as Harry helped her awkwardly to her feet. \"I've looked forward to coming to Hogwarts ever since B-Bill came and n-now I'll have to leave and -- w-what'll Mum and Dad say?\"  Fawkes was waiting for them, hovering in the Chamber entrance. Harry urged Ginny forward; they stepped over the motionless coils of the dead basilisk, through the echoing gloom, and back into the tunnel. Harry heard the stone doors close behind them with a soft hiss.  After a few minutes' progress up the dark tunnel, a distant sound of slowly shifting rock reached Harry's ears.  \"Ron!\" Harry yelled, speeding up. \"Ginny's okay! I've got her!\"  He heard Ron give a strangled cheer, and they turned the next bend to see his eager face staring through the sizable gap he had managed to make in the rock fall.  \"Ginny!\" Ron thrust an arm through the gap in the rock to pull  321,3  her through first. \"You're alive! I don't believe it! What happened?\" How - what -- where did that bird come from?\"  Fawkes had swooped through the gap after Ginny.  \"He's Dumbledore's,\" said Harry, squeezing through himself  \"How come you've got a sword?\" said Ron, gaping at the glittering weapon in Harry's hand.  \"I'll explain when we get out of here,\" said Harry with a sideways glance at Ginny, who was crying harder than ever.  \"But --\"  \"Later,\" Harry said shortly. He didn't think it was a good idea to tell Ron yet who'd been opening the Chamber, not in front of Ginny, anyway. \"Where's Lockhart?\"  \"Back there,\" said Ron, still looking puzzled but jerking his head up the tunnel toward the pipe. \"He's in a bad way. Come and see.\"  Led by Fawkes, whose wide scarlet wings emitted a soft golden glow in the darkness, they walked all the way back to the mouth of the pipe. Gilderoy Lockhart was sitting there, humming placidly to himself.  \"His memory's gone,\" said Ron. \"The Memory Charm backfired. Hit him instead of us. Hasn't got a clue who he is, or where he is, or who we are. I told him to come and wait here."
}