{
  "id": "426f4d8d1959d35e17243e617a0ad88b5af87db7",
  "text": "  Shagga laughed.  The Halfman has no goats.    I’ll get some just for you.   Dawn was breaking, and pale ripples of light shimmered on the surface of the river, shattering under the poles and reforming when the ferry had passed. Timett had taken his Burned Men into the kingswood two days before. Yesterday the Black Ears and Moon Brothers followed, today the Stone Crows.   Whatever you do, don’t try and fight a battle,  Tyrion said.  Strike at their camps and baggage train. Ambush their scouts and hang the bodies from trees ahead of their line of march, loop around and cut down stragglers. I want night attacks, so many and so sudden that they’ll be afraid to sleep—   Shagga laid a hand atop Tyrion’s head.  All this I learned from Dolf son of Holger before my beard had grown. This is the way of war in the Mountains of the Moon.    The kingswood is not the Mountains of the Moon, and you won’t be fighting Milk Snakes and Painted Dogs. And listen to the guides I’m sending, they know this wood as well as you know your mountains. Heed their counsel and they’ll serve you well.    Shagga will listen to the Halfman’s pets,  the clansman promised solemnly. And then it was time for him to lead his garron onto the ferry. Tyrion watched them push off and pole out toward the center of the Blackwater. He felt a queer twinge in the pit of his stomach as Shagga faded in the morning mist. He was going to feel naked without his clansmen.  He still had Bronn’s hirelings, near eight hundred of them now, but sellswords were notoriously fickle. Tyrion had done what he could to buy their continued loyalty, promising Bronn and a dozen of his best men lands and knighthoods when the battle was won. They’d drunk his wine, laughed at his jests, and called each other ser until they were all staggering… all but Bronn himself, who’d only smiled that insolent dark smile of his and afterward said,  They’ll kill for that knighthood, but don’t ever think they’ll die for it.   Tyrion had no such delusion.  The gold cloaks were almost as uncertain a weapon. Six thousand men in the City Watch, thanks to Cersei, but only a quarter of them could be relied upon.  There’s few out-and-out traitors, though there’s some, even your spider hasn’t found them all,  Bywater had warned him.  But there’s hundreds greener than spring grass, men who joined for bread and ale and safety. No man likes to look craven in the sight of his fellows, so they’ll fight brave enough at the start, when it’s all warhorns and blowing banners. But if the battle looks to be going sour they’ll break, and they’ll break bad. The first man to throw down his spear and run will have a thousand more trodding on his heels.   To be sure, there were seasoned men in the City Watch, the core of two thousand who’d gotten their gold cloaks from Robert, not Cersei. Yet even those… a watchman was not truly a soldier, Lord Tywin Lannister had been fond of saying. Of knights and squires and men-at-arms, Tyrion had no more than three hundred. Soon enough, he must test the truth of another of his father’s sayings: One man on a wall was worth ten beneath it.  Bronn and the escort were waiting at the foot of the quay, amidst swarming beggars, strolling whores, and fishwives crying the catch. The fishwives did more business than all the rest combined. Buyers flocked around the barrels and stalls to haggle over winkles, clams, and river pike. With no other food coming into the city, the price of fish was ten times what it had been before the war, and still rising. Those who had coin came to the riverfront each morning and each evening, in hopes of bringing home an eel or a pot of red crabs; those who did not slipped between the stalls hoping to steal, or stood gaunt and forlorn beneath the walls.  The gold cloaks cleared a path through the press, shoving people aside with the shafts of their spears. Tyrion ignored the muttered curses as best he could. A fish came sailing out of the crowd, slimy and rotten. It landed at his feet and flew to pieces. He stepped over it gingerly and climbed into his saddle. Children with swollen bellies were already fighting over pieces of the stinking fish.  Mounted, he gazed along the riverfront. Hammers rang in the morning air as carpenters swarmed over the Mud Gate, extending wooden hoardings from the battlements. Those were coming well. He was a deal less pleased by the clutter of ramshackle structures that had been allowed to grow up behind the quays, attaching themselves to the city walls like barnacles on the hull of a ship; bait shacks and pot-shops, warehouses, merchants’ stalls, alehouses, the cribs where the cheaper sort of whores spread their legs. It has to go, every bit of it. As it was, Stannis would hardly need scaling ladders to storm the walls.  He called Bronn to his side.  Assemble a hundred men and burn everything you see here between the water’s edge and the city walls.  He waved his stubby fingers, taking in all the waterfront squalor.  I want nothing left standing, do you understand?   The black-haired sellsword turned his head, considering the task."
}