{
  "id": "427509053736393f7a1b2ff8f4cf01b969863bf6",
  "text": "   ####-'Hasufel is  his name,'  said  Jomer.  'May he bear  you well and to  better   fortune than Gbrulf, his late master!'       A  smaller and lighter  horse, but  restive and fiery,  was brought  to  Legolas. Arod was his  name.  But Legolas asked them to take  off saddle and  rein. 'I need them not,' he said, and leaped lightly up, and to their wonder   Arod was  tame and willing  beneath  him, moving  here and there  with but a  spoken word: such was the elvish way with all good beasts.  Gimli was lifted  up behind  his friend. and  he clung to him, not much more at ease than  Sam  Gamgee in a boat.       'Farewell, and may you find what  you  seek!' cried Jomer. 'Return with  what speed you may, and let our swords hereafter shine together!'       'I will come,' said Aragorn.       'And I will come, too,' said Gimli. 'The matter  of the  Lady Galadriel  lies still between us. I have yet to teach you gentle speech. '       'We  shall see,' said Jomer. 'So many strange things  have chanced that  to learn the praise of a fair lady under the loving strokes of a Dwarf's axe  will seem no great wonder. Farewell!'       With that they parted.  Very swift were the horses of Rohan. When aft er  a little Gimli looked back, the company of Jomer were  already small and far  away. Aragorn did not look  back: he was watching the  trail as they sped on  their way, bending low with his head beside the neck of Hasufel. Before long  they came to the  borders of the Entwash, and there they met the other trail  of which Jomer had spoken, coming down from the East out of the Wold.       Aragorn dismounted and surveyed the ground, then  leaping back into the   saddle, he rode  away for  some distance  eastward, keeping to one side  and  taking care not  to override  the footprints. Then he again  dismounted  and  examined the ground, going backwards and forwards on foot.       'There  is  little  to  discover,'  he said when he returned. 'The main  trail is all confused with the passage of  the  horsemen  as they came back;  their outward  course  must have lain nearer  the river. But  this  eastward  trail is fresh and clear. There is no sign there of any feet going the other   way, back towards  Anduin. Now  we  must ride slower, and make sure  that no  trace or footstep branches off on either side. The Orcs must have been aware  from this point that they were  pursued; they may have made some  attempt to  get their captives away before they were overtaken.'       As they rode forward the  day  was overcast.  Low grey clouds came over   the  Wold.  A  mist  shrouded the sun. Ever nearer  the  tree-clad slopes of   ####-Fangorn loomed, slowly darkling as the sun  went west. They  saw no  sign of  any  trail to  right or  left, but here  a nd  there they passed single Orcs,   fallen in  their tracks as they  ran, with grey-feathered arrows sticking in  back or throat.       At  last  as the  afternoon was  waning they came  to  the eaves of the  forest, and in  an open  glade among the first trees they found the place of  the great burning:  the ashes were  still hot  and smoking. Beside it was  a   great pile of  helms and mail, cloven shields, and broken swords,  bows  and  darts  and other gear of war. Upon  a stake in  the  middle was set a  great  goblin head;  upon its shattered helm the  white badge could  still be seen.  Further away, not far from the river, where  it  came streaming out from the  edge of  the wood, there was a mound. It was newly raised: the raw earth was  covered with fresh-cut turves: about it were planted fifteen spears.        Aragorn and  his  companions  searched far and wide about  the field of  battle,  but  the light faded, and evening soon drew down, dim and misty. By  nightfall they had discovered no trace of Merry and Pippin.       'We can  do no more,' said Gimli sadly. 'We have been set  many riddles  since we  came to Tol Brandir, but this  is the hardest to  unravel. I would  guess  that the burned bones of  the hobbits are now mingled with the Orcs'.   It will be hard news for Frodo, if he lives to hear it; and hard too for the  old hobbit who waits in Rivendell. Elrond was against their coming.'       'But Gandalf was not,' said Legolas.        'But Gandalf chose  to come himself, and he was the first to be  lost '  answered Gimli. 'His foresight failed him.'       'The counsel of Gandalf was not founded on foreknowledge of safety, for   himself  or for  others,' said Aragorn. 'There are some  things that  it  is  better to begin than to refuse, even though the end may be dark. But I shall  not  depart  from  this  place yet.  In  any  case  we  must  here await the  morning-light.'       A little way  beyond  the battle-field they  made  their  camp under  a   spreading tree: it looked  like a chestnut, and yet it still bore many broad  brown leaves  of a former year,  like dry  hands with long splayed  fingers;   they rattled mournfully in the night-breeze.       Gimli shivered."
}