{
  "id": "42efae20badd0502c0cb34669b9a754fefdac46a",
  "text": "  I knew you’d learn what Davos had to say soon enough. You always do, don’t you?    I would be of no help to you if I did not,  Cressen said.  I met Davos on the stair.    And he told all, I suppose? I should have had the man’s tongue shortened along with his fingers.    He would have made you a poor envoy then.    He made me a poor envoy in any case. The storm lords will not rise for me. It seems they do not like me, and the justice of my cause means nothing to them. The cravenly ones will sit behind their walls waiting to see how the wind rises and who is likely to triumph. The bold ones have already declared for Renly. For Renly!  He spat out the name like poison on his tongue.   Your brother has been the Lord of Storm’s End these past thirteen years. These lords are his sworn bannermen—    His,  Stannis broke in,  when by rights they should be mine. I never asked for Dragonstone. I never wanted it. I took it because Robert’s enemies were here and he commanded me to root them out. I built his fleet and did his work, dutiful as a younger brother should be to an elder, as Renly should be to me. And what was Robert’s thanks? He names me Lord of Dragonstone, and gives Storm’s End and its incomes to Renly. Storm’s End belonged to House Baratheon for three hundred years; by rights it should have passed to me when Robert took the Iron Throne.   It was an old grievance, deeply felt, and never more so than now. Here was the heart of his lord’s weakness; for Dragonstone, old and strong though it was, commanded the allegiance of only a handful of lesser lords, whose stony island holdings were too thinly peopled to yield up the men that Stannis needed. Even with the sellswords he had brought across the narrow sea from the Free Cities of Myr and Lys, the host camped outside his walls was far too small to bring down the power of House Lannister.   Robert did you an injustice,  Maester Cressen replied carefully,  yet he had sound reasons. Dragonstone had long been the seat of House Targaryen. He needed a man’s strength to rule here, and Renly was but a child.    He is a child still,  Stannis declared, his anger ringing loud in the empty hall,  a thieving child who thinks to snatch the crown off my brow. What has Renly ever done to earn a throne? He sits in council and jests with Littlefinger, and at tourneys he dons his splendid suit of armor and allows himself to be knocked off his horse by a better man. That is the sum of my brother Renly, who thinks he ought to be a king. I ask you, why did the gods inflict me with brothers?    I cannot answer for the gods.    You seldom answer at all these days, it seems to me. Who maesters for Renly? Perchance I should send for him, I might like his counsel better. What do you think this maester said when my brother decided to steal my crown? What counsel did your colleague offer to this traitor blood of mine?    It would surprise me if Lord Renly sought counsel, Your Grace.  The youngest of Lord Steffon’s three sons had grown into a man bold but heedless, who acted from impulse rather than calculation. In that, as in so much else, Renly was like his brother Robert, and utterly unlike Stannis.   Your Grace,  Stannis repeated bitterly.  You mock me with a king’s style, yet what am I king of? Dragonstone and a few rocks in the narrow sea, there is my kingdom.  He descended the steps of his chair to stand before the table, his shadow falling across the mouth of the Blackwater Rush and the painted forest where King’s Landing now stood. There he stood, brooding over the realm he sought to claim, so near at hand and yet so far away.  Tonight I am to sup with my lords bannermen, such as they are. Celtigar, Velaryon, Bar Emmon, the whole paltry lot of them. A poor crop, if truth be told, but they are what my brothers have left me. That Lysene pirate Salladhor Saan will be there with the latest tally of what I owe him, and Morosh the Myrman will caution me with talk of tides and autumn gales, while Lord Sunglass mutters piously of the will of the Seven. Celtigar will want to know which storm lords are joining us. Velaryon will threaten to take his levies home unless we strike at once. What am I to tell them? What must I do now?    Your true enemies are the Lannisters, my lord,  Maester Cressen answered.  If you and your brother were to make common cause against them—    I will not treat with Renly,  Stannis answered in a tone that brooked no argument.  Not while he calls himself a king.    Not Renly, then,  the maester yielded. His lord was stubborn and proud; when he had set his mind, there was no changing it.  Others might serve your needs as well. Eddard Stark’s son has been proclaimed King in the North, with all the power of Winterfell and Riverrun behind him.    A green boy,  said Stannis,  and another false king. Am I to accept a broken realm?    Surely half a kingdom is better than none,  Cressen said,  and if you help the boy avenge his father’s murder—    Why should I avenge Eddard Stark? The man was nothing to me."
}