{
  "id": "446ade00756e0eed0c6e98e6dc1bfecd93a7e167",
  "text": "  \"All right, you three?\" Hagrid yelled over the heads of the crowd. They waved at him, but had no chance to speak to him because the mass of people around them was shunting them away along the platform. Harry, Ron, and Hermione followed the rest of the school along the platform and out onto a rough mud track, where at least a hundred stagecoaches awaited the remaining students, each pulled, Harry could only assume, by an invisible horse, because when they climbed inside and shut the door, the coach set off all by itself, bumping and swaying in procession.  The coach smelled faintly of mold and straw. Harry felt better since the chocolate, but still weak. Ron and Hermione kept looking at him sideways, as though frightened he might collapse again.  As the carriage trundled toward a pair of magnificent wrought iron gates, flanked with stone columns topped with winged boars,  Harry saw two more towering, hooded dementors, standing guard on either side. A wave of cold sickness threatened to engulf him again; he leaned back into the lumpy seat and closed his eyes until they had passed the gates. The carriage picked up speed on the long, sloping drive up to the castle; Hermione was leaning out of the tiny window, watching the many turrets and towers draw nearer. At last, the carriage swayed to a halt, and Hermione and Ron got out.  As Harry stepped down, a drawling, delighted voice sounded in his ear.  \"You fainted, Potter? Is Longbottorn telling the truth? You actualy fainted?\"  Malfoy elbowed past Hermione to block Harry's way up the stone steps to the castle, his face gleeful and his pale eyes glinting maliciously. \"Shove off, Malfoy,\" said Ron, whose jaw was clenched.  \"Did you faint as well, Weasley?\" said Malfoy loudly. \"Did the scary old dementor frighten you too, Weasley?\"  \"Is there a problem?\" said a mild voice. Professor Lupin had just gotten out of the next carriage.  Malfoy gave Professor Lupin an insolent stare, which took in the patches on his robes and the delapidated suitcase. With a tiny hint of sarcasm in his voice, he said, \"Oh, no -- er -- Professor,\" then he smirked at Crabbe and Goyle and led them up the steps into the castle.  Hermione prodded Ron in the back to make him hurry, and the three of them joined the crowd swarming up the steps, through the giant oak front doors, into the cavernous entrance hall, which was lit with flaming torches, and housed a magnificent marble staircase that led to the upper floors.  The door into the Great Hall stood open at the right; Harry followed the crowd toward it, but had barely glimpsed the enchanted ceiling, which was black and cloudy tonight, when a voice called, \"Potter! Granger! I want to see you both!\"  Harry and Hermione turned around, surprised. Professor McGonagall, Transfiguration teacher and head of Gryffindor House, was calling over the heads of the crowd. She was a sternlooking witch who wore her hair in a tight bun; her sharp eyes were framed with square spectacles. Harry fought his way over to her with a feeling of foreboding: Professor McGonagall had a way of making him feel he must have done something wrong.  \"There's no need to look so worried -- I just want a word in MY office,\" she told them. \"Move along there, Weasley.\"  Ron stared as Professor McGonagall ushered Harry and Hermione away from the chattering crowd; they accompanied her across the entrance hall, up the marble staircase, and along a corridor.  Once they were in her office, a small room with a large, welcoming fire, Professor McGonagall motioned Harry and Hermione to sit down. She settled herself behind her desk and said abruptly, \"Professor Lupin sent an owl ahead to say that you were taken ill on the train, Potter.\"  Before Harry could reply, there was a soft knock on the door and Madam Pomfrey, the nurse, came bustling in.  Harry felt himself going red in the face. It was bad enough that he'd passed out, or whatever he had done, without everyone making all this fuss.  \"I'm fine,\" he said, \"I don't need anything  \"Oh, it's you, is it?\" said Madam Pomfrey, ignoring this and bending down to stare closely at him. \"I suppose you've been doing something dangerous again?\"  \"It was a dementor, Poppy,\" said Professor McGonagall.  They exchanged a dark look, and Madam Pomfrey clucked disapprovingly.  \"Setting dementors around a school, she muttered, pushing back Harry's hair and feeling his forehead. \"He won't be the last one who collapses. Yes, he's all clammy. Terrible things, they are, and the effect they have on people who are already delicate  \"I'm not delicate!\" said Harry crossly.  \"Of course you're not,\" said Madam Pomfrey absentmindedly, now taking his pulse.  \"What does he need?\" said Professor McGonagall crisply. \"Bed rest? Should he perhaps spend tonight in the hospital wing?\"  \"I'm fine!\" said Harry, jumping up. The thought of what Draco Malfoy would say if he had to go to the hospital wing was torture.  \"Well, he should have some chocolate, at the very least,\" said Madam Pomfrey, who was now trying to peer into Harry's eyes."
}