{
  "id": "4694c8d8f88b2de585eb129d2d04afb317ceae4a",
  "text": " That’s what I’ll give you, Lady Sansa. Your brother’s head.   A kind of madness took over her then, and she heard herself say,  Maybe my brother will give me your head.   Joffrey scowled.  You must never mock me like that. A true wife does not mock her lord. Ser Meryn, teach her.   This time the knight grasped her beneath the jaw and held her head still as he struck her. He hit her twice, left to right, and harder, right to left. Her lip split and blood ran down her chin, to mingle with the salt of her tears.   You shouldn’t be crying all the time,  Joffrey told her.  You’re more pretty when you smile and laugh.   Sansa made herself smile, afraid that he would have Ser Meryn hit her again if she did not, but it was no good, the king still shook his head.  Wipe off the blood, you’re all messy.   The outer parapet came up to her chin, but along the inner edge of the walk was nothing, nothing but a long plunge to the bailey seventy or eighty feet below. All it would take was a shove, she told herself. He was standing right there, right there, smirking at her with those fat wormlips. You could do it, she told herself. You could. Do it right now. It wouldn’t even matter if she went over with him. It wouldn’t matter at all.   Here, girl.  Sandor Clegane knelt before her, between her and Joffrey. With a delicacy surprising in such a big man, he dabbed at the blood welling from her broken lip.  The moment was gone. Sansa lowered her eyes.  Thank you,  she said when he was done. She was a good girl, and always remembered her courtesies.      DAENERYS  Wings shadowed her fever dreams.   You don’t want to wake the dragon, do you?   She was walking down a long hall beneath high stone arches. She could not look behind her, must not look behind her. There was a door ahead of her, tiny with distance, but even from afar, she saw that it was painted red. She walked faster, and her bare feet left bloody footprints on the stone.   You don’t want to wake the dragon, do you?   She saw sunlight on the Dothraki sea, the living plain, rich with the smells of earth and death. Wind stirred the grasses, and they rippled like water. Drogo held her in strong arms, and his hand stroked her sex and opened her and woke that sweet wetness that was his alone, and the stars smiled down on them, stars in a daylight sky.  Home,  she whispered as he entered her and filled her with his seed, but suddenly the stars were gone, and across the blue sky swept the great wings, and the world took flame.   …don’t want to wake the dragon, do you?   Ser Jorah’s face was drawn and sorrowful.  Rhaegar was the last dragon,  he told her. He warmed translucent hands over a glowing brazier where stone eggs smouldered red as coals. One moment he was there and the next he was fading, his flesh colorless, less substantial than the wind.  The last dragon,  he whispered, thin as a wisp, and was gone. She felt the dark behind her, and the red door seemed farther away than ever.   …don’t want to wake the dragon, do you?   Viserys stood before her, screaming.  The dragon does not beg, slut. You do not command the dragon. I am the dragon, and I will be crowned.  The molten gold trickled down his face like wax, burning deep channels in his flesh.  I am the dragon and I will be crowned!  he shrieked, and his fingers snapped like snakes, biting at her nipples, pinching, twisting, even as his eyes burst and ran like jelly down seared and blackened cheeks.   …don’t want to wake the dragon…   The red door was so far ahead of her, and she could feel the icy breath behind, sweeping up on her. If it caught her she would die a death that was more than death, howling forever alone in the darkness. She began to run.   …don’t want to wake the dragon…   She could feel the heat inside her, a terrible burning in her womb. Her son was tall and proud, with Drogo’s copper skin and her own silver-gold hair, violet eyes shaped like almonds. And he smiled for her and began to lift his hand toward hers, but when he opened his mouth the fire poured out. She saw his heart burning through his chest, and in an instant he was gone, consumed like a moth by a candle, turned to ash. She wept for her child, the promise of a sweet mouth on her breast, but her tears turned to steam as they touched her skin.   …want to wake the dragon…   Ghosts lined the hallway, dressed in the faded raiment of kings. In their hands were swords of pale fire. They had hair of silver and hair of gold and hair of platinum white, and their eyes were opal and amethyst, tourmaline and jade.  Faster,  they cried,  faster, faster.  She raced, her feet melting the stone wherever they touched.  Faster!  the ghosts cried as one, and she screamed and threw herself forward. A great knife of pain ripped down her back, and she felt her skin tear open and smelled the stench of burning blood and saw the shadow of wings. And Daenerys Targaryen flew.   …wake the dragon…   The door loomed before her, the red door, so close, so close, the hall was a blur around her, the cold receding behind."
}