{
  "id": "47a31bbd3b44b076501f62a7530aaae56202f524",
  "text": " \"But mostly, sir, life has improved for my kind since you triumphed over He-Who-Must-Not-Be-Named. Harry Potter survived, and the Dark Lord's power was broken, and it was a new dawn, sir, and Harry Potter shone like a beacon of hope for those of us who thought the Dark days would never end, sit... And now, at Hogwarts, terrible things are to happen, are perhaps happening already, and Dobby cannot let Harry Potter stay here now that history is to repeat itself, now that the Chamber of Secrets is open once more  Dobby froze, horrorstruck, then grabbed Harry's water jug from his bedside table and cracked it over his own head, toppling out of sight. A second later, he crawled back onto the bed, cross-eyed, muttering, \"Bad Dobby, very bad Dobby. . .\"  \"So there is a Chamber of Secrets?\" Harry whispered. \"And did you say it's been opened before? Tell me, Dobby!\"  He seized the elf's bony wrist as Dobby's hand inched toward the water jug. \"But I'm not Muggle-born - how can I be in danger from the Chamber?\"  \"Ah, sir, ask no more, ask no more of poor Dobby,\" stammered the elf, his eyes huge in the dark. \"Dark deeds are planned in this place, but Harry Potter must not be here when they happen - go home, Harry Potter, go home. Harry Potter must not meddle in this, sir, 'tis too dangerous -\"  \"Who is it, Dobby?\" Harry said, keeping a firm hold on Dobby's  *178*  wrist to stop him from hitting himself with the water jug again. \"Who's opened it? Who opened it last time?\"  \"Dobby can't, sir, Dobby can't, Dobby mustn't tell!\" squealed the elf. \"Go home, Harry Potter, go home!\"  \"I'm not going anywhere!\" said Harry fiercely. \"One of my best friends is Muggle-born; she'll be first in line if the Chamber really has been opened -\"  \"Harry Potter risks his own life for his friends!\" moaned Dobby in a kind of miserable ecstasy. \"So noble! So valiant! But he must save himself, he must, Harry Potter must not -\"  Dobby suddenly froze, his bat ears quivering. Harry heard it, too. There were footsteps coming down the passageway outside.  \"Dobby must go!\" breathed the elf, terrified. There was a loud crack, and Harry's fist was suddenly clenched on thin air. He slumped back into bed, his eyes on the dark doorway to the hospital wing as the footsteps drew nearer.  Next moment, Dumbledore was backing into the dormitory, wearing a long woolly dressing gown and a nightcap. He was carrying one end of what looked like a statue. Professor McGonagall appeared a second later, carrying its feet. Together, they heaved it onto a bed.  \"Get Madam Pomfrey,\" whispered Dumbledore, and Professor McGonagall hurried past the end of Harry's bed out of sight. Harry lay quite still, pretending to be asleep. He heard urgent voices, and then Professor McGonagall swept back into view, closely followed by Madam Pomfrey, who was pulling a cardigan on over her nightdress. He heard a sharp intake of breath.  \"What happened?\" Madam Pomfrey whispered to Dumbledore, bending over the statue on the bed.  *l79*  \"Another attack,\" said Dumbledore. \"Minerva found him on the stairs.  \"There was a bunch of grapes next to him,\" said Professor McGonagall. \"We think he was trying to sneak up here to visit Potter.\"  Harry's stomach gave a horrible lurch. Slowly and carefully, he raised himself a few inches so he could look at the statue on the bed. A ray of moonlight lay across its staring face.  It was Colin Creevey. His eyes were wide and his hands were stuck up in front of him, holding his camera.  \"Petrified?\" whispered Madam Pomfrey.  \"Yes,\" said Professor McGonagall. \"But I shudder to think ... If Albus hadn't been on the way downstairs for hot chocolate - who knows what might have -\"  The three of them stared down at Colin. Then Dumbledore leaned forward and wrenched the camera out of Colin's rigid grip.  \"You don't think he managed to get a picture of his attacker?\" said Professor McGonagall eagerly.  Dumbledore didn't answer. He opened the back of the camera.  \"Good gracious!\" said Madam Pomfrey.  A jet of steam had hissed out of the camera. Harry, three beds away, caught the acrid smell of burnt plastic.  \"Melted,\" said Madam Pomfrey wonderingly. \"All melted...\"  \"What does this mean, Albus?\" Professor McGonagall asked urgently.  \"It means,\" said Dumbledore, \"that the Chamber of Secrets is indeed open again.\"  Madam Pomfrey clapped a hand to her mouth. Professor McGonagall stared at Dumbledore.  *180*  \"But, Albus ... surely ... who?\" \"The question is not who,\" said Dumbledore, his eyes on Colin. \"The question is, how . . . .\" And from what Harry could see of Professor McGonagall's shad owy face, she didn't understand this any better than he did.  C H-H A P T t R ELEVEN  THE D-KJEL]ING C-L-IJIB  Harry woke up on Sunday morning to find the dormitory blazing with winter sunlight and his arm reboned but very stiff. He sat up quickly and looked over at Colin's bed, but it had been blocked from view by the high curtains Harry had changed behind yesterday. Seeing that he was awake, Madam Pomfrey came bustling over with a breakfast tray and then began bending and stretching his arm and fingers."
}