{
  "id": "4ae89700395c4dfb5e769f1e42a2b8a61758f0ba",
  "text": "  She skinnied farther out, until the branch began to sag under her weight. No boats were tied to the pier, but she could see thin tendrils of smoke rising from some of the chimneys, and part of a wagon jutting out behind a stable.  Someone’s there. Arya chewed her lip. All the other places they’d come upon had been empty and desolate. Farms, villages, castles, septs, barns, it made no matter. If it could burn, the Lannisters had burned it; if it could die, they’d killed it. They had even set the woods ablaze where they could, though the leaves were still green and wet from recent rains, and the fires had not spread.  They would have burned the lake if they could have,  Gendry had said, and Arya knew he was right. On the night of their escape, the flames of the burning town had shimmered so brightly on the water that it had seemed that the lake was afire.  When they finally summoned the nerve to steal back into the ruins the next night, nothing remained but blackened stones, the hollow shells of houses, and corpses. In some places wisps of pale smoke still rose from the ashes. Hot Pie had pleaded with them not to go back, and Lommy called them fools and swore that Ser Amory would catch them and kill them too, but Lorch and his men had long gone by the time they reached the holdfast. They found the gates broken down, the walls partly demolished, and the inside strewn with the unburied dead. One look was enough for Gendry.  They’re killed, every one,  he said.  And dogs have been at them too, look.    Or wolves.    Dogs, wolves, it makes no matter. It’s done here.   But Arya would not leave until they found Yoren. They couldn’t have killed him, she told herself, he was too hard and tough, and a brother of the Night’s Watch besides. She said as much to Gendry as they searched among the corpses.  The axe blow that had killed him had split his skull apart, but the great tangled beard could be no one else’s, or the garb, patched and unwashed and so faded it was more grey than black. Ser Amory Lorch had given no more thought to burying his own dead than to those he had murdered, and the corpses of four Lannister men-at-arms were heaped near Yoren’s. Arya wondered how many it had taken to bring him down.  He was going to take me home, she thought as they dug the old man’s hole. There were too many dead to bury them all, but Yoren at least must have a grave, Arya had insisted. He was going to bring me safe to Winterfell, he promised. Part of her wanted to cry. The other part wanted to kick him.  It was Gendry who thought of the lord’s towerhouse and the three that Yoren had sent to hold it. They had come under attack as well, but the round tower had only one entry, a second-story door reached by a ladder. Once that had been pulled inside, Ser Amory’s men could not get at them. The Lannisters had piled brush around the tower’s base and set it afire, but the stone would not burn, and Lorch did not have the patience to starve them out. Cutjack opened the door at Gendry’s shout, and when Kurz said they’d be better pressing on north than going back, Arya had clung to the hope that she still might reach Winterfell.  Well, this village was no Winterfell, but those thatched roofs promised warmth and shelter and maybe even food, if they were bold enough to risk them. Unless it’s Lorch there. He had horses; he would have traveled faster than us.  She watched from the tree for a long time, hoping she might see something; a man, a horse, a banner, anything that would help her know. A few times she glimpsed motion, but the buildings were so far off it was hard to be certain. Once, very clearly, she heard the whinny of a horse.  The air was full of birds, crows mostly. From afar, they were no larger than flies as they wheeled and flapped above the thatched roofs. To the east, Gods Eye was a sheet of sun-hammered blue that filled half the world. Some days, as they made their slow way up the muddy shore (Gendry wanted no part of any roads, and even Hot Pie and Lommy saw the sense in that), Arya felt as though the lake were calling her. She wanted to leap into those placid blue waters, to feel clean again, to swim and splash and bask in the sun. But she dare not take off her clothes where the others could see, not even to wash them. At the end of the day she would often sit on a rock and dangle her feet in the cool water. She had finally thrown away her cracked and rotted shoes. Walking barefoot was hard at first, but the blisters had finally broken, the cuts had healed, and her soles had turned to leather. The mud was nice between her toes, and she liked to feel the earth underfoot when she walked.  From up here, she could see a small wooded island off to the northeast. Thirty yards from shore, three black swans were gliding over the water, so serene… no one had told them that war had come, and they cared nothing for burning towns and butchered men. She stared at them with yearning. Part of her wanted to be a swan. The other part wanted to eat one."
}