{
  "id": "4c6c988efcd0f25178bb65d0749e51d556d8032b",
  "text": "  Yet after a while the motion of her horse became as soothing as the rocking of a cradle, and Arya found her eyes growing heavy. She let them close, just for an instant, then snapped them wide again. I can’t go to sleep, she screamed at herself silently, I can’t, I can’t. She knuckled at her eye and rubbed it hard to keep it open, clutching the reins tightly and kicking her mount to a canter. But neither she nor the horse could sustain the pace, and it was only a few moments before they fell back to a walk again, and a few more until her eyes closed a second time. This time they did not open quite so quickly.  When they did, she found that her horse had come to a stop and was nibbling at a tuft of grass, while Gendry was shaking her arm.  You fell asleep,  he told her.   I was just resting my eyes.    You were resting them a long while, then. Your horse was wandering in a circle, but it wasn’t till she stopped that I realized you were sleeping. Hot Pie’s just as bad, he rode into a tree limb and got knocked off, you should have heard him yell. Even that didn’t wake you up. You need to stop and sleep.    I can keep going as long as you can.  She yawned.   Liar,  he said.  You keep going if you want to be stupid, but I’m stopping. I’ll take the first watch. You sleep.    What about Hot Pie?   Gendry pointed. Hot Pie was already on the ground, curled up beneath his cloak on a bed of damp leaves and snoring softly. He had a big wedge of cheese in one fist, but it looked as though he had fallen asleep between bites.  It was no good arguing, Arya realized; Gendry had the right of it. The Mummers will need to sleep too, she told herself, hoping it was true. She was so weary it was a struggle even to get down from the saddle, but she remembered to hobble her horse before finding a place beneath a beech tree. The ground was hard and damp. She wondered how long it would be before she slept in a bed again, with hot food and a fire to warm her. The last thing she did before closing her eyes was unsheathe her sword and lay it down beside her.  Ser Gregor,  she whispered, yawning.  Dunsen, Polliver, Raff the Sweetling. The Tickler and… the Tickler… the Hound…   Her dreams were red and savage. The Mummers were in them, four at least, a pale Lyseni and a dark brutal axeman from Ib, the scarred Dothraki horse lord called Iggo and a Dornishman whose name she never knew. On and on they came, riding through the rain in rusting mail and wet leather, swords and axe clanking against their saddles. They thought they were hunting her, she knew with all the strange sharp certainty of dreams, but they were wrong. She was hunting them.  She was no little girl in the dream; she was a wolf, huge and powerful, and when she emerged from beneath the trees in front of them and bared her teeth in a low rumbling growl, she could smell the rank stench of fear from horse and man alike. The Lyseni’s mount reared and screamed in terror, and the others shouted at one another in mantalk, but before they could act the other wolves came hurtling from the darkness and the rain, a great pack of them, gaunt and wet and silent.  The fight was short but bloody. The hairy man went down as he unslung his axe, the dark one died stringing an arrow, and the pale man from Lys tried to bolt. Her brothers and sisters ran him down, turning him again and again, coming at him from all sides, snapping at the legs of his horse and tearing the throat from the rider when he came crashing to the earth.  Only the belled man stood his ground. His horse kicked in the head of one of her sisters, and he cut another almost in half with his curved silvery claw as his hair tinkled softly.  Filled with rage, she leapt onto his back, knocking him head-first from his saddle. Her jaws locked on his arm as they fell, her teeth sinking through the leather and wool and soft flesh. When they landed she gave a savage jerk with her head and ripped the limb loose from his shoulder. Exulting, she shook it back and forth in her mouth, scattering the warm red droplets amidst the cold black rain.      Tyrion   He woke to the creak of old iron hinges.   Who?  he croaked. At least he had his voice back, raw and hoarse though it was. The fever was still on him, and Tyrion had no notion of the hour. How long had he slept this time? He was so weak, so damnably weak.  Who?  he called again, more loudly. Torchlight spilled through the open door, but within the chamber the only light came from the stub of a candle beside his bed.  When he saw a shape moving toward him, Tyrion shivered. Here in Maegor’s Holdfast, every servant was in the queen’s pay, so any visitor might be another of Cersei’s catspaws, sent to finish the work Ser Mandon had begun.  Then the man stepped into the candlelight, got a good look at the dwarf’s pale face, and chortled.  Cut yourself shaving, did you?   Tyrion’s fingers went to the great gash that ran from above one eye down to his jaw, across what remained of his nose. The proud flesh was still raw and warm to the touch."
}