{
  "id": "4c74dc9828291fc4a63018e0f6908ba3178d29ce",
  "text": " His crutch slipped and he fell to his knees. The crypts were growing darker. A light has gone out somewhere.  Ygritte?  he whispered.  Forgive me. Please.  But it was only a direwolf, grey and ghastly, spotted with blood, his golden eyes shining sadly through the dark…  The cell was dark, the bed hard beneath him. His own bed, he remembered, his own bed in his steward’s cell beneath the Old Bear’s chambers. By rights it should have brought him sweeter dreams. Even beneath the furs, he was cold. Ghost had shared his cell before the ranging, warming it against the chill of night. And in the wild, Ygritte had slept beside him. Both gone now. He had burned Ygritte himself, as he knew she would have wanted, and Ghost… where are you? Was he dead as well, was that what his dream had meant, the bloody wolf in the crypts? But the wolf in the dream had been grey, not white. Grey, like Bran’s wolf. Had the Thenns hunted him down and killed him after Queenscrown? If so, Bran was lost to him for good and all.  Jon was trying to make sense of that when the horn blew.  The Horn of Winter, he thought, still confused from sleep. But Mance never found Joramun’s horn, so that couldn’t be. A second blast followed, as long and deep as the first. Jon had to get up and go to the Wall, he knew, but it was so hard…  He shoved aside his furs and sat. The pain in his leg seemed duller, nothing he could not stand. He had slept in his breeches and tunic and smallclothes, for the added warmth, so he had only to pull on his boots and don leather and mail and cloak. The horn blew again, two long blasts, so he slung Longclaw over one shoulder, found his crutch, and hobbled down the steps.  It was the black of night outside, bitter cold and overcast. His brothers were spilling out of towers and keeps, buckling their swordbelts and walking toward the Wall. Jon looked for Pyp and Grenn, but could not find them. Perhaps one of them was the sentry blowing the horn. It is Mance, he thought. He has come at last. That was good. We will fight a battle, and then we’ll rest. Alive or dead, we’ll rest.  Where the stair had been, only an immense tangle of charred wood and broken ice remained below the Wall. The winch raised them up now, but the cage was only big enough for ten men at a time, and it was already on its way up by the time Jon arrived. He would need to wait for its return. Others waited with him; Satin, Mully, Spare Boot, Kegs, big blond Hareth with his buck teeth. Everyone called him Horse, He had been a stablehand in Mole’s Town, one of the few moles who had stayed at Castle Black. The rest had run back to their fields and hovels, or their beds in the underground brothel. Horse wanted to take the black, though, the great buck-toothed fool. Zei remained as well, the whore who’d proved so handy with a crossbow, and Noye had kept three orphan boys whose father had died on the steps. They were young—nine and eight and five—but no one else seemed to want them.  As they waited for the cage to come back, Clydas brought them cups of hot mulled wine, while Three-Finger Hobb passed out chunks of black bread. Jon took a heel from him and gnawed on it.   Is it Mance Rayder?  Satin asked anxiously.   We can hope so.  There were worse things than wildlings in the dark. Jon remembered the words the wildling king had spoken on the Fist of the First Men, as they stood amidst that pink snow. When the dead walk, walls and stakes and swords mean nothing. You cannot fight the dead, Jon Snow. No man knows that half so well as me. Just thinking of it made the wind seem a little colder.  Finally the cage came clanking back down, swaying at the end of the long chain, and they crowded in silently and shut the door.  Mully yanked the bell rope three times. A moment later they began to rise, by fits and starts at first, then more smoothly. No one spoke. At the top the cage swung sideways and they clambered out one by one. Horse gave Jon a hand down onto the ice. The cold hit him in the teeth like a fist.  A line of fires burned along the top of the Wall, contained in iron baskets on poles taller than a man. The cold knife of the wind stirred and swirled the flames, so the lurid orange light was always shifting. Bundles of quarrels, arrows, spears, and scorpion bolts stood ready on every hand. Rocks were piled ten feet high, big wooden barrels of pitch and lamp oil lined up beside them. Bowen Marsh had left Castle Black well supplied in everything save men. The wind was whipping at the black cloaks of the scarecrow sentinels who stood along the ramparts, spears in hand.  I hope it wasn’t one of them who blew the horn,  Jon said to Donal Noye when he limped up beside him.   Did you hear that?  Noye asked.  There was the wind, and horses, and something else.  A mammoth,  Jon said.  That was a mammoth.   The armorer’s breath was frosting as it blew from his broad, flat nose. North of the Wall was a sea of darkness that seemed to stretch forever. Jon could make out the faint red glimmer of distant fires moving through the wood."
}