{
  "id": "4cc34d3fefb502fbd82d4e713aaf61fef98aef1c",
  "text": "    Lord of Light, shine your face upon us.    Light your flame among us, R’hllor,  said the red priest.  Show us the truth or falseness of this man. Strike him down if he is guilty, and give strength to his sword if he is true. Lord of Light, give us wisdom.    For the night is dark,  the others chanted, Harwin and Anguy loud as all the rest,  and full of terrors.    This cave is dark too,  said the Hound,  but I’m the terror here. I hope your god’s a sweet one, Dondarrion. You’re going to meet him shortly.   Unsmiling, Lord Beric laid the edge of his longsword against the palm of his left hand, and drew it slowly down. Blood ran dark from the gash he made, and washed over the steel.  And then the sword took fire.  Arya heard Gendry whisper a prayer.   Burn in seven hells,  the Hound cursed.  You, and Thoros too.  He threw a glance at the red priest.  When I’m done with him you’ll be next, Myr.    Every word you say proclaims your guilt, dog,  answered Thoros, while Lem and Greenbeard and Jack-Be-Lucky shouted threats and curses. Lord Beric himself waited silent, calm as still water, his shield on his left arm and his sword burning in his right hand. Kill him, Arya thought, please, you have to kill him. Lit from below, his face was a death mask, his missing eye a red and angry wound. The sword was aflame from point to crossguard, but Dondarrion seemed not to feel the heat. He stood so still he might have been carved of stone.  But when the Hound charged him, he moved fast enough.  The flaming sword leapt up to meet the cold one, long streamers of fire trailing in its wake like the ribbons the Hound had spoken of. Steel rang on steel. No sooner was his first slash blocked than Clegane made another, but this time Lord Beric’s shield got in the way, and wood chips flew from the force of the blow. Hard and fast the cuts came, from low and high, from right and left, and each one Dondarrion blocked. The flames swirled about his sword and left red and yellow ghosts to mark its passage. Each move Lord Beric made fanned them and made them burn the brighter, until it seemed as though the lightning lord stood within a cage of fire.  Is it wildfire?  Arya asked Gendry.   No. This is different. This is…    …magic?  she finished as the Hound edged back. Now it was Lord Beric attacking, filling the air with ropes of fire, driving the bigger man back on his heels. Clegane caught one blow high on his shield, and a painted dog lost a head. He countercut, and Dondarrion interposed his own shield and launched a fiery backslash. The outlaw brotherhood shouted on their leader.  He’s yours!  Arya heard, and  At him! At him! At him!  The Hound parried a cut at his head, grimacing as the heat of the flames beat against his face. He grunted and cursed and reeled away.  Lord Beric gave him no respite. Hard on the big man’s heels he followed, his arm never still. The swords clashed and sprang apart and clashed again, splinters flew from the lightning shield while swirling flames kissed the dogs once, and twice, and thrice. The Hound moved to his right, but Dondarrion blocked him with a quick sidestep and drove him back the other way… toward the sullen red blaze of the firepit. Clegane gave ground until he felt the heat at his back. A quick glance over his shoulder showed him what was behind him, and almost cost him his head when Lord Beric attacked anew.  Arya could see the whites of Sandor Clegane’s eyes as he bulled his way forward again. Three steps up and two back, a move to the left that Lord Beric blocked, two more forward and one back, clang and clang, and the big oaken shields took blow after blow after blow. The Hound’s lank dark hair was plastered to his brow in a sheen of sweat. Wine sweat, Arya thought, remembering that he’d been taken drunk. She thought she could see the beginnings of fear wake in his eyes. He’s going to lose, she told herself, exulting, as Lord Beric’s flaming sword whirled and slashed. In one wild flurry, the lightning lord took back all the ground the Hound had gained, sending Clegane staggering to the very edge of the firepit once more. He is, he is, he’s going to die. She stood on her toes for a better look.   Bloody bastard!  the Hound screamed as he felt the fire licking against the back of his thighs. He charged, swinging the heavy sword harder and harder, trying to smash the smaller man down with brute force, to break blade or shield or arm. But the flames of Dondarrion’s parries snapped at his eyes, and when the Hound jerked away from them, his foot went out from under him and he staggered to one knee. At once Lord Beric closed, his downcut screaming through the air trailing pennons of fire. Panting from exertion, Clegane jerked his shield up over his head just in time, and the cave rang with the loud crack of splintering oak.   His shield is afire,  Gendry said in a hushed voice. Arya saw it in the same instant. The flames had spread across the chipped yellow paint, and the three black dogs were engulfed."
}