{
  "id": "4d9e81a54ad7f8fad3f7b85ab7d94f50b84bf90c",
  "text": "       'Just a  plain hobbit you  look,' said Bilbo.  'But there is more about  you now than  appears  on the surface. Good luck to you!' He turned away and  looked out of the window, trying to hum a tune.       'I cannot thank you as I should, Bilbo,  for this, and for all our past   kindnesses,' said Frodo.       'Don't try!' said the old hobbit, turning round and slapping him on the  back.  `Ow!' he cried. `You are  too  hard  now  to slap! But there you are:  Hobbits must stick together, and especially  Bagginses. All I  ask in return  is: take  as much care of yourself as you can. and  bring  back all the news  you can, and  any old  songs and  tales you can come by. I'll do  my best to  finish my book before you return. I should like to write the second book, if   ####-I am spared.' He broke off and turned to the window again, singing softly.         I sit beside the fire and think       of all that I have seen,       of meadow-flowers and butterflies       in summers that have been;         Of yellow leaves and gossamer       in autumns that there were,       with morning mist and silver sun       and wind upon my hair.         I sit beside the fire and think       of how the world will be       when winter comes without a spring       that I shall ever see.         For still  there are so many things       that I have never seen:       in every wood in every spring       there is a different green.         I sit beside the fire and think       of people long ago,       and people who will see a world        that I shall never know.          But all the while I sit and think       of times there were before,       I listen for returning feet       and voices at the door.         It was  a  cold grey  day near the end of  December.  The East Wind was  streaming through  the  bare branches of the trees, and seething in the dark  pines on the hills. Ragged clouds  were hurrying overhead,  dark and low. As  the cheerless shadows  of the early evening began  to  fall the Company made  ready to set out. They were to start at dusk, for Elrond  counselled them to   ####-journey  under cover  of night as often as  they could,  until they were far  from Rivendell.       `You should fear the many eyes  of the servants of Sauron,' he said. 'I   do not doubt that news of the discomfiture of the Riders has already reached  him,  and he will be filled with wrath. Soon now his spies on foot  and  wing   will be abroad in the northern lands. Even of the  sky above you must beware  as you go on your way.'       The Company took little gear of war,  for their hope was in secrecy not  in battle. Aragorn had And®ril  but no other weapon, and he went  forth clad  only in rusty green and brown. as a  Ranger of the wilderness. Boromir had a  long sword,  in fashion like And®ril but of less  lineage and he bore also a   shield and his war-horn.       'Loud and  clear it sounds  in the valleys of the hills,' he said, `and  then  let all the foes  of Gondor  flee!' Putting  it to  his lips he blew a   blast, and the echoes leapt from rock to rock, and all that heard that voice  in Rivendell sprang to their feet.       Slow  should you  be to  wind  that  horn again,  Boromir, said Elrond.  'until you stand once more on the  borders of your land, and dire need is on  you.'       `Maybe,' said Boromir.  'But always I have let my  horn cry  at setting  forth, and though thereafter we may walk in the shadows, I will not go forth  as a thief in the night.'       Gimli the  dwarf alone wore  openly  a short shirt of steel-rings,  for   dwarves make  light  of burdens;  and in  his  belt was a  broad-bladed axe.  Legolas had  a bow and a  quiver,  and  at his belt a long  white knife. The  younger  hobbits wore the swords that they had  taken  from the  barrow; but  Frodo took only Sting;  and his mail-coat, as Bilbo wished, remained hidden.  Gandalf bore his staff, but girt at his side was  the elven-sword Glamdring,  the mate of Orcrist that lay now upon  the breast of Thorin under the Lonely  Mountain.       All were well furnished by Elrond with thick warm clothes, and they had  jackets and cloaks lined with  fur. Spare food and clothes  and blankets and  other needs were laden on a  pony, none other  than the poor beast that they  had brought from Bree.       ?he stay  in Rivendell had  worked a  great wonder of change on him: he  was  glossy and seemed  to  have  the vigour of youth.  It  was  Sam who had  insisted on choosing him, declaring that Bill (as he called him) would pine,   ####-if he did not come.       `That  animal can nearly talk,' he said, `and  would talk, if he stayed  here  much longer. He gave me a  look as plain as Mr. Pippin could speak it:  if you don't  let me go  with you, Sam, I'll follow  on my own.' So Bill was  going as the beast of burden, yet he was the only member of the Company that  did not seem depressed.       Their  farewells had been  said in the great hall by the  fire, and they  were only waiting now for  Gandalf, who had not yet come out of the house."
}