{
  "id": "4e7113dd7a1fee8f72674bd50c968ee08af1bef2",
  "text": " \"It's over there, it got washed out ......  Harry and Ron looked under the sink where Myrtle was pointing. A small, thin book lay there. It had a shabby black cover and was as wet as everything else in the bathroom. Harry stepped forward to pick it up, but Ron suddenly flung out an arm to hold him back.  \"What?\" said Harry.  \"Are you crazy?\" said Ron. \"It could be dangerous.\"  \"Dangerous?\"said Harry, laughing. \"Come off it, how could it be dangerous?\"  \"You'd be surprised,\" said Ron, who was looking apprehensively at the book. \"Some of the books the Ministry's confiscated Dad's told me - there was one that burned your eyes out. And  *2%0*  everyone who read Sonnets of a Sorcerer spoke in limericks for the rest of their lives. And some old witch in Bath had a book that you could never stop reading! You just had to wander around with your nose in it, trying to do everything one-handed. And -\"  \"All right, I've got the point,\" said Harry.  The little book lay on the floor, nondescript and soggy.  \"Well, we won't find out unless we look at it,\" he said, and he ducked around Ron and picked it up off the floor.  Harry saw at once that it was a diary, and the faded year on the cover told him it was fifty years old. He opened it eagerly. On the first page he could just make out the name \"T M. Riddle\" in smudged ink.  \"Hang on,\" said Ron, who had approached cautiously and was looking over Harry's shoulder. \"I know that name .... T. M. Riddle got an award for special services to the school fifty years ago.\"  \"How on earth d'you know that?\" said Harry in amazement.  \"Because Filch made me polish his shield about fifty times in detention,\" said Ron resentfully. \"That was the one I burped slugs all over. If you'd wiped slime off a name for an hour, you'd remember it, too.\"  Harry peeled the wet pages apart. They were completely blank. There wasn't the faintest trace of writing on any of them, not even Auntie Mabel's birthday, or dentist, half-past three.  \"He never wrote in it,\" said Harry, disappointed.  \"I wonder why someone wanted to flush it away?\" said Ron curiously.  Harry turned to the back cover of the book and saw the printed name of a variety store on Vauxhall Road, London.  *231 *  \"He must've been Muggle-born,\" said Harry thoughtfufly. \"To have bought a diary from Vauxhall Road ......  \"Well, it's not much use to you,\" said Ron. He dropped his voice. \"Fifty points if you can get it through Myrtle's nose.\"  Harry, however, pocketed it.  Hermione left the hospital wing, de-whiskered, tail-less, and furfree, at the beginning of February. On her first evening back in Gryffindor Tower, Harry showed her T. M. Riddle's diary and told her the story of how they had found it.  \"Oooh, it might have hidden powers,\" said Hermione enthusiastically, taking the diary and looking at it closely.  \"If it has, it's hiding them very well,\" said Ron. \"Maybe it's shy. I don't know why you don't chuck it, Harry.\"  \"I wish I knew why someone did try to chuck it,\" said Harry. \"I wouldn't mind knowing how Riddle got an award for special services to Hogwarts either.\"  \"Could've been anything,\" said Ron. \"Maybe he got thirty O.WL.s or saved a teacher from the giant squid. Maybe he murdered Myrtle; that would've done everyone a favor .....  But Harry could tell from the arrested look on Hermione's face that she was thinking what he was thinking.  \"What?\" said Ron, looking from one to the other.  \"Well, the Chamber of Secrets was opened fifty years ago, wasn't it?\" he said. \"That's what Malfoy said.\"  \"Yeah. . .\" said Ron slowly.  \"And this diary is fifty years old,\" said Hermione, tapping it excitedly.  *232*  a so?  .  \"Oh, Ron, wake up,\" snapped Hermione. \"We know the person who opened the Chamber last time was expelled fifty years ago. We know T. M. Riddle got an award for special services to the school fifty years ago. Well, what if Riddle got his special award for catching the Heir of Slytherin? His diary would probably tell us everything - where the Chamber is, and how to open it, and what sort of creature lives in it - the person who's behind the attacks this time wouldn't want that lying around, would they?\"  \"That's a brilliant theory, Hermione,\" said Ron, \"with just one tiny little flaw. There's nothing written in his diary.\"  But Hermione was pulling her wand out of her bag.  \"It might be invisible ink!\" she whispered.  She tapped the diary three times and said, \"Aparecium!\"  Nothing happened. Undaunted, Hermione shoved her hand back into her bag and pulled out what appeared to be a bright red eraser.  \"It's a Revealer, I got it in Diagon Alley,\" she said.  She rubbed hard on January first. Nothing happened.  \"I'm telling you, there's nothing to find in there,\" said Ron. \"Riddle just got a diary for Christmas and couldn't be bothered filling it in.\"  Harry couldn't explain, even to himself, why he didn't just throw Riddle's diary away. The fact was that even though he knew the diary was blank, he kept absentmindedly picking it up and turning the pages, as though it were a story he wanted to finish."
}