{
  "id": "4f75a14f32af995ff73160fdc2a5edf51b63cdbc",
  "text": " He had just reached the portrait hole when there was a clatter behind him and Colin Creevey came dashing down the spiral staircase, his camera swinging madly around his neck and something clutched in his hand.  \"I heard someone saying your name on the stairs, Harry! Look what I've got here! I've had it developed, I wanted to show you -\"  *105*  Harry looked bemusedly at the photograph Colin was brandishing under his nose.  A moving, black-and-white Lockhart was tugging hard on an arm Harry recognized as his own. He was pleased to see that his photographic self was putting up a good fight and refusing to be dragged into view. As Harry watched, Lockhart gave up and slumped, panting, against the white edge of the picture.  \"Will you sign it?\" said Colin eagerly.  \"No,\" said Harry flatly, glancing around to check that the room was really deserted. \"Sorry, Colin, I'm in a hurry - Quidditch practice -\"  He climbed through the portrait hole.  \"Oh, wow! Wait for me! I've never watched a Quidditch game before!\"  Colin scrambled through the hole after him.  \"It'll be really boring,\" Harry said quickly, but Colin ignored him, his face shining with excitement.  \"You were the youngest House player in a hundred years, weren't you, Harry? Weren't you?\" said Colin, trotting alongside him. \"You must be brilliant. I've never flown. Is it easy? Is that your own broom? Is that the best one there is?\"  Harry didn't know how to get rid of him. It was like having an extremely talkative shadow.  \"I don't really understand Quidditch,\" said Colin breathlessly. \"Is it true there are four balls? And two of them fly around trying to knock people off their brooms?\"  \"Yes,\" said Harry heavily, resigned to explaining the complicated rules of Quidditch. \"They're called Bludgers. There are two Beaters  ), *106*  on each team who carry clubs to beat the Bludgers away from their side. Fred and George Weasley are the Gryffindor Beaters.\"  \"And what are the other balls for?\" Colin asked, tripping down a couple of steps because he was gazing open-mouthed at Harry.  \"Well, the Quafe - that's the biggish red one - is the one that scores goals. Three Chasers on each team throw the Quaffle to each other and try and get it through the goal posts at the end of the pitch - they're three long poles with hoops on the end.\"  \"And the fourth ball -\"  \"- is the Golden Snitch,\" said Harry, \"and it's very small, very fast, and difficult to catch. But that's what the Seeker's got to do, because a game of Quidditch doesn't end until the Snitch has been caught. And whichever team's Seeker gets the Snitch earns his team an extra hundred and fifty points.\"  \"And you're the Gryffindor Seeker, aren't you?\" said Colin in awe.  \"Yes,\" said Harry as they left the castle and started across the dew- drenched grass. \"And there's the Keeper, too. He guards the goal posts. That's it, really.\"  But Colin didn't stop questioning Harry all the way down the sloping lawns to the Quidditch field, and Harry only shook him off when he reached the changing rooms; Colin called after him in a piping voice, \"I'll go and get a good seat, Harry!\" and hurried off to the stands.  The rest of the Gryffindor team were already in the changing room. Wood was the only person who looked truly awake. Fred and George Weasley were sitting, puffy-eyed and touslehaired, next to fourth year Alicia Spinnet, who seemed to be nodding off against the wall behind her. Her fellow Chasers, Katie  *107*  Bell and Angelina Johnson, were yawning side by side opposite them.  \"There you are, Harry, what kept you?\" said Wood briskly. \"Now, I wanted a quick talk with you all before we actually get onto the field, because I spent the summer devising a whole new training program, which I really think will make all the difference ....  Wood was holding up a large diagram of a Quidditch field, on which were drawn many lines, arrows, and crosses in differentcolored inks. He took out his wand, tapped the board, and the arrows began to wiggle over the diagram like caterpillars. As Wood launched into a speech about his new tactics, Fred Weasley's head drooped right onto Alicia Spinnet's shoulder and he began to snore.  The first board took nearly twenty minutes to explain, but there was another board under that, and a third under that one. Harry sank into a stupor as Wood droned on and on.  \"So,\" said Wood, at long last, jerking Harry from a wistful fantasy about what he could be eating for breakfast at this very moment up at the castle. \"Is that clear? Any questions?\"  \"I've got a question, Oliver,\" said George, who had woken with a start. \"Why couldn't you have told us all this yesterday when we were awake?\"  Wood wasn't pleased.  \"Now, listen here, you lot,\" he said, glowering at them all. \"We should have won the Quidditch cup last year. We're easily the best team. But unfortunately -owing to circumstances beyond our control - \"  *108*  Harry shifted guiltily in his seat. He had been unconscious in the hospital wing for the final match of the previous year, meaning that Gryffindor had been a player short and had suffered their worst defeat in three hundred years."
}