{
  "id": "4fe827b566709df1a69c9e1d0d16c53f4f6e90e4",
  "text": "  Harry was glad school was over, but there was no escaping Dudley's gang, who visited the house every single day. Piers, Dennis, Malcolm, and Gordon were all big and stupid, but as Dudley was the biggest and stupidest of the lot, he was the leader. The rest of them were all quite happy to join in Dudley's favorite sport: Harry Hunting.  This was why Harry spent as much time as possible out of the house, wandering around and thinking about the end of the holidays, where he could see a tiny ray of hope. When September came he would be going off to secondary school and, for the first time in his life, he wouldn't be with Dudley. Dudley had been accepted at Uncle Vernon's old private school, Smeltings. Piers Polkiss was going there too. Harry, on the other hand, was going to Stonewall High, the local public school. Dudley thought this was very funny.  \"They stuff people's heads down the toilet the first day at Stonewall,\" he told Harry. \"Want to come upstairs and practice?\"  \"No, thanks,\" said Harry. \"The poor toilet's never had anything as horrible as your head down it -- it might be sick.\" Then he ran, before Dudley could work out what he'd said.  One day in July, Aunt Petunia took Dudley to London to buy his Smeltings uniform, leaving Harry at Mrs. Figg's. Mrs. Figg wasn 't as bad as usual. It turned out she'd broken her leg tripping over one of her cats, and she didn't seem quite as fond of them as before. She let Harry watch television and gave him a bit of chocolate cake that tasted as though she'd had it for several years.  That evening, Dudley paraded around the living room for the family in his brand-new uniform. Smeltings' boys wore maroon tailcoats, orange knickerbockers, and flat straw hats called boaters. They also carried knobbly sticks, used for hitting each other while the teachers weren't looking. This was supposed to be good training for later life.  As he looked at Dudley in his new knickerbockers, Uncle Vernon said gruffly that it was the proudest moment of his life. Aunt Petunia burst into tears and said she couldn't believe it was her Ickle Dudleykins, he looked so handsome and grown-up. Harry didn't trust himself to speak. He thought two of his ribs might already have cracked from trying not to laugh.  There was a horrible smell in the kitchen the next morning when Harry went in for breakfast. It seemed to be coming from a large metal tub in the sink. He went to have a look. The tub was full of what looked like dirty rags swimming in gray water.  \"What's this?\" he asked Aunt Petunia. Her lips tightened as they always did if he dared to ask a question.  \"Your new school uniform,\" she said.  Harry looked in the bowl again.  \"Oh,\" he said, \"I didn't realize it had to be so wet.\"  \"DotA be stupid,\" snapped Aunt Petunia. \"I'm dyeing some of Dudley's old things gray for you. It'll look just like everyone else's when I've finished.\"  Harry seriously doubted this, but thought it best not to argue. He sat down at the table and tried not to think about how he was going to look on his first day at Stonewall High -- like he was wearing bits of old elephant skin, probably.  Dudley and Uncle Vernon came in, both with wrinkled noses because of the smell from Harry's new uniform. Uncle Vernon opened his newspaper as usual and Dudley banged his Smelting stick, which he carried everywhere, on the table.  They heard the click of the mail slot and flop of letters on the doormat.  \"Get the mail, Dudley,\" said Uncle Vernon from behind his paper.  \"Make Harry get it.\"  \"Get the mail, Harry.\"  \"Make Dudley get it.\"  \"Poke him with your Smelting stick, Dudley.\"  Harry dodged the Smelting stick and went to get the mail. Three things lay on the doormat: a postcard from Uncle Vernon's sister Marge, who was vacationing on the Isle of Wight, a brown envelope that looked like a bill, and -- a letter for Harry.  Harry picked it up and stared at it, his heart twanging like a giant elastic band. No one, ever, in his whole life, had written to him. Who would? He had no friends, no other relatives -- he didn't belong to the library, so he'd never even got rude notes asking for books back. Yet here it was, a letter, addressed so plainly there could be no mistake:  Mr. H. Potter  The Cupboard under the Stairs  4 Privet Drive  Little Whinging  Surrey  The envelope was thick and heavy, made of yellowish parchment, and the address was written in emerald-green ink. There was no stamp.  Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger, and a snake surrounding a large letter H.  \"Hurry up, boy!\" shouted Uncle Vernon from the kitchen. \"What are you doing, checking for letter bombs?\" He chuckled at his own joke.  Harry went back to the kitchen, still staring at his letter. He handed Uncle Vernon the bill and the postcard, sat down, and slowly began to open the yellow envelope.  Uncle Vernon ripped open the bill, snorted in disgust, and flipped over the postcard."
}