{
  "id": "5044ea66e8044eebafa825d2dc30c761a9cb7c63",
  "text": " in one of his rare curt letters, Lord Balon had written of his youngest brother going down in a storm, and turning holy when he washed up safe on shore.  Uncle Aeron?  he said doubtfully.   Nephew Theon,  the priest replied.  Your lord father bid me fetch you. Come.    In a moment, Uncle.  He turned back to the Myraham.  My things,  he commanded the captain.  A sailor fetched him down his tall yew bow and quiver of arrows, but it was the captain’s daughter who brought the pack with his good clothing.  Milord.  Her eyes were red. When he took the pack, she made as if to embrace him, there in front of her own father and his priestly uncle and half the island.  Theon turned deftly aside.  You have my thanks.    Please,  she said,  I do love you well, milord.    I must go.  He hurried after his uncle, who was already well down the pier. Theon caught him with a dozen long strides.  I had not looked for you, Uncle. After ten years, I thought perhaps my lord father and lady mother might come themselves, or send Dagmer with an honor guard.    It is not for you to question the commands of the Lord Reaper of Pyke.  The priest’s manner was chilly, most unlike the man Theon remembered. Aeron Greyjoy had been the most amiable of his uncles, feckless and quick to laugh, fond of songs, ale, and women.  As to Dagmer, the Cleftjaw is gone to Old Wyk at your father’s behest, to roust the Stonehouses and the Drumms.    To what purpose? Why are the longships hosting?    Why have longships ever hosted?  His uncle had left the horses tied up in front of the waterside inn. When they reached them, he turned to Theon.  Tell me true, nephew. Do you pray to the wolf gods now?   Theon seldom prayed at all, but that was not something you confessed to a priest, even your father’s own brother.  Ned Stark prayed to a tree. No, I care nothing for Stark’s gods.    Good. Kneel.   The ground was all stones and mud.  Uncle, I—    Kneel. Or are you too proud now, a lordling of the green lands come among us?   Theon knelt. He had a purpose here, and might need Aeron’s help to achieve it. A crown was worth a little mud and horseshit on his breeches, he supposed.   Bow your head.  Lifting the skin, his uncle pulled the cork and directed a thin stream of seawater down upon Theon’s head. It drenched his hair and ran over his forehead into his eyes. Sheets washed down his cheeks, and a finger crept under his cloak and doublet and down his back, a cold rivulet along his spine. The salt made his eyes burn, until it was all he could do not to cry out. He could taste the ocean on his lips.  Let Theon your servant be born again from the sea, as you were,  Aeron Greyjoy intoned.  Bless him with salt, bless him with stone, bless him with steel. Nephew, do you still know the words?    What is dead may never die,  Theon said, remembering.   What is dead may never die,  his uncle echoed,  but rises again, harder and stronger. Stand.   Theon stood, blinking back tears from the salt in his eyes. Wordless, his uncle corked the waterskin, untied his horse, and mounted. Theon did the same. They set off together, leaving the inn and the harbor behind them, up past the castle of Lord Botley into the stony hills. The priest ventured no further word.   I have been half my life away from home,  Theon ventured at last.  Will I find the islands changed?    Men fish the sea, dig in the earth, and die. Women birth children in blood and pain, and die. Night follows day. The winds and tides remain. The islands are as our god made them.   Gods, he has grown grim, Theon thought.  Will I find my sister and my lady mother at Pyke?    You will not. Your mother dwells on Harlaw, with her own sister. It is less raw there, and her cough troubles her. Your sister has taken Black Wind to Great Wyk, with messages from your lord father. She will return e’er long, you may be sure.   Theon did not need to be told that Black Wind was Asha’s longship. He had not seen his sister in ten years, but that much he knew of her. Odd that she would call it that, when Robb Stark had a wolf named Grey Wind.  Stark is grey and Greyjoy’s black,  he murmured, smiling,  but it seems we’re both windy.   The priest had nothing to say to that.   And what of you, Uncle?  Theon asked.  You were no priest when I was taken from Pyke. I remember how you would sing the old reaving songs standing on the table with a horn of ale in hand.    Young I was, and vain,  Aeron Greyjoy said,  but the sea washed my follies and my vanities away. That man drowned, nephew. His lungs filled with seawater, and the fish ate the scales off his eyes. When I rose again, I saw clearly.   He is as mad as he is sour. Theon had liked what he remembered of the old Aeron Greyjoy.  Uncle, why has my father called his swords and sails?    Doubtless he will tell you at Pyke.    I would know his plans now.    From me, you shall not. We are commanded not to speak of this to any man.    Even to me?  Theon’s anger flared. He’d led men in war, hunted with a king, won honor in tourney melees, ridden with Brynden Blackfish and Greatjon Umber, fought in the Whispering Wood, bedded more girls than he could name, and yet this uncle was treating him as though he were still a child of ten."
}