{
  "id": "50b6e2772d4f009a50d41ce39d53a128b5e0aa82",
  "text": "  Has Your Grace forgotten that we are at war with Casterly Rock? In war you kill your enemies. Didn’t your father teach you that, boy?    Boy?  The Greatjon dealt Rickard Karstark a buffet with a mailed fist that sent the other lord to his knees.   Leave him!  Robb’s voice rang with command. Umber stepped back away from the captive.  Lord Karstark spit out a broken tooth.  Yes, Lord Umber, leave me to the king. He means to give me a scolding before he forgives me. That’s how he deals with treason, our King in the North.  He smiled a wet red smile.  or should I call you the King Who Lost the North, Your Grace?   The Greatjon snatched a spear from the man beside him and jerked it to his shoulder.  Let me spit him, sire. Let me open his belly so we can see the color of his guts.   The doors of the hall crashed open, and the Blackfish entered with water running from his cloak and helm. Tully men-at-arms followed him in, while outside lightning cracked across the sky and a hard black rain pounded against the stones of Riverrun. Ser Brynden removed his helm and went to one knee.  Your Grace,  was all he said, but the grimness of his tone spoke volumes.   I will hear Ser Brynden privily, in the audience chamber.  Robb rose to his feet.  Greatjon, keep Lord Karstark here till I return, and hang the other seven.   The Greatjon lowered the spear.  Even the dead ones?    Yes. I will not have such fouling my lord uncle’s rivers. Let them feed the crows.   One of the captives dropped to his knees.  Mercy, sire. I killed no one, I only stood at the door to watch for guards.   Robb considered that a moment.  Did you know what Lord Rickard intended? Did you see the knives drawn? Did you hear the shouts, the screams, the cries for mercy?    Aye, I did, but I took no part. I was only the watcher, I swear it…    Lord Umber,  said Robb,  this one was only the watcher. Hang him last, so he may watch the others die. Mother, Uncle, with me, if you please.  He turned away as the Greatjon’s men closed upon the prisoners and drove them from the hall at spearpoint. Outside the thunder crashed and boomed, so loud it sounded as if the castle were coming down about their ears. Is this the sound of a kingdom falling? Catelyn wondered.  It was dark within the audience chamber, but at least the sound of the thunder was muffled by another thickness of wall. A servant entered with an oil lamp to light the fire, but Robb sent him away and kept the lamp. There were tables and chairs, but only Edmure sat, and he rose again when he realized that the others had remainded standing. Robb took off his crown and placed it on the table before him.  The Blackfish shut the door.  The Karstarks are gone.    All?  Was it anger or despair that thickened Robb’s voice like that? Even Catelyn was not certain.   All the fighting men,  Ser Brynden replied.  A few camp followers and serving men were left with their wounded. We questioned as many as we needed, to be certain of the truth. They started leaving at nightfall, stealing off in ones and twos at first, and then in larger groups. The wounded men and servants were told to keep the campfires lit so no one would know they’d gone, but once the rains began it didn’t matter.    Will they re-form, away from Riverrun?  asked Robb.   No. They’ve scattered, hunting. Lord Karstark has sworn to give the hand of his maiden daughter to any man highborn or low who brings him the head of the Kingslayer.   Gods be good. Catelyn felt ill again.   Near three hundred riders and twice as many mounts, melted away in the night.  Robb rubbed his temples, where the crown had left its mark in the soft skin above his ears.  All the mounted strength of Karhold, lost.   Lost by me. By me, may the gods forgive me. Catelyn did not need to be a soldier to grasp the trap Robb was in. For the moment he held the riverlands, but his kingdom was surrounded by enemies to every side but east, where Lysa sat aloof on her mountaintop. Even the Trident was scarce secure so long as the Lord of the Crossing withheld his allegiance. And now to lose the Karstarks as well…   No word of this must leave Riverrun,  her brother Edmure said.  Lord Tywin would… the Lannisters pay their debts, they are always saying that. Mother have mercy, when he hears.   Sansa. Catelyn’s nails dug into the soft flesh of her palms, so hard did she close her hand.  Robb gave Edmure a look that chilled.  Would you make me a liar as well as a murderer, Uncle?    We need speak no falsehood. Only say nothing. Bury the boys and hold our tongues till the war’s done. Willem was son to Ser Kevan Lannister, and Lord Tywin’s nephew. Tion was Lady Genna’s, and a Frey. We must keep the news from the Twins as well, until…    Until we can bring the murdered dead back to life?  said Brynden Blackfish sharply.  The truth escaped with the Karstarks, Edmure. It is too late for such games.    I owe their fathers truth,  said Robb.  And justice. I owe them that as well.  He gazed at his crown, the dark gleam of bronze, the circle of iron swords."
}