{
  "id": "5187cf6b9464b21413d5151be80d7db96590370d",
  "text": "  \"We all did, remember?\" \"I didn't know leprechaun gold vanishes,\" Ron muttered.  \"I thought I was paying you back.  You shouldn't've given me that Chudley Cannon hat for Christmas.\" \"Forget it, all right?\"  said Harry. Ron speared a roast potato on the end of his fork, glaring at it.  Then he said, \"I hate being poor.\" Harry and Hermione looked at each other.  Neither of them really knew what to say. \"It's rubbish,\" said Ron, still glaring down at his potato.  \"I don't blame Fred and George for trying to make some extra money.  Wish I could.  Wish I had a niffler.\" \"Well, we know what to get you next Christmas,\" said Hermione brightly.  Then, when Ron continued to look gloomy, she said, \"Come on, Ron, it could be worse.  At least your fingers aren't full of pus.\"  Hermione was having a lot of difficulty managing her knife and fork, her fingers were so stiff and swollen.  \"I hate that Skeeter woman!\"  she burst out savagely.  \"I'll get her back for this if it's the last thing I do!\"  Hate mail continued to arrive for Hermione over the following week, and although she followed Hagrid's advice and stopped opening it, several of her ill-wishers sent Howlers, which exploded at the Gryffindor table and shrieked insults at her for the whole Hall to hear.  Even those people who didn't read Witch Weekly knew all about the supposed Harry-Krum-Hermione triangle now.  Harry was getting sick of telling people that Hermione wasn't his girlfriend. \"It'll die down, though,\" he told Hermione, \"if we just ignore it. ... People got bored with that stuff she wrote about me last time \"I want to know how she's listening into private conversations when she's supposed to be banned from the grounds!\"  said Hermione angrily. Hermione hung back in their next Defense Against the Dark Arts lesson to ask Professor Moody something.  The rest of the class was very eager to leave; Moody had given them such a rigorous test of hex-deflection that many of them were nursing small injuries.  Harry had such a bad case of Twitchy Ears, he had to hold his hands clamped over them as he walked away from the class. \"Well, Rita's definitely not using an Invisibility Cloak!\"  Hermione panted five minutes later, catching up with Harry and Ron in the entrance hall and pulling Harrys hand away from one of his wiggling ears so that he could hear her.  \"Moody says he didn't see her anywhere near the judges' table at the second task, or anywhere near the lake!\" \"Hermione, is there any point in telling you to drop this?\"  said Ron. \"No!\" said Hermione stubbornly.  \"I want to know how she heard me talking to Viktor! And how she found out about Hagrids mum!\" \"Maybe she had you bugged,\"  said Harry. \"Bugged?\" said Ron blankly.  \"What. . . put fleas on her or something?\" Harry started explaining about hidden microphones and recording equipment.  Ron was fascinated, but Hermione interrupted them. \"Aren't you two ever going to read Hogwarts, A History^\" \"What's the point?\"  said Ron.  \"You know it by heart, we can just ask you.\" \"All those substitutes for magic Muggles use - electricity, computers, and radar, and all those things - they all go haywire around Hogwarts, there's too much magic in the air.  No, Rita's using magic to eavesdrop, she must be. ... If I could just find out what it is ... ooh, if it's illegal, I'll have her ...\" \"Haven't we got enough to worry about?\"  Ron asked her.  \"Do we have to start a vendetta against Rita Skeeter as well?\" \"I'm not asking you to help!\"  Hermione snapped.  \"I'll do it on my own!\" She marched back up the marble staircase without a backward glance. Harry was quite sure she was going to the library. \"What's the betting she comes back with a box of / Hate Rita Skeeter badges?\" said Ron. Hermione, however, did not ask Harry and Ron to help her pursue vengeance against Rita Skeeter, for which they were both grateful, because their workload was mounting ever higher in the days before the Easter holidays.  Harry frankly marveled at the fact that Hermione could research magical methods of eavesdropping as well as everything else they had to do.  He was working flat-out just to get through all their homework, though he made a point of sending regular food packages up to the cave in the mountain for Sirius; after last summer, Harry had not forgotten what it felt like to be continually hungry.  He enclosed notes to Sirius, telling him that nothing out of the ordinary had happened, and that they were still waiting for an answer from Percy. Hedwig didn't return until the end of the Easter holidays.  Percy's letter was enclosed in a package of Easter eggs that Mrs. Weasley had sent.  Both Harrys and Ron's were the size of dragon eggs and full of homemade toffee.  Hermiones, however, was smaller than a chicken egg.  Her face fell when she saw it. \"Your mum doesn't read Witch Weekly, by any chance, does she, Ron?\"  she asked quietly. \"Yeah,\" said Ron, whose mouth was full of toffee. \"Gets it for the recipes.\" Hermione looked sadly at her tiny egg."
}