{
  "id": "533cd29fcb94ac0105e4cc15419569d24a222e6d",
  "text": "  He's not going to do it nice and polite to your face.  You need to be prepared.  You need to be alert and watchful.  You need to put that away, Miss Brown, when I'm talking.\" Lavender jumped and blushed.  She had been showing Parvati her completed horoscope under the desk.  Apparently Moody's magical eye could see through solid wood, as well as out of the back of his head. \"So. . . do any of you know which curses are most heavily punished by wizarding law?\" Several hands rose tentatively into the air, including Ron's and Hermione's.  Moody pointed at Ron, though his magical eye was still fixed on Lavender. \"Er,\" said Ron tentatively, \"my dad told me about one.. . . Is it called the Imperius Curse, or something?\" \"Ah, yes,\" said Moody appreciatively. \"Your father would know that one.  Gave the Ministry a lot of trouble at one time, the Imperius Curse.\" Moody got heavily to his mismatched feet, opened his desk drawer, and took out a glass jar. Three large black spiders were scuttling around inside it. Harry felt Ron recoil slightly next to him - Ron hated spiders. Moody reached into the jar, caught one of the spiders, and held it in the palm of his hand so that they could all see it. He then pointed his wand at it and muttered, \"Imperio!\" The spider leapt from Moody's hand on a fine thread of silk and began to swing backward and forward as though on a trapeze. It stretched out its legs rigidly, then did a back flip, breaking the thread and landing on the desk, where it began to cartwheel in circles.  Moody jerked his wand, and the spider rose onto two of its hind legs and went into what was unmistakably a tap dance. Everyone was laughing - everyone except Moody. \"Think it's funny, do you?\" he growled.  \"You'd like it, would you, if I did it to you?\" The laughter died away almost instantly. \"Total control,\" said Moody quietly as the spider balled itself up and began to roll over and over.  \"I could make it jump out of the window, drown itself, throw itself down one of your throats. . .\" Ron gave an involuntary shudder. \"Years back, there were a lot of witches and wizards being controlled by the Imperius Curse,\" said Moody, and Harry knew he was talking about the days in which Voldemort had been all-powerful.  \"Some job for the Ministry, trying to sort out who was being forced to act, and who was acting of their own free will. \"The Imperius Curse can be fought, and I'll be teaching you how, but it takes real strength of character, and not everyone's got it.  Better avoid being hit with it if you can. CONSTANT VIGILANCE!\"  he barked, and everyone jumped. Moody picked up the somersaulting spider and threw it back into the jar. \"Anyone else know one?  Another illegal curse?\" Hermione's hand flew into the air again and so, to Harry's slight surprise, did Neville's. The only class in which Neville usually volunteered information was Herbology which was easily his best subject.  Neville looked surprised at his own daring.  \"Yes?\" said Moody, his magical eye rolling right over to fix on Neville. \"There's one - the Cruciatus Curse,\" said Neville in a small but distinct voice. Moody was looking very intently at Neville, this time with both eyes. \"Your name's Longbottom?\"  he said, his magical eye swooping down to check the register again. Neville nodded nervously, but Moody made no further inquiries.  Turning back to the class at large, he reached into the jar for the next spider and placed it upon the desktop, where it remained motionless, apparently too scared to move. \"The Cruciatus Curse,\" said Moody.  \"Needs to be a bit bigger for you to get the idea,\" he said, pointing his wand at the spider.  \"Engorgio!\" The spider swelled. It was now larger than a tarantula.  Abandoning all pretense, Ron pushed his chair backward, as far away from Moody's desk as possible. Moody raised his wand again, pointed it at the spider, and muttered, \"Crucio!\" At once, the spider's legs bent in upon its body; it rolled over and began to twitch horribly, rocking from side to side.  No sound came from it, but Harry was sure that if it could have given voice, it would have been screaming.  Moody did not remove his wand, and the spider started to shudder and jerk more violently - \"Stop it!\" Hermione said shrilly.\" Harry looked around at her.  She was looking, not at the spider, but at Neville, and Harry, following her gaze, saw that Neville's hands were clenched upon the desk in front of him, his knuckles white, his eyes wide and horrified. Moody raised his wand. The spider's legs relaxed, but it continued to twitch. \"Reducio,\" Moody muttered, and the spider shrank back to its proper size.  He put it back into the jar. \"Pain,\" said Moody softly.  \"You don't need thumbscrews or knives to torture someone if you can perform the Cruciatus Curse. . . . That one was very popular once too. \"Right. . . anyone know any others?\" Harry looked around.  From the looks on everyone's faces, he guessed they were all wondering what was going to happen to the last spider."
}