{
  "id": "54c59446cd1f6327af466b09da1bc695bc9f02a4",
  "text": "  It is the bad blood that makes you angry, and the rage that brings on the shaking. Come now.   They led the boy away. My lord husband, Sansa thought, as she contemplated the ruins of Winterfell. The snow had stopped, and it was colder than before. She wondered if Lord Robert would shake all through their wedding. At least Joffrey was sound of body. A mad rage seized hold of her. She picked up a broken branch and smashed the torn doll’s head down on top of it, then pushed it down atop the shattered gatehouse of her snow castle. The servants looked aghast, but when Littlefinger saw what she’d done he laughed.  If the tales be true, that’s not the first giant to end up with his head on Winterfell’s walls.    Those are only stories,  she said, and left him there.  Back in her bedchamber, Sansa took off her cloak and her wet boots and sat beside the fire. She had no doubt that she would be made to answer for Lord Robert’s fit. Perhaps Lady Lysa will send me away. Her aunt was quick to banish anyone who displeased her, and nothing displeased her quite so much as people she suspected of mistreating her son.  Sansa would have welcomed banishment. The Gates of the Moon was much larger than the Eyrie, and livelier as well. Lord Nestor Royce seemed gruff and stern, but his daughter Myranda kept his castle for him, and everyone said how frolicsome she was. Even Sansa’s supposed bastardy might not count too much against her below. One of King Robert’s baseborn daughters was in service to Lord Nestor, and she and the Lady Myranda were said to be fast friends, as close as sisters.  I will tell my aunt that I don’t want to marry Robert. Not even the High Septon himself could declare a woman married if she refused to say the vows. She wasn’t a beggar, no matter what her aunt said. She was thirteen, a woman flowered and wed, the heir to Winterfell. Sansa felt sorry for her little cousin sometimes, but she could not imagine ever wanting to be his wife. I would sooner be married to Tyrion again. If Lady Lysa knew that, surely she’d send her away… away from Robert’s pouts and shakes and runny eyes, away from Marillion’s lingering looks, away from Petyr’s kisses. I will tell her. I will!  It was late that afternoon when Lady Lysa summoned her. Sansa had been marshaling her courage all day, but no sooner did Marillion appear at her door than all her doubts returned.  Lady Lysa requires your presence in the High Hall.  The singer’s eyes undressed her as he spoke, but she was used to that.  Marillion was comely, there was no denying it; boyish and slender, with smooth skin, sandy hair, a charming smile. But he had made himself well hated in the Vale, by everyone but her aunt and little Lord Robert. To hear the servants talk, Sansa was not the first maid to suffer his advances, and the others had not had Lothor Brune to defend them. But Lady Lysa would hear no complaints against him. Since coming to the Eyrie, the singer had become her favorite. He sang Lord Robert to sleep every night, and tweaked the noses of Lady Lysa’s suitors with verses that made mock of their foibles. Her aunt had showered him with gold and gifts; costly clothes, a gold arm ring, a belt studded with moonstones, a fine horse. She had even given him her late husband’s favorite falcon. It all served to make Marillion unfailingly courteous in Lady Lysa’s presence, and unfailingly arrogant outside it.   Thank you,  Sansa told him stiffly.  I know the way.   He would not leave.  My lady said to bring you.   Bring me? She did not like the sound of that.  Are you a guardsman now?  Littlefinger had dismissed the Eyrie’s captain of guards and put Ser Lothor Brune in his place.   Do you require guarding?  Marillion said lightly.  I am composing a new song, you should know. A song so sweet and sad it will melt even your frozen heart. ‘The Roadside Rose,’ I mean to call it. About a baseborn girl so beautiful she bewitched every man who laid eyes upon her.   I am a Stark of Winterfell, she longed to tell him. Instead she nodded, and let him escort her down the tower steps and along a bridge. The High Hall had been closed as long as she’d been at the Eyrie. Sansa wondered why her aunt had opened it. Normally she preferred the comfort of her solar, or the cozy warmth of Lord Arryn’s audience chamber with its view of the waterfall.  Two guards in sky-blue cloaks flanked the carved wooden doors of the High Hall, spears in hand.  No one is to enter so long as Alayne is with Lady Lysa,  Marillion told them.   Aye.  The men let them pass, then crossed their spears. Marillion swung the doors shut and barred them with a third spear, longer and thicker than those the guards had borne.  Sansa felt a prickle of unease.  Why did you do that?    My lady awaits you.   She looked about uncertainly. Lady Lysa sat on the dais in a highbacked chair of carved weirwood, alone. To her right was a second chair, taller than her own, with a stack of blue cushions piled on the seat, but Lord Robert was not in it."
}