{
  "id": "55ea5c854422d95304e3321e338c7fc481161e4c",
  "text": " His men followed.  The four of the Night’s Watch remained. Robb turned to them uncertainly.  I have had rooms prepared, and you’ll find no lack of hot water to wash off the dust of the road. I hope you will honor us at table tonight.  He spoke the words so awkwardly that even Bran took note; it was a speech he had learned, not words from the heart, but the black brothers thanked him all the same.  Summer followed them up the tower steps as Hodor carried Bran back to his bed. Old Nan was asleep in her chair. Hodor said  Hodor,  gathered up his great-grandmother, and carried her off, snoring softly, while Bran lay thinking. Robb had promised that he could feast with the Night’s Watch in the Great Hall.  Summer,  he called. The wolf bounded up on the bed. Bran hugged him so hard he could feel the hot breath on his cheek.  I can ride now,  he whispered to his friend.  We can go hunting in the woods soon, wait and see.  After a time he slept.  In his dream he was climbing again, pulling himself up an ancient windowless tower, his fingers forcing themselves between blackened stones, his feet scrabbling for purchase. Higher and higher he climbed, through the clouds and into the night sky, and still the tower rose before him. When he paused to look down, his head swam dizzily and he felt his fingers slipping. Bran cried out and clung for dear life. The earth was a thousand miles beneath him and he could not fly. He could not fly. He waited until his heart had stopped pounding, until he could breathe, and he began to climb again. There was no way to go but up. Far above him, outlined against a vast pale moon, he thought he could see the shapes of gargoyles. His arms were sore and aching, but he dared not rest. He forced himself to climb faster. The gargoyles watched him ascend. Their eyes glowed red as hot coals in a brazier. Perhaps once they had been lions, but now they were twisted and grotesque. Bran could hear them whispering to each other in soft stone voices terrible to hear. He must not listen, he told himself, he must not hear, so long as he did not hear them he was safe. But when the gargoyles pulled themselves loose from the stone and padded down the side of the tower to where Bran clung, he knew he was not safe after all.  I didn’t hear,  he wept as they came closer and closer,  I didn’t, I didn’t.   He woke gasping, lost in darkness, and saw a vast shadow looming over him.  I didn’t hear,  he whispered, trembling in fear, but then the shadow said  Hodor,  and lit the candle by the bedside, and Bran sighed with relief.  Hodor washed the sweat from him with a warm, damp cloth and dressed him with deft and gentle hands. When it was time, he carried him down to the Great Hall, where a long trestle table had been set up near the fire. The lord’s seat at the head of the table had been left empty, but Robb sat to the right of it, with Bran across from him. They ate suckling pig that night, and pigeon pie, and turnips soaking in butter, and afterward the cook had promised honeycombs. Summer snatched table scraps from Bran’s hand, while Grey Wind and Shaggydog fought over a bone in the corner. Winterfell’s dogs would not come near the hall now. Bran had found that strange at first, but he was growing used to it.  Yoren was senior among the black brothers, so the steward had seated him between Robb and Maester Luwin. The old man had a sour smell, as if he had not washed in a long time. He ripped at the meat with his teeth, cracked the ribs to suck out the marrow from the bones, and shrugged at the mention of Jon Snow.  Ser Alliser’s bane,  he grunted, and two of his companions shared a laugh that Bran did not understand. But when Robb asked for news of their uncle Benjen, the black brothers grew ominously quiet.   What is it?  Bran asked.  Yoren wiped his fingers on his vest.  There’s hard news, m’lords, and a cruel way to pay you for your meat and mead, but the man as asks the question must bear the answer. Stark’s gone.   One of the other men said,  The Old Bear sent him out to look for Waymar Royce, and he’s late returning, my lord.    Too long,  Yoren said.  Most like he’s dead.    My uncle is not dead,  Robb Stark said loudly, anger in his tones. He rose from the bench and laid his hand on the hilt of his sword.  Do you hear me? My uncle is not dead!  His voice rang against the stone walls, and Bran was suddenly afraid.  Old sour-smelling Yoren looked up at Robb, unimpressed.  Whatever you say, m’lord,  he said. He sucked at a piece of meat between his teeth.  The youngest of the black brothers shifted uncomfortably in his seat.  There’s not a man on the Wall knows the haunted forest better than Benjen Stark. He’ll find his way back.    Well,  said Yoren,  maybe he will and maybe he won’t. Good men have gone into those woods before, and never come out.   All Bran could think of was Old Nan’s story of the Others and the last hero, hounded through the white woods by dead men and spiders big as hounds. He was afraid for a moment, until he remembered how that story ended."
}