{
  "id": "569e50f5530a54e320d06edc54962b1d4da42d7a",
  "text": "       `What in truth  this Thing is I cannot yet guess; but some heirloom  of  power and peril it must be.  A  fell weapon, perchance, devised by  the Dark   Lord. If it were  a thing that gave advantage in battle. I can  well believe  that  Boromir,  the  proud  and fearless,  often rash, ever anxious for  the  victory of  Minas  Tirith (and  his own glory therein), might desire  such a   thing and be allured by  it. Alas that ever he went on that errand! I should  have been chosen by my  father and the elders but he put himself forward. as  being the older and the hardier (both true), and he would not be stayed.       'But  fear no more!  I would not take  this  thing,  if it  lay by  the  highway. Not were Minas Tirith  falling in ruin and  I alone could save her,  so, using the  weapon of the Dark Lord for her  good and my glory.  No. I do  not wish for such triumphs, Frodo son of Drogo.'       'Neither did the Council,' said Frodo. 'Nor do  I. I would have nothing  to do with such matters.'       `For myself,' said Faramir, 'I would see the White Tree in flower again  in the courts of the kings, and the Silver Crown return, and Minas Tirith in  peace:  Minas  Anor again as of old, full of light, high and fair, beautiful  as a queen among other queens: not a mistress of many  slaves, nay, not even  a kind mistress of willing slaves.  War  must  be, while we defend our lives  against a destroyer who would devour all; but I do not love the bright sword   ####-for its sharpness, nor the arrow for  its swiftness, nor the warrior for his  glory. I love only that which they defend: the city of the Men  of  N®menor;   and I would have  her loved for her memory,  her ancientry, her  beauty, and   her present wisdom. Not feared, save  as men may fear the  dignity of a man,  old and wise.       'So  fear me not! I do not ask you to tell me  more.  I do not even ask   you to tell me  whether I now speak nearer the  mark. But if you  will trust   me,  it may  be that I can advise  you in your present  quest, whatever that  be-yes, and even aid you.'       Frodo made no  answer. Almost he  yielded to  the  desire for  help and  counsel, to tell this grave young man, whose words  seemed so wise and fair,  all that was in his mind. But something  held him back. His heart  was heavy   with fear and sorrow: if he and Sam  were indeed, as seemed likely, all that  was now left of the Nine Walkers, then he was  in sole command of the secret  of their errand. Better mistrust undeserved  than rash words. And the memory  of Bor omir, of the dreadful change that the  lure of the Ring had  worked in  him, was very present to his mind, when he looked at Faramir and listened to  his voice: unlike they were, and yet also much akin.       They walked on in  silence for a  while,  passing  like grey and  green  shadows under  the old trees,  their feet  making no  sound; above them many  birds sang, and the sun glistened on the polished roof of dark leaves in the  evergreen woods of Ithilien.       Sam had taken no part in  the conversation, though he had listened; and  at the same time he had attended with his keen hobbit ears to  all  the soft   woodland noises about them. One thing he had noted, that in all the talk the  name of Gollum had not once come up. He was glad, though he felt that it was  too much to hope that he would never  hear  it again. He soon  became  aware  also that though they  walked alone, there  were many men close at hand: not  only Damrod and Mablung flitting in and out of the shadows ahead, but others  on either side, all making their swift secret way to some appointed place.       Once,  looking suddenly back,  as if some prickle of the skin told  him  that he  was watched from behind, he  thought he caught a brief glimpse of a   small dark shape slipping behind a  tree-trunk. He opened his mouth to speak  and shut it again. `I'm not sure of it,' he said to himself, 'and why should  I remind them of the old villain, if  they choose to  forget  him? I wish  I  could!'       So they passed on,  until the woodlands grew thinner and the land began   ####-to fall more steeply.  Then they turned aside again, to the right,  and came  quickly  to a  small river in a narrow  gorge:  it was the  same stream that  trickled  far  above out of  the round pool, now grown  to  a swift torrent,  leaping down over many stones in a deep-cloven bed,  overhung  with ilex and  dark box-woods. Looking west they could see,  below them in a haze of light,  lowlands and broad meads, and glinting far off in the westering sun the wide   waters of the Anduin.       'Here, alas! I must do you  a discourtesy,' said  Faramir.  \"I hope you   will pardon it to one who has so far made his orders give way to courtesy as  not  to  slay you or to bind  you. But it is a command that no stranger, not  even one of Rohan that fights  with  us, sha ll  see the path we now  go with  open eyes. I must blindfold you.'       `As you will,' said  Frodo."
}