{
  "id": "57c7940620c2d3ad91373221882e1cde9b046810",
  "text": "   Will could feel it. Four years in the Night’s Watch, and he had never been so afraid. What was it?   Wind. Trees rustling. A wolf. Which sound is it that unmans you so, Gared?  When Gared did not answer, Royce slid gracefully from his saddle. He tied the destrier securely to a low-hanging limb, well away from the other horses, and drew his longsword from its sheath. Jewels glittered in its hilt, and the moonlight ran down the shining steel. It was a splendid weapon, castle-forged, and new-made from the look of it. Will doubted it had ever been swung in anger.   The trees press close here,  Will warned.  That sword will tangle you up, m’lord. Better a knife.    If I need instruction, I will ask for it,  the young lord said.  Gared, stay here. Guard the horses.   Gared dismounted.  We need a fire. I’ll see to it.    How big a fool are you, old man? If there are enemies in this wood, a fire is the last thing we want.    There’s some enemies a fire will keep away,  Gared said.  Bears and direwolves and… and other things…   Ser Waymar’s mouth became a hard line.  No fire.   Gared’s hood shadowed his face, but Will could see the hard glitter in his eyes as he stared at the knight. For a moment he was afraid the older man would go for his sword. It was a short, ugly thing, its grip discolored by sweat, its edge nicked from hard use, but Will would not have given an iron bob for the lordling’s life if Gared pulled it from its scabbard.  Finally Gared looked down.  No fire,  he muttered, low under his breath.  Royce took it for acquiescence and turned away.  Lead on,  he said to Will.  Will threaded their way through a thicket, then started up the slope to the low ridge where he had found his vantage point under a sentinel tree. Under the thin crust of snow, the ground was damp and muddy, slick footing, with rocks and hidden roots to trip you up. Will made no sound as he climbed. Behind him, he heard the soft metallic slither of the lordling’s ringmail, the rustle of leaves, and muttered curses as reaching branches grabbed at his longsword and tugged on his splendid sable cloak.  The great sentinel was right there at the top of the ridge, where Will had known it would be, its lowest branches a bare foot off the ground. Will slid in underneath, flat on his belly in the snow and the mud, and looked down on the empty clearing below.  His heart stopped in his chest. For a moment he dared not breathe. Moonlight shone down on the clearing, the ashes of the firepit, the snow-covered lean-to, the great rock, the little half-frozen stream. Everything was just as it had been a few hours ago.  They were gone. All the bodies were gone.   Gods!  he heard behind him. A sword slashed at a branch as Ser Waymar Royce gained the ridge. He stood there beside the sentinel, longsword in hand, his cloak billowing behind him as the wind came up, outlined nobly against the stars for all to see.   Get down!  Will whispered urgently.  Something’s wrong.   Royce did not move. He looked down at the empty clearing and laughed.  Your dead men seem to have moved camp, Will.   Will’s voice abandoned him. He groped for words that did not come. It was not possible. His eyes swept back and forth over the abandoned campsite, stopped on the axe. A huge double-bladed battle-axe, still lying where he had seen it last, untouched. A valuable weapon…   On your feet, Will,  Ser Waymar commanded.  There’s no one here. I won’t have you hiding under a bush.   Reluctantly, Will obeyed.  Ser Waymar looked him over with open disapproval.  I am not going back to Castle Black a failure on my first ranging. We will find these men.  He glanced around.  Up the tree. Be quick about it. Look for a fire.   Will turned away, wordless. There was no use to argue. The wind was moving. It cut right through him. He went to the tree, a vaulting grey-green sentinel, and began to climb. Soon his hands were sticky with sap, and he was lost among the needles. Fear filled his gut like a meal he could not digest. He whispered a prayer to the nameless gods of the wood, and slipped his dirk free of its sheath. He put it between his teeth to keep both hands free for climbing. The taste of cold iron in his mouth gave him comfort.  Down below, the lordling called out suddenly,  Who goes there?  Will heard uncertainty in the challenge. He stopped climbing; he listened; he watched.  The woods gave answer: the rustle of leaves, the icy rush of the stream, a distant hoot of a snow owl.  The Others made no sound.  Will saw movement from the corner of his eye. Pale shapes gliding through the wood. He turned his head, glimpsed a white shadow in the darkness. Then it was gone. Branches stirred gently in the wind, scratching at one another with wooden fingers. Will opened his mouth to call down a warning, and the words seemed to freeze in his throat. Perhaps he was wrong. Perhaps it had only been a bird, a reflection on the snow, some trick of the moonlight. What had he seen, after all?   Will, where are you?  Ser Waymar called up."
}