{
  "id": "58727bf4cc5fd2f93f4e61efa1101d305bc28629",
  "text": " Farlen was as likely a suspect as any, so Theon sat in judgment, called him guilty, and condemned him to death. Even that went sour. As he knelt to the block, the kennelmaster said,  M’lord Eddard always did his own killings.  Theon had to take the axe himself or look a weakling. His hands were sweating, so the shaft twisted in his grip as he swung and the first blow landed between Farlen’s shoulders. It took three more cuts to hack through all that bone and muscle and sever the head from the body, and afterward he was sick, remembering all the times they’d sat over a cup of mead talking of hounds and hunting. I had no choice, he wanted to scream at the corpse. The ironborn can’t keep secrets, they had to die, and someone had to take the blame for it. He only wished he had killed him cleaner. Ned Stark had never needed more than a single blow to take a man’s head.  The killings stopped after Farlen’s death, but even so his men continued sullen and anxious.  They fear no foe in open battle,  Black Lorren told him,  but it is another thing to dwell among enemies, never knowing if the washerwoman means to kiss you or kill you, or whether the serving boy is filling your cup with ale or bale. We would do well to leave this place.    I am the Prince of Winterfell!  Theon had shouted.  This is my seat, no man will drive me from it. No, nor woman either!   Asha. It was her doing. My own sweet sister, may the Others bugger her with a sword. She wanted him dead, so she could steal his place as their father’s heir. That was why she had let him languish here, ignoring the urgent commands he had sent her.  He found her in the high seat of the Starks, ripping a capon apart with her fingers. The hall rang with the voices of her men, sharing stories with Theon’s own as they drank together. They were so loud that his entrance went all but unnoticed.  Where are the rest?  he demanded of Reek. There were no more than fifty men at the trestle tables, most of them his. Winterfell’s Great Hall could have seated ten times the number.   This is the whole o’ the company, m’lord prince.    The whole—how many men did she bring?    Twenty, by my count.   Theon Greyjoy strode to where his sister was sprawled. Asha was laughing at something one of her men had said, but broke off at his approach.  Why, ’tis the Prince of Winterfell.  She tossed a bone to one of the dogs sniffing about the hall. Under that hawk’s beak of a nose, her wide mouth twisted in a mocking grin.  Or is it Prince of Fools?    Envy ill becomes a maid.   Asha sucked grease from her fingers. A lock of black hair fell across her eyes. Her men were shouting for bread and bacon. They made a deal of noise, as few as they were.  Envy, Theon?    What else would you call it? With thirty men, I captured Winterfell in a night. You needed a thousand and a moon’s turn to take Deepwood Motte.    Well, I’m no great warrior like you, brother,  She quaffed half a horn of ale and wiped her mouth with the back of her hand.  I saw the heads above your gates. Tell me true, which one gave you the fiercest fight, the cripple or the babe?   Theon could feel the blood rushing to his face. He took no joy from those heads, no more than he had in displaying the headless bodies of the children before the castle. Old Nan stood with her soft toothless mouth opening and closing soundlessly, and Farlen threw himself at Theon, snarling like one of his hounds. Urzen and Cadwyl had to beat him senseless with the butts of their spears. How did I come to this? he remembered thinking as he stood over the fly-speckled bodies.  Only Maester Luwin had the stomach to come near. Stone-faced, the small grey man had begged leave to sew the boys’ heads back onto their shoulders, so they might be laid in the crypts below with the other Stark dead.   No,  Theon had told him.  Not the crypts.    But why, my lord? Surely they cannot harm you now. It is where they belong. All the bones of the Starks—    I said no.  He needed the heads for the wall, but he had burned the headless bodies that very day, in all their finery. Afterward he had knelt amongst the bones and ashes to retrieve a slag of melted silver and cracked jet, all that remained of the wolf’s-head brooch that had once been Bran’s. He had it still.   I treated Bran and Rickon generously,  he told his sister.  They brought their fate on themselves.    As do we all, little brother.   His patience was at an end.  How do you expect me to hold Winterfell if you bring me only twenty men?    Ten,  Asha corrected.  The others return with me. You wouldn’t want your own sweet sister to brave the dangers of the wood without an escort, would you? There are direwolves prowling the dark.  She uncoiled from the great stone seat and rose to her feet.  Come, let us go somewhere we can speak more privily.   She was right, he knew, though it galled him that she would make that decision. I should never have come to the hall, he realized belatedly. I should have summoned her to me."
}