{
  "id": "5910a20910064f47d4bddb18d60a105b197c2fac",
  "text": " But perhaps I can give you some small measure of justice, in the name of our king, Robert.   Every eye in the hall was fixed on him, waiting. Slowly Ned struggled to his feet, pushing himself up from the throne with the strength of his arms, his shattered leg screaming inside its cast. He did his best to ignore the pain; it was no moment to let them see his weakness.  The First Men believed that the judge who called for death should wield the sword, and in the north we hold to that still. I mislike sending another to do my killing… yet it seems I have no choice.  He gestured at his broken leg.   Lord Eddard!  The shout came from the west side of the hall as a handsome stripling of a boy strode forth boldly. Out of his armor, Ser Loras Tyrell looked even younger than his sixteen years. He wore pale blue silk, his belt a linked chain of golden roses, the sigil of his House.  I beg you the honor of acting in your place. Give this task to me, my lord, and I swear I shall not fail you.   Littlefinger chuckled.  Ser Loras, if we send you off alone, Ser Gregor will send us back your head with a plum stuffed in that pretty mouth of yours. The Mountain is not the sort to bend his neck to any man’s justice.    I do not fear Gregor Clegane,  Ser Loras said haughtily.  Ned eased himself slowly back onto the hard iron seat of Aegon’s misshapen throne. His eyes searched the faces along the wall.  Lord Beric,  he called out.  Thoros of Myr. Ser Gladden. Lord Lothar.  The men named stepped forward one by one.  Each of you is to assemble twenty men, to bring my word to Gregor’s keep. Twenty of my own guards shall go with you. Lord Beric Dondarrion, you shall have the command, as befits your rank.   The young lord with the red-gold hair bowed.  As you command, Lord Eddard.   Ned raised his voice, so it carried to the far end of the throne room.  In the name of Robert of the House Baratheon, the First of his Name, King of the Andals and the Rhoynar and the First Men, Lord of the Seven Kingdoms and Protector of the Realm, by the word of Eddard of the House Stark, his Hand, I charge you to ride to the westlands with all haste, to cross the Red Fork of the Trident under the king’s flag, and there bring the king’s justice to the false knight Gregor Clegane, and to all those who shared in his crimes. I denounce him, and attaint him, and strip him of all rank and titles, of all lands and incomes and holdings, and do sentence him to death. May the gods take pity on his soul.   When the echo of his words had died away, the Knight of Flowers seemed perplexed.  Lord Eddard, what of me?   Ned looked down on him. From on high, Loras Tyrell seemed almost as young as Robb.  No one doubts your valor, Ser Loras, but we are about justice here, and what you seek is vengeance.  He looked back to Lord Beric.  Ride at first light. These things are best done quickly.  He held up a hand.  The throne will hear no more petitions today.   Alyn and Porther climbed the steep iron steps to help him back down. As they made their descent, he could feel Loras Tyrell’s sullen stare, but the boy had stalked away before Ned reached the floor of the throne room.  At the base of the Iron Throne, Varys was gathering papers from the council table. Littlefinger and Grand Maester Pycelle had already taken their leave.  You are a bolder man than I, my lord,  the eunuch said softly.   How so, Lord Varys?  Ned asked brusquely. His leg was throbbing, and he was in no mood for word games.   Had it been me up there, I should have sent Ser Loras. He so wanted to go… and a man who has the Lannisters for his enemies would do well to make the Tyrells his friends.    Ser Loras is young,  said Ned.  I daresay he will outgrow the disappointment.    And Ser Ilyn?  The eunuch stroked a plump, powdered cheek.  He is the King’s Justice, after all. Sending other men to do his office… some might construe that as a grave insult.    No slight was intended.  In truth, Ned did not trust the mute knight, though perhaps that was only because he misliked executioners.  I remind you, the Paynes are bannermen to House Lannister. I thought it best to choose men who owed Lord Tywin no fealty.    Very prudent, no doubt,  Varys said.  Still, I chanced to see Ser Ilyn in the back of the hall, staring at us with those pale eyes of his, and I must say, he did not look pleased, though to be sure it is hard to tell with our silent knight. I hope he outgrows his disappointment as well. He does so love his work…       SANSA   He wouldn’t send Ser Loras,  Sansa told Jeyne Poole that night as they shared a cold supper by lamplight.  I think it was because of his leg.   Lord Eddard had taken his supper in his bedchamber with Alyn, Harwin, and Vayon Poole, the better to rest his broken leg, and Septa Mordane had complained of sore feet after standing in the gallery all day. Arya was supposed to join them, but she was late coming back from her dancing lesson.   His leg?  Jeyne said uncertainly. She was a pretty, dark-haired girl of Sansa’s own age."
}