{
  "id": "593abeabbeb56ac73b66803f93ae653d1b9798da",
  "text": " The road may pass,  but  they  shall  not! Not  while Faramir  is Captain.  He  leads now in all  perilous  ventures.  But his life is charmed, or fate  spares him  for  some  other end.'       Their talk  died down into a listening silence.  All  seemed  still and  watchful. Sam, crouched by the edge of the fern-brake, peered  out. With his   ####-keen hobbit-eyes  he  saw that many  more Men were about. He  could see  them  stealing up the slopes, singly or in long files, keeping always to the shade  of  grove or thicket, or crawling, hardly visible  in their brown and  green  raiment, through  grass and  brake. All were  hooded  and  masked,  and  had  gauntlets on  their hands, and  were  armed like Faramir and his companions.  Before  long they had  all passed and  vanished. The sun rose till it neared  the South. The shadows shrank.       `I wonder where that dratted Gollum is?  '  thought Sam, as  he crawled  back into deeper shade. `He  stands  a fair chance of being spitted  for  an  Orc,  or of being roasted  by the Yellow Face. But I  fancy he'll look after   himself.' He lay down beside Frodo and began to doze.       He woke,  thinking that he had heard horns blowing. He sat up.  It  was  now high noon.  The guards stood alert and tense in the shadow of the trees.   Suddenly the horns rang out louder and beyond  mistake from  above, over the  top  of  the slope. Sam thought that he heard cries and wild  shouting also,  but  the sound was faint,  as  if  it came out  of some  distant  cave. Then  presently the noise of  fighting broke  out  near at hand, just  above their  hiding-place. He could hear plainly the ringing grate of steel on steel, the  clang  of sword on iron  cap, the  dull beat of blade on  shield;  men  were  yelling and screaming, and one clear loud voice was calling Gondor! Gondor!       `It sounds like a hundred blacksmiths all smithying together,' said Sam  to Frodo. 'They're as near as I want them now.'       But the noise grew closer. `They are  coming!' cried Damrod. `See! Some  of  the Southrons have broken  from the trap  and are flying  from the road.  There they go! Our men after them, and the Captain leading.'       Sam,  eager to see more, went now and joined the guards. He scrambled a  little  way  up into one of  the  larger of the bay-trees. For  a  moment he  caught a glimpse of swarthy men in red running  down the slope  some way off  with green-clad warriors leaping after them, hewing them down  as they fled.  Arrows  were thick in the air. Then suddenly straight over  the rim of their  sheltering bank, a man fell, crashing through  the slender trees,  nearly on  top of them. He came to  rest in the  fern a  few feet away,  face downward,  green arrow-feathers  sticking from  his neck  below  a  golden collar.  His  scarlet robes  were tattered, his  corslet of overlapping brazen  plates was  rent and hewn, his black plaits of hair braided with gold were drenched with  blood. His brown hand still clutched the hilt of a broken sword.   ####-     It was Sam's  first view of a battle of Men against Men, and he did not  like it much. He was  glad that he could not see the dead  face. He wondered  what the man's name was and where he came from; and if he was really evil of  heart, or what lies or threats had  led him on the long march from his home;  and if  he would not really rather have stayed there in peace-all in a flash  of  thought which  was  quickly driven  from his mind. For  just as  Mablung  stepped towards the  fallen  body, there was a  new noise.  Great crying and  shouting. Amidst it Sam heard a shrill bellowing or trumpeting.  And  then a   great thudding and bumping. like huge rams dinning on the ground.       'Ware! Ware!' cried Damrod  to his  companion. 'May the Valar turn  him  aside! Mymak! Mymak!'       To his  astonishment and terror,  and lasting delight,  Sam  saw a vast   shape crash out of  the trees  and come careering down the  slope. Big as  a   house, much bigger than a house, it looked to him, a grey-clad moving  hill.   Fear and wonder, maybe, enlarged him in the hobbit's eyes, but the  Mymak of  Harad was indeed a beast of vast bulk, and the like of him does not walk now  in Middle-earth; his kin that  live still in latter days are but memories of  his girth and majesty. On  he came, straight towards  the watchers, and then  swerved  aside in the nick of time,  passing only  a few yards away, rocking   the ground beneath their feet: his great legs like trees, enormous sail-like  ears  spread out, long  snout upraised like a huge serpent  about to strike.  his small red eyes raging. His upturned hornlike tusks were bound with bands  of  gold and dripped with blood. His trappings of  scarlet and  gold flapped  about him in wild tatters. The  ruins  of  what seemed a very war -tower  lay  upon his heaving back, smashed in his furious passage thr ough the woods; and  high upon  his  neck still desperately clung a  tiny  figure-the  body  of a   mighty warrior, a giant among the Swertings."
}