{
  "id": "597dbbc6961db140064524afe066798a5e255147",
  "text": " So come with me and kill the son of a bitch!  Tyrion unsheathed his axe, wheeled the stallion around, and trotted toward the sally port. He thought they were following, but never dared to look.      SANSA  The torches shimmered brightly against the hammered metal of the wall sconces, filling the Queen’s Ballroom with silvery light. Yet there was still darkness in that hall. Sansa could see it in the pale eyes of Ser Ilyn Payne, who stood by the back door still as stone, taking neither food nor wine. She could hear it in Lord Gyles’s racking cough, and the whispered voice of Osney Kettleblack when he slipped in to bring Cersei the tidings.  Sansa was finishing her broth when he came the first time, entering through the back. She glimpsed him talking to his brother Osfryd. Then he climbed the dais and knelt beside the high seat, smelling of horse, four long thin scratches on his cheek crusted with scabs, his hair falling down past his collar and into his eyes. For all his whispering, Sansa could not help but hear.  The fleets are locked in battle. Some archers got ashore, but the Hound’s cut them to pieces, Y’Grace. Your brother’s raising his chain, I heard the signal. Some drunkards down to Flea Bottom are smashing doors and climbing through windows. Lord Bywater’s sent the gold cloaks to deal with them. Baelor’s Sept is jammed full, everyone praying.    And my son?    The king went to Baelor’s to get the High Septon’s blessing. Now he’s walking the walls with the Hand, telling the men to be brave, lifting their spirits as it were.   Cersei beckoned to her page for another cup of wine, a golden vintage from the Arbor, fruity and rich. The queen was drinking heavily, but the wine only seemed to make her more beautiful; her cheeks were flushed, and her eyes had a bright, feverish heat to them as she looked down over the hall. Eyes of wildfire, Sansa thought.  Musicians played. Jugglers juggled. Moon Boy lurched about the hall on stilts making mock of everyone, while Ser Dontos chased serving girls on his broomstick horse. The guests laughed, but it was a joyless laughter, the sort of laughter that can turn into sobbing in half a heartbeat. Their bodies are here, but their thoughts are on the city walls, and their hearts as well.  After the broth came a salad of apples, nuts, and raisins. At any other time, it might have made a tasty dish, but tonight all the food was flavored with fear. Sansa was not the only one in the hall without an appetite. Lord Gyles was coughing more than he was eating, Lollys Stokeworth sat hunched and shivering, and the young bride of one of Ser Lancel’s knights began to weep uncontrollably. The queen commanded Maester Frenken to put her to bed with a cup of dreamwine.  Tears,  she said scornfully to Sansa as the woman was led from the hall.  The woman’s weapon, my lady mother used to call them. The man’s weapon is a sword. And that tells us all you need to know, doesn’t it?    Men must be very brave, though,  said Sansa.  To ride out and face swords and axes, everyone trying to kill you…    Jaime told me once that he only feels truly alive in battle and in bed.  She lifted her cup and took a long swallow. Her salad was untouched.  I would sooner face any number of swords than sit helpless like this, pretending to enjoy the company of this flock of frightened hens.    You asked them here, Your Grace.    Certain things are expected of a queen. They will be expected of you should you ever wed Joffrey. Best learn.  The queen studied the wives, daughters, and mothers who filled the benches.  Of themselves the hens are nothing, but their cocks are important for one reason or another, and some may survive this battle. So it behooves me to give their women my protection. If my wretched dwarf of a brother should somehow manage to prevail, they will return to their husbands and fathers full of tales about how brave I was, how my courage inspired them and lifted their spirits, how I never doubted our victory even for a moment.    And if the castle should fall?    You’d like that, wouldn’t you?  Cersei did not wait for a denial.  If I’m not betrayed by my own guards, I may be able to hold here for a time. Then I can go to the walls and offer to yield to Lord Stannis in person. That will spare us the worst. But if Maegor’s Holdfast should fall before Stannis can come up, why then, most of my guests are in for a bit of rape, I’d say. And you should never rule out mutilation, torture, and murder at times like these.   Sansa was horrified.  These are women, unarmed, and gently born.    Their birth protects them,  Cersei admitted,  though not as much as you’d think. Each one’s worth a good ransom, but after the madness of battle, soldiers often seem to want flesh more than coin. Even so, a golden shield is better than none. Out in the streets, the women won’t be treated near as tenderly. Nor will our servants. Pretty things like that serving wench of Lady Tanda’s could be in for a lively night, but don’t imagine the old and the infirm and the ugly will be spared."
}