{
  "id": "5a112e93ec003c92220ec0bd15cc5ad23b83c922",
  "text": " \"I asked her to go with me just now,\" Harry said dully, \"and she told me.\" Ginny had suddenly stopped smiling. \"This is mad,\" said Ron.  \"We're the only ones left who haven't got anyone - well, except Neville.  Hey - guess who he asked?  Hermione!\" \"What?\" said Harry, completely distracted by this startling news. \"Yeah, I know!\"  said Ron, some of the color coming back into his face as he started to laugh.  \"He told me after Potions!  Said she's always been really nice, helping him out with work and stuff- but she told him she was already going with someone.  Ha!  As if!  She just didn't want to go with Neville ... I mean, who would?\" \"Don't!\" said Ginny, annoyed. \"Don't laugh -\" Just then Hermione climbed in through the portrait hole. \"Why weren't you two at dinner?\"  she said, coming over to join them. \"Because - oh shut up laughing, you two - because they've both just been turned down by girls they asked to the ball!\"  said Ginny. That shut Harry and Ron up. \"Thanks a bunch, Ginny,\" said Ron sourly. \"All the good-looking ones taken, Ron?\"  said Hermione loftily.  \"Eloise Midgen starting to look quite pretty now, is she?  Well, I'm sure you'll find someone somewhere who'll have you.\" But Ron was staring at Hermione as though suddenly seeing her in a whole new light. \"Hermione, Neville's right - you are a girl. . . .\" \"Oh well spotted,\" she said acidly. \"Well - you can come with one of us!\" \"No, I can't,\" snapped Hermione. \"Oh come on,\" he said impatiently, \"we need partners, we're going to look really stupid if we haven't got any, everyone else has . . .\" \"I can't come with you,\" said Hermione, now blushing, \"because I'm already going with someone.\" \"No, you're not!\"  said Ron. \"You just said that to get rid of Neville!\" \"Oh did I?\" said Hermione, and her eyes flashed dangerously.  \"Just because it's taken you three years to notice, Ron, doesn't mean no one else has spotted I'm a girl!\" Ron stared at her. Then he grinned again. \"Okay, okay, we know you're a girl,\" he said.  \"That do?  Will you come now?\" \"I've already told you!\"  Hermione said very angrily.  \"I'm going with someone else!\" And she stormed off toward the girls' dormitories again. \"She's lying,\" said Ron flatly, watching her go. \"She's not,\" said Ginny quietly. \"Who is it then?\"  said Ron sharply. \"I'm not telling you, it's her business,\" said Ginny. \"Right,\" said Ron, who looked extremely put out, \"this is getting stupid.  Ginny, you can go with Harry, and I'll just -\" \"I can't,\" said Ginny, and she went scarlet too. \"I'm going with - with Neville.  He asked me when Hermione said no, and I thought. . . well. . . I'm not going to be able to go otherwise, I'm not in fourth year.\"  She looked extremely miserable.  \"I think I'll go and have dinner,\" she said, and she got up and walked off to the portrait hole, her head bowed. Ron goggled at Harry. \"What's got into them?\"  he demanded. But Harry had just seen Parvati and Lavender come in through the portrait hole. The time had come for drastic action. \"Wait here,\" he said to Ron, and he stood up, walked straight up to Parvati, and said, \"Parvati? Will you go to the ball with me?\" Parvati went into a fit of giggles.  Harry waited for them to subside, his fingers crossed in the pocket of his robes. \"Yes, all right then,\" she said finally, blushing furiously. \"Thanks,\" said Harry, in relief.  \"Lavender - will you go with Ron?\" \"She's going with Seamus,\" said Parvati, and the pair of them giggled harder than ever. Harry sighed. \"Can't you think of anyone who'd go with Ron?\"  he said, lowering his voice so that Ron wouldn't hear. \"What about Hermione Granger?\"  said Parvati. \"She's going with someone else.\" Parvati looked astonished. \"Ooooh - who?\"  she said keenly. Harry shrugged. \"No idea,\" he said.  \"So what about Ron?\" \"Well. . .\" said Parvati slowly, \"I suppose my sister might. . . Padma, you know ... in Ravenclaw.  I'll ask her if you like.\" \"Yeah, that would be great,\" said Harry.  \"Let me know, will you?\" And he went back over to Ron, feeling that this ball was a lot more trouble than it was worth, and hoping very much that Padma Patil's nose was dead center.  CHAPTER TWENTY-THREE - THE YULE BALL  Despite the very heavy load of homework that the fourth  years had been given for the holidays.  Harry was in no mood to work when term ended, and spent the week leading up to Christmas enjoying himself as fully as possible along with everyone else.  Gryffindor Tower was hardly less crowded now than during term-time; it seemed to have shrunk slightly too, as its inhabitants were being so much rowdier than usual.  Fred and George had had a great success with their Canary Creams, and for the first couple of days of the holidays, people kept bursting into feather all over the place.  Before long, however, all the Gryffindors had learned to treat food anybody else offered them with extreme caution, in case it had a Canary Cream concealed in the center, and George confided to Harry that he and Fred were now working on developing something else."
}