{
  "id": "5b755b383a91cdaeb61129c8f850842135576adc",
  "text": "  'At least to  me, and to many;  though not to all, as you may find, if you come to the king.'       'It  is  tidings more grievous than any in  this  land can  understand,  though it may touch them  sorely  ere the year is much older,' said Aragorn.  'But when  the great fall,  the less must lead. My  part it has been to guide  our Company on the long  road from Moria. Through Lurien we came -- of  which  it were well that you should learn  the truth  ere you speak of it  again  --  and thence down the leagues of the Great River to the falls of Rauros. There  Boromir was slain by the same Orcs whom you destroyed.'       'Your  news is all of woe!' cried Jomer in dismay. 'Great harm is  this  death to  Minas  Tirith, and to us all. That was a worthy man! All spoke his  praise.  He  came  seldom to the Mark, for he  was ever  in the wars on  the  East -borders; but I have seen him. More like to the swift sons of Eorl  than  to the  grave Men  of Gondor  he seemed  to me, and likely to  prove a great  captain of  his  people when  his time came. But we have had no word of this  grief out of Gondor. When did he fall?'       'It is now the fourth day since he was slain,' answered  Aragorn,  'and  since the evening of  that day  we  have  journeyed from the shadow  of  Tol   Brandir.'       'On foot?' cried Jomer.       'Yes, even as you see us.'       Wide wonder came into Jomer's eyes. 'Strider is too poor a name, son of  Arathorn,' he  said. 'Wingfoot I name  you.  This deed of the  three friends  should be sung in many a hall. Forty leagues and five  you have measured ere  the fourth day is ended! Hardy is the race of Elendil!       'But  now, lord, what would you  have me do! I must return in  haste to  Thjoden. I spoke warily  before  my  men. It is true that  we are not yet at  open  war with the Black Land, and there are some, close to the  king's ear,  that speak craven counsels; but war is coming. We shall  not forsake our old  alliance  with Gondor, and while they fight we shall aid them: so say  I and  all  who  hold  with me. The East-mark is my charge. the  ward  of  the Third  Marshal, and I have  removed  all our  herds  and herdfolk, withdrawing them   ####-beyond Entwash, and leaving none here but guards and swift scouts.'       'Then you do not pay tribute to Sauron?' said Gimli.       'We do not and we never have.'  said Jomer  with  a flash  of his eyes;  'though it comes to my  ears that that lie has been told. Some years ago the  Lord of the Black Land wished to  purchase horses of us at  great price, but  we  refused him.  for he puts  beasts  to evil use. Then he sent  plundering  Orcs, and  they carry  off what they can, choosing always the  black horses:  few of these are now left. For that reason our feud with the Orcs is bitter.       'But at this  time our chief concern  is  with Saruman. He has  claimed  lordship over  all this  land,  and there  has been war  between us for many  months.  He has taken Orcs into his service,  and Wolf-riders, and evil Men,   and he has closed the Gap against us, so that we are likely to be beset both  east and west.       'It is ill dealing with such a  foe:  he  is a wizard both cunning  and  dwimmer -crafty, having many guises. He walks here and there, they say, as an  old  man hooded and cloaked, very like  to Gandalf, as many now recall.  His  spies  slip  through every net, and his birds  of ill omen are abroad in the  sky. I do not  know how it will all end, and  my heart  misgives me;  for it  seems to  me that his friends do not all dwell in Isengard. But  if you come  to the king's  house, you shall see for  yourself. Will  you not come? Do  I  hope in vain that you have been sent to me for a help in doubt and need?'       'I will come when I may,' said Aragorn.       'Come now!' said Jomer. 'The Heir of Elendil would be a strength indeed  to the  Sons of Eorl  in this evil tide.  There  is battle even  now upon the  Westemnet, and I fear that it may go ill for us.       'Indeed in this riding north I went without the king's leave, for in my  absence his  house  is left with little guard. But scouts warned me  of  the  orc-host coming down out of the East  Wall  three nights ago, and among them  they reported that some bore the white badges of Saruman. So suspecting what  I  most fear, a league between  Orthanc  and  the Dark Tower, I led forth my  jored,  men of  my own household; and  we overtook the Orcs at nightfall two  days  ago, near to the borders of the Entwood. There we surrounded them, and  gave battle yesterday at dawn. Fifteen of my men  I lost, and  twelve horses  alas! For the  Orcs were greater in number than we counted on. Others joined  them. coming out of the East across the Great River: their trail is plain to  see a little north of this spot.  And  others, too, came out  of the forest.  Great Orcs, who  also bore the White Hand of Isengard: that kind is stronger    ####-and more fell than all  others.        'Nonetheless we put an end to them."
}