{
  "id": "5bd107ad0c8f0ba296c4b94f970ac1ea5912520e",
  "text": "       'Greetings!' said  the la d. 'Where do you come from? You are a stranger   in the City.'       'I was,' said Pippin; 'but they say I have become a man of Gondor.'       'Oh  come!' said the lad. 'Then we are all men  here.  But how old  are  you, and what is your name? I am ten  years a lready, and  shall soon be five  feet.  I am  taller  than you. But then my father  is  a  Guard, one of  the  tallest. What is your father?'       'Which question  shall  I  answer first?' said Pippin. 'My father farms  the  lands  round Whitwell  near  Tuckborough in  the  Shire.  I  am  nearly  twenty-nine, so I pass you there; though I am but four feet, and  not likely  to grow any more, save sideways.'       'Twenty-nine!' said the lad  and whistled. 'Why, you are  quite old! As  old as my  uncle Iorlas. Still,' he added hopefully, 'I  wager I could stand  you on your head or lay you on your back.'       'Maybe you could, if I let you,' said Pippin with a laugh. 'And maybe I  could  do  the  same  to  you: we know some  wrestling tricks in  my  little  country.  Where,  let  me tell  you,  I am considered  uncommonly large  and  strong; and I have never allowed anyone  to stand me  on  my  head. So if it  came to a trial and nothing else would serve, I might have  to kill you. For   when you  are older, you will learn that folk are not always what they seem;   and though  you may have taken me for a soft stranger -lad and easy prey, let   me  warn you: I am not,  I  am a halfling,  hard, bold,  and wicked!' Pippin  pulled such  a  grim face  that the boy stepped  back a pace, but at once he  returned with clenched fists and the light of battle in his eye.       'No!'  Pippin laughed. 'Don't  believe what strangers say of themselves  either! I am  not a fighter.  But it  would be politer in any  case for  the  challenger to say who he is.'       The boy drew himself  up  proudly.  'I am Bergil son of Beregond of the  Guards,' he said.   ####-     'So I thought,' said Pippin, 'for you look like your father. I know him  and he sent me to find you.'       'Then why did you not say so at once?' said Bergil, and suddenly a look   of dismay came over his face. 'Do not  tell me that he has changed his mind,   and will send me away with the maidens! But no, the last wains have gone.'       'His message is less bad than that, if not good.' said Pippin. 'He says  that if you would  prefer it to standing me  on  my head, you might show  me  round the  City for  a while  and cheer my loneliness. I can  tell  you some  tales of far countries in return.'       Bergil  clapped his hands,  and laughed with relief.  'All is well,' he  cried. 'Come then! We were  soon going to the  Gate  to look  on. We will go  now.'       'What is happening there?'       'The  Captains  of the  Outlands  are  expected up the South  Road  ere  sundown. Come with us and you will see.'       Bergil proved a good comrade, the best company Pippin had had  since he  parted from Merry, and soon they  were laughing and  talking  gaily  as they  went about  the streets, heedless of the many  glances  that men gave  them.  Before long they found themselves in  a throng going towards the Great Gate.  There Pippin went  up  much in  the esteem of Bergil,  for when he spoke his  name and the pass-word the guard saluted  him and let  him pass through; and  what was more, he allowed him to take his companion with him.       'That is good!' said Bergil. 'We boys are no longer allowed to pass the  Gate without an elder. Now we shall see better.'       Beyond the Gate there was a crowd of men  along  the  verge of the road  and of the great paved space into  which all the wa ys to  Minas Tirith  ran.  All eyes were turned southwards, and soon a murmur rose: 'There is dust away  there! They are coming!'       Pippin and Bergil  edged their way  forward to the front of the  crowd,  and waited. Horns sounded at some distance, and the noise of cheering rolled  towards them like a gathering wind. Then there was a loud trumpet-blast, and  all about them people were shouting.       'Forlong! Forlong!' Pippin  heard men calling.  'What do  they say?' he  asked.       'Forlong  has come,' Bergil answered; 'old Forlong the Fat, the Lord of  Lossarnach. That is where  my grandsire  lives. Hurrah! Here he is. Good old  Forlong!'   ####-     Leading the line there came walking a big thick -limbed horse, and on it  sat a man of  wide  shoulders and  huge girth, but old and grey-bearded, yet  mail-clad and  black-helmed and  bearing  a  long heavy  spear.  Behind  him  marched  proudly  a  dusty  line  of  men,   well-armed  and  bearing  great  battle-axes; grim-faced they were, and shorter  and  somewhat swarthier  than  any men that Pippin had yet seen in Gondor.       'Forlong!' men shouted.  'True heart, true friend!  Forlong!'  But when  the men of Lossarnach  had passed they muttered: 'So few! Two hundreds,  what  are they? We hoped for ten times the number. That will be the new tidings of  the  black fleet."
}