{
  "id": "5c3757ae9353ae6fd1190072aa5d11c9ea891afe",
  "text": "  We’re going to sail on a galley. It will be an adventure, and then we’ll be with Bran and Robb again, and Old Nan and Hodor and the rest.  She touched her on the arm.   Hodor!  Sansa yelled.  You ought to marry Hodor, you’re just like him, stupid and hairy and ugly!  She wrenched away from her sister’s hand, stormed into her bedchamber, and barred the door behind her.      EDDARD   Pain is a gift from the gods, Lord Eddard,  Grand Maester Pycelle told him.  It means the bone is knitting, the flesh healing itself. Be thankful.    I will be thankful when my leg stops throbbing.   Pycelle set a stoppered flask on the table by the bed.  The milk of the poppy, for when the pain grows too onerous.    I sleep too much already.    Sleep is the great healer.    I had hoped that was you.   Pycelle smiled wanly.  It is good to see you in such a fierce humor, my lord.  He leaned close and lowered his voice.  There was a raven this morning, a letter for the queen from her lord father. I thought you had best know.    Dark wings, dark words,  Ned said grimly.  What of it?    Lord Tywin is greatly wroth about the men you sent after Ser Gregor Clegane,  the maester confided.  I feared he would be. You will recall, I said as much in council.    Let him be wroth,  Ned said. Every time his leg throbbed, he remembered Jaime Lannister’s smile, and Jory dead in his arms.  Let him write all the letters to the queen he likes. Lord Beric rides beneath the king’s own banner. If Lord Tywin attempts to interfere with the king’s justice, he will have Robert to answer to. The only thing His Grace enjoys more than hunting is making war on lords who defy him.   Pycelle pulled back, his maester’s chain jangling.  As you say. I shall visit again on the morrow.  The old man hurriedly gathered up his things and took his leave. Ned had little doubt that he was bound straight for the royal apartments, to whisper at the queen. I thought you had best know, indeed… as if Cersei had not instructed him to pass along her father’s threats. He hoped his response rattled those perfect teeth of hers. Ned was not near as confident of Robert as he pretended, but there was no reason Cersei need know that.  When Pycelle was gone, Ned called for a cup of honeyed wine. That clouded the mind as well, yet not as badly. He needed to be able to think. A thousand times, he asked himself what Jon Arryn might have done, had he lived long enough to act on what he’d learned. Or perhaps he had acted, and died for it.  It was queer how sometimes a child’s innocent eyes can see things that grown men are blind to. Someday, when Sansa was grown, he would have to tell her how she had made it all come clear for him. He’s not the least bit like that old drunken king, she had declared, angry and unknowing, and the simple truth of it had twisted inside him, cold as death. This was the sword that killed Jon Arryn, Ned thought then, and it will kill Robert as well, a slower death but full as certain. Shattered legs may heal in time, but some betrayals fester and poison the soul.  Littlefinger came calling an hour after the Grand Maester had left, clad in a plum-colored doublet with a mockingbird embroidered on the breast in black thread, and a striped cloak of black and white.  I cannot visit long, my lord,  he announced.  Lady Tanda expects me to lunch with her. No doubt she will roast me a fatted calf. If it’s near as fatted as her daughter, I’m like to rupture and die. And how is your leg?    Inflamed and painful, with an itch that is driving me mad.   Littlefinger lifted an eyebrow.  In future, try not to let any horses fall on it. I would urge you to heal quickly. The realm grows restive. Varys has heard ominous whispers from the west. Freeriders and sellswords have been flocking to Casterly Rock, and not for the thin pleasure of Lord Tywin’s conversation.    Is there word of the king?  Ned demanded.  Just how long does Robert intend to hunt?    Given his preferences, I believe he’d stay in the forest until you and the queen both die of old age,  Lord Petyr replied with a faint smile.  Lacking that, I imagine he’ll return as soon as he’s killed something. They found the white hart, it seems… or rather, what remained of it. Some wolves found it first, and left His Grace scarcely more than a hoof and a horn. Robert was in a fury, until he heard talk of some monstrous boar deeper in the forest. Then nothing would do but he must have it. Prince Joffrey returned this morning, with the Royces, Ser Balon Swann, and some twenty others of the party. The rest are still with the king.    The Hound?  Ned asked, frowning. Of all the Lannister party, Sandor Clegane was the one who concerned him the most, now that Ser Jaime had fled the city to join his father.   Oh, returned with Joffrey, and went straight to the queen.  Littlefinger smiled.  I would have given a hundred silver stags to have been a roach in the rushes when he learned that Lord Beric was off to behead his brother.    Even a blind man could see the Hound loathed his brother."
}