{
  "id": "5c87370ece59fbecfdb46cf55bcc322d29a46a8b",
  "text": " Stone hammers pounded stakes deep into the ice to serve as anchors for the ropes; the iron stakes ran out before they were halfway up, and after that the climbers used horn and sharpened bone. And the men kicked, driving the spikes on their boots against the hard unyielding ice again and again and again and again to make one foothold. Their legs must be numb, Jon thought by the fourth hour. How long can they keep on with that? He watched as restless as the Magnar, listening for the distant moan of a Thenn warhorn. But the horns stayed silent, and there was no sign of the Night’s Watch.  By the sixth hour, Jarl had moved ahead of Grigg the Goat again, and his men were widening the gap.  The Mance’s pet must want a sword,  the Magnar said, shading his eyes. The sun was high in the sky, and the upper third of the Wall was a crystalline blue from below, reflecting so brilliantly that it hurt the eyes to look on it. Jarl’s four and Grigg’s were all but lost in the glare, though Errok’s team was still in shadow. Instead of moving upward they were edging their way sideways at about five hundred feet, making for a chimney. Jon was watching them inch along when he heard the sound—a sudden crack that seemed to roll along the ice, followed by a shout of alarm. And then the air was full of shards and shrieks and falling men, as a sheet of ice a foot thick and fifty feet square broke off from the Wall and came tumbling, crumbling, rumbling, sweeping all before it. Even down at the foot of the ridge, some chunks came spinning through the trees and rolling down the slope. Jon grabbed Ygritte and pulled her down to shield her, and one of the Thenns was struck in the face by a chunk that broke his nose.  And when they looked up Jarl and his team were gone. Men, ropes, stakes, all gone; nothing remained above six hundred feet. There was a wound in the Wall where the climbers had clung half a heartbeat before, the ice within as smooth and white as polished marble and shining in the sun. Far far below there was a faint red smear where someone had smashed against a frozen pinnace.  The Wall defends itself, Jon thought as he pulled Ygritte back to her feet.  They found Jarl in a tree, impaled upon a splintered branch and still roped to the three men who lay broken beneath him. One was still alive, but his legs and spine were shattered, and most of his ribs as well.  Mercy,  he said when they came upon him. One of the Thenns smashed his head in with a big stone mace. The Magnar gave orders, and his men began to gather fuel for a pyre.  The dead were burning when Grigg the Goat reached the top of the Wall. By the time Errok’s four had joined them, nothing remained of Jarl and his team but bone and ash.  The sun had begun to sink by then, so the climbers wasted little time. They unwound the long coils of hemp they’d had looped around their chests, tied them all together, and tossed down one end. The thought of trying to climb five hundred feet up that rope filled Jon with dread, but Mance had planned better than that. The raiders Jarl had left below uncasked a huge ladder, with rungs of woven hemp as thick as a man’s arm, and tied it to the climbers’ rope. Errok and Grigg and their men grunted and heaved, pulled it up, staked it to the top, then lowered the rope again to haul up a second ladder. There were five altogether.  When all of them were in place, the Magnar shouted a brusque command in the Old Tongue, and five of his Thenns started up together. Even with the ladders, it was no easy climb. Ygritte watched them struggle for a while.  I hate this Wall,  she said in a low angry voice.  Can you feel how cold it is?    It’s made of ice,  Jon pointed out.   You know nothing, Jon Snow. This wall is made o’ blood.   Nor had it drunk its fill. By sunset, two of the Thenns had fallen from the ladder to their deaths, but they were the last. It was near midnight before Jon reached the top. The stars were out again, and Ygritte was trembling from the climb.  I almost fell,  she said, with tears in her eyes.  Twice. Thrice. The Wall was trying t’ shake me off, I could feel it.  One of the tears broke free and trickled slowly down her cheek.   The worst is behind us.  Jon tried to sound confident.  Don’t be frightened.  He tried to put an arm around her.  Ygritte slammed the heel of her hand into his chest, so hard it stung even through his layers of wool, mail, and boiled leather.  I wasn’t frightened. You know nothing, Jon Snow.    Why are you crying, then?    Not for fear!  She kicked savagely at the ice beneath her with a heel, chopping out a chunk.  I’m crying because we never found the Horn of Winter. We opened half a hundred graves and let all those shades loose in the world, and never found the Horn of Joramun to bring this cold thing down!       Jaime   His hand burned.  Still, still, long after they had snuffed out the torch they’d used to sear his bloody stump, days after, he could still feel the fire lancing up his arm, and his fingers twisting in the flames, the fingers he no longer had."
}