{
  "id": "5ddccbe53cec6bee78931c9c04b0726457b19f79",
  "text": "...\"  He looked at Harry, who did not look away.  \"Believe me,\" croaked Black. \"Believe me, Harry. I never betrayed James and Lily. I would have died before I betrayed them.\"  And at long last, Harry believed him. Throat too tight to speak, he nodded.  \"No!\"  Pettigrew had fallen to his knees as though Harry's nod had been his own death sentence. He shuffled forward on his knees, groveling, his hands clasped in front of him as though praying.  \"Sirius -- it's me... it's Peter... your friend... you wouldn't --\"  Black kicked out and Pettigrew recoiled.  \"There's enough filth on my robes without you touching them,\" said Black.  \"Remus!\" Pettigrew squeaked, turning to Lupin instead, writhing imploringly in front of him. \"You don't believe this wouldn't Sirius have told you they'd changed the plan?\"  \"Not if he thought I was the spy, Peter,\" said Lupin. \"I assume that's why you didn't tell me, Sirius?\" he said casually over Pettigrews head.  \"Forgive me, Remus,\" said Black.  \"Not at all, Padfoot, old friend,\" said Lupin, who was now rolling up his sleeves. \"And will you, in turn, forgive me for believing you were the spy?\"  \"Of course,\" said Black, and the ghost of a grin flitted across his gaunt face. He, too, began rolling up his sleeves. \"Shall we kill him together?\"  \"Yes, I think so,\" said Lupin grimly.  \"You wouldn't... you won't...,\" gasped Pettigrew. And he scrambled around to Ron.  \"Ron... haven't I been a good friend... a good pet? You won't let them kill me, Ron, will you... you're on my side, aren't you.  But Ron was staring at Pettigrew with the utmost revulsion.  \"I let you sleep in my bed!\" he said.  \"Kind boy... kind master...\" Pettigrew crawled toward Ron \"You won't let them do it.... I was your rat.... I was a good pet....\"  \"If you made a better rat than a human, it's not much to boast about, Peter,\" said Black harshly. Ron, going still paler with pain, wrenched his broken leg out of Pettigrew's reach. Pettigrew turned on his knees, staggered forward, and seized the hem of Hermione's robes.  \"Sweet girl... clever girl... you -- you won't let them.... Help me....\"  Hermione pulled her robes out of Pettigrew's clutching hands and backed away against the wall, looking horrified.  Pettigrew knelt, trembling uncontrollably, and-turned his head slowly toward Harry.  \"Harry... Harry... you look just like your father... just like him....\"  \"HOW DARE YOU SPEAK TO HARRY?\" roared Black. \"HOW DARE YOU FACE HIM? HOW DARE YOU TALK ABOUT JAMES IN FRONT OF HIM?\"  \"Harry,\" whispered Pettigrew, shuffling toward him, hands outstretched. \"Harry, James wouldn't have wanted me killed.... James would have understood, Harry... he would have shown me mercy...\"  Both Black and Lupin strode forward, seized Pettigrew's shoulders, and threw him backward onto the floor. He sat there, twitching with terror, staring up at them.  \"You sold Lily and James to Voldemort,\" said Black, who was shaking too. \"Do you deny it?\"  Pettigrew burst into tears. It was horrible to watch, like an oversized, balding baby, cowering on the floor.  \"Sirius, Sirius, what could I have done? The Dark Lord... you have no idea... he has weapons you can't imagine.... I was scared, Sirius, I was never brave like you and Remus and James. I never meant it to happen.... He-Who-Must-Not-Be-Named forced me --\"  \"DON'T LIE!\" bellowed Black. \"YOU'D BEEN PASSING INFORMATION TO HIM FOR A YEAR BEFORE LILY AND JAMES DIED! YOU WERE HIS SPY!\"  \"He -- he was taking over everywhere!\" gasped Pettigrew. \"Wh -- what was there to be gained by refusing him?\"  \"What was there to be gained by fighting the most evil wizard who has ever existed?\" said Black, with a terrible fury in his face. \"Only innocent lives, Peter!\"  \"You don't understand!\" whined Pettigrew. \"He would have killed me, Sirius!\"  \"THEN YOU SHOULD HAVE DIED!\" roared Black. \"DIED RATHER THAN BETRAY YOUR FRIENDS, AS WE WOULD HAVE DONE FOR YOU!\"  Black and Lupin stood shoulder to shoulder, wands raised.  \"You should have realized,\" said Lupin quietly, \"if Voldemort didn't kill you, we would. Good-bye, Peter.\"  Hermione covered her face with her hands and turned to the wall.  \"NO!\" Harry yelled. He ran forward, placing himself in front Pettigrew, facing the wands. \"You can't kill him,\" he said breathlessly. \"You can't.\"  Black and Lupin both looked staggered.  \"Harry, this piece of vermin is the reason you have no parents,\" Black snarled. \"This cringing bit of filth would have seen you die too, without turning a hair. You heard him. His own stinking skin meant more to him than your whole family.\"  \"I know,\" Harry panted. \"We'll take him up to the castle. We'll hand him over to the dementors.... He can go to Azkaban... but don't kill him.\"  \"Harry!\" gasped Pettigrew, and he flung his arms around Harry's knees. \"You -- thank you -- it's more than I deserve -- thank you --\"  \"Get off me,\" Harry spat, throwing Pettigrew's hands off him in disgust. \"I'm not doing this for you. I'm doing it because -- I don't reckon my dad would've wanted them to become killers -- just for you."
}