{
  "id": "60d96cd90f9a154913fdf5074505f0c2c4a35d38",
  "text": " If Edmure and Roslin were happy in one another, if the Late Lord Frey could be appeased and his power once more wedded to Robb’s… Even then, what chance will we have, caught between Lannister and Greyjoy? It was a question Catelyn dared not dwell on, though Robb dwelt on little else. She saw how he studied his maps whenever they made camp, searching for some plan that might win back the north.  Her brother Edmure had other cares.  You don’t suppose all Lord Walder’s daughters look like him, do you?  he wondered, as he sat in his tall striped pavilion with Catelyn and his friends.   With so many different mothers, a few of the maids are bound to turn up comely,  said Ser Marq Piper,  but why should the old wretch give you a pretty one?    No reason at all,  said Edmure in a glum tone.  It was more than Catelyn could stand.  Cersei Lannister is comely,  she said sharply.  You’d be wiser to pray that Roslin is strong and healthy, with a good head and a loyal heart.  And with that she left them.  Edmure did not take that well. The next day he avoided her entirely on the march, preferring the company of Marq Piper, Lymond Goodbrook, Patrek Mallister, and the young Vances. They do not scold him, except in jest, Catelyn told herself when they raced by her that afternoon with nary a word. I have always been too hard with Edmure, and now grief sharpens my every word. She regretted her rebuke. There was rain enough falling from the sky without her making more. And was it really such a terrible thing, to want a pretty wife? She remembered her own childish disappointment, the first time she had laid eyes on Eddard Stark. She had pictured him as a younger version of his brother Brandon, but that was wrong. Ned was shorter and plainer of face, and so somber. He spoke courteously enough, but beneath the words she sensed a coolness that was all at odds with Brandon, whose mirths had been as wild as his rages. Even when he took her maidenhood, their love had more of duty to it than of passion. We made Robb that night, though; we made a king together. And after the war, at Winterfell, I had love enough for any woman, once I found the good sweet heart beneath Ned’s solemn face. There is no reason Edmure should not find the same, with his Roslin.  As the gods would have it, their route took them through the Whispering Wood where Robb had won his first great victory. They followed the course of the twisting stream on the floor of that pinched narrow valley, much as Jaime Lannister’s men had done that fateful night. It was warmer then, Catelyn remembered, the trees were still green, and the stream did not overflow its banks. Fallen leaves choked the flow now and lay in sodden snarls among the rocks and roots, and the trees that had once hidden Robb’s army had exchanged their green raiment for leaves of dull gold spotted with brown, and a red that reminded her of rust and dry blood. Only the spruce and the soldier pines still showed green, thrusting up at the belly of the clouds like tall dark spears.  More than the trees have died since then, she reflected. On the night of the Whispering Wood, Ned was still alive in his cell beneath Aegon’s High Hill, Bran and Rickon were safe behind the walls of Winterfell. And Theon Greyjoy fought at Robb’s side, and boasted of how he had almost crossed swords with the Kingslayer. Would that he had. If Theon had died in place of Lord Karstark’s sons, how much ill would have been undone?  As they passed through the battleground, Catelyn glimpsed signs of the carnage that had been; an overturned helm filling with rain, a splintered lance, the bones of a horse. Stone cairns had been raised over some of the men who had fallen here, but scavengers had already been at them. Amidst the tumbles of rock, she spied brightly colored cloth and bits of shiny metal. Once she saw a face peering out at her, the shape of the skull beginning to emerge from beneath the melting brown flesh.  It made her wonder where Ned had come to rest. The silent sisters had taken his bones north, escorted by Hallis Mollen and a small honor guard. Had Ned ever reached Winterfell, to be interred beside his brother Brandon in the dark crypts beneath the castle? Or did the door slam shut at Moat Cailin before Hal and the sisters could pass?  Thirty-five hundred riders wound their way along the valley floor through the heart of the Whispering Wood, but Catelyn Stark had seldom felt lonelier. Every league she crossed took her farther from Riverrun, and she found herself wondering whether she would ever see the castle again. Or was it lost to her forever, like so much else?  Five days later, their scouts rode back to warn them that the rising waters had washed out the wooden bridge at Fairmarket. Galbart Glover and two of his bolder men had tried swimming their mounts across the turbulent Blue Fork at Ramsford. Two of the horses had been swept under and drowned, and one of the riders; Glover himself managed to cling to a rock until they could pull him in."
}