{
  "id": "610e0fe1ec941eb254c29674e63ea4d7d4049504",
  "text": "  Aye,  the wildling repeated,  he’s the craven killed the Halfhand. Up in the Frostfangs, it were, after we hunted down t’other crows and killed them, every one. We would have done for this one too, only he begged f’ his worthless life, offered t’ join us if we’d have him. The Halfhand swore he’d see the craven dead first, but the wolf ripped Qhorin half t’ pieces and this one opened his throat.  He gave Jon a cracktooth smile then, and spat blood on his foot.   Well?  Janos Slynt demanded of Jon harshly.  Do you deny it? Or will you claim Qhorin commanded you to kill him?    He told me…  The words came hard.  He told me to do whatever they asked of me.   Slynt looked about the solar, at the other Eastwatch men.  Does this boy think I fell off a turnip wagon onto my head?    Your lies won’t save you now, Lord Snow,  warned Ser Alliser Thorne.  We’ll have the truth from you, bastard.    I’ve told you the truth. Our garrons were failing, and Rattleshirt was close behind us. Qhorin told me to pretend to join the wildlings. ‘You must not balk, whatever is asked of you,’ he said. He knew they would make me kill him. Rattleshirt was going to kill him anyway, he knew that too.    So now you claim the great Qhorin Halfhand feared this creature?  Slynt looked at Rattleshirt, and snorted.   All men fear the Lord o’ Bones,  the wildling grumbled. Ser Glendon kicked him, and he lapsed back into silence.   I never said that,  Jon insisted.  Slynt slammed a fist on the table.  I heard you! Ser Alliser had your measure true enough, it seems. You lie through your bastard’s teeth. Well, I will not suffer it. I will not! You might have fooled this crippled blacksmith, but not Janos Slynt! Oh, no. Janos Slynt does not swallow lies so easily. Did you think my skull was stuffed with cabbage?    I don’t know what your skull is stuffed with. My lord.    Lord Snow is nothing if not arrogant,  said Ser Alliser.  He murdered Qhorin just as his fellow turncloaks did Lord Mormont. It would not surprise me to learn that it was all part of the same fell plot. Benjen Stark may well have a hand in all this as well. For all we know, he is sitting in Mance Rayder’s tent even now. You know these Starks, my lord.    I do,  said Janos Slynt.  I know them too well.   Jon peeled off his glove and showed them his burned hand.  I burned my hand defending Lord Mormont from a wight. And my uncle was a man of honor. He would never have betrayed his vows.    No more than you?  mocked Ser Alliser.  Septon Cellador cleared his throat.  Lord Slynt,  he said,  this boy refused to swear his vows properly in the sept, but went beyond the Wall to say his words before a heart tree. His father’s gods, he said, but they are wildling gods as well.    They are the gods of the north, Septon.  Maester Aemon was courteous, but firm.  My lords, when Donal Noye was slain, it was this young man Jon Snow who took the Wall and held it, against all the fury of the north. He has proved himself valiant, loyal, and resourceful. Were it not for him, you would have found Mance Rayder sitting here when you arrived, Lord Slynt. You are doing him a great wrong. Jon Snow was Lord Mormont’s own steward and squire. He was chosen for that duty because the Lord Commander saw much promise in him. As do I.    Promise?  said Slynt.  Well, promise may turn false. Qhorin Halfhand’s blood is on his hands. Mormont trusted him, you say, but what of that? I know what it is to be betrayed by men you trusted. Oh, yes. And I know the ways of wolves as well.  He pointed at Jon’s face.  Your father died a traitor.    My father was murdered.  Jon was past caring what they did to him, but he would not suffer any more lies about his father.  Slynt purpled.  Murder? You insolent pup. King Robert was not even cold when Lord Eddard moved against his son.  He rose to his feet; a shorter man than Mormont, but thick about the chest and arms, with a gut to match. A small gold spear tipped with red enamel pinned his cloak at the shoulder.  Your father died by the sword, but he was highborn, a King’s Hand. For you, a noose will serve. Ser Alliser, take this turncloak to an ice cell.    My lord is wise.  Ser Alliser seized Jon by the arm.  Jon yanked away and grabbed the knight by the throat with such ferocity that he lifted him off the floor. He would have throttled him if the Eastwatch men had not pulled him off. Thorne staggered back, rubbing the marks Jon’s fingers had left on his neck.  You see for yourselves, brothers. The boy is a wildling.       Tyrion   When dawn broke, he found he could not face the thought of food. By evenfall I may stand condemned. His belly was acid with bile, and his nose itched. Tyrion scratched at it with the point of his knife. One last witness to endure, then my turn. But what to do? Deny everything? Accuse Sansa and Ser Dontos? Confess, in the hope of spending the rest of his days on the Wall? Let the dice fly and pray the Red Viper could defeat Ser Gregor Clegane?  Tyrion stabbed listlessly at a greasy grey sausage, wishing it were his sister."
}