{
  "id": "612da0a57100ac43adf320b355cfa4fd3eedfd62",
  "text": " He felt nothing. A pair of yellow eyes looked into his own, shining like the sun. The window was open and it was cold in the room, but the warmth that came off the wolf enfolded him like a hot bath. His pup, Bran realized… or was it? He was so big now. He reached out to pet him, his hand trembling like a leaf.  When his brother Robb burst into the room, breathless from his dash up the tower steps, the direwolf was licking Bran’s face. Bran looked up calmly.  His name is Summer,  he said.      CATELYN   We will make King’s Landing within the hour.   Catelyn turned away from the rail and forced herself to smile.  Your oarmen have done well by us, Captain. Each one of them shall have a silver stag, as a token of my gratitude.   Captain Moreo Turnitis favored her with a half bow.  You are far too generous, Lady Stark. The honor of carrying a great lady like yourself is all the reward they need.    But they’ll take the silver anyway.   Moreo smiled.  As you say.  He spoke the Common Tongue fluently, with only the slightest hint of a Tyroshi accent. He’d been plying the narrow sea for thirty years, he’d told her, as oarman, quartermaster, and finally captain of his own trading galleys. The Storm Dancer was his fourth ship, and his fastest, a two-masted galley of sixty oars.  She had certainly been the fastest of the ships available in White Harbor when Catelyn and Ser Rodrik Cassel had arrived after their headlong gallop downriver. The Tyroshi were notorious for their avarice, and Ser Rodrik had argued for hiring a fishing sloop out of the Three Sisters, but Catelyn had insisted on the galley. It was good that she had. The winds had been against them much of the voyage, and without the galley’s oars they’d still be beating their way past the Fingers, instead of skimming toward King’s Landing and journey’s end.  So close, she thought. Beneath the linen bandages, her fingers still throbbed where the dagger had bitten. The pain was her scourge, Catelyn felt, lest she forget. She could not bend the last two fingers on her left hand, and the others would never again be dexterous. Yet that was a small enough price to pay for Bran’s life.  Ser Rodrik chose that moment to appear on deck.  My good friend,  said Moreo through his forked green beard. The Tyroshi loved bright colors, even in their facial hair.  It is so fine to see you looking better.    Yes,  Ser Rodrik agreed.  I haven’t wanted to die for almost two days now.  He bowed to Catelyn.  My lady.   He was looking better. A shade thinner than he had been when they set out from White Harbor, but almost himself again. The strong winds in the Bite and the roughness of the narrow sea had not agreed with him, and he’d almost gone over the side when the storm seized them unexpectedly off Dragonstone, yet somehow he had clung to a rope until three of Moreo’s men could rescue him and carry him safely below decks.   The captain was just telling me that our voyage is almost at an end,  she said.  Ser Rodrik managed a wry smile.  So soon?  He looked odd without his great white side whiskers; smaller somehow, less fierce, and ten years older. Yet back on the Bite it had seemed prudent to submit to a crewman’s razor, after his whiskers had become hopelessly befouled for the third time while he leaned over the rail and retched into the swirling winds.   I will leave you to discuss your business,  Captain Moreo said. He bowed and took his leave of them.  The galley skimmed the water like a dragonfly, her oars rising and falling in perfect time. Ser Rodrik held the rail and looked out over the passing shore.  I have not been the most valiant of protectors.   Catelyn touched his arm.  We are here, Ser Rodrik, and safely. That is all that truly matters.  Her hand groped beneath her cloak, her fingers stiff and fumbling. The dagger was still at her side. She found she had to touch it now and then, to reassure herself.  Now we must reach the king’s master-at-arms, and pray that he can be trusted.    Ser Aron Santagar is a vain man, but an honest one.  Ser Rodrik’s hand went to his face to stroke his whiskers and discovered once again that they were gone. He looked nonplussed.  He may know the blade, yes… but, my lady, the moment we go ashore we are at risk. And there are those at court who will know you on sight.   Catelyn’s mouth grew tight.  Littlefinger,  she murmured. His face swam up before her; a boy’s face, though he was a boy no longer. His father had died several years before, so he was Lord Baelish now, yet still they called him Littlefinger. Her brother Edmure had given him that name, long ago at Riverrun. His family’s modest holdings were on the smallest of the Fingers, and Petyr had been slight and short for his age.  Ser Rodrik cleared his throat.  Lord Baelish once, ah…  His thought trailed off uncertainly in search of the polite word.  Catelyn was past delicacy.  He was my father’s ward. We grew up together in Riverrun. I thought of him as a brother, but his feelings for me were… more than brotherly."
}