{
  "id": "61b49089f4c45320aebd7499643697089bab2237",
  "text": " He must put off his crown and bend the knee, little as he may like it.    And who will tell him so?  Roose Bolton smiled.  It is a fine thing to have so many valiant brothers in such troubled times. I shall think on all you’ve said.   His smile was dismissal. The Freys made their courtesies and shuffled out, leaving only Qyburn, Steelshanks Walton, and Arya. Lord Bolton beckoned her closer.  I am bled sufficiently. Nan, you may remove the leeches.    At once, my lord.  It was best never to make Roose Bolton ask twice. Arya wanted to ask him what Ser Hosteen had meant about Winterfell, but she dared not. I’ll ask Elmar, she thought. Elmar will tell me. The leeches wriggled slowly between her fingers as she plucked them carefully from the lord’s body, their pale bodies moist to the touch and distended with blood. They’re only leeches, she reminded herself. If I closed my hand, they’d squish between my fingers.   There is a letter from your lady wife.  Qyburn pulled a roll of parchment from his sleeve. Though he wore maester’s robes, there was no chain about his neck; it was whispered that he had lost it for dabbling in necromancy.   You may read it,  Bolton said.  The Lady Walda wrote from the Twins almost every day, but all the letters were the same.  I pray for you morn, noon, and night, my sweet lord,  she wrote,  and count the days until you share my bed again. Return to me soon, and I will give you many trueborn sons to take the place of your dear Domeric and rule the Dreadfort after you.  Arya pictured a plump pink baby in a cradle, covered with plump pink leeches.  She brought Lord Bolton a damp washcloth to wipe down his soft hairless body.  I will send a letter of my own,  he told the onetime maester.   To the Lady Walda?    To Ser Helman Tallhart.   A rider from Ser Helman had come two days past. Tallhart men had taken the castle of the Darrys, accepting the surrender of its Lannister garrison after a brief siege.   Tell him to put the captives to the sword and the castle to the torch, by command of the king. Then he is to join forces with Robett Glover and strike east toward Duskendale. Those are rich lands, and hardly touched by the fighting. It is time they had a taste. Glover has lost a castle, and Tallhart a son. Let them take their vengeance on Duskendale.    I shall prepare the message for your seal, my lord.   Arya was glad to hear that the castle of the Darrys would be burned. That was where they’d brought her when she’d been caught after her fight with Joffrey, and where the queen had made her father kill Sansa’s wolf. It deserves to burn. She wished that Robett Glover and Ser Helman Tallhart would come back to Harrenhal, though; they had marched too quickly, before she’d been able to decide whether to trust them with her secret.   I will hunt today,  Roose Bolton announced as Qyburn helped him into a quilted jerkin.   Is it safe, my lord?  Qyburn asked.  Only three days past, Septon Utt’s men were attacked by wolves. They came right into his camp, not five yards from the fire, and killed two horses.    It is wolves I mean to hunt. I can scarcely sleep at night for the howling.  Bolton buckled on his belt, adjusting the hang of sword and dagger.  It’s said that direwolves once roamed the north in great packs of a hundred or more, and feared neither man nor mammoth, but that was long ago and in another land. It is queer to see the common wolves of the south so bold.    Terrible times breed terrible things, my lord.   Bolton showed his teeth in something that might have been a smile.  Are these times so terrible, Maester?    Summer is gone and there are four kings in the realm.    One king may be terrible, but four?  He shrugged.  Nan, my fur cloak.  She brought it to him.  My chambers will be clean and orderly upon my return,  he told her as she fastened it.  And tend to Lady Walda’s letter.    As you say, my lord.   The lord and maester swept from the room, giving her not so much as a backward glance. When they were gone, Arya took the letter and carried it to the hearth, stirring the logs with a poker to wake the flames anew. She watched the parchment twist, blacken, and flare up. If the Lannisters hurt Bran and Rickon, Robb will kill them every one. He’ll never bend the knee, never, never, never. He’s not afraid of any of them. Curls of ash floated up the chimney. Arya squatted beside the fire, watching them rise through a veil of hot tears. If Winterfell is truly gone, is this my home now? Am I still Arya, or only Nan the serving girl, for forever and forever and forever?  She spent the next few hours tending to the lord’s chambers. She swept out the old rushes and scattered fresh sweet-smelling ones, laid a fresh fire in the hearth, changed the linens and fluffed the featherbed, emptied the chamber pots down the privy shaft and scrubbed them out, carried an armload of soiled clothing to the washerwomen, and brought up a bowl of crisp autumn pears from the kitchen. When she was done with the bedchamber, she went down half a flight of stairs to do the same in the great solar, a spare drafty room as large as the halls of many a smaller castle."
}