{
  "id": "62c8898346c3eefbe3a891dbc65ef2f8efa3538a",
  "text": " Her father had been slain before she was born, and her splendid brother Rhaegar as well. Her mother had died bringing her into the world while the storm screamed outside. Gentle Ser Willem Darry, who must have loved her after a fashion, had been taken by a wasting sickness when she was very young. Her brother Viserys, Khal Drogo who was her sun-and-stars, even her unborn son, the gods had claimed them all. They will not have my dragons, Dany vowed. They will not.  The dragons were no larger than the scrawny cats she had once seen skulking along the walls of Magister Illyrio’s estate in Pentos… until they unfolded their wings. Their span was three times their length, each wing a delicate fan of translucent skin, gorgeously colored, stretched taut between long thin bones. When you looked hard, you could see that most of their body was neck, tail, and wing. Such little things, she thought as she fed them by hand. or rather, tried to feed them, for the dragons would not eat. They would hiss and spit at each bloody morsel of horsemeat, steam rising from their nostrils, yet they would not take the food… until Dany recalled something Viserys had told her when they were children.  Only dragons and men eat cooked meat, he had said.  When she had her handmaids char the horsemeat black, the dragons ripped at it eagerly, their heads striking like snakes. So long as the meat was seared, they gulped down several times their own weight every day, and at last began to grow larger and stronger. Dany marveled at the smoothness of their scales, and the heat that poured off them, so palpable that on cold nights their whole bodies seemed to steam.  Each evenfall as the khalasar set out, she would choose a dragon to ride upon her shoulder. Irri and Jhiqui carried the others in a cage of woven wood slung between their mounts, and rode close behind her, so Dany was never out of their sight. It was the only way to keep them quiescent.   Aegon’s dragons were named for the gods of Old Valyria,  she told her bloodriders one morning after a long night’s journey.  Visenya’s dragon was Vhagar, Rhaenys had Meraxes, and Aegon rode Balerion, the Black Dread. It was said that Vhagar’s breath was so hot that it could melt a knight’s armor and cook the man inside, that Meraxes swallowed horses whole, and Balerion… his fire was as black as his scales, his wings so vast that whole towns were swallowed up in their shadow when he passed overhead.   The Dothraki looked at her hatchlings uneasily. The largest of her three was shiny black, his scales slashed with streaks of vivid scarlet to match his wings and horns.  Khaleesi,  Aggo murmured,  there sits Balerion, come again.    It may be as you say, blood of my blood,  Dany replied gravely,  but he shall have a new name for this new life. I would name them all for those the gods have taken. The green one shall be Rhaegal, for my valiant brother who died on the green banks of the Trident. The cream-and-gold I call Viserion. Viserys was cruel and weak and frightened, yet he was my brother still. His dragon will do what he could not.    And the black beast?  asked Ser Jorah Mormont.   The black,  she said,  is Drogon.   Yet even as her dragons prospered, her khalasar withered and died. Around them the land turned ever more desolate. Even devilgrass grew scant; horses dropped in their tracks, leaving so few that some of her people must trudge along on foot. Doreah took a fever and grew worse with every league they crossed. Her lips and hands broke with blood blisters, her hair came out in clumps, and one evenfall she lacked the strength to mount her horse. Jhogo said they must leave her or bind her to her saddle, but Dany remembered a night on the Dothraki sea, when the Lysene girl had taught her secrets so that Drogo might love her more. She gave Doreah water from her own skin, cooled her brow with a damp cloth, and held her hand until she died, shivering. Only then would she permit the khalasar to press on.  They saw no sign of other travelers. The Dothraki began to mutter fearfully that the comet had led them to some hell. Dany went to Ser Jorah one morning as they made camp amidst a jumble of black windscoured stones.  Are we lost?  she asked him.  Does this waste have no end to it?    It has an end,  he answered wearily.  I have seen the maps the traders draw, my queen. Few caravans come this way, that is so, yet there are great kingdoms to the east, and cities full of wonders. Yi Ti, Qarth, Asshai by the Shadow…    Will we live to see them?    I will not lie to you. The way is harder than I dared think.  The knight’s face was grey and exhausted. The wound he had taken to his hip the night he fought Khal Drogo’s bloodriders had never fully healed; she could see how he grimaced when he mounted his horse, and he seemed to slump in his saddle as they rode.  Perhaps we are doomed if we press on… but I know for a certainty that we are doomed if we turn back.   Dany kissed him lightly on the cheek. It heartened her to see him smile."
}