{
  "id": "63196fafd85158daf4ec9cc4cd34c133d9b82335",
  "text": "  Petyr snorted.  I would have told him the same thing for half a cup.   Finally, on a grey windy afternoon, Bryen came running back to the tower with his dogs barking at his heels, to announce that riders were approaching from the southwest.  Lysa,  Lord Petyr said.  Come, Alayne, let us greet her.   They put on their cloaks and waited outside. The riders numbered no more than a score; a very modest escort, for the Lady of the Eyrie. Three maids rode with her, and a dozen household knights in mail and plate. She brought a septon as well, and a handsome singer with a wisp of a mustache and long sandy curls.  Could that be my aunt? Lady Lysa was two years younger than Mother, but this woman looked ten years older. Thick auburn tresses fell down past her waist, but beneath the costly velvet gown and jeweled bodice her body sagged and bulged. Her face was pink and painted, her breasts heavy, her limbs thick. She was taller than Littlefinger, and heavier; nor did she show any grace in the clumsy way she climbed down off her horse.  Petyr knelt to kiss her fingers.  The king’s small council commanded me to woo and win you, my lady. Do you think you might have me for your lord and husband?   Lady Lysa pooched her lips and pulled him up to plant a kiss upon his cheek.  Oh, mayhaps I could be persuaded.  She giggled.  Have you brought gifts to melt my heart?    The king’s peace.    Oh, poo to the peace, what else have you brought me?    My daughter.  Littlefinger beckoned Sansa forward with a hand.  My lady, allow me to present you Alayne Stone.   Lysa Arryn did not seem greatly pleased to see her. Sansa did a deep curtsy, her head bowed.  A bastard?  she heard her aunt say.  Petyr, have you been wicked? Who was her mother?    The wench is dead. I’d hoped to take Alayne to the Eyrie.    What am I to do with her there?    I have a few notions,  said Lord Petyr.  But just now I am more interested in what I might do with you, my lady.   All the sternness melted off her aunt’s round pink face, and for a moment Sansa thought Lysa Arryn was about to cry.  Sweet Petyr, I’ve missed you so, you don’t know, you can’t know. Yohn Royce has been stirring up all sorts of trouble, demanding that I call my banners and go to war. And the others all swarm around me, Hunter and Corbray and that dreadful Nestor Royce, all wanting to wed me and take my son to ward, but none of them truly love me. Only you, Petyr. I’ve dreamed of you so long.    And I of you, my lady.  He slid an arm around behind her and kissed her on the neck.  How soon can we be wed?    Now,  said Lady Lysa, sighing.  I’ve brought my own septon, and a singer, and mead for the wedding feast.    Here?  That did not please him.  I’d sooner wed you at the Eyrie, with your whole court in attendance.    Poo to my court. I have waited so long, I could not bear to wait another moment.  She put her arms around him.  I want to share your bed tonight, my sweet. I want us to make another child, a brother for Robert or a sweet little daughter.    I dream of that as well, sweetling. Yet there is much to be gained from a great public wedding, with all the Vale—    No.  She stamped a foot.  I want you now, this very night. And I must warn you, after all these years of silence and whisperings, I mean to scream when you love me. I am going to scream so loud they’ll hear me in the Eyrie!    Perhaps I could bed you now, and wed you later?   The Lady Lysa giggled like a girl.  Oh, Petyr Baelish, you are so wicked. No, I say no, I am the Lady of the Eyrie, and I command you to wed me this very moment!   Petyr gave a shrug.  As my lady commands, then. I am helpless before you, as ever.   They said their vows within the hour, standing beneath a sky-blue canopy as the sun sank in the west. Afterward trestle tables were set up beneath the small flint tower, and they feasted on quail, venison, and roast boar, washing it down with a fine light mead. Torches were lit as dusk crept in. Lysa’s singer played  The Vow Unspoken  and  Seasons of My Love  and  Two Hearts That Beat as One.  Several younger knights even asked Sansa to dance. Her aunt danced as well, her skirts whirling when Petyr spun her in his arms. Mead and marriage had taken years off Lady Lysa. She laughed at everything so long as she held her husband’s hand, and her eyes seemed to glow whenever she looked at him.  When it was time for the bedding, her knights carried her up to the tower, stripping her as they went and shouting bawdy jests. Tyrion spared me that, Sansa remembered. It would not have been so bad being undressed for a man she loved, by friends who loved them both. By Joffrey, though… she shuddered.  Her aunt had brought only three ladies with her, so they pressed Sansa to help them undress Lord Petyr and march him up to his marriage bed. He submitted with good grace and a wicked tongue, giving as good as he got. By the time they had gotten him into the tower and out of his clothes, the other women were flushed, with laces unlaced, kirtles crooked, and skirts in disarray."
}