{
  "id": "63bfb573efb590a775b07815aa440f7936a3c2a1",
  "text": " If his antics during Care of Magical Creatures lessons are any guide, however, Frid-wulfa's son appears to have inherited her brutal nature. In a bizarre twist, Hagrid is reputed to have developed a close friendship with the boy who brought around You-Know-Who's fall from power - thereby driving Hagrid's own mother, like the rest of You-Know-Who's supporters, into hiding. Perhaps Harry Potter is unaware of the unpleasant truth about his large friend - but Albus Dumbledore surely has a duty to ensure that Harry Potter, along with his fellow students, is warned about the dangers of associating with part-giants.  Harry finished reading and looked up at Ron, whose mouth was hanging open. \"How did she find out?\" he whispered. But that wasn't what was bothering Harry. \"What d'you mean, 'we all hate Hagrid'?\"  Harry spat at Malfoy.  \"What's this rubbish about him\" - he pointed at Crabbe - \"getting a bad bite off a flobberworm?  They haven't even got teeth!\" Crabbe was sniggering, apparently very pleased with himself. \"Well, I think this should put an end to the oaf's teaching career,\" said Malfoy, his eyes glinting. \"Half-giant. . . and there was me thinking he'd just swallowed a bottle of Skele-Gro when he was young. ... None of the mummies and daddies are going to like this at all. ... They'll be worried he'll eat their kids, ha, ha. ...\" \"You-\" \"Are you paying attention over there?\" Professor Grubbly-Planks voice carried over to the boys; the girls were all clustered around the unicorn now, stroking it.  Harry was so angry that the Daily Prophet article shook in his hands as he turned to stare unseeingly at the unicorn, whose many magical properties Professor Grubbly-Plank was now enumerating in a loud voice, so that the boys could hear too. \"I hope she stays, that woman!\" said Parvati Patil when the lesson had ended and they were all heading back to the castle for lunch. \"That's more what I thought Care of Magical Creatures would be like . . . proper creatures like unicorns, not monsters. . . .\" \"What about Hagrid?\" Harry said angrily as they went up the steps. \"What about him?\" said Parvati in a hard voice. \"He can still be gamekeeper, can't he?\" Parvati had been very cool toward Harry since the ball.  He supposed that he ought to have paid her a bit more attention, but she seemed to have had a good time all the same.  She was certainly telling anybody who would listen that she had made arrangements to meet the boy from Beauxbatons in Hogsmeade on the next weekend trip. \"That was a really good lesson,\" said Hermione as they entered the Great Hall.  \"I didn't know half the things Professor Grubbly-Plank told us about uni -\" \"Look at this!\"  Harry snarled, and he shoved the Daily Prophet article under Hermione's nose. Hermione's mouth fell open as she read.  Her reaction was exactly the same as Ron's. \"How did that horrible Skeeter woman find out? You don't think Hagrid told her?\" \"No,\" said Harry, leading the way over to the Gryffindor table and throwing himself into a chair, furious.  \"He never even told us, did he?  I reckon she was so mad he wouldn't give her loads of horrible stuff about me, she went ferreting around to get him back.\" \"Maybe she heard him telling Madame Maxime at the ball,\" said Hermione quietly. \"We'd have seen her in the garden!\" said Ron. \"Anyway, she's not supposed to come into school anymore, Hagrid said Dumbledore banned her. . . .\" \"Maybe she's got an Invisibility Cloak,\" said Harry, ladling chicken casserole onto his plate and splashing it everywhere in his anger.  \"Sort of thing she'd do, isn't it, hide in bushes listening to people.\" \"Like you and Ron did, you mean,\" said Hermione.   \"We weren't trying to hear him!\" said Ron indignantly.  \"We didn't have any choice!  The stupid prat, talking about his giantess mother where anyone could have heard him!\" \"We've got to go and see him,\" said Harry. \"This evening, after Divination. Tell him we want him back . . . you do want him back?\" he shot at Hermione. \"I - well, I'm not going to pretend it didn't make a nice change, having a proper Care of Magical Creatures lesson for once - but I do want Hagrid back, of course I do!\"  Hermione added hastily, quailing under Harry's furious stare. So that evening after dinner, the three of them left the castle once more and went down through the frozen grounds to Hagrid's cabin.  They knocked, and Fang's booming barks answered. \"Hagrid, it's us!\" Harry shouted, pounding on the door. \"Open up!\" Hagrid didn't answer.  They could hear Fang scratching at the door, whining, but it didn't open.  They hammered on it for ten more minutes; Ron even went and banged on one of the windows, but there was no response. \"What's he avoiding us for?\"  Hermione said when they had finally given up and were walking back to the school.  \"He surely doesn't think we'd care about him being half-giant?\" But it seemed that Hagrid did care.  They didn't see a sign of him all week.  He didn't appear at the staff table at mealtimes, they didn't see him going about his gamekeeper duties on the grounds, and Professor Grubbly-Plank continued to take the Care of Magical Creatures classes."
}