{
  "id": "64416f23fc5fd8df075d88d316c40fb1a0db137e",
  "text": "  \"I wonder who'll be teaching us?\" said Hermione as they edged into the chattering crowd. \"Someone told me Flitwick was a dueling champion when he was young - maybe it'll be him.\"  \"As long as it's not -\" Harry began, but he ended on a groan: Gilderoy Lockhart was walking onto the stage, resplendent in robes of deep plum and accompanied by none other than Snape, wearing his usual black.  Lockhart waved an arm for silence and called ' \"Gather round, gather round! Can everyone see me? Can you all hear me? Excellent!  \"Now, Professor Dumbledore has granted me permission to start this little dueling club, to train you all in case you ever need to defend yourselves as I myself have done on countless occasions - for full details, see my published works.  \"Let me introduce my assistant, Professor Snape,\" said Lockhart, flashing a wide smile. \"He tells me he knows a tiny little bit about dueling himself and has sportingly agreed to help me with a short demonstration before we begin. Now, I don't want any of you youngsters to worry - you'll still have your Potions master when I'm through with him, never fear!\"  \"Wouldn't it be good if they finished each other off?\" Ron muttered in Harry's ear.  Snape's upper lip was curling. Harry wondered why Lockhart  *189*  was still smiling; if Snape had been looking at him like that he'd have been running as fast as he could in the opposite direction.  Lockhart and Snape turned to face each other and bowed; at least, Lockhart did, with much twirling of his hands, whereas Snape jerked his head irritably. Then they raised their wands like swords in front of them.  \"As you see, we are holding our wands in the accepted combative position,\" Lockhart told the silent crowd. \"On the count of three, we will cast our first spells. Neither of us will be aiming to kill, of course.\"  \"I wouldn't bet on that,\" Harry murmured, watching Snape baring his teeth.  \"One - two - three -\"  Both of them swung their wands above their heads and pointed them at their opponent; Snape cried: \"Expelliarmus!\" There was a dazzling flash of scarlet light and Lockhart was blasted off his feet: He flew backward off the stage, smashed into the wall, and slid down it to sprawl on the floor.  Malfoy and some of the other Slytherins cheered. Hermione was dancing on tiptoes. \"Do you think he's all right?\" she squealed through her fingers.  \"Who cares?\" said Harry and Ron together.  Lockhart was getting unsteadily to his feet. His hat had fallen off and his wavy hair was standing on end.  \"Well, there you have it!\" he said, tottering back onto the platform. \"That was a Disarming Charm - as you see, I've lost my wand - ah, thank you, Miss Brown - yes, an excellent idea to show them that, Professor Snape, but if you don't mind my saying  *190*  so, it was very obvious what you were about to do. If I had wanted to stop you it would have been only too easy - however, I felt it would be instructive to let them see . . .\"  Snape was looking murderous. Possibly Lockhart had noticed, because he said, \"Enough demonstrating! I'm going to come amongst you now and put you all into pairs. Professor Snape, if you'd like to help me -\"  They moved through the crowd, matching up partners. Lockhart teamed Neville with Justin Finch-Fletchley, but Snape reached Harry and Ron first.  \"Time to split up the dream team, I think,\" he sneered. \"Weasley, you can partner Finnigan. Potter -\"  Harry moved automatically toward Hermione.  \"I don't think so,\" said Snape, smiling coldly. \"Mr. Malfoy, come over here. Let's see what you make of the famous Potter. And you, Miss Granger - you can partner Miss Bulstrode.\"  Malfoy strutted over, smirking. Behind him walked a Slytherin girl who reminded Harry of a picture he'd seen in Holidays with Hags. She was large and square and her heavy jaw jutted aggressively. Hermione gave her a weak smile that she did not return.  \"Face your partners!\" called Lockhart, back on the platform. \"And bow!\"  Harry and Malfoy barely inclined their heads, not taking their eyes off each other.  \"Wands at the ready!\" shouted Lockhart. \"When I count to three, cast your charms to disarm your opponents - only to disarm them - we don't want any accidents - one ... two ... three -\"  *191*  Harry swung his wand high, but Malfoy had already started on \"two\": His spell hit Harry so hard he felt as though he'd been hit over the head with a saucepan. He stumbled, but everything still seemed to be working, and wasting no more time, Harry pointed his wand straight at Malfoy and shouted, \"Rictusempra!\"  A jet of silver light hit Malfoy in the stomach and he doubled up, wheezing.  \"I said disarm only!\" Lockhart shouted in alarm over the heads of the battling crowd, as Malfoy sank to his knees; Harry had hit him with a Tickling Charm, and he could barely move for laughing. Harry hung back, with a vague feeling it would be unsporting to bewitch Malfoy while he was on the floor, but this was a mistake; gasping for breath, Malfoy pointed his wand at Harry's knees, choked, \"Tarantallegra!\" and the next second Harry's legs began to jerk around out of his control in a kind of quickstep."
}