{
  "id": "6577d452af813c5abf4b09efdf587d9309950638",
  "text": "  When he kept very still, his leg did not hurt so much, so he did his best to lie unmoving. For how long he could not say. There was no sun and no moon. He could not see to mark the walls. Ned closed his eyes and opened them; it made no difference. He slept and woke and slept again. He did not know which was more painful, the waking or the sleeping. When he slept, he dreamed: dark disturbing dreams of blood and broken promises. When he woke, there was nothing to do but think, and his waking thoughts were worse than nightmares. The thought of Cat was as painful as a bed of nettles. He wondered where she was, what she was doing. He wondered whether he would ever see her again.  Hours turned to days, or so it seemed. He could feel a dull ache in his shattered leg, an itch beneath the plaster. When he touched his thigh, the flesh was hot to his fingers. The only sound was his breathing. After a time, he began to talk aloud, just to hear a voice. He made plans to keep himself sane, built castles of hope in the dark. Robert’s brothers were out in the world, raising armies at Dragonstone and Storm’s End. Alyn and Harwin would return to King’s Landing with the rest of his household guard once they had dealt with Ser Gregor. Catelyn would raise the north when the word reached her, and the lords of river and mountain and Vale would join her.  He found himself thinking of Robert more and more. He saw the king as he had been in the flower of his youth, tall and handsome, his great antlered helm on his head, his warhammer in hand, sitting his horse like a horned god. He heard his laughter in the dark, saw his eyes, blue and clear as mountain lakes.  Look at us, Ned,  Robert said.  Gods, how did we come to this? You here, and me killed by a pig. We won a throne together…   I failed you, Robert, Ned thought. He could not say the words. I lied to you, hid the truth. I let them kill you.  The king heard him.  You stiff-necked fool,  he muttered,  too proud to listen. Can you eat pride, Stark? Will honor shield your children?  Cracks ran down his face, fissures opening in the flesh, and he reached up and ripped the mask away. It was not Robert at all; it was Littlefinger, grinning, mocking him. When he opened his mouth to speak, his lies turned to pale grey moths and took wing.  Ned was half-asleep when the footsteps came down the hall. At first he thought he dreamt them; it had been so long since he had heard anything but the sound of his own voice. Ned was feverish by then, his leg a dull agony, his lips parched and cracked. When the heavy wooden door creaked open, the sudden light was painful to his eyes.  A gaoler thrust a jug at him. The clay was cool and beaded with moisture. Ned grasped it with both hands and gulped eagerly. Water ran from his mouth and dripped down through his beard. He drank until he thought he would be sick.  How long…?  he asked weakly when he could drink no more.  The gaoler was a scarecrow of a man with a rat’s face and frayed beard, clad in a mail shirt and a leather half cape.  No talking,  he said as he wrenched the jug from Ned’s hands.   Please,  Ned said,  my daughters…  The door crashed shut. He blinked as the light vanished, lowered his head to his chest, and curled up on the straw. It no longer stank of urine and shit. It no longer smelled at all.  He could no longer tell the difference between waking and sleeping. The memory came creeping upon him in the darkness, as vivid as a dream. It was the year of false spring, and he was eighteen again, down from the Eyrie to the tourney at Harrenhal. He could see the deep green of the grass, and smell the pollen on the wind. Warm days and cool nights and the sweet taste of wine. He remembered Brandon’s laughter, and Robert’s berserk valor in the melee, the way he laughed as he unhorsed men left and right. He remembered Jaime Lannister, a golden youth in scaled white armor, kneeling on the grass in front of the king’s pavilion and making his vows to protect and defend King Aerys. Afterward, Ser Oswell Whent helped Jaime to his feet, and the White Bull himself, Lord Commander Ser Gerold Hightower, fastened the snowy cloak of the Kingsguard about his shoulders. All six White Swords were there to welcome their newest brother.  Yet when the jousting began, the day belonged to Rhaegar Targaryen. The crown prince wore the armor he would die in: gleaming black plate with the three-headed dragon of his House wrought in rubies on the breast. A plume of scarlet silk streamed behind him when he rode, and it seemed no lance could touch him. Brandon fell to him, and Bronze Yohn Royce, and even the splendid Ser Arthur Dayne, the Sword of the Morning.  Robert had been jesting with Jon and old Lord Hunter as the prince circled the field after unhorsing Ser Barristan in the final tilt to claim the champion’s crown. Ned remembered the moment when all the smiles died, when Prince Rhaegar Targaryen urged his horse past his own wife, the Dornish princess Elia Martell, to lay the queen of beauty’s laurel in Lyanna’s lap."
}