{
  "id": "66cb38e1f3af8195dc3e0dce39128d7069fa3e8c",
  "text": " Lord Tywin, why didn’t I say Lord Tywin?  Perhaps it was not too late to change her mind. Weese was not killed yet. If she could find Jaqen, tell him…  Hurriedly, Arya ran down the twisting steps, her chores forgotten. She heard the rattle of chains as the portcullis was slowly lowered, its spikes sinking deep into the ground… and then another sound, a shriek of pain and fear.  A dozen people got there before her, though none was coming any too close. Arya squirmed between them. Weese was sprawled across the cobbles, his throat a red ruin, eyes gaping sightlessly up at a bank of grey cloud. His ugly spotted dog stood on his chest, lapping at the blood pulsing from his neck, and every so often ripping a mouthful of flesh out of the dead man’s face.  Finally someone brought a crossbow and shot the spotted dog dead while she was worrying at one of Weese’s ears.   Damnedest thing,  she heard a man say.  He had that bitch dog since she was a pup.    This place is cursed,  the man with the crossbow said.   It’s Harren’s ghost, that’s what it is,  said Goodwife Amabel.  I’ll not sleep here another night, I swear it.   Arya lifted her gaze from the dead man and his dead dog. Jaqen H’ghar was leaning up against the side of the Wailing Tower. When he saw her looking, he lifted a hand to his face and laid two fingers casually against his cheek.      CATELYN  Two days ride from Riverrun, a scout spied them watering their horses beside a muddy steam. Catelyn had never been so glad to see the twin tower badge of House Frey.  When she asked him to lead them to her uncle, he said,  The Blackfish is gone west with the king, my lady. Martyn Rivers commands the outriders in his stead.    I see.  She had met Rivers at the Twins; a baseborn son of Lord Walder Frey, half brother to Ser Perwyn. It did not surprise her to learn that Robb had struck at the heart of Lannister power; clearly he had been contemplating just that when he sent her away to treat with Renly.  Where is Rivers now?    His camp is two hours ride, my lady.    Take us to him,  she commanded. Brienne helped her back into her saddle, and they set out at once.   Have you come from Bitterbridge, my lady?  the scout asked.   No.  She had not dared. With Renly dead, Catelyn had been uncertain of the reception she might receive from his young widow and her protectors. Instead she had ridden through the heart of the war, through fertile riverlands turned to blackened desert by the fury of the Lannisters, and each night her scouts brought back tales that made her ill.  Lord Renly is slain,  she added.   We’d hoped that tale was some Lannister lie, or—    Would that it were. My brother commands in Riverrun?    Yes, my lady. His Grace left Ser Edmure to hold Riverrun and guard his rear.   Gods grant him the strength to do so, Catelyn thought. And the wisdom as well.  Is there word from Robb in the west?    You have not heard?  The man seemed surprised.  His Grace won a great victory at Oxcross. Ser Stafford Lannister is dead, his host scattered.   Ser Wendel Manderly gave a whoop of pleasure, but Catelyn only nodded. Tomorrow’s trials concerned her more than yesterday’s triumphs.  Martyn Rivers had made his camp in the shell of a shattered holdfast, beside a roofless stable and a hundred fresh graves. He went to one knee when Catelyn dismounted.  Well met, my lady. Your brother charged us to keep an eye out for your party, and escort you back to Riverrun in all haste should we come upon you.   Catelyn scarce liked the sound of that.  Is it my father?    No, my lady. Lord Hoster is unchanged.  Rivers was a ruddy man with scant resemblance to his half brothers.  It is only that we feared you might chance upon Lannister scouts. Lord Tywin has left Harrenhal and marches west with all his power.    Rise,  she told Rivers, frowning. Stannis Baratheon would soon be on the march as well, gods help them all.  How long until Lord Tywin is upon us?    Three days, perhaps four, it is hard to know. We have eyes out along all the roads, but it would be best not to linger.   Nor did they. Rivers broke his camp quickly and saddled up beside her, and they set off again, near fifty strong now, flying beneath the direwolf, the leaping trout, the twin towers.  Her men wanted to hear more of Robb’s victory at Oxcross, and Rivers obliged.  There’s a singer come to Riverrun, calls himself Rymund the Rhymer, he’s made a song of the fight. Doubtless you’ll hear it sung tonight, my lady. ‘Wolf in the Night’ this Rymund calls it.  He went on to tell how the remnants of Ser Stafford’s host had fallen back on Lannisport. Without siege engines there was no way to storm Casterly Rock, so the Young Wolf was paying the Lannisters back in kind for the devastation they’d inflicted on the riverlands. Lords Karstark and Glover were raiding along the coast, Lady Mormont had captured thousands of cattle and was driving them back toward Riverrun, while the Greatjon had seized the gold mines at Castamere, Nunn’s Deep, and the Pendric Hills."
}