{
  "id": "67dc10664f0f9e73801a129bf86d15ad903b2506",
  "text": "  His black eyes were alight with malice.  \"Don't go blaming Dumbledore for Potter's determination to break rules.  He has been crossing lines ever since he arrived here -\"  \"Thank you, Severus,\" said Dumbledore firmly, and Snape went quiet, though his eyes still glinted malevolently through his curtain of greasy black hair. Professor Dumbledore was now looking down at Harry, who looked right back at him, trying to discern the expression of the eyes behind the half-moon spectacles. \"Did you put your name into the Goblet of Fire, Harry?\"  he asked calmly. \"No,\" said Harry.  He was very aware of everybody watching him closely.  Snape made a soft noise of impatient disbelief in the shadows. \"Did you ask an older student to put it into the Goblet of Fire for you?\" said Professor Dumbledore, ignoring Snape. \"No,\" said Harry vehemently. \"Ah, but of course 'e is lying!\"  cried Madame Maxime.  Snape was now shaking his head, his lip curling. \"He could not have crossed the Age Line,\" said Professor McGonagall sharply.  \"I am sure we are all agreed on that -\" \"Dumbly-dorr must 'ave made a mistake wiz ze line,\" said Madame Maxime, shrugging. \"It is possible, of course,\" said Dumbledore politely. \"Dumbledore, you know perfectly well you did not make a mistake!\" said Professor McGonagall angrily.  \"Really, what nonsense!  Harry could not have crossed the line himself, and as Professor Dumbledore believes that he did not persuade an older student to do it for him, I'm sure that should be good enough for everybody else!\" She shot a very angry look at Professor Snape. \"Mr. Crouch.. . Mr. Bagman,\" said Karkaroff, his voice unctuous once more, \"you are our - er - objective judges.  Surely you will agree that this is most irregular?\" Bagman wiped his round, boyish face with his handkerchief and looked at Mr. Crouch, who was standing outside the circle of the firelight, his face half hidden in shadow.  He looked slightly eerie, the half darkness making him look much older, giving him an almost skull-like appearance.  When he spoke, however, it was in his usual curt voice. \"We must follow the rules, and the rules state clearly that those people whose names come out of the Goblet of Fire are bound to compete in the tournament.\" \"Well, Barty knows the rule book back to front,\" said Bagman, beaming and turning back to Karkaroff and Madame Maxime, as though the matter was now closed. \"I insist upon resubmitting the names of the rest of my students,\" said Karkaroff. He had dropped his unctuous tone and his smile now.  His face wore a very ugly look indeed.  \"You will set up the Goblet of Fire once more, and we will continue adding names until each school has two champions.  It's only fair, Dumbledore.\" \"But Karkaroff, it doesn't work like that,\" said Bagman.  \"The Goblet of Fire's just gone out - it won't reignite until the start of the next tournament -\" \"- in which Durmstrang will most certainly not be competing!\" exploded Karkaroff. \"After all our meetings and negotiations and compromises, I little expected something of this nature to occur!  I have half a mind to leave now!\" \"Empty threat, Karkaroff,\" growled a voice from near the door.  \"You can't leave your champion now.  He's got to compete.  They've all got to compete.  Binding magical contract, like Dumbledore said.  Convenient, eh?\" Moody had just entered the room.  He limped toward the fire, and with every right step he took, there was a loud clunk. \"Convenient?\" said Karkaroff.  \"I'm afraid I don't understand you, Moody.\" Harry could tell he was trying to sound disdainful, as though what Moody was saying was barely worth his notice, but his hands gave him away; they had balled themselves into fists. \"Don't you?\" said Moody quietly. \"It's very simple, Karkaroff. Someone put Potter's name in that goblet knowing he'd have to compete if it came out.\" \"Evidently, someone 'oo wished to give 'Ogwarts two bites at ze apple!\" said Madame Maxime. \"I quite agree, Madame Maxime,\" said Karkaroff, bowing to her. \"I shall be lodging complaints with the Ministry of Magic and the International Confederation of Wizards -\" \"If anyone's got reason to complain, it's Potter,\" growled Moody, \"but. . . funny thing. . . I don't hear him saying a word. . . \"Why should 'e complain?\" burst out Fleur Delacour, stamping her foot. \"E 'as ze chance to compete, 'asn't 'e? We 'ave all been 'oping to be chosen for weeks and weeks!  Ze honor for our schools!  A thousand Galleons in prize money - zis is a chance many would die for!\" \"Maybe someone's hoping Potter is going to die for it,\" said Moody, with the merest trace of a growl. An extremely tense silence followed these words. Ludo Bagman, who was looking very anxious indeed, bounced nervously up and down on his feet and said, \"Moody, old man. . . what a thing to say!\" \"We all know Professor Moody considers the morning wasted if he hasn't discovered six plots to murder him before lunchtime,\" said Karkaroff loudly.  \"Apparently he is now teaching his students to fear assassination too."
}