{
  "id": "684394fe5849a6b2d917d23f2b8c5cdcb3ef2d4b",
  "text": "  He looked at the stump and felt sick all over again. There’s no place like that beneath the Rock, he thought. His stomach was sour and empty, and his head was pounding where he’d pillowed it against the stump.  Qyburn felt his brow.  You still have a touch of fever.    A fever dream.  Jaime reached up.  Help me.  Steelshanks took him by his good hand and pulled him to his feet.   Another cup of dreamwine?  asked Qyburn.   No. I’ve dreamt enough this night.  He wondered how long it was till dawn. Somehow he knew that if he closed his eyes, he would be back in that dark wet place again.   Milk of the poppy, then? And something for your fever? You are still weak, my lord. You need to sleep. To rest.   That is the last thing I mean to do. The moonlight glimmered pale upon the stump where Jaime had rested his head. The moss covered it so thickly he had not noticed before, but now he saw that the wood was white. It made him think of Winterfell, and Ned Stark’s heart tree. It was not him, he thought. It was never him. But the stump was dead and so was Stark and so were all the others, Prince Rhaegar and Ser Arthur and the children. And Aerys. Aerys is most dead of all.  Do you believe in ghosts, Maester?  he asked Qyburn.  The man’s face grew strange.  Once, at the Citadel, I came into an empty room and saw an empty chair. Yet I knew a woman had been there, only a moment before. The cushion was dented where she’d sat, the cloth was still warm, and her scent lingered in the air. If we leave our smells behind us when we leave a room, surely something of our souls must remain when we leave this life?  Qyburn spread his hands.  The archmaesters did not like my thinking, though. Well, Marwyn did, but he was the only one.   Jaime ran his fingers through his hair.  Walton,  he said,  saddle the horses. I want to go back.    Back?  Steelshanks regarded him dubiously.  He thinks I’ve gone mad. And perhaps I have.  I left something at Harrenhal.    Lord Vargo holds it now. Him and his Bloody Mummers.    You have twice the men he does.    If I don’t serve you up to your father as commanded, Lord Bolton will have my hide. We press on to King’s Landing.   Once Jaime might have countered with a smile and a threat, but onehanded cripples do not inspire much fear. He wondered what his brother would do. Tyrion would find a way.  Lannisters lie, Steelshanks. Didn’t Lord Bolton tell you that?   The man frowned suspiciously.  What if he did?    Unless you take me back to Harrenhal, the song I sing my father may not be one the Lord of the Dreadfort would wish to hear. I might even say it was Bolton ordered my hand cut off, and Steelshanks Walton who swung the blade.   Walton gaped at him.  That isn’t so.    No, but who will my father believe?  Jaime made himself smile, the way he used to smile when nothing in the world could frighten him.  It will be so much easier if we just go back. We’d be on our way again soon enough, and I’d sing such a sweet song in King’s Landing you’ll never believe your ears. You’d get the girl, and a nice fat purse of gold as thanks.    Gold?  Walton liked that well enough.  How much gold?   I have him.  Why, how much would you want?   And by the time the sun came up, they were halfway back to Harrenhal.  Jaime pushed his horse much harder than he had the day before, and Steelshanks and the northmen were forced to match his pace. Even so, it was midday before they reached the castle on the lake. Beneath a darkening sky that threatened rain, the immense walls and five great towers stood black and ominous. It looks so dead. The walls were empty, the gates closed and barred. But high above the barbican, a single banner hung limp. The black goat of Qohor, he knew. Jaime cupped his hands to shout.  You in there! Open your gates, or I’ll kick them down!   It was not until Qyburn and Steelshanks added their voices that a head finally appeared on the battlements above them. He goggled down at them, then vanished. A short time later, they heard the portcullis being drawn upward. The gates swung open, and Jaime Lannister spurred his horse through the walls, scarcely glancing at the murder holes as he passed beneath them. He had been worried that the goat might not admit them, but it seemed as if the Brave Companions still thought of them as allies. Fools.  The outer ward was deserted; only the long slate-roofed stables showed any signs of life, and it was not horses that interested Jaime just then. He reined up and looked about. He could hear sounds from somewhere behind the Tower of Ghosts, and men shouting in half a dozen tongues. Steelshanks and Qyburn rode up on either side.  Get what you came back for, and we’ll be gone again,  said Walton.  I want no trouble with the Mummers.    Tell your men to keep their hands on their sword hilts, and the Mummers will want no trouble with you. Two to one, remember?  Jaime’s head jerked round at the sound of a distant roar, faint but ferocious. It echoed off the walls of Harrenhal, and the laughter swelled up like the sea."
}