{
  "id": "6d30e8bfb80cdefc69679a6076d0c64f09da9f3f",
  "text": " Whores did have charms, especially if you had a face like Petyr’s. The poor lad had a wife, to be sure, but she was half the problem. Not only was she twice his age, but she was bedding his brother Walder too, if the talk was true. There was always lots of talk around the Twins, and only a little was ever true, but in this case Merrett believed it. Black Walder was a man who took what he wanted, even his brother’s wife. He’d had Edwyn’s wife too, that was common knowledge, Fair Walda had been known to slip into his bed from time to time, and some even said he’d known the seventh Lady Frey a deal better than he should have. Small wonder he refused to marry. Why buy a cow when there were udders all around begging to be milked?  Cursing under his breath, Merrett jammed his heels into his horse’s flanks and rode on up the hill. As tempting as it was to drink the gold away, he knew that if he didn’t come back with Petyr Pimple, he had as well not come back at all.  Lord Walder would soon turn two-and-ninety. His ears had started to go, his eyes were almost gone, and his gout was so bad that he had to be carried everywhere. He could not possibly last much longer, all his sons agreed. And when he goes, everything will change, and not for the better. His father was querulous and stubborn, with an iron will and a wasp’s tongue, but he did believe in taking care of his own. All of his own, even the ones who had displeased and disappointed him. Even the ones whose names he can’t remember. Once he was gone, though…  When Ser Stevron had been heir, that was one thing. The old man had been grooming Stevron for sixty years, and had pounded it into his head that blood was blood. But Stevron had died whilst campaigning with the Young Wolf in the west— of waiting, no doubt,  Lame Lothar had quipped when the raven brought them the news—and his sons and grandsons were a different sort of Frey. Stevron’s son Ser Ryman stood to inherit now; a thick-witted, stubborn, greedy man. And after Ryman came his own sons, Edwyn and Black Walder, who were even worse.  Fortunately,  Lame Lothar once said,  they hate each other even more than they hate us.   Merrett wasn’t certain that was fortunate at all, and for that matter Lothar himself might be more dangerous than either of them. Lord Walder had ordered the slaughter of the Starks at Roslin’s wedding, but it had been Lame Lothar who had plotted it out with Roose Bolton, all the way down to which songs would be played. Lothar was a very amusing fellow to get drunk with, but Merrett would never be so foolish as to turn his back on him. In the Twins, you learned early that only full blood siblings could be trusted, and them not very far.  It was like to be every son for himself when the old man died, and every daughter as well. The new Lord of the Crossing would doubtless keep on some of his uncles, nephews, and cousins at the Twins, the ones he happened to like or trust, or more likely the ones he thought would prove useful to him. The rest of us he’ll shove out to fend for ourselves.  The prospect worried Merrett more than words could say. He would be forty in less than three years, too old to take up the life of a hedge knight… even if he’d been a knight, which as it happened he wasn’t. He had no land, no wealth of his own. He owned the clothes on his back but not much else, not even the horse he was riding. He wasn’t clever enough to be a maester, pious enough to be a septon, or savage enough to be a sellsword. The gods gave me no gift but birth, and they stinted me there. What good was it to be the son of a rich and powerful House if you were the ninth son? When you took grandsons and great-grandsons into account, Merrett stood a better chance of being chosen High Septon than he did of inheriting the Twins.  I have no luck, he thought bitterly. I have never had any bloody luck. He was a big man, broad around the chest and shoulders if only of middling height. In the last ten years he had grown soft and fleshy, he knew, but when he’d been younger Merrett had been almost as robust as Ser Hosteen, his eldest full brother, who was commonly regarded as the strongest of Lord Walder Frey’s brood. As a boy he’d been packed off to Crakehall to serve his mother’s family as a page. When old Lord Sumner had made him a squire, everyone had assumed he would be Ser Merrett in no more than a few years, but the outlaws of the Kingswood Brotherhood had pissed on those plans. While his fellow squire Jaime Lannister was covering himself in glory, Merrett had first caught the pox from a camp follower, then managed to get captured by a woman, the one called the White Fawn. Lord Sumner had ransomed him back from the outlaws, but in the very next fight he’d been felled by a blow from a mace that had broken his helm and left him insensible for a fortnight. Everyone gave him up for dead, they told him later.  Merrett hadn’t died, but his fighting days were done. Even the lightest blow to his head brought on blinding pain and reduced him to tears."
}