{
  "id": "6e94159f28f8708673b4d9d2de54a6744c3df25c",
  "text": " Through the leafy canopy she could see the bone-white branches of the heart tree. It looks just like the one in Winterfell from here. If only it had been… then when she climbed down she would have been home again, and maybe find her father sitting under the weirwood where he always sat.  Shoving her sword through her belt, she slipped down branch to branch until she was back on the ground. The light of the moon painted the limbs of the weirwood silvery white as she made her way toward it, but the five-pointed red leaves turned black by night. Arya stared at the face carved into its trunk. It was a terrible face, its mouth twisted, its eyes flaring and full of hate. Is that what a god looked like? Could gods be hurt, the same as people? I should pray, she thought suddenly.  Arya went to her knees. She wasn’t sure how she should begin. She clasped her hands together. Help me, you old gods, she prayed silently. Help me get those men out of the dungeon so we can kill Ser Amory, and bring me home to Winterfell. Make me a water dancer and a wolf and not afraid again, ever.  Was that enough? Maybe she should pray aloud if she wanted the old gods to hear. Maybe she should pray longer. Sometimes her father had prayed a long time, she remembered. But the old gods had never helped him. Remembering that made her angry.  You should have saved him,  she scolded the tree.  He prayed to you all the time. I don’t care if you help me or not. I don’t think you could even if you wanted to.    Gods are not mocked, girl.   The voice startled her. She leapt to her feet and drew her wooden sword. Jaqen H’ghar stood so still in the darkness that he seemed one of the trees.  A man comes to hear a name. One and two and then comes three. A man would have done.   Arya lowered the splintery point toward the ground.  How did you know I was here?    A man sees. A man hears. A man knows.   She regarded him suspiciously. Had the gods sent him?  How’d you make the dog kill Weese? Did you call Rorge and Biter up from hell? Is Jaqen H’ghar your true name?    Some men have many names. Weasel. Arry. Arya.   She backed away from him, until she was pressed against the heart tree.  Did Gendry tell?    A man knows,  he said again.  My lady of Stark.   Maybe the gods had sent him in answer to her prayers.  I need you to help me get those men out of the dungeons. That Glover and those others, all of them. We have to kill the guards and open the cell somehow—    A girl forgets,  he said quietly.  Two she has had, three were owed. If a guard must die, she needs only speak his name.    But one guard won’t be enough, we need to kill them all to open the cell.  Arya bit her lip hard to stop from crying.  I want you to save the northmen like I saved you.   He looked down at her pitilessly.  Three lives were snatched from a god. Three lives must be repaid. The gods are not mocked.  His voice was silk and steel.   I never mocked.  She thought for a moment.  The name… can I name anyone? And you’ll kill him?   Jaqen H’ghar inclined his head.  A man has said.    Anyone?  she repeated.  A man, a woman, a little baby, or Lord Tywin, or the High Septon, or your father?    A man’s sire is long dead, but did he live, and did you know his name, he would die at your command.    Swear it,  Arya said.  Swear it by the gods.    By all the gods of sea and air, and even him of fire, I swear it.  He placed a hand in the mouth of the weirwood.  By the seven new gods and the old gods beyond count, I swear it.   He has sworn.  Even if I named the king…    Speak the name, and death will come. On the morrow, at the turn of the moon, a year from this day, it will come. A man does not fly like a bird, but one foot moves and then another and one day a man is there, and a king dies.  He knelt beside her, so they were face-to-face,  A girl whispers if she fears to speak aloud. Whisper it now. Is it Joffrey?   Arya put her lips to his ear.  It’s Jaqen H’ghar.   Even in the burning barn, with walls of flame towering all around and him in chains, he had not seemed so distraught as he did now.  A girl… she makes a jest.    You swore. The gods heard you swear.    The gods did hear,  There was a knife in his hand suddenly, its blade thin as her little finger. Whether it was meant for her or him, Arya could not say.  A girl will weep. A girl will lose her only friend.    You’re not my friend. A friend would help me.  She stepped away from him, balanced on the balls of her feet in case he threw his knife.  I’d never kill a friend.   Jaqen’s smile came and went.  A girl might… name another name then, if a friend did help?    A girl might,  she said.  If a friend did help.   The knife vanished.  Come.    Now?  She had never thought he would act so quickly.   A man hears the whisper of sand in a glass. A man will not sleep until a girl unsays a certain name. Now, evil child.   I’m not an evil child, she thought, I am a direwolf, and the ghost in Harrenhal. She put her broomstick back in its hiding place and followed him from the godswood."
}