{
  "id": "6ee2dc1acece9d6b49baf3ce9f8ff4e7c5a65b8b",
  "text": "    At my brother’s command, not for love of me,  Stannis answered.  Lord Eddard did his duty, I will not deny it. Did I ever do less? I should have been Robert’s Hand.    That was your brother’s will. Ned never wanted it.    Yet he took it. That which should have been mine. Still, I give you my word, you shall have justice for his murder.   How they loved to promise heads, these men who would be king.  Your brother promised me the same. But if truth be told, I would sooner have my daughters back, and leave justice to the gods. Cersei still holds my Sansa, and of Arya there has been no word since the day of Robert’s death.    If your children are found when I take the city, they shall be sent to you.  Alive or dead, his tone implied.   And when shall that be, Lord Stannis? King’s Landing is close to your Dragonstone, but I find you here instead.    You are frank, Lady Stark. Very well, I’ll answer you frankly. To take the city, I need the power of these southron lords I see across the field. My brother has them. I must needs take them from him.    Men give their allegiance where they will, my lord. These lords swore fealty to Robert and House Baratheon. If you and your brother were to put aside your quarrel—    I have no quarrel with Renly, should he prove dutiful. I am his elder, and his king. I want only what is mine by rights. Renly owes me loyalty and obedience. I mean to have it. From him, and from these other lords.  Stannis studied her face.  And what cause brings you to this field, my lady? Has House Stark cast its lot with my brother, is that the way of it?   This one will never bend, she thought, yet she must try nonetheless. Too much was at stake.  My son reigns as King in the North, by the will of our lords and people. He bends the knee to no man, but holds out the hand of friendship to all.    Kings have no friends,  Stannis said bluntly,  only subjects and enemies.    And brothers,  a cheerful voice called out behind her. Catelyn glanced over her shoulder as Lord Renly’s palfrey picked her way through the stumps. The younger Baratheon was splendid in his green velvet doublet and satin cloak trimmed in vair. The crown of golden roses girded his temples, jade stag’s head rising over his forehead, long black hair spilling out beneath. jagged chunks of black diamond studded his swordbelt, and a chain of gold and emeralds looped around his neck.  Renly had chosen a woman to carry his banner as well, though Brienne hid face and form behind plate armor that gave no hint of her sex. Atop her twelve-foot lance, the crowned stag pranced black-on-gold as the wind off the sea rippled the cloth.  His brother’s greeting was curt.  Lord Renly.    King Renly. Can that truly be you, Stannis?   Stannis frowned.  Who else should it be?   Renly gave an easy shrug.  When I saw that standard, I could not be certain. Whose banner do you bear?    Mine own.   The red-clad priestess spoke up.  The king has taken for his sigil the fiery heart of the Lord of Light.   Renly seemed amused by that.  All for the good. If we both use the same banner, the battle will be terribly confused.   Catelyn said,  Let us hope there will be no battle. We three share a common foe who would destroy us all.   Stannis studied her, unsmiling.  The Iron Throne is mine by rights. All those who deny that are my foes.    The whole of the realm denies it, brother,  said Renly.  Old men deny it with their death rattle, and unborn children deny it in their mothers’wombs. They deny it in Dorne and they deny it on the Wall. No one wants you for their king. Sorry.   Stannis clenched his jaw, his face taut.  I swore I would never treat with you while you wore your traitor’s crown. Would that I had kept to that vow.    This is folly,  Catelyn said sharply.  Lord Tywin sits at Harrenhal with twenty thousand swords. The remnants of the Kingslayer’s army have regrouped at the Golden Tooth, another Lannister host gathers beneath the shadow of Casterly Rock, and Cersei and her son hold King’s Landing and your precious Iron Throne. You each name yourself king, yet the kingdom bleeds, and no one lifts a sword to defend it but my son.   Renly shrugged.  Your son has won a few battles. I shall win the war. The Lannisters can wait my pleasure.    If you have proposals to make, make them,  Stannis said brusquely,  or I will be gone.    Very well,  said Renly.  I propose that you dismount, bend your knee, and swear me your allegiance.   Stannis choked back rage.  That you shall never have.    You served Robert, why not me?    Robert was my elder brother. You are the younger.    Younger, bolder, and far more comely…    …and a thief and a usurper besides.   Renly shrugged.  The Targaryens called Robert usurper. He seemed to be able to bear the shame. So shall I.   This will not do.  Listen to yourselves! If you were sons of mine, I would bang your heads together and lock you in a bedchamber until you remembered that you were brothers.   Stannis frowned at her.  You presume too much, Lady Stark."
}