{
  "id": "6fe937a40b59ad5f306e451bacc0a0e91fc7cf5d",
  "text": " No wonder his wife despised him. I have to go through with this. Petyr Pimple might be Lord of the Crossing one day, Edwyn has no sons and Black Walder’s only got bastards. Petyr will remember who came to get him. He took another swallow, corked the skin up, and led his palfrey through broken stones, gorse, and thin wind-whipped trees, following the sounds to what had been the castle ward.  Fallen leaves lay thick upon the ground, like soldiers after some great slaughter. A man in patched, faded greens was sitting crosslegged atop a weathered stone sepulcher, fingering the strings of a woodharp. The music was soft and sad. Merrett knew the song. High in the halls of the kings who are gone, Jenny would dance with her ghosts…   Get off there,  Merrett said.  You’re sitting on a king.    Old Tristifer don’t mind my bony arse. The Hammer of Justice, they called him. Been a long while since he heard any new songs.  The outlaw hopped down. Trim and slim, he had a narrow face and foxy features, but his mouth was so wide that his smile seemed to touch his ears. A few strands of thin brown hair were blowing across his brow. He pushed them back with his free hand and said,  Do you remember me, my lord?    No.  Merrett frowned.  Why would I?    I sang at your daughter’s wedding. And passing well, I thought. That Pate she married was a cousin. We’re all cousins in Sevenstreams. Didn’t stop him from turning niggard when it was time to pay me.  He shrugged.  Why is it your lord father never has me play at the Twins? Don’t I make enough noise for his lordship? He likes it loud, I have been hearing.    You bring the gold?  asked a harsher voice, behind him.  Merrett’s throat was dry. Bloody outlaws, always hiding in the bushes. It had been the same in the kingswood. You’d think you’d caught five of them, and ten more would spring from nowhere.  When he turned, they were all around him; an ill-favored gaggle of leathery old men and smooth-cheeked lads younger than Petyr Pimple, the lot of them clad in roughspun rags, boiled leather, and bits of dead men’s armor. There was one woman with them, bundled up in a hooded cloak three times too big for her. Merrett was too flustered to count them, but there seemed to be a dozen at the least, maybe a score.   I asked a question.  The speaker was a big bearded man with crooked green teeth and a broken nose; taller than Merrett, though not so heavy in the belly. A halfhelm covered his head, a patched yellow cloak his broad shoulders.  Where’s our gold?    in my saddlebag. A hundred golden dragons.  Merrett cleared his throat.  You’ll get it when I see that Petyr—   A squat one-eyed outlaw strode forward before he could finish, reached into the saddlebag bold as you please, and found the sack. Merrett started to grab him, then thought better of it. The outlaw opened the drawstring, removed a coin, and bit it.  Tastes right.  He hefted the sack.  Feels right too.   They’re going to take the gold and keep Petyr too, Merrett thought in sudden panic.  That’s the whole ransom. All you asked for.  His palms were sweating. He wiped them on his breeches.  Which one of you is Beric Dondarrion?  Dondarrion had been a lord before he turned outlaw, he might still be a man of honor.   Why, that would be me,  said the one-eyed man.   You’re a bloody liar, Jack,  said the big bearded man in the yellow cloak.  It’s my turn to be Lord Beric.    Does that mean I have to be Thoros?  The singer laughed.  My lord, sad to say, Lord Beric was needed elsewhere. The times are troubled, and there are many battles to fight. But we’ll sort you out just as he would, have no fear.   Merrett had plenty of fear. His head was pounding too. Much more of this and he’d be sobbing.  You have your gold,  he said.  Give me my nephew, and I’ll be gone.  Petyr was actually more a great half-nephew, but there was no need to go into that.   He’s in the godswood,  said the man in the yellow cloak.  We’ll take you to him. Notch, you hold his horse.   Merrett handed over the bridle reluctantly. He did not see what other choice he had.  My water skin,  he heard himself say.  A swallow of wine, to settle my—    We don’t drink with your sort,  yellow cloak said curtly.  It’s this way. Follow me.   Leaves crunched beneath their heels, and every step sent a spike of pain through Merrett’s temple. They walked in silence, the wind gusting around them. The last light of the setting sun was in his eyes as he clambered over the mossy hummocks that were all that remained of the keep. Behind was the godswood.  Petyr Pimple was hanging from the limb of an oak, a noose tight around his long thin neck. His eyes bulged from a black face, staring down at Merrett accusingly. You came too late, they seemed to say. But he hadn’t. He hadn’t! He had come when they told him.  You killed him,  he croaked.   Sharp as a blade, this one,  said the one-eyed man.  An aurochs was thundering through Merrett’s head. Mother have mercy, he thought.  I brought the gold."
}