{
  "id": "704dc92ffd372b5ea0bc29236abe2c159d45fa6f",
  "text": " Dany pulled up a coverlet and tucked it in under her arms. She was naked, and had not expected a caller at this hour.  Come,  she said when she saw Ser Jorah standing without, beneath a swaying lantern.  The exile knight ducked his head as he entered.  Your Grace. I am sorry to disturb your sleep.    I was not sleeping, ser. Come and watch.  She took a chunk of salt pork out of the bowl in her lap and held it up for her dragons to see. All three of them eyed it hungrily. Rhaegal spread green wings and stirred the air, and Viserion’s neck swayed back and forth like a long pale snake’s as he followed the movement of her hand.  Drogon,  Dany said softly,  dracarys.  And she tossed the pork in the air.  Drogon moved quicker than a striking cobra. Flame roared from his mouth, orange and scarlet and black, searing the meat before it began to fall. As his sharp black teeth snapped shut around it, Rhaegal’s head darted close, as if to steal the prize from his brother’s jaws, but Drogon swallowed and screamed, and the smaller green dragon could only hiss in frustration.   Stop that, Rhaegal,  Dany said in annoyance, giving his head a swat.  You had the last one. I’ll have no greedy dragons.  She smiled at Ser Jorah.  I won’t need to char their meat over a brazier any longer.    So I see. Dracarys?   All three dragons turned their heads at the sound of that word and Viserion let loose with a blast of pale gold flame that made Ser Jorah take a hasty step backward. Dany giggled.  Be careful with that word, ser, or they’re like to singe your beard off. It means ‘dragonfire’ in High Valyrian. I wanted to choose a command that no one was like to utter by chance.   Mormont nodded.  Your Grace,  he said,  I wonder if I might have a few private words?    Of course. Irri, leave us for a bit.  She put a hand on Jhiqui’s bare shoulder and shook the other handmaid awake.  You as well, sweetling. Ser Jorah needs to talk to me.    Yes, Khaleesi.  Jhiqui tumbled from the bunk, naked and yawning, her thick black hair tumbled about her head. She dressed quickly and left with Irri, closing the door behind them.  Dany gave the dragons the rest of the salt pork to squabble over, and patted the bed beside her.  Sit, goodser, and tell me what is troubling you.    Three things.  Ser Jorah sat.  Strong Belwas. This Arstan Whitebeard. And Illyrio Mopatis, who sent them.   Again? Dany pulled the coverlet higher and tugged one end over her shoulder.  And why is that?    The warlocks in Qarth told you that you would be betrayed three times,  the exile knight reminded her, as Viserion and Rhaegal began to snap and claw at each other.   Once for blood and once for gold and once for love.  Dany was not like to forget.  Mirri Maz Duur was the first.    Which means two traitors yet remain… and now these two appear. I find that troubling, yes. Never forget, Robert offered a lordship to the man who slays you.   Dany leaned forward and yanked Viserion’s tail, to pull him off his green brother. Her blanket fell away from her chest as she moved. She grabbed it hastily and covered herself again.  The Usurper is dead,  she said.   But his son rules in his place.  Ser Jorah lifted his gaze, and his dark eyes met her own.  A dutiful son pays his father’s debts. Even blood debts.    This boy Joffrey might want me dead… if he recalls that I’m alive. What has that to do with Belwas and Arstan Whitebeard? The old man does not even wear a sword. You’ve seen that.    Aye. And I have seen how deftly he handles that staff of his. Recall how he killed that manticore in Qarth? It might as easily have been your throat he crushed.    Might have been, but was not,  she pointed out.  It was a stinging manticore meant to slay me. He saved my life.    Khaleesi, has it occurred to you that Whitebeard and Belwas might have been in league with the assassin? It might all have been a ploy to win your trust.   Her sudden laughter made Drogon hiss, and sent Viserion flapping to his perch above the porthole.  The ploy worked well.   The exile knight did not return her smile.  These are Illyrio’s ships, Illyrio’s captains, Illyrio’s sailors… and Strong Belwas and Arstan are his men as well, not yours.    Magister Illyrio has protected me in the past. Strong Belwas says that he wept when he heard my brother was dead.    Yes,  said Mormont,  but did he weep for Viserys, or for the plans he had made with him?    His plans need not change. Magister Illyrio is a friend to House Targaryen, and wealthy…    He was not born wealthy. In the world as I have seen it, no man grows rich by kindness. The warlocks said the second treason would be for gold. What does Illyrio Mopatis love more than gold?    His skin.  Across the cabin Drogon stirred restlessly, steam rising from his snout.  Mirri Maz Duur betrayed me. I burned her for it.    Mirri Maz Duur was in your power. In Pentos, you shall be in Illyrio’s power. It is not the same. I know the magister as well as you. He is a devious man, and clever—    I need clever men about me if I am to win the Iron Throne."
}