{
  "id": "705f752f454c7d186e0e4f650448c00d4a1a7de4",
  "text": " I am only a knight, and I have nothing to offer you but exile, but I beg you, hear me. Let Khal Drogo go. You shall not be alone. I promise you, no man shall take you to Vaes Dothrak unless you wish to go. You need not join the dosh khaleen. Come east with me. Yi Ti, Qarth, the Jade Sea, Asshai by the Shadow. We will see all the wonders yet unseen, and drink what wines the gods see fit to serve us. Please, Khaleesi. I know what you intend. Do not. Do not.    I must,  Dany told him. She touched his face, fondly, sadly.  You do not understand.    I understand that you loved him,  Ser Jorah said in a voice thick with despair.  I loved my lady wife once, yet I did not die with her. You are my queen, my sword is yours, but do not ask me to stand aside as you climb on Drogo’s pyre. I will not watch you burn.    Is that what you fear?  Dany kissed him lightly on his broad forehead.  I am not such a child as that, sweet ser.    You do not mean to die with him? You swear it, my queen?    I swear it,  she said in the Common Tongue of the Seven Kingdoms that by rights were hers.  The third level of the platform was woven of branches no thicker than a finger, and covered with dry leaves and twigs. They laid them north to south, from ice to fire, and piled them high with soft cushions and sleeping silks. The sun had begun to lower toward the west by the time they were done. Dany called the Dothraki around her. Fewer than a hundred were left. How many had Aegon started with? she wondered. It did not matter.   You will be my khalasar,  she told them.  I see the faces of slaves. I free you. Take off your collars. Go if you wish, no one shall harm you. If you stay, it will be as brothers and sisters, husbands and wives.  The black eyes watched her, wary, expressionless.  I see the children, women, the wrinkled faces of the aged. I was a child yesterday. Today I am a woman. Tomorrow I will be old. To each of you I say, give me your hands and your hearts, and there will always be a place for you.  She turned to the three young warriors of her khas.  Jhogo, to you I give the silver-handled whip that was my bride gift, and name you ko, and ask your oath, that you will live and die as blood of my blood, riding at my side to keep me safe from harm.   Jhogo took the whip from her hands, but his face was confused.  Khaleesi,  he said hesitantly,  this is not done. It would shame me, to be bloodrider to a woman.    Aggo,  Dany called, paying no heed to Jhogo’s words. If I look back I am lost.  To you I give the dragonbone bow that was my bride gift.  It was double-curved, shiny black and exquisite, taller than she was.  I name you ko, and ask your oath, that you should live and die as blood of my blood, riding at my side to keep me safe from harm.   Aggo accepted the bow with lowered eyes.  I cannot say these words. Only a man can lead a khalasar or name a ko.    Rakharo,  Dany said, turning away from the refusal,  you shall have the great arakh that was my bride gift, with hilt and blade chased in gold. And you too I name my ko, and ask that you live and die as blood of my blood, riding at my side to keep me safe from harm.    You are khaleesi,  Rakharo said, taking the arakh.  I shall ride at your side to Vaes Dothrak beneath the Mother of Mountains, and keep you safe from harm until you take your place with the crones of the dosh khaleen. No more can I promise.   She nodded, as calmly as if she had not heard his answer, and turned to the last of her champions.  Ser Jorah Mormont,  she said,  first and greatest of my knights, I have no bride gift to give you, but I swear to you, one day you shall have from my hands a longsword like none the world has ever seen, dragon-forged and made of Valyrian steel. And I would ask for your oath as well.    You have it, my queen,  Ser Jorah said, kneeling to lay his sword at her feet.  I vow to serve you, to obey you, to die for you if need be.    Whatever may come?    Whatever may come.    I shall hold you to that oath. I pray you never regret the giving of it.  Dany lifted him to his feet. Stretching on her toes to reach his lips, she kissed the knight gently and said,  You are the first of my Queensguard.   She could feel the eyes of the khalasar on her as she entered her tent. The Dothraki were muttering and giving her strange sideways looks from the corners of their dark almond eyes. They thought her mad, Dany realized. Perhaps she was. She would know soon enough. If I look back I am lost.  Her bath was scalding hot when Irri helped her into the tub, but Dany did not flinch or cry aloud. She liked the heat. It made her feel clean. Jhiqui had scented the water with the oils she had found in the market in Vaes Dothrak; the steam rose moist and fragrant. Doreah washed her hair and combed it out, working loose the mats and tangles. Irri scrubbed her back. Dany closed her eyes and let the smell and the warmth enfold her. She could feel the heat soaking through the soreness between her thighs. She shuddered when it entered her, and her pain and stiffness seemed to dissolve."
}