{
  "id": "70b7b2762a3e24b23061ec129d598cdd53ec714b",
  "text": " \"Three turns? What's he talking about? What are we supposed to do?\"  But Hermione was fumbling with the neck of her robes, pulling from beneath them a very long, very fine gold chain.  \"Harry, come here,\" she said urgently. \"Quick!\"  Harry moved toward her, completely bewildered. She was holding the chain out. He saw a tiny, sparkling hourglass hanging from it.  \"Here --\"  She had thrown the chain around his neck too.  \"Ready?\" she said breathlessly.  \"What are we doing?\" Harry said, completely lost.  Hermione turned the hourglass over three times.  The dark ward dissolved. Harry had the sensation that he was flying very fast, backward. A blur of colors and shapes rushed past him, his ears were pounding, he tried to yell but couldn't hear his own voice --  And then he felt solid ground beneath his feet, and everything came into focus again --  He was standing next to Hermione in the deserted entrance hall and a stream of golden sunlight was falling across the paved floor from the open front doors. He looked wildly around at Hermione, the chain of the hourglass cutting into his neck.  \"Hermione, what --?\"  \"In here!\" Hermione seized Harry's arm and dragged him across the hall to the door of a broom closet; she opened it, pushed him inside among the buckets and mops, then slammed the door behind them.  \"What -- how -- Hermione, what happened?\"  \"We've gone back in time,\" Hermione whispered, lifting the chain off Harry's neck in the darkness. \"Three hours back...\"  Harry found his own leg and gave it a very hard pinch. It hurt a lot, which seemed to rule out the possibility that he was having a very bizarre dream.  \"But --\"  \"Shh! Listen! Someone's coming! I think -- I think it might be us!\" Hermione had her ear pressed against the cupboard door.  \"Footsteps across the hall... yes, I think it's us going down to Hagrid's!\"  \"Are you telling me,\" Harry whispered, \"that we're here in this cupboard and we're out there too?\"  \"Yes,\" said Hermione, her ear still glued to the cupboard door. \"I'm sure it's us. It doesn't sound like more than three people... and we're walking slowly because we're under the Invisibility Cloak -- \"  She broke off, still listening intently.  \"We've gone down the front steps....\"  Hermione sat down on an upturned bucket, looking desperately anxious, but Harry wanted a few questions answered.  \"Where did you get that hourglass thing?\"  \"It's called a Time-Turner,\" Hermione whispered, \"and I got it from Professor McGonagall on our first day back. I've been using it all year to get to all my lessons. Professor McGonagall made me swear I wouldn't tell anyone. She had to write all sorts of letters to the Ministry of Magic so I could have one. She had to tell them that I was a model student, and that I'd never, ever use it for anything except my studies.... I've been turning it back so I could do hours over again, that's how I've been doing several lessons at once, see? But...  \"Harry, I don't understand what Dumbledore wants us to do. Why did he tell us to go back three hours? How's that going to help Sirius?\"  Harry stared at her shadowy face.  \"There must be something that happened around now he wants us to change,\" he said slowly. \"What happened? We were walking down to Hagrid's three hours ago....\"  \"This is three hours ago, and we are walking down to Hagrid's,\" said Hermione. \"We just heard ourselves leaving....\"  Harry frowned; he felt as though he were screwing up his whole brain in concentration.  \"Dumbledore just said -- just said we could save more than one innocent life....\" And then it hit him. \"Hermione, we're going to save Buckbeak!\"  \"But -- how will that help Sirius?\"  \"Dumbledore said -- he just told us where the window is -- the window of Flitwick's office! Where they've got Sirius locked up! We've got to fly Buckbeak up to the window and rescue Sirius! Sirius can escape on Buckbeak -- they can escape together!\"  From what Harry could see of Hermione's face, she looked terrified.  \"If we manage that without being seen, it'll be a miracle!\"  \"Well, we've got to try, haven't we?\" said Harry. He stood up and pressed his ear against the door. \"Doesn't sound like anyone's there.... Come on, let's go.\"  Harry pushed open the closet door. The entrance hall was deserted. As quietly and quickly as they could, they darted out of the closet and down the stone steps. The shadows were already lengthening, the tops of the trees in the Forbidden Forest gilded once more with gold.  \"If anyone's looking out of the window --\" Hermione squeaked, looking up at the castle behind them.  \"We'll run for it,\" said Harry determinedly. \"Straight into the forest, all right? We'll have to hide behind a tree or something and keep a lookout --\"  \"Okay, but we'll go around by the greenhouses!\" said Hermione breathlessly. \"We need to keep out of sight of Hagrid's front door, or we'll see us! We must be nearly at Hagrid's by now!\"  Still working out what she meant, Harry set off at a sprint, Hermione behind him."
}