{
  "id": "70ccc3e37829f6e637bfb256f62b12b61a6de6e3",
  "text": "  This is the galleas Titan’s Daughter, of the Free City of Braavos.    Wait,  Arya said suddenly.  I have something else.  She had stuffed it down inside her smallclothes to keep it safe, so she had to dig deep to find it, while the oarsmen laughed and the captain lingered with obvious impatience.  One more silver will make no difference, child,  he finally said.   It’s not silver.  Her fingers closed on it.  It’s iron. Here.  She pressed it into his hand, the small black iron coin that Jaqen H’ghar had given her, so worn the man whose head it bore had no features. It’s probably worthless, but…  The captain turned it over and blinked at it, then looked at her again.  This… how…?   Jaqen said to say the words too. Arya crossed her arms against her chest.  Valar morghulis,  she said, as loud as if she’d known what it meant.   Valar dohaeris,  he replied, touching his brow with two fingers.  Of course you shall have a cabin.       Samwell    He sucks harder than mine.  Gilly stroked the babe’s head as she held him to her nipple.   He’s hungry,  said the blonde woman Val, the one the black brothers called the wildling princess.  He’s lived on goats’ milk up to now, and potions from that blind maester.   The boy did not have a name yet, no more than Gilly’s did. That was the wildling way. Not even Mance Rayder’s son would get a name till his third year, it would seem, though Sam had heard the brothers calling him  the little prince  and  born-in-battle.   He watched the child nurse at Gilly’s breast, and then he watched Jon watch. Jon is smiling. A sad smile, still, but definitely a smile of sorts. Sam was glad to see it. It is the first time I’ve seen him smile since I got back.  They had walked from the Nightfort to Deep Lake, and from Deep Lake to Queensgate, following a narrow track from one castle to the next, never out of sight of the Wall. A day and a half from Castle Black, as they trudged along on callused feet, Gilly heard horses behind them, and turned to see a column of black riders coming from the west.  My brothers,  Sam assured her.  No one uses this road but the Night’s Watch.  It had turned out to be Ser Denys Mallister from the Shadow Tower, along with the wounded Bowen Marsh and the survivors from the fight at the Bridge of Skulls. When Sam saw Dywen, Giant, and Dolorous Edd Tollett, he broke down and wept.  It was from them that he learned about the battle beneath the Wall.  Stannis landed his knights at Eastwatch, and Cotter Pyke led him along the ranger’s roads, to take the wildlings unawares,  Giant told him.  He smashed them. Mance Rayder was taken captive, a thousand of his best slain, including Harma Dogshead. The rest scattered like leaves before a storm, we heard.  The gods are good, Sam thought. If he had not gotten lost as he made his way south from Craster’s Keep, he and Gilly might have walked right into the battle… or into Mance Rayder’s camp, at the very least. That might have been well enough for Gilly and the boy, but not for him. Sam had heard all the stories about what wildlings did with captured crows. He shuddered.  Nothing that his brothers told him prepared him for what he found at Castle Black, however. The common hall had burned to the ground and the great wooden stair was a mound of broken ice and scorched timbers. Donal Noye was dead, along with Rast, Deaf Dick, Red Alyn, and so many more, yet the castle was more crowded than Sam had ever seen; not with black brothers, but with the king’s soldiers, more than a thousand of them. There was a king in the King’s Tower for the first time in living memory, and banners flew from the Lance, Hardin’s Tower, the Grey Keep, the Shieldhall, and other buildings that had stood empty and abandoned for long years.  The big one, the gold with the black stag, that’s the royal standard of House Baratheon,  he told Gilly, who had never seen banners before.  The fox-and-flowers is House Florent. The turtle is Estermont, the swordfish is Bar Emmon, and the crossed trumpets are for Wensington.    They’re all bright as flowers.  Gilly pointed.  I like those yellow ones, with the fire. Look, and some of the fighters have the same thing on their blouses.    A fiery heart. I don’t know whose sigil that is.   He found out soon enough.  Queen’s men,  Pyp told him—after he let out a whoop, and shouted,  Run and bar the doors, lads, it’s Sam the Slayer come back from the grave,  while Grenn was hugging Sam so hard he thought his ribs might break— but best you don’t go asking where the queen is. Stannis left her at Eastwatch, with their daughter and his fleet. He brought no woman but the red one.    The red one?  said Sam uncertainly.   Melisandre of Asshai,  said Grenn.  The king’s sorceress. They say she burned a man alive at Dragonstone so Stannis would have favorable winds for his voyage north. She rode beside him in the battle too, and gave him his magic sword. Lightbringer, they call it. Wait till you see it. It glows like it had a piece of sun inside it."
}