{
  "id": "70cd3770ff82920c15af11f5c4989d128edf9e81",
  "text": "  *195*  \"So?\" said Harry. \"I bet loads of people here can do it.\"  \"Oh, no they can't,\" said Ron. \"It's not a very common gift. Harry, this is bad.\"  \"What's bad?\" said Harry, starting to feel quite angry. \"What's wrong with everyone? Listen, if I hadn't told that snake not to attack Justin -\"  \"Oh, that's what you said to it?\"  \"What d'you mean? You were there - you heard me -\"  \"I heard you speaking Parseltongue,\" said Ron. \"Snake language. You could have been saying anything - no wonder Justin panicked, you sounded like you were egging the snake on or something - it was creepy, you know -\"  Harry gaped at him.  \"I spoke a different language? But - I didn't realize - how can I speak a language without knowing I can speak it?\"  Ron shook his head. Both he and Hermione were looking as though someone had died. Harry couldn't see what was so terrible.  \"D'you want to tell me what's wrong with stopping a massive snake biting off Justin's head?\" he said. \"What does it matter how I did it as long as Justin doesn't have to join the Headless Hunt?\"  \"It matters,\" said Hermione, speaking at last in a hushed voice, \"because being able to talk to snakes was what Salazar Slytherin was famous for. That's why the symbol of Slytherin House is a serpent.\"  Harry's mouth fell open.  \"Exactly,\" said Ron. \"And now the whole school's going to think you're his great-great-great-great-grandson or something -\"  \"But I'm not,\" said Harry, with a panic he couldn't quite explain.  \"You'll find that hard to prove,\" said Hermione. \"He lived about a thousand years ago; for all we know, you could be.\"  * IL96 *  Harry lay awake for hours that night. Through a gap in the curtains around his four-poster he watched snow starting to drift past the tower window and wondered . . .  Could he be a descendant of Salazar Slithering? He didn't know anything about his father's family, after all. The Dursleys had always forbidden questions about his wizarding relatives.  Quietly, Harry tried to say something in Parseltongue. The words wouldn't come. It seemed he had to be face-to-face with a snake to do it.   But I'm in Gryffindor, Harry thought. The Sorting Hat wouldn't have put me in here if I had Slytherin blood...  Ah, said a nasty little voice in his brain, but the Sorting Hat wanted to put you in Slytherin, don't you remember?  Harry turned over. He'd see Justin the next day in Herbology and he'd explain that he'd been calling the snake off, not egging it on, which (he thought angrily, pummeling his pillow) any fool should have realized.  By next morning, however, the snow that had begun in the night had turned into a blizzard so thick that the last Herbology lesson of the term was canceled: Professor Sprout wanted to fit socks and scarves on the Mandrakes, a tricky operation she would entrust to no one else, now that it was so important for the Mandrakes to grow quickly and revive Mrs. Norris and Colin Creevey.  Harry fretted about this next to the fire in the Gryffindor common room, while Ron and Hermione used their time off to play a game of wizard chess.  \"For heaven's sake, Harry,\" said Hermione, exasperated, as one  *197*  of Ron's bishops wrestled her knight off his horse and dragged him off the board. \"Go and find Justin if it's so important to you.\"  So Harry got up and left through the portrait hole, wondering where Justin might be.  The castle was darker than it usually was in daytime because of the thick, swirling gray snow at every window. Shivering, Harry walked past classrooms where lessons were taking place, catching snatches of what was happening within. Professor McGonagall was shouting at someone who, by the sound of it, had turned his friend into a badger. Resisting the urge to take a look, Harry walked on by, thinking that Justin might be using his free time to catch up on some work, and deciding to check the library first.  A group of the Hufliepuffs who should have been in Herbology were indeed sitting at the back of the library, but they didn't seem to be working. Between the long lines of high bookshelves, Harry could see that their heads were close together and they were having what looked like an absorbing conversation. He couldn't see whether Justin was among them. He was walking toward them when something of what they were saying met his ears, and he paused to listen, hidden in the Invisibility section.  \"So anyway,\" a stout boy was saying, \"I told Justin to hide up in our dormitory. I mean to say, if Potter's marked him down as his next victim, it's best if he keeps a low profile for a while. Of course, Justin's been waiting for something like this to happen ever since he let slip to Potter he was Muggle-born. Justin actually told him he'd been down for Eton. That's not the kind of thing you bandy about with Slytherin's heir on the loose, is it?\"  \"You definitely think it is Potter, then, Ernie?\" said a girl with blonde pigtails anxiously.  198  \"Hannah,\" said the stout boy solemnly, \"he's a Parselmouth. Everyone knows that's the mark of a Dark wizard."
}