{
  "id": "71784808e62a4405f186398ed0a67af361dfdd3f",
  "text": "  Dumbledore, and you still think he's trustworthy?\"                    \"You fool!\"  Professor McGonagall cried.  \"Cedric Diggory!  Mr. Crouch!  These deaths were not the random work of a lunatic!\"     \"I see no evidence to the contrary!\"  shouted Fudge, now matching her anger, his face purpling.  \"It seems to me that you are all determined to start a panic that will destabilize everything we have worked for these last thirteen years!\" Harry couldn't believe what he was hearing.  He had always thought of Fudge as a kindly figure, a little blustering, a little pompous, but essentially good-natured.  But now a short, angry wizard stood before him, refusing, point-blank, to accept the prospect of disruption in his comfortable and ordered world - to believe that Voldemort could have risen. \"Voldemort has returned,\" Dumbledore repeated.  \"If you accept that fact straightaway. Fudge, and take the necessary measures, we may still be able to save the situation.  The first and most essential step is to remove Azkaban from the control of the dementors -\" \"Preposterous!\"  shouted Fudge again.  \"Remove the dementors?  I'd be kicked out of office for suggesting it!  Half of us only feel safe in our beds at night because we know the dementors are standing guard at Azkaban!\" \"The rest of us sleep less soundly in our beds, Cornelius, knowing that you have put Lord Voldemort's most dangerous supporters in the care of creatures who will join him the instant he asks them!\"  said Dumbledore.  \"They will not remain loyal to you, Fudge!  Voldemort can offer them much more scope for their powers and their pleasures than you can! With the dementors behind him, and his old supporters returned to him, you will be hard-pressed to stop him regaining the sort of power he had thirteen years ago!\" Fudge was opening and closing his mouth as though no words could express his outrage. \"The second step you must take - and at once,\" Dumbledore pressed on, \"is to send envoys to the giants.\" \"Envoys to the giants?\"  Fudge shrieked, finding his tongue again.  \"What madness is this?\" \"Extend them the hand of friendship, now, before it is too late,\" said Dumbledore, \"or Voldemort will persuade them, as he did before, that he alone among wizards will give them their rights and their freedom!\" \"You - you cannot be serious!\"  Fudge gasped, shaking his head and retreating further from Dumbledore.  \"If the magical community got wind that I had approached the giants - people hate them, Dumbledore - end of my career -\" \"You are blinded,\" said Dumbledore, his voice rising now, the aura of power around him palpable, his eyes blazing once more, \"by the love of the office you hold, Cornelius!  You place too much importance, and you always have done, on the so-called purity of blood!  You fail to recognize that it matters not what someone is born, but what they grow to be!  Your dementor has just destroyed the last remaining member of a pure-blood family as old as any - and see what that man chose to make of his life!  I tell you now- take the steps I have suggested, and you will be remembered, in office or out, as one of the bravest and greatest Ministers of Magic we have ever known.  Fail to act - and history will remember you as the man who stepped aside and allowed Voldemort a second chance to destroy the world we have tried to rebuild!\" \"Insane,\" whispered Fudge, still backing away.  \"Mad . . .\" And then there was silence.  Madam Pomfrey was standing frozen at the foot of Harry's bed, her hands over her mouth. Mrs.Weasley was still standing over Harry, her hand on his shoulder to prevent him from rising.  Bill, Ron, and Hermione were staring at Fudge. \"If your determination to shut your eyes will carry you as far as this, Cornelius,\" said Dumbledore, \"we have reached a parting of the ways.  You must act as you see fit.  And I - I shall act as I see fit.\" Dumbledore's voice carried no hint of a threat; it sounded like a mere statement, but Fudge bristled as though Dumbledore were advancing upon him with a wand. \"Now, see here, Dumbledore,\" he said, waving a threatening finger.  \"I've given you free rein, always.  I've had a lot of respect for you.  I might not have agreed with some of your decisions, but I've kept quiet.  There aren't many who'd have let you hire werewolves, or keep Hagrid, or decide what to teach your students without reference to the Ministry.  But if you're going to work against me -\" \"The only one against whom I intend to work,\" said Dumbledore, \"is Lord Voldemort.  If you are against him, then we remain, Cornelius, on the same side.\" It seemed Fudge could think of no answer to this.  He rocked backward and forward on his small feet for a moment and spun his bowler hat in his hands.  Finally, he said, with a hint of a plea in his voice, \"He can't be back, Dumbledore, he just can't be ...\" Snape strode forward, past Dumbledore, pulling up the left sleeve of his robes as he went.  He stuck out his forearm and showed it to Fudge, who recoiled."
}