{
  "id": "7224e1f3cff6624e455d55fd65dd356eeae79d24",
  "text": " \"Oh yeah?\" Ron yelled back. \"What's that?\" \"Next time there's a ball, ask me before someone else does, and not as a last resort!\" Ron mouthed soundlessly like a goldfish out of water as Hermione turned on her heel and stormed up the girls' staircase to bed. Ron turned to look at Harry. \"Well,\" he sputtered, looking thunderstruck, \"well - that just proves - completely missed the point -\" Harry didn't say anything.  He liked being back on speaking terms with Ron too much to speak his mind right now - but he somehow thought that Hermione had gotten the point much better than Ron had.  CHAPTER TWENTY-FOUR - RITA SKEETER'S SCOOP  Everybody got up late on Boxing Day.  The Gryffindor common room was much quieter than it had been lately, many yawns punctuating the lazy conversations.  Hermione's hair was bushy again; she confessed to Harry that she had used liberal amounts of Sleekeazy's Hair Potion on it for the ball, \"but it's way too much bother to do every day,\" she said matter-of-factly, scratching a purring Crookshanks behind the ears. Ron and Hermione seemed to have reached an unspoken agreement not to discuss their argument.  They were being quite friendly to each other, though oddly formal.  Ron and Harry wasted no time in telling Hermione about the conversation they had overheard between Madame Maxime and Hagrid, but Hermione didn't seem to find the news that Hagrid was a half-giant nearly as shocking as Ron did. \"Well, I thought he must be,\" she said, shrugging. \"I knew he couldn't be pure giant because they're about twenty feet tall. But honestly, all this hysteria about giants. They can't all be horrible. . . . It's the same sort of prejudice that people have toward werewolves. . . . It's just bigotry, isn't it?\" Ron looked as though he would have liked to reply scathingly, but perhaps he didn't want another row, because he contented himself with shaking his head disbelievingly while Hermione wasn't looking. It was time now to think of the homework they had neglected during the first week of the holidays.  Everybody seemed to be feeling rather flat now that Christmas was over - everybody except Harry, that is, who was starting (once again) to feel slightly nervous. The trouble was that February the twenty-fourth looked a lot closer from this side of Christmas, and he still hadn't done anything about working out the clue inside the golden egg. He therefore started taking the egg out of his trunk every time he went up to the dormitory, opening it, and listening intently, hoping that this time it would make some sense. He strained to think what the sound reminded him of, apart from thirty musical saws, but he had never heard anything else like it. He closed the egg, shook it vigorously, and opened it again to see if the sound had changed, but it hadn't. He tried asking the egg questions, shouting over all the wailing, but nothing happened. He even threw the egg across the room - though he hadn't really expected that to help. Harry had not forgotten the hint that Cedric had given him, but his less-than-friendly feelings toward Cedric just now meant that he was keen not to take his help if he could avoid it. In any case, it seemed to him that if Cedric had really wanted to give Harry a hand, he would have been a lot more explicit. He, Harry, had told Cedric exactly what was coming in the first task - and Cedric's idea of a fair exchange had been to tell Harry to take a bath.  Well, he didn't need that sort of rubbishy help - not from someone who kept walking down corridors hand in hand with Cho, anyway.  And so the first day of the new term arrived, and Harry set off to lessons, weighed down with books, parchment, and quills as usual, but also with the lurking worry of the egg heavy in his stomach, as though he were carrying that around with him too. Snow was still thick upon the grounds, and the greenhouse windows were covered in condensation so thick that they couldn't see out of them in Herbology.  Nobody was looking forward to Care of Magical Creatures much in this weather, though as Ron said, the skrewts would probably warm them up nicely, either by chasing them, or blasting off so forcefully that Hagrid's cabin would catch fire. When they arrived at Hagrid 's cabin, however, they found an elderly witch with closely cropped gray hair and a very prominent chin standing before his front door. \"Hurry up, now, the bell rang five minutes ago,\" she barked at them as they struggled toward her through the snow. \"Who're you?\" said Ron, staring at her.  \"Wheres Hagrid?\"  \"My name is Professor Grubbly-Plank,\" she said briskly. \"I am your temporary Care of Magical Creatures teacher.\"  \"Where's Hagrid?\" Harry repeated loudly.  \"He is indisposed,\" said Professor Grubbly-Plank shortly.  Soft and unpleasant laughter reached Harrys ears. He turned; Draco Malfoy and the rest of the Slytherins were joining the class.  All of them looked gleeful, and none of them looked surprised to see Professor Grubbly-Plank. \"This way, please,\" said Professor Grubbly-Plank, and she strode off around the paddock where the Beauxbatons horses were shivering."
}