{
  "id": "7296f577792a10e7ac4563bdef5b3c2eaf0b7968",
  "text": "    I’m not a little girl,  she said angrily.  Who else is there? You said friends    Sharna’s husband, and an orphan boy they took in. They won’t harm you. There’s ale, if you think you’re old enough. Fresh bread and maybe a bit of meat.  Tom glanced toward the cottage.  And whatever you stole from Old Pate’s garden besides.    We never stole,  said Arya.   Are you Old Pate’s daughter, then? A sister? A wife? Tell me no lies, Squab. I buried Old Pate myself, right there under that willow where you were hiding, and you don’t have his look.  He drew a sad sound from his harp.  We’ve buried many a good man this past year, but we’ve no wish to bury you, I swear it on my harp. Archer, show her.   The archer’s hand moved quicker than Arya would have believed. His shaft went hissing past her head within an inch of her ear and buried itself in the trunk of the willow behind her. By then the bowman had a second arrow notched and drawn. She’d thought she understood what Syrio meant by quick as a snake and smooth as summer silk, but now she knew she hadn’t. The arrow thrummed behind her like a bee.  You missed,  she said.   More fool you if you think so,  said Anguy.  They go where I send them.    That they do,  agreed Lem Lemoncloak.  There were a dozen steps between the archer and the point of her sword. We have no chance, Arya realized, wishing she had a bow like his, and the skill to use it. Glumly, she lowered her heavy longsword till the point touched the ground.  We’ll come see this inn,  she conceded, trying to hide the doubt in her heart behind bold words.  You walk in front and we’ll ride behind, so we can see what you’re doing.   Tom Sevenstrings bowed deeply and said,  Before, behind, it makes no matter. Come along, lads, let’s show them the way. Anguy, best pull up those arrows, we won’t be needing them here.   Arya sheathed her sword and crossed the road to where her friends sat on their horses, keeping her distance from the three strangers.  Hot Pie, get those cabbages,  she said as she vaulted into her saddle.  And the carrots too.   For once he did not argue. They set off as she had wanted, walking their horses slowly down the rutted road a dozen paces behind the three on foot. But before very long, somehow they were riding right on top of them. Tom Sevenstrings walked slowly, and liked to strum his woodharp as he went.  Do you know any songs?  he asked them.  I’d dearly love someone to sing with, that I would. Lem can’t carry a tune, and our longbow lad only knows marcher ballads, every one of them a hundred verses long.    We sing real songs in the marches,  Anguy said mildly.   Singing is stupid,  said Arya.  Singing makes noise. We heard you a long way off. We could have killed you.   Tom’s smile said he did not think so.  There are worse things than dying with a song on your lips.    If there were wolves hereabouts, we’d know it,  groused Lem.  Or lions. These are our woods.    You never knew we were there,  said Gendry.   Now, lad, you shouldn’t be so certain of that,  said Tom.  Sometimes a man knows more than he says.   Hot Pie shifted his seat.  I know the song about the bear,  he said.  Some of it, anyhow.   Tom ran his fingers down his strings.  Then let’s hear it, pie boy.  He threw back his head and sang,  A bear there was, a bear, a bear! All black and brown, and covered with hair…   Hot Pie joined in lustily, even bouncing in his saddle a little on the rhymes. Arya stared at him in astonishment. He had a good voice and he sang well. He never did anything well, except bake, she thought to herself.  A small brook flowed into the Trident a little farther on. As they waded across, their singing flushed a duck from among the reeds. Anguy stopped where he stood, unslung his bow, notched an arrow, and brought it down. The bird fell in the shallows not far from the bank. Lem took off his yellow cloak and waded in knee-deep to retrieve it, complaining all the while.  Do you think Sharna might have lemons down in that cellar of hers?  said Anguy to Tom as they watched Lem splash around, cursing.  A Dornish girl once cooked me duck with lemons.  He sounded wistful.  Tom and Hot Pie resumed their song on the other side of the brook, with the duck hanging from Lem’s belt beneath his yellow cloak. Somehow the singing made the miles seem shorter. It was not very long at all until the inn appeared before them, rising from the riverbank where the Trident made a great bend to the north. Arya squinted at it suspiciously as they neared. It did not look like an outlaws’ lair, she had to admit; it looked friendly, even homey, with its whitewashed upper story and slate roof and the smoke curling up lazy from its chimney. Stables and other outbuildings surrounded it, and there was an arbor in back, and apple trees, a small garden. The inn even had its own dock, thrusting out into the river, and…   Gendry,  she called, her voice low and urgent.  They have a boat. We could sail the rest of the way up to Riverrun."
}