{
  "id": "72a76f56c38688ddbf12db27f5e20ea3c90f0dae",
  "text": " I see no other choices.  Catelyn put her heels to her horse and rode off, leaving her son to ponder her words. It would not do to make him feel as if his mother were usurping his place. Did you teach him wisdom as well as valor, Ned? she wondered. Did you teach him how to kneel? The graveyards of the Seven Kingdoms were full of brave men who had never learned that lesson.  It was near midday when their vanguard came in sight of the Twins, where the Lords of the Crossing had their seat.  The Green Fork ran swift and deep here, but the Freys had spanned it many centuries past and grown rich off the coin men paid them to cross. Their bridge was a massive arch of smooth grey rock, wide enough for two wagons to pass abreast; the Water Tower rose from the center of the span, commanding both road and river with its arrow slits, murder holes, and portcullises. It had taken the Freys three generations to complete their bridge; when they were done they’d thrown up stout timber keeps on either bank, so no one might cross without their leave.  The timber had long since given way to stone. The Twins—two squat, ugly, formidable castles, identical in every respect, with the bridge arching between—had guarded the crossing for centuries. High curtain walls, deep moats, and heavy oak-and-iron gates protected the approaches, the bridge footings rose from within stout inner keeps, there was a barbican and portcullis on either bank, and the Water Tower defended the span itself.  One glance was sufficient to tell Catelyn that the castle would not be taken by storm. The battlements bristled with spears and swords and scorpions, there was an archer at every crenel and arrow slit, the drawbridge was up, the portcullis down, the gates closed and barred.  The Greatjon began to curse and swear as soon as he saw what awaited them. Lord Rickard Karstark glowered in silence.  That cannot be assaulted, my lords,  Roose Bolton announced.   Nor can we take it by siege, without an army on the far bank to invest the other castle,  Helman Tallhart said gloomily. Across the deep-running green waters, the western twin stood like a reflection of its eastern brother.  Even if we had the time. Which, to be sure, we do not.   As the northern lords studied the castle, a sally port opened, a plank bridge slid across the moat, and a dozen knights rode forth to confront them, led by four of Lord Walder’s many sons. Their banner bore twin towers, dark blue on a field of pale silver-grey. Ser Stevron Frey, Lord Walder’s heir, spoke for them. The Freys all looked like weasels; Ser Stevron, past sixty with grandchildren of his own, looked like an especially old and tired weasel, yet he was polite enough.  My lord father has sent me to greet you, and inquire as to who leads this mighty host.    I do.  Robb spurred his horse forward. He was in his armor, with the direwolf shield of Winterfell strapped to his saddle and Grey Wind padding by his side.  The old knight looked at her son with a faint flicker of amusement in his watery grey eyes, though his gelding whickered uneasily and sidled away from the direwolf.  My lord father would be most honored if you would share meat and mead with him in the castle and explain your purpose here.   His words crashed among the lords bannermen like a great stone from a catapult. Not one of them approved. They cursed, argued, shouted down each other.   You must not do this, my lord,  Galbart Glover pleaded with Robb.  Lord Walder is not to be trusted.   Roose Bolton nodded.  Go in there alone and you’re his. He can sell you to the Lannisters, throw you in a dungeon, or slit your throat, as he likes.    If he wants to talk to us, let him open his gates, and we will all share his meat and mead,  declared Ser Wendel Manderly.   Or let him come out and treat with Robb here, in plain sight of his men and ours,  suggested his brother, Ser Wylis.  Catelyn Stark shared all their doubts, but she had only to glance at Ser Stevron to see that he was not pleased by what he was hearing. A few more words and the chance would be lost. She had to act, and quickly.  I will go,  she said loudly.   You, my lady?  The Greatjon furrowed his brow.   Mother, are you certain?  Clearly, Robb was not.   Never more,  Catelyn lied glibly.  Lord Walder is my father’s bannerman. I have known him since I was a girl. He would never offer me any harm.  Unless he saw some profit in it, she added silently, but some truths did not bear saying, and some lies were necessary.   I am certain my lord father would be pleased to speak to the Lady Catelyn,  Ser Stevron said.  To vouchsafe for our good intentions, my brother Ser Perwyn will remain here until she is safely returned to you.    He shall be our honored guest,  said Robb. Ser Perwyn, the youngest of the four Freys in the party, dismounted and handed the reins of his horse to a brother.  I require my lady mother’s return by evenfall, Ser Stevron,  Robb went on.  It is not my intent to linger here long.   Ser Stevron Frey gave a polite nod."
}