{
  "id": "735ee04d64870cb23379aeed7605e196d7db5f0c",
  "text": " He raised his eyebrows at her; she nodded again and let go.  Quietly as they could, they crept out into the hall and UP the crumbling staircase. Everything was covered in a thick layer of dust except the floor, where a wide shiny stripe had been made by something being dragged upstairs.  They reached the dark landing.  \"Nox,\" they whispered together, and the lights at the end of their wands went out. Only one door was open. As they crept toward it, they heard movement from behind it; a low moan, and then a deep, loud purring. They exchanged a last look, a last nod.  Wand held tightly before him, Harry kicked the door wide open.  On a magnificent four-poster bed with dusty hangings lay Crookshanks, purring loudly at the sight of them. On the floor beside him, clutching his leg, which stuck out at a strange angle, was Ron.  Harry and Hermione dashed across to him.  \"Ron -- are you okay?\"  \"Where's the dog?\"  \"Not a dog,\" Ron moaned. His teeth were gritted with pain. \"Harry, it's a trap --\"  \"What --\"  \"He's the dog... he's an Animagus.\"  Ron was staring over Harry's shoulder. Harry wheeled around. With a snap, the man in the shadows closed the door behind them.  A mass of filthy, matted hair hung to his elbows. If eyes hadn't been shining out of the deep, dark sockets, he might have been a corpse. The waxy skin was stretched so tightly over the bones of his face, it looked like a skull. His yellow teeth were bared in a grin. It was Sirius Black.  \"Expelliarmus!\"he croaked, pointing Ron's wand at them.  Harry's and Hermione's wands shot out of their hands, high in the air, and Black caught them. Then he took a step closer. His eyes were fixed on Harry.  \"I thought you'd come and help your friend,\" he said hoarsely.  His voice sounded as though he had long since lost the habit of using it. \"Your father would have done the same for me. Brave of you) not to run for a teacher. I'm grateful... it will make everything much easier....\"  The taunt about his father rang in Harry's ears as though Black had bellowed it. A boiling hate erupted in Harry's chest, leaving no place for fear. For the first time in his life, he wanted his wand back in his hand, not to defend himself, but to attack... to kill. Without knowing what he was doing, he started forward, but there was a sudden movement on either side of him and two pairs of hands grabbed him and held him back.... \"No, Harry!\" Hermione gasped in a petrified whisper; Ron, however, spoke to Black.  \"If you want to kill Harry, you'll have to kill us too!\" he said fiercely, though the effort of standing upright was draining him of still more color, and he swayed slightly as he spoke.  Something flickered in Black's shadowed eyes.  \"Lie down,\" he said quietly to Ron. \"You will damage that leg even more.\"  \"Did you hear me?\" Ron said weakly, though he was clinging painfully to Harry to stay upright. \"You'll have to kill all three of us!\"  \"There'll be only one murder here tonight,\" said Brack, and his grin widened.  \"Why's that?\" Harry spat, trying to wrench himself free of Ron, and Hermione. \"Didn't care last time, did you? Didn't mind slaughtering all those Muggles to get at Pettigrew... What's the matter, gone soft in Azkaban?\"  \"Harry!\" Hermione whimpered. \"Be quiet!\"  \"HE KILLED MY MUM AND DAD!\" Harry roared, and with a huge effort he broke free of Hermione's and Ron's restraint and lunged forward -  He had forgotten about magic -- he had forgotten that he was short and skinny and thirteen, whereas Black was a tall, full-grown man -- all Harry knew was that he wanted to hurt Black as badly as he could and that he didn't care how much he got hurt in return --  Perhaps it was the shock of Harry doing something so stupid, but Black didn't raise the wands in time -- one of Harry's hands fastened over his wasted wrist, forcing the wand tips away; the knuckles of Harry's other hand collided with the side of Black's head and they fell, backward, into the wall -  Hermione was screaming; Ron was yelling; there was a blinding flash as the wands in Black's hand sent a jet of sparks into the air that missed Harry's face by inches; Harry felt the shrunken arm under his fingers twisting madly, but he clung on, his other hand punching every part of Black it could find.  But Black's free hand had found Harry's throat  \"No,\" he hissed, \"I've waited too long --\"  The fingers tightened, Harry choked, his glasses askew.  Then he saw Hermione's foot swing out of nowhere. Black let go of Harry with a grunt of pain; Ron had thrown himself on Black's wand hand and Harry heard a faint clatter --  He fought free of the tangle of bodies and saw his own wand rolling across the floor; he threw himself toward it but  \"Argh!\"  Crookshanks had joined the fray; both sets of front claws had sunk themselves deep into Harry's arm; Harry threw him off, but Crookshanks now darted toward Harry's wand --  \"NO YOU DON'T!\" roared Harry, and he aimed a kick at Crookshanks that made the cat leap aside, spitting; Harry snatched up his wand and turned -  \"Get out of the way!\" he shouted at Ron and Hermione."
}