{
  "id": "74e8dddb3f3ed75d25ddb29382706064077e741a",
  "text": " This could be ticklish, the dwarf thought, waiting to see how his father would handle it.   Prince Doran comes at my son’s invitation,  Lord Tywin said calmly,  not only to join in our celebration, but to claim his seat on this council, and the justice Robert denied him for the murder of his sister Elia and her children.   Tyrion watched the faces of the Lords Tyrell, Redwyne, and Rowan, wondering if any of the three would be bold enough to say,  But Lord Tywin, wasn’t it you who presented the bodies to Robert, all wrapped up in Lannister cloaks?  None of them did, but it was there on their faces all the same. Redwyne does not give a fig, he thought, but Rowan looks fit to gag.   When the king is wed to your Margaery and Myrcella to Prince Trystane, we shall all be one great House,  Ser Kevan reminded Mace Tyrell.  The enmities of the past should remain there, would you not agree, my lord?    This is my daughter’s wedding—    —and my grandson’s,  said Lord Tywin firmly.  No place for old quarrels, surely?    I have no quarrel with Doran Martell,  insisted Lord Tyrell, though his tone was more than a little grudging.  If he wishes to cross the Reach in peace, he need only ask my leave.   Small chance of that, thought Tyrion. He’ll climb the Boneway, turn east near Summerhall, and come up the kingsroad.   Three hundred Dornishmen need not trouble our plans,  said Cersei.  We can feed the men-at-arms in the yard, squeeze some extra benches into the throne room for the lordlings and highborn knights, and find Prince Doran a place of honor on the dais.   Not by me, was the message Tyrion saw in Mace Tyrell’s eyes, but the Lord of Highgarden made no reply but a curt nod.   Perhaps we can move to a more pleasant task,  said Lord Tywin.  The fruits of victory await division.    What could be sweeter?  said Littlefinger, who had already swallowed his own fruit, Harrenhal.  Each lord had his own demands; this castle and that village, tracts of lands, a small river, a forest, the wardship of certain minors left fatherless by the battle. Fortunately, these fruits were plentiful, and there were orphans and castles for all. Varys had lists. Forty-seven lesser lordlings and six hundred nineteen knights had lost their lives beneath the fiery heart of Stannis and his Lord of Light, along with several thousand common men-at-arms. Traitors all, their heirs were disinherited, their lands and castles granted to those who had proved more loyal.  Highgarden reaped the richest harvest. Tyrion eyed Mace Tyrell’s broad belly and thought, He has a prodigious appetite, this one. Tyrell demanded the lands and castles of Lord Alester Florent, his own bannerman, who’d had the singular ill judgment to back first Renly and then Stannis. Lord Tywin was pleased to oblige. Brightwater Keep and all its lands and incomes were granted to Lord Tyrell’s second son, Ser Garlan, transforming him into a great lord in the blink of an eye. His elder brother, of course, stood to inherit Highgarden itself.  Lesser tracts were granted to Lord Rowan, and set aside for Lord Tarly, Lady Oakheart, Lord Hightower, and other worthies not present. Lord Redwyne asked only for thirty years’ remission of the taxes that Littlefinger and his wine factors had levied on certain of the Arbor’s finest vintages. When that was granted, he pronounced himself well satisfied and suggested that they send for a cask of Arbor gold, to toast good King Joffrey and his wise and benevolent Hand. At that Cersei lost patience.  It’s swords Joff needs, not toasts,  she snapped.  His realm is still plagued with would-be usurpers and self-styled kings.    But not for long, I think,  said Varys unctuously.   A few more items remain, my lords.  Ser Kevan consulted his papers.  Ser Addam has found some crystals from the High Septon’s crown. It appears certain now that the thieves broke up the crystals and melted down the gold.    Our Father Above knows their guilt and will sit in judgment on them all,  the High Septon said piously.   No doubt he will,  said Lord Tywin.  All the same, you must be crowned at the king’s wedding. Cersei, summon your goldsmiths, we must see to a replacement.  He did not wait for her reply, but turned at once to Varys.  You have reports?   The eunuch drew a parchment from his sleeve.  A kraken has been seen off the Fingers.  He giggled.  Not a Greyjoy, mind you, a true kraken. It attacked an Ibbenese whaler and pulled it under. There is fighting on the Stepstones, and a new war between Tyrosh and Lys seems likely. Both hope to win Myr as ally. Sailors back from the Jade Sea report that a three-headed dragon has hatched in Qarth, and is the wonder of that city—    Dragons and krakens do not interest me, regardless of the number of their heads,  said Lord Tywin.  Have your whisperers perchance found some trace of my brother’s son?    Alas, our beloved Tyrek has quite vanished, the poor brave lad.  Varys sounded close to tears.   Tywin,  Ser Kevan said, before Lord Tywin could vent his obvious displeasure,  some of the gold cloaks who deserted during the battle have drifted back to barracks, thinking to take up duty once again."
}