{
  "id": "74feb86029ddbaf937c49a76fe1b89ca8cbabb8c",
  "text": " Before Harry could reach any conclusions about the place in which they were, he heard footsteps.  The door in the corner of the dungeon opened and three people entered - or at least one man, flanked by two dementors. Harry's insides went cold.  The dementors - tall, hooded creatures whose faces were concealed - were gliding slowly toward the chair in the center of the room, each grasping one of the man's arms with their dead and rotten-looking hands.  The man between them looked as though he was about to faint, and Harry couldn't blame him ... he knew the dementors could not touch him inside a memory, but he remembered their power only too well.  The watching crowd recoiled slightly as the dementors placed the man in the chained chair and glided back out of the room.  The door swung shut behind them. Harry looked down at the man now sitting in the chair and saw that it was Karkaroff. Unlike Dumbledore, Karkaroff looked much younger; his hair and goatee were black. He was not dressed in sleek furs, but in thin and ragged robes.  He was shaking.  Even as Harry watched, the chains on the arms of the chair glowed suddenly gold and snaked their way up Karkaroff's arms, binding him there. \"Igor Karkaroff,\" said a curt voice to Harry's left.  Harry looked around and saw Mr. Crouch standing up in the middle of the bench beside him.  Crouch's hair was dark, his face was much less lined, he looked fit and alert.  \"You have been brought from Azkaban to present evidence to the Ministry of Magic.  You have given us to understand that you have important information for us.\" Karkaroff straightened himself as best he could, tightly bound to the chair. \"I have, sir,\" he said, and although his voice was very scared, Harry could still hear the familiar unctuous note in it.  \"I wish to be of use to the Ministry. I wish to help. I - I know that the Ministry is trying to - to round up the last of the Dark Lords supporters.  I am eager to assist in any way I can. ...\" There was a murmur around the benches.  Some of the wizards and witches were surveying Karkaroff with interest, others with pronounced mistrust.  Then Harry heard, quite distinctly, from Dumbledores other side, a familiar, growling voice saying, \"Filth.\" Harry leaned forward so that he could see past Dumbledore.  Mad-Eye Moody was sitting there - except that there was a very noticeable difference in his appearance.  He did not have his magical eye, but two normal ones.  Both were looking down upon Karkaroff, and both were narrowed in intense dislike. \"Crouch is going to let him out,\" Moody breathed quietly to Dumbledore.  \"He's done a deal with him.  Took me six months to track him down, and Crouch is going to let him go if he's got enough new names.  Let's hear his information, I say, and throw him straight back to the dementors.\" Dumbledore made a small noise of dissent through his long, crooked nose. \"Ah, I was forgetting . . . you don't like the dementors, do you, Albus?\" said Moody with a sardonic smile. \"No,\" said Dumbledore calmly, \"I'm afraid I don't.  I have long felt the Ministry is wrong to ally itself with such creatures.\" \"But for filth like this . . .\" Moody said softly. \"You say you have names for us, Karkaroff,\" said Mr. Crouch. \"Let us hear them, please.\" \"You must understand,\" said Karkaroff hurriedly, \"that He-Who-Must-Not-Be-Named operated always in the greatest secrecy. . . . He preferred that we - I mean to say, his supporters - and I regret now, very deeply, that I ever counted myself among them -\" \"Get on with it,\" sneered Moody. \"- we never knew the names of every one of our fellows - He alone knew exactly who we all were -\" \"Which was a wise move, wasn't it, as it prevented someone like you, Karkaroff, from turning all of them in,\" muttered Moody. \"Yet you say you have some names for us?\" said Mr. Crouch. \"I - I do,\" said Karkaroff breathlessly.  \"And these were important supporters, mark you.  People I saw with my own eyes doing his bidding.  I give this information as a sign that I fully and totally renounce him, and am filled with a remorse so deep I can barely -\" \"These names are?\" said Mr. Crouch sharply. Karkaroff drew a deep breath. \"There was Antonin Dolohov,\" he said.  \"I - I saw him torture countless Muggles and - and non-supporters of the Dark Lord.\" \"And helped him do it,\" murmured Moody. \"We have already apprehended Dolohov,\" said Crouch.  \"He was caught shortly after yourself.\" \"Indeed?\" said Karkaroff, his eyes widening.  \"I - I am delighted to hear it!\" But he didn't look it.  Harry could tell that this news had come as a real blow to him. One of his names was worthless. \"Any others?\"  said Crouch coldly. \"Why, yes ... there was Rosier,\" said Karkaroff hurriedly. \"Evan Rosier.\" \"Rosier is dead,\" said Crouch.  \"He was caught shortly after you were too.  He preferred to fight rather than come quietly and was killed in the struggle.\" \"Took a bit of me with him, though,\" whispered Moody to Harry's right. Harry looked around at him once more, and saw him indicating the large chunk out of his nose to Dumbledore."
}