{
  "id": "766eac0766cc24c1994bdf1526d14589e6fddd4f",
  "text": "  When I want a mountain scaled, I call on Stonesnake. Should I need to put an arrow through the eye of some foe across a windy battlefield, I summon Squire Dalbridge. Ebben can make any man give up his secrets. To lead men you must know them, Jon Snow. I know more of you now than I did this morning.    And if I had slain her?  asked Jon.   She would be dead, and I would know you better than I had before. But enough talk. You ought be sleeping. We have leagues to go, and dangers to face. You will need your strength.   Jon did not think sleep would come easily, but he knew the Halfhand was right. He found a place out of the wind, beneath an overhang of rock, and took off his cloak to use it for a blanket.  Ghost,  he called.  Here. To me.  He always slept better with the great white wolf beside him; there was comfort in the smell of him, and welcome warmth in that shaggy pale fur. This time, though, Ghost did no more than look at him. Then he turned away and padded around the garrons, and quick as that he was gone. He wants to hunt, Jon thought. Perhaps there were goats in these mountains. The shadowcats must live on something.  Just don’t try and bring down a ’cat,  he muttered. Even for a direwolf, that would be dangerous. He tugged his cloak over him and stretched out beneath the rock.  When he closed his eyes, he dreamed of direwolves.  There were five of them when there should have been six, and they were scattered, each apart from the others. He felt a deep ache of emptiness, a sense of incompleteness. The forest was vast and cold, and they were so small, so lost. His brothers were out there somewhere, and his sister, but he had lost their scent. He sat on his haunches and lifted his head to the darkening sky, and his cry echoed through the forest, a long lonely mournful sound. As it died away, he pricked up his ears, listening for an answer, but the only sound was the sigh of blowing snow.  Jon?  The call came from behind him, softer than a whisper, but strong too. Can a shout be silent? He turned his head, searching for his brother, for a glimpse of a lean grey shape moving beneath the trees, but there was nothing, only…  A weirwood.  It seemed to sprout from solid rock, its pale roots twisting up from a myriad of fissures and hairline cracks. The tree was slender compared to other weirwoods he had seen, no more than a sapling, yet it was growing as he watched, its limbs thickening as they reached for the sky. Wary, he circled the smooth white trunk until he came to the face. Red eyes looked at him. Fierce eyes they were, yet glad to see him. The weirwood had his brother’s face. Had his brother always had three eyes?  Not always, came the silent shout. Not before the crow.  He sniffed at the bark, smelled wolf and tree and boy, but behind that there were other scents, the rich brown smell of warm earth and the hard grey smell of stone and something else, something terrible. Death, he knew. He was smelling death. He cringed back, his hair bristling, and bared his fangs.  Don’t be afraid, I like it in the dark. No one can see you, but you can see them. But first you have to open your eyes. See? Like this. And the tree reached down and touched him.  And suddenly he was back in the mountains, his paws sunk deep in a drift of snow as he stood upon the edge of a great precipice. Before him the Skirling Pass opened up into airy emptiness, and a long vee-shaped valley lay spread beneath him like a quilt, awash in all the colors of an autumn afternoon.  A vast blue-white wall plugged one end of the vale, squeezing between the mountains as if it had shouldered them aside, and for a moment he thought he had dreamed himself back to Castle Black. Then he realized he was looking at a river of ice several thousand feet high. Under that glittering cold cliff was a great lake, its deep cobalt waters reflecting the snowcapped peaks that ringed it. There were men down in the valley, he saw now; many men, thousands, a huge host. Some were tearing great holes in the half-frozen ground, while others trained for war. He watched as a swarming mass of riders charged a shield wall, astride horses no larger than ants. The sound of their mock battle was a rustling of steel leaves, drifting faintly on the wind. Their encampment had no plan to it; he saw no ditches, no sharpened stakes, no neat rows of horse lines. Everywhere crude earthen shelters and hide tents sprouted haphazardly, like a pox on the face of the earth. He spied untidy mounds of hay, smelled goats and sheep, horses and pigs, dogs in great profusion. Tendrils of dark smoke rose from a thousand cookfires.  This is no army, no more than it is a town. This is a whole people come together.  Across the long lake, one of the mounds moved. He watched it more closely and saw that it was not dirt at all, but alive, a shaggy lumbering beast with a snake for a nose and tusks larger than those of the greatest boar that had ever lived. And the thing riding it was huge as well, and his shape was wrong, too thick in the leg and hips to be a man."
}