{
  "id": "76b077bda0e68557c4a4f0a1df5d1e455b43ec72",
  "text": "  There  was a wide  arch  leading to a   courtyard between the two wings, and on the left under the arch there was  a   large doorway reached by  a few  broad  steps. The  door  was open and light  streamed out of it. Above the arch  there was a lamp, and beneath it swung a   large signboard: a  fat white pony reared up on  its hind legs. Over the door  was painted in white letters: THE PRANCING PONY by BARLIMAN   BUTTERBUR. Many  of the lower windows showed lights behind thick curtains.    ####-     As they hesitated outside in the gloom, someone began singing  a  merry  song  inside, and many  cheerful voices  joined loudly in the  chorus.  They  listened  to  this encouraging sound for a moment and  then  got  off  their  ponies. The song ended and there was a burst of laughter and clapping.       They led their ponies under the arch, and leaving  them standing in the  yard they climbed up  the steps. Frodo went forward and nearly bumped into a   short fat man with a bald head and a red  face. He had a white apron on, and  was  bustling out of  one door and in through another, carrying a tray laden  with full mugs.        'Can we--' began Frodo.       'Half a minute, if  you please!' shouted the man over his shoulder, and  vanished into a babel of voices and a cloud of smoke. In a moment he was out  again, wiping his hands on his apron.       'Good  evening, little master!' he said, bending down. 'What may you be  wanting?'       'Beds for four, and stabling for five ponies,  if that can be  managed.  Are you Mr. Butterbur?'       'That's right! Barliman is my name. Barliman Butterbur at your service!   You 're from the Shire,  eh?' he said, and  then suddenly he clapped his hand   to  his forehead, as  if  trying to remember something. 'Hobbits!' he cried.  'Now what does that remind me of? Might I ask your names, sir?'       'Mr. Took and Mr. Brandybuck,' said   Frodo; 'and this is Sam Gamgee. My  name is Underhill.'       'There  now!' said  Mr.  Butterbur,  snapping  his fingers. 'It's  gone  again! But it'll come back, when I have time to  think. I'm run off my feet;  but I'll see what I can  do for you. We don't often get a party out  of  the  Shire nowadays, and I should be sorry not to make you welcome. But  there is  such  a crowd already in the house  tonight  as there  hasn't been for  long  enough. It never rains but it pours, we say in Bree.       'Hi! Nob!' he shouted. 'Where  are  you, you woolly-footed  slow-coach?   Nob!'       'Coming,  sir! Coming!' A cheery-looking hobbit bobbed out  of  a door,  and  seeing the  travellers, stopped short and stared  at  them  with  great  interest.        'Where's  Bob?'  asked the landlord.  'You don't  know? Well find  him!   Double sharp! I haven't got six legs, nor six eyes neither! Tell Bob there's  five ponies that have to be stabled. He must find room somehow.' Nob trotted   ####-off with a grin and a wink.       'Well, now, what wa s  I going to  say?' said Mr. Butterbur, tapping his  forehead. 'One thing drives out another, so to speak. I'm that busy tonight,  my head is going round. There's  a party that came up the Greenway from  down  South last night - and that was strange enough to  begin with. Then there's a   travelling  company  of dwarves  going  West come  in  this evening. And now  there's you.  If you weren't  hobbits, I  doubt  if  we could house you. But  we've  got  a room or two  in the  north wing  that  were made  special  for  hobbits, when this  place was built.  On  the  ground  floor as they usually  prefer; round windows and all as they like it. I hope you'll be comfortable.  You'll be wanting supper, I don't doubt. As soon as may be. This way now!'       He led them a short  way  down a passage, and opened a door. 'Here is a   nice little parlour!' he said. 'I hope it will suit. Excuse me now. I'm that  busy. No time for talking. I must be trotting. It's hard  work for two legs,   but I  don't get thinner. I'll look  in again  la ter.  If you want anything,  ring the hand-bell, and Nob will come. If he don't come, ring and shout!'       Off he went at last, and left them feeling rather breathless. He seemed  capable of  an endless stream of talk, however busy he might be. They  found  themselves in a small and cosy room. There  was a bit of bright fire burning   on  the hearth,  and in front of it  were some low  and comfortable  chairs.   There  was a round table, already spread with a white cloth, and on it was a   large hand-bell. But  Nob, the  hobbit servant, came bustling in long before  they thought of ringing. He brought candles and a tray full of plates.        'Will you be wanting anything  to drink, masters?' he asked. 'And shall  I show you the bedrooms, while your supper is got ready? '       They were  washed and in the middle of good deep mugs  of beer when Mr.  Butterbur and  Nob  came in again. In a twinkling the table was laid.  There  was hot soup, cold meats, a  blackberry  tart,  new loaves, slabs of butter,  and half  a ripe  cheese: good plain food, as good  as the Shire could show,  and homelike enough to  dispel  the last of  Sam's misgivings (already  much  relieved by the excellence of the beer)."
}