{
  "id": "76c9d348f607904d454899115d58fcb325cd483a",
  "text": " Without a wall Castle Black could not be held; Donal Noye knew that as well as any.  The castle does them no good,  the armorer told his little garrison.  Kitchens, common hall, stables, even the towers… let them take it all. We’ll empty the armory and move what stores we can to the top of the Wall, and make our stand around the gate.   So Castle Black had a wall of sorts at last, a crescent-shaped barricade ten feet high made of stores; casks of nails and barrels of salt mutton, crates, bales of black broadcloth, stacked logs, sawn timbers, fire-hardened stakes, and sacks and sacks of grain. The crude rampart enclosed the two things most worth defending; the gate to the north, and the foot of the great wooden switchback stair that clawed and climbed its way up the face of the Wall like a drunken thunderbolt, supported by wooden beams as big as tree trunks driven deep into the ice.  The last few moles were still making the long climb, Jon saw, urged on by his brothers. Grenn was carrying a little boy in his arms, while Pyp, two flights below, let an old man lean upon his shoulder. The oldest villagers still waited below for the cage to make its way back down to them. He saw a mother pulling along two children, one on either hand, as an older boy ran past her up the steps. Two hundred feet above them, Sky Blue Su and Lady Meliana (who was no lady, all her friends agreed) stood on a landing, looking south. They had a better view of the smoke than he did, no doubt. Jon wondered about the villagers who had chosen not to flee. There were always a few, too stubborn or too stupid or too brave to run, a few who preferred to fight or hide or bend the knee. Maybe the Thenns would spare them.  The thing to do would be to take the attack to them, he thought. With fifty rangers well mounted, we could cut them apart on the road. They did not have fifty rangers, though, nor half as many horses. The garrison had not returned, and there was no way to know just where they were, or even whether the riders that Noye had sent out had reached them.  We are the garrison, Jon told himself, and look at us. The brothers Bowen Marsh had left behind were old men, cripples, and green boys, just as Donal Noye had warned him. He could see some wrestling barrels up the steps, others on the barricade; stout old Kegs, as slow as ever, Spare Boot hopping along briskly on his carved wooden leg, half-mad Easy who fancied himself Florian the Fool reborn, Dornish Dilly, Red Alyn of the Rosewood, Young Henly (well past fifty), Old Henly (well past seventy), Hairy Hal, Spotted Pate of Maidenpool. A couple of them saw Jon looking down from atop the King’s Tower and waved up at him. Others turned away. They still think me a turncloak. That was a bitter draft to drink, but Jon could not blame them. He was a bastard, after all. Everyone knew that bastards were wanton and treacherous by nature, having been born of lust and deceit. And he had made as many enemies as friends at Castle Black… Rast, for one. Jon had once threatened to have Ghost rip his throat out unless he stopped tormenting Samwell Tarly, and Rast did not forget things like that. He was raking dry leaves into piles under the stairs just now, but every so often he stopped long enough to give Jon a nasty look.   No,  Donal Noye roared at three of the Mole’s Town men, down below.  The pitch goes to the hoist, the oil up the steps, crossbow bolts to the fourth, fifth, and sixth landings, spears to first and second. Stack the lard under the stair, yes, there, behind the planks. The casks of meat are for the barricade. Now, you poxy plow pushers, NOW!   He has a lord’s voice, Jon thought. His father had always said that in battle a captain’s lungs were as important as his sword arm.  It does not matter how brave or brilliant a man is, if his commands cannot be heard,  Lord Eddard told his sons, so Robb and he used to climb the towers of Winterfell to shout at each other across the yard. Donal Noye could have drowned out both of them. The moles all went in terror of him, and rightfully so, since he was always threatening to rip their heads off.  Three-quarters of the village had taken Jon’s warning to heart and come to Castle Black for refuge. Noye had decreed that every man still spry enough to hold a spear or swing an axe would help defend the barricade, else they could damn well go home and take their chances with the Thenns. He had emptied the armory to put good steel in their hands; big double-bladed axes, razor-sharp daggers, longswords, maces, spiked morningstars. Clad in studded leather jerkins and mail hauberks, with greaves for their legs and gorgets to keep their heads on their shoulders, a few of them even looked like soldiers. In a bad light. If you squint.  Noye had put the women and children to work as well. Those too young to fight would carry water and tend the fires, the Mole’s Town midwife would assist Clydas and Maester Aemon with any wounded, and Three-Finger Hobb suddenly had more spit boys, kettle stirrers, and onion choppers than he knew what to do with."
}