{
  "id": "779bff9fdeef80d2e8552d98ff6834a1a0118773",
  "text": " \"Ready, Sirius?\" said Lupin.  Black had already retrieved Snape's wand from the bed. He approached Lupin and the struggling rat, and his wet eyes suddenly seemed to be burning in his face.  \"Together?\" he said quietly.  \"I think so,,, said Lupin, holding Scabbers tightly in one hand and his wand in the other. \"On the count of three. One -- two -- THREE!\"  A flash of blue-white light erupted from both wands; for a moment, Scabbers was frozen in midair, his small gray form twisting madly -- Ron yelled -- the rat fell and hit the floor. There was another blinding flash of light and then --  It was like watching a speeded-up film of a growing tree. A head was shooting upward from the ground; limbs were sprouting; a moment later, a man was standing where Scabbers had been, cringing and wringing his hands. Crookshanks was spitting and snarling on the bed; the hair on his back was standing up.  He was a very short man, hardly taller than Harry and Hermione. His thin, colorless hair was unkempt and there was a large bald patch on top. He had the shrunken appearance of a plump man who has lost a lot of weight in a short time. His skin looked grubby, almost like Scabbers's fur, and something of the rat lingered around his pointed nose and his very small, watery eyes. He looked around at them all, his breathing fast and shallow. Harry saw his eyes dart to the door and back again.  \"Well, hello, Peter,\" said Lupin pleasantly, as though rats frequently erupted into old school friends around him. \"Long time, no see.  \"S -- Sirius... R -- Remus...\" Even Pettigrew's voice was squeaky. Again, his eyes darted toward the door. \"My friends... my old friends...\"  Black's wand arm rose, but Lupin seized him around the wrist, gave him a warning took, then turned again to Pettigrew, his voice light and casual.  \"We've been having a little chat, Peter, about what happened the night Lily and James died. You might have missed the finer points while you were squeaking around down there on the bed --\"  \"Remus,\" gasped Pettigrew, and Harry could see beads of sweat breaking out over his pasty face, \"you don't believe him, do you...? He tried to kill me, Remus....\"  \"So we've heard,\" said Lupin, more coldly. \"I'd like to clear up one or two little matters with you, Peter, if you'll be so --\"  \"He's come to try and kill me again!\" Pettigrew squeaked suddenly, pointing at Black, and Harry saw that he used his middle finger, because his index was missing. \"He killed Lily and James and now he's going to kill me too.... You've got to help me, Remus....\"  Black's face looked more skull-like than ever as he stared at Pettigrew with his fathomless eyes.  \"No one's going to try and kill you until we've sorted a few things out,\" said Lupin.  \"Sorted things out?\" squealed Pettigrew, looking wildly about him once more, eyes taking in the boarded windows and, again' the only door. \"I knew he'd come after me! I knew he'd be back for me! I've been waiting for this for twelve years!\"  \"You knew Sirius was going to break out of Azkaban?\" said Lupin, his brow furrowed. \"When nobody has ever done it before?\"  \"He's got dark powers the rest of us can only dream of!\" Pettigrew shouted shrilly. \"How else did he get out of there? I suppose He-Who-Must-Not-Be-Named taught him a few tricks!\"  Black started to laugh, a horrible, mirthless laugh that filled the whole room.  \"Voldemort, teach me tricks?\" he said.  Pettigrew flinched as though Black had brandished a whip at him.  \"What, scared to hear your old master's name?\" said Black. I don't blame you, Peter. His lot aren't very happy with you, are they?\"  \"Don't know what you mean, Sirius --\" muttered Pettigrew, his breathing faster than ever. His whole face was shining with sweat now.  \"You haven't been hiding from me for twelve years,\" said Black. \"You've been hiding from Voldemort's old supporters. I heard things in Azkaban, Peter... They all think you're dead, or you'd have to answer to them.... I've heard them screaming all sorts of things in their sleep. Sounds like they think the double-crosser double-crossed them. Voldemort went to the Potters' on your information... and Voldemort met his downfall there. And not all Voldemort's supporters ended up in Azkaban, did they? There are still plenty out here, biding their time, pretending they've seen the error of their ways.  If they ever got wind that you were still alive, Peter --\"  \"Don't know... what you're talking about...,\" said Pettigrew again, more shrilly than ever. He wiped his face on his sleeve and looked up at Lupin. \"You don't believe this -- this madness, Remus --\"  \"I must admit, Peter, I have difficulty in understanding why an innocent man would want to spend twelve years as a rat,\" said Lupin evenly.  \"Innocent, but scared!\" squealed Pettigrew. \"If Voldemort's supporters were after me, it was because I put one of their best men in Azkaban -- the spy, Sirius Black!\"  Black's face contorted.  \"How dare you,\" he growled, sounding suddenly like the bearsized dog he had been."
}