{
  "id": "77fbcc17fe979bf74c2acafa69a568f69be3906d",
  "text": "  'I have  come back   here, for I  must have a  little peace,  alone. You should sleep,  in  a bed  while you still  may. At the sunrise I  shall take you to the  Lord Denethor   again. No, when the  summons  comes, not at sunrise. The Darkness has begun.  There will be no dawn.'     ####-   Chapter 2. The Passing of the Grey Company            Gandalf was gone, and the thudding  hoofs of Shadowfax were lost in the   night, when Merry came  back to Aragorn. He  had only a light bundle, for he  had lost his pack at Parth  Galen, and all he had was a few useful things he  had picked up among the wreckage of  Isengard. Hasufel was  already saddled.  Legolas and Gimli with their horse stood close by.       'So four of the Company still remain,'  said Aragorn. 'We  will ride on  together.  But  we  shall  not  go alone,  as  I  thought. The  king is  now  determined  to set out at  once.  Since the coming of the winged  shadow, he  desires to return to the hills under cover of night.'       'And then whither?' said Legolas.        'I cannot say yet,' Aragorn answered. 'As for the king, he will  go  to  the muster that he commanded at Edoras,  four  nights from now. And there, I  think, he will hear tidings of war, and the Riders of Rohan  will go down to  Minas Tirith. But for myself, and any that will go with me . . .'       'I for one!' cried Legolas. 'And Gimli with him!' said the Dwarf.       'Well, for myself,' said Aragorn, 'it is dark before me. I must go down  also to Minas Tirith, but I  do not yet see the  road. An hour long prepared  approaches.'       'Don't leave me behind!'  said Merry. 'I have not been of much use yet;  but I don't want to be laid aside, like baggage to be called for when all is  over. I don't think the Riders will want to be bothered with me now. Though,  of  course, the  king did say that I was to sit by  him when  he came to his  house and tell him all about the Shire.'       'Yes,' said Aragorn, 'and your road lies with him, I  think, Merry. But  do  not  look for mirth at  the ending. It will be long, I fear, ere Thjoden  sits  at ease  again  in  Meduseld.  Many hopes will wither  in this  bitter   Spring.'       Soon all were ready  to depart:  twenty -four horses, with Gimli  behind  Legolas,  and Merry  in front of Aragorn. Presently they were riding swiftly   through the night. They had not long passed the mounds at the Fords of Isen,  when a Rider galloped up from the rear of their line.       'My  lord,'  he said to  the king, 'there are horsemen behind us. As we  crossed the fords I thought that  I heard them. Now we  are sure.  They  are   ####-overtaking us, riding hard.'       Thjoden at once called a halt. The Riders turned about and seized their  spears.  Aragorn  dismounted and  set Merry on the  ground, and drawing  his  sword he stood by the king's stirrup. Jomer and his esquire rode back to the  rear. Merry felt more  like unneeded baggage than  ever, and he wondered, if  there was a fight, what  he should do. Supposing the king's small escort was  trapped and overcome, but  he escaped into the darkness  - alone in the wild   fields of Rohan  with no idea of where he was in all the  endless miles? 'No  good!' he thought. He drew his sword and tightened his belt.       The sinking moon was obscured by a great sailing cloud, but suddenly it  rode  out clear  again. Then they all  heard the sound of  hoofs, and at the  same moment they saw dark shapes coming  swiftly on the path from the fords.   The moonlight glinted here and  there  on the points of spears. The number of  the pursuers could  not be told, but they seemed  no fewer than  the  king's  escort, at the least.       When they were some  fifty paces off,  Jomer  cried  in  a  loud voice:  'Halt! Halt! Who rides in Rohan?'       The  pursuers  brought  their  steeds  to  a sudden  stand.  A  silence  followed: and  then in the  moonlight, a  horseman could be seen dismounting  and walking  slowly  forward. His hand  showed white as  he held it up, palm  outward, in token of pea ce; but the king's men gripped their weapons. At ten  paces the man stopped. He was  tall,  a dark standing shadow. Then his clear  voice rang out.       'Rohan? Rohan did you say?  That is  a glad word.  We seek that land in  haste from long afar.'       'You have found it,' said Jomer. 'When you crossed the fords yonder you   entered it. But it is the realm of Thjoden  the King. None ride here save by  his leave. Who are you? And what is your haste?'       'Halbarad D®nadan, Ranger  of the North I am,' cried the man. 'We  seek   one Aragorn son of Arathorn, and we heard that he was in Rohan.'       'And  you have  found  him also!' cried  Aragorn. Giving his  reins  to  Merry, he ran  forward and embraced  the newcomer. 'Halbarad!' he said.  'Of  all joys this is the least expected!'       Merry breathed a sigh of relief. He had thought that this was some last  trick of Saruman's, to waylay  the king  while he  had  only a few men about  him;  but it seemed that there would be no need to die in Thjoden's defence,   not yet at any rate."
}