{
  "id": "792f959f9d74ce76198e37cb5a5b41180d100d0e",
  "text": " Ser Jorah says that he was the last of the dragons.   Khal Drogo looked down at her. His face was a copper mask, yet under the long black mustache, drooping beneath the weight of its gold rings, she thought she glimpsed the shadow of a smile.  Is good name, Dan Ares wife, moon of my life,  he said.  They rode to the lake the Dothraki called the Womb of the World, surrounded by a fringe of reeds, its water still and calm. A thousand thousand years ago, Jhiqui told her, the first man had emerged from its depths, riding upon the back of the first horse.  The procession waited on the grassy shore as Dany stripped and let her soiled clothing fall to the ground. Naked, she stepped gingerly into the water. Irri said the lake had no bottom, but Dany felt soft mud squishing between her toes as she pushed through the tall reeds. The moon floated on the still black waters, shattering and re-forming as her ripples washed over it. Goose pimples rose on her pale skin as the coldness crept up her thighs and kissed her lower lips. The stallion’s blood had dried on her hands and around her mouth. Dany cupped her fingers and lifted the sacred waters over her head, cleansing herself and the child inside her while the khal and the others looked on. She heard the old women of the dosh khaleen muttering to each other as they watched, and wondered what they were saying.  When she emerged from the lake, shivering and dripping, her handmaid Doreah hurried to her with a robe of painted sandsilk, but Khal Drogo waved her away. He was looking on her swollen breasts and the curve of her belly with approval, and Dany could see the shape of his manhood pressing through his horsehide trousers, below the heavy gold medallions of his belt. She went to him and helped him unlace. Then her huge khal took her by the hips and lifted her into the air, as he might lift a child. The bells in his hair rang softly.  Dany wrapped her arms around his shoulders and pressed her face against his neck as he thrust himself inside her. Three quick strokes and it was done.  The stallion who mounts the world,  Drogo whispered hoarsely. His hands still smelled of horse blood. He bit at her throat, hard, in the moment of his pleasure, and when he lifted her off, his seed filled her and trickled down the inside of her thighs. Only then was Doreah permitted to drape her in the scented sandsilk, and Irri to fit soft slippers to her feet.  Khal Drogo laced himself up and spoke a command, and horses were brought to the lakeshore. Cohollo had the honor of helping the khaleesi onto her silver. Drogo spurred his stallion, and set off down the godsway beneath the moon and stars. On her silver, Dany easily kept pace.  The silk tenting that roofed Khal Drogo’s hall had been rolled up tonight, and the moon followed them inside. Flames leapt ten feet in the air from three huge stone-lined firepits. The air was thick with the smells of roasting meat and curdled, fermented mare’s milk. The hall was crowded and noisy when they entered, the cushions packed with those whose rank and name were not sufficient to allow them at the ceremony. As Dany rode beneath the arched entry and up the center aisle, every eye was on her. The Dothraki screamed out comments on her belly and her breasts, hailing the life within her. She could not understand all they shouted, but one phrase came clear.  The stallion that mounts the world,  she heard, bellowed in a thousand voices.  The sounds of drums and horns swirled up into the night. Half-clothed women spun and danced on the low tables, amid joints of meat and platters piled high with plums and dates and pomegranates. Many of the men were drunk on clotted mare’s milk, yet Dany knew no arakhs would clash tonight, not here in the sacred city, where blades and bloodshed were forbidden.  Khal Drogo dismounted and took his place on the high bench. Khal Jommo and Khal Ogo, who had been in Vaes Dothrak with their khalasars when they arrived, were given seats of high honor to Drogo’s right and left. The bloodriders of the three khals sat below them, and farther down Khal Jommo’s four wives.  Dany climbed off her silver and gave the reins to one of the slaves. As Doreah and Irri arranged her cushions, she searched for her brother. Even across the length of the crowded hall, Viserys should have been conspicuous with his pale skin, silvery hair, and beggar’s rags, but she did not see him anywhere.  Her glance roamed the crowded tables near the walls, where men whose braids were even shorter than their manhoods sat on frayed rugs and flat cushions around the low tables, but all the faces she saw had black eyes and copper skin. She spied Ser Jorah Mormont near the center of the hall, close to the middle firepit. It was a place of respect, if not high honor; the Dothraki esteemed the knight’s prowess with a sword. Dany sent Jhiqui to bring him to her table. Mormont came at once, and went to one knee before her.  Khaleesi,  he said,  I am yours to command.   She patted the stuffed horsehide cushion beside her."
}