{
  "id": "79adbbe5841496f74bf67a53ace2ff41a77e1abc",
  "text": " Osha propped Bran up against Lord Rickard’s stone wolf as she hurried to assist the maester. In the light of the guttering torch, shadow wolves twenty feet tall fought on the wall and roof.   Shaggy,  a small voice called. When Bran looked up, his little brother was standing in the mouth of Father’s tomb. With one final snap at Summer’s face, Shaggydog broke off and bounded to Rickon’s side.  You let my father be,  Rickon warned Luwin.  You let him be.    Rickon,  Bran said softly.  Father’s not here.    Yes he is. I saw him.  Tears glistened on Rickon’s face.  I saw him last night.    In your dream…?   Rickon nodded.  You leave him. You leave him be. He’s coming home now, like he promised. He’s coming home.   Bran had never seen Maester Luwin took so uncertain before. Blood dripped down his arm where Shaggydog had shredded the wool of his sleeve and the flesh beneath.  Osha, the torch,  he said, biting through his pain, and she snatched it up before it went out. Soot stains blackened both legs of his uncle’s likeness.  That… that beast,  Luwin went on,  is supposed to be chained up in the kennels.   Rickon patted Shaggydog’s muzzle, damp with blood.  I let him loose. He doesn’t like chains.  He licked at his fingers.   Rickon,  Bran said,  would you like to come with me?    No. I like it here.    It’s dark here. And cold.    I’m not afraid. I have to wait for Father.    You can wait with me,  Bran said.  We’ll wait together, you and me and our wolves.  Both of the direwolves were licking wounds now, and would bear close watching.   Bran,  the maester said firmly,  I know you mean well, but Shaggydog is too wild to run loose. I’m the third man he’s savaged. Give him the freedom of the castle and it’s only a question of time before he kills someone. The truth is hard, but the wolf has to be chained, or…  He hesitated.  …or killed, Bran thought, but what he said was,  He was not made for chains. We will wait in your tower, all of us.    That is quite impossible,  Maester Luwin said.  Osha grinned.  The boy’s the lordling here, as I recall.  She handed Luwin back his torch and scooped Bran up into her arms again.  The maester’s tower it is.    Will you come, Rickon?   His brother nodded.  If Shaggy comes too,  he said, running after Osha and Bran, and there was nothing Maester Luwin could do but follow, keeping a wary eye on the wolves.  Maester Luwin’s turret was so cluttered that it seemed to Bran a wonder that he ever found anything. Tottering piles of books covered tables and chairs, rows of stoppered jars lined the shelves, candle stubs and puddles of dried wax dotted the furniture, the bronze Myrish lens tube sat on a tripod by the terrace door, star charts hung from the walls, shadow maps lay scattered among the rushes, papers, quills, and pots of inks were everywhere, and all of it was spotted with droppings from the ravens in the rafters. Their strident quorks drifted down from above as Osha washed and cleaned and bandaged the maester’s wounds, under Luwin’s terse instruction.  This is folly,  the small grey man said while she dabbed at the wolf bites with a stinging ointment.  I agree that it is odd that both you boys dreamed the same dream, yet when you stop to consider it, it’s only natural. You miss your lord father, and you know that he is a captive. Fear can fever a man’s mind and give him queer thoughts. Rickon is too young to comprehend—    I’m four now,  Rickon said. He was peeking through the lens tube at the gargoyles on the First Keep. The direwolves sat on opposite sides of the large round room, licking their wounds and gnawing on bones.   —too young, and—ooh, seven hells, that burns, no, don’t stop, more. Too young, as I say, but you, Bran, you’re old enough to know that dreams are only dreams.    Some are, some aren’t.  Osha poured pale red firemilk into a long gash. Luwin gasped.  The children of the forest could tell you a thing or two about dreaming.   Tears were streaming down the maester’s face, yet he shook his head doggedly.  The children… live only in dreams. Now. Dead and gone. Enough, that’s enough. Now the bandages. Pads and then wrap, and make it tight, I’ll be bleeding.    Old Nan says the children knew the songs of the trees, that they could fly like birds and swim like fish and talk to the animals,  Bran said.  She says that they made music so beautiful that it made you cry like a little baby just to hear it.    And all this they did with magic,  Maester Luwin said, distracted.  I wish they were here now. A spell would heal my arm less painfully, and they could talk to Shaggydog and tell him not to bite.  He gave the big black wolf an angry glance out of the corner of his eye.  Take a lesson, Bran. The man who trusts in spells is dueling with a glass sword. As the children did. Here, let me show you something.  He stood abruptly, crossed the room, and returned with a green jar in his good hand.  Have a look at these,  he said as he pulled the stopper and shook out a handful of shiny black arrowheads."
}