{
  "id": "7a305510e5321d88920b6b61e0da58d5687fa6eb",
  "text": "  Robb’s to marry some Frey girl, you told me so yourself, and the Walders say the same. He’ll have sons, and they’ll be the lords of Winterfell after him, not me.    It may be so, Bran,  Ser Rodrik said,  but I was wed three times and my wives gave me daughters. Now only Beth remains to me. My brother Martyn fathered four strong sons, yet only Jory lived to be a man. When he was slain, Martyn’s line died with him. When we speak of the morrow nothing is ever certain.   Leobald Tallhart had his turn the following day. He spoke of weather portents and the slack wits of smallfolk, and told how his nephew itched for battle.  Benfred has raised his own company of lances. Boys, none older than nineteen years, but every one thinks he’s another young wolf. When I told them they were only young rabbits, they laughed at me. Now they call themselves the Wild Hares and gallop about the country with rabbitskins tied to the ends of their lances, singing songs of chivalry.   Bran thought that sounded grand. He remembered Benfred Tallhart, a big bluff loud boy who had often visited Winterfell with his father, Ser Helman, and had been friendly with Robb and with Theon Greyjoy. But Ser Rodrik was clearly displeased by what he heard.  If the king were in need of more men, he would send for them,  he said.  Instruct your nephew that he is to remain at Torrhen’s Square, as his lord father commanded.    I will, ser,  said Leobald, and only then raised the matter of Lady Hornwood. Poor thing, with no husband to defend her lands nor son to inherit. His own lady wife was a Hornwood, sister to the late Lord Halys, doubtless they recalled.  An empty hall is a sad one. I had a thought to send my younger son to Lady Donella to foster as her own. Beren is near ten, a likely lad, and her own nephew. He would cheer her, I am certain, and perhaps he would even take the name Hornwood…    If he were named heir?  suggested Maester Luwin.   …so the House might continue,  finished Leobald.  Bran knew what to say.  Thank you for the notion, my lord,  he blurted out before Ser Rodrik could speak.  We will bring the matter to my brother Robb. Oh, and Lady Hornwood.   Leobald seemed surprised that he had spoken.  I’m grateful, my prince,  he said, but Bran saw pity in his pale blue eyes, mingled perhaps with a little gladness that the cripple was, after all, not his son. For a moment he hated the man.  Maester Luwin liked him better, though.  Beren Tallhart may well be our best answer,  he told them when Leobald had gone.  By blood he is half Hornwood. If he takes his uncle’s name…    …he will still be a boy,  said Ser Rodrik,  and hard-pressed to hold his lands against the likes of Mors Umber or this bastard of Roose Bolton’s. We must think on this carefully. Robb should have our best counsel before he makes his decision.    It may come down to practicalities,  said Maester Luwin.  Which lord he most needs to court. The riverlands are part of his realm, he may wish to cement the alliance by wedding Lady Hornwood to one of the lords of the Trident. A Blackwood, perhaps, or a Frey—    Lady Hornwood can have one of our Freys,  said Bran.  She can have both of them if she likes.    You are not kind, my prince,  Ser Rodrik chided gently.  Neither are the Walders. Scowling, Bran stared down at the table and said nothing.  In the days that followed, ravens arrived from other lordly houses, bearing regrets. The bastard of the Dreadfort would not be joining them, the Mormonts and Karstarks had all gone south with Robb, Lord Locke was too old to dare the journey, Lady Flint was heavy with child, there was sickness at Widow’s Watch. Finally all of the principal vassals of House Stark had been heard from save for Howland Reed the crannogman, who had not set foot outside his swamps for many a year, and the Cerwyns whose castle lay a half day’s ride from Winterfell. Lord Cerwyn was a captive of the Lannisters, but his son, a lad of fourteen, arrived one bright, blustery morning at the head of two dozen lances. Bran was riding Dancer around the yard when they came through the gate. He trotted over to greet them. Cley Cerwyn had always been a friend to Bran and his brothers.   Good morrow, Bran,  Cley called out cheerfully.  Or must I call you Prince Bran now?    Only if you want.   Cley laughed.  Why not? Everyone else is a king or prince these days. Did Stannis write Winterfell as well?    Stannis? I don’t know.    He’s a king now too,  Cley confided.  He says Queen Cersei bedded her brother, so Joffrey is a bastard.    Joffrey the Illborn,  one of the Cerwyn knights growled.  Small wonder he’s faithless, with the Kingslayer for a father.    Aye,  said another,  the gods hate incest. Look how they brought down the Targaryens.   For a moment Bran felt as though he could not breathe. A giant hand was crushing his chest. He felt as though he was falling, and clutched desperately at Dancer’s reins.  His terror must have shown on his face.  Bran?  Cley Cerwyn said.  Are you unwell? It’s only another king."
}