{
  "id": "7c93d85d511e829f4f7c79fb7f344ff28bc93cf9",
  "text": "  Coming  to  a  rise  he  could  see  his  own  Hill  in  the  distance,  and  he  stopped  suddenly and said:     Roads go ever ever on,  Over rock and under tree,  By caves where never sun has shone,  By streams that never find the sea;    Over snow by winter sown,  And through the merry flowers of June,  Over grass and over stone,  And under mountains in the moon.    Roads go ever ever on  Under cloud and under star,   Yet feet that wandering have gone  Turn at last to home afar.      ####-Eyes that fire and sword have seen  And horror in the halls of stone  Look at last on meadows green  And trees and hills they long have known.     Gandalf  looked  at  him.  \"My  dear  Bilbo!\"  he  said.  \"Something  is  the  matter  with you! You are not the hobbit that you were.\"  And so they crossed the bridge and passed the mill by the river and came right  back  to  Bilbo's  own  door.  \"Bless  me!  What's  going  on?\"  he  cried.  There  was  a  great  commotion,  and  people  of  all  sorts,  respectable  and  unrespectable,  were  thick  round  the  door,  and many were  going  in  and  out-not even wiping  their  feet  on the mat, as Bilbo noticed with annoyance.  If he was surprised,  they were more surprised still. He had arrived back  in  the  middle  of an auction! There was a large notice in black and red hung on the gate,  stating  that  on  June  the  Twenty-second  Messrs.  Grubb,  Grubb,  and  Bun-owes  would  sell  by  auction  the  effects  of  the  late  Bilbo  Baggins  Esquire,  of  Bag-End,  Underhill,  Hobbiton.  Sale  to  commence  at  ten  o'clock  sharp.  It  was  now  nearly  lunch-time,  and most  of  the  things  had  already  been  sold,  for  various  prices  from  next  to  nothing  to  old  songs  (as  is  not  unusual  at  auctions).  Bilbo's  cousins  the  Sackville-Bagginses  were,  in  fact,  busy  measuring  his  rooms  to  see  if  their  own  furniture would  fit.  In  short Bilbo was  \"Presumed Dead,\"  and not  everybody  that  said so was sorry to find the presumption wrong.  The  return  of  Mr.  Bilbo  Baggins  created  quite  a  disturbance,  both  under  the  Hill  and  over  the Hill, and across  the Water;  it was a great deal more  than a nine  days' wonder.  The  legal  bother,  indeed,  lasted  for  years.  It was  quite  a  long  time  before Mr. Baggins was in fact admitted to be alive again. The people who had got  specially  good  bargains  at  the  Sale  took  a  deal  of  convincing;  and  in  the  end  to  sav6  time  Bilbo  had  to  buy  back  quite  a  lot  of  his  own  furniture.  Many  of  his  silver  spoons mysteriously  disappeared  and were  never  accounted  for.  Personally  he  suspected  the  Sackville-Bagginses.  On  their  side  they  never  admitted  that  the  returned  Baggins  was  genuine,  and  they  were  not  on  friendly  terms  with  Bilbo  ever after. They really had wanted to live in his nice hobbit-hole so very much.  Indeed Bilbo  found he had  lost more  than  spoons  – he had lost his reputation.  It  is  true  that  for  ever  after  he  remained  an  elf-friend,  and  had  the  honour  of  dwarves, wizards, and all such folk as ever passed that way; but he was no longer  quite  respectable.  He  was  in  fact  held  by  all  the  hobbits  of  the  neighbourhood to  be  'queer'-except by his nephews and nieces on  the Took  side, but even  they were  not  encouraged  in  their  friendship  by  their  elders.  I  am  sorry  to  say  he  did  not   ####-mind.  He  was  quite  content;  and  the  sound  of  the  kettle  on  his  hearth  was  ever  after more musical  than  it had been  even  in  the quiet days before  the Unexpected  Party. His sword he hung over  the mantelpiece. His coat of mail was arranged on  a  stand  in  the hall  (until he  lent  it  to  a Museum). His gold  and  silver was  largely  spent in presents, both useful and extravagant – which to a certain extent accounts  for  the  affection  of  his  nephews  and  his  nieces.  His  magic  ring  he  kept  a  great  secret,  for  he  chiefly  used  it  when  unpleasant  callers  came.  He  took  to  writing  poetry  and  visiting  the  elves;  and  though  many  shook  their  heads  and  touched  their  foreheads  and  said  \"Poor  old Baggins!\"  and  though  few  believed  any  of  his  tales,  he  remained  very  happy  to  the  end  of  his  days,  and  those  were  extraordinarily long.  One  autumn  evening  some  years  afterwards  Bilbo  was  sitting  in  his  study  writing  his  memoirs  –  he  thought  of  calling  them  \"There  and  Back  Again,  a  Hobbit's  Holiday\"  –  when  there  was  a  ring  at  the  door.  It  was  Gandalf  and  a  dwarf; and the dwarf was actually Balin.  \"Come  in!  Come  in!\"  said  Bilbo,  and  soon  they  were  settled  in  chairs  by  the  fire. If Balin noticed that Mr. Baggins' waistcoat was more extensive (and had real  gold buttons), Bilbo also noticed that Balm's beard was several inches longer, and  his jewelled belt was of great magnificence."
}