{
  "id": "7d8f40fb7abd02ce016a192612981103104ae76e",
  "text": "  My lady,  he said,  the Lord granted me a view of Riverrun. An island in a sea of fire, it seemed. The flames were leaping lions with long crimson claws. And how they roared! A sea of Lannisters, my lady. Riverrun will soon come under attack.    Arya felt as though he’d punched her in the belly.  No!    Sweetling,  said Thoros,  the flames do not lie. Sometimes I read them wrongly, blind fool that I am. But not this time, I think. The Lannisters will soon have Riverrun under siege.    Robb will beat them.  Arya got a stubborn look.  He’ll beat them like he did before.    Your brother may be gone,  said Thoros.  Your mother as well. I did not see them in the flames. This wedding the old one spoke of, a wedding on the Twins… she has her own ways of knowing things, that one. The weirwoods whisper in her ear when she sleeps. If she says your mother is gone to the Twins…   Arya turned on Tom and Lem.  If you hadn’t caught me, I would have been there. I would have been home.   Lord Beric paid no heed to her outburst.  My lady,  he said with weary courtesy,  would you know your grandfather’s brother by sight? Ser Brynden Tully, called the Blackfish? Would he know you, perchance?   Arya shook her head miserably. She had heard her mother speak of Ser Brynden Blackfish, but if she had ever met him herself it had been when she was too little to remember.   Small chance the Blackfish will pay good coin for a girl he doesn’t know,  said Tom.  Those Tullys are a sour, suspicious lot, he’s like to think we’re selling him false goods.    We’ll convince him,  Lem Lemoncloak insisted.  She will, or Harwin. Riverrun is closest. I say we take her there, get the gold, and be bloody well done with her.    And if the lions catch us inside the castle?  said Tom.  They’d like nothing better than to hang his lordship in a cage from the top of Casterly Rock.    I do not mean to be taken,  said Lord Beric. A final word hung unspoken in the air. Alive. They all heard it, even Arya, though it never passed his lips.  Still, we dare not go blindly here. I want to know where the armies are, the wolves and lions both. Sharna will know something, and Lord Vance’s maester will know more. Acorn Hall’s not far. Lady Smallwood will shelter us for a time while we send scouts ahead to learn…   His words beat at her ears like the pounding of a drum, and suddenly it was more than Arya could stand. She wanted Riverrun, not Acorn Hall; she wanted her mother and her brother Robb, not Lady Smallwood or some uncle she never knew. Whirling, she broke for the door, and when Harwin tried to grab her arm she spun away from him quick as a snake.  Outside the stables the rain was still falling, and distant lightning flashed in the west. Arya ran as fast as she could. She did not know where she was going, only that she wanted to be alone, away from all the voices, away from their hollow words and broken promises. All I wanted was to go to Riverrun. It was her own fault, for taking Gendry and Hot Pie with her when she left Harrenhal. She would have been better alone. If she had been alone, the outlaws would never have caught her, and she’d be with Robb and her mother by now. They were never my pack. If they had been, they wouldn’t leave me. She splashed through a puddle of muddy water. Someone was shouting her name, Harwin probably, or Gendry, but the thunder drowned them out as it rolled across the hills, half a heartbeat behind the lightning. The lightning lord, she thought angrily. Maybe he couldn’t die, but he could lie.  Somewhere off to her left a horse whinnied. Arya couldn’t have gone more than fifty yards from the stables, yet already she was soaked to the bone. She ducked around the corner of one of the tumbledown houses, hoping the mossy walls would keep the rain off, and almost bowled right into one of the sentries. A mailed hand closed hard around her arm.   You’re hurting me,  she said, twisting in his grasp.  Let go, I was going to go back, I…    Back?  Sandor Clegane’s laughter was iron scraping over stone.  Bugger that, wolf girl. You’re mine.  He needed only one hand to yank her off her feet and drag her kicking toward his waiting horse. The cold rain lashed them both and washed away her shouts, and all that Arya could think of was the question he had asked her. Do you know what dogs do to wolves?      Jaime   Though his fever lingered stubbornly, the stump was healing clean, and Qyburn said his arm was no longer in danger. Jaime was anxious to be gone, to put Harrenhal, the Bloody Mummers, and Brienne of Tarth all behind him. A real woman waited for him in the Red Keep.   I am sending Qyburn with you, to look after you on the way to King’s Landing,  Roose Bolton said on the morn of their departure.  He has a fond hope that your father will force the Citadel to give him back his chain, in gratitude.    We all have fond hopes. If he grows me back a hand, my father will make him Grand Maester.   Steelshanks Walton commanded Jaime’s escort; blunt, brusque, brutal, at heart a simple soldier."
}