{
  "id": "7dba6956b5443241ad0dca0c3520d018362768e0",
  "text": "  Well, no doubt the Starks have been terribly good to you. I’m certain Lady Stark treats you as if you were one of her own. And your brother Robb, he’s always been kind, and why not? He gets Winterfell and you get the Wall. And your father… he must have good reasons for packing you off to the Night’s Watch…    Stop it,  Jon Snow said, his face dark with anger.  The Night’s Watch is a noble calling!   Tyrion laughed.  You’re too smart to believe that. The Night’s Watch is a midden heap for all the misfits of the realm. I’ve seen you looking at Yoren and his boys. Those are your new brothers, Jon Snow, how do you like them? Sullen peasants, debtors, poachers, rapers, thieves, and bastards like you all wind up on the Wall, watching for grumkins and snarks and all the other monsters your wet nurse warned you about. The good part is there are no grumkins or snarks, so it’s scarcely dangerous work. The bad part is you freeze your balls off, but since you’re not allowed to breed anyway, I don’t suppose that matters.    Stop it!  the boy screamed. He took a step forward, his hands coiling into fists, close to tears.  Suddenly, absurdly, Tyrion felt guilty. He took a step forward, intending to give the boy a reassuring pat on the shoulder or mutter some word of apology.  He never saw the wolf, where it was or how it came at him. One moment he was walking toward Snow and the next he was flat on his back on the hard rocky ground, the book spinning away from him as he fell, the breath going out of him at the sudden impact, his mouth full of dirt and blood and rotting leaves. As he tried to get up, his back spasmed painfully. He must have wrenched it in the fall. He ground his teeth in frustration, grabbed a root, and pulled himself back to a sitting position.  Help me,  he said to the boy, reaching up a hand.  And suddenly the wolf was between them. He did not growl. The damned thing never made a sound. He only looked at him with those bright red eyes, and showed him his teeth, and that was more than enough. Tyrion sagged back to the ground with a grunt.  Don’t help me, then. I’ll sit right here until you leave.   Jon Snow stroked Ghost’s thick white fur, smiling now.  Ask me nicely.   Tyrion Lannister felt the anger coiling inside him, and crushed it out with a will. It was not the first time in his life he had been humiliated, and it would not be the last. Perhaps he even deserved this.  I should be very grateful for your kind assistance, Jon,  he said mildly.   Down, Ghost,  the boy said. The direwolf sat on his haunches. Those red eyes never left Tyrion. Jon came around behind him, slid his hands under his arms, and lifted him easily to his feet. Then he picked up the book and handed it back.   Why did he attack me?  Tyrion asked with a sidelong glance at the direwolf. He wiped blood and dirt from his mouth with the back of his hand.   Maybe he thought you were a grumkin.   Tyrion glanced at him sharply. Then he laughed, a raw snort of amusement that came bursting out through his nose entirely without his permission.  Oh, gods,  he said, choking on his laughter and shaking his head,  I suppose I do rather look like a grumkin. What does he do to snarks?    You don’t want to know.  Jon picked up the wineskin and handed it to Tyrion.  Tyrion pulled out the stopper, tilted his head, and squeezed a long stream into his mouth. The wine was cool fire as it trickled down his throat and warmed his belly. He held out the skin to Jon Snow.  Want some?   The boy took the skin and tried a cautious swallow.  It’s true, isn’t it?  he said when he was done.  What you said about the Night’s Watch.   Tyrion nodded.  Jon Snow set his mouth in a grim line.  If that’s what it is, that’s what it is.   Tyrion grinned at him.  That’s good, bastard. Most men would rather deny a hard truth than face it.    Most men,  the boy said.  But not you.    No,  Tyrion admitted,  not me. I seldom even dream of dragons anymore. There are no dragons.  He scooped up the fallen bearskin.  Come, we had better return to camp before your uncle calls the banners.   The walk was short, but the ground was rough underfoot and his legs were cramping badly by the time they got back. Jon Snow offered a hand to help him over a thick tangle of roots, but Tyrion shook him off. He would make his own way, as he had all his life. Still, the camp was a welcome sight. The shelters had been thrown up against the tumbledown wall of a long-abandoned holdfast, a shield against the wind. The horses had been fed and a fire had been laid. Yoren sat on a stone, skinning a squirrel. The savory smell of stew filled Tyrion’s nostrils. He dragged himself over to where his man Morrec was tending the stewpot. Wordlessly, Morrec handed him the ladle. Tyrion tasted and handed it back.  More pepper,  he said.  Benjen Stark emerged from the shelter he shared with his nephew.  There you are. Jon, damn it, don’t go off like that by yourself. I thought the Others had gotten you.    It was the grumkins,  Tyrion told him, laughing."
}