{
  "id": "7fa19bda1fb04fd05bece817a462bd299de8a3ba",
  "text": " In summer the wormwalks were seldom used, save by rats and other vermin, but winter was a different matter. When the snows drifted forty and fifty feet high and the ice winds came howling out of the north, the tunnels were all that held Castle Black together.  Soon, Jon thought as they climbed. He’d seen the harbinger that had come to Maester Aemon with word of summer’s end, the great raven of the Citadel, white and silent as Ghost. He had seen a winter once, when he was very young, but everyone agreed that it had been a short one, and mild. This one would be different. He could feel it in his bones.  The steep stone steps had Sam puffing like a blacksmith’s bellows by the time they reached the surface. They emerged into a brisk wind that made Jon’s cloak swirl and snap. Ghost was stretched out asleep beneath the wattle-and-daub wall of the granary, but he woke when Jon appeared, bushy white tail held stiffly upright as he trotted to them.  Sam squinted up at the Wall. It loomed above them, an icy cliff seven hundred feet high. Sometimes it seemed to Jon almost a living thing, with moods of its own. The color of the ice was wont to change with every shift of the light. Now it was the deep blue of frozen rivers, now the dirty white of old snow, and when a cloud passed before the sun it darkened to the pale grey of pitted stone. The Wall stretched east and west as far as the eye could see, so huge that it shrunk the timbered keeps and stone towers of the castle to insignificance. It was the end of the world.  And we are going beyond it.  The morning sky was streaked by thin grey clouds, but the pale red line was there behind them. The black brothers had dubbed the wanderer Mormont’s Torch, saying (only half in jest) that the gods must have sent it to light the old man’s way through the haunted forest.   The comet’s so bright you can see it by day now,  Sam said, shading his eyes with a fistful of books.   Never mind about comets, it’s maps the Old Bear wants.   Ghost loped ahead of them. The grounds seemed deserted this morning, with so many rangers off at the brothel in Mole’s Town, digging for buried treasure and drinking themselves blind. Grenn had gone with them. Pyp and Halder and Toad had offered to buy him his first woman to celebrate his first ranging. They’d wanted Jon and Sam to come as well, but Sam was almost as frightened of whores as he was of the haunted forest, and Jon had wanted no part of it.  Do what you want,  he told Toad,  I took a vow.   As they passed the sept, he heard voices raised in song. Some men want whores on the eve of battle, and some want gods. Jon wondered who felt better afterward. The sept tempted him no more than the brothel; his own gods kept their temples in the wild places, where the weirwoods spread their bone-white branches. The Seven have no power beyond the Wall, he thought, but my gods will be waiting.  Outside the armory, Ser Endrew Tarth was working with some raw recruits. They’d come in last night with Conwy, one of the wandering crows who roamed the Seven Kingdoms collecting men for the Wall. This new crop consisted of a greybeard leaning on a staff, two blond boys with the look of brothers, a foppish youth in soiled satin, a raggy man with a clubfoot, and some grinning loon who must have fancied himself a warrior. Ser Endrew was showing him the error of that presumption. He was a gentler master-at-arms than Ser Alliser Thorne had been, but his lessons would still raise bruises. Sam winced at every blow, but Jon Snow watched the swordplay closely.   What do you make of them, Snow?  Donal Noye stood in the door of his armory, bare-chested under a leather apron, the stump of his left arm uncovered for once. With his big gut and barrel chest, his flat nose and bristly black jaw, Noyc did not make a pretty sight, but he was a welcome one nonetheless. The armorer had proved himself a good friend.   They smell of summer,  Jon said as Ser Endrew bullrushed his foe and knocked him sprawling.  Where did Conwy find them?    A lord’s dungeon near Gulltown,  the smith replied.  A brigand, a barber, a beggar, two orphans, and a boy whore. With such do we defend the realms of men.    They’ll do.  Jon gave Sam a private smile.  We did.   Noye drew him closer.  You’ve heard these tidings of your brother?    Last night.  Conwy and his charges had brought the news north with them, and the talk in the common room had been of little else. Jon was still not certain how he felt about it. Robb a king? The brother he’d played with, fought with, shared his first cup of wine with? But not mother’s milk, no. So now Robb will sip summerwine from jeweled goblets, while I’m kneeling beside some stream sucking snowmelt from cupped hands.  Robb will make a good king,  he said loyally.   Will he now?  The smith eyed him frankly.  I hope that’s so, boy, but once I might have said the same of Robert.    They say you forged his warhammer,  Jon remembered.   Aye. I was his man, a Baratheon man, smith and armorer at Storm’s End until I lost the arm."
}