{
  "id": "8127feabc9f9edc6916b7f56ea9edc35ab365667",
  "text": " The girls followed close behind with the silk awning, to keep her in the shade, but the thousand men before her enjoyed no such protection. More than half had the copper skins and almond eyes of Dothraki and Lhazerene, but she saw men of the Free Cities in the ranks as well, along with pale Qartheen, ebon-faced Summer Islanders, and others whose origins she could not guess. And some had skins of the same amber hue as Kraznys mo Nakloz, and the bristly red-black hair that marked the ancient folk of Ghis, who named themselves the harpy’s sons. They sell even their own kind. It should not have surprised her. The Dothraki did the same, when khalasar met khalasar in the sea of grass.  Some of the soldiers were tall and some were short. They ranged in age from fourteen to twenty, she judged. Their cheeks were smooth, and their eyes all the same, be they black or brown or blue or grey or amber. They are like one man, Dany thought, until she remembered that they were no men at all. The Unsullied were eunuchs, every one of them.  Why do you cut them?  she asked Kraznys through the slave girl.  Whole men are stronger than eunuchs, I have always heard.    A eunuch who is cut young will never have the brute strength of one of your Westerosi knights, this is true,  said Kraznys mo Nakloz when the question was put to him.  A bull is strong as well, but bulls die every day in the fighting pits. A girl of nine killed one not three days past in Jothiel’s Pit. The Unsullied have something better than strength, tell her. They have discipline. We fight in the fashion of the Old Empire, yes. They are the lockstep legions of Old Ghis come again, absolutely obedient, absolutely loyal, and utterly without fear.   Dany listened patiently to the translation.   Even the bravest men fear death and maiming,  Arstan said when the girl was done.  Kraznys smiled again when he heard that.  Tell the old man that he smells of piss, and needs a stick to hold him up.    Truly, your worship?   He poked her with his lash.  No, not truly, are you a girl or a goat, to ask such folly? Say that Unsullied are not men. Say that death means nothing to them, and maiming less than nothing.  He stopped before a thickset man who had the look of Lhazar about him and brought his whip up sharply, laying a line of blood across one copper cheek. The eunuch blinked, and stood there, bleeding.  Would you like another?  asked Kraznys.   If it please your worship.   It was hard to pretend not to understand. Dany laid a hand on Kraznys’s arm before he could raise the whip again.  Tell the Good Master that I see how strong his Unsullied are, and how bravely they suffer pain.   Kraznys chuckled when he heard her words in Valyrian.  Tell this ignorant whore of a westerner that courage has nothing to do with it.    The Good Master says that was not courage, Your Grace.    Tell her to open those slut’s eyes of hers.    He begs you attend this carefully, Your Grace.   Kraznys moved to the next eunuch in line, a towering youth with the blue eyes and flaxen hair of Lys.  Your sword,  he said. The eunuch knelt, unsheathed the blade, and offered it up hilt first. It was a shortsword, made more for stabbing than for slashing, but the edge looked razor-sharp.  Stand,  Kraznys commanded.   Your worship.  The eunuch stood, and Kraznys mo Nakloz slid the sword slowly up his torso, leaving a thin red line across his belly and between his ribs. Then he jabbed the swordpoint in beneath a wide pink nipple and began to work it back and forth.   What is he doing?  Dany demanded of the girl, as the blood ran down the man’s chest.   Tell the cow to stop her bleating,  said Kraznys, without waiting for the translation.  This will do him no great harm. Men have no need of nipples, eunuchs even less so.  The nipple hung by a thread of skin. He slashed, and sent it tumbling to the bricks, leaving behind a round red eye copiously weeping blood. The eunuch did not move, until Kraznys offered him back his sword, hilt first.  Here, I’m done with you.    This one is pleased to have served you.   Kraznys turned back to Dany.  They feel no pain, you see.    How can that be?  she demanded through the scribe.   The wine of courage,  was the answer he gave her.  It is no true wine at all, but made from deadly nightshade, bloodfly larva, black lotus root, and many secret things. They drink it with every meal from the day they are cut, and with each passing year feel less and less. It makes them fearless in battle. Nor can they be tortured. Tell the savage her secrets are safe with the Unsullied. She may set them to guard her councils and even her bedchamber, and never a worry as to what they might overhear.   In Yunkai and Meereen, eunuchs are often made by removing a boy’s testicles, but leaving the penis. Such a creature is infertile, yet often still capable of erection. Only trouble can come of this. We remove the penis as well, leaving nothing. The Unsullied are the purest creatures on the earth.  He gave Dany and Arstan another of his broad white smiles."
}