{
  "id": "816809518c87e41609236a158599ae559541a946",
  "text": " Rakharo was fighting Haggo, arakh dancing with arakh until Jhogo’s whip cracked, loud as thunder, the lash coiling around Haggo’s throat. A yank, and the bloodrider stumbled backward, losing his feet and his sword. Rakharo sprang forward, howling, swinging his arakh down with both hands through the top of Haggo’s head. The point caught between his eyes, red and quivering. Someone threw a stone, and when Dany looked, her shoulder was torn and bloody.  No,  she wept,  no, please, stop it, it’s too high, the price is too high.  More stones came flying. She tried to crawl toward the tent, but Cohollo caught her. Fingers in her hair, he pulled her head back and she felt the cold touch of his knife at her throat.  My baby,  she screamed, and perhaps the gods heard, for as quick as that, Cohollo was dead. Aggo’s arrow took him under the arm, to pierce his lungs and heart.  When at last Daenerys found the strength to raise her head, she saw the crowd dispersing, the Dothraki stealing silently back to their tents and sleeping mats. Some were saddling horses and riding off. The sun had set. Fires burned throughout the khalasar, great orange blazes that crackled with fury and spit embers at the sky. She tried to rise, and agony seized her and squeezed her like a giant’s fist. The breath went out of her; it was all she could do to gasp. The sound of Mirri Maz Duur’s voice was like a funeral dirge. Inside the tent, the shadows whirled.  An arm went under her waist, and then Ser Jorah was lifting her off her feet. His face was sticky with blood, and Dany saw that half his ear was gone. She convulsed in his arms as the pain took her again, and heard the knight shouting for her handmaids to help him. Are they all so afraid? She knew the answer. Another pain grasped her, and Dany bit back a scream. It felt as if her son had a knife in each hand, as if he were hacking at her to cut his way out.  Doreah, curse you,  Ser Jorah roared.  Come here. Fetch the birthing women.    They will not come. They say she is accursed.    They’ll come or I’ll have their heads.   Doreah wept.  They are gone, my lord.    The maegi,  someone else said. Was that Aggo?  Take her to the maegi.   No, Dany wanted to say, no, not that, you mustn’t, but when she opened her mouth, a long wail of pain escaped, and the sweat broke over her skin. What was wrong with them, couldn’t they see? Inside the tent the shapes were dancing, circling the brazier and the bloody bath, dark against the sandsilk, and some did not look human. She glimpsed the shadow of a great wolf, and another like a man wreathed in flames.   The Lamb Woman knows the secrets of the birthing bed,  Irri said.  She said so, I heard her.    Yes,  Doreah agreed,  I heard her too.   No, she shouted, or perhaps she only thought it, for no whisper of sound escaped her lips. She was being carried. Her eyes opened to gaze up at a flat dead sky, black and bleak and starless. Please, no. The sound of Mirri Maz Duur’s voice grew louder, until it filled the world. The shapes! she screamed. The dancers!  Ser Jorah carried her inside the tent.      ARYA  The scent of hot bread drifting from the shops along the Street of Flour was sweeter than any perfume Arya had ever smelled. She took a deep breath and stepped closer to the pigeon. It was a plump one, speckled brown, busily pecking at a crust that had fallen between two cobblestones, but when Arya’s shadow touched it, it took to the air.  Her stick sword whistled out and caught it two feet off the ground, and it went down in a flurry of brown feathers. She was on it in the blink of an eye, grabbing a wing as the pigeon flapped and fluttered. It pecked at her hand. She grabbed its neck and twisted until she felt the bone snap.  Compared with catching cats, pigeons were easy.  A passing septon was looking at her askance.  Here’s the best place to find pigeon,  Arya told him as she brushed herself off and picked up her fallen stick sword.  They come for the crumbs.  He hurried away.  She tied the pigeon to her belt and started down the street. A man was pushing a load of tarts by on a two-wheeled cart; the smells sang of blueberries and lemons and apricots. Her stomach made a hollow rumbly noise.  Could I have one?  she heard herself say.  A lemon, or… or any kind.   The pushcart man looked her up and down. Plainly he did not like what he saw.  Three coppers.   Arya tapped her wooden sword against the side of her boot.  I’ll trade you a fat pigeon,  she said.   The Others take your pigeon,  the pushcart man said.  The tarts were still warm from the oven. The smells were making her mouth water, but she did not have three coppers… or one. She gave the pushcart man a look, remembering what Syrio had told her about seeing. He was short, with a little round belly, and when he moved he seemed to favor his left leg a little. She was just thinking that if she snatched a tart and ran he would never be able to catch her when he said,  You be keepin’ your filthy hands off."
}