{
  "id": "81a560768dfceb2c04544d5121f12f7281f64a2c",
  "text": "       The landlord hovered round for a link, and then prepared to leave them.  'I don't  know whether  you would care  to  join the company, when  you have  supped,' he said, standing at the door. 'Perhaps you would rather go to your  beds. Still the company would be very pleased to welcome you , if  you  had a  mind.  We don't get  Outsiders  -  travellers from the  Shire, I should  say,   ####-begging your pardon - often; and we like to hear a bit of news, or any story  or song you may have in mind.  But as you please! Ring the bell, if you lack   anything!'       So refreshed and encouraged did  they feel at the end  of  their supper  (about three quarters of an hour's steady going, not hindered by unnecessary  talk) that Frodo, Pippin, and Sam decided to join the company. Merry said it   would be too stuffy. 'I shall sit  here quietly by the fire  for  a bit, and  perhaps go out later for a sniff of the air. Mind your Ps and Qs, and  don't   forget that you are supposed to be  escaping in secret, and are still on the  high-road and not very far from the Shire!'       'All right!' said Pippin. 'Mind yourself!  Don't  get  lost,  and don't   forget that it is safer indoors!'       The company  was in the big common-room  of the inn.  The gathering was  large  and mixed, as Frodo discovered, when his eyes got used  to the light.  This came chiefly from a blazing  log-fire, for the three lamps hanging from  the  beams were  dim,  and half  veiled  in smoke.  Barliman  Butterbur  was  standing  near the  fire, talking  to  a couple  of dwarves and one  or  two  strange-looking  men.  On the benches were  various  folk:  men  of   Bree, a   collection of local  hobbits  (sitting  chattering  together),  a  few  more  dwarves,  and other vague figures difficult to make out away  in the shadows  and comers.        As soon as the Shire-hobbits  entered, there  was  a  chorus of welcome  from the Bree-landers. The strangers, especially those that  had come up the  Greenway, stared at them curiously. The landlord introduced the newcomers to  the Bree-folk, so  quickly  that, though they caught  many  names, they were  seldom  sure who the names belonged to.  The Men of Bree seemed  all to have  rather  botanical (and to the Shire-folk rather odd) names,  like Rushlight,  Goatleaf,  Heathertoes,  Appledore, Thistlewool and  Ferny (not  to  mention   Butterbur).  Some  of  the hobbits  had  similar  names.  The  Mugworts, for   instance,  seemed numerous.  But  most of them  had natural  names,  such as  Banks, Brockhouse, Longholes,  Sandheaver, and Tunnelly,  many of which  were  used  in the Shire.  There were several Underhills  from Saddle, and as they  could not imagine sharing  a name without being  related, they took Frodo to   their hearts as a long-lost cousin.       The Bree-hobbits were,  in fact, friendly  and  inquisitive,  and Frodo  soon found that  some  explanation  of  what he was doing would  have  to be   ####-given. He gave out that he was interested in history and geography (at which   there was much wagging of heads, although neither  of these words  were much  used in the  Bree-dialect). He said  he  was thinking of writing a  book (at  which there was  silent astonishment), and that he and his friends  wanted to   collect information about  hobbits living  outside the Shire,  especially in  the eastern lands.       At this  a  chorus of voices broke  out. If Frodo had  really wanted to  write a  book,  and  had  had  many ears, he  would  have learned enough for   several chapters  in a few minutes. And if that was not enough, he was given   a whole list of names, beginning with 'Old Barliman here', to whom he  could  go for further information. But after a time, a s Frodo did not show any sign  of writing a book on the spot, the hobbits returned to their questions about  doings in  the Shire. Frodo did not  prove  very communicative,  and he soon  found himself sitting alone in a comer, listening and looking around.       The Men and  Dwarves were mostly talking of  distant events and telling  flews of a kind that was becoming only too familiar. There  was trouble away  in the South, and it seemed that the  Men who had  come up the Greenway  were  on  the  move,  looking for   lands  where they  could  find some  peace. The  Bree-folk were  sympathetic, but plainly  not  very  ready to  take  a large  number  of  strangers  into  their little land. One  of  the  travellers,  a   squint-eyed ill-favoured fellow, was foretelling  that more  and more people  would  be  coming north in  the near future. 'If  room isn't found for them,  they'll  find it for  themselves.  They've a  right  to live,  same as other  folk,'  he said  loudly. The  local inhabitants did not look  pleased at the  prospect.       The hobbits  did not pay much attention to all this,  and it did not at  the moment seem to concern hobbits. Big  Folk could hardly  beg for lodgings  in hobbit-holes. They were more  interested in Sam and Pippin,  who were now  feeling quite  at home, and were chatting  gaily about events in the  Shire."
}