{
  "id": "81b64896f2aff8e488cde3356617494d0cbfaab4",
  "text": " \"Tuck in.\"   \"Hear, hear!\" said Harry and Ron loudly as the empty dishes filled magically before their eyes. Nearly Headless Nick watched mournfully as Harry, Ron, and Hermione loaded their own plates. \"Aaah, 'at's be'er,\" said Ron, with his mouth full of mashed potato. \"You're lucky there's a feast at all tonight, you know,\" said Nearly Headless Nick. \"There was trouble in the kitchens earlier.\" \"Why?  Wha' 'appened?\" said Harry, through a sizable chunk of steak. \"Peeves, of course,\" said Nearly Headless Nick, shaking his head, which wobbled dangerously.  He pulled his ruff a little higher up on his neck.  \"The usual argument, you know. He wanted to attend the feast - well, it's quite out of the question, you know what he's like, utterly uncivilized, can't see a plate of food without throwing it.  We held a ghost's council - the Fat Friar was all for giving him the chance - but most wisely, in my opinion, the Bloody Baron put his foot down.\" The Bloody Baron was the Slytherin ghost, a gaunt and silent specter covered in silver bloodstains.  He was the only person at Hogwarts who could really control Peeves. \"Yeah, we thought Peeves seemed hacked off about something,\" said Ron darkly.  \"So what did he do in the kitchens?\" \"Oh the usual,\" said Nearly Headless Nick, shrugging.  \"Wreaked havoc and mayhem. Pots and pans everywhere.  Place swimming in soup.  Terrified the house-elves out of their wits--\" Clang. Hermione had knocked over her golden goblet.  Pumpkin juice spread steadily over the tablecloth, staining several feet of white linen orange, but Hermione paid no attention. \"There are house-elves here?\" she said, staring, horror-struck, at Nearly Headless Nick.  \"Here at Hogwarts?\" \"Certainly,\" said Nearly Headless Nick, looking surprised at her reaction.  \"The largest number in any dwelling in Britain, I believe.  Over a hundred.\" \"I've never seen one!\"  said Hermione. \"Well, they hardly ever leave the kitchen by day, do they?\"  said Nearly Headless Nick. \"They come out at night to do a bit of cleaning.. . see to the fires and so on.. . . I mean, you're not supposed to see them, are you?  That's the mark of a good house-elf, isn't it, that you don't know it's there?\" Hermione stared at him. \"But they get paid?\" she said.  \"They get holidays, don't they?  And - and sick leave, and pensions, and everything?\" Nearly Headless Nick chortled so much that his ruff slipped and his head flopped off, dangling on the inch or so of ghostly skin and muscle that still attached it to his neck. \"Sick leave and pensions?\" he said, pushing his head back onto his shoulders and securing it once more with his ruff.  \"House-elves don't want sick leave and pensions!\" Hermione looked down at her hardly touched plate of food, then put her knife and fork down upon it and pushed it away from her. \"Oh c'mon, 'Er-my-knee,\" said Ron, accidentally spraying Harry with bits of Yorkshire pudding.  \"Oops -- sorry, 'Arry --\"  He swallowed.  \"You won't get them sick leave by starving yourself!\" \"Slave labor,\" said Hermione, breathing hard through her nose.  \"That's what made this dinner.  Slave labor.\" And she refused to eat another bite. The rain was still drumming heavily against the high, dark glass.  Another clap of thunder shook the windows, and the stormy ceiling flashed, illuminating the golden plates as the remains of the first course vanished and were replaced, instantly, with puddings. \"Treacle tart, Hermione!\"  said Ron, deliberately wafting its smell toward her.  \"Spotted dick, look!  Chocolate gateau!\" But Hermione gave him a look so reminiscent of Professor McGonagall that he gave up. When the puddings too had been demolished, and the last crumbs had faded off the plates, leaving them sparkling clean, Albus Dumbledore got to his feet again.  The buzz of chatter filling the Hall ceased almost at once, so that only the howling wind and pounding rain could be heard. \"So!\" said Dumbledore, smiling around at them all.  \"Now that we are all fed and watered,\" (\"Hmph!\" said Hermione)  \"I must once more ask for your attention, while I give out a few notices. \"Mr. Filch, the caretaker, has asked me to tell you that the list of objects forbidden inside the castle has this year been extended to include Screaming Yo-yos, Fanged Frisbees, and Ever-Bashing Boomerangs.  The full list comprises some four hundred and thirty-seven items, I believe, and can be viewed in Mr. Filch's office, if anybody would like to check it.\" The corners of Dumbledore's mouth twitched.  He continued, \"As ever, I would like to remind you all that the forest on the grounds is out-of-bounds to students, as is the village of Hogsmeade to all below third year. \"It is also my painful duty to inform you that the Inter-House Quidditch Cup will not take place this year.\" \"What?\"  Harry gasped.  He looked around at Fred and George, his fellow members of the Quidditch team. They were mouthing soundlessly at Dumbledore, apparently too appalled to speak.  Dumbhedore went on, \"This is due to an event that will be starting in October, and continuing throughout the school year, taking up much of the teachers' time and energy - but I am sure you will all enjoy it immensely."
}