{
  "id": "82b9fee251d6c6c2d01aba085f41136b78bb55fe",
  "text": " Legolas lay still,  looking  up at  the  sun and  sky with steady eyes,  and singing  softly  to  himself.  At last he sat  up. 'Come  now!' he said. 'Time  wears on, and the  mists  are  blowing away, or  would  if  you  strange folk did  not  wreathe  yourselves in smoke. What of the tale?'       'Well, my tale begins with waking up in the dark and finding myself all  strung-up in an orc-camp,' said Pippin. 'Let me see, what is today?'   ####-     'The fifth of March  in the Shire-reckoning,' said Aragorn. Pippin made  some calculations on his fingers. 'Only nine days ago!' he  said.1 'It seems  a year since we were caught. Well, though half of it was like a bad dream, I  reckon that three  very horrible days  followed. Merry will correct me, if I  forget anything important: I am not going into details:  the  whips and  the  filth  and stench  and all that; it does not bear remembering.' With that he  plunged  into an account of Boromir's last fight and the orc-march from Emyn  Muil to the Forest.  The others  nodded as the various points were fitted in  with their guesses.        'Here are some treasures that you let fall,' said Aragorn. 'You will be  glad to have them back.' He loosened his belt from under his cloak  and took   from it the two sheathed knives.        'Well!' said  Merry. 'I  never expected  to see those again! I marked a   few orcs with mine; but Ugl®k  took them from us. How he glared! At first  I  thought he  was going to  stab me, but he threw the  things away as if  they  burned him.'       'And here also is  your brooch, Pippin,' said Aragorn. 'I have kept  it  safe, for it is a very precious thing.'       'I know,'  said Pippin.  'It was a  wrench  to let it go; but what else  could I do?'       'Nothing else,' answered Aragorn. 'One who cannot cast away  a treasure  at need is in fetters. You did rightly.'       'The cutting of the bands on your wrists,  that was smart  work!'  said  Gimli. 'Luck  served you there; but you seized your chance with both  hands,  one might say. '       'And set us a  pretty  riddle,' said  Legolas. 'I  wondered  if you had  grown wings!'       'Unfortunately  not,'  said  Pippin.  'But  you  did   not  know  about  Grishnbkh.' He shuddered and said  no more, leaving  Merry to tell of  those   last horrible moments: the  pawing hands, the hot  breath, and  the dreadful  strength of Grishnbkh's hairy arms.        'All this about the  Orcs of Barad-dyr, Lugb®rz as  they call it, makes  me uneasy,' said  Aragorn.  'The  Dark Lord  already knew  too much and  his  servants also; and Grishnbkh  evidently sent some message  across  the River  after the quarrel. The Red Eye will be looking towards Isengard. But Saruman  at any rate is in a cleft stick of his own cutting.'       'Yes, whichever side  wins, his outlook is poor,'  said  Merry. 'Things   ####-began to go all wrong for him from the moment his Orcs set foot in Rohan.'       'We caught  a glimpse  of  the old villain, or so Gandalf  hints,' said  Gimli. 'On the edge of the Forest.'       'When was that?' asked Pippin.       'Five nights ago,' said Aragorn.       'Let me see,' said Merry: 'five nights ago-now we come to a part of the  story  you  know nothing  about.  We met  Treebeard that morning  after  the   battle; and that night we were  at Wellinghall,  one of his ent-houses.  The  next  morning  we  went to  Entmoot, a gathering of Ents, that is,  and  the  queerest thing  I have ever seen in my life. It lasted all that  day and the  next; and we spent the nights with an Ent called Quickbeam. And then late in  the afternoon in the third day of their moot,  the Ents suddenly blew up. It  was amazing. The Forest had  felt as tense as if a  thunderstorm was brewing  inside it: then  all at once  it exploded. I wish you could have heard their  song as they marched.'       'If Saruma n had heard it, he would be a hundred miles away by now, even  if he had had to run on his own legs,' said Pippin.       'Though Isengard be strong and hard, as cold as stone and bare as bone,       We go, we go, we go to war, to hew the stone and break the door!       There was  very much more. A  great deal  of the song had no words, and   was like a music of horns and drums.  It was very exciting. But I thought it  was only marching music and no more, just a song  -- until I got here. I know  better now.'       'We came down  over  the last  ridge  into Nan Curunnr, after night had  fallen,' Merry continued. 'It was then that I first had the feeling that the  Forest itself  was  moving  behind  us. I thought  I was dreaming  an entish  dream, but  Pippin had noticed  it too. We were both frightened; but  we did   not find out more about it until later.       'It  was  the  Huorns,  or so the Ents call them  in \"short  language\".  Treebeard  won't say much about them,  but  I think they are Ents that  have  become almost  like trees, at least to look at. They stand here and there in  the wood or under its eaves, silent, watching endlessly over the trees;  but  deep  in the  darkest  dales there  are hundreds and  hundreds  of  them,  I  believe."
}