{
  "id": "83a87fd15b3dcd9790fd4f4a9f438969950d7159",
  "text": "   The armor had been made of silver and gold, the knights of jade and beryl and onyx and tourmaline, of amber and opal and amethyst, each as tall as her little finger.  A thousand lovely knights,  she said,  but not the sort my enemies need fear. And my bullocks cannot carry me across the water, I—why are we stopping?  The oxen had slowed notably.   Khaleesi,  Aggo called through the drapes as the palanquin jerked to a sudden halt. Dany rolled onto an elbow to lean out. They were on the fringes of the bazaar, the way ahead blocked by a solid wall of people.  What are they looking at?   Jhogo rode back to her.  A firemage, Khaleesi.    I want to sec.    Then you must.  The Dothraki offered a hand down. When she took it, he pulled her up onto his horse and sat her in front of him, where she could see over the heads of the crowd. The firemage had conjured a ladder in the air, a crackling orange ladder of swirling flame that rose unsupported from the floor of the bazaar, reaching toward the high latticed roof.  Most of the spectators, she noticed, were not of the city: she saw sailors off trading ships, merchants come by caravan, dusty men out of the red waste, wandering soldiers, craftsmen, slavers. Jhogo, slid one hand about her waist and leaned close.  The Milk Men shun him. Khaleesi, do you see the girl in the felt hat? There, behind the fat priest. She is a—    —cutpurse,  finished Dany. She was no pampered lady, blind to such things. She had seen cutpurses aplenty in the streets of the Free Cities, during the years she’d spent with her brother, running from the Usurper’s hired knives.  The mage was gesturing, urging the flames higher and higher with broad sweeps of his arms. As the watchers craned their necks upward, the cutpurses squirmed through the press, small blades hidden in their palms. They relieved the prosperous of their coin with one hand while pointing upward with the other.  When the fiery ladder stood forty feet high, the mage leapt forward and began to climb it, scrambling up hand over hand as quick as a monkey. Each rung he touched dissolved behind him, leaving no more than a wisp of silver smoke. When he reached the top, the ladder was gone and so was he.   A fine trick,  announced Jhogo with admiration.   No trick,  a woman said in the Common Tongue.  Dany had not noticed Quaithe in the crowd, yet there she stood, eyes wet and shiny behind the implacable red lacquer mask.  What mean you, my lady?    Half a year gone, that man could scarcely wake fire from dragonglass. He had some small skill with powders and wildfire, sufficient to entrance a crowd while his cutpurses did their work. He could walk across hot coals and make burning roses bloom in the air, but he could no more aspire to climb the fiery ladder than a common fisherman could hope to catch a kraken in his nets.   Dany looked uneasily at where the ladder had stood. Even the smoke was gone now, and the crowd was breaking up, each man going about his business. In a moment more than a few would find their purses flat and empty.  And now?    And now his powers grow, Khaleesi. And you are the cause of it.    Me?  She laughed.  How could that be?   The woman stepped closer and lay two fingers on Dany’s wrist.  You are the Mother of Dragons, are you not?    She is, and no spawn of shadows may touch her.  Jhogo brushed Quaithe’s fingers away with the handle of his whip.  The woman took a step backward.  You must leave this city soon, Daenerys Targaryen, or you will never be permitted to leave it at all.   Dany’s wrist still tingled where Quaithe had touched her.  Where would you have me go?  she asked.   To go north, you must journey south. To reach the west, you must go east. To go forward you must go back, and to touch the light you must pass beneath the shadow.   Asshai, Dany thought. She would have me go to Asshai.  Will the Asshai’i give me an army?  she demanded.  Will there be gold for me in Asshai? Will there be ships? What is there in Asshai that I will not find in Qarth?    Truth,  said the woman in the mask. And bowing, she faded back into the crowd.  Rakharo snorted contempt through his drooping black mustachios.  Khaleesi, better a man should swallow scorpions than trust in the spawn of shadows, who dare not show their face beneath the sun. It is known.    It is known,  Aggo agreed.  Xaro Xhoan Daxos had watched the whole exchange from his cushions. When Dany climbed back into the palanquin beside him, he said,  Your savages are wiser than they know. Such truths as the Asshai’i hoard are not like to make you smile.  Then he pressed another cup of wine on her, and spoke of love and lust and other trifles all the way back to his manse.  In the quiet of her chambers, Dany stripped off her finery and donned a loose robe of purple silk. Her dragons were hungry, so she chopped up a snake and charred the pieces over a brazier. They are growing, she realized as she watched them snap and squabble over the blackened flesh. They must weigh twice what they had in Vaes Tolorro."
}