{
  "id": "848cc954f6b9fdbcca603f99c30710efd57e4a0a",
  "text": "      HOUSE LANNISTER  Fair-haired, tall, and handsome, the Lannisters are the blood of Andal adventurers who carved out a mighty kingdom in the western hills and valleys. Through the female line they claim descent from Lann the Clever, the legendary trickster of the Age of Heroes. The gold of Casterly Rock and the Golden Tooth has made them the wealthiest of the Great Houses. Their sigil is a golden lion upon a crimson field. The Lannister words are Hear Me Roar!    TYWIN LANNISTER, Lord of Casterly Rock, Warden of the West, Shield of Lannisport,  —his wife, {LADY JOANNA}, a cousin, died in childbed,  —their children:    —SER JAIME, called the Kingslayer, heir to Casterly Rock, a twin to Cersei,  —QUEEN CERSEI, wife of King Robert I Baratheon, a twin to Jaime,  —TYRION, called the Imp, a dwarf,    —his siblings:    —SER KEVAN, his eldest brother,    —his wife, DORNA, of House Swyft,  —their eldest son, LANCEL, squire to the king,  —their twin sons, WILLEM and MARTYN,  —their infant daughter, JANEI,      —GENNA, his sister, wed to Ser Emmon Frey,    —their son, SER CLEOS FREY,  —their son, TION FREY, a squire,      —{SER TYGETT}, his second brother, died of a pox,    —his widow, DARLESSA, of House Marbrand,  —their son, TYREK, squire to the king,      —{GERION}, his youngest brother, lost at sea,    —his bastard daughter, JOY, a girl of ten,      —their cousin, SER STAFFORD LANNISTER, brother to the late Lady Joanna,    —his daughters, CERENNA and MYRIELLE,  —his son, SER DAVEN LANNISTER,    —his counselor, MAESTER CREYLEN,  —his chief knights and lords bannermen:    —LORD LEO LEFFORD,  —SER ADDAM MARBRAND,  —SER GREGOR CLEGANE, the Mountain That Rides,  —SER HARYS SWYFT, father by marriage to Ser Kevan,  —LORD ANDROX BRAX,  —SER FORLEY PRESTER,  —SER AMORY LOACH,  —VARGO HOAT, of the Free City of Qohor, a sellsword,      Principal houses sworn to Casterly Rock are Payne, Swyft, Marbrand, Lydden, Banefort, Lefford, Crakehall, Serrett, Broom, Clegane, Prester, and Westerling.      HOUSE ARRYN  The Arryns are descended from the Kings of Mountain and Vale, one of the oldest and purest lines of Andal nobility. Their sigil is the moon-and-falcon, white, upon a sky-blue field. The Arryn words are As High As Honor.    {JON ARRYN}, Lord of the Eyrie, Defender of the Vale, Warden of the East, Hand of the King, recently deceased,  —his first wife, {LADY JEYNE, of House Royce}, died in childbed, her daughter stillborn,  —his second wife, {LADY ROWENA, of House Arryn}, his cousin, died of a winter chill, childless,  —his third wife and widow, LADY LYSA, of House Tully,    —their son:  —ROBERT ARRYN, a sickly boy of six years, now Lord of the Eyrie and Defender of the Vale,    —their retainers and household:    —MAESTER COLEMON, counselor, healer, and tutor,  —SER VARDIS EGEN, captain of the guard,  —SER BRYNDEN TULLY, called the Blackfish, Knight of the Gate and uncle to Lady Lysa,  —LORD NESTOR ROYCE, High Steward of the Vale,    —SER ALBAR ROYCE, his son,  —MYA STONE, a bastard girl in his service,      —LORD EON HUNTER, suitor to Lady Lysa,  —SER LYN CORBRAY, suitor to Lady Lysa,    —MYCHEL REDFORT, his squire,      —LADY ANYA WAYNWOOD, a widow,    —SER MORTON WAYNWOOD, her son, suitor to Lady Lysa,  —SER DONNEL WAYNWOOD, her son,      —MORD, a brutal gaoler,      The principal houses sworn to the Eyrie are Royce, Baelish, Egen, Waynwood, Hunter, Redfort, Corbray, Belmore, Melcolm, and Hersy.      HOUSE TULLY  The Tullys never reigned as kings, though they held rich lands and the great castle at Riverrun for a thousand years. During the Wars of Conquest, the riverlands belonged to Harren the Black, King of the Isles. Harren’s grandfather, King Harwyn Hardhand, had taken the Trident from Arrec the Storm King, whose ancestors had conquered all the way to the Neck three hundred years earlier, slaying the last of the old River Kings. A vain and bloody tyrant, Harren the Black was little loved by those he ruled, and many of the river lords deserted him to join Aegon’s army. First among those was Edmyn Tully of Riverrun. When Harren and his line perished in the burning of Harrenhal, Aegon rewarded House Tully by raising Lord Edmyn to dominion over the lands of the Trident and requiring the other river lords to swear him fealty. The Tully sigil is a leaping trout, silver, on a field of rippling blue and red. The Tully words are Family, Duty, Honor.    HOSTER TULLY, Lord of Riverrun,  —his wife, {LADY MINISA, of House Whent}, died in childbed,  —their children:    —CATELYN, the eldest daughter, wed to Lord Eddard Stark,  —LYSA, the younger daughter, wed to Lord Jon Arryn,  —SER EDMURE, heir to Riverrun,    —his brother, SER BRYNDEN, called the Blackfish,  —his household:    —MAESTER VYMAN, counselor, healer, and tutor,  —SER DESMOND GRELL, master-at-arms,  —SER ROBIN RYGER, captain of the guard,  —UTHERYDES WAYN, steward of Riverrun,    —his knights and lords bannermen:    —JASON MALLISTER, Lord of Seagate,    —PATREK MALLISTER, his son and heir,      —WALDER FREY, Lord of the Crossing,    —his numerous sons, grandsons, and bastards,      —JONOS BRACKEN, Lord of the Stone Hedge,  —TYTOS BLACKWOOD, Lord of Raventree,  —SER RAYMUN DARRY,  —SER KARYL VANCE,  —SER MARQ PIPER,  —SHELLA WHENT, Lady of Harrenhal,    —SER WILLIS WODE, a knight in her service,      Lesser houses sworn to Riverrun include Darry, Frey, Mallister, Bracken, Blackwood, Whent, Ryger, Piper, Vance."
}