{
  "id": "848ec500187816b59887725806df2f1a12bc9e84",
  "text": "   \"We  knew  it  would  be  a  desperate  venture,\"  said  Thorin,  \"and we  know  that  still; and I still  think  that when we have won  it will be  time enough  to  think what  to  do  about  it.  As  for  your  share,  Mr.  Baggins,  I  assure  you  we  are  more  than  grateful and you shall choose you own fourteenth, as soon as we have anything to   ####-divide, am sorry if you are worried about transport, and I admit the difficulties are  great-the  lands  have  not  become  less  wild  with  the  passing  of  time,  rather  the  reverse-but  we  will  do  whatever  we  can  for  you,  and  take  our  share  of  the  cost  when the time comes. Believe me or not as you like!\"  From that the talk turned to the great hoard itself and to the things that Thorin  and Balin remembered. They wondered if they were still lying there .unharmed in  the  hall  below:  the  spears  that  were  made  for  the  armies  of  the  great  King  Bladorthin  (long  since  dead),  each  had  a  thrice-forged head and  their  shafts were  inlaid with  cunning gold, but  they were never delivered or paid  for;  shields made  for warriors long dead; the great golden cup of Thror, two-handed, hammered and  carven with birds and flowers whose eyes and petals were of jewels; coats of mail  gilded and silvered and  impenetrable;  the necklace of Girion, Lord of Dale, made  of five hundred emeralds green as grass, which he gave for the arming of his eldest  son  in  a  coat  of  dwarf-linked rings the like of which had never been made before,  for  it  was  wrought  of  pure  silver  to  the  power  and  strength  of  triple  steel.  But  fairest  of  all  was  the  great  white  gem,  which  the  dwarves  had  found  beneath  the  roots of the Mountain, the Heart of the Mountain, the Arkenstone of Thrain.  \"The  Arkenstone!  The  Arkenstone!\"  murmured  Thorin  in  the  dark,  half  dreaming with his chin upon his knees. \"It was like a globe with a thousand facets;  it shone like silver in the firelight, like water in the sun, like snow under the stars,  like rain upon the Moon!\"  But  the enchanted desire of  the hoard had  fallen  from Bilbo. All  through  their  talk  he  was  only  half  listening  to  them.  He  sat  nearest  to  the  door with  one  ear  cocked  for  any  beginnings  of  a  sound  without,  his  other  was  alert  or  echoes  beyond  the  murmurs  of  the  dwarves,  for  any  whisper  of  a  movement  from  far  below.   Darkness  grew  deeper  and  he  grew  ever  more  uneasy.  \"Shut  the  door!\"  he  begged them. \"I fear that dragon in my marrow. I like this silence far less than the  uproar of last night. Shut the door before it is too late!\"  Something  in  his  voice  gave  the  dwarves  an  uncomfortable  feeling.  Slowly  Thorin shook off his dreams and getting up he kicked away the stone that wedged  the door. Then they thrust upon it, and it closed with a snap and a clang. No trace  of a keyhole was there left on the inside. They were shut in the Mountain!  And  not  a  moment  too  soon.  They  had  hardly  gone  any  distance  down  the  tunnel  when  a  blow  smote  the  side  of  the  Mountain  like  the  crash  of  battering- rams  made  of  forest  oaks  and  swung  by  giants.  The  rock  boomed,  the  walls  cracked and stones fell from the roof on their heads. What would have happened if   ####-the door had still been open I don't like to think. They fled further down the tunnel  glad to be still alive, while behind them outside they heard the roar and rumble of  Smaug's  fury.  He  was  breaking  rocks  to  pieces,  smashing  wall  and  cliff  with  the  lashings  of  his  huge  tail,  till  their  little  lofty  camping ground,  the  scorched grass,  the thrush's stone, the snail-covered walls, the narrow ledge, and all disappeared in  a  jumble  of  smithereens,  and  an  avalanche  of  splintered  stones  fell  over  the  cliff  into the valley below.   Smaug  had  left  his  lair  in  silent  stealth,  quietly  soared  into  the  air,  and  then  floated heavy and slow in the dark like a monstrous crow, down the wind towards  the  west  of  the  Mountain,  in  the  hopes  of  catching  unawares  something  or  somebody  there,  and  of  spying  the outlet  to  the passage which  the  thief had used.  This  was  the  outburst  of  his  wrath  when  he  could  find  nobody  and  see  nothing,  even where he guessed the outlet must actually be.  After  he  had  let  off  his  rage  in  this  way  he  felt  better  and  he  thought  in  his  heart that he would not be troubled again from that direction. In-the meanwhile he  had further vengeance to take. \"Barrel-rider!\" he snorted. \"Your fee came from the  waterside  and  up  the water  you  came with  out  a  doubt.  I  don't  know  your  smell,  but if you are not one of those men of the Lake, you had their help. They shall see  me and remember who is the real King under the Mountain!\"  He rose in fire and went away south towards the Running River."
}