{
  "id": "85b2b29f7225ea0f2c6fd8f9a336b853cd399aeb",
  "text": "   Yes, life,  Noye said.  A long life or a short one, it’s up to you, Snow. The road you’re walking, one of your brothers will slit your throat for you one night.    They’re not my brothers,  Jon snapped.  They hate me because I’m better than they are.    No. They hate you because you act like you’re better than they are. They look at you and see a castle-bred bastard who thinks he’s a lordling.  The armorer leaned close.  You’re no lordling. Remember that. You’re a Snow, not a Stark. You’re a bastard and a bully.    A bully?  Jon almost choked on the word. The accusation was so unjust it took his breath away.  They were the ones who came after me. Four of them.    Four that you’ve humiliated in the yard. Four who are probably afraid of you. I’ve watched you fight. It’s not training with you. Put a good edge on your sword, and they’d be dead meat; you know it, I know it, they know it. You leave them nothing. You shame them. Does that make you proud?   Jon hesitated. He did feel proud when he won. Why shouldn’t he? But the armorer was taking that away too, making it sound as if he were doing something wrong.  They’re all older than me,  he said defensively.   Older and bigger and stronger, that’s the truth. I’ll wager your master-at-arms taught you how to fight bigger men at Winterfell, though. Who was he, some old knight?    Ser Rodrik Cassel,  Jon said warily. There was a trap here. He felt it closing around him.  Donal Noye leaned forward, into Jon’s face.  Now think on this, boy. None of these others have ever had a master-at-arms until Ser Alliser. Their fathers were farmers and wagonmen and poachers, smiths and miners and oars on a trading galley. What they know of fighting they learned between decks, in the alleys of Oldtown and Lannisport, in wayside brothels and taverns on the kingsroad. They may have clacked a few sticks together before they came here, but I promise you, not one in twenty was ever rich enough to own a real sword.  His look was grim.  So how do you like the taste of your victories now, Lord Snow?    Don’t call me that!  Jon said sharply, but the force had gone out of his anger. Suddenly he felt ashamed and guilty.  I never… I didn’t think…    Best you start thinking,  Noye warned him.  That, or sleep with a dagger by your bed. Now go.   By the time Jon left the armory, it was almost midday. The sun had broken through the clouds. He turned his back on it and lifted his eyes to the Wall, blazing blue and crystalline in the sunlight. Even after all these weeks, the sight of it still gave him the shivers. Centuries of windblown dirt had pocked and scoured it, covering it like a film, and it often seemed a pale grey, the color of an overcast sky… but when the sun caught it fair on a bright day, it shone, alive with light, a colossal blue-white cliff that filled up half the sky.  The largest structure ever built by the hands of man, Benjen Stark had told Jon on the kingsroad when they had first caught sight of the Wall in the distance.  And beyond a doubt the most useless,  Tyrion Lannister had added with a grin, but even the Imp grew silent as they rode closer. You could see it from miles off, a pale blue line across the northern horizon, stretching away to the east and west and vanishing in the far distance, immense and unbroken. This is the end of the world, it seemed to say.  When they finally spied Castle Black, its timbered keeps and stone towers looked like nothing more than a handful of toy blocks scattered on the snow, beneath the vast wall of ice. The ancient stronghold of the black brothers was no Winterfell, no true castle at all. Lacking walls, it could not be defended, not from the south, or east, or west; but it was only the north that concerned the Night’s Watch, and to the north loomed the Wall. Almost seven hundred feet high it stood, three times the height of the tallest tower in the stronghold it sheltered. His uncle said the top was wide enough for a dozen armored knights to ride abreast. The gaunt outlines of huge catapults and monstrous wooden cranes stood sentry up there, like the skeletons of great birds, and among them walked men in black as small as ants.  As he stood outside the armory looking up, Jon felt almost as overwhelmed as he had that day on the kingsroad, when he’d seen it for the first time. The Wall was like that. Sometimes he could almost forget that it was there, the way you forgot about the sky or the earth underfoot, but there were other times when it seemed as if there was nothing else in the world. It was older than the Seven Kingdoms, and when he stood beneath it and looked up, it made Jon dizzy. He could feel the great weight of all that ice pressing down on him, as if it were about to topple, and somehow Jon knew that if it fell, the world fell with it.   Makes you wonder what lies beyond,  a familiar voice said.  Jon looked around.  Lannister. I didn’t see—I mean, I thought I was alone.   Tyrion Lannister was bundled in furs so thickly he looked like a very small bear."
}