{
  "id": "86605c4753d11a8c38591a5a0df0e35e40a87e2a",
  "text": "  Is it dry in there?    Drier than out here.    If I lurk about after, not too close to the fire, belike they’ll take no note of me till morn. The ones under his roof will be the first he murders, but at least we’ll die dry.   Jon had to laugh.  Craster’s one man. We’re two hundred. I doubt he’ll murder anyone.    You cheer me,  said Edd, sounding utterly morose.  And besides, there’s much to be said for a good sharp axe. I’d hate to be murdered with a maul. I saw a man hit in the brow with a maul once. Scarce split the skin at all, but his head turned mushy and swelled up big as a gourd, only purply-red. A comely man, but he died ugly. It’s good that we’re not giving them mauls.  Edd walked away shaking his head, his sodden black cloak shedding rain behind him.  Jon got the horses fed before he stopped to think of his own supper. He was wondering where to find Sam when he heard a shout of fear.  Wolf!  He sprinted around the hall toward the cry, the earth sucking at his boots. One of Craster’s women was backed up against the mud-spattered wall of the keep.  Keep away,  she was shouting at Ghost.  You keep away!  The direwolf had a rabbit in his mouth and another dead and bloody on the ground before him.  Get it away, m’lord,  she pleaded when she saw him.   He won’t hurt you.  He knew at once what had happened; a wooden hutch, its slats shattered, lay on its side in the wet grass.  He must have been hungry. We haven’t seen much game.  Jon whistled. The direwolf bolted down the rabbit, crunching the small bones between his teeth, and padded over to him.  The woman regarded them with nervous eyes. She was younger than he’d thought at first. A girl of fifteen or sixteen years, he judged, dark hair plastered across a gaunt face by the falling rain, her bare feet muddy to the ankles. The body under the sewn skins was showing in the early turns of pregnancy.  Are you one of Craster’s daughters?  he asked.  She put a hand over her belly.  Wife now.  Edging away from the wolf, she knelt mournfully beside the broken hutch.  I was going to breed them rabbits. There’s no sheep left.    The Watch will make good for them.  Jon had no coin of his own, or he would have offered it to her… though he was not sure what good a few coppers or even a silver piece would do her beyond the Wall.  I’ll speak to Lord Mormont on the morrow.   She wiped her hands on her skirt.  M’lord—    I’m no lord.   But others had come crowding round, drawn by the woman’s scream and the crash of the rabbit hutch.  Don’t you believe him, girl,  called out Lark the Sisterman, a ranger mean as a cur.  That’s Lord Snow himself.    Bastard of Winterfell and brother to kings,  mocked Chett, who’d left his hounds to see what the commotion was about.   That wolf’s looking at you hungry, girl,  Lark said.  Might be it fancies that tender bit in your belly.   Jon was not amused.  You’re scaring her.    Warning her, more like.  Chett’s grin was as ugly as the boils that covered most of his face.   We’re not to talk to you,  the girl remembered suddenly.   Wait,  Jon said, too late. She bolted, ran.  Lark made a grab for the second rabbit, but Ghost was quicker. When he bared his teeth, the Sisterman slipped in the mud and went down on his bony butt. The others laughed. The direwolf took the rabbit in his mouth and brought it to Jon.   There was no call to scare the girl,  he told them.   We’ll hear no scolds from you, bastard.  Chett blamed Jon for the loss of his comfortable position with Maester Aemon, and not without justice. If he had not gone to Aemon about Sam Tarly, Chett would still be tending an old blind man instead of a pack of ill-tempered hunting hounds.  You may be the Lord Commander’s pet, but you’re not the Lord Commander… and you wouldn’t talk so bloody bold without that monster of yours always about.    I’ll not fight a brother while we’re beyond the Wall,  Jon answered, his voice cooler than he felt.  Lark got to one knee.  He’s afraid of you, Chett. On the Sisters, we have a name for them like him.    I know all the names. Save your breath.  He walked away, Ghost at his side. The rain had dwindled to a thin drizzle by the time he reached the gate. Dusk would be on them soon, followed by another wet dark dismal night. The clouds would hide moon and stars and Mormont’s Torch, turning the woods black as pitch. Every piss would be an adventure, if not quite of the sort Jon Snow had once envisioned.  Out under the trees, some rangers had found enough duff and dry wood to start a fire beneath a slanting ridge of slate. Others had raised tents or made rude shelters by stretching their cloaks over low branches. Giant had crammed himself inside the hollow of a dead oak.  How d’ye like my castle, Lord Snow?    It looks snug. You know where Sam is?    Keep on the way you were. If you come on Ser Ottyn’s pavilion, you’ve gone too far.  Giant smiled.  Unless Sam’s found him a tree too. What a tree that would be.   It was Ghost who found Sam in the end."
}