{
  "id": "86afb55e51f94f10d1a149e6dfe5dac707cdfc45",
  "text": "  Now I squire for Belwas.    A bit old for such, aren’t you?  Ser Jorah had shouldered his way to her side, holding the brass platter awkwardly under his arm. Belwas’s hard head had left it badly bent.   Not too old to serve my liege, Lord Mormont.    You know me as well?    I saw you fight a time or two. At Lannisport where you near unhorsed the Kingslayer. And on Pyke, there as well. You do not recall, Lord Mormont?   Ser Jorah frowned.  Your face seems familiar, but there were hundreds at Lannisport and thousands on Pyke. And I am no lord. Bear Island was taken from me. I am but a knight.    A knight of my Queensguard.  Dany took his arm.  And my true friend and good counselor.  She studied Arstan’s face. He had a great dignity to him, a quiet strength she liked.  Rise, Arstan Whitebeard. Be welcome, Strong Belwas. Ser Jorah you know. Ko Aggo and Ko Jhogo are blood of my blood. They crossed the red waste with me, and saw my dragons born.    Horse boys.  Belwas grinned toothily.  Belwas has killed many horse boys in the fighting pits. They jingle when they die.   Aggo’s arakh leapt to his hand.  Never have I killed a fat brown man. Belwas will be the first.    Sheath your steel, blood of my blood,  said Dany,  this man comes to serve me. Belwas, you will accord all respect to my people, or you will leave my service sooner than you’d wish, and with more scars than when you came.   The gap-toothed smile faded from the giant’s broad brown face, replaced by a confused scowl. Men did not often threaten Belwas, it would seem, and less so girls a third his size.  Dany gave him a smile, to take a bit of the sting from the rebuke.  Now tell me, what would Magister Illyrio have of me, that he would send you all the way from Pentos?    He would have dragons,  said Belwas gruffly,  and the girl who makes them. He would have you.    Belwas has the truth of us, Your Grace,  said Arstan.  We were told to find you and bring you back to Pentos. The Seven Kingdoms have need of you. Robert the Usurper is dead, and the realm bleeds. When we set sail from Pentos there were four kings in the land, and no justice to be had.   Joy bloomed in her heart, but Dany kept it from her face.  I have three dragons,  she said,  and more than a hundred in my khalasar, with all their goods and horses.    it is no matter,  boomed Belwas.  We take all. The fat man hires three ships for his little silverhair queen.    It is so, Your Grace,  Arstan Whitebeard said.  The great cog Saduleon is berthed at the end of the quay, and the galleys Summer Sun and Joso’s Prank are anchored beyond the breakwater.   Three heads has the dragon, Dany thought, wondering.  I shall tell my people to make ready to depart at once. But the ships that bring me home must bear different names.    As you wish,  said Arstan.  What names would you prefer?    Vhagar,  Daenerys told him.  Meraxes. And Balerion. Paint the names on their hulls in golden letters three feet high, Arstan. I want every man who sees them to know the dragons are returned.       ARYA  The heads had been dipped in tar to slow the rot. Every morning when Arya went to the well to draw fresh water for Roose Bolton’s basin, she had to pass beneath them. They faced outward, so she never saw their faces, but she liked to pretend that one of them was Joffrey’s. She tried to picture how his pretty face would look dipped in tar. If I was a crow I could fly down and peck off his stupid fat pouty lips.  The heads never lacked for attendants. The carrion crows wheeled about the gatehouse in raucous unkindness and quarreled upon the ramparts over every eye, screaming and cawing at each other and taking to the air whenever a sentry passed along the battlements. Sometimes the maester’s ravens joined the feast as well, flapping down from the rookery on wide black wings. When the ravens came the crows would scatter, only to return the moment the larger birds were gone.  Do the ravens remember Maester Tothmure? Arya wondered. Are they sad for him? When they quork at him, do they wonder why he doesn’t answer? Perhaps the dead could speak to them in some secret tongue the living could not hear.  Tothmure had been sent to the axe for dispatching birds to Casterly Rock and King’s Landing the night Harrenhal had fallen, Lucan the armorer for making weapons for the Lannisters, Goodwife Harra for telling Lady Whent’s household to serve them, the steward for giving Lord Tywin the keys to the treasure vault. The cook was spared (some said because he’d made the weasel soup), but stocks were hammered together for pretty Pia and the other women who’d shared their favors with Lannister soldiers. Stripped and shaved, they were left in the middle ward beside the bear pit, free for the use of any man who wanted them.  Three Frey men-at-arms were using them that morning as Arya went to the well. She tried not to look, but she could hear the men laughing. The pail was very heavy once full. She was turning to bring it back to Kingspyre when Goodwife Amabel seized her arm."
}