{
  "id": "86db3bca030f58661d71c160719f8aebb4c2462c",
  "text": " It had been Ser Jorah’s suggestion that she speak only Dothraki and the Common Tongue while in Astapor. My bear is more clever than he looks.  Tell me of their training.    The Westerosi woman is pleased with them, but speaks no praise, to keep the price down,  the translator told her master.  She wishes to know how they were trained.   Kraznys mo Nakloz bobbed his head. He smelled as if he’d bathed in raspberries, this slaver, and his jutting red-black beard glistened with oil. He has larger breasts than I do, Dany reflected. She could see them through the thin sea-green silk of the gold-fringed tokar he wound about his body and over one shoulder. His left hand held the tokar in place as he walked, while his right clasped a short leather whip.  Are all Westerosi pigs so ignorant?  he complained.  All the world knows that the Unsullied are masters of spear and shield and shortsword.  He gave Dany a broad smile.  Tell her what she would know, slave, and be quick about it. The day is hot.   That much at least is no lie. A matched pair of slave girls stood behind them, holding a striped silk awning over their heads, but even in the shade Dany felt light-headed, and Kraznys was perspiring freely. The Plaza of Pride had been baking in the sun since dawn. Even through the thickness of her sandals, she could feel the warmth of the red bricks underfoot. Waves of heat rose off them shimmering to make the stepped pyramids of Astapor around the plaza seem half a dream.  If the Unsullied felt the heat, however, they gave no hint of it. They could be made of brick themselves, the way they stand there. A thousand had been marched out of their barracks for her inspection; drawn up in ten ranks of one hundred before the fountain and its great bronze harpy, they stood stiffly at attention, their stony eyes fixed straight ahead. They wore nought but white linen clouts knotted about their loins, and conical bronze helms topped with a sharpened spike a foot tall. Kraznys had commanded them to lay down their spears and shields, and doff their swordbelts and quilted tunics, so the Queen of Westeros might better inspect the lean hardness of their bodies.   They are chosen young, for size and speed and strength,  the slave told her.  They begin their training at five. Every day they train from dawn to dusk, until they have mastered the shortsword, the shield, and the three spears. The training is most rigorous, Your Grace. Only one boy in three survives it. This is well known. Among the Unsullied it is said that on the day they win their spiked cap, the worst is done with, for no duty that will ever fall to them could be as hard as their training.   Kraznys mo Nakloz supposedly spoke no word of the Common Tongue, but he bobbed his head as he listened, and from time to time gave the slave girl a poke with the end of his lash.  Tell her that these have been standing here for a day and a night, with no food nor water. Tell her that they will stand until they drop if I should command it, and when nine hundred and ninety-nine have collapsed to die upon the bricks, the last will stand there still, and never move until his own death claims him. Such is their courage. Tell her that.    I call that madness, not courage,  said Arstan Whitebeard, when the solemn little scribe was done. He tapped the end of his hardwood staff against the bricks, tap tap, as if to tell his displeasure. The old man had not wanted to sail to Astapor; nor did he favor buying this slave army. A queen should hear all sides before reaching a decision. That was why Dany had brought him with her to the Plaza of Pride, not to keep her safe. Her bloodriders would do that well enough. Ser Jorah Mormont she had left aboard Balerion to guard her people and her dragons. Much against her inclination, she had locked the dragons belowdecks. It was too dangerous to let them fly freely over the city; the world was all too full of men who would gladly kill them for no better reason than to name themselves dragonslayer.   What did the smelly old man say?  the slaver demanded of his translator. When she told him, he smiled and said,  Inform the savages that we call this obedience. Others may be stronger or quicker or larger than the Unsullied. Some few may even equal their skill with sword and spear and shield. But nowhere between the seas will you ever find any more obedient.    Sheep are obedient,  said Arstan when the words had been translated. He had some Valyrian as well, though not so much as Dany, but like her he was feigning ignorance.  Kraznys mo Nakloz showed his big white teeth when that was rendered back to him.  A word from me and these sheep would spill his stinking old bowels on the bricks,  he said,  but do not say that. Tell them that these creatures are more dogs than sheep. Do they eat dogs or horse in these Seven Kingdoms?    They prefer pigs and cows, your worship.    Beef. Pfag. Food for unwashed savages.   Ignoring them all, Dany walked slowly down the line of slave soldiers."
}