{
  "id": "87107e2d58e4f5997393b68d22633abc3462fbbf",
  "text": "'       'Yet now under the Lord of Barad-dyr the most  fell of all his captains  is already master of your outer  walls,'  said Gandalf. 'King of Angmar long  ago, Sorcerer, Ringwraith, Lord of the Nazgyl, a spear of terror in the hand  of Sauron, shadow of despair.'       'Then, Mithrandir, you  had a  foe to  match you,'  said Denethor. 'For   myself, I  have long known who is the chief captain of the hosts of the Dark  Tower. Is this all that you have returned to say? Or can it be that you have  withdrawn because you are overmatched?'       Pippin  trembled, fearing  that Gandalf would be stung to sudden wrath,  but his fear was needless.  'It  might be so,' Gandalf answered softly. 'But  our trial of strength is not yet come. And if words  spoken  of old be true,  not by the hand of man  shall he fall, and hidden from the Wise  is the doom  that awaits him.  However that may be, the Captain of Despair does not press  forward,  yet.  He rules rather according to  the  wisdom that you have just  spoken, from the rear, driving his slaves in madness on before.       'Nay, I came  rather to guard the hurt men that can yet be  healed; for  the Rammas is  breached far and wide, and soon the host of Morgul will enter   in at many points. And I came chiefly to say this. Soon there will be battle  on  the  fields. A sortie must be made  ready.  Let it be of mounted men. In  them lies our  brief hope, for in one thing only is  the enemy  still poorly  provided: he has few horsemen.'       'And we also have few. Now  would the coming of Rohan be in the nick of  time,' said Denethor.       'We are likely to see other newcomers first,' said  Gandalf. 'Fugitives  from Cair Andros have  already reached us. The isle has fallen. Another army  is come from the Black Gate, crossing from the north-east.'       'Some have accused  you, Mithrandir,  of  delighting to bear ill news,'  said Denethor, 'but to  me  this is  no longer news: it  was known to mw ere   ####-nightfall yesterday. As for the sortie,  I had already given thought to  it.  Let us go down.'       Time  passed. At length watchers on the walls could  see the retreat of  the  out-companies. Small bands of weary  and  often wounded  men came first   with  little  order; some  were running wildly  as if  pursued. Away to  the  ea stward the distant fires flickered; and  now it seemed that here and there  they crept across the plain. Houses and barns were burning.  Then from  many  points little  rivers of red flame  came  hurrying on,  winding through  the  gloom,  converging  towards   the line of  the broad  road that  led from the  City-gate to Osgiliath.       'The enemy,' men  murmured. 'The  dike is  down. Here they come pouring  through the  breaches! And they carry  torches,  it seems. Where are our own  folk?'       It drew now to evening by the hour, and  the light was so dim that even  far-sighted men upon the  Citadel could  discern little clearly out upon the  fields, save only the  burnings that ever multiplied, and the lines  of fire  that grew in length and speed.  At last, less than a mile  from  the City, a   more ordered mass of men came into view, marching not running, still holding  together.       The watchers held their breath. 'Faramir must be there,' they said. 'He  can govern man and beast. He will make it yet.'       Now  the  main retreat  was scarcely  two furlongs distant. Out of  the  gloom behind a small company of horsemen galloped, all that was  left of the  rearguard. Once again they turned at bay, facing the oncoming lines of fire.  Then  suddenly  there was a tumult of   fierce cries. Horsemen of  the  enemy   swept up. The lines of fire became flowing torrents,  file upon file of Orcs  bearing flames, and wild Southron men with red banners, shouting with  harsh  tongues, surging up, overtaking the retreat. And with a  piercing cry out of  the dim sky fell the winged shadows, the Nazgyl stooping to the kill.       The retreat became a rout. Already men were breaking away, flying  wild   and witless here and there, flinging away their weapons, crying out in fear,  falling to the ground.       And then a trumpet rang from the Citadel, and Denethor at last released  the sortie. Drawn up  within  the shadow of the  Gate and under the  looming  walls outside they had waited for his signal: all the  mounted men that were  left in the City.  Now they  sprang forward, formed, quickened to  a gallop,  and charged with a great shout. And  from the walls an answering  shout went   ####-up; for foremost on the field rode the swan-knights of Dol Amroth with their   Prince and his blue banner at their head.       'Amroth for Gondor!' they cried. 'Amroth to Faramir!'       Like thunder they broke  upon the enemy on either flank of the retreat;  but  one rider outran  them  all, swift as the  wind in the grass: Shadowfax  bore him, shining,  unveiled  once  more, a light starting from his upraised  hand.       The Nazgyl screeched and swept away, for their Captain was not yet come  to challenge the  white fire of his foe."
}