{
  "id": "893d3019c2bc01e118c78849fd811d8902644d48",
  "text": "    Not in this.  Davos was no courtier, and he did not even try to blunt his words.  It is not in Stannis to yield, so long as he knows his claim is just. No more than he can unsay his words against Joffrey, when he believes them true. As for the marriage, Tommen was born of the same incest as Joffrey, and His Grace would sooner see Shireen dead than wed to such.   A vein throbbed in Florent’s forehead.  He has no choice.    You are wrong, my lord. He can choose to die a king.    And us with him? Is that what you desire, Onion Knight?    No. But I am the king’s man, and I will make no peace without his leave.   Lord Alester stared at him helplessly for a long moment, and then began to weep.      Jon   The last night fell black and moonless, but for once the sky was clear.  I am going up the hill to look for Ghost,  he told the Thenns at the cave mouth, and they grunted and let him pass.  So many stars, he thought as he trudged up the slope through pines and firs and ash. Maester Luwin had taught him his stars as a boy in Winterfell; he had learned the names of the twelve houses of heaven and the rulers of each; he could find the seven wanderers sacred to the Faith; he was old friends with the Ice Dragon, the Shadowcat, the Moonmaid, and the Sword of the Morning. All those he shared with Ygritte, but not some of the others. We look up at the same stars, and see such different things. The King’s Crown was the Cradle, to hear her tell it; the Stallion was the Horned Lord; the red wanderer that septons preached was sacred to their Smith up here was called the Thief. And when the Thief was in the Moonmaid, that was a propitious time for a man to steal a woman, Ygritte insisted.  Like the night you stole me. The Thief was bright that night.    I never meant to steal you,  he said.  I never knew you were a girl until my knife was at your throat.    If you kill a man, and never mean t’, he’s just as dead,  Ygritte said stubbornly. Jon had never met anyone so stubborn, except maybe for his little sister Arya. Is she still my sister? he wondered. Was she ever? He had never truly been a Stark, only Lord Eddard’s motherless bastard, with no more place at Winterfell than Theon Greyjoy. And even that he’d lost. When a man of the Night’s Watch said his words, he put aside his old family and joined a new one, but Jon Snow had lost those brothers too.  He found Ghost atop the hill, as he thought he might. The white wolf never howled, yet something drew him to the heights all the same, and he would squat there on his hindquarters, hot breath rising in a white mist as his red eyes drank the stars.   Do you have names for them as well?  Jon asked, as he went to one knee beside the direwolf and scratched the thick white fur on his neck,  The Hare? The Doe? The She-Wolf?  Ghost licked his face, his rough wet tongue rasping against the scabs where the eagle’s talons had ripped Jon’s cheek. The bird marked both of us, he thought.  Ghost,  he said quietly,  on the morrow we go over. There’s no steps here, no cage-and-crane, no way for me to get you to the other side. We have to part. Do you understand?   In the dark, the direwolf’s red eyes looked black. He nuzzled at Jon’s neck, silent as ever, his breath a hot mist. The wildlings called Jon Snow a warg, but if so he was a poor one. He did not know how to put on a wolf skin, the way Orell had with his eagle before he’d died. Once Jon had dreamed that he was Ghost, looking down upon the valley of the Milkwater where Mance Rayder had gathered his people, and that dream had turned out to be true. But he was not dreaming now, and that left him only words.   You cannot come with me,  Jon said, cupping the wolf’s head in his hands and looking deep into those eyes.  You have to go to Castle Black. Do you understand? Castle Black. Can you find it? The way home? Just follow the ice, east and east, into the sun, and you’ll find it. They will know you at Castle Black, and maybe your coming will warn them.  He had thought of writing out a warning for Ghost to carry, but he had no ink, no parchment, not even a writing quill, and the risk of discovery was too great.  I will meet you again at Castle Black, but you have to get there by yourself. We must each hunt alone for a time. Alone.   The direwolf twisted free of Jon’s grasp, his ears pricked up. And suddenly he was bounding away. He loped through a tangle of brush, leapt a deadfall, and raced down the hillside, a pale streak among the trees. Off to Castle Black? Jon wondered. Or off after a hare? He wished he knew. He feared he might prove just as poor a warg as a sworn brother and a spy.  A wind sighed through the trees, rich with the smell of pine needles, tugging at his faded blacks. Jon could see the Wall looming high and dark to the south, a great shadow blocking out the stars. The rough hilly ground made him think they must be somewhere between the Shadow Tower and Castle Black, and likely closer to the former. For days they had been wending their way south between deep lakes that stretched like long thin fingers along the floors of narrow valleys, while flint ridges and pine-clad hills jostled against one another to either side."
}