{
  "id": "897826e34bef8986ba4576f39725b70a61a8df96",
  "text": " So where do you think he got that name? Har!   Jon had to laugh. Even now, even here. Ygritte had been fond of Longspear Ryk. He hoped he found some joy with Tormund’s Munda. Someone needed to find some joy somewhere.   You know nothing, Jon Snow,  Ygritte would have told him. I know that I am going to die, he thought. I know that much, at least.  All men die,  he could almost hear her say,  and women too, and every beast that flies or swims or runs. It’s not the when o’ dying that matters, it’s the how of it, Jon Snow.  Easy for you to say, he thought back. You died brave in battle, storming the castle of a foe. I’m going to die a turncloak and a killer. Nor would his death be quick, unless it came on the end of Mance’s sword.  Soon they were among the tents. It was the usual wildling camp; a sprawling jumble of cookfires and piss pits, children and goats wandering freely, sheep bleating among the trees, horse hides pegged up to dry. There was no plan to it, no order, no defenses. But there were men and women and animals everywhere.  Many ignored him, but for every one who went about his business there were ten who stopped to stare; children squatting by the fires, old women in dog carts, cave dwellers with painted faces, raiders with claws and snakes and severed heads painted on their shields, all turned to have a look. Jon saw spearwives too, their long hair streaming in the piney wind that sighed between the trees.  There were no true hills here, but Mance Rayder’s white fur tent had been raised on a spot of high stony ground right on the edge of the trees. The King-beyond-the-Wall was waiting outside, his ragged red-and-black cloak blowing in the wind. Harma Dogshead was with him, Jon saw, back from her raids and feints along the Wall, and Varamyr Sixskins as well, attended by his shadowcat and two lean grey wolves.  When they saw who the Watch had sent, Harma turned her head and spat, and one of Varamyr’s wolves bared its teeth and growled.  You must be very brave or very stupid, Jon Snow,  Mance Rayder said,  to come back to us wearing a black cloak.    What else would a man of the Night’s Watch wear?    Kill him,  urged Harma.  Send his body back up in that cage o’ theirs and tell them to send us someone else. I’ll keep his head for my standard. A turncloak’s worse than a dog.    I warned you he was false.  Varamyr’s tone was mild, but his shadowcat was staring at Jon hungrily through slitted grey eyes.  I never did like the smell o’ him.    Pull in your claws, beastling.  Tormund Giantsbane swung down off his horse.  The lad’s here to hear. You lay a paw on him, might be I’ll take me that shadowskin cloak I been wanting.    Tormund Crowlover,  Harma sneered.  You are a great sack o’ wind, old man.   The skinchanger was grey-faced, round-shouldered, and bald, a mouse of a man with a wolfling’s eyes.  Once a horse is broken to the saddle, any man can mount him,  he said in a soft voice.  Once a beast’s been joined to a man, any skinchanger can slip inside and ride him. Orell was withering inside his feathers, so I took the eagle for my own. But the joining works both ways, warg. Orell lives inside me now, whispering how much he hates you. And I can soar above the Wall, and see with eagle eyes.    So we know,  said Mance.  We know how few you were, when you stopped the turtle. We know how many came from Eastwatch. We know how your supplies have dwindled. Pitch, oil, arrows, spears. Even your stair is gone, and that cage can only lift so many. We know. And now you know we know.  He opened the flap of the tent.  Come inside. The rest of you, wait here.    What, even me?  said Tormund.   Particularly you. Always.   It was warm within. A small fire burned beneath the smoke holes, and a brazier smouldered near the pile of furs where Dalla lay, pale and sweating. Her sister was holding her hand. Val, Jon remembered.  I was sorry when Jarl fell,  he told her.  Val looked at him with pale grey eyes.  He always climbed too fast.  She was as fair as he’d remembered, slender, full-breasted, graceful even at rest, with high sharp cheekbones and a thick braid of honey-colored hair that fell to her waist.   Dalla’s time is near,  Mance explained.  She and Val will stay. They know what I mean to say.   Jon kept his face as still as ice. Foul enough to slay a man in his own tent under truce. Must I murder him in front of his wife as their child is being born? He closed the fingers of his sword hand. Mance was not wearing armor, but his own sword was sheathed on his left hip. And there were other weapons in the tent, daggers and dirks, a bow and a quiver of arrows, a bronze-headed spear lying beside that big black…  …horn.  Jon sucked in his breath.  A warhorn, a bloody great warhorn.   Yes,  Mance said.  The Horn of Winter, that Joramun once blew to wake giants from the earth.   The horn was huge, eight feet along the curve and so wide at the mouth that he could have put his arm inside up to the elbow. If this came from an aurochs, it was the biggest that ever lived."
}