{
  "id": "8a870cb39f6464e1abf524d218599a9993956bfb",
  "text": "       Peel it! Heal it!       Old Troll laughed, when he heard Tom groan,       And he knew his toes could feel it.   ####-       Tom's leg is game, since home he came,       And his bootless foot is lasting lame;       But Troll don't care, and he's still there       With the bone he boned from its owner.       Doner! Boner!       Troll's old seat is still the same,       And the bone he boned from its owner!       'Well, that's a warning to  us all!' laughed Merry. 'It  is as well you   used a stick, and not your hand, Strider!'       'Where did you come  by  tha t, Sam?' asked Pippin.  'I've  never  heard  those words before.'       Sam  muttered  something  inaudible. 'It's  out of  his  own  head,  of  course,'  said Frodo. 'I am learning a lot about Sam Gamgee on this journey.   First he was a conspirator, now he's a  jester.  He'll end up  by becoming a   wizard - or a warrior!'       'I hope not,' said Sam. 'I don't want to be neither!'       In  the afternoon  they went  on  down  the  woods. They were  probably  following the very track  that Gandalf, Bilbo, and the dwarves had used many  years before.  After a  few miles they came  out on the top  of a high  bank   above the  Road. At this point  the Road had left the Hoarwell far behind in  its narrow valley, and now clung close to the feet of the hills, rolling and  winding eastward among woods and heather -covered slopes towards the Ford  and  the  Mountains.  Not far  down the bank Strider pointed out a  stone in  the  grass.  On  it roughly  cut  and  now  much weathered  could  still be  seen  dwarf-runes and secret marks.       'There!' said  Merry.  'That  must be the stone  that marked  the place  where the  trolls' gold  was  hidden.  How much is  left of Bilbo's share, I  wonder, Frodo?'       Frodo looked at the stone,  and wished that  Bilbo had brought home  no  treasure more perilous, nor  less easy to pan with. 'None  at all,' he said.  'Bilbo gave it all away. He told me he did not feel it was really his, as it  came from robbers.'       The Road lay quiet under the long  shadows of early  evening. There was  no sign of any  other  travellers  to be  seen. As  there  was now no  other   possible course for them to  take,  they climbed down  the bank, and turning   ####-left went off  as  fast as they could.  Soon a shoulder of the hills cut off  the  light  of the fast westering sun. A cold wind flowed down to  meet them  from the mountains ahead.       They were beginning  to look out  for a place  off the Road, where they  could camp for the night, when they heard a sound that  brought  sudden fear  back  into their hearts: the  noise of  hoofs behind them. They looked back,  but they could not see far because of  the many windings and rollings of the   Road. As quickly as they could they scrambled off the beaten way and up into  the deep heather and bilberry brushwood on the slopes above, u ntil they came  to a small patch of thick-growing hazels.  As they peered out from among the  bushes, they could see the Road, faint and  grey in  the failing light, some  thirty feel  below them. The sound of hoofs  drew  nearer.  They were  going   fast, with a light clippety-clippely-clip. Then faintly,  as if it was blown  away from  them by the breeze,  they seemed  to catch a dim  ringing, as  of  small bells tinkling.       'That does not sound like a Black Rider's horse!' said Frodo, listening  intently. The  other  hobbits agreed hopefully that it did not,  but they all  remained  full of suspicion.  They had been in  fear of pursuit for  so long  that any sound from  behind seemed ominous and  unfriendly. But Strider  was  now leaning forward, stooped to the  ground, with a  hand to  his ear, and a   look of joy on his face.       The light faded, and  the leaves on the bushes  rustled softly. Clearer   and nearer  now the bells jingled, and clippety -clip  came the quick trotting  feet. Suddenly into view below came a white  horse, gleaming in the shadows,   running swiftly. In the dusk its  headstall flickered and flashed,  as if it  were studded with gems  like living stars. The rider's cloak streamed behind  him, and his hood was thrown back; his golden hair flowed shimmering in  the  wind of his  speed. To  Frodo it  appeared  that a  white  light was shining  through the form and raiment of the rider, as if through a thin veil.       Strider sprang from hiding and  dashed  down  towards the Road, leaping  with a cry through  the heather; but even before he  had moved or called, the  rider  had  reined in  his horse and halted, looking  up towards the thicket  where  they stood. When he saw  Strider, he dismounted and  ran to meet  him  calling out: Ai na vedui D®nadan! Mae govannen! His speech and clear  ringing  voice left no doubt in their hearts:  the rider  was  of the Elven-folk.  No  others that dwelt in the wide  world had voices so  fair  to hear. But there   ####-seemed to be  a note of haste or fear  in his call, and they saw tha t he was  now speaking quickly and urgently to Strider."
}