{
  "id": "8ac9940086d3a16cd60f29c1bf1715bf61d64ec2",
  "text": "  \"Doing what?\"  \"Getting to all her classes!\" Ron said. \"I heard her talking to Professor Vector, that Arithmancy witch, this morning. They were going on about yesterday's lesson, but Hermione can't 've been there, because she was with us in Care of Magical Creatures! And Ernie McMillan told me she's never missed a Muggle Studies class, but half of them are at the same time as Divination, and she's never missed one of them either!\"  Harry didn't have time to fathom the mystery of Hermione's impossible schedule at the moment; he really needed to get on with Snape's essay. Two seconds later, however, he was interrupted again, this time by Wood.  \"Bad news, Harry. I've just been to see Professor McGonagall about the Firebolt. She -- er -- got a bit shirty with me. Told m' I'd got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about you staying alive. Just because I told her I didn't care if it threw you off, as long as you caught the Snitch first.\" Wood shook his head in disbelief. \"Honestly, the way she was yelling at me... you'd think I'd said something terrible... then I asked her how much longer she was going to keep it. He screwed up his face and imitated Professor McGonagall's severe voice. 'As long as necessary, Wood'... I reckon it's time you ordered a new broom, Harry. There's an order form at the back of Which Broomstick... you could get a Nimbus Two Thousand and One, like Malfoy's got.\"  \"I'm not buying anything Malfoy thinks is good,\" said Harry flatly.  January faded imperceptibly into February, with no change in the bitterly cold weather. The match against Ravenclaw was drawing nearer and nearer, but Harry still hadn't ordered a new broom. He was now asking Professor McGonagall for news of the Firebolt after every Transfiguration lesson, Ron standing hopefully at his shoulder, Hermione rushing past with her face averted.  \"No, Potter, you can't have it back yet,\" Professor McGonagall told him the twelfth time this happened, before he'd even opened his mouth. \"We've checked for most of the usual curses, but Professor Flitwick believes the broom might be carrying a Hurling Hex. I shall tell you once we've finished checking it. Now, please stop badgering me.\"  To make matters even worse, Harry's anti-dementor lessons were not going nearly as well as he had hoped. Several sessions on, he was able to produce an indistinct, silvery shadow every time the boggart-dementor approached him, but his Patronus was too feeble to drive the dementor away. All it did was hover, like a semitransparent cloud, draining Harry of energy as he fought to keep it there. Harry felt angry with himself, guilty about his secret desire to hear his parents' voices again.  \"You're expecting too much of yourself,\" said Professor Lupin, sternly in their fourth week of practice. \"For a thirteen-year-old wizard, even an indistinct Patronus is a huge achievement. You aren't passing out anymore, are you?\"  I thought a Patronus would -- charge the dementors down or something,\" said Harry dispiritedly. \"Make them disappear --\"  \"The true Patronus does do that,\" said Lupin. \"But you've achieved a great deal in a very short space of time. If the dementors put in an appearance at your next Quidditch match, You will be able to keep them at bay long enough to get back to the ground.\"  \"You said it's harder if there are loads of them,\" said Harry.  \"I have complete confidence in you,\" said Lupin, smiling. \"Here -- you've earned a drink - something from the Three Broomsticks. You won't have tried it before --\"  He pulled two bottles out of his briefcase.  \"Butterbeer!\" said Harry, without thinking. \"Yeah, I like that stuff!\"  Lupin raised an eyebrow.  \"Oh -Ron and Hermione brought me some back from Hogsmeade,\" Harry lied quickly.  I see,\" said Lupin, though he still looked slightly suspicious. \"Well -- let's drink to a Gryffindor victory against Ravenclaw! Not that I'm supposed to take sides, as a teacher... \" he added hastily  They drank the butterbeer in silence, until Harry voiced something he'd been wondering for a while.  \"What's under a dementor's hood?\"  Professor Lupin lowered his bottle thoughtfully.  \"Hmmm... well, the only people who really know are in no condition to tell us. You see, the dementor lowers its hood only to use its last and worst weapon.\"  \"What's that?\"  \"They call it the Dementor's Kiss,\" said Lupin, with a slightly twisted smile. \"It's what dementors do to those they wish to destroy utterly. I suppose there must be some kind of mouth under there, because they clamp their jaws upon the mouth of the victim and -- and suck out his soul.\"  Harry accidentally spat out a bit of butterbeer.  \"What -- they kill --?\"  \"Oh no,\" said Lupin. \"Much worse than that. You can exist without your soul, you know, as long as your brain and heart are still working. But you'll have no sense of self anymore, no memory, no. .. anything. There's no chance at all of recovery. You'll just exist. As an empty shell."
}