{
  "id": "8b344e65987551d3d4af118b2f92f6947458ab79",
  "text": "  What madness is this?  he said bluntly. Brynden Tully had never been a man to blunt the edge of his words.  A night ascent, with the moon not even full? Even Lysa should know that’s an invitation to a broken neck.    The mules know the way, Ser Brynden.  A wiry girl of seventeen or eighteen years stepped up beside Lord Nestor. Her dark hair was cropped short and straight around her head, and she wore riding leathers and a light shirt of silvered ringmail. She bowed to Catelyn, more gracefully than her lord.  I promise you, my lady, no harm will come to you. It would be my honor to take you up. I’ve made the dark climb a hundred times. Mychel says my father must have been a goat.   She sounded so cocky that Catelyn had to smile.  Do you have a name, child?    Mya Stone, if it please you, my lady,  the girl said.  It did not please her; it was an effort for Catelyn to keep the smile on her face. Stone was a bastard’s name in the Vale, as Snow was in the north, and Flowers in Highgarden; in each of the Seven Kingdoms, custom had fashioned a surname for children born with no names of their own. Catelyn had nothing against this girl, but suddenly she could not help but think of Ned’s bastard on the Wall, and the thought made her angry and guilty, both at once. She struggled to find words for a reply.  Lord Nestor filled the silence.  Mya’s a clever girl, and if she vows she will bring you safely to the Lady Lysa, I believe her. She has not failed me yet.    Then I put myself in your hands, Mya Stone,  Catelyn said.  Lord Nestor, I charge you to keep a close guard on my prisoner.    And I charge you to bring the prisoner a cup of wine and a nicely crisped capon, before he dies of hunger,  Lannister said.  A girl would be pleasant as well, but I suppose that’s too much to ask of you.  The sellsword Bronn laughed aloud.  Lord Nestor ignored the banter.  As you say, my lady, so it will be done.  Only then did he look at the dwarf.  See our lord of Lannister to a tower cell, and bring him meat and mead.   Catelyn took her leave of her uncle and the others as Tyrion Lannister was led off, then followed the bastard girl through the castle. Two mules were waiting in the upper bailey, saddled and ready. Mya helped her mount one while a guardsman in a sky-blue cloak opened the narrow postern gate. Beyond was dense forest of pine and spruce, and the mountain like a black wall, but the steps were there, chiseled deep into the rock, ascending into the sky.  Some people find it easier if they close their eyes,  Mya said as she led the mules through the gate into the dark wood.  When they get frightened or dizzy, sometimes they hold on to the mule too tight. They don’t like that.    I was born a Tully and wed to a Stark,  Catelyn said.  I do not frighten easily. Do you plan to light a torch?  The steps were black as pitch.  The girl made a face.  Torches just blind you. On a clear night like this, the moon and the stars are enough. Mychel says I have the eyes of the owl.  She mounted and urged her mule up the first step. Catelyn’s animal followed of its own accord.   You mentioned Mychel before,  Catelyn said. The mules set the pace, slow but steady. She was perfectly content with that.   Mychel’s my love,  Mya explained.  Mychel Redfort. He’s squire to Ser Lyn Corbray. We’re to wed as soon as he becomes a knight, next year or the year after.   She sounded so like Sansa, so happy and innocent with her dreams. Catelyn smiled, but the smile was tinged with sadness. The Redforts were an old name in the Vale, she knew, with the blood of the First Men in their veins. His love she might be, but no Redfort would ever wed a bastard. His family would arrange a more suitable match for him, to a Corbray or a Waynwood or a Royce, or perhaps a daughter of some greater house outside the Vale. If Mychel Redfort laid with this girl at all, it would be on the wrong side of the sheet.  The ascent was easier than Catelyn had dared hope. The trees pressed close, leaning over the path to make a rustling green roof that shut out even the moon, so it seemed as though they were moving up a long black tunnel. But the mules were surefooted and tireless, and Mya Stone did indeed seem blessed with night-eyes. They plodded upward, winding their way back and forth across the face of the mountain as the steps twisted and turned. A thick layer of fallen needles carpeted the path, so the shoes of their mules made only the softest sound on the rock. The quiet soothed her, and the gentle rocking motion set Catelyn to swaying in her saddle. Before long she was fighting sleep.  Perhaps she did doze for a moment, for suddenly a massive ironbound gate was looming before them.  Stone,  Mya announced cheerily, dismounting. Iron spikes were set along the tops of formidable stone walls, and two fat round towers overtopped the keep. The gate swung open at Mya’s shout. Inside, the portly knight who commanded the waycastle greeted Mya by name and offered them skewers of charred meat and onions still hot from the spit."
}