{
  "id": "8c55abaaf4741ca4aa816d19b3c0a26dd9246666",
  "text": "  \"Clearly,\" said Mr. Malfoy, his pale eyes straying to Mr. and Mrs. Granger, who were watching apprehensively. \"The company you keep, Weasley ... and I thought your family could sink no lower ='  There was a thud of metal as Ginny's cauldron went flying; Mr. Weasley had thrown himself at Mr. Malfoy, knocking him backward into a bookshelf. Dozens of heavy spellbooks came thundering down on all their heads; there was a yell of, \"Get him, Dad!\" from Fred or George; Mrs. Weasley was shrieking, \"No, Arthur, no!\"; the crowd stampeded backward, knocking more shelves over; \"Gentlemen, please - please!\" cried the assistant, and then, louder than all  \"Break it up, there, gents, break it up -\"  62  Hagrid was wading toward them through the sea of books. In an instant he had pulled Mr. Weasley and Mr. Malfoy apart. Mr. Weasley had a cut lip and Mr. Malfoy had been hit in the eye by an Encyclopedia of Toadstools. He was still holding Ginny's old Transfiguration book. He thrust it at her, his eyes glittering with malice.  \"Here, girl - take your book - it's the best your father can give you -\" Pulling himself out of Hagrid's grip he beckoned to Draco and swept from the shop.  \"Yeh should've ignored him, Arthur,\" said Hagrid, almost lifting Mr. Weasley off his feet as he straightened his robes. \"Rotten ter the core, the whole family, everyone knows that - no Malfoy's worth listenin' ter - bad blood, that's what it is - come on now - let's get outta here.\"  The assistant looked as though he wanted to stop them leaving, but he barely came up to Hagrid's waist and seemed to think better of it. They hurried up the street, the Grangers shaking with fright and Mrs. Weasley beside herself with fury.  \"A fine example to set for your children . . . brawling in public . . . what Gilderoy Lockhart must've thought -\"  \"He was pleased,\" said Fred. \"Didn't you hear him as we were leaving? He was asking that bloke from the Daily Prophet if he'd be able to work the fight into his report - said it was all publicity -\"  But it was a subdued group that headed back to the fireside in the Leaky Cauldron, where Harry, the Weasleys, and all their shopping would be traveling back to the Burrow using Floo powder. They said good-bye to the Grangers, who were leaving the pub for the Muggle street on the other side; Mr. Weasley started to ask  63  them how bus stops worked, but stopped quickly at the look on Mrs. Weasley's face.  Harry took off his glasses and put them safely in his pocket before helping himself to Floo powder. It definitely wasn't his favorite way to travel.  C H-H A P T E RR  F I v E  THE WHOMPING  WILLOW  he end of the summer vacation came too quickly for Harry's liking. He was looking forward to getting back to Hogwarts, but his month at the Burrow had been the happiest of his life. It was difficult not to feel jealous of Ron when he thought of the Dursleys and the sort of welcome he could expect next time he turned up on Privet Drive.  On their last evening, Mrs. Weasley conjured up a sumptuous dinner that included all of Harry's favorite things, ending with a mouthwatering treacle pudding. Fred and George rounded off the evening with a display of Filibuster fireworks; they fiIled the kitchen with red and blue stars that bounced from ceiling to wall for at least half an hour. Then it was time for a last mug of hot chocolate and bed.  It took a long while to get started next morning. They were up at dawn, but somehow they still seemed to have a great deal to do.  65    Mrs. Weasley dashed about in a bad mood looking for spare socks and quills; people kept colliding on the stairs, half-dressed with bits of toast in their hands; and Mr. Weasley nearly broke his neck, tripping over a stray chicken as he crossed the yard carrying Ginny's trunk to the car.  Harry couldn't see how eight people, six large trunks, two owls, and a rat were going to fit into one small Ford Anglia. He had reckoned, of course, without the special features that Mr. Weasley had added.  \"Not a word to Molly,\" he whispered to Harry as he opened the. trunk and showed him how it had been magically expanded so that the luggage fitted easily.  When at last they were all in the car, Mrs. Weasley glanced into the back seat, where Harry, Ron, Fred, George, and Percy were all sitting comfortably side by side, and said, \"Muggles do know more than we give them credit for, don't they?\" She and Ginny got into the front seat, which had been stretched so that it resembled a park bench. \"I mean, you'd never know it was this roomy from the outside, would you?\"  Mr. Weasley started up the engine and they trundled out of the yard, Harry turning back for a last look at the house. He barely had time to wonder when he'd see it again when they were back George had forgotten his box of Filibuster fireworks. Five minutes after that, they skidded to a halt in the yard so that Fred could run in for his broomstick. They had almost reached the highway when Ginny shrieked that she'd left her diary."
}