{
  "id": "8ce234847fd84c5e4069e8563ea1b98cdd53a33e",
  "text": " Their drums echoed off the ice like rolling thunder.  He could feel the despair all around him.  There must be a hundred thousand,  Satin wailed.  How can we stop so many?    The Wall will stop them,  Jon heard himself say. He turned and said it again, louder.  The Wall will stop them. The Wall defends itself.  Hollow words, but he needed to say them, almost as much as his brothers needed to hear them.  Mance wants to unman us with his numbers. Does he think we’re stupid?  He was shouting now, his leg forgotten, and every man was listening.  The chariots, the horsemen, all those fools on foot… what are they going to do to us up here? Any of you ever see a mammoth climb a wall?  He laughed, and Pyp and Owen and half a dozen more laughed with him.  They’re nothing, they’re less use than our straw brothers here, they can’t reach us, they can’t hurt us, and they don’t frighten us, do they?    NO!  Grenn shouted.   They’re down there and we’re up here,  Jon said,  and so long as we hold the gate they cannot pass. They cannot pass!  They were all shouting then, roaring his own words back at him, waving swords and longbows in the air as their cheeks flushed red. Jon saw Kegs standing there with a warhorn slung beneath his arm.  Brother,  he told him,  sound for battle.    Grinning, Kegs lifted the horn to his lips, and blew the two long blasts that meant wildlings. Other horns took up the call until the Wall itself seemed to shudder, and the echo of those great deep-throated moans drowned all other sound.   Archers,  Jon said when the horns had died away,  you’ll aim for the giants with that ram, every bloody one of you. Loose at my command, not before. THE GIANTS AND THE RAM. I want arrows raining on them with every step, but we’ll wait till they’re in range. Any man who wastes an arrow will need to climb down and fetch it back, do you hear me?    I do,  shouted Owen the Oaf.  I hear you, Lord Snow.   Jon laughed, laughed like a drunk or a madman, and his men laughed with him. The chariots and the racing horsemen on the flanks were well ahead of the center now, he saw. The wildlings had not crossed a third of the half mile, yet their battle line was dissolving.  Load the trebuchet with caltrops,  Jon said.  Owen, Kegs, angle the catapults toward the center. Scorpions, load with fire spears and loose at my command.  He pointed at the Mole’s Town boys.  You, you, and you, stand by with torches.   The wildling archers shot as they advanced; they would dash forward, stop, loose, then run another ten yards. There were so many that the air was constantly full of arrows, all falling woefully short. A waste, Jon thought. Their want of discipline is showing. The smaller horn-and-wood bows of the free folk were outranged by the great yew longbows of the Night’s Watch, and the wildlings were trying to shoot at men seven hundred feet above them.  Let them shoot,  Jon said.  Wait. Hold.  Their cloaks were flapping behind them.  The wind is in our faces, it will cost us range. Wait.  Closer, closer. The skins wailed, the drums thundered, the wildling arrows fluttered and fell.   DRAW.  Jon lifted his own bow and pulled the arrow to his ear. Satin did the same, and Grenn, Owen the Oaf, Spare Boot, Black Jack Bulwer, Arron and Emrick. Zei hoisted her crossbow to her shoulder. Jon was watching the ram come on and on, the mammoths and giants lumbering forward on either side. They were so small he could have crushed them all in one hand, it seemed. If only my hand was big enough. Through the killing ground they came. A hundred crows rose from the carcass of the dead mammoth as the wildlings thundered past to either side of them. Closer and closer, until…   LOOSE!   The black arrows hissed downward, like snakes on feathered wings. Jon did not wait to see where they struck. He reached for a second arrow as soon as the first left his bow.  NOTCH. DRAW. LOOSE.  As soon as the arrow flew he found another.  NOTCH. DRAW. LOOSE.  Again, and then again. Jon shouted for the trebuchet, and heard the creak and heavy thud as a hundred spiked steel caltrops went spinning through the air.  Catapults,  he called,  scorpions. Bowmen, loose at will.  Wildling arrows were striking the Wall now, a hundred feet below them. A second giant spun and staggered. Notch, draw, loose. A mammoth veered into another beside it, spilling giants on the ground. Notch, draw, loose. The ram was down and done, he saw, the giants who’d pushed it dead or dying.  Fire arrows,  he shouted.  I want that ram burning.  The screams of wounded mammoths and the booming cries of giants mingled with the drums and pipes to make an awful music, yet still his archers drew and loosed, as if they’d all gone as deaf as dead Dick Follard. They might be the dregs of the order, but they were men of the Night’s Watch, or near enough as made no matter. That’s why they shall not pass.  One of the mammoths was running berserk, smashing wildlings with his trunk and crushing archers underfoot. Jon pulled back his bow once more, and launched another arrow at the beast’s shaggy back to urge him on."
}