{
  "id": "8d61e149e06979caadde67613c0b49a8c5f4a726",
  "text": " `Nassty wicked Men!  Smjagol's  neck still hurts him, yes it does. Let's go! '       `Yes, let  us go,' said Frodo. `But  if you can only speak ill of those   ####-who showed you mercy, keep silent! '       `Nice Master! ' said Gollum. `Smjagol was only joking. Always forgives,   he  does, yes, yes, even nice Master's little trickses. Oh yes, nice Master,  nice Smjagol! '       Frodo and Sam did not  answer.  Hoisting their packs and  taking  their  staves in hand, they passed on into the woods of Ithilien.       Twice that day they  rested  and took a little of the food provided  by  Faramir:  dried fruits and  salted  meat, enough for  many  days;  and bread  enough to last while it was still fresh. Gollum ate nothing.       The sun rose and  passed  overhead unseen, and began to sink,  and  the  light through  the trees to the west grew golden; and always they  walked in  cool green  shadow, and all about  them was silence. The birds seemed all to  have flown away or to have fallen dumb.       Darkness came early  to the silent  woods, and before the fall of night  they halted, weary, for they had walked  seven leagues or more  from Henneth  Annyn. Frodo lay and  slept  away  the  night  on the  deep mould beneath an  ancient tree. Sam beside  him was more uneasy: he woke many times, but there  was never a sign of Gollum, who had slipped off as  soon as  the others  had  settled to rest. Whether he had slept by himself in some hole nearby, or had  wandered  restlessly prowling through  the  night, he did  not say;  but  he  returned with the first glimmer of light, and roused his companions.        `Must get up, yes  they must!'  he  said. 'Long ways to go still, south  and east. Hobbits must make haste!'       That day passed  much  as the  day  before had  gone,  except that  the  silence seemed deeper; the air grew heavy, and it began to be stifling under   the trees. It felt as if thunder was  brewing. Gollum often paused, sniffing  the air, and then he would mutter to himself and urge them to greater speed.        As the third stage of  their day's  march drew on  and afternoon wa ned,  the forest opened out, and the trees became larger and more scattered. Great  ilexes of  huge girth stood  dark  and solemn in  wide glades with  here and  there among  them  hoary ash-trees. and  giant oaks  just putting  out their  brown-green  buds.  About them  lay long launds of green  grass dappled with  celandine and anemones, white and blue, now folded for sleep; and there were  acres  populous with  the leaves of  woodland hyacinths: already their sleek   bell-stems were  thrusting through the  mould . No  living creature, beast or   bird, was to be seen, but in these open places Gollum grew afraid, and  they   walked now with caution, flitting from one long shadow to another.   ####-     Light  was fading fast when they came to the forest -end. There they sat  under  an old gnarled oak that  sent its roots twisting like snakes  down  a   steep crumbling bank. A deep dim valley lay before them. On its further side  the  woods gathered  again,  blue  and grey under  the  sullen  evening, and  marched on southwards. To the  right the Mountains of Gondor  glowed,  remote  in  the  West,  under  a fire-flecked  sky. To  the left  lay darkness:  the  towering walls of Mordor;  and  out of  that darkness the long valley  came,  falling steeply in an ever -widening trough towards the Anduin. At its bottom  ran a hurrying stream:  Frodo could  hear its stony voice coming  up through  the silence; and beside  it on the hither side a road went winding down like  a pale ribbon, down into chill grey mists that  no  gleam of sunset touched.  There it seemed to  Frodo that he descried far off, floating as it were on a   shadowy sea, the high  dim  tops and broken pinnacles of old  towers forlorn  and dark.       He turned to Gollum. `Do you know where we are? ' he said.       'Yes,  Master. Dangerous places. This is the road from the Tower of the  Moon, Master, down to the ruined city by the shores of the River. The ruined  city, yes, very nasty place, full of  enemies. We shouldn't have taken Men's  advice. Hobbits have come a long way out of the path. Must go east now, away  up there.' He waved his skinny arm  towards  the darkling mountains. `And we  can't  use  this  road. Oh  no!  Cruel peoples come this way, down  from the  Tower.'       Frodo looked down on to the road. At any rate nothing was moving  on it   now. It appeared lonely  and forsaken, running  down to empty  ruins  in the  mist. But there was an evil feeling in the air, as if things might indeed be  passing up and down that  eyes could  not see. Frodo shuddered  as he looked  again  at the distant pinnacles now dwindling into  night, and the  sound of  the water  seemed  cold  and cruel: the voice  of Morgulduin,  the  polluted  stream that flowed from the Valley of the Wraiths.        'What shall we do?  ' he said.  'We have walked long  and far. Shall we  look for some place in the woods behind where we can lie hidden? '       'No good  hiding in the  dark,' said Gollum."
}