{
  "id": "8e0a228c45aaf345da4f5a7457d180d099899661",
  "text": "  Fie!  he shouted down.  I’m not in the tourney!    The hides won’t burn,  Jon said, as much to himself as to the others. Their only hope was to try and crush the turtle when it reached the Wall. For that, they needed boulders. No matter how stoutly built the turtle was, a huge chunk of rock crashing straight down on top of it from seven hundred feet was bound to do some damage.  Grenn, Owen, Kegs, it’s time.   Alongside the warming shed a dozen stout oaken barrels were lined up in a row. They were full of crushed rock; the gravel that the black brothers customarily spread on the footpaths to give themselves better footing atop the Wall. Yesterday, after he’d seen the free folk covering the turtle with sheepskins, Jon told Grenn to pour water into the barrels, as much as they would take. The water would seep down through the crushed stone, and overnight the whole thing would freeze solid. It was the nearest thing to a boulder they were going to get.   Why do we need to freeze it?  Grenn had asked him.  Why don’t we just roll the barrels off the way they are?   Jon answered,  If they crash against the Wall on the way down they’ll burst, and loose gravel will spray everywhere. We don’t want to rain pebbles on the whoresons.   He put his shoulder to the one barrel with Grenn, while Kegs and Owen were wrestling with another. Together they rocked it back and forth to break the grip of the ice that had formed around its bottom.  The bugger weighs a ton,  said Grenn.   Tip it over and roll it,  Jon said.  Careful, if it rolls over your foot you’ll end up like Spare Boot.   Once the barrel was on its side, Jon grabbed a torch and waved it above the surface of the Wall, back and forth, just enough to melt the ice a little. The thin film of water helped the barrel roll more easily. Too easily, in fact; they almost lost it. But finally, with four of them pooling their efforts, they rolled their boulder to the edge and stood it up again.  They had four of the big oak barrels lined up above the gate by the time Pyp shouted,  There’s a turtle at our door!  Jon braced his injured leg and leaned out for a look. Hoardings, Marsh should have built hoardings. So many things they should have done. The wildlings were dragging the dead giants away from the gate. Horse and Mully were dropping rocks down on them, and Jon thought he saw one man go down, but the stones were too small to have any effect on the turtle itself. He wondered what the free folk would do about the dead mammoth in the path, but then he saw. The turtle was almost as wide as a longhall, so they simply pushed it over the carcass. His leg twitched, but Horse caught his arm and drew him back to safety.  You shouldn’t lean out like that,  the boy said.   We should have built hoardings.  Jon thought he could hear the crash of axes on wood, but that was probably just fear ringing in his ears. He looked to Grenn.  Do it.   Grenn got behind a barrel, put his shoulder against it, grunted, and began to push. Owen and Mully moved to help him. They shoved the barrel out a foot, and then another. And suddenly it was gone.  They heard the thump as it struck the Wall on the way down, and then, much louder, the crash and crack of splintering wood, followed by shouts and screams. Satin whooped and Owen the Oaf danced in circles, while Pyp leaned out and called,  The turtle was stuffed full of rabbits! Look at them hop away!    Again,  Jon barked, and Grenn and Kegs slammed their shoulders against the next barrel, and sent it tottering out into empty air.  By the time they were done, the front of Mance’s turtle was a crushed and splintered ruin, and wildlings were spilling out the other end and scrambling for their camp. Satin scooped up his crossbow and sent a few quarrels after them as they ran, to see them off the faster. Grenn was grinning through his beard, Pyp was making japes, and none of them would die today.  On the morrow, though… Jon glanced toward the shed. Eight barrels of gravel remained where twelve had stood a few moments before. He realized how tired he was then, and how much his wound was hurting. I need to sleep. A few hours, at least. He could go to Maester Aemon for some dreamwine, that would help.  I am going down to the King’s Tower,  he told them.  Call me if Mance gets up to anything. Pyp, you have the Wall.    Me?  said Pyp.   Him?  said Grenn.  Smiling, he left them to it and rode down in the cage.  A cup of dreamwine did help, as it happened. No sooner had he stretched out on the narrow bed in his cell than sleep took him. His dreams were strange and formless, full of strange voices, shouts and cries, and the sound of a warhorn, blowing low and loud, a single deep booming note that lingered in the air.  When he awoke the sky was black outside the arrow slit that served him for a window, and four men he did not know were standing over him. One held a lantern.  Jon Snow,  the tallest of them said brusquely,  pull on your boots and come with us.   His first groggy thought was that somehow the Wall had fallen whilst he slept, that Mance Rayder had sent more giants or another turtle and broken through the gate."
}