{
  "id": "8e0f90cd827db0300c902afc5c8e9a918e13de32",
  "text": " Next came Ser Garlan Tyrell and his lady wife, and finally it was their turn.   My lady.  Tyrion offered Sansa his arm. She took it dutifully, but he could feel her stiffness as they walked up the aisle together. She never once looked down at him.  He heard them cheering outside even before he reached the doors. The mob loved Margaery so much they were even willing to love Joffrey again. She had belonged to Renly, the handsome young prince who had loved them so well he had come back from beyond the grave to save them. And the bounty of Highgarden had come with her, flowing up the roseroad from the south. The fools didn’t seem to remember that it had been Mace Tyrell who closed the roseroad to begin with, and made the bloody famine.  They stepped out into the crisp autumn air.  I feared we’d never escape,  Tyrion quipped.  Sansa had no choice but to look at him then.  I… yes, my lord. As you say.  She looked sad.  It was such a beautiful ceremony, though.   As ours was not.  It was long, I’ll say that much. I need to return to the castle for a good piss.  Tyrion rubbed the stump of his nose.  Would that I’d contrived some mission to take me out of the city. Littlefinger was the clever one.   Joffrey and Margaery stood surrounded by Kingsguard atop the steps that fronted on the broad marble plaza. Ser Addam and his gold cloaks held back the crowd, while the statue of King Baelor the Blessed gazed down on them benevolently. Tyrion had no choice but to queue up with the rest to offer congratulations. He kissed Margaery’s fingers and wished her every happiness. Thankfully, there were others behind them waiting their turn, so they did not need to linger long.  Their litter had been sitting in the sun, and it was very warm inside the curtains. As they lurched into motion, Tyrion reclined on an elbow while Sansa sat staring at her hands. She is just as comely as the Tyrell girl. Her hair was a rich autumn auburn, her eyes a deep Tully blue. Grief had given her a haunted, vulnerable look; if anything, it had only made her more beautiful. He wanted to reach her, to break through the armor of her courtesy. Was that what made him speak? Or just the need to distract himself from the fullness in his bladder?   I had been thinking that when the roads are safe again, we might journey to Casterly Rock.  Far from Joffrey and my sister. The more he thought about what Joff had done to Lives of Four Kings, the more it troubled him. There was a message there, oh yes.  It would please me to show you the Golden Gallery and the Lion’s Mouth, and the Hall of Heroes where Jaime and I played as boys. You can hear thunder from below where the sea comes in…   She raised her head slowly. He knew what she was seeing; the swollen brutish brow, the raw stump of his nose, his crooked pink scar and mismatched eyes. Her own eyes were big and blue and empty.  I shall go wherever my lord husband wishes.    I had hoped it might please you, my lady.    It will please me to please my lord.   His mouth tightened. What a pathetic little man you are. Did you think babbling about the Lion’s Mouth would make her smile? When have you ever made a woman smile but with gold?  No, it was a foolish notion. Only a Lannister can love the Rock.    Yes, my lord. As you wish.   Tyrion could hear the commons shouting out King Joffrey’s name. In three years that cruel boy will be a man, ruling in his own right… and every dwarf with half his wits will be a long way from King’s Landing. Oldtown, perhaps. Or even the Free Cities. He had always had a yen to see the Titan of Braavos. Perhaps that would please Sansa. Gently, he spoke of Braavos, and met a wall of sullen courtesy as icy and unyielding as the Wall he had walked once in the north. It made him weary. Then and now.  They passed the rest of the journey in silence. After a while, Tyrion found himself hoping that Sansa would say something, anything, the merest word, but she never spoke. When the litter halted in the castle yard, he let one of the grooms help her down.  We will be expected at the feast an hour hence, my lady. I will join you shortly.  He walked off stiff-legged. Across the yard, he could hear Margaery’s breathless laugh as Joffrey swept her from the saddle. The boy will be as tall and strong as Jaime one day, he thought, and I’ll still be a dwarf beneath his feet. And one day he’s like to make me even shorter…  He found a privy and sighed gratefully as he relieved himself of the morning’s wine. There were times when a piss felt near as good as a woman, and this was one. He wished he could relieve himself of his doubts and guilts half as easily.  Podrick Payne was waiting outside his chambers.  I laid out your new doublet. Not here. On your bed. In the bedchamber.    Yes, that’s where we keep the bed.  Sansa would be in there, dressing for the feast. Shae as well.  Wine, Pod.   Tyrion drank it in his window seat, brooding over the chaos of the kitchens below. The sun had not yet touched the top of the castle wall, but he could smell breads baking and meats roasting."
}