{
  "id": "8e39a17218d2b727c3099191731db64113bd1916",
  "text": " \"Never.  How could you say something like that - I want Harry to win the tournament.  Harry knows that, don't you, Harry?\" \"You've got a funny way of showing it,\" sneered Ron. \"This whole tournament's supposed to be about getting to know foreign wizards and making friends with them!\"  said Hermione hotly. \"No it isn't!\" shouted Ron.  \"It's about winning!\" People were starting to stare at them. \"Ron,\" said Harry quietly, \"I haven't got a problem with Hermione coming with Krum -\" But Ron ignored Harry too. \"Why don't you go and find Vicky, he'll be wondering where you are,\" said Ron. \"Don't call him Vicky!\" Hermione jumped to her feet and stormed off across the dance floor, disappearing into the crowd.  Ron watched her go with a mixture of anger and satisfaction on his face. \"Are you going to ask me to dance at all?\" Padma asked him. \"No,\" said Ron, still glaring after Hermione. \"Fine,\" snapped Padma, and she got up and went to join Parvati and the Beauxbatons boy, who conjured up one of his friends to join them so fast that Harry could have sworn he had zoomed him there by a Summoning Charm. \"Vare is Herm-own-ninny?\" said a voice. Krum had just arrived at their table clutching two butterbeers. \"No idea,\" said Ron mulishly, looking up at him. \"Lost her, have you?\" Krum was looking surly again. \"Veil, if you see her, tell her I haff drinks,\" he said, and he slouched off. \"Made friends with Viktor Krum, have you, Ron?\" Percy had bustled over, rubbing his hands together and looking extremely pompous. \"Excellent!  That's the whole point, you know - international magical cooperation!\" To Harry's displeasure, Percy now took Padma's vacated seat.  The top table was now empty; Professor Dumbledore was dancing with Professor Sprout, Ludo Bagman with Professor McGonagall; Madame Maxime and Hagrid were cutting a wide path around the dance floor as they waltzed through the students, and Karkaroff was nowhere to be seen. When the next song ended, everybody applauded once more, and Harry saw Ludo Bagman kiss Professor McGonagall's hand and make his way back through the crowds, at which point Fred and George accosted him. \"What do they think they're doing, annoying senior Ministry members?\" Percy hissed, watching Fred and George suspiciously. \"No respect...\" Ludo Bagman shook off Fred and George fairly quickly, however, and, spotting Harry, waved and came over to their table. \"I hope my brothers weren't bothering you, Mr. Bagman?\" said Percy at once. \"What? Oh not at all, not at all!\" said Bagman.  \"No, they were just telling me a bit more about those fake wands of theirs.  Wondering if I could advise them on the marketing.  I've promised to put them in touch with a couple of contacts of mine at Zonko's Joke Shop. ...\" Percy didn't look happy about this at all, and Harry was prepared to bet he would be rushing to tell Mrs. Weasley about this the moment he got home. Apparently Fred and George's plans had grown even more ambitious lately, if they were hoping to sell to the public.  Bagman opened his mouth to ask Harry something, but Percy diverted him. \"How do you feel the tournament's going, Mr. Bagman?  Our department's quite satisfied - the hitch with the Goblet of Fire\" - he glanced at Harry - \"was a little unfortunate, of course, but it seems to have gone very smoothly since, don't you think?\" \"Oh yes,\" Bagman said cheerfully, \"it's all been enormous fun.  How's old Barty doing? Shame he couldn't come.\" \"Oh I'm sure Mr. Crouch will be up and about in no time,\" said Percy importantly, \"but in the meantime, I'm more than willing to take up the slack.  Of course, it's not all attending balls\" - he laughed airily - \"oh no, I've had to deal with all sorts of things that have cropped up in his absence - you heard Ali Bashir was caught smuggling a consignment of flying carpets into the country?  And then we've been trying to persuade the Transylvanians to sign the International Ban on Dueling.  I've got a meeting with their Head of Magical Cooperation in the new year -\" \"Let's go for a walk,\" Ron muttered to Harry, \"get away from Percy. ...\" Pretending they wanted more drinks.  Harry and Ron left the table, edged around the dance floor, and slipped out into the entrance hall.  The front doors stood open, and the fluttering fairy lights in the rose garden winked and twinkled as they went down the front steps, where they found themselves surrounded by bushes; winding, ornamental paths; and large stone statues.  Harry could hear splashing water, which sounded like a fountain.  Here and there, people were sitting on carved benches.  He and Ron set off along one of the winding paths through the rosebushes, but they had gone only a short way when they heard an unpleasantly familiar voice. \"... don't see what there is to fuss about, Igor.\" \"Severus, you cannot pretend this isn't happening!\"  Karkaroffs voice sounded anxious and hushed, as though keen not to be overheard.  \"It's been getting clearer and clearer for months.  I am becoming seriously concerned, I can't deny it _\" \"Then flee,\" said Snapes voice curtly."
}