{
  "id": "8fac2b0a4bef7e7b2661ef57672ef00a29877d7a",
  "text": "  \"They won't want us visiting them now!  We could've tried to get more stuff out of Winky about Crouch!\" \"Oh as if you care about that!\" scoffed Hermione.  \"You only like coming down here for the food!\" It was an irritable sort of day after that.  Harry got so tired of Ron and Hermione sniping at each other over their homework in the common room that he took Sirius's food up to the Owlery that evening on his own. Pigwidgeon was much too small to carry an entire ham up to the mountain by himself, so Harry enlisted the help of two school screech owls as well.  When they had set off into the dusk, looking extremely odd carrying the large package between them.  Harry leaned on the windowsill, looking out at the grounds, at the dark, rustling treetops of the Forbidden Forest, and the rippling sails of the Durmstrang ship.  An eagle owl flew through the coil of smoke rising from Hagrids chimney; it soared toward the castle, around the Owlery, and out of sight. Looking down, Harry saw Hagrid digging energetically in front of his cabin.  Harry wondered what he was doing; it looked as though he were making a new vegetable patch.  As he watched, Madame Maxime emerged from the Beauxbatons carriage and walked over to Hagrid.  She appeared to be trying to engage him in conversation.  Hagrid leaned upon his spade, but did not seem keen to prolong their talk, because Madame Maxime returned to the carriage shortly afterward. Unwilling to go back to Gryffindor Tower and listen to Ron and Hermione snarling at each other, Harry watched Hagrid digging until the darkness swallowed him and the owls around Harry began to awake, swooshing past him into the night.  By breakfast the next day Ron's and Hermione's bad moods had burnt out, and to Harrys relief, Ron's dark predictions that the house-elves would send substandard food up to the Gryffindor table because Hermione had insulted them proved false; the bacon, eggs, and kippers were quite as good as usual. When the post owls arrived, Hermione looked up eagerly; she seemed to be expecting something. \"Percy won't've had time to answer yet,\" said Ron.  \"We only sent Hedwig yesterday.\" \"No, it's not that,\" said Hermione.  \"I've taken out a subscription to the Daily Prophet. I'm getting sick of finding everything out from the Slytherins.\" \"Good thinking!\"  said Harry, also looking up at the owls.  \"Hey, Hermione, I think you're in luck -\" A gray owl was soaring down toward Hermione. \"It hasn't got a newspaper, though,\" she said, looking disappointed.  \"It's -\" But to her bewilderment, the gray owl landed in front of her plate, closely followed by four barn owls, a brown owl, and a tawny. \"How many subscriptions did you take out?\" said Harry, seizing Hermione's goblet before it was knocked over by the cluster of owls, all of whom were jostling close to her, trying to deliver their own letter first. \"What on earth - ?\" Hermione said, taking the letter from the gray owl, opening it, and starting to read.  \"Oh really!\" she sputtered, going rather red. \"What's up?\" said Ron. \"It,'s - oh how ridiculous -\" She thrust the letter at Harry, who saw that it was not handwritten, but composed from pasted letters that seemed to have been cut out of the Daily Prophet.  YOU ARE A WICKED GIRL.  HARRY POTTER DESERVES BETTER.  GO BACK WHERE YOU CAME FROM MUGGLE.  \"They're all like it!\"  said Hermione desperately, opening one letter after another.  \"'Harry Potter can do much better than the likes of you. . . .' 'You deserve to be boiled in frog spawn. . . .' Ouch!\" She had opened the last envelope, and yellowish-green liquid smelling strongly of petrol gushed over her hands, which began to erupt in large yellow boils. \"Undiluted bubotuber pus!\" said Ron, picking up the envelope gingerly and sniffing it. \"Ow!\"  said Hermione, tears starting in her eyes as she tried to rub the pus off her hands with a napkin, but her fingers were now so thickly covered in painful sores that it looked as though she were wearing a pair of thick, knobbly gloves. \"You'd better get up to the hospital wing,\" said Harry as the owls around Hermione took flight.  \"We'll tell Professor Sprout where you've gone. . . .\" \"I warned her!\"  said Ron as Hermione hurried out of the Great Hall, cradling her hands. \"I warned her not to annoy Rita Skeeter!  Look at this one ...\"  He read out one of the letters Hermione had left behind: \"I read In Witch Weekly about how you are playing Harry Potter false and that boy has had enough hardship and I will be sending you a curse by next post as soon as I can find a big enough envelope.'  Blimey, she'd better watch out for herself.\" Hermione didn't turn up for Herbology.  As Harry and Ron left the greenhouse for their Care of Magical Creatures class, they saw Malfoy, Crabbe, and Goyle descending the stone steps of the castle.  Pansy Parkinson was whispering and giggling behind them with her gang of Slytherin girls.  Catching sight of Harry, Pansy called, \"Potter, have you split up with your girlfriend?  Why was she so upset at breakfast?\" Harry ignored her; he didn't want to give her the satisfaction of knowing how much trouble the Witch Weekly article had caused."
}