{
  "id": "905b8c57e56938a245fb131e8a5397552bd7a6d0",
  "text": " and all   about it there had lain a pleasant, fertile land.       It was not so now. Beneath the walls of Isengard there still were acres  tilled  by  the  slaves  of Saruman;  but  most  of the valley had  become a   wilderness of  weeds and  thorns.  Brambles  trailed  upon  the  ground,  or  clambering over bush and  bank, made shaggy caves where small beasts  housed.  No  trees grew there; but among  the rank  grasses  could still be  seen the  burned and axe-hewn stumps of ancient groves. It  was  a sad country, silent   now  but for the stony noise  of quick  waters. Smokes and steams drifted in   sullen clouds and lurked  in the  hollows.  The  riders did  not speak.  Many   ####-doubted in their hearts, wondering to what dismal end their journey led.       After they had ridden for some miles, the highway became a wide street,   paved with great flat stones, squared and laid with skill; no blade of  grass  was seen in any joint. Deep  gutters, filled with  trickling water. ran down  on either side. Suddenly  a tall pillar loomed up before them. It was black;  and set upon it was a great stone, carved and painted in the likeness  of  a   long  White Hand. Its finger pointed north. Not far now they knew  that  the  gates of Isengard  must stand, and  their hearts  were heavy; but their eyes  could not pierce the mists ahead.       Beneath  the  mountain's  arm within  the  Wizard's Vale through  years  uncounted had stood that ancient place that  Men called Isengard.  Partly it  was shaped  in  the making of  the mountains, but  mighty works  the  Men of  Westernesse had wrought there of  old; and Saruman  had dwelt there long and  had not been idle.       This  was  its fashion,  while Saruman was at  his height, accounted by  many the chief of Wizards. A great ring-wall of stone, like towering cliffs,  stood out from the shelter of the mountain-side, from which it ran  and then  returned again. One entrance only was there made in  it, a great arch delved  in the  southern wall. Here  through the black  rock a long  tunnel had been  hewn, closed at either end with mighty  doors of iron.  They were so wrought  and poised upon their  huge hinges, posts of  steel driven  into the  living  stone, that  when unbarred they could  be moved with  a light  thrust of the  arms, noiselessly. One who passed in and came at length out of  the  echoing   tunnel,  beheld a  plain,  a great  circle, somewhat  hollowed  like a  vast   shallow bowl: a mile it measured from rim to rim. Once it had been green and  filled  with avenues, and  groves of fruitful trees, watered by streams that  flowed  from the mountains to  a lake. But no green thing grew there  in the  latter  days of Saruman. The  roads wer e  paved with stone-flags,  dark  and  hard;  and beside their borders instead of trees there marched long lines of  pillars, some of marble, some of copper and of iron. joined by heavy chains.        Many  houses  there  were,  chambers,  halls,  and  passages,  cut  and  tunnelled back into the  walls upon their  inner side, so that all  the open  circle  was overlooked by countless windows and dark doors. Thousands  could  dwell  there,  workers, servants, slaves, and warriors with  great  store of  arms; wolves  were fed and stabled in deep dens beneath. The plain, too, was  bored and delved. Shafts were driven deep into the  ground; their upper ends   were  covered by low mounds and domes of stone, so that in the moonlight the   ####-Ring  of Isengard looked like a  graveyard  of  unquiet dead. For the ground   trembled. The shafts  ran  down by many slopes and  spiral stairs to caverns  far under; there Saruman had treasuries,  store-houses, armouries, smithies,   and  great  furnaces.  Iron  wheels  revolved  there endlessly, and  hammers  thudded. At night plumes of vapour steamed from the vents, lit  from beneath  with red light, or blue, or venomous green.       To the  centre  all the roads ran between  their chains. There stood  a   tower of  marvellous shape.  It  was  fashioned by  the builders of old, who  smoothed  the  Ring of Isengard, and yet it seemed  a thing not  made by the  craft  of Men, but riven from the bones of the  earth in the ancient torment  of the hills. A peak and isle of rock  it was. black and gleaming hard: four  mighty piers of many-sided stone were  welded  into one, but near the summit  they  opened  into gaping  horns. their  pinnacles sharp  as the  points  of  spears, keen-edged as  knives. Between  them was a narrow  space,  and there  upon a floor of   polished stone,  written  with  strange signs,  a man might   stand  five  hundred feet above the plain. This was Orthanc,  the citadel of  Saruman, the  name of which had (by design or chance) a twofold meaning; for   in the Elvish  speech orthanc  signifies Mount Fang,  but in the language of  the Mark of old the Cunning Mind.       A strong  place  and wonderful  was  Isengard,  and  long  it had  been  beautiful;  and there great lords had dwelt, the wardens of  Gondor upon the  West, and wise men that watched the stars."
}