{
  "id": "9093934239c48b4a47c749db9a52c31618b70483",
  "text": " He prided himself on keeping his weapons sharp.  When I return, I shall expect a warm room and clean rushes,  he warned the thralls as he drew on a pair of black gloves, the silk decorated with a delicate scrollwork tracery in golden thread.  Theon returned to the Great Keep through a covered stone walkway, the echoes of his footsteps mingling with the ceaseless rumble of the sea below. To get to the Sea Tower on its crooked pillar, he had to cross three further bridges, each narrower than the one before. The last was made of rope and wood, and the wet salt wind made it sway underfoot like a living thing. Theon’s heart was in his mouth by the time he was halfway across. A long way below, the waves threw up tall plumes of spray as they crashed against the rock. As a boy, he used to run across this bridge, even in the black of night. Boys believe nothing can hurt them, his doubt whispered. Grown men know better.  The door was grey wood studded with iron, and Theon found it barred from the inside. He hammered on it with a fist, and cursed when a splinter snagged the fabric of his glove. The wood was damp and moldy, the iron studs rusted.  After a moment the door was opened from within by a guard in a black iron breastplate and pothelm.  You are the son?    Out of my way, or you’ll learn who I am.  The man stood aside. Theon climbed the twisting steps to the solar. He found his father seated beside a brazier, beneath a robe of musty sealskins that covered him foot to chin. At the sound of boots on stone, the Lord of the Iron Islands lifted his eyes to behold his last living son. He was smaller than Theon remembered him. And so gaunt. Balon Greyjoy had always been thin, but now he looked as though the gods had put him in a cauldron and boiled every spare ounce of flesh from his bones, until nothing remained but hair and skin. Bone thin and bone hard he was, with a face that might have been chipped from flint. His eyes were flinty too, black and sharp, but the years and the salt winds had turned his hair the grey of a winter sea, flecked with whitecaps. Unbound, it hung past the small of the back.   Nine years, is it?  Lord Balon said at last.   Ten,  Theon answered, pulling off his torn gloves.   A boy they took,  his father said.  What are you now?    A man,  Theon answered.  Your blood and your heir.   Lord Balon grunted.  We shall see.    You shall,  Theon promised.   Ten years, you say. Stark had you as long as I. And now you come as his envoy.    Not his,  Theon said.  Lord Eddard is dead, beheaded by the Lannister queen.    They are both dead, Stark and that Robert who broke my walls with his stones. I vowed I’d live to see them both in their graves, and I have.  He grimaced.  Yet the cold and the damp still make my joints ache, as when they were alive. So what does it serve?    It serves.  Theon moved closer.  I bring a letter—    Did Ned Stark dress you like that?  his father interrupted, squinting up from beneath his robe.  Was it his pleasure to garb you in velvets and silks and make you his own sweet daughter?   Theon felt the blood rising to his face.  I am no man’s daughter. If you mislike my garb, I will change it.    You will.  Throwing off the furs, Lord Balon pushed himself to his feet. He was not so tall as Theon remembered.  That bauble around your neck—was it bought with gold or iron?   Theon touched the gold chain. He had forgotten. It has been so long… In the Old Way, women might decorate themselves with ornaments bought with coin, but a warrior wore only the jewelry he took off the corpses of enemies slain by his own hand. Paying the iron price, it was called.   You blush red as a maid, Theon. A question was asked. Is it the gold price you paid, or the iron?    The gold,  Theon admitted.  His father slid his fingers under the necklace and gave it a yank so hard it was like to take Theon’s head off, had the chain not snapped first.  My daughter has taken an axe for a lover,  Lord Balon said.  I will not have my son bedeck himself like a whore.  He dropped the broken chain onto the brazier, where it slid down among the coals.  It is as I feared. The green lands have made you soft, and the Starks have made you theirs.     You’re wrong. Ned Stark was my gaoler, but my blood is still salt and iron.   Lord Balon turned away to warm his bony hands over the brazier.  Yet the Stark pup sends you to me like a well-trained raven, clutching his little message.    There is nothing small about the letter I bear,  Theon said,  and the offer he makes is one I suggested to him.    This wolf king heeds your counsel, does he?  The notion seemed to amuse Lord Balon.   He heeds me, yes. I’ve hunted with him, trained with him, shared meat and mead with him, warred at his side. I have earned his trust. He looks on me as an older brother, he—    No.  His father jabbed a finger at his face.  Not here, not in Pyke, not in my hearing, you will not name him brother, this son of the man who put your true brothers to the sword."
}