{
  "id": "91c72cbf6f555e8693e11fefef5d73679803890c",
  "text": "   When Quaithe too was gone, Ser Jorah said,  She speaks truly, my queen… though I like her no more than the others.    I do not understand her.  Pyat and Xaro had showered Dany with promises from the moment they first glimpsed her dragons, declaring themselves her loyal servants in all things, but from Quaithe she had gotten only the rare cryptic word. And it disturbed her that she had never seen the woman’s face. Remember Mirri Maz Duur, she told herself. Remember treachery. She turned to her bloodriders.  We will keep our own watch so long as we are here. See that no one enters this wing of the palace without my leave, and take care that the dragons are always well guarded.    It shall be done, Khaleesi,  Aggo said.   We have seen only the parts of Qarth that Pyat Pree wished us to see,  she went on.  Rakharo, go forth and look on the rest, and tell me what you find. Take good men with you—and women, to go places where men are forbidden.    As you say, I do, blood of my blood,  said Rakharo.   Ser Jorah, find the docks and see what manner of ships lay at anchor. It has been half a year since I last heard tidings from the Seven Kingdoms. Perhaps the gods will have blown some good captain here from Westeros with a ship to carry us home.   The knight frowned.  That would be no kindness. The Usurper will kill you, sure as sunrise.  Mormont hooked his thumbs through his swordbelt.  My place is here at your side.    Jhogo can guard me as well. You have more languages than my bloodriders, and the Dothraki mistrust the sea and those who sail her. Only you can serve me in this. Go among the ships and speak to the crews, learn where they are from and where they are bound and what manner of men command them.   Reluctantly, the exile nodded.  As you say, my queen.   When all the men had gone, her handmaids stripped off the travel-stained silks she wore, and Dany padded out to where the marble pool sat in the shade of a portico. The water was deliciously cool, and the pool was stocked with tiny golden fish that nibbled curiously at her skin and made her giggle. It felt good to close her eyes and float, knowing she could rest as long as she liked. She wondered whether Aegon’s Red Keep had a pool like this, and fragrant gardens full of lavender and mint. It must, surely. Viserys always said the Seven Kingdoms were more beautiful than any other place in the world.  The thought of home disquieted her. If her sun-and-stars had lived, he would have led his khalasar across the poison water and swept away her enemies, but his strength had left the world. Her bloodriders remained, sworn to her for life and skilled in slaughter, but only in the ways of the horselords. The Dothraki sacked cities and plundered kingdoms, they did not rule them. Dany had no wish to reduce King’s Landing to a blackened ruin full of unquiet ghosts. She had supped enough on tears. I want to make my kingdom beautiful, to fill it with fat men and pretty maids and laughing children. I want my people to smile when they see me ride by, the way Viserys said they smiled for my father.  But before she could do that she must conquer.  The Usurper will kill you, sure as sunrise, Mormont had said. Robert had slain her gallant brother Rhaegar, and one of his creatures had crossed the Dothraki sea to poison her and her unborn son. They said Robert Baratheon was strong as a bull and fearless in battle, a man who loved nothing better than war. And with him stood the great lords her brother had named the Usurper’s dogs, cold-eyed Eddard Stark with his frozen heart, and the golden Lannisters, father and son, so rich, so powerful, so treacherous.  How could she hope to overthrow such men? When Khal Drogo had lived, men trembled and made him gifts to stay his wrath. If they did not, he took their cities, wealth and wives and all. But his khalasar had been vast, while hers was meager. Her people had followed her across the red waste as she chased her comet, and would follow her across the poison water too, but they would not be enough. Even her dragons might not be enough. Viserys had believed that the realm would rise for its rightful king… but Viserys had been a fool, and fools believe in foolish things.  Her doubts made her shiver. Suddenly the water felt cold to her, and the little fish prickling at her skin annoying. Dany stood and climbed from the pool.  Irri,  she called,  Jhiqui.   As the handmaids toweled her dry and wrapped her in a sandsilk robe, Dany’s thoughts went to the three who had sought her out in the City of Bones. The Bleeding Star led me to Qarth for a purpose. Here I will find what I need, if I have the strength to take what is offered, and the wisdom to avoid the traps and snares. If the gods mean for me to conquer, they will provide, they will send me a sign, and if not… if not…  It was near evenfall and Dany was feeding her dragons when Irri stepped through the silken curtains to tell her that Ser Jorah had returned from the docks… and not alone."
}