{
  "id": "9233076092354181031a62ca75800c827e39af19",
  "text": "  His soft hands washed each other in a gesture of helpless distress.   A child born of traitor’s seed will find that betrayal comes naturally to her,  said Grand Maester Pycelle.  She is a sweet thing now, but in ten years, who can say what treasons she may hatch?    No,  Sansa said, horrified.  I’m not, I’d never… I wouldn’t betray Joffrey, I love him, I swear it, I do.    Oh, so poignant,  said Varys.  And yet, it is truly said that blood runs truer than oaths.    She reminds me of the mother, not the father,  Lord Petyr Baelish said quietly.  Look at her. The hair, the eyes. She is the very image of Cat at the same age.   The queen looked at her, troubled, and yet Sansa could see kindness in her clear green eyes.  Child,  she said,  if I could truly believe that you were not like your father, why nothing should please me more than to see you wed to my Joffrey. I know he loves you with all his heart.  She sighed.  And yet, I fear that Lord Varys and the Grand Maester have the right of it. The blood will tell. I have only to remember how your sister set her wolf on my son.    I’m not like Arya,  Sansa blurted.  She has the traitor’s blood, not me. I’m good, ask Septa Mordane, she’ll tell you, I only want to be Joffrey’s loyal and loving wife.   She felt the weight of Cersei’s eyes as the queen studied her face.  I believe you mean it, child.  She turned to face the others.  My lords, it seems to me that if the rest of her kin were to remain loyal in this terrible time, that would go a long way toward laying our fears to rest.   Grand Maester Pycelle stroked his huge soft beard, his wide brow furrowed in thought.  Lord Eddard has three sons.    Mere boys,  Lord Petyr said with a shrug.  I should be more concerned with Lady Catelyn and the Tullys.   The queen took Sansa’s hand in both of hers.  Child, do you know your letters?   Sansa nodded nervously. She could read and write better than any of her brothers, although she was hopeless at sums.   I am pleased to hear that. Perhaps there is hope for you and Joffrey still…    What do you want me to do?    You must write your lady mother, and your brother, the eldest… what is his name?    Robb,  Sansa said.   The word of your lord father’s treason will no doubt reach them soon. Better that it should come from you. You must tell them how Lord Eddard betrayed his king.   Sansa wanted Joffrey desperately, but she did not think she had the courage to do as the queen was asking.  But he never… I don’t… Your Grace, I wouldn’t know what to say…   The queen patted her hand.  We will tell you what to write, child. The important thing is that you urge Lady Catelyn and your brother to keep the king’s peace.    It will go hard for them if they don’t,  said Grand Maester Pycelle.  By the love you bear them, you must urge them to walk the path of wisdom.    Your lady mother will no doubt fear for you dreadfully,  the queen said.  You must tell her that you are well and in our care, that we are treating you gently and seeing to your every want. Bid them to come to King’s Landing and pledge their fealty to Joffrey when he takes his throne. If they do that… why, then we shall know that there is no taint in your blood, and when you come into the flower of your womanhood, you shall wed the king in the Great Sept of Baelor, before the eyes of gods and men.   …wed the king… The words made her breath come faster, yet still Sansa hesitated.  Perhaps… if I might see my father, talk to him about…    Treason?  Lord Varys hinted.   You disappoint me, Sansa,  the queen said, with eyes gone hard as stones.  We’ve told you of your father’s crimes. If you are truly as loyal as you say, why should you want to see him?    I… I only meant…  Sansa felt her eyes grow wet.  He’s not… please, he hasn’t been… hurt, or… or…    Lord Eddard has not been harmed,  the queen said.   But… what’s to become of him?    That is a matter for the king to decide,  Grand Maester Pycelle announced ponderously.  The king! Sansa blinked back her tears. Joffrey was the king now, she thought. Her gallant prince would never hurt her father, no matter what he might have done. If she went to him and pleaded for mercy, she was certain he’d listen. He had to listen, he loved her, even the queen said so. Joff would need to punish Father, the lords would expect it, but perhaps he could send him back to Winterfell, or exile him to one of the Free Cities across the narrow sea. It would only have to be for a few years. By then she and Joffrey would be married. Once she was queen, she could persuade Joff to bring Father back and grant him a pardon.  Only… if Mother or Robb did anything treasonous, called the banners or refused to swear fealty or anything, it would all go wrong. Her Joffrey was good and kind, she knew it in her heart, but a king had to be stern with rebels. She had to make them understand, she had to!   I’ll… I’ll write the letters,  Sansa told them.  With a smile as warm as the sunrise, Cersei Lannister leaned close and kissed her gently on the cheek."
}