{
  "id": "92bdc7e9f39aa1507fcf2afbd1b38e710778e999",
  "text": "  The eighth Lady Frey stood beside Lord Walder’s high seat. At his feet sat a somewhat younger version of himself, a stooped thin man of fifty whose costly garb of blue wool and grey satin was strangely accented by a crown and collar ornamented with tiny brass bells. The likeness between him and his lord was striking, save for their eyes; Lord Frey’s small, dim, and suspicious, the other’s large, amiable, and vacant. Catelyn recalled that one of Lord Walder’s brood had fathered a halfwit long years ago. During past visits, the Lord of the Crossing had always taken care to hide this one away. Did he always wear a fool’s crown, or is that meant as mockery of Robb? It was a question she dare not ask.  Frey sons, daughters, children, grandchildren, husbands, wives, and servants crowded the rest of the hall. But it was the old man who spoke.  You will forgive me if I do not kneel, I know. My legs no longer work as they did, though that which hangs between ’em serves well enough, heh.  His mouth split in a toothless smile as he eyed Robb’s crown.  Some would say it’s a poor king who crowns himself with bronze, Your Grace.    Bronze and iron are stronger than gold and silver,  Robb answered.  The old Kings of Winter wore such a sword-crown.    Small good it did them when the dragons came. Heh.  That heh seemed to please the lackwit, who bobbed his head from side to side, jingling crown and collar.  Sire,  Lord Walder said,  forgive my Aegon the noise. He has less wits than a crannogman, and he’s never met a king before. One of Stevron’s boys. We call him Jinglebell.    Ser Stevron mentioned him, my lord.  Robb smiled at the lackwit.  Well met, Aegon. Your father was a brave man.   Jinglebell jingled his bells. A thin line of spit ran from one corner of his mouth when he smiled.   Save your royal breath. You’d do as well talking to a chamberpot.  Lord Walder shifted his gaze to the others.  Well, Lady Catelyn, I see you have returned to us. And young Ser Edmure, the victor of the Stone Mill. Lord Tully now, I’ll need to remember that. You’re the fifth Lord Tully I’ve known. I outlived the other four, heh. Your bride’s about here somewhere. I suppose you want a look at her.    I would, my lord.    Then you’ll have it. But clothed. She’s a modest girl, and a maid. You won’t see her naked till the bedding.  Lord Walder cackled.  Heh. Soon enough, soon enough.  He craned his head about.  Benfrey, go fetch your sister. Be quick about it, Lord Tully’s come all the way from Riverrun.  A young knight in a quartered surcoat bowed and took his leave, and the old man turned back to Robb.  And where’s your bride, Your Grace? The fair Queen Jeyne. A Westerling of the Crag, I’m told, heh.    I left her at Riverrun, my lord. She was too weary for more travel, as we told Ser Ryman.    That makes me grievous sad. I wanted to behold her with mine own weak eyes. We all did, heh. Isn’t that so, my lady?   Pale wispy Lady Frey seemed startled that she would be called upon to speak.  Y-yes, my lord. We all so wanted to pay homage to Queen Jeyne. She must be fair to look on.    She is most fair, my lady.  There was an icy stillness in Robb’s voice that reminded Catelyn of his father.  The old man either did not hear it or refused to pay it any heed.  Fairer than my own get, heh? Elsewise how could her face and form have made the King’s Grace forget his solemn promise.   Robb suffered the rebuke with dignity.  No words can set that right, I know, but I have come to make my apologies for the wrong I did your House, and to beg for your forgiveness, my lord.    Apologies, heh. Yes, you vowed to make one, I recall. I’m old, but I don’t forget such things. Not like some kings, it seems. The young remember nothing when they see a pretty face and a nice firm pair of teats, isn’t that so? I was the same. Some might say I still am, heh heh. They’d be wrong, though, wrong as you were. But now you’re here to make amends. It was my girls you spurned, though. Mayhaps it’s them should hear you beg for pardon, Your Grace. My maiden girls. Here, have a look at them.  When he waggled his fingers, a flurry of femininity left their places by the walls to line up beneath the dais. Jinglebell started to rise as well, his bells ringing merrily, but Lady Frey grabbed the lackwit’s sleeve and tugged him back down.  Lord Walder named the names.  My daughter Arwyn,  he said of a girl of fourteen.  Shirei, my youngest trueborn daughter. Ami and Marianne are granddaughters. I married Ami to Ser Pate of Sevenstreams, but the Mountain killed the oaf so I got her back. That’s a Cersei, but we call her Little Bee, her mother’s a Beesbury. More granddaughters. One’s a Walda, and the others… well, they have names, whatever they are…    I’m Merry, Lord Grandfather,  one girl said.   You’re noisy, that’s for certain. Next to Noisy is my daughter Tyta. Then another Walda. Alyx, Marissa… are you Marissa? I thought you were. She’s not always bald. The maester shaved her hair off, but he swears it will soon grow back."
}