{
  "id": "92c88b5220a1629e3764ce83a1b8907897fa7db3",
  "text": " Perhaps his gout is better.  So why did he have such a bad feeling about this?  This waiting was intolerable.  Banners forward,  he snapped.  We’ll meet them.  He kicked his horse. Bronn and Pod followed, one to either side. When the Dornishmen saw them coming, they spurred their own mounts, banners rippling as they rode. From their ornate saddles were slung the round metal shields they favored, and many carried bundles of short throwing spears, or the double-curved Dornish bows they used so well from horseback.  There were three sorts of Dornishmen, the first King Daeron had observed. There were the salty Dornishmen who lived along the coasts, the sandy Dornishmen of the deserts and long river valleys, and the stony Dornishmen who made their fastnesses in the passes and heights of the Red Mountains. The salty Dornishmen had the most Rhoynish blood, the stony Dornishmen the least.  All three sorts seemed well represented in Doran’s retinue. The salty Dornishmen were lithe and dark, with smooth olive skin and long black hair streaming in the wind. The sandy Dornishmen were even darker, their faces burned brown by the hot Dornish sun. They wound long bright scarfs around their helms to ward off sunstroke. The stony Dornishmen were biggest and fairest, sons of the Andals and the First Men, brown-haired or blond, with faces that freckled or burned in the sun instead of browning.  The lords wore silk and satin robes with jeweled belts and flowing sleeves. Their armor was heavily enameled and inlaid with burnished copper, shining silver, and soft red gold. They came astride red horses and golden ones and a few as pale as snow, all slim and swift, with long necks and narrow beautiful heads. The fabled sand steeds of Dorne were smaller than proper warhorses and could not bear such weight of armor, but it was said that they could run for a day and night and another day, and never tire.  The Dornish leader forked a stallion black as sin with a mane and tail the color of fire. He sat his saddle as if he’d been born there, tall, slim, graceful. A cloak of pale red silk fluttered from his shoulders, and his shirt was armored with overlapping rows of copper disks that glittered like a thousand bright new pennies as he rode. His high gilded helm displayed a copper sun on its brow, and the round shield slung behind him bore the sun-and-spear of House Martell on its polished metal surface.  A Martell sun, but ten years too young, Tyrion thought as he reined up, too fit as well, and far too fierce. He knew what he must deal with by then. How many Dornishmen does it take to start a war? he asked himself. Only one. Yet he had no choice but to smile.  Well met, my lords. We had word of your approach, and His Grace King Joffrey bid me ride out to welcome you in his name. My lord father the King’s Hand sends his greetings as well.  He feigned an amiable confusion.  Which of you is Prince Doran?    My brother’s health requires he remain at Sunspear.  The princeling removed his helm. Beneath, his face was lined and saturnine, with thin arched brows above large eyes as black and shiny as pools of coal oil. Only a few streaks of silver marred the lustrous black hair that receded from his brow in a widow’s peak as sharply pointed as his nose. A salty Dornishman for certain.  Prince Doran has sent me to join King Joffrey’s council in his stead, as it please His Grace.    His Grace will be most honored to have the counsel of a warrior as renowned as Prince Oberyn of Dorne,  said Tyrion, thinking, This will mean blood in the gutters.  And your noble companions are most welcome as well.    Permit me to acquaint you with them, my lord of Lannister. Ser Deziel Dalt, of Lemonwood. Lord Tremond Gargalen. Lord Harmen Uller and his brother Ser Ulwyck. Ser Ryon Allyrion and his natural son Ser Daemon Sand, the Bastard of Godsgrace. Lord Dagos Manwoody, his brother Ser Myles, his sons Mors and Dickon. Ser Arron Qorgyle. And never let it be thought that I would neglect the ladies. Myria Jordayne, heir to the Tor. Lady Larra Blackmont, her daughter Jynessa, her son Perros.  He raised a slender hand toward a black-haired woman to the rear, beckoning her forward.  And this is Ellaria Sand, mine own paramour.   Tyrion swallowed a groan. His paramour, and bastard-born, Cersei will pitch a holy fit if he wants her at the wedding. If she consigned the woman to some dark corner below the salt, his sister would risk the Red Viper’s wrath. Seat her beside him at the high table, and every other lady on the dais was like to take offense. Did Prince Doran mean to provoke a quarrel?  Prince Oberyn wheeled his horse about to face his fellow Dornishmen.  Ellaria, lords and ladies, sers, see how well King Joffrey loves us. His Grace has been so kind as to send his own Uncle Imp to bring us to his court.    Bronn snorted back laughter, and Tyrion perforce must feign amusement as well.  Not alone, my lords. That would be too enormous a task for a little man like me."
}