{
  "id": "933524be3ea414aac2bf4e903b2666e5ae21db50",
  "text": "  \"We've never been allowed in,\" said Ron enviously.  *55*  \"I should ruddy well think not,\" growled Hagrid. Mrs. Weasley now came galloping into view, her handbag swing ing wildly in one hand, Ginny just clinging onto the other. \"Oh, Harry - oh, my dear - you could have been any where -\" Gasping for breath she pulled a large clothes brush out of her bag and began sweeping off the soot Hagrid hadn't managed to beat away. Mr. Weasley took Harry's glasses, gave them a tap of his wand, and returned them, good as new. \"Well, gotta be off,\" said Hagrid, who was having his hand wrung by Mrs. Weasley (\"Knockturn Alley! If you hadn't found him, Hagrid!\"). \"See yer at Hogwarts!\" And he strode away, head and shoulders taller than anyone else in the packed street. \"Guess who I saw in Borgin and Burkes?\" Harry asked Ron and Hermione as they climbed the Gringotts steps. \"Malfoy and his fa ther.\" \"Did Lucius Malfoy buy anything?\" said Mr. Weasley sharply behind them. \"No, he was selling =' \"So he's worried,\" said Mr. Weasley with grim satisfaction. \"Oh, I'd love to get Lucius Malfoy for something ...... \"You be careful, Arthur,\" said Mrs. Weasley sharply as they were bowed into the bank by a goblin at the door. \"That family's trou ble. Don't go biting off more than you can chew -\" \"So you don't think I'm a match for Lucius Malfoy?\" said Mr. Weasley indignantly, but he was distracted almost at once by the sight of Hermione's parents, who were standing nervously at the counter that ran all along the great marble hall, waiting for Hermione to introduce them.  ,5 s  \"But you're Muggles!\" said Mr. Weasley delightedly. \"We must have a drink! What's that you've got there? Oh, you're changing Muggle money. Molly, look!\" He pointed excitedly at the tenpound notes in Mr. Granger's hand.  \"Meet you back here,\" Ron said to Hermione as the Weasleys and Harry were led off to their underground vaults by another Gringotts goblin.  The vaults were reached by means of small, goblin-driven carts that sped along miniature train tracks through the bank's underground tunnels. Harry enjoyed the breakneck journey down to the Weasleys' vault, but felt dreadful, far worse than he had in Knockturn Alley, when it was opened. There was a very small pile of silver Sickles inside, and just one gold Galleon. Mrs. Weasley felt right into the corners before sweeping the whole lot into her bag. Harry felt even worse when they reached his vault. He tried to block the contents from view as he hastily shoved handfuls of coins into a leather bag.  Back outside on the marble steps, they all separated. Percy muttered vaguely about needing a new quill. Fred and George had spotted their friend from Hogwarts, Lee Jordan. Mrs. Weasley and Ginny were going to a secondhand robe shop. Mr. Weasley was insisting on taking the Grangers off to the Leaky Cauldron for a drink.  \"We'll all meet at Flourish and Blotts in an hour to buy your schoolbooks,\" said Mrs. Weasley, setting off with Ginny. \"And not one step down Knockturn Alley!\" she shouted at the twins' retreating backs.  Harry, Ron, and Hermione strolled off along the winding, cobbled street. The bag of gold, silver, and bronze jangling cheerfully  *57*  in Harry's pocket was clamoring to be spent, so he bought three large strawberry-and-peanut-butter ice creams, which they slurped happily as they wandered up the alley, examining the fascinating shop windows. Ron gazed longingly at a full set of Chudley Can non robes in the windows of Quality Quidditch Supplies until Hermione dragged them off to buy ink and parchment next door. In Gambol and Japes Wizarding Joke Shop, they met Fred, George, and Lee Jordan, who were stocking up on Dr. Filibuster's Fabulous Wet-Start, No-Heat Fireworks, and in a tiny junk shop full of bro ken wands, lopsided brass scales, and old cloaks covered in potion stains they found Percy, deeply immersed in a small and deeply boring book called Prefects Who Gained Power. `A study of Hogwarts prefects and their later careers, \" Ron read aloud off the back cover. \"That sounds fascinating . . . .\"  \"Go away,\" Percy snapped. \"'Course, he's very ambitious, Percy, he's got it all planned out .... He wants to be Minister of Magic. . . \" Ron told Harry and Hermione in an undertone as they left Percy to it. An hour later, they headed for Flourish and Blotts. They were by no means the only ones making their way to the bookshop. As they approached it, they saw to their surprise a large crowd jostling out side the doors, trying to get in. The reason for this was proclaimed  by a large banner stretched across the upper windows:  GILDEROY LOCKHART will be signing copies of his autobiography MAGICAL ME today 12:30 P.m. to 4:30 P.m.  \"We can actually meet him!\" Hermione squealed. \"I mean, he's written almost the whole booklist!\"  The crowd seemed to be made up mostly of witches around Mrs. Weasley's age. A harrassed-looking wizard stood at the door, saying, \"Calmly, please, ladies .... Don't push, there ... mind the books, now ."
}