{
  "id": "93d97cf90474620845996b2b87103e41bfa697aa",
  "text": " `It's as orc-like a place as  ever there could be! '       After that, first he on  the right, and  then Frodo on the left, passed  three or four such openings, some wider, some smaller; but  there was as yet  no doubt of  the main way,  for it was straight, and did not turn, and still  went steadily up. But how long was it, how much more of this would they have  to  endure, or could they  endure? The breathlessness of the air was growing  as they climbed; and now they seemed often  in the  blind dark to sense some  resistance  thicker  than  the  foul air. As they  thrust forward they  felt  things brush against their heads, or against their hands, long tentacles, or    ####-hanging growths perhaps:  they could not tell what  they were. And still the  stench grew. It grew, until almost it seemed to them that smell was the only  clear sense left t¢  them. and  that was for their torment.  One  hour,  two  hours,  three  hours: how many  had  they  passed  in  this  lightless  hole?   Hours-days, weeks rather. Sam left the tunnel -side and shrank towards Frodo,  and their hands met and clasped. and so together they still went on.       At length Frodo, groping along the  left-hand  wall, came suddenly to a   void. Almost he fell sideways  into the emptiness. Here was some  opening in  the rock far  wider than any  they had yet passed; and out of it came a reek   so foul, and a sense of lurking malice so intense, that Frodo reeled. And at  that moment Sam too lurched and fell forwards.        Fighting off both the sickness and  the fear, Frodo gripped Sam's hand.  `Up!  ' he said in  a hoarse breath without  voice. 'It all comes from here,  the stench and the peril. Now for it! Quick! '       Calling up his remaining strength and resolution, he dragged Sam to his  feet, and  forced his own limbs to move. Sam  stumbled beside him. One step,  two steps, three steps-at last six steps. Maybe they had passed the dreadful  unseen opening, but  whether  that was so  or not, suddenly it was easier to  move,  as if  some  hostile will  for the moment  had  released  them.  They  struggled on, still hand in hand.       But almost at once they came to a new difficulty. The tunnel forked, or   so it  seemed, and in the dark they could  not tell wh ich was the wider way,  or  which kept nearer to the straight. Which should they take, the  left, or   the  right? They knew of  nothing  to guide  them, yet a false choice  would  almost certainly be fatal.       `Which way has Gollum gone? ' panted Sam. 'And why didn't he wait? '       `Smjagol!  ' said  Frodo,  trying  to  call. 'Smjagol! '  But his voice  croaked, and the  name fell dead almost as  it left his lips.  There  was no  answer, not an echo, not even a tremor of the air.       `He's really gone this time, I  fancy,'  muttered Sam. `I guess this is  just exactly where  he meant to bring us. Gollum! If ever I lay hands on you   again, you'll be sorry for it.'       Presently,  groping  and fumbling  in  the  dark, they  found  that the  opening on the left wa s blocked: either it was  a blind, or else  some great  stone had fallen in  the passage. 'This can't be the way,'  Frodo whispered.  'Right or wrong, we must take the other.'       'And quick! ' Sam panted. 'There's something worse than Gollum about. I    ####-can feel something looking at us.'       They had not gone  more than a  few yards  when from behind them came a   sound,  startling and horrible in  the  heavy  padded  silence: a  gurgling,  bubbling noise, and  a  long  venomous hiss. They wheeled round, but nothing  could be seen. Still as stones they stood, staring, waiting for they did not  know what.       `It's  a trap!' said Sam, and he  laid his hand upon  the  hilt  of his  sword; and  as he did so, he thought of the darkness of the barrow whence it   came. 'I   wish  old  Tom was near us  now!' he  thought.  Then  as he stood,  darkness  about him and a  blackness of  despair and  anger in his heart. it  seemed  to him that he saw a  light:  a light in his mind, almost unbearably  bright at first, as a sun-ray to the eyes of one long hidden in a windowless   pit. Then  the light became colour: green,  gold, silver, white. Far off, as  in  a  little  picture drawn  by  elven-fingers  he  saw  the Lady Galadriel  standing on the  grass  in  Lurien,  and gifts  were  in her hands. And you,  Ring-bearer, he  heard her say,  remote  but clear, for you  I have prepared   this.       The bubbling hiss  drew nearer,  and there  was a  creaking as  of some  great jointed thing that moved with slow purpose in the dark. A reek came on  before it. 'Master, master!' cried Sam, and the  life and  urgency came back   into his voice. 'The Lady's  gift! The star-glass! A light  to you  in  dark  places, she said it was to be. The star-glass!  '       `The star-glass?' muttered Frodo, as one answering out of sleep, hardly  comprehending.  `Why  yes! Why had  I forgotten it? A  light when all  other  lights go out! And now indeed light alone can help us."
}