{
  "id": "95353c8e82dde4f7bfe34855c8c4289c5b4d9ee3",
  "text": " Out  from the beleaguered  hills   knights  of   Gondor,  Riders  of  Rohan,  D®nedain  of  the  North,  close-serried  companies, drove against  their wavering  foes, piercing  the  press with the thrust of bitter spears. But  Gandalf lifted up his arms  and  called once more in a clear voice:       'Stand, Men of the West! Stand and wait! This is the hour of doom.'       And even  as he spoke  the earth rocked beneath their feet. Then rising  swiftly  up,  far  above the  Towers  of  the  Black  Gate, high  above  the  mountains,  a vast soaring  darkness  sprang into the sky,  flickering  with  fire. The  earth  groaned  and quaked.  The  Towers  of  the  Teeth  swayed,  tottered, and fell down; the mighty rampart  crumbled;  the Black  Gate  was  hurled in ruin; and from far away, now dim, now growing, now mounting to  the  clouds, there came a drumming rumble, a roar, a long echoing roll of ruinous  noise.       'The  realm of  Sauron is ended!'  said  Gandalf.  'The Ring-bearer has  fulfilled his Quest.' And as the Captains gazed south to the Land of Mordor,  it seemed to them that, black  against  the pall of cloud, there rose a huge  shape of shadow,  impenetrable,  lightning-crowned,  filling  all  the  sky.  Enormous it reared above the world,  and stretched  out towards  them a vast   threatening hand, terrible but  impotent: for even as it leaned over them, a   great wind took it, and  it was  all blown away, and passed; and then a hush  fell.       The Captains  bowed their heads; and when they looked up again, behold!  their enemies were flying and  the power of Mordor was scattering  like dust   in the wind. As when death  smites the swollen brooding thing  that inhabits  their crawling hill and holds them all in sway, ants will wander witless and  purposeless and then feebly die, so the creatures of Sauron, orc or troll or   beast  spell-enslaved,  ran  hither  and  thither  mindless;  and  some slew  themselves, or  cast themselves  in pits,  or  fled wailing  back to hide in  holes and dark lightless  places far  from hope. But the Men of  Rhyn and of  Harad, Easterling and  Southron, saw  the ruin of their war  and  the  great  majesty and glory  of the Captains of the West. And those  that were deepest   and longest in evil servitude,  hating the West, and yet were men  proud and  bold,  in their turn now gathered  themselves for a  last stand of desperate  battle. But the most part fled eastward  as  they could; and some cast their    ####-weapons down and sued for mercy.       Then Gandalf, leaving all such matters of battle and command to Aragorn  and the  other  lords, stood  upon the hill-top  and called; and down to him  came the great eagle, Gwaihir  the Windlord, and stood before him.       'Twice you have  borne me,  Gwaihir my friend,'  said  Gandalf. 'Thrice  shall pay for all, if you  are willing. You will  not find  me a burden much  greater than when  you bore me from  Zirak-zigil, where  my  old life burned  away.'       'I would  bear you,' answered Gwaihir, 'whither you will, even were you   made of stone.'       'Then  come, and let your  brother go with us,  and some other of  your  folk who is most  swift! For we have need of  speed greater than  any  wind,   outmatching the wings of the Nazgyl.'       'The North  Wind blows, but we  shall outfly it,' said Gwaihir. And  he  lifted up Gandalf and  sped away south, and  with  him  went Landroval,  and  Meneldor young and swift. And they passed over  Udyn and  Gorgoroth  and  saw  all  the land in  ruin and tumult  beneath them, and before them Mount  Doom  blazing, pouring out its fire.       'I am glad that you are here with me,' said Frodo. 'Here at the end  of  all things, Sam.'       'Yes, I  am with  you, Master,' said Sam, laying  Frodo's  wounded hand  gently to his breast. 'And you're with me.  And  the journey's finished. But  after  coming all that way I don't  want to give  up  yet. It's not like me,  somehow, if you understand.'       'Maybe not, Sam,' said Frodo; 'but  it's like things  are in the world.  Hopes fail. An end comes.  We have only  a little  time to wait  now. We are  lost in ruin and downfall, and there is no escape.'       'Well,  Master, we could at  least go further from this dangerous place  here, from this Crack of Doom,  if  that's its name. Now couldn't  we? Come,  Mr. Frodo, let's go down the path at any rate!'       'Very  well,  Sam. If you wish to go, I'll come,' said  Frodo; and they  rose and went slowly down the  winding road; and even as they passed towards  the  Mountain's  quaking  feet, a  great smoke and steam  belched  from  the  Sammath Naur, and the side  of  the cone was riven open,  and  a  huge fiery  vomit rolled in slow thunderous cascade down the eastern mountain-side.       Frodo and Sam could go no further. Their last strength of mind and body   ####-was  swiftly  ebbing.  They  had  reached  a low ashen  hill  piled  at  the  Mountain's foot; but from it there was no more escape."
}