{
  "id": "9556a0a3adae5279ff8eb00867f31f34eb97fa6f",
  "text": "  Viserys of the House Targaryen, the Third of his Name,  he called in a high, sweet voice,  King of the Andals and the Rhoynar and the First Men, Lord of the Seven Kingdoms and Protector of the Realm. His sister, Daenerys Stormborn, Princess of Dragonstone. His honorable host, Illyrio Mopatis, Magister of the Free City of Pentos.   They stepped past the eunuch into a pillared courtyard overgrown in pale ivy. Moonlight painted the leaves in shades of bone and silver as the guests drifted among them. Many were Dothraki horselords, big men with red-brown skin, their drooping mustachios bound in metal rings, their black hair oiled and braided and hung with bells. Yet among them moved bravos and sellswords from Pentos and Myr and Tyrosh, a red priest even fatter than Illyrio, hairy men from the Port of Ibben, and lords from the Summer Isles with skin as black as ebony. Daenerys looked at them all in wonder… and realized, with a sudden start of fear, that she was the only woman there.  Illyrio whispered to them.  Those three are Drogo’s bloodriders, there,  he said.  By the pillar is Khal Moro, with his son Rhogoro. The man with the green beard is brother to the Archon of Tyrosh, and the man behind him is Ser Jorah Mormont.   The last name caught Daenerys.  A knight?    No less.  Illyrio smiled through his beard.  Anointed with the seven oils by the High Septon himself.    What is he doing here?  she blurted.   The Usurper wanted his head,  Illyrio told them.  Some trifling affront. He sold some poachers to a Tyroshi slaver instead of giving them to the Night’s Watch. Absurd law. A man should be able to do as he likes with his own chattel.    I shall wish to speak with Ser Jorah before the night is done,  her brother said. Dany found herself looking at the knight curiously. He was an older man, past forty and balding, but still strong and fit. Instead of silks and cottons, he wore wool and leather. His tunic was a dark green, embroidered with the likeness of a black bear standing on two legs.  She was still looking at this strange man from the homeland she had never known when Magister Illyrio placed a moist hand on her bare shoulder.  Over there, sweet princess,  he whispered,  there is the khal himself.   Dany wanted to run and hide, but her brother was looking at her, and if she displeased him she knew she would wake the dragon. Anxiously, she turned and looked at the man Viserys hoped would ask to wed her before the night was done.  The slave girl had not been far wrong, she thought. Khal Drogo was a head taller than the tallest man in the room, yet somehow light on his feet, as graceful as the panther in Illyrio’s menagerie. He was younger than she’d thought, no more than thirty. His skin was the color of polished copper, his thick mustachios bound with gold and bronze rings.   I must go and make my submissions,  Magister Illyrio said.  Wait here. I shall bring him to you.   Her brother took her by the arm as Illyrio waddled over to the khal, his fingers squeezing so hard that they hurt.  Do you see his braid, sweet sister?   Drogo’s braid was black as midnight and heavy with scented oil, hung with tiny bells that rang softly as he moved. It swung well past his belt, below even his buttocks, the end of it brushing against the back of his thighs.   You see how long it is?  Viserys said.  When Dothraki are defeated in combat, they cut off their braids in disgrace, so the world will know their shame. Khal Drogo has never lost a fight. He is Aegon the Dragonlord come again, and you will be his queen.   Dany looked at Khal Drogo. His face was hard and cruel, his eyes as cold and dark as onyx. Her brother hurt her sometimes, when she woke the dragon, but he did not frighten her the way this man frightened her.  I don’t want to be his queen,  she heard herself say in a small, thin voice.  Please, please, Viserys, I don’t want to, I want to go home.    Home?  He kept his voice low, but she could hear the fury in his tone.  How are we to go home, sweet sister? They took our home from us!  He drew her into the shadows, out of sight, his fingers digging into her skin.  How are we to go home?  he repeated, meaning King’s Landing, and Dragonstone, and all the realm they had lost.  Dany had only meant their rooms in Illyrio’s estate, no true home surely, though all they had, but her brother did not want to hear that. There was no home there for him. Even the big house with the red door had not been home for him. His fingers dug hard into her arm, demanding an answer.  I don’t know… she said at last, her voice breaking. Tears welled in her eyes.   I do,  he said sharply.  We go home with an army, sweet sister. With Khal Drogo’s army, that is how we go home. And if you must wed him and bed him for that, you will.  He smiled at her.  I’d let his whole khalasar fuck you if need be, sweet sister, all forty thousand men, and their horses too if that was what it took to get my army. Be grateful it is only Drogo. In time you may even learn to like him."
}