{
  "id": "95ebde74bc5be717ca803f06e163fdc91d86087f",
  "text": " The horse reared and almost threw him.  The Knight of Flowers saluted the king, rode to the far end of the list, and couched his lance, ready. Ser Gregor brought his animal to the line, fighting with the reins. And suddenly it began. The Mountain’s stallion broke in a hard gallop, plunging forward wildly, while the mare charged as smooth as a flow of silk. Ser Gregor wrenched his shield into position, juggled with his lance, and all the while fought to hold his unruly mount on a straight line, and suddenly Loras Tyrell was on him, placing the point of his lance just there, and in an eye blink the Mountain was failing. He was so huge that he took his horse down with him in a tangle of steel and flesh.  Ned heard applause, cheers, whistles, shocked gasps, excited muttering, and over it all the rasping, raucous laughter of the Hound. The Knight of Flowers reined up at the end of the lists. His lance was not even broken. His sapphires winked in the sun as he raised his visor, smiling. The commons went mad for him.  In the middle of the field, Ser Gregor Clegane disentangled himself and came boiling to his feet. He wrenched off his helm and slammed it down onto the ground. His face was dark with fury and his hair fell down into his eyes.  My sword,  he shouted to his squire, and the boy ran it out to him. By then his stallion was back on its feet as well.  Gregor Clegane killed the horse with a single blow of such ferocity that it half severed the animal’s neck. Cheers turned to shrieks in a heartbeat. The stallion went to its knees, screaming as it died. By then Gregor was striding down the lists toward Ser Loras Tyrell, his bloody sword clutched in his fist.  Stop him!  Ned shouted, but his words were lost in the roar. Everyone else was yelling as well, and Sansa was crying.  It all happened so fast. The Knight of Flowers was shouting for his own sword as Ser Gregor knocked his squire aside and made a grab for the reins of his horse. The mare scented blood and reared. Loras Tyrell kept his seat, but barely. Ser Gregor swung his sword, a savage two-handed blow that took the boy in the chest and knocked him from the saddle. The courser dashed away in panic as Ser Loras lay stunned in the dirt. But as Gregor lifted his sword for the killing blow, a rasping voice warned,  Leave him be,  and a steel-clad hand wrenched him away from the boy.  The Mountain pivoted in wordless fury, swinging his longsword in a killing arc with all his massive strength behind it, but the Hound caught the blow and turned it, and for what seemed an eternity the two brothers stood hammering at each other as a dazed Loras Tyrell was helped to safety. Thrice Ned saw Ser Gregor aim savage blows at the hound’s-head helmet, yet not once did Sandor send a cut at his brother’s unprotected face.  It was the king’s voice that put an end to it… the king’s voice and twenty swords. Jon Arryn had told them that a commander needs a good battlefield voice, and Robert had proved the truth of that on the Trident. He used that voice now.  STOP THIS MADNESS,  he boomed,  IN THE NAME OF YOUR KING!   The Hound went to one knee. Ser Gregor’s blow cut air, and at last he came to his senses. He dropped his sword and glared at Robert, surrounded by his Kingsguard and a dozen other knights and guardsmen. Wordlessly, he turned and strode off, shoving past Barristan Selmy.  Let him go,  Robert said, and as quickly as that, it was over.   Is the Hound the champion now?  Sansa asked Ned.   No,  he told her.  There will be one final joust, between the Hound and the Knight of Flowers.   But Sansa had the right of it after all. A few moments later Ser Loras Tyrell walked back onto the field in a simple linen doublet and said to Sandor Clegane,  I owe you my life. The day is yours, ser.    I am no ser,  the Hound replied, but he took the victory, and the champion’s purse, and, for perhaps the first time in his life, the love of the commons. They cheered him as he left the lists to return to his pavilion.  As Ned walked with Sansa to the archery field, Littlefinger and Lord Renly and some of the others fell in with them.  Tyrell had to know the mare was in heat,  Littlefinger was saying.  I swear the boy planned the whole thing. Gregor has always favored huge, ill-tempered stallions with more spirit than sense.  The notion seemed to amuse him.  It did not amuse Ser Barristan Selmy.  There is small honor in tricks,  the old man said stiffly.   Small honor and twenty thousand golds.  Lord Renly smiled.  That afternoon a boy named Anguy, an unheralded commoner from the Dornish Marches, won the archery competition, outshooting Ser Balon Swann and Jalabhar Xho at a hundred paces after all the other bowmen had been eliminated at the shorter distances. Ned sent Alyn to seek him out and offer him a position with the Hand’s guard, but the boy was flush with wine and victory and riches undreamed of, and he refused.  The melee went on for three hours. Near forty men took part, freeriders and hedge knights and new-made squires in search of a reputation."
}