{
  "id": "979146501d56bc6622a9316e46f32a6c4b3cbcb1",
  "text": "  Now  they sat  side by side again  in the embrasure  looking eastward, where  they had eaten and talked the day before.       It was the sunset-hour, but  the great pall had  now stretched far into  the  West, and  only  as it sank at last into the Sea did the Sun escape  to  send  out a brief farewell  gleam before  the night, even as Frodo saw it a t  the Cross-roads touching the head of the fallen king. But  to  the fields of  the Pelennor, under the shadow of Mindolluin, there came no gleam: they were  brown and drear.       Already it  seemed years to  Pippin  since he had sat  there before, in  some half-forgotten time when he had still  been a hobbit,  a  light-hearted  wanderer touched little by the perils he had passed through. Now  he was one  small soldier in a city preparing for a great assault, clad in the proud but  sombre manner of the Tower of Guard.       In some  other time and place Pippin  might have been pleased with  his  new array,  but he knew  now  that he was taking part in no  play; he was in  deadly  earnest the servant of  a grim  master  in the  greatest  peril. The  hauberk was burdensome, and the helm weighed upon his head. His cloak he  had  cast aside  upon the seat. He turned his tired  gaze away from  the darkling  fields below and yawned, and then he sighed.       'You are weary of this day?' said Beregond.       'Yes,'  said Pippin,  'very: tired out with idleness and waiting. I have  kicked my  heels  at the door of my master's  chamber  for many  slow hours,  while  he  has  debated with Gandalf and the Prince and other great persons.   And I'm not  used,  Master Beregond, to waiting hungry on others while  they  eat. It is a sore trial for a hobbit, that. No doubt you will think I should  feel the honour more  deeply. But  what is the good  of such honour?  Indeed  what is the  good even of  food  and  drink under this creeping shadow? What  does it  mean?  The very air seems thick and brown! Do  you often  have such  glooms when the wind is in the East?'   ####-     'Nay,'  said  Beregond, 'this is no weather of the world. This  is some  device  of his  malice; some broil of fume from the Mountain of Fire that he  sends  to darken hearts and counsel. And so it doth indeed. I wish the  Lord  Faramir would  return. He  would not be dismayed. But now,  who  knows if he  will ever come back across the River out of the Darkness?'       'Yes,' said Pippin, 'Gandalf, too, is anxious.  He was disappointed.  I  think, not  to  find Faramir here. And where has he  got to himself? He left  the  Lord's council before the noon -meal,  and  in  no good  mood either,  I  thought. Perhaps he has some foreboding of bad news.'       Suddenly as they talked  they were  stricken dumb, frozen as it were to  listening  stones. Pippin cowered down  with his hands pressed to his  ears;   but Beregond, who  had been  looking out from the battlement  as he spoke of  Faramir, remained  there, stiffened, staring  out with starting eyes. Pippin  knew the shuddering cry that he had heard: it was the same that he had heard  long  ago  in  the Marish  of the Shire, but now it was grown  in  power and  hatred, piercing the heart with a poisonous despair .       At last Beregond spoke with an effort. 'They have come!' he said. 'Take  courage and look! There are fell things below.'       Reluctantly Pippin climbed on to the seat and looked out over the wall.  The Pelennor lay dim  beneath him, fading away to the scarce guessed line of  the  Great  River. But  now  wheeling  swiftly across  it,  like  shadows of  untimely  night, he  saw in  the middle airs  below him five birdlike forms,  horrible as carrion-fowl  yet greater than  eagles, cruel as death. Now they  swooped near, venturing almost within bowshot of the walls, now they circled  away.       'Black Riders!'  muttered Pippin.  'Black  Riders  of the air! But see,  Beregond!' he cried. 'They are  looking for something, surely? See  how they  wheel and swoop,  always down to that  point over  there!  And  can  you see  something moving on the ground? Dark little things. Yes, men on horses: four  or five. Ah! I cannot stand it! Gandalf! Gandalf save us!'       Another  long screech rose and fell,  and  he threw  himself back again  from the  wall, panting like  a  hunted  animal.  Faint and seemingly remote  through that shuddering cry he  heard  winding  up from below the sound of a  trumpet ending on a long high note.       'Faramir!  The  Lord Faramir! It is  his call!' cried  Beregond. 'Brave  heart! But how can he win to the  Gate, if these  foul hell-hawks have other   weapons than fear? But look! They hold on. They will make the Gate.  No! the   ####-horses are running mad. Look! the men are thrown; they are running  on foot.  No,  one is  still  up, but he  rides  back to the others. That will be  the  Captain: he can master both beasts and men. Ah! there one of the foul things  is stooping on him. Help! help! Will no one go out to him? Faramir!'       With  that Beregond sprang  away  and ran off into the gloom."
}