{
  "id": "9863023851a3ff1a6993920f62f0458981d3695b",
  "text": " The crucial chapter, \"The Shadow of the  Past', is  one of the oldest parts of the tale.  It  was written long before  the foreshadow  of  1939 had yet become a threat of inevitable disaster, and  from that  point the  story would have developed along essentially  the same  lines, if that disaster had been averted. Its sources are things long before  in mind, or in some  cases already written, and  little or nothing in it was  modified by the war that began in 1939 or its sequels.        The real war  does not resemble the legendary war in its process or its  conclusion. If it had inspired  or  directed  the development of the legend,  then certainly the  Ring would have  been seized and used against Sauron; he  would  not have been annihilated  but enslaved, and Barad-dyr would not have  been destroyed but occupied. Saruman, failing to get possession of the Ring,  would m the confusion  and treacheries of the  time have found in Mordor the  missing links in his own researches into Ring-lore, and before long he would  have made a Great  Ring  of his  own with which to challenge the self-styled  Ruler of Middle-earth.  In that conflict both sides would  have held hobbits  in hatred and contempt: they would not long have survived even as slaves.       Other arrangements could be devised according to the tastes or views of  those  who  like allegory  or  topical reference.  But I  cordially  dislike  allegory in all its manifestations, and always have done so since I grew old  and  wary  enough to  detect  its  presence. I  much prefer history, true or   feigned, with its varied  applicability  to the  thought  and  experience of  readers. I think that many confuse 'applicability' with 'allegory'; but  the  one  resides  in the  freedom of the reader, and the  other in  the purposed  domination of the author.       An author cannot of course remain wholly unaffected  by his experience,   but the ways in which a story-germ uses the soil of experience are extremely   complex,  and  attempts  to  define  the  process  are at  best guesses from  evidence  that  is  inadequate  and  ambiguous.  It  is also  false,  though  naturally  attractive,  when  the  lives  of   an  author  and  critic  have  overlapped, to  suppose that the movements of thought or the events of times  common to both were necessarily the most powerful influences. One has  indeed  personally to come under the shadow of war to feel fully its oppression; but  as the years go by it seems now often forgotten that to  be caught  in youth   ####-by  1914 was no less hideous an experience  than to  be involved in 1939 and  the  following years. By 1918 all but one of my close  friends were dead. Or   to  take  a less grievous  matter:  it  has been supposed by some  that 'The  Scouring of  the Shire' reflects the situation in England at the time when I  was finishing  my tale. It does  not. It is an  essential  part of the plot,  foreseen from the outset, though in the event  modified  by the character of  Saruman as  developed  in  the story  without, need I  say,  any allegorical  significance or contemporary political reference  whatsoever. It has  indeed  some basis in experience,  though  slender (for the  economic situation  was  entirely different),  and much further back. The country in which I lived in  childhood was  being  shabbily  destroyed before  I was  ten, in  days  when  motor -cars were  rare objects  (I had  never seen  one) and  men wer e  still  building suburban railways.  Recently I saw in a paper a picture of the last   decrepitude of  the once  thriving  corn-mill beside its  pool that long ago  seemed to me so important.  I never liked the looks of the Young miller, but  his father,  the Old  miller,  had  a  black  beard,  and he  was  not named  Sandyman.       The  Lord  of  the  Rings is  now  issued in  a  new  edition,  and the  opportunity  has  been  taken  of  revising  it.  A  number  of  errors  and  inconsistencies that still rema ined in  the text have been corrected, and an  attempt has been made to provide information on a few points which attentive  readers have raised. I have considered all their comments and enquiries, and  if some seem to have been passed over  that  may be because I have failed to   keep  my  notes in  order;  but many  enquiries  could only  be answered  by   additional appendices, or indeed  by the  production  of an accessory volume   containing  much of  the material that I did not  include  in  the  original  edition, in particular more detailed linguistic information. In the meantime  this edition offers this Foreword, an  addition to the Prologue, some notes,   and an index of the names of persons and places. This index is in  intention  complete in items  but not in references,  since for the present  purpose it  has been  necessary to reduce its bulk. A complete index, making full use of  the  material  prepared  for  me  by Mrs.  N. Smith,  belongs  rather to the  accessory volume."
}