{
  "id": "99a97f8162bbfcfce8ff6c93a29ace336e820178",
  "text": "  \"We might go from there up along the River Running,\" went on Thorin taking  no  notice,  \"and  so  to  the  ruins  of Dale-the old  town  in  the valley  there, under  the  shadow  of  the Mountain. But we  none of us liked the idea of the Front Gate. The  river  runs  right out of  it  through  the great  cliff  at  the South of  the Mountain,  and  out of it comes the dragon too-far too often, unless he has changed.\"  \"That  would  be  no  good,\"  said  the  wizard,  \"not  without  a  mighty  Warrior,  even  a  Hero.  I  tried  to  find  one;  but  warriors  are  busy  fighting  one  another  in  distant  lands,  and  in  this  neighbourhood  heroes  are  scarce,  or  simply  lot  to  be  found.  Swords  in  these  parts  are  mostly  blunt,  and  axes  are  used  for  trees,  and  shields  as  cradles  or  dish-covers;  and  dragons  are  comfortably  far-off  (and  therefore  legendary).  That  is  why  I  settled  on  burglary-especially  when  I  remembered the existence of a Side-door. And here is our little Bilbo Baggins, the  burglar,  the  chosen  and  selected  burglar.  So  now  let's  get  on  and  make  some  plans.\"  \"Very  well  then,\"  said  Thorin,  \"supposing  the  burglar-expert  gives  us  some  ideas or suggestions.\" He turned with mock-politeness to Bilbo.  \"First  I  should  like  to  know  a  bit  more  about  things,\"  said  he,  feeling  all  confused and a bit shaky inside, but so far still lookishly determined to go on with  things.  \"I mean  about  the  gold  and  the  dragon,  and  all  that,  and  how  it  got  there,  and who it belongs to, and so on and further.\"  \"Bless  me!\"  said  Thorin,  \"haven't  you  got  a  map?  and  didn't  you  hear  our  song? and haven't we been talking about all this for hours?\"  \"All  the  same,  I  should  like  it  all plain  and  clear,\"  said he obstinately, putting  on  his  business  manner  (usually  reserved  for  people  who  tried  to  borrow money  off him),  and doing his best  to  appear wise  and prudent  and professional  and  live   ####-up  to Gandalf's  recommendation. \"Also  I  should  like  to know about  risks, out-of- pocket  expenses,  time  required  and  remuneration,  and  so  forth\"-by  which  he  meant: \"What am I going to get out of it? and am I going to come back alive?\"  \"O  very  well,\"  said  Thorin.  \"Long  ago  in  my  grandfather  Thror's  time  our  family  was  driven  out  of  the  far  North,  and  came  back  with  all  their  wealth  and  their tools to this Mountain on the map. It had been discovered by my far ancestor,  Thrain the Old, but now they mined and they tunnelled and they made huger halls  and greater workshops  -and  in  addition  I  believe  they  found  a  good  deal  of  gold  and a great many  jewels  too. Anyway they grew immensely rich and famous, and  my  grandfather  was  King  under  the  Mountain  again  and  treated  with  great  reverence  by  the  mortal  men,  who  lived  to  the  South,  and  were  gradually  spreading  up  the  Running  River  as  far  as  the  valley  overshadowed  by  the  Mountain.  They  built  the merry  town  of  Dale  there  in  those  days.  Kings  used  to  send  for  our  smiths,  and  reward  even  the  least  skilful most  richly.  Fathers would  beg  us  to  take  their  sons  as  apprentices,  and  pay  us  handsomely,  especially  in  food-supplies, which we  never  bothered  to  grow  or  find  for  ourselves. Altogether  those were good days for us, and the poorest of us had money to spend and to lend,  and leisure to make beautiful things just for the. fun of it, not to speak of the most  marvellous  and  magical  toys,  the  like  of  which  is  not  to  be  found  in  the  world  now-a-days.  So  my  grandfather's  halls  became  full  of  armour  and  jewels  and  carvings and cups, and the toy-market of Dale was the wonder of the North.  \"Undoubtedly  that  was  what  brought  the  dragon.  Dragons  steal  gold  and  jewels, you know, from men and elves and dwarves, wherever they can find them;  and  they  guard  their  plunder  as  long  as  they  live  (which  is  practically  forever,  unless they are killed), and never enjoy a brass ring of it. Indeed they hardly know  a  good  bit  of  work  from  a  bad,  though  they  usually  have  a  good  notion  of  the  current market value; and they can't make a thing for themselves, not even mend a  little  loose  scale of  their armour. There were  lots of dragons  in  the North  in  those  days, and gold was probably getting scarce up there, with the dwarves flying south  or  getting  killed,  and  all  the  general  waste  and  destruction  that  dragons  make  going  from  bad  to  worse.  There  was  a  most  specially  greedy,  strong  and  wicked  worm called Smaug. One day he flew up into the air and came south. The first we  heard of  it was a noise  like a hurricane coming from  the North, and  the pine-trees  on  the  Mountain  creaking  and  cracking  in  the  wind.  Some  of  the  dwarves  who  happened  to  be  outside  (I  was  one  luckily  -a  fine  adventurous  lad  in  those  days,  always wandering about, and it saved my life that day)-well, from a good way off  we saw the dragon settle on our mountain in a spout of flame."
}