{
  "id": "9aa05893d0332e8dc4c218cab86b8d57b7a84599",
  "text": " Yet there was nothing grand about it. It was a soldier’s tent of heavy canvas, dyed the dark yellow that sometimes passed for gold. Only the royal banner that streamed atop the center pole marked it as a king’s. That, and the guards without; queen’s men leaning on tall spears, with the badge of the fiery heart sewn over their own.  Grooms came up to help them dismount. One of the guards relieved Melisandre of her cumbersome standard, driving the staff deep into the soft ground. Devan stood to one side of the door, waiting to lift the flap for the king. An older squire waited beside him. Stannis took off his crown and handed it to Devan.  Cold water, cups for two. Davos, attend me. My lady, I shall send for you when I require you.    As the king commands.  Melisandre bowed.  After the brightness of the morning, the interior of the pavilion seemed cool and dim. Stannis seated himself on a plain wooden camp stool and waved Davos to another.  One day I may make you a lord, smuggler. If only to irk Celtigar and Florent. You will not thank me, though. It will mean you must suffer through these councils, and feign interest in the braying of mules.    Why do you have them, if they serve no purpose?    The mules love the sound of their own braying, why else? And I need them to haul my cart. Oh, to be sure, once in a great while some useful notion is put forth. But not today, I think—ah, here’s your son with our water.   Devan set the tray on the table and filled two clay cups. The king sprinkled a pinch of salt in his cup before he drank; Davos took his water straight, wishing it were wine.  You were speaking of your council?    Let me tell you how it will go. Lord Velaryon will urge me to storm the castle walls at first light, grapnels and scaling ladders against arrows and boiling oil. The young mules will think this a splendid notion. Estermont will favor settling down to starve them out, as Tyrell and Redwyne once tried with me. That might take a year, but old mules are patient. And Lord Caron and the others who like to kick will want to take up Ser Cortnay’s gauntlet and hazard all upon a single combat. Each one imagining he will be my champion and win undying fame.  The king finished his water.  What would you have me do, smuggler?   Davos considered a moment before he answered.  Strike for King’s Landing at once.   The king snorted.  And leave Storm’s End untaken?    Ser Cortnay does not have the power to harm you. The Lannisters do. A siege would take too long, single combat is too chancy, and an assault would cost thousands of lives with no certainty of success. And there is no need. Once you dethrone Joffrey this castle must come to you with all the rest. It is said about the camp that Lord Tywin Lannister rushes west to rescue Lannisport from the vengeance of the northmen…    You have a passing clever father, Devan,  the king told the boy standing by his elbow.  He makes me wish I had more smugglers in my service. And fewer lords. Though you are wrong in one respect, Davos. There is a need. If I leave Storm’s End untaken in my rear, it will be said I was defeated here. And that I cannot permit. Men do not love me as they loved my brothers. They follow me because they fear me… and defeat is death to fear. The castle must fall.  His jaw ground side to side.  Aye, and quickly. Doran Martell has called his banners and fortified the mountain passes. His Dornishmen are poised to sweep down onto the Marches. And Highgarden is far from spent. My brother left the greater part of his power at Bitterbridge, near sixty thousand foot. I sent my wife’s brother Ser Errol with Ser Parmen Crane to take them under my command, but they have not returned. I fear that Ser Loras Tyrell reached Bitterbridge before my envoys, and took that host for his own.    All the more reason to take King’s Landing as soon as we may. Salladhor Saan told me—    Salladhor Saan thinks only of gold!  Stannis exploded.  His head is full of dreams of the treasure he fancies lies under the Red Keep, so let us hear no more of Salladhor Saan. The day I need military counsel from a Lysene brigand is the day I put off my crown and take the black.  The king made a fist.  Are you here to serve me, smuggler? Or to vex me with arguments?    I am yours,  Davos said.   Then hear me. Ser Cortnay’s lieutenant is cousin to the Fossoways. Lord Meadows, a green boy of twenty. Should some ill chance strike down Penrose, command of Storm’s End would pass to this stripling, and his cousins believe he would accept my terms and yield up the castle.    I remember another stripling who was given command of Storm’s End. He could not have been much more than twenty.    Lord Meadows is not as stonehead stubborn as I was.    Stubborn or craven, what does it matter? Ser Cortnay Penrose seemed hale and hearty to me.    So did my brother, the day before his death. The night is dark and full of terrors, Davos.   Davos Seaworth felt the small hairs rising on the back of his neck."
}