{
  "id": "9b58c00bc8de29f031f98460173489b4d74ab4ec",
  "text": " We should be starting this week. He said he'd have time after Christmas.\"  \"Ah,\" said Wood, his expression clearing. \"Well, in that case -- I really didn't want to lose you as Seeker, Harry. And have you ordered a new broom yet?\"  \"No,\" said Harry.  \"What! You'd better get a move on, you know -- you can't ride that Shooting Star against Ravenclaw!\"  \"He got a Firebolt for Christmas,\" said Ron.  \"A Firebolt? No! Seriously? A -- a real Firebolt?\"  \"Don't get excited, Oliver,\" said Harry gloomily. \"I haven't got it anymore. It was confiscated.\" And he explained all about how the Firebolt was now being checked for jinxes.  \"Jinxed? How could it be jinxed?\"  \"Sirius Black\" Harry said wearily. \"He's supposed to be after me. So McGonagall reckons he might have sent it.\"  Waving aside the information that a famous murderer was after his Seeker, Wood said, \"But Black couldn't have bought a Firebolt! He's on the run! The whole country's on the lookout for him! How could he just walk into Quality Quidditch Supplies and buy a broomstick?\"  \"I know,\" said Harry, \"but McGonagall still wants to strip it down --\"  Wood went pale.  \"I'll go and talk to her, Harry,\" he promised. \"I'll make her see reason.... A Firebolt... a real Firebolt, on our team... She wants Gryffindor to win as much as we do.... I'll make her see sense. A Firebolt...\"  Classes started again the next day. The last thing anyone felt like doing was spending two hours on the grounds on a raw January morning, but Hagrid had provided a bonfire full of salamanders for their enjoyment, and they spent an unusually good lesson collecting dry wood and leaves to keep the fire blazing while the flame-loving lizards scampered up and down the crumbling, white-hot logs. The first Divination lesson of the new term was much less fun; Professor Trelawney was now teaching them palmistry, and she lost no time in informing Harry that he had the shortest life line she had ever seen.  It was Defense Against the Dark Arts that Harry was keen to get to; after his conversation with Wood, he wanted to get started on his anti-dementor lessons as soon as possible.  \"Ah yes,\" said Lupin, when Harry reminded him of his promise at the end of class. \"Let me see... how about eight o'clock on Thursday evening? The History of Magic classroom should be large enough.... I'll have to think carefully about how we're going to do this.... We can't bring a real dementor into the castle to practice on....\"  \"Still looks ill, doesn't he?\" said Ron as they walked down the corridor, heading to dinner. \"What d'you reckon's the matter with him?\"  There was a loud and impatient \"tuh\" from behind them. It was Hermione, who had been sitting at the feet of a suit of armor, repacking her bag, which was so full of books it wouldn't close.  \"And what are you tutting at us for?\" said Ron irritably.  \"Nothing,\" said Hermione in a lofty voice, heaving her bag back over her shoulder.  \"Yes, you were,\" said Ron. \"I said I wonder what's wrong with Lupin, and you --\"  \"Well, isn't it obvious?\" said Hermione, with a look of maddening superiority.  \"If you don't want to tell us, don't,\" snapped Ron.  \"Fine,\" said Hermione haughtily, and she marched off.  \"She doesn't know,\" said Ron, staring resentfully after Hermione. \"She's just trying to get us to talk to her again.\"  At eight o'clock on Thursday evening, Harry left Gryffindor Tower for the History of Magic classroom. It was dark and empty when he arrived, but he lit the lamps with his wand and had waited only five minutes when Professor Lupin turned up, carrying a large packing case, which he heaved onto Professor Binn's desk.  \"What's that?\" said Harry.  \"Another boggart,\" said Lupin, stripping off his cloak. \"I've been combing the castle ever since Tuesday, and very luckily, I found this one lurking inside Mr. Filch's filing cabinet. It's the nearest we'll get to a real dementor. The boggart will turn into a dementor when he sees you, so we'll be able to practice on him. I can store him in my office when we're not using him; there's a cupboard under my desk he'll like.\"  \"Okay,\" said Harry, trying to sound as though he wasn't apprehensive at all and merely glad that Lupin had found such a good substitute for a real dementor.  \"So...\" Professor Lupin had taken out his own wand, and indicated that Harry should do the same. \"The spell I am going to try and teach you is highly advanced magic, Harry -- well beyond ordinary Wizarding Level. It is called the Patronus Charm.\"  \"How does it work?\" said Harry nervously.  \"Well, when it works correctly, It conjures up a Patronus,\" said Lupin, \"which is a kind of anti- dementor -- a guardian that acts as a shield between you and the dementor.\"  Harry had a sudden vision of himself crouching behind a Hagridsized figure holding a large club. Professor Lupin continued, \"The Patronus is a kind of positive force, a projection of the very things that the dementor feeds upon -- hope, happiness, the desire to survive -- but it cannot feel despair, as real humans can, so the dementors can't hurt it."
}