{
  "id": "9ce25e6ac621e3b607d1186ea86c5d3725c8f77f",
  "text": "   Sansa whirled. A man stepped out of the shadows, heavyset, thick of neck, shambling. He wore a dark grey robe with the cowl pulled forward, but when a thin sliver of moonlight touched his cheek, she knew him at once by the blotchy skin and web of broken veins beneath.  Ser Dontos,  she breathed, heartbroken.  Was it you?    Yes, my lady.  When he moved closer, she could smell the sour stench of wine on his breath.  Me.  He reached out a hand.  Sansa shrank back.  Don’t!  She slid her hand under her cloak, to her hidden knife.  What… what do you want with me?    Only to help you,  Dontos said,  as you helped me.    You’re drunk, aren’t you?    Only one cup of wine, to help my courage. If they catch me now, they’ll strip the skin off my back.   And what will they do to me? Sansa found herself thinking of Lady again. She could smell out falsehood, she could, but she was dead, Father had killed her, on account of Arya. She drew the knife and held it before her with both hands.   Are you going to stab me?  Dontos asked.   I will,  she said.  Tell me who sent you.    No one, sweet lady. I swear it on my honor as a knight.    A knight?  Joffrey had decreed that he was to be a knight no longer, only a fool, lower even than Moon Boy.  I prayed to the gods for a knight to come save me,  she said.  I prayed and prayed. Why would they send me a drunken old fool?    I deserve that, though… I know it’s queer, but… all those years I was a knight, I was truly a fool, and now that I am a fool I think… I think I may find it in me to be a knight again, sweet lady. And all because of you… your grace, your courage. You saved me, not only from Joffrey, but from myself.  His voice dropped.  The singers say there was another fool once who was the greatest knight of all…    Florian,  Sansa whispered. A shiver went through her.   Sweet lady, I would be your Florian,  Dontos said humbly, falling to his knees before her.  Slowly, Sansa lowered the knife. Her head seemed terribly light, as if she were floating. This is madness, to trust myself to this drunkard, but if I turn away will the chance ever come again?  How… how would you do it? Get me away?   Ser Dontos raised his face to her.  Taking you from the castle, that will be the hardest. Once you’re out, there are ships that would take you home. I’d need to find the coin and make the arrangements, that’s all.    Could we go now?  she asked, hardly daring to hope.   This very night? No, my lady, I fear not. First I must find a sure way to get you from the castle when the hour is ripe. It will not be easy, nor quick. They watch me as well.  He licked his lips nervously.  Will you put away your blade?   Sansa slipped the knife beneath her cloak.  Rise, ser.    Thank you, sweet lady.  Ser Dontos lurched clumsily to his feet, and brushed earth and leaves from his knees.  Your lord father was as true a man as the realm has ever known, but I stood by and let them slay him. I said nothing, did nothing… and yet, when Joffrey would have slain me, you spoke up. Lady, I have never been a hero, no Ryam Redwyne or Barristan the Bold. I’ve won no tourneys, no renown in war… but I was a knight once, and you have helped me remember what that meant. My life is a poor thing, but it is yours.  Ser Dontos placed a hand on the gnarled bole of the heart tree. He was shaking, she saw.  I vow, with your father’s gods as witness, that I shall send you home.   He swore. A solemn oath, before the gods.  Then… I will put myself in your hands, ser. But how will I know, when it is time to go? Will you send me another note?   Ser Dontos glanced about anxiously.  The risk is too great. You must come here, to the godswood. As often as you can. This is the safest place. The only safe place. Nowhere else. Not in your chambers nor mine nor on the steps nor in the yard, even if it seems we are alone. The stones have ears in the Red Keep, and only here may we talk freely.    Only here,  Sansa said.  I’ll remember.    And if I should seem cruel or mocking or indifferent when men are watching, forgive me, child. I have a role to play, and you must do the same. One misstep and our heads will adorn the walls as did your father’s.   She nodded.  I understand.    You will need to be brave and strong… and patient, patient above all.    I will be,  she promised,  but… please… make it as soon as you can. I’m afraid…    So am I,  Ser Dontos said, smiling wanly.  And now you must go, before you are missed.    You will not come with me?    Better if we are never seen together.   Nodding, Sansa took a step… then spun back, nervous, and softly laid a kiss on his cheek, her eyes closed.  My Florian,  she whispered.  The gods heard my prayer.   She flew along the river walk, past the small kitchen, and through the pig yard, her hurried footsteps lost beneath the squealing of the hogs in their pens. Home, she thought, home, he is going to take me home, he’ll keep me safe, my Florian. The songs about Florian and Jonquil were her very favorites."
}