{
  "id": "9d94618bde7e563610166131378717a7e490c4df",
  "text": " They had walked back, it seemed. Somehow the Kingslayer had contrived to sink their galley and escape, Maester Vyman confided. Catelyn asked if she might speak with Ser Robin to learn more of what had happened, but that was refused her.  Something else was wrong as well. On the day her brother returned, a few hours after their argument, she had heard angry voices from the yard below. When she climbed to the roof to see, there were knots of men gathered across the castle beside the main gate. Horses were being led from the stables, saddled and bridled, and there was shouting, though Catelyn was too far away to make out the words. One of Robb’s white banners lay on the ground, and one of the knights turned his horse and trampled over the direwolf as he spurred toward the gate. Several others did the same. Those are men who fought with Edmure on the fords, she thought. What could have made them so angry? Has my brother slighted them somehow, given them some insult? She thought she recognized Ser Perwyn Frey, who had traveled with her to Bitterbridge and Storm’s End and back, and his bastard half brother Martyn Rivers as well, but from this vantage it was hard to be certain. Close to forty men poured out through the castle gates, to what end she did not know.  They did not come back. Nor would Maester Vyman tell her who they had been, where they had gone, or what had made them so angry.  I am here to see to your father, and only that, my lady,  he said.  Your brother will soon be Lord of Riverrun. What he wishes you to know, he must tell you.   But now Robb was returned from the west, returned in triumph. He will forgive me, Catelyn told herself. He must forgive me, he is my own son, and Arya and Sansa are as much his blood as mine. He will free me from these rooms and then I will know what has happened.  By the time Ser Desmond came for her, she had bathed and dressed and combed out her auburn hair.  King Robb has returned from the west, my lady,  the knight said,  and commands that you attend him in the Great Hall.   It was the moment she had dreamt of and dreaded. Have I lost two sons, or three? She would know soon enough.  The hall was crowded when they entered. Every eye was on the dais, but Catelyn knew their backs: Lady Mormont’s patched ringmail, the Greatjon and his son looming above every other head in the hall, Lord Jason Mallister white-haired with his winged helm in the crook of his arm, Tytos Blackwood in his magnificent raven-feather cloak… Half of them will want to hang me now. The other half may only turn their eyes away. She had the uneasy feeling that someone was missing, too.  Robb stood on the dais. He is a boy no longer, she realized with a pang. He is sixteen now, a man grown. Just look at him. War had melted all the softness from his face and left him hard and lean. He had shaved his beard away, but his auburn hair fell uncut to his shoulders. The recent rains had rusted his mail and left brown stains on the white of his cloak and surcoat. Or perhaps the stains were blood. On his head was the sword crown they had fashioned him of bronze and iron. He bears it more comfortably now. He bears it like a king.  Edmure stood below the crowded dais, head bowed modestly as Robb praised his victory.  …fell at the Stone Mill shall never be forgotten. Small wonder Lord Tywin ran off to fight Stannis. He’d had his fill of northmen and rivermen both.  That brought laughter and approving shouts, but Robb raised a hand for quiet.  Make no mistake, though. The Lannisters will march again, and there will be other battles to win before the kingdom is secure.   The Greatjon roared out,  King in the North!  and thrust a mailed fist into the air. The river lords answered with a shout of  King of the Trident!  The hall grew thunderous with pounding fists and stamping feet.  Only a few noted Catelyn and Ser Desmond amidst the tumult, but they elbowed their fellows, and slowly a hush grew around her. She held her head high and ignored the eyes. Let them think what they will. It is Robb’s judgment that matters.  The sight of Ser Brynden Tully’s craggy face on the dais gave her comfort. A boy she did not know seemed to be acting as Robb’s squire. Behind him stood a young knight in a sand-colored surcoat blazoned with seashells, and an older one who wore three black pepperpots on a saffron bend, across a field of green and silver stripes. Between them were a handsome older lady and a pretty maid who looked to be her daughter. There was another girl as well, near Sansa’s age. The seashells were the sigil of some lesser house, Catelyn knew; the older man’s she did not recognize. Prisoners? Why would Robb bring captives onto the dais?  Utherydes Wayn banged his staff on the floor as Ser Desmond escorted her forward. If Robb looks at me as Edmure did, I do not know what I will do. But it seemed to her that it was not anger she saw in her son’s eyes, but something else… apprehension, perhaps? No, that made no sense. What should he fear? He was the Young Wolf, King of the Trident and the North."
}