{
  "id": "9f2471944b16b0d187e5a971b5e25537ec2489f6",
  "text": "  What in all the seven hells am I supposed to make of this? He says one thing, she says another.    They were not the only ones present,  Ned said.  Sansa, come here.  Ned had heard her version of the story the night Arya had vanished. He knew the truth.  Tell us what happened.   His eldest daughter stepped forward hesitantly. She was dressed in blue velvets trimmed with white, a silver chain around her neck. Her thick auburn hair had been brushed until it shone. She blinked at her sister, then at the young prince.  I don’t know,  she said tearfully, looking as though she wanted to bolt.  I don’t remember. Everything happened so fast, I didn’t see…    You rotten!  Arya shrieked. She flew at her sister like an arrow, knocking Sansa down to the ground, pummeling her.  Liar, liar, liar, liar.    Arya, stop it!  Ned shouted. Jory pulled her off her sister, kicking. Sansa was pale and shaking as Ned lifted her back to her feet.  Are you hurt?  he asked, but she was staring at Arya, and she did not seem to hear.   The girl is as wild as that filthy animal of hers,  Cersei Lannister said.  Robert, I want her punished.    Seven hells,  Robert swore.  Cersei, look at her. She’s a child. What would you have me do, whip her through the streets? Damn it, children fight. It’s over. No lasting harm was done.   The queen was furious.  Joff will carry those scars for the rest of his life.   Robert Baratheon looked at his eldest son.  So he will. Perhaps they will teach him a lesson. Ned, see that your daughter is disciplined. I will do the same with my son.    Gladly, Your Grace,  Ned said with vast relief.  Robert started to walk away, but the queen was not done.  And what of the direwolf?  she called after him.  What of the beast that savaged your son?   The king stopped, turned back, frowned.  I’d forgotten about the damned wolf.   Ned could see Arya tense in Jory’s arms. Jory spoke up quickly.  We found no trace of the direwolf, Your Grace.   Robert did not look unhappy.  No? So be it.   The queen raised her voice.  A hundred golden dragons to the man who brings me its skin!    A costly pelt,  Robert grumbled.  I want no part of this, woman. You can damn well buy your furs with Lannister gold.   The queen regarded him coolly.  I had not thought you so niggardly. The king I’d thought to wed would have laid a wolfskin across my bed before the sun went down.   Robert’s face darkened with anger.  That would be a fine trick, without a wolf.    We have a wolf,  Cersei Lannister said. Her voice was very quiet, but her green eyes shone with triumph.  It took them all a moment to comprehend her words, but when they did, the king shrugged irritably.  As you will. Have Ser Ilyn see to it.    Robert, you cannot mean this,  Ned protested.  The king was in no mood for more argument.  Enough, Ned, I will hear no more. A direwolf is a savage beast. Sooner or later it would have turned on your girl the same way the other did on my son. Get her a dog, she’ll be happier for it.   That was when Sansa finally seemed to comprehend. Her eyes were frightened as they went to her father.  He doesn’t mean Lady, does he?  She saw the truth on his face.  No,  she said.  No, not Lady, Lady didn’t bite anybody, she’s good…    Lady wasn’t there,  Arya shouted angrily.  You leave her alone!    Stop them,  Sansa pleaded,  don’t let them do it, please, please, it wasn’t Lady, it was Nymeria, Arya did it, you can’t, it wasn’t Lady, don’t let them hurt Lady, I’ll make her be good, I promise, I promise…  She started to cry.  All Ned could do was take her in his arms and hold her while she wept. He looked across the room at Robert. His old friend, closer than any brother.  Please, Robert. For the love you bear me. For the love you bore my sister. Please.   The king looked at them for a long moment, then turned his eyes on his wife.  Damn you, Cersei,  he said with loathing.  Ned stood, gently disengaging himself from Sansa’s grasp. All the weariness of the past four days had returned to him.  Do it yourself then, Robert,  he said in a voice cold and sharp as steel.  At least have the courage to do it yourself.   Robert looked at Ned with flat, dead eyes and left without a word, his footsteps heavy as lead. Silence filled the hall.   Where is the direwolf?  Cersei Lannister asked when her husband was gone. Beside her, Prince Joffrey was smiling.   The beast is chained up outside the gatehouse, Your Grace,  Ser Barristan Selmy answered reluctantly.   Send for Ilyn Payne.    No,  Ned said.  Jory, take the girls back to their rooms and bring me Ice.  The words tasted of bile in his throat, but he forced them out.  If it must be done, I will do it.   Cersei Lannister regarded him suspiciously.  You, Stark? Is this some trick? Why would you do such a thing?   They were all staring at him, but it was Sansa’s look that cut.  She is of the north. She deserves better than a butcher.   He left the room with his eyes burning and his daughter’s wails echoing in his ears, and found the direwolf pup where they chained her."
}