{
  "id": "9fce57d941886a023880793ff9b785be6d28c8ff",
  "text": "'   ####-     Frodo shuddered. 'But why  should we be?'  he asked. 'And why should he  want such slaves?'       'To tell you the  truth,' replied Gandalf,  'I  believe that hitherto -  hitherto,  mark you - he has entirely overlooked the existence  of   hobbits.   You should be thankful. But your  safety has passed. He does not need you   -  he  has  many  more useful  servants   -  but  he won't forget you again. And  hobbits as miserable slaves would please him far more than hobbits happy and  free. There is  such a thing as malice and revenge.'       'Revenge?' said Frodo. 'Revenge for what? I still don't understand what  all this has to do with Bilbo and myself, and our ring.'       'It has everything to do with  it,' said Gandalf. 'You do  not know the  real peril  yet; but  you shall. I was not sure of it myself when I was last   here; but the time has come to speak. Give me the ring for a moment.'       Frodo took it from his breeches-pocket, where it was clasped to a chain  that hung  from  his  belt. He unfastened  it  and handed  it slowly  to the  wizard. It felt suddenly very heavy, as if either it or Frodo himself was in  some way reluctant for Gandalf to touch it.       Gandalf held it up. It looked  to be  made of pure and solid gold. 'Can  you see any markings  on it?' he asked.       'No,'  said  Frodo. 'There  are none. It is quite  plain,  and it never   shows a scratch or sign of wear.'       'Well  then, look!'  To Frodo's  astonishment and  distress  the wizard  threw it suddenly  into the middle  of a glowing corner  of the fire.  Frodo  gave a cry and groped for the tongs; but Gandalf held him back.       'Wait!' he said in a commanding voice,  giving Frodo a quick  look from  under his bristling brows.       No apparent  change came over the ring. After a  while  Gandalf got up,  closed  the shutters outside the window,  and drew  the  curtains.  The room  became dark and silent, though the  clack of Sam's shears, now nearer to the   windows,  could  still be heard  faintly from the garden. For  a  moment the  wizard st ood looking at the fire; then he stooped and  removed  the ring  to  the hearth with the tongs, and at once picked it up. Frodo gasped.       It  is quite cool,' said Gandalf. 'Take it!' Frodo received  it  on his  shrinking palm: it seemed to have become thicker and heavier than ever.       'Hold it up!' said Gandalf. 'And look closely!'       As  Frodo  did  so,  he  now  saw  fine  lines, finer than  the  finest   pen-strokes,  running along the ring, outside and inside: lines of fire that   ####-seemed  to  form  the  letters of a flowing  script. They  shone  piercingly  bright, and yet remote, as if out of a great depth.         I cannot read the fiery letters,' said Frodo in a quavering voice.       'No,' said Gandalf, 'but I can. The  letters are Elvish,  of an ancient  mode, but the  language is that of Mordor, which I will  not utter here. But  this in the Common Tongue is what is said, close enough:       One Ring to rule them all, One Ring to find them,       One Ring to bring them all and in the darkness bind them.       It is only two lines of a verse long known in Elven-lore:       Three Rings for the Elven-kings under the sky,       Seven for the Dwarf- lords in their halls of stone,       Nine for Mortal Men doomed to die,       One for the Dark Lord on his dark throne       In the Land of Mordor where the Shadows lie.       One Ring to rule them all. One Ring to find them,       One Ring to bring them all and in the darkness bind them       In the Land of Mordor where the Shadows lie.'       He  paused,  and  then  said  slowly in  a  deep voice:  'This  is  the  Master-ring, the One  Ring to rule them all.  This is the  One  Ring that he  lost many ages ago, to the great weakening of  his power. He greatly desires  it - but he must not get it.'       Frodo sat silent  and motionless.  Fear seemed  to stretch out  a  vast   hand, like a dark  cloud rising in the East and  looming  up  to engulf him.  'This ring!' he stammered. 'How, how on earth did it come to me?'       'Ah!' said Gandalf. 'That is a very long story. The beginnings lie back  in  the Black Years, which only the lore-masters now remember. If  I were to  tell  you all  that tale, we should still  be sitting  here when  Spring had  passed into Winter.       'But last  night  I told  you of Sauron the Great,  the Dark  Lord. The  rumours that you have  heard are  true: he  has indeed arisen again and left  his hold in Mirkwood and returned to his ancient fastness in the  Dark Tower  of Mordor. That name even  you  hobbits have heard of, like a  shadow on the  borders of  old  stories. Always after a  defeat and a  respite, the  Shadow  takes another shape and grows again.'       'I wish it need not have happened in my time,' said Frodo.       'So do I,' said Gandalf, 'and so do all who live to see such times. But   ####-that is not for them to decide. All we have to decide is what to do with the  time that  is given, us."
}