{
  "id": "a0a83b19b1709792c53b0ae6eca8355a8e146962",
  "text": "  He gave a dry chuckle.  He knows little of Stannis Baratheon either, I fear. That one might have given him Harrenhal for his service… but he would have given him a noose for his crimes as well.    A noose is kinder than what he’ll get from my father.    By now he has come to the same realization. With Stannis broken and Renly dead, only a Stark victory can save him from Lord Tywin’s vengeance, but the chances of that grow perishingly slim.    King Robb has won every battle,  Brienne said stoutly, as stubbornly loyal of speech as she was of deed.   Won every battle, while losing the Freys, the Karstarks, Winterfell, and the north. A pity the wolf is so young. Boys of sixteen always believe they are immortal and invincible. An older man would bend the knee, I’d think. After a war there is always a peace, and with peace there are pardons… for the Robb Starks, at least. Not for the likes of Vargo Hoat.  Bolton gave him a small smile.  Both sides have made use of him, but neither will shed a tear at his passing. The Brave Companions did not fight in the Battle of the Blackwater, yet they died there all the same.    You’ll forgive me if I don’t mourn?    You have no pity for our wretched doomed goat? Ah, but the gods must… else why deliver you into his hands?  Bolton chewed another chunk of meat.  Karhold is smaller and meaner than Harrenhal, but it lies well beyond the reach of the lion’s claws. Once wed to Alys Karstark, Hoat might be a lord in truth. If he could collect some gold from your father so much the better, but he would have delivered you to Lord Rickard no matter how much Lord Tywin paid. His price would be the maid, and safe refuge.   But to sell you he must keep you, and the riverlands are full of those who would gladly steal you away. Glover and Tallhart were broken at Duskendale, but remnants of their host are still abroad, with the Mountain slaughtering the stragglers. A thousand Karstarks prowl the lands south and east of Riverrun, hunting you. Elsewhere are Darry men left lordless and lawless, packs of four-footed wolves, and the lightning lord’s outlaw bands. Dondarrion would gladly hang you and the goat together from the same tree.  The Lord of the Dreadfort sopped up some of the blood with a chunk of bread.  Harrenhal was the only place Lord Vargo could hope to hold you safe, but here his Brave Companions are much outnumbered by my own men, and by Ser Aenys and his Freys. No doubt he feared I might return you to Ser Edmure at Riverrun… or worse, send you on to your father.   By maiming you, he meant to remove your sword as a threat, gain himself a grisly token to send to your father, and diminish your value to me. For he is my man, as I am King Robb’s man. Thus his crime is mine, or may seem so in your father’s eyes. And therein lies my… small difficulty.  He gazed at Jaime, his pale eyes unblinking, expectant, chill.  I see.  You want me to absolve you of blame. To tell my father that this stump is no work of yours.  Jaime laughed.  My lord, send me to Cersei, and I’ll sing as sweet a song as you could want, of how gently you treated me.  Any other answer, he knew, and Bolton would give him back to the goat.  Had I a hand, I’d write it out. How I was maimed by the sellsword my own father brought to Westeros, and saved by the noble Lord Bolton.    I will trust to your word, ser.   There’s something I don’t often hear.  How soon might we be permitted to leave? And how do you mean to get me past all these wolves and brigands and Karstarks?    You will leave when Qyburn says you are strong enough, with a strong escort of picked men under the command of my captain, Walton. Steelshanks, he is called. A soldier of iron loyalty. Walton will see you safe and whole to King’s Landing.    Provided Lady Catelyn’s daughters are delivered safe and whole as well,  said the wench.  My lord, your man Walton’s protection is welcome, but the girls are my charge.   The Lord of the Dreadfort gave her an uninterested glance.  The girls need not concern you any further, my lady. The Lady Sansa is the dwarf’s wife, only the gods can part them now.    His wife?  Brienne said, appalled.  The Imp? But… he swore, before the whole court, in sight of gods and men…   She is such an innocent. Jaime was almost as surprised, if truth be told, but he hid it better. Sansa Stark, that ought to put a smile on Tyrion’s face. He remembered how happy his brother had been with his little crofter’s daughter… for a fortnight.   What the Imp did or did nor swear scarcely matters now,  said Lord Bolton.  Least of all to you.  The wench looked almost wounded. Perhaps she finally felt the steel jaws of the trap when Roose Bolton beckoned to his guards.  Ser Jaime will continue on to King’s Landing. I said nothing about you, I fear. It would be unconscionable of me to deprive Lord Vargo of both his prizes.  The Lord of the Dreadfort reached out to pick another prune.  Were I you, my lady, I should worry less about Starks and rather more about sapphires."
}