{
  "id": "a0eb40ad79bca988147dca7e39a5dac0359ce5c0",
  "text": " He could see himself on the cold stone floor, a little broken thing, but he wasn’t broken now. He grabbed Hodor’s longsword. The breathing was as loud as a blacksmith’s bellows.  From the well came a wail, a piercing creech that went through him like a knife. A huge black shape heaved itself up into the darkness and lurched toward the moonlight, and the fear rose up in Bran so thick that before he could even think of drawing Hodor’s sword the way he’d meant to, he found himself back on the floor again with Hodor roaring  Hodor hodor HODOR,  the way he had in the lake tower whenever the lightning flashed. But the thing that came in the night was screaming too, and thrashing wildly in the folds of Meera’s net. Bran saw her spear dart out of the darkness to snap at it, and the thing staggered and fell, struggling with the net. The wailing was still coming from the well, even louder now. On the floor the black thing flopped and fought, screeching,  No, no, don’t, please, DON’T…   Meera stood over him, the moonlight shining silver off the prongs of her frog spear.  Who are you?  she demanded.   I’m SAM,  the black thing sobbed.  Sam, Sam, I’m Sam, let me out, you stabbed me…  He rolled through the puddle of moonlight, flailing and flopping in the tangles of Meera’s net. Hodor was still shouting,  Hodor hodor hodor.   It was Jojen who fed the sticks to the fire and blew on them until the flames leapt up crackling. Then there was light, and Bran saw the pale thin-faced girl by the lip of the well, all bundled up in furs and skins beneath an enormous black cloak, trying to shush the screaming baby in her arms. The thing on the floor was pushing an arm through the net to reach his knife, but the loops wouldn’t let him. He wasn’t any monster beast, or even Mad Axe drenched in gore; only a big fat man dressed up in black wool, black fur, black leather, and black mail.  He’s a black brother,  said Bran.  Meera, he’s from the Night’s Watch.    Hodor?  Hodor squatted down on his haunches to peer at the man in the net.  Hodor,  he said again, hooting.   The Night’s Watch, yes.  The fat man was still breathing like a bellows.  I’m a brother of the Watch.  He had one cord under his chins, forcing his head up, and others digging deep into his cheeks.  I’m a crow, please. Let me out of this.   Bran was suddenly uncertain.  Are you the three-eyed crow?  He can’t be the three-eyed crow.   I don’t think so.  The fat man rolled his eyes, but there were only two of them.  I’m only Sam. Samwell Tarly. Let me out, it’s hurting me.  He began to struggle again.  Meera made a disgusted sound.  Stop flopping around. If you tear my net I’ll throw you back down the well. Just lie still and I’ll untangle you.    Who are you?  Jojen asked the girl with the baby.   Gilly,  she said.  For the gillyflower. He’s Sam. We never meant to scare you.  She rocked her baby and murmured at it, and finally it stopped crying.  Meera was untangling the fat brother. Jojen went to the well and peered down.  Where did you come from?    From Craster’s,  the girl said.  Are you the one?   Jojen turned to look at her.  The one?    He said that Sam wasn’t the one,  she explained.  There was someone else, he said. The one he was sent to find.    Who said?  Bran demanded.   Coldhands,  Gilly answered softly.  Meera peeled back one end of her net, and the fat man managed to sit up. He was shaking, Bran saw, and still struggling to catch his breath.  He said there would be people,  he huffed.  People in the castle. I didn’t know you’d be right at the top of the steps, though. I didn’t know you’d throw a net on me or stab me in the stomach.  He touched his belly with a black-gloved hand.  Am I bleeding? I can’t see.    It was just a poke to get you off your feet,  said Meera.  Here, let me have a look.  She went to one knee, and felt around his navel.  You’re wearing mail. I never got near your skin.    Well, it hurt all the same,  Sam complained.   Are you really a brother of the Night’s Watch?  Bran asked.  The fat man’s chins jiggled when he nodded. His skin looked pale and saggy.  Only a steward. I took care of Lord Mormont’s ravens.  For a moment he looked like he was going to cry.  I lost them at the Fist, though. It was my fault. I got us lost too. I couldn’t even find the Wall. It’s a hundred leagues long and seven hundred feet high and I couldn’t find it!    Well, you’ve found it now,  said Meera.  Lift your rump off the ground, I want my net back.    How did you get through the Wall?  Jojen demanded as Sam struggled to his feet.  Does the well lead to an underground river, is that where you came from? You’re not even wet…    There’s a gate,  said fat Sam.  A hidden gate, as old as the Wall itself. The Black Gate, he called it.   The Reeds exchanged a look.  We’ll find this gate at the bottom of the well?  asked Jojen.  Sam shook his head.  You won’t. I have to take you.    Why?  Meera demanded.  If there’s a gate…    You won’t find it. If you did it wouldn’t open."
}