{
  "id": "a188f6439ca703eb9362946275c5ce314dc21ab5",
  "text": " Such ground made for slow riding, but offered easy concealment for those wishing to approach the Wall unseen.  For wildling raiders, he thought. Like us. Like me.  Beyond that Wall lay the Seven Kingdoms, and everything he had sworn to protect. He had said the words, had pledged his life and honor, and by rights he should be up there standing sentry. He should be raising a horn to his lips to rouse the Night’s Watch to arms. He had no horn, though. It would not be hard to steal one from the wildlings, he suspected, but what would that accomplish? Even if he blew it, there was no one to hear. The Wall was a hundred leagues long and the Watch sadly dwindled. All but three of the strongholds had been abandoned; there might not be a brother within forty miles of here, but for Jon. If he was a brother still…  I should have tried to kill Mance Rayder on the Fist, even if it meant my life. That was what Qhorin Halfhand would have done. But Jon had hesitated, and the chance passed. The next day he had ridden off with Styr the Magnar, Jarl, and more than a hundred picked Thenns and raiders. He told himself that he was only biding his time, that when the moment came he would slip away and ride for Castle Black. The moment never came. They rested most nights in empty wildling villages, and Styr always set a dozen of his Thenns to guard the horses. Jarl watched him suspiciously. And Ygritte was never far, day or night.  Two hearts that beat as one. Mance Rayder’s mocking words rang bitter in his head. Jon had seldom felt so confused. I have no choice, he’d told himself the first time, when she slipped beneath his sleeping skins. If I refuse her, she will know me for a turncloak. I am playing the part the Halfhand told me to play.  His body had played the part eagerly enough. His lips on hers, his hand sliding under her doeskin shirt to find a breast, his manhood stiffening when she rubbed her mound against it through their clothes. My vows, he’d thought, remembering the weirwood grove where he had said them, the nine great white trees in a circle, the carved red faces watching, listening. But her fingers were undoing his laces and her tongue was in his mouth and her hand slipped inside his smallclothes and brought him out, and he could not see the weirwoods anymore, only her. She bit his neck and he nuzzled hers, burying his nose in her thick red hair. Lucky, he thought, she is lucky, fire-kissed.  Isn’t that good?  she whispered as she guided him inside her. She was sopping wet down there, and no maiden, that was plain, but Jon did not care. His vows, her maidenhood, none of it mattered, only the heat of her, the mouth on his, the finger that pinched at his nipple.  Isn’t that sweet?  she said again.  Not so fast, oh, slow, yes, like that. There now, there now, yes, sweet, sweet. You know nothing, Jon Snow, but I can show you. Harder now. Yessss.   A part, he tried to remind himself afterward. I am playing a part. I had to do it once, to prove I’d abandoned my vows. I had to make her trust me. It need never happen again. He was still a man of the Night’s Watch, and a son of Eddard Stark. He had done what needed to be done, proved what needed to be proven.  The proving had been so sweet, though, and Ygritte had gone to sleep beside him with her head against his chest, and that was sweet as well, dangerously sweet. He thought of the weirwoods again, and the words he’d said before them. It was only once, and it had to be. Even my father stumbled once, when he forgot his marriage vows and sired a bastard. Jon vowed to himself that it would be the same with him. It will never happen again.  It happened twice more that night, and again in the morning, when she woke to find him hard. The wildlings were stirring by then, and several could not help but notice what was going on beneath the pile of furs. Jarl told them to be quick about it, before he had to throw a pail of water over them. Like a pair of rutting dogs, Jon thought afterward. Was that what he’d become? I am a man of the Night’s Watch, a small voice inside insisted, but every night it seemed a little fainter, and when Ygritte kissed his ears or bit his neck, he could not hear it at all. Was this how it was for my father? he wondered. Was he as weak as I am, when he dishonored himself in my mother’s bed?  Something was coming up the hill behind him, he realized suddenly. For half a heartbeat he thought it might be Ghost come back, but the direwolf never made so much noise. Jon drew Longclaw in a single smooth motion, but it was only one of the Thenns, a broad man in a bronze helm.  Snow,  the intruder said.  Come. Magnar wants.  The men of Thenn spoke the Old Tongue, and most had only a few words of the Common.  Jon did not much care what the Magnar wanted, but there was no use arguing with someone who could scarcely understand him, so he followed the man back down the hill.  The mouth of the cave was a cleft in the rock barely wide enough for a horse, half concealed behind a soldier pine."
}