{
  "id": "a1e47625a1991ee5ca43ba4e3a9f57eb67547d5e",
  "text": " I will  not deceive  you: when I heard that Shadowfax had  come  back  riderless, I rejoiced at the return of the horse, but still more at the lack   of the rider; and when Jomer brought the  tidings that you  had gone at last  to your long home, I did not mourn. But news from afar is seldom sooth. Here  you  come  again! And with you come  evils  worse  than before, as  might be  expected. Why should I welcome you, Gandalf Stormcrow? Tell me that.'  Slowly   he sat down again in his cha ir.       'You speak justly, lord,'  said the pale man sitting upon the steps  of  the  dais. 'It is not  yet five  days since  the  bitter  tidings  came that  Thjodred your son was slain upon  the West  Marches: your right hand, Second  Marshal Of the Mark. In Jomer  there  is little trust. Few men would be left   to guard your walls, if  he had been allowed to rule.  And even now we learn  from Gondor that the Dark Lord is stirring in the East. Such  is the hour in  which this wanderer chooses to return. Why indeed  should  we  welcome  you,  Master Stormcrow?  Lbthspell I  name you,  Ill-news; and ill news is  an ill  guest they say.' He laughed grimly, as he lifted his heavy lids for a moment  and gazed on the strangers with dark eyes.    ####-     'You are  held wise, my friend Wormtongue,  and are  doubtless a  great  support to your master,' answered Gandalf in a soft voice. 'Yet in two  ways  may a man  come with evil tidings. lie may be a worker of evil; or he may be  such as leaves well alone, and comes only to bring aid in time of need.'       'That  is so,' said Wormtongue; 'but there is a  third kind: pickers of  bones, meddlers in other men's sorrows, carrion-fowl  that grow fat  on war.  What aid have you ever brought, Stormcrow? And what aid do you bring now?  It  was  aid from  us that you sought last time that you were here. Then my lord  bade you  Choose any horse that you would and be gone; and  to the wonder of  all you took Shadowfax in your insolence. My lord was sorely grieved; yet to  some it seemed that to speed you from the land the price was not  too great.  I guess that it is  likely to turn out the same once more: you will seek aid  rather than  render  it. Do  you  bring men?  Do you bring  horses,  swords,   spears? That I  would call aid; that is our present need. But  who are these  that  follow at your tail? Three ragged wanderers in grey,  and you yourself  the most beggar-like of the four!'       'The courtesy of your hall is somewhat lessened of late, Thjoden son of  Thengel,' said  Gandalf. 'Has not the  messenger from your gate reported the  names of my companions? Seldom  has any lord of  Rohan received  three   such  guests. Weapons they have  laid at your doors  that  are worth many a mortal  man, even the mightiest. Grey is their raiment, for the Elves clad them, and  thus they have passed through the shadow of great perils to your hall.'       'Then it  is true, as  Jomer reported, that  you are in league with the  Sorceress of the Golden Wood?'  said Wormtongue. 'It  is not  to be wondered  at: webs of deceit were ever woven in Dwimordene.'       Gimli  strode  a pace forward, but felt  suddenly  the hand  of Gandalf  clutch him by the shoulder, and he halted, standing stiff as stone.       In Dwimordene, in Lurien       Seldom have walked the feet of Men,       Few mortal eyes have seen the light       That lies there ever, long and bright.       Galadriel! Galadriel!       Clear is the water of your well;       White is the star in your white hand;       Unmarred, unstained is leaf and land   ####-     In Dwimordene, in Lurien       More fair than thoughts of Mortal Men.       Thus Gandalf softly  sang, and then suddenly  he changed.  Casting  his  tattered cloak aside, he stood up and leaned  no longer on his staff; and he  spoke in a clear cold voice.  'The wise speak only  of what they know, Grnma  son of Gblmud. A witless worm have you become. Therefore be silent, and  keep  your forked tongue behind  your  teeth.  I  have not passed through fire and  death to bandy crooked words  with a serving-man till the  lightning falls.'  He raised his staff.  There was a roll of thunder. The  sunlight was blotted  out from the eastern  windows; the whole hall became suddenly dark as night.  The fire faded to sullen embers. Only Gandalf could be seen,  standing white  and tall before the blackened hearth.       In the gloom they heard  the hiss  of  Wormtongue's voice:  'Did I  not  counsel you, lord, to forbid  his  staff? That fool, Hbma, has betrayed us!'  There was  a flash as if lightning had cloven the roof. Then all was silent.  Wormtongue sprawled on his face.       'Now Thjoden son of Thengel, will you hearken to me?' said Gandalf. 'Do  you ask for help?' He lifted his staff and pointed to a  high  window. There  the darkness  seemed  to clear, and  through the opening could be seen, high  and far, a patch of shining sky. 'Not all is dark. Take courage, Lord of the  Mark; for better help you will not  find."
}