{
  "id": "a1f0a600a2a8f008a68c9d756f8906ba5060b78a",
  "text": " I won’t let them take us, she vowed silently, reaching back over her shoulder to touch the hilt of the sword that Gendry had stolen for her. I won’t.  Late that afternoon, they emerged from beneath the trees and found themselves on the banks of a river. Hot Pie gave a whoop of delight.  The Trident! Now all we have to do is go upstream, like you said. We’re almost there!   Arya chewed her lip.  I don’t think this is the Trident.  The river was swollen by the rain, but even so it couldn’t be much more than thirty feet across. She remembered the Trident as being much wider.  It’s too little to be the Trident,  she told them,  and we didn’t come far enough.    Yes we did,  Hot Pie insisted.  We rode all day, and hardly stopped at all. We must have come a long way.    Let’s have a look at that map again,  said Gendry.  Arya dismounted, took out the map, unrolled it. The rain pattered against the sheepskin and ran off in rivulets.  We’re someplace here, I think,  she said, pointing, as the boys peered over her shoulders.   But,  said Hot Pie,  that’s hardly any ways at all. See, Harrenhal’s there by your finger, you’re almost touching it. And we rode all day!    There’s miles and miles before we reach the Trident,  she said.  We won’t be there for days. This must be some different river, one of these, see.  She showed him some of the thinner blue lines the mapmaker had painted in, each with a name painted in flne script beneath it.  The Darry, the Greenapple, the Maiden… here, this one, the Little Willow, it might be that.   Hot Pie looked from the line to the river.  It doesn’t look so little to me.   Gendry was frowning as well.  The one you’re pointing at runs into that other one, see.    The Big Willow,  she read.   The Big Willow, then. See, and the Big Willow runs into the Trident, so we could follow the one to the other, but we’d need to go downstream, not up. Only if this river isn’t the Little Willow, if it’s this other one here…    Rippledown Rill,  Arya read.   See, it loops around and flows down toward the lake, back to Harrenhal.  He traced the line with a finger.  Hot Pie’s eyes grew wide.  No! They’ll kill us for sure.    We have to know which river this is,  declared Gendry, in his stubbornest voice.  We have to know.    Well, we don’t.  The map might have names written beside the blue lines, but no one had written a name on the riverbank.  We won’t go up or downstream,  she decided, rolling up the map.  We’ll cross and keep going north, like we were.    Can horses swim?  asked Hot Pie.  It looks deep, Arry. What if there are snakes?    Are you sure we’re going north?  asked Gendry.  All these hills… if we got turned around…    The moss on the trees—   He pointed to a nearby tree.  That tree’s got moss on three sides, and that next one has no moss at all. We could be lost, just riding around in a circle.    We could be,  said Arya,  but I’m going to cross the river anyway. You can come or you can stay here.  She climbed back into the saddle, ignoring the both of them. If they didn’t want to follow, they could find Riverrun on their own, though more likely the Mummers would just find them.  She had to ride a good half mile along the bank before she finally found a place where it looked as though it might be safe to cross, and even then her mare was reluctant to enter the water. The river, whatever its name, was running brown and fast, and the deep part in the middle came up past the horse’s belly. Water filled her boots, but she pressed in her heels all the same and climbed out on the far bank. From behind she heard splashing, and a mare’s nervous whinny. They followed, then. Good. She turned to watch as the boys struggled across and emerged dripping beside her.  It wasn’t the Trident,  she told them.  It wasn’t.   The next river was shallower and easier to ford. That one wasn’t the Trident either, and no one argued with her when she told them they would cross it.  Dusk was settling as they stopped to rest the horses once more and share another meal of bread and cheese.  I’m cold and wet,  Hot Pie complained.  We’re a long way from Harrenhal now, for sure. We could have us a fire—    NO!  Arya and Gendry both said, at the exact same instant. Hot Pie quailed a little. Arya gave Gendry a sideways look. He said it with me, like Jon used to do, back in Winterfell. She missed Jon Snow the most of all her brothers.   Could we sleep at least?  Hot Pie asked.  I’m so tired, Arry, and my arse is sore. I think I’ve got blisters.    You’ll have more than that if you’re caught,  she said.  We’ve got to keep going. We’ve got to.    But it’s almost dark, and you can’t even see the moon.    Get back on your horse.   Plodding along at a slow walking pace as the light faded around them, Arya found her own exhaustion weighing heavy on her. She needed sleep as much as Hot Pie, but they dare not. If they slept, they might open their eyes to find Vargo Hoat standing over them with Shagwell the Fool and Faithful Urswyck and Rorge and Biter and Septon Utt and all his other monsters."
}