{
  "id": "a2454f21f0d32ecf46b7bfd78eb47a6bef3aa49e",
  "text": "  There was also, of course, Mrs. Weasley's usual package, including a new sweater (green, with a picture of a dragon on it - Harry supposed Charlie had told her all about the Horntail), and a large quantity of homemade mince pies. Harry and Ron met up with Hermione in the common room, and they went down to breakfast together.  They spent most of the morning in Gryffindor Tower, where everyone was enjoying their presents, then returned to the Great Hall for a magnificent lunch, which included at least a hundred turkeys and Christmas puddings, and large piles of Cribbage's Wizarding Crackers. They went out onto the grounds in the afternoon; the snow was untouched except for the deep channels made by the Durmstrang and Beauxbatons students on their way up to the castle.  Hermione chose to watch Harry and the Weasleys' snowball fight rather than join in, and at five o'clock said she was going back upstairs to get ready for the ball. \"What, you need three hours?\"  said Ron, looking at her incredulously and paying for his lapse in concentration when a large snowball, thrown by George, hit him hard on the side of the head.  \"Who're you going with?\"  he yelled after Hermione, but she just waved and disappeared up the stone steps into the castle. There was no Christmas tea today, as the ball included a feast, so at seven o'clock, when it had become hard to aim properly, the others abandoned their snowball fight and trooped back to the common room. The Fat Lady was sitting in her frame with her friend Violet from downstairs, both of them extremely tipsy, empty boxes of chocolate liqueurs littering the bottom other picture. \"Lairy fights, that's the one!\"  she giggled when they gave the password, and she swung forward to let them inside. Harry, Ron, Seamus, Dean, and Neville changed into their dress robes up in their dormitory, all of them looking very self-conscious, but none as much as Ron, who surveyed himself in the long mirror in the corner with an appalled look on his face.  There was just no getting around the fact that his robes looked more like a dress than anything else.  In a desperate attempt to make them look more manly, he used a Severing Charm on the ruff and cuffs.  It worked fairly well; at least he was now lace-free, although he hadn't done a very neat job, and the edges still looked depressingly frayed as the boys set off downstairs. \"I still can't work out how you two got the best-looking girls in the year,\" muttered Dean. \"Animal magnetism,\" said Ron gloomily, pulling stray threads out of his cuffs. The common room looked strange, full of people wearing different colors instead of the usual mass of black.  Parvati was waiting for Harry at the foot of the stairs.  She looked very pretty indeed, in robes of shocking pink, with her long dark plait braided with gold, and gold bracelets glimmering at her wrists.  Harry was relieved to see that she wasn't giggling. \"You - er - look nice,\" he said awkwardly. \"Thanks,\" she said. \"Padma's going to meet you in the entrance hall,\" she added to Ron. \"Right,\" said Ron, looking around. \"Where's Hermione?\" Parvati shrugged. \"Shall we go down then, Harry?\" \"Okay,\" said Harry, wishing he could just stay in the common room.  Fred winked at Harry as he passed him on the way out of the portrait hole. The entrance hall was packed with students too, all milling around waiting for eight o'clock, when the doors to the Great Hall would be thrown open.  Those people who were meeting partners from different Houses were edging through the crowd trying to find one another.  Parvati found her sister, Padma, and led her over to Harry and Ron. \"Hi,\" said Padma, who was looking just as pretty as Parvati in robes of bright turquoise. She didn't look too enthusiastic about having Ron as a partner, though; her dark eyes lingered on the frayed neck and sleeves of his dress robes as she looked him up and down. \"Hi,\" said Ron, not looking at her, but staring around at the crowd. \"Oh no ...\" He bent his knees slightly to hide behind Harry, because Fleur Delacour was passing, looking stunning in robes of silver-gray satin, and accompanied by the Ravenclaw Quidditch captain, Roger Davies. When they had disappeared, Ron stood straight again and stared over the heads of the crowd. \"Where is Hermione?\" he said again. A group of Slytherins came up the steps from their dungeon common room.  Malfoy was in front; he was wearing dress robes of black velvet with a high collar, which in Harry's opinion made him look like a vicar.  Pansy Parkinson in very frilly robes of pale pink was clutching Malfoy's arm.  Crabbe and Goyle were both wearing green; they resembled moss-colored boulders, and neither of them, Harry was pleased to see, had managed to find a partner. The oak front doors opened, and everyone turned to look as the Durmstrang students entered with Professor Karkaroff.  Krum was at the front of the party, accompanied by a pretty girl in blue robes Harry didn't know.  Over their heads he saw that an area of lawn right in front of the castle had been transformed into a sort of grotto full of fairy lights - meaning hundreds of actual living fairies were sitting in the rosebushes that had been conjured there, and fluttering over the statues of what seemed to be Father Christmas and his reindeer."
}