{
  "id": "a2f4513a41beb91297b8e2d48bcf337d6cbc4ac7",
  "text": " Ned sat beside her for a while.  Lady,  he said, tasting the name. He had never paid much attention to the names the children had picked, but looking at her now, he knew that Sansa had chosen well. She was the smallest of the litter, the prettiest, the most gentle and trusting. She looked at him with bright golden eyes, and he ruffled her thick grey fur.  Shortly, Jory brought him Ice.  When it was over, he said,  Choose four men and have them take the body north. Bury her at Winterfell.    All that way?  Jory said, astonished.   All that way,  Ned affirmed.  The Lannister woman shall never have this skin.   He was walking back to the tower to give himself up to sleep at last when Sandor Clegane and his riders came pounding through the castle gate, back from their hunt.  There was something slung over the back of his destrier, a heavy shape wrapped in a bloody cloak.  No sign of your daughter, Hand,  the Hound rasped down,  but the day was not wholly wasted. We got her little pet.  He reached back and shoved the burden off, and it fell with a thump in front of Ned.  Bending, Ned pulled back the cloak, dreading the words he would have to find for Arya, but it was not Nymeria after all. It was the butcher’s boy, Mycah, his body covered in dried blood. He had been cut almost in half from shoulder to waist by some terrible blow struck from above.   You rode him down,  Ned said.  The Hound’s eyes seemed to glitter through the steel of that hideous dog’s-head helm.  He ran.  He looked at Ned’s face and laughed.  But not very fast.       BRAN  It seemed as though he had been falling for years.  Fly, a voice whispered in the darkness, but Bran did not know how to fly, so all he could do was fall.  Maester Luwin made a little boy of clay, baked him till he was hard and brittle, dressed him in Bran’s clothes, and flung him off a roof. Bran remembered the way he shattered.  But I never fall,  he said, falling.  The ground was so far below him he could barely make it out through the grey mists that whirled around him, but he could feel how fast he was falling, and he knew what was waiting for him down there. Even in dreams, you could not fall forever. He would wake up in the instant before he hit the ground, he knew. You always woke up in the instant before you hit the ground.  And if you don’t? the voice asked.  The ground was closer now, still far far away, a thousand miles away, but closer than it had been. It was cold here in the darkness. There was no sun, no stars, only the ground below coming up to smash him, and the grey mists, and the whispering voice. He wanted to cry.  Not cry. Fly.   I can’t fly,  Bran said.  I can’t, I can’t…   How do you know? Have you ever tried?  The voice was high and thin. Bran looked around to see where it was coming from. A crow was spiraling down with him, just out of reach, following him as he fell.  Help me,  he said.  I’m trying, the crow replied. Say, got any corn?  Bran reached into his pocket as the darkness spun dizzily around him. When he pulled his hand out, golden kernels slid from between his fingers into the air. They fell with him.  The crow landed on his hand and began to eat.   Are you really a crow?  Bran asked.  Are you really falling? the crow asked back.   It’s just a dream,  Bran said.  Is it? asked the crow.   I’ll wake up when I hit the ground,  Bran told the bird.  You’ll die when you hit the ground, the crow said. It went back to eating corn.  Bran looked down. He could see mountains now, their peaks white with snow, and the silver thread of rivers in dark woods. He closed his eyes and began to cry.  That won’t do any good, the crow said. I told you, the answer is flying, not crying. How hard can it be? I’m doing it. The crow took to the air and flapped around Bran’s hand.   You have wings,  Bran pointed out.  Maybe you do too.  Bran felt along his shoulders, groping for feathers.  There are different kinds of wings, the crow said.  Bran was staring at his arms, his legs. He was so skinny, just skin stretched taut over bones. Had he always been so thin? He tried to remember. A face swam up at him out of the grey mist, shining with light, golden.  The things I do for love,  it said.  Bran screamed.  The crow took to the air, cawing. Not that, it shrieked at him. Forget that, you do not need it now, put it aside, put it away. It landed on Bran’s shoulder, and pecked at him, and the shining golden face was gone.  Bran was falling faster than ever. The grey mists howled around him as he plunged toward the earth below.  What are you doing to me?  he asked the crow, tearful.  Teaching you how to fly.   I can’t fly!   You’re flying tight now.   I’m falling!   Every flight begins with a fall, the crow said. Look down.   I’m afraid…   LOOK DOWN!  Bran looked down, and felt his insides turn to water. The ground was rushing up at him now. The whole world was spread out below him, a tapestry of white and brown and green. He could see everything so clearly that for a moment he forgot to be afraid."
}