{
  "id": "a31e9ba61a0cc1998323dafe410f7618b61553b0",
  "text": " You are not to be killed, if that is what you fear. It’s still my intent to send you to the Wall, but I could not do it without Lord Tyrell’s consent. Put down the crossbow and we will go back to my chambers and talk of it.    We can talk here just as well. Perhaps I don’t choose to go to the Wall, Father. It’s bloody cold up there, and I believe I’ve had enough coldness from you. So just tell me something, and I’ll be on my way. One simple question, you owe me that much.    I owe you nothing.    You’ve given me less than that, all my life, but you’ll give me this. What did you do with Tysha?    Tysha?   He does not even remember her name.  The girl I married.    Oh, yes. Your first whore.   Tyrion took aim at his father’s chest.  The next time you say that word, I’ll kill you.    You do not have the courage.    Shall we find out? It’s a short word, and it seems to come so easily to your lips.  Tyrion gestured impatiently with the bow.  Tysha. What did you do with her, after my little lesson?    I don’t recall.    Try harder. Did you have her killed?   His father pursed his lips.  There was no reason for that, she’d learned her place… and had been well paid for her day’s work, I seem to recall. I suppose the steward sent her on her way. I never thought to inquire.    On her way where?    Wherever whores go.   Tyrion’s finger clenched. The crossbow whanged just as Lord Tywin started to rise. The bolt slammed into him above the groin and he sat back down with a grunt. The quarrel had sunk deep, right to the fletching. Blood seeped out around the shaft, dripping down into his pubic hair and over his bare thighs.  You shot me,  he said incredulously, his eyes glassy with shock.   You always were quick to grasp a situation, my lord,  Tyrion said.  That must be why you’re the Hand of the King.    You… you are no… no son of mine.    Now that’s where you’re wrong, Father. Why, I believe I’m you writ small. Do me a kindness now, and die quickly. I have a ship to catch.   For once, his father did what Tyrion asked him. The proof was the sudden stench, as his bowels loosened in the moment of death. Well, he was in the right place for it, Tyrion thought. But the stink that filled the privy gave ample evidence that the oft-repeated jape about his father was just another lie.  Lord Tywin Lannister did not, in the end, shit gold.      Samwell   The king was angry. Sam saw that at once.  As the black brothers entered one by one and knelt before him, Stannis shoved away his breakfast of hardbread, salt beef, and boiled eggs, and eyed them coldly. Beside him, the red woman Melisandre looked as if she found the scene amusing.  I have no place here, Sam thought anxiously, when her red eyes fell upon him. Someone had to help Maester Aemon up the steps. Don’t look at me, I’m just the maester’s steward. The others were contenders for the Old Bear’s command, all but Bowen Marsh, who had withdrawn from the contest but remained castellan and Lord Steward. Sam did not understand why Melisandre should seem so interested in him.  King Stannis kept the black brothers on their knees for an extraordinarily long time.  Rise,  he said at last. Sam gave Maester Aemon his shoulder to help him back up.  The sound of Lord Janos Slynt clearing his throat broke the strained silence.  Your Grace, let me say how pleased we are to be summoned here. When I saw your banners from the Wall, I knew the realm was saved. ‘There comes a man who neer forgets his duty,’ I said to good Ser Alliser. ‘A strong man, and a true king.’ May I congratulate you on your victory over the savages? The singers will make much of it, I know—    The singers may do as they like,  Stannis snapped.  Spare me your fawning, Janos, it will not serve you.  He rose to his feet and frowned at them all.  Lady Melisandre tells me that you have not yet chosen a Lord Commander. I am displeased. How much longer must this folly last?    Sire,  said Bowen Marsh in a defensive tone,  no one has achieved two-thirds of the vote yet. It has only been ten days.    Nine days too long. I have captives to dispose of, a realm to order, a war to fight. Choices must be made, decisions that involve the Wall and the Night’s Watch. By rights your Lord Commander should have a voice in those decisions.    He should, yes,  said Janos Slynt.  But it must be said. We brothers are only simple soldiers. Soldiers, yes! And Your Grace will know that soldiers are most comfortable taking orders. They would benefit from your royal guidance, it seems to me. For the good of the realm. To help them choose wisely.   The suggestion outraged some of the others.  Do you want the king to wipe our arses for us too?  said Cotter Pyke angrily.  The choice of a Lord Commander belongs to the Sworn Brothers, and to them alone,  insisted Ser Denys Mallister.  If they choose wisely they won’t be choosing me,  moaned Dolorous Edd. Maester Aemon, calm as always, said,  Your Grace, the Night’s Watch has been choosing its own leader since Brandon the Builder raised the Wall."
}