{
  "id": "a35bb93993cf3cdfc89d31dde46e93eada573cdd",
  "text": "       Gandalf, however,  disbelieved Bilbo's first story, as soon as he heard  it,  and he continued  to be very curious about the ring. Eventually he  got  the true  tale  out  of  Bilbo  after much questioning,  which for  a  while  strained  their  friendship;  but  the  wizard seemed  to  think  the  truth  important. Though he did not say so to Bilbo, he also thought  it important,  and disturbing, to find that the good hobbit had not told the truth from the  first:  quite contrary to his  habit. The idea of a 'present' was  not  mere  hobbitlike  invention,  all the  same.  It was  suggested  to Bilbo,  as  he  confessed, by Gollum's talk that he overheard; for Gollum did, in fact, call  the  ring  his 'birthday  present', many times.  That also  Gandalf  thought  strange and suspicious; but he did not discover the truth in  this point for   many more years, as will be seen in this book.       Of  Bilbo's  later adventures little  more need be said here. Wi th  the  help of the ring he escaped from the orc-guards at the gate and rejoined his  companions. He  used the ring many times on his  quest, chiefly for the help  of his  friends; but  he kept it secret from them as long as he could. After    ####-his return to his home he never spoke  of  it  again to anyone, save Gandalf  and Frodo;  and no one else  in the  Shire knew of its  existence,  or so he  believed. Only to Frodo did he show  the account of  his Journey that he was  writing.       His  sword,  Sting, Bilbo hu ng  over his  fireplace,  and  his coat  of  marvellous mail, the gift of the Dwarves from the Dragon-hoard, he lent to a   museum, to the Michel Delving Mathom-house in fact. But he kept in a  drawer   at Bag  End  the old cloak and hood that he had worn on his travels; and the   ring, secured by a fine chain, remained in his pocket.       He returned to his home at Bag End on June the 22nd in his fifty-second  year (S.R. 1342),  and nothing very notable occurred in the  Shire until Mr.  Baggins    began    the   pr eparations   for   the   celebration   of    his  hundred-and-eleventh birthday  (S.R.  1401).  At  this  point  this  History  begins.   ####-   NOTE ON THE SHIRE RECORDS            At the end of the Third Age the part played by the Hobbits in the great  events that led  to  the  inclusion  of  the Shire  in the  Reunited Kingdom  awakened among them a  more widespread  interest in  their own  history; and  many of their traditions, up to that time still  mainly oral, were collected  and Written down. The  greater families were  also concerned with  events in  the  Kingdom  at  large,  and  many  of  their members  studied its  ancient  histories and  legends. By the  end of the  first century of the Fourth  Age  there were already to be found in the Shire several libraries tha t contained  many historical books and records.       The largest of these collections were probably at Undertowers, at Great  Smials,  and at Brandy Hall.  This  account of the end of  the Third  Age is  drawn mainly from the Red Book of Westmarch. That most important  source  for  the  history  of  the War  of  the Ring was so  called because it  was  long  preserved  at  Undertowers,  the  home  of the Fairbairns,  Wardens  of  the  Westmarch.1  It was in origin Bilbo's private diary, which he took with  him  to Rivendell.  Frodo brought  it back to the Shire, together with many loose  leaves of notes, and during S.R. 1420-1 he nearly filled its pages  with his  account of the War.  But annexed to  it  and preserved with it, probably m a   single red case, were  the three large  volumes, bound in  red leather, that  Bilbo gave  to him as a parting gift. To these four  volumes there was added   in Westmarch a fifth containing commentaries, genealogies, and various other   matter concerning the hobbit members of the Fellowship.       The original Red Book has  not been  preserved, but  many  copies  were  made,  especially of the first volume, for the use of the descendants of the  children  of  Master  Samwise.  The  most  important  copy, however,  has  a   different history.  It  was kept at  Great  Smials,  but it  was written  in  Condor,  probably at  the  request  of the  great-grandson  of Peregrin, and  completed in S.R. 1592  (F.A. 172). Its southern scribe appended this  note:  Findegil,  King's Writer, finished this work in IV 172. It  is an exact copy  in  all details of the Thain's Book  m Minas Tirith.  That book was  a copy,  made at the request of King Elessar,  of the Red Book of the Periannath, and   ####-was brought to him by the Thain Peregrin when he retired to Gondor in IV 64 .       The Thain's Book was  thus  the first copy made of  the  Red  Book  and  contained much that was later omitted or lost.  In Minas  Tirith it received  much  annotation, and  many  corrections, especially  of  names,  words, and  quotations in the Elvish languages; and there was added to it an abbreviated   version of those  parts of The  Tale of Aragorn  and Arwen which lie outside  the  account of the War."
}