{
  "id": "a5f82809b32e6616d02481be5ab19d68cc329e80",
  "text": "  .136 \"Very amusing,\" said Nearly Headless Nick darkly. \"Don't mind Nick!\" shouted Sir Patrick's head from the floor. \"Still upset we won't let him join the Hunt! But I mean to say - look at the fellow -\" \"I think,\" said Harry hurriedly, at a meaningful look from Nick, \"Nick's very - frightening and - er -\" \"Ha!\" yelled Sir Patrick's head. \"Bet he asked you to say that!\" \"If I could have everyone's attention, it's time for my speech!\" said Nearly Headless Nick loudly, striding toward the podium and climbing into an icy blue spotlight. \"My late lamented lords, ladies, and gentlemen, it is my great sorrow . . .\" But nobody heard much more. Sir Patrick and the rest of the Headless Hunt had just started a game of Head Hockey and the crowd were turning to watch. Nearly Headless Nick tried vainly to recapture his audience, but gave up as Sir Patrick's head went sailing past him to loud cheers. Harry was very cold by now, not to mention hungry. \"I can't stand much more of this,\" Ron muttered, his teeth chattering, as the orchestra ground back into action and the ghosts swept back onto the dance floor. \"Let's go,\" Harry agreed. They backed toward the door, nodding and beaming at anyone who looked at them, and a minute later were hurrying back up the passageway full of black candles. \"Pudding might not be finished yet,\" said Ron hopefully, leading the way toward the steps to the entrance hall.  .137 And then Harry heard it. \". . . rip . . . tear . . . kill . . .\" It was the same voice, the same cold, murderous voice he had heard in Lockhart's office. He stumbled to a halt, clutching at the stone wall, listening with all his might, looking around, squinting up and down the dimly lit passageway. \"Harry, what're you -?\" \"It's that voice again - shut up a minute -\" \". . . soo hungry . . . for so long . . .\" \"Listen!\" said Harry urgently, and Ron and Hermione froze, watching him. \". . . kill . . . time to kill . . .\" The voice was growing fainter. Harry was sure it was moving away - moving upward. A mixture of fear and excitement gripped him as he stared at the dark ceiling; how could it be moving upward? Was it a phantom, to whom stone ceilings didn't matter? \"This way,\" he shouted, and he began to run, up the stairs, into the entrance hall. It was no good hoping to hear anything here, the babble of talk from the Halloween feast was echoing out of the Great Hall. Harry sprinted up the marble staircase to the first floor, Ron and Hermione clattering behind him. \"Harry, what're we -\" \"SHH!\"  .138 Harry strained his ears. Distantly, from the floor above, and growing fainter still, he heard the voice: \". . . I smell blood. . . . I SMELL BLOOD!\" His stomach lurched - \"It's going to kill someone!\" he shouted, and ignoring Ron's and Hermione's bewildered faces, he ran up the next flight of steps three at a time, trying to listen over his own pounding footsteps - Harry hurtled around the whole of the second floor, Ron and Hermione panting behind him, not stopping until they turned a corner into the last, deserted passage. \"Harry, what was that all about?\" said Ron, wiping sweat off his face. \"I couldn't hear anything. . . .\" But Hermione gave a sudden gasp, pointing down the corridor. \"Look!\" Something was shining on the wall ahead. They approached slowly, squinting through the darkness. Foot-high words had been daubed on the wall between two windows, shimmering in the light cast by the flaming torches. the chamber of secrets has been opened. enemies of the heir, beware. \"What's that thing - hanging underneath?\" said Ron, a slight quiver in his voice. As they edged nearer, Harry almost slipped - there was a large puddle of water on the floor; Ron and Hermione grabbed him, and they inched toward the message, eyes fixed on a dark shadow beneath it. All three of them realized what it was at once, and leapt backward with a splash..Mrs. Norris,    the caretaker's cat, was hanging by her tail from the torch bracket. She was stiff as a board, her eyes wide and staring. For a few seconds, they didn't move. Then Ron said, \"Let's get out of here.\" \"Shouldn't we try and help -\" Harry began awkwardly. \"Trust me,\" said Ron. \"We don't want to be found here.\" But it was too late. A rumble, as though of distant thunder, told them that the feast had just ended. From either end of the corridor where they stood came the sound of hundreds of feet climbing the stairs, and the loud, happy talk of well-fed people; next moment, students were crashing into the passage from both ends. The chatter, the bustle, the noise died suddenly as the people in front spotted the hanging cat. Harry, Ron, and Hermione stood alone, in the middle of the corridor, as silence fell among the mass of students pressing forward to see the grisly sight. Then someone shouted through the quiet. \"Enemies of the Heir, beware! You'll be next, Mudbloods!\" It was Draco Malfoy. He had pushed to the front of the crowd, his cold eyes alive, his usually bloodless face flushed, as he grinned at the sight of the hanging, immobile cat."
}