{
  "id": "a66fc11d2bf9fd1d234be5fcffb9ce74df337607",
  "text": "...were they talking about Neville's parents?\" Dumbledore gave Harry a very sharp look. \" Has Neville never told you why he has been brought up by his grandmother?\" he said. Harry shook his head, wondering, as he did so, how he could have failed to ask Neville this, in almost four years of knowing him. \"Yes, they were talking about Nevilles parents,\" said Dumbledore.  \"His father, Frank, was an Auror just like Professor Moody.  He and his wife were tortured for information about Voldemort's whereabouts after he lost his powers, as you heard.\" \"So they're dead?\" said Harry quietly. \"No,\" said Dumbledore, his voice full of a bitterness Harry had never heard there before.  \"They are insane.  They are both in St. Mungo's Hospital for Magical Maladies and Injuries.  I believe Neville visits them, with his grandmother, during the holidays.  They do not recognize him.\" Harry sat there, horror-struck. He had never known . . . never, in four years, bothered to find out. . . \"The Longbottoms were very popular,\" said Dumbledore.  \"The attacks on them came after Voldemort's fall from power, just when everyone thought they were safe.  Those attacks caused a wave of fury such as I have never known.  The Ministry was under great pressure to catch those who had done it.  Unfortunately, the Longbottoms' evidence was - given their condition - none too reliable.\" \"Then Mr. Crouch's son might not have been involved?\" said Harry slowly. Dumbledore shook his head. \"As to that, I have no idea.\" Harry sat in silence once more, watching the contents of the Pensieve swirl.  There were two more questions he was burning to ask . . . but they concerned the guilt of living people. . . . \"Er,\" he said, \"Mr. Bagman . ..\" \"... has never been accused of any Dark activity since,\" said Dumbledore calmly. \"Right,\" said Harry hastily, staring at the contents of the Pensieve again, which were swirling more slowly now that Dumbledore had stopped adding thoughts.  \"And ... er ...\" But the Pensieve seemed to be asking his question for him. Snape's face was swimming on the surface again.  Dumbledore glanced down into it, and then up at Harry. \"No more has Professor Snape,\" he said. Harry looked into Dumbledore's light blue eyes, and the thing he really wanted to know spilled out of his mouth before he could stop it. \"What made you think he'd really stopped supporting Voldemort, Professor?\" Dumbledore held Harrys gaze for a few seconds, and then said, \"That, Harry, is a matter between Professor Snape and myself.\" Harry knew that the interview was over; Dumbledore did not look angry, yet there was a finality in his tone that told Harry it was time to go.  He stood up, and so did Dumbledore. \"Harry,\" he said as Harry reached the door.  \"Please do not speak about Neville's parents to anybody else.  He has the right to let people know, when he is ready.\" \"Yes, Professor,\" said Harry, turning to go. \"And-\" Harry looked back.  Dumbledore was standing over the Pensieve, his face lit from beneath by its silvery spots of light, looking older than ever.  He stared at Harry for a moment, and then said, \"Good luck with the third task.\"  CHAPTER THIRTY-ONE - THE THIRD TASK  Dumbledore reckons You-Know-Who's getting stronger again as well?\"  Ron whispered. Everything Harry had seen in the Pensieve, nearly everything Dumbledore had told and shown him afterward, he had now shared with Ron and Hermione - and, of course, with Sirius, to whom Harry had sent an owl the moment he had left Dumbledore's office.  Harry, Ron, and Hermione sat up late in the common room once again that night, talking it all over until Harry's mind was reeling, until he understood what Dumbledore had meant about a head becoming so full of thoughts that it would have been a relief to siphon them off. Ron stared into the common room fire.  Harry thought he saw Ron shiver slightly, even though the evening was warm. \"And he trusts Snape?\"  Ron said.  \"He really trusts Snape, even though he knows he was a Death Eater?\" \"Yes,\" said Harry. Hermione had not spoken for ten minutes.  She was sitting with her forehead in her hands, staring at her knees.  Harry thought she too looked as though she could have done with a Pensieve. \"Rita Skeeter,\" she muttered finally. \"How can you be worrying about her now?\"  said Ron, in utter disbelief. \"I'm not worrying about her,\" Hermione said to her knees.  \"I'm just thinking. . . remember what she said to me in the Three Broomsticks?  'I know things about Ludo Bagman that would make your hair curl. ' This is what she meant, isn't it?  She reported his trial, she knew he'd passed information to the Death Eaters.  And Winky too, remember . . .'Ludo Bagman's a bad wizard.'  Mr. Crouch would have been furious he got off, he would have talked about it at home.\" \"Yeah, but Bagman didn't pass information on purpose, did he?\" Hermione shrugged. \"And Fudge reckons Madame Maxime attacked Crouch?\"  Ron said, turning back to Harry. \"Yeah,\" said Harry, \"but he's only saying that because Crouch disappeared near the Beauxbatons carriage."
}