{
  "id": "a90f39b50ead3737e1e49d72a90c39fd24224b49",
  "text": " Harry was still looking out of the window, feeling increasingly nervous. Ernie didn't seem to have mastered the use of a steering wheel. The Knight Bus kept mounting the pavement, but it didn't hit anything; lines of lampposts, mailboxes, and trash cans jumped out of its way as it approached and back into position once it had passed.  Stan came back downstairs, followed by a faintly green witch wrapped in a traveling cloak.  \"'Ere you go, Madam Marsh,\" said Stan happily as Ern stamped on the brake and the beds slid a foot or so toward the front of the bus. Madam Marsh clamped a handkerchief to her mouth and tottered down the steps. Stan threw her bag out after her and rammed the doors shut; there was another loud BANG, and they were thundering down a narrow country lane, trees leaping out of the way.  Harry wouldn't have been able to sleep even if he had been traveling on a bus that didn't keep banging loudly and jumping a hundred miles at a time. His stomach churned as he fell back to wondering what was going to happen to him, and whether the Dursleys had managed to get Aunt Marge off the ceiling yet.  Stan had unfurled a copy of the Daily Prophet and was now reading with his tongue between his teeth. A large photograph of a sunken-faced man with long, matted hair blinked slowly at Harry from the front page. He looked strangely familiar.  \"That man!\" Harry said, forgetting his troubles for a moment. \"He was on the Muggle news!\"  Stanley turned to the front page and chuckled.  \"Sirius Black,\" he said, nodding. \"'Course 'e was on the Muggle news, Neville, where you been?\"  He gave a superior sort of chuckle at the blank look on Harry's face, removed the front page, and handed it to Harry.  \"You oughta read the papers more, Neville.\"  Harry held the paper up to the candlelight and read:  BLACK STILL AT LARGE  Sirius Black, possibly the most infamous prisoner ever to be held in Azkaban fortress, is still eluding capture, the Ministry of Magic confirmed today.  \"We are doing all we can to recapture Black,\" said the Minister of Magic, Cornelius Fudge, this morning, \"and we beg the magical community to remain calm.\"  Fudge has been criticized by some members of the International Federation of Warlocks for informing the Muggle Prime Minister of the crisis.  \"Well, really, I had to, don't you know,\" said an irritable Fudge. \"Black is mad. He's a danger to anyone who crosses him, magic or Muggle. I have the Prime Minister's assurance that he will not breathe a word of Black's true identity to anyone. And let's face it-who'd believe him if he did?\"  While Muggles have been told that Black is carrying a gun (a kind of metal wand that Muggles use to kill each other), the magical community lives in fear of a massacre like that of twelve years ago, when Black murdered thirteen people with a single curse.  Harry looked into the shadowed eyes of Sirius Black, the only part of the sunken face that seemed alive. Harry had never met a vampire, but he had seen pictures of them in his Defense Against the Dark Arts classes, and Black, with his waxy white skin, looked just like one.  \"Scary-lookin' fing, inee?\" said Stan, who had been watching Harry read.  \"He murdered thirteen people?\" said Harry, handing the page back to Stan, \"with one curse?\"  \"Yep,\" said Stan, \"in front of witnesses an' all. Broad daylight. Big trouble it caused, dinnit, Ern?\"  \"Ar,\" said Ern darkly.  Stan swiveled in his armchair, his hands on the back, the better to look at Harry.  \"Black woz a big supporter of You-Know-'Oo,\" he said.  \"What, Voldemort?\" said Harry, without thinking.  Even Stan's pimples went white; Ern jerked the steering wheel so hard that a whole farmhouse had to jump aside to avoid the bus.  \"You outta your tree?\" yelped Stan. \"'Choo say 'is name for?\"  \"Sorry,\" said Harry hastily. \"Sorry, I -- I forgot --\"  \"Forgot!\" said Stan weakly. \"Blimey, my 'eart's goin' that fast ...\"  \"So -- so Black was a supporter of You-Know-Who?\" Harry prompted apologetically.  \"Yeah,\" said Stan, still rubbing his chest. \"Yeah, that's right. Very close to You-Know-'Oo, they say. Anyway, when little 'Arry Potter got the better of You-Know-'Oo --\"  Harry nervously flattened his bangs down again.  \"-- all You-Know-'Oo's supporters was tracked down, wasn't they, Ern? Most of 'em knew it was all over, wiv You-Know-'Oo gone, and they came quiet. But not Sirius Black. I 'eard he thought 'e'd be second-in-command once You-Know-'Oo 'ad taken over.  \"Anyway, they cornered Black in the middle of a street full of Muggles an' Black took out 'is wand and 'e blasted 'alf the street apart, an' a wizard got it, an' so did a dozen Muggles what got in the way. 'Orrible, eh? An' you know what Black did then?\" Stan continued in a dramatic whisper.  \"What?\" said Harry.  \"Laughed,\" said Stan. \"Jus' stood there an' laughed. An' when reinforcements from the Ministry of Magic got there, I 'e went wiv em quiet as anyfink, still laughing 'is 'ead off. 'Cos 'e's mad, inee, Ern? Inee mad?\"  \"If he weren't when he went to Azkaban, he will be now,\" said Ern in his slow voice."
}