{
  "id": "aa4e9c9fcaeca951e6e7ee86cc2f87ac5153320f",
  "text": " I don’t know what he needs. Please, my lady, you’re his mother, tell me what I should do.   Tell me what I should do. Catelyn might have asked the same, if her father had been well enough to ask. But Lord Hoster was gone, or near enough. Her Ned as well. Bran and Rickon too, and Mother, and Brandon so long ago. Only Robb remained to her, Robb and the fading hope of her daughters.   Sometimes,  Catelyn said slowly,  the best thing you can do is nothing. When I first came to Winterfell, I was hurt whenever Ned went to the godswood to sit beneath his heart tree. Part of his soul was in that tree, I knew, a part I would never share. Yet without that part, I soon realized, he would not have been Ned. Jeyne, child, you have wed the north, as I did… and in the north, the winters will come.  She tried to smile.  Be patient. Be understanding. He loves you and he needs you, and he will come back to you soon enough. This very night, perhaps. Be there when he does. That is all I can tell you.   The young queen listened raptly.  I will,  she said when Catelyn was done.  I’ll be there.  She got to her feet.  I should go back. He might have missed me. I’ll see. But if he’s still at his maps, I’ll be patient.    Do,  said Catelyn, but when the girl was at the door, she thought of something else.  Jeyne,  she called after,  there’s one more thing Robb needs from you, though he may not know it yet himself. A king must have an heir.   The girl smiled at that.  My mother says the same. She makes a posset for me, herbs and milk and ale, to help make me fertile. I drink it every morning. I told Robb I’m sure to give him twins. An Eddard and a Brandon. He liked that, I think. We… we try most every day, my lady. Sometimes twice or more.  The girl blushed very prettily.  I’ll be with child soon, I promise. I pray to our Mother Above, every night.    Very good. I will add my prayers as well. To the old gods and the new.   When the girl had gone, Catelyn turned back to her father and smoothed the thin white hair across his brow.  An Eddard and a Brandon,  she sighed softly.  And perhaps in time a Hoster. Would you like that?  He did not answer, but she had never expected that he would. As the sound of the rain on the roof mingled with her father’s breathing, she thought about Jeyne. The girl did seem to have a good heart, just as Robb had said. And good hips, which might be more important.      Jaime   Two days’ ride to either side of the kingsroad, they passed through a wide swath of destruction, miles of blackened fields and orchards where the trunks of dead trees jutted into the air like archers’ stakes. The bridges were burnt as well, and the streams swollen by autumn rains, so they had to range along the banks in search of fords. The nights were alive with howling of wolves, but they saw no people.  At Maidenpool, Lord Mooton’s red salmon still flew above the castle on its hill, but the town walls were deserted, the gates smashed, half the homes and shops burned or plundered. They saw nothing living but a few feral dogs that went slinking away at the sound of their approach. The pool from which the town took its name, where legend said that Florian the Fool had first glimpsed Jonquil bathing with her sisters, was so choked with rotting corpses that the water had turned into a murky grey-green soup.  Jaime took one look and burst into song.  Six maids there were in a spring-fed pool…    What are you doing?  Brienne demanded.   Singing. ‘Six Maids in a Pool,’ I’m sure you’ve heard it. And shy little maids they were, too. Rather like you. Though somewhat prettier, I’ll warrant.    Be quiet,  the wench said, with a look that suggested she would love to leave him floating in the pool among the corpses.   Please, Jaime,  pleaded cousin Cleos.  Lord Mooton is sworn to Riverrun, we don’t want to draw him out of his castle. And there may be other enemies hiding in the rubble…    Hers or ours? They are not the same, coz. I have a yen to see if the wench can use that sword she wears.    If you won’t be quiet, you leave me no choice but to gag you, Kingslayer.    Unchain my hands and I’ll play mute all the way to King’s Landing. What could be fairer than that, wench?    Brienne! My name is Brienne!  Three crows went flapping into the air startled at the sound.   Care for a bath, Brienne?  He laughed.  You’re a maiden and there’s the pool. I’ll wash your back.  He used to scrub Cersei’s back, when they were children together at Casterly Rock.  The wench turned her horse’s head and trotted away. Jaime and Ser Cleos followed her out of the ashes of Maidenpool. A half mile on, green began to creep back into the world once more. Jaime was glad. The burned lands reminded him too much of Aerys.   She’s taking the Duskendale road,  Ser Cleos muttered.  it would be safer to follow the coast.    Safer but slower. I’m for Duskendale, coz. If truth be told, I’m bored with your company.  You may be half Lannister, but you’re a far cry from my sister.  He could never bear to be long apart from his twin."
}