{
  "id": "aa90d0d215cf531fafe7226f4c57863cd5e2be31",
  "text": " \"Don't lie to me,\" Snape hissed, his fathomless black eyes boring into Harrys. \"Boomslang skin.  Gillyweed.  Both come from my private stores, and I know who stole them.\" Harry stared back at Snape, determined not to blink or to look guilty.  In truth, he hadn't stolen either of these things from Snape.  Hermione had taken the boomslang skin back in their second year - they had needed it for the Polyjuice Potion - and while Snape had suspected Harry at the time, he had never been able to prove it. Dobby, of course, had stolen the gillyweed. \"I don't know what you're talking about,\" Harry lied coldly. \"You were out of bed on the night my office was broken into!\"  Snape hissed.  \"I know it. Potter!  Now, Mad-Eye Moody might have joined your fan club, but I will not tolerate your behavior!  One more nighttime stroll into my office, Potter, and you will pay!\" \"Right,\" said Harry coolly, turning back to his ginger roots.  \"I'll bear that in mind if I ever get the urge to go in there.\" Snape's eyes flashed. He plunged a hand into the inside of his black robes. For one wild moment. Harry thought Snape was about to pull out his wand and curse him - then he saw that Snape had drawn out a small crystal bottle of a completely clear potion.  Harry stared at it. \"Do you know what this is. Potter?\" Snape said, his eyes glittering dangerously again. \"No,\" said Harry, with complete honesty this time. \"It is Veritaserum - a Truth Potion so powerful that three drops would have you spilling your innermost secrets for this entire class to hear,\" said Snape viciously.  \"Now, the use of this potion is controlled by very strict Ministry guidelines.  But unless you watch your step, you might just find that my hand slips\" - he shook the crystal bottle slightly - \"right over your evening pumpkin juice.  And then. Potter . . . then we'll find out whether you've been in my office or not.\" Harry said nothing.  He turned back to his ginger roots once more, picked up his knife, and started slicing them again.  He didn't like the sound of that Truth Potion at all, nor would he put it past Snape to slip him some.  He repressed a shudder at the thought of what might come spilling out of his mouth if Snape did it... quite apart from landing a whole lot of people in trouble - Hermione and Dobby for a start - there were all the other things he was concealing . . . like the fact that he was in contact with Sirius . . . and - his insides squirmed at the thought - how he felt about Cho. ... He tipped his ginger roots into the cauldron too, and wondered whether he ought to take a leaf out of Moody s book and start drinking only from a private hip flask. There was a knock on the dungeon door. \"Enter,\" said Snape in his usual voice. The class looked around as the door opened. Professor Karkaroff came in. Everyone watched him as he walked up toward Snape's desk.  He was twisting his finger around his goatee and looking agitated. \"We need to talk,\" said Karkaroff abruptly when he had reached Snape.  He seemed so determined that nobody should hear what he was saying that he was barely opening his lips; it was as though he were a rather poor ventriloquist.  Harry kept his eyes on his ginger roots, listening hard. \"I'll talk to you after my lesson, Karkaroff,\" Snape muttered, but Karkaroff interrupted him. \"I want to talk now, while you can't slip off, Severus.  You've been avoiding me.\" \"After the lesson,\" Snape snapped. Under the pretext of holding up a measuring cup to see if he'd poured out enough armadillo bile, Harry sneaked a sidelong glance at the pair of them. Karkaroff looked extremely worried, and Snape looked angry. Karkaroff hovered behind Snape's desk for the rest of the double period.  He seemed intent on preventing Snape from slipping away at the end of class.  Keen to hear what Karkaroff wanted to say, Harry deliberately knocked over his bottle of armadillo bile with two minutes to go to the bell, which gave him an excuse to duck down behind his cauldron and mop up while the rest of the class moved noisily toward the door. \"What's so urgent?\" he heard Snape hiss at Karkaroff. \"This,\" said Karkaroff, and Harry, peering around the edge of his cauldron, saw Karkaroff pull up the left-hand sleeve of his robe and show Snape something on his inner forearm. \"Well?\" said Karkaroff, still making every effort not to move his lips.  \"Do you see?  It's never been this clear, never since - \" \"Put it away!\" snarled Snape, his black eyes sweeping the classroom. \"But you must have noticed -\" Karkaroff began in an agitated voice. \"We can talk later, Karkaroff!\"  spat Snape.  \"Potter!  What are you doing?\" \"Clearing up my armadillo bile, Professor,\" said Harry innocently, straightening up and showing Snape the sodden rag he was holding. Karkaroff turned on his heel and strode out of the dungeon.  He looked both worried and angry.  Not wanting to remain alone with an exceptionally angry Snape, Harry threw his books and ingredients back into his bag and left at top speed to tell Ron and Hermione what he had just witnessed."
}