{
  "id": "ab83736bc65b714c1d07efeddbc020017a38fde8",
  "text": "  Lightning crashed through the sky, and light filled the tower and etched them all in shadow. Hodor rocked back and forth, humming.  Bran could feel Summer’s fear in that bright instant. He closed two eyes and opened a third, and his boy’s skin slipped off him like a cloak as he left the tower behind…  …and found himself out in the rain, his belly full of deer, cringing in the brush as the sky broke and boomed above him. The smell of rotten apples and wet leaves almost drowned the scent of man, but it was there. He heard the clink and slither of hardskin, saw men moving under the trees. A man with a stick blundered by, a skin pulled up over his head to make him blind and deaf. The wolf went wide around him, behind a dripping thornbush and beneath the bare branches of an apple tree. He could hear them talking, and there beneath the scents of rain and leaves and horse came the sharp red stench of fear…      Jon   The ground was littered with pine needles and blown leaves, a carpet of green and brown still damp from the recent rains. It squished beneath their feet. Huge bare oaks, tall sentinels, and hosts of soldier pines stood all around them. On a hill above them was another roundtower, ancient and empty, thick green moss crawling up its side almost to the summit.  Who built that, all of stone like that?  Ygritte asked him.  Some king?    No. Just the men who used to live here.    What happened to them?    They died or went away.  Brandon’s Gift had been farmed for thousands of years, but as the Watch dwindled there were fewer hands to plow the fields, tend the bees, and plant the orchards, so the wild had reclaimed many a field and hall. In the New Gift there had been villages and holdfasts whose taxes, rendered in goods and labor, helped feed and clothe the black brothers. But those were largely gone as well.   They were fools to leave such a castle,  said Ygritte.   It’s only a towerhouse. Some little lordling lived there once, with his family and a few sworn men. When raiders came he would light a beacon from the roof. Winterfell has towers three times the size of that.   She looked as if she thought he was making that up.  How could men build so high, with no giants to lift the stones?   In legend, Brandon the Builder had used giants to help raise Winterfell, but Jon did not want to confuse the issue.  Men can build a lot higher than this. In Oldtown there’s a tower taller than the Wall.  He could tell she did not believe him. If I could show her Winterfell… give her a flower from the glass gardens, feast her in the Great Hall, and show her the stone kings on their thrones. We could bathe in the hot pools, and love beneath the heart tree while the old gods watched over us.  The dream was sweet… but Winterfell would never be his to show. It belonged to his brother, the King in the North. He was a Snow, not a Stark. Bastard, oathbreaker, and turncloak…   Might be after we could come back here, and live in that tower,  she said.  Would you want that, Jon Snow? After?   After. The word was a spear thrust. After the war. After the conquest. After the wildlings break the Wall…  His lord father had once talked about raising new lords and settling them in the abandoned holdfasts as a shield against wildlings. The plan would have required the Watch to yield back a large part of the Gift, but his uncle Benjen believed the Lord Commander could be won around, so long as the new lordlings paid taxes to Castle Black rather than Winterfell.  It is a dream for spring, though,  Lord Eddard had said.  Even the promise of land will not lure men north with a winter coming on.   If winter had come and gone more quickly and spring had followed in its turn, I might have been chosen to hold one of these towers in my father’s name. Lord Eddard was dead, however, his brother Benjen lost; the shield they dreamt together would never be forged.  This land belongs to the Watch,  Jon said.  Her nostrils flared.  No one lives here.    Your raiders drove them off.    They were cowards, then. If they wanted the land they should have stayed and fought.    Maybe they were tired of fighting. Tired of barring their doors every night and wondering if Rattleshirt or someone like him would break them down to carry off their wives. Tired of having their harvests stolen, and any valuables they might have. It’s easier to move beyond the reach of raiders.  But if the Wall should fail, all the north will lie within the reach of raiders.   You know nothing, Jon Snow. Daughters are taken, not wives. You’re the ones who steal. You took the whole world, and built the Wall t’ keep the free folk out.    Did we?  Sometimes Jon forgot how wild she was, and then she would remind him.  How did that happen?    The gods made the earth for all men t’ share. Only when the kings come with their crowns and steel swords, they claimed it was all theirs. My trees, they said, you can’t eat them apples. My stream, you can’t fish here. My wood, you’re not t’ hunt. My earth, my water, my castle, my daughter, keep your hands away or I’ll chop ’em off, but maybe if you kneel t’ me I’ll let you have a sniff."
}