{
  "id": "ac077f8cbf56f2288196679331069f413c0cac4c",
  "text": " \"And then there was this big row,\" Ginny said, \"because Mum wants them to go into the Ministry of Magic like Dad, and they told her all they want to do is open a joke shop.\" Just then a door on the second landing opened, and a face poked out wearing horn-rimmed glasses and a very annoyed expression. \"Hi, Percy,\" said Harry. \"Oh hello, Harry,\" said Percy.  \"I was wondering who was making all the noise. I'm trying to work in here, you know I've got a report to finish for the office - and it's rather difficult to concentrate when people keep thundering up and down the stairs.\" \"We're not thundering, \"said Ron irritably.  \"We're walking.  Sorry if we've disturbed the top-secret workings of the Ministry of Magic.\" \"What are you working on?\" said Harry. \"A report for the Department of International Magical Cooperation,\" said Percy smugly. \"We're trying to standardize cauldron thickness.  Some of these foreign imports are just a shade too thin - leakages have been increasing at a rate of almost three percent a year -\" \"That'll change the world, that report will,\" said Ron. \"Front page of the Daily Prophet, I expect, cauldron leaks.\" Percy went slightly pink. \"You might sneer, Ron,\" he said heatedly, \"but unless some sort of international law is imposed we might well find the market flooded with flimsy, shallow-bottomed products that seriously endanger -\" \"Yeah, yeah, all right,\" said Ron, and he started off upstairs again.  Percy slammed his bedroom door shut.  As Harry, Hermione, and Ginny followed Ron up three more flights of stairs, shouts from the kitchen below echoed up to them.  It sounded as though Mr. Weasley had told Mrs. Weasley about the toffees. The room at the top of the house where Ron slept looked much as it had the last time that Harry had come to stay: the same posters of Ron's favorite Quidditch team, the Chudley Cannons, were whirling and waving on the walls and sloping ceiling, and the fish tank on the windowsill, which had previously held frog spawn, now contained one extremely large frog. Ron's old rat, Scabbers, was here no more, but instead there was the tiny gray owl that had delivered Ron's letter to Harry in Privet Drive.  It was hopping up and down in a small cage and twittering madly. \"Shut up, Pig,\" said Ron, edging his way between two of the four beds that had been squeezed into the room.  \"Fred and George are in here with us, because Bill and Charlie are in their room,\" he told Harry.  \"Percy gets to keep his room all to himself because he's got to work.\" \"Er - why are you calling that owl Pig?\" Harry asked Ron. \"Because he's being stupid,\" said Ginny, \"Its proper name is Pigwidgeon.\" \"Yeah, and that's not a stupid name at all,\" said Ron sarcastically.  \"Ginny named him,\" he explained to Harry.  \"She reckons it's sweet.  And I tried to change it, but it was too late, he won't answer to anything else.  So now he's Pig.  I've got to keep him up here because he annoys Errol and Hermes.  He annoys me too, come to that. Pigwidgeon zoomed happily around his cage, hooting shrilly.  Harry knew Ron too well to take him seriously.  He had moaned continually about his old rat, Scabbers, but had been most upset when Hermione's cat, Crookshanks, appeared to have eaten him. \"Where's Crookshanks?\" Harry asked Hermione now. \"Out in the garden, I expect,\" she said. \"He likes chasing gnomes.  He's never seen any before.\" \"Percy's enjoying work, then?\"  said Harry, sitting down on one of the beds and watching the Chudley Cannons zooming in and out of the posters on the ceiling. \"Enjoying it?\"  said Ron darkly.  \"I don't reckon he'd come home if Dad didn't make him.  He's obsessed.  Just don't get him onto the subject of his boss.  According to Mr. Crouch ... as I was saying to Mr. Crouch ... Mr. Crouch is of the opinion ... Mr. Crouch was telling me ... They'll be announcing their engagement any day now.\" \"Have you had a good summer, Harry?\"  said Hermione.  \"Did you get our food parcels and everything?\" \"Yeah, thanks a lot, \" said Harry.  \"They saved my life, those cakes. \"And have you heard from -?\"  Ron began, but at a look from Hermione he fell silent. Harry knew Ron had been about to ask about Sirius.  Ron and Hermione had been so deeply involved in helping Sirius escape from the Ministry of Magic that they were almost as concerned about Harry's godfather as he was.  However, discussing him in front of Ginny was a bad idea. Nobody but themselves and Professor Dumbledore knew about how Sirius had escaped, or believed in his innocence. \"I think they've stopped arguing,\" said Hermione, to cover the awkward moment, because Ginny was looking curiously from Ron to Harry.  \"Shall we go down and help your mum with dinner?\" \"Yeah, all right,\" said Ron.  The four of them left Ron's room and went back downstairs to find Mrs. Weasley alone in the kitchen, looking extremely bad-tempered. \"We're eating out in the garden,\" she said when they came in.  \"There's just not room for eleven people in here.  Could you take the plates outside, girls?  Bill and Charlie are setting up the tables."
}