{
  "id": "ac2be85656e2c2b6a53deda1af0fbcf8a817f877",
  "text": "    You think I fear death?  That seemed to amuse him.   You should. Your crimes will have earned you a place of torment in the deepest of the seven hells, if the gods are just.    What gods are those, Lady Catelyn? The trees your husband prayed to? How well did they serve him when my sister took his head off?  Jaime gave a chuckle.  If there are gods, why is the world so full of pain and injustice?    Because of men like you.    There are no men like me. There’s only me.   There is nothing here but arrogance and pride, and the empty courage of a madman. I am wasting my breath with this one. If there was ever a spark of honor in him, it is long dead.  If you will not speak with me, so be it. Drink the wine or piss in it, ser, it makes no matter to me.   Her hand was at the door pull when he said,  Lady Stark.  She turned, waited.  Things go to rust in this damp,  Jaime went on.  Even a man’s courtesies. Stay, and you shall have your answers… for a price.   He has no shame.  Captives do not set prices.    Oh, you’ll find mine modest enough. Your turnkey tells me nothing but vile lies, and he cannot even keep them straight. One day he says Cersei has been flayed, and the next it’s my father. Answer my questions and I’ll answer yours.    Truthfully?    Oh, it’s truth you want? Be careful, my lady. Tyrion says that people often claim to hunger for truth, but seldom like the taste when it’s served up.    I am strong enough to hear anything you care to say.    As you will, then. But first, if you’d be so kind… the wine. My throat is raw.   Catelyn hung the lamp from the door and moved the cup and flagon closer. Jaime sloshed the wine around his mouth before he swallowed.  Sour and vile,  he said,  but it will do.  He put his back to the wall, drew his knees up to his chest, and stared at her.  Your first question, Lady Catelyn?   Not knowing how long this game might continue, Catelyn wasted no time.  Are you Joffrey’s father?    You would never ask unless you knew the answer.    I want it from your own lips.   He shrugged.  Joffrey is mine. As are the rest of Cersei’s brood, I suppose.    You admit to being your sister’s lover?    I’ve always loved my sister, and you owe me two answers. Do all my kin still live?    Ser Stafford Lannister was slain at Oxcross, I am told.   Jaime was unmoved.  Uncle Dolt, my sister called him. it’s Cersei and Tyrion who concern me. As well as my lord father.    They live, all three.  But not long, if the gods are good.  Jaime drank some more wine.  Ask your next.   Catelyn wondered if he would dare answer her next question with anything but a lie.  How did my son Bran come to fall?    I flung him from a window.   The easy way he said it took her voice away for an instant. If I had a knife, I would kill him now, she thought, until she remembered the girls. Her throat constricted as she said,  You were a knight, sworn to defend the weak and innocent.    He was weak enough, but perhaps not so innocent. He was spying on us.    Bran would not spy.    Then blame those precious gods of yours, who brought the boy to our window and gave him a glimpse of something he was never meant to see.    Blame the gods?  she said, incredulous.  Yours was the hand that threw him. You meant for him to die.   His chains chinked softly.  I seldom fling children from towers to improve their health. Yes, I meant for him to die.    And when he did not, you knew your danger was worse than ever, so you gave your catspaw a bag of silver to make certain Bran would never wake.    Did I now?  Jaime lifted his cup and took a long swallow.  I won’t deny we talked of it, but you were with the boy day and night, your maester and Lord Eddard attended him frequently, and there were guards, even those damned direwolves… it would have required cutting my way through half of Winterfell. And why bother, when the boy seemed like to die of his own accord?    If you lie to me, this session is at an end.  Catelyn held out her hands, to show him her fingers and palms.  The man who came to slit Bran’s throat gave me these scars. You swear you had no part in sending him?    On my honor as a Lannister.    Your honor as a Lannister is worth less than this.  She kicked over the waste pail. Foul-smelling brown ooze crept across the floor of the cell, soaking into the straw.  Jaime Lannister backed away from the spill as far as his chains would allow.  I may indeed have shit for honor, I won’t deny it, but I have never yet hired anyone to do my killing. Believe what you will, Lady Stark, but if I had wanted your Bran dead I would have slain him myself.   Gods be merciful, he’s telling the truth.  If you did not send the killer, your sister did.    If so, I’d know. Cersei keeps no secrets from me.    Then it was the Imp.    Tyrion is as innocent as your Bran. He wasn’t climbing around outside of anyone’s window, spying.    Then why did the assassin have his dagger?    What dagger was this?    It was so long,  she said, holding her hands apart,  plain, but finely made, with a blade of Valyrian steel and a dragonbone hilt."
}