{
  "id": "ac8ddd7411d2a8ccb1976f33ce995afac62512e8",
  "text": " But  their main gate used  to  come out on a different pass, one more easy to travel by, so that they often caught  people  benighted  near  their  gates. Evidently  people  had  given  up  going  that way,  and  the  goblins  must  have  opened  their  new  entrance  at  the  top  of  the  pass  the  dwarves had taken, quite recently, because it had been found quite safe up to now.    ####-\"I must see if I can't find a more or less decent giant to block it up again,\" said  Gandalf, \"or soon there will be no getting over the mountains at all.\"  As  soon  as Gandalf  had  heard Bilbo's  yell  he  realized what  had  happened.  In  the flash which killed the goblins that were grabbing him he had nipped inside the  crack, just as it snapped to. He followed after the drivers and prisoners right to the  edge  of  the  great  hall,  and  there  he  sat  down  and  worked  up  the  best  magic  he  could in the shadows.  \"A very ticklish business, it was,\" he said. \"Touch and go!\"  But,  of  course,  Gandalf  had  made  a  special  study  of  bewitchments  with  fire  and  lights (even  the hobbit had never forgotten  the magic fireworks at Old Took's  midsummer-eve  parties,  as  you  remember).  The  rest  we  all  know  -  except  that  Gandalf knew all about  the back-door, as the goblins called the lower gate, where  Bilbo lost his buttons. As a matter of fact it was well known to anybody who was  acquainted with this part of the mountains; but it took a wizard to keep his head in  the tunnels and guide them in the right direction.  \"They made  that  gate  ages  ago,\"  he  said,  \"partly  for  a way  of  escape,  if  they  needed one; partly as a way out into the lands beyond, where they still come in the  dark and do great damage. They guard  it always and no one has ever managed to  block it up. They will guard it doubly after this,\" he laughed.  All  the  others  laughed  too.  After  all  they  had  lost  a  good  deal,  but  they  had  killed the Great Goblin and a great many others besides, and they had all escaped,  so they might be said to have had the best of it so far.   But  the  wizard  called  them  to  their  senses.  \"We  must  be  getting  on  at  once,  now we  are  a  little  rested,\"  he  said.  \"They will  be  out  after  us  in  hundreds when  night  comes  on;  and  already  shadows  are  lengthening.  They  can  smell  our  footsteps  for  hours  and  hours  after  we  have  passed. We  must  be  miles  on  before  dusk. There will be a bit of moon,  if  it keeps fine, and  that  is  lucky. Not  that  they  mind the moon much, but it will give us a little light to steer by.\"  \"O yes!\" he said  in answer  to more questions from  the hobbit. \"You  lose  track  of  time  inside  goblin-tunnels.  Today's  Thursday,  and  it  was  Monday  night  or  Tuesday morning that we were captured. We have gone miles and miles, and come  right down through the heart of the mountains, and are now on the other side-quite  a short cut. But we are not at  the point  to which our pass would have brought us;  we  are  too  far  to  the North,  and  have  some  awkward  country  ahead. And we  are  still pretty high up. Let's get on!\"     ####-\"I  am  so dreadfully hungry,\" groaned Bilbo, who was  suddenly  aware  that he  had  not  had  a meal  since  the  night  before  the  night  before  last.  Just  think  of  that  for  a  hobbit!  His  stomach  felt  all  empty  and  loose  and  his  legs  all  wobbly,  now  that the excitement was over.   \"Can't  help  it,\"  said Gandalf,  \"unless  you  like  to  go  back  and  ask  the  goblins  nicely to let you have your pony back and your luggage.\"  \"No thank you!\" said Bilbo.  \"Very well  then, we must  just  tighten our belts  and  trudge on  - or  we shall be  made into supper, and that will be much worse than having none ourselves.\"  As  they went  on  Bilbo  looked  from  side  to  side  for  something  to  eat;  but  the  blackberries were  still  only  in  flower,  and  of  course  there were  no  nuts,  nor  even  hawthorn-berries. He nibbled a bit of sorrel, and he drank from a small mountain- stream that crossed the path, and he ate three wild strawberries that he found on its  bank, but it was not much good.  They  still  went  on  and  on.  The  rough  path  disappeared.  The  bushes,  and  the  long  grasses,  between  the  boulders,  the  patches  of  rabbit-cropped  turf,  the  thyme  and  the  sage  and  the  marjoram,  and  the  yellow  rockroses  all  vanished,  and  they  found themselves at the top of a wide steep slope of fallen stones, the remains of a  landslide.  When  they  began  to  go  down  this,  rubbish  and  small  pebbles  rolled  away  from  their  feet;  soon  larger  bits  of  split  stone  went  clattering  down  and  started  other  pieces  below  them  slithering  and  rolling;  then  lumps  of  rocks  were  disturbed and bounded off, crashing down with a dust and a noise. Before long the  whole  slope  above  them  and  below  them  seemed  on  the  move,  and  they  were  sliding  away,  huddled  all  together,  in  a  fearful  confusion  of  slipping,  rattling,  cracking slabs and stones."
}