{
  "id": "acc6e50e19326f76d556d1aa1a7db9b052145676",
  "text": "   She knew the voice. But he’s in the Vale, she thought. Ser Lothor Brune stood beside him with a torch.   Lord Petyr,  Dontos called from the boat.  I must needs row back, before they think to look for me.   Petyr Baelish put a hand on the rail.  But first you’ll want your payment. Ten thousand dragons, was it?    Ten thousand.  Dontos rubbed his mouth with the back of his hand.  As you promised, my lord.    Ser Lothor, the reward.   Lothor Brune dipped his torch. Three men stepped to the gunwale, raised crossbows, fired. One bolt took Dontos in the chest as he looked up, punching through the left crown on his surcoat. The others ripped into throat and belly. It happened so quickly neither Dontos nor Sansa had time to cry out. When it was done, Lothor Brune tossed the torch down on top of the corpse. The little boat was blazing fiercely as the galley moved away.   You killed him.  Clutching the rail, Sansa turned away and retched. Had she escaped the Lannisters to tumble into worse?   My lady,  Littlefinger murmured,  your grief is wasted on such a man as that. He was a sot, and no man’s friend.    But he saved me.    He sold you for a promise of ten thousand dragons. Your disappearance will make them suspect you in Joffrey’s death. The gold cloaks will hunt, and the eunuch will jingle his purse. Dontos… well, you heard him. He sold you for gold, and when he’d drunk it up he would have sold you again. A bag of dragons buys a man’s silence for a while, but a well-placed quarrel buys it forever.  He smiled sadly.  All he did he did at my behest. I dared not befriend you openly. When I heard how you saved his life at Joff ‘s tourney, I knew he would be the perfect catspaw.   Sansa felt sick.  He said he was my Florian.    Do you perchance recall what I said to you that day your father sat the Iron Throne?   The moment came back to her vividly.  You told me that life was not a song. That I would learn that one day, to my sorrow.  She felt tears in her eyes, but whether she wept for Ser Dontos Hollard, for Joff, for Tyrion, or for herself, Sansa could not say.  Is it all lies, forever and ever, everyone and everything?    Almost everyone. Save you and I, of course.  He smiled.  Come to the godswood tonight if you want to go home.    The note… it was you?    It had to be the godswood. No other place in the Red Keep is safe from the eunuch’s little birds… or little rats, as I call them. There are trees in the godswood instead of walls. Sky above instead of ceiling. Roots and dirt and rock in place of floor. The rats have no place to scurry. Rats need to hide, lest men skewer them with swords.  Lord Petyr took her arm.  Let me show you to your cabin. You have had a long and trying day, I know. You must be weary.   Already the little boat was no more than a swirl of smoke and fire behind them, almost lost in the immensity of the dawn sea. There was no going back; her only road was forward.  Very weary,  she admitted.  As he led her below, he said,  Tell me of the feast. The queen took such pains. The singers, the jugglers, the dancing bear… did your little lord husband enjoy my jousting dwarfs?    Yours?    I had to send to Braavos for them and hide them away in a brothel until the wedding. The expense was exceeded only by the bother. It is surprisingly difficult to hide a dwarf, and Joffrey… you can lead a king to water, but with Joff one had to splash it about before he realized he could drink it. When I told him about my little surprise, His Grace said, ‘Why would I want some ugly dwarfs at my feast? I hate dwarfs.’ I had to take him by the shoulder and whisper, ‘Not as much as your uncle will.’   The deck rocked beneath her feet, and Sansa felt as if the world itself had grown unsteady.  They think Tyrion poisoned Joffrey. Ser Dontos said they seized him.   Littlefinger smiled.  Widowhood will become you, Sansa.   The thought made her tummy flutter. She might never need to share a bed with Tyrion again. That was what she’d wanted… wasn’t it?  The cabin was low and cramped, but a featherbed had been laid upon the narrow sleeping shelf to make it more comfortable, and thick furs piled atop it.  It will be snug, I know, but you shouldn’t be too uncomfortable.  Littlefinger pointed out a cedar chest under the porthole.  You’ll find fresh garb within. Dresses, smallclothes, warm stockings, a cloak. Wool and linen only, I fear. Unworthy of a maid so beautiful, but they’ll serve to keep you dry and clean until we can find you something finer.   He had this all prepared for me.  My lord, I… I do not understand… Joffrey gave you Harrenhal, made you Lord Paramount of the Trident… why…    Why should I wish him dead?  Littlefinger shrugged.  I had no motive. Besides, I am a thousand leagues away in the Vale. Always keep your foes confused. If they are never certain who you are or what you want, they cannot know what you are like to do next. Sometimes the best way to baffle them is to make moves that have no purpose, or even seem to work against you."
}