{
  "id": "addac6287fbeeb932dd10fdb6a982f912382d427",
  "text": " The whole team splashed down into the mud.  \"I called for time-out!\" Wood roared at his team. \"Come on, under here --\"  They huddled at the edge of the field under a large umbrella; Harry took off his glasses and wiped them hurriedly on his robes.  \"What's the score?\"  \"We're fifty points up,\" said Wood, \"but unless we get the Snitch soon, we'll be playing into the night.\"  \"I've got no chance with these on,\" Harry said exasperatedly, waving his glasses.  At that very moment, Hermione appeared at his shoulder; she was holding her cloak over her head and was, inexplicably, beaming.  \"I've had an idea, Harry! Give me your glasses, quick!\"  He handed them to her, and as the team watched in amazement, Hermione tapped them with her wand and said, \"Impervius!\"  \"There!\" she said, handing them back to Harry. \"They'll repel water!\"  Wood looked as though he could have kissed her.  \"Brilliant!\" he called hoarsely after her as she disappeared into the crowd. \"Okay, team, let's go for it!\"  Hermione's spell had done the trick. Harry was still numb with cold, still wetter than he'd ever been in his life, but he could see. Full of fresh determination, he urged his broom through the turbulent air, staring in every direction for the Snitch, avoiding a Bludger, ducking beneath Diggory, who was streaking in the opposite direction....  There was another clap of thunder, followed immediately by forked lightning. This was getting more and more dangerous. Harry needed to get the Snitch quickly -  He turned, intending to head back toward the middle of the field, but at that moment, another flash of lightning illuminated the stands, and Harry saw something that distracted him completely , the silhouette of an enormous shaggy black dog, clearly imprinted against the sky, motionless in the topmost, empty row of seats.  Harry's numb hands slipped on the broom handle and his Nimbus dropped a few feet. Shaking his sodden bangs out of his eyes, he squinted back into the stands. The dog had vanished.  \"Harry!\" came Wood's anguished yell from the Gryffindor goal posts. \"Harry, behind you!\"  Harry looked wildly around. Cedric Diggory was pelting up the field, and a tiny speck of gold was shimmering in the rain-filled air between them -  With a jolt of panic, Harry threw himself flat to the broornhandle and zoomed toward the Snitch.  \"Come on!\" he growled at his Nimbus as the rain whipped his face. 'Taster!\"  But something odd was happening. An eerie silence was falling across the stadium. The wind, though as strong as ever, was forgetting to roar. It was as though someone had turned off the sound, as though Harry had gone suddenly deaf -- what was going on?  And then a horribly familiar wave of cold swept over him, inside him, just as he became aware of something moving on the field below...  Before he'd had time to think, Harry had taken his eyes off the Snitch and looked down.  At least a hundred dementors, their hidden faces pointing up at him, were standing beneath him. It was as though freezing water were rising in his chest, cutting at his insides. And then he heard it again.... Someone was screaming, screaming inside his head... a woman...  \"Not Harry, not Harry, please not Harry!\"  \"Stand aside, you silly girl... stand aside, now....\"  \"Not Harry, please no, take me, kill me instead --\"  Numbing, swirling white mist was filling Harry's brain.... What was he doing? Why was he flying? He needed to help her... She was going to die.... She was going to be murdered....  He was falling, falling through the icy mist.  \"Not Harry! Please... have mercy... have mercy....  A shrill voice was laughing, the woman was screaming, and Harry knew no more.  \"Lucky the ground was so soft.\"  \"I thought he was dead for sure.\"  \"But he didn't even break his glasses.\"  Harry could hear the voices whispering, but they made no sense whatsoever. He didn't have a clue where he was, or how he'd got there, or what he'd been doing before he got there. All he knew was that every inch of him was aching as though it had been beaten.  \"That was the scariest thing I've ever seen in my life.\"  Scariest... the scariest thing... hooded black figures... cold ... screaming...  Harry's eyes snapped open. He was lying in the hospital wing. The Gryffindor Quidditch team, spattered with mud from head to foot, was gathered around his bed. Ron and Hermione were also there, looking as though they'd just climbed out of a swimming pool.  \"Harry!\" said Fred, who looked extremely white underneath, the mud. \"How're you feeling?\"  It was as though Harry's memory was on fast forward. The lightning -- the Grim -- the Snitch -- and the dementors...  \"What happened?\" he said, sitting up so suddenly they all gasped.  \"You fell off,\" said Fred. \"Must've been -- what -- fifty feet?\"  \"We thought you'd died,\" said Alicia, who was shaking.  Hermione made a small, squeaky noise. Her eyes were extremely bloodshot.  \"But the match,\" said Harry. \"What happened? Are we doing a replay?\"  No one said anything."
}