{
  "id": "addf6dff04a85e24be3bef1ec3ed07aa13c43406",
  "text": "  He reached out and touched Ned with a soft hand.  But you, Lord Stark… I think… no, I know… he would not kill you, not even for his queen, and there may lie our salvation.   It was all too much. For a moment Eddard Stark wanted nothing so much as to return to Winterfell, to the clean simplicity of the north, where the enemies were winter and the wildlings beyond the Wall.  Surely Robert has other loyal friends,  he protested.  His brothers, his—    —wife?  Varys finished, with a smile that cut.  His brothers hate the Lannisters, true enough, but hating the queen and loving the king are not quite the same thing, are they? Ser Barristan loves his honor, Grand Maester Pycelle loves his office, and Littlefinger loves Littlefinger.    The Kingsguard—    A paper shield,  the eunuch said.  Try not to look so shocked, Lord Stark. Jaime Lannister is himself a Sworn Brother of the White Swords, and we all know what his oath is worth. The days when men like Ryam Redwyne and Prince Aemon the Dragonknight wore the white cloak are gone to dust and song. Of these seven, only Ser Barristan Selmy is made of the true steel, and Selmy is old. Ser Boros and Ser Meryn are the queen’s creatures to the bone, and I have deep suspicions of the others. No, my lord, when the swords come out in earnest, you will be the only true friend Robert Baratheon will have.    Robert must be told,  Ned said.  If what you say is true, if even a part of it is true, the king must hear it for himself.    And what proof shall we lay before him? My words against theirs? My little birds against the queen and the Kingslayer, against his brothers and his council, against the Wardens of East and West, against all the might of Casterly Rock? Pray, send for Ser Ilyn directly, it will save us all some time. I know where that road ends.    Yet if what you say is true, they will only bide their time and make another attempt.    Indeed they will,  said Varys,  and sooner rather than later, I do fear. You are making them most anxious, Lord Eddard. But my little birds will be listening, and together we may be able to forestall them, you and I.  He rose and pulled up his cowl so his face was hidden once more.  Thank you for the wine. We will speak again. When you see me next at council, be certain to treat me with your accustomed contempt. You should not find it difficult.   He was at the door when Ned called,  Varys.  The eunuch turned back.  How did Jon Arryn die?    I wondered when you would get around to that.    Tell me.    The tears of Lys, they call it. A rare and costly thing, clear and sweet as water, and it leaves no trace. I begged Lord Arryn to use a taster, in this very room I begged him, but he would not hear of it. Only one who was less than a man would even think of such a thing, he told me.   Ned had to know the rest.  Who gave him the poison?    Some dear sweet friend who often shared meat and mead with him, no doubt. Oh, but which one? There were many such. Lord Arryn was a kindly, trusting man.  The eunuch sighed.  There was one boy. All he was, he owed Jon Arryn, but when the widow fled to the Eyrie with her household, he stayed in King’s Landing and prospered. It always gladdens my heart to see the young rise in the world.  The whip was in his voice again, every word a stroke.  He must have cut a gallant figure in the tourney, him in his bright new armor, with those crescent moons on his cloak. A pity he died so untimely, before you could talk to him…   Ned felt half-poisoned himself.  The squire,  he said.  Ser Hugh.  Wheels within wheels within wheels. Ned’s head was pounding.  Why? Why now? Jon Arryn had been Hand for fourteen years. What was he doing that they had to kill him?    Asking questions,  Varys said, slipping out the door.      TYRION  As he stood in the predawn chill watching Chiggen butcher his horse, Tyrion Lannister chalked up one more debt owed the Starks. Steam rose from inside the carcass when the squat sellsword opened the belly with his skinning knife. His hands moved deftly, with never a wasted cut; the work had to be done quickly, before the stink of blood brought shadowcats down from the heights.   None of us will go hungry tonight,  Bronn said. He was near a shadow himself; bone thin and bone hard, with black eyes and black hair and a stubble of beard.   Some of us may,  Tyrion told him.  I am not fond of eating horse. Particularly my horse.    Meat is meat,  Bronn said with a shrug.  The Dothraki like horse more than beef or pork.    Do you take me for a Dothraki?  Tyrion asked sourly. The Dothraki ate horse, in truth; they also left deformed children out for the feral dogs who ran behind their khalasars. Dothraki customs had scant appeal for him.  Chiggen sliced a thin strip of bloody meat off the carcass and held it up for inspection.  Want a taste, dwarf?    My brother Jaime gave me that mare for my twenty-third name day,  Tyrion said in a flat voice.   Thank him for us, then. If you ever see him again.  Chiggen grinned, showing yellow teeth, and swallowed the raw meat in two bites."
}