{
  "id": "aee98acf23d00286ea6ffcff4dc85ae0805e8a76",
  "text": "       Sometimes in the silence of that barren country they fancied  that they  heard faint sounds behind  them, a stone falling,  or the  imagined step  of  flapping feet on the rock. But if they halted  and  stood  still  listening,  they heard  no more,  nothing but  the  wind sighing over  the  edges of the  stones -- yet even that reminded them of breath softly hissing through sharp  teeth.       All that  day  the  outer  ridge of the  Emyn  Muil  had  been  bending  gradually northward,  as  they  struggled  on.  Along  its  brink there  now  stretched  a wide tumbled flat of scored and  weathered rock,  cut  every now   and again by trench-like gullies that sloped steeply down to deep notches in   the cliff-face. To find a path in  these clefts, which  were becoming deeper  and more  frequent, Frodo  and Sam were driven to their left, well away from  the edge, and they did not notice that for several miles they had been going  slowly but steadily downhill: the cliff-top was sinking towards the level of  the lowlands.       At last  they were brought to a  halt.  The ridge took  a  sharper bend  nor thward and was gashed by  a deeper  ravine. On the further side it reared  up again,  many fathoms at a single  leap: a great grey cliff  loomed before  them, cut sheer down  as if by  a  knife stroke.  They could  go  no further  forwards, and must turn now either west or east. But west  would  lead  them  only  into more labour and delay, back towards the  heart of the hills; east   ####-would take them to the outer precipice.       `There's nothing for it but  to scramble down  this gully,  Sam,'  said  Frodo. `Let's see what it leads to!'       'A nasty drop, I'll bet,' said Sam.       The  cleft  was  longer and deeper  than it seemed. Some way down  they  found a  few gnarled and stunted  trees,  the first they  had seen for days:  twisted birch for  the  most part, with here and there a fir -tree. Many were  dead and gaunt, bitten to the core by the eastern winds. Once in milder days  there must have been a fair thicket in the ravine, but now, after some fifty  yards,  the  trees  came to  an end, though  old broken stumps  straggled on  almost to the cliff's brink. The bottom of  the  gully, which  lay along the  edge of a rock -fault, was rough with broken stone and slanted steeply  down.  When they came at last to the end of it, Frodo stooped and leaned out.       `Look!' he said. `We must have come down a  long way, or else the cliff  has sunk. It's much lower here than it was, and it looks easier too.'       Sam knelt beside  him  and peered  reluctantly over the  edge.  Then he  glanced up at the great  cliff rising up, away on  their left. `Easier! ' he  grunted. `Well, I  suppose it's always easier getting down than up. Those as  can't fly can jump!'       `It would be a big jump still,' said Frodo. `About, well'  --  he  stood  for a moment measuring it with his eyes  -- `about eighteen  fathoms I should   guess. Not more.'       'And that's enough! ' said Sam. `Ugh! How I do hate looking down from a  height! But looking's better than climbing.'       `All the same,' said Frodo, `I think  we could climb here; and  I think   we shall have to try. See -- the rock is quite different from  what it was a   few miles back. It has slipped and cracked.'       The outer fall  was  indeed no  longer  sheer,  but  sloped outwards  a   little. It looked  like a great rampart or  sea -wall whose  foundations  had  shifted, so that  its courses were all twisted and disordered, leaving great  fissures  and  long  slanting edges that were in places  almost as  wide  as  stairs.       `And if we're going to try and  get down, we had better  try  at  once.  It's getting dark early. I think there's a storm coming.'       The smoky  blur of the mountains  in the  East  was  lost  in a  deeper   blackness that was already reaching out  westwards with long arms. There was  a distant  mutter of  thunder borne on the rising breeze. Frodo sniffed  the   ####-air and looked up  doubtfully at the  sky. He strapped his belt  outside his  cloak  and  tightened it, and settled  his  light pack on  his back; then he  stepped towards the edge. `I'm going to try it,' he said.       `Very good! ' said Sam gloomily. `But I'm going first.'       'You? ' said Frodo. `What's made you change your mind about climbing?'       'I haven't changed my mind.  But it's only sense: put the one lowest as  is most  likely to slip. I don't want to come down atop of you a nd knock you   off no sense in killing two with one fall.'       Before Frodo  could  stop  him,  he  sat down,  swung his legs over the  brink,  and twisted round, scrabbling with  his toes for a  foothold.  It is  doubtful if he ever did anything braver in cold blood, or more unwise.       'No,  no! Sam, you  old ass! ' said Frodo.  `You'll kill  yourself  for   certain going  over like that without  even a look to see what  to make for.  Come back! '  He took Sam under  the armpits and hauled him up  again."
}