{
  "id": "b09b634ccc50996cb7d3bbbbe89fb569ddbee1a9",
  "text": " The water went sloshing over the side onto Amabel’s legs.  You did that on purpose,  the woman screeched.   What do you want?  Arya squirmed in her grasp. Amabel had been half-crazed since they’d cut Harra’s head off.   See there?  Arnabel pointed across the yard at Pia.  When this northman falls you’ll be where she is.    Let me go.  She tried to wrench free, but Amabel only tightened her fingers.   He will fall too, Harrenhal pulls them all down in the end. Lord Tywin’s won now, he’ll be marching back with all his power, and then it will be his turn to punish the disloyal. And don’t think he won’t know what you did!  The old woman laughed.  I may have a turn at you myself. Harra had an old broom, I’ll save it for you. The handle’s cracked and splintery—   Arya swung the bucket. The weight of the water made it turn in her hands, so she didn’t smash Amabel’s head in as she wanted, but the woman let go of her anyway when the water came out and drenched her.  Don’t ever touch me,  Arya shouted,  or I’ll kill you. You get away.   Sopping, Goodwife Amabel jabbed a thin finger at the flayed man on the front of Arya’s tunic.  You think you’re safe with that little bloody man on your teat, but you’re not! The Lannisters are coming! See what happens when they get here.   Three-quarters of the water had splashed out on the ground, so Arya had to return to the well. If I told Lord Bolton what she said, her head would be up next to Harra’s before it got dark, she thought as she drew up the bucket again. She wouldn’t, though.  Once, when there had been only half as many heads, Gendry had caught Arya looking at them.  Admiring your work?  he asked.  He was angry because he’d liked Lucan, she knew, but it still wasn’t fair.  It’s Steelshanks Walton’s work,  she said defensively.  And the Mummers, and Lord Bolton.    And who gave us all them? You and your weasel soup.   Arya punched his arm.  It was just hot broth. You hated Ser Amory too.    I hate this lot worse. Ser Amory was fighting for his lord, but the Mummers are sellswords and turncloaks. Half of them can’t even speak the Common Tongue. Septon Utt likes little boys, Qyburn does black magic, and your friend Biter eats people.   The worst thing was, she couldn’t even say he was wrong. The Brave Companions did most of the foraging for Harrenhal, and Roose Bolton had given them the task of rooting out Lannisters. Vargo Hoat had divided them into four bands, to visit as many villages as possible. He led the largest group himself, and gave the others to his most trusted captains. She had heard Rorge laughing over Lord Vargo’s way of finding traitors. All he did was return to places he had visited before under Lord Tywin’s banner and seize those who had helped him. Many had been bought with Lannister silver, so the Mummers often returned with bags of coin as well as baskets of heads.  A riddle!  Shagwell would shout gleefully.  If Lord Bolton’s goat eats the men who fed Lord Lannister’s goat, how many goats are there?    One,  Arya said when he asked her.   Now there’s a weasel clever as a goat!  the fool tittered.  Rorge and Biter were as bad as the others. Whenever Lord Bolton took a meal with the garrison, Arya would see them there among the rest. Biter gave off a stench like bad cheese, so the Brave Companions made him sit down near the foot of the table where he could grunt and hiss to himself and tear his meat apart with fingers and teeth. He would sniff at Arya when she passed, but it was Rorge who scared her most. He sat up near Faithful Ursywck, but she could feel his eyes crawling over her as she went about her duties.  Sometimes she wished she had gone off across the narrow sea with Jaqen H’ghar. She still had the stupid coin he’d given her, a piece of iron no larger than a penny and rusted along the rim. One side had writing on it, queer words she could not read. The other showed a man’s head, but so worn that all his features had rubbed off. He said it was of great value, but that was probably a lie too, like his name and even his face. That made her so angry that she threw the coin away, but after an hour she got to feeling bad and went and found it again, even though it wasn’t worth anything.  She was thinking about the coin as she crossed the Flowstone Yard, struggling with the weight of the water in her pail.  Nan,  a voice called out.  Put down that pail and come help me.   Elmar Frey was no older than she was, and short for his age besides. He had been rolling a barrel of sand across the uneven stone, and was red-faced from exertion. Arya went to help him. Together they pushed the barrel all the way to the wall and back again, then stood it upright.  She could hear the sand shifting around inside as Elmar pried open the lid and pulled out a chainmail hauberk.  Do you think it’s clean enough?  As Roose Bolton’s squire, it was his task to keep his mail shiny bright.   You need to shake out the sand. There’s still spots of rust. See?  She pointed.  You’d best do it again."
}