{
  "id": "b0f91a404f5721d5669bdded0a85b6baab4efc15",
  "text": "   It’s even worse than I feared.  And my father? Who does he have spying on me?   This time the eunuch laughed aloud.  Why, me, my lord.   Tyrion laughed as well. He was not so great a fool as to trust Varys any further than he had to—but the eunuch already knew enough about Shae to get her well and thoroughly hanged.  You will bring Shae to me through the walls, hidden from all these eyes. As you have done before.   Varys wrung his hands.  Oh, my lord, nothing would please me more, but… King Maegor wanted no rats in his own walls, if you take my meaning. He did require a means of secret egress, should he ever be trapped by his enemies, but that door does not connect with any other passages. I can steal your Shae away from Lady Lollys for a time, to be sure, but I have no way to bring her to your bedchamber without us being seen.    Then bring her somewhere else.    But where? There is no safe place.    There is.  Tyrion grinned.  Here. It’s time to put that rock-hard bed of yours to better use, I think.   The eunuch’s mouth opened. Then he giggled.  Lollys tires easily these days. She is great with child. I imagine she will be safely asleep by moonrise.   Tyrion hopped down from the chair.  Moonrise, then. See that you lay in some wine. And two clean cups.   Varys bowed.  It shall be as my lord commands.   The rest of the day seemed to creep by as slow as a worm in molasses. Tyrion climbed to the castle library and tried to distract himself with Beldecar’s History of the Rhoynish Wars, but he could hardly see the elephants for imagining Shae’s smile. Come the afternoon, he put the book aside and called for a bath. He scrubbed himself until the water grew cool, and then had Pod even out his whiskers. His beard was a trial to him; a tangle of yellow, white, and black hairs, patchy and coarse, it was seldom less than unsightly, but it did serve to conceal some of his face, and that was all to the good.  When he was as clean and pink and trimmed as he was like to get, Tyrion looked over his wardrobe, and chose a pair of tight satin breeches in Lannister crimson and his best doublet, the heavy black velvet with the lion’s head studs. He would have donned his chain of golden hands as well, if his father hadn’t stolen it while he lay dying. It was not until he was dressed that he realized the depths of his folly. Seven hells, dwarf, did you lose all your sense along with your nose? Anyone who sees you is going to wonder why you’ve put on your court clothes to visit the eunuch. Cursing, Tyrion stripped and dressed again, in simpler garb; black woolen breeches, an old white tunic, and a faded brown leather jerkin. It doesn’t matter, he told himself as he waited for moonrise. Whatever you wear, you’re still a dwarf. You’ll never be as tall as that knight on the steps, him with his long straight legs and hard stomach and wide manly shoulders.  The moon was peeping over the castle wall when he told Podrick Payne that he was going to pay a call on Varys.  Will you be long, my lord?  the boy asked.   Oh, I hope so.   With the Red Keep so crowded, Tyrion could not hope to go unnoticed. Ser Balon Swann stood guard on the door, and Ser Loras Tyrell on the drawbridge. He stopped to exchange pleasantries with both of them. It was strange to see the Knight of Flowers all in white when before he had always been as colorful as a rainbow.  How old are you, Ser Loras?  Tyrion asked him.   Seventeen, my lord.   Seventeen, and beautiful, and already a legend. Half the girls in the Seven Kingdoms want to bed him, and all the boys want to be him.  If you will pardon my asking, ser—why would anyone choose to join the Kingsguard at seventeen?    Prince Aemon the Dragonknight took his vows at seventeen,  Ser Loras said,  and your brother Jaime was younger still.    I know their reasons. What are yours? The honor of serving beside such paragons as Meryn Trant and Boros Blount?  He gave the boy a mocking grin.  To guard the king’s life, you surrender your own. You give up your lands and titles, give up hope of marriage, children…    House Tyrell continues through my brothers,  Ser Loras said.  It is not necessary for a third son to wed, or breed.    Not necessary, but some find it pleasant. What of love?    When the sun has set, no candle can replace it.    Is that from a song?  Tyrion cocked his head, smiling.  Yes, you are seventeen, I see that now.   Ser Loras tensed.  Do you mock me?   A prickly lad.  No. If I’ve given offense, forgive me. I had my own love once, and we had a song as well.  I loved a maid as fair as summer, with sunlight in her hair. He bid Ser Loras a good evening and went on his way.  Near the kennels a group of men-at-arms were fighting a pair of dogs. Tyrion stopped long enough to see the smaller dog tear half the face off the larger one, and earned a few coarse laughs by observing that the loser now resembled Sandor Clegane. Then, hoping he had disarmed their suspicions, he proceeded to the north wall and down the short flight of steps to the eunuch’s meager abode."
}