{
  "id": "b26a5057c9212a00e5de443f8a340973013cbd5b",
  "text": "\"  Harry wished he had about eight more eyes. He turned his head in every direction as they walked up the street, trying to look at everything at once: the shops, the things outside them, the people doing their shopping. A plump woman outside an Apothecary was shaking her head as they passed, saying, \"Dragon liver, seventeen Sickles an ounce, they're mad....\"  A low, soft hooting came from a dark shop with a sign saying Eeylops Owl Emporium -- Tawny, Screech, Barn, Brown, and Snowy. Several boys of about Harry's age had their noses pressed against a window with broomsticks in it. \"Look,\" Harry heard one of them say, \"the new Nimbus Two Thousand -- fastest ever --\" There were shops selling robes, shops selling telescopes and strange silver instruments Harry had never seen before, windows stacked with barrels of bat spleens and eels' eyes, tottering piles of spell books, quills, and rolls of parchment, potion bottles, globes of the moon....  \"Gringotts,\" said Hagrid.  They had reached a snowy white building that towered over the other little shops. Standing beside its burnished bronze doors, wearing a uniform of scarlet and gold, was -  \"Yeah, that's a goblin,\" said Hagrid quietly as they walked up the white stone steps toward him. The goblin was about a head shorter than Harry. He had a swarthy, clever face, a pointed beard and, Harry noticed, very long fingers and feet. He bowed as they walked inside. Now they were facing a second pair of doors, silver this time, with words engraved upon them:  Enter, stranger, but take heed  Of what awaits the sin of greed,  For those who take, but do not earn,  Must pay most dearly in their turn.  So if you seek beneath our floors  A treasure that was never yours,  Thief, you have been warned, beware  Of finding more than treasure there.  \"Like I said, Yeh'd be mad ter try an' rob it,\" said Hagrid.  A pair of goblins bowed them through the silver doors and they were in a vast marble hall. About a hundred more goblins were sitting on high stools behind a long counter, scribbling in large ledgers, weighing coins in brass scales, examining precious stones through eyeglasses. There were too many doors to count leading off the hall, and yet more goblins were showing people in and out of these. Hagrid and Harry made for the counter.  \"Morning,\" said Hagrid to a free goblin. \"We've come ter take some money outta Mr. Harry Potter's safe.\"  \"You have his key, Sir?\"  \"Got it here somewhere,\" said Hagrid, and he started emptying his pockets onto the counter, scattering a handful of moldy dog biscuits over the goblin's book of numbers. The goblin wrinkled his nose. Harry watched the goblin on their right weighing a pile of rubies as big as glowing coals.  \"Got it,\" said Hagrid at last, holding up a tiny golden key.  The goblin looked at it closely.  \"That seems to be in order.\"  \"An' I've also got a letter here from Professor Dumbledore,\" said Hagrid importantly, throwing out his chest. \"It's about the YouKnow-What in vault seven hundred and thirteen.\"  The goblin read the letter carefully.  \"Very well,\" he said, handing it back to Hagrid, \"I will have Someone take you down to both vaults. Griphook!\"  Griphook was yet another goblin. Once Hagrid had crammed all the dog biscuits back inside his pockets, he and Harry followed Griphook toward one of the doors leading off the hall.  \"What's the You-Know-What in vault seven hundred and thirteen?\" Harry asked.  \"Can't tell yeh that,\" said Hagrid mysteriously. \"Very secret. Hogwarts business. Dumbledore's trusted me. More'n my job's worth ter tell yeh that.\"  Griphook held the door open for them. Harry, who had expected more marble, was surprised. They were in a narrow stone passageway lit with flaming torches. It sloped steeply downward and there were little railway tracks on the floor. Griphook whistled and a small cart came hurtling up the tracks toward them. They climbed in -- Hagrid with some difficulty -- and were off.  At first they just hurtled through a maze of twisting passages. Harry tried to remember, left, right, right, left, middle fork, right, left, but it was impossible. The rattling cart seemed to know its own way, because Griphook wasn't steering.  Harry's eyes stung as the cold air rushed past them, but he kept them wide open. Once, he thought he saw a burst of fire at the end of a passage and twisted around to see if it was a dragon, but too late - - they plunged even deeper, passing an underground lake where huge stalactites and stalagmites grew from the ceiling and floor.  I never know,\" Harry called to Hagrid over the noise of the cart, \"what's the difference between a stalagmite and a stalactite?\"  \"Stalagmite's got an 'm' in it,\" said Hagrid. \"An' don' ask me questions just now, I think I'm gonna be sick.\"  He did look very green, and when the cart stopped at last beside a small door in the passage wall, Hagrid got out and had to lean against the wall to stop his knees from trembling.  Griphook unlocked the door. A lot of green smoke came billowing out, and as it cleared, Harry gasped."
}