{
  "id": "b2c85122f93e4a4ba6fc3e1c412cca64a957578f",
  "text": "   Ah.  Tyrion had known nothing of this ploy. Had Varys’s little birds failed him for once? Even spiders must nod, he supposed… or was the eunuch playing a deeper and more subtle game than he knew?  You have my thanks, ser.    Will you grant me the boon I asked of you?    Perhaps.  Lancel wanted his own command in the next battle. A splendid way to die before he finished growing that mustache, but young knights always think themselves invincible.  Tyrion lingered after his cousin had slipped away. At the Warrior’s altar, he used one candle to light another. Watch over my brother, you bloody bastard, he’s one of yours. He lit a second candle to the Stranger, for himself.  That night, when the Red Keep was dark, Bronn arrived to find him sealing a letter.  Take this to Ser Jacelyn Bywater.  The dwarf dribbled hot golden wax down onto the parchment.   What does it say?  Bronn could not read, so he asked impudent questions.   That he’s to take fifty of his best swords and scout the roseroad.  Tyrion pressed his seal into the soft wax.   Stannis is more like to come up the kingsroad.    Oh, I know. Tell Bywater to disregard what’s in the letter and take his men north. He’s to lay a trap along the Rosby road. Lord Gyles will depart for his castle in a day or two, with a dozen men-at-arms, some servants, and my nephew. Prince Tommen may be dressed as a page.    You want the boy brought back, is that it?    No. I want him taken on to the castle.  Removing the boy from the city was one of his sister’s better notions, Tyrion had decided. At Rosby, Tommen would be safe from the mob, and keeping him apart from his brother also made things more difficult for Stannis; even if he took King’s Landing and executed Joffrey, he’d still have a Lannister claimant to contend with.  Lord Gyles is too sickly to run and too craven to fight. He’ll command his castellan to open the gates. Once inside the walls, Bywater is to expel the garrison and hold Tommen there safe. Ask him how he likes the sound of Lord Bywater.    Lord Bronn would sound better. I could grab the boy for you just as well. I’ll dandle him on my knee and sing him nursery songs if there’s a lordship in it.    I need you here,  said Tyrion. And I don’t trust you with my nephew. Should any ill befall Joffrey, the Lannister claim to the Iron Throne would rest on Tommen’s young shoulders. Ser Jacelyn’s gold cloaks would defend the boy; Bronn’s sellswords were more apt to sell him to his enemies.   What should the new lord do with the old one?    Whatever he pleases, so long as he remembers to feed him. I don’t want him dying.  Tyrion pushed away from the table.  My sister will send one of the Kingsguard with the prince.   Bronn was not concerned.  The Hound is Joffrey’s dog, he won’t leave him. Ironhand’s gold cloaks should be able to handle the others easy enough.    If it comes to killing, tell Ser Jacelyn I won’t have it done in front of Tommen.  Tyrion donned a heavy cloak of dark brown wool.  My nephew is tender-hearted.    Are you certain he’s a Lannister?    I’m certain of nothing but winter and battle,  he said.  Come. I’m riding with you part of the way.    Chataya’s?    You know me too well.   They left through a postern gate in the north wall. Tyrion put his heels into his horse and clattered down Shadowblack Lane. A few furtive shapes darted into alleys at the sound of hoofbeats on the cobbles, but no one dared accost them. The council had extended his curfew; it was death to be taken on the streets after the evenfall bells had sung. The measure had restored a degree of peace to King’s Landing and quartered the number of corpses found in the alleys of a morning, yet Varys said the people cursed him for it. They should be thankful they have the breath to curse. A pair of gold cloaks confronted them as they were making their way along Coppersmith’s Wynd, but when they realized whom they’d challenged they begged the Hand’s pardons and waved them on. Bronn turned south for the Mud Gate and they parted company.  Tyrion rode on toward Chataya’s, but suddenly his patience deserted him. He twisted in the saddle, scanning the street behind. There were no signs of followers. Every window was dark or tightly shuttered. He heard nothing but the wind swirling down the alleys. If Cersei has someone stalking me tonight, he must be disguised as a rat.  Bugger it all,  he muttered. He was sick of caution. Wheeling his horse around, he dug in his spurs. If anyone’s after me, we’ll see how well they ride. He flew through the moonlight streets, clattering over cobbles, darting down narrow alleys and up twisty wynds, racing to his love.  As he hammered on the gate he heard music wafting faintly over the spiked stone walls. One of the Ibbenese ushered him inside. Tyrion gave the man his horse and said,  Who is that?  The diamond-shaped panes of the longhall windows shone with yellow light, and he could hear a man singing.  The Ibbenese shrugged.  Fatbelly singer.   The sound swelled as he walked from the stable to the house."
}