{
  "id": "b475a62154fb0b0d4025934828adff7331c1fcc2",
  "text": "  It had to be more than that, or why kill him?   Littlefinger shook the rain from his hair and laughed.  Now I see. Lord Arryn learned that His Grace had filled the bellies of some whores and fishwives, and for that he had to be silenced. Small wonder. Allow a man like that to live, and next he’s like to blurt out that the sun rises in the east.   There was no answer Ned Stark could give to that but a frown. For the first time in years, he found himself remembering Rhaegar Targaryen. He wondered if Rhaegar had frequented brothels; somehow he thought not.  The rain was falling harder now, stinging the eyes and drumming against the ground. Rivers of black water were running down the hill when Jory called out,  My lord,  his voice hoarse with alarm. And in an instant, the street was full of soldiers.  Ned glimpsed ringmail over leather, gauntlets and greaves, steel helms with golden lions on the crests. Their cloaks clung to their backs, sodden with rain. He had no time to count, but there were ten at least, a line of them, on foot, blocking the street, with longswords and iron-tipped spears.  Behind!  he heard Wyl cry, and when he turned his horse, there were more in back of them, cutting off their retreat. Jory’s sword came singing from its scabbard.  Make way or die!    The wolves are howling,  their leader said. Ned could see rain running down his face.  Such a small pack, though.   Littlefinger walked his horse forward, step by careful step.  What is the meaning of this? This is the Hand of the King.    He was the Hand of the King.  The mud muffled the hooves of the blood bay stallion. The line parted before him. On a golden breastplate, the lion of Lannister roared its defiance.  Now, if truth be told, I’m not sure what he is.    Lannister, this is madness,  Littlefinger said.  Let us pass. We are expected back at the castle. What do you think you’re doing?    He knows what he’s doing,  Ned said calmly.  Jaime Lannister smiled.  Quite true. I’m looking for my brother. You remember my brother, don’t you, Lord Stark? He was with us at Winterfell. Fair-haired, mismatched eyes, sharp of tongue. A short man.    I remember him well,  Ned replied.   It would seem he has met some trouble on the road. My lord father is quite vexed. You would not perchance have any notion of who might have wished my brother ill, would you?    Your brother has been taken at my command, to answer for his crimes,  Ned Stark said.  Littlefinger groaned in dismay.  My lords—   Ser Jaime ripped his longsword from its sheath and urged his stallion forward.  Show me your steel, Lord Eddard. I’ll butcher you like Aerys if I must, but I’d sooner you died with a blade in your hand.  He gave Littlefinger a cool, contemptuous glance.  Lord Baelish, I’d leave here in some haste if I did not care to get bloodstains on my costly clothing.   Littlefinger did not need to be urged.  I will bring the City Watch,  he promised Ned. The Lannister line parted to let him through, and closed behind him. Littlefinger put his heels to his mare and vanished around a corner.  Ned’s men had drawn their swords, but they were three against twenty. Eyes watched from nearby windows and doors, but no one was about to intervene. His party was mounted, the Lannisters on foot save for Jaime himself. A charge might win them free, but it seemed to Eddard Stark that they had a surer, safer tactic.  Kill me,  he warned the Kingslayer,  and Catelyn will most certainly slay Tyrion.   Jaime Lannister poked at Ned’s chest with the gilded sword that had sipped the blood of the last of the Dragonkings.  Would she? The noble Catelyn Tully of Riverrun murder a hostage? I think… not.  He sighed.  But I am not willing to chance my brother’s life on a woman’s honor.  Jaime slid the golden sword into its sheath.  So I suppose I’ll let you run back to Robert to tell him how I frightened you. I wonder if he’ll care.  Jaime pushed his wet hair back with his fingers and wheeled his horse around. When he was beyond the line of swordsmen, he glanced back at his captain.  Tregar, see that no harm comes to Lord Stark.    As you say, m’lord.    Still… we wouldn’t want him to leave here entirely unchastened, so —through the night and the rain, he glimpsed the white of Jaime’s smile— kill his men.    No!  Ned Stark screamed, clawing for his sword. Jaime was already cantering off down the street as he heard Wyl shout. Men closed from both sides. Ned rode one down, cutting at phantoms in red cloaks who gave way before him. Jory Cassel put his heels into his mount and charged. A steel-shod hoof caught a Lannister guardsman in the face with a sickening crunch. A second man reeled away and for an instant Jory was free. Wyl cursed as they pulled him off his dying horse, swords slashing in the rain. Ned galloped to him, bringing his longsword down on Tregar’s helm. The jolt of impact made him grit his teeth. Tregar stumbled to his knees, his lion crest sheared in half, blood running down his face. Heward was hacking at the hands that had seized his bridle when a spear caught him in the belly."
}