{
  "id": "b56c8b0f37f7d99e0483a63c8f13fdef8fccbe7b",
  "text": " He leaned against the wooden door and looked up at Hogwarts, with its windows glowing red in the setting sun. Gryffindor in the lead. He'd done it, he'd shown Snape....  And speaking of Snape...  A hooded figure came swiftly down the front steps of the castle. Clearly not wanting to be seen, it walked as fast as possible toward the forbidden forest. Harry's victory faded from his mind as he watched. He recognized the figure's prowling walk. Snape, sneaking into the forest while everyone else was at dinner -- what was going on?  Harry jumped back on his Nimbus Two Thousand and took off. Gliding silently over the castle he saw Snape enter the forest at a run. He followed.  The trees were so thick he couldn't see where Snape had gone. He flew in circles, lower and lower, brushing the top branches of trees until he heard voices. He glided toward them and landed noiselessly in a towering beech tree.  He climbed carefully along one of the branches, holding tight to his broomstick, trying to see through the leaves. Below, in a shadowy clearing, stood Snape, but he wasn't alone. Quirrell was there, too. Harry couldn't make out the look on his face, but he was stuttering worse than ever. Harry strained to catch what they were saying.  \"... d-don't know why you wanted t-t-to meet here of all p-places, Severus...\"  \"Oh, I thought we'd keep this private,\" said Snape, his voice icy. \"Students aren't supposed to know about the Sorcerer's Stone, after all.\"  Harry leaned forward. Quirrell was mumbling something. Snape interrupted him.  \"Have you found out how to get past that beast of Hagrid's yet?\"  \"B-b-but Severus, I --\"  \"You don't want me as your enemy, Quirrell,\" said Snape, taking a step toward him.  \"I-I don't know what you  \"You know perfectly well what I mean.\"  An owl hooted loudly, and Harry nearly fell out of the tree. He steadied himself in time to hear Snape say, \"-- your little bit of hocus-pocus. I'm waiting.\"  \"B-but I d-d-don't --\"  \"Very well,\" Snape cut in. \"We'll have another little chat soon, when you've had time to think things over and decided where your loyalties lie.\"  He threw his cloak over his head and strode out of the clearing. It was almost dark now, but Harry could see Quirrell, standing quite still as though he was petrified.  \"Harry, where have you been?\" Hermione squeaked.  \"We won! You won! We won!\" shouted Ron, thumping Harry on the back. \"And I gave Malfoy a black eye, and Neville tried to take on Crabbe and Goyle single-handed! He's still out cold but Madam Pomftey says he'll be all right - talk about showing Slytherin! Everyone's waiting for you in the common room, we're having a party, Fred and George stole some cakes and stuff from the kitchens.\"  \"Never mind that now,\" said Harry breathlessly. \"Let's find an empty room, you wait 'til you hear this....\"  He made sure Peeves wasn't inside before shutting the door behind them, then he told them what he'd seen and heard.  \"So we were right, it is the Sorcerer's Stone, and Snape's trying to force Quirrell to help him get it. He asked if he knew how to get past Fluffy - and he said something about Quirrell's 'hocus pocuss-- I reckon there are other things guarding the stone apart from Fluffy, loads of enchantments, probably, and Quirrell would have done some anti-Dark Arts spell that Snape needs to break through --\"  \"So you mean the Stone's only safe as long as Quirrell stands up to Snape?\" said Hermione in alarm.  \"It'll be gone by next Tuesday,\" said Ron.   CHAPTER FOURTEEN  NORBERT THE NORWEGIAN RIDGEBACK  Quirrell, however, must have been braver than they'd thought. In the weeks that followed he did seem to be getting paler and thinner, but it didn't look as though he'd cracked yet.  Every time they passed the third-floor corridor, Harry, Ron, and Hermione would press their ears to the door to check that Fluffy was still growling inside. Snape was sweeping about in his usual bad temper, which surely meant that the Stone was still safe. Whenever Harry passed Quirrell these days he gave him an encouraging sort of smile, and Ron had started telling people off for laughing at Quirrell's stutter.  Hermione, however, had more on her mind than the Sorcerer's Stone. She had started drawing up study schedules and colorcoding all her notes. Harry and Ron wouldn't have minded, but she kept nagging them to do the same.  \"Hermione, the exams are ages away.\"  \"Ten weeks,\" Hermione snapped. \"That's not ages, that's like a second to Nicolas Flamel.\"  \"But we're not six hundred years old,\" Ron reminded her. \"Anyway, what are you studying for, you already know it A.\"  \"What am I studying for? Are you crazy? You realize we need to pass these exams to get into the second year? They're very important, I should have started studying a month ago, I don't know what's gotten into me....\"  Unfortunately, the teachers seemed to be thinking along the same lines as Hermione. They piled so much homework on them that the Easter holidays weren't nearly as much fun as the Christmas ones."
}