{
  "id": "b6a1b7abd77b358ebea0439bc7c86a0430352df5",
  "text": "  His face was blotchy, his eyes swollen, and he had gone to the other extreme where his hair was concerned; far from trying to make it behave, it now looked like a wig of tangled wire. \"Hi, Hagrid,\" said Harry. Hagrid looked up. \"'Lo,\" he said in a very hoarse voice. \"More tea, I think,\" said Dumbledore, closing the door behind Harry, Ron, and Hermione, drawing out his wand, and twiddling it; a revolving tea tray appeared in midair along with a plate of cakes.  Dumbledore magicked the tray onto the table, and everybody sat down. There was a slight pause, and then Dumbledore said, \"Did you by any chance hear what Miss Granger was shouting, Hagrid?\" Hermione went slightly pink, but Dumbledore smiled at her and continued, \"Hermione, Harry, and Ron still seem to want to know you, judging by the way they were attempting to break down the door.\" \"Of course we still want to know you!\"  Harry said, staring at Hagrid.  \"You don't think anything that Skeeter cow - sorry, Professor,\" he added quickly, looking at Dumbledore. \"I have gone temporarily deaf and haven't any idea what you said. Harry,\" said Dumbledore, twiddling his thumbs and staring at the ceiling. \"Er-right,\" said Harry sheepishly.  \"I just meant-Hagrid, how could you think we'd care what that-woman-wrote about you?\" Two fat tears leaked out of Hagrid's beetle-black eyes and fell slowly into his tangled beard. \"Living proof of what I've been telling you, Hagrid,\" said Dumbledore, still looking carefully up at the ceiling.  \"I have shown you the letters from the countless parents who remember you from their own days here, telling me in no uncertain terms that if I sacked you, they would have something to say about it -\" \"Not all of 'em,\" said Hagrid hoarsely. \"Not all of 'em wan me ter stay.\" \"Really, Hagrid, if you are holding out for universal popularity, I'm afraid you will be in this cabin for a very long time,\" said Dumbledore, now peering sternly over his half-moon spectacles.  \"Not a week has passed since I became headmaster of this school when I haven't had at least one owl complaining about the way I run it.  But what should I do?  Barricade myself in my study and refuse to talk to anybody?\" \"Yeh - yeh're not half-giant!\"  said Hagrid croakily. \"Hagrid, look what I've got for relatives!\"  Harry said furiously.  \"Look at the Dursleys!\" \"An excellent point,\" said Professor Dumbledore.  \"My own brother, Aberforth, was prosecuted for practicing inappropriate charms on a goat.  It was all over the papers, but did Aberforth hide?  No, he did not!  He held his head high and went about his business as usual! Of course, I'm not entirely sure he can read, so that may not have been bravery. . ..\" \"Come back and teach, Hagrid,\" said Hermione quietly, \"please come back, we really miss you.\" Hagrid gulped.  More tears leaked out down his cheeks and into his tangled beard. Dumbledore stood up.  \"I refuse to accept your resignation, Hagrid, and I expect you back at work on Monday,\" he said.  \"You will join me for breakfast at eight-thirty in the Great Hall.  No excuses.  Good afternoon to you all.\" Dumbledore left the cabin, pausing only to scratch Fangs ears.  When the door had shut behind him, Hagrid began to sob into his dustbin-lid-sized hands.  Hermione kept patting his arm, and at last, Hagrid looked up, his eyes very red indeed, and said, \"Great man, Dumbledore . . . great man . ..\" \"Yeah, he is,\" said Ron. \"Can I have one of these cakes, Hagrid?\"  \"Help yerself,\" said Hagrid, wiping his eyes on the back of his hand.  \"Ar, he's righ', o' course - yeh're all righ' . . .I bin stupid . .. my ol' dad woulda bin ashamed o' the way I've bin behavin'....\" More tears leaked out, but he wiped them away more forcefully, and said, \"Never shown you a picture of my old dad, have I?  Here...\" Hagrid got up, went over to his dresser, opened a drawer, and pulled out a picture of a short wizard with Hagrid's crinkled black eyes, beaming as he sat on top of Hagrid's shoulder. Hagrid was a good seven or eight feet tall, judging by the apple tree beside him, but his face was beardless, young, round, and smooth - he looked hardly older than eleven. \"Tha was taken jus' after I got inter Hogwarts,\" Hagrid croaked.  \"Dad was dead chuffed ... thought I migh' not be a wizard, see, 'cos me mum ... well, anyway.  'Course, I never was great shakes at magic, really... but at least he never saw me expelled.  Died, see, in me second year. . . .\" \"Dumbledore was the one who stuck up for me after Dad went.  Got me the gamekeeper job . . . trusts people, he does.  Gives 'em second chances ... tha's what sets him apar' from other heads, see.  He'll accept anyone at Hogwarts, s'long as they've got the talent. Knows people can turn out okay even if their families weren' ... well... all tha' respectable.  But some don understand that.  There's some who'd always hold it against yeh . . . there's some who'd even pretend they just had big bones rather than stand up an' say - I am what I am, an' I'm not ashamed."
}