{
  "id": "b6bd9b586d68ce0878fec826eea5c6f345ea7ad2",
  "text": "    It’s only a few who believe that,  Sam assured him.  Ser Alliser and his friends. Most of the brothers know better. King Stannis knows as well, I’ll wager. You brought him the Horn of Winter and captured Mance Rayder’s son.    All I did was protect Val and the babe against looters when the wildlings fled, and keep them there until the rangers found us. I never captured anyone. King Stannis keeps his men well in hand, that’s plain. He lets them plunder some, but I’ve only heard of three wildling women being raped, and the men who did it have all been gelded. I suppose I should have been killing the free folk as they ran. Ser Alliser has been putting it about that the only time I bared my sword was to defend our foes. I failed to kill Mance Rayder because I was in league with him, he says.    That’s only Ser Alliser,  said Sam.  Everyone knows the sort of man he is.  With his noble birth, his knighthood, and his long years in the Watch, Ser Alliser Thorne might have been a strong challenger for the Lord Commander’s title, but almost all the men he’d trained during his years as master-at-arms despised him. His name had been offered, of course, but after running a weak sixth on the first day and actually losing votes on the second, Thorne had withdrawn to support Lord Janos Slynt.   What everyone knows is that Ser Alliser is a knight from a noble line, and trueborn, while I’m the bastard who killed Qhorin Halfhand and bedded with a spearwife. The warg, I’ve heard them call me. How can I be a warg without a wolf, I ask you?  His mouth twisted.  I don’t even dream of Ghost anymore. All my dreams are of the crypts, of the stone kings on their thrones. Sometimes I hear Robb’s voice, and my father’s, as if they were at a feast. But there’s a wall between us, and I know that no place has been set for me.   The living have no place at the feasts of the dead. It tore the heart from Sam to hold his silence then. Bran’s not dead, Jon, he wanted to stay. He’s with friends, and they’re going north on a giant elk to find a three-eyed crow in the depths of the haunted forest. It sounded so mad that there were times Sam Tarly thought he must have dreamt it all, conjured it whole from fever and fear and hunger… but he would have blurted it out anyway, if he had not given his word.  Three times he had sworn to keep the secret; once to Bran himself, once to that strange boy Jojen Reed, and last of all to Coldhands.  The world believes the boy is dead,  his rescuer had said as they parted.  Let his bones lie undisturbed. We want no seekers coming after us. Swear it, Samwell of the Night’s Watch. Swear it for the life you owe me.   Miserable, Sam shifted his weight and said,  Lord Janos will never be chosen Lord Commander.  It was the best comfort he had to offer Jon, the only comfort.  That won’t happen.    Sam, you’re a sweet fool. Open your eyes. It’s been happening for days.  Jon pushed his hair back out of his eyes and said,  I may know nothing, but I know that. Now pray excuse me, I need to hit someone very hard with a sword.   There was naught that Sam could do but watch him stride off toward the armory and the practice yard. That was where Jon Snow spent most of his waking hours. With Ser Endrew dead and Ser Alliser disinterested, Castle Black had no master-at-arms, so Jon had taken it on himself to work with some of the rawer recruits; Satin, Horse, Hop-Robin with his clubfoot, Arron and Emrick. And when they had duties, he would train alone for hours with sword and shield and spear, or match himself against anyone who cared to take him on.  Sam, you’re a sweet fool, he could hear Jon saying, all the way back to the maester’s keep. Open your eyes. It’s been happening for days. Could he be right? A man needed the votes of two-thirds of the Sworn Brothers to become the Lord Commander of the Night’s Watch, and after nine days and nine votes no one was even close to that. Lord Janos had been gaining, true, creeping up past first Bowen Marsh and then Othell Yarwyck, but he was still well behind Ser Denys Mallister of the Shadow Tower and Cotter Pyke of Eastwatch-by-the-Sea. One of them will be the new Lord Commander, surely, Sam told himself.  Stannis had posted guards outside the maester’s door too. Within, the rooms were hot and crowded with the wounded from the battle; black brothers, king’s men, and queen’s men, all three. Clydas was shuffling amongst them with flagons of goats’ milk and dreamwine, but Maester Aemon had not yet returned from his morning call on Mance Rayder. Sam hung his cloak upon a peg and went to lend a hand. But even as he fetched and poured and changed dressings, Jon’s words nagged at him. Sam, you’re a sweet fool. Open your eyes. It’s been happening for days.  It was a good hour before he could excuse himself to feed the ravens. On the way up to the rookery, he stopped to check the tally he had made of last night’s count. At the start of the choosing, more than thirty names had been offered, but most had withdrawn once it became clear they could not win."
}