{
  "id": "b795f9bf1124ec4622e1dec27c0430d8a286d1fe",
  "text": " The bells were very loud here.  Arya squirmed through the press, ducking between the legs of horses and clutching tight to her sword stick. From the middle of the crowd, all she could see were arms and legs and stomachs, and the seven slender towers of the sept looming overhead. She spotted a wood wagon and thought to climb up on the back where she might be able to see, but others had the same idea. The teamster cursed at them and drove them off with a crack of his whip.  Arya grew frantic. Forcing her way to the front of the crowd, she was shoved up against the stone of a plinth. She looked up at Baelor the Blessed, the septon king. Sliding her stick sword through her belt, Arya began to climb. Her broken thumbnail left smears of blood on the painted marble, but she made it up, and wedged herself in between the king’s feet.  That was when she saw her father.  Lord Eddard stood on the High Septon’s pulpit outside the doors of the sept, supported between two of the gold cloaks. He was dressed in a rich grey velvet doublet with a white wolf sewn on the front in beads, and a grey wool cloak trimmed with fur, but he was thinner than Arya had ever seen him, his long face drawn with pain. He was not standing so much as being held up; the cast over his broken leg was grey and rotten.  The High Septon himself stood behind him, a squat man, grey with age and ponderously fat, wearing long white robes and an immense crown of spun gold and crystal that wreathed his head with rainbows whenever he moved.  Clustered around the doors of the sept, in front of the raised marble pulpit, were a knot of knights and high lords. Joffrey was prominent among them, his raiment all crimson, silk and satin patterned with prancing stags and roaring lions, a gold crown on his head. His queen mother stood beside him in a black mourning gown slashed with crimson, a veil of black diamonds in her hair. Arya recognized the Hound, wearing a snowy white cloak over his dark grey armor, with four of the Kingsguard around him. She saw Varys the eunuch gliding among the lords in soft slippers and a patterned damask robe, and she thought the short man with the silvery cape and pointed beard might be the one who had once fought a duel for Mother.  And there in their midst was Sansa, dressed in sky-blue silk, with her long auburn hair washed and curled and silver bracelets on her wrists. Arya scowled, wondering what her sister was doing here, why she looked so happy.  A long line of gold-cloaked spearmen held back the crowd, commanded by a stout man in elaborate armor, all black lacquer and gold filigree. His cloak had the metallic shimmer of true cloth-of-gold.  When the bell ceased to toll, a quiet slowly settled across the great plaza, and her father lifted his head and began to speak, his voice so thin and weak she could scarcely make him out. People behind her began to shout out,  What?  and  Louder!  The man in the black-and-gold armor stepped up behind Father and prodded him sharply. You leave him alone! Arya wanted to shout, but she knew no one would listen. She chewed her lip.  Her father raised his voice and began again.  I am Eddard Stark, Lord of Winterfell and Hand of the King,  he said more loudly, his voice carrying across the plaza,  and I come before you to confess my treason in the sight of gods and men.    No,  Arya whimpered. Below her, the crowd began to scream and shout. Taunts and obscenities filled the air. Sansa had hidden her face in her hands.  Her father raised his voice still higher, straining to be heard.  I betrayed the faith of my king and the trust of my friend, Robert,  he shouted.  I swore to defend and protect his children, yet before his blood was cold, I plotted to depose and murder his son and seize the throne for myself. Let the High Septon and Baelor the Beloved and the Seven bear witness to the truth of what I say: Joffrey Baratheon is the one true heir to the Iron Throne, and by the grace of all the gods, Lord of the Seven Kingdoms and Protector of the Realm.   A stone came sailing out of the crowd. Arya cried out as she saw her father hit. The gold cloaks kept him from falling. Blood ran down his face from a deep gash across his forehead. More stones followed. One struck the guard to Father’s left. Another went clanging off the breastplate of the knight in the black-and-gold armor. Two of the Kingsguard stepped in front of Joffrey and the queen, protecting them with their shields.  Her hand slid beneath her cloak and found Needle in its sheath. She tightened her fingers around the grip, squeezing as hard as she had ever squeezed anything. Please, gods, keep him safe, she prayed. Don’t let them hurt my father.  The High Septon knelt before Joffrey and his mother.  As we sin, so do we suffer,  he intoned, in a deep swelling voice much louder than Father’s.  This man has confessed his crimes in the sight of gods and men, here in this holy place.  Rainbows danced around his head as he lifted his hands in entreaty."
}