{
  "id": "b827d7082785e35d37e60a1af7c0fa1edce153a1",
  "text": " \"What the - ?\"  gasped Ron as he sprang to his feet again, staring up at the thing that had appeared. For a split second, Harry thought it was another leprechaun formation. Then he realized that it was a colossal skull, comprised of what looked like emerald stars, with a serpent protruding from its mouth like a tongue. As they watched, it rose higher and higher, blazing in a haze of greenish smoke, etched against the black sky like a new constellation.  Suddenly, the wood all around them erupted with screams. Harry didn't understand why, but the only possible cause was the sudden appearance of the skull, which had now risen high enough to illuminate the entire wood like some grisly neon sign. He scanned the darkness for the person who had conjured the skull, but he couldn't see anyone. \"Who's there?\" he called again. \"Harry, come on, move!\"  Hermione had seized the collar of his jacket and was tugging him backward. \"What's the matter?\" Harry said, startled to see her face so white and terrified. \"It's the Dark Mark, Harry!\" Hermione moaned, pulling him as hard as she could. \"You-Know-Who's sign!\" \"Voldemort's - \"Harry, come on!\" Harry turned - Ron was hurriedly scooping up his miniature Krum - the three of them started across the clearing - but before they had taken a few hurried steps, a series of popping noises announced the arrival of twenty wizards, appearing from thin air, surrounding them. Harry whirled around, and in an instant, he registered one fact:  Each of these wizards had his wand out, and every wand was pointing right at himself, Ron, and Hermione. Without pausing to think, he yelled, \"DUCK!\" He seized the other two and pulled them down onto the ground. \"STUPEFY!\"  roared twenty voices - there was a blinding series of flashes and Harry felt the hair on his head ripple as though a powerful wind had swept the clearing.  Raising his head a fraction of an inch he saw jets of fiery red light flying over them from the wizards' wands, crossing one another, bouncing off tree trunks, rebounding into the darkness--  \"Stop!\"  yelled a voice he recognized. \"STOP!  That's my son!\"  Harry's hair stopped blowing about.  He raised his head a little higher. The wizard in front of him had lowered his wand.  He rolled over and saw Mr. Weasley striding toward them, looking terrified. \"Ron - Harry\" - his voice sounded shaky - \"Hermione - are you all right?\" \"Out of the way, Arthur,\" said a cold, curt voice. It was Mr. Crouch.  He and the other Ministry wizards were closing in on them. Harry got to his feet to face them.  Mr. Crouch's face was taut with rage. \"Which of you did it?\" he snapped, his sharp eyes darting between them. \"Which of you conjured the Dark Mark?\" \"We didn't do that!\" said Harry, gesturing up at the skull.  \"We didn't do anything!\" said Ron, who was rubbing his elbow and looking indignantly at his father. \"What did you want to attack us for?\" \"Do not lie, sir!\" shouted Mr. Crouch. His wand was still pointing directly at Ron, and his eyes were popping - he looked slightly mad. \"You have been discovered at the scene of the crime!\" \"Barty,\" whispered a witch in a long woolen dressing gown, \"they're kids, Barty, they'd never have been able to \"Where did the Mark come from, you three?\" said Mr. Weasley quickly. \"Over there,\" said Hermione shakily, pointing at the place where they had heard the voice. \"There was someone behind the trees. . . they shouted words - an incantation -\"  \"Oh, stood over there, did they?\" said Mr. Crouch, turning his popping eyes on Hermione now, disbelief etched all over his face. \"Said an incantation, did they? You seem very well informed about how that Mark is summoned, missy -\" But none of the Ministry wizards apart from Mr. Crouch seemed to think it remotely likely that Harry, Ron, or Hermione had conjured the skull; on the contrary, at Hermione's words, they had all raised their wands again and were pointing in the direction she had indicated, squinting through the dark trees. \"We're too late,\" said the witch in the woolen dressing gown, shaking her head. \"They'll have Disapparated.\" \"I don't think so,\" said a wizard with a scrubby brown beard. It was Amos Diggory, Cedric's father. \"Our Stunners went right through those trees. . . . There's a good chance we got them. . . \"Amos, be careful!\" said a few of the wizards warningly as Mr. Diggory squared his shoulders, raised his wand, marched across the clearing, and disappeared into the darkness. Hermione watched him vanish with her hands over her mouth. A few seconds later, they heard Mr. Diggory shout. \"Yes! We got them! There's someone here! Unconscious! It's - but - blimey. . \"You've got someone?\" shouted Mr. Crouch, sounding highly disbelieving. \"Who? Who is it?\" They heard snapping twigs, the rustling of leaves, and then crunching footsteps as Mr. Diggory reemerged from behind the trees. He was carrying a tiny, limp figure in his arms. Harry recognized the tea towel at once.  It was Winky. Mr. Crouch did not move or speak as Mr."
}