{
  "id": "b8a8e39b335a59ca94f7201b52f39a61de7ad097",
  "text": "   A bastard,  Jon said with a laugh.  You can say it, Sam. I’ve heard the word before.  He put the spurs to his surefooted little garron.  I need to hunt down Ser Ottyn. Be careful around Craster’s women.  As if Samwell Tarly needed warning on that score.  We’ll talk later, after we’ve made camp.   Jon carried the word back to Ser Ottyn Wythers, plodding along with the rear guard. A small prune-faced man of an age with Mormont, Ser Ottyn always looked tired, even at Castle Black, and the rain had beaten him down unmercifully.  Welcome tidings,  he said.  This wet has soaked my bones, and even my saddle sores complain of saddle sores.   On his way back, Jon swung wide of the column’s line of march and took a shorter path through the thick of the wood. The sounds of man and horse diminished, swallowed up by the wet green wild, and soon enough he could hear only the steady wash of rain against leaf and tree and rock. It was midafternoon, yet the forest seemed as dark as dusk. Jon wove a path between rocks and puddles, past great oaks, grey-green sentinels, and black-barked ironwoods. In places the branches wove a canopy overhead and he was given a moment’s respite from the drumming of the rain against his head. As he rode past a lightning-blasted chestnut tree overgrown with wild white roses, he heard something rustling in the underbrush.  Ghost,  he called out.  Ghost, to me.   But it was Dywen who emerged from the greenery, forking a shaggy grey garron with Grenn ahorse beside him. The Old Bear had deployed outriders to either side of the main column, to screen their march and warn of the approach of any enemies, and even there he took no chances, sending the men out in pairs.   Ah, it’s you, Lord Snow.  Dywen smiled an oaken smile; his teeth were carved of wood, and fit badly.  Thought me and the boy had us one o’ them Others to deal with. Lose your wolf?    He’s off hunting.  Ghost did not like to travel with the column, but he would not be far. When they made camp for the night, he’d find his way to Jon at the Lord Commander’s tent.   Fishing, I’d call it, in this wet,  Dywen said.   My mother always said rain was good for growing crops,  Grenn put in hopefully.   Aye, a good crop of mildew,  Dywen said.  The best thing about a rain like this, it saves a man from taking baths.  He made a clacking sound on his wooden teeth.   Buckwell’s found Craster,  Jon told them.   Had he lost him?  Dywen chuckled.  See that you young bucks don’t go nosing about Craster’s wives, you hear?   Jon smiled.  Want them all for yourself, Dywen?   Dywen clacked his teeth some more.  Might be I do. Craster’s got ten fingers and one cock, so he don’t count but to eleven. He’d never miss a couple.    How many wives does he have, truly?  Grenn asked.   More’n you ever will, brother. Well, it’s not so hard when you breed your own. There’s your beast, Snow.   Ghost was trotting along beside Jon’s horse with tail held high, his white fur ruffed up thick against the rain. He moved so silently Jon could not have said just when he appeared. Grenn’s mount shied at the scent of him; even now, after more than a year, the horses were uneasy in the presence of the direwolf.  With me, Ghost.  Jon spurred off to Craster’s Keep.  He had never thought to find a stone castle on the far side of the Wall, but he had pictured some sort of motte-and-bailey with a wooden palisade and a timber tower keep. What they found instead was a midden heap, a pigsty, an empty sheepfold, and a windowless daub-and-wattle hall scarce worthy of the name. It was long and low, chinked together from logs and roofed with sod. The compound stood atop a rise too modest to name a hill, surrounded by an earthen dike. Brown rivulets flowed down the slope where the rain had eaten gaping holes in the defenses, to join a rushing brook that curved around to the north, its thick waters turned into a murky torrent by the rains.  On the southwest, he found an open gate flanked by a pair of animal skulls on high poles: a bear to one side, a ram to the other. Bits of flesh still clung to the bear skull, Jon noted as he joined the line riding past. Within, Jarmen Buckwell’s scouts and men from Thoren Smallwood’s van were setting up horse lines and struggling to raise tents. A host of piglets rooted about three huge sows in the sty. Nearby, a small girl pulled carrots from a garden, naked in the rain, while two women tied a pig for slaughter. The animal’s squeals were high and horrible, almost human in their distress. Chett’s hounds barked wildly in answer, snarling and snapping despite his curses, with a pair of Craster’s dogs barking back. When they saw Ghost, some of the dogs broke off and ran, while others began to bay and growl. The direwolf ignored them, as did Jon.  Well, thirty of us will be warm and dry, Jon thought once he’d gotten a good look at the hall. Perhaps as many as fifty. The place was much too small to sleep two hundred men, so most would need to remain outside. And where to put them? The rain had turned half the compound yard to ankle-deep puddles and the rest to sucking mud."
}