{
  "id": "bb5f0eb5158625cf0147ea30a19129dc613e087f",
  "text": "  Catelyn slapped him so hard she broke his lip. Olyvar, she thought, and Perwyn, Alesander, all absent. And Roslin wept…  Edwyn Frey shoved her aside. The music drowned all other sound, echoing off the walls as if the stones themselves were playing. Robb gave Edwyn an angry look and moved to block his way… and staggered suddenly as a quarrel sprouted from his side, just beneath the shoulder. If he screamed then, the sound was swallowed by the pipes and horns and fiddles. Catelyn saw a second bolt pierce his leg, saw him fall. Up in the gallery, half the musicians had crossbows in their hands instead of drums or lutes. She ran toward her son, until something punched in the small of the back and the hard stone floor came up to slap her.  Robb!  she screamed. She saw Smalljon Umber wrestle a table off its trestles. Crossbow bolts thudded into the wood, one two three, as he flung it down on top of his king. Robin Flint was ringed by Freys, their daggers rising and falling. Ser Wendel Manderly rose ponderously to his feet, holding his leg of lamb. A quarrel went in his open mouth and came out the back of his neck. Ser Wendel crashed forward, knocking the table off its trestles and sending cups, flagons, trenchers, platters, turnips, beets, and wine bouncing, spilling, and sliding across the floor.  Catelyn’s back was on fire. I have to reach him. The Smalljon bludgeoned Ser Raymund Frey across the face with a leg of mutton. But when he reached for his swordbelt a crossbow bolt drove him to his knees. In a coat of gold or a coat of red, a lion still has claws. She saw Lucas Blackwood cut down by Ser Hosteen Frey. One of the Vances was hamstrung by Black Walder as he was wrestling with Ser Harys Haigh. And mine are long and sharp, my lord, as long and sharp as yours. The crossbows took Donnel Locke, Owen Norrey, and half a dozen more. Young Ser Benfrey had seized Dacey Mormont by the arm, but Catelyn saw her grab up a flagon of wine with her other hand, smash it full in his face, and run for the door. It flew open before she reached it. Ser Ryman Frey pushed into the hall, clad in steel from helm to heel. A dozen Frey men-at-arms packed the door behind him. They were armed with heavy longaxes.   Mercy!  Catelyn cried, but horns and drums and the clash of steel smothered her plea. Ser Ryman buried the head of his axe in Dacey’s stomach. By then men were pouring in the other doors as well, mailed men in shaggy fur cloaks with steel in their hands. Northmen! She took them for rescue for half a heartbeat, till one of them struck the Smalljon’s head off with two huge blows of his axe. Hope blew out like a candle in a storm.  In the midst of slaughter, the Lord of the Crossing sat on his carved oaken throne, watching greedily.  There was a dagger on the floor a few feet away. Perhaps it had skittered there when the Smalljon knocked the table off its trestles, or perhaps it had fallen from the hand of some dying man. Catelyn crawled toward it. Her limbs were leaden, and the taste of blood was in her mouth. I will kill Walder Frey, she told herself. Jinglebell was closer to the knife, hiding under a table, but he only cringed away as she snatched up the blade. I will kill the old man, I can do that much at least.  Then the tabletop that the Smalljon had flung over Robb shifted, and her son struggled to his knees. He had an arrow in his side, a second in his leg, a third through his chest. Lord Walder raised a hand, and the music stopped, all but one drum. Catelyn heard the crash of distant battle, and closer the wild howling of a wolf. Grey Wind, she remembered too late.  Heh,  Lord Walder cackled at Robb,  the King in the North arises. Seems we killed some of your men, Your Grace. Oh, but I’ll make you an apology, that will mend them all again, heh.   Catelyn grabbed a handful of Jinglebell Frey’s long grey hair and dragged him out of his hiding place.  Lord Walder!  she shouted.  LORD WALDER!  The drum beat slow and sonorous, doom boom doom.  Enough,  said Catelyn.  Enough, I say. You have repaid betrayal with betrayal, let it end.  When she pressed her dagger to Jinglebell’s throat, the memory of Bran’s sickroom came back to her, with the feel of steel at her own throat. The drum went boom doom boom doom boom doom.  Please,  she said.  He is my son. My first son, and my last. Let him go. Let him go and I swear we will forget this… forget all you’ve done here. I swear it by the old gods and new, we… we will take no vengeance…   Lord Walder peered at her in mistrust.  Only a fool would believe such blather. D’you take me for a fool, my lady?    I take you for a father. Keep me for a hostage, Edmure as well if you haven’t killed him. But let Robb go.    No.  Robb’s voice was whisper faint.  Mother, no…    Yes. Robb, get up. Get up and walk out, please, please. Save yourself… if not for me, for Jeyne.    Jeyne?  Robb grabbed the edge of the table and forced himself to stand.  Mother,  he said,  Grey Wind…    Go to him. Now."
}