{
  "id": "bca717ffc4ab914aef0a77676db21bc9ce1336d8",
  "text": "  Harry was halfway along the passage to the bar, which was now very dark, when he heard another pair of angry voices coming from the parlor. A second later, he recognized them as Mr. and Mrs.  Weasleys'. He hesitated, not wanting them to know he'd heard them arguing, when the sound of his own name made him stop, then move closer to the parlor door.  \"--makes no sense not to tell him,\" Mr. Weasley was saying heatedly. \"Harry's got a right to know. I've tried to tell Fudge, but he insists on treating Harry like a child. He's thirteen years old and --\"  \"Arthur, the truth would terrify him!\" said Mrs. Weasley shrilly. \"Do you really want to send Harry back to school with that hanging over him? For heaven's sake, he's happy not knowing!\"  \"I don't want to make him miserable, I want to put him on his guard!\" retorted Mr. Weasley. \"You know what Harry and Ron are like, wandering off by themselves -- they've ended up in the Forbidden Forest twice! But Harry mustn't do that this year! When I think what could have happened to him that night he ran away from home! If the Knight Bus hadn't picked him up, I'm prepared to bet he would have been dead before the Ministry found him.\"  \"But he's not dead, he's fine, so what's the point  \"Molly, they say Sirius Black's mad, and maybe he is, but he was clever enough to escape from Azkaban, and that's supposed to be impossible. It's been three weeks, and no one's seen hide nor hair of him, and I don't care what Fudge keeps telling the Daily Prophet, we're no nearer catching Black than inventing self-spelling wands. The only thing we know for sure is what Black's after  \"But Harry will be perfectly safe at Hogwarts.\"  \"We thought Azkaban was perfectly safe. If Black can break out of Azkaban, he can break into Hogwarts.\"  \"But no one's really sure that Black's after Harry  There was a thud on wood, and Harry was sure Mr. Weasley had banged his fist on the table.  \"Molly, how many times do I have to tell you? They didn't report it in the press because Fudge wanted it kept quiet, but Fudge went out to Azkaban the night Black escaped. The guards told Fudge that Blacks been talking in his sleep for a while now. Always the same words: 'He's at Hogwarts... he's at Hogwarts.' Black is deranged, Molly, and he wants Harry dead. If you ask me, he thinks murdering Harry will bring You-Know-Who back to pow er. Black lost everything the night Harry stopped You- Know-Who, and he's had twelve years alone in Azkaban to brood on that....\"  There was a silence. Harry leaned still closer to the door, desperate to hear more.  \"Well, Arthur, you must do what you think is right. But you're forgetting Albus Dumbledore. I don't think anything could hurt Harry at Hogwarts while Dumbledore's headmaster. I suppose he knows about all this?\"  \"Of course he knows. We had to ask him if he minds the Azkaban guards stationing themselves around the entrances to the school grounds. He wasn't happy about it, but he agreed.\"  \"Not happy? Why shouldn't he be happy, if they're there to catch Black?\"  \"Dumbledore isn't fond of the Azkaban guards,\" said Mr. Weasley heavily. \"Nor am 1, if it comes to that... but when you're dealing with a wizard like Black, you sometimes have to join forces with those you'd rather avoid.\"  \"If they save Harry then I will never say another word against them, said Mr. Weasley wearily. \"It's late, Molly, we'd better go up....\"  Harry heard chairs move. As quietly as he could, he hurried down the passage to the bar and out of sight. The parlor door opened, and a few seconds later footsteps told him that Mr. and Mrs. Weasley were climbing the stairs.  The bottle of rat tonic was lying under the table they had sat at earlier. Harry waited until he heard Mr. and Mrs. Weasley's bedroom door close, then headed back upstairs with the bottle.  Fred and George were crouching in the shadows on the landing, heaving with laughter as they listened to Percy dismantling his and Ron's room in search of his badge.  \"We've got it,\" Fred whispered to Harry. \"We've been improving it.\"  The badge now read Bighead Boy.  Harry forced a laugh, went to give Ron the rat tonic, then shut himself in his room and lay down on his bed.  So Sirius Black was after him. This explained everything. Fudge had been lenient with him because he was so relieved to find him alive. He'd made Harry promise to stay in Diagon Alley where there were plenty of wizards to keep an eye on him. And he was sending two Ministry cars to take them all to the station tomorrow, so that the Weasleys could look after Harry until he was on the train.  Harry lay listening to the muffled shouting next door and wondered why he didn't feel more scared. Sirius Black had murdered thirteen people with one curse; Mr. and Mrs, Weasley obviously thought Harry would be panic-stricken if he knew the truth. But Harry happened to agree wholeheartedly with Mrs. Weasley that the safest place on earth was wherever Albus Dumbledore happened to be. Didn't people always say that Dumbledore was the only person Lord Voldemort had ever been afraid of? Surely Black, as Voldemort's right-hand man, would be just as frightened of him?  And then there were these Azkaban guards everyone kept talking about."
}