{
  "id": "be1067afe57829dc48c474732bb4d5eaf6b6caa8",
  "text": " `But you had better tell us about it, and  let  us know  the worst at once.'       'The road  that I speak  of leads to the Mines of Moria,' said Gandalf.   Only  Gimli lifted  up his head; a smouldering fire  was in his eyes. On all  the others a dread fell at  the mention of that name. Even to the hobbits it  was a legend of vague fear:       `The road  may lead  to Moria,  but how can  we  hope that it will lead  through Moria? ' said Aragorn darkly.       `It  is a name of ill omen,' said Boromir. `Nor do I see the need to go  there. If we cannot cross the mountains, let us journey southwards, until we  come  to the Gap of Rohan, where men  are friendly to  my people, taking the  road that  I followed on my way  hither. Or we might  pass by  and cross the  Isen into Langstrand and  Lebennin,  and so come to Gondor from the  regions  nigh to the sea.'       'Things have changed since you came  north, Boromir,' answered Gandalf.   'Did you not hear what I  told you  of Saruman? With him I may have business  of my own ere all is over. But the Ring must not come near Isengard, if that  can by any means be prevented. The Gap of Rohan is closed to  us while we go  with the Bearer.       'As  for the longer road:  we cannot  afford the time. We might spend a   year in such a journey, and we should pass through many lands that are empty  and  harbourless.  Yet  they would not  be safe. The watchful  eyes  both of  Saruman and of the Enemy are on them. When you came north, Boromir, you  were  in the  Enemy's eyes only one stray wanderer from the South and a matter  of  small concern to  him: his  mind was busy with the pursuit of the  Ring. But  you return now as  a member of the Ring's  Company, and you  are in peril as  long as you remain with us. The danger will increase  with every league that  we go south under the naked sky.       `Since our open attempt on the mountain-pass our plight has become more  desperate, I  fear. I  see now little  hope, if  we  do not soon vanish from  sight for a while, and cover our trail. Therefore I advise that we should go  neither over the mountains, nor round them, but  under them. That  is a road  at any rate that the Enemy will least expect us to take.'       `We do not  know what  he expects,' said  Boromir. `He  may  watch  all  roads, likely and  unlikely. In  that case to enter  Moria would  be to walk   into  a  trap, hardly better than knocking at  the  gates of  the Dark Tower    ####-itself. The name of Moria is black.'       `You speak  of  what  you do not  know,  when you  liken  Moria to  the  stronghold of Sauron,' answered Gandalf.  `I alone of you  have ever been in  the dungeons of the Dark Lord, and only in  his older and lesser dwelling in   Dol Guldur. Those who pass the gates of Barad-dyr do not return. But I wou ld  not lead you into Moria if there  were no hope of coming out again. If there  are Orcs there,  it may prove ill for us, that is true. But most of the Orcs  of the Misty Mountains were  scattered or  destroyed  in the Battle  of Five  Armies. The Eagles report that Orcs are gathering again from afar; but there  is a hope that Moria is still free.       `There is  even a chance that Dwarves are  there, and that in some deep  hall of his fathers, Balin son of Fundin may be found. However it may prove,  one must tread the path that need chooses!'       'I will tread the  path with you, Gandalf! ' said Gimli. 'I will go and  look on  the halls of Durin, whatever may  wait  there-if  you can  find the  doors that are shut.'       'Good,  Gimli!  '  said  Gandalf.  `You encourage me. We  will seek the  hidden  doors together.  And  we will come  through.  In  the  ruins of  the  Dwarves, a dwarf's head  will be less easy to bewilder than Elves or Men  or   Hobbits. Yet it  will not  be the first time  that  I have been to  Moria. I  sought  there long for Thrbin son of  Thrur  after  he  was  lost.  I passed  through, and I came out again alive! '       `I too once passed the Dimrill Gate,' said Aragorn quietly; 'but though  I also came out again, the memory is very evil. I do not wish to enter Moria   a second time.'       'And I don't wish to enter it even once,' said Pippin.       'Nor me,' muttered Sam.       `Of course not!  ' said Gandalf.  'Who would? But  the question is: who  will follow me, if I lead you there? '       'I will,' said Gimli eagerly.       'I  will,' said  Aragorn  heavily.  `You  followed  my  lead almost  to  disaster in  the  snow, and have said no  word of  blame. I will follow your  lead  now  -- if this last warning does not move you. It is  not of the Ring,  nor of  us others that  I am thinking now, but of you, Gandalf. And I say to  you: if you pass the doors of Moria, beware! '       `I  will not go,' said Boromir;  'not  unless  the vote  of  the  whole  company  is  against me.  What  do  Legolas and  the  little  folk  say? The   ####-Ring-bearer's voice surely should be heard? '       'I do not wish to go to Moria,' said Legolas."
}