{
  "id": "be44988c4c9b8624379475aa7e33943191e0f787",
  "text": "  You came to us outlaws,  he began,  poachers, rapers, debtors, killers, and thieves. You came to us children. You came to us alone, in chains, with neither friends nor honor. You came to us rich, and you came to us poor. Some of you bear the names of proud houses. Others have only bastards’ names, or no names at all. It makes no matter. All that is past now. On the Wall, we are all one house.   At evenfall, as the sun sets and we face the gathering night, you shall take your vows. From that moment, you will be a Sworn Brother of the Night’s Watch. Your crimes will be washed away, your debts forgiven. So too you must wash away your former loyalties, put aside your grudges, forget old wrongs and old loves alike. Here you begin anew.   A man of the Night’s Watch lives his life for the realm. Not for a king, nor a lord, nor the honor of this house or that house, neither for gold nor glory nor a woman’s love, but for the realm, and all the people in it. A man of the Night’s Watch takes no wife and fathers no sons. Our wife is duty. Our mistress is honor. And you are the only sons we shall ever know.   You have learned the words of the vow. Think carefully before you say them, for once you have taken the black, there is no turning back. The penalty for desertion is death.  The Old Bear paused for a moment before he said,  Are there any among you who wish to leave our company? If so, go now, and no one shall think the less of you.   No one moved.   Well and good,  said Mormont.  You may take your vows here at evenfall, before Septon Celladar and the first of your order. Do any of you keep to the old gods?   Jon stood.  I do, my lord.    I expect you will want to say your words before a heart tree, as your uncle did,  Mormont said.   Yes, my lord,  Jon said. The gods of the sept had nothing to do with him; the blood of the First Men flowed in the veins of the Starks.  He heard Grenn whispering behind him.  There’s no godswood here. Is there? I never saw a godswood.    You wouldn’t see a herd of aurochs until they trampled you into the snow,  Pyp whispered back.   I would so,  Grenn insisted.  I’d see them a long way off.   Mormont himself confirmed Grenn’s doubts.  Castle Black has no need of a godswood. Beyond the Wall the haunted forest stands as it stood in the Dawn Age, long before the Andals brought the Seven across the narrow sea. You will find a grove of weirwoods half a league from this spot, and mayhap your gods as well.    My lord.  The voice made Jon glance back in surprise. Samwell Tarly was on his feet. The fat boy wiped his sweaty palms against his tunic.  Might I… might I go as well? To say my words at this heart tree?    Does House Tarly keep the old gods too?  Mormont asked.   No, my lord,  Sam replied in a thin, nervous voice. The high officers frightened him, Jon knew, the Old Bear most of all.  I was named in the light of the Seven at the sept on Horn Hill, as my father was, and his father, and all the Tarlys for a thousand years.    Why would you forsake the gods of your father and your House?  wondered Ser Jaremy Rykker.   The Night’s Watch is my House now,  Sam said.  The Seven have never answered my prayers. Perhaps the old gods will.    As you wish, boy,  Mormont said. Sam took his seat again, as did Jon.  We have placed each of you in an order, as befits our need and your own strengths and skills.  Bowen Marsh stepped forward and handed him a paper. The Lord Commander unrolled it and began to read.  Haider, to the builders,  he began. Haider gave a stiff nod of approval.  Grenn, to the rangers. Albett, to the builders. Pypar, to the rangers.  Pyp looked over at Jon and wiggled his ears.  Samwell, to the stewards.  Sam sagged with relief, mopping at his brow with,a scrap of silk.  Matthar, to the rangers. Dareon, to the stewards. Todder, to the rangers. Jon, to the stewards.   The stewards? For a moment Jon could not believe what he had heard. Mormont must have read it wrong. He started to rise, to open his mouth, to tell them there had been a mistake… and then he saw Ser Alliser studying him, eyes shiny as two flakes of obsidian, and he knew.  The Old Bear rolled up the paper.  Your firsts will instruct you in your duties. May all the gods preserve you, brothers.  The Lord Commander favored them with a half bow, and took his leave. Ser Alliser went with him, a thin smile on his face. Jon had never seen the master-at-arms took quite so happy.   Rangers with me,  Ser Jaremy Rykker called when they were gone. Pyp was staring at Jon as he got slowly to his feet. His ears were red. Grenn, grinning broadly, did not seem to realize that anything was amiss. Matt and Toad fell in beside them, and they followed Ser Jaremy from the sept.   Builders,  announced lantern-jawed Othell Yarwyck. Haider and Albett trailed out after him.  Jon looked around him in sick disbelief. Maester Aemon’s blind eyes were raised toward the light he could not see. The septon was arranging crystals on the altar. Only Sam and Darcon remained on the benches; a fat boy, a singer… and him."
}