{
  "id": "bec11506040ca887caec4d5c0f44a8108a696982",
  "text": "  Arya squirmed in the saddle and felt the links of the Hound’s mail digging into her back. His arms encircled her; on the left, the burned arm, he’d donned a steel vambrace for protection, but she’d seen him change the dressings, and the flesh beneath was still raw and seeping. If the burns pained him, though, Sandor Clegane gave no hint of it.   Is this the Blackwater Rush?  They had ridden so far in rain and darkness, through trackless woods and nameless villages, that Arya had lost all sense of where they were.   It’s a river we need to cross, that’s all you need to know.  Clegane would answer her from time to time, but he had warned her not to talk back. He had given her a lot of warnings that first day.  The next time you hit me, I’ll tie your hands behind your back,  he’d said.  The next time you try and run off, I’ll bind your feet together. Scream or shout or bite me again, and I’ll gag you. We can ride double, or I can throw you across the back of the horse trussed up like a sow for slaughter. Your choice.   She had chosen to ride, but the first time they made camp she’d waited until she thought he was asleep, and found a big jagged rock to smash his ugly head in. Quiet as a shadow, she told herself as she crept toward him, but that wasn’t quiet enough. The Hound hadn’t been asleep after all. Or maybe he’d woken. Whichever it was, his eyes opened, his mouth twitched, and he took the rock away from her as if she were a baby. The best she could do was kick him.  I’ll give you that one,  he said, when he flung the rock into the bushes.  But if you’re stupid enough to try again, I’ll hurt you.    Why don’t you just kill me like you did Mycah?  Arya had screamed at him. She was still defiant then, more angry than scared.  He answered by grabbing the front of her tunic and yanking her within an inch of his burned face.  The next time you say that name I’ll beat you so bad you’ll wish I killed you.   After that, he rolled her in his horse blanket every night when he went to sleep, and tied ropes around her top and bottom so she was bound up as tight as a babe in swaddling clothes.  It has to be the Blackwater, Arya decided as she watched the rain lash the river. The Hound was Joffrey’s dog; he was taking her back to the Red Keep, to hand to Joffrey and the queen. She wished that the sun would come out, so she could tell which way they were going. The more she looked at the moss on the trees the more confused she got. The Blackwater wasn’t so wide at King’s Landing, but that was before the rains.   The fords will all be gone,  Sandor Clegane said,  and I wouldn’t care to try and swim over neither.   There’s no way across, she thought. Lord Beric will catch us for sure. Clegane had pushed his big black stallion hard, doubling back thrice to throw off pursuit, once even riding half a mile up the center of a swollen stream… but Arya still expected to see the outlaws every time she looked back. She had tried to help them by scratching her name on the trunks of trees when she went in the bushes to make water, but the fourth time she did it he caught her, and that was the end of that. It doesn’t matter, Arya told herself, Thoros will find me in his flames. Only he hadn’t. Not yet, anyway, and once they crossed the river…   Harroway town shouldn’t be far,  the Hound said.  Where Lord Roote stables Old King Andahar’s two-headed water horse. Maybe we’ll ride across.   Arya had never heard of Old King Andahar. She’d never seen a horse with two heads either, especially not one who could run on water, but she knew better than to ask. She held her tongue and sat stiff as the Hound turned the stallion’s head and trotted along the ridgeline, following the river downstream. At least the rain was at their backs this way. She’d had enough of it stinging her eyes half-blind and washing down her cheeks like she was crying. Wolves never cry, she reminded herself again.  It could not have been much past noon, but the sky was dark as dusk. They had not seen the sun in more days than she could count. Arya was soaked to the bone, saddle-sore, sniffling, and achy. She had a fever too, and sometimes shivered uncontrollably, but when she’d told the Hound that she was sick he’d only snarled at her.  Wipe your nose and shut your mouth,  he told her. Half the time he slept in the saddle now, trusting his stallion to follow whatever rutted farm track or game trail they were on. The horse was a heavy courser, almost as big as a destrier but much faster. Stranger, the Hound called him. Arya had tried to steal him once, when Clegane was taking a piss against a tree, thinking she could ride off before he could catch her. Stranger had almost bitten her face off. He was gentle as an old gelding with his master, but otherwise he had a temper as black as he was. She had never known a horse so quick to bite or kick.  They rode beside the river for hours, splashing across two muddy vassal streams before they reached the place that Sandor Clegane had spoken of."
}