{
  "id": "bfce1d17e732e37c346cd213689ba385504c572e",
  "text": "  The touch of Joffrey’s hand on her sleeve made her heart beat faster.  What would you like to do?   Be with you, Sansa thought, but she said,  Whatever you’d like to do, my prince.   Jofftey reflected a moment.  We could go riding.    Oh, I love riding,  Sansa said.  Joffrey glanced back at Lady, who was following at their heels.  Your wolf is liable to frighten the horses, and my dog seems to frighten you. Let us leave them both behind and set off on our own, what do you say?   Sansa hesitated.  If you like,  she said uncertainly.  I suppose I could tie Lady up.  She did not quite understand, though.  I didn’t know you had a dog…   Joffrey laughed.  He’s my mother’s dog, in truth. She has set him to guard me, and so he does.    You mean the Hound,  she said. She wanted to hit herself for being so slow. Her prince would never love her if she seemed stupid.  Is it safe to leave him behind?   Prince Joffrey looked annoyed that she would even ask.  Have no fear, lady. I am almost a man grown, and I don’t fight with wood like your brothers. All I need is this.  He drew his sword and showed it to her; a longsword adroitly shrunken to suit a boy of twelve, gleaming blue steel, castle-forged and double-edged, with a leather grip and a lion’s-head pommel in gold. Sansa exclaimed over it admiringly, and Joffrey looked pleased.  I call it Lion’s Tooth,  he said.  And so they left her direwolf and his bodyguard behind them, while they ranged east along the north bank of the Trident with no company save Lion’s Tooth.  It was a glorious day, a magical day. The air was warm and heavy with the scent of flowers, and the woods here had a gentle beauty that Sansa had never seen in the north. Prince Joffrey’s mount was a blood bay courser, swift as the wind, and he rode it with reckless abandon, so fast that Sansa was hard-pressed to keep up on her mare. It was a day for adventures. They explored the caves by the riverbank, and tracked a shadowcat to its lair, and when they grew hungry, Joffrey found a holdfast by its smoke and told them to fetch food and wine for their prince and his lady. They dined on trout fresh from the river, and Sansa drank more wine than she had ever drunk before.  My father only lets us have one cup, and only at feasts,  she confessed to her prince.   My betrothed can drink as much as she wants,  Joffrey said, refilling her cup.  They went more slowly after they had eaten. Joffrey sang for her as they rode, his voice high and sweet and pure. Sansa was a little dizzy from the wine.  Shouldn’t we be starting back?  she asked.   Soon,  Joffrey said.  The battleground is right up ahead, where the river bends. That was where my father killed Rhaegar Targaryen, you know. He smashed in his chest, crunch, right through the armor.  Joffrey swung an imaginary warhammer to show her how it was done.  Then my uncle Jaime killed old Aerys, and my father was king. What’s that sound?   Sansa heard it too, floating through the woods, a kind of wooden clattering, snack snack snack.  I don’t know,  she said. It made her nervous, though.  Joffrey, let’s go back.    I want to see what it is.  Joffrey turned his horse in the direction of the sounds, and Sansa had no choice but to follow. The noises grew louder and more distinct, the clack of wood on wood, and as they grew closer they heard heavy breathing as well, and now and then a grunt.   Someone’s there,  Sansa said anxiously. She found herself thinking of Lady, wishing the direwolf was with her.   You’re safe with me.  Joffrey drew his Lion’s Tooth from its sheath. The sound of steel on leather made her tremble.  This way,  he said, riding through a stand of trees.  Beyond, in a clearing overlooking the river, they came upon a boy and a girl playing at knights. Their swords were wooden sticks, broom handles from the look of them, and they were rushing across the grass, swinging at each other lustily. The boy was years older, a head taller, and much stronger, and he was pressing the attack. The girl, a scrawny thing in soiled leathers, was dodging and managing to get her stick in the way of most of the boy’s blows, but not all. When she tried to lunge at him, he caught her stick with his own, swept it aside, and slid his wood down hard on her fingers. She cried out and lost her weapon.  Prince Joffrey laughed. The boy looked around, wide-eyed and startled, and dropped his stick in the grass. The girl glared at them, sucking on her knuckles to take the sting out, and Sansa was horrified.  Arya?  she called out incredulously.   Go away,  Arya shouted back at them, angry tears in her eyes.  What are you doing here? Leave us alone.   Joffrey glanced from Arya to Sansa and back again.  Your sister?  She nodded, blushing. Joffrey examined the boy, an ungainly lad with a coarse, freckled face and thick red hair.  And who are you, boy?  he asked in a commanding tone that took no notice of the fact that the other was a year his senior.   Mycah,  the boy muttered. He recognized the prince and averted his eyes."
}