{
  "id": "bff85bd07caecb4dfffcb23df8fd3afb2e173138",
  "text": " He lay back and closed his eyes. Perhaps he would dream of Tysha again. I wonder how she’d like my face now, he thought bitterly.      JON  When Qhorin Halfhand told him to find some brush for a fire, Jon knew their end was near.  It will be good to feel warm again, if only for a little while, he told himself while he hacked bare branches from the trunk of a dead tree. Ghost sat on his haunches watching, silent as ever. Will he howl for me when I’m dead, as Bran’s wolf howled when he fell? Jon wondered. Will Shaggydog howl, far off in Winterfell, and Grey Wind and Nymeria, wherever they might be?  The moon was rising behind one mountain and the sun sinking behind another as Jon struck sparks from flint and dagger, until finally a wisp of smoke appeared. Qhorin came and stood over him as the first flame rose up flickering from the shavings of bark and dead dry pine needles.  As shy as a maid on her wedding night,  the big ranger said in a soft voice,  and near as fair. Sometimes a man forgets how pretty a fire can be.   He was not a man you’d expect to speak of maids and wedding nights. So far as Jon knew, Qhorin had spent his whole life in the Watch. Did he ever love a maid or have a wedding? He could not ask. Instead he fanned the fire. When the blaze was all acrackle, he peeled off his stiff gloves to warm his hands, and sighed, wondering if ever a kiss had felt as good. The warmth spread through his fingers like melting butter.  The Halfhand eased himself to the ground and sat cross-legged by the fire, the flickering light playing across the hard planes of his face. Only the two of them remained of the five rangers who had fled the Skirling Pass, back into the blue-grey wilderness of the Frostfangs.  At first Jon had nursed the hope that Squire Dalbridge would keep the wildlings bottled up in the pass. But when they’d heard the call of a far-off horn every man of them knew the squire had fallen. Later they spied the eagle soaring through the dusk on great blue-grey wings and Stonesnake unslung his bow, but the bird flew out of range before he could so much as string it. Ebben spat and muttered darkly of wargs and skinchangers.  They glimpsed the eagle twice more the day after, and heard the hunting horn behind them echoing against the mountains. Each time it seemed a little louder, a little closer. When night fell, the Halfhand told Ebben to take the squire’s garron as well as his own, and ride east for Mormont with all haste, back the way they had come. The rest of them would draw off the pursuit.  Send Jon,  Ebben had urged.  He can ride as fast as me.    Jon has a different part to play.    He is half a boy still.    No,  said Qhorin,  he is a man of the Night’s Watch.   When the moon rose, Ebben parted from them. Stonesnake went east with him a short way, then doubled back to obscure their tracks, and the three who remained set off toward the southwest.  After that the days and nights blurred one into the other. They slept in their saddles and stopped only long enough to feed and water the garrons, then mounted up again. Over bare rock they rode, through gloomy pine forests and drifts of old snow, over icy ridges and across shallow rivers that had no names. Sometimes Qhorin or Stonesnake would loop back to sweep away their tracks, but it was a futile gesture. They were watched. At every dawn and every dusk they saw the eagle soaring between the peaks, no more than a speck in the vastness of the sky.  They were scaling a low ridge between two snowcapped peaks when a shadowcat came snarling from its lair, not ten yards away. The beast was gaunt and half-starved, but the sight of it sent Stonesnake’s mare into a panic; she reared and ran, and before the ranger could get her back under control she had stumbled on the steep slope and broken a leg.  Ghost ate well that day, and Qhorin insisted that the rangers mix some of the garron’s blood with their oats, to give them strength. The taste of that foul porridge almost choked Jon, but he forced it down. They each cut a dozen strips of raw stringy meat from the carcass to chew on as they rode, and left the rest for the shadowcats.  There was no question of riding double. Stonesnake offered to lay in wait for the pursuit and surprise them when they came. Perhaps he could take a few of them with him down to hell. Qhorin refused.  If any man in the Night’s Watch can make it through the Frostfangs alone and afoot, it is you, brother. You can go over mountains that a horse must go around. Make for the Fist. Tell Mormont what Jon saw, and how. Tell him that the old powers are waking, that he faces giants and wargs and worse. Tell him that the trees have eyes again.   He has no chance, Jon thought when he watched Stonesnake vanish over a snow-covered ridge, a tiny black bug crawling across a rippling expanse of white.  After that, every night seemed colder than the night before, and more lonely. Ghost was not always with them, but he was never far either. Even when they were apart, Jon sensed his nearness."
}