{
  "id": "c00be5afc06e135819598f1f9375aee0c263a749",
  "text": "   Look at him,  brayed Lommy Greenhands.  I bet he’s going to cry now. You want to cry, Lumpyhead?   She had cried in her sleep the night before, dreaming of her father. Come morning, she’d woken red-eyed and dry, and could not have shed another tear if her life had hung on it.   He’s going to wet his pants,  Hot Pie suggested.   Leave him be,  said the boy with the shaggy black hair who rode behind them. Lommy had named him the Bull, on account of this horned helm he had that he polished all the time but never wore. Lommy didn’t dare mock the Bull. He was older, and big for his age, with a broad chest and strong-looking arms.   You better give Hot Pie the sword, Arry,  Lommy said.  Hot Pie wants it bad. He kicked a boy to death. He’ll do the same to you, I bet.    I knocked him down and I kicked him in the balls, and I kept kicking him there until he was dead,  Hot Pie boasted.  I kicked him all to pieces. His balls were broke open and bloody and his cock turned black. You better gimme the sword.   Arya slid her practice sword from her belt.  You can have this one,  she told Hot Pie, not wanting to fight.   That’s just some stick.  He rode nearer and tried to reach over for Needle’s hilt.  Arya made the stick whistle as she laid the wood across his donkey’s hindquarters. The animal hawed and bucked, dumping Hot Pie on the ground. She vaulted off her own donkey and poked him in the gut as he tried to get up and he sat back down with a grunt. Then she whacked him across the face and his nose made a crack like a branch breaking. Blood dribbled from his nostrils. When Hot Pie began to wail, Arya whirled toward Lommy Greenhands, who was sitting on his donkey openmouthed.  You want some sword too?  she yelled, but he didn’t. He raised dyed green hands in front of his face and squealed at her to get away.  The Bull shouted,  Behind you,  and Arya spun. Hot Pie was on his knees, his fist closing around a big jagged rock. She let him throw it, ducking her head as it sailed past. Then she flew at him. He raised a hand and she hit it, and then his cheek, and then his knee. He grabbed for her, and she danced aside and bounced the wood off the back of his head. He fell down and got up and stumbled after her, his red face all smeared with dirt and blood. Arya slid into a water dancer’s stance and waited. When he came close enough, she lunged, right between his legs, so hard that if her wooden sword had had a point it would have come out between his butt cheeks.  By the time Yoren pulled her off him, Hot Pie was sprawled out on the ground with his breeches brown and smelly, crying as Arya whapped him over and over and over.  Enough,  the black brother roared, prying the stick sword from her fingers,  you want to kill the fool?  When Lommy and some others started to squeal, the old man turned on them too.  Shut your mouths, or I’ll be shutting them for you. Any more o’ this, I’ll tie you lot behind the wagons and drag you to the Wall.  He spat.  And that goes twice for you, Arry. You come with me, boy. Now.   They were all looking at her, even the three chained and manacled in the back of the wagon. The fat one snapped his pointy teeth together and hissed, but Arya ignored him.  The old man dragged her well off the road into a tangle of trees, cursing and muttering all the while.  If I had a thimble o’ sense, I would’ve left you in King’s Landing. You hear me, boy?  He always snarled that word, putting a bite in it so she would be certain to hear.  Unlace your breeches and pull ‘em down. Go on, there’s no one here to see. Do it.   Sullenly, Arya did as he said.  Over there, against the oak. Yes, like that.  She wrapped her arms around the trunk and pressed her face to the rough wood.  You scream now. You scream loud.   I won’t, Arya thought stubbornly, but when Yoren laid the wood against the back of her bare thighs, the shriek burst out of her anyway.  Think that hurt?  he said.  Try this one.  The stick came whistling. Arya shrieked again, clutching the tree to keep from falling.  One more.  She held on tight, chewing her lip, flinching when she heard it coming. The stroke made her jump and howl. I won’t cry, she thought, I won’t do that. I’m a Stark of Winterfell, our sigil is the direwolf, direwolves don’t cry. She could feel a thin trickle of blood running down her left leg. Her thighs and cheeks were ablaze with pain.  Might be I got your attention now,  Yoren said.  Next time you take that stick to one of your brothers, you’ll get twice what you give, you hear me? Now cover yourself.   They’re not my brothers, Arya thought as she bent to yank up her breeches, but she knew better than to say so. Her hands fumbled with her belt and laces.  Yoren was looking at her.  You hurt?   Calm as still water, she told herself, the way Syrio Forel had taught her.  Some.   He spat.  That pie boy’s hurting worse. It wasn’t him as killed your father, girl, nor that thieving Lommy neither. Hitting them won’t bring him back.    I know,  Arya muttered sullenly."
}