{
  "id": "c033cd4bf3ea26f6948be0d9b14d94699930c691",
  "text": " If you run short of letters, capture a few septons and set them to copying out more. I mean to use your second son as well. He will take Lady Marya across the narrow sea, to Braavos and the other Free Cities, to deliver other letters to the men who rule there. The world will know of my claim, and of Cersei’s infamy.   You can tell them, Davos thought, but will they believe? He glanced thoughtfully at Maester Pylos. The king caught the look.  Maester, perhaps you ought get to your writing. We will need a great many letters, and soon.    As you will.  Pylos bowed, and took his leave.  The king waited until he was gone before he said,  What is it you would not say in the presence of my maester, Davos?    My liege, Pylos is pleasant enough, but I cannot see the chain about his neck without mourning for Maester Cressen.    Is it his fault the old man died?  Stannis glanced into the fire.  I never wanted Cressen at that feast. He’d angered me, yes, he’d given me bad counsel, but I did not want him dead. I’d hoped he might be granted a few years of ease and comfort. He had earned that much, at least, but —he ground his teeth together— but he died. And Pylos serves me ably.    Pylos is the least of it. The letter… What did your lords make of it, I wonder?   Stannis snorted.  Celtigar pronounced it admirable. If I showed him the contents of my privy, he would declare that admirable as well. The others bobbed their heads up and down like a flock of geese, all but Velaryon, who said that steel would decide the matter, not words on parchment. As if I had never suspected. The Others take my lords, I’ll hear your views.    Your words were blunt and strong.    And true.    And true. Yet you have no proof. Of this incest. No more than you did a year ago.    There’s proof of a sort at Storm’s End. Robert’s bastard. The one he fathered on my wedding night, in the very bed they’d made up for me and my bride. Delena was a Florent, and a maiden when he took her, so Robert acknowledged the babe. Edric Storm, they call him. He is said to be the very image of my brother. If men were to see him, and then look again at Joffrey and Tommen, they could not help but wonder, I would think.    Yet how are men to see him, if he is at Storm’s End?   Stannis drummed his fingers on the Painted Table.  It is a difficulty. One of many.  He raised his eyes.  You have more to say about the letter. Well, get on with it. I did not make you a knight so you could learn to mouth empty courtesies. I have my lords for that. Say what you would say, Davos.   Davos bowed his head.  There was a phrase at the end. How did it go? Done in the Light of the Lord…    Yes.  The king’s jaw was clenched.   Your people will mislike those words.    As you did?  said Stannis sharply.   If you were to say instead, Done in the sight of gods and men, or By the grace of the gods old and new…    Have you gone devout on me, smuggler?    That was to be my question for you, my liege.    Was it now? It sounds as though you love my new god no more than you love my new maester.    I do not know this Lord of Light,  Davos admitted,  but I knew the gods we burned this morning. The Smith has kept my ships safe, while the Mother has given me seven strong sons.    Your wife has given you seven strong sons. Do you pray to her? It was wood we burned this morning.    That may be so,  Davos said,  but when I was a boy in Flea Bottom begging for a copper, sometimes the septons would feed me.    I feed you now.    You have given me an honored place at your table. And in return I give you truth. Your people will not love you if you take from them the gods they have always worshiped, and give them one whose very name sounds queer on their tongues.   Stannis stood abruptly.  R’hllor. Why is that so hard? They will not love me, you say? When have they ever loved me? How can I lose something I have never owned?  He moved to the south window to gaze out at the moonlit sea.  I stopped believing in gods the day I saw the Windproud break up across the bay. Any gods so monstrous as to drown my mother and father would never have my worship, I vowed. In King’s Landing, the High Septon would prattle at me of how all justice and goodness flowed from the Seven, but all I ever saw of either was made by men.    If you do not believe in gods—    —why trouble with this new one?  Stannis broke in.  I have asked myself as well. I know little and care less of gods, but the red priestess has power.   Yes, but what sort of power?  Cressen had wisdom.    I trusted in his wisdom and your wiles, and what did they avail me, smuggler? The storm lords sent you packing. I went to them a beggar and they laughed at me. Well, there will be no more begging, and no more laughing either. The Iron Throne is mine by rights, but how am I to take it? There are four kings in the realm, and three of them have more men and more gold than I do. I have ships… and I have her. The red woman. Half my knights are afraid even to say her name, did you know? If she can do nothing else, a sorceress who can inspire such dread in grown men is not to be despised."
}