{
  "id": "c037ad07cdba0132ae71988e3fecb7e554eaaa73",
  "text": "    Little boyman,  Shagga roared,  will you mock my axe after I chop off your manhood and feed it to the goats?   But Gunthor raised a hand.  No. I would hear his words. The mothers go hungry, and steel fills more mouths than gold. What would you give us for your lives, Tyrion son of Tywin? Swords? Lances? Mail?    All that, and more, Gunthor son of Gurn,  Tyrion Lannister replied, smiling.  I will give you the Vale of Arryn.       EDDARD  Through the high narrow windows of the Red Keep’s cavernous throne room, the light of sunset spilled across the floor, laying dark red stripes upon the walls where the heads of dragons had once hung. Now the stone was covered with hunting tapestries, vivid with greens and browns and blues, and yet still it seemed to Ned Stark that the only color in the hall was the red of blood.  He sat high upon the immense ancient seat of Aegon the Conqueror, an ironwork monstrosity of spikes and jagged edges and grotesquely twisted metal. It was, as Robert had warned him, a hellishly uncomfortable chair, and never more so than now, with his shattered leg throbbing more sharply every minute. The metal beneath him had grown harder by the hour, and the fanged steel behind made it impossible to lean back. A king should never sit easy, Aegon the Conqueror had said, when he commanded his armorers to forge a great seat from the swords laid down by his enemies. Damn Aegon for his arrogance, Ned thought sullenly, and damn Robert and his hunting as well.   You are quite certain these were more than brigands?  Varys asked softly from the council table beneath the throne. Grand Maester Pycelle stirred uneasily beside him, while Littlefinger toyed with a pen. They were the only councillors in attendance. A white hart had been sighted in the kingswood, and Lord Renly and Ser Barristan had joined the king to hunt it, along with Prince Joffrey, Sandor Clegane, Balon Swann, and half the court. So Ned must needs sit the Iron Throne in his absence.  At least he could sit. Save the council, the rest must stand respectfully, or kneel. The petitioners clustered near the tall doors, the knights and high lords and ladies beneath the tapestries, the smallfolk in the gallery, the mailed guards in their cloaks, gold or grey: all stood.  The villagers were kneeling: men, women, and children, alike tattered and bloody, their faces drawn by fear. The three knights who had brought them here to bear witness stood behind them.   Brigands, Lord Varys?  Ser Raymun Darry’s voice dripped scorn.  Oh, they were brigands, beyond a doubt. Lannister brigands.   Ned could feel the unease in the hall, as high lords and servants alike strained to listen. He could not pretend to surprise. The west had been a tinderbox since Catelyn had seized Tyrion Lannister. Both Riverrun and Casterly Rock had called their banners, and armies were massing in the pass below the Golden Tooth. It had only been a matter of time until the blood began to flow. The sole question that remained was how best to stanch the wound.  Sad-eyed Ser Karyl Vance, who would have been handsome but for the winestain birthmark that discolored his face, gestured at the kneeling villagers.  This is all the remains of the holdfast of Sherrer, Lord Eddard. The rest are dead, along with the people of Wendish Town and the Mummer’s Ford.    Rise,  Ned commanded the villagers. He never trusted what a man told him from his knees.  All of you, up.   In ones and twos, the holdfast of Sherrer struggled to its feet. One ancient needed to be helped, and a young girl in a bloody dress stayed on her knees, staring blankly at Ser Arys Oakheart, who stood by the foot of the throne in the white armor of the Kingsguard, ready to protect and defend the king… or, Ned supposed, the King’s Hand.   Joss,  Ser Raymun Darry said to a plump balding man in a brewer’s apron.  Tell the Hand what happened at Sherrer.   Joss nodded.  If it please His Grace—    His Grace is hunting across the Blackwater,  Ned said, wondering how a man could live his whole life a few days ride from the Red Keep and still have no notion what his king looked like. Ned was clad in a white linen doublet with the direwolf of Stark on the breast; his black wool cloak was fastened at the collar by his silver hand of office. Black and white and grey, all the shades of truth.  I am Lord Eddard Stark, the King’s Hand. Tell me who you are and what you know of these raiders.    I keep… I kept… I kept an alehouse, m’lord, in Sherrer, by the stone bridge. The finest ale south of the Neck, everyone said so, begging your pardons, m’lord. It’s gone now like all the rest, m’lord. They come and drank their fill and spilled the rest before they fired my roof, and they would of spilled my blood too, if they’d caught me. M’lord.    They burnt us out,  a farmer beside him said.  Come riding in the dark, up from the south, and fired the fields and the houses alike, killing them as tried to stop them. They weren’t no raiders, though, m’lord. They had no mind to steal our stock, not these, they butchered my milk cow where she stood and left her for the flies and the crows."
}