{
  "id": "c0eb5c072f0018a935fc6a519b44c2d5b3b675b1",
  "text": " As we crossed he fell upon us from front and rear.   I saw the Mountain slay Raymun Darry with a single blow so terrible that it took Darry’s arm off at the elbow and killed the horse beneath him too. Gladden Wylde died there with him, and Lord Mallery was ridden down and drowned. We had lions on every side, and I thought I was doomed with the rest, but Alyn shouted commands and restored order to our ranks, and those still a horse rallied around Thoros and cut our way free. Six score we’d been that morning. By dark no more than two score were left, and Lord Beric was gravely wounded. Thoros drew a foot of lance from his chest that night, and poured boiling wine into the hole it left.   Every man of us was certain his lordship would be dead by daybreak. But Thoros prayed with him all night beside the fire, and when dawn came, he was still alive, and stronger than he’d been. It was a fortnight before he could mount a horse, but his courage kept us strong. He told us that our war had not ended at the Mummer’s Ford, but only begun there, and that every man of ours who’d fallen would be avenged tenfold.   By then the fighting had passed by us. The Mountain’s men were only the van of Lord Tywin’s host. They crossed the Red Fork in strength and swept up into the riverlands, burning everything in their path. We were so few that all we could do was harry their rear, but we told each other that we’d join up with King Robert when he marched west to crush Lord Tywin’s rebellion. Only then we heard that Robert was dead, and Lord Eddard as well, and Cersei Lannister’s whelp had ascended the Iron Throne.   That turned the whole world on its head. We’d been sent out by the King’s Hand to deal with outlaws, you see, but now we were the outlaws, and Lord Tywin was the Hand of the King. There was some wanted to yield then, but Lord Beric wouldn’t hear of it. We were still king’s men, he said, and these were the king’s people the lions were savaging. If we could not fight for Robert, we would fight for them, until every man of us was dead. And so we did, but as we fought something queer happened. For every man we lost, two showed up to take his place. A few were knights or squires, of gentle birth, but most were common men—fieldhands and fiddlers and innkeeps, servants and shoemakers, even two septons. Men of all sorts, and women too, children, dogs…    Dogs?  said Arya.   Aye.  Harwin grinned.  One of our lads keeps the meanest dogs you’d ever want to see.    I wish I had a good mean dog,  said Arya wistfully.  A lion-killing dog.  She’d had a direwolf once, Nymeria, but she’d thrown rocks at her until she fled, to keep the queen from killing her. Could a direwolf kill a lion? she wondered.  It rained again that afternoon, and long into the evening. Thankfully the outlaws had secret friends all over, so they did not need to camp out in the open or seek shelter beneath some leaky bower, as she and Hot Pie and Gendry had done so often.  That night they sheltered in a burned, abandoned village. At least it seemed to be abandoned, until Jack-Be-Lucky blew two short blasts and two long ones on his hunting horn. Then all sorts of people came crawling out of the ruins and up from secret cellars. They had ale and dried apples and some stale barley bread, and the outlaws had a goose that Anguy had brought down on the ride, so supper that night was almost a feast.  Arya was sucking the last bit of meat off a wing when one of the villagers turned to Lem Lemoncloak and said,  There were men through here not two days past, looking for the Kingslayer.   Lem snorted.  They’d do better looking in Riverrun. Down in the deepest dungeons, where it’s nice and damp.  His nose looked like a squashed apple, red and raw and swollen, and his mood was foul.   No,  another villager said.  He’s escaped.   The Kingslayer. Arya could feel the hair on the back of her neck prickling. She held her breath to listen.   Could that be true?  Tom o’ Sevens said.   I’ll not believe it,  said the one-eyed man in the rusty pothelm. The other outlaws called him Jack-Be-Lucky, though losing an eye didn’t seem very lucky to Arya.  I’ve had me a taste o’ them dungeons. How could he escape?   The villagers could only shrug at that. Greenbeard stroked his thick grey-and-green whiskers and said,  The wolves will drown in blood if the Kingslayer’s loose again. Thoros must be told. The Lord of Light will show him Lannister in the flames.    There’s a fine fire burning here,  said Anguy, smiling.  Greenbeard laughed, and cuffed the archer’s ear.  Do I look a priest to you, Archer? When Pello of Tyrosh peers into the fire, the cinders singe his beard.   Lem cracked his knuckles and said,  Wouldn’t Lord Beric love to capture Jaime Lannister, though…    Would he hang him, Lem?  one of the village women asked.  It’d be half a shame to hang a man as pretty as that one.    A trial first!  said Anguy.  Lord Beric always gives them a trial, you know that.  He smiled.  Then he hangs them."
}