{
  "id": "c23b33ae84457db293a94507c7e0a13586777617",
  "text": " Drogo was a bolder man than the other horselords in half a hundred ways, she had found… but not in this. If only she could get him onto a ship…  After the khal and his bloodriders had ridden off with their bows, Dany summoned her handmaids. Her body felt so fat and ungainly now that she welcomed the help of their strong arms and deft hands, whereas before she had often been uncomfortable with the way they fussed and fluttered about her. They scrubbed her clean and dressed her in sandsilk, loose and flowing. As Doreah combed out her hair, she sent Jhiqui to find Ser Jorah Mormont.  The knight came at once. He wore horsehair leggings and painted vest, like a rider. Coarse black hair covered his thick chest and muscular arms.  My princess. How may I serve you?    You must talk to my lord husband,  Dany said.  Drogo says the stallion who mounts the world will have all the lands of the earth to rule, and no need to cross the poison water. He talks of leading his khalasar east after Rhaego is born, to plunder the lands around the Jade Sea.   The knight looked thoughtful.  The khal has never seen the Seven Kingdoms,  he said.  They are nothing to him. If he thinks of them at all, no doubt he thinks of islands, a few small cities clinging to rocks in the manner of Lorath or Lys, surrounded by stormy seas. The riches of the east must seem a more tempting prospect.    But he must ride west,  Dany said, despairing.  Please, help me make him understand.  She had never seen the Seven Kingdoms either, no more than Drogo, yet she felt as though she knew them from all the tales her brother had told her. Viserys had promised her a thousand times that he would take her back one day, but he was dead now and his promises had died with him.   The Dothraki do things in their own time, for their own reasons,  the knight answered.  Have patience, Princess. Do not make your brother’s mistake. We will go home, I promise you.   Home? The word made her feel sad. Ser Jorah had his Bear Island, but what was home to her? A few tales, names recited as solemnly as the words of a prayer, the fading memory of a red door… was Vaes Dothrak to be her home forever? When she looked at the crones of the dosh khaleen, was she looking at her future?  Ser Jorah must have seen the sadness on her face.  A great caravan arrived during the night, Khaleesi. Four hundred horses, from Pentos by way of Norvos and Qohor, under the command of Merchant Captain Byan Votyris. Illyrio may have sent a letter. Would you care to visit the Western Market?   Dany stirred.  Yes,  she said.  I would like that.  The markets came alive when a caravan had come in. You could never tell what treasures the traders might bring this time, and it would be good to hear men speaking Valyrian again, as they did in the Free Cities.  Irri, have them prepare a litter.    I shall tell your khas,  Ser Jorah said, withdrawing.  If Khal Drogo had been with her, Dany would have ridden her silver. Among the Dothraki, mothers stayed on horseback almost up to the moment of birth, and she did not want to seem weak in her husband’s eyes. But with the khal off hunting, it was pleasant to lie back on soft cushions and be carried across Vaes Dothrak, with red silk curtains to shield her from the sun. Ser Jorah saddled up and rode beside her, with the four young men of her khas and her handmaids.  The day was warm and cloudless, the sky a deep blue. When the wind blew, she could smell the rich scents of grass and earth. As her litter passed beneath the stolen monuments, she went from sunlight to shadow and back again. Dany swayed along, studying the faces of dead heroes and forgotten kings. She wondered if the gods of burned cities could still answer prayers.  If I were not the blood of the dragon, she thought wistfully, this could be my home. She was khaleesi, she had a strong man and a swift horse, handmaids to serve her, warriors to keep her safe, an honored place in the dosh khaleen awaiting her when she grew old… and in her womb grew a son who would one day bestride the world. That should be enough for any woman… but not for the dragon. With Viserys gone, Daenerys was the last, the very last. She was the seed of kings and conquerors, and so too the child inside her. She must not forget.  The Western Market was a great square of beaten earth surrounded by warrens of mud-baked brick, animal pens, whitewashed drinking halls. Hummocks rose from the ground like the backs of great subterranean beasts breaking the surface, yawning black mouths leading down to cool and cavernous storerooms below. The interior of the square was a maze of stalls and crookback aisles, shaded by awnings of woven grass.  A hundred merchants and traders were unloading their goods and setting up in stalls when they arrived, yet even so the great market seemed hushed and deserted compared to the teeming bazaars that Dany remembered from Pentos and the other Free Cities. The caravans made their way to Vaes Dothrak from east and west not so much to sell to the Dothraki as to trade with each other, Ser Jorah had explained."
}