{
  "id": "c3177dbe17d83c9a232e78e1f5dec9dd07755466",
  "text": "  'Will they attack the inn?'  'No, I  think not,' said Strider.  'They are not all here yet. And in any  case that  is not their way. In dark and loneliness  they are strongest; they will  not  openly attack a house where ther e are lights and many people -not until they  are desperate, not while all the  long  leagues of Eriador still  lie before  us.  But their  power  is in  terror, and already some in Bree are in  their  clutch. They will drive these wretches to some evil work: Ferny, and some of  the strangers, and, maybe,  the gatekeeper too. They had words with Harry at  West-gate on Monday. I was watching them. He was white and shaking when  they  left him.'       'We seem to have enemies all round,' said Frodo. 'What are we to do? '       'Stay here, and do not  go to  your rooms! They are sure  to have found  out which those  are. The hobbit-rooms  have windows looking north and close  to the ground. We will all remain together and bar this window and the door.  But first Nob and I will fetch your luggage.'       While Strider was  gone, Frodo gave Merry a  rapid account of all  that  had happened since supper. Merry was  still reading and  pondering Gandalf's  letter when Strider and Nob returned.       'Well Masters,' said  Nob, 'I've ruffled up  the clothes  and  put in a   bolster down the  middle of  each bed.  And I made a  nice imitation of your   head  with a brown woollen mat, Mr. Bag  - Underhill,  sir,' he added with  a   grin.       Pippin laughed. 'Very life-like!'  he said. 'But  wha t will happen when  they have penetrated the disguise?'       'We shall  see,'  said  Strider.  'Let us hope  to hold the  fort  till  morning.'       'Good  night to  you,' said Nob, and went off to take  his part in  the  watch on the doors.        Their bags and gear they piled on the parlour -floor. They pushed a  low  chair against the door and shut the window. Peering  out, Frodo saw that the  night was still clear. The Sickle was swinging bright above the shoulders of   Bree-hill. He then closed and barred  the heavy inside shutters and drew the   curtains together. Strider built up the fire and blew out all the candles.        The  hobbits lay  down  on their blankets  with their feet  towards the  hearth; but  Strider settled himself  in the chair against  the  door .  They   ####-talked for a little, for Merry still had several questions to ask.       'Jumped over  the Moon!'  chuckled  Merry as he rolled himself  in  his  blanket. 'Very ridiculous of you, Frodo! But I wish I had been there to see.  The worthies of Bree will be discussing it a hundred years hence.'       'I  hope so,' said Strider. Then  they all fell  silent, and one by one  the hobbits dropped off to sleep.     ####-   Chapter 11. A Knife in the Dark            As  they prepared  for sleep  in  the  inn at  Bree,  darkness  lay  on  Buckland; a mist strayed in the dells and along the river -bank. The house at  Crickhollow stood silent. Fatty Bolger opened the door cautiously and peered  out. A feeling of fear had been growing on him all day, and he was unable to  rest or go to bed: there was a brooding threat  in the breathless night-air.  As he  stared out into the gloom, a black shadow moved under the trees;  the  gate  seemed  to open  of its own  accord and close again without  a  sound.  Terror seized him. He  shrank  back,  and for a moment he stood trembling in  the hall. Then he shut and locked the door.       The night  deepened.  There  came  the  soft  sound of horses  led with  stealth  along the  lane.  Outside  the gate  they stopped, and three  black   figures entered,  like shades of night  creeping across the ground. One went  to the door, one to the corner of the house on  either side; and there  they  stood, as  still as the shadows of  stones, while night went slowly on.  The  house and the quiet trees seemed to be waiting breathlessly.       There was a faint stir  in the leaves, and  a cock crowed far away. The  cold hour before dawn was passing. The figure by the door moved. In the dark  without moon or stars a drawn blade gleamed,  as  if a chill light had  been  unsheathed.  There was a blow, soft but heavy, and the door shuddered.       'Open, in the name of Mordor!' said a voice thin and menacing.       At a second blow the door yielded and fell back, with timbers burst and  lock broken. The black figures passed swiftly in.       At that moment, among the trees nearby,  a  horn rang out.  It rent the  night like fire on a hill-top.       AWAKE! FEAR! FIRE! FOES! AWAKE!       Fatty Bolger had not been idle. As soon as he saw the dark shapes creep  from the garden, he knew that he must run for it, or perish. And run he did,  out  of the  back door, through  the garden,  and over the  fields.  When he  reached  the  nearest  house,  more  than a mile  away, he  collapsed on the  doorstep. 'No, no, no!'  he was  crying. 'No,  not me! I haven't got it!' It  was  some time  before anyone could make out what he  was babbling about."
}