{
  "id": "c46e3c51a930467c87e820bbf0203f00aee60c0b",
  "text": "  \"And you'll be sticking to that story, boy, or there'll be trouble, spat Uncle Vernon.  Harry sat there, white-faced and furious, staring at Uncle Vernon, hardly able to believe it. Aunt Marge coming for a weeklong visit -- it was the worst birthday present the Dursleys had ever given him, including that pair of Uncle Vernon's old socks.  \"Well, Petunia,\" said Uncle Vernon, getting heavily to his feet, \"I'll be off to the station, then. Want to come along for the ride, Dudders?\"  \"No,\" said Dudley, whose attention had returned to the television now that Uncle Vernon had finished threatening Harry.  \"Duddy's got to make himself smart for his auntie,\" said Aunt Petunia, smoothing Dudley's thick blond hair. \"Mummy's bought him a lovely new bow tie.\"  Uncle Vernon clapped Dudley on his porky shoulder. \"See you in a bit, then,\" he said, and he left the kitchen.  Harry, who had been sitting in a kind of horrified trance, had a sudden idea. Abandoning his toast, he got quickly to his feet and followed Uncle Vernon to the front door.  Uncle Vernon was pulling on his car coat.  \"I'm not taking you,\" he snarled as he turned to see Harry watching him.  \"Like I wanted to come,\" said Harry coldly. \"I want to ask you something.\"  Uncle Vernon eyed him suspiciously.  \"Third years at Hog -- at my school are allowed to visit the village sometimes,\" said Harry.  \"So?\" snapped Uncle Vernon, taking his car keys from a hook next to the door.  \"I need you to sign the permission form,\" said Harry in a rush.  \"And why should I do that?\" sneered Uncle Vernon.  \"Well,\" said Harry, choosing his words carefully, \"it'll be hard work, pretending to Aunt Marge I go to that St. Whatsits --\"  \"St. Brutus's Secure Center for Incurably Criminal Boys!\" bellowed Uncle Vernon, and Harry was pleased to hear a definite note of panic in Uncle Vernon's voice.  \"Exactly,\" said Harry, looking calmly up into Uncle Vernon's large, purple face. \"It's a lot to remember. I'll have to make it sound convincing, won't I? What if I accidentally let something slip?\"  \"You'll get the stuffing knocked out of you, won't you?\" roared Uncle Vernon, advancing on Harry with his fist raised. But Harry stood his ground.  \"Knocking the stuffing out of me won't make Aunt Marge forget what I could tell her,\" he said grimly.  Uncle Vernon stopped, his fist still raised, his face an ugly puce.  \"But if you sign my permission form,\" Harry went on quickly, \"I swear I'll remember where I'm supposed to go to school, and I'll act like a Mug -- like I'm normal and everything.\"  Harry could tell that Uncle Vernon was thinking it over, even if his teeth were bared and a vein was throbbing in his temple.  \"Right,\" he snapped finally. \"I shall monitor your behavior carefully during Marge's visit. If, at the end of it, you've toed the line and kept to the story, I'll sign your ruddy form.\"  He wheeled around, pulled open the front door, and slammed it so hard that one of the little panes of glass at the top fell out.  Harry didn't return to the kitchen. He went back upstairs to his bedroom. If he was going to act like a real Muggle, he'd better start now. Slowly and sadly he gathered up all his presents and his birthday cards and hid them under the loose floorboard with his homework. Then he went to Hedwig's cage. Errol seemed to have recovered; he and Hedwig were both asleep, heads under their wings. Harry sighed, then poked them both awake.  \"Hedwig,\" he said gloomily, \"you're going to have to clear off for a week. Go with Errol. Ron'll look after you. I'll write him a note, explaining. And don't look at me like that\" -- Hedwig's large amber eyes were reproachful -- \"it's not my fault. It's the only way I'll be allowed to visit Hogsmeade with Ron and Hermione.\"  Ten minutes later, Errol and Hedwig (who had a note to Ron bound to her leg) soared out of the window and out of sight. Harry, now feeling thoroughly miserable, put the empty cage away inside the wardrobe.  But Harry didn't have long to brood. In next to no time, Aunt Petunia was shrieking up the stairs for Harry to come down and get ready to welcome their guest.  \"Do something about your hair!\" Aunt Petunia snapped as he reached the hall.  Harry couldn't see the point of trying to make his hair lie flat. Aunt Marge loved criticizing him, so the untidier he looked, the happier she would be.  All too soon, there was a crunch of gravel outside as Uncle Vernon's car pulled back into the driveway, then the clunk of the car doors and footsteps on the garden path.  \"Get the door!\" Aunt Petunia hissed at Harry.  A feeling of great gloom in his stomach, Harry pulled the door open.  On the threshold stood Aunt Marge. She was very like Uncle Vernon: large, beefy, and purple- faced, she even had a mustache, though not as bushy as his. In one hand she held an enormous suitcase, and tucked under the other was an old and evil-tempered bulldog.  \"Where's my Dudders?\" roared Aunt Marge. \"Where's my neffy-poo?\"  Dudley came waddling down the hall, his blond hair plastered flat to his fat head, a bow tie just visible under his many chins."
}