{
  "id": "c4f75da2e9f2bedbd25c571cd54fa098cd0fa732",
  "text": "  Harry caught snatches of conversation in strange languages from the inside of tents they passed, and though he couldn't understand a word, the tone of every single voice was excited. \"Er - is it my eyes, or has everything gone green?\" said Ron. It wasn't just Ron's eyes. They had walked into a patch of tents that were all covered with a thick growth of shamrocks, so that it looked as though small, oddly shaped hillocks had sprouted out of the earth.  Grinning faces could be seen under those that had their flaps open. Then, from behind them, they heard their names. \"Harry!  Ron!  Hermione!\" It was Seamus Finnigan, their fellow Gryffindor fourth year.  He was sitting in front of his own shamrock-covered tent, with a sandy-haired woman who had to be his mother, and his best friend, Dean Thomas, also of Gryffindor. \"Like the decorations?\" said Seamus, grinning.  \"The Ministry's not too happy.\" \"Ah, why shouldn't we show our colors?\"  said Mrs. Finnigan.  \"You should see what the Bulgarians have got dangling all over their tents.  You'll be supporting Ireland, of course?\" she added, eyeing Harry, Ron, and Hermione beadily.  When they had assured her that they were indeed supporting Ireland, they set off again, though, as Ron said, \"Like we'd say anything else surrounded by that lot.\" I wonder what the Bulgarians have got dangling all over their tents?\"  said Hermione. \"Let's go and have a look,\" said Harry, pointing to a large patch of tents upfield, where the Bulgarian flag - white, green, and red - was fluttering in the breeze. The tents here had not been bedecked with plant life, but each and every one of them had the same poster attached to it, a poster of a very surly face with heavy black eyebrows. The picture was, of course, moving, but all it did was blink and scowl. \"Krum,\" said Ron quietly. \"What?\" said Hermione. \"Krum!\" said Ron. \"Viktor Krum, the Bulgarian Seeker!\" \"He looks really grumpy,\" said Hermione, looking around at the many Krums blinking and scowling at them. \"'Really grumpy?\"  Ron raised his eyes to the heavens.  \"Who cares what he looks like? He's unbelievable.  He's really young too.  Only just eighteen or something.  He's a genius, you wait until tonight, you'll see.\" There was already a small queue for the tap in the corner of the field.  Harry, Ron, and Hermione joined it, right behind a pair of men who were having a heated argument.  One of them was a very old wizard who was wearing a long flowery nightgown.  The other was clearly a Ministry wizard; he was holding out a pair of pinstriped trousers and almost crying with exasperation. \"Just put them on, Archie, there's a good chap.  You can't walk around like that, the Muggle at the gate's already getting suspicious - I bought this in a Muggle shop,\" said the old wizard stubbornly.  \"Muggles wear them.\" \"Muggle women wear them, Archie, not the men, they wear these,\" said the Ministry wizard, and he brandished the pinstriped trousers. \"I'm not putting them on,\" said old Archie in indignation.  \"I like a healthy breeze 'round my privates, thanks.\" Hermione was overcome with such a strong fit of the giggles at this point that she had to duck out of the queue and only returned when Archie had collected his water and moved away. Walking more slowly now, because of the weight of the water, they made their way back through the campsite.  Here and there, they saw more familiar faces:  other Hogwarts students with their families.  Oliver Wood, the old captain of Harry's House Quidditch team, who had just left Hogwarts, dragged Harry over to his parents' tent to introduce him, and told him excitedly that he had just been signed to the Puddlemere United reserve team.  Next they were hailed by Ernie Macmillan, a Hufflepuff fourth year, and a little farther on they saw Cho Chang, a very pretty girl who played Seeker on the Ravenclaw team.  She waved and smiled at Harry, who slopped quite a lot of water down his front as he waved back.  More to stop Ron from smirking than anything, Harry hurriedly pointed out a large group of teenagers whom he had never seen before. \"Who d'you reckon they are?\" he said.  \"They don't go to Hogwarts, do they?\" \"'Spect they go to some foreign school,\" said Ron.  \"I know there are others.  Never met anyone who went to one, though. Bill had a penfriend at a school in Brazil ... this was years and years ago ... and he wanted to go on an exchange trip but Mum and Dad couldn't afford it. His penfriend got all offended when he said he wasn't going and sent him a cursed hat. It made his ears shrivel up.\" Harry laughed but didn't voice the amazement he felt at hearing about other wizarding schools.  He supposed, now that he saw representatives of so many nationalities in the campsite, that he had been stupid never to realize that Hogwarts couldn't be the only one.  He glanced at Hermione, who looked utterly unsurprised by the information.  No doubt she had run across the news about other wizarding schools in some book or other."
}