{
  "id": "c75fe9ba0fd67e2f41f710cdf532212ece1ec122",
  "text": "  \"Funny way to get to a wizards' school, the train. Magic carpets all got punctures, have they?\"  Harry didn't say anything.  \"Where is this school, anyway?\"  \"I don't know,\" said Harry, realizing this for the first time. He pulled the ticket Hagrid had given him out of his pocket.  \"I just take the train from platform nine and three-quarters at eleven o'clock,\" he read.  His aunt and uncle stared.  \"Platform what?\"  \"Nine and three-quarters.\"  \"Don't talk rubbish,\" said Uncle Vernon. \"There is no platform nine and three-quarters.\"  \"It's on my ticket.\"  \"Barking,\" said Uncle Vernon, \"howling mad, the lot of them. You'll see. You just wait. All right, we'll take you to King's Cross. We're going up to London tomorrow anyway, or I wouldn't bother.\"  \"Why are you going to London?\" Harry asked, trying to keep things friendly.  \"Taking Dudley to the hospital,\" growled Uncle Vernon. \"Got to have that ruddy tail removed before he goes to Smeltings.\"  Harry woke at five o'clock the next morning and was too excited and nervous to go back to sleep. He got up and pulled on his jeans because he didn't want to walk into the station in his wizard's robes -- he'd change on the train. He checked his Hogwarts list yet again to make sure he had everything he needed, saw that Hedwig was shut safely in her cage, and then paced the room, waiting for the Dursleys to get up. Two hours later, Harry's huge, heavy trunk had been loaded into the Dursleys' car, Aunt Petunia had talked Dudley into sitting next to Harry, and they had set off.  They reached King's Cross at half past ten. Uncle Vernon dumped Harry's trunk onto a cart and wheeled it into the station for him. Harry thought this was strangely kind until Uncle Vernon stopped dead, facing the platforms with a nasty grin on his face.  \"Well, there you are, boy. Platform nine -- platform ten. Your platform should be somewhere in the middle, but they don't seem to have built it yet, do they?\"  He was quite right, of course. There was a big plastic number nine over one platform and a big plastic number ten over the one next to it, and in the middle, nothing at all.  \"Have a good term,\" said Uncle Vernon with an even nastier smile. He left without another word. Harry turned and saw the Dursleys drive away. All three of them were laughing. Harry's mouth went rather dry. What on earth was he going to do? He was starting to attract a lot of funny looks, because of Hedwig. He'd have to ask someone.  He stopped a passing guard, but didn't dare mention platform nine and three-quarters. The guard had never heard of Hogwarts and when Harry couldn't even tell him what part of the country it was in, he started to get annoyed, as though Harry was being stupid on purpose. Getting desperate, Harry asked for the train that left at eleven o'clock, but the guard said there wasn't one. In the end the guard strode away, muttering about time wasters. Harry was now trying hard not to panic. According to the large clock over the arrivals board, he had ten minutes left to get on the train to Hogwarts and he had no idea how to do it; he was stranded in the middle of a station with a trunk he could hardly lift, a pocket full of wizard money, and a large owl.  Hagrid must have forgotten to tell him something you had to do, like tapping the third brick on the left to get into Diagon Alley. He wondered if he should get out his wand and start tapping the ticket inspector's stand between platforms nine and ten.  At that moment a group of people passed just behind him and he caught a few words of what they were saying.  \"-- packed with Muggles, of course --\"  Harry swung round. The speaker was a plump woman who was talking to four boys, all with flaming red hair. Each of them was pushing a trunk like Harry's in front of him -- and they had an owl.  Heart hammering, Harry pushed his cart after them. They stopped and so did he, just near enough to hear what they were saying.  \"Now, what's the platform number?\" said the boys' mother.  \"Nine and three-quarters!\" piped a small girl, also red-headed, who was holding her hand, \"Mom, can't I go... \"  \"You're not old enough, Ginny, now be quiet. All right, Percy, you go first.\"  What looked like the oldest boy marched toward platforms nine and ten. Harry watched, careful not to blink in case he missed it -- but just as the boy reached the dividing barrier between the two platforms, a large crowd of tourists came swarming in front of him and by the time the last backpack had cleared away, the boy had vanished.  \"Fred, you next,\" the plump woman said.  \"I'm not Fred, I'm George,\" said the boy. \"Honestly, woman, you call yourself our mother? CarA you tell I'm George?\"  \"Sorry, George, dear.\"  \"Only joking, I am Fred,\" said the boy, and off he went. His twin called after him to hurry up, and he must have done so, because a second later, he had gone -- but how had he done it?  Now the third brother was walking briskly toward the barrier he was almost there -- and then, quite suddenly, he wasn't anywhere."
}