{
  "id": "c7737623fc108845b5f2a88cfb3cdfd5ca55af51",
  "text": " The nightfires had burned low, and as the east began to lighten the immense mass of Storm’s End emerged like a dream of stone while wisps of pale mist raced across the field, flying from the sun on wings of wind. Morning ghosts, she had heard Old Nan call them once, spirits returning to their graves. And Renly one of them now, gone like his brother Robert, like her own dear Ned.   I never held him but as he died,  Brienne said quietly as they walked through the spreading chaos. Her voice sounded as if she might break at any instant.  He was laughing one moment, and suddenly the blood was everywhere… my lady, I do not understand. Did you see, did you…?    I saw a shadow. I thought it was Renly’s shadow at the first, but it was his brother’s.    Lord Stannis?    I felt him. It makes no sense, I know…   It made sense enough for Brienne.  I will kill him,  the tall homely girl declared.  With my lord’s own sword, I will kill him. I swear it. I swear it. I swear it.   Hal Mollen and the rest of her escort were waiting with the horses. Ser Wendel Manderly was all in a lather to know what was happening.  My lady, the camp has gone mad,  he blurted when he saw them.  Lord Renly, is he—  He stopped suddenly, staring at Brienne and the blood that drenched her.   Dead, but not by our hands.    The battle—  Hal Mollen began.   There will be no battle.  Catelyn mounted, and her escort formed up about her, with Ser Wendel to her left and Ser Perwyn Frey on her right.  Brienne, we brought mounts enough for twice our number. Choose one, and come with us.    I have my own horse, my lady. And my armor—    Leave them. We must be well away before they think to look for us. We were both with the king when he was killed. That will not be forgotten.  Wordless, Brienne turned and did as she was bid.  Ride,  Catelyn commanded her escort when they were all ahorse.  If any man tries to stop us, cut him down.   As the long fingers of dawn fanned across the fields, color was returning to the world. Where grey men had sat grey horses armed with shadow spears, the points of ten thousand lances now glinted silverly cold, and on the myriad flapping banners Catelyn saw the blush of red and pink and orange, the richness of blues and browns, the blaze of gold and yellow. All the power of Storm’s End and Highgarden, the power that had been Renly’s an hour ago. They belong to Stannis now, she realized, even if they do not know it themselves yet. Where else are they to turn, if not to the last Baratheon? Stannis has won all with a single evil stroke.  I am the rightful king, he had declared, his jaw clenched hard as iron, and your son no less a traitor than my brother here. His day will come as well.  A chill went through her.      JON  The hill jutted above the dense tangle of forest, rising solitary and sudden, its windswept heights visible from miles off. The wildlings called it the Fist of the First Men, rangers said. It did look like a fist, Jon Snow thought, punching up through earth and wood, its bare brown slopes knuckled with stone.  He rode to the top with Lord Mormont and the officers, leaving Ghost below under the trees. The direwolf had run off three times as they climbed, twice returning reluctantly to Jon’s whistle. The third time, the Lord Commander lost patience and snapped,  Let him go, boy. I want to reach the crest before dusk. Find the wolf later.   The way up was steep and stony, the summit crowned by a chest-high wall of tumbled rocks. They had to circle some distance west before they found a gap large enough to admit the horses.  This is good ground, Thoren,  the Old Bear proclaimed when at last they attained the top.  We could scarce hope for better. We’ll make our camp here to await Halfhand.  The Lord Commander swung down off his saddle, dislodging the raven from his shoulder. Complaining loudly, the bird took to the air.  The views atop the hill were bracing, yet it was the ringwall that drew Jon’s eye, the weathered grey stones with their white patches of lichen, their beards of green moss. It was said that the Fist had been a ringfort of the First Men in the Dawn Age.  An old place, and strong,  Thoren Smallwood said.   Old,  Mormont’s raven screamed as it flapped in noisy circles about their heads.  Old, old, old.    Quiet,  Mormont growled up at the bird. The Old Bear was too proud to admit to weakness, but Jon was not deceived. The strain of keeping up with younger men was taking its toll.   These heights will be easy to defend, if need be,  Thoren pointed out as he walked his horse along the ring of stones, his sable-trimmed cloak stirring in the wind.   Yes, this place will do.  The Old Bear lifted a hand to the wind, and raven landed on his forearm, claws scrabbling against his black ringmail.   What about water, my lord?  Jon wondered.   We crossed a brook at the foot of the hill.    A long climb for a drink,  Jon pointed out,  and outside the ring of stones.   Thoren said,  Are you too lazy to climb a hill, boy?   When Lord Mormont said,  We’re not like to find another place as strong."
}