{
  "id": "c7a59361c3d6e9e976d5a28600f940fe66874274",
  "text": " They seemed to scare most people senseless, and if they were stationed all around the school, Black's chances of getting inside seemed very remote.  No, all in all, the thing that bothered Harry most was the fact that his chances of visiting Hogsmeade now looked like zero. Nobody would want Harry to leave the safety of the castle until Black was caught; in fact, Harry suspected his every move would be carefully watched until the danger had passed.  He scowled at the dark ceiling. Did they think he couldn't look after himself? He'd escaped Lord Voldemort three times; he wasn't completely useless....  Unbidden, the image of the beast in the shadows of Magnolia Crescent crossed his mind. What to do when you know the worst is coming...  \"I'm not going to be murdered,\" Harry said out loud.  \"That's the spirit, dear,\" said his mirror sleepily.  CHAPTER FIVE  THE DEMENTOR  Tom woke Harry the next morning with his usual toothless grin and a cup of tea. Harry got dressed and was just persuading a disgruntled Hedwig to get back into her cage when Ron banged his way into the room, pulling a sweatshirt over his head and looking irritable.  \"The sooner we get on the train, the better,\" he said. \"At least I can get away from Percy at Hogwarts. Now he's accusing me of dripping tea on his photo of Penelope Clearwater. You know,\" Ron grimaced, \"his girlfriend. She's hidden her face under the frame because her nose has gone all blotchy...\"  \"I've got something to tell you,\" Harry began, but they were interrupted by Fred and George, who had looked in to congratulate Ron on infuriating Percy again.  They headed down to breakfast, where Mr. Weasley was reading the front page of the Daily Prophet with a furrowed brow and Mrs. Weasley was telling Hermione and Ginny about a love potion she'd made as a young girl. All three of them were rather giggly.  \"What were you saying?\" Ron asked Harry as they sat down.  \"Later,\" Harry muttered as Percy stormed in.  Harry had no chance to speak to Ron or Hermione in the chaos of leaving; they were too busy heaving all their trunks down the Leaky Cauldron's narrow staircase and piling them up near the door, with Hedwig and Hermes, Percy's screech owl, perched on top in their cages. A small wickerwork basket stood beside the heap of trunks, spitting loudly.  \"It's all right, Crookshanks,\" Hermione cooed through the wickerwork. \"I'll let you out on the train.\"  \"You won't,\" snapped Ron. \"What about poor Scabbers, eh?\"  He pointed at his chest, where a large lump indicated that Scabbers was curled up in his pocket.  Mr. Weasley, who had been outside waiting for the Ministry cars, stuck his head inside.  \"They're here, he said. \"Harry, come on.\"  Mr. Weasley marched Harry across the short stretch of pavement toward the first of two old- fashioned dark green cars, each of which was driven by a furtive-looking wizard wearing a suit of emerald velvet.  \"In you get, Harry,\" said Mr. Weasley, glancing up and down the crowded street.  Harry got into the back of the car and was shortly joined by Hermione, Ron, and, to Ron's disgust, Percy.  The journey to King's Cross was very uneventful compared with Harry's trip on the Knight Bus. The Ministry of Magic cars seemed almost ordinary. though Harry noticed that they could slide through gaps that Uncle Vernon's new company car certainly couldn't have managed. They reached King's Cross with twenty minutes to spare; the Ministry drivers found them trolleys, unloaded their trunks, touched their hats in salute to Mr. Weasley, and drove away, somehow managing to jump to the head of an unmoving line at the traffic lights.  Mr. Weasley kept close to Harry's elbow all the way into the station.  \"Right then,\" he said, glancing around them. \"Let's do this in pairs, as there are so many of us. I'll go through first with Harry.\"  Mr. Weasley strolled toward the barrier between platforms nine and ten, pushing Harry's trolley and apparently very interested in the InterCity 125 that had just arrived at platform nine. With a meaningful look at Harry, he leaned casually against the barrier. Harry imitated him.  In a moment, they had fallen sideways through the solid metal onto platform nine and three- quarters and looked up to see the Hogwarts Express, a scarlet steam engine, puffing smoke over a platform packed with witches and wizards seeing their children onto the train.  Percy and Ginny suddenly appeared behind Harry. They were panting and had apparently taken the barrier at a run.  \"Ah, there's Penelope!\" said Percy, smoothing his hair and going Pink again. Ginny caught Harry's eye, and they both turned away to hide their laughter as Percy strode over to a girl with long, curly hair, walking with his chest thrown out so that she couldn't miss his shiny badge. stood back to let him on. They leaned out of the window and waved at Mr. and Mrs. Weasley until the train turned a corner and blocked them from view.  \"I need to talk to you in private,\" Harry muttered to Ron and Hermione as the train picked up speed."
}