{
  "id": "c7ac8e0bcc0319b75cd375ba6747c265911510c2",
  "text": " The black sky wept, the river grumbled, men cursed and died. Arya had mud in her teeth and her face was wet. Rain. It’s only rain. That’s all it is.  We’re here,  she shouted. Her voice sounded thin and scared, a little girl’s voice.  Robb’s just in the castle, and my mother. The gate’s even open.  There were no more Freys riding out. I came so far.  We have to go get my mother.    Stupid little bitch.  Fires glinted off the snout of his helm, and made the steel teeth shine.  You go in there, you won’t come out. Maybe Frey will let you kiss your mother’s corpse.    Maybe we can save her…    Maybe you can. I’m not done living yet.  He rode toward her, crowding her back toward the wayn.  Stay or go, she-wolf. Live or die. Your—   Arya spun away from him and darted for the gate. The portcullis was coming down, but slowly. I have to run faster. The mud slowed her, though, and then the water. Run fast as a wolf. The drawbridge had begun to lift, the water running off it in a sheet, the mud falling in heavy clots. Faster. She heard loud splashing and looked back to see Stranger pounding after her, sending up gouts of water with every stride. She saw the longaxe too, still wet with blood and brains. And Arya ran. Not for her brother now, not even for her mother, but for herself. She ran faster than she had ever run before, her head down and her feet churning up the river, she ran from him as Mycah must have run.  His axe took her in the back of the head.      Tyrion   They supped alone, as they did so often.   The pease are overcooked,  his wife ventured once.   No matter,  he said.  So is the mutton.   It was a jest, but Sansa took it for criticism.  I am sorry, my lord.    Why? Some cook should be sorry. Not you. The pease are not your province, Sansa.    I… I am sorry that my lord husband is displeased.    Any displeasure I’m feeling has naught to do with pease. I have Joffrey and my sister to displease me, and my lord father, and three hundred bloody Dornishmen.  He had settled Prince Oberyn and his lords in a cornerfort facing the city, as far from the Tyrells as he could put them without evicting them from the Red Keep entirely. It was not nearly far enough. Already there had been a brawl in a Flea Bottom pot-shop that left one Tyrell man-at-arms dead and two of Lord Gargalen’s scalded, and an ugly confrontation in the yard when Mace Tyrell’s wizened little mother called Ellaria Sand  the serpent’s whore.  Every time he chanced to see Oberyn Martell the prince asked when the justice would be served. Overcooked pease were the least of Tyrion’s troubles, but he saw no point in burdening his young wife with any of that. Sansa had enough griefs of her own.   The pease suffice,  he told her curtly.  They are green and round, what more can one expect of pease? Here, I’ll have another serving, if it please my lady.  He beckoned, and Podrick Payne spooned so many pease onto his plate that Tyrion lost sight of his mutton. That was stupid, he told himself. Now I have to eat them all, or she’ll be sorry all over again.  The supper ended in a strained silence, as so many of their suppers did. Afterward, as Pod was removing the cups and platters, Sansa asked Tyrion for leave to visit the godswood.   As you wish.  He had become accustomed to his wife’s nightly devotions. She prayed at the royal sept as well, and often lit candles to Mother, Maid, and Crone. Tyrion found all this piety excessive, if truth be told, but in her place he might want the help of the gods as well.  I confess, I know little of the old gods,  he said, trying to be pleasant.  Perhaps someday you might enlighten me. I could even accompany you.    No,  Sansa said at once.  You… you are kind to offer, but… there are no devotions, my lord. No priests or songs or candles. Only trees, and silent prayer. You would be bored.    No doubt you’re right.  She knows me better than I thought.  Though the sound of rustling leaves might be a pleasant change from some septon droning on about the seven aspects of grace.  Tyrion waved her off.  I won’t intrude. Dress warmly, my lady, the wind is brisk out there.  He was tempted to ask what she prayed for, but Sansa was so dutiful she might actually tell him, and he didn’t think he wanted to know.  He went back to work after she left, trying to track some golden dragons through the labyrinth of Littlefinger’s ledgers. Petyr Baelish had not believed in letting gold sit about and grow dusty, that was for certain, but the more Tyrion tried to make sense of his accounts the more his head hurt. It was all very well to talk of breeding dragons instead of locking them up in the treasury, but some of these ventures smelled worse than week-old fish. I wouldn’t have been so quick to let Joffrey fling the Antler Men over the walls if I’d known how many of the bloody bastards had taken loans from the crown. He would have to send Bronn to find their heirs, but he feared that would prove as fruitful as trying to squeeze silver from a silverfish."
}