{
  "id": "c7df27c487b72a93bf27c77084583ddb09140ece",
  "text": " Over at the Slytherin table, Malfoy, Crabbe, and Goyle were laughing at him, tapping their heads with their fingers, pulling grotesquely mad faces, and waggling their tongues like snakes. \"How did she know your scar hurt in Divination?\" Ron said. \"There's no way she was there, there's no way she could've heard -\" \"The window was open,\" said Harry. \"I opened it to breathe.\" \"You were at the top of North Tower!\"  Hermione said.  \"Your voice couldn't have carried all the way down to the grounds!\" \"Well, you're the one who's supposed to be researching magical methods of bugging!\" said Harry. \"You tell me how she did it!\" \"I've been trying!\"  said Hermione.  \"But I... but. . .\" An odd, dreamy expression suddenly came over Hermione's face.  She slowly raised a hand and ran her fingers through her hair. \"Are you all right?\" said Ron, frowning at her. \"Yes,\" said Hermione breathlessly.  She ran her fingers through her hair again, and then held her hand up to her mouth, as though speaking into an invisible walkie-talkie.  Harry and Ron stared at each other. \"I've had an idea,\" Hermione said, gazing into space.  \"I think I know. . . because then no one would be able to see ... even Moody. . . and she'd have been able to get onto the window ledge . . . but she's not allowed . . . she's definitely not allowed ... I think we've got her!  Just give me two seconds in the library - just to make sure!\" With that, Hermione seized her school bag and dashed out of the Great Hall. \"Oi!\" Ron called after her.  \"We've got our History of Magic exam in ten minutes! Blimey,\" he said, turning back to Harry, \"she must really hate that Skeeter woman to risk missing the start of an exam.  What're you going to do in Binns's class - read again?\" Exempt from the end-of-term tests as a Triwizard champion, Harry had been sitting in the back of every exam class so far, looking up fresh hexes for the third task. \"S'pose so,\" Harry said to Ron; but just then. Professor McGonagall came walking alongside the Gryffindor table toward him. \"Potter, the champions are congregating in the chamber off the Hall after breakfast,\" she said. \"But the task's not till tonight!\"  said Harry, accidentally spilling scrambled eggs down his front, afraid he had mistaken the time. \"I'm aware of that, Potter,\" she said.  \"The champions' families are invited to watch the final task, you know.  This is simply a chance for you to greet them.\" She moved away. Harry gaped after her. \"She doesn't expect the Dursleys to turn up, does she?\"  he asked Ron blankly. \"Dunno,\" said Ron.  \"Harry, I'd better hurry, I'm going to be late for Binns.  See you later.\" Harry finished his breakfast in the emptying Great Hall.  He saw Fleur Delacour get up from the Ravenclaw table and join Cedric as he crossed to the side chamber and entered.  Krum slouched off to join them shortly afterward.  Harry stayed where he was.  He really didn't want to go into the chamber.  He had no family - no family who would turn up to see him risk his life, anyway.  But just as he was getting up, thinking that he might as well go up to the library and do a spot more hex research, the door of the side chamber opened, and Cedric stuck his head out. \"Harry, come on, they're waiting for you!\" Utterly perplexed.  Harry got up.  The Dursleys couldn't possibly be here, could they? He walked across the Hall and opened the door into the chamber. Cedric and his parents were just inside the door.  Viktor Krum was over in a corner, conversing with his dark-haired mother and father in rapid Bulgarian.  He had inherited his fathers hooked nose.  On the other side of the room, Fleur was jabbering away in French to her mother.  Fleur's little sister, Gabrielle, was holding her mother's hand.  She waved at Harry, who waved back, grinning.  Then he saw Mrs. Weasley and Bill standing in front of the fireplace, beaming at him. \"Surprise!\"  Mrs. Weasley said excitedly as he smiled broadly and walked over to them. \"Thought we'd come and watch you. Harry!\"  She bent down and kissed him on the cheek. \"You all right?\" said Bill, grinning at Harry and shaking his hand.  \"Charlie wanted to come, but he couldn't get time off.  He said you were incredible against the Horntail.\" Fleur Delacour, Harry noticed, was eyeing Bill with great interest over her mother's shoulder.  Harry could tell she had no objection whatsoever to long hair or earrings with fangs on them. \"This is really nice of you,\" Harry muttered to Mrs. Weasley.  \"I thought for a moment - the Dursleys -\" \"Hmm,\" said Mrs. Weasley, pursing her lips.  She had always refrained from criticizing the Dursleys in front of Harry, but her eyes flashed every time they were mentioned. \"It's great being back here,\" said Bill, looking around the chamber (Violet, the Fat Lady's friend, winked at him from her frame).  \"Haven't seen this place for five years.  Is that picture of the mad knight still around?  Sir Cadogan?\" \"Oh yeah,\" said Harry, who had met Sir Cadogan the previous year. \"And the Fat Lady?\" said Bill."
}