{
  "id": "c900a5a1ac9da658e55d34298e15a59281465d62",
  "text": " Florian was homely too, though not so old.  She was racing headlong down the serpentine steps when a man lurched out of a hidden doorway. Sansa caromed into him and lost her balance. Iron fingers caught her by the wrist before she could fall, and a deep voice rasped at her.  It’s a long roll down the serpentine, little bird. Want to kill us both?  His laughter was rough as a saw on stone.  Maybe you do.   The Hound.  No, my lord, pardons, I’d never.  Sansa averted her eyes but it was too late, he’d seen her face.  Please, you’re hurting me.  She tried to wriggle free.   And what’s Joff’s little bird doing flying down the serpentine in the black of night?  When she did not answer, he shook her.  Where were you?    The g-g-godswood, my lord,  she said, not daring to lie.  Praying… praying for my father, and… for the king, praying that he’d not be hurt.    Think I’m so drunk that I’d believe that?  He let go his grip on her arm, swaying slightly as he stood, stripes of light and darkness falling across his terrible burnt face.  You look almost a woman… face, teats, and you’re taller too, almost… ah, you’re still a stupid little bird, aren’t you? Singing all the songs they taught you… sing me a song, why don’t you? Go on. Sing to me. Some song about knights and fair maids. You like knights, don’t you?   He was scaring her.  T-true knights, my lord.    True knights,  he mocked.  And I’m no lord, no more than I’m a knight. Do I need to beat that into you?  Clegane reeled and almost fell.  Gods,  he swore,  too much wine. Do you like wine, little bird? True wine? A flagon of sour red, dark as blood, all a man needs. Or a woman.  He laughed, shook his head.  Drunk as a dog, damn me. You come now. Back to your cage, little bird. I’ll take you there. Keep you safe for the king.  The Hound gave her a push, oddly gentle, and followed her down the steps. By the time they reached the bottom, he had lapsed back into a brooding silence, as if he had forgotten she was there.  When they reached Maegor’s Holdfast, she was alarmed to see that it was Ser Boros Blount who now held the bridge. His high white helm turned stiffly at the sound of their footsteps. Sansa flinched away from his gaze. Ser Boros was the worst of the Kingsguard, an ugly man with a foul temper, all scowls and jowls.   That one is nothing to fear, girl.  The Hound laid a heavy hand on her shoulder.  Paint stripes on a toad, he does not become a tiger.   Ser Boros lifted his visor.  Ser, where—    Fuck your ser, Boros. You’re the knight, not me. I’m the king’s dog, remember?     The king was looking for his dog earlier.    The dog was drinking. It was your night to shield him, ser. You and my other brothers.   Ser Boros turned to Sansa.  How is it you are not in your chambers at this hour, lady?    I went to the godswood to pray for the safety of the king.  The lie sounded better this time, almost true.   You expect her to sleep with all the noise?  Clegane said.  What was the trouble?    Fools at the gate,  Ser Boros admitted.  Some loose tongues spread tales of the preparations for Tyrek’s wedding feast, and these wretches got it in their heads they should be feasted too. His Grace led a sortie and sent them scurrying.    A brave boy,  Clegane said, mouth twitching.  Let us see how brave he is when he faces my brother, Sansa thought. The Hound escorted her across the drawbridge. As they were winding their way up the steps, she said,  Why do you let people call you a dog? You won’t let anyone call you a knight.    I like dogs better than knights. My father’s father was kennelmaster at the Rock. One autumn year, Lord Tytos came between a lioness and her prey. The lioness didn’t give a shit that she was Lannister’s own sigil. Bitch tore into my lord’s horse and would have done for my lord too, but my grandfather came up with the hounds. Three of his dogs died running her off. My grandfather lost a leg, so Lannister paid him for it with lands and a towerhouse, and took his son to squire. The three dogs on our banner are the three that died, in the yellow of autumn grass. A hound will die for you, but never lie to you. And he’ll look you straight in the face.  He cupped her under the jaw, raising her chin, his fingers pinching her painfully.  And that’s more than little birds can do, isn’t it? I never got my song.    I… I know a song about Florian and Jonquil.    Florian and Jonquil? A fool and his cunt. Spare me. But one day I’ll have a song from you, whether you will it or no.    I will sing it for you gladly.   Sandor Clegane snorted.  Pretty thing, and such a bad liar. A dog can smell a lie, you know. Look around you, and take a good whiff. They’re all liars here… and every one better than you.       ARYA  When she climbed all the way up to the highest branch, Arya could see chimneys poking through the trees. Thatched roofs clustered along the shore of the lake and the small stream that emptied into it, and a wooden pier jutted out into the water beside a low long building with a slate roof."
}