{
  "id": "cada17e50eb7bd885367a0d2bcc3881825bcfdd5",
  "text": " Toward the end, Dany thought she glimpsed a fierce pride in his dark, almond-shaped eyes, but she could not be sure. The khal’s face did not often betray the thoughts within.  And finally it was done. Her cheeks and fingers were sticky as she forced down the last of it. Only then did she turn her eyes back to the old women, the crones of the dosh khaleen.   Khalakka dothrae mr’anha!  she proclaimed in her best Dothraki. A prince rides inside me! She had practiced the phrase for days with her handmaid Jhiqui.  The oldest of the crones, a bent and shriveled stick of a woman with a single black eye, raised her arms on high.  Khalakka dothrae!  she shrieked. The prince is riding!   He is riding!  the other women answered.  Rakh! Rakh! Rakh haj!  they proclaimed. A boy, a boy, a strong boy.  Bells rang, a sudden clangor of bronze birds. A deep-throated warhorn sounded its long low note. The old women began to chant. Underneath their painted leather vests, their withered dugs swayed back and forth, shiny with oil and sweat. The eunuchs who served them threw bundles of dried grasses into a great bronze brazier, and clouds of fragrant smoke rose up toward the moon and the stars. The Dothraki believed the stars were horses made of fire, a great herd that galloped across the sky by night.  As the smoke ascended, the chanting died away and the ancient crone closed her single eye, the better to peer into the future. The silence that fell was complete. Dany could hear the distant call of night birds, the hiss and crackle of the torches, the gentle lapping of water from the lake. The Dothraki stared at her with eyes of night, waiting.  Khal Drogo laid his hand on Dany’s arm. She could feel the tension in his fingers. Even a khal as mighty as Drogo could know fear when the dosh khaleen peered into smoke of the future. At her back, her handmaids fluttered anxiously.  Finally the crone opened her eye and lifted her arms.  I have seen his face, and heard the thunder of his hooves,  she proclaimed in a thin, wavery voice.   The thunder of his hooves!  the others chorused.   As swift as the wind he rides, and behind him his khalasar covers the earth, men without number, with arakhs shining in their hands like blades of razor grass. Fierce as a storm this prince will be. His enemies will tremble before him, and their wives will weep tears of blood and rend their flesh in grief. The bells in his hair will sing his coming, and the milk men in the stone tents will fear his name.  The old woman trembled and looked at Dany almost as if she were afraid.  The prince is riding, and he shall be the stallion who mounts the world.    The stallion who mounts the world!  the onlookers cried in echo, until the night rang to the sound of their voices.  The one-eyed crone peered at Dany.  What shall he be called, the stallion who mounts the world?   She stood to answer.  He shall be called Rhaego,  she said, using the words that Jhiqui had taught her. Her hands touched the swell beneath her breasts protectively as a roar went up from the Dothraki.  Rhaego,  they screamed.  Rhaego, Rhaego, Rhaego!   The name was still ringing in her ears as Khal Drogo led her from the pit. His bloodriders fell in behind them. A procession followed them out onto the godsway, the broad grassy road that ran through the heart of Vaes Dothrak, from the horse gate to the Mother of Mountains. The crones of the dosh khaleen came first, with their eunuchs and slaves. Some supported themselves with tall carved staffs as they struggled along on ancient, shaking legs, while others walked as proud as any horselord. Each of the old women had been a khaleesi once. When their lord husbands died and a new khal took his place at the front of his riders, with a new khaleesi mounted beside him, they were sent here, to reign over the vast Dothraki nation. Even the mightiest of khals bowed to the wisdom and authority of the dosh khaleen. Still, it gave Dany the shivers to think that one day she might be sent to join them, whether she willed it or no.  Behind the wise women came the others; Khal Ogo and his son, the khalakka Fogo, Khal Jommo and his wives, the chief men of Drogo’s khalasar, Dany’s handmaids, the khal’s servants and slaves, and more. Bells rang and drums beat a stately cadence as they marched along the godsway. Stolen heroes and the gods of dead peoples brooded in the darkness beyond the road. Alongside the procession, slaves ran lightly through the grass with torches in their hands, and the flickering flames made the great monuments seem almost alive.   What is meaning, name Rhaego?  Khal Drogo asked as they walked, using the Common Tongue of the Seven Kingdoms. She had been teaching him a few words when she could. Drogo was quick to learn when he put his mind to it, though his accent was so thick and barbarous that neither Ser Jorah nor Viserys could understand a word he said.   My brother Rhaegar was a fierce warrior, my sun-and-stars,  she told him.  He died before I was born."
}