{
  "id": "cc66fcbb8ad9f6a30782784d68e13174f55ced82",
  "text": "  She gave her arm to Arstan Whitebeard, to lead her back across the plaza to her litter. Aggo and Jhogo fell in to either side of them, walking with the bowlegged swagger all the horselords affected when forced to dismount and stride the earth like common mortals.  Dany climbed into her litter frowning, and beckoned Arstan to climb in beside her. A man as old as him should not be walking in such heat. She did not close the curtains as they got under way. With the sun beating down so fiercely on this city of red brick, every stray breeze was to be cherished, even if it did come with a swirl of fine red dust. Besides, I need to see.  Astapor was a queer city, even to the eyes of one who had walked within the House of Dust and bathed in the Womb of the World beneath the Mother of Mountains. All the streets were made of the same red brick that had paved the plaza. So too were the stepped pyramids, the deep-dug fighting pits with their rings of descending seats, the sulfurous fountains and gloomy wine caves, and the ancient walls that encircled them. So many bricks, she thought, and so old and crumbling. Their fine red dust was everywhere, dancing down the gutters at each gust of wind. Small wonder so many Astapori women veiled their faces; the brick dust stung the eyes worse than sand.   Make way!  Jhogo shouted as he rode before her litter.  Make way for the Mother of Dragons!  But when he uncoiled the great silverhandled whip that Dany had given him, and made to crack it in the air, she leaned out and told him nay.  Not in this place, blood of my blood,  she said, in his own tongue.  These bricks have heard too much of the sound of whips.   The streets had been largely deserted when they had set out from the port that morning, and scarcely seemed more crowded now. An elephant lumbered past with a latticework litter on its back. A naked boy with peeling skin sat in a dry brick gutter, picking his nose and staring sullenly at some ants in the street. He lifted his head at the sound of hooves, and gaped as a column of mounted guards trotted by in a cloud of red dust and brittle laughter. The copper disks sewn to their cloaks of yellow silk glittered like so many suns, but their tunics were embroidered linen, and below the waist they wore sandals and pleated linen skirts. Bareheaded, each man had teased and oiled and twisted his stiff red-black hair into some fantastic shape, horns and wings and blades and even grasping hands, so they looked like some troupe of demons escaped from the seventh hell. The naked boy watched them for a bit, along with Dany, but soon enough they were gone, and he went back to his ants, and a knuckle up his nose.  An old city, this, she reflected, but not so populous as it was in its glory, nor near so crowded as Qarth or Pentos or Lys.  Her litter came to a sudden halt at the cross street, to allow a coffle of slaves to shuffle across her path, urged along by the crack of an overseer’s lash. These were no Unsullied, Dany noted, but a more common sort of men, with pale brown skins and black hair. There were women among them, but no children. All were naked. Two Astapori rode behind them on white asses, a man in a red silk tokar and a veiled woman in sheer blue linen decorated with flakes of lapis lazuli. In her red-black hair she wore an ivory comb. The man laughed as he whispered to her, paying no more mind to Dany than to his slaves, nor the overseer with his twisted five-thonged lash, a squat broad Dothraki who had the harpy and chains tattooed proudly across his muscular chest.   Bricks and blood built Astapor,  Whitebeard murmured at her side,  and bricks and blood her people.    What is that?  Dany asked him, curious.   An old rhyme a maester taught me, when I was a boy. I never knew how true it was. The bricks of Astapor are red with the blood of the slaves who make them.    I can well believe that,  said Dany.   Then leave this place before your heart turns to brick as well. Sail this very night, on the evening tide.   Would that I could, thought Dany.  When I leave Astapor it must be with an army, Ser Jorah says.    Ser Jorah was a slaver himself, Your Grace,  the old man reminded her.  There are sellswords in Pentos and Myr and Tyrosh you can hire. A man who kills for coin has no honor, but at least they are no slaves. Find your army there, I beg you.    My brother visited Pentos, Myr, Braavos, near all the Free Cities. The magisters and archons fed him wine and promises, but his soul was starved to death. A man cannot sup from the beggar’s bowl all his life and stay a man. I had my taste in Qarth, that was enough. I will not come to Pentos bowl in hand.    Better to come a beggar than a slaver,  Arstan said.   There speaks one who has been neither.  Dany’s nostrils flared.  Do you know what it is like to be sold, squire? I do. My brother sold me to Khal Drogo for the promise of a golden crown. Well, Drogo crowned him in gold, though not as he had wished, and I… my sun-and-stars made a queen of me, but if he had been a different man, it might have been much otherwise."
}