{
  "id": "d0143420ec0872cfced069c1a527e591bd4e6016",
  "text": "   Cersei was not appeased.  I want you to make Father bring his army to King’s Landing.   Where it will serve no purpose but to make you feel safe.  When have I ever been able to make Father do anything?   She ignored the question.  And when do you plan to free Jaime? He’s worth a hundred of you.   Tyrion grinned crookedly.  Don’t tell Lady Stark, I beg you. We don’t have a hundred of me to trade.    Father must have been mad to send you. You’re worse than useless.  The queen jerked on her reins and wheeled her palfrey around. She rode out the gate at a brisk trot, ermine cloak streaming behind her. Her retinue hastened after.  In truth, Renly Baratheon did not frighten Tyrion half so much as his brother Stannis did. Renly was beloved of the commons, but he had never before led men in war. Stannis was otherwise: hard, cold, inexorable. if only they had some way of knowing what was happening on Dragonstone… but not one of the fisherfolk he had paid to spy out the island had ever returned, and even the informers the eunuch claimed to have placed in Stannis’s household had been ominously silent. The striped hulls of Lysene war galleys had been seen offshore, though, and Varys had reports from Myr of sellsail captains taking service with Dragonstone. If Stannis attacks by sea while his brother Renly storms the gates, they’ll soon be mounting Joffrey’s head on a spike. Worse, mine will be beside him. A depressing thought. He ought to make plans to get Shae safely out of the city, should the worst seem likely.  Podrick Payne stood at the door of his solar, studying the floor.  He’s inside,  he announced to Tyrion’s belt buckle.  Your solar. My lord. Sorry.   Tyrion sighed.  Look at me, Pod. It unnerves me when you talk to my codpiece, especially when I’m not wearing one. Who is inside my solar?    Lord Littlefinger.  Podrick managed a quick look at his face, then hastily dropped his eyes.  I meant, Lord Petyr. Lord Baelish. The master of coin.     You make him sound a crowd.  The boy hunched down as if struck, making Tyrion feel absurdly guilty.  Lord Petyr was seated on his window seat, languid and elegant in a plush plum-colored doublet and a yellow satin cape, one gloved hand resting on his knee.  The king is fighting hares with a crossbow,  he said.  The hares are winning. Come see.   Tyrion had to stand on his toes to get a look. A dead hare lay on the ground below; another, long ears twitching, was about to expire from the bolt in his side. Spent quarrels lay strewn across the hard-packed earth like straws scattered by a storm.  Now!  Joff shouted. The gamesman released the hare he was holding, and he went bounding off. Joffrey jerked the trigger on the crossbow. The bolt missed by two feet. The hare stood on his hind legs and twitched his nose at the king. Cursing, Joff spun the wheel to winch back his string, but the animal was gone before he was loaded.  Another!  The gamesman reached into the hutch. This one made a brown streak against the stones, while Joffrey’s hurried shot almost took Ser Preston in the groin.  Littlefinger turned away.  Boy, are you fond of potted hare?  he asked Podrick Payne.  Pod stared at the visitor’s boots, lovely things of red-dyed leather ornamented with black scrollwork.  To eat, my lord?    Invest in pots,  Littlefinger advised.  Hares will soon overrun the castle. We’ll be eating hare thrice a day.    Better than rats on a skewer,  said Tyrion.  Pod, leave us. Unless Lord Petyr would care for some refreshment?    Thank you, but no.  Littlefinger flashed his mocking smile.  Drink with the dwarf, it’s said, and you wake up walking the Wall. Black brings out my unhealthy pallor.   Have no fear, my lord, Tyrion thought, it’s not the Wall I have in mind for you. He seated himself in a high chair piled with cushions and said,  You look very elegant today, my lord.    I’m wounded. I strive to look elegant every day.    Is the doublet new?    It is. You’re most observant.    Plum and yellow. Are those the colors of your House?    No. But a man gets bored wearing the same colors day in and day out, or so I’ve found.    That’s a handsome knife as well.    Is it?  There was mischief in Littlefinger’s eyes. He drew the knife and glanced at it casually, as if he had never seen it before.  Valyrian steel, and a dragonbone hilt. A trifle plain, though. It’s yours, if you would like it.    Mine?  Tyrion gave him a long look.  No. I think not. Never mine.  He knows, the insolent wretch. He knows and he knows that I know, and he thinks that I cannot touch him.  If ever truly a man had armored himself in gold, it was Petyr Baelish, not Jaime Lannister. Jaime’s famous armor was but gilded steel, but Littlefinger, ah… Tyrion had learned a few things about sweet Petyr, to his growing disquiet.  Ten years ago, Jon Arryn had given him a minor sinecure in customs, where Lord Petyr had soon distinguished himself by bringing in three times as much as any of the king’s other collectors. King Robert had been a prodigious spender."
}