{
  "id": "d0b8f4721b0c6da4b49f3f76d100314c17020648",
  "text": "   Here’s something you don’t know. It wasn’t supposed to happen like it did. I was set to leave, wagons bought and loaded, and a man comes with a boy for me, and a purse of coin, and a message, never mind who it’s from. Lord Eddard’s to take the black, he says to me, wait, he’ll be going with you. Why d’you think I was there? Only something went queer.    Joffrey,  Arya breathed.  Someone should kill him!    Someone will, but it won’t be me, nor you neither.  Yoren tossed back her stick sword.  Got sourleaf back at the wagons,  he said as they made their way back to the road.  You’ll chew some, it’ll help with the sting.   It did help, some, though the taste of it was foul and it made her spit look like blood. Even so, she walked for the rest of that day, and the day after, and the day after that, too raw to sit a donkey. Hot Pie was worse off; Yoren had to shift some barrels around so he could lie in the back of a wagon on some sacks of barley, and he whimpered every time the wheels hit a rock. Lommy Greenhands wasn’t even hurt, yet he stayed as far away from Arya as he could get.  Every time you look at him, he twitches,  the Bull told her as she walked beside his donkey. She did not answer. It seemed safer not to talk to anyone.  That night she lay upon her thin blanket on the hard ground, staring up at the great red comet. The comet was splendid and scary all at once.  The Red Sword,  the Bull named it; he claimed it looked like a sword, the blade still red-hot from the forge. When Arya squinted the right way she could see the sword too, only it wasn’t a new sword, it was Ice, her father’s greatsword, all ripply Valyrian steel, and the red was Lord Eddard’s blood on the blade after Ser Ilyn the King’s Justice had cut off his head. Yoren had made her look away when it happened, yet it seemed to her that the comet looked like Ice must have, after.  When at last she slept, she dreamed of home. The kingsroad wound its way past Winterfell on its way to the Wall, and Yoren had promised he’d leave her there with no one any wiser about who she’d been. She yearned to see her mother again, and Robb and Bran and Rickon… but it was Jon Snow she thought of most. She wished somehow they could come to the Wall before Winterfell, so Jon might muss up her hair and call her  little sister.  She’d tell him,  I missed you,  and he’d say it too at the very same moment, the way they always used to say things together. She would have liked that. She would have liked that better than anything.      SANSA  The morning of King Joffrey’s name day dawned bright and windy, with the long tail of the great comet visible through the high scuttling clouds. Sansa was watching it from her tower window when Ser Arys Oakheart arrived to escort her down to the tourney grounds.  What do you think it means?  she asked him.   Glory to your betrothed,  Ser Arys answered at once.  See how it flames across the sky today on His Grace’s name day, as if the gods themselves had raised a banner in his honor. The smallfolk have named it King Joffrey’s Comet.   Doubtless that was what they told Joffrey; Sansa was not so sure.  I’ve heard servants calling it the Dragon’s Tail.    King Joffrey sits where Aegon the Dragon once sat, in the castle built by his son,  Ser Arys said.  He is the dragon’s heir—and crimson is the color of House Lannister, another sign. This comet is sent to herald Joffrey’s ascent to the throne, I have no doubt. It means that he will triumph over his enemies.   Is it true? she wondered. Would the gods be so cruel? Her mother was one of Joffrey’s enemies now, her brother Robb another. Her father had died by the king’s command. Must Robb and her lady mother die next? The comet was red, but Joffrey was Baratheon as much as Lannister, and their sigil was a black stag on a golden field. Shouldn’t the gods have sent Joff a golden comet?  Sansa closed the shutters and turned sharply away from the window.  You look very lovely today, my lady,  Ser Arys said.   Thank you, ser.  Knowing that Joffrey would require her to attend the tourney in his honor, Sansa had taken special care with her face and clothes. She wore a gown of pale purple silk and a moonstone hair net that had been a gift from Joffrey. The gown had long sleeves to hide the bruises on her arms. Those were Joffrey’s gifts as well. When they told him that Robb had been proclaimed King in the North, his rage had been a fearsome thing, and he had sent Ser Boros to beat her.   Shall we go?  Ser Arys offered his arm and she let him lead her from her chamber. If she must have one of the Kingsguard dogging her steps, Sansa preferred that it be him. Ser Boros was short-tempered, Ser Meryn cold, and Ser Mandon’s strange dead eyes made her uneasy, while Ser Preston treated her like a lackwit child. Arys Oakheart was courteous, and would talk to her cordially. Once he even objected when Joffrey commanded him to hit her. He did hit her in the end, but not hard as Ser Meryn or Ser Boros might have, and at least he had argued."
}