{
  "id": "d11c6d49907f409137c9939b51b72312a6d08e97",
  "text": " Nothing would please me more than to hunt you down like the pig you are.  His arms were red to the elbow as he laid the skinning knife aside.  So. There is your choice. The Night’s Watch —he reached inside the deer, ripped out its heart, and held it in his fist, red and dripping— or this.   Sam told the tale in a calm, dead voice, as if it were something that had happened to someone else, not to him. And strangely, Jon thought, he did not weep, not even once. When he was done, they sat together and listened to the wind for a time. There was no other sound in all the world.  Finally Jon said,  We should go back to the common hall.    Why?  Sam asked.  Jon shrugged.  There’s hot cider to drink, or mulled wine if you prefer. Some nights Dareon sings for us, if the mood is on him. He was a singer, before… well, not truly, but almost, an apprentice singer.    How did he come here?  Sam asked.   Lord Rowan of Goldengrove found him in bed with his daughter. The girl was two years older, and Dareon swears she helped him through her window, but under her father’s eye she named it rape, so here he is. When Maester Aemon heard him sing, he said his voice was honey poured over thunder.  Jon smiled.  Toad sometimes sings too, if you call it singing. Drinking songs he learned in his father’s winesink. Pyp says his voice is piss poured over a fart.  They laughed at that together.   I should like to hear them both,  Sam admitted,  but they would not want me there.  His face was troubled.  He’s going to make me fight again on the morrow, isn’t he?    He is,  Jon was forced to say.  Sam got awkwardly to his feet.  I had better try to sleep.  He huddled down in his cloak and plodded off.  The others were still in the common room when Jon returned, alone but for Ghost.  Where have you been?  Pyp asked.   Talking with Sam,  he said.   He truly is craven,  said Grenn.  At supper, there were still places on the bench when he got his pie, but he was too scared to come sit with us.    The Lord of Ham thinks he’s too good to eat with the likes of us,  suggested Jeren.   I saw him eat a pork pie,  Toad said, smirking.  Do you think it was a brother?  He began to make oinking noises.   Stop it!  Jon snapped angrily.  The other boys fell silent, taken aback by his sudden fury.  Listen to me,  Jon said into the quiet, and he told them how it was going to be. Pyp backed him, as he’d known he would, but when Halder spoke up, it was a pleasant surprise. Grenn was anxious at the first, but Jon knew the words to move him. One by one the rest fell in line. Jon persuaded some, cajoled some, shamed the others, made threats where threats were required. At the end they had all agreed… all but Rast.   You girls do as you please,  Rast said,  but if Thorne sends me against Lady Piggy, I’m going to slice me off a rasher of bacon.  He laughed in Jon’s face and left them there.  Hours later, as the castle slept, three of them paid a call on his cell. Grenn held his arms while Pyp sat on his legs. Jon could hear Rast’s rapid breathing as Ghost leapt onto his chest. The direwolf’s eyes burned red as embers as his teeth nipped lightly at the soft skin of the boy’s throat, just enough to draw blood.  Remember, we know where you sleep,  Jon said softly.  The next morning Jon heard Rast tell Albett and Toad how his razor had slipped while he shaved.  From that day forth, neither Rast nor any of the others would hurt Samwell Tarly. When Ser Alliser matched them against him, they would stand their ground and swat aside his slow, clumsy strokes. If the master-at-arms screamed for an attack, they would dance in and tap Sam lightly on breastplate or helm or leg. Ser Alliser raged and threatened and called them all cravens and women and worse, yet Sam remained unhurt. A few nights later, at Jon’s urging, he joined them for the evening meal, taking a place on the bench beside Halder. It was another fortnight before he found the nerve to join their talk, but in time he was laughing at Pyp’s faces and teasing Grenn with the best of them.  Fat and awkward and frightened he might be, but Samwell Tarly was no fool. One night he visited Jon in his cell.  I don’t know what you did,  he said,  but I know you did it.  He looked away shyly.  I’ve never had a friend before.    We’re not friends,  Jon said. He put a hand on Sam’s broad shoulder.  We’re brothers.   And so they were, he thought to himself after Sam had taken his leave. Robb and Bran and Rickon were his father’s sons, and he loved them still, yet Jon knew that he had never truly been one of them. Catelyn Stark had seen to that. The grey walls of Winterfell might still haunt his dreams, but Castle Black was his life now, and his brothers were Sam and Grenn and Halder and Pyp and the other cast-outs who wore the black of the Night’s Watch.   My uncle spoke truly,  he whispered to Ghost. He wondered if he would ever see Benjen Stark again, to tell him.      EDDARD   It’s the hand’s tourney that’s the cause of all the trouble, my lords,  the commander of the city watch complained to the king’s council."
}