{
  "id": "d1e5a4f8c5421299f2eb896558351fe36a759cc1",
  "text": "  \"Don't let him get you, Harry - don't let go!\" She and the other two shadowy figures began to pace around the inner walls of the golden web, while the Death Eaters flitted around the outside of it... and Voldemort's dead victims whispered as they circled the duelers, whispered words of encouragement to Harry, and hissed words Harry couldn't hear to Voldemort. And now another head was emerging from the tip of Voldemorts wand . . . and Harry knew when he saw it who it would be ... he knew, as though he had expected it from the moment when Cedric had appeared from the wand . . . knew, because the man appearing was the one he'd thought of more than any other tonight. . . . The smoky shadow of a tall man with untidy hair fell to the ground as Bertha had done, straightened up, and looked at him . . . and Harry, his arms shaking madly now, looked back into the ghostly face of his father. \"Your mother's coming . . .\" he said quietly.  \"She wants to see you ... it will be all right.. . hold on. . . .\" And she came. . . first her head, then her body... a young woman with long hair, the smoky, shadowy form of Lily Potter blossomed from the end of Voldemort's wand, fell to the ground, and straightened like her husband.  She walked close to Harry, looking down at him, and she spoke in the same distant, echoing voice as the others, but quietly, so that Voldemort, his face now livid with fear as his victims prowled around him, could not hear. . .. \"When the connection is broken, we will linger for only moments . . . but we will give you time. . . you must get to the Portkey, it will return you to Hogwarts ... do you understand, Harry?\" \"Yes,\" Harry gasped, fighting now to keep a hold on his wand, which was slipping and sliding beneath his fingers. \"Harry . . .\" whispered the figure of Cedric, \"take my body back, will you?  Take my body back to my parents, ...\" \"I will,\" said Harry, his face screwed up with the effort of holding the wand. \"Do it now,\" whispered his father's voice, \"be ready to run . . . do it now. ...\" \"NOW!\"  Harry yelled; he didn't think he could have held on for another moment anyway - he pulled his wand upward with an almighty wrench, and the golden thread broke; the cage of light vanished, the phoenix song died - but the shadowy figures of Voldemort's victims did not disappear - they were closing in upon Voldemort, shielding Harry from his gaze - And Harry ran as he had never run in his life, knocking two stunned Death Eaters aside as he passed; he zigzagged behind headstones, feeling their curses following him, hearing them hit the headstones - he was dodging curses and graves, pelting toward Cedric's body, no longer aware of the pain in his leg, his whole being concentrated on what he had to do - \"Stun him!\" he heard Voldemort scream. Ten feet from Cedric, Harry dived behind a marble angel to avoid the jets of red light and saw the tip of its wing shatter as the spells hit it.  Gripping his wand more tightly, he dashed out from behind the angel - \"Impedimenta!\" he bellowed, pointing his wand wildly over his shoulder at the Death Eaters running at him. From a muffled yell, he thought he had stopped at least one of them, but there was no time to stop and look; he jumped over the cup and dived as he heard more wand blasts behind him; more jets of light flew over his head as he fell, stretching out his hand to grab Cedric's arm... \"Stand aside!  I will kill him!  He is mine!\" shrieked Voldemort.  Harry's hand had closed on Cedric's wrist; one tombstone stood between him and Voldemort, but Cedric was too heavy to carry, and the cup was out of reach - Voldemort's red eyes flamed in the darkness. Harry saw his mouth curl into a smile, saw him raise his wand. \"Accio!\"  Harry yelled, pointing his wand at the Triwizard Cup.  It flew into the air and soared toward him.  Harry caught it by the handle - He heard Voldemort s scream of fury at the same moment that he felt the jerk behind his navel that meant the Portkey had worked - it was speeding him away in a whirl of wind and color, and Cedric along with him. . . . They were going back.  CHAPTER THIRTY-FIVE - VERITASERUM  Harry felt himself slam flat into the ground; his face was pressed into grass; the smell of it filled his nostrils.  He had closed his eyes while the Portkey transported him, and he kept them closed now.  He did not move.  All the breath seemed to have been knocked out of him; his head was swimming so badly he felt as though the ground beneath him were swaying like the deck of a ship.  To hold himself steady, he tightened his hold on the two things he was still clutching: the smooth, cold handle of the Triwizard Cup and Cedric's body.  He felt as though he would slide away into the blackness gathering at the edges of his brain if he let go of either of them.  Shock and exhaustion kept him on the ground, breathing in the smell of the grass, waiting . . . waiting for someone to do something . . . something to happen . . . and all the while, his scar burned dully on his forehead."
}