{
  "id": "d3c9467a2ad25ab05d0c2da3f41f80be9b90efe0",
  "text": "  As glib of tongue as she is fair of face.  By your speech, I’d judge you nobly born.    My father is Selwyn of Tarth, by the grace of the gods Lord of Evenfall.  Even that was given grudgingly.   Tarth,  Jaime said.  A ghastly large rock in the narrow sea, as I recall. And Evenfall is sworn to Storm’s End. How is it that you serve Robb of Winterfell?     It is Lady Catelyn I serve. And she commanded me to deliver you safe to your brother Tyrion at King’s Landing, not to bandy words with you. Be silent.    I’ve had a bellyful of silence, woman.    Talk with Ser Cleos then. I have no words for monsters.   Jaime hooted.  Are there monsters hereabouts? Hiding beneath the water, perhaps? In that thick of willows? And me without my sword!    A man who would violate his own sister, murder his king, and fling an innocent child to his death deserves no other name.   Innocent? The wretched boy was spying on us. All Jaime had wanted was an hour alone with Cersei. Their journey north had been one long torment; seeing her every day, unable to touch her, knowing that Robert stumbled drunkenly into her bed every night in that great creaking wheelhouse. Tyrion had done his best to keep him in a good humor, but it had not been enough.  You will be courteous as concerns Cersei, wench,  he warned her.   My name is Brienne, not wench.    What do you care what a monster calls you?    My name is Brienne,  she repeated, dogged as a hound.   Lady Brienne?  She looked so uncomfortable that Jaime sensed a weakness.  Or would Ser Brienne be more to your taste?  He laughed.  No, I fear not. You can trick out a milk cow in crupper, crinet, and chamfron, and bard her all in silk, but that doesn’t mean you can ride her into battle.    Cousin Jaime, please, you ought not speak so roughly.  Under his cloak, Ser Cleos wore a surcoat quartered with the twin towers of House Frey and the golden lion of Lannister.  We have far to go, we should not quarrel amongst ourselves.    When I quarrel I do it with a sword, coz. I was speaking to the lady. Tell me, wench, are all the women on Tarth as homely as you? I pity the men, if so. Perhaps they do not know what real women look like, living on a dreary mountain in the sea.    Tarth is beautiful,  the wench grunted between strokes.  The Sapphire Isle, it’s called. Be quiet, monster, unless you mean to make me gag you.    She’s rude as well, isn’t she, coz?  Jaime asked Ser Cleos.  Though she has steel in her spine, I’ll grant you. Not many men dare name me monster to my face.  Though behind my back they speak freely enough, I have no doubt.  Ser Cleos coughed nervously.  Lady Brienne had those lies from Catelyn Stark, no doubt. The Starks cannot hope to defeat you with swords, ser, so now they make war with poisoned words.   They did defeat me with swords, you chinless cretin. Jaime smiled knowingly. Men will read all sorts of things into a knowing smile, if you let them. Has cousin Cleos truly swallowed this kettle of dung, or is he striving to ingratiate himself? What do we have here, an honest muttonhead or a lickspittle?  Ser Cleos prattled blithely on.  Any man who’d believe that a Sworn Brother of the Kingsguard would harm a child does not know the meaning of honor.   Lickspittle. If truth be told, Jaime had come to rue heaving Brandon Stark out that window. Cersei had given him no end of grief afterward, when the boy refused to die.  He was seven, Jaime,  she’d berated him.  Even if he understood what he saw, we should have been able to frighten him into silence.    I didn’t think you’d want—    You never think. If the boy should wake and tell his father what he saw—    If if if.  He had pulled her into his lap.  if he wakes we’ll say he was dreaming, we’ll call him a liar, and should worse come to worst I’ll kill Ned Stark.    And then what do you imagine Robert will do?    Let Robert do as he pleases. I’ll go to war with him if I must. The War for Cersei’s Cunt, the singers will call it.    Jaime, let go of me!  she raged, struggling to rise.  Instead he had kissed her. For a moment she resisted, but then her mouth opened under his. He remembered the taste of wine and cloves on her tongue. She gave a shudder. His hand went to her bodice and yanked, tearing the silk so her breasts spilled free, and for a time the Stark boy had been forgotten.  Had Cersei remembered him afterward and hired this man Lady Catelyn spoke of, to make sure the boy never woke? If she wanted him dead she would have sent me. And it is not like her to chose a catspaw who would make such a royal botch of the killing.  Downriver, the rising sun shimmered against the wind-whipped surface of the river. The south shore was red clay, smooth as any road. Smaller streams fed into the greater, and the rotting trunks of drowned trees clung to the banks. The north shore was wilder. High rocky bluffs rose twenty feet above them, crowned by stands of beech, oak, and chestnut. Jaime spied a watchtower on the heights ahead, growing taller with every stroke of the oars."
}