{
  "id": "d4326f1e700861a304b6f04e75b3b96bf332bd47",
  "text": " She held her breath as the men reached the top of the steps.   What would you have me do?  asked the torchbearer, a stout man in a leather half cape. Even in heavy boots, his feet seemed to glide soundlessly over the ground. A round scarred face and a stubble of dark beard showed under his steel cap, and he wore mail over boiled leather, and a dirk and shortsword at his belt. It seemed to Arya there was something oddly familiar about him.   If one Hand can die, why not a second?  replied the man with the accent and the forked yellow beard.  You have danced the dance before, my friend.  He was no one Arya had ever seen before, she was certain of it. Grossly fat, yet he seemed to walk lightly, carrying his weight on the balls of his feet as a water dancer might. His rings glimmered in the torchlight, red-gold and pale silver, crusted with rubies, sapphires, slitted yellow tiger eyes. Every finger wore a ring; some had two.   Before is not now, and this Hand is not the other,  the scarred man said as they stepped out into the hall. Still as stone, Arya told herself, quiet as a shadow. Blinded by the blaze of their own torch, they did not see her pressed flat against the stone, only a few feet away.   Perhaps so,  the forked beard replied, pausing to catch his breath after the long climb.  Nonetheless, we must have time. The princess is with child. The khal will not bestir himself until his son is born. You know how they are, these savages.   The man with the torch pushed at something. Arya heard a deep rumbling. A huge slab of rock, red in the torchlight, slid down out of the ceiling with a resounding crash that almost made her cry out. Where the entry to the well had been was nothing but stone, solid and unbroken.   If he does not bestir himself soon, it may be too late,  the stout man in the steel cap said.  This is no longer a game for two players, if ever it was. Stannis Baratheon and Lysa Arryn have fled beyond my reach, and the whispers say they are gathering swords around them. The Knight of Flowers writes Highgarden, urging his lord father to send his sister to court. The girl is a maid of fourteen, sweet and beautiful and tractable, and Lord Renly and Ser Loras intend that Robert should bed her, wed her, and make a new queen. Littlefinger… the gods only know what game Littlefinger is playing. Yet Lord Stark’s the one who troubles my sleep. He has the bastard, he has the book, and soon enough he’ll have the truth. And now his wife has abducted Tyrion Lannister, thanks to Littlefinger’s meddling. Lord Tywin will take that for an outrage, and Jaime has a queer affection for the Imp. If the Lannisters move north, that will bring the Tullys in as well. Delay, you say. Make haste, I reply. Even the finest of jugglers cannot keep a hundred balls in the air forever.    You are more than a juggler, old friend. You are a true sorcerer. All I ask is that you work your magic awhile longer.  They started down the hall in the direction Arya had come, past the room with the monsters.   What I can do, I will,  the one with the torch said softly.  I must have gold, and another fifty birds.   She let them get a long way ahead, then went creeping after them. Quiet as a shadow.   So many?  The voices were fainter as the light dwindled ahead of her.  The ones you need are hard to find… so young, to know their letters… perhaps older… not die so easy…    No. The younger are safer… treat them gently…    …if they kept their tongues…    …the risk…   Long after their voices had faded away, Arya could still see the light of the torch, a smoking star that bid her follow. Twice it seemed to disappear, but she kept on straight, and both times she found herself at the top of steep, narrow stairs, the torch glimmering far below her. She hurried after it, down and down. Once she stumbled over a rock and fell against the wall, and her hand found raw earth supported by timbers, whereas before the tunnel had been dressed stone.  She must have crept after them for miles. Finally they were gone, but there was no place to go but forward. She found the wall again and followed, blind and lost, pretending that Nymeria was padding along beside her in the darkness. At the end she was knee-deep in foul-smelling water, wishing she could dance upon it as Syrio might have, and wondering if she’d ever see light again. It was full dark when finally Arya emerged into the night air.  She found herself standing at the mouth of a sewer where it emptied into the river. She stank so badly that she stripped right there, dropping her soiled clothing on the riverbank as she dove into the deep black waters. She swam until she felt clean, and crawled out shivering. Some riders went past along the river road as Arya was washing her clothes, but if they saw the scrawny naked girl scrubbing her rags in the moonlight, they took no notice.  She was miles from the castle, but from anywhere in King’s Landing you needed only to look up to see the Red Keep high on Aegon’s Hill, so there was no danger of losing her way."
}