{
  "id": "d450ed2ca232d0c745d2d9b0a2b9da47549a68e3",
  "text": " Young Henly was dead and Old Henly was dying, surrounded by foes. He could see Easy spinning and slashing, laughing like a loon, his cloak flapping as he leapt from cask to cask. A bronze axe caught him just below the knee and the laughter turned into a bubbling shriek.   They’re breaking,  Satin said.   No,  said Jon,  they’re broken.   It happened quickly. One mole fled and then another, and suddenly all the villagers were throwing down their weapons and abandoning the barricade. The brothers were too few to hold alone. Jon watched them try and form a line to fall back in order, but the Thenns washed over them with spear and axe, and then they were fleeing too. Dornish Dilly slipped and went down on his face, and a wildling planted a spear between his shoulder blades. Kegs, slow and short of breath, had almost reached the bottom step when a Thenn caught the end of his cloak and yanked him around… but a crossbow quarrel dropped the man before his axe could fall.  Got him,  Satin crowed, as Kegs staggered to the stair and began to crawl up the steps on hands and knees.  The gate is lost. Donal Noye had closed and chained it, but it was there for the taking, the iron bars glimmering red with reflected firelight, the cold black tunnel behind. No one had fallen back to defend it; the only safety was on top of the Wall, seven hundred feet up the crooked wooden stairs.   What gods do you pray to?  Jon asked Satin.   The Seven,  the boy from Oldtown said.   Pray, then,  Jon told him.  Pray to your new gods, and I’ll pray to my old ones.  It all turned here.  With the confusion at the trapdoor, Jon had forgotten to fill his quiver. He limped back across the roof and did that now, and picked up his bow as well. The kettle had not moved from where he’d left it, so it seemed as though they were safe enough for the nonce. The dance has moved on, and we’re watching from the gallery, he thought as he hobbled back. Satin was loosing quarrels at the wildlings on the steps, then ducking down behind a merlon to cock the crossbow. He may be pretty, but he’s quick.  The real battle was on the steps. Noye had put spearmen on the two lowest landings, but the headlong flight of the villagers had panicked them and they had joined the flight, racing up toward the third landing with the Thenns killing anyone who fell behind. The archers and crossbowmen on the higher landings were trying to drop shafts over their heads. Jon nocked an arrow, drew, and loosed, and was pleased when one of the wildlings went rolling down the steps. The heat of the fires was making the Wall weep, and the flames danced and shimmered against the ice. The steps shook to the footsteps of men running for their lives.  Again Jon notched and drew and loosed, but there was only one of him and one of Satin, and a good sixty or seventy Thenns pounding up the stairs, killing as they went, drunk on victory. On the fourth landing, three brothers in black cloaks stood shoulder to shoulder with longswords in their hands, and battle was joined again, briefly. But there were only three and soon enough the wildling tide washed over them, and their blood dripped down the steps.  A man is never so vulnerable in battle as when he flees,  Lord Eddard had told Jon once.  A running man is like a wounded animal to a soldier. It gets his bloodlust up.  The archers on the fifth landing fled before the battle even reached them. It was a rout, a red rout.   Fetch the torches,  Jon told Satin. There were four of them stacked beside the fire, their heads wrapped in oily rags. There were a dozen fire arrows too. The Oldtown boy thrust one torch into the fire until it was blazing brightly, and brought the rest back under his arm, unlit. He looked frightened again, as well he might. Jon was frightened too.  It was then that he saw Styr. The Magnar was climbing up the barricade, over the gutted corn sacks and smashed barrels and the bodies of friends and foe alike. His bronze scale armor gleamed darkly in the firelight. Styr had taken off his helm to survey the scene of his triumph, and the bald earless whoreson was smiling. In his hand was a long weirwood spear with an ornate bronze head. When he saw the gate, he pointed the spear at it and barked something in the Old Tongue to the half-dozen Thenns around him. Too late, Jon thought. You should have led your men over the barricade, you might have been able to save a few.  Up above, a warhorn sounded, long and low. Not from the top of the Wall, but from the ninth landing, some two hundred feet up, where Donal Noye was standing.  Jon notched a fire arrow to his bowstring, and Satin lit it from the torch. He stepped to the parapet, drew, aimed, loosed. Ribbons of flame trailed behind as the shaft sped downward and thudded into its target, crackling.  Not Styr. The steps. Or more precisely, the casks and kegs and sacks that Donal Noye had piled up beneath the steps, as high as the first landing; the barrels of lard and lamp oil, the bags of leaves and oily rags, the split logs, bark, and wood shavings."
}