{
  "id": "d52cbf20ce0a676871a18881fa3060c3db21a3d1",
  "text": "  That boy looked pretty sickly when he arrived.  Crouch being an important Ministry member, he and his wife were allowed a deathbed visit.  That was the last time I saw Barty Crouch, half carrying his wife past my cell.  She died herself, apparently, shortly afterward.  Grief.  Wasted away just like the boy.  Crouch never came for his sons body.  The dementors buried him outside the fortress; I watched them do it.\" Sirius threw aside the bread he had just lifted to his mouth and instead picked up the flask of pumpkin juice and drained it. \"So old Crouch lost it all, just when he thought he had it made,\" he continued, wiping his mouth with the back of his hand.  \"One moment, a hero, poised to become Minister of Magic...next, his son dead, his wife dead, the family name dishonored, and, so I've heard since I escaped, a big drop in popularity.  Once the boy had died, people started feeling a bit more sympathetic toward the son and started asking how a nice young lad from a good family had gone so badly astray.  The conclusion was that his father never cared much for him.  So Cornelius Fudge got the top job, and Crouch was shunted sideways into the Department of International Magical Cooperation.\" There was a long silence.  Harry was thinking of the way Crouch's eyes had bulged as he'd looked down at his disobedient house-elf back in the wood at the Quidditch World Cup. This, then, must have been why Crouch had overreacted to Winky being found beneath the Dark Mark.  It had brought back memories of his son, and the old scandal, and his fall from grace at the Ministry. \"Moody says Crouch is obsessed with catching Dark wizards,\" Harry told Sirius. \"Yeah, I've heard it's become a bit of a mania with him,\" said Sirius, nodding.  \"If you ask me, he still thinks he can bring back the old popularity by catching one more Death Eater.\" \"And he sneaked up here to search Snape's office!\" s aid Ron triumphantly, looking at Hermione. \"Yes, and that doesn't make sense at all,\" said Sirius. \"Yeah, it does!\"  said Ron excitedly, but Sirius shook his head. \"Listen, if Crouch wants to investigate Snape, why hasn't he been coming to judge the tournament?  It would be an ideal excuse to make regular visits to Hogwarts and keep an eye on him.\" \"So you think Snape could be up to something, then?\"  asked Harry, but Hermione broke in. \"Look, I don't care what you say, Dumbledore trusts Snape -\" \"Oh give it a rest, Hermione,\" said Ron impatiently.  \"I know Dumbledores brilliant and everything, but that doesn't mean a really clever Dark wizard couldn't fool him -\" \"Why did Snape save Harry's life in the first year, then?  Why didn't he just let him die?\" \"I dunno - maybe he thought Dumbledore would kick him out-\" \"What d'you think, Sirius?\"  Harry said loudly, and Ron and Hermione stopped bickering to listen. \"I think they've both got a point,\" said Sirius, looking thoughtfully at Ron and Hermione. \"Ever since I found out Snape was teaching here, I've wondered why Dumbledore hired him. Snape's always been fascinated by the Dark Arts, he was famous for it at school.  Slimy, oily, greasy-haired kid, he was,\"  Sirius added, and Harry and Ron grinned at each other.  \"Snape knew more curses when he arrived at school than half the kids in seventh year, and he was part of a gang of Slytherins who nearly all turned out to be Death Eaters.\" Sirius held up his fingers and began ticking off names. \"Rosier and Wilkes - they were both killed by Aurors the year before Voldemort fell. The Lestranges - they're a married couple - they're in Azkaban.  Avery - from what I've heard he wormed his way out of trouble by saying he'd been acting under the Imperius Curse - he's still at large.  But as far as I know, Snape was never even accused of being a Death Eater - not that that means much.  Plenty of them were never caught.  And Snape s certainly clever and cunning enough to keep himself out of trouble.\" \"Snape knows Karkaroff pretty well, but he wants to keep that quiet,\" said Ron. \"Yeah, you should've seen Snape's face when Karkaroff turned up in Potions yesterday!\"  said Harry quickly.  \"Karkaroff wanted to talk to Snape, he says Snape's been avoiding him.  Karkaroff looked really worried.  He showed Snape something on his arm, but I couldn't see what it was.\" He showed Snape something on his arm?\"  said Sirius, looking frankly bewildered.  He ran his fingers distractedly through his filthy hair, then shrugged again.  \"Well, I've no idea what that's about. . . but if Karkaroff s genuinely worried, and he's going to Snape for answers ...\" Sirius stared at the cave wall, then made a grimace of frustration. \"There's still the fact that Dumbledore trusts Snape, and I know Dumbledore trusts where a lot of other people wouldn't, but I just can't see him letting Snape teach at Hogwarts if he'd ever worked for Voldemort.\" \"Why are Moody and Crouch so keen to get into Snapes office then?\"  said Ron stubbornly. \"Well,\" said Sirius slowly, \"I wouldn't put it past Mad-Eye to have searched every single teacher's office when he got to Hogwarts."
}