{
  "id": "d537a42d46dc57d96c234de2cae330d55f037872",
  "text": " It took him ages to get the beastly stuff out of his  eyes and eyebrows, and as for his beard, he had to cut most of it off. Well, between  them  they started  to haul up  first one dwarf and  then another and slash  them  free.  None  of  them were  better  off  than  Fili,  and  some  of  them were worse.  Some  had  hardly  been  able  to breathe  at  all  (long noses  are  sometimes useful you  see),  and  some had been more poisoned.  In  this  way  they  rescued  Kili,  Bifur,  Bofur,  Don  and  Nori.  Poor  old  Bombur  was  so  exhausted-he was  the  fattest  and  had  been  constantly  pinched  and  poked- that  he  just  rolled off  the branch  and  fell plop on  to  the ground,  fortunately on  to  leaves,  and  lay  there.  But  there were  still  five  dwarves  hanging  at  the  end  of  the  branch  when  the  spiders  began  to  come  back,  more  full  of  rage  than  ever.  Bilbo  immediately  went  to  the  end  of  the  branch  nearest  the  tree-trunk  and  kept  back  those that crawled up. He had taken off his ring when he rescued Fili and forgotten  to put it on again, so now they all began to splutter and hiss:  \"Now  we  see  you,  you  nasty  little  creature!  We  will  eat  you  and  leave  your  bones and skin hanging on a tree. Ugh! he's got a sting has he? Well, we'll get him  all the same, and then we'll hang him head downwards for a day or two.\"  While  this  was  going  on,  the  other  dwarves  were  working  at  the  rest  of  the  captives,  and  cutting  at  the  threads  with  their  knives.  Soon  all  would  be  free,  though  it  was  not  clear  what  would  happen  after  that.  The  spiders  had  caught  them  pretty  easily  the  night  before,  but  that  had  been  unawares  and  in  the  dark.  This time there looked like being a horrible battle.  Suddenly  Bilbo  noticed  that  some  of  the  spiders  had  gathered  round  old  Bombur on the floor, and had tied him up again and were dragging him away. He  gave  a  shout  and  slashed  at  the  spiders  in  front  of  him.  They  quickly  gave way,  and  he  scrambled  and  fell  down  the  tree  right  into  the  middle  of  those  on  the  ground. His  little sword was something new  in  the way of stings for  them. How  it  darted  to  and  fro!  It  shone with  delight  as  he  stabbed  at  them. Half  a  dozen were  killed before the rest drew off and left Bombur to Bilbo.  \"Come  down! Come  down!\"  he  shouted  to  the  dwarves  on  the  branch.  \"Don't  stay up  there and be netted!\" For he saw spiders swarming up all  the neighboring  trees, and crawling along the boughs above the heads of the dwarves.   ####-Down the dwarves scrambled or jumped or dropped, eleven all in a heap, most  of  them  very  shaky  and  little  use  on  their  legs. There  they were  at  last,  twelve  of  them counting poor old Bombur, who was being propped up on either  side by his  cousin Bifur, and his brother Bofur; and Bilbo was dancing about and waving his  Sting;  and  hundreds  of  angry  spiders were  goggling  at  them  all  round  and  about  and above. It looked pretty hopeless.  Then  the  battle  began. Some  of  the  dwarves  had  knives,  and some had sticks,  and  all  of  them  could  get  at  stones;  and  Bilbo  had  his  elvish  dagger.  Again  and  again  the spiders were beaten off, and many of  them were killed. But  it could not  go  on  for  long. Bilbo was  nearly  tired  out;  only  four  of  the  dwarves were  able to  stand firmly, and soon they would all be overpowered like weary flies. Already the  spiders were beginning to weave their webs all round them again from tree to tree.  In the end Bilbo could think of no plan except to let the dwarves into the secret of  his ring. He was rather sorry about it, but it could not be helped.  \"I  am  going  to  disappear,\"  he  said.  \"I  shall  draw  the  spiders  off,  if  I  can;  and  you must keep  together  and make  in  the opposite direction. To  the  left  there,  that  is more or less the way towards the place where we last saw the elf-fires.\"  It was difficult to get them to understand, what with their dizzy heads, and the  shouts, and the whacking of sticks and the throwing of stones; but at last Bilbo felt  he  could  delay  no  longer-the  spiders  were  drawing  their  circle  ever  closer.  He  suddenly  slipped  on  his  ring,  and  to  the  great  astonishment  of  the  dwarves  he  vanished.  Soon  there  came  the  sound  of  \"Lazy  Lob\"  and  \"Attercop\"  from  among  the  trees  away  on  the  right.  That  upset  the  spiders  greatly. They  stopped  advancing,  and  some,  went  off  in  the  direction  of  the  voice.  \"Attercop\" made  them  so  angry  that  they  lost  their wits. Then Balin, who had grasped Bilbo's plan better  than  the  rest, led an attack. The dwarves huddled together in a knot, and sending a shower  of  stones  they  drove  at  the  spiders  on  the  left,  and  burst  through  the  ring.  Away  behind them now the shouting and singing suddenly stopped."
}