{
  "id": "d5397a3392035b0a85e1b0a58363b48696e984bd",
  "text": "    Let them. You’re safer that way, sweetling. Queen Cersei and the Imp and Lord Varys and their like, they all watch each other keen as hawks, and pay this one and that one to spy out what the others are doing, but no one ever troubles themselves about Lady Tanda’s daughter, do they?  Dontos covered his mouth to stifle a burp.  Gods preserve you, my little Jonquil.  He was growing weepy. The wine did that to him.  Give your Florian a little kiss now. A kiss for luck.  He swayed toward her.  Sansa dodged the wet groping lips, kissed him lightly on an unshaven cheek, and bid him good night. It took all her strength not to weep. She had been weeping too much of late. It was unseemly, she knew, but she could not seem to help herself; the tears would come, sometimes over a trifle, and nothing she did could hold them back.  The drawbridge to Maegor’s Holdfast was unguarded. The Imp had moved most of the gold cloaks to the city walls, and the white knights of the Kingsguard had duties more important than dogging her heels. Sansa could go where she would so long as she did not try to leave the castle, but there was nowhere she wanted to go.  She crossed over the dry moat with its cruel iron spikes and made her way up the narrow turnpike stair, but when she reached the door of her bedchamber she could not bear to enter. The very walls of the room made her feel trapped; even with the window opened wide it felt as though there were no air to breathe.  Turning back to the stair, Sansa climbed. The smoke blotted out the stars and the thin crescent of moon, so the roof was dark and thick with shadows. Yet from here she could see everything: the Red Keep’s tall towers and great cornerforts, the maze of city streets beyond, to south and west the river running black, the bay to the east, the columns of smoke and cinders, and fires, fires everywhere. Soldiers crawled over the city walls like ants with torches, and crowded the hoardings that had sprouted from the ramparts. Down by the Mud Gate, outlined against the drifting smoke, she could make out the vague shape of the three huge catapults, the biggest anyone had ever seen, overtopping the walls by a good twenty feet. Yet none of it made her feel less fearful. A stab went through her, so sharp that Sansa sobbed and clutched at her belly. She might have fallen, but a shadow moved suddenly, and strong fingers grabbed her arm and steadied her.  She grabbed a merlon for support, her fingers scrabbling at the rough stone.  Let go of me,  she cried.  Let go.    The little bird thinks she has wings, does she? Or do you mean to end up crippled like that brother of yours?   Sansa twisted in his grasp.  I wasn’t going to fall. It was only… you startled me, that’s all.    You mean I scared you. And still do.   She took a deep breath to calm herself.  I thought I was alone, I…  She glanced away.   The little bird still can’t bear to look at me, can she?  The Hound released her.  You were glad enough to see my face when the mob had you, though. Remember?   Sansa remembered all too well. She remembered the way they had howled, the feel of the blood running down her cheek from where the stone had struck her, and the garlic stink on the breath of the man who had tried to pull her from her horse. She could still feel the cruel pinch of fingers on her wrist as she lost her balance and began to fall.  She’d thought she was going to die then, but the fingers had twitched, all five at once, and the man had shrieked loud as a horse. When his hand fell away, another hand, stronger, shoved her back into her saddle. The man with the garlicky breath was on the ground, blood pumping out the stump of his arm, but there were others all around, some with clubs in hand. The Hound leapt at them, his sword a blur of steel that trailed a red mist as it swung. When they broke and ran before him he had laughed, his terrible burned face for a moment transformed.  She made herself look at that face now, really look. It was only courteous, and a lady must never forget her courtesies. The scars are not the worst part, nor even the way his mouth twitches. It’s his eyes. She had never seen eyes so full of anger.  I… I should have come to you after,  she said haltingly.  To thank you, for… for saving me… you were so brave.    Brave?  His laugh was half a snarl.  A dog doesn’t need courage to chase off rats. They had me thirty to one, and not a man of them dared face me.   She hated the way he talked, always so harsh and angry.  Does it give you joy to scare people?    No, it gives me joy to kill people.  His mouth twitched.  Wrinkle up your face all you like, but spare me this false piety. You were a high lord’s get. Don’t tell me Lord Eddard Stark of Winterfell never killed a man.    That was his duty. He never liked it.    Is that what he told you?  Clegane laughed again.  Your father lied. Killing is the sweetest thing there is.  He drew his longsword.  Here’s your truth. Your precious father found that out on Baelor’s steps."
}