{
  "id": "d544f5434a4c68c78c679501c8d5ae36377b3b95",
  "text": "    I wish you well of them, my lady,  Ser Cortnay answered,  but I bow to other gods, and a different king.    There is but one true king, and one true god,  announced Lord Florent.   Are we here to dispute theology, my lord? Had I known, I would have brought a septon.    You know full well why we are here,  said Stannis.  You have had a fortnight to consider my offer. You sent your ravens. No help has come. Nor will it. Storm’s End stands alone, and I am out of patience. One last time, ser, I command you to open your gates, and deliver me that which is mine by rights.    And the terms?  asked Ser Cortnay.   Remain as before,  said Stannis.  I will pardon you for your treason, as I have pardoned these lords you see behind me. The men of your garrison will be free to enter my service or to return unmolested to their homes. You may keep your weapons and as much property as a man can carry. I will require your horses and pack animals, however.    And what of Edric Storm?    My brother’s bastard must be surrendered to me.    Then my answer is still no, my lord.   The king clenched his jaw. He said nothing.  Melisandre spoke instead.  May the Lord of Light protect you in your darkness, Ser Cortnay.    May the Others bugger your Lord of Light,  Penrose spat back,  and wipe his arse with that rag you bear.   Lord Alester Florent cleared his throat.  Ser Cortnay, mind your tongue. His Grace means the boy no harm. The child is his own blood, and mine as well. My niece Delena was the mother, as all men know. If you will not trust to the king, trust to me. You know me for a man of honor—    I know you for a man of ambition,  Ser Cortnay broke in.  A man who changes kings and gods the way I change my boots. As do these other turncloaks I see before me.   An angry clamor went up from the king’s men. He is not far wrong, Davos thought. Only a short time before, the Fossoways, Guyard Morrigen, and the Lords Caron, Varner, Errol, and Estermont had all belonged to Renly. They had sat in his pavilion, helped him make his battle plans, plotted how Stannis might be brought low. And Lord Florent had been with them—he might be Queen Selyse’s own uncle, but that had not kept the Lord of Brightwater from bending his knee to Renly when Renly’s star was rising.  Bryce Caron walked his horse forward a few paces, his long rainbow-striped cloak twisting in the wind off the bay.  No man here is a turncloak, ser. My fealty belongs to Storm’s End, and King Stannis is its rightful lord… and our true king. He is the last of House Baratheon, Robert’s heir and Renly’s.    If that is so, why is the Knight of Flowers not among you? And where is Mathis Rowan? Randyll Tarly? Lady Oakheart? Why are they not here in your company, they who loved Renly best? Where is Brienne of Tarth, I ask you?    That one?  Ser Guyard Morrigen laughed harshly.  She ran. As well she might. Hers was the hand that slew the king.    A lie,  Ser Cortnay said.  I knew Brienne when she was no more than a girl playing at her father’s feet in Evenfall Hall, and I knew her still better when the Evenstar sent her here to Storm’s End. She loved Renly Baratheon from the first moment she laid eyes on him, a blind man could see it.    To be sure,  declared Lord Florent airily,  and she would scarcely be the first maid maddened to murder by a man who spurned her. Though for my own part, I believe it was Lady Stark who slew the king. She had journeyed all the way from Riverrun to plead for an alliance, and Renly had refused her. No doubt she saw him as a danger to her son, and so removed him.    It was Brienne,  insisted Lord Caron.  Ser Emmon Cuy swore as much before he died. You have my oath on that, Ser Cortnay.   Contempt thickened Ser Cortnay’s voice.  And what is that worth? You wear your cloak of many colors, I see. The one Renly gave you when you swore your oath to protect him. If he is dead, how is it you are not?  He turned his scorn on Guyard Morrigen.  I might ask the same of you, ser. Guyard the Green, yes? Of the Rainbow Guard? Sworn to give his own life for his king’s? if I had such a cloak, I would be ashamed to wear it.   Morrigen bristled.  Be glad this is a parley, Penrose, or I would have your tongue for those words.    And cast it in the same fire where you left your manhood?    Enough!  Stannis said.  The Lord of Light willed that my brother die for his treason. Who did the deed matters not.    Not to you, perhaps,  said Ser Cortnay.  I have heard your proposal, Lord Stannis. Now here is mine.  He pulled off his glove and flung it full in the king’s face.  Single combat. Sword, lance, or any weapon you care to name. Or if you fear to hazard your magic sword and royal skin against an old man, name you a champion, and I shall do the same.  He gave Guyard Morrigen and Bryce Caron a scathing look.  Either of these pups would do nicely, I should think.   Ser Guyard Morrigen grew dark with fury.  I will take up the gage, if it please the king.    As would I.  Bryce Caron looked to Stannis."
}