{
  "id": "d83655aaf53bcbea9cea58c072a04a102d124afa",
  "text": "  Did Ser Loras hurt his leg?    Not his leg,  Sansa said, nibbling delicately at a chicken leg.  Father’s leg, silly. It hurts him ever so much, it makes him cross. Otherwise I’m certain he would have sent Ser Loras.   Her father’s decision still bewildered her. When the Knight of Flowers had spoken up, she’d been sure she was about to see one of Old Nan’s stories come to life. Ser Gregor was the monster and Ser Loras the true hero who would slay him. He even looked a true hero, so slim and beautiful, with golden roses around his slender waist and his rich brown hair tumbling down into his eyes. And then Father had refused him! It had upset her more than she could tell. She had said as much to Septa Mordane as they descended the stairs from the gallery, but the septa had only told her it was not her place to question her lord father’s decisions.  That was when Lord Baelish had said,  Oh, I don’t know, Septa. Some of her lord father’s decisions could do with a bit of questioning. The young lady is as wise as she is lovely.  He made a sweeping bow to Sansa, so deep she was not quite sure if she was being complimented or mocked.  Septa Mordane had been very upset to realize that Lord Baelish had overheard them.  The girl was just talking, my lord,  she’d said.  Foolish chatter. She meant nothing by the comment.   Lord Baelish stroked his little pointed beard and said,  Nothing? Tell me, child, why would you have sent Ser Loras?   Sansa had no choice but to explain about heroes and monsters. The king’s councillor smiled.  Well, those are not the reasons I’d have given, but…  He had touched her cheek, his thumb lightly tracing the line of a cheekbone.  Life is not a song, sweetling. You may learn that one day to your sorrow.   Sansa did not feel like telling all that to Jeyne, however; it made her uneasy just to think back on it.   Ser Ilyn’s the King’s Justice, not Ser Loras,  Jcyne said.  Lord Eddard should have sent him.   Sansa shuddered. Every time she looked at Ser Ilyn Payne, she shivered. He made her feel as though something dead were slithering over her naked skin.  Ser Ilyn’s almost like a second monster. I’m glad Father didn’t pick him.    Lord Beric is as much a hero as Ser Loras. He’s ever so brave and gallant.    I suppose,  Sansa said doubtfully. Beric Dondarrion was handsome enough, but he was awfully old, almost twenty-two; the Knight of Flowers would have been much better. Of course, Jeyne had been in love with Lord Beric ever since she had first glimpsed him in the lists. Sansa thought she was being silly; Jeyne was only a steward’s daughter, after all, and no matter how much she mooned after him, Lord Beric would never look at someone so far beneath him, even if she hadn’t been half his age.  It would have been unkind to say so, however, so Sansa took a sip of milk and changed the subject.  I had a dream that Joffrey would be the one to take the white hart,  she said. It had been more of a wish, actually, but it sounded better to call it a dream. Everyone knew that dreams were prophetic. White harts were supposed to be very rare and magical, and in her heart she knew her gallant prince was worthier than his drunken father.   A dream? Truly? Did Prince Joffrey just go up to it and touch it with his bare hand and do it no harm?    No,  Sansa said.  He shot it with a golden arrow and brought it back for me.  In the songs, the knights never killed magical beasts, they just went up to them and touched them and did them no harm, but she knew Joffrey liked hunting, especially the killing part. Only animals, though. Sansa was certain her prince had no part in murdering Jory and those other poor men; that had been his wicked uncle, the Kingslayer. She knew her father was still angry about that, but it wasn’t fair to blame Joff. That would be like blaming her for something that Arya had done.   I saw your sister this afternoon,  Jeyne blurted out, as if she’d been reading Sansa’s thoughts.  She was walking through the stables on her hands. Why would she do a thing like that?    I’m sure I don’t know why Arya does anything.  Sansa hated stables, smelly places full of manure and flies. Even when she went riding, she liked the boy to saddle the horse and bring it to her in the yard.  Do you want to hear about the court or not?    I do,  Jeyne said.   There was a black brother,  Sansa said,  begging men for the Wall, only he was kind of old and smelly.  She hadn’t liked that at all. She had always imagined the Night’s Watch to be men like Uncle Benjen. In the songs, they were called the black knights of the Wall. But this man had been crookbacked and hideous, and he looked as though he might have lice. If this was what the Night’s Watch was truly like, she felt sorry for her bastard half brother, Jon.  Father asked if there were any knights in the hall who would do honor to their houses by taking the black, but no one came forward, so he gave this Yoren his pick of the king’s dungeons and sent him on his way."
}