{
  "id": "d8a338f070d6caa51d9a0e64522eab4bd229ceff",
  "text": " We have sworn you our faith by earth and water, bronze and iron, ice and fire. The risk is yours, Bran, as is the gift. The choice should be yours too, I think. We are your servants to command.  She grinned.  At least in this.    You mean,  Bran said,  you’ll do what I say? Truly?    Truly, my prince,  the girl replied,  so consider well.   Bran tried to think it through, the way his father might have. The Greatjon’s uncles Hother Whoresbane and Mors Crowfood were fierce men, but he thought they would be loyal. And the Karstarks, them too. Karhold was a strong castle, Father always said. We would be safe with the Umbers or the Karstarks.  Or they could go south to fat Lord Manderly. At Winterfell, he’d laughed a lot, and never seemed to look at Bran with so much pity as the other lords. Castle Cerwyn was closer than White Harbor, but Maester Luwin had said that Cley Cerwyn was dead. The Umbers and the Karstarks and the Manderlys may all be dead as well, he realized. As he would be, if he was caught by the ironmen or the Bastard of Bolton.  If they stayed here, hidden down beneath Tumbledown Tower, no one would find them. He would stay alive. And crippled.  Bran realized he was crying. Stupid baby, he thought at himself. No matter where he went, to Karhold or White Harbor or Greywater Watch, he’d be a cripple when he got there. He balled his hands into fists.  I want to fly,  he told them.  Please. Take me to the crow.       Davos   When he came up on deck, the long point of Driftmark was dwindling behind them while Dragonstone rose from the sea ahead. A pale grey wisp of smoke blew from the top of the mountain to mark where the island lay. Dragonmont is restless this morning, Davos thought, or else Melisandre is burning someone else.  Melisandre had been much in his thoughts as Shayala’s Dance made her way across Blackwater Bay and through the Gullet, tacking against perverse contrary winds. The great fire that burned atop the Sharp Point watchtower at the end of Massey’s Hook reminded him of the ruby she wore at her throat, and when the world turned red at dawn and sunset the drifting clouds turned the same color as the silks and satins of her rustling gowns.  She would be waiting on Dragonstone as well, waiting in all her beauty and all her power, with her god and her shadows and his king. The red priestess had always seemed loyal to Stannis, until now. She has broken him, as a man breaks a horse. She would ride him to power if she could, and for that she gave my sons to the fire. I will cut the living heart from her breast and see how it burns. He touched the hilt of the fine long Lysene dirk that the captain had given him.  The captain had been very kind to him. His name was Khorane Sathmantes, a Lyseni like Salladhor Saan, whose ship this was. He had the pale blue eyes you often saw on Lys, set in a bony weatherworn face, but he had spent many years trading in the Seven Kingdoms. When he learned that the man he had plucked from the sea was the celebrated onion knight, he gave him the use of his own cabin and his own clothes, and a pair of new boots that almost fit. He insisted that Davos share his provisions as well, though that turned out badly. His stomach could not tolerate the snails and lampreys and other rich food Captain Khorane so relished, and after his first meal at the captain’s table he spent the rest of the day with one end or the other dangling over the rail.  Dragonstone loomed larger with every stroke of the oars. Davos could see the shape of the mountain now, and on its side the great black citadel with its gargoyles and dragon towers. The bronze figurehead at the bow of Shayala’s Dance sent up wings of salt spray as it cut the waves. He leaned his weight against the rail, grateful for its support. His ordeal had weakened him. If he stood too long his legs shook, and sometimes he fell prey to uncontrollable fits of coughing and brought up gobs of bloody phlegm. It is nothing, he told himself. Surely the gods did not bring me safe through flre and sea only to kill me with a flux.  As he listened to the pounding of the oarmaster’s drum, the thrum of the sail, and the rhythmic swish and creak of the oars, he thought back to his younger days, when these same sounds woke dread in his heart on many a misty morn. They heralded the approach of old Ser Tristimun’s sea watch, and the sea watch was death to smugglers when Aerys Targaryen sat the Iron Throne.  But that was another lifetime, he thought. That was before the onion ship, before Storm’s End, before Stannis shortened my fingers. That was before the war or the red comet, before I was a Seaworth or a knight. I was a different man in those days, before Lord Stannis raised me high.  Captain Khorane had told him of the end of Stannis’s hopes, on the night the river burned. The Lannisters had taken him from the flank, and his fickle bannermen had abandoned him by the hundreds in the hour of his greatest need.  King Renly’s shade was seen as well,  the captain said,  slaying right and left as he led the lion lord’s van."
}