{
  "id": "da878b58de2201631649b46683fe5cf9ee6f3871",
  "text": " I am alive, and drunk on sunlight. A laugh burst from his lips, sudden as a quail flushed from cover.   Quiet,  the wench grumbled, scowling. Scowls suited her broad homely face better than a smile. Not that Jaime had ever seen her smiling. He amused himself by picturing her in one of Cersei’s silken gowns in place of her studded leather jerkin. As well dress a cow in silk as this one.  But the cow could row. Beneath her roughspun brown breeches were calves like cords of wood, and the long muscles of her arms stretched and tightened with each stroke of the oars. Even after rowing half the night, she showed no signs of tiring, which was more than could be said for his cousin Ser Cleos, laboring on the other oar. A big strong peasant wench to look at her, yet she speaks like one highborn and wears longsword and dagger. Ah, but can she use them? Jaime meant to find out, as soon as he rid himself of these fetters.  He wore iron manacles on his wrists and a matching pair about his ankles, joined by a length of heavy chain no more than a foot long.  You’d think my word as a Lannister was not good enough,  he’d japed as they bound him. He’d been very drunk by then, thanks to Catelyn Stark. Of their escape from Riverrun, he recalled only bits and pieces. There had been some trouble with the gaoler, but the big wench had overcome him.  After that they had climbed an endless stair, around and around. His legs were weak as grass, and he’d stumbled twice or thrice, until the wench lent him an arm to lean on. At some point he was bundled into a traveler’s cloak and shoved into the bottom of a skiff. He remembered listening to Lady Catelyn command someone to raise the portcullis on the Water Gate. She was sending Ser Cleos Frey back to King’s Landing with new terms for the queen, she’d declared in a tone that brooked no argument.  He must have drifted off then. The wine had made him sleepy, and it felt good to stretch, a luxury his chains had not permitted him in the cell. Jaime had long ago learned to snatch sleep in the saddle during a march. This was no harder. Tyrion is going to laugh himself sick when he hears how I slept through my own escape. He was awake now, though, and the fetters were irksome.  My lady,  he called out,  if you’ll strike off these chains, I’ll spell you at those oars.   She scowled again, her face all horse teeth and glowering suspicion.  You’ll wear your chains, Kingslayer.    You figure to row all the way to King’s Landing, wench?    You will call me Brienne. Not wench.    My name is Ser Jaime. Not Kingslayer.    Do you deny that you slew a king?    No. Do you deny your sex? If so, unlace those breeches and show me.  He gave her an innocent smile.  I’d ask you to open your bodice, but from the look of you that wouldn’t prove much.   Ser Cleos fretted.  Cousin, remember your courtesies.   The Lannister blood runs thin in this one. Cleos was his Aunt Genna’s son by that dullard Emmon Frey, who had lived in terror of Lord Tywin Lannister since the day he wed his sister. When Lord Walder Frey had brought the Twins into the war on the side of Riverrun, Ser Emmon had chosen his wife’s allegiance over his father’s. Casterly Rock got the worst of that bargain, Jaime reflected. Ser Cleos looked like a weasel, fought like a goose, and had the courage of an especially brave ewe. Lady Stark had promised him release if he delivered her message to Tyrion, and Ser Cleos had solemnly vowed to do so.  They’d all done a deal of vowing back in that cell, Jaime most of all. That was Lady Catelyn’s price for loosing him. She had laid the point of the big wench’s sword against his heart and said,  Swear that you will never again take up arms against Stark nor Tully. Swear that you will compel your brother to honor his pledge to return my daughters safe and unharmed. Swear on your honor as a knight, on your honor as a Lannister, on your honor as a Sworn Brother of the Kingsguard. Swear it by your sister’s life, and your father’s, and your son’s, by the old gods and the new, and I’ll send you back to your sister. Refuse, and I will have your blood.  He remembered the prick of the steel through his rags as she twisted the point of the sword.  I wonder what the High Septon would have to say about the sanctity of oaths sworn while dead drunk, chained to a wall, with a sword pressed to your chest? Not that Jaime was truly concerned about that fat fraud, or the gods he claimed to serve. He remembered the pail Lady Catelyn had kicked over in his cell. A strange woman, to trust her girls to a man with shit for honor. Though she was trusting him as little as she dared. She is putting her hope in Tyrion, not in me.  Perhaps she is not so stupid after all,  he said aloud.  His captor took it wrong.  I am not stupid. Nor deaf.   He was gentle with her; mocking this one would be so easy there would be no sport to it.  I was speaking to myself, and not of you. It’s an easy habit to slip into in a cell.   She frowned at him, pushing the oars forward, pulling them back, pushing them forward, saying nothing."
}