{
  "id": "db74406a93a2ab3219f7c41c47e22c23e7a7fcdd",
  "text": "  Then  Bard  drew his bow-string to his ear. The dragon was circling back, flying low, and as he  came the moon rose above the eastern shore and silvered his great wings.  \"Arrow!\"  said  the  bowman.  \"Black  arrow!  I  have  saved  you  to  the  last.  You  have never  failed me and always  I have  recovered you.  I had you  from my  father  and  he  from  of  old.  If  ever  you  came  from  the  forges  of  the  true  king  under  the  Mountain, go now and speed well!\"  The  dragon  swooped  once more  lower  than  ever,  and  as  he  turned  and  dived  down his belly glittered white with  sparkling  fires of gems  in  the moon-but not in  one place. The great bow  twanged. The black arrow sped straight from  the string,  straight  for  the  hollow  by  the  left  breast  where  the  foreleg  was  flung  wide.  In  it  smote and vanished, barb, shaft and  feather, so  fierce was  its  flight. With a shriek  that  deafened men,  felled  trees  and  split  stone,  Smaug  shot  spouting  into  the  air,  turned over and crashed down from on high in ruin.  Full on  the  town he  fell. His  last  throes splintered  it  to sparks and gledes. The  lake roared  in. A vast steam  leaped up, white  in  the sudden dark under  the moon.   ####-There  was  a  hiss,  a  gushing  whirl,  and  then  silence.  And  that  was  the  end  of  Smaug  and  Esgaroth,  but  not  of  Bard.  The waxing moon  rose  higher  and  higher  and the wind grew loud and cold. It twisted the white fog into bending pillars and  hurrying  clouds  and  drove  it  off  to  the West  to  scatter  in  tattered  shreds over  the  marshes before Mirkwood. Then the many boats could be seen dotted dark on the  surface of  the  lake, and down  the wind came  the voices of  the people of Esgaroth  lamenting  their  lost  town and goods and  ruined houses. But  they had  really much  to be  thankful  for, had  they  thought of  it,  though  it  could hardly be  expected  that  they should just then: three quarters of the people of the town had at least escaped  alive;  their  woods  and  fields  and  pastures  and  cattle  and  most  of  their  boats  remained undamaged; and the dragon was dead. What that meant they had not yet  realized.  They  gathered  in  mournful  crowds  upon  the  western  shores,  shivering  in  the  cold wind,  and  their  first  complaints  and  anger were  against  the Master, who had  left the town so soon, while some were still willing to defend it.  \"He  may  have  a  good  head  for  business-especially  his  own  business,\"  some  murmured, \"but he  is no good when anything serious happens!\" And  they praised  the courage of Bard and his last mighty shot. \"If only he had not been killed,\" they  all  said,  \"we  would  make  him  a  king.  Bard  the  Dragon-shooter  of  the  line  of  Girion! Alas that he is lost!\"  And  in  the very midst of  their  talk, a  tall figure stepped from  the shadows. He  was drenched with water, his black hair hung wet over his face and shoulders, and  a fierce light was in his eyes.  \"Bard  is  not  lost!\"  he  cried.  \"He  dived  from  Esgaroth,  when  the  enemy  was  slain. I am Bard, of the line of Girion; I am the slayer of the dragon!\"  \"King  Bard!  King  Bard!\"  they  shouted;  but  the Master  ground  his  chattering  teeth.  \"Girion was lord of Dale, not king of Esgaroth,\" he said. \"In the Lake-town we  have  always  elected masters  from  among  the old  and wise,  and have not  endured  the rule of mere fighting men. Let 'King Bard' go back to his own kingdom-Dale is  now freed by his valour, and nothing binders his return. And any that wish can go  with  him,  if  they  prefer  the  cold  shores  under  the  shadow  of  the Mountain  to  the  green shores of the lake. The wise will stay here and hope to rebuild our town, and  enjoy again in time its peace and riches.\"  \"We will have King Bard!\" the people near at hand shouted in reply. \"We have  had  enough  of  the  old men  and  the money-counters!\" And people further off took   ####-up the cry: \"Up the Bowman, and down with Moneybags,\" till the clamour echoed  along the shore.  \"I  am  the  last man  to  undervalue  Bard  the  Bowman,\"  said  the Master warily  (for Bard now stood close beside him). \"He has tonight earned an eminent place in  the  roll  of  the  benefactors  of  our  town;  and  he  is  worthy  of  many  imperishable  songs.  But,  why  O  People?\"-and  here  the Master  rose  to  his  feet  and  spoke  very  loud and clear – \"why do I get all your blame? For what fault am I to be deposed?  Who  aroused  the  dragon  from  his  slumber,  I might  ask? Who obtained of us rich  gifts  and  ample  help,  and  led  us  to  believe  that  old  songs  could  come  true? Who  played  on  our  soft  hearts  and  our  pleasant  fancies? What  sort  of  gold  have  they  sent  down  the  river  to  reward  us?  Dragon-fire  and  ruin!  From  whom  should we  claim the recompense of our damage, and aid for our widows and orphans?\"  As  you  see,  the Master  had  not  got  his  position  for  nothing."
}