{
  "id": "dd92fbb96407343ce7cbbeeb8399844b071fe521",
  "text": "  They  fell  to  talking  of  their  times  together,  of  course,  and  Bilbo  asked  how  things  were  going  in  the  lands  of  the Mountain.  It  seemed  they  were  going  very  well.  Bard  had  rebuilt  the  town  in  Dale  and  men  had  gathered  to  him  from  the  Lake  and  from  South  and  West,  and  all  the  valley  had  become  tilled  again  and  rich, and the desolation was now filled with birds and blossoms in spring and fruit  and  feasting  in  autumn. And Lake-town was refounded and was more prosperous  than  ever,  and much wealth went  up  and down the Running River; and there was  friendship in those parts between elves and dwarves and men.  The old Master had come to a bad end. Bard had given him much gold for the  help  of  the  Lake-people,  but  being  of  the  kind  that  easily  catches  such  disease  he  fell under the dragon-sickness, and took most of the gold and fled with it, and died  of starvation in the Waste, deserted by his companions.  \"The  new  Master  is  of  wiser  kind,\"  said  Balin,  \"and  very  popular,  for,  of  course,  he  gets  most  of  the  credit  for  the  present  prosperity.  They  are  making  songs which say that in his day the rivers run with gold.\"  \"Then  the  prophecies  of  the  old  songs  have  turned  out  to  be  true,  after  a  fashion!\" said Bilbo.   ####-\"Of  course!\"  said Gandalf.  \"And why  should  not  they  prove  true? Surely you  don't  disbelieve  the  prophecies,  because  you  had  a  hand  in  bringing  them  about  yourself? You  don't  really  suppose,  do  you,  that  all  your  adventures  and  escapes  were  managed  by  mere  luck,  just  for  your  sole  benefit?  You  are  a  very  fine  person,  Mr.  Baggins,  and  I  am  very  fond  of  you;  but  you  are  only  quite  a  little  fellow in a wide world after all!\"  \"Thank goodness!\" said Bilbo laughing, and handed him the tobacco-jar.      ####-####-     Complete Table of Contents      Foreword          Prologue    Concerning Hobbits        1.   Concerning Pipe-weed        2.   Of the Ordering of the Shire        3.   Of the Finding of the Ring        4.          note on the shire records           ####-Book I        Chapter 1   A Long-expected Party        Chapter 2   The Shadow of the Past        Chapter 3   Three is Company         Chapter 4   A Short Cut to Mushrooms        Chapter 5   A Conspiracy Unmasked         Chapter 6   The Old Forest        Chapter 7   In the House of Tom Bombadil         Chapter 8  Fog on the Barrow-Downs        Chapter 9   At the Sign of The Prancing Pony        Chapter 10  Strider        Chapter 11  A Knife in the Dark         Chapter 12  Flight to the Ford           Book II        Chapter 1   Many Meetings        Chapter 2   The Council of Elrond         Chapter 3   The Ring Goes South         Chapter 4   A Journey in the Dark         Chapter 5   The Bridge of Khazad-dym        Chapter 6   Lothlurien        Chapter 7   The Mirror of Galadriel         Chapter 8   Farewell to Lurien         Chapter 9   The Great River        Chapter 10  The Breaking of the Fellowship           ####-Book III        Chapter 1   The Departure of Boromir        Chapter 2   The Riders of Rohan         Chapter 3   The Uruk-Hai        Chapter 4   Treebeard        Chapter 5   The White Rider        Chapter 6   The King of the Golden Hall         Chapter 7   Helm's Deep        Chapter 8   The Road to Isengard         Chapter 9   Flotsam and Jetsam         Chapter 10  The Voice of Saruman         Chapter 11  The Palantnr          Book IV         Chapter 1   The Taming of Smjagol         Chapter 2   The Passage of the Marshes        Chapter 3   The Black Gate is Closed         Chapter 4   Of Herbs and Stewed Rabbit        Chapter 5   The Window on the West        Chapter 6   The Forbidden Pool         Chapter 7   Journey to the Cross-roads        Chapter 8   The Stairs of Cirith Ungol         Chapter 9   Shelob's Lair        Chapter 10  The Choices of Master Samwise            ####-Book V         Chapter 1   Minas Tirith        Chapter 2   The Passing of the Grey Company         Chapter 3   The Muster of Rohan        Chapter 4   The Siege of Gondor        Chapter 5   The Ride of the Rohirrim         Chapter 6   The Battle of the Pelennor Fields        Chapter 7   The Pyre of Denethor        Chapter 8   The Houses of Healing         Chapter 9   The Last Debate         Chapter 10  The Black Gate Opens          Book VI         Chapter 1   The Tower of Cirith Ungo       Chapter 2   The Land of Shadow         Chapter 3   Mount Doom         Chapter 4   The Field of Cormallen         Chapter 5   The Steward and the King         Chapter 6   Many Partings        Chapter 7   Homeward Bound        Chapter 8   The Scouring of the Shire         Chapter 9   The Grey Havens    ####-Foreword            This  tale grew in the telling, until it became  a history of the Great  War of the  Ring and included  many glimpses of the yet more ancient history  that preceded it. It was begun soon after The  Hobbit was written and before  its publication in 1937; but I did not go  on with this sequel, for I wished  first  to complete and set in  order the mythology and  legends of the Elder   Days, which had then been taking shape for some years."
}