{
  "id": "de027cbfe1397824f834a3da02ed152a3f715419",
  "text": "\"  The giant took a gulp of tea and wiped his mouth with the back of his hand.  \"Call me Hagrid,\" he said, \"everyone does. An' like I told yeh, I'm Keeper of Keys at Hogwarts -- yeh'll know all about Hogwarts, o' course.  \"Er -- no,\" said Harry.  Hagrid looked shocked.  \"Sorry,\" Harry said quickly.  \"Sony?\" barked Hagrid, turning to stare at the Dursleys, who shrank back into the shadows. \"It' s them as should be sorry! I knew yeh weren't gettin' yer letters but I never thought yeh wouldn't even know abou' Hogwarts, fer cryin' out loud! Did yeh never wonder where yet parents learned it all?\"  \"All what?\" asked Harry.  \"ALL WHAT?\" Hagrid thundered. \"Now wait jus' one second!\"  He had leapt to his feet. In his anger he seemed to fill the whole hut. The Dursleys were cowering against the wall.  \"Do you mean ter tell me,\" he growled at the Dursleys, \"that this boy -- this boy! -- knows nothin' abou' -- about ANYTHING?\"  Harry thought this was going a bit far. He had been to school, after all, and his marks weren't bad.  \"I know some things,\" he said. \"I can, you know, do math and stuff.\" But Hagrid simply waved his hand and said, \"About our world, I mean. Your world. My world. Yer parents' world.\"  \"What world?\"  Hagrid looked as if he was about to explode.  \"DURSLEY!\" he boomed.  Uncle Vernon, who had gone very pale, whispered something that sounded like \"Mimblewimble.\" Hagrid stared wildly at Harry.  \"But yeh must know about yet mom and dad,\" he said. \"I mean, they're famous. You're famous.\"  \"What? My -- my mom and dad weren't famous, were they?\"  \"Yeh don' know... yeh don' know...\" Hagrid ran his fingers through his hair, fixing Harry with a bewildered stare.  \"Yeh don' know what yeh are?\" he said finally.  Uncle Vernon suddenly found his voice.  \"Stop!\" he commanded. \"Stop right there, sit! I forbid you to tell the boy anything!\"  A braver man than Vernon Dursley would have quailed under the furious look Hagrid now gave him; when Hagrid spoke, his every syllable trembled with rage.  \"You never told him? Never told him what was in the letter Dumbledore left fer him? I was there! I saw Dumbledore leave it, Dursley! An' you've kept it from him all these years?\"  \"Kept what from me?\" said Harry eagerly.  \"STOP! I FORBID YOU!\" yelled Uncle Vernon in panic.  Aunt Petunia gave a gasp of horror.  \"Ah, go boil yet heads, both of yeh,\" said Hagrid. \"Harry -- yet a wizard.\"  There was silence inside the hut. Only the sea and the whistling wind could be heard.  \"-- a what?\" gasped Harry.  \"A wizard, o' course,\" said Hagrid, sitting back down on the sofa, which groaned and sank even lower, \"an' a thumpin' good'un, I'd say, once yeh've been trained up a bit. With a mum an' dad like yours, what else would yeh be? An' I reckon it's abou' time yeh read yer letter.\"  Harry stretched out his hand at last to take the yellowish envelope, addressed in emerald green to Mr. H. Potter, The Floor, Hut-on-the-Rock, The Sea. He pulled out the letter and read:  HOGWARTS SCHOOL of WITCHCRAFT and WIZARDRY  Headmaster: ALBUS DUMBLEDORE  (Order of Merlin, First Class, Grand Sorc., Chf. Warlock, Supreme Mugwump, International Confed. of Wizards)  Dear Mr. Potter,  We are pleased to inform you that you have been accepted at Hogwarts School of Witchcraft and Wizardry. Please find enclosed a list of all necessary books and equipment.  Term begins on September 1. We await your owl by no later than July 31. Yours sincerely,  Minerva McGonagall,  Deputy Headmistress  Questions exploded inside Harry's head like fireworks and he couldn't decide which to ask first. After a few minutes he stammered, \"What does it mean, they await my owl?\"  \"Gallopin' Gorgons, that reminds me,\" said Hagrid, clapping a hand to his forehead with enough force to knock over a cart horse, and from yet another pocket inside his overcoat he pulled an owl -- a real, live, rather ruffled-looking owl -- a long quill, and a roll of parchment. With his tongue between his teeth he scribbled a note that Harry could read upside down:  Dear Professor Dumbledore,  Given Harry his letter.  Taking him to buy his things tomorrow.  Weather's horrible. Hope you're Well.  Hagrid  Hagrid rolled up the note, gave it to the owl, which clamped it in its beak, went to the door, and threw the owl out into the storm. Then he came back and sat down as though this was as normal as talking on the telephone.  Harry realized his mouth was open and closed it quickly.  \"Where was I?\" said Hagrid, but at that moment, Uncle Vernon, still ashen-faced but looking very angry, moved into the firelight.  \"He's not going,\" he said.  Hagrid grunted.  \"I'd like ter see a great Muggle like you stop him,\" he said.  \"A what?\" said Harry, interested.  \"A Muggle,\" said Hagrid, \"it's what we call nonmagic folk like thern. An' it's your bad luck you grew up in a family o' the biggest Muggles I ever laid eyes on.\"  \"We swore when we took him in we'd put a stop to that rubbish,\" said Uncle Vernon, \"swore we'd stamp it out of him! Wizard indeed!\"  \"You knew?\" said Harry."
}