{
  "id": "df8a61034cb4069f8e25e6743d639d51ef65f8e7",
  "text": " Donal Noye held him down, while Clydas helped guide the maester’s hand. Jon did not move, except to pound his fist against the table, again and again and again. The pain was so huge he felt small and weak and helpless inside it, a child whimpering in the dark. Ygritte, he thought, when the stench of burning flesh was in his nose and his own shriek echoing in her ears. Ygritte, I had to. For half a heartbeat the agony started to ebb. But then the iron touched him once again, and he fainted.  When his eyelids fluttered open, he was wrapped in thick wool and floating. He could not seem to move, but that did not matter. For a time he dreamed that Ygritte was with him, tending him with gentle hands. Finally he closed his eyes and slept.  The next waking was not so gentle. The room was dark, but under the blankets the pain was back, a throbbing in his leg that turned into a hot knife at the least motion. Jon learned that the hard way when he tried to see if he still had a leg. Gasping, he swallowed a scream and made another fist.   Jon?  A candle appeared, and a well-remembered face was looking down on him, big ears and all.  You shouldn’t move.    Pyp?  Jon reached up, and the other boy clasped his hand and gave it a squeeze.  I thought you’d gone…    …with the Old Pomegranate? No, he thinks I’m too small and green. Grenn’s here too.    I’m here too.  Grenn stepped to the other side of the bed.  I fell asleep.   Jon’s throat was dry.  Water,  he gasped. Grenn brought it, and held it to his lips.  I saw the Fist,  he said, after a long swallow.  The blood, and the dead horses… Noye said a dozen made it back… who?    Dywen did. Giant, Dolorous Edd, Sweet Donnel Hill, Ulmer, Left Hand Lew, Garth Greyfeather. Four or five more. Me.    Sam?   Grenn looked away.  He killed one of the Others, Jon. I saw it. He stabbed him with that dragonglass knife you made him, and we started calling him Sam the Slayer. He hated that.   Sam the Slayer. Jon could hardly imagine a less likely warrior than Sam Tarly.  What happened to him?    We left him.  Grenn sounded miserable.  I shook him and screamed at him, even slapped his face. Giant tried to drag him to his feet, but he was too heavy. Remember in training how he’d curl up on the ground and lie there whimpering? At Craster’s he wouldn’t even whimper. Dirk and Ollo were tearing up the walls looking for food, Garth and Garth were fighting, some of the others were raping Craster’s wives. Dolorous Edd figured Dirk’s bunch would kill all the loyal men to keep us from telling what they’d done, and they had us two to one. We left Sam with the Old Bear. He wouldn’t move, Jon.   You were his brother, he almost said. How could you leave him amongst wildlings and murderers?   He might still be alive,  said Pyp.  He might surprise us all and come riding up tomorrow.    With Mance Rayder’s head, aye.  Grenn was trying to sound cheerful, Jon could tell.  Sam the Slayer!   Jon tried to sit again. It was as much a mistake as the first time. He cried out, cursing.   Grenn, go wake Maester Aemon,  said Pyp.  Tell him Jon needs more milk of the poppy.   Yes, Jon thought.  No,  he said.  The Magnar…    We know,  said Pyp.  The sentries on the Wall have been told to keep one eye on the south, and Donal Noye dispatched some men to Weatherback Ridge to watch the kingsroad. Maester Aemon’s sent birds to Eastwatch and the Shadow Tower too.   Maester Aemon shuffled to the bedside, one hand on Grenn’s shoulder.  Jon, be gentle with yourself. It is good that you have woken, but you must give yourself time to heal. We drowned the wound with boiling wine, and closed you up with a poultice of nettle, mustard seed and moldy bread, but unless you rest…    I can’t.  Jon fought through the pain to sit.  Mance will be here soon… thousands of men, giants, mammoths… has word been sent to Winterfell? To the king?  Sweat dripped off his brow. He closed his eyes a moment.  Grenn gave Pyp a strange look.  He doesn’t know.    Jon,  said Maester Aemon,  much and more happened while you were away, and little of it good. Balon Greyjoy has crowned himself again and sent his longships against the north. Kings sprout like weeds at every hand and we have sent appeals to all of them, yet none will come. They have more pressing uses for their swords, and we are far off and forgotten. And Winterfell… Jon, be strong… Winterfell is no more…    No more?  Jon stared at Aemon’s white eyes and wrinkled face.  My brothers are at Winterfell. Bran and Rickon…   The maester touched his brow.  I am so very sorry, Jon. Your brothers died at the command of Theon Greyjoy, after he took Winterfell in his father’s name. When your father’s bannermen threatened to retake it, he put the castle to the torch.    Your brothers were avenged,  Grenn said.  Bolton’s son killed all the ironmen, and it’s said he’s flaying Theon Greyjoy inch by inch for what he did.    I’m sorry, Jon.  Pyp squeezed his shoulder.  We are all.   Jon had never liked Theon Greyjoy, but he had been their father’s ward."
}