{
  "id": "e06933a8b14d4e5c019116e37b04da56e7c7e950",
  "text": "  Her supper was a simple meal of fruit and cheese and fry bread, with a jug of honeyed wine to wash it down.  Doreah, stay and eat with me,  Dany commanded when she sent her other handmaids away. The Lysene girl had hair the color of honey, and eyes like the summer sky.  She lowered those eyes when they were alone.  You honor me, Khaleesi,  she said, but it was no honor, only service. Long after the moon had risen, they sat together, talking.  That night, when Khal Drogo came, Dany was waiting for him. He stood in the door of her tent and looked at her with surprise. She rose slowly and opened her sleeping silks and let them fall to the ground.  This night we must go outside, my lord,  she told him, for the Dothraki believed that all things of importance in a man’s life must be done beneath the open sky.  Khal Drogo followed her out into the moonlight, the bells in his hair tinkling softly. A few yards from her tent was a bed of soft grass, and it was there that Dany drew him down. When he tried to turn her over, she put a hand on his chest.  No,  she said.  This night I would look on your face.   There is no privacy in the heart of the khalasar. Dany felt the eyes on her as she undressed him, heard the soft voices as she did the things that Doreah had told her to do. It was nothing to her. Was she not khaleesi? His were the only eyes that mattered, and when she mounted him she saw something there that she had never seen before. She rode him as fiercely as ever she had ridden her silver, and when the moment of his pleasure came, Khal Drogo called out her name.  They were on the far side of the Dothraki sea when Jhiqui brushed the soft swell of Dany’s stomach with her fingers and said,  Khaleesi, you are with child.    I know,  Dany told her.  It was her fourteenth name day.      BRAN  In the yard below, Rickon ran with the wolves.  Bran watched from his window seat. Wherever the boy went, Grey Wind was there first, loping ahead to cut him off, until Rickon saw him, screamed in delight, and went pelting off in another direction. Shaggydog ran at his heels, spinning and snapping if the other wolves came too close. His fur had darkened until he was all black, and his eyes were green fire. Bran’s Summer came last. He was silver and smoke, with eyes of yellow gold that saw all there was to see. Smaller than Grey Wind, and more wary. Bran thought he was the smartest of the litter. He could hear his brother’s breathless laughter as Rickon dashed across the hard-packed earth on little baby legs.  His eyes stung. He wanted to be down there, laughing and running. Angry at the thought, Bran knuckled away the tears before they could fall. His eighth name day had come and gone. He was almost a man grown now, too old to cry.   It was just a lie,  he said bitterly, remembering the crow from his dream.  I can’t fly. I can’t even run.    Crows are all liars,  Old Nan agreed, from the chair where she sat doing her needlework.  I know a story about a crow.    I don’t want any more stories,  Bran snapped, his voice petulant. He had liked Old Nan and her stories once. Before. But it was different now. They left her with him all day now, to watch over him and clean him and keep him from being lonely, but she just made it worse.  I hate your stupid stories.   The old woman smiled at him toothlessly.  My stories? No, my little lord, not mine. The stories are, before me and after me, before you too.   She was a very ugly old woman, Bran thought spitefully; shrunken and wrinkled, almost blind, too weak to climb stairs, with only a few wisps of white hair left to cover a mottled pink scalp. No one really knew how old she was, but his father said she’d been called Old Nan even when he was a boy. She was the oldest person in Winterfell for certain, maybe the oldest person in the Seven Kingdoms. Nan had come to the castle as a wet nurse for a Brandon Stark whose mother had died birthing him. He had been an older brother of Lord Rickard, Bran’s grandfather, or perhaps a younger brother, or a brother to Lord Rickard’s father. Sometimes Old Nan told it one way and sometimes another. In all the stories the little boy died at three of a summer chill, but Old Nan stayed on at Winterfell with her own children. She had lost both her sons to the war when King Robert won the throne, and her grandson was killed on the walls of Pyke during Balon Greyjoy’s rebellion. Her daughters had long ago married and moved away and died. All that was left of her own blood was Hodor, the simpleminded giant who worked in the stables, but Old Nan just lived on and on, doing her needlework and telling her stories.   I don’t care whose stories they are,  Bran told her,  I hate them.  He didn’t want stories and he didn’t want Old Nan. He wanted his mother and father. He wanted to go running with Summer loping beside him. He wanted to climb the broken tower and feed corn to the crows. He wanted to ride his pony again with his brothers. He wanted it to be the way it had been before."
}