{
  "id": "e0db3e9fee9bd86b1143c9091f904d287f1ae08e",
  "text": "  Arya did as he told her. She did not have to pretend to be frightened. Behind her, the men went back to their dice.  She could not have said how she got back to Flea Bottom, but she was breathing hard by the time she reached the narrow crooked unpaved streets between the hills. The Bottom had a stench to it, a stink of pigsties and stables and tanner’s sheds, mixed in with the sour smell of winesinks and cheap whorehouses. Arya wound her way through the maze dully. It was not until she caught a whiff of bubbling brown coming through a pot-shop door that she realized her pigeon was gone. It must have slipped from her belt as she ran, or someone had stolen it and she’d never noticed. For a moment she wanted to cry again. She’d have to walk all the way back to the Street of Flour to find another one that plump.  Far across the city, bells began to ring.  Arya glanced up, listening, wondering what the ringing meant this time.   What’s this now?  a fat man called from the pot-shop.   The bells again, gods ha’mercy,  wailed an old woman.  A red-haired whore in a wisp of painted silk pushed open a second-story window.  Is it the boy king that’s died now?  she shouted down, leaning out over the street.  Ah, that’s a boy for you, they never last long.  As she laughed, a naked man slid his arms around her from behind, biting her neck and rubbing the heavy white breasts that hung loose beneath her shift.   Stupid slut,  the fat man shouted up.  The king’s not dead, that’s only summoning bells. One tower tolling. When the king dies, they ring every bell in the city.    Here, quit your biting, or I’ll ring your bells,  the woman in the window said to the man behind her, pushing him off with an elbow.  So who is it died, if not the king?    It’s a summoning,  the fat man repeated.  Two boys close to Arya’s age scampered past, splashing through a puddle. The old woman cursed them, but they kept right on going. Other people were moving too, heading up the hill to see what the noise was about. Arya ran after the slower boy.  Where you going?  she shouted when she was right behind him.  What’s happening?   He glanced back without slowing.  The gold cloaks is carryin’ him to the sept.    Who?  she yelled, running hard.   The Hand! They’ll be taking his head off, Buu says.   A passing wagon had left a deep rut in the street. The boy leapt over, but Arya never saw it. She tripped and fell, face first, scraping her knee open on a stone and smashing her fingers when her hands hit the hard-packed earth. Needle tangled between her legs. She sobbed as she struggled to her knees. The thumb of her left hand was covered with blood. When she sucked on it, she saw that half the thumbnail was gone, ripped off in her fall. Her hands throbbed, and her knee was all bloody too.   Make way!  someone shouted from the cross street.  Make way for my lords of Redwyne!  It was all Arya could do to get out of the road before they ran her down, four guardsmen on huge horses, pounding past at a gallop. They wore checked cloaks, blue-and-burgundy. Behind them, two young lordlings rode side by side on a pair of chestnut mares alike as peas in a pod. Arya had seen them in the bailey a hundred times; the Redwyne twins, Ser Horas and Ser Hobber, homely youths with orange hair and square, freckled faces. Sansa and Jeyne Poole used to call them Ser Horror and Ser Slobber, and giggle whenever they caught sight of them. They did not look funny now.  Everyone was moving in the same direction, all in a hurry to see what the ringing was all about. The bells seemed louder now, clanging, calling. Arya joined the stream of people. Her thumb hurt so bad where the nail had broken that it was all she could do not to cry. She bit her lip as she limped along, listening to the excited voices around her.   —the King’s Hand, Lord Stark. They’re carrying him up to Baelor’s Sept.    I heard he was dead.    Soon enough, soon enough. Here, I got me a silver stag says they lop his head off.    Past time, the traitor.  The man spat.  Arya struggled to find a voice.  He never—  she started, but she was only a child and they talked right over her.   Fool! They ain’t neither going to lop him. Since when do they knick traitors on the steps of the Great Sept?    Well, they don’t mean to anoint him no knight. I heard it was Stark killed old King Robert. Slit his throat in the woods, and when they found him, he stood there cool as you please and said it was some old boar did for His Grace.    Ah, that’s not true, it was his own brother did him, that Renly, him with his gold antlers.    You shut your lying mouth, woman. You don’t know what you’re saying, his lordship’s a fine true man.   By the time they reached the Street of the Sisters, they were packed in shoulder to shoulder. Arya let the human current carry her along, up to the top of Visenya’s Hill. The white marble plaza was a solid mass of people, all yammering excitedly at each other and straining to get closer to the Great Sept of Baelor."
}