{
  "id": "e1672fd2a6a4ccdb0a7dc8aab5a3d02b1580869e",
  "text": " \"I've just been reading the letter you sent me.  \"Oh,\" said Riddle. He sat down, gripping his hands together very tightly.  \"My dear boy,\" said Dipper kindly, \"I cannot possibly let you stay at school over the summer. Surely you want to go home for the holidays?\"  \"No,\" said Riddle at once. \"Id much rather stay at Hogwarts than go back to that - to that -\"  * 243*  \"You live in a Muggle orphanage during the holidays, I believe?\" said Dippet curiously.  \"Yes, sir,\" said Riddle, reddening slightly.  \"You are Muggle-born?\"  \"Half-blood, sir,\" said Riddle. \"Muggle father, witch mother.\"  \"And are both your parents -?\"  \"My mother died just after I was born, sir. They told me at the orphanage she lived just long enough to name me - Tom after my father, Marvolo after my grandfather.\"  Dipper clucked his tongue sympathetically.  \"The thing is, Tom,\" he sighed, \"Special arrangements might have been made for you, but in the current circumstances . . . .\"  \"You mean all these attacks, sir?\" said Riddle, and Harry's heart leapt, and he moved closer, scared of missing anything.  \"Precisely,\" said the headmaster. \"My dear boy, you must see how foolish it would be of me to allow you to remain at the castle when term ends. Particularly in light of the recent tragedy ... the death of that poor little girl .... You will be safer by far at your orphanage. As a matter of fact, the Ministry of Magic is even now talking about closing the school. We are no nearer locating the er - source of all this unpleasantness . . . .\"  Riddle's eyes had widened.  \"Sir - if the person was caught - if it all stopped -\"  \"What do you mean?\" said Dippet with a squeak in his voice, sitting up in his chair. \"Riddle, do you mean you know something about these attacks?\"  \"No, sir,\" said Riddle quickly.  But Harry was sure it was the same sort of \"no\" that he himself had given Dumbledore.  *244*  Dippet sank back, looking faintly disappointed.  \"You may go, Tom ......  Riddle slid off his chair and slouched out of the room. Harry followed him.  Down the moving spiral staircase they went, emerging next to the gargoyle in the darkening corridor. Riddle stopped, and so did Harry, watching him. Harry could tell that Riddle was doing some serious thinking. He was biting his lip, his forehead furrowed.  Then, as though he had suddenly reached a decision, he hurried off, Harry gliding noiselessly behind him. They didn't see another person until they reached the entrance hall, when a tall wizard with long, sweeping auburn hair and a beard called to Riddle from the marble staircase.  \"What are you doing, wandering around this late, Tom?\"  Harry gaped at the wizard. He was none other than a fifty-year- younger Dumbledore.  \"I had to see the headmaster, sir,\" said Riddle.  \"Well, hurry off to bed,\" said Dumbledore, giving Riddle exactly the kind of penetrating stare Harry knew so well. \"Best not to roam the corridors these days. Not since . . .\"  He sighed heavily, bade Riddle good night, and strode off. Riddle watched him walk out of sight and then, moving quickly, headed straight down the stone steps to the dungeons, with Harry in hot pursuit.  But to Harry's disappointment, Riddle led him not into a hidden passageway or a secret tunnel but to the very dungeon in which Harry had Potions with Snape. The torches hadn't been lit, and when Riddle pushed the door almost closed, Harry could only just  *2 45 *  see him, standing stock-still by the door, watching the passage outside.  It felt to Harry that they were there for at least an hour. All he could see was the figure of Riddle at the door, staring through the crack, waiting like a statue. And just when Harry had stopped feeling expectant and tense and started wishing he could return to the present, he heard something move beyond the door.  Someone was creeping along the passage. He heard whoever it was pass the dungeon where he and Riddle were hidden. Riddle, quiet as a shadow, edged through the door and followed, Harry tiptoeing behind him, forgetting that he couldn't be heard.  For perhaps five minutes they followed the footsteps, until Riddle stopped suddenly, his head inclined in the direction of new noises. Harry heard a door creak open, and then someone speaking in a hoarse whisper.  \"C'mon ... gotta get yeh outta here .... C'mon now ... in the box. . .\"  There was something familiar about that voice ....  Riddle suddenly jumped around the corner. Harry stepped out behind him. He could see the dark outline of a huge boy who was crouching in front of an open door, a very large box next to it.  \"Evening, Rubeus,\" said Riddle sharply.  The boy slammed the door shut and stood up.  \"What yer doin' down here, Tom?\"  Riddle stepped closer.  \"It's all over,\" he said. \"I'm going to have to turn you in, Rubeus. They're talking about closing Hogwarts if the attacks don't stop.\"  4 6  \"N\" at d'yeh -\"  \"I don't think you meant to kill anyone. But monsters don't make good pets. I suppose you just let it out for exercise and -\"  \"It never killed no one!\" said the large boy, backing against the closed door."
}