{
  "id": "e17f2897792d3e58bc690c1cfb588aa3edb6095b",
  "text": "    I hope he doesn’t kill anyone important.  The clansmen Tyrion had brought down from their fastnesses in the Mountains of the Moon were loyal in their own fierce way, but they were proud and quarrelsome as well, prone to answer insults real or imagined with steel.  Try to find him. And while you are at it, see that the rest have been quartered and fed. I want them in the barracks beneath the Tower of the Hand, but don’t let the steward put the Stone Crows near the Moon Brothers, and tell him the Burned Men must have a hall all to themselves.    Where will you be?    I’m riding back to the Broken Anvil.   Bronn grinned insolently.  Need an escort? The talk is, the streets are dangerous.    I’ll call upon the captain of my sister’s household guard, and remind him that I am no less a Lannister than she is. He needs to recall that his oath is to Casterly Rock, not to Cersei or Joffrey.   An hour later, Tyrion rode from the Red Keep accompanied by a dozen Lannister guardsmen in crimson cloaks and lion-crested halfhelms. As they passed beneath the portcullis, he noted the heads mounted atop the walls. Black with rot and old tar, they had long since become unrecognizable.  Captain Vylarr,  he called,  I want those taken down on the morrow. Give them to the silent sisters for cleaning.  It would be hell to match them with the bodies, he supposed, yet it must be done. Even in the midst of war certain decencies needed to be observed.  Vylarr grew hesitant.  His Grace has told us he wishes the traitors’ heads to remain on the walls until he fills those last three empty spikes there on the end.    Let me hazard a wild stab. One is for Robb Stark, the others for Lords Stannis and Renly. Would that be right?    Yes, my lord.    My nephew is thirteen years old today, Vylarr. Try and recall that. I’ll have the heads down on the morrow, or one of those empty spikes may have a different lodger. Do you take my meaning, Captain?    I’ll see that they’re taken down myself, my lord.    Good.  Tyrion put his heels into his horse and trotted away, leaving the red cloaks to follow as best they could.  He had told Cersei he intended to take the measure of the city. That was not entirely a lie. Tyrion Lannister was not pleased by much of what he saw. The streets of King’s Landing had always been teeming and raucous and noisy, but now they reeked of danger in a way that he did not recall from past visits. A naked corpse sprawled in the gutter near the Street of Looms, being torn at by a pack of feral dogs, yet no one seemed to care. Watchmen were much in evidence, moving in pairs through the alleys in their gold cloaks and shirts of black ringmail, iron cudgels never far from their hands. The markets were crowded with ragged men selling their household goods for any price they could get… and conspicuously empty of farmers selling food. What little produce he did see was three times as costly as it had been a year ago. One peddler was hawking rats roasted on a skewer.  Fresh rats,  he cried loudly,  fresh rats.  Doubtless fresh rats were to be preferred to old stale rotten rats. The frightening thing was, the rats looked more appetizing than most of what the butchers were selling. On the Street of Flour, Tyrion saw guards at every other shop door. When times grew lean, even bakers found sellswords cheaper than bread, he reflected.   There is no food coming in, is there?  he said to Vylarr.   Little enough,  the captain admitted.  With the war in the riverlands and Lord Renly raising rebels in Highgarden, the roads are closed to south and west.    And what has my good sister done about this?    She is taking steps to restore the king’s peace,  Vylarr assured him.  Lord Slynt has tripled the size of the City Watch, and the queen has put a thousand craftsmen to work on our defenses. The stonemasons are strengthening the walls, carpenters are building scorpions and catapults by the hundred, fletchers are making arrows, the smiths are forging blades, and the Alchemists’ Guild has pledged ten thousand jars of wildfire.   Tyrion shifted uncomfortably in his saddle. He was pleased that Cersei had not been idle, but wildfire was treacherous stuff, and ten thousand jars were enough to turn all of King’s Landing into cinders.  Where has my sister found the coin to pay for all of this?  It was no secret that King Robert had left the crown vastly in debt, and alchemists were seldom mistaken for altruists.   Lord Littlefinger always finds a way, my lord. He has imposed a tax on those wishing to enter the city.    Yes, that would work,  Tyrion said, thinking, Clever. Clever and cruel. Tens of thousands had fled the fighting for the supposed safety of King’s Landing. He had seen them on the kingsroad, troupes of mothers and children and anxious fathers who had gazed on his horses and wagons with covetous eyes. Once they reached the city they would doubtless pay over all they had to put those high comforting walls between them and the war… though they might think twice if they knew about the wildfire."
}