{
  "id": "e1ec02612509f2f635749000f0bae35ca0bbe312",
  "text": " I was warm, though. Some dogs crawled atop me during the night. My cloak was almost dry when one of them pissed in it. Or perhaps it was Brown Bernarr. Have you noticed that the rain stopped the instant I had a roof above me? It will start again now that I’m back out. Gods and dogs alike delight to piss on me.    I’d best go see to Lord Mormont,  said Jon.  The rain might have stopped, but the compound was still a morass of shallow lakes and slippery mud. Black brothers were folding their tents, feeding their horses, and chewing on strips of salt beef. Jarman Buckwell’s scouts were tightening the girths on their saddles before setting out.  Jon,  Buckwell greeted him from horseback.  Keep a good edge on that bastard sword of yours. We’ll be needing it soon enough.   Craster’s hall was dim after daylight. Inside, the night’s torches had burned low, and it was hard to know that the sun had risen. Lord Mormont’s raven was the first to spy him enter. Three lazy flaps of its great black wings, and it perched atop Longclaw’s hilt.  Corn?  It nipped at a strand of Jon’s hair.   Ignore that wretched beggar bird, Jon, it’s just had half my bacon.  The Old Bear sat at Craster’s board, breaking his fast with the other officers on fried bread, bacon, and sheepgut sausage. Craster’s new axe was on the table, its gold inlay gleaming faintly in the torchlight. Its owner was sprawled unconscious in the sleeping loft above, but the women were all up, moving about and serving.  What sort of day do we have?    Cold, but the rain has stopped.    Very good. See that my horse is saddled and ready. I mean for us to ride within the hour. Have you eaten? Craster serves plain fare, but filling.   I will not eat Craster’s food, he decided suddenly.  I broke my fast with the men, my lord.  Jon shooed the raven off Longclaw. The bird hopped back to Mormont’s shoulder, where it promptly shat.  You might have done that on Snow instead of saving it for me,  the Old Bear grumbled. The raven quorked.  He found Sam behind the hall, standing with Gilly at the broken rabbit hutch. She was helping him back into his cloak, but when she saw Jon she stole away. Sam gave him a look of wounded reproach.  I thought you would help her.    And how was I to do that?  Jon said sharply.  Take her with us, wrapped up in your cloak? We were commanded not to—    I know,  said Sam guiltily,  but she was afraid. I know what it is to be afraid. I told her…  He swallowed.   What? That we’d take her with us?   Sam’s fat face blushed a deep red.  On the way home.  He could not meet Jon’s eyes.  She’s going to have a baby.    Sam, have you taken leave of all your sense? We may not even return this way. And if we do, do you think the Old Bear is going to let you pack off one of Craster’s wives?    I thought… maybe by then I could think of a way…    I have no time for this, I have horses to groom and saddle.  Jon walked away as confused as he was angry. Sam’s heart was a big as the rest of him, but for all his reading he could be as thick as Grenn at times. It was impossible, and dishonorable besides. So why do I feel so ashamed?  Jon took his accustomed position at Mormont’s side as the Night’s Watch streamed out past the skulls on Craster’s gate. They struck off north and west along a crooked game trail. Melting ice dripped down all about them, a slower sort of rain with its own soft music. North of the compound, the brook was in full spate, choked with leaves and bits of wood, but the scouts had found where the ford lay and the column was able to splash across. The water ran as high as a horse’s belly. Ghost swam, emerging on the bank with his white fur dripping brown. When he shook, spraying mud and water in all directions, Mormont said nothing, but on his shoulder the raven screeched.   My lord,  Jon said quietly as the wood closed in around them once more.  Craster has no sheep. Nor any sons.   Mormont made no answer.   At Winterfell one of the serving women told us stories,  Jon went on.  She used to say that there were wildlings who would lay with the Others to birth half-human children.    Hearth tales. Does Craster seem less than human to you?   In half a hundred ways.  He gives his sons to the wood.   A long silence. Then:  Yes.  And  Yes,  the raven muttered, strutting.  Yes, yes, yes.    You knew?    Smallwood told me. Long ago. All the rangers know, though few will talk of it.    Did my uncle know?    All the rangers,  Mormont repeated.  You think I ought to stop him. Kill him if need be.  The Old Bear sighed.  Were it only that he wished to rid himself of some mouths, I’d gladly send Yoren or Conwys to collect the boys. We could raise them to the black and the Watch would be that much the stronger. But the wildlings serve crueler gods than you or I. These boys are Craster’s offerings. His prayers, if you will.   His wives must offer different prayers, Jon thought.   How is it you came to know this?  the Old Bear asked him.  From one of Craster’s wives?    Yes, my lord,  Jon confessed."
}