{
  "id": "e2a813f43bef6571c2e9d508face010a6c2a7b89",
  "text": " They skulked in an empty chamber off the entrance hall, listening, until they were sure it was deserted. They heard a last pair of people hurrying across the hall and a door slamming. Hermione poked her head around the door.  \"Okay,\" she whispered, \"no one there -- cloak on --\"  Walking very close together so that nobody would see them, they crossed the hall on tiptoe beneath the cloak, then walked down the stone front steps into the grounds. The sun was already sinking behind the Forbidden Forest, gilding the top branches of the trees.  They reached Hagrid's cabin and knocked. He was a minute in answering, and when he did, he looked all around for his visitor, pale-faced and trembling.  \"It's us,\" Harry hissed. \"We're wearing the Invisibility Cloak. Let us in and we can take it off.\"  \"Yeh shouldn've come!\" Hagrid whispered, but he stood back, and they stepped inside. Hagrid shut the door quickly and Harry pulled off the cloak.  Hagrid was not crying, nor did he throw himself upon their necks. He looked like a man who did not know where he was or what to do. This helplessness was worse to watch than tears.  \"Wan' some tea?\" he said. His great hands were shaking as he reached for the kettle.  \"Where's Buckbeak, Hagrid?\" said Hermione hesitantly.  I -- I took him outside,\" said Hagrid, spilling milk all over the table as he filled up the jug. \"He's tethered in me pumpkin patch. Thought he oughta see the trees an' -- an' smell fresh air -- before  Hagrid's hand trembled so violently that the milk jug slipped from his grasp and shattered all over the floor.  \"I'll do it, Hagrid,\" said Hermione quickly, hurrying over and starting to clean up the mess.  \"There's another one in the cupboard,\" Hagrid said, sitting down and wiping his forehead on his sleeve. Harry glanced at Ron, who looked back hopelessly.  \"Isn't there anything anyone can do, Hagrid?\" Harry asked fiercely, sitting down next to him. \"Dumbledore --\"  \"He's tried,\" said Hagrid. \"He's got no power ter overrule the Committee. He told 'em Buckbeak's all right, but they're scared.... Yeh know what Lucius Malfoy's like... threatened 'em, I expect... an' the executioner, Macnair, he's an old pal o' Malfoy's... but it'll be quick an' clean... an' I'll be beside him.... \"  Hagrid swallowed. His eyes were darting all over the cabin as though looking for some shred of hope or comfort.  \"Dumbledore's gonna come down while it -- while it happens. Wrote me this mornin'. Said he wants ter -- ter be with me. Great man, Dumbledore....\"  Hermione, who had been rummaging in Hagrid's cupboard for another milk jug, let out a small, quickly stifled sob. She straightened up with the new jug in her hands, fighting back tears.  \"We'll stay with you too, Hagrid,\" she began, but Hagrid shook his shaggy head.  \"Yeh're ter go back up ter the castle. I told yeh, I don' wan' yeh watchin'. An' yeh shouldn' be down here anyway... If Fudge an' Dumbledore catch yeh out without permission, Harry, yeh'll be in big trouble.\"  Silent tears were now streaming down Hermione's face, but she hid them from Hagrid, bustling around making tea. Then, as she picked up the milk bottle to pour some into the jug, she let out a shriek.  \"Ron, I don't believe it -- it's Scabbers!\"  Ron gaped at her.  \"What are you talking about?\"  Hermione carried the milk jug over to the table and turned it upside down. With a frantic squeak, and much scrambling to get back inside, Scabbers the rat came sliding out onto the table.  \"Scabbers!\" said Ron blankly. \"Scabbers, what are you doing here?\"  He grabbed the struggling rat and held him up to the light. Scabbers looked dreadful. He was thinner than ever, large tufts of hair had fallen out leaving wide bald patches, and he writhed in Ron's hands as though desperate to free himself  \"It's okay, Scabbers!\" said Ron. \"No cats! There's nothing here to hurt you!\"  Hagrid suddenly stood up, his eyes fixed on the window. His normally ruddy face had gone the color of parchment.  \"They're comin'....\"  Harry, Ron, and Hermione whipped around. A group of men was walking down the distant castle steps. In front was Albus Dumbledore, his silver beard gleaming in the dying sun. Next to him trotted Cornelius Fudge. Behind them came the feeble old Committee member and the executioner, Macnair.  \"Yeh gotta go,\" said Hagrid. Every inch of him was trembling. \"They mustn' find yeh here.... Go now...\"  Ron stuffed Scabbers into his pocket and Hermione picked up the cloak. \"I'll let yeh out the back way,\" said Hagrid.  They followed him to the door into his back garden. Harry felt strangely unreal, and even more so when he saw Buckbeak a few yards away, tethered to a tree behind Hagrid's Pumpkin patch. Buckbeak seemed to know something was happening. He turned his sharp head from side to side and pawed the ground nervously.  \"It's okay, Beaky,\" said Hagrid softly. \"It's okay...\" He turned to Harry, Ron, and Hermione. \"Go on,\" he said. \"Get goin'.\"  But they didn't move.  \"Hagrid, we can't --\"  \"We'll tell them what really happened --\"  \"They can't kill him --\"  \"Go!\" said Hagrid fiercely."
}