{
  "id": "e2bd8bfa0926e2a4cb4a04aa861fe2731615d660",
  "text": " \"Four students out of bed in one night! I've never heard of such a thing before! You, Miss Granger, I thought you had more sense. As for you, Mr. Potter, I thought Gryffindor meant more to you than this. All three of you will receive detentions -- yes, you too, Mr. Longbottom, nothing gives you the right to walk around school at night, especially these days, it's very dangerous -- and fifty points will be taken from Gryffindor.\"  \"Fifty?\" Harry gasped -- they would lose the lead, the lead he'd won in the last Quidditch match.  \"Fifty points each,\" said Professor McGonagall, breathing heavily through her long, pointed nose.  \"Professor -- please  \"You can't --\"  \"Don't tell me what I can and can't do, Potter. Now get back to bed, all of you. I've never been more ashamed of Gryffindor students.\"  A hundred and fifty points lost. That put Gryffindor in last place. In one night, they'd ruined any chance Gryffindor had had for the house cup. Harry felt as though the bottom had dropped out of his stomach. How could they ever make up for this?  Harry didn't sleep all night. He could hear Neville sobbing into his pillow for what seemed like hours. Harry couldn't think of anything to say to comfort him. He knew Neville, like himself, was dreading the dawn. What would happen when the rest of Gryffindor found out what they'd done?  At first, Gryffindors passing the giant hourglasses that recorded the house points the next day thought there'd been a mistake. How could they suddenly have a hundred and fifty points fewer than yesterday? And then the story started to spread: Harry Potter, the famous Harry Potter, their hero of two Quidditch matches, had lo st them all those points, him and a couple of other stupid first years.  From being one of the most popular and admired people at the school, Harry was suddenly the most hated. Even Ravenclaws and Hufflepuffs turned on him, because everyone had been longing to see Slytherin lose the house cup. Everywhere Harry went, people pointed and didn't trouble to lower their voices as they insulted him. Slytherins, on the other hand, clapped as he walked past them, whistling and cheering, \"Thanks Potter, we owe you one!\"  Only Ron stood by him.  \"They'll all forget this in a few weeks. Fred and George have lost loads of points in all the time they've been here, and people still like them.\"  \"They've never lost a hundred and fifty points in one go, though, have they?\" said Harry miserably.  \"Well -- no,\" Ron admitted.  It was a bit late to repair the damage, but Harry swore to himself not to meddle in things that weren't his business from now on. He'd had it with sneaking around and spying. He felt so ashamed of himself that he went to Wood and offered to resign from the Quidditch team.  \"Resign?\" Wood thundered. \"What good'll that do? How are we going to get any points back if we can't win at Quidditch?\"  But even Quidditch had lost its fun. The rest of the team wouldn't speak to Harry during practice, and if they had to speak about him, they called him \"the Seeker.\"  Hermione and Neville were suffering, too. They didn't have as bad a time as Harry, because they weren't as well-known, but nobody would speak to them, either. Hermione had stopped drawing attention to herself in class, keeping her head down and working in silence.  Harry was almost glad that the exams weren't far away. All the studying he had to do kept his mind off his misery. He, Ron, and Hermione kept to themselves, working late into the night, trying to remember the ingredients in complicated potions, learn charms and spells by heart, memorize the dates of magical discoveries and goblin rebellions....  Then, about a week before the exams were due to start, Harry's new resolution not to interfere in anything that didn't concern him was put to an unexpected test. Walking back from the library on his own one afternoon, he heard somebody whimpering from a classroom up ahead. As he drew closer, he heard Quirrell's voice.  \"No -- no -- not again, please --\"  It sounded as though someone was threatening him. Harry moved closer.  \"All right -- all right --\" he heard Quirrell sob.  Next second, Quirrell came hurrying out of the classroom straightening his turban. He was pale and looked as though he was about to cry. He strode out of sight; Harry didn't think Quirrell had even noticed him. He waited until Quirrell's footsteps had disappeared, then peered into the classroom. It was empty, but a door stood ajar at the other end. Harry was halfway toward it before he remembered what he'd promised himself about not meddling.  All the same, he'd have gambled twelve Sorcerer's Stones that Snape had just left the room, and from what Harry had just heard, Snape would be walking with a new spring in his step -- Quirrell seemed to have given in at last.  Harry went back to the library, where Hermione was testing Ron on Astronomy. Harry told them what he'd heard.  \"Snape's done it, then!\" said Ron. \"If Quirrell's told him how to break his Anti-Dark Force spell --\"  \"There's still Fluffy, though,\" said Hermione."
}