{
  "id": "e5cccc691965eddfa22ee208caf505b236976059",
  "text": " Craster’s sloping palisades of mud and melting snow would hardly slow the wights, who’d climbed the much steeper slopes of the Fist to swarm over the ringwall. And instead of three hundred brothers drawn up in disciplined ranks to meet them, the wights would find forty-one ragged survivors, nine too badly hurt to fight. Forty-four had come straggling into Craster’s out of the storm, out of the sixty-odd who’d cut their way free of the Fist, but three of those had died of their wounds, and Bannen would soon make four.   Do you think the wights are gone?  Sam asked Grenn.  Why don’t they come finish us?    They only come when it’s cold.    Yes,  said Sam,  but is it the cold that brings the wights, or the wights that bring the cold?    Who cares?  Grenn’s axe sent wood chips flying.  They come together, that’s what matters. Hey, now that we know that dragonglass kills them, maybe they won’t come at all. Maybe they’re frightened of us now!   Sam wished he could believe that, but it seemed to him that when you were dead, fear had no more meaning than pain or love or duty. He wrapped his hands around his legs, sweating under his layers of wool and leather and fur. The dragonglass dagger had melted the pale thing in the woods, true… but Grenn was talking like it would do the same to the wights. We don’t know that, he thought. We don’t know anything, really. I wish Jon was here. He liked Grenn, but he couldn’t talk to him the same way. Jon wouldn’t call me Slayer, I know. And I could talk to him about Gilly’s baby. Jon had ridden off with Qhorin Halfhand, though, and they’d had no word of him since. He had a dragonglass dagger too, but did he think to use it? Is he lying dead and frozen in some ravine… or worse, is he dead and walking?  He could not understand why the gods would want to take Jon Snow and Bannen and leave him, craven and clumsy as he was. He should have died on the Fist, where he’d pissed himself three times and lost his sword besides. And he would have died in the woods if Small Paul had not come along to carry him. I wish it was all a dream. Then I could wake up. How flne that would be, to wake back on the Fist of the First Men with all his brothers still around him, even Jon and Ghost. Or even better, to wake in Castle Black behind the Wall and go to the common room for a bowl of Three-Finger Hobb’s thick cream of wheat, with a big spoon of butter melting in the middle and a dollop of honey besides. Just the thought of it made his empty stomach rumble.   Snow.   Sam glanced up at the sound. Lord Commander Mormont’s raven was circling the fire, beating the air with wide black wings.   Snow,  the bird cawed.  Snow, snow.   Wherever the raven went, Mormont soon followed. The Lord Commander emerged from beneath the trees, mounted on his garron between old Dywen and the fox-faced ranger Ronnel Harclay, who’d been raised to Thoren Smallwood’s place. The spearmen at the gate shouted a challenge, and the Old Bear returned a gruff,  Who in seven hells do you think goes there? Did the Others take your eyes?  He rode between the gateposts, one bearing a ram’s skull and the other the skull of a bear, then reined up, raised a fist, and whistled. The raven came flapping down at his call.   My lord,  Sam heard Ronnel Harclay say,  we have only twenty-two mounts, and I doubt half will reach the Wall.    I know that,  Mormont grumbled.  We must go all the same. Craster’s made that plain.  He glanced to the west, where a bank of dark clouds hid the sun.  The gods gave us a respite, but for how long?  Mormont swung down from the saddle, jolting his raven back into the air. He saw Sam then, and bellowed,  Tarly!    Me?  Sam got awkwardly to his feet.   Me?  The raven landed on the old man’s head.  Me?    Is your name Tarly? Do you have a brother hereabouts? Yes, you. Close your mouth and come with me.    With you?  The words tumbled out in a squeak.  Lord Commander Mormont gave him a withering look.  You are a man of the Night’s Watch. Try not to soil your smallclothes every time I look at you. Come, I said.  His boots made squishing sounds in the mud, and Sam had to hurry to keep up.  I’ve been thinking about this dragonglass of yours.    It’s not mine,  Sam said.   Jon Snow’s dragonglass, then. If dragonglass daggers are what we need, why do we have only two of them? Every man on the Wall should be armed with one the day he says his words.    We never knew…    We never knew! But we must have known once. The Night’s Watch has forgotten its true purpose, Tarly. You don’t build a wall seven hundred feet high to keep savages in skins from stealing women. The Wall was made to guard the realms of men… and not against other men, which is all the wildlings are when you come right down to it. Too many years, Tarly, too many hundreds and thousands of years. We lost sight of the true enemy. And now he’s here, but we don’t know how to fight him. Is dragonglass made by dragons, as the smallfolk like to say?    The m-maesters think not,  Sam stammered."
}