{
  "id": "e6162afb6ca9c8d42fd382f4361e078ab60b93c7",
  "text": "\" The silvery light from the Pensieve illuminated Dumbledore's face, and it struck Harry suddenly how very old he was looking.  He knew, of course, that Dumbledore was getting on in years, but somehow he never really thought of Dumbledore as an old man. \"So, Harry,\" said Dumbledore quietly. \"Before you got lost in my thoughts, you wanted to tell me something.\" \"Yes,\" said Harry. \"Professor - I was in Divination just now, and - er - I fell asleep.\" He hesitated here, wondering if a reprimand was coming, but Dumbledore merely said, \"Quite understandable. Continue.\" \"Well, I had a dream,\" said Harry.  \"A dream about Lord Voldemort.  He was torturing Wormtail . . . you know who Wormtail-\" \"I do know,\" said Dumbledore promptly.  \"Please continue.\" \"Voldemort got a letter from an owl.  He said something like, Wormtail's blunder had been repaired.  He said someone was dead.  Then he said, Wormtail wouldn't be fed to the snake - there was a snake beside his chair.  He said - he said he'd be feeding me to it, instead.  Then he did the Cruciatus Curse on Wormtail - and my scar hurt,\" Harry said.  \"It woke me up, it hurt so badly.\" Dumbledore merely looked at him. \"Er - that's all,\" said Harry. \"I see,\" said Dumbledore quietly. \"I see.  Now, has your scar hurt at any other time this year, excepting the time it woke you up over the summer?\" \"No, I - how did you know it woke me up over the summer?\" said Harry, astonished. \"You are not Sirius's only correspondent,\" said Dumbledore.  \"I have also been in contact with him ever since he left Hogwarts last year.  It was I who suggested the mountainside cave as the safest place for him to stay.\" Dumbledore got up and began walking up and down behind his desk.  Every now and then, he placed his wand tip to his temple, removed another shining silver thought, and added it to the Pensieve.  The thoughts inside began to swirl so fast that Harry couldn't make out anything clearly:  It was merely a blur of color. \"Professor?\"  he said quietly, after a couple of minutes. Dumbledore stopped pacing and looked at Harry. \"My apologies,\" he said quietly.  He sat back down at his desk. \"D'you - d'you know why my scar's hurting me?\" Dumbledore looked very intently at Harry for a moment, and then said, \"I have a theory, no more than that. ... It is my belief that your scar hurts both when Lord Voldemort is near you, and when he is feeling a particularly strong surge of hatred.\" \"But. . . why?\" \"Because you and he are connected by the curse that failed,\" said Dumbledore. \"That is no ordinary scar.\" \"So you think . . . that dream . . . did it really happen?\" \"It is possible,\" said Dumbledore. \"I would say - probable. Harry - did you see Voldemort?\" \"No,\" said Harry.  \"Just the back of his chair.  But - there wouldn't have been anything to see, would there?  I mean, he hasn't got a body, has he?  But. . . but then how could he have held the wand?\"  Harry said slowly. \"How indeed?\" muttered Dumbledore.  \"How indeed . . .\" Neither Dumbledore nor Harry spoke for a while.  Dumbledore was gazing across the room, and, every now and then, placing his wand tip to his temple and adding another shining silver thought to the seething mass within the Pensieve. \"Professor,\" Harry said at last, \"do you think he's getting stronger?\" \"Voldemort?\" said Dumbledore, looking at Harry over the Pensieve.  It was the characteristic, piercing look  Dumbledore had given him on other occasions, and always made Harry feel as though Dumbledore were seeing right through him in a way that even Moody's magical eye could not.  \"Once again. Harry, I can only give you my suspicions.\" Dumbledore sighed again, and he looked older, and wearier, than ever. \"The years of Voldemort's ascent to power,\" he said, \"were marked with disappearances.  Bertha Jorkins has vanished without a trace in the place where Voldemort was certainly known to be last. Mr. Crouch too has disappeared . . . within these very grounds.  And there was a third disappearance, one which the Ministry, I regret to say, do not consider of any importance, for it concerns a Muggle.  His name was Frank Bryce, he lived in the village where Voldemort's father grew up, and he has not been seen since last August.  You see, I read the Muggle newspapers, unlike most of my Ministry friends.\" Dumbledore looked very seriously at Harry. \"These disappearances seem to me to be linked.  The Ministry disagrees - as you may have heard, while waiting outside my office.\" Harry nodded.  Silence fell between them again, Dumbledore extracting thoughts every now and then.  Harry felt as though he ought to go, but his curiosity held him in his chair. \"Professor?\"  he said again. \"Yes, Harry?\"  said Dumbledore. \"Er . . . could I ask you about. . . that court thing I was in ... in the Pensieve?\" \"You could,\" said Dumbledore heavily.  \"I attended it many times, but some trials come back to me more clearly than others ... particularly now. ...\" \"You know - you know the trial you found me in?  The one with Crouch's son?  Well."
}