{
  "id": "e61c5fa47726289d28ef5ce6c19dfcc498f46630",
  "text": "  Off to Gulltown to see the fair maid, heigh-ho, heigh-ho…   Arya rose, carrots dangling from her hand. It sounded like the singer was coming up the river road. Over among the cabbages, Hot Pie had heard it too, to judge by the look on his face. Gendry had gone to sleep in the shade of the burned cottage, and was past hearing anything.   I’ll steal a sweet kiss with the point of my blade, heigh-ho, heigh-ho.  She thought she heard a woodharp too, beneath the soft rush of the river.   Do you hear?  Hot Pie asked in a hoarse whisper, as he hugged an armful of cabbages.  Someone’s coming.    Go wake Gendry,  Arya told him.  Just shake him by the shoulder, don’t make a lot of noise.  Gendry was easy to wake, unlike Hot Pie, who needed to be kicked and shouted at.   I’ll make her my love and we’ll rest in the shade, heigh-ho, heigh-ho.  The song swelled louder with every word.  Hot Pie opened his arms. The cabbages fell to the ground with soft thumps.  We have to hide.   Where? The burned cottage and its overgrown garden stood hard beside the banks of the Trident. There were a few willows growing along the river’s edge and reed beds in the muddy shallows beyond, but most of the ground hereabouts was painfully open. I knew we should never have left the woods, she thought. They’d been so hungry, though, and the garden had been too much a temptation. The bread and cheese they had stolen from Harrenhal had given out six days ago, back in the thick of the woods.  Take Gendry and the horses behind the cottage,  she decided. There was part of one wall still standing, big enough, maybe, to conceal two boys and three horses. If the horses don’t whinny, and that singer doesn’t come poking around the garden.   What about you?    I’ll hide by the tree. He’s probably alone. If he bothers me, I’ll kill him. Go!   Hot Pie went, and Arya dropped her carrots and drew the stolen sword from over her shoulder. She had strapped the sheath across her back; the longsword was made for a man grown, and it bumped against the ground when she wore it on her hip. It’s too heavy besides, she thought, missing Needle the way she did every time she took this clumsy thing in her hand. But it was a sword and she could kill with it, that was enough.  Lightfoot, she moved to the big old willow that grew beside the bend in the road and went to one knee in the grass and mud, within the veil of trailing branches. You old gods, she prayed as the singer’s voice grew louder, you tree gods, hide me, and make him go past. Then a horse whickered, and the song broke off suddenly. He’s heard, she knew, but maybe he’s alone, or if he’s not, maybe they’ll be as scared of us as we are of them.   Did you hear that?  a man’s voice said.  There’s something behind that wall, I would say.    Aye,  replied a second voice, deeper.  What do you think it might be, Archer?   Two, then. Arya bit her lip. She could not see them from where she knelt, on account of the willow. But she could hear.   A bear.  A third voice, or the first one again?   A lot of meat on a bear,  the deep voice said.  A lot of fat as well, in fall. Good to eat, if it’s cooked up right.    Could be a wolf. Maybe a lion.    With four feet, you think? Or two?    Makes no matter. Does it?    Not so I know. Archer, what do you mean to do with all them arrows?    Drop a few shafts over the wall. Whatever’s hiding back there will come out quick enough, watch and see.    What if it’s some honest man back there, though? Or some poor woman with a little babe at her breast?    An honest man would come out and show us his face. Only an outlaw would skulk and hide.    Aye, that’s so. Go on and loose your shafts, then.   Arya sprang to her feet.  Don’t!  She showed them her sword. There were three, she saw. Only three. Syrio could fight more than three, and she had Hot Pie and Gendry to stand with her, maybe. But they’re boys, and these are men.  They were men afoot, travel-stained and mud-specked. She knew the singer by the woodharp he cradled against his jerkin, as a mother might cradle a babe. A small man, fifty from the look of him, he had a big mouth, a sharp nose, and thinning brown hair. His faded greens were mended here and there with old leather patches, and he wore a brace of throwing knives on his hip and a woodman’s axe slung across his back.  The man beside him stood a good foot taller, and had the look of a soldier. A longsword and dirk hung from his studded leather belt, rows of overlapping steel rings were sewn onto his shirt, and his head was covered by a black iron halfhelm shaped like a cone. He had bad teeth and a bushy brown beard, but it was his hooded yellow cloak that drew the eye. Thick and heavy, stained here with grass and there with blood, frayed along the bottom and patched with deerskin on the right shoulder, the greatcloak gave the big man the look of some huge yellow bird.  The last of the three was a youth as skinny as his longbow, if not quite as tall. Red-haired and freckled, he wore a studded brigantine, high boots, fingerless leather gloves, and a quiver on his back."
}