{
  "id": "e6e4ff40270ba3d8df2c1b832b9ca15f52e3fa73",
  "text": "  There was a stunned silence, both inside and outside the common room.  \"You -- you did?\" said Professor McGonagall. \"But -- but the password!\"  \"He had 'em!\" said Sir Cadogan proudly. \"Had the whole week's, my lady! Read 'em off a little piece of paper!\"  Professor McGonagall pulled herself back through the portrait hole to face the stunned crowd. She was white as chalk.  \"Which person,\" she said, her voice shaking, \"which abysmally foolish person wrote down this week's passwords and left them lying around?\"  There was utter silence, broken by the smallest of terrified squeaks. Neville Longbottom, trembling from head to fluffy slippered toes, raised his hand slowly into the air.  CHAPTER FOURTEEN  SNAPE'S GRUDGE  No one in Gryffindor Tower slept that night. They knew that the castle was being searched again, and the whole House stayed awake in the common room, waiting to hear whether Black had been caught. Professor McGonagall came back at dawn, to tell them that he had again escaped.  Throughout the day, everywhere they went they saw signs of tighter security; Professor Flitwick could be seen teaching the front doors to recognize a large picture of Sirius Black; Filch was suddenly bustling up and down the corridors, boarding up everything from tiny cracks in the walls to mouse holes. Sir Cadogan had been fired. His portrait had been taken back to its lonely landing on the seventh floor, and the Fat Lady was back. She had been expertly restored, but was still extremely nervous, and had agreed to return to her job only on condition that she was given extra protection. A bunch of surly security trolls had been hired to guard her. They paced the corridor in a menacing group, talking in grunts and comparing the size of their clubs.  Harry couldn't help noticing that the statue of the one-eyed witch on the third floor remained unguarded and unblocked. It seemed that Fred and George had been right in thinking that they -- and now Harry, Ron, and Hermione -- were the only ones who knew about the hidden passageway within it.  \"D'you reckon we should tell someone?\" Harry asked Ron.  \"We know he's not coming in through Honeyduke's,\" said Ron dismissively. \"We'd've heard if the shop had been broken into.\"  Harry was glad Ron took this view. If the one-eyed witch was boarded up too, he would never be able to go into Hogsmeade again.  Ron had become an instant celebrity. For the first time in his life, people were paying more attention to him than to Harry, and it was clear that Ron was rather enjoying the experience. Though still severely shaken by the night's events, he was happy to tell anyone who asked what had happened, with a wealth of detail.  \"... I was asleep, and I heard this ripping noise, and I thought it was in my dream, you know? But then there was this draft... I woke up and one side of the hangings on my bed had been pulled down.... I rolled over... and I saw him standing over me... like a skeleton, with loads of filthy hair ... holding this great long knife, must've been twelve inches... and he looked at me, and I looked at him, and then I yelled, and he scampered.  \"Why, though?\" Ron added to Harry as the group of secondyear girls who had been listening to his chilling tale departed. \"Why did he run?\"  Harry had been wondering the same thing. Why had Black, having got the wrong bed, not silenced Ron and proceeded to Harry? Black had proved twelve years ago that he didn't mind murdering innocent people, and this time he had been facing five unarmed boys, four of whom were asleep.  \"He must've known he'd have a job getting back out of the castle once you'd yelled and woken people up,\" said Harry thoughtfully. \"He'd've had to kill the whole House to get back through the portrait hole... then he would' ve met the teachers....\"  Neville was in total disgrace. Professor McGonagall was so furious with him she had banned him from all future Hogsmeade visits, given him a detention, and forbidden anyone to give him the password into the tower. Poor Neville was forced to wait. outside the common room every night for somebody to let him in, while the security trolls leered unpleasantly at him. None of these punishments, however, came close to matching the one his grandmother had in store for him. Two days after Black's break-in, she sent Neville the very worst thing a Hogwarts student could receive over breakfast -- a Howler.  The school owls swooped into the Great Hall carrying the mail as usual, and Neville choked as a huge barn owl landed in front of him, a scarlet envelope clutched in its beak. Harry and Ron, who were sitting opposite him, recognized the letter as a Howler at once -- Ron had got one from his mother the year before.  \"Run for it, Neville,\" Ron advised.  Neville didn't need telling twice. He seized the envelope, and holding it before him like a bomb, sprinted out of the hall, while the Slytherin table exploded with laughter at the sight of him. They heard the Howler go off in the entrance hall -- Neville's grandmother's voice, magically magnified to a hundred times its Usual volume, shrieking about how he had brought shame on the whole family."
}