{
  "id": "e714145ff2377fd5e0ac0877686a6487852908ca",
  "text": "  I am the blood of the dragon, Daenerys Targaryen reminded herself as she turned her face away. She pressed her lips together and hardened her heart and rode on toward the gate.   Most of Ogo’s riders fled,  Ser Jorah was saying.  Still, there may be as many as ten thousand captives.   Slaves, Dany thought. Khal Drogo would drive them downriver to one of the towns on Slaver’s Bay. She wanted to cry, but she told herself that she must be strong. This is war, this is what it looks like, this is the price of the Iron Throne.   I’ve told the khal he ought to make for Meereen,  Ser Jorah said.  They’ll pay a better price than he’d get from a slaving caravan. Illyrio writes that they had a plague last year, so the brothels are paying double for healthy young girls, and triple for boys under ten. If enough children survive the journey, the gold will buy us all the ships we need, and hire men to sail them.   Behind them, the girl being raped made a heartrending sound, a long sobbing wail that went on and on and on. Dany’s hand clenched hard around the reins, and she turned the silver’s head.  Make them stop,  she commanded Ser Jorah.   Khaleesi?  The knight sounded perplexed.   You heard my words,  she said.  Stop them.  She spoke to her khas in the harsh accents of Dothraki.  Jhogo, Quaro, you will aid Ser Jorah. I want no rape.   The warriors exchanged a baffled look.  Jorah Mormont spurred his horse closer.  Princess,  he said,  you have a gentle heart, but you do not understand. This is how it has always been. Those men have shed blood for the khal. Now they claim their reward.   Across the road, the girl was still crying, her high singsong tongue strange to Dany’s ears. The first man was done with her now, and a second had taken his place.   She is a lamb girl,  Quaro said in Dothraki.  She is nothing, Khaleesi. The riders do her honor. The Lamb Men lay with sheep, it is known.    It is known,  her handmaid Irri echoed.   It is known,  agreed Jhogo, astride the tall grey stallion that Drogo had given him.  If her wailing offends your ears, Khaleesi, Jhogo will bring you her tongue.  He drew his arakh.   I will not have her harmed,  Dany said.  I claim her. Do as I command you, or Khal Drogo will know the reason why.    Ai, Khaleesi,  Jhogo replied, kicking his horse. Quaro and the others followed his lead, the bells in their hair chiming.   Go with them,  she commanded Ser Jorah.   As you command.  The knight gave her a curious look.  You are your brother’s sister, in truth.    Viserys?  She did not understand.   No,  he answered.  Rhaegar.  He galloped off.  Dany heard Jhogo shout. The rapers laughed at him. One man shouted back. Jhogo’s arakh flashed, and the man’s head went tumbling from his shoulders. Laughter turned to curses as the horsemen reached for weapons, but by then Quaro and Aggo and Rakharo were there. She saw Aggo point across the road to where she sat upon her silver. The riders looked at her with cold black eyes. One spat. The others scattered to their mounts, muttering.  All the while the man atop the lamb girl continued to plunge in and out of her, so intent on his pleasure that he seemed unaware of what was going on around him. Ser Jorah dismounted and wrenched him off with a mailed hand. The Dothraki went sprawling in the mud, bounced up with a knife in hand, and died with Aggo’s arrow through his throat. Mormont pulled the girl off the pile of corpses and wrapped her in his blood-spattered cloak. He led her across the road to Dany.  What do you want done with her?   The girl was trembling, her eyes wide and vague. Her hair was matted with blood.  Doreah, see to her hurts. You do not have a rider’s look, perhaps she will not fear you. The rest, with me.  She urged the silver through the broken wooden gate.  It was worse inside the town. Many of the houses were afire, and the jaqqa rhan had been about their grisly work. Headless corpses filled the narrow, twisty lanes. They passed other women being raped. Each time Dany reined up, sent her khas to make an end to it, and claimed the victim as slave. One of them, a thick-bodied, flat-nosed woman of forty years, blessed Dany haltingly in the Common Tongue, but from the others she got only flat black stares. They were suspicious of her, she realized with sadness; afraid that she had saved them for some worse fate.   You cannot claim them all, child,  Ser Jorah said, the fourth time they stopped, while the warriors of her khas herded her new slaves behind her.   I am khaleesi, heir to the Seven Kingdoms, the blood of the dragon,  Dany reminded him.  It is not for you to tell me what I cannot do.  Across the city, a building collapsed in a great gout of fire and smoke, and she heard distant screams and the wailing of frightened children.  They found Khal Drogo seated before a square windowless temple with thick mud walls and a bulbous dome like some immense brown onion. Beside him was a pile of heads taller than he was. One of the short arrows of the Lamb Men stuck through the meat of his upper arm, and blood covered the left side of his bare chest like a splash of paint."
}