{
  "id": "e747f55c40e5c7a34ad194ae60fc65e1f08a40b4",
  "text": "  When the summons from his lord father arrived, it was the first time Tyrion could ever recall being pleased to see Ser Boros Blount. He closed the ledgers gratefully, blew out the oil lamp, tied a cloak around his shoulders, and waddled across the castle to the Tower of the Hand. The wind was brisk, just as he’d warned Sansa, and there was a smell of rain in the air. Perhaps when Lord Tywin was done with him he should go to the godswood and fetch her home before she got soaked.  But all that went straight out of his head when he entered the Hand’s solar to find Cersei, Ser Kevan, and Grand Maester Pycelle gathered about Lord Tywin and the king. Joffrey was almost bouncing, and Cersei was savoring a smug little smile, though Lord Tywin looked as grim as ever. I wonder if he could smile even if he wanted to.  What’s happened?  Tyrion asked.  His father offered him a roll of parchment. Someone had flattened it, but it still wanted to curl.  Roslin caught a fine fat trout,  the message read.  Her brothers gave her a pair of wolf pelts for her wedding.  Tyrion turned it over to inspect the broken seal. The wax was silvery-grey, and pressed into it were the twin towers of House Frey.  Does the Lord of the Crossing imagine he’s being poetic? Or is this meant to confound us?  Tyrion snorted.  The trout would be Edmure Tully, the pelts…    He’s dead!  Joffrey sounded so proud and happy you might have thought he’d skinned Robb Stark himself.  First Greyjoy and now Stark. Tyrion thought of his child wife, praying in the godswood even now. Praying to her father’s gods to bring her brother victory and keep her mother safe, no doubt. The old gods paid no more heed to prayer than the new ones, it would seem. Perhaps he should take comfort in that.  Kings are falling like leaves this autumn,  he said.  It would seem our little war is winning itself.    Wars do not win themselves, Tyrion,  Cersei said with poisonous sweetness.  Our lord father won this war.    Nothing is won so long as we have enemies in the field,  Lord Tywin warned them.   The river lords are no fools,  the queen argued.  Without the northmen they cannot hope to stand against the combined power of Highgarden, Casterly Rock, and Dorne. Surely they will choose submission rather than destruction.    Most,  agreed Lord Tywin.  Riverrun remains, but so long as Walder Frey holds Edmure Tully hostage, the Blackfish dare not mount a threat. Jason Mallister and Tytos Blackwood will fight on for honor’s sake, but the Freys can keep the Mallisters penned up at Seagard, and with the right inducement Jonos Bracken can be persuaded to change his allegiance and attack the Blackwoods. In the end they will bend the knee, yes. I mean to offer generous terms. Any castle that yields to us will be spared, save one.    Harrenhal?  said Tyrion, who knew his sire.   The realm is best rid of these Brave Companions. I have commanded Ser Gregor to put the castle to the sword.   Gregor Clegane. It appeared as if his lord father meant to mine the Mountain for every last nugget of ore before turning him over to Dornish justice. The Brave Companions would end as heads on spikes, and Littlefinger would stroll into Harrenhal without so much as a spot of blood on those fine clothes of his. He wondered if Petyr Baelish had reached the Vale yet. If the gods are good, he ran into a storm at sea and sank. But when had the gods ever been especially good?   They should all be put to the sword,  Joffrey declared suddenly.  The Mallisters and Blackwoods and Brackens… all of them. They’re traitors. I want them killed, Grandfather. I won’t have any generous terms.  The king turned to Grand Maester Pycelle.  And I want Robb Stark’s head too. Write to Lord Frey and tell him. The king commands. I’m going to have it served to Sansa at my wedding feast.    Sire,  Ser Kevan said, in a shocked voice,  the lady is now your aunt by marriage.    A jest.  Cersei smiled.  Joff did not mean it.    Yes I did,  Joffrey insisted.  He was a traitor, and I want his stupid head. I’m going to make Sansa kiss it.    No.  Tyrion’s voice was hoarse.  Sansa is no longer yours to torment. Understand that, monster.   Joffrey sneered.  You’re the monster, Uncle.    Am I?  Tyrion cocked his head.  Perhaps you should speak more softly to me, then. Monsters are dangerous beasts, and just now kings seem to be dying like flies.    I could have your tongue out for saying that,  the boy king said, reddening.  I’m the king.   Cersei put a protective hand on her son’s shoulder.  Let the dwarf make all the threats he likes, Joff. I want my lord father and my uncle to see what he is.   Lord Tywin ignored that; it was Joffrey he addressed.  Aerys also felt the need to remind men that he was king. And he was passing fond of ripping tongues out as well. You could ask Ser Ilyn Payne about that, though you’ll get no reply.    Ser Ilyn never dared provoke Aerys the way your Imp provokes Joff,  said Cersei.  You heard him. ‘Monster’ he said."
}