{
  "id": "e7dbbf451e45c296df24d58ae9dd4c314a827c91",
  "text": "  I envy those eggs,  he said.  I could do with a bit of boiling about now. If the kettle were larger, I might jump in. Though I would sooner it were wine than water. There are worse ways to die than warm and drunk. I knew a brother drowned himself in wine once. It was a poor vintage, though, and his corpse did not improve it.    You drank the wine?    It’s an awful thing to find a brother dead. You’d have need of a drink as well, Lord Snow.  Edd stirred the kettle and added a pinch more nutmeg.  Restless, Jon squatted by the fire and poked at it with a stick. He could hear the Old Bear’s voice inside the tent, punctuated by the raven’s squawks and Qhorin Halfhand’s quieter tones, but he could not make out the words. Alfyn Crowkiller dead, that’s good. He was one of the bloodiest of the wildling raiders, taking his name from the black brothers he’d slain. So why does Qhorin sound so grave, after such a victory?  Jon had hoped that the arrival of men from the Shadow Tower would lift the spirits in the camp. Only last night, he was coming back through the dark from a piss when he heard five or six men talking in low voices around the embers of a fire. When he heard Chett muttering that it was past time they turned back, Jon stopped to listen.  It’s an old man’s folly, this ranging,  he heard.  We’ll find nothing but our graves in them mountains.    There’s giants in the Frostfangs, and wargs, and worse things,  said Lark the Sisterman.   I’ll not be going there, I promise you.    The Old Bear’s not like to give you a choice.    Might be we won’t give him one,  said Chett.  Just then one of the dogs had raised his head and growled, and he had to move away quickly, before he was seen. I was not meant to hear that, he thought. He considered taking the tale to Mormont, but he could not bring himself to inform on his brothers, even brothers such as Chett and the Sisterman. It was just empty talk, he told himself. They are cold and afraid, we all are. It was hard waiting here, perched on the stony summit above the forest, wondering what the morrow might bring. The unseen enemy is always the most fearsome.  Jon slid his new dagger from its sheath and studied the flames as they played against the shiny black glass. He had fashioned the wooden hilt himself, and wound hempen twine around it to make a grip. Ugly, but it served. Dolorous Edd opined that glass knives were about as useful as nipples on a knight’s breastplate, but Jon was not so certain. The dragonglass blade was sharper than steel, albeit far more brittle.  It must have been buried for a reason.  He had made a dagger for Grenn as well, and another for the Lord Commander. The warhorn he had given to Sam. On closer examination the horn had proved cracked, and even after he had cleaned all the dirt out, Jon had been unable to get any sound from it. The rim was chipped as well, but Sam liked old things, even worthless old things.  Make a drinking horn out of it,  Jon told him,  and every time you take a drink you’ll remember how you ranged beyond the Wall, all the way to the Fist of the First Men.  He gave Sam a spearhead and a dozen arrowheads as well, and passed the rest out among his other friends for luck.  The Old Bear had seemed pleased by the dagger, but he preferred a steel knife at his belt, Jon had noticed. Mormont could offer no answers as to who might have buried the cloak or what it might mean. Perhaps Qhorin will know. The Halfhand had ventured deeper into the wild than any other living man.   You want to serve, or shall I?   Jon sheathed the dagger.  I’ll do it.  He wanted to hear what they were saying.  Edd cut three thick slices off a stale round of oat bread, stacked them on a wooden platter, covered them with bacon and bacon drippings, and filled a bowl with hard-cooked eggs. Jon took the bowl in one hand and the platter in the other and backed into the Lord Commander’s tent.  Qhorin was seated cross-legged on the floor, his spine as straight as a spear. Candlelight flickered against the hard flat planes of his cheeks as he spoke.  …Rattleshirt, the Weeping Man, and every other chief great and small,  he was saying.  They have wargs as well, and mammoths, and more strength than we would have dreamed. Or so he claimed. I will not swear as to the truth of it. Ebben believes the man was telling us tales to make his life last a little longer.    True or false, the Wall must be warned,  the Old Bear said as Jon placed the platter between them.  And the king.    Which king?    All of them. The true and the false alike. If they would claim the realm, let them defend it.   The Halfhand helped himself to an egg and cracked it on the edge of the bowl.  These kings will do what they will,  he said, peeling away the shell.  Likely it will be little enough. The best hope is Winterfell. The Starks must rally the north.    Yes. To be sure.  The Old Bear unrolled a map, frowned at it, tossed it aside, opened another. He was pondering where the hammer would fall, Jon could see it."
}