{
  "id": "e89e7a91cc195fac78db9c8852a67072b64f195d",
  "text": " There  was a still silence.  Then Gollum dropped his  head and shrank down, until he was squatting on the  floor,  shivering.  'We  doesn't  know  and we  doesn't want  to  know,'  he   whimpered. `Never came here; never come again.'       `There are locked doors and closed windows in your mind, and dark rooms  behind them,' said Faramir. `But in this I judge  that you speak  the truth.  It is well  for you. What oath will  you swear never to return; and never to  lead any living creature hither by word or sign?'       `Master knows,'  said Gollum with a  sidelong glance at Frodo. `Yes, he  knows. We will promise Master, if he saves us. We'll promise to It, yes.' He  crawled  to Frodo's feet.  'Save  us,  nice Master!  '  he whined.  `Smjagol  promises to Precious, promises faithfully. Never come again, never speak, no   ####-never! No, precious, no!'       `Are you satisfied? ' said Faramir.       `Yes,' said Frodo.  'At least, you must  either  accept this promise or  carry out your law. You will get no more. But I promised that if he came  to   me, he should not be harmed. And I would not be proved faithless.'       Faramir sat for a moment in thought. `Very good,' he  said at last.  `I   surrender you to your master, to Frodo son of Drogo. Let him declare what he  will do with you! '       'But, Lord Faramir,' said Frodo bowing, `you have not yet declared your  will  concerning  the said Frodo, and until  that is  made known, he  cannot  shape his plans for himself  or his companions. Your judgement was postponed  until the morning; but that is now at hand.'       `Then I  will declare my doom,' said Faramir. `As for you, Frodo, in so  far as lies in me under higher  authority, I declare you  free in  the realm  of, Gondor to the furthest of its ancient bounds; save only that neither you   nor any that go with you have leave to come  to  this  place unbidden.  This  doom  shall  stand for a  year and a day, and  then cease,  unless you shall  before that term come to Minas Tirith and present yourself to  the  Lord and   Steward of the City. Then I will entreat him to confirm what I have done and  to make  it  lifelong.  In the  meantime,  whomsoever  you  take  under your   protection shall be under my protection  and under the shield of Gondor. Are  you answered? '       Frodo bowed low. 'I am answered,' he  said, `and I place myself at your  service, if that is of any worth to one so high and honourable.'       `It is  of  great  worth,' said  Faramir.  'And  now, do you  take this  creature, this Smjagol, under your protection? '       `I  do  take  Smjagol under  my  protection,' said  Frodo.  Sam  sighed  audibly;  and  not  at  the courtesies, of which, as  any  hobbit  would, he  thoroughly approved. Indeed in the Shire such a matter would have required a   great many more words and bows.        'Then I say  to you,'  said Faramir, turning to  Gollum, 'you  are under   doom of  death; but while you walk with Frodo you are safe for our part. Yet  if ever you be found by any man of Gondor astray without him, the doom shall  fall. And may death find  you swiftly, within Gondor  or  without,  if you do  not well serve him. Now answer me: whither would you go? You were his  guide,  he says. Whither were you leading him? ' Gollum made no reply.   ####-     `This I will not  have secret,'  said Faramir. `Answer me,  or  I  will  reverse my judgement! ' Still Gollum did not answer.       `I will answer for him,' said Frodo. `He brought  me to the Black Gate,  as I asked; but it was impassable.'       `There is no open gate into the Nameless Land,' said Faramir.       `Seeing this, we  turned aside and came by  the Southward road '  Frodo  continued; 'for he said that there is, or there may be, a path near to Minas  Ithil.'       `Minas Morgul,' said Faramir.       `I do not know clearly,' said Frodo; `but the path  climbs, I think, up  into  the mountains  on the  northern side of that vale  where  the old city  stands. It goes up to a high cleft and so down to -- that which is beyond.'       `Do you know the name of that high pass? ' said Faramir.       'No,' said Frodo.       'It is  called Cirith Ungol.' Gollum hissed sharply and began muttering  to himself. `Is not that its name? ' said Faramir turning to him.       `No! '  said  Gollum, and then he squealed, as if something had stabbed  him. 'Yes, yes, we heard the name once. But what does the name matter to us?  Master  says he must get in. So we must try some way. There is no  other way  to try, no.'       'No  other way?  ' said  Faramir. `How do  you  know  that? And who has  explored  all  the  confines  of  that  dark  realm? '  He  looked long  and  thoughtfully at Gollum. Presently he spoke  again. `Take this creature away,  Anborn. Treat  him gently, but watch  him.  And do not you,  Smjagol, try to  dive into the falls.  The rocks  have such  teeth  there  as would  slay you   before your time. Leave us now and take your fish! '       Anborn  went out  and Gollum went cringing before him."
}