{
  "id": "e8fa45f419fd5be62482d911b0baad594cf4b630",
  "text": "  The Riddles were buried in the Little Hangleton churchyard, and their graves remained objects of curiosity for a while.  To everyone's surprise, and amid a cloud of suspicion, Frank Bryce returned to his cottage on the grounds of the Riddle House.  \"'S far as I'm concerned, he killed them, and I don't care what the police say,\" said Dot in the Hanged Man.  \"And if he had any decency, he'd leave here, knowing as how we knows he did it.\"  But Frank did not leave.  He stayed to tend the garden for the next family who lived in the Riddle House, and then the next -- for neither family stayed long.  Perhaps it was partly because of Frank that the new owners said there was a nasty feeling about the place, which, in the absence of inhabitants, started to fall into disrepair.   The wealthy man who owned the Riddle House these days neither lived there nor put it to any use; they said in the village that he kept it for \"tax reasons,\" though nobody was very clear what these might be.  The wealthy owner continued to pay Frank to do the gardening, however.  Frank was nearing his seventy-seventh birthday now, very deaf, his bad leg stiffer than ever, but could be seen pottering around the flower beds in fine weather, even though the weeds were starting to creep up on him, try as he might to suppress them.  Weeds were not the only things Frank had to contend with either.  Boys from the village made a habit of throwing stones through the windows of the Riddle House.  They rode their bicycles over the lawns Frank worked so hard to keep smooth.  Once or twice, they broke into the old house for a dare.  They knew that old Frank's devotion to the house and the grounds amounted almost to an obsession, and it amused them to see him limping across the garden, brandishing his stick and yelling croakily at them.  Frank, for his part, believed the boys tormented him because they, like their parents and grandparents, though him a murderer.  So when Frank awoke one night in August and saw something very odd up at the old house, he merely assumed that the boys had gone one step further in their attempts to punish him.  It was Frank's bad leg that woke him; it was paining him worse than ever in his old age.  He got up and limped downstairs into the kitchen with the idea of refilling his hot-water bottle to ease the stiffness in his knee.  Standing at the sink, filling the kettle, he looked up at the Riddle House and saw lights glimmering in its upper windows.  Frank knew at once what was going on.  The boys had broken into the house again, and judging by the flickering quality of the light, they had started a fire.  Frank had no telephone, in any case, he had deeply mistrusted the police ever since they had taken him in for questioning about the Riddles' deaths.  He put down the kettle at once, hurried back upstairs as fast as his bad leg would allow, and was soon back in his kitchen, fully dressed and removing a rusty old key from its hook by the door.  He picked up his walking stick, which was propped against the wall, and set off into the night.    The front door of the Riddle House bore no sign of being forced, nor did any of the windows.  Frank limped around to the back of the house until he reached a door almost completely hidden by ivy, took out the old key, put it into the lock, and opened the door noiselessly.  He let himself into the cavernous kitchen.  Frank had not entered it for many years; nevertheless, although it was very dark, he remembered where the door into the hall was, and he groped his way towards it, his nostrils full of the smell of decay, ears pricked for any sound of footsteps or voices from overhead.  He reached the hall, which was a little lighter owing to the large mullioned windows on either side of the front door, and started to climb the stairs, blessing the dust that lay thick upon the stone, because it muffled the sound of his feet and stick.  On the landing, Frank turned right, and saw at once where the intruders were:  At the every end of the passage a door stood ajar, and a flickering light shone through the gap, casting a long sliver of gold across the black floor.  Frank edged closer and closer, he was able to see a narrow slice of the room beyond.  The fire, he now saw, had been lit in the grate.  This surprised him.  Then he stopped moving and listened intently, for a man's voice spoke within the room; it sounded timid and fearful.  \"There is a little more in the bottle, My Lord, if you are still hungry.\"  \"Later,\" said a second voice.  This too belonged to a man -- but it was strangely high-pitched, and cold as a sudden blast of icy wind.  Something about that voice made the sparse hairs on the back of Frank's neck stand up.  \"Move me closer to the fire, Wormtail.\"  Frank turned his right ear toward the door, the better to hear.  There came the clink of a bottle being put down upon some hard surface, and then the dull scraping noise of a heavy chair being dragged across the floor.  Frank caught a glimpse of a small man, his back to the door, pushing the chair into place."
}