{
  "id": "ea231d909ede557eff36da844d7b6af8ae8bb9e0",
  "text": "  \"O!  why  did  we  not  remember  Beorn's  advice,  and  Gandalf's!\"  he  lamented.  \"What  a mess we  are  in  now! We!  I  only wish  it was we:  it  is  horrible  being all alone.\"  In the end he made as good a guess as he could at the direction from which the  cries for help had come in the night – and by luck (he was born with a good share  of  it) be guessed more or  less  right, as you will  see. Having made up his mind he  crept  along  as  cleverly  as  he  could.  Hobbits  are  clever  at quietness,  especially  in  woods,  as  1.  have  already  told  you;  also  Bilbo  had  slipped  on  his  ring  before  he  started. That is why the spiders neither saw nor heard him coming.  He had picked his way stealthily 'for some distance, when he noticed a place of  dense  black  shadow  ahead  of  him  black  even  for  that  forest,  like  a  patch  of  midnight  that had never been cleared away. As he drew nearer, he saw  that  it was  made  by  spider-webs one behind  and over  and  tangled with  another. Suddenly he  saw,  too,  that  there  were  spiders  huge  and  horrible  sitting  in  the  branches  above  him,  and  ring  or  no  ring  he  trembled  with  fear  lest  they  should  discover  him.  Standing behind a tree he watched a group of them for some time, and then in the  silence  and  stillness  of  the  wood  he  realised  that  these  loathsome  creatures  were  speaking one to another. Their voices were a sort of thin creaking and hissing, but  he could make out many of  the words  that  they said. They were  talking about  the  dwarves!  \"It was  a  sharp  struggle, but worth  it,\"  said one.  \"What nasty  thick  skins  they  have to be sure, but I'll wager there is good juice inside.\"   ####-\"Aye, they'll make fine eating, when they've hung a bit,\" said another.   \"Don't  hang  'em  too  long,\"  said  a  third.  \"They're  not  as  fat  as  they might  be.  Been feeding none too well of late, I should guess.\"  \"Kill'em, I say,\" hissed a fourth; \"kill 'em now and hang 'em dead for a while.\"  \"They're dead now, I'll warrant,\" said the first.  \"That they are not. I saw one a-struggling just now. Just coming round again, I  should say, after a bee-autiful sleep. I'll show you.\"  With that one of the fat spiders ran along a rope, till it came to a dozen bundles  hanging  in  a  row  from  a  high  branch.  Bilbo  was  horrified,  now  that  he  noticed  them for the first time dangling in the shadows, to see a dwarvish foot sticking out  of  the bottoms of some of  the bundles, or here and  there  the  tip of a nose, or a bit  of beard or of a hood.  To the fattest of these bundles the spider went--\"It is poor old Bombur, I'll bet,\"  thought Bilbo  –  and  nipped  hard  at  the  nose  that  stuck  out. There was  a muffled  yelp  inside,  and  a  toe  shot  up  and  kicked  the  spider  straight  and  hard. There was  life  in  Bombur  still.  There  was  a  noise  like  the  kicking  of  a  flabby  football,  and  the  enraged spider  fell off  the branch, only catching  itself with  its own  thread  just  in time.  The  others  laughed.  \"You  were  quite  right,\"  they  said,  \"the  meat's  alive  and  kicking!\"                        \"  \"I'll  soon  put  an  end  to  that,\"  hissed  the  angry  spider  climbing  back  onto  the  branch.  Bilbo  saw  that  the moment  had  come  when  he must  do  something.  He  could  not  get  up  at  the  brutes  and  he  had  nothing  to  shoot  with;  but  looking  about  he  saw  that  in  this place  there were many  stones  lying  in what appeared  to be  a now  dry little watercourse. Bilbo was a pretty fair shot with a stone, and it did not take  him long to find a nice smooth egg-shaped one that fitted his hand cosily.   As  a  boy  he  used  to  practise  throwing  stones  at  things,  until  rabbits  and  squirrels,  and even birds, got out of his way as quick as  lightning  if  they saw him  stoop;  and  even  grownup  he  had  still  spent  a  deal  of  his  time  at  quoits,  dart- throwing,  shooting  at  the  wand,  bowls,  ninepins  and  other  quiet  games  of  the  aiming  and  throwing  sort-indeed  he  could  do  lots  of  things,  besides  blowing  smoke-rings, asking riddles and cooking, that I haven't had time to tell you about.  There  is  no  time  now.  While  he  was  picking  up  stones,  the  spider  had  reached  Bombur,  and  soon  he  would  have  been  dead.  At  that  moment  Bilbo  threw.  The  stone struck the spider plunk on the head, and it dropped senseless off the tree, flop  to the ground, with all its legs curled up.   ####-The  next  stone  went  whizzing  through  a  big  web,  snapping  its  cords,  and  taking off the spider sitting in the middle of it, whack, dead. After that there was a  deal  of  commotion  in  the  spider-colony,  and  they  forgot  the  dwarves  for  a  bit,  I  can  tell  you.  They  could  not  see Bilbo,  but  they  could make  a  good  guess  at  the  direction  from  which  the  stones  were  coming."
}