{
  "id": "ead41a86154ffef1659b3ec8c66b59207af25e7b",
  "text": " Actually  in  the Shire in Bilbo's  days it  was, as a rule, only the richest and  the  poorest Hobbits  that maintained the old custom. The poorest  went on  living  in burrows  of the  most  primitive  kind,  mere holes indeed, with only one  window or  none;  while  the  well-to-do  still constructed  more  luxurious  versions of the simple diggings of old.  But suitable  sites for these large  and ramifying tunnels (or smials as they called them) were not everywhere to  be found; and in the flats and the low-lying districts the Hobbits, as  they   ####-multiplied, began to  build above ground. Indeed, even in the hilly  regions  and the older villages, such  as  Hobbiton or Tuckborough,  or in the  chief  township of the Shire, Michel Delving  on  the White Downs, there  were  now  many houses  of wood,  brick, or stone. These  were  specially  favoured  by  millers, smiths, ropers,  and cartwrights, and others of that sort; for even  when  they  had holes to live in. Hobbits had long been  accustomed to build  sheds and workshops.       The habit of building farmhouses and barns was said to have begun among  the inhabitants of the Marish  down by the Brandywine.  The  Hobbits of that  quarter, the Eastfarthing, were rather large and heavy-legged, and they wore  dwarf-boots in muddy  weather. But they were well known  to  be Stoors in  a  large part of their blood, as indeed was shown by the down that many grew on  their chins. No Har foot  or Fallohide had  any trace of a beard. Indeed, the  folk  of  the Marish,  and  of Buckland,  east  of  the  River,  which  they  afterwards  occupied, came for the most  part  later into the Shire  up from  south-away;  and  they still had many peculiar names and strange  words  not  found elsewhere in the Shire.       It is probable that the craft of building, as many other crafts beside,  was derived from the D®nedain. But  the Hobbits  may  have learned it direct  from the Elves, the teachers of  Men  in their  youth. For the Elves of  the  High Kindred had not yet forsaken Middle-earth, and they dwelt still at that  time at  the Grey Havens away to the west, and in other  places within reach  of the  Shire. Three  Elf-towers of immemorial age were still to be seen  on  the  Tower Hills  beyond the  western marches.  They shone far  off  in  the  moonlight. The tallest was furthest away, standing alone upon a green mound.  The Hobbits of the Westfarthing said that one could see the Sea from the lop   of that tower; but  no  Hobbit had ever  been known to climb it. Indeed, few  Hobbits  had ever  seen or  sailed  upon the Sea, and fewer  still had  ever   returned to  report  it. Most Hobbits regarded even  rivers  and small boats  with deep misgivings, and not  many of  them could swim.  And as the days of  the Shire lengthened  they  spoke  less and  less with  the  Elves, and grew  afraid  of them, and distrustful of those  that  had dealings with them; and  the Sea  became  a word  of fear  among them, and a token of death, and they  turned their faces away from the hills in the west.       The craft  of building may have come from Elves or Men, but the Hobbits  used it in  their own fashion. They did not go in  for  towers. Their houses  were usually long, low,  and comfortable. The oldest kind  were,  indeed, no   ####-more than built imitations of smials, thatched with dry  grass or  straw, or   roofed with turves,  and having walls somewhat  bulged. That stage, however,  belonged to the early days of the Shire, and hobbit-building had long  since  been  altered, improved by devices,  learned from Dwarves,  or discovered by  themselves.  A  preference for round windows, and even round  doors, was the  chief remaining peculiarity of hobbit -architecture.       The houses  and  the  holes   of  Shire-hobbits  were  often  large, and  inhabited by large families. (Bilbo and Frodo Baggins were as bachelors very  exceptional,  as they were also in many other ways, such as their friendship  with the Elves.) Sometimes, as in the case  of the Tooks of Great Smials, or   the Brandybucks  of  Brandy Hall,  many  generations of  relatives  lived in  (comparative) peace  together  in one ancestral  and many -tunnelled mansion.  All Hobbits were, in any case,  clannish and reckoned up their relationships  with great care. They drew long and elaborate family -trees with  innumerable  branches. In dealing with Hobbits it is important to remember who is related  to whom,  and in what degree. It would be impossible in this book to set out  a  family-tree  that included  even the more  important members of the  more  important families at  the  time which these tales tell of. The genealogical  trees  at  the  end  of  the  Red Book of  Westmarch  are  a  small book  in  themselves,  and all but Hobbits  would find them  exceedingly dull. Hobbits  delighted in such things, if they  were accurate: they liked  to  have books  filled with  things that they already knew, set out fair and  square with no  contradictions."
}