{
  "id": "ebeaff34fbdce42d6fe07bcbeeed1703ae14939f",
  "text": " A skilled armorer even more so. Why would you choose to stay with us?   Arya watched Gendry screw up his stupid face, thinking.  At the hollow hill, what you said about being King Robert’s men, and brothers, I liked that. I liked that you gave the Hound a trial. Lord Bolton just hanged folk or took off their heads, and Lord Tywin and Ser Amory were the same. I’d sooner smith for you.    We got plenty of mail needs mending, m’lord,  Jack reminded Lord Beric.  Most we took off the dead, and there’s holes where the death came through.    You must be a lackwit, boy,  said Lem.  We’re outlaws. Lowborn scum, most of us, excepting his lordship. Don’t think it’ll be like Tom’s fool songs neither. You won’t be stealing no kisses from a princess, nor riding in no tourneys in stolen armor. You join us, you’ll end with your neck in a noose, or your head mounted up above some castle gate.    It’s no more than they’d do for you,  said Gendry.   Aye, that’s so,  said Jack-Be-Lucky cheerfully.  The crows await us all. M’lord, the boy seems brave enough, and we do have need of what he brings us. Take him, says Jack.    And quick,  suggested Harwin, chuckling,  before the fever passes and he comes back to his senses.   A wan smile crossed Lord Beric’s lips.  Thoros, my sword.   This time the lightning lord did not set the blade afire, but merely laid it light on Gendry’s shoulder.  Gendry, do you swear before the eyes of gods and men to defend those who cannot defend themselves, to protect all women and children, to obey your captains, your liege lord, and your king, to fight bravely when needed and do such other tasks as are laid upon you, however hard or humble or dangerous they may be?    I do, m’lord.   The marcher lord moved the sword from the right shoulder to the left, and said,  Arise Ser Gendry, knight of the hollow hill, and be welcome to our brotherhood.   From the door came rough, rasping laughter.  The rain was running off him. His burned arm was wrapped in leaves and linen and bound tight against his chest by a crude rope sling, but the older burns that marked his face glistened black and slick in the glow of their little fire.  Making more knights, Dondarrion?  the intruder said in a growl.  I ought to kill you all over again for that.   Lord Beric faced him coolly.  I’d hoped we’d seen the last of you, Clegane. How did you come to find us?    It wasn’t hard. You made enough bloody smoke to be seen in Oldtown.    What’s become of the sentries I posted?   Clegane’s mouth twitched.  Those two blind men? Might be I killed them both. What would you do if I had?   Anguy strung his bow. Notch was doing the same.  Do you wish to die so very much, Sandor?  asked Thoros.  You must be mad or drunk to follow us here.    Drunk on rain? You didn’t leave me enough gold to buy a cup of wine, you whoresons.   Anguy drew an arrow.  We’re outlaws. Outlaws steal. It’s in the songs, if you ask nice Tom may sing you one. Be thankful we didn’t kill you.    Come try it, Archer. I’ll take that quiver off you and shove those arrows up your freckly little arse.   Anguy raised his longbow, but Lord Beric lifted a hand before he could loose.  Why did you come here, Clegane?    To get back what’s mine.    Your gold?    What else? It wasn’t for the pleasure of looking at your face, Dondarrion, I’ll tell you that. You’re uglier than me now. And a robber knight besides, it seems.    I gave you a note for your gold,  Lord Beric said calmly.  A promise to pay, when the war’s done.    I wiped my arse with your paper. I want the gold.    We don’t have it. I sent it south with Greenbeard and the Huntsman, to buy grain and seed across the Mander.    To feed all them whose crops you burned,  said Gendry.   Is that the tale, now?  Sandor Clegane laughed again.  As it happens, that’s just what I meant to do with it. Feed a bunch of ugly peasants and their poxy whelps.    You’re lying,  said Gendry.   The boy has a mouth on him, I see. Why believe them and not me? Couldn’t be my face, could it?  Clegane glanced at Arya.  You going to make her a knight too, Dondarrion? The first eight-year-old girl knight?    I’m twelve,  Arya lied loudly,  and I could be a knight if I wanted. I could have killed you too, only Lem took my knife.  Remembering that still made her angry.   Complain to Lem, not me. Then tuck your tail between your legs and run. Do you know what dogs do to wolves?    Next time I will kill you. I’ll kill your brother too!    No.  His dark eyes narrowed.  That you won’t.  He turned back to Lord Beric.  Say, make my horse a knight. He never shits in the hall and doesn’t kick more than most, he deserves to be knighted. Unless you meant to steal him too.    Best climb on that horse and go,  warned Lem.   I’ll go with my gold. Your own god said I’m guiltless—    The Lord of Light gave you back your life,  declared Thoros of Myr.  He did not proclaim you Baelor the Blessed come again.  The red priest unsheathed his sword, and Arya saw that Jack and Merrit had drawn as well."
}