{
  "id": "ec45860d30a08c605595345f5c48bd8d195c392a",
  "text": " Upon this  rough bier they carried the  body of  their companion to the shore, together   with such trophies of  his last battle as they chose to send forth with him.  It was only a short way, yet they found it no easy task, for  Boromir was  a   man both tall and strong.   ####-     At the water -side Aragorn  remained, watching the  bier. while  Legolas  and Gimli hastened back on foot to Parth  Galen. It was  a mile or more, and  it was some time before they came back, paddling two boats swiftly along the  shore.       'There is a strange tale  to tell!'  said Legolas. 'There are  only two  boats upon the bank. We could find no trace of the other.'       'Have Orcs been there?' asked Aragorn.       'We saw no signs of  them,' answered Gimli. 'And Orcs  would have taken  or destroyed all the boats, and the baggage as well.'       'I will look at the ground when we come there,' said Aragorn.       Now they laid  Boromir  in the middle of the boat that  was to bear him  away. The grey hood and elven-cloak they folded and placed beneath his head.  They combed his long dark hair and arrayed it upon his shoulders. The golden  belt of Lurien gleamed  about  his waist. His helm they set beside  him, and  across  his lap  they laid the  cloven horn and  the hilts and shards of his  sword; beneath his  feet  they put the swords of his enemies. Then fastening   the  prow to the stern of the other boat,  they drew him out into the water.  They rowed sadly along the shore, and turning into the swift -running channel  they passed the green sward of Parth Galen. The steep  sides of  Tol Brandir   were  glowing:  it  was now  mid-afternoon.  As they  went south the fume of  Rauros rose and  shimmered before them, a haze of gold. The rush and thunder  of the falls shook the windless air .       Sorrowfully  they  cast loose  the funeral  boat:  there  Boromir  lay,  restful, peaceful, gliding upon  the bosom of the  flowing water. The stream  took him while they  held their own boat back with their paddles. He floated  by  them, and slowly  his  boat departed, waning to  a dark spot against the  golden  light;  and then suddenly it vanished. Rauros  roared on unchanging.  The River  had taken Boromir  son of Denethor,  and he was not seen again in  Minas  Tirith,  standing as he used to  stand  upon  the  White Tower in the  morning. But  in Gondor in after -days it long  was said that  the elven-boat  rode  the falls  and the foaming pool, and bore him down  through Osgiliath,  and  past the many mouths of Anduin, out  into the Great Sea at night  under   the stars.       For a  while  the three companions remained  silent,  gazing after him.  Then  Aragorn spoke. 'They will look for him from the White Tower,' he said,  'but he will not return from mountain or from  sea.' Then slowly he began to  sing:   ####-     Through Rohan over fen and field where the long grass grows       The West Wind comes walking, and about the walls it goes.       'What news from the West, O wandering wind, do you bring to me tonight?        Have you seen Boromir the Tall by moon or by starlight?'       'I saw him ride over seven streams, over waters wide and grey;       I saw him walk in empty lands, until he passed away       Into the shadows of the North. I saw him then no more.       The North Wind may have heard the horn of the son of Denethor.'        'O Boromir! From the high walls westward I looked afar,       But you came not from the empty lands where no men are.'          Then Legolas sang:         From the mouths of the Sea the South Wind flies, from the sandhills and the stones;       The wailing of the gulls it bears, and at the gate it moans.       'What news from the South, O sighing wind, do you bring to me at eve?       Where now is Boromir the Fair? He tarries and I grieve.'        'Ask not of me where he doth dwell-so many bones there lie       On the white shores and the dark shores under the stormy sky;       So many have passed down Anduin to find the flowing Sea.       Ask of the North Wind news of them the North Wind sends to me!'        'O Boromir! Beyond the gate the seaward road runs south,       But you came not with the wailing gulls from the grey sea's mouth.'        Then Aragorn sang again:       From the  Gate  of Kings  the  North Wind rides,  and past the  roaring falls;        And clear and cold about the tower its loud horn calls.       'What news from the North, O mighty wind, do you bring to me today?       What news of Boromir the Bold? For he is long away.'        'Beneath Amon Hen I heard his cry. There many foes he fought.       His cloven shield, his broken sword, they to the water brought.       His head so proud, his face so fair, his limbs they laid to rest;       And Rauros, golden Rauros-falls, bore him upon its breast.'        'O Boromir! The Tower of Guard shall ever northward gaze       To Rauros, golden Rauros-falls, until the end o f days.'          So they ended. Then they  turned  their boat and drove it with all  the  speed they could against the stream back to Parth Galen."
}