{
  "id": "ef00d72e3f8d063c7e4bf47ac609c87ed408d0b6",
  "text": " Dead men clogged the shallows, some still moving as the water pushed them, others washed up on the banks. Her brothers and sisters swarmed around them, tearing at the rich ripe flesh.  The crows were there too, screaming at the wolves and filling the air with feathers. Their blood was hotter, and one of her sisters had snapped at one as it took flight and caught it by the wing. It made her want a crow herself. She wanted to taste the blood, to hear the bones crunch between her teeth, to fill her belly with warm flesh instead of cold. She was hungry and the meat was all around, but she knew she could not eat.  The scent was stronger now. She pricked her ears up and listened to the grumbles of her pack, the shriek of angry crows, the whirr of wings and sound of running water. Somewhere far off she could hear horses and the calls of living men, but they were not what mattered. Only the scent mattered. She sniffed the air again. There it was, and now she saw it too, something pale and white drifting down the river, turning where it brushed against a snag. The reeds bowed down before it.  She splashed noisily through the shallows and threw herself into the deeper water, her legs churning. The current was strong but she was stronger. She swam, following her nose. The river smells were rich and wet, but those were not the smells that pulled her. She paddled after the sharp red whisper of cold blood, the sweet cloying stench of death. She chased them as she had often chased a red deer through the trees, and in the end she ran them down, and her jaw closed around a pale white arm. She shook it to make it move, but there was only death and blood in her mouth. By now she was tiring, and it was all she could do to pull the body back to shore. As she dragged it up the muddy bank, one of her little brothers came prowling, his tongue lolling from his mouth. She had to snarl to drive him off, or else he would have fed. Only then did she stop to shake the water from her fur. The white thing lay facedown in the mud, her dead flesh wrinkled and pale, cold blood trickling from her throat. Rise, she thought. Rise and eat and run with us.  The sound of horses turned her head. Men. They were coming from downwind, so she had not smelled them, but now they were almost here. Men on horses, with flapping black and yellow and pink wings and long shiny claws in hand. Some of her younger brothers bared their teeth to defend the food they’d found, but she snapped at them until they scattered. That was the way of the wild. Deer and hares and crows fled before wolves, and wolves fled from men. She abandoned the cold white prize in the mud where she had dragged it, and ran, and felt no shame.  When morning came, the Hound did not need to shout at Arya or shake her awake. She had woken before him for a change, and even watered the horses. They broke their fast in silence, until Sandor said,  This thing about your mother…    It doesn’t matter,  Arya said in a dull voice.  I know she’s dead. I saw her in a dream.   The Hound looked at her a long time, then nodded. No more was said of it. They rode on toward the mountains.  In the higher hills, they came upon a tiny isolated village surrounded by grey-green sentinels and tall blue soldier pines, and Clegane decided to risk going in.  We need food,  he said,  and a roof over our heads. They’re not like to know what happened at the Twins, and with any luck they won’t know me.   The villagers were building a wooden palisade around their homes, and when they saw the breadth of the Hound’s shoulders they offered them food and shelter and even coin for work.  If there’s wine as well, I’ll do it,  he growled at them. In the end, he settled for ale, and drank himself to sleep each night.  His dream of selling Arya to Lady Arryn died there in the hills, though.  There’s frost above us and snow in the high passes,  the village elder said.  If you don’t freeze or starve, the shadowcats will get you, or the cave bears. There’s the clans as well. The Burned Men are fearless since Timett One-Eye came back from the war. And half a year ago, Gunthor son of Gurn led the Stone Crows down on a village not eight miles from here. They took every woman and every scrap of grain, and killed half the men. They have steel now, good swords and mail hauberks, and they watch the high road—the Stone Crows, the Milk Snakes, the Sons of the Mist, all of them. Might be you’d take a few with you, but in the end they’d kill you and make off with your daughter.   I’m not his daughter, Arya might have shouted, if she hadn’t felt so tired. She was no one’s daughter now. She was no one. Not Arya, not Weasel, not Nan nor Arry nor Squab, not even Lumpyhead. She was only some girl who ran with a dog by day, and dreamed of wolves by night.  It was quiet in the village. They had beds stuffed with straw and not too many lice, the food was plain but filling, and the air smelled of pines. All the same, Arya soon decided that she hated it. The villagers were cowards."
}