{
  "id": "ef82c6dd37796aacfc05b5e3047fccdfb50ed069",
  "text": "   I do not mean to frighten you, but neither will I lie to you. We have come to a dark dangerous place, child. This is not Winterfell. We have enemies who mean us ill. We cannot fight a war among ourselves. This willfulness of yours, the running off, the angry words, the disobedience… at home, these were only the summer games of a child. Here and now, with winter soon upon us, that is a different matter. It is time to begin growing up.    I will,  Arya vowed. She had never loved him so much as she did in that instant.  I can be strong too. I can be as strong as Robb.   He held Needle out to her, hilt first.  Here.   She looked at the sword with wonder in her eyes. For a moment she was afraid to touch it, afraid that if she reached for it it would be snatched away again, but then her father said,  Go on, it’s yours,  and she took it in her hand.   I can keep it?  she said.  For true?    For true.  He smiled.  If I took it away, no doubt I’d find a morningstar hidden under your pillow within the fortnight. Try not to stab your sister, whatever the provocation.    I won’t. I promise.  Arya clutched Needle tightly to her chest as her father took his leave.  The next morning, as they broke their fast, she apologized to Septa Mordane and asked for her pardon. The septa peered at her suspiciously, but Father nodded.  Three days later, at midday, her father’s steward Vayon Poole sent Arya to the Small Hall. The trestle tables had been dismantled and the benches shoved against the walls. The hall seemed empty, until an unfamiliar voice said,  You are late, boy.  A slight man with a bald head and a great beak of a nose stepped out of the shadows, holding a pair of slender wooden swords.  Tomorrow you will be here at midday.  He had an accent, the lilt of the Free Cities, Braavos perhaps, or Myr.   Who are you?  Arya asked.   I am your dancing master.  He tossed her one of the wooden blades. She grabbed for it, missed, and heard it clatter to the floor.  Tomorrow you will catch it. Now pick it up.   It was not just a stick, but a true wooden sword complete with grip and guard and pommel. Arya picked it up and clutched it nervously with both hands, holding it out in front of her. It was heavier than it looked, much heavier than Needle.  The bald man clicked his teeth together.  That is not the way, boy. This is not a greatsword that is needing two hands to swing it. You will take the blade in one hand.    It’s too heavy,  Arya said.   It is heavy as it needs to be to make you strong, and for the balancing. A hollow inside is filled with lead, just so. One hand now is all that is needing.   Arya took her right hand off the grip and wiped her sweaty palm on her pants. She held the sword in her left hand. He seemed to approve.  The left is good. All is reversed, it will make your enemies more awkward. Now you are standing wrong. Turn your body sideface, yes, so. You are skinny as the shaft of a spear, do you know. That is good too, the target is smaller. Now the grip. Let me see.  He moved closer and peered at her hand, prying her fingers apart, rearranging them.  Just so, yes. Do not squeeze it so tight, no, the grip must be deft, delicate.    What if I drop it?  Arya said.   The steel must be part of your arm,  the bald man told her.  Can you drop part of your arm? No. Nine years Syrio Forel was first sword to the Sealord of Braavos, he knows these things. Listen to him, boy.   It was the third time he had called her  boy.   I’m a girl,  Arya objected.   Boy, girl,  Syrio Forel said.  You are a sword, that is all.  He clicked his teeth together.  Just so, that is the grip. You are not holding a battle-axe, you are holding a—    —needle,  Arya finished for him, fiercely.   Just so. Now we will begin the dance. Remember, child, this is not the iron dance of Westeros we are learning, the knight’s dance, hacking and hammering, no. This is the bravo’s dance, the water dance, swift and sudden. All men are made of water, do you know this? When you pierce them, the water leaks out and they die.  He took a step backward, raised his own wooden blade.  Now you will try to strike me.   Arya tried to strike him. She tried for four hours, until every muscle in her body was sore and aching, while Syrio Forel clicked his teeth together and told her what to do.  The next day their real work began.      DAENERYS   The Dothraki sea,  Ser Jorah Mormont said as he reined to a halt beside her on the top of the ridge. beneath them, the plain stretched out immense and empty, a vast flat expanse that reached to the distant horizon and beyond. It was a sea, Dany thought. Past here, there were no hills, no mountains, no trees nor cities nor roads, only the endless grasses, the tall blades rippling like waves when the winds blew.  It’s so green,  she said.   Here and now,  Ser Jorah agreed.  You ought to see it when it blooms, all dark red flowers from horizon to horizon, like a sea of blood. Come the dry season, and the world turns the color of old bronze."
}