{
  "id": "effdbb747bcf52ab3265969a55b151a06c0fe08e",
  "text": " Lord Jason will take you back to your ship when we are done. Pray wait outside.    That I will, Your Grace. That I will.   No sooner had he left the king’s pavilion than the Greatjon began to laugh, but Robb silenced him with a look.  Euron Greyjoy is no man’s notion of a king, if half of what Theon said of him was true. Theon is the rightful heir, unless he’s dead… but Victarion commands the Iron Fleet. I can’t believe he would remain at Moat Cailin while Euron Crow’s Eye holds the Seastone Chair. He has to go back.    There’s a daughter as well,  Galbart Glover reminded him.  The one who holds Deepwood Motte, and Robett’s wife and child.    If she stays at Deepwood Motte that’s all she can hope to hold,  said Robb.  What’s true for the brothers is even more true for her. She will need to sail home to oust Euron and press her own claim.  Her son turned to Lord Jason Mallister.  You have a fleet at Seagard?    A fleet, Your Grace? Half a dozen longships and two war galleys. Enough to defend my own shores against raiders, but I could not hope to meet the Iron Fleet in battle.    Nor would I ask it of you. The ironborn will be setting sail toward Pyke, I expect. Theon told me how his people think. Every captain a king on his own deck. They will all want a voice in the succession. My lord, I need two of your longships to sail around the Cape of Eagles and up the Neck to Greywater Watch.   Lord Jason hesitated.  A dozen streams drain the wetwood, all shallow, silty, and uncharted. I would not even call them rivers. The channels are ever drifting and changing. There are endless sandbars, deadfalls, and tangles of rotting trees. And Greywater Watch moves. How are my ships to find it?    Go upriver flying my banner. The crannogmen will find you. I want two ships to double the chances of my message reaching Howland Reed. Lady Maege shall go on one, Galbart on the second.  He turned to the two he’d named.  You’ll carry letters for those lords of mine who remain in the north, but all the commands within will be false, in case you have the misfortune to be taken. If that happens, you must tell them that you were sailing for the north. Back to Bear Island, or for the Stony Shore.  He tapped a finger on the map.  Moat Cailin is the key. Lord Balon knew that, which is why he sent his brother Victarion there with the hard heart of the Greyjoy strength.    Succession squabbles or no, the ironborn are not such fools as to abandon Moat Cailin,  said Lady Maege.   No,  Robb admitted.  Victarion will leave the best part of his garrison, I’d guess. Every man he takes will be one less man we need to fight, however. And he will take many of his captains, count on that. The leaders. He will need such men to speak for him if he hopes to sit the Seastone Chair.    You cannot mean to attack up the causeway, Your Grace,  said Galbart Glover.  The approaches are too narrow. There is no way to deploy. No one has ever taken the Moat.    From the south,  said Robb.  But if we can attack from the north and west simultaneously, and take the ironmen in the rear while they are beating off what they think is my main thrust up the causeway, then we have a chance. Once I link up with Lord Bolton and the Freys, I will have more than twelve thousand men. I mean to divide them into three battles and start up the causeway a half-day apart. If the Greyjoys have eyes south of the Neck, they will see my whole strength rushing headlong at Moat Cailin.   Roose Bolton will have the rearguard, while I command the center. Greatjon, you shall lead the van against Moat Cailin. Your attack must be so fierce that the ironborn have no leisure to wonder if anyone is creeping down on them from the north.   The Greatjon chuckled.  Your creepers best come fast, or my men will swarm those walls and win the Moat before you show your face. I’ll make a gift of it to you when you come dawdling up.    That’s a gift I should be glad to have,  said Robb.  Edmure was frowning.  You talk of attacking the ironmen in the rear, sire, but how do you mean to get north of them?    There are ways through the Neck that are not on any map, Uncle. Ways known only to the crannogmen—narrow trails between the bogs, and wet roads through the reeds that only boats can follow.  He turned to his two messengers.  Tell Howland Reed that he is to send guides to me, two days after I have started up the causeway. To the center battle, where my own standard flies. Three hosts will leave the Twins, but only two will reach Moat Cailin. Mine own battle will melt away into the Neck, to reemerge on the Fever. If we move swiftly once my uncle’s wed, we can all be in position by year’s end. We will fall upon the Moat from three sides on the first day of the new century, as the ironmen are waking with hammers beating at their heads from the mead they’ll quaff the night before.    I like this plan,  said the Greatjon.  I like it well.   Galbart Glover rubbed his mouth.  There are risks. If the crannogmen should fail you…    We will be no worse than before."
}