{
  "id": "f14ae5a9f556380e0740ac5eb6ccbe8d391d2874",
  "text": " A  gleam of firelight came from the open doors, and soft lights were glowing in  many windows. Bilbo  huddled in a cloak stood silent  on the doorstep beside  Frodo.  Aragorn sat with his head bowed to his knees; only Elrond knew fully  what this hour meant to him. The others could be seen as grey  shapes in the  darkness.        Sam was  standing by the  pony, sucking  his teeth, and staring moodily  into  the  gloom  where  the  river  roared  stonily below;  his  desire for   adventure was at its lowest ebb.       `Bill,  my lad,' he said,  `you oughtn't to have took up  with us.  You   could have stayed here and et the best hay  till the  new grass comes.' Bill  swished his tail and said nothing.       Sam  eased the pack on  his shoulders, and  went over anxiously  in his  mind all the things that he had stowed in it,  wondering if he had forgotten  anything: his chief treasure, his cooking gear; and the  little  box of salt  that he  always carried  and  refilled  when he  could;  a  good  supply  of  pipe-weed (but not near enough,  I'll  warrant); flint  and tinder;  woollen  hose:  linen;  various  small  belongings  of his  master's that  Frodo  had  forgotten and Sam had  stowed to  bring them out in  triumph when they  were  called for. He went through them all.       'Rope!'  he  muttered. `No  rope!  And  only  last night  you  said  to  yourself: \"Sam, what about a bit of rope? You'll want it, if you haven't got  it:\" Well, I'll wa nt it. I can't get it now.'       At that moment Elrond came out with  Gandalf, and he called the Company  to him. 'This is my last  word,' he said in a low voice. 'The Ring-bearer is  setting  out on the Quest  of  Mount Doom. On him  alone is any charge laid:  neither to cast away the Ring, nor to deliver it to any servant of the Enemy  nor  indeed to  let any  handle  it,  save  members of  the Company  and the  Council,  and  only then in  gravest need. The others  go  with him  as free  companions,  to help him on his way.  You may tarry,  or come back, or  turn   ####-aside into other paths, as chance allows. The further you  go, the less easy  will it be  to  withdraw; yet  no oath or bond is  laid on you to go further   than you will. For you do not yet know the strength of  your hearts, and you   cannot foresee what each may meet upon the road.'       `Faithless is he that says farewell when the road darkens,' said Gimli.       'Maybe,' said Elrond, `but let him not vow to walk in the dark, who has  not seen the nightfall. '       'Yet sworn word may strengthen quaking heart,' said Gimli.       `Or  break it,' said Elrond. `Look  not too far ahead! But  go now with  good hearts!  Farewell, and may the  blessing of Elves and Men and  all Free  Folk go with you. May the stars shine upon your faces!'       'Good . . . good luck!' cried Bilbo, stuttering with the cold. 'I don't  suppose you will be able to keep a diary, Frodo my lad, but I shall expect a   full account when you get back. And don't be too long! Farewell!'       Many other s of Elrond's household stood in the shadows and watched them  go, bidding them farewell  with soft  voices. There was no laughter, and  no   song or music. At last they turned away and faded silently into the dusk.       They crossed  the bridge and wound slowly up the long steep paths  that  led out of the cloven vale of Rivendell; and they came at length to the high  moor where the wind hissed through the  heather. Then with one glance at the  Last Homely House twinkling below them they strode away far into the night.       At  the  Ford of Bruinen they left the Road and turning southwards went  on  by  narrow paths  among the folded lands. Their purpose was to hold this  course west of the Mountains  for many  miles and days. The country was  much  rougher  and  mor e barren  than  in  the  green vale of the  Great River  in  Wilderland  on the other side of the range,  and  their going would be slow;   but  they hoped  in  this way to  escape the notice of unfriendly  eyes. The  spies of Sauron had hitherto seldom been seen in this empty country, and the  paths were little known except to the people of Rivendell.        Gandalf walked in front, and with him went Aragorn, who knew this  land  even  in the dark.  The  others were in file behind, and  Legolas whose eyes  were keen was the rearguard.  The first  part of their  journey was hard and  dreary, and Frodo remembered little  of it, save the wind. For many  sunless  days an icy blast came from the Mountains in the east, and no garment seemed  able  to keep out its searching fingers.  Though the Company was  well clad,  they  seldom felt warm, either moving or at rest. They slept uneasily during   ####-the middle of  the day,  in some  hollow of the land,  or  hidden under  the  tangled  thorn-bushes  that  grew in  thickets in many places. In  the  late  afternoon they were roused by the watch, and took their chief meal: cold and  cheerless as  a rule, for they could seldom risk the lighting of a  fire."
}