{
  "id": "f187c5efee07da1dd9035ef982aa627bd2ba10b2",
  "text": "   Robb could not deny the sense of that. Yet all the same, he resents me for it, Catelyn thought wearily. He misses Jeyne already, and some part of him blames me for her absence, though he knows it was good counsel.  Of the six Westerlings who had come with her son from the Crag, only one remained by his side; Ser Raynald, Jeyne’s brother, the royal banner-bearer. Robb had dispatched Jeyne’s uncle Rolph Spicer to deliver young Martyn Lannister to the Golden Tooth the very day he received Lord Tywin’s assent to the exchange of captives. It was deftly done. Her son was relieved of his fear for Martyn’s safety, Galbart Glover was relieved to hear that his brother Robett had been put on a ship at Duskendale, Ser Rolph had important and honorable employment… and Grey Wind was at the king’s side once more. Where he belongs.  Lady Westerling had remained at Riverrun with her children; Jeyne, her little sister Eleyna, and young Rollam, Robb’s squire, who complained bitterly about being left. Yet that was wise as well. Olyvar Frey had squired for Robb previously, and would doubtless be present for his sister’s wedding; to parade his replacement before him would be as unwise as it was unkind. As for Ser Raynald, he was a cheerful young knight who swore that no insult of Walder Frey’s could possibly provoke him. And let us pray that insults are all we need to contend with.  Catelyn had her fears on that score, though. Her lord father had never trusted Walder Frey after the Trident, and she was ever mindful of that. Queen Jeyne would be safest behind the high, strong walls of Riverrun, with the Blackfish to protect her. Robb had even created him a new title, Warden of the Southern Marches. Ser Brynden would hold the Trident if any man could.  All the same, Catelyn would miss her uncle’s craggy face, and Robb would miss his counsel. Ser Brynden had played a part in every victory her son had won. Galbart Glover had taken command of the scouts and outriders in his place; a good man, loyal and steady, but without the Blackfish’s brilliance.  Behind Glover’s screen of scouts, Robb’s line of march stretched several miles. The Greatjon led the van. Catelyn traveled in the main column, surrounded by plodding warhorses with steelclad men on their backs. Next came the baggage train, a procession of wayns laden with food, fodder, camp supplies, wedding gifts, and the wounded too weak to walk, under the watchful eye of Ser Wendel Manderly and his White Harbor knights. Herds of sheep and goats and scrawny cattle trailed behind, and then a little tail of footsore camp followers. Even farther back was Robin Flint and the rearguard. There was no enemy in back of them for hundreds of leagues, but Robb would take no chances.  Thirty-five hundred they were, thirty-five hundred who had been blooded in the Whispering Wood, who had reddened their swords at the Battle of the Camps, at Oxcross, Ashemark, and the Crag, and all through the gold-rich hills of the Lannister west. Aside from her brother Edmure’s modest retinue of friends, the lords of the Trident had remained to hold the riverlands while the king retook the north. Ahead awaited Edmure’s bride and Robb’s next battle… and for me, two dead sons, an empty bed, and a castle full of ghosts. It was a cheerless prospect. Brienne, where are you? Bring my girls back to me, Brienne. Bring them back safe.  The drizzle that had sent them off turned into a soft steady rain by midday, and continued well past nightfall. The next day the northmen never saw the sun at all, but rode beneath leaden skies with their hoods pulled up to keep the water from their eyes. It was a heavy rain, turning roads to mud and fields to quagmires, swelling the rivers and stripping the trees of their leaves. The constant patter made idle chatter more bother than it was worth, so men spoke only when they had something to say, and that was seldom enough.   We are stronger than we seem, my lady,  Lady Maege Mormont said as they rode. Catelyn had grown fond of Lady Maege and her eldest daughter, Dacey; they were more understanding than most in the matter of Jaime Lannister, she had found. The daughter was tall and lean, the mother short and stout, but they dressed alike in mail and leather, with the black bear of House Mormont on shield and surcoat. By Catelyn’s lights, that was queer garb for a lady, yet Dacey and Lady Maege seemed more comfortable, both as warriors and as women, than ever the girl from Tarth had been.   I have fought beside the Young Wolf in every battle,  Dacey Mormont said cheerfully.  He has not lost one yet.   No, but he has lost everything else, Catelyn thought, but it would not do to say it aloud. The northmen did not lack for courage, but they were far from home, with little enough to sustain them but for their faith in their young king. That faith must be protected, at all costs. I must be stronger, she told herself. I must be strong for Robb. If I despair, my grief will consume me. Everything would turn on this marriage."
}