{
  "id": "f2f17c9792891b4eb06a9ae567a8cf0f2bd0c336",
  "text": "  He was making the same sort of screechy noises that the merpeople made when they were above water; clearly, Dumbledore could speak Mermish.  Finally he straightened up, turned to his fellow judges, and said, \"A conference before we give the marks, I think.\" The judges went into a huddle.  Madam Pomfrey had gone to rescue Ron from Percy's clutches; she led him over to Harry and the others, gave him a blanket and some Pepperup Potion, then went to fetch Fleur and her sister.  Fleur had many cuts on her face and arms and her robes were torn, but she didn't seem to care, nor would she allow Madam Pomfrey to clean them. \"Look after Gabrielle,\" she told her, and then she turned to Harry.  \"You saved 'er,\" she said breathlessly.  \"Even though she was not your 'ostage.\" \"Yeah,\" said Harry, who was now heartily wishing he'd left all three girls tied to the statue. Fleur bent down, kissed Harry twice on each cheek (he felt his face burn and wouldn't have been surprised if steam was coming out of his ears again), then said to Ron, \"And you too-you 'elped -\" \"Yeah,\" said Ron, looking extremely hopeful, \"yeah, a bit -\" Fleur swooped down on him too and kissed him. Hermione looked simply furious, but just then, Ludo Bagman's magically magnified voice boomed out beside them, making them all jump, and causing the crowd in the stands to go very quiet. \"Ladies and gentlemen, we have reached our decision.  Merchieftainess Murcus has told us exactly what happened at the bottom of the lake, and we have therefore decided to award marks out of fifty for each of the champions, as follows. . . . \"Fleur Delacour, though she demonstrated excellent use of the Bubble-Head Charm, was attacked by grindylows as she approached her goal, and failed to retrieve her hostage.  We award her twenty-five points.\" Applause from the stands. \"I deserved zero,\" said Fleur throatily, shaking her magnificent head. \"Cedric Diggory, who also used the Bubble-Head Charm, was first to return with his hostage, though he returned one minute outside the time limit of an hour.\"  Enormous cheers from the Hufflepuffs in the crowd; Harry saw Cho give Cedric a glowing look.  \"We therefore award him forty-seven points.\" Harrys heart sank. If Cedric had been outside the time limit, he most certainly had been. \"Viktor Krum used an incomplete form of Transfiguration, which was nevertheless effective, and was second to return with his hostage.  We award him forty points.\" Karkaroff clapped particularly hard, looking very superior. \"Harry Potter used gillyweed to great effect,\" Bagman continued.  \"He returned last, and well outside the time limit of an hour.  However, the Merchieftainess informs us that Mr. Potter was first to reach the hostages, and that the delay in his return was due to his determination to return all hostages to safety, not merely his own.\" Ron and Hermione both gave Harry half-exasperated, half-commiserating looks. \"Most of the judges,\" and here, Bagman gave Karkaroff a very nasty look, \"feel that this shows moral fiber and merits full marks.  However . . . Mr. Potter's score is forty-five points.\" Harry's stomach leapt - he was now tying for first place with Cedric.  Ron and Hermione, caught by surprise, stared at Harry, then laughed and started applauding hard with the rest of the crowd. \"There you go. Harry!\" Ron shouted over the noise.  \"You weren't being thick after all - you were showing moral fiber!\" Fleur was clapping very hard too, but Krum didn't look happy at all.  He attempted to engage Hermione in conversation again, but she was too busy cheering Harry to listen. \"The third and final task will take place at dusk on the twenty-fourth of June,\" continued Bagman. \"The champions will be notified of what is coming precisely one month beforehand. Thank you all for your support of the champions.\" It was over.  Harry thought dazedly, as Madam Pomfrey began herding the champions and hostages back to the castle to get into dry clothes ... it was over, he had got through ... he didn't have to worry about anything now until June the twenty-fourth. . .. Next time he was in Hogsmeade, Harry decided as he walked back up the stone steps into the castle, he was going to buy Dobby a pair of socks for every day of the year.    CHAPTER TWENTY-SEVEN - PADFOOT RETURNS  One of the best things about the aftermath of the second task was that everybody was very keen to hear details of what had happened down in the lake, which meant that Ron was getting to share Harry's limelight for once.  Harry noticed that Ron's version of events changed subtly with every retelling.  At first, he gave what seemed to be the truth; it tallied with Hermione's story, anyway - Dumbledore had put all the hostages into a bewitched sleep in Professor McGonagall's office, first assuring them that they would be quite safe, and would awake when they were back above the water.  One week later, however, Ron was telling a thrilling tale of kidnap in which he struggled single-handedly against fifty heavily armed merpeople who had to beat him into submission before tying him up."
}