{
  "id": "f4f3bb780d978465e5cf30403e259a0b5aeef23a",
  "text": "   Lord Tywin and his knights have grooms and squires to tend their horses, they don’t need the likes of you,  Goodwife Amabel said.  The kitchens are snug and clean, and there’s always a warm fire to sleep by and plenty to eat. You might have done well there, but I can see you’re not a clever girl. Harra, I believe we should give this one to Weese.    If you think so, Amabel.  They gave her a shift of grey roughspun wool and a pair of ill-fitting shoes, and sent her off.  Weese was understeward for the Wailing Tower, a squat man with a fleshy carbuncle of a nose and a nest of angry red boils near one corner of his plump lips. Arya was one of six sent to him. He looked them all over with a gimlet eye.  The Lannisters are generous to those as serve them well, an honor none of your sort deserve, but in war a man makes do with what’s to hand. Work hard and mind your place and might be one day you’ll rise as high as me. If you think to presume on his lordship’s kindness, though, you’ll find me waiting after m’lord has gone, y’see.  He strutted up and down before them, telling them how they must never look the highborn in the eye, nor speak until spoken to, nor get in his lordship’s way.  My nose never lies,  he boasted.  I can smell defiance, I can smell pride, I can smell disobedience. I catch a whiff of any such stinks, you’ll answer for it. When I sniff you, all I want to smell is fear.       DAENERYS  On the walls of Qarth, men beat gongs to herald her coming, while others blew curious horns that encircled their bodies like great bronze snakes. A column of camelry emerged from the city as her honor guards. The riders wore scaled copper armor and snouted helms with copper tusks and long black silk plumes, and sat high on saddles inlaid with rubies and garnets. Their camels were dressed in blankets of a hundred different hues.   Qarth is the greatest city that ever was or ever will be,  Pyat Pree had told her, back amongst the bones of Vaes Tolorro.  It is the center of the world, the gate between north and south, the bridge between east and west, ancient beyond memory of man and so magnificent that Saathos the Wise put out his eyes after gazing upon Qarth for the first time, because he knew that all he saw thereafter should look squalid and ugly by comparison.   Dany took the warlock’s words well salted, but the magnificence of the great city was not to be denied. Three thick walls encircled Qarth, elaborately carved. The outer was red sandstone, thirty feet high and decorated with animals: snakes slithering, kites flying, fish swimming, intermingled with wolves of the red waste and striped zorses and monstrous elephants. The middle wall, forty feet high, was grey granite alive with scenes of war: the clash of sword and shield and spear, arrows in flight, heroes at battle and babes being butchered, pyres of the dead. The innermost wall was fifty feet of black marble, with carvings that made Dany blush until she told herself that she was being a fool. She was no maid; if she could look on the grey wall’s scenes of slaughter, why should she avert her eyes from the sight of men and women giving pleasure to one another?  The outer gates were banded with copper, the middle with iron; the innermost were studded with golden eyes. All opened at Dany’s approach. As she rode her silver into the city, small children rushed out to scatter flowers in her path. They wore golden sandals and bright paint, no more.  All the colors that had been missing from Vaes Tolorro had found their way to Qarth; buildings crowded about her fantastical as a fever dream in shades of rose, violet, and umber. She passed under a bronze arch fashioned in the likeness of two snakes mating, their scales delicate flakes of jade, obsidian, and lapis lazuli. Slim towers stood taller than any Dany had ever seen, and elaborate fountains filled every square, wrought in the shapes of griffins and dragons and manticores.  The Qartheen lined the streets and watched from delicate balconies that looked too frail to support their weight. They were tall pale folk in linen and samite and tiger fur, every one a lord or lady to her eyes. The women wore gowns that left one breast bare, while the men favored beaded silk skirts. Dany felt shabby and barbaric as she rode past them in her lionskin robe with black Drogon on one shoulder. Her Dothraki called the Qartheen  Milk Men  for their paleness, and Khal Drogo had dreamed of the day when he might sack the great cities of the east. She glanced at her bloodriders, their dark almond-shaped eyes giving no hint of their thoughts. Is it only the plunder they see? she wondered. How savage we must seem to these Qartheen.  Pyrat Pree conducted her little khalasar down the center of a great arcade where the city’s ancient heroes stood thrice life-size on columns of white and green marble. They passed through a bazaar in a cavernous building whose latticework ceiling was home to a thousand gaily colored birds. Trees and flowers bloomed on the terraced walls above the stalls, while below it seemed as if everything the gods had put into the world was for sale."
}