{
  "id": "f5844599328777f0869829ca95a510c5fbe86686",
  "text": " Sansa lifted her head and walked toward him, not too slow and not too fast. She must not let them see how nervous she was.   The Lady Sansa, of House Stark,  the herald cried.  She stopped under the throne, at the spot where Ser Barristan’s white cloak lay puddled on the floor beside his helm and breastplate.  Do you have some business for king and council, Sansa?  the queen asked from the council table.   I do.  She knelt on the cloak, so as not to spoil her gown, and looked up at her prince on his fearsome black throne.  As it please Your Grace, I ask mercy for my father, Lord Eddard Stark, who was the Hand of the King.  She had practiced the words a hundred times.  The queen sighed.  Sansa, you disappoint me. What did I tell you about traitor’s blood?    Your father has committed grave and terrible crimes, my lady,  Grand Maester Pycelle intoned.   Ah, poor sad thing,  sighed Varys.  She is only a babe, my lords, she does not know what she asks.   Sansa had eyes only for Joffrey. He must listen to me, he must, she thought. The king shifted on his seat,  Let her speak,  he commanded.  I want to hear what she says.    Thank you, Your Grace.  Sansa smiled, a shy secret smile, just for him. He was listening. She knew he would.   Treason is a noxious weed,  Pycelle declared solemnly.  It must be torn up, root and stem and seed, lest new traitors sprout from every roadside.    Do you deny your father’s crime?  Lord Baelish asked.   No, my lords.  Sansa knew better than that.  I know he must be punished. All I ask is mercy. I know my lord father must regret what he did. He was King Robert’s friend and he loved him, you all know he loved him. He never wanted to be Hand until the king asked him. They must have lied to him. Lord Renly or Lord Stannis or… or somebody, they must have lied, otherwise…   King Joffrey leaned forward, hands grasping the arms of the throne. Broken sword points fanned out between his fingers.  He said I wasn’t the king. Why did he say that?    His leg was broken,  Sansa replied eagerly.  It hurt ever so much, Maester Pycelle was giving him milk of the poppy, and they say that milk of the poppy fills your head with clouds. Otherwise he would never have said it.   Varys said,  A child’s faith… such sweet innocence… and yet, they say wisdom oft comes from the mouths of babes.    Treason is treason,  Pycelle replied at once.  Joffrey rocked restlessly on the throne.  Mother?   Cersei Lannister considered Sansa thoughtfully.  If Lord Eddard were to confess his crime,  she said at last,  we would know he had repented his folly.   Joffrey pushed himself to his feet. Please, Sansa thought, please, please, be the king I know you are, good and kind and noble, please.  Do you have any more to say?  he asked her.   Only… that as you love me, you do me this kindness, my prince,  Sansa said.  King Joffrey looked her up and down.  Your sweet words have moved me,  he said gallantly, nodding, as if to say all would be well.  I shall do as you ask… but first your father has to confess. He has to confess and say that I’m the king, or there will be no mercy for him.    He will,  Sansa said, heart soaring.  Oh, I know he will.       EDDARD  The straw on the floor stank of urine. There was no window, no bed, not even a slop bucket. He remembered walls of pale red stone festooned with patches of nitre, a grey door of splintered wood, four inches thick and studded with iron. He had seen them, briefly, a quick glimpse as they shoved him inside. Once the door had slammed shut, he had seen no more. The dark was absolute. He had as well been blind.  Or dead. Buried with his king.  Ah, Robert,  he murmured as his groping hand touched a cold stone wall, his leg throbbing with every motion. He remembered the jest the king had shared in the crypts of Winterfell, as the Kings of Winter looked on with cold stone eyes. The king eats, Robert had said, and the Hand takes the shit. How he had laughed. Yet he had gotten it wrong. The king dies, Ned Stark thought, and the Hand is buried.  The dungeon was under the Red Keep, deeper than he dared imagine. He remembered the old stories about Maegor the Cruel, who murdered all the masons who labored on his castle, so they might never reveal its secrets.  He damned them all: Littlefinger, Janos Slynt and his gold cloaks, the queen, the Kingslayer, Pycelle and Varys and Ser Barristan, even Lord Renly, Robert’s own blood, who had run when he was needed most. Yet in the end he blamed himself.  Fool,  he cried to the darkness,  thrice-damned blind fool.   Cersei Lannister’s face seemed to float before him in the darkness. Her hair was full of sunlight, but there was mockery in her smile.  When you play the game of thrones, you win or you die,  she whispered. Ned had played and lost, and his men had paid the price of his folly with their life’s blood.  When he thought of his daughters, he would have wept gladly, but the tears would not come. Even now, he was a Stark of Winterfell, and his grief and his rage froze hard inside him."
}