{
  "id": "f5f870fbcfecd82ec122a38bb00ae3bfac3123b7",
  "text": " His buttons were carved jade monkeys, and atop his wispy white curls perched a jaunty green cap decorated with a fan of peacock feathers.  Davos threaded his way through the tables to a chair. In the days before his knighthood, he had often bought cargoes from Salladhor Saan. The Lyseni was a smuggler himself, as well as a trader, a banker, a notorious pirate, and the self-styled Prince of the Narrow Sea. When a pirate grows rich enough, they make him a prince. It had been Davos who had made the journey to Lys to recruit the old rogue to Lord Stannis’s cause.   You did not see the gods burn, my lord?  he asked.   The red priests have a great temple on Lys. Always they are burning this and burning that, crying out to their R’hllor. They bore me with their fires. Soon they will bore King Stannis too, it is to be hoped.  He seemed utterly unconcerned that someone might overhear him, eating his grapes and dribbling the seeds out onto his lip, flicking them off with a finger.  My Bird of a Thousand Colors came in yesterday, good ser. She is not a warship, no, but a trader, and she paid a call on King’s Landing. Are you sure you will not have a grape? Children go hungry in the city, it is said.  He dangled the grapes before Davos and smiled.   It’s ale I need, and news.    The men of Westeros are ever rushing,  complained Salladhor Saan.  What good is this, I ask you? He who hurries through life hurries to his grave.  He belched.  The Lord of Casterly Rock has sent his dwarf to see to King’s Landing. Perhaps he hopes that his ugly face will frighten off attackers, eh? Or that we will laugh ourselves dead when the Imp capers on the battlements, who can say? The dwarf has chased off the lout who ruled the gold cloaks and put in his place a knight with an iron hand.  He plucked a grape, and squeezed it between thumb and forefinger until the skin burst. juice ran down between his fingers.  A serving girl pushed her way through, swatting at the hands that groped her as she passed. Davos ordered a tankard of ale, turned back to Saan, and said,  How well is the city defended?   The other shrugged.  The walls are high and strong, but who will man them? They are building scorpions and spitfires, oh, yes, but the men in the golden cloaks are too few and too green, and there are no others. A swift strike, like a hawk plummeting at a hare, and the great city will be ours. Grant us wind to fill our sails, and your king could sit upon his Iron Throne by evenfall on the morrow. We could dress the dwarf in motley and prick his little cheeks with the points of our spears to make him dance for us, and mayhaps your goodly king would make me a gift of the beautiful Queen Cersei to warm my bed for a night. I have been too long away from my wives, and all in his service.    Pirate,  said Davos.  You have no wives, only concubines, and you have been well paid for every day and every ship.    Only in promises,  said Salladhor Saan mournfully.  Good ser, it is gold I crave, not words on papers.  He popped a grape into his mouth.   You’ll have your gold when we take the treasury in King’s Landing. No man in the Seven Kingdoms is more honorable than Stannis Baratheon. He will keep his word.  Even as Davos spoke, he thought, This world is twisted beyond hope, when lowborn smugglers must vouch for the honor of kings.   So he has said and said. And so I say, let us do this thing. Even these grapes could be no more ripe than that city, my old friend.   The serving girl returned with his ale. Davos gave her a copper.  Might be we could take King’s Landing, as you say,  he said as he lifted the tankard,  but how long would we hold it? Tywin Lannister is known to be at Harrenhal with a great host, and Lord Renly…    Ah, yes, the young brother,  said Salladhor Saan.  That part is not so good, my friend. King Renly bestirs himself. No, here he is Lord Renly, my pardons. So many kings, my tongue grows weary of the word. The brother Renly has left Highgarden with his fair young queen, his flowered lords and shining knights, and a mighty host of foot. He marches up your road of roses toward the very same great city we were speaking of.    He takes his bride?   The other shrugged.  He did not tell me why. Perhaps he is loath to part with the warm burrow between her thighs, even for a night. Or perhaps he is that certain of his victory.    The king must be told.    I have attended to it, good ser. Though His Grace frowns so whenever he does see me that I tremble to come before him. Do you think he would like me better if I wore a hair shirt and never smiled? Well, I will not do it. I am an honest man, he must suffer me in silk and samite. Or else I shall take my ships where I am better loved. That sword was not Lightbringer, my friend.   The sudden shift in subject left Davos uneasy.  Sword?    A sword plucked from fire, yes. Men tell me things, it is my pleasant smile. How shall a burnt sword serve Stannis?    A burning sword,  corrected Davos.   Burnt,  said Salladhor Saan,  and be glad of that, my friend."
}