{
  "id": "f614680968d22de3f92f745d42738ba652579671",
  "text": "   I don’t know about fish.  Arya tugged at the Weasel’s matted hair, thinking it might be best to hack it off.  There’s crows down by the water. Something’s dead there.    Fish, washed up on shore,  Hot Pie said.  If the crows eat it, I bet we could.    We should catch some crows, we could eat them,  said Lommy.  We could make a fire and roast them like chickens.   Gendry looked fierce when he scowled. His beard had grown in thick and black as briar.  I said, no fires.    Lommy’s hungry,  Hot Pie whined,  and I am too.    We’re all hungry,  said Arya.   You’re not,  Lommy spat from the ground.  Worm breath.   Arya could have kicked him in his wound.  I said I’d dig worms for you too, if you wanted.   Lommy made a disgusted face.  If it wasn’t for my leg, I’d hunt us some boars.    Some boars,  she mocked.  You need a boarspear to hunt boars, and horses and dogs, and men to flush the boar from its lair.  Her father had hunted boar in the wolfswood with Robb and Jon. Once he even took Bran, but never Arya, even though she was older. Septa Mordane said boar hunting was not for ladies, and Mother only promised that when she was older she might have her own hawk. She was older now, but if she had a hawk she’d eat it.   What do you know about hunting boars?  said Hot Pie.   More than you.   Gendry was in no mood to hear it.  Quiet, both of you, I need to think what to do.  He always looked pained when he tried to think, like it hurt him something fierce.   Yield,  Lommy said.   I told you to shut up about the yielding. We don’t even know who’s in there. Maybe we can steal some food.    Lommy could steal, if it wasn’t for his leg,  said Hot Pie.  He was a thief in the city.    A bad thief,  Arya said,  or he wouldn’t have got caught.   Gendry squinted up at the sun.  Evenfall will be the best time to sneak in. I’ll go scout come dark.    No, I’ll go,  Arya said.  You’re too noisy.   Gendry got that look on his face.  We’ll both go.    Arry should go,  said Lommy.  He’s sneakier than you are.    We’ll both go, I said.    But what if you don’t come back? Hot Pie can’t carry me by himself, you know he can’t…    And there’s wolves,  Hot Pie said.  I heard them last night, when I had the watch. They sounded close.   Arya had heard them too. She’d been asleep in the branches of an elm, but the howling had woken her. She’d sat awake for a good hour, listening to them, prickles creeping up her spine.   And you won’t even let us have a fire to keep them off,  Hot Pie said.  It’s not right, leaving us for the wolves.    No one is leaving you,  Gendry said in disgust.  Lommy has his spear if the wolves come, and you’ll be with him. We’re just going to go see, that’s all; we’re coming back.    Whoever it is, you should yield to them,  Lommy whined.  I need some potion for my leg, it hurts bad.    If we see any leg potion, we’ll bring it,  Gendry said.  Arry, let’s go, I want to get near before the sun is down. Hot Pie, you keep Weasel here, I don’t want her following.    Last time she kicked me.    I’ll kick you if you don’t keep her here.  Without waiting for an answer, Gendry donned his steel helm and walked off.  Arya had to scamper to keep up. Gendry was five years older and a foot taller than she was, and long of leg as well. For a while he said nothing, just plowed on through the trees with an angry look on his face, making too much noise. But finally he stopped and said,  I think Lommy’s going to die.   She was not surprised. Kurz had died of his wound, and he’d been a lot stronger than Lommy. Whenever it was Arya’s turn to help carry him, she could feel how warm his skin was, and smell the stink off his leg.  Maybe we could find a maester…    You only find maesters in castles, and even if we found one, he wouldn’t dirty his hands on the likes of Lommy.  Gendry ducked under a low-hanging limb.   That’s not true.  Maester Luwin would have helped anyone who came to him, she was certain.   He’s going to die, and the sooner he does it, the better for the rest of us. We should just leave him, like he says. If it was you or me hurt, you know he’d leave us.  They scrambled down a steep cut and up the other side, using roots for handholds.  I’m sick of carrying him, and I’m sick of all his talk about yielding too. If he could stand up, I’d knock his teeth in. Lommy’s no use to anyone. That crying girl’s no use either.    You leave Weasel alone, she’s just scared and hungry is all.  Arya glanced back, but the girl was not following for once. Hot Pie must have grabbed her, like Gendry had told him.   She’s no use,  Gendry repeated stubbornly.  Her and Hot Pie and Lommy, they’re slowing us down, and they’re going to get us killed. You’re the only one of the bunch who’s good for anything. Even if you are a girl.   Arya froze in her steps.  I’m not a girl!    Yes you are. Do you think I’m as stupid as they are?    No, you’re stupider. The Night’s Watch doesn’t take girls, everyone knows that.    That’s true. I don’t know why Yoren brought you, but he must have had some reason."
}