{
  "id": "f74165a030ea12707c0eaf87da1b1642d8e00d5b",
  "text": " 'Course, everyone gets scared when something like this happens in case You-Know-Who's behind it.\"  Harry turned this news over in his mind. He was starting to get a prickle of fear every time You- Know-Who was mentioned. He supposed this was all part of entering the magical world, but it had been a lot more comfortable saying \"Voldemort\" without worrying.  \"What's your Quidditch team?\" Ron asked.  \"Er -- I don't know any,\" Harry confessed.  \"What!\" Ron looked dumbfounded. \"Oh, you wait, it's the best game in the world --\" And he was off, explaining all about the four balls and the positions of the seven players, describing famous games he'd been to with his brothers and the broomstick he'd like to get if he had the money. He was just taking Harry through the finer points of the game when the compartment door slid open yet again, but it wasn't Neville the toadless boy, or Hermione Granger this time.  Three boys entered, and Harry recognized the middle one at once: it was the pale boy from Madam Malkin's robe shop. He was looking at Harry with a lot more interest than he'd shown back in Diagon Alley.  \"Is it true?\" he said. \"They're saying all down the train that Harry Potter's in this compartment. So it's you, is it?\"  \"Yes,\" said Harry. He was looking at the other boys. Both of them were thickset and looked extremely mean. Standing on either side of the pale boy, they looked like bodyguards.  \"Oh, this is Crabbe and this is Goyle,\" said the pale boy carelessly, noticing where Harry was looking. \"And my name's Malfoy, Draco Malfoy.\"  Ron gave a slight cough, which might have been hiding a snigget. Draco Malfoy looked at him.  \"Think my name's funny, do you? No need to ask who you are. My father told me all the Weasleys have red hair, freckles, and more children than they can afford.\"  He turned back to Harry. \"You'll soon find out some wizarding families are much better than others, Potter. You don't want to go making friends with the wrong sort. I can help you there.\"  He held out his hand to shake Harry's, but Harry didn't take it.  \"I think I can tell who the wrong sort are for myself, thanks,\" he said coolly.  Draco Malfoy didn't go red, but a pink tinge appeared in his pale cheeks.  \"I'd be careful if I were you, Potter,\" he said slowly. \"Unless you're a bit politer you'll go the same way as your parents. They didn't know what was good for them, either. You hang around with riffraff like the Weasleys and that Hagrid, and it'll rub off on you.\"  Both Harry and Ron stood up.  \"Say that again,\" Ron said, his face as red as his hair.  \"Oh, you're going to fight us, are you?\" Malfoy sneered.  \"Unless you get out now,\" said Harry, more bravely than he felt, because Crabbe and Goyle were a lot bigger than him or Ron.  \"But we don't feet like leaving, do we, boys? We've eaten all our food and you still seem to have some.\"  Goyle reached toward the Chocolate Frogs next to Ron - Ron leapt forward, but before he'd so much as touched Goyle, Goyle let out a horrible yell.  Scabbers the rat was hanging off his finger, sharp little teeth sunk deep into Goyle's knuckle - Crabbe and Malfoy backed away as Goyle swung Scabbers round and round, howling, and when Scabbets finally flew off and hit the window, all three of them disappeared at once. Perhaps they thought there were more rats lurking among the sweets, or perhaps they'd heard footsteps, because a second later, Hermione Granger had come in.  \"What has been going on?\" she said, looking at the sweets all over the floor and Ron picking up Scabbers by his tail.  I think he's been knocked out,\" Ron said to Harry. He looked closer at Scabbers. \"No -- I don't believe it -- he's gone back to sleep-\"  And so he had.  \"You've met Malfoy before?\"  Harry explained about their meeting in Diagon Alley.  \"I've heard of his family,\" said Ron darkly. \"They were some of the first to come back to our side after You-Know-Who disappeared. Said they'd been bewitched. My dad doesn't believe it. He says Malfoy's father didn't need an excuse to go over to the Dark Side.\" He turned to Hermione. \"Can we help you with something?\"  \"You'd better hurry up and put your robes on, I've just been up to the front to ask the conductor, and he says we're nearly there. You haven't been fighting, have you? You'll be in trouble before we even get there!\"  \"Scabbers has been fighting, not us,\" said Ron, scowling at her. \"Would you mind leaving while we change?\"  \"All right -- I only came in here because people outside are behaving very childishly, racing up and down the corridors,\" said Hermione in a sniffy voice. \"And you've got dirt on your nose, by the way, did you know?\"  Ron glared at her as she left. Harry peered out of the window. It was getting dark. He could see mountains and forests under a deep purple sky. The train did seem to be slowing down.  He and Ron took off their jackets and pulled on their long black robes. Ron's were a bit short for him, you could see his sneakers underneath them.  A voice echoed through the train: \"We will be reaching Hogwarts in five minutes' time."
}