{
  "id": "f7c3d4387618c60de34f1a7e477fd04ea554bdf4",
  "text": " Quiet as a shadow, she repeated, sliding forward, light as a feather.  When she was three steps away from him, the tomcat bolted. Left, then right, he went; and right, then left, went Arya, cutting off his escape. He hissed again and tried to dart between her legs. Quick as a snake, she thought. Her hands closed around him. She hugged him to her chest, whirling and laughing aloud as his claws raked at the front of her leather jerkin. Ever so fast, she kissed him right between the eyes, and jerked her head back an instant before his claws would have found her face. The tomcat yowled and spit.   What’s he doing to that cat?   Startled, Arya dropped the cat and whirled toward the voice. The tom bounded off in the blink of an eye. At the end of the alley stood a girl with a mass of golden curls, dressed as pretty as a doll in blue satin. Beside her was a plump little blond boy with a prancing stag sewn in pearls across the front of his doublet and a miniature sword at his belt. Princess Myrcella and Prince Tommen, Arya thought. A septa as large as a draft horse hovered over them, and behind her two big men in crimson cloaks, Lannister house guards.   What were you doing to that cat, boy?  Myrcella asked again, sternly. To her brother she said,  He’s a ragged boy, isn’t he? Look at him.  She giggled.   A ragged dirty smelly boy,  Tommen agreed.  They don’t know me, Arya realized. They don’t even know I’m a girl. Small wonder; she was barefoot and dirty, her hair tangled from the long run through the castle, clad in a jerkin ripped by cat claws and brown roughspun pants hacked off above her scabby knees. You don’t wear skirts and silks when you’re catching cats. Quickly she lowered her head and dropped to one knee. Maybe they wouldn’t recognize her. If they did, she would never hear the end of it. Septa Mordane would be mortified, and Sansa would never speak to her again from the shame.  The old fat septa moved forward.  Boy, how did you come here? You have no business in this part of the castle.    You can’t keep this sort out,  one of the red cloaks said.  Like trying to keep out rats.    Who do you belong to, boy?  the septa demanded.  Answer me. What’s wrong with you, are you mute?   Arya’s voice caught in her throat. If she answered, Tommen and Myrcella would know her for certain.   Godwyn, bring him here,  the septa said. The taller of the guardsmen started down the alley.  Panic gripped her throat like a giant’s hand. Arya could not have spoken if her life had hung on it. Calm as still water, she mouthed silently.  As Godwyn reached for her, Arya moved. Quick as a snake. She leaned to her left, letting his fingers brush her arm, spinning around him. Smooth as summer silk. By the time he got himself turned, she was sprinting down the alley. Swift as a deer. The septa was screeching at her. Arya slid between legs as thick and white as marble columns, bounded to her feet, bowled into Prince Tommen and hopped over him when he sat down hard and said  Oof,  spun away from the second guard, and then she was past them all, running full out.  She heard shouts, then pounding footsteps, closing behind her. She dropped and rolled. The red cloak went careening past her, stumbling. Arya sprang back to her feet. She saw a window above her, high and narrow, scarcely more than an arrow slit. Arya leapt, caught the sill, pulled herself up. She held her breath as she wriggled through. Slippery as an eel. Dropping to the floor in front of a startled scrubwoman, she hopped up, brushed the rushes off her clothes, and was off again, out the door and along a long hall, down a stair, across a hidden courtyard, around a corner and over a wall and through a low narrow window into a pitch-dark cellar. The sounds grew more and more distant behind her.  Arya was out of breath and quite thoroughly lost. She was in for it now if they had recognized her, but she didn’t think they had. She’d moved too fast. Swift as a deer.  She hunkered down in the dark against a damp stone wall and listened for the pursuit, but the only sound was the beating of her own heart and a distant drip of water. Quiet as a shadow, she told herself. She wondered where she was. When they had first come to King’s Landing, she used to have bad dreams about getting lost in the castle. Father said the Red Keep was smaller than Winterfell, but in her dreams it had been immense, an endless stone maze with walls that seemed to shift and change behind her. She would find herself wandering down gloomy halls past faded tapestries, descending endless circular stairs, darting through courtyards or over bridges, her shouts echoing unanswered. In some of the rooms the red stone walls would seem to drip blood, and nowhere could she find a window. Sometimes she would hear her father’s voice, but always from a long way off, and no matter how hard she ran after it, it would grow fainter and fainter, until it faded to nothing and Arya was alone in the dark.  It was very dark right now, she realized."
}