{
  "id": "f81741410ee02a28181826aa5ee2489bae1cab70",
  "text": " Harry moved the tip of his eagle-feather quill down the page, frowning as he looked for something that would help him write his essay, \"Witch Burning in the Fourteenth Century Was Completely Pointless discuss.\"  The quill paused at the top of a likely-looking paragraph. Harry Pushed his round glasses up the bridge of his nose, moved his flashlight closer to the book, and read:  Non-magic people (more commonly known as Muggles) were particularly afraid of magic in medieval times, but not very good at recognizing it. On the rare occasion that they did catch a real witch or wizard, burning had no effect whatsoever. The witch or wizard would perform a basic Flame Freezing Charm and then pretend to shriek with pain while enjoying a gentle, tickling sensation. Indeed, Wendelin the Weird enjoyed being burned so much that she allowed herself to be caught no less than fortyseven times in various disguises.  Harry put his quill between his teeth and reached underneath his pillow for his ink bottle and a roll of parchment. Slowly and very carefully he unscrewed the ink bottle, dipped his quill into it, and began to write, pausing every now and then to listen, because if any of the Dursleys heard the scratching of his quill on their way to the bathroom, he'd probably find himself locked in the cupboard under the stairs for the rest of the summer.  The Dursley family of number four, Privet Drive, was the reason that Harry never enjoyed his summer holidays. Uncle Vernon, Aunt Petunia, and their son, Dudley, were Harry's only living relatives. They were Muggles, and they had a very medieval attitude toward magic. Harry's dead parents, who had been a witch and wizard themselves, were never mentioned under the Dursleys' roof For years, Aunt Petunia and Uncle Vernon had hoped that if they kept Harry as downtrodden as possible, they would be able to squash the magic out of him. To their fury, they had been unsuccessful. These days they lived in terror of anyone finding out that Harry had spent most of the last two years at Hogwarts School of Witchcraft and Wizardry. The most they could do, however, was to lock away Harry's spellbooks, wand, cauldron, and broomstick at the start of the summer break, and forbid him to talk to the neighbors.  This separation from his spellbooks had been a real problem for Harry, because his teachers at Hogwarts had given him a lot of holiday work. One of the essays, a particularly nasty one about shrinking potions, was for Harry's least favorite teacher, Professor Snape, who would be delighted to have an excuse to give Harry detention for a month. Harry had therefore seized his chance in the first week of the holidays. While Uncle Vernon, Aunt Petunia, and Dudley had gone out into the front garden to admire Uncle Vernon's new company car (in very loud voices, so that the rest of the street would notice it too), Harry had crept downstairs, picked the lock on the cupboard under the stairs, grabbed some of his books, and hidden them in his bedroom. As long as he didn't leave spots of ink on the sheets, the Dursleys need never know that he was studying magic by night.  Harry was particularly keen to avoid trouble with his aunt and uncle at the moment, as they were already in an especially bad mood with him, all because he'd received a telephone call from a fellow wizard one week into the school vacation.  Ron Weasley, who was one of Harry's best friends at Hogwarts, came from a whole family of wizards. This meant that he knew a lot of things Harry didn't, but had never used a telephone before. Most unluckily, it had been Uncle Vernon who had answered the call.  \"Vernon Dursley speaking.\"  Harry, who happened to be in the room at the time, froze as he heard Ron's voice answer.  \"HELLO? HELLO? CAN YOU HEAR ME? I -- WANT -- TO -- TALK -- TO -- HARRY -- POTTER!\"  Ron was yelling so loudly that Uncle Vernon jumped and held the receiver a foot away from his ear, staring at it with an expression of mingled fury and alarm.  \"WHO IS THIS?\" he roared in the direction of the mouthpiece. \"WHO ARE YOU?\"  \"RON -- WEASLEY!\" Ron bellowed back, as though he and Uncle Vernon were speaking from opposite ends of a football field. \"I'M -- A -- FRIEND -- OF -- HARRY'S -- FROM -- SCHOOL --\"  Uncle Vernon's small eyes swiveled around to Harry, who was rooted to the spot.  \"THERE IS NO HARRY POTTER HERE!\" he roared, now holding the receiver at arm's length, as though frightened it might explode. \"I DON'T KNOW WHAT SCHOOL YOURE TALKING ABOUT! NEVER CONTACT ME AGAIN! DON'T YOU COME NEAR MY FAMILY!\"  And he threw the receiver back onto the telephone as if dropping a poisonous spider.  The fight that had followed had been one of the worst ever.  \"HOW DARE YOU GIVE THIS NUMBER TO PEOPLE LIKE -- PEOPLE LIKE YOU!\" Uncle Vernon had roared, spraying Harry with spit.  Ron obviously realized that he'd gotten Harry into trouble, because he hadn't called again. Harry's other best friend from Hogwarts, Hermione Granger, hadn't been in touch either."
}