{
  "id": "f94facb6e34a4a4a0e20252b1eb33b138eb707d8",
  "text": " I wanted Harry Potters blood.  I wanted the blood of the one who had stripped me of power thirteen years ago . . . for the lingering protection his mother once gave him would then reside in my veins too. . . . \"But how to get at Harry Potter?  For he has been better protected than I think even he knows, protected in ways devised by Dumbledore long ago, when it fell to him to arrange the boy's future.  Dumbledore invoked an ancient magic, to ensure the boy's protection as long as he is in his relations' care.  Not even I can touch him there. . . . Then, of course, there was the Quidditch World Cup. ... I thought his protection might be weaker there, away from his relations and Dumbledore, but I was not yet strong enough to attempt kidnap in the midst of a horde of Ministry wizards.  And then, the boy would return to Hogwarts, where he is under the crooked nose of that Muggle-loving fool from morning until night.  So how could I take him? \"Why ... by using Bertha Jorkins's information, of course.  Use my one faithful Death Eater, stationed at Hogwarts, to ensure that the boy's name was entered into the Goblet of Fire. Use my Death Eater to ensure that the boy won the tournament - that he touched the Triwizard Cup first - the cup which my Death Eater had turned into a Portkey, which would bring him here, beyond the reach of Dumbledore's help and protection, and into my waiting arms.  And here he is ... the boy you all believed had been my downfall. ...\" Voldemort moved slowly forward and turned to face Harry.  He raised his wand. \"Crucio!\" It was pain beyond anything Harry had ever experienced; his very bones were on fire; his head was surely splitting along his scar; his eyes were rolling madly in his head; he wanted it to end ... to black out... to die ... And then it was gone.  He was hanging limply in the ropes binding him to the headstone of Voldemort's father, looking up into those bright red eyes through a kind of mist.  The night was ringing with the sound of the Death Eaters' laughter. \"You see, I think, how foolish it was to suppose that this boy could ever have been stronger than me,\" said Voldemort.  \"But I want there to be no mistake in anybody's mind. Harry Potter escaped me by a lucky chance.  And I am now going to prove my power by killing him, here and now, in front of you all, when there is no Dumbledore to help him, and no mother to die for him.  I will give him his chance.  He will be allowed to fight, and you will be left in no doubt which of us is the stronger.  Just a little longer, Nagini,\" he whispered, and the snake glided away through the grass to where the Death Eaters stood watching. \"Now untie him, Wormtail, and give him back his wand.\"  CHAPTER THIRTY-FOUR - PRIORI INCANTATEM  Wormtail approached Harry, who scrambled to find his feet, to support his own weight before the ropes were untied.  Wormtail raised his new silver hand, pulled out the wad of material gagging Harry, and then, with one swipe, cut through the bonds tying Harry to the gravestone. There was a split second, perhaps, when Harry might have considered running for it, but his injured leg shook under him as he stood on the overgrown grave, as the Death Eaters closed ranks, forming a tighter circle around him and Voldemort, so that the gaps where the missing Death Eaters should have stood were filled.  Wormtail walked out of the circle to the place where Cedric's body lay and returned with Harry's wand, which he thrust roughly into Harry's hand without looking at him.  Then Wormtail resumed his place in the circle of watching Death Eaters. \"You have been taught how to duel. Harry Potter?\"  said Voldemort softly, his red eyes glinting through the darkness. At these words Harry remembered, as though from a former life, the dueling club at Hogwarts he had attended briefly two years ago. ... All he had learned there was the Disarming Spell, \"Expelliarmus\". . . and what use would it be to deprive Voldemort of his wand, even if he could, when he was surrounded by Death Eaters, outnumbered by at least thirty to one?  He had never learned anything that could possibly fit him for this.  He knew he was facing the thing against which Moody had always warned . . . the unblockable Avada Kedavra curse - and Voldemort was right - his mother was not here to die for him this time. ... He was quite unprotected. . . . \"We bow to each other. Harry,\" said Voldemort, bending a little, but keeping his snakelike face upturned to Harry.  \"Come, the niceties must be observed. . . . Dumbledore would like you to show manners. . . . Bow to death, Harry. ...\" The Death Eaters were laughing again.  Voldemorts lipless mouth was smiling.  Harry did not bow.  He was not going to let Voldemort play with him before killing him ... he was not going to give him that satisfaction. . . . \"I said, bow,\" Voldemort said, raising his wand - and Harry felt his spine curve as though a huge, invisible hand were bending him ruthlessly forward, and the Death Eaters laughed harder than ever."
}