{
  "id": "f9dee1f955ab308551f1a9883304604ee5a76e44",
  "text": "  Them as own all this won’t like that much.    I never imagined they would. So be it; they’ll have something else to curse the evil monkey demon for.    Some may fight.    See that they lose.    What do we do with those that live here?    Let them have a reasonable time to remove their property, and then move them out. Try not to kill any of them, they’re not the enemy. And no more rapes! Keep your men in line, damn it.    They’re sellswords, not septons,  said Bronn.  Next you’ll be telling me you want them sober.    It couldn’t hurt.   Tyrion only wished he could as easily make city walls twice as tall and three times as thick. Though perhaps it did not matter. Massive walls and tall towers had not saved Storm’s End, nor Harrenhal, nor even Winterfell.  He remembered Winterfell as he had last seen it. Not as grotesquely huge as Harrenhal, nor as solid and impregnable to look at as Storm’s End, yet there had been a great strength in those stones, a sense that within those walls a man might feel safe. The news of the castle’s fall had come as a wrenching shock.  The gods give with one hand and take with the other,  he muttered under his breath when Varys told him. They had given the Starks Harrenhal and taken Winterfell, a dismal exchange.  No doubt he should be rejoicing. Robb Stark would have to turn north now. If he could not defend his own home and hearth, he was no sort of king at all. It meant reprieve for the west, for House Lannister, and yet…  Tyrion had only the vaguest memory of Theon Greyjoy from his time with the Starks. A callow youth, always smiling, skilled with a bow; it was hard to imagine him as Lord of Winterfell. The Lord of Winterfell would always be a Stark.  He remembered their godswood; the tall sentinels armored in their grey-green needles, the great oaks, the hawthorn and ash and soldier pines, and at the center the heart tree standing like some pale giant frozen in time. He could almost smell the place, earthy and brooding, the smell of centuries, and he remembered how dark the wood had been even by day. That wood was Winterfell. It was the north. I never felt so out of place as I did when I walked there, so much an unwelcome intruder. He wondered if the Greyjoys would feel it too. The castle might well be theirs, but never that godswood. Not in a year, or ten, or fifty.  Tyrion Lannister walked his horse slowly toward the Mud Gate. Winterfell is nothing to you, he reminded himself. Be glad the place has fallen, and look to your own walls. The gate was open. Inside, three great trebuchets stood side by side in the market square, peering over the battlements like three huge birds. Their throwing arms were made from the trunks of old oaks, and banded with iron to keep them from splitting. The gold cloaks had named them the Three Whores, because they’d be giving Lord Stannis such a lusty welcome. Or so we hope.  Tyrion put his heels into his horse and trotted through the Mud Gate, breasting the human tide. Once beyond the Whores, the press grew thinner and the street opened up around him.  The ride back to the Red Keep was uneventful, but at the Tower of the Hand he found a dozen angry trader captains waiting in his audience chamber to protest the seizure of their ships. He gave them a sincere apology and promised compensation once the war was done. That did little to appease them.  What if you should lose, my lord?  one Braavosi asked.   Then apply to King Stannis for your compensation.   By the time he rid himself of them, bells were ringing and Tyrion knew he would be late for the installation. He waddled across the yard almost at a run and crowded into the back of the castle sept as Joffrey fastened white silk cloaks about the shoulders of the two newest members of his Kingsguard. The rite seemed to require that everyone stand, so Tyrion saw nothing but a wall of courtly arses. On the other hand, once the new High Septon was finished leading the two knights through their solemn vows and anointing them in the names of the Seven, he would be well positioned to be first out the doors.  He approved of his sister’s choice of Ser Balon Swann to take the place of the slain Preston Greenfield. The Swanns were Marcher lords, proud, powerful, and cautious. Pleading illness, Lord Gulian Swann had remained in his castle, taking no part in the war, but his eldest son had ridden with Renly and now Stannis, while Balon, the younger, served at King’s Landing. If he’d had a third son, Tyrion suspected he’d be off with Robb Stark. It was not perhaps the most honorable course, but it showed good sense; whoever won the iron Throne, the Swanns intended to survive. In addition to being well born, young Ser Balon was valiant, courtly, and skilled at arms; good with a lance, better with a morningstar, superb with the bow. He would serve with honor and courage.  Alas, Tyrion could not say the same for Cersei’s second choice. Ser Osmund Kettleblack looked formidable enough. He stood six feet and six inches, most of it sinew and muscle, and his hook nose, bushy eyebrows, and spade-shaped brown beard gave his face a fierce aspect, so long as he did not smile."
}