{
  "id": "fac0c5c299d5e897ecf63882fe4b8db43bc16e41",
  "text": "   He could carry the message back to Castle Black and tell them of the horn, but if he left Mance still alive Lord Janos and Ser Alliser would seize on that as proof that he was a turncloak. A thousand thoughts flickered through Jon’s head. If I can destroy the horn, smash it here and now… but before he could begin to think that through, he heard the low moan of some other horn, made faint by the tent’s hide walls. Mance heard it too. Frowning, he went to the door. Jon followed.  The warhorn was louder outside. Its call had stirred the wildling camp. Three Hornfoot men jogged past, carrying long spears. Horses were whinnying and snorting, giants roaring in the Old Tongue, and even the mammoths were restless.   Outrider’s horn,  Tormund told Mance.   Something’s coming.  Varamyr sat crosslegged on the half-frozen ground, his wolves circled restlessly around him. A shadow swept over him, and Jon looked up to see the eagle’s blue-grey wings.  Coming, from the east.   When the dead walk, walls and stakes and swords mean nothing, he remembered. You cannot fight the dead, Jon Snow. No man knows that half so well as me.  Harma scowled.  East? The wights should be behind us.    East,  the skinchanger repeated.  Something’s coming.    The Others?  Jon asked.  Mance shook his head.  The Others never come when the sun is up.  Chariots were rattling across the killing ground, jammed with riders waving spears of sharpened bone. The king groaned.  Where the bloody hell do they think they’re going? Quenn, get those fools back where they belong. Someone bring my horse. The mare, not the stallion. I’ll want my armor too.  Mance glanced suspiciously at the Wall. Atop the icy parapets, the straw soldiers stood collecting arrows, but there was no sign of any other activity.  Harma, mount up your raiders. Tormund, find your sons and give me a triple line of spears.    Aye,  said Tormund, striding off.  The mousy little skinchanger closed his eyes and said,  I see them. They’re coming along the streams and game trails…    Who?    Men. Men on horses. Men in steel and men in black.    Crows.  Mance made the word a curse. He turned on Jon.  Did my old brothers think they’d catch me with my breeches down if they attacked while we were talking?    If they planned an attack they never told me about it.  Jon did not believe it. Lord Janos lacked the men to attack the wildling camp. Besides, he was on the wrong side of the Wall, and the gate was sealed with rubble. He had a different sort of treachery in mind, this can’t be his work.   If you’re lying to me again, you won’t be leaving here alive,  Mance warned. His guards brought him his horse and armor. Elsewhere around the camp, Jon saw people running at cross purposes, some men forming up as if to storm the Wall while others slipped into the woods, women driving dog carts east, mammoths wandering west. He reached back over his shoulder and drew Longclaw just as a thin line of rangers emerged from the fringes of the wood three hundred yards away. They wore black mail, black halfhelms, and black cloaks. Half-armored, Mance drew his sword.  You knew nothing of this, did you?  he said to Jon, coldly.  Slow as honey on a cold morning, the rangers swept down on the wildling camp, picking their way through clumps of gorse and stands of trees, over roots and rocks. Wildlings flew to meet them, shouting war cries and waving clubs and bronze swords and axes made of flint, galloping headlong at their ancient enemies. A shout, a slash, and a fine brave death, Jon had heard brothers say of the free folk’s way of fighting.   Believe what you will,  Jon told the King-beyond-the-Wall,  but I knew nothing of any attack.   Harma thundered past before Mance could reply, riding at the head of thirty raiders. Her standard went before her; a dead dog impaled on a spear, raining blood at every stride. Mance watched as she smashed into the rangers.  Might be you’re telling it true,  he said.  Those look like Eastwatch men. Sailors on horses. Cotter Pyke always had more guts than sense. He took the Lord of Bones at Long Barrow, he might have thought to do the same with me. If so, he’s a fool. He doesn’t have the men, he—    Mance!  the shout came. It was a scout, bursting from the trees on a lathered horse.  Mance, there’s more, they’re all around us, iron men, iron, a host of iron men.   Cursing, Mance swung up into the saddle.  Varamyr, stay and see that no harm comes to Dalla.  The King-beyond-the-Wall pointed his sword at Jon.  And keep a few extra eyes on this crow. If he runs, rip out his throat.     Aye, I’ll do that.  The skinchanger was a head shorter than Jon, slumped and soft, but that shadowcat could disembowel him with one paw.  They’re coming from the north too,  Varamyr told Mance.  You best go.   Mance donned his helm with its raven wings. His men were mounted up as well.  Arrowhead,  Mance snapped,  to me, form wedge.  Yet when he slammed his heels into the mare and flew across the field at the rangers, the men who raced to catch him lost all semblance of formation."
}