{
  "id": "fb4ee0639ab636292a79debe2bccc1a8b6eb1cca",
  "text": " She opened her mouth wide and an unearthly sound filled the room, a long, wailing shriek that made the hair on Harry's head stand on end -- 'Riddikulus!\" shouted Seamus.  The banshee made a rasping noise and clutched her throat; her voice was gone.  Crack! The banshee turned into a rat, which chased its tail in a circle, then -- crack!- became a rattlesnake, which slithered and writhed before -- crack! -- becoming a single, bloody eyeball.  'It's confused!\" shouted Lupin. \"We're getting there! Dean!\"  Dean hurried forward.  Crack! The eyeball became a severed hand, which flipped over and began to creep along the floor like a crab.  \"Riddikulus!\" yelled Dean.  'There was a snap, and the hand was trapped in a mousetrap.  \"Excellent! Ron, you next!\"  Ron leapt forward.  Crack!  Quite a few people screamed. A giant spider, six feet tall and covered in hair, was advancing on Ron, clicking its pincers menacingly. For a moment, Harry thought Ron had frozen. Then --  \"Riddikulus!\" bellowed Ron, and the spider's legs vanished; it rolled over and over; Lavender Brown squealed and ran out of its way and it came to a halt at Harry's feet. He raised his wand, ready, but --  \"Here!\" shouted Professor Lupin suddenly, hurrying forward. Crack!  The legless spider had vanished. For a second, everyone looked wildly around to see where it was. Then they saw a silvery-white orb hanging in the air in front of Lupin, who said, \"Riddikulus!\" almosi lazily.  Crack!  \"Forward, Neville, and finish him off!\" said Lupin as the boggart landed on the floor as a cockroach. Crack! Snape was back. This time Neville charged forward looking determined.  \"Riddikulus!\" he shouted, and they had a split second's view of Snape in his lacy dress before Neville let out a great \"Ha!\" of laughter, and the boggart exploded, burst into a thousand tiny wisps of smoke, and was gone.  \"Excellent!\" cried Professor Lupin as the class broke into applause. \"Excellent) Neville. Well done, everyone.... Let me See... five points to Gryffindor for every person to tackle the boggart -- ten for Neville because he did it twice... and five each to Hermione and Harry.\"  \"But I didn't do anything,\" said Harry.  \"You and Hermione answered my questions correctly at the start of the class, Harry,\" Lupin said lightly. \"Very well, everyone, an excellent lesson. Homework, kindly read the chapter on boggarts and summarize it for me... to be handed in on Monday. That will be all.\"  Talking excitedly, the class left the staffroom. Harry, however, wasn't feeling cheerful. Professor Lupin had deliberately stopped him from tackling the boggart. Why? Was it because he'd seen Harry collapse on the train, and thought he wasn't up to much? Had he thought Harry would pass out again?  But no one else seemed to have noticed anything.  \"Did you see me take that banshee?\" shouted Seamus. \"And the hand!\" said Dean, waving his own around.  \"And Snape in that hat!\" \"And my mummy!\"  I wonder why Professor Lupin's frightened of crystal balls?\" said Lavender thoughtfully.  \"That was the best Defense Against the Dark Arts lesson we've ever had, wasn't it?\" said Ron excitedly as they made their way back to the classroom to get their bags.  \"He seems like a very good teacher,\" said Hermione approvingly. \"But I wish I could have had a turn with the boggart --\"  \"What would it have been for you?\" said Ron, sniggering. \"A piece of homework that only got nine out of ten?\"  CHAPTER EIGHT  FLIGHT OF THE FAT FADY  In no time at all, Defense Against the Dark Arts had become most people's favorite class. Only Draco Malfoy and his gang of Slytherins had anything bad to say about Professor Lupin.  \"Look at the state of his robes,\" Malfoy would say in a loud whisper as Professor Lupin passed. \"He dresses like our old houseelf \"  But no one else cared that Professor Lupin's robes were patched and frayed. His next few lessons were just as interesting as the first. After boggarts, they studied Red Caps, nasty little goblin like creatures that lurked wherever there had been bloodshed: in the dungeons of castles and the potholes of deserted battlefields, waiting to bludgeon those who had gotten lost. From Red Caps they moved on to kappas, creepy. water-dwellers that looked like scaly monkeys, with webbed hands itching to strangle unwitting waders in their ponds.  Harry only wished he was as happy with some of his other classes. Worst of all was Potions. Snape was in a particularly vindictive mood these days, and no one was in any doubt why. The story of the boggart assuming Snape's shape, and the way that Neville had dressed it in his grandmother's clothes, had traveled through the school like wildfire. Snape didn't seem to find it funny. His eyes flashed menacingly at the very mention of Professor Lupin's name, and he was bullying Neville worse than ever.  Harry was also growing to dread the hours he spent in Professor Trelawney's stifling tower room, deciphering lopsided shapes and symbols, trying to ignore the way Professor Trelawney's enormous eyes filled with tears every time she looked at him."
}