{
  "id": "fb75655ecf650a36978c55016e629311fff4c307",
  "text": " It occurred to Tyrion belatedly that it might be wise to leave himself.  When he heard Cersei’s scream, he knew that it was over.  I should leave. Now. Instead he waddled toward her.  His sister sat in a puddle of wine, cradling her son’s body. Her gown was tom and stained, her face white as chalk. A thin black dog crept up beside her, sniffing at Joffrey’s corpse.  The boy is gone, Cersei,  Lord Tywin said. He put his gloved hand on his daughter’s shoulder as one of his guardsmen shooed away the dog.  Unhand him now. Let him go.  She did not hear. It took two Kingsguard to pry loose her fingers, so the body of King Joffrey Baratheon could slide limp and lifeless to the floor.  The High Septon knelt beside him.  Father Above, judge our good King Joffrey justly,  he intoned, beginning the prayer for the dead. Margaery Tyrell began to sob, and Tyrion heard her mother Lady Alerie saying,  He choked, sweetling. He choked on the pie. It was naught to do with you. He choked. We all saw.    He did not choke.  Cersei’s voice was sharp as Ser Ilyn’s sword.  My son was poisoned.  She looked to the white knights standing helplessly around her.  Kingsguard, do your duty.    My lady?  said Ser Loras Tyrell, uncertain.   Arrest my brother,  she commanded him.  He did this, the dwarf. Him and his little wife. They killed my son. Your king. Take them! Take them both!       Sansa   Far across the city, a bell began to toll.  Sansa felt as though she were in a dream.  Joffrey is dead,  she told the trees, to see if that would wake her.  He had not been dead when she left the throne room. He had been on his knees, though, clawing at his throat, tearing at his own skin as he fought to breathe. The sight of it had been too terrible to watch, and she had turned and fled, sobbing. Lady Tanda had been fleeing as well.  You have a good heart, my lady,  she said to Sansa.  Not every maid would weep so for a man who set her aside and wed her to a dwarf.   A good heart. I have a good heart. Hysterical laughter rose up her gullet, but Sansa choked it back down. The bells were ringing, slow and mournful. Ringing, ringing, ringing. They had rung for King Robert the same way. Joffrey was dead, he was dead, he was dead, dead, dead. Why was she crying, when she wanted to dance? Were they tears of joy?  She found her clothes where she had hidden them, the night before last. With no maids to help her, it took her longer than it should have to undo the laces of her gown. Her hands were strangely clumsy, though she was not as frightened as she ought to have been.  The gods are cruel to take him so young and handsome, at his own wedding feast,  Lady Tanda had said to her.  The gods are just, thought Sansa. Robb had died at a wedding feast as well. It was Robb she wept for. Him and Margaery. Poor Margaery, twice wed and twice widowed. Sansa slid her arm from a sleeve, pushed down the gown, and wriggled out of it. She balled it up and shoved it into the bole of an oak, shook out the clothing she had hidden there. Dress warmly, Ser Dontos had told her, and dress dark. She had no blacks, so she chose a dress of thick brown wool. The bodice was decorated with freshwater pearls, though. The cloak will cover them. The cloak was a deep green, with a large hood. She slipped the dress over her head, and donned the cloak, though she left the hood down for the moment. There were shoes as well, simple and sturdy, with flat heels and square toes. The gods heard my prayer, she thought. She felt so numb and dreamy. My skin has turned to porcelain, to ivory, to steel. Her hands moved stiffly, awkwardly, as if they had never let down her hair before. For a moment she wished Shae was there, to help her with the net.  When she pulled it free, her long auburn hair cascaded down her back and across her shoulders. The web of spun silver hung from her fingers, the fine metal glimmering softly, the stones black in the moonlight. Black amethysts from Asshai. One of them was missing. Sansa lifted the net for a closer look. There was a dark smudge in the silver socket where the stone had fallen out.  A sudden terror filled her. Her heart hammered against her ribs, and for an instant she held her breath. Why am I so scared, it’s only an amethyst, a black amethyst from Asshai, no more than that. It must have been loose in the setting, that’s all. It was loose and it fell out, and now it’s lying somewhere in the throne room, or in the yard, unless…  Ser Dontos had said the hair net was magic, that it would take her home. He told her she must wear it tonight at Joffrey’s wedding feast. The silver wire stretched tight across her knuckles. Her thumb rubbed back and forth against the hole where the stone had been. She tried to stop, but her fingers were not her own. Her thumb was drawn to the hole as the tongue is drawn to a missing tooth. What kind of magic? The king was dead, the cruel king who had been her gallant prince a thousand years ago. If Dontos had lied about the hair net, had he lied about the rest as well? What if he never comes? What if there is no ship, no boat on the river, no escape? What would happen to her then?  She heard a faint rustle of leaves, and stuffed the silver hair net down deep in the pocket of her cloak."
}