{
  "id": "fc86170f4532fcadb123335351375c5704b7531b",
  "text": " Harry followed their descent through his Omnioculars, squinting to see where the Snitch was -  \"They're going to crash!\" screamed Hermione next to Harry. She was half right - at the very last second, Viktor Krum pulled out of the dive and spiraled off. Lynch, however, hit the ground with a dull thud that could be heard throughout the stadium. A huge groan rose from the Irish seats. \"Fool!\" moaned Mr. Weasley. \"Krum was feinting!\" \"It's time-out!\" yelled Bagman's voice, \"as trained mediwizards hurry onto the field to examine Aidan Lynch!\" \"He'll be okay, he only got ploughed!\" Charlie said reassuringly to Ginny, who was hanging over the side of the box, looking horror-struck. \"Which is what Krum was after, of course... .\" Harry hastily pressed the replay and play-by-play buttons on his Omnioculars, twiddled the speed dial, and put them back up to his eyes. He watched as Krum and Lynch dived again in slow motion.  WRONSKI DEFENSIVE FEINT - DANGEROUS SEEKER DIVERSION  read the shining purple lettering across his lenses.  He saw Krum's face contorted with concentration as he pulled out of the dive just in time, while Lynch was flattened, and he understood - Krum hadn't seen the Snitch at all, he was just making Lynch copy him.  Harry had never seen anyone fly like that; Krum hardly looked as though he was using a broomstick at all; he moved so easily through the air that he looked unsupported and weightless.  Harry turned his Omnioculars back to normal and focused them on Krum.  He was now circling high above Lynch, who was being revived by mediwizards with cups of potion.  Harry, focusing still more closely upon Krum's face, saw his dark eyes darting all over the ground a hundred feet below.  He was using the time while Lynch was revived to look for the Snitch without interference. Lynch got to his feet at last, to loud cheers from the green-clad supporters, mounted his Firebolt, and kicked back off into the air.  His revival seemed to give Ireland new heart.  When Mostafa blew his whistle again, the Chasers moved into action with a skill unrivaled by anything Harry had seen so far. After fifteen more fast and furious minutes, Ireland had pulled ahead by ten more goals. They were now leading by one hundred and thirty points to ten, and the game was starting to get dirtier. As Mullet shot toward the goal posts yet again, clutching the Quaffle tightly under her arm, the Bulgarian Keeper, Zograf, flew out to meet her.  Whatever happened was over so quickly Harry didn't catch it, but a scream of rage from the Irish crowd, and Mostafa's long, shrill whistle blast, told him it had been a foul. \"And Mostafa takes the Bulgarian Keeper to task for cobbing -- excessive use of elbows!\"  Bagman informed the roaring spectators.  \"And - yes, it's a penalty to Ireland!\" The leprechauns, who had risen angrily into the air like a swarm of glittering hornets when Mullet had been fouled, now darted together to form the words \"HA, HA, HA!\"  The veela on the other side of the field leapt to their feet, tossed their hair angrily, and started to dance again. As one, the Weasley boys and Harry stuffed their fingers into their ears, but Hermione, who hadn't bothered, was soon tugging on Harry's arm.  He turned to look at her, and she pulled his fingers impatiently out of his ears. \"Look at the referee!\" she said, giggling. Harry looked down at the field. Hassan Mostafa had landed right in front of the dancing veela, and was acting very oddly indeed. He was flexing his muscles and smoothing his mustache excitedly. \"Now, we can't have that!\" said Ludo Bagman, though he sounded highly amused. \"Somebody slap the referee!\" A mediwizard came tearing across the field, his fingers stuffed into his own ears, and kicked Mostafa hard in the shins. Mostafa seemed to come to himself; Harry, watching through the Omnioculars again, saw that he looked exceptionally embarrassed and had started shouting at the veela, who had stopped dancing and were looking mutinous. \"And unless I'm much mistaken, Mostafa is actually attempting to send off the Bulgarian team mascots!\"  said Bagman's voice.  \"Now there's something we haven't seen before. . . . Oh this could turn nasty. . . It did: The Bulgarian Beaters, Volkov and Vulchanov, landed on either side of Mostafa and began arguing furiously with him, gesticulating toward the leprechauns, who had now gleefully formed the words \"HEE, HEE, HEE.\"  Mostafa was not impressed by the Bulgarians' arguments, however; he was jabbing his finger into the air, clearly telling them to get flying again, and when they refused, he gave two short blasts on his whistle. \"Two penalties for Ireland!\" shouted Bagman, and the Bulgarian crowd howled with anger.  \"And Volkov and Vulchanov had better get back on those brooms. . . yes. . . there they go. . . and Troy takes the Quaffle. . Play now reached a level of ferocity beyond anything they had yet seen. The Beaters on both sides were acting without mercy:  Volkov and Vulchanov in particular seemed not to care whether their clubs made contact with Bludger or human as they swung them violently through the air."
}