{
  "id": "fcd83814666fefb128bd1c38f466c02bad6ff101",
  "text": "  Then  suddenly  goblins  came  running  up  yelling.  They  thought  a  battle  with  the  woodmen  was  going  on;  but  they  goon  learned  what  had  really  happened.  Some  of  them  actually  sat  down  and  laughed.  Others  waved  their  spears  and   ####-clashed  the  shafts  against  their  shields.  Goblins  are  not  afraid  of  fire,  and  they  soon had a plan which seemed to them most amusing.  Some got all the wolves together in a pack. Some stacked fern and brushwood  round  the  tree-trunks.  Others  rushed  round  and  stamped  and  beat,  and  beat  and  stamped,  until  nearly  all  the  flames were  put  out-but  they did not put out  the  fire  nearest  to  the  trees  where  the  dwarves  were.  That  fire  they  fed  with  leaves  and  dead  branches  and  bracken.  Soon  they  had  a  ring  of  smoke  and  flame  all  round  the dwarves, a ring which they kept from spreading outwards; but it closed slowly  in,  till  the  running  fire  was  licking  the  fuel  piled  under  the  trees.  Smoke  was  in  Bilbo's  eyes,  he  could  feel  the  heat  of  the  flames;  and  through  the  reek  he  could  see  the  goblins  dancing  round  and  round  in  a  circle  like  people  round  a  midsummer  bonfire.  Outside  the  ring  of  dancing  warriors  with  spears  and  axes  stood the wolves at a respectful distance, watching and waiting.  He could hear the goblins beginning a horrible song:     Fifteen birds in five firtrees,  their feathers were fanned in a fiery breeze!  But, funny little birds, they had no wings!  O what shall we do with the funny little things?   Roast 'em alive, or stew them in a pot;  fry them, boil them and eat them hot?      Then  they  stopped  and  shouted  out:  \"Fly  away  little  birds!  Fly  away  if  you  can! Come down little birds, or you will get roasted in your nests! Sing, sing little  birds! Why don't you sing?\"  \"Go  away!  little  boys!\"  shouted Gandalf  in  answer.  \"It  isn't  bird-nesting time.  Also naughty little boys that play with fire get punished.\" He said it to make them  angry,  and  to  show  them  he was  not  frightened  of  them-though of course he was,  wizard though he was. But they took no notice, and they went on singing.     Burn, burn tree and fern!  Shrivel and scorch! A fizzling torch  To light the night for our delight,  Ya hey!    Bake and toast 'em, fry and roast 'em  till beards blaze, and eyes glaze;  till hair smells and skins crack,  fat melts, and bones black   ####-in cinders lie  beneath the sky!    So dwarves shall die,  and light the night for our delight,  Ya hey!  Ya-harri-heyl  Ya hoy!     And  with  that  Ya  hoy!  the  flames  were  under  Gandalf’s  tree.  In  a moment  it  spread to the others. The bark caught fire, the lower branches cracked.  Then  Gandalf  climbed  to  the  top  of  his  tree.  The  sudden  splendour  flashed  from  his  wand  like  lightning,  as  he  got  ready  to  spring  down  from  on  high  right  among  the spears of  the goblins. That would have been  the end of him,  though he  would  probably  have  killed  many  of  them  as  he  came  hurtling  down  like  a  thunderbolt. But he never leaped.  Just at that moment the Lord of the Eagles swept down from above, seized him  in his talons, and was gone.    There was a howl of anger and surprise from the goblins. Loud cried the Lord  of  the Eagles,  to whom Gandalf had now  spoken. Back  swept  the great birds  that  were  with  him,  and  down  they  came  like  huge  black  shadows.  The  wolves  yammered and gnashed  their  teeth;  the goblins yelled and stamped with  rage, and  flung their heavy spears in the air in vain. Over them swooped the eagles; the dark  rush of  their beating wings  smote  them  to  the  floor or drove  them  far  away;  their  talons  tore  at  goblin  faces.  Other  birds  flew  to  the  tree-tops  and  seized  the  dwarves, who were scrambling up now as far as ever they dared to go.  Poor  little Bilbo was  very  nearly  left  behind  again! He  just managed  to  catch  hold of Dori's legs, as Dori was borne off last of all; and they went together above  the  tumult  and  the  burning,  Bilbo  swinging  in  the  air  with  his  arms  nearly  breaking.  Now  far below  the goblins and  the wolves were  scattering  far and wide  in  the  woods. A few eagles were still circling and sweeping above the battle-ground. The  flames about  the  trees sprang suddenly up above  the highest branches. They went  up  in  crackling  fire.  There  was  a  sudden  flurry  of  sparks  and  smoke.  Bilbo  had  escaped only just in time!  Soon the light of the burning was faint below, a red twinkle on the black floor;  and  they  were  high  up  in  the  sky,  rising  all  the  time  in  strong  sweeping circles.   ####-Bilbo  never  forgot  that  flight,  clinging  onto Dori's  ankles. He moaned  \"my  arms,  my arms!\"; but Dori groaned \"my poor legs, my poor legs!\"  At  the  best  of  times  heights  made  Bilbo  giddy."
}