{
  "id": "fdd9df368481c023e88486431268dae983ac7055",
  "text": "  This stinks of manure. Perhaps I shall use it as a horse blanket.    I had Doreah sew it specially for you,  she told him, wounded.  These are garments fit for a khal.    I am the Lord of the Seven Kingdoms, not some grass-stained savage with bells in his hair,  Viserys spat back at her. He grabbed her arm.  You forget yourself, slut. Do you think that big belly will protect you if you wake the dragon?   His fingers dug into her arm painfully and for an instant Dany felt like a child again, quailing in the face of his rage. She reached out with her other hand and grabbed the first thing she touched, the belt she’d hoped to give him, a heavy chain of ornate bronze medallions. She swung it with all her strength.  It caught him full in the face. Viserys let go of her. Blood ran down his cheek where the edge of one of the medallions had sliced it open.  You are the one who forgets himself,  Dany said to him.  Didn’t you learn anything that day in the grass? Leave me now, before I summon my khas to drag you out. And pray that Khal Drogo does not hear of this, or he will cut open your belly and feed you your own entrails.   Viserys scrambled back to his feet.  When I come into my kingdom, you will rue this day, slut.  He walked off, holding his torn face, leaving her gifts behind him.  Drops of his blood had spattered the beautiful sandsilk cloak. Dany clutched the soft cloth to her cheek and sat cross-legged on her sleeping mats.   Your supper is ready, Khaleesi,  Jhiqui announced.   I’m not hungry,  Dany said sadly. She was suddenly very tired.  Share the food among yourselves, and send some to Ser Jorah, if you would.  After a moment she added,  Please, bring me one of the dragon’s eggs.   Irri fetched the egg with the deep green shell, bronze flecks shining amid its scales as she turned it in her small hands. Dany curled up on her side, pulling the sandsilk cloak across her and cradling the egg in the hollow between her swollen belly and small, tender breasts. She liked to hold them. They were so beautiful, and sometimes just being close to them made her feel stronger, braver, as if somehow she were drawing strength from the stone dragons locked inside.  She was lying there, holding the egg, when she felt the child move within her… as if he were reaching out, brother to brother, blood to blood.  You are the dragon,  Dany whispered to him,  the true dragon. I know it. I know it.  And she smiled, and went to sleep dreaming of home.      BRAN  A light snow was falling. Bran could feel the flakes on his face, melting as they touched his skin like the gentlest of rains. He sat straight atop his horse, watching as the iron portcullis was winched upward. Try as he might to keep calm, his heart was fluttering in his chest.   Are you ready?  Robb asked.  Bran nodded, trying not to let his fear show. He had not been outside Winterfell since his fall, but he was determined to ride out as proud as any knight.   Let’s ride, then.  Robb put his heels into his big grey-and-white gelding, and the horse walked under the portcullis.   Go,  Bran whispered to his own horse. He touched her neck lightly, and the small chestnut filly started forward. Bran had named her Dancer. She was two years old, and Joseth said she was smarter than any horse had a right to be. They had trained her special, to respond to rein and voice and touch. Up to now, Bran had only ridden her around the yard. At first Joseth or Hodor would lead her, while Bran sat strapped to her back in the oversize saddle the Imp had drawn up for him, but for the past fortnight he had been riding her on his own, trotting her round and round, and growing bolder with every circuit.  They passed beneath the gatehouse, over the drawbridge, through the outer walls. Summer and Grey Wind came loping beside them, sniffing at the wind. Close behind came Theon Greyjoy, with his longbow and a quiver of broadheads; he had a mind to take a deer, he had told them. He was followed by four guardsmen in mailed shirts and coifs, and Joseth, a stick-thin stableman whom Robb had named master of horse while Hullen was away. Maester Luwin brought up the rear, riding on a donkey. Bran would have liked it better if he and Robb had gone off alone, just the two of them, but Hal Mollen would not hear of it, and Maester Luwin backed him. If Bran fell off his horse or injured himself, the maester was determined to be with him.  Beyond the castle lay the market square, its wooden stalls deserted now. They rode down the muddy streets of the village, past rows of small neat houses of log and undressed stone. Less than one in five were occupied, thin tendrils of woodsmoke curling up from their chimneys. The rest would fill up one by one as it grew colder. When the snow fell and the ice winds howled down out of the north, Old Nan said, farmers left their frozen fields and distant holdfasts, loaded up their wagons, and then the winter town came alive. Bran had never seen it happen, but Maester Luwin said the day was looming closer."
}