{
  "id": "fe4d9526083b77bd75ef0714c537054717de6471",
  "text": "    I left my horse at the inn. Come.  They walked down the strand together, and when Theon took her arm, she did not pull away. He liked the way she walked; there was a boldness to it, part saunter and part sway, that suggested she would be just as bold beneath the blankets.  Lordsport was as crowded as he’d ever seen it, swarming with the crews of the longships that lined the pebbled shore and rode at anchor well out past the breakwater. Ironmen did not bend their knees often nor easily, but Theon noted that oarsmen and townfolk alike grew quiet as they passed, and acknowledged him with respectful bows of the head. They have finally learned who I am, he thought. And past time too.  Lord Goodbrother of Great Wyk had come in the night before with his main strength, near forty longships. His men were everywhere, conspicuous in their striped goat’s hair sashes. It was said about the inn that Otter Gimpknee’s whores were being fucked bowlegged by beardless boys in sashes. The boys were welcome to them so far as Theon was concerned. A poxier den of slatterns he hoped he’d never see. His present companion was more to his taste. That she was wed to his father’s shipwright and pregnant to boot only made her more intriguing.   Has my lord prince begun choosing his crew?  Esgred asked as they made their way toward the stable.  Ho, Bluetooth,  she shouted to a passing seafarer, a tall man in bearskin vest and raven-winged helm.  How fares your bride?    Fat with child, and talking of twins.    So soon?  Esgred smiled that wicked smile.  You got your oar in the water quickly.    Aye, and stroked and stroked and stroked,  roared the man.   A big man,  Theon observed.  Bluetooth, was it? Should I choose him for my Sea Bitch?    Only if you mean to insult him. Bluetooth has a sweet ship of his own.    I have been too long away to know one man from another,  Theon admitted. He’d looked for a few of the friends he’d played with as a boy, but they were gone, dead, or grown into strangers.  My uncle Victarion has loaned me his own steersman.    Rymolf Stormdrunk? A good man, so long as he’s sober.  She saw more faces she knew, and called out to a passing trio,  Uller, Qarl. Where’s your brother, Skyte?    The Drowned God needed a strong oarsman, I fear,  replied the stocky man with the white streak in his beard.   What he means is, Eldiss drank too much wine and his fat belly burst,  said the pink-cheeked youth beside him.   What’s dead may never die,  Esgred said.   What’s dead may never die.   Theon muttered the words with them.  You seem well known,  he said to the woman when the men had passed on.   Every man loves the shipwright’s wife. He had better, lest he wants his ship to sink. If you need men to pull your oars, you could do worse than those three.    Lordsport has no lack of strong arms.  Theon had given the matter no little thought. It was fighters he wanted, and men who would be loyal to him, not to his lord father or his uncles. He was playing the part of a dutiful young prince for the moment, while he waited for Lord Balon to reveal the fullness of his plans. If it turned out that he did not like those plans or his part in them, however, well…   Strength is not enough. A longship’s oars must move as one if you would have her best speed. Choose men who have rowed together before, if you’re wise.    Sage counsel. Perhaps you’d help me choose them.  Let her believe I want her wisdom, women fancy that.   I may. If you treat me kindly.    How else?   Theon quickened his stride as they neared the Myraham, rocking high and empty by the quay. Her captain had tried to sail a fortnight past, but Lord Balon would not permit it. None of the merchantmen that called at Lordsport had been allowed to depart again; his father wanted no word of the hosting to reach the mainland before he was ready to strike.   Milord,  a plaintive voice called down from the forecastle of the merchanter. The captain’s daughter leaned over the rail, gazing after him. Her father had forbidden her to come ashore, but whenever Theon came to Lordsport he spied her wandering forlornly about the deck.  Milord, a moment,  she called after him.  As it please milord…    Did she?  Esgred asked as Theon hurried her past the cog.  Please milord?   He saw no sense in being coy with this one.  For a time. Now she wants to be my salt wife.    Oho. Well, she’d profit from some salting, no doubt. Too soft and bland, that one. Or am I wrong?    You’re not wrong.  Soft and bland. Precisely. How had she known?  He had told Wex to wait at the inn. The common room was so crowded that Theon had to push his way through the door. Not a seat was to be had at bench nor table. Nor did he see his squire.  Wex , he shouted over the din and clatter. If he’s up with one of those poxy whores, I’ll strip the hide off him, he was thinking when he finally spied the boy, dicing near the hearth… and winning too, by the look of the pile of coins before him.   Time to go,  Theon announced."
}