{
  "id": "fe9207cae6b763f4efc13c50528881d254fa492e",
  "text": " Weasley, flaring up at once. \"If Dad hadn't said anything, old Rita would just have said it was disgraceful that nobody from the Ministry had commented,\" said Bill, who was playing chess with Ron.  \"Rita Skeeter never makes anyone look good.  Remember, she interviewed all the Gringotts' Charm Breakers once, and called me 'a long-haired pillock'?\" \"Well, it is a bit long, dear,\" said Mrs. Weasley gently.  \"If you'd just let me -\" \"No, Mum.\" Rain lashed against the living room window. Hermione was immersed in The Standard Book of Spells, Grade 4, copies of which Mrs. Weasley had bought for her, Harry, and Ron in Diagon Alley.  Charlie was darning a fireproof balaclava.  Harry was polishing his Firebolt, the broomstick servicing kit Hermione had given him for his thirteenth birthday open at his feet. Fred and George were sitting in a far corner, quills out, talking in whispers, their heads bent over a piece of parchment. \"What are you two up to?\" said Mrs. Weasley sharply, her eyes on the twins. \"Homework,\" said Fred vaguely. \"Don't be ridiculous, you're still on holiday,\" said Mrs. Weasley. \"Yeah, we've left it a bit late,\" said George. \"You're not by any chance writing out a new order form, are you?\" said Mrs. Weasley shrewdly.  \"You wouldn't be thinking of restarting Weasleys' Wizard Wheezes, by any chance?\" \"Now, Mum,\" said Fred, looking up at her, a pained look on his face. \"If the Hogwarts Express crashed tomorrow, and George and I died, how would you feel to know that the last thing we ever heard from you was an unfounded accusation?\" Everyone laughed, even Mrs. Weasley. \"Oh your father's coming!\"  she said suddenly, looking up at the clock again. Mr. Weasley's hand had suddenly spun from \"work\" to \"traveling\"; a second later it had shuddered to a halt on \"home\" with the others, and they heard him calling from the kitchen. \"Coming, Arthur!\" called Mrs. Weasley, hurrying out of the room. A few moments later, Mr. Weasley came into the warm living room carrying his dinner on a tray.  He looked completely exhausted. \"Well, the fat's really in the fire now,\" he told Mrs. Weasley as he sat down in an armchair near the hearth and toyed unenthusiastically with his somewhat shriveled cauliflower. \"Rita Skeeter's been ferreting around all week, looking for more Ministry mess-ups to report. And now she's found out about poor old Bertha going missing, so that'll be the headline in the Prophet tomorrow.  I told Bagman he should have sent someone to look for her ages ago.\" \"Mr. Crouch has been saying it for weeks and weeks,\" said Percy swiftly. \"Crouch is very lucky Rita hasn't found out about Winky,\" said Mr. Weasley irritably. \"There'd be a week's worth of headlines in his house-elf being caught holding the wand that conjured the Dark Mark.\" \"I thought we were all agreed that that elf, while irresponsible, did not conjure the Mark?\"  said Percy hotly. \"If you ask me, Mr. Crouch is very lucky no one at the Daily Prophet knows how mean he is to elves!\" said Hermione angrily. \"Now look here, Hermione!\" said Percy. \"A high-ranking Ministry official like Mr. Crouch deserves unswerving obedience from his servants -\"  \"His slave, you mean!\"  said Hermione, her voice rising passionately, \"because he didn't pay Winky, did he?\" \"I think you'd all better go upstairs and check that you've packed properly!\" said Mrs. Weasley, breaking up the argument.  \"Come on now, all of you. . . .\" Harry repacked his broomstick servicing kit, put his Firebolt over his shoulder, and went back upstairs with Ron.  The rain sounded even louder at the top of the house, accompanied by loud whistlings and moans from the wind, not to mention sporadic howls from the ghoul who lived in the attic.  Pigwidgeon began twittering and zooming around his cage when they entered. The sight of the half-packed trunks seemed to have sent him into a frenzy of excitement.  \"Bung him some Owl Treats,\" said Ron, throwing a packet across to Harry. \"It might shut him up.\" Harry poked a few Owl Treats through the bars of Pigwidgeon's cage, then turned to his trunk.  Hedwig's cage stood next to it, still empty. \"It's been over a week,\" Harry said, looking at Hedwig's deserted perch.  \"Ron, you don't reckon Sirius has been caught, do you?\" \"Nah, it would've been in the Daily Prophet,\" said Ron.  \"The Ministry would want to show they'd caught someone, wouldn't they?\" \"Yeah, I suppose. . . .\" \"Look, here's the stuff Mum got for you in Diagon Alley. And she's got some gold out of your vault for you. . . and she's washed all your socks.\" He heaved a pile of parcels onto Harry's camp bed and dropped the money bag and a load of socks next to it.  Harry started unwrapping the shopping.  Apart from The Standard Book of Spells, Grade 4, by Miranda Goshawk, he had a handful of new quills, a dozen rolls of parchment, and refills for his potion-making kit - he had been running low on spine of lionfish and essence of belladonna.  He was just piling underwear into his cauldron when Ron made a loud noise of disgust behind him."
}