{
  "id": "00b1ed3d2b20f732f721ba443928967d76357eef",
  "text": " She heard Ser Meryn Trant curse.  Bloody oafs,  he swore, drawing his longsword from its scabbard.  Syrio Forel resumed his stance and clicked his teeth together.  Arya child,  he called out, never looking at her,  be gone now.   Look with your eyes, he had said. She saw: the knight in his pale armor head to foot, legs, throat, and hands sheathed in metal, eyes hidden behind his high white helm, and in his hand cruel steel. Against that: Syrio, in a leather vest, with a wooden sword in his hand.  Syrio, run,  she screamed.   The first sword of Braavos does not run,  he sang as Ser Meryn slashed at him. Syrio danced away from his cut, his stick a blur. In a heartbeat, he had bounced blows off the knight’s temple, elbow, and throat, the wood ringing against the metal of helm, gauntlet, and gorget. Arya stood frozen. Ser Meryn advanced; Syrio backed away. He checked the next blow, spun away from the second, deflected the third.  The fourth sliced his stick in two, splintering the wood and shearing through the lead core.  Sobbing, Arya spun and ran.  She plunged through the kitchens and buttery, blind with panic, weaving between cooks and potboys. A baker’s helper stepped in front of her, holding a wooden tray. Arya bowled her over, scattering fragrant loaves of fresh-baked bread on the floor. She heard shouting behind her as she spun around a portly butcher who stood gaping at her with a cleaver in his hands. His arms were red to the elbow.  All that Syrio Forel had taught her went racing through her head. Swift as a deer. Quiet as a shadow. Fear cuts deeper than swords. Quick as a snake. Calm as still water. Fear cuts deeper than swords. Strong as a bear. Fierce as a wolverine. Fear cuts deeper than swords. The man who fears losing has already lost. Fear cuts deeper than swords. Fear cuts deeper than swords. Fear cuts deeper than swords. The grip of her wooden sword was slick with sweat, and Arya was breathing hard when she reached the turret stair. For an instant she froze. Up or down? Up would take her to the covered bridge that spanned the small court to the Tower of the Hand, but that would be the way they’d expect her to go, for certain. Never do what they expect, Syrio once said. Arya went down, around and around, leaping over the narrow stone steps two and three at a time. She emerged in a cavernous vaulted cellar, surrounded by casks of ale stacked twenty feet tall. The only light came through narrow slanting windows high in the wall.  The cellar was a dead end. There was no way out but the way she had come in. She dare not go back up those steps, but she couldn’t stay here, either. She had to find her father and tell him what had happened. Her father would protect her.  Arya thrust her wooden sword through her belt and began to climb, leaping from cask to cask until she could reach the window. Grasping the stone with both hands, she pulled herself up. The wall was three feet thick, the window a tunnel slanting up and out. Arya wriggled toward daylight. When her head reached ground level, she peered across the bailey to the Tower of the Hand.  The stout wooden door hung splintered and broken, as if by axes. A dead man sprawled facedown on the steps, his cloak tangled beneath him, the back of his mailed shirt soaked red. The corpse’s cloak was grey wool trimmed with white satin, she saw with sudden terror. She could not tell who he was.   No,  she whispered. What was happening? Where was her father? Why had the red cloaks come for her? She remembered what the man with the yellow beard had said, the day she had found the monsters. If one Hand can die, why not a second? Arya felt tears in her eyes. She held her breath to listen. She heard the sounds of fighting, shouts, screams, the clang of steel on steel, coming through the windows of the Tower of the Hand.  She could not go back. Her father…  Arya closed her eyes. For a moment she was too frightened to move. They had killed Jory and Wyl and Heward, and that guardsman on the step, whoever he had been. They could kill her father too, and her if they caught her.  Fear cuts deeper than swords,  she said aloud, but it was no good pretending to be a water dancer, Syrio had been a water dancer and the white knight had probably killed him, and anyhow she was only a little girl with a wooden stick, alone and afraid.  She squirmed out into the yard, glancing around warily as she climbed to her feet. The castle seemed deserted. The Red Keep was never deserted. All the people must be hiding inside, their doors barred. Arya glanced up longingly at her bedchamber, then moved away from the Tower of the Hand, keeping close to the wall as she slid from shadow to shadow. She pretended she was chasing cats… except she was the cat now, and if they caught her, they would kill her.  Moving between buildings and over walls, keeping stone to her back wherever possible so no one could surprise her, Arya reached the stables almost without incident. A dozen gold cloaks in mail and plate ran past as she was edging across the inner bailey, but without knowing whose side they were on, she hunched down low in the shadows and let them pass."
}