{
  "id": "014cb14980e9d160e50b6104dc5573a2e40a38fd",
  "text": " Then  the hurrying water of  the Forest River swept all the company of casks  and tubs away to the north bank, in which it had eaten out a wide bay. This had a  shingly  shore  under  hanging  banks  and  was  walled  at  the  eastern  end  by  a  little  jutting  cape  of  hard  rock.  On  the  shallow  shore  most  of  the barrels  ran  aground,  though a few went on to bump against the stony pier.   There  were  people  on  the  look-out  on  the  banks.  They  quickly  poled  and  pushed all the barrels together into the shallows, and when they had counted them  they  roped  them  together and left them till the morning. Poor dwarves! Bilbo was  not  so  badly  off  now.  He  slipped  from  his  barrel  and  waded  ashore,  and  then  sneaked  along  to  some huts  that he  could  see near  the water's  edge. He no  longer  thought  twice  about  picking  up  a  supper  uninvited  if  he  got  the  chance,  he  had  been  obliged  to  do  it  for  so  long,  and  he  knew  only  too  well  what  it  was  to  be  really  hungry,  not merely  politely  interested  in  the  dainties  of  a well-filled larder.  Also he had caught a glimpse of a fire  through  the  trees, and that appealed to him  with his dripping and ragged clothes clinging to him cold and clammy.     There is no need to tell you much of his adventures that night, for now we are  drawing  near  the  end  of  the  eastward  journey  and  coming  to  the  last  and  greatest  adventure,  so  we  must  hurry  on.  Of  course  helped  by  his  magic  ring  he  got  on   ####-very well  at  first,  but  he was  given  away  in  the  end  by  his wet  footsteps  and  the  trail of drippings that he left wherever he went or sat; and also he began to snivel,  and  wherever  he  tried  to  hide  he  was  found  out  by  the  terrific  explosions  of  his  suppressed  sneezes.  Very  soon  there  was  a  fine  commotion  in  the  village  by  the  riverside; but Bilbo escaped  into  the woods carrying a  loaf and a  leather bottle of  wine and a pie that did not belong to him. The rest of the night he had to pass wet  as he was and far from a fire, but the bottle helped him to do that, and he actually  dozed a little on some dry leaves, even though the year was getting late and the air  was chilly.   He woke again with a specially loud sneeze. It was already grey morning, and  there was a merry racket down by the river. They were making up a raft of barrels,  and  the  raft-elves  would  soon  be  steering  it  off  down  the  stream  to  Lake-town.  Bilbo  sneezed  again.  He  was  no  longer  dripping  but  he  felt  cold  all  over.  He  scrambled down as  fast as his  stiff  legs would  take him and managed  just  in  time  to get on to the mass of casks without being noticed in the general bustle. Luckily  there was  no  sun  at  the  time  to  cast  an  awkward  shadow,  and  for  a mercy he did  not sneeze again for a good while.  There  was  a  mighty  pushing  of  poles.  The  elves  that  were  standing  in  the  shallow  .water  heaved  and  shoved.  The  barrels  now  all  lashed  together  creaked  and fretted.  .  \"This is a heavy load!\" some grumbled. \"They float too deep-some of these are  never  empty.  If  they  had  come  ashore  in  the  daylight, we might  have  had  a  look  inside,\" they said.  \"No time now!\" cried the raftman. \"Shove off!\"  And off they went at last, slowly at first, until they had passed the point of rock  where other elves stood  to fend  them off with poles, and  then quicker and quicker  as  they  caught  the  main  stream  and  went  sailing  away  down,  down  towards  the  Lake.  They  had  escaped  the  dungeons  of  the  king  and  were  through  the wood,  but  whether alive or dead still remains to be seen.     ####-<h4>Chapter 10</h4> <br>   A Warm Welcome     The day grew lighter and warmer as they floated along. After a while the river  rounded  a  steep  shoulder  of  land  that  came  down  upon  their  left. Under  its  rocky  feet  like  an  inland  cliff  the  deepest  stream  had  flowed  lapping  and  bubbling.  Suddenly  the  cliff  fell  away. The  shores  sank. The  trees  ended. Then Bilbo  saw  a  sight: The  lands opened wide  about him,  filled with  the waters of  the  river which  broke  up  and  wandered  in  a  hundred  winding  courses,  or  halted  in  marshes  and  pools  dotted  with  isles  on  every  side:  but  still  a  strong  water  flowed  on  steadily  through  the midst. And  far  away,  its  dark  head  in  a  torn  cloud,  there  loomed  the  Mountain!  Its  nearest  neighbours  to  the  North-East  and  the  tumbled  land  that  joined it to them could not be seen. All alone it rose and looked across the marshes  to  the  forest.  The  Lonely  Mountain!  Bilbo  had  come  far  and  through  many  adventures to see it, and now he did not like the look of it in the least.  As  he  listened  to  the  talk  of  the  raftmen  and  pieced  together  the  scraps  of  information  they  let  fall, he  soon  realized  that he was very  fortunate  ever  to have  seen  it  at  all,  even  from  this  distance."
}