{
  "id": "0183264782e9cc4aa4c4e235f64d82ba65c3d90d",
  "text": "   Wed to Ser Loras, oh… Sansa’s breath caught in her throat. She remembered Ser Loras in his sparkling sapphire armor, tossing her a rose. Ser Loras in white silk, so pure, innocent, beautiful. The dimples at the corner of his mouth when he smiled. The sweetness of his laugh, the warmth of his hand. She could only imagine what it would be like to pull up his tunic and caress the smooth skin underneath, to stand on her toes and kiss him, to run her fingers through those thick brown curls and drown in his deep brown eyes. A flush crept up her neck.   OH, I’M A MAID, AND I’M PURE AND FAIR! I’LL NEVER DANCE WITH A HAIRY BEAR! A BEAR! A BEAR! I’LL NEVER DANCE WITH A HAIRY BEAR!    Would you like that, Sansa?  asked Margaery.  I’ve never had a sister, only brothers. Oh, please say yes, please say that you will consent to marry my brother.   The words came tumbling out of her.  Yes. I will. I would like that more than anything. To wed Ser Loras, to love him…    Loras?  Lady Olenna sounded annoyed.  Don’t be foolish, child. Kingsguard never wed. Didn’t they teach you anything in Winterfell? We were speaking of my grandson Willas. He is a bit old for you, to be sure, but a dear boy for all that. Not the least bit oafish, and heir to Highgarden besides.   Sansa felt dizzy; one instant her head was full of dreams of Loras, and the next they had all been snatched away. Willas? Willas?  I,  she said stupidly. Courtesy is a lady’s armor. You must not offend them, be careful what you say.  I do not know Ser Willas. I have never had the pleasure, my lady. Is he… is he as great a knight as his brothers?    …LIFTED HER HIGH INTO THE AIR! THE BEAR! THE BEAR!    No,  Margaery said.  He has never taken vows.   Her grandmother frowned.  Tell the girl the truth. The poor lad is crippled, and that’s the way of it.    He was hurt as a squire, riding in his first tourney,  Margaery confided.  His horse fell and crushed his leg.    That snake of a Dornishman was to blame, that Oberyn Martell. And his maester as well.    I CALLED FOR A KNIGHT, BUT YOU’RE A BEAR! A BEAR! A BEAR! ALL BLACK AND BROWN AND COVERED WITH HAIR!    Willas has a bad leg but a good heart,  said Margaery.  He used to read to me when I was a little girl, and draw me pictures of the stars. You will love him as much as we do, Sansa.    SHE KICKED AND WAILED, THE MAID SO FAIR, BUT HE LICKED THE HONEY FROM HER HAIR. HER HAIR! HER HAIR! HE LICKED THE HONEY FROM HER HAIR!    When might I meet him?  asked Sansa, hesitantly.   Soon,  promised Margaery.  When you come to Highgarden, after Joffrey and I are wed. My grandmother will take you.    I will,  said the old woman, patting Sansa’s hand and smiling a soft wrinkly smile.  I will indeed.    THEN SHE SIGHED AND SQUEALED AND KICKED THE AIR! MY BEAR! SHE SANG. MY BEAR SO FAIR! AND OFF THEY WENT, FROM HERE TO THERE, THE BEAR, THE BEAR, AND THE MAIDEN FAIR.  Butterbumps roared the last line, leapt into the air, and came down on both feet with a crash that shook the wine cups on the table. The women laughed and clapped.   I thought that dreadful song would never end,  said the Queen of Thorns.  But look, here comes my cheese.       Jon   The world was grey darkness, smelling of pine and moss and cold. Pale mists rose from the black earth as the riders threaded their way through the scatter of stones and scraggly trees, down toward the welcoming fires strewn like jewels across the floor of the river valley below. There were more fires than Jon Snow could count, hundreds of fires, thousands, a second river of flickery lights along the banks of the icy white Milkwater. The fingers of his sword hand opened and closed.  They descended the ridge without banners or trumpets, the quiet broken only by the distant murmur of the river, the clop of hooves, and the clacking of Rattleshirt’s bone armor. Somewhere above an eagle soared on great blue-grey wings, while below came men and dogs and horses and one white direwolf.  A stone bounced down the slope, disturbed by a passing hoof, and Jon saw Ghost turn his head at the sudden sound. He had followed the riders at a distance all day, as was his custom, but when the moon rose over the soldier pines he’d come bounding up, red eyes aglow. Rattleshirt’s dogs greeted him with a chorus of snarls and growls and wild barking, as ever, but the direwolf paid them no mind. Six days ago, the largest hound had attacked him from behind as the wildlings camped for the night, but Ghost had turned and lunged, sending the dog fleeing with a bloody haunch. The rest of the pack maintained a healthy distance after that.  Jon Snow’s garron whickered softly, but a touch and a soft word soon quieted the animal. Would that his own fears could be calmed so easily. He was all in black, the black of the Night’s Watch, but the enemy rode before and behind. Wildlings, and I am with them. Ygritte wore the cloak of Qhorin Halfhand. Lenyl had his hauberk, the big spearwife Ragwyle his gloves, one of the bowmen his boots."
}