{
  "id": "01afc278f9c10bffdfe2cb6fe24a9914bc7b5e43",
  "text": " It was Mance, certain as sunrise. The Others did not light torches.   How do we fight them if we can’t see them?  Horse asked.  Donal Noye turned toward the two great trebuchets that Bowen Marsh had restored to working order.  Give me light!  he roared.  Barrels of pitch were loaded hastily into the slings and set afire with a torch. The wind fanned the flames to a brisk red fury.  NOW!  Noye bellowed. The counterweights plunged downward, the throwing arms rose to thud against the padded crossbars. The burning pitch went tumbling through the darkness, casting an eerie flickering light upon the ground below. Jon caught a glimpse of mammoths moving ponderously through the half-light, and just as quickly lost them again. A dozen, maybe more. The barrels struck the earth and burst. They heard a deep bass trumpeting, and a giant roared something in the Old Tongue, his voice an ancient thunder that sent shivers up Jon’s spine.   Again!  Noye shouted, and the trebuchets were loaded once more. Two more barrels of burning pitch went crackling through the gloom to come crashing down amongst the foe. This time one of them struck a dead tree, enveloping it in flame. Not a dozen mammoths, Jon saw, a hundred.  He stepped to the edge of the precipice. Careful, he reminded himself, it is a long way down. Red Alyn sounded his sentry’s horn once more, Aaaaahoooooooooooooooooooooooooo, aaaaahoooooooooooooooooooo. And now the wildlings answered, not with one horn but with a dozen, and with drums and pipes as well. We are come, they seemed to say, we are come to break your Wall, to take your lands and steal your daughters. The wind howled, the trebuchets creaked and thumped, the barrels flew. Behind the giants and the mammoths, Jon saw men advancing on the Wall with bows and axes. Were there twenty or twenty thousand? In the dark there was no way to tell. This is a battle of blind men, but Mance has a few thousand more of them than we do.   The gate!  Pyp cried out.  They’re at the GATE!   The Wall was too big to be stormed by any conventional means; too high for ladders or siege towers, too thick for battering rams. No catapult could throw a stone large enough to breach it, and if you tried to set it on fire, the icemelt would quench the flames. You could climb over, as the raiders did near Greyguard, but only if you were strong and fit and sure-handed, and even then you might end up like Jarl, impaled on a tree. They must take the gate, or they cannot pass.  But the gate was a crooked tunnel through the ice, smaller than any castle gate in the Seven Kingdoms, so narrow that rangers must lead their garrons through single file. Three iron grates closed the inner passage, each locked and chained and protected by a murder hole. The outer door was old oak, nine inches thick and studded with iron, not easy to break through. But Mance has mammoths, he reminded himself, and giants as well.   Must be cold down there,  said Noye.  What say we warm them up, lads?  A dozen jars of lamp oil had been lined up on the precipice. Pyp ran down the line with a torch, setting them alight. Owen the Oaf followed, shoving them over the edge one by one. Tongues of pale yellow fire swirled around the jars as they plunged downward. When the last was gone, Grenn kicked loose the chocks on a barrel of pitch and sent it rumbling and rolling over the edge as well. The sounds below changed to shouts and screams, sweet music to their ears.  Yet still the drums beat on, the trebuchets shuddered and thumped, and the sound of skinpipes came wafting through the night like the songs of strange fierce birds. Septon Cellador began to sing as well, his voice tremulous and thick with wine.      Gentle Mother, font of mercy,  save our sons from war, we pray,  stay the swords and stay the arrows,  let them know…      Donal Noye rounded on him.  Any man here stays his sword, I’ll chuck his puckered arse right off this Wall… starting with you, Septon. Archers! Do we have any bloody archers?    Here,  said Satin.   And here,  said Mully.  But how can I find a target? It’s black as the inside of a pig’s belly. Where are they?   Noye pointed north.  Loose enough arrows, might be you’ll find a few. At least you’ll make them fretful.  He looked around the ring of firelit faces.  I need two bows and two spears to help me hold the tunnel if they break the gate.  More than ten stepped forward, and the smith picked his four.  Jon, you have the Wall till I return.   For a moment Jon thought he had misheard. It had sounded as if Noye were leaving him in command.  My lord?    Lord? I’m a blacksmith. I said, the Wall is yours.   There are older men, Jon wanted to say, better men. I am still as green as summer grass. I’m wounded, and I stand accused of desertion. His mouth had gone bone dry.  Aye,  he managed.  Afterward it would seem to Jon Snow as if he’d dreamt that night. Side by side with the straw soldiers, with longbows or crossbows clutched in half-frozen hands, his archers launched a hundred flights of arrows against men they never saw."
}