{
  "id": "026a5be8641edcca63922b0a838cda01e28d5121",
  "text": "..\"  \"This place is haunted!\" said Ron.  \"It's not,\" said Lupin, still looking at the door in a puzzled way. \"The Shrieking Shack was never haunted.... The screams and howls the villagers used to hear were made by me.\"  He pushed his graying hair out of his eyes, thought for a moment then said, \"That's where all of this starts -- with my becoming a werewolf, None of this could have happened if I hadn't been bitter... and if I hadn't been so foolhardy...\"  He looked sober and tired. Ron started to interrupt, but Hermione, said, \"Shh!\" She was watching Lupin very intently.  \"I as a very small boy when I received the bite. My parents tried everything, but in those days there was no cure. The potion that Professor Snape has been making for me is a very recent discovery. It makes me safe, you see. As long as I take it in the week, preceding the full moon, I keep my mind when I transform.... I'm able to curl up in my office, a harmless wolf, and wait for the moon to wane again.  \"Before the Wolfsbane Potion was discovered, however, I became a fully fledged monster once a month. It seemed impossible that I would be able to come to Hogwarts. Other parents weren't likely to want their children exposed to me.  \"But then Dumbledore became Headmaster, and he was sympathetic. He said that as long as we took certain precautions, there was no reason I shouldn't come to school....\" Lupin sighed, and looked directly at Harry. \"I told you, months ago, that the Whomping Willow was planted the year I came to Hogwarts. The truth is that it was planted because I came to Hogwarts. This house\" -- Lupin looked miserably around the room, -- \"the tunnel that leads to it -- they were built for my use. Once a month, I was smuggled out of the castle, into this place, to transform. The tree was placed at the tunnel mouth to stop anyone coming across me while I was dangerous.\"  Harry couldn't see where this story was going, but he was listening raptly all the same. The only sound apart from Lupin's voice was Scabbers's frightened squeaking.  \"My transformations in those days were -- were terrible. It is very painful to turn into a werewolf. I was separated from humans to bite, so I bit and scratched myself instead. The villagers heard the noise and the screaming and thought they were hearing particularly violent spirits. Dumbledore encouraged the rumor.... Even now, when the house has been silent for years, the villagers don't dare approach it....\"  \"But apart from my transformations, I was happier than I had ever been in my life. For the first time ever, I had friends, three great friends. Sirius Black... Peter Pettigrew... and, of course, your father, Harry -- James Potter.\"  \"Now, my three friends could hardly fail to notice that I disappeared once a month. I made up all sorts of stories. I told them my mother was ill, and that I had to go home to see her... I was terrified they would desert me the moment they found out what I was. But of course, they, like you, Hermione, worked out the truth....\"  \"And they didn't desert me at all. Instead, they did something for me that would make my transformations not only bearable, but the best times of my life. They became Animagi.\"  \"My dad too?\" said Harry, astounded.  \"Yes, indeed,\" said Lupin. \"It took them the best part of three years to work out how to do it. Your father and Sirius here were the cleverest students in the school, and lucky they were, because the Animagus transformation can go horribly wrong -- one reason the Ministry keeps a close watch on those attempting to do it. Peter needed all the help he could get from James and Sirius. Finally, in our fifth year, they managed it. They could each turn into a different animal at will.\"  \"But how did that help you?\" said Hermione, sounding puzzled.  \"They couldn't keep me company as humans, so they kept me company as animals,\" said Lupin. \"A werewolf is only a danger to people. They sneaked out of the castle every month under James's Invisibility Cloak. They transformed... Peter, as the smallest, could slip beneath the Willow's attacking branches and touch the knot that freezes it. They would then slip down the tunnel and join me. Under their influence, I became less dangerous. My body was still wolfish, but my mind seemed to become less so while I was with them.\"  \"Hurry up, Remus,\" snarled Black, who was still watching Scabbers with a horrible sort of hunger on his face.  \"I'm getting there, Sirius, I'm getting there... well, highly exciting possibilities were open to us now that we could all transform. Soon we were leaving the Shrieking Shack and roaming the school grounds and the village by night. Sirius and James transformed into such large animals, they were able to keep a werewolf in check. I doubt whether any Hogwarts students ever found out more about the Hogwarts grounds and Hogsmeade than we did.... And that's how we came to write the Marauder's Map, and sign it with our nicknames. Sirius is Padfoot. Peter is Wormtail. James was Prongs."
}