{
  "id": "029f35663eb67b89b9b9ac014e1f39a7acfeda40",
  "text": ". . . Bagman wants a word, back in the champions' tent.\" Ron said he would wait, so Harry reentered the tent, which somehow looked quite different now:  friendly and welcoming.  He thought back to how he'd felt while dodging the Horntail, and compared it to the long wait before he'd walked out to face it.... There was no comparison; the wait had been immeasurably worse. Fleur, Cedric, and Krum all came in together.  One side of Cedric's face was covered in a thick orange paste, which was presumably mending his burn.  He grinned at Harry when he saw him. \"Good one, Harry.\" \"And you,\" said Harry, grinning back. \"Well done, all of you!\"  said Ludo Bagman, bouncing into the tent and looking as pleased as though he personally had just got past a dragon.  \"Now, just a quick few words. You've got a nice long break before the second task, which will take place at half past nine on the morning of February the twenty-fourth - but we're giving you something to think about in the meantime!  If you look down at those golden eggs you're all holding, you will see that they open. . . see the hinges there?  You need to solve the clue inside the egg - because it will tell you what the second task is, and enable you to prepare for it!  All clear?  Sure?  Well, off you go, then!\" Harry left the tent, rejoined Ron, and they started to walk back around the edge of the forest, talking hard; Harry wanted to hear what the other champions had done in more detail. Then, as they rounded the clump of trees behind which Harry had first heard the dragons roar, a witch leapt out from behind them. It was Rita Skeeter.  She was wearing acid-green robes today; the Quick-Quotes Quill in her hand blended perfectly against them. \"Congratulations, Harry!\"  she said, beaming at him.  \"I wonder if you could give me a quick word?  How you felt facing that dragon?  How you feel now, about the fairness of the scoring?\" \"Yeah, you can have a word,\" said Harry savagely. \"Good-bye.\" And he set off back to the castle with Ron.  CHAPTER TWENTY-ONE - THE HOUSE-ELF LIBERATION FRONT    Harry, Ron, and Hermione went up to the Owlery that evening to find Pigwidgeon, so that Harry could send Sirius a letter telling him that he had managed to get past his dragon unscathed.  On the way, Harry filled Ron in on everything Sirius had told him about Karkaroff. Though shocked at first to hear that Karkaroff had been a Death Eater, by the time they entered the Owlery Ron was saying that they ought to have suspected it all along.   \"Fits, doesn't it?\"  he said.  \"Remember what Malfoy said on the train, about his dad being friends with Karkaroff?  Now we know where they knew each other.  They were probably running around in masks together at the World Cup.... I'll tell you one thing, though, Harry, if it was Karkaroff who put your name in the goblet, he's going to be feeling really stupid now, isn't he?  Didn't work, did it?  You only got a scratch!  Come here - I'll do it -\" Pigwidgeon was so overexcited at the idea of a delivery he was flying around and around Harry's head, hooting incessantly.  Ron snatched Pigwidgeon out of the air and held him still while Harry attached the letter to his leg. \"There's no way any of the other tasks are going to be that dangerous, how could they be?\"  Ron went on as he carried Pigwidgeon to the window.  \"You know what? I reckon you could win this tournament, Harry, I'm serious.\" Harry knew that Ron was only saying this to make up for his behavior of the last few weeks, but he appreciated it all the same.  Hermione, however, leaned against the Owlery wall, folded her arms, and frowned at Ron. \"Harry's got a long way to go before he finishes this tournament,\" she said seriously.  \"If that was the first task, I hate to think what's coming next.\" \"Right little ray of sunshine, aren't you?\"  said Ron.  \"You and Professor Trelawney should get together sometime.\" He threw Pigwidgeon out of the window.  Pigwidgeon plummeted twelve feet before managing to pull himself back up again; the letter attached to his leg was much longer and heavier than usual - Harry hadn't been able to resist giving Sirius a blow-by-blow account of exactly how he had swerved, circled, and dodged the Horntail.  They watched Pigwidgeon disappear into the darkness, and then Ron said, \"Well, we'd better get downstairs for your surprise party, Harry - Fred and George should have nicked enough food from the kitchens by now.\" Sure enough, when they entered the Gryffindor common room it exploded with cheers and yells again.  There were mountains of cakes and flagons of pumpkin juice and butterbeer on every surface; Lee Jordan had let off some Filibuster's Fireworks, so that the air was thick with stars and sparks; and Dean Thomas, who was very good at drawing, had put up some impressive new banners, most of which depicted Harry zooming around the Horntail's head on his Firebolt, though a couple showed Cedric with his head on fire. Harry helped himself to food; he had almost forgotten what it was like to feel properly hungry, and sat down with Ron and Hermione."
}