{
  "id": "03bacc8933c8c7cd0c473eb6c142e637542c0d0e",
  "text": " Enough drink will make blind washerwomen and reeking pig girls seem as comely as you, sweetling.   Me?    Try not to sound so like a mouse, Sansa. You’re a woman now, remember? And betrothed to my firstborn.  The queen sipped at her wine.  Were it anyone else outside the gates, I might hope to beguile him. But this is Stannis Baratheon. I’d have a better chance of seducing his horse.  She noticed the look on Sansa’s face, and laughed.  Have I shocked you, my lady?  She leaned close.  You little fool. Tears are not a woman’s only weapon. You’ve got another one between your legs, and you’d best learn to use it. You’ll find men use their swords freely enough. Both kinds of swords.   Sansa was spared the need to reply when two Kettleblacks reentered the hall. Ser Osmund and his brothers had become great favorites about the castle; they were always ready with a smile and a jest, and got on with grooms and huntsmen as well as they did with knights and squires. With the serving wenches they got on best of all, it was gossiped. Of late Ser Osmund had taken Sandor Clegane’s place by Joffrey’s side, and Sansa had heard the women at the washing well saying he was as strong as the Hound, only younger and faster. If that was so, she wondered why she had never once heard of these Kettleblacks before Ser Osmund was named to the Kingsguard.  Osney was all smiles as he knelt beside the queen.  The hulks have gone up, Y’Grace. The whole Blackwater’s awash with wildfire. A hundred ships burning, maybe more.    And my son?    He’s at the Mud Gate with the Hand and the Kingsguard, Y’Grace. He spoke to the archers on the hoardings before, and gave them a few tips on handling a crossbow, he did. All agree, he’s a right brave boy.    He’d best remain a right live boy.  Cersei turned to his brother Osfryd, who was taller, sterner, and wore a drooping black mustache.  Yes?   Osfryd had donned a steel halfhelm over his long black hair, and the look on his face was grim,  Y’Grace,  he said quietly,  the boys caught a groom and two maidservants trying to sneak out a postern with three of the king’s horses.    The night’s first traitors,  the queen said,  but not the last, I fear. Have Ser Ilyn see to them, and put their heads on pikes outside the stables as a warning.  As they left, she turned to Sansa.  Another lesson you should learn, if you hope to sit beside my son. Be gentle on a night like this and you’ll have treasons popping up all about you like mushrooms after a hard rain. The only way to keep your people loyal is to make certain they fear you more than they do the enemy.    I will remember, Your Grace,  said Sansa, though she had always heard that love was a surer route to the people’s loyalty than fear. If I am ever a queen, I’ll make them love me.  Crabclaw pies followed the salad. Then came mutton roasted with leeks and carrots, served in trenchers of hollowed bread. Lollys ate too fast, got sick, and retched all over herself and her sister. Lord Gyles coughed, drank, coughed, drank, and passed out. The queen gazed down in disgust to where he sprawled with his face in his trencher and his hand in a puddle of wine.  The gods must have been mad to waste manhood on the likes of him, and I must have been mad to demand his release.   Osfryd Kettleblack returned, crimson cloak swirling.  There’s folks gathering in the square, Y’Grace, asking to take refuge in the castle. Not a mob, rich merchants and the like.    Command them to return to their homes,  the queen said.  If they won’t go, have our crossbowmen kill a few. No sorties; I won’t have the gates opened for any reason.    As you command.  He bowed and moved off.  The queen’s face was hard and angry.  Would that I could take a sword to their necks myself.  Her voice was starting to slur.  When we were little, Jaime and I were so much alike that even our lord father could not tell us apart. Sometimes as a lark we would dress in each other’s clothes and spend a whole day each as the other. Yet even so, when Jaime was given his first sword, there was none for me. ‘What do I get?’ I remember asking. We were so much alike, I could never understand why they treated us so differently. Jaime learned to fight with sword and lance and mace, while I was taught to smile and sing and please. He was heir to Casterly Rock, while I was to be sold to some stranger like a horse, to be ridden whenever my new owner liked, beaten whenever he liked, and cast aside in time for a younger filly. Jaime’s lot was to be glory and power, while mine was birth and moonblood.    But you were queen of all the Seven Kingdoms,  Sansa said.   When it comes to swords, a queen is only a woman after all.   Cersei’s wine cup was empty. The page moved to fill it again, but she turned it over and shook her head.  No more. I must keep a clear head.   The last course was goat cheese served with baked apples. The scent of cinnamon filled the hall as Osney Kettleblack slipped in to kneel once more between them.  Y’Grace,  he murmured."
}