{
  "id": "03e3a64a02285c6ab2c356fd135a70117371926a",
  "text": " Thinking of Osha made Bran wonder where she was. He pictured her safe in White Harbor with Rickon and Shaggydog, eating eels and fish and hot crab pie with fat Lord Manderly. Or maybe they were warming themselves at the Last Hearth before the Greatjon’s fires. But Bran’s life had turned into endless chilly days on Hodor’s back, riding his basket up and down the slopes of mountains.   Up and down,  Meera would sigh sometimes as they walked,  then down and up. Then up and down again. I hate these stupid mountains of yours, Prince Bran.    Yesterday you said you loved them.    Oh, I do. My lord father told me about mountains, but I never saw one till now. I love them more than I can say.   Bran made a face at her.  But you just said you hated them.    Why can’t it be both?  Meera reached up to pinch his nose.   Because they’re different,  he insisted.  Like night and day, or ice and fire.    If ice can burn,  said Jojen in his solemn voice,  then love and hate can mate. Mountain or marsh, it makes no matter. The land is one.    One,  his sister agreed,  but over wrinkled.   The high glens seldom did them the courtesy of running north and south, so often they found themselves going long leagues in the wrong direction, and sometimes they were forced to double back the way they’d come.  If we took the kingsroad we could be at the Wall by now,  Bran would remind the Reeds. He wanted to find the three-eyed crow, so he could learn to fly. Half a hundred times he said it if he said it once, until Meera started teasing by saying it along with him.   If we took the kingsroad we wouldn’t be so hungry either,  he started saying then. Down in the hills they’d had no lack of food. Meera was a fine huntress, and even better at taking fish from streams with her three-pronged frog spear. Bran liked to watch her, admiring her quickness, the way she sent the spear lancing down and pulled it back with a silvery trout wriggling on the end of it. And they had Summer hunting for them as well. The direwolf vanished most every night as the sun went down, but he was always back again before dawn, most often with something in his jaws, a squirrel or a hare.  But here in the mountains, the streams were smaller and more icy, and the game scarcer. Meera still hunted and fished when she could, but it was harder, and some nights even Summer found no prey. Often they went to sleep with empty bellies.  But Jojen remained stubbornly determined to stay well away from roads.  Where you find roads you find travelers,  he said in that way he had,  and travelers have eyes to see, and mouths to spread tales of the crippled boy, his giant, and the wolf that walks beside them.  No one could get as stubborn as Jojen, so they struggled on through the wild, and every day climbed a little higher, and moved a little farther north.  Some days it rained, some days were windy, and once they were caught in a sleet storm so fierce that even Hodor bellowed in dismay. On the clear days, it often seemed as if they were the only living things in all the world.  Does no one live up here?  Meera Reed asked once, as they made their way around a granite upthrust as large as Winterfell.   There’s people,  Bran told her.  The Umbers are mostly east of the kingsroad, but they graze their sheep in the high meadows in summer. There are Wulls west of the mountains along the Bay of Ice, Harclays back behind us in the hills, and Knotts and Liddles and Norreys and even some Flints up here in the high places.  His father’s mother’s mother had been a Flint of the mountains. Old Nan once said that it was her blood in him that made Bran such a fool for climbing before his fall. She had died years and years and years before he was born, though, even before his father had been born.   Wull?  said Meera.  Jojen, wasn’t there a Wull who rode with Father during the war?    Theo Wull.  Joien was breathing hard from the climb.  Buckets, they used to call him.    That’s their sigil,  said Bran.  Three brown buckets on a blue field, with a border of white and grey checks. Lord Wull came to Winterfell once, to do his fealty and talk with Father, and he had the buckets on his shield. He’s no true lord, though. Well, he is, but they call him just the Wull, and there’s the Knott and the Norrey and the Liddle too. At Winterfell we called them lords, but their own folk don’t.   Jojen Reed stopped to catch his breath.  Do you think these mountain folk know we’re here?    They know.  Bran had seen them watching; not with his own eyes, but with Summer’s sharper ones, that missed so little.  They won’t bother us so long as we don’t try and make off with their goats or horses.   Nor did they. Only once did they encounter any of the mountain people, when a sudden burst of freezing rain sent them looking for shelter. Summer found it for them, sniffing out a shallow cave behind the greygreen branches of a towering sentinel tree, but when Hodor ducked beneath the stony overhang, Bran saw the orange glow of fire farther back and realized they were not alone."
}