{
  "id": "040cae729fbce0869451c0f8d1a0ac163537c93f",
  "text": " So  the Wargs  had  no  intention  of  going  away  and  letting  the  people  up  the  trees escape, at any rate not until morning. And long before that, they said, goblin  soldiers would be coming down  from  the mountains; and goblins can climb  trees,  or cut them down.  Now you can understand why Gandalf, listening to their growling and yelping,  began  to be dreadfully afraid, wizard  though he was, and  to feel  that  they were  in  a very bad place, and had not yet escaped at all. All  the same he was not going to  let them have it all their own way, though he could not do very much stuck up in a  tall  tree  with  wolves  all  round  on  the  ground  below.  He  gathered  the  huge  pinecones  from  the  branches  of  his  tree.  Then  he  set  one  alight  with  bright  blue  fire, and  threw  it whizzing down among  the circle of  the wolves.  It  struck one on  the back, and  immediately his shaggy coat caught  fire, and he was  leaping  to and  fro  yelping  horribly.  Then  another  came  and  another,  one  in  blue  flames,  one  in  red,  another  in  green.  They  burst  on  the  ground  in  the  middle  of  the  circle  and  went off in coloured sparks and smoke. A specially large one hit the chief wolf on  the  nose,  and  he  leaped  in  the  air  ten  feet,  and  then  rushed  round  and  round  the  circle biting and snapping even at the other wolves in his anger and fright.  The  dwarves  and  Bilbo  shouted  and  cheered.  The  rage  of  the  wolves  was  terrible  to  see,  and  the  commotion  they  made  filled  all  the  forest.  Wolves  are   afraid of fire at all times, but this was a most horrible and uncanny fire. If a spark  got  in  their coats  it stuck and burned  into  them, and unless  they  rolled over quick  they  were  soon  all  in  flames.  Very  soon  all  about  the  glade  wolves  were  rolling  over  and over  to put out  the  sparks on  their backs, while  those  that  were burning  were running about howling and setting others alight, till their own friends chased  them  away  and  they  fled  off  down  the  slopes  crying  and  yammering  and  looking  for water.     \"What's  all  this  uproar  in  the  forest  tonight?\"  said  the  Lord  of  the  Eagles. He  was  sitting,  black  in  the moonlight,  on  the  top  of  a  lonely  pinnacle  of  rock  at  the   ####-eastern edge of  the mountains. \"I hear wolves' voices! Are  the goblins at mischief  in the woods?\"  He swept up  into  the air, and  immediately  two of his guards  from the rocks at  either hand  leaped up  to  follow him. They circled up  in  the sky and  looked down  upon  the  ring  of  the Wargs,  a  tiny  spot  far  far  below.  But  eagles  have  keen  eyes  and  can  see  small  things  at  a  great  distance.  The  lord  of  the  eagles  of  the  Misty  Mountains had eyes  that could  look at  the  sun unblinking, and could  see a  rabbit  moving on the ground a mile below even in the moonlight. So though he could not  see  the  people  in  the  trees,  he  could make  out  the  commotion  among  the wolves  and  see  the  tiny  flashes  of  fire,  and  hear  the  howling  and  yelping  come  up  faint  from far beneath him. Also he could see the glint of the moon on goblin spears and  helmets,  as  long  lines  of  the wicked  folk  crept  down  the  hillsides  from  their  gate  and wound into the wood.  Eagles are not kindly birds. Some are cowardly and cruel. But the ancient race  of  the  northern  mountains  were  the  greatest  of  all  birds;  they  were  proud  and  strong and noble-hearted. They did not love goblins, or fear them. When they took  any  notice  of  them at all (which was seldom, for they did not eat such creatures ),  they  swooped on  them and drove  them  shrieking back  to  their caves, and  stopped  whatever  wickedness  they  were  doing.  The  goblins  hated  the  eagles  and  feared  them, but could not reach their lofty seats, or drive them from the mountains.  Tonight  the  Lord  of  the  Eagles  was  filled  with  curiosity  to  know  what  was  afoot;  so  he  summoned  many  other  eagles  to  him,  and  they  flew  away  from  the  mountains,  and  slowly  circling  ever  round  and  round  they  came  down,  down,  down towards the ring of the wolves and the meeting-place of the goblins.  A  very  good  thing  too!  Dreadful  things  had  been  going  on  down  there.  The  wolves  that  had  caught  fire  and  fled  into  the  forest  had  set  it  alight  in  several  places.  It  was  high  summer,  and  on  this  eastern  side  of  the  mountains  there  had  been little rain for some time. Yellowing bracken, fallen branches, deep-piled pine- needles, and here and there dead trees, were soon in flames. All round the clearing  of  the  Wargs  fire  was  leaping.  But  the  wolf-guards  did  not  leave  the  trees.  Maddened and angry they were leaping and howling round the trunks, and cursing  the  dwarves  in  their  horrible  language,  with  their  tongues  hanging  out,  and  their  eyes shining as red and fierce as the flames."
}