{
  "id": "04259dc18ce2b1976f7b016c2ad5ecb410483951",
  "text": " Oh, Robert loved him, to be sure. Loved him as a brother, how often did I hear that? I was his brother, not Ned Stark, but you would never have known it by the way he treated me. I held Storm’s End for him, watching good men starve while Mace Tyrell and Paxter Redwyne feasted within sight of my walls. Did Robert thank me? No. He thanked Stark, for lifting the siege when we were down to rats and radishes. I built a fleet at Robert’s command, took Dragonstone in his name. Did he take my hand and say, Well done, brother, whatever should I do without you? No, he blamed me for letting Willem Darry steal away Viserys and the babe, as if I could have stopped it. I sat on his council for fifteen years, helping Jon Arryn rule his realm while Robert drank and whored, but when Jon died, did my brother name me his Hand? No, he went galloping off to his dear friend Ned Stark, and offered him the honor. And small good it did either of them.     Be that as it may, my lord,  Maester Cressen said gently.  Great wrongs have been done you, but the past is dust. The future may yet be won if you join with the Starks. There are others you might sound out as well. What of Lady Arryn? If the queen murdered her husband, surely she will want justice for him. She has a young son, Jon Arryn’s heir. If you were to betroth Shireen to him—    The boy is weak and sickly,  Lord Stannis objected.  Even his father saw how it was, when he asked me to foster him on Dragonstone. Service as a page might have done him good, but that damnable Lannister woman had Lord Arryn poisoned before it could be done, and now Lysa hides him in the Eyrie. She’ll never part with the boy, I promise you that.     Then you must send Shireen to the Eyrie,  the maester urged.  Dragonstone is a grim home for a child. Let her fool go with her, so she will have a familiar face about her.    Familiar and hideous.  Stannis furrowed his brow in thought.  Still… perhaps it is worth the trying…   Must the rightful Lord of the Seven Kingdoms beg for help from widow women and usurpers?  a woman’s voice asked sharply.  Maester Cressen turned sand bowed his head.  My lady,  he said, chagrined that he had not heard her enter.  Lord Stannis scowled.  I do not beg. Of anyone. Mind you remember that, woman.    I am pleased to hear it, my lord.  Lady Selyse was as tall as her husband, thin of body and thin of face, with prominent ears, a sharp nose, and the faintest hint of a mustache on her upper lip. She plucked it daily and cursed it regularly, yet it never failed to return. Her eyes were pale, her mouth stern, her voice a whip. She cracked it now.  Lady Arryn owes you her allegiance, as do the Starks, your brother Renly, and all the rest. You are their one true king. It would not be fitting to plead and bargain with them for what is rightfully yours by the grace of god.   God, she said, not gods. The red woman had won her, heart and soul, turning her from the gods of the Seven Kingdoms, both old and new, to worship the one they called the Lord of Light.   Your god can keep his grace,  said Lord Stannis, who did not share his wife’s fervent new faith.  It’s swords I need, not blessings. Do you have an army hidden somewhere that you’ve not told me of?  There was no affection in his tone. Stannis had always been uncomfortable around women, even his own wife. When he had gone to King’s Landing to sit on Robert’s council, he had left Selyse on Dragonstone with their daughter. His letters had been few, his visits fewer; he did his duty in the marriage bed once or twice a year, but took no joy in it, and the sons he had once hoped for had never come.   My brothers and uncles and cousins have armies,  she told him.  House Florent will rally to your banner.    House Florent can field two thousand swords at best.  It was said that Stannis knew the strength of every house in the Seven Kingdoms.  And you have a deal more faith in your brothers and uncles than I do, my lady. The Florent lands lie too close to Highgarden for your lord uncle to risk Mace Tyrell’s wrath.    There is another way.  Lady Selyse moved closer.  Look out your windows, my lord. There is the sign you have waited for, blazoned on the sky. Red, it is, the red of flame, red for the fiery heart of the true god. it is his banner—and yours! See how it unfurls across the heavens like a dragon’s hot breath, and you the Lord of Dragonstone. It means your time has come, Your Grace. Nothing is more certain. You are meant to sail from this desolate rock as Aegon the Conqueror once sailed, to sweep all before you as he did. Only say the word, and embrace the power of the Lord of Light.    How many swords will the Lord of Light put into my hand?  Stannis demanded again.   All you need,  his wife promised,  The swords of Storm’s End and Highgarden for a start, and all their lords bannermen.    Davos would tell you different,  Stannis said.  Those swords are sworn to Renly. They love my charming young brother, as they once loved Robert… and as they have never loved me."
}