{
  "id": "044a1e80445a28dc3e510bcc90b588c5a4b99515",
  "text": " Lord Beric still held the blade he’d used to dub Gendry. Maybe this time they’ll kill him.  The Hound’s mouth gave another twitch.  You’re no more than common thieves.   Lem glowered.  Your lion friends ride into some village, take all the food and every coin they find, and call it foraging. The wolves as well, so why not us? No one robbed you, dog. You just been good and foraged.   Sandor Clegane looked at their faces, every one, as if he were trying to commit them all to memory. Then he walked back out into the darkness and the pouring rain from whence he’d come, with never another word. The outlaws waited, wondering…   I best go see what he did to our sentries.  Harwin took a wary look out the door before he left, to make certain the Hound was not lurking just outside.   How’d that bloody bastard get all that gold anyhow?  Lem Lemoncloak said, to break the tension.  Anguy shrugged.  He won the Hand’s tourney. In King’s Landing.  The bowman grinned.  I won a fair fortune myself, but then I met Dancy, Jayde, and Alayaya. They taught me what roast swan tastes like, and how to bathe in Arbor wine.    Pissed it all away, did you?  laughed Harwin.   Not all. I bought these boots, and this excellent dagger.    You ought t’have bought some land and made one o’ them roast swan girls an honest woman,  said Jack-Be-Lucky.  Raised yourself a crop o’ turnips and a crop o’ sons.    Warrior defend me! What a waste that would have been, to turn my gold to turnips.    I like turnips,  said Jack, aggrieved.  I could do with some mashed turnips right now.   Thoros of Myr paid no heed to the banter.  The Hound has lost more than a few bags of coin,  he mused.  He has lost his master and kennel as well. He cannot go back to the Lannisters, the Young Wolf would never have him, nor would his brother be like to welcome him. That gold was all he had left, it seems to me.    Bloody hell,  said Watty the Miller.  He’ll come murder us in our sleep for sure, then.    No.  Lord Beric had sheathed his sword.  Sandor Clegane would kill us all gladly, but not in our sleep. Anguy, on the morrow, take the rear with Beardless Dick. If you see Clegane still sniffing after us, kill his horse.    That’s a good horse,  Anguy protested.   Aye,  said Lem.  It’s the bloody rider we should be killing. We could use that horse.    I’m with Lem,  Notch said.  Let me feather the dog a few times, discourage him some.   Lord Beric shook his head.  Clegane won his life beneath the hollow hill. I will not rob him of it.    My lord is wise,  Thoros told the others.  Brothers, a trial by battle is a holy thing. You heard me ask R’hllor to take a hand, and you saw his fiery finger snap Lord Beric’s sword, just as he was about to make an end of it. The Lord of Light is not yet done with Joffrey’s Hound, it would seem.   Harwin soon returned to the brewhouse.  Puddingfoot was sound asleep, but unharmed.    Wait till I get hold of him,  said Lem.  I’ll cut him a new bunghole. He could have gotten every one of us killed.   No one rested very comfortably that night, knowing that Sandor Clegane was out there in the dark, somewhere close. Arya curled up near the fire, warm and snug, yet sleep would not come. She took out the coin that Jaqen H’ghar had given her and curled her fingers around it as she lay beneath her cloak. It made her feel strong to hold it, remembering how she’d been the ghost in Harrenhal. She could kill with a whisper then.  Jaqen was gone, though. He’d left her. Hot Pie left me too, and now Gendry is leaving. Lommy had died, Yoren had died, Syrio Forel had died, even her father had died, and Jaqen had given her a stupid iron penny and vanished.  Valar morghulis,  she whispered softly, tightening her fist so the hard edges of the coin dug into her palm.  Ser Gregor, Dunsen, Polliver, Raff the Sweetling. The Tickler and the Hound. Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei.  Arya tried to imagine how they would look when they were dead, but it was hard to bring their faces to mind. The Hound she could see, and his brother the Mountain, and she would never forget Joffrey’s face, or his mother’s… but Raff and Dunsen and Polliver were all fading, and even the Tickler, whose looks had been so commonplace.  Sleep took her at last, but in the black of night Arya woke again, tingling. The fire had burned down to embers. Mudge stood by the door, and another guard was pacing outside. The rain had stopped, and she could hear wolves howling. So close, she thought, and so many. They sounded as if they were all around the stable, dozens of them, maybe hundreds. I hope they eat the Hound. She remembered what he’d said, about wolves and dogs.  Come morning, Septon Utt still swung beneath the tree, but the brown brothers were out in the rain with spades, digging shallow graves for the other dead. Lord Beric thanked them for the night’s lodging and the meal, and gave them a bag of silver stags to help rebuild. Harwin, Likely Luke, and Watty the Miller went out scouting, but neither wolves nor hounds were found."
}