{
  "id": "04db48464d480b31540d281adff3b458c2d2dabd",
  "text": " Arms reached through the portrait hole to pull Harry and Ron inside, leaving Hermione to scramble in after then-t.  \"Brilliant!\" yelled Lee Jordan. \"Inspired! What an entrance! Flying a car right into the Whomping Willow, people'll be talking about that one for years -\"  \"Good for you,\" said a fifth year Harry had never spoken to; someone was patting him on the back as though he'd just won a marathon; Fred and George pushed their way to the front of the crowd and said together, \"Why couldn't we've come in the car, eh?\"  84  Ron was scarlet in the face, grinning embarrassedly, but Harry could see one person who didn't look happy at all. Percy was visible over the heads of some excited first years, and he seemed to be trying to get near enough to start telling them off. Harry nudged Ron in the ribs and nodded in Percy's direction. Ron got the point at once.  \"Got to get upstairs - bit tired,\" he said, and the two of them started pushing their way toward the door on the other side of the room, which led to a spiral staircase and the dormitories.  \"'Night,\" Harry called back to Hermione, who was wearing a scowl just like Percy's.  They managed to get to the other side of the common room, still having their backs slapped, and gained the peace of the staircase. They hurried up it, right to the top, and at last reached the door of their old dormitory, which now had a sign on it saying SECOND YEARS. They entered the familiar, circular room, with its five four-posters hung with red velvet and its high, narrow windows. Their trunks had been brought up for them and stood at the ends of their beds.  Ron grinned guiltily at Harry.  \"I know I shouldn't've enjoyed that or anything, but ='  The dormitory door flew open and in came the other second year Gryffindor boys, Seamus Finnigan, Dean Thomas, and Neville Longbottom.  \"Unbelievable!\" beamed Seamus.  \"Cool,\" said Dean.  \"Amazing,\" said Neville, awestruck.  Harry couldn't help it. He grinned, too.  * 85 *  H-H A P T E RR  s 1 x  GILDEROY LOCKHART  he next day, however, Harry barely grinned once. Things started to go downhill from breakfast in the Great Hall. The four long house tables were laden with tureens of porridge, plates of kippers, mountains of toast, and dishes of eggs and bacon, beneath the enchanted ceiling (today, a dull, cloudy gray). Harry and Ron sat down at the Gryffindor table next to Hermione, who had her copy of Voyages with Vampires propped open against a milk jug. There was a slight stiffness in the way she said \"Morning,\" which told Harry that she was still disapproving of the way they had arrived. Neville Longbottom, on the other hand, greeted them cheerfully. Neville was a round-faced and accident-prone boy with the worst memory of anyone Harry had ever met.  \"Mail's due any minute - I think Gran's sending a few things I forgot.\"  Harry had only just started his porridge when, sure enough, there was a rushing sound overhead and a hundred or so owls  86    streamed in, circling the hall and dropping letters and packages into the chattering crowd. A big, lumpy package bounced off Neville's head and, a second later, something large and gray fell into Hermione's jug, spraying them all with milk and feathers.  \"Enrol!\" said Ron, pulling the bedraggled owl out by the feet. Errol slumped, unconscious, onto the table, his legs in the air and a damp red envelope in his beak.  \"Oh, no -\" Ron gasped.  \"It's all right, he's still alive,\" said Hermione, prodding Errol gently with the tip of her finger.  \"It's not that - it's that.\"  Ron was pointing at the red envelope. It looked quite ordinary to Harry, but Ron and Neville were both looking at it as though they expected it to explode.  \"What's the matter?\" said Harry.  \"She's - she's sent me a Howler,\" said Ron faintly.  \"You'd better open it, Ron,\" said Neville in a timid whisper. \"It'll be worse if you don't My gran sent me one once, and I ignored it and\" - he gulped - \"it was horrible.\"  Harry looked from their petrified faces to the red envelope.  \"What's a Howler?\" he said.  But Ron's whole attention was fixed on the letter, which had begun to smoke at the corners.  \"Open it,\" Neville urged. \"It'll all be over in a few minutes -\"  Ron stretched out a shaking hand, eased the envelope from Errol's beak, and slit it open. Neville stuffed his fingers in his ears. A split second later, Harry knew why. He thought for a moment it had exploded; a roar of sound fiIled the huge hall, shaking dust from the ceiling.  8 _  \"- E CAR, I WO ULDN'T HAVE BEEN S UR-  STEALING THE  PRISED IF THEY'D EXPELLED YOU, YOU WAIT TILL I GET HOLD OF YOU, I DON'T SUPPOSE YOU STOPPED TO THINK WHAT YOUR FATHERAND I WENT THROUGH WHEN WE SAW IT WAS GONE -\"  Mrs. Weasleys yells, a hundred times louder than usual, made the plates and spoons rattle on the table, and echoed deafeningly off the stone walls. People throughout the hall were swiveling around to see who had received the Howler, and Ron sank so low in his chair that only his crimson forehead could be seen."
}