{
  "id": "055be773f60bb0842e8faf9f7bace39cd38b64b7",
  "text": "  Wood took a moment to regain control of himself. Their last defeat was clearly still torturing him.  \"So this year, we train harder than ever before .... Okay, let's go and put our new theories into practice!\" Wood shouted, seizing his broomstick and leading the way out of the locker rooms. Stifflegged and still yawning, his team followed.  They had been in the locker room so long that the sun was up completely now, although remnants of mist hung over the grass in the stadium. As Harry walked onto the field, he saw Ron and Hermione sitting in the stands.  \"Aren't you finished yet?\" called Ron incredulously.  \"Haven't even started,\" said Harry, looking jealously at the toast and marmalade Ron and Hermione had brought out of the Great Hall. \"Wood's been teaching us new moves.\"  He mounted his broomstick and kicked at the ground, soaring up into the air. The cool morning air whipped his face, waking him far more effectively than Wood's long talk. It felt wonderful to be back on the Quidditch field. He soared right around the stadium at full speed, racing Fred and George.  \"What's that funny clicking noise?\" called Fred as they hurtled around the corner.  Harry looked into the stands. Colin was sitting in one of the highest seats, his camera raised, taking picture after picture, the sound strangely magnified in the deserted stadium.  *io9*  \"Look this way, Harry! This way!\" he cried shrilly.  \"Who's that?\" said Fred.  \"No idea,\" Harry lied, putting on a spurt of speed that took him as far away as possible from Colin.  \"What's going on?\" said Wood, frowning, as he skimmed through the air toward them. \"Why's that first year taking pictures? I don't like it. He could be a Slytherin spy, trying to find out about our new training program.\"  \"He's in Gryffindor,\" said Harry quickly.  \"And the Slytherins don't need a spy, Oliver,\" said George.  \"What makes you say that?\" said Wood testily.  \"Because they're here in person,\" said George, pointing.  Several people in green robes were walking onto the field, broomsticks in their hands.  \"I don't believe it!\" Wood hissed in outrage. \"I booked the field for today! We'll see about this!\"  Wood shot toward the ground, landing rather harder than he meant to in his anger, staggering slightly as he dismounted. Harry, Fred, and George followed.  \"Flint!\" Wood bellowed at the Slytherin Captain. \"This is our practice time! We got up specially! You can clear off now!\"  Marcus Flint was even larger than Wood. He had a look of trollish cunning on his face as he replied, \"Plenty of room for all of us, Wood.\"  Angelina, Alicia, and Katie had come over, too. There were no girls on the Slytherin team, who stood shoulder to shoulder, facing the Gryffindors, leering to a man.  \"But I booked the field!\" said Wood, positively spitting with rage. \"I booked it!\"  *110*  \"Ah,\" said Flint. \"But I've got a specially signed note here from Professor Snape. `I, Professor S. Snape, give the Slytherin team permission to practice today on the Quidditch field owing to the need to train their new Seeker.\"'  \"You've got a new Seeker?\" said Wood, distracted. \"Where?\"  And from behind the six large figures before them came a seventh, smaller boy, smirking all over his pale, pointed face. It was Draco Malfoy.  \"Aren't you Lucius Malfoy's son?\" said Fred, looking at Malfoy with dislike.  \"Funny you should mention Draco's father,\" said Flint as the whole Slytherin team smiled still more broadly. \"Let me show you the generous gift he's made to the Slytherin team.\"  All seven of them held out their broomsticks. Seven highly polished, brand-new handles and seven sets of fine gold lettering spelling the words Nimbus Two Thousand and One gleamed under the Gryffindors' noses in the early morning sun.  \"Very latest model. Only came out last month,\" said Flint carelessly, flicking a speck of dust from the end of his own. \"I believe it outstrips the old Two Thousand series by a considerable amount. As for the old Cleansweeps\" - he smiled nastily at Fred and George, who were both clutching Cleansweep Fives - \"sweeps the board with them.\"  None of the Gryffindor team could think of anything to say for a moment. Malfoy was smirking so broadly his cold eyes were reduced to slits.  \"Oh, look,\" said Flint. \"A field invasion.\"  Ron and Hermione were crossing the grass to see what was going on.  *111*  \"What's happening?\" Ron asked Harry. \"Why aren't you playing? And what's he doing here?\"  He was looking at Malfoy, taking in his Slytherin Quidditch robes.  \"I'm the new Slytherin Seeker, Weasley,\" said Malfoy, smugly. \"Everyone's just been admiring the brooms my father's bought our team.  Ron gaped, open-mouthed, at the seven superb broomsticks in front of him.  \"Good, aren't they?\" said Malfoy smoothly. \"But perhaps the Gryffindor team will be able to raise some gold and get new brooms, too. You could raffle off those Cleansweep Fives; I expect a museum would bid for them.\"  The Slytherin team howled with laughter.  \"At least no one on the Gryffindor team had to buy their way in,\" said Hermione sharply."
}