{
  "id": "05735c061d07c6ad149849d0aca49b68795eeea3",
  "text": " The guests would soon be pouring into the throne room, full of anticipation; this would be an evening of song and splendor, designed not only to unite Highgarden and Casterly Rock but to trumpet their power and wealth as a lesson to any who might still think to oppose Joffrey’s rule.  But who would be mad enough to contest Joffrey’s rule now, after what had befallen Stannis Baratheon and Robb Stark? There was still fighting in the riverlands, but everywhere the coils were tightening. Ser Gregor Clegane had crossed the Trident and seized the ruby ford, then captured Harrenhal almost effortlessly. Seagard had yielded to Black Walder Frey, Lord Randyll Tarly held Maidenpool, Duskendale, and the kingsroad. In the west, Ser Daven Lannister had linked up with Ser Forley Prester at the Golden Tooth for a march on Riverrun. Ser Ryman Frey was leading two thousand spears down from the Twins to join them. And Paxter Redwyne claimed his fleet would soon set sail from the Arbor, to begin the long voyage around Dorne and through the Stepstones. Stannis’s Lyseni pirates would be outnumbered ten to one. The struggle that the maesters were calling the War of the Five Kings was all but at an end. Mace Tyrell had been heard complaining that Lord Tywin had left no victories for him.   My lord?  Pod was at his side.  Will you be changing? I laid out the doublet. On your bed. For the feast.    Feast?  said Tyrion sourly.  What feast?    The wedding feast.  Pod missed the sarcasm, of course.  King Joffrey and Lady Margaery. Queen Margaery, I mean.   Tyrion resolved to get very, very drunk tonight.  Very well, young Podrick, let us go make me festive.   Shae was helping Sansa with her hair when they entered the bedchamber. Joy and grief, he thought when he beheld them there together. Laughter and tears. Sansa wore a gown of silvery satin trimmed in vair, with dagged sleeves that almost touched the floor, lined in soft purple felt. Shae had arranged her hair artfully in a delicate silver net winking with dark purple gemstones. Tyrion had never seen her look more lovely, yet she wore sorrow on those long satin sleeves.  Lady Sansa,  he told her,  you shall be the most beautiful woman in the hall tonight.    My lord is too kind.    My lady,  said Shae wistfully.  Couldn’t I come serve at table? I so want to see the pigeons fly out of the pie.   Sansa looked at her uncertainly.  The queen has chosen all the servers.    And the hall will be too crowded.  Tyrion had to bite back his annoyance.  There will be musicians strolling all through the castle, though, and tables in the outer ward with food and drink for all.  He inspected his new doublet, crimson velvet with padded shoulders and puffed sleeves slashed to show the black satin underlining. A handsome garment. All it wants is a handsome man to wear it.  Come, Pod, help me into this.   He had another cup of wine as he dressed, then took his wife by the arm and escorted her from the Kitchen Keep to join the river of silk, satin, and velvet flowing toward the throne room. Some guests had gone inside to find their places on the benches. Others were milling in front of the doors, enjoying the unseasonable warmth of the afternoon. Tyrion led Sansa around the yard, to perform the necessary courtesies.  She is good at this, he thought, as he watched her tell Lord Gyles that his cough was sounding better, compliment Elinor Tyrell on her gown, and question Jalabhar Xho about wedding customs in the Summer Isles. His cousin Ser Lancel had been brought down by Ser Kevan, the first time he’d left his sickbed since the battle. He looks ghastly. Lancel’s hair had turned white and brittle, and he was thin as a stick. Without his father beside him holding him up, he would surely have collapsed. Yet when Sansa praised his valor and said how good it was to see him getting strong again, both Lancel and Ser Kevan beamed. She would have made Joffrey a good queen and a better wife if he’d had the sense to love her. He wondered if his nephew was capable of loving anyone.   You do look quite exquisite, child,  Lady Olenna Tyrell told Sansa when she tottered up to them in a cloth-of-gold gown that must have weighed more than she did.  The wind has been at your hair, though.  The little old woman reached up and fussed at the loose strands, tucking them back into place and straightening Sansa’s hair net.  I was very sorry to hear about your losses,  she said as she tugged and fiddled.  Your brother was a terrible traitor, I know, but if we start killing men at weddings they’ll be even more frightened of marriage than they are presently. There, that’s better.  Lady Olenna smiled.  I am pleased to say I shall be leaving for Highgarden the day after next. I have had quite enough of this smelly city, thank you. Perhaps you would like to accompany me for a little visit, whilst the men are off having their war? I shall miss my Margaery so dreadfully, and all her lovely ladies. Your company would be such sweet solace."
}