{
  "id": "060f2f39e3ba0f37f56d72035dacba4717f3d894",
  "text": "       The Guards of the gate  were robed  in black, and  their helms  were of  strange  shape, high-crowned,  with long cheek -guards  close-fitting to  the  face,  and above the cheek -guards were set the white wings of sea -birds; but  the helms gleamed with a  flame of silver, for they were indeed  wrought  of  mithril, heirlooms from the glory of old days. Upon  the black surcoats were  embroidered in white a tree blossoming like  snow beneath a silver crown and  many-pointed  stars. This  was the livery of the heirs of  Elendil, and none  wore it now in all Gondor,  save the Guards of the Citadel  before the Court  of the Fountain where the White Tree once had grown.       Already it  seemed that word of their coming had  gone before them: and  at once they were admitted,  silently, and without question. Quickly Gandalf  strode across  the white-paved court.  A  sweet fountain played there in the  morning sun,  and a  sward of bright green  lay about it; but in the  midst.  drooping over the pool,  stood  a dead  tree, and  the falling drops dripped  sadly from its barren and broken branches back into the clear water.   ####-     Pippin glanced at  it  as he hurried after Gandalf. It looked mournful,  he thought, and he wondered why the dead tree was  left in  this place where  everything else was well tended.       Seven stars and seven stones and one white tree.       The words that Gandalf had murmured came back into  his mind. And  then  he found himself at the doors of  the great hall beneath the gleaming tower;  and behind the wizard he passed the tall silent door -wardens and entered the  cool echoing shadows of the house of stone.       They walked  down  a paved passage, long and  empty, and  as  they went  Gandalf spoke softly to Pippin. 'Be careful of your  words, Master Peregrin!   This is  no time for  hobbit pertness. Thjoden is a kindly old man. Denethor   is of another  sort, proud and subtle,  a  man  of far  greater  lineage and  power, though  he is  not called a king. But he will  speak most to you, and  question you much, since you  can tell him  of his son Boromir. He loved him  greatly: too much  perhaps; and the more  so because they  were  unlike. But  under cover  of  this love he will think it easier to  learn what he witches  from you rather than  from me. Do not tell him more than you need, and leave  quiet  the matter of Frodo's errand. I will deal with that in due  time. And  say nothing about Aragorn either, unless you must.'       'Why  not? What is wrong with Strider?' Pippin  whispered. 'He meant to  come here, didn't he? And he'll be arriving soon himself anyway.'       'Maybe,  maybe,' said Gandalf. 'Though if he comes, it is likely  to be  in some way that no one expects, not even Denethor. It will be better so. At  least he should come unheralded by us.'       Gandalf halted  before a  tall  door of  polished  metal. 'See,  Master   Pippin,  there  is no  t ime to instruct  you now in  the history of  Gondor;  though it might have been  better, if you  had learned something of it, when  you were  still birds-nesting and playing truant in the woods  of the Shire.  Do as I bid! It  is scarcely wise when bringing the news of the death of his  heir to a mighty lord to speak over much of the  coming of one who  will, if  he comes, claim the kingship. Is that enough?'       'Kingship?' said Pippin amazed.       'Yes,' said  Gandalf.  'If you  have  walked all these days with closed  ears and mind asleep, wake up now!' He knocked on the door.       The door opened,  but no one could be  seen  to open it.  Pippin looked  into a great hall. It was  lit by deep windows in the wide aisles at  either   side, beyond  the rows of tall  pillars that upheld the  roof. Monoliths  of   ####-black marble, they  rose to great capitals carved in many strange figures of  beasts and leaves; and far above in  shadow  the wide  vaulting gleamed with  dull  gold, inset with  flowing traceries of  many colours. No  hangings nor   storied webs, nor  any things of woven stuff or  of wood, were to be seen in  that long solemn hall; but between the pillars there stood  a silent company  of tall images graven in cold stone.       Suddenly Pippin was  reminded  of  the hewn rocks of  Argonath, and awe  fell on him, as he looked down  that  avenue of kings  long dead. At the far  end upon a dais of many steps was set a high throne under a canopy of marble  shaped like a crowned helm; behind  it was carved upon the wall and set with  gems an image of a tree  in flower. But the throne was empty. At the foot of  the dais, upon the lowest step which was broad and deep, there  was  a stone  chair,  black and unadorned, and on it sat an  old man gazing at his lap. In  his hand was a  white rod  with a  golden knob. He did not look up. Solemnly  they paced the long floor towards him, until they stood three paces from his  footstool. Then Gandalf spoke.       'Hail, Lord  and Steward of Minas Tirith,  Denethor son of Ecthelion! I  am come with counsel and tidings in this dark hour."
}