{
  "id": "06be105dee346877d36fbb65336b54c109bcabc7",
  "text": " Hagrid would have liked nothing better than a pet dragon, as Harry, Ron, and Hermione knew only too well - he had owned one for a brief period during their first year, a vicious Norwegian Ridgeback by the name of Norbert.  Hagrid simply loved monstrous creatures, the more lethal, the better. \"Well, at least the skrewts are small,\" said Ron as they made their way back up to the castle for lunch an hour later. \"They are now,\" said Hermione in an exasperated voice, \"but once Hagrid's found out what they eat, I expect they'll be six feet long.\" \"Well, that won't matter if they turn out to cure seasickness or something, will it?\" said Ron, grinning slyly at her. \"You know perfectly well I only said that to shut Malfoy up,\" said Hermione. \"As a matter of fact I think he's right.  The best thing to do would be to stamp on the lot of them before they start attacking us all.\" They sat down at the Gryffindor table and helped themselves to lamb chops and potatoes.  Hermione began to eat so fast that Harry and Ron stared at her. \"Er - is this the new stand on elf rights?\" said Ron. \"You're going to make yourself puke instead?\" \"No,\" said Hermione, with as much dignity as she could muster with her mouth bulging with sprouts.  \"I just want to get to the library.\" \"What?\" said Ron in disbelief. \"Hermione - it's the first day back!  We haven't even got homework yet!\" Hermione shrugged and continued to shovel down her food as though she had not eaten for days.  Then she leapt to her feet, said, \"See you at dinner!\"  and departed at high speed. When the bell rang to signal the start of afternoon lessons, Harry and Ron set off for North Tower where, at the top of a tightly spiraling staircase, a silver stepladder led to a circular trapdoor in the ceiling, and the room where Professor Trelawney lived. The familiar sweet perfume spreading from the fire met their nostrils as they emerged at the top of the stepladder.  As ever, the curtains were all closed; the circular room was bathed in a dim reddish light cast by the many lamps, which were all draped with scarves and shawls. Harry and Ron walked through the mass of occupied chintz chairs and poufs that cluttered the room, and sat down at the same small circular table. \"Good day,\" said the misty voice of Professor Trelawney right behind Harry, making him jump. A very thin woman with enormous glasses that made her eyes appear far too large for her face, Professor Trelawney was peering down at Harry with the tragic expression she always wore whenever she saw him.  The usual large amount of beads, chains, and bangles glittered upon her person in the firelight. \"You are preoccupied, my dear,\" she said mournfully to Harry.  \"My inner eye sees past your brave face to the troubled soul within.  And I regret to say that your worries are not baseless.  I see difficult times ahead for you, alas. . . most difficult.. . I fear the thing you dread will indeed come to pass. . . and perhaps sooner than you think...\" Her voice dropped almost to a whisper.  Ron rolled his eyes at Harry, who looked stonily back.  Professor Trelawney swept past them and seated herself in a large winged armchair before the fire, facing the class.  Lavender Brown and Parvati Patil, who deeply admired Professor Trelawney, were sitting on poufs very close to her. \"My dears, it is time for us to consider the stars,\" she said.  \"The movements of the planets and the mysterious portents they reveal only to those who understand the steps of the celestial dance. Human destiny may be deciphered by the planetary rays, which intermingle. . .\" But Harry's thoughts had drifted.  The perfumed fire always made him feel sleepy and dull-witted, and Professor Trelawney's rambling talks on fortune-telling never held him exactly spellbound - though he couldn't help thinking about what she had just said to him. \"I fear the thing you dread will indeed come to pass...'\" But Hermione was right, Harry thought irritably, Professor Trelawney really was an old fraud.  He wasn't dreading anything at the moment at all. . . well, unless you counted his fears that Sirius had been caught. . . but what did Professor Trelawney know?  He had long since come to the conclusion that her brand of fortunetelling was really no more than lucky guesswork and a spooky manner. Except, of course, for that time at the end of last term, when she had made the prediction about Voldemort rising again. . . and Dumbledore himself had said that he thought that trance had been genuine, when Harry had described it to him. \"Harry!\" Ron muttered. \"What?\" Harry looked around; the whole class was staring at him.  He sat up straight; he had been almost dozing off, lost in the heat and his thoughts. \"I was saying, my dear, that you were clearly born under the baleful influence of Saturn,\" said Professor Trelawney, a faint note of resentment in her voice at the fact that he had obviously not been hanging on her words. \"Born under - what, sorry?\" said Harry. \"Saturn, dear, the planet Saturn!\"  said Professor Trelawney, sounding definitely irritated that he wasn't riveted by this news."
}