{
  "id": "07c28872643bdd9faf4b9867b4840ca0d10966fc",
  "text": " Harry swirled around, staring about. Something sharp . . . anything . . . There were rocks littering the lake bottom.  He dived and snatched up a particularly jagged one and returned to the statue.  He began to hack at the ropes binding Ron, and after several minutes' hard work, they broke apart.  Ron floated, unconscious, a few inches above the lake bottom, drifting a little in the ebb of the water. Harry looked around. There was no sign of any of the other champions. What were they playing at?  Why didn't they hurry up?  He turned back to Hermione, raised the jagged rock, and began to hack at her bindings too - At once, several pairs of strong gray hands seized him. Half a dozen mermen were pulling him away from Hermione, shaking their green-haired heads, and laughing. \"You take your own hostage,\" one of them said to him.  \"Leave the others ...\" \"No way!\" said Harry furiously - but only two large bubbles came out. Your task is to retrieve your own friend . . . leave the others ...\" She's my friend too!\" Harry yelled, gesturing toward Hermione, an enormous silver bubble emerging soundlessly from his lips.  \"And I don't want them to die either!\" Cho's head was on Hermiones shoulder; the small silver-haired girl was ghostly green and pale.  Harry struggled to fight off the mermen, but they laughed harder than ever, holding him back. Harry looked wildly around.  Where were the other champions?  Would he have time to take Ron to the surface and come back down for Hermione and the others?  Would he be able to find them again?  He looked down at his watch to see how much time was left - it had stopped working. But then the merpeople around him pointed excitedly over his head. Harry looked up and saw Cedric swimming toward them.  There was an enormous bubble around his head, which made his features look oddly wide and stretched. \"Got lost!\" he mouthed, looking panic-stricken.  \"Fleur and Krum're coming now!\" Feeling enormously relieved, Harry watched Cedric pull a knife out of his pocket and cut Cho free. He pulled her upward and out of sight. Harry looked around, waiting.  Where were Fleur and Krum?  Time was getting short, and according to the song, the hostages would be lost after an hour. . . . The merpeople started screeching animatedly.  Those holding Harry loosened their grip, staring behind them. Harry turned and saw something monstrous cutting through the water toward them:  a human body in swimming trunks with the head of a shark. ... It was Krum.  He appeared to have transfigured himself- but badly. The shark-man swam straight to Hermione and began snapping and biting at her ropes; the trouble was that Krum's new teeth were positioned very awkwardly for biting anything smaller than a dolphin, and Harry was quite sure that if Krum wasn't careful, he was going to rip Hermione in half.  Darting forward. Harry hit Krum hard on the shoulder and held up the jagged stone.  Krum seized it and began to cut Hermione free.  Within seconds, he had done it; he grabbed Hermione around the waist, and without a backward glance, began to rise rapidly with her toward the surface. Now what? Harry thought desperately.  If he could be sure that Fleur was coming. . . . But still no sign.  There was nothing to be done except. . . He snatched up the stone, which Krum had dropped, but the mermen now closed in around Ron and the little girl, shaking their heads at him. Harry pulled out his wand. \"Get out of the way!\" Only bubbles flew out of his mouth, but he had the distinct impression that the mermen had understood him, because they suddenly stopped laughing.  Their yellowish eyes were fixed upon Harry's wand, and they looked scared.  There might be a lot more of them than there were of him, but Harry could tell, by the looks on their faces, that they knew no more magic than the giant squid did. \"You've got until three!\"  Harry shouted; a great stream of bubbles burst from him, but he held up three fingers to make sure they got the message.  \"One . . .\" (he put down a finger) \"two . . .\" (he put down a second one) - They scattered. Harry darted forward and began to hack at the ropes binding the small girl to the statue, and at last she was free.  He seized the little girl around the waist, grabbed the neck of Rons robes, and kicked off from the bottom. It was very slow work.  He could no longer use his webbed hands to propel himself forward; he worked his flippers furiously, but Ron and Fleur's sister were like potato-filled sacks dragging him back down. ... He fixed his eyes skyward, though he knew he must still be very deep, the water above him was so dark, . . . Merpeople were rising with him.  He could see them swirling around him with ease, watching him struggle through the water. .. . Would they pull him back down to the depths when the time was up?  Did they perhaps eat humans?  Harry's legs were seizing up with the effort to keep swimming; his shoulders were aching horribly with the effort of dragging Ron and the girl."
}