{
  "id": "07c743a88e8bd94bf9ffa34561d274b8083af41f",
  "text": " From time to time the other wolves would dart in as well, to snap at a leg or an ear when the prince was turned the other way. One angered him so much that he whirled in a black fury and tore out the attacker’s throat. After that the others kept their distance.  And as the last red light was filtering through green boughs and golden, the old wolf lay down weary in the dirt, and rolled over to expose his throat and belly. It was submission.  The prince sniffed at him and licked the blood from fur and torn flesh. When the old wolf gave a soft whimper, the direwolf turned away. He was very hungry now, and the prey was his.   Hodor.   The sudden sound made him stop and snarl. The wolves regarded him with green and yellow eyes, bright with the last light of day. None of them had heard it. It was a queer wind that blew only in his ears. He buried his jaws in the deer’s belly and tore off a mouthful of flesh.   Hodor, hodor.   No, he thought. No, I won’t. It was a boy’s thought, not a direwolf’s. The woods were darkening all about him, until only the shadows of the trees remained, and the glow of his cousins’ eyes. And through those and behind those eyes, he saw a big man’s grinning face, and a stone vault whose walls were spotted with niter. The rich warm taste of blood faded on his tongue. No, don’t, don’t, I want to eat, I want to, I want…   Hodor, hodor, hodor, hodor, hodor,  Hodor chanted as he shook him softly by the shoulders, back and forth and back and forth. He was trying to be gentle, he always tried, but Hodor was seven feet tall and stronger than he knew, and his huge hands rattled Bran’s teeth together.  NO!  he shouted angrily.  Hodor, leave off, I’m here, I’m here.   Hodor stopped, looking abashed.  Hodor?   The woods and wolves were gone. Bran was back again, down in the damp vault of some ancient watchtower that must have been abandoned thousands of years before. It wasn’t much of a tower now. Even the tumbled stones were so overgrown with moss and ivy that you could hardly see them until you were right on top of them.  Tumbledown Tower , Bran had named the place; it was Meera who found the way down into the vault, however.   You were gone too long.  Jojen Reed was thirteen, only four years older than Bran. Jojen wasn’t much bigger either, no more than two inches or maybe three, but he had a solemn way of talking that made him seem older and wiser than he really was. At Winterfell, Old Nan had dubbed him  little grandfather.   Bran frowned at him.  I wanted to eat.    Meera will be back soon with supper.    I’m sick of frogs.  Meera was a frogeater from the Neck, so Bran couldn’t really blame her for catching so many frogs, he supposed, but even so…  I wanted to eat the deer.  For a moment he remembered the taste of it, the blood and the raw rich meat, and his mouth watered. I won the fight for it. I won.   Did you mark the trees?   Bran flushed. Jojen was always telling him to do things when he opened his third eye and put on Summer’s skin. To claw the bark of a tree, to catch a rabbit and bring it back in his jaws uneaten, to push some rocks in a line. Stupid things.  I forgot,  he said.   You always forget.   It was true. He meant to do the things that Jojen asked, but once he was a wolf they never seemed important. There were always things to see and things to smell, a whole green world to hunt. And he could run! There was nothing better than running, unless it was running after prey.  I was a prince, Jojen,  he told the older boy.  I was the prince of the woods.    You are a prince,  Jojen reminded him softly.  You remember, don’t you? Tell me who you are.    You know.  Jojen was his friend and his teacher, but sometimes Bran just wanted to hit him.   I want you to say the words. Tell me who you are.    Bran,  he said sullenly. Bran the Broken.  Brandon Stark.  The cripple boy.  The Prince of Winterfell.  Of Winterfell burned and tumbled, its people scattered and slain. The glass gardens were smashed, and hot water gushed from the cracked walls to steam beneath the sun. How can you be the prince of someplace you might never see again?   And who is Summer?  Jojen prompted.   My direwolf.  He smiled.  Prince of the green.    Bran the boy and Summer the wolf. You are two, then?    Two,  he sighed,  and one.  He hated Jojen when he got stupid like this. At Winterfell he wanted me to dream my wolf dreams, and now that I know how he’s always calling me back.   Remember that, Bran. Remember yourself, or the wolf will consume you. When you join, it is not enough to run and hunt and howl in Summer’s skin.   It is for me, Bran thought. He liked Summer’s skin better than his own. What good is it to be a skinchanger if you can’t wear the skin you like?   Will you remember? And next time, mark the tree. Any tree, it doesn’t matter, so long as you do it.    I will. I’ll remember. I could go back and do it now, if you like. I won’t forget this time.  But I’ll eat my deer first, and fight with those little wolves some more."
}