{
  "id": "07ca1c47dfb829d0fe45d92bb4594a29f9fe6aa2",
  "text": " Arya had thought of revealing herself to the first outriders they encountered, but she had always pictured grey-cloaked men with the direwolf on their breasts. She might have risked it even if they’d worn the Umber giant or the Glover fist, but she did not know this pitchfork knight or whom he served. The closest thing to a pitchfork she had ever seen at Winterfell was the trident in the hand of Lord Manderly’s merman.   You have business at the Twins?  the knight asked.   Salt pork for the wedding feast, if it please you, ser.  The Hound mumbled his reply, his eyes down, his face hidden.   Salt pork never pleases me.  The pitchfork knight gave Clegane only the most cursory glance, and paid no attention at all to Arya, but he looked long and hard at Stranger. The stallion was no plow horse, that was plain at a glance. One of the squires almost wound up in the mud when the big black courser bit at his own mount.  How did you come by this beast?  the pitchfork knight demanded.   M’lady told me to bring him, ser,  Clegane said humbly.  He’s a wedding gift for young Lord Tully.    What lady? Who is it you serve?    Old Lady Whent, ser.    Does she think she can buy Harrenhal back with a horse?  the knight asked.  Gods, is there any fool like an old fool?  Yet he waved them down the road.  Go on with you, then.    Aye, m’lord.  The Hound snapped his whip again, and the old drays resumed their weary trek. The wheels had settled deep into the mud during the halt, and it took several moments for the team to pull them free again. By then the outriders were riding off. Clegane gave them one last look and snorted.  Ser Donnel Haigh,  he said.  I’ve taken more horses off him than I can count. Armor as well. Once I near killed him in a mêlée.    How come he didn’t know you, then?  Arya asked.   Because knights are fools, and it would have been beneath him to look twice at some poxy peasant.  He gave the horses a lick with the whip.  Keep your eyes down and your tone respectful and say ser a lot, and most knights will never see you. They pay more mind to horses than to smallfolk. He might have known Stranger if he’d ever seen me ride him.   He would have known your face, though. Arya had no doubt of that. Sandor Clegane’s burns would not be easy to forget, once you saw them. He couldn’t hide the scars behind a helm, either; not so long as the helm was made in the shape of a snarling dog.  That was why they’d needed the wayn and the pickled pigs’ feet.  I’m not going to be dragged before your brother in chains,  the Hound had told her,  and I’d just as soon not have to cut through his men to get to him. So we play a little game.   A farmer chance-met on the kingsroad had provided them with wayn, horses, garb, and casks, though not willingly. The Hound had taken them at swordpoint. When the farmer cursed him for a robber, he said,  No, a forager. Be grateful you get to keep your smallclothes. Now take those boots off. Or I’ll take your legs off. Your choice.  The farmer was as big as Clegane, but all the same he chose to give up his boots and keep his legs.  Evenfall found them still trudging toward the Green Fork and Lord Frey’s twin castles. I am almost there, Arya thought. She knew she ought to be excited, but her belly was all knotted up tight. Maybe that was just the fever she’d been fighting, but maybe not. Last night she’d had a bad dream, a terrible dream. She couldn’t remember what she’d dreamed of now, but the feeling had lingered all day. If anything, it had only gotten stronger. Fear cuts deeper than swords. She had to be strong now, the way her father told her. There was nothing between her and her mother but a castle gate, a river, and an army… but it was Robb’s army, so there was no real danger there. Was there?  Roose Bolton was one of them, though. The Leech Lord, as the outlaws called him. That made her uneasy. She had fled Harrenhal to get away from Bolton as much as from the Bloody Mummers, and she’d had to cut the throat of one of his guards to escape. Did he know she’d done that? Or did he blame Gendry or Hot Pie? Would he have told her mother? What would he do if he saw her? He probably won’t even know me. She looked more like a drowned rat than a lord’s cupbearer these days. A drowned boy rat. The Hound had hacked handfuls of her hair off only two days past. He was an even worse barber than Yoren, and he’d left her half bald on one side. Robb won’t know me either, I bet. Or even Mother. She had been a little girl the last time she saw them, the day Lord Eddard Stark left Winterfell.  They heard the music before they saw the castle; the distant rattle of drums, the brazen blare of horns, the thin skirling of pipes faint beneath the growl of the river and the sound of the rain beating on their heads.  We’ve missed the wedding,  the Hound said,  but it sounds as though the feast is still going. I’ll be rid of you soon.   No, I’ll be rid of you, Arya thought.  The road had been running mostly northwest, but now it turned due west between an apple orchard and a field of drowned corn beaten down by the rain."
}