{
  "id": "0812d901493c2681f45f0eee4232696a5dd0c776",
  "text": "   There was laughter all around. Then Tom drew his fingers across the strings of his woodharp and broke into soft song.      The brothers of the Kingswood,  they were an outlaw band.  The forest was their castle,  but they roamed across the land.  No man’s gold was safe from them,  nor any maiden’s hand.  Oh, the brothers of the Kingswood,  that fearsome outlaw band…      Warm and dry in a corner between Gendry and Harwin, Arya listened to the singing for a time, then closed her eyes and drifted off to sleep. She dreamt of home; not Riverrun, but Winterfell. It was not a good dream, though. She was alone outside the castle, up to her knees in mud. She could see the grey walls ahead of her, but when she tried to reach the gates every step seemed harder than the one before, and the castle faded before her, until it looked more like smoke than granite. And there were wolves as well, gaunt grey shapes stalking through the trees all around her, their eyes shining. Whenever she looked at them, she remembered the taste of blood.  The next morning they left the road to cut across the fields. The wind was gusting, sending dry brown leaves swirling around the hooves of their horses, but for once it did not rain. When the sun came out from behind a cloud, it was so bright Arya had to pull her hood forward to keep it out of her eyes.  She reined up very suddenly.  We are going the wrong way!   Gendry groaned.  What is it, moss again?    Look at the sun,  she said.  We’re going south!  Arya rummaged in her saddlebag for the map, so she could show them.  We should never have left the Trident. See.  She unrolled the map on her leg. All of them were looking at her now.  See, there’s Riverrun, between the rivers.    As it happens,  said Jack-Be-Lucky,  we know where Riverrun is. Every man o’ us.    You’re not going to Riverrun,  Lem told her bluntly.  I was almost there, Arya thought. I should have let them take our horses. I could have walked the rest of the way. She remembered her dream then, and bit her lip.   Ah, don’t look so hurt, child,  said Tom Sevenstrings.  No harm will come to you, you have my word on that.    The word of a liar!    No one lied,  said Lem.  We made no promises. It’s not for us to say what’s to be done with you.   Lem was not the leader, though, no more than Tom; that was Greenbeard, the Tyroshi. Arya turned to face him.  Take me to Riverrun and you’ll be rewarded,  she said desperately.   Little one,  Greenbeard answered,  a peasant may skin a common squirrel for his pot, but if he finds a gold squirrel in his tree he takes it to his lord, or he will wish he did.    I’m not a squirrel,  Arya insisted.   You are.  Greenbeard laughed.  A little gold squirrel who’s off to see the lightning lord, whether she wills it or not. He’ll know what’s to be done with you. I’ll wager he sends you back to your lady mother, just as you wish.   Tom Sevenstrings nodded.  Aye, that’s like Lord Beric. He’ll do right by you, see if he don’t.   Lord Beric Dondarrion. Arya remembered all she’d heard at Harrenhal, from the Lannisters and the Bloody Mummers alike. Lord Beric the wisp o’ the wood. Lord Beric who’d been killed by Vargo Hoat and before that by Ser Amory Lorch, and twice by the Mountain That Rides. If he won’t send me home maybe I’ll kill him too.  Why do I have to see Lord Beric?  she asked quietly.   We bring him all our highborn captives,  said Anguy.  Captive. Arya took a breath to still her soul. Calm as still water. She glanced at the outlaws on their horses, and turned her horse’s head. Now, quick as a snake, she thought, as she slammed her heels into the courser’s flank. Right between Greenbeard and Jack-Be-Lucky she flew, and caught one glimpse of Gendry’s startled face as his mare moved out of her way. And then she was in the open field, and running.  North or south, east or west, that made no matter now. She could find the way to Riverrun later, once she’d lost them. Arya leaned forward in the saddle and urged the horse to a gallop. Behind her the outlaws were cursing and shouting at her to come back. She shut her ears to the calls, but when she glanced back over her shoulder four of them were coming after her, Anguy and Harwin and Greenbeard racing side by side with Lem farther back, his big yellow cloak flapping behind him as he rode.  Swift as a deer,  she told her mount.  Run, now, run.   Arya dashed across brown weedy fields, through waist-high grass and piles of dry leaves that flurried and flew when her horse galloped past. There were woods to her left, she saw. I can lose them there. A dry ditch ran along one side of the field, but she leapt it without breaking stride, and plunged in among the stand of elm and yew and birch trees. A quick peek back showed Anguy and Harwin still hard on her heels. Greenbeard had fallen behind, though, and she could not see Lem at all.  Faster,  she told her horse,  you can, you can.   Between two elms she rode, and never paused to see which side the moss was growing on."
}