{
  "id": "0833c080bb485fd87d8f9cb6cee5fc0c6f3d2e71",
  "text": " By the time she had clambered back into the car, they were running very late, and tempers were running high.  * 66  Mr. Weasley glanced at his watch and then at his wife.  \"Molly, dear -\"  \"No, Arthur -\"  \"No one would see - this little button here is an Invisibility Booster I installed - that'd get us up in the air - then we fly above the clouds. We'd be there in ten minutes and no one would be any the wiser -\"  \"I said no, Arthur, not in broad daylight -\"  They reached King's Cross at a quarter to eleven. Mr. Weasley dashed across the road to get trolleys for their trunks and they all hurried into the station.  Harry had caught the Hogwarts Express the previous year. The tricky part was getting onto platform nine and three-quarters, which wasn't visible to the Muggle eye. What you had to do was walk through the solid barrier dividing platforms nine and ten. It didn't hurt, but it had to be done carefully so that none of the Muggles noticed you vanishing.  \"Percy first,\" said Mrs. Weasley, looking nervously at the clock overhead, which showed they had only five minutes to disappear casually through the barrier.  Percy strode briskly forward and vanished. Mr. Weasley went next; Fred and George followed.  \"I'll take Ginny and you two come right after us,\" Mrs. Weasley told Harry and Ron, grabbing Ginny's hand and setting off. In the blink of an eye they were gone.  \"Let's go together, we've only got a minute,\" Ron said to Harry.  Harry made sure that Hedwig's cage was safely wedged on top of his trunk and wheeled his trolley around to face the barrier. He felt  61  perfectly confident; this wasn't nearly as uncomfortable as using Floo powder. Both of them bent low over the handles of their trolleys and walked purposefully toward the barrier, gathering speed. A few feet away from it, they broke into a run and  CRASH.  Both trolleys hit the barrier and bounced backward; Ron's trunk fell off with a loud thump, Harry was knocked off his feet, and Hedwig's cage bounced onto the shiny floor, and she rolled away, shrieking indignantly; people all around them stared and a guard nearby yelled, \"What in blazes d'you think you're doing?\"  \"Lost control of the trolley,\" Harry gasped, clutching his ribs as he got up. Ron ran to pick up Hedwig, who was causing such a scene that there was a lot of muttering about cruelty to animals from the surrounding crowd.  \"Why can't we get through?\" Harry hissed to Ron.  \"I dunno -\"  Ron looked wildly around. A dozen curious people were still watching them.  \"We're going to miss the train,\" Ron whispered. \"I don't understand why the gateway's sealed itself -\"  Harry looked up at the giant clock with a sickening feeling in the pit of his stomach. Ten seconds ... nine seconds ...  He wheeled his trolley forward cautiously until it was right against the barrier and pushed with all his might. The metal remained solid.  Three seconds . . . two seconds ... one second ...  \"It's gone,\" said Ron, sounding stunned. \"The train's left. What if Mum and Dad can't get back through to us? Have you got any Muggle money?\"  68  And they marched off through the crowd of curious Muggles, out of the station and back onto the side road where the old Ford Anglia was parked.  Ron unlocked the cavernous trunk with a series of taps from his wand. They heaved their luggage back in, put Hedwig on the back seat, and got into the front.  \"Check that no one's watching,\" said Ron, starting the ignition with another tap of his wand. Harry stuck his head out of the window: Traffic was rumbling along the main road ahead, but their street was empty.  \"Okay,\" he said.  Ron pressed a tiny silver button on the dashboard. The car around them vanished - and so did they. Harry could feel the seat vibrating beneath him, hear the engine, feel his hands on his knees and his glasses on his nose, but for all he could see, he had become a pair of eyeballs, floating a few feet above the ground in a dingy street full of parked cars.  \"Let's go,\" said Ron's voice from his right.  And the ground and the dirty buildings on either side fell away, dropping out of sight as the car rose; in seconds, the whole of London lay, smoky and glittering, below them.  Then there was a popping noise and the car, Harry, and Ron reappeared.  \"Uh-oh,\" said Ron, jabbing at the Invisibility Booster. \"It's faulty -\"  Both of them pummeled it. The car vanished. Then it flickered back again.  \"Hold on!\" Ron yelled, and he slammed his foot on the acceler  * 7 0  ator; they shot straight into the low, woolly clouds and everything turned dull and foggy.  \"Now what?\" said Harry, blinking at the solid mass of cloud pressing in on them from all sides.  \"We need to see the train to know what direction to go in,\" said Ron.  \"Dip back down again - quickly -\"  They dropped back beneath the clouds and twisted around in their seats, squinting at the ground.  \"I can see it!\" Harry yelled. \"Right ahead - there!\"  The Hogwarts Express was streaking along below them like a scarlet snake."
}