{
  "id": "0870e6a29ee42a4b5d7577767d2747e10f13245f",
  "text": "  At  last they got the idea that enemies were in Buckland, some strange  invasion   ####-from the Old Forest. And then they lost no more time.       FEAR! FIRE! FOES!       The Brandybucks were blowing  the Horn-call of  Buckland,  that had not  been sounded for  a hundred years, not  since the white wolves came  in  the  Fell Winter, when the Brandywine was frozen over.       AWAKE! AWAKE!       Far-away answering horns were heard. The alarm was spreading. The black   figures fled from the house.  One  of them  let fall a  hobbit-cloak  on the  step, as he ran. In the lane the noise  of hoofs broke out, and gathering to  a gallop, went hammering away into the darkness. All about Crickhollow there  was the sound  of horns blowing, and voices crying and feet running. But the  Black Riders rode like a gale to the North-gate. Let the little people blow!   Sauron  would deal  with them later. Meanwhile they had another errand: they  knew now that the house  was empty and the Ring had gone. They rode down  the  guards at the gate and vanished from the Shire.       In  the early night  Frodo woke from deep  sleep, suddenly, as if  some  sound or presence  had disturbed  him. He saw that Strider was sitting alert  in his  chair: his  eyes gleamed in  the light of the  fire, which had  been  tended and was burning brightly; but he made no sign or movement.       Frodo soon went to sleep again; but his dreams were again troubled with   the noise  of wind and of ga lloping  hoofs.  The wind  seemed to be  curling   round the house and shaking it; and far off  he heard a horn blowing wildly.   He  opened his  eyes,  and  heard a  cock  crowing  lustily in the inn-yard.  Strider  had  drawn the  curtains and pushed back the shutters with a clang.  The  first  grey light of day  was in the room, and  a  cold  air was coming  through the open window.        As soon  as  Strider  had roused them  all,  he led  the  way  to their  bedrooms. When they  saw them they were glad that they had taken his advice:  the windows had been forced  open and were  swinging, and  the curtains were  flapping; the beds  were tossed about,  and the bolsters  slashed and  flung  upon the floor; the brown mat was torn to pieces.       Strider  immediately  went  to fetch the landlord. Poor  Mr.  Butterbur  looked sleepy and frightened. He had hardly closed his eyes all night (so he  said), but he had never heard a sound.       'Never has such  a thing happened  in my  time!' he cried,  raising his  hands in horror. 'Guests unable to sleep in  their beds,  and good  bolsters   ####-ruined and all! What are we coming to?'       'Dark times,' said  Strider. 'But for  the present you  may be left  in  peace,  when you have got rid of us. We will leave at once. Never mind about  breakfast: a drink  and a bite standing will have to do. We shall be  packed  in a few minutes.'       Mr. Butterbur hurried off to see that their ponies were  got ready, and  to fetch them a 'bite'. But very soon he came back in dismay. The ponies had  vanished!  The stable-doors had all  been opened in the night, and they were  gone: not only Merry's ponies, but every other horse and beast in the place.       Frodo was  crushed by the news. How  could they hope to reach Rivendell  on foot, pursued  by  mounted enemies? They might as  well  set  out for the  Moon. Strider sat silent for a while, looking at the hobbits,  as if he  was  weighing up their strength and courage.       'Ponies would  not help  us to  escape  horsemen,'  he  said  at  last,  thoughtfully, as if he guessed  what Frodo  had in  mind. 'We should  not go  much slower on foot, not  on the roads that I mean to take.  I was  going to  walk in any case. It is the food and stores that trouble me. We cannot count  on getting anything to  eat between here and Rivendell, except  what we take  with  us; and we ought to take plenty  to spare; for we  may be delayed,  or   forced  to  go round-about, far out  of  the direct way.  How much  are  you   prepared to carry on your backs?'       'As  much as we must,' said Pippin with  a sinking heart, but trying to  show that he was tougher than he looked (or felt).       'I can carry enough for two,' said Sam defiantly.       'Can't  anything be done,  Mr. Butterbur?' asked Frodo. 'Can't we get a   couple of  ponies in the vi llage, or even one  just for the baggage? I don't   suppose we  could  hire  them, but we might be able to buy them,' he  added,   doubtfully, wondering if he could afford it.       'I  doubt  it,'  said   the  landlord  unhappily.  'The  two  or  three  riding-ponies that there were in Bree were stabled  in  my yard, and they're  gone.  As for other animals, horses or ponies for draught or what not, there  are very few of them in Bree, and they won't be for sale. But I'll do what I  can. I'll rout out Bob and send him round as soon as may be.'       'Yes,' said Strider reluctantly, 'you  had better do that. I am  afraid  we  shall have to try  to get  one pony at least."
}