{
  "id": "08fdd1891e29b11d0a348c914bc554fcb0a80863",
  "text": " Another was pale cream streaked with gold. The last was black, as black as a midnight sea, yet alive with scarlet ripples and swirls.  What are they?  she asked, her voice hushed and full of wonder.   Dragon’s eggs, from the Shadow Lands beyond Asshai,  said Magister Illyrio.  The eons have turned them to stone, yet still they burn bright with beauty.    I shall treasure them always.  Dany had heard tales of such eggs, but she had never seen one, nor thought to see one. It was a truly magnificent gift, though she knew that Illyrio could afford to be lavish. He had collected a fortune in horses and slaves for his part in selling her to Khal Drogo.  The khal’s bloodriders offered her the traditional three weapons, and splendid weapons they were. Haggo gave her a great leather whip with a silver handle, Cohollo a magnificent arakh chased in gold, and Qotho a double-curved dragonbone bow taller than she was. Magister Illyrio and Ser Jorah had taught her the traditional refusals for these offerings.  This is a gift worthy of a great warrior, O blood of my blood, and I am but a woman. Let my lord husband bear these in my stead.  And so Khal Drogo too received his  bride gifts.   Other gifts she was given in plenty by other Dothraki: slippers and jewels and silver rings for her hair, medallion belts and painted vests and soft furs, sandsilks and jars of scent, needles and feathers and tiny bottles of purple glass, and a gown made from the skin of a thousand mice.  A handsome gift, Khaleesi,  Magister Illyrio said of the last, after he had told her what it was.  Most lucky.  The gifts mounted up around her in great piles, more gifts than she could possibly imagine, more gifts than she could want or use.  And last of all, Khal Drogo brought forth his own bride gift to her. An expectant hush rippled out from the center of the camp as he left her side, growing until it had swallowed the whole khalasar. When he returned, the dense press of Dothraki gift-givers parted before him, and he led the horse to her.  She was a young filly, spirited and splendid. Dany knew just enough about horses to know that this was no ordinary animal. There was something about her that took the breath away. She was grey as the winter sea, with a mane like silver smoke.  Hesitantly she reached out and stroked the horse’s neck, ran her fingers through the silver of her mane. Khal Drogo said something in Dothraki and Magister Illyrio translated.  Silver for the silver of your hair, the khal says.    She’s beautiful,  Dany murmured.   She is the pride of the khalasar,  Illyrio said.  Custom decrees that the khaleesi must ride a mount worthy of her place by the side of the khal.   Drogo stepped forward and put his hands on her waist. He lifted her up as easily as if she were a child and set her on the thin Dothraki saddle, so much smaller than the ones she was used to. Dany sat there uncertain for a moment. No one had told her about this part.  What should I do?  she asked Illyrio.  It was Ser Jorah Mormont who answered.  Take the reins and ride. You need not go far.   Nervously Dany gathered the reins in her hands and slid her feet into the short stirrups. She was only a fair rider; she had spent far more time traveling by ship and wagon and palanquin than by horseback. Praying that she would not fall off and disgrace herself, she gave the filly the lightest and most timid touch with her knees.  And for the first time in hours, she forgot to be afraid. Or perhaps it was for the first time ever.  The silver-grey filly moved with a smooth and silken gait, and the crowd parted for her, every eye upon them. Dany found herself moving faster than she had intended, yet somehow it was exciting rather than terrifying. The horse broke into a trot, and she smiled. Dothraki scrambled to clear a path. The slightest pressure with her legs, the lightest touch on the reins, and the filly responded. She sent it into a gallop, and now the Dothraki were hooting and laughing and shouting at her as they jumped out of her way. As she turned to ride back, a firepit loomed ahead, directly in her path. They were hemmed in on either side, with no room to stop. A daring she had never known filled Daenerys then, and she gave the filly her head.  The silver horse leapt the flames as if she had wings.  When she pulled up before Magister Illyrio, she said,  Tell Khal Drogo that he has given me the wind.  The fat Pentoshi stroked his yellow beard as he repeated her words in Dothraki, and Dany saw her new husband smile for the first time.  The last sliver of sun vanished behind the high walls of Pentos to the west just then. Dany had lost all track of time. Khal Drogo commanded his bloodriders to bring forth his own horse, a lean red stallion. As the khal was saddling the horse, Viserys slid close to Dany on her silver, dug his fingers into her leg, and said,  Please him, sweet sister, or I swear, you will see the dragon wake as it has never woken before.   The fear came back to her then, with her brother’s words."
}