{
  "id": "09295273ec1d1b0ed8abd496a2a7bc2a873b5468",
  "text": " With the bundle under her arm, she crept to the far end of the stable. Unlatching the back door, she peeked out anxiously. She could hear the distant sound of swordplay, and the shivery wail of a man screaming in pain across the bailey. She would need to go down the serpentine steps, past the small kitchen and the pig yard, that was how she’d gone last time, chasing the black tomcat… only that would take her right past the barracks of the gold cloaks. She couldn’t go that way. Arya tried to think of another way. If she crossed to the other side of the castle, she could creep along the river wall and through the little godswood… but first she’d have to cross the yard, in the plain view of the guards on the walls.  She had never seen so many men on the walls. Gold cloaks, most of them, armed with spears. Some of them knew her by sight. What would they do if they saw her running across the yard? She’d look so small from up there, would they be able to tell who she was? Would they care?  She had to leave now, she told herself, but when the moment came, she was too frightened to move.  Calm as still water, a small voice whispered in her ear. Arya was so startled she almost dropped her bundle. She looked around wildly, but there was no one in the stable but her, and the horses, and the dead men.  Quiet as a shadow, she heard. Was it her own voice, or Syrio’s? She could not tell, yet somehow it calmed her fears.  She stepped out of the stable.  It was the scariest thing she’d ever done. She wanted to run and hide, but she made herself walk across the yard, slowly, putting one foot in front of the other as if she had all the time in the world and no reason to be afraid of anyone. She thought she could feel their eyes, like bugs crawling on her skin under her clothes. Arya never looked up. If she saw them watching, all her courage would desert her, she knew, and she would drop the bundle of clothes and run and cry like a baby, and then they would have her. She kept her gaze on the ground. By the time she reached the shadow of the royal sept on the far side of the yard, Arya was cold with sweat, but no one had raised the hue and cry.  The sept was open and empty. Inside, half a hundred prayer candles burned in a fragrant silence. Arya figured the gods would never miss two. She stuffed them up her sleeves, and left by a back window. Sneaking back to the alley where she had cornered the one-eared tom was easy, but after that she got lost. She crawled in and out of windows, hopped over walls, and felt her way through dark cellars, quiet as a shadow. Once she heard a woman weeping. It took her more than an hour to find the low narrow window that slanted down to the dungeon where the monsters waited.  She tossed her bundle through and doubled back to light her candle. That was chancy; the fire she’d remembered seeing had burnt down to embers, and she heard voices as she was blowing on the coals. Cupping her fingers around the flickering candle, she went out the window as they were coming in the door, without ever getting a glimpse of who it was.  This time the monsters did not frighten her. They seemed almost old friends. Arya held the candle over her head. With each step she took, the shadows moved against the walls, as if they were turning to watch her pass.  Dragons,  she whispered. She slid Needle out from under her cloak. The slender blade seemed very small and the dragons very big, yet somehow Arya felt better with steel in her hand.  The long windowless hall beyond the door was as black as she remembered. She held Needle in her left hand, her sword hand, the candle in her right fist. Hot wax ran down across her knuckles. The entrance to the well had been to the left, so Arya went right. Part of her wanted to run, but she was afraid of snuffing out her candle. She heard the faint squeaking of rats and glimpsed a pair of tiny glowing eyes on the edge of the light, but rats did not scare her. Other things did. It would be so easy to hide here, as she had hidden from the wizard and the man with the forked beard. She could almost see the stableboy standing against the wall, his hands curled into claws with the blood still dripping from the deep gashes in his palms where Needle had cut him. He might be waiting to grab her as she passed. He would see her candle coming a long way off. Maybe she would be better off without the light…  Fear cuts deeper than swords, the quiet voice inside her whispered. Suddenly Arya remembered the crypts at Winterfell. They were a lot scarier than this place, she told herself. She’d been just a little girl the first time she saw them. Her brother Robb had taken them down, her and Sansa and baby Bran, who’d been no bigger than Rickon was now. They’d only had one candle between them, and Bran’s eyes had gotten as big as saucers as he stared at the stone faces of the Kings of Winter, with their wolves at their feet and their iron swords across their laps.  Robb took them all the way down to the end, past Grandfather and Brandon and Lyanna, to show them their own tombs."
}