{
  "id": "0942b475c7c57fd0c5f4251ed7975c484fae62b3",
  "text": "   Certainly Varys had once been young. Ned doubted that he had ever been innocent.  You mention children. Robert had a change of heart concerning Daenerys Targaryen. Whatever arrangements you made, I want unmade. At once.    Alas,  said Varys.  At once may be too late. I fear those birds have flown. But I shall do what I can, my lord. With your leave.  He bowed and vanished down the steps, his soft-soled slippers whispering against the stone as he made his descent.  Cayn and Tomard were helping Ned across the bridge when Lord Renly emerged from Maegor’s Holdfast.  Lord Eddard,  he called after Ned,  a moment, if you would be so kind.   Ned stopped.  As you wish.   Renly walked to his side.  Send your men away.  They met in the center of the bridge, the dry moat beneath them. Moonlight silvered the cruel edges of the spikes that lined its bed.  Ned gestured. Tomard and Cayn bowed their heads and backed away respectfully. Lord Renly glanced warily at Ser Boros on the far end of the span, at Ser Preston in the doorway behind them.  That letter.  He leaned close.  Was it the regency? Has my brother named you Protector?  He did not wait for a reply.  My lord, I have thirty men in my personal guard, and other friends beside, knights and lords. Give me an hour, and I can put a hundred swords in your hand.    And what should I do with a hundred swords, my lord?    Strike! Now, while the castle sleeps.  Renly looked back at Ser Boros again and dropped his voice to an urgent whisper.  We must get Joffrey away from his mother and take him in hand. Protector or no, the man who holds the king holds the kingdom. We should seize Myrcella and Tommen as well. Once we have her children, Cersei will not dare oppose us. The council will confirm you as Lord Protector and make Joffrey your ward.   Ned regarded him coldly.  Robert is not dead yet. The gods may spare him. If not, I shall convene the council to hear his final words and consider the matter of the succession, but I will not dishonor his last hours on earth by shedding blood in his halls and dragging frightened children from their beds.   Lord Renly took a step back, taut as a bowstring.  Every moment you delay gives Cersei another moment to prepare. By the time Robert dies, it may be too late… for both of us.    Then we should pray that Robert does not die.    Small chance of that,  said Renly.   Sometimes the gods are merciful.    The Lannisters are not.  Lord Renly turned away and went back across the moat, to the tower where his brother lay dying.  By the time Ned returned to his chambers, he felt weary and heartsick, yet there was no question of his going back to sleep, not now. When you play the game of thrones, you win or you die, Cersei Lannister had told him in the godswood. He found himself wondering if he had done the right thing by refusing Lord Renly’s offer. He had no taste for these intrigues, and there was no honor in threatening children, and yet… if Cersei elected to fight rather than flee, he might well have need of Renly’s hundred swords, and more besides.   I want Littlefinger,  he told Cayn.  If he’s not in his chambers, take as many men as you need and search every winesink and whorehouse in King’s Landing until you find him. Bring him to me before break of day.  Cayn bowed and took his leave, and Ned turned to Tomard.  The Wind Witch sails on the evening tide. Have you chosen the escort?    Ten men, with Porther in command.    Twenty, and you will command,  Ned said. Porther was a brave man, but headstrong. He wanted someone more solid and sensible to keep watch over his daughters.   As you wish, m’lord,  Tom said.  Can’t say I’ll be sad to see the back of this place. I miss the wife.    You will pass near Dragonstone when you turn north. I need you to deliver a letter for me.   Tom looked apprehensive.  To Dragonstone, m’lord?  The island fortress of House Targaryen had a sinister repute.   Tell Captain Qos to hoist my banner as soon as he comes in sight of the island. They may be wary of unexpected visitors. If he is reluctant, offer him whatever it takes. I will give you a letter to place into the hand of Lord Stannis Baratheon. No one else. Not his steward, nor the captain of his guard, nor his lady wife, but only Lord Stannis himself.    As you command, m’lord.   When Tomard had left him, Lord Eddard Stark sat staring at the flame of the candle that burned beside him on the table. For a moment his grief overwhelmed him. He wanted nothing so much as to seek out the godswood, to kneel before the heart tree and pray for the life of Robert Baratheon, who had been more than a brother to him. Men would whisper afterward that Eddard Stark had betrayed his king’s friendship and disinherited his sons; he could only hope that the gods would know better, and that Robert would learn the truth of it in the land beyond the grave.  Ned took out the king’s last letter. A roll of crisp white parchment sealed with golden wax, a few short words and a smear of blood."
}