{
  "id": "09985d14e2cd1bfca7e7baae4e8f93ad9b3e802b",
  "text": " He saw no siege towers rumbling up the kingsroad, but there was timber enough in the wolfswood to build as many as were required.  Theon studied their banners through Maester Luwin’s Myrish lens tube. The Cerwyn battle-axe flapped bravely wherever he looked, and there were Tallhart trees as well, and mermen from White Harbor. Less common were the sigils of Flint and Karstark. Here and there he even saw the bull moose of the Hornwoods. But no Glovers, Asha saw to them, no Boltons from the Dreadfort, no Umbers come down from the shadow of the Wall. Not that they were needed. Soon enough the boy Cley Cerwyn appeared before the gates carrying a peace banner on a tall staff, to announce that Ser Rodrik Cassel wished to parley with Theon Turncloak.  Turncloak. The name was bitter as bile. He had gone to Pyke to lead his father’s longships against Lannisport, he remembered.  I shall be out shortly,  he shouted down.  Alone.   Black Lorren disapproved.  Only blood can wash out blood,  he declared.  Knights may keep their truces with other knights, but they are not so careful of their honor when dealing with those they deem outlaw.   Theon bristled.  I am the Prince of Winterfell and heir to the Iron Islands. Now go find the girl and do as I told you.   Black Lorren gave him a murderous look.  Aye, Prince.   He’s turned against me too, Theon realized. Of late it seemed to him as if the very stones of Winterfell had turned against him. If I die, I die friendless and abandoned. What choice did that leave him, but to live?  He rode to the gatehouse with his crown on his head. A woman was drawing water from the well, and Gage the cook stood in the door of the kitchens. They hid their hatred behind sullen looks and faces blank as slate, yet he could feel it all the same.  When the drawbridge was lowered, a chill wind sighed across the moat. The touch of it made him shiver. It is the cold, nothing more, Theon told himself, a shiver, not a tremble. Even brave men shiver. Into the teeth of that wind he rode, under the portcullis, over the drawbridge. The outer gates swung open to let him pass. As he emerged beneath the walls, he could sense the boys watching from the empty sockets where their eyes had been.  Ser Rodrik waited in the market astride his dappled gelding. Beside him, the direwolf of Stark flapped from a staff borne by young Cley Cerwyn. They were alone in the square, though Theon could see archers on the roofs of surrounding houses, spearmen to his right, and to his left a line of mounted knights beneath the merman-and-trident of House Manderly. Every one of them wants me dead. Some were boys he’d drunk with, diced with, even wenched with, but that would not save him if he fell into their hands.   Ser Rodrik.  Theon reined to a halt.  It grieves me that we must meet as foes.    My own grief is that I must wait a while to hang you.  The old knight spat onto the muddy ground.  Theon Turncloak.    I am a Greyjoy of Pyke,  Theon reminded him.  The cloak my father swaddled me in bore a kraken, not a direwolf.    For ten years you have been a ward of Stark.    Hostage and prisoner, I call it.    Then perhaps Lord Eddard should have kept you chained to a dungeon wall. Instead he raised you among his own sons, the sweet boys you have butchered, and to my undying shame I trained you in the arts of war. Would that I had thrust a sword through your belly instead of placing one in your hand.    I came out to parley, not to suffer your insults. Say what you have to say, old man. What would you have of me?    Two things,  the old man said.  Winterfell, and your life. Command your men to open the gates and lay down their arms. Those who murdered no children shall be free to walk away, but you shall be held for King Robb’s justice. May the gods take pity on you when he returns.    Robb will never look on Winterfell again,  Theon promised.  He will break himself on Moat Cailin, as every southron army has done for ten thousand years. We hold the north now, ser.    You hold three castles,  replied Ser Rodrik,  and this one I mean to take back, Turncloak.   Theon ignored that.  Here are my terms. You have until evenfall to disperse. Those who swear fealty to Balon Greyjoy as their king and to myself as Prince of Winterfell will be confirmed in their rights and properties and suffer no harm. Those who defy us will be destroyed.   Young Cerwyn was incredulous.  Are you mad, Greyjoy?   Ser Rodrik shook his head.  Only vain, lad. Theon has always had too lofty an opinion of himself, I fear.  The old man jabbed a finger at him.  Do not imagine that I need wait for Robb to fight his way up the Neck to deal with the likes of you. I have near two thousand men with me… and if the tales be true, you have no more than fifty.   Seventeen, in truth. Theon made himself smile.  I have something better than men.  And he raised a fist over his head, the signal Black Lorren had been told to watch for.  The walls of Winterfell were behind him, but Ser Rodrik faced them squarely and could not fail to see."
}