{
  "id": "09a53291836b6fd30b111832d22a3836a3e8b1db",
  "text": "  Indeed, they looked less like plants than thick, black, giant slugs, protruding vertically out of the soil.  Each was squirming slightly and had a number of large, shiny swellings upon it, which appeared to be full of liquid.   \"Bubotubers,\" Professor Sprout told them briskly. \"They need squeezing. You will collect the pus -\"   \"The what?\" said Seamus Finnigan, sounding revolted.   \"Pus, Finnigan, pus,\" said Professor Sprout, \"and it's extremely valuable, so don't waste it.  You will collect the pus, I say, in these bottles.  Wear your dragon-hide gloves; it can do funny things to the skin when undiluted, bubotuber pus.\"   Squeezing the bubotubers was disgusting, but oddly satisfying.  As each swelling was popped, a large amount of thick yellowish-green liquid burst forth, which smelled strongly of petrol.  They caught it in the bottles as Professor Sprout had indicated, and by the end of the lesson had collected several pints.   \"This'll keep Madam Pomfrey happy,\" said Professor Sprout, stoppering the last bottle with a cork.  \"An excellent remedy for the more stubborn forms of acne, bubotuber pus.  Should stop students resorting to desperate measures to rid themselves of pimples.\"   \"Like poor Eloise Midgen,\" said Hannah Abbott, a Hufflepuff, in a hushed voice.  \"She tried to curse hers off.\"   \"Silly girl,\" said Professor Sprout, shaking her head.  \"But Madam Pomfrey fixed her nose back on in the end.\"   A booming bell echoed from the castle across the wet grounds, signaling the end of the lesson, and the class separated; the Hufflepuffs climbing the stone steps for Transfiguration, and the Gryffindors heading in the other direction, down the sloping lawn toward Hagrid's small wooden cabin, which stood on the edge of the Forbidden Forest.   Hagrid was standing outside his hut, one hand on the collar of his enormous black boarhound, Fang. There were several open wooden crates on the ground at his feet, and Fang was whimpering and straining at his collar, apparently keen to investigate the contents more closely.  As they drew nearer, an odd rattling noise reached their ears, punctuated by what sounded like minor explosions. \"Mornin'!\" Hagrid said, grinning at Harry, Ron, and Hermione.  \"Be'er wait fer the Slytherins, they won' want ter miss this - Blast-Ended Skrewts!\" \"Come again?\" said Ron. Hagrid pointed down into the crates. \"Eurgh!\"  squealed Lavender Brown, jumping backward.  \"Eurgh\" just about summed up the Blast-Ended Skrewts in Harry's opinion.  They looked like deformed, shell-less lobsters, horribly pale and slimy-looking, with legs sticking out in very odd places and no visible heads. There were about a hundred of them in each crate, each about six inches long, crawling over one another, bumping blindly into the sides of the boxes.  They were giving off a very powerful smell of rotting fish.  Every now and then, sparks would fly out of the end of a skrewt, and with a small phut, it would be propelled forward several inches. \"On'y jus' hatched,\" said Hagrid proudly, \"so yeh'll be able ter raise 'em yerselves! Thought we'd make a bit of a project of it!\" \"And why would we want to raise them?\" said a cold voice. The Slytherins had arrived.  The speaker was Draco Malfoy.  Crabbe and Goyle were chuckling appreciatively at his words.  Hagrid looked stumped at the question. \"I mean, what do they do?\" asked Malfoy. \"What is the point of them?\" Hagrid opened his mouth, apparently thinking hard; there was a few seconds' pause, then he said roughly, \"Tha's next lesson, Malfoy.  Yer jus' feedin' 'em today.  Now, yeh'll wan' ter try 'em on a few diff'rent things - I've never had 'em before, not sure what they'll go fer - I got ant eggs an' frog livers an' a bit o' grass snake - just try 'em out with a bit of each.\" \"First pus and now this,\" muttered Seamus. Nothing but deep affection for Hagrid could have made Harry, Ron, and Hermione pick up squelchy handfuls of frog liver and lower them into the crates to tempt the Blast-Ended Skrewts.  Harry couldn't suppress the suspicion that the whole thing was entirely pointless, because the skrewts didn't seem to have mouths. \"Ouch!\" yelled Dean Thomas after about ten minutes. \"It got me.\" Hagrid hurried over to him, looking anxious. \"Its end exploded!\" said Dean angrily, showing Hagrid a burn on his hand. \"Ah, yeah, that can happen when they blast off,\" said Hagrid, nodding. \"Eurgh!\" said Lavender Brown again. \"Eurgh, Hagrid, what's that pointy thing on it?\" \"Ah, some of 'em have got stings,\" said Hagrid enthusiastically (Lavender quickly withdrew her hand from the box).  \"I reckon they're the males. . . . The females've got sorta sucker things on their bellies. . . . I think they might be ter suck blood.\" \"Well, I can certainly see why we're trying to keep them alive,\" said Malfoy sarcastically. \"Who wouldn't want pets that can burn, sting, and bite all at once?\" \"Just because they're not very pretty, it doesn't mean they're not useful,\" Hermione snapped.  \"Dragon blood's amazingly magical, but you wouldn't want a dragon for a pet, would you?\" Harry and Ron grinned at Hagrid, who gave them a furtive smile from behind his bushy beard."
}