{
  "id": "09bb2a8fd87cb349ee175c151da19ae954e9eb51",
  "text": " But then - when they had walked so far around the perimeter of the forest that the castle and the lake were out of sight - Harry heard something. Men were shouting up ahead. . . then came a deafening, earsplitting roar. . . Hagrid led Madame Maxime around a clump of trees and came to a halt.  Harry hurried up alongside them - for a split second, he thought he was seeing bonfires, and men darting around them - and then his mouth fell open. Dragons. Four fully grown, enormous, vicious-looking dragons were rearing onto their hind legs inside an enclosure fenced with thick planks of wood, roaring and snorting - torrents of fire were shooting into the dark sky from their open, fanged mouths, fifty feet above the ground on their outstretched necks.  There was a silvery-blue one with long, pointed horns, snapping and snarling at the wizards on the ground; a smooth-scaled green one, which was writhing and stamping with all its might; a red one with an odd fringe of fine gold spikes around its face, which was shooting mushroom-shaped fire clouds into the air; and a gigantic black one, more lizard-hike than the others, which was nearest to them. At least thirty wizards, seven or eight to each dragon, were attempting to control them, pulling on the chains connected to heavy leather straps around their necks and legs. Mesmerized, Harry looked up, high above him, and saw the eyes of the black dragon, with vertical pupils like a cat's, bulging with either fear or rage, he couldn't tell which. . . . It was making a horrible noise, a yowling, screeching scream. \"Keep back there, Hagrid!\"  yelled a wizard near the fence, straining on the chain he was holding.  \"They can shoot fire at a range of twenty feet, you know!  I've seen this Horntail do forty!\" \"Is'n' it beautiful?\"  said Hagrid softly. \"It's no good!\" yelled another wizard.  \"Stunning Spells, on the count of three!\" Harry saw each of the dragon keepers pull out his wand. \"Stupefy!\"  they shouted in unison, and the Stunning Spells shot into the darkness like fiery rockets, bursting in showers of stars on the dragons' scaly hides - Harry watched the dragon nearest to them teeter dangerously on its back legs; its jaws stretched wide in a silent howl; its nostrils were suddenly devoid of flame, though still smoking - then, very slowly, it fell.  Several tons of sinewy, scaly-black dragon hit the ground with a thud that Harry could have sworn made the trees behind him quake. The dragon keepers lowered their wands and walked forward to their fallen charges, each of which was the size of a small hill.  They hurried to tighten the chains and fasten them securely to iron pegs, which they forced deep into the ground with their wands. \"Wan' a closer look?\"  Hagrid asked Madame Maxime excitedly.  The pair of them moved right up to the fence, and Harry followed.  The wizard who had warned Hagrid not to come any closer turned, and Harry realized who it was:  Charlie Weasley. \"All right, Hagrid?\"  he panted, coming over to talk.  \"They should be okay now - we put them out with a Sleeping Draft on the way here, thought it might be better for them to wake up in the dark and the quiet - but, like you saw, they weren't happy, not happy at all -\" \"What breeds you got here, Charlie?\"  said Hagrid, gazing at the closest dragon, the black one, with something chose to reverence.  Its eyes were still just open.  Harry could see a strip of gleaming yellow beneath its wrinkled black eyelid. \"This is a Hungarian Horntail,\" said Charlie.  \"There's a Common Welsh Green over there, the smaller one -- a Swedish Short-Snout, that blue-gray -- and a Chinese Fireball, that's the red.\" Charlie looked around; Madame Maxime was strolling away around the edge of the enclosure, gazing at the stunned dragons. \"I didn't know you were bringing her, Hagrid,\" Charlie said, frowning.  \"The champions aren't supposed to know what's coming - she's bound to tell her student, isn't she?\" \"Jus' thought she'd like ter see 'em,\" shrugged Hagrid, still gazing, enraptured, at the dragons. \"Really romantic date, Hagrid,\" said Charlie, shaking his head. \"Four. . .\" said Hagrid, \"so it's one fer each o' the champions, is it?  What've they gotta do - fight 'em?\" \"Just get past them, I think,\" said Charlie.  \"We'll be on hand if it gets nasty, Extinguishing Spells at the ready.  They wanted nesting mothers, I don't know why. . . but I tell you this, I don't envy the one who gets the Horntail.  Vicious thing.  Its back end's as dangerous as its front, look.\" Charlie pointed toward the Horntail's tail, and Harry saw long, bronze-colored spikes protruding along it every few inches. Five of Charlie's fellow keepers staggered up to the Horntail at that moment, carrying a clutch of huge granite-gray eggs between them in a blanket. They placed them carefully at the Horntail's side.  Hagrid let out a moan of longing. \"I've got them counted, Hagrid,\" said Charlie sternly.  Then he said, \"How's Harry?\" \"Fine,\" said Hagrid. He was still gazing at the eggs."
}