{
  "id": "0a27447368b83bcb54a66ae07b55d2d8c39fa7db",
  "text": " \"Oh yes, I'm fine,\" Neville gabbled in the same unnaturally high voice.  \"Very interesting dinner - I mean lesson - what's for eating?\" Ron gave Harry a startled look. \"Neville, what - ?\" But an odd clunking noise sounded behind them, and they turned to see Professor Moody limping toward them.  All four of them fell silent, watching him apprehensively, but when he spoke, it was in a much lower and gentler growl than they had yet heard. \"It's all right, sonny,\" he said to Neville.  \"Why don't you come up to my office?  Come on. . . we can have a cup of tea. . . .\" Neville looked even more frightened at the prospect of tea with Moody.  He neither moved nor spoke.  Moody turned his magical eye upon Harry. \"You all right, are you, Potter?\" \"Yes,\" said Harry, almost defiantly. Moody's blue eye quivered slightly in its socket as it surveyed Harry.  Then he said, \"You've got to know.  It seems harsh, maybe, but you've got to know.  No point pretending. . . well.. . come on, Longbottom, I've got some books that might interest you.\" Neville looked pleadingly at Harry, Ron, and Hermione, but they didn't say anything, so Neville had no choice but to allow himself to be steered away, one of Moody's gnarled hands on his shoulder. \"What was that about?\"  said Ron, watching Neville and Moody turn the corner. \"I don't know,\" said Hermione, looking pensive. \"Some lesson, though, eh?\" said Ron to Harry as they set off for the Great Hall.  \"Fred and George were right, weren't they?  He really knows his stuff, Moody, doesn't he?  When he did Avada Kedavra, the way that spider just died, just snuffed it right -\" But Ron fell suddenly silent at the look on Harry's face and didn't speak again until they reached the Great Hall, when he said he supposed they had better make a start on Professor Trelawney's predictions tonight, since they would take hours. Hermione did not join in with Harry and Ron's conversation during dinner, but ate furiously fast, and then left for the library again.  Harry and Ron walked back to Gryffindor Tower, and Harry, who had been thinking of nothing else all through dinner, now raised the subject of the Unforgivable Curses himself. \"Wouldn't Moody and Dumbledore be in trouble with the Ministry if they knew we'd seen the curses?\"  Harry asked as they approached the Fat Lady. \"Yeah, probably,\" said Ron.  \"But Dumbledore's always done things his way, hasn't he, and Moody's been getting in trouble for years, I reckon.  Attacks first and asks questions later - look at his dustbins.  Balderdash.\" The Fat Lady swung forward to reveal the entrance hole, and they climbed into the Gryffindor common room, which was crowded and noisy. \"Shall we get our Divination stuff, then?\"  said Harry. \"I s'pose,\" Ron groaned. They went up to the dormitory to fetch their books and charts, to find Neville there alone, sitting on his bed, reading.  He looked a good deal calmer than at the end of Moody's lesson, though still not entirely normal.  His eyes were rather red. \"You all right, Neville?\" Harry asked him. \"Oh yes,\" said Neville, \"I'm fine, thanks.  Just reading this book Professor Moody lent me. . .\" He held up the book:  Magical Water Plants of the Mediterranean. \"Apparently, Professor Sprout told Professor Moody I'm really good at Herbology,\" Neville said.  There was a faint note of pride in his voice that Harry had rarely heard there before.  \"He thought I'd like this.\" Telling Neville what Professor Sprout had said, Harry thought, had been a very tactful way of cheering Neville up, for Neville very rarely heard that he was good at anything.  It was the sort of thing Professor Lupin would have done. Harry and Ron took their copies of Unfogging the Future back down to the common room, found a table, and set to work on their predictions for the coming month.  An hour later, they had made very little progress, though their table was littered with bits of parchment bearing sums and symbols, and Harry's brain was as fogged as though it had been filled with the fumes from Professor Trelawney's fire. \"I haven't got a clue what this lot's supposed to mean,\" he said, staring down at a long list of calculations. \"You know,\" said Ron, whose hair was on end because of all the times he had run his fingers through it in frustration, \"I think it's back to the old Divination standby.\" \"What - make it up?\" \"Yeah,\" said Ron, sweeping the jumble of scrawled notes off the table, dipping his pen into some ink, and starting to write. \"Next Monday,\" he said as he scribbled, \"I am likely to develop a cough, owing to the unlucky conjunction of Mars and Jupiter.\"  He looked up at Harry.  \"You know her - just put in loads of misery, she'll lap it up.\" \"Right,\" said Harry, crumpling up his first attempt and lobbing it over the heads of a group of chattering first years into the fire.  \"Okay. . . on Monday, I will be in danger of- er - burns.\" \"Yeah, you will be,\" said Ron darkly, \"we're seeing the skrewts again on Monday. Okay, Tuesday, I'll. . ."
}