{
  "id": "0a5ded3808d21fd689a2f09736a1d07492033788",
  "text": "  She studied Lord Jason boldly. The last time she had seen him he had been jesting with her uncle at her wedding feast; the Mallisters stood bannermen to the Tullys, and his gifts had been lavish. His brown hair was salted with white now, his face chiseled gaunt by time, yet the years had not touched his pride. He rode like a man who feared nothing. Catelyn envied him that; she had come to fear so much. As the riders passed, Lord Jason nodded a curt greeting, but it was only a high lord’s courtesy to strangers chance met on the road. There was no recognition in those fierce eyes, and his son did not even waste a look.   He did not know you,  Ser Rodrik said after, wondering.   He saw a pair of mud-spattered travelers by the side of the road, wet and tired. It would never occur to him to suspect that one of them was the daughter of his liege lord. I think we shall be safe enough at the inn, Ser Rodrik.   It was near dark when they reached it, at the crossroads north of the great confluence of the Trident. Masha Heddle was fatter and greyer than Catelyn remembered, still chewing her sourleaf, but she gave them only the most cursory of looks, with nary a hint of her ghastly red smile.  Two rooms at the top of the stair, that’s all there is,  she said, chewing all the while.  They’re under the bell tower, you won’t be missing meals, though there’s some thinks it too noisy. Can’t be helped. We’re full up, or near as makes no matter. It’s those rooms or the road.   It was those rooms, low, dusty garrets at the top of a cramped narrow staircase.  Leave your boots down here,  Masha told them after she’d taken their coin.  The boy will clean them. I won’t have you tracking mud up my stairs. Mind the bell. Those who come late to meals don’t eat.  There were no smiles, and no mention of sweet cakes.  When the supper bell rang, the sound was deafening. Catelyn had changed into dry clothes. She sat by the window, watching rain run down the pane. The glass was milky and full of bubbles, and a wet dusk was falling outside. Catelyn could just make out the muddy crossing where the two great roads met.  The crossroads gave her pause. If they turned west from here, it was an easy ride down to Riverrun. Her father had always given her wise counsel when she needed it most, and she yearned to talk to him, to warn him of the gathering storm. If Winterfell needed to brace for war, how much more so Riverrun, so much closer to King’s Landing, with the power of Casterly Rock looming to the west like a shadow. If only her father had been stronger, she might have chanced it, but Hoster Tully had been bedridden these past two years, and Catelyn was loath to tax him now.  The eastern road was wilder and more dangerous, climbing through rocky foothills and thick forests into the Mountains of the Moon, past high passes and deep chasms to the Vale of Arryn and the stony Fingers beyond. Above the Vale, the Eyrie stood high and impregnable, its towers reaching for the sky. There she would find her sister… and, perhaps, some of the answers Ned sought. Surely Lysa knew more than she had dared to put in her letter. She might have the very proof that Ned needed to bring the Lannisters to ruin, and if it came to war, they would need the Arryns and the eastern lords who owed them service.  Yet the mountain road was perilous. Shadowcats prowled those passes, rock slides were common, and the mountain clans were lawless brigands, descending from the heights to rob and kill and melting away like snow whenever the knights rode out from the Vale in search of them. Even Jon Arryn, as great a lord as any the Eyrie had ever known, had always traveled in strength when he crossed the mountains. Catelyn’s only strength was one elderly knight, armored in loyalty.  No, she thought, Riverrun and the Eyrie would have to wait. Her path ran north to Winterfell, where her sons and her duty were waiting for her. As soon as they were safely past the Neck, she could declare herself to one of Ned’s bannermen, and send riders racing ahead with orders to mount a watch on the kingsroad.  The rain obscured the fields beyond the crossroads, but Catelyn saw the land clear enough in her memory. The marketplace was just across the way, and the village a mile farther on, half a hundred white cottages surrounding a small stone sept. There would be more now; the summer had been long and peaceful. North of here the kingsroad ran along the Green Fork of the Trident, through fertile valleys and green woodlands, past thriving towns and stout holdfasts and the castles of the river lords.  Catelyn knew them all: the Blackwoods and the Brackens, ever enemies, whose quarrels her father was obliged to settle; Lady Whent, last of her line, who dwelt with her ghosts in the cavernous vaults of Harrenhal; irascible Lord Frey, who had outlived seven wives and filled his twin castles with children, grandchildren, and great-grandchildren, and bastards and grandbastards as well. All of them were bannermen to the Tullys, their swords sworn to the service of Riverrun."
}