{
  "id": "0a617efa139877c855b34270965dcbf372f0b62d",
  "text": " I’ll wait for you below.  He went striding off, his cloak swirling behind him.  Catelyn exchanged a look with Ser Rodrik. They went through the doors to the high, nervous sound of a child’s giggles.  Lysa’s apartments opened over a small garden, a circle of dirt and grass planted with blue flowers and ringed on all sides by tall white towers. The builders had intended it as a godswood, but the Eyrie rested on the hard stone of the mountain, and no matter how much soil was hauled up from the Vale, they could not get a weirwood to take root here. So the Lords of the Eyrie planted grass and scattered statuary amidst low, flowering shrubs. It was there the two champions would meet to place their lives, and that of Tyrion Lannister, into the hands of the gods.  Lysa, freshly scrubbed and garbed in cream velvet with a rope of sapphires and moonstones around her milk-white neck, was holding court on the terrace overlooking the scene of the combat, surrounded by her knights, retainers, and lords high and low. Most of them still hoped to wed her, bed her, and rule the Vale of Arryn by her side. From what Catelyn had seen during her stay at the Eyrie, it was a vain hope.  A wooden platform had been built to elevate Robert’s chair; there the Lord of the Eyrie sat, giggling and clapping his hands as a humpbacked puppeteer in blue-and-white motley made two wooden knights hack and slash at each other. Pitchers of thick cream and baskets of blackberries had been set out, and the guests were sipping a sweet orange-scented wine from engraved silver cups. A fool’s festival, Brynden had called it, and small wonder.  Across the terrace, Lysa laughed gaily at some jest of Lord Hunter’s, and nibbled a blackberry from the point of Ser Lyn Corbray’s dagger. They were the suitors who stood highest in Lysa’s favor… today, at least. Catelyn would have been hard-pressed to say which man was more unsuitable. Eon Hunter was even older than Jon Arryn had been, half-crippled by gout, and cursed with three quarrelsome sons, each more grasping than the last. Ser Lyn was a different sort of folly; lean and handsome, heir to an ancient but impoverished house, but vain, reckless, hot-tempered… and, it was whispered, notoriously uninterested in the intimate charms of women.  When Lysa espied Catelyn, she welcomed her with a sisterly embrace and a moist kiss on the cheek.  Isn’t it a lovely morning? The gods are smiling on us. Do try a cup of the wine, sweet sister. Lord Hunter was kind enough to send for it, from his own cellars.    Thank you, no. Lysa, we must talk.    After,  her sister promised, already beginning to turn away from her.   Now.  Catelyn spoke more loudly than she’d intended. Men were turning to look.  Lysa, you cannot mean to go ahead with this folly. Alive, the Imp has value. Dead, he is only food for crows. And if his champion should prevail here—    Small chance of that, my lady,  Lord Hunter assured her, patting her shoulder with a liver-spotted hand.  Ser Vardis is a doughty fighter. He will make short work of the sellsword.    Will he, my lord?  Catelyn said coolly.  I wonder.  She had seen Bronn fight on the high road; it was no accident that he had survived the journey while other men had died. He moved like a panther, and that ugly sword of his seemed a part of his arm.  Lysa’s suitors were gathering around them like bees round a blossom.  Women understand little of these things,  Ser Morton Waynwood said.  Ser Vardis is a knight, sweet lady. This other fellow, well, his sort are all cowards at heart. Useful enough in a battle, with thousands of their fellows around them, but stand them up alone and the manhood leaks right out of them.    Say you have the truth of it, then,  Catelyn said with a courtesy that made her mouth ache.  What will we gain by the dwarf’s death? Do you imagine that Jaime will care a fig that we gave his brother a trial before we flung him off a mountain?    Behead the man,  Ser Lyn Corbray suggested.  When the Kingslayer receives the Imp’s head, it will be a warning to him,   Lysa gave an impatient shake of her waist-long auburn hair.  Lord Robert wants to see him fly,  she said, as if that settled the matter.  And the Imp has only himself to blame. It was he who demanded a trial by combat.    Lady Lysa had no honorable way to deny him, even if she’d wished to,  Lord Hunter intoned ponderously.  Ignoring them all, Catelyn turned all her force on her sister.  I remind you, Tyrion Lannister is my prisoner.    And I remind you, the dwarf murdered my lord husband!  Her voice rose.  He poisoned the Hand of the King and left my sweet baby fatherless, and now I mean to see him pay!  Whirling, her skirts swinging around her, Lysa stalked across the terrace. Ser Lyn and Ser Morton and the other suitors excused themselves with cool nods and trailed after her.   Do you think he did?  Ser Rodrik asked her quietly when they were alone again.  Murder Lord Jon, that is? The Imp still denies it, and most fiercely…    I believe the Lannisters murdered Lord Arryn,  Catelyn replied,  but whether it was Tyrion, or Ser Jaime, or the queen, or all of them together, I could not begin to say."
}