{
  "id": "0b0aff4715218b692b5b1adb3bcc58f39b0c8945",
  "text": " Yet   I  think I caught a glimpse with  the tail  of-my eye, as the saying  is, of  something dark shooting under the shadow of the bank. I couldn't see no more  eyes though.       `I said to myself: \"dreaming again, Sam Gamgee,\" I said: and  I said no  more just then. But  I've been  thinking since. and now I'm not so sure. What  do you make of it, Mr. Frodo? '       'I  should make nothing of it  but a log and the dusk and sleep in your  eyes Sam, said  Frodo, if this was the  first  time that those eyes had been  seen. But it isn't. I saw them away back north before we reached Lurien. And  I saw  a strange creature with eyes climbing to the  flet that night. Haldir  saw it too. And do you remember the report of the  Elves that went after the   orc-band?  '       `Ah,'  said  Sam. `I  do;  and  I remember  more too.  I don't  like my  thoughts; but thinking of one thing and another, and Mr. Bilbo's stories and  all, I fancy I  could put a name on the creature,  at a guess. A nasty name.  Gollum, maybe?  '       `Yes, that  is what  I  have feared for  some  time,' said  Frodo. `Ever   since  the night on the flet. I suppose he was lurking in Moria, and  picked  up our trail then;  but I hoped that our stay in Lurien would throw  him off  the scent again. The miserable creature must  have  been hiding in the woods  by the Silverlode, watching us start off! '       `That's about it,'  said Sam. `And  we'd better be a  bit more watchful  ourselves,  or we'll  feel some  nasty fingers  round our necks one of these  nights, if we ever wake up to feel anything. And   that's what I  was leading   ####-up to. No need to trouble  Strider or the others tonight. I'll keep watch. I  can sleep tomorrow, being no more than luggage in a boat, as you might say.'       `I might,' said Frodo, `and I might say \"luggage with eyes\".  You shall  watch; but only if  you promise  to  wake me  halfway  towards  morning,  if  nothing happens before then.'       In the  dead hours Frodo came out  of a  deep dark  sleep  to find  Sam  shaking him. `It's a shame to wake you,' whispered Sam, `but that's what you  said. There's  nothing  to  tell,  or not much. I thought I heard  some soft   plashing and a sniffing noise, a while  back;  but  you hear  a lot  of such  queer sounds by a river at night.'       He lay down, and Frodo sat up, huddled in his blankets,   and fought off  his sleep. Minutes or hours passed  slowly, and  nothing happened. Frodo was  just yielding  to the temptation to lie down again when a dark shape, hardly  visible, floated close to one of the moored boats. A long whitish hand could   be dimly seen as it shot out and grabbed the gunwale; two pale lamplike eyes  shone coldly as  they peered inside, and then they  lifted  and gazed up  at  Frodo  on the eyot. They were not more than a yard or  two  away,  and Frodo  heard  the  soft hiss of intaken breath. He stood up, drawing Sting from its  sheath, and faced the eyes. Immediately their light was shut  off. There was  another hiss and a splash, and the dark log-shape shot away downstream  into  the night. Aragorn stirred in his sleep, turned over, and sat up`       'What is it? ' he whispered, springing  up and coming to Frodo. `I felt  something in my sleep. Why have you drawn your sword? '       `Gollum,' answered Frodo. 'Or at least, so I guess.'       `Ah! '  said Aragorn. `So you know about our little footpad, do you? He  padded after us all through Moria and right down to Nimrodel. Since we  took   to boats,  he has been lying on a  log  and paddling with  hands and feet. I  have tried  to catch him once or twice at night; but he is slier than a fox,  and a s slippery as a  fish. I hoped the river -voyage would beat him, but  he  is too clever a waterman.       `We  shall have to  try going faster tomorrow. You lie down  now, and I  will keep watch for what is left of the night.  I wish I could  lay my hands  on the wretch.  We might make him useful. But if I cannot, we shall have  to  try  and lose him. He is very dangerous. Quite apart from murder by night on  his own account, he may put any enemy that is about on our track.'       The night  passed without  Gollum showing  so  much as  a shadow again.  After that the Company kept a sharp look -out, but they saw no more of Gollum   ####-while  the voyage lasted.  If he  was still following, he  was very wary and  cunning.  At Aragorn's bidding they paddled now  for  long  spells, and  the  banks went  swiftly  by.  But  they  saw little  of the  country,  for  they  journeyed mostly by night and  twilight, resting by day, and lying as hidden   as the  land  allowed.  In this way the  time passed without event until the  seventh day.       The weather was still grey and overcast,  with  wind from the East, but  as evening drew into night the sky away westward cleared, and pools of faint  light,  yellow and pale green, opened under  the grey shores of cloud. There  the white rind of the new Moon could be seen glimmering in the remote lakes."
}