{
  "id": "0b0e2cf3bb8fa0dc9a669fa957a7e0f7b62260a3",
  "text": " Arya flushed. They had always been close. Jon had their father’s face, as she did. They were the only ones. Robb and Sansa and Bran and even little Rickon all took after the Tullys, with easy smiles and fire in their hair. When Arya had been little, she had been afraid that meant that she was a bastard too. It been Jon she had gone to in her fear, and Jon who had reassured her.   Why aren’t you down in the yard?  Arya asked him.  He gave her a half smile.  Bastards are not allowed to damage young princes,  he said.  Any bruises they take in the practice yard must come from trueborn swords.    Oh.  Arya felt abashed. She should have realized. For the second time today, Arya reflected that life was not fair.  She watched her little brother whack at Tommen.  I could do just as good as Bran,  she said.  He’s only seven. I’m nine.   Jon looked her over with all his fourteen-year-old wisdom.  You’re too skinny,  he said. He took her arm to feel her muscle. Then he sighed and shook his head.  I doubt you could even lift a longsword, little sister, never mind swing one.   Arya snatched back her arm and glared at him. Jon messed up her hair again. They watched Bran and Tommen circle each other.   You see Prince Joffrey?  Jon asked.  She hadn’t, not at first glance, but when she looked again she found him to the back, under the shade of the high stone wall. He was surrounded by men she did not recognize, young squires in the livery of Lannister and Baratheon, strangers all. There were a few older men among them; knights, she surmised.   Look at the arms on his surcoat,  Jon suggested.  Arya looked. An ornate shield had been embroidered on the prince’s padded surcoat. No doubt the needlework was exquisite. The arms were divided down the middle; on one side was the crowned stag of the royal House, on the other the lion of Lannister.   The Lannisters are proud,  Jon observed.  You’d think the royal sigil would be sufficient, but no. He makes his mother’s House equal in honor to the king’s.    The woman is important too!  Arya protested.  Jon chuckled.  Perhaps you should do the same thing, little sister. Wed Tully to Stark in your arms.    A wolf with a fish in its mouth?  It made her laugh.  That would look silly. Besides, if a girl can’t fight, why should she have a coat of arms?   Jon shrugged.  Girls get the arms but not the swords. Bastards get the swords but not the arms. I did not make the rules, little sister.   There was a shout from the courtyard below. Prince Tommen was rolling in the dust, trying to get up and failing. All the padding made him look like a turtle on its back. Bran was standing over him with upraised wooden sword, ready to whack him again once he regained his feet. The men began to laugh.   Enough!  Ser Rodrik called out. He gave the prince a hand and yanked him back to his feet.  Well fought. Lew, Donnis, help them out of their armor.  He looked around.  Prince Joffrey, Robb, will you go another round?   Robb, already sweaty from a previous bout, moved forward eagerly.  Gladly.   Joffrey moved into the sunlight in response to Rodrik’s summons. His hair shone like spun gold. He looked bored.  This is a game for children, Ser Rodrik.   Theon Greyjoy gave a sudden bark of laughter.  You are children,  he said derisively.   Robb may be a child,  Joffrey said.  I am a prince. And I grow tired of swatting at Starks with a play sword.    You got more swats than you gave, Joff,  Robb said.  Are you afraid?   Prince Joffrey looked at him.  Oh, terrified,  he said.  You’re so much older.  Some of the Lannister men laughed.  Jon looked down on the scene with a frown.  Joffrey is truly a little shit,  he told Arya.  Ser Rodrik tugged thoughtfully at his white whiskers.  What are you suggesting?  he asked the prince.   Live steel.    Done,  Robb shot back.  You’ll be sorry!   The master-at-arms put a hand on Robb’s shoulder to quiet him.  Live steel is too dangerous. I will permit you tourney swords, with blunted edges.   Joffrey said nothing, but a man strange to Arya, a tall knight with black hair and burn scars on his face, pushed forward in front of the prince.  This is your prince. Who are you to tell him he may not have an edge on his sword, ser?    Master-at-arms of Winterfell, Clegane, and you would do well not to forget it.    Are you training women here?  the burned man wanted to know. He was muscled like a bull.   I am training knights,  Ser Rodrik said pointedly.  They will have steel when they are ready. When they are of an age.   The burned man looked at Robb.  How old are you, boy?    Fourteen,  Robb said.   I killed a man at twelve. You can be sure it was not with a blunt sword.   Arya could see Robb bristle. His pride was wounded. He turned on Ser Rodrik.  Let me do it. I can beat him.    Beat him with a tourney blade, then,  Ser Rodrik said.  Joffrey shrugged.  Come and see me when you’re older, Stark. If you’re not too old.  There was laughter from the Lannister men.  Robb’s curses rang through the yard."
}