{
  "id": "0c45e4a611bd9e7e983f39dd78daf98b086535e9",
  "text": " His arrows were fletched with grey goose feathers, and six of them stood in the ground before him, like a little fence.  The three men looked at her, standing there in the road with her blade in hand. Then the singer idly plucked a string.  Boy,  he said,  put up that sword now, unless you’re wanting to be hurt. It’s too big for you, lad, and besides, Anguy here could put three shafts through you before you could hope to reach us.    He could not,  Arya said,  and I’m a girl.    So you are.  The singer bowed.  My pardons.    You go on down the road. Just walk right past here, and you keep on singing, so we’ll know where you are. Go away and leave us be and I won’t kill you.   The freckle-faced archer laughed.  Lem, she won’t kill us, did you hear?    I heard,  said Lem, the big soldier with the deep voice.   Child,  said the singer,  put up that sword, and we’ll take you to a safe place and get some food in that belly. There are wolves in these parts, and lions, and worse things. No place for a little girl to be wandering alone.    She’s not alone.  Gendry rode out from behind the cottage wall, and behind him Hot Pie, leading her horse. In his chainmail shirt with a sword in his hand, Gendry looked almost a man grown, and dangerous. Hot Pie looked like Hot Pie.  Do like she says, and leave us be,  warned Gendry.   Two and three,  the singer counted,  and is that all of you? And horses too, lovely horses. Where did you steal them?    They’re ours.  Arya watched them carefully. The singer kept distracting her with his talk, but it was the archer who was the danger. If he should pull an arrow from the ground…   Will you give us your names like honest men?  the singer asked the boys.   I’m Hot Pie,  Hot Pie said at once.   Aye, and good for you.  The man smiled.  It’s not every day I meet a lad with such a tasty name. And what would your friends be called, Mutton Chop and Squab?   Gendry scowled down from his saddle.  Why should I tell you my name? I haven’t heard yours.    Well, as to that, I’m Tom of Sevenstreams, but Tom Sevenstrings is what they call me, or Tom o’ Sevens. This great lout with the brown teeth is Lem, short for Lemoncloak. It’s yellow, you see, and Lem’s a sour sort. And young fellow me lad over there is Anguy, or Archer as we like to call him.    Now who are you?  demanded Lem, in the deep voice that Arya had heard through the branches of the willow.  She was not about to give up her true name as easy as that.  Squab, if you want,  she said.  I don’t care.   The big man laughed.  A squab with a sword,  he said.  Now there’s something you don’t often see.    I’m the Bull,  said Gendry, taking his lead from Arya. She could not blame him for preferring Bull to Mutton Chop.  Tom Sevenstrings strummed his harp.  Hot Pie, Squab, and the Bull. Escaped from Lord Bolton’s kitchen, did you?    How did you know?  Arya demanded, uneasy.   You bear his sigil on your chest, little one.   She had forgotten that for an instant. Beneath her cloak, she still wore her fine page’s doublet, with the flayed man of the Dreadfort sewn on her breast.  Don’t call me little one!    Why not?  said Lem.  You’re little enough.    I’m bigger than I was. I’m not a child.  Children didn’t kill people, and she had.   I can see that, Squab. You’re none of you children, not if you were Bolton’s.    We never were.  Hot Pie never knew when to keep quiet.  We were at Harrenhal before he came, that’s all.    So you’re lion cubs, is that the way of it?  said Tom.   Not that either. We’re nobody’s men. Whose men are you?   Anguy the Archer said,  We’re king’s men.   Arya frowned.  Which king?    King Robert,  said Lem, in his yellow cloak.   That old drunk?  said Gendry scornfully.  He’s dead, some boar killed him, everyone knows that.    Aye, lad,  said Tom Sevenstrings,  and more’s the pity.  He plucked a sad chord from his harp.  Arya didn’t think they were king’s men at all. They looked more like outlaws, all tattered and ragged. They didn’t even have horses to ride. King’s men would have had horses.  But Hot Pie piped up eagerly.  We’re looking for Riverrun,  he said.  How many days’ ride is it, do you know?   Arya could have killed him.  You be quiet, or I’ll stuff rocks in your big stupid mouth,    Riverrun is a long way upstream,  said Tom.  A long hungry way. Might be you’d like a hot meal before you set out? There’s an inn not far ahead kept by some friends of ours. We could share some ale and a bite of bread, instead of fighting one another.    An inn?  The thought of hot food made Arya’s belly rumble, but she didn’t trust this Tom. Not everyone who spoke you friendly was really your friend.  It’s near, you say?    Two miles upstream,  said Tom.  A league at most.   Gendry looked as uncertain as she felt.  What do you mean, friends?  he asked warily.   Friends. Have you forgotten what friends are?    Sharna is the innkeep’s name,  Tom put in.  She has a sharp tongue and a fierce eye, I’ll grant you that, but her heart’s a good one, and she’s fond of little girls."
}