{
  "id": "0c716b2476f728fae9d5918a88d066f650c6ac4b",
  "text": "  Elia. Say it! Elia. Of Dorne!  He was circling, spear poised for another thrust.  Say it!   Tyrion had his own prayer. Fall down and die, was how it went. Damn you, fall down and die! The blood trickling from the Mountain’s armpit was his own now, and he must be bleeding even more heavily inside the breastplate. When he tried to take a step, one knee buckled. Tyrion thought he was going down.  Prince Oberyn had circled behind him.  ELIA OF DORNE!  he shouted. Ser Gregor started to turn, but too slow and too late. The spearhead went through the back of the knee this time, through the layers of chain and leather between the plates on thigh and calf. The Mountain reeled, swayed, then collapsed face first on the ground. His huge sword went flying from his hand. Slowly, ponderously, he rolled onto his back.  The Dornishman flung away his ruined shield, grasped the spear in both hands, and sauntered away. Behind him the Mountain let out a groan, and pushed himself onto an elbow. Oberyn whirled cat-quick, and ran at his fallen foe.  EEEEELLLLLLIIIIIAAAAA!  he screamed, as he drove the spear down with the whole weight of his body behind it. The crack of the ashwood shaft snapping was almost as sweet a sound as Cersei’s wail of fury, and for an instant Prince Oberyn had wings. The snake has vaulted over the Mountain. Four feet of broken spear jutted from Clegane’s belly as Prince Oberyn rolled, rose, and dusted himself off. He tossed aside the splintered spear and claimed his foe’s greatsword.  If you die before you say her name, ser, I will hunt you through all seven hells,  he promised.  Ser Gregor tried to rise, The broken spear had gone through him, and was pinning him to the ground. He wrapped both hands about the shaft, grunting, but could not pull it out. Beneath him was a spreading pool of red.  I am feeling more innocent by the instant,  Tyrion told Ellaria Sand beside him.  Prince Oberyn moved closer.  Say the name!  He put a foot on the Mountain’s chest and raised the greatsword with both hands. Whether he intended to hack off Gregor’s head or shove the point through his eyeslit was something Tyrion would never know.  Clegane’s hand shot up and grabbed the Dornishman behind the knee. The Red Viper brought down the greatsword in a wild slash, but he was off-balance, and the edge did no more than put another dent in the Mountain’s vambrace. Then the sword was forgotten as Gregor’s hand tightened and twisted, yanking the Dornishman down on top of him. They wrestled in the dust and blood, the broken spear wobbling back and forth. Tyrion saw with horror that the Mountain had wrapped one huge arm around the prince, drawing him tight against his chest, like a lover.   Elia of Dorne,  they all heard Ser Gregor say, when they were close enough to kiss. His deep voice boomed within the helm.  I killed her screaming whelp.  He thrust his free hand into Oberyn’s unprotected face, pushing steel fingers into his eyes.  Then I raped her.  Clegane slammed his fist into the Dornishman’s mouth, making splinters of his teeth.  Then I smashed her fucking head in. Like this.  As he drew back his huge fist, the blood on his gauntlet seemed to smoke in the cold dawn air. There was a sickening crunch. Ellaria Sand wailed in terror, and Tyrion’s breakfast came boiling back up. He found himself on his knees retching bacon and sausage and applecakes, and that double helping of fried eggs cooked up with onions and fiery Dornish peppers.  He never heard his father speak the words that condemned him. Perhaps no words were necessary. I put my life in the Red Viper’s hands, and he dropped it. When he remembered, too late, that snakes had no hands, Tyrion began to laugh hysterically.  He was halfway down the serpentine steps before he realized that the gold cloaks were not taking him back to his tower room.  I’ve been consigned to the black cells,  he said. They did not bother to answer. Why waste your breath on the dead?      Daenerys   Dany broke her fast under the persimmon tree that grew in the terrace garden, watching her dragons chase each other about the apex of the Great Pyramid where the huge bronze harpy once stood. Meereen had a score of lesser pyramids, but none stood even half as tall. From here she could see the whole city: the narrow twisty alleys and wide brick streets, the temples and granaries, hovels and palaces, brothels and baths, gardens and fountains, the great red circles of the fighting pits. And beyond the walls was the pewter sea, the winding Skahazadhan, the dry brown hills, burnt orchards, and blackened fields. Up here in her garden Dany sometimes felt like a god, living atop the highest mountain in the world.  Do all gods feel so lonely? Some must, surely. Missandei had told her of the Lord of Harmony, worshiped by the Peaceful People of Naath; he was the only true god, her little scribe said, the god who always was and always would be, who made the moon and stars and earth, and all the creatures that dwelt upon them."
}