{
  "id": "0c870c60b78838dcce1c4fa306bb6d3a23631bee",
  "text": " 'If they've killed you,  what  shall I do? Well, I'm coming at last, right to the top, to see what I must.'     ####-     Up, up he went. It was dark save  for an occasional torch  flaring at a   turn, or beside some opening  that  led into the higher levels of the Tower.  Sam tried to count the  steps, but  after two hundred he lost his reckoning.  He  was moving quietly  now: for  he thought that he could hear the sound of  voices talking, still  some way above. More than  one rat remained alive, it  seemed.       All  at  once, when he felt that he could pump out no more  breath, nor   force  his knees to bend again, the stair ended. He stood still. The  voices  were  now loud and near. Sam  peered about. He had climbed right to the flat  roof of the third and highest tier of the Tower: an open space, about twenty  yards across, with  a low parapet. There the  stair was covered by  a  small  domed chamber in the midst of the roof, with low doors facing east and west.  Eastward Sam  could  see the plain  of Mordor vast  and  dark below, and the  burning mountain  far away. A  fresh turmoil was surging in its  deep wells,   and the rivers of fire blazed so fiercely that even at this distance of many  miles the light  of them  lit the tower -top with a red glare.  Westward  the  view was blocked  by the base of the great turret that stood at the  back of  this upper court and reared its  horn high above the crest of the encircling  hills. Light gleamed in a window-slit. Its door was not ten yards from where  Sam stood. It  was open but dark, and from just within its shadow the voices  came.       At first Sam did not listen; he took a pace  out  of the  eastward door   and  looked  about.  At  once he saw  that up  here the  fighting  had  been  fiercest. All the  court was  choked with  dead orcs  or their  severed  and  scattered heads  and limbs. The place stank of death. A snarl  followed by  a  blow  and  a  cry  sent him darting back into hiding. An  orc-voice rose  in  anger,  and he knew  it again  at once, harsh, brutal, cold. It was  Shagrat  speaking, Captain of the Tower.       `You won't  go again,  you say? Curse you, Snaga, you little maggot! If  you think  I'm so damaged  that it's safe  to flout me, you're mistaken Come  here, and I'll  squeeze  your  eyes out, like I did to Radbug just now.  And  when some new lads come, I'll deal with you: I'll send you to Shelob.'       `They  won't  come,  not before  you're dead  anyway,'  answered  Snaga   surlily. 'I've told you twice that Gorbag's swine got to the gate first, and  none of ours  got out. Lagduf and Muzgash ran through, but they were shot. I  saw it from a window, I tell you. And they wer e the last.'       'Then you  must go. I must stay here anyway. But  I'm  hurt.  The Black    ####-Pits take  that filthy  rebel  Gorbag!' Shagrat's  voice trailed off into  a   string of foul  names and curses. `I  gave  him  better  than  I got, but he  knifed me, the dung,  before I throttled him. You must go, or  I'll eat you.  News must  get through to Lugb®rz, or we'll both be for the Black Pits. Yes,  you too. You won't escape by skulking here.'       `I'm not going down those stairs again,' growled Snaga, `be you captain  or no. Nar! Keep your hands off your knife,  or I'll  put  an arrow  in your  guts. You won't be a captain  long when They hear about all these goings-on.  I've  fought for the  Tower against those  stinking Morgul-rats,  but a nice  mess you two precious captains have made of things, fighting over the swag.'       'That's enough  from you,'  snarled  Shagrat. `I had my orders. It  was  Gorbag started it, trying to pinch that pretty shirt.'       `Well, you put  his back up, being so high and mighty. And he had  more  sense than you anyway. He told you more than once that the most dangerous of  these spies was still loose, and you wouldn't  listen. And you  won't listen  now. Gorbag  was right, I tell you. There's  a great fighter  about,  one of  those bloody-handed  Elves, or one of the filthy tarks.1 He's coming here, I  tell you. You heard the bell.  He's got past the Watchers, and that's tark's  work.  He's on the stairs. And until he's off them, I'm not going  down. Not  if you were a Nazgyl, I wouldn't.'       `So  that's it, is it?' yelled Shagrat. 'You'll do this, and you'll not  do  that? And  when he does come, you'll bolt  and leave me? No, you  won't!  I'll put red maggot-holes in your belly first.'       Out of the turret-door the  smaller  orc came flying.  Behind  him came  Shagrat, a large orc with long  arms that,  as  he ran crouching, reached to  the  ground. But one  arm hung  limp and seemed to be  bleeding;  the  other   hugged  a  large black bundle.  In the red  glare  Sam, cowering behind  the  stair-door, caught a glimpse of his evil face as it passed: it was scored as  if  by  rending  claws and  smeared  with blood;  slaver  dripped  from  its  protruding fangs; the mouth snarled like an animal.       As far as Sam could see, Shagrat  hunted  Snaga round  the roof,  until  ducking and eluding  him the  smaller  orc with a yelp darted back  into the  turret  and  disappeared."
}