{
  "id": "0ce6a0ea6528d3cd6c100c86b896430bf27cd2b1",
  "text": " That was the wildling’s way, hard and perilous, but at least no one wouid follow him. He wouldn’t stray within a hundred leagues of Winterfell or the kingsroad.  Samwell Tarly awaited them in the old stables, slumped on the ground against a bale of hay, too anxious to sleep. He rose and brushed himself off.  I… I’m glad they found you, Jon.    I’m not,  Jon said, dismounting.  Pyp hopped off his horse and looked at the lightening sky with disgust.  Give us a hand bedding down the horses, Sam,  the small boy said.  We have a long day before us, and no sleep to face it on, thanks to Lord Snow.   When day broke, Jon walked to the kitchens as he did every dawn. Three-Finger Hobb said nothing as he gave him the Old Bear’s breakfast. Today it was three brown eggs boiled hard, with fried bread and ham steak and a bowl of wrinkled plums. Jon carried the food back to the King’s Tower. He found Mormont at the window seat, writing. His raven was walking back and forth across his shoulders, muttering,  Corn, corn, corn.  The bird shrieked when Jon entered.  Put the food on the table,  the Old Bear said, glancing up.  I’ll have some beer.   Jon opened a shuttered window, took the flagon of beer off the outside ledge, and filled a horn. Hobb had given him a lemon, still cold from the Wall. Jon crushed it in his fist. The juice trickled through his fingers. Mormont drank lemon in his beer every day, and claimed that was why he still had his own teeth.   Doubtless you loved your father,  Mormont said when Jon brought him his horn.  The things we love destroy us every time, lad. Remember when I told you that?    I remember,  Jon said sullenly. He did not care to talk of his father’s death, not even to Mormont.   See that you never forget it. The hard truths are the ones to hold tight. Fetch me my plate. Is it ham again? So be it. You look weary. Was your moonlight ride so tiring?   Jon’s throat was dry.  You know?    Know,  the raven echoed from Mormont’s shoulder.  Know.   The Old Bear snorted.  Do you think they chose me Lord Commander of the Night’s Watch because I’m dumb as a stump, Snow? Aemon told me you’d go. I told him you’d be back. I know my men… and my boys too. Honor set you on the kingsroad… and honor brought you back.    My friends brought me back,  Jon said.   Did I say it was your honor?  Mormont inspected his plate.   They killed my father. Did you expect me to do nothing?    If truth be told, we expected you to do just as you did.  Mormont tried a plum, spit out the pit.  I ordered a watch kept over you., You were seen leaving. If your brothers had not fetched you back, you would have been taken along the way, and not by friends. Unless you have a horse with wings like a raven. Do you?    No.  Jon felt like a fool.   Pity, we could use a horse like that.   Jon stood tall. He told himself that he would die well; that much he could do, at the least.  I know the penalty for desertion, my lord. I’m not afraid to die.    Die!  the raven cried.   Nor live, I hope,  Mormont said, cutting his ham with a dagger and feeding a bite to the bird.  You have not deserted—yet. Here you stand. If we beheaded every boy who rode to Mole’s Town in the night, only ghosts would guard the Wall. Yet maybe you mean to flee again on the morrow, or a fortnight from now. Is that it? Is that your hope, boy?   Jon kept silent.   I thought so.  Mormont peeled the shell off a boiled egg.  Your father is dead, lad. Do you think you can bring him back?    No,  he answered, sullen.   Good,  Mormont said.  We’ve seen the dead come back, you and me, and it’s not something I care to see again.  He ate the egg in two bites and flicked a bit of shell out from between his teeth.  Your brother is in the field with all the power of the north behind him. Any one of his lords bannermen commands more swords than you’ll find in all the Night’s Watch. Why do you imagine that they need your help? Are you such a mighty warrior, or do you carry a grumkin in your pocket to magic up your sword?   Jon had no answer for him. The raven was pecking at an egg, breaking the shell. Pushing his beak through the hole, he pulled out morsels of white and yoke.  The Old Bear sighed.  You are not the only one touched by this war. Like as not, my sister is marching in your brother’s host, her and those daughters of hers, dressed in men’s mail. Maege is a hoary old snark, stubborn, short-tempered, and willful. Truth be told, I can hardly stand to be around the wretched woman, but that does not mean my love for her is any less than the love you bear your half sisters.  Frowning, Mormont took his last egg and squeezed it in his fist until the shell crunched.  Or perhaps it does. Be that as it may, I’d still grieve if she were slain, yet you don’t see me running off. I said the words, just as you did. My place is here… where is yours, boy?   I have no place, Jon wanted to say, I’m a bastard, I have no rights, no name, no mother, and now not even a father. The words would not come."
}