{
  "id": "0cf01e9938b3e01744d8ffd82e619a713a6c41ed",
  "text": " He fancied there was a glimmer on the ground  down there, or perhaps it  was some trick of his tears, as he peered out at that high stony place where  all his life had fallen in ruin.       'If only I could have my wish, my one wish,' he sighed, `to go back and  find him! '  Then  at last he turned to  the  road in front and took  a  few  steps: the heaviest and the most reluctant he had ever taken.       Only a few steps; and now only a  few more and  he would be going  down  and would never see that high place again. And then suddenly  he heard cries  and voices. He stood still as  stone.  Orc-voices. They were behind him  and  before him.  A noise of tramping feet and harsh shouts:  Orcs were coming up  to  the  Cleft from the  far side, from  some entry to  the tower,  perhaps.   Tramping feet and shouts behind. He  wheeled round. He saw small red lights,  torches, winking away below there as they  issued  from the tunnel. At  last   the hunt was up. The red eye of the tower had not been blind. He was caught.       Now the flicker of approaching torches and the clink of steel ahead was  very near. In a  minute they would reach the top and be on  him. He had taken  too long in making up his mind, and now it was no good. How could he escape,  or save himself, or save the Ring? The Ring. He was not aware of any thought  or  decision. He simply found himself drawing  out the  chain and taking the  Ring in his hand.  The head of  the  orc-company appeared in the Cleft right   before him. Then he put it on.       The world changed, and a single moment of time was filled with an  hour   of thought. At once he was aware that  hearing was sharpened while sight was  dimmed, but otherwise than in  Shelob's  lair. All things about him now were   ####-not dark but vague; while he himself was there in  a grey hazy world, alone,   like a small black solid rock and the Ring, weighing down his left hand, was  like an orb of hot gold. He did not feel invisible at  all, but horribly and  uniquely visible; and he knew that somewhere an Eye was searching for him.       He heard the  crack of stone, and the murmur of water far off in Morgul  Vale;  and down away under the rock the bubbling misery  of Shelob, groping,  lost in some blind passage; and voices in the dungeons of the tower; and the  cries of the Orcs  as they came out of the tunnel; and deafening, roaring in  his ears, the crash of the feet  a nd the  rending clamour of the Orcs before  him.  He  shrank  against the cliff. But  they marched  up  like  a  phantom  company,  grey distorted  figures in a mist, only  dreams of  fear with pale  flames in their hands. And they passed him  by. He  cowered , trying to creep   away into some cranny and to hide.       He listened.  The Orcs from the tunnel and the others marching down had  sighted one another,  and  both parties were now hurrying  and  shouting. He  heard them both clearly, and he understood what they  said. Perhaps the Ring  gave understanding of tongues,  or simply  understanding, especially  of the   servants  of  Sauron  its maker, so that if he gave heed,  he understood and  translated  the thought  to himself. Certainly the Ring had grown greatly in  power  as it approached the places of its forging; but one  thing it did not  confer, and that  was courage. At present Sam  still thought only of hiding,  of lying low till all  was quiet again; and he listened anxiously. He  could  not tell how near the voices were, the words seemed almost in his ears.        'Hola! Gorbag! What are you doing up here? Had enough of war already? '       'Orders, you lubber. And what are  you doing, Shagrat? Tired of lurking  up there? Thinking of coming down to fight? '       'Orders to  you.  I'm in command  of this pass.  So speak civil. What's  your report?  '       'Nothing.'       `Hai!  hai! yoi!'  A yell  broke into the exchanges of the leaders. The  Orcs lower down  had  suddenly seen something. They began to run. So did the  others.       `Hai! Hola! Here's something! Lying right in  the road. A spy, a spy! '  There was a hoot of snarling horns and a babel of baying voices.        With a dreadful stroke Sam was wakened from his cowering mood. They  had  seen  his master. What would they do? He had heard tales of the Orcs to make   ####-the blood run cold. It could not be borne. He  sprang up. He flung the Quest   and all his decisions away, and fear and doubt with them.  He knew now where  his place was  and had been: at  his master's side, though what he  could do  there  was not clear. Back  he  ran down the  steps, down the  path  towards  Frodo.       `How many are there?'  he  thought. `Thirty or forty  from the tower at  least, and  a  lot more than  that  from down below, I guess. How many can I  kill before they get  me? They'll see the flame of  the  sword, as soon as I  draw it, and they'll get me  sooner or later. I wonder if any song will ever   mention it: How Samwise  fell  in  the High Pass and made  a wall of  bodies  round his master."
}