{
  "id": "0cfad1d8ee6d1343cabc614998bf152b0daee711",
  "text": " They were in a corridor. The forbidden corridor on the third floor. And now they knew why it was forbidden.  They were looking straight into the eyes of a monstrous dog, a dog that filled the whole space between ceiling and floor. It had three heads. Three pairs of rolling, mad eyes; three noses, twitching  and quivering in their direction; three drooling mouths, saliva hanging in slippery ropes from yellowish fangs.  It was standing quite still, all six eyes staring at them, and Harry knew that the only reason they weren't already dead was that their sudden appearance had taken it by surprise, but it was quickly getting over that, there was no mistaking what those thunderous growls meant.  Harry groped for the doorknob -- between Filch and death, he'd take Filch.  They fell backward -- Harry slammed the door shut, and they ran, they almost flew, back down the corridor. Filch must have hurried off to look for them somewhere else, because they didn't see him anywhere, but they hardly cared -- all they wanted to do was put as much space as possible between them and that monster. They didn't stop running until they reached the portrait of the Fat Lady on the seventh floor.  \"Where on earth have you all been?\" she asked, looking at their bathrobes hanging off their shoulders and their flushed, sweaty faces.  \"Never mind that -- pig snout, pig snout,\" panted Harry, and the portrait swung forward. They scrambled into the common room and collapsed, trembling, into armchairs.  It was a while before any of them said anything. Neville, indeed, looked as if he'd never speak again.  \"What do they think they're doing, keeping a thing like that locked up in a school?\" said Ron finally. \"If any dog needs exercise, that one does.\"  Hermione had got both her breath and her bad temper back again. \"You don't use your eyes, any of you, do you?\" she snapped. \"Didn't you see what it was standing on.  \"The floor?\" Harry suggested. \"I wasn't looking at its feet, I was too busy with its heads.\"  \"No, not the floor. It was standing on a trapdoor. It's obviously guarding something.\"  She stood up, glaring at them.  I hope you're pleased with yourselves. We could all have been killed -- or worse, expelled. Now, if you don't mind, I'm going to bed.\"  Ron stared after her, his mouth open.  \"No, we don't mind,\" he said. \"You'd think we dragged her along, wouldn't you.  But Hermione had given Harry something else to think about as he climbed back into bed. The dog was guarding something.... What had Hagrid said? Gringotts was the safest place in the world for something you wanted to hide -- except perhaps Hogwarts.  It looked as though Harry had found out where the grubby littie package from vault seven hundred and thirteen was.   CHAPTER TEN  HALLOWEEN  Malfoy couldn't believe his eyes when he saw that Harry and Ron were still at Hogwarts the next day, looking tired but perfectly cheerful. Indeed, by the next morning Harry and Ron thought that meeting the three-headed dog had been an excellent adventure, and they were quite keen to have another one. In the meantime, Harry filled Ron in about the package that seemed to have been moved from Gringotts to Hogwarts, and they spent a lot of time wondering what could possibly need such heavy protection. \"It's either really valuable or really dangerous,\" said Ron. \"Or both,\" said Harry.   But as all they knew for sure about the mysterious object was that it was about two inches long, they didn't have much chance of guessing what it was without further clues.  Neither Neville nor Hermione showed the slightest interest in what lay underneath the dog and the trapdoor. All Neville cared about was never going near the dog again.  Hermione was now refusing to speak to Harry and Ron, but she was such a bossy know-it-all that they saw this as an added bonus. All they really wanted now was a way of getting back at Malfoy, and to their great delight, just such a thing arrived in the mail about a week later.  As the owls flooded into the Great Hall as usual, everyone's attention was caught at once by a long, thin package carried by six large screech owls. Harry was just as interested as everyone else to see what was in this large parcel, and was amazed when the owls soared down and dropped it right in front of him, knocking his bacon to the floor. They had hardly fluttered out of the way when another owl dropped a letter on top of the parcel.  Harry ripped open the letter first, which was lucky, because it said:   DO NOT OPEN THE PARCEL AT THE TABLE.  It contains your new Nimbus Two Thousand, but I don't want everybody knowing you've got a broomstick or they'll all want one. Oliver Wood will meet you tonight on the Quidditch field at seven o'clock for your first training session.  Professor McGonagall  Harry had difficulty hiding his glee as he handed the note to Ron to read.  \"A Nimbus Two Thousand!\" Ron moaned enviously. \"I've never even touched one.\"  They left the hall quickly, wanting to unwrap the broomstick in private before their first class, but halfway across the entrance hall they found the way upstairs barred by Crabbe and Goyle."
}