{
  "id": "0d247c76b8fdb8d0a23051b44abe2b67be1b0f20",
  "text": "  Then, with a second whoosh, George had cried \"the Burrow!\" and vanished too. \"Ron, you next,\" said Mr. Weasley. \"See you,\" said Ron brightly to the Dursleys.  He grinned broadly at Harry, then stepped into the fire, shouted \"the Burrow!\" and disappeared. Now Harry and Mr. Weasley alone remained. \"Well . . . 'bye then,\" Harry said to the Dursleys. They didn't say anything at all.  Harry moved toward the fire, but just as he reached the edge of the hearth, Mr. Weasley put out a hand and held him back.  He was looking at the Dursleys in amazement. \"Harry said good-bye to you,\" he said. \"Didn't you hear him?\" \"It doesn't matter,\" Harry muttered to Mr. Weasley.  \"Honestly, I don't care.\" Mr. Weasley did not remove his hand from Harry's shoulder. \"You aren't going to see your nephew till next summer,\" he said to Uncle Vernon in mild indignation.  \"Surely you're going to say good-bye?\" Uncle Vernon's face worked furiously.  The idea of being taught consideration by a man who had just blasted away half his living room wall seemed to be causing him intense suffering. But Mr. Weasley's wand was still in his hand, and Uncle Vernon's tiny eyes darted to it once, before he said, very resentfully, \"Good-bye, then.\" \"See you,\" said Harry, putting one foot forward into the green flames, which felt pleasantly like warm breath.  At that moment, however, a horrible gagging sound erupted behind him, and Aunt Petunia started to scream. Harry wheeled around. Dudley was no longer standing behind his parents. He was kneeling beside the coffee table, and he was gagging and sputtering on a foot-long, purple, slimy thing that was protruding from his mouth.  One bewildered second later, Harry realized that the foot-long thing was Dudley's tongue - and that a brightly colored toffee wrapper lay on the floor before him. Aunt Petunia hurled herself onto the ground beside Dudley, seized the end of his swollen tongue, and attempted to wrench it out of his mouth; unsurprisingly, Dudley yelled and sputtered worse than ever, trying to fight her off. Uncle Vernon was bellowing and waving his arms around, and Mr. Weasley had to shout to make himself heard. \"Not to worry, I can sort him out!\"  he yelled, advancing on Dudley with his wand outstretched, but Aunt Petunia screamed worse than ever and threw herself on top of Dudley, shielding him from Mr. Weasley. \"No, really!\" said Mr. Weasley desperately.  \"It's a simple process it was the toffee - my son Fred - real practical joker - but it's only an Engorgement Charm - at least, I think it is - please, I can correct it -\" But far from being reassured, the Dursleys became more panic- stricken; Aunt Petunia was sobbing hysterically, tugging Dudley's tongue as though determined to rip it out; Dudley appeared to be suffocating under the combined pressure of his mother and his tongue; and Uncle Vernon, who had lost control completely, seized a china figure from on top of the sideboard and threw it very hard at Mr. Weasley, who ducked, causing the ornament to shatter in the blasted fireplace. \"Now really!\" said Mr. Weasley angrily, brandishing his wand.  \"I'm trying to help!\" Bellowing like a wounded hippo, Uncle Vernon snatched up another ornament. \"Harry, go! Just go!\"  Mr. Weasley shouted, his wand on Uncle Vernon.  \"I'll sort this out!\" Harry didn't want to miss the fun, but Uncle Vernon's second ornament narrowly missed his left ear, and on balance he thought it best to leave the situation to Mr. Weasley.  He stepped into the fire, looking over his shoulder as he said \"the Burrow!\"  His last fleeting glimpse of the living room was of Mr. Weasley blasting a third ornament out of Uncle Vernon's hand with his wand, Aunt Petunia screaming and lying on top of Dudley, and Dudley's tongue lolling around like a great slimy python.  But next moment Harry had begun to spin very fast, and the Dursleys' living room was whipped out of sight in a rush of emerald-green flames.  CHAPTER FIVE - WEASLEYS' WIZARD WHEEZES  Harry spun faster and faster, elbows tucked tightly to his sides, blurred fireplaces flashing past him, until he started to feel sick and closed his eyes.  Then, when at last he felt himself slowing down, he threw out his hands and came to a halt in time to prevent himself from falling face forward out of the Weasleys' kitchen fire. \"Did he eat it?\" said Fred excitedly, holding out a hand to pull Harry to his fee \"Yeah,\" said Harry, straightening up.  \"What was it?\" \"Ton-Tongue Toffee,\" said Fred brightly.  \"George and I invented them, and we've been looking for someone to test them on all summer. . . .\" The tiny kitchen exploded with laughter; Harry looked around and saw that Ron and George were sitting at the scrubbed wooden table with two red-haired people Harry had never seen before, though he knew immediately who they must be: Bill and Charlie, the two eldest Weasley brothers. \"How're you doing, Harry?\" said the nearer of the two, grinning at him and holding out a large hand, which Harry shook, feeling calluses and blisters under his fingers."
}