{
  "id": "0d2c3906fdfdfd750eba35a56992f535257acbf1",
  "text": " No one wants war again, least of all me.  Her hand touched his face, his hair.  If friends can turn to enemies, enemies can become friends. Your wife is a thousand leagues away, and my brother has fled. Be kind to me, Ned. I swear to you, you shall never regret it.    Did you make the same offer to Jon Arryn?   She slapped him.   I shall wear that as a badge of honor,  Ned said dryly.   Honor,  she spat.  How dare you play the noble lord with me! What do you take me for? You’ve a bastard of your own, I’ve seen him. Who was the mother, I wonder? Some Dornish peasant you raped while her holdfast burned? A whore? Or was it the grieving sister, the Lady Ashara? She threw herself into the sea, I’m told. Why was that? For the brother you slew, or the child you stole? Tell me, my honorable Lord Eddard, how are you any different from Robert, or me, or Jaime?    For a start,  said Ned,  I do not kill children. You would do well to listen, my lady. I shall say this only once. When the king returns from his hunt, I intend to lay the truth before him. You must be gone by then. You and your children, all three, and not to Casterly Rock. If I were you, I should take ship for the Free Cities, or even farther, to the Summer Isles or the Port of Ibben. As far as the winds blow.    Exile,  she said.  A bitter cup to drink from.    A sweeter cup than your father served Rhaegar’s children,  Ned said,  and kinder than you deserve. Your father and your brothers would do well to go with you. Lord Tywin’s gold will buy you comfort and hire swords to keep you safe. You shall need them. I promise you, no matter where you flee, Robert’s wrath will follow you, to the back of beyond if need be.   The queen stood.  And what of my wrath, Lord Stark?  she asked softly. Her eyes searched his face.  You should have taken the realm for yourself. It was there for the taking. Jaime told me how you found him on the Iron Throne the day King’s Landing fell, and made him yield it up. That was your moment. All you needed to do was climb those steps, and sit. Such a sad mistake.    I have made more mistakes than you can possibly imagine,  Ned said,  but that was not one of them.    Oh, but it was, my lord,  Cersei insisted.  When you play the game of thrones, you win or you die. There is no middle ground.   She turned up her hood to hide her swollen face and left him there in the dark beneath the oak, amidst the quiet of the godswood, under a blue-black sky. The stars were coming out.      DAENERYS  The heart was steaming in the cool evening air when Khal Drogo set it before her, raw and bloody. His arms were red to the elbow. Behind him, his bloodriders knelt on the sand beside the corpse of the wild stallion, stone knives in their hands. The stallion’s blood looked black in the flickering orange glare of the torches that ringed the high chalk walls of the pit.  Dany touched the soft swell of her belly. Sweat beaded her skin and trickled down her brow. She could feel the old women watching her, the ancient crones of Vaes Dothrak, with eyes that shone dark as polished flint in their wrinkled faces. She must not flinch or look afraid. I am the blood of the dragon, she told herself as she took the stallion’s heart in both hands, lifted it to her mouth, and plunged her teeth into the tough, stringy flesh.  Warm blood filled her mouth and ran down over her chin. The taste threatened to gag her, but she made herself chew and swallow. The heart of a stallion would make her son strong and swift and fearless, or so the Dothraki believed, but only if the mother could eat it all. If she choked on the blood or retched up the flesh, the omens were less favorable; the child might be stillborn, or come forth weak, deformed, or female.  Her handmaids had helped her ready herself for the ceremony. Despite the tender mother’s stomach that had afflicted her these past two moons, Dany had dined on bowls of half-clotted blood to accustom herself to the taste, and Irri made her chew strips of dried horseflesh until her jaws were aching. She had starved herself for a day and a night before the ceremony in the hopes that hunger would help her keep down the raw meat.  The wild stallion’s heart was all muscle, and Dany had to worry it with her teeth and chew each mouthful a long time. No steel was permitted within the sacred confines of Vaes Dothrak, beneath the shadow of the Mother of Mountains; she had to rip the heart apart with teeth and nails. Her stomach roiled and heaved, yet she kept on, her face smeared with the heartsblood that sometimes seemed to explode against her lips.  Khal Drogo stood over her as she ate, his face as hard as a bronze shield. His long black braid was shiny with oil. He wore gold rings in his mustache, gold bells in his braid, and a heavy belt of solid gold medallions around his waist, but his chest was bare. She looked at him whenever she felt her strength failing; looked at him, and chewed and swallowed, chewed and swallowed, chewed and swallowed."
}