{
  "id": "0e15a92159f4a7148e11eaa3e1f328a55fd29325",
  "text": " It was indeed a mallorn, and  it was the wonder of the neighbourhood.  In after years, as it grew in grace  and beauty, it was known far and wide and people would come long journeys  to  see it: the only mallorn  west of the Mountains and east of the Sea, and one  of the finest in the world.       Altogether 1420 in  the Shire was a marvellous year. Not only was there  wonderful sunshine and delicious rain, in due times and perfect measure, but  there seemed something more: an air of richness and growth, and a gleam of a   beauty  beyond  that  of  mortal summers  that flicker  and  pass  upon this  Middle-earth. All the children born or begotten in that year, and there were   ####-many, were fair to see and strong, and most of them  had a rich golden  hair  that had before  been rare  among hobbits.  The fruit was so  plentiful that  young  hobbits very nearly bathed in  strawberries and cream; and later they  sat on the lawns under the plum-trees  and ate, until they had made piles of  stones  like  small pyramids or  the  heaped skulls of a conqueror, and then  they  moved on. And no  one was ill,  and everyone was pleased. except those  who had to mow the grass.        In the  Southfarthing the vines were laden, and the yield of 'leaf' was  astonishing; and everywhere there was  so much  corn that at  Harvest  every  barn was stuffed. 'The  Northfarthing barley  was so fine  that the beer  of  1420 malt was long remembered and became a byword. Indeed a generation  later  one might hear an  old gaffer  in an inn, aft er  a good pint  of well-earned  ale,  put  down his mug with a sigh:  'Ah! that was  proper fourteen-twenty,  that was!'       Sam stayed at first at  the Cottons'  with Frodo; but when  the New Row  was ready he went  with the Gaffer. In addition to all his  other  labours he  was  busy  directing  the cleaning up and restoring  of Bag End; but he  was  often away in the Shire on his forestry work. So he was not at home in early  March and did not know that  Frodo had  been ill. On the  thirteenth of that  month  Farmer Cotton found Frodo lying on his bed; he was clutching  a white  gem that hung on a chain about his neck and he seemed half in a dream.       'It is gone for ever,' he said, 'and now all is dark and empty.'       But the fit  passed, and  when Sam got back on  the twenty-fifth, Frodo  had  recovered, and he said nothing about  himself. In the meanwhile Bag End  had  been  set  in order,  and Merry and Pippin came over  from  Crickhollow  bringing back  all the old furniture  and gear, so that  the  old hole  soon  looked very much as it always had done.       When all was at last ready Frodo said: 'When are you  going to  move in  and join me, Sam?'       Sam looked a bit awkward.       'There is no need to come yet, if you don't want to,'  said Frodo. 'But  you k now the Gaffer  is close at hand, and he will be very well looked after   by Widow Rumble.'       It s not that, Mr. Frodo, said Sam, and he went ver red.       'Well, what is it?'       'It's Rosie, Rose Cotton,' said Sam. 'It seems she didn't like my going   ####-abroad at all, poor lass; but as I hadn't spoken, she couldn't say so. And I  didn't speak, because I had  a job to  do first. But now I have  spoken, and  she says:  \"Well, you've  wasted  a year,  so why wait longer?\"  \"Wasted?\" I   says. \"I wouldn't call it that.\" Still I see what she means. I feel torn  in  two, as you might say.'       'I see,' said Frodo: 'you want to get married, and yet you want to live  with me in  Bag End too? But my dear  Sam, how easy! Get  married as soon as  you  can, and then move in with Rosie. There's room enough in Bag End for as  big a family as you could wish for.'       And so it was settled. Sam Gamgee married Rose Cotton in the Spring  of  1420 (which was  also famous  for its weddings), and they came and lived  at  Bag End. And if Sam thought himself lucky, Frodo knew that he was more  lucky  himself; for there was not a hobbit in the  Shire that was looked after with  such care. When the labours of repair  had all been planned and set going he  took to a quiet life, writing a great dea l and  going through all his notes.  He resigned the office of Deputy Mayor at the Free Fair that mid-summer, and  dear old Will Whitfoot had another seven years of presiding at Banquets.        Merry and Pippin lived together for some time at Crickhollow, and  there  was  much coming  and  going between  Buckland and Bag  End.  The two   young  Travellers cut a great  dash in the Shire  with  their songs and their tales  and their finery,  and  their wonderful  parties. 'Lordly' folk called them,  meaning nothing bu t good; for it warmed all hearts to see them go  riding by  with their mail-shirts so bright and their shields so splendid, laughing and  singing songs of far away; and if they were now large and magnificent,  they   were unchanged otherwise, unless they were  indeed  more fairspoken and  more  jovial and full of merriment than ever before."
}