{
  "id": "0e1ee63f25b430e8633a6f4f03444a83a0d66ee8",
  "text": " The twins are Serra and Sarra.  He squinted down at one of the younger girls.  Heh, are you another Walda?   The girl could not have been more than four.  I’m Ser Aemon Rivers’s Walda, lord great grandfather.  She curtsied.   How long have you been talking? Not that you’re like to have anything sensible to say, your father never did. He’s a bastard’s son besides, heh. Go away, I wanted only Freys up here. The King in the North has no interest in base stock.  Lord Walder glanced to Robb, as Jinglebell bobbed his head and chimed.  There they are, all maidens. Well, and one widow, but there’s some who like a woman broken in. You might have had any one of them.    It would have been an impossible choice, my lord,  said Robb with careful courtesy.  They’re all too lovely.   Lord Walder snorted.  And they say my eyes are bad. Some will do well enough, I suppose. Others… well, it makes no matter. They weren’t good enough for the King in the North, heh. Now what is it you have to say?    My ladies.  Robb looked desperately uncomfortable, but he had known this moment must come, and he faced it without flinching.  All men should keep their word, kings most of all. I was pledged to marry one of you and I broke that vow. The fault is not in you. What I did was not done to slight you, but because I loved another. No words can set it right, I know, yet I come before you to ask forgiveness, that the Freys of the Crossing and the Starks of Winterfell may once again be friends.   The smaller girls fidgeted anxiously. Their older sisters waited for Lord Walder on his black oak throne. Jinglebell rocked back and forth, bells chiming on collar and crown.   Good,  the Lord of the Crossing said.  That was very good, Your Grace. ‘No words can set it right’ heh. Well said, well said. At the wedding feast I hope you will not refuse to dance with my daughters. It would please an old man’s heart, heh.  He bobbed his wrinkled pink head up and down, in much the same way his lackwit grandson did, though Lord Walder wore no bells.  And here she is, Lord Edmure. My daughter Roslin, my most precious little blossom, heh.   Ser Benfrey led her into the hall. They looked enough alike to be full siblings. Judging from their age, both were children of the sixth Lady Frey; a Rosby, Catelyn seemed to recall.  Roslin was small for her years, her skin as white as if she had just risen from a milk bath. Her face was comely, with a small chin, delicate nose, and big brown eyes. Thick chestnut hair fell in loose waves to a waist so tiny that Edmure would be able to put his hands around it. Beneath the lacy bodice of her pale blue gown, her breasts looked small but shapely.   Your Grace.  The girl went to her knees.  Lord Edmure, I hope I am not a disappointment to you.   Far from it, thought Catelyn. Her brother’s face had lit up at the sight of her.  You are a delight to me, my lady,  Edmure said.  And ever will be, I know.   Roslin had a small gap between two of her front teeth that made her shy with her smiles, but the flaw was almost endearing. Pretty enough, Catelyn thought, but so small, and she comes of Rosby stock. The Rosbys had never been robust. She much preferred the frames of some of the older girls in the hall; daughters or granddaughters, she could not be sure. They had a Crakehall look about them, and Lord Walder’s third wife had been of that House. Wide hips to bear children, big breasts to nurse them, strong arms to carry them. The Crakehalls have always been a big-boned family, and strong.   My lord is kind,  the Lady Roslin said to Edmure.   My lady is beautiful.  Edmure took her hand and drew her to her feet.  But why are you crying?    For joy,  Roslin said.  I weep for joy, my lord.    Enough,  Lord Walder broke in.  You may weep and whisper after you’re wed, heh. Benfrey, see your sister back to her chambers, she has a wedding to prepare for. And a bedding, heh, the sweetest part. For all, for all.  His mouth moved in and out.  We’ll have music, such sweet music, and wine, heh, the red will run, and we’ll put some wrongs aright. But now you’re weary, and wet as well, dripping on my floor. There’s fires waiting for you, and hot mulled wine, and baths if you want ’em. Lothar, show our guests to their quarters.    I need to see my men across the river, my lord,  Robb said.   They shan’t get lost,  Lord Walder complained.  They’ve crossed before, haven’t they? When you came down from the north. You wanted crossing and I gave it to you, and you never said mayhaps, heh. But suit yourself. Lead each man across by the hand if you like, it’s naught to me.    My lord!  Catelyn had almost forgotten.  Some food would be most welcome. We have ridden many leagues in the rain.   Walder Frey’s mouth moved in and out.  Food, heh. A loaf of bread, a bite of cheese, mayhaps a sausage.    Some wine to wash it down,  Robb said.  And salt.    Bread and salt. Heh. Of course, of course.  The old man clapped his hands together, and servants came into the hall, bearing flagons of wine and trays of bread, cheese, and butter."
}