{
  "id": "0e8ba14adc4f78ce07d952b4f83e3a4e804c885a",
  "text": "  To the other maidens he had given white roses, but the one he plucked for her was red.  Sweet lady,  he said,  no victory is half so beautiful as you.  Sansa took the flower timidly, struck dumb by his gallantry. His hair was a mass of lazy brown curls, his eyes like liquid gold. She inhaled the sweet fragrance of the rose and sat clutching it long after Ser Loras had ridden off.  When Sansa finally looked up, a man was standing over her, staring. He was short, with a pointed beard and a silver streak in his hair, almost as old as her father.  You must be one of her daughters,  he said to her. He had grey-green eyes that did not smile when his mouth did.  You have the Tully look.    I’m Sansa Stark,  she said, ill at ease. The man wore a heavy cloak with a fur collar, fastened with a silver mockingbird, and he had the effortless manner of a high lord, but she did not know him.  I have not had the honor, my lord.   Septa Mordane quickly took a hand.  Sweet child, this is Lord Petyr Baelish, of the king’s small council.    Your mother was my queen of beauty once,  the man said quietly. His breath smelled of mint.  You have her hair.  His fingers brushed against her cheek as he stroked one auburn lock. Quite abruptly he turned and walked away.  By then, the moon was well up and the crowd was tired, so the king decreed that the last three matches would be fought the next morning, before the melee. While the commons began their walk home, talking of the day’s jousts and the matches to come on the morrow, the court moved to the riverside to begin the feast. Six monstrous huge aurochs had been roasting for hours, turning slowly on wooden spits while kitchen boys basted them with butter and herbs until the meat crackled and spit. Tables and benches had been raised outside the pavilions, piled high with sweetgrass and strawberries and fresh-baked bread.  Sansa and Septa Mordane were given places of high honor, to the left of the raised dais where the king himself sat beside his queen. When Prince Joffrey seated himself to her right, she felt her throat tighten. He had not spoken a word to her since the awful thing had happened, and she had not dared to speak to him. At first she thought she hated him for what they’d done to Lady, but after Sansa had wept her eyes dry, she told herself that it had not been Joffrey’s doing, not truly. The queen had done it; she was the one to hate, her and Arya. Nothing bad would have happened except for Arya.  She could not hate Joffrey tonight. He was too beautiful to hate. He wore a deep blue doublet studded with a double row of golden lion’s heads, and around his brow a slim coronet made of gold and sapphires. His hair was as bright as the metal. Sansa looked at him and trembled, afraid that he might ignore her or, worse, turn hateful again and send her weeping from the table.  Instead Joffrey smiled and kissed her hand, handsome and gallant as any prince in the songs, and said,  Ser Loras has a keen eye for beauty, sweet lady.    He was too kind,  she demurred, trying to remain modest and calm, though her heart was singing.  Ser Loras is a true knight. Do you think he will win tomorrow, my lord?    No,  Joffrey said.  My dog will do for him, or perhaps my uncle Jaime. And in a few years, when I am old enough to enter the lists, I shall do for them all.  He raised his hand to summon a servant with a flagon of iced summerwine, and poured her a cup. She looked anxiously at Septa Mordane, until Joffrey leaned over and filled the septa’s cup as well, so she nodded and thanked him graciously and said not another word.  The servants kept the cups filled all night, yet afterward Sansa could not recall ever tasting the wine. She needed no wine. She was drunk on the magic of the night, giddy with glamour, swept away by beauties she had dreamt of all her life and never dared hope to know. Singers sat before the king’s pavilion, filling the dusk with music. A juggler kept a cascade of burning clubs spinning through the air. The king’s own fool, the pie-faced simpleton called Moon Boy, danced about on stilts, all in motley, making mock of everyone with such deft cruelty that Sansa wondered if he was simple after all. Even Septa Mordane was helpless before him; when he sang his little song about the High Septon, she laughed so hard she spilled wine on herself.  And Joffrey was the soul of courtesy. He talked to Sansa all night, showering her with compliments, making her laugh, sharing little bits of court gossip, explaining Moon Boy’s japes. Sansa was so captivated that she quite forgot all her courtesies and ignored Septa Mordane, seated to her left.  All the while the courses came and went. A thick soup of barley and venison. Salads of sweetgrass and spinach and plums, sprinkled with crushed nuts. Snails in honey and garlic. Sansa had never eaten snails before; Joffrey showed her how to get the snail out of the shell, and fed her the first sweet morsel himself. Then came trout fresh from the river, baked in clay; her prince helped her crack open the hard casing to expose the flaky white flesh within."
}