{
  "id": "0f02fd82585c276bef3948e7ad1c9a0e2db77524",
  "text": "  \"Shouldn'ta lost me temper,\" he said ruefully, \"but it didn't work anyway. Meant ter turn him into a pig, but I suppose he was so much like a pig anyway there wasn't much left ter do.\"  He cast a sideways look at Harry under his bushy eyebrows.  \"Be grateful if yeh didn't mention that ter anyone at Hogwarts,\" he said. \"I'm -- er -- not supposed ter do magic, strictly speakin'. I was allowed ter do a bit ter follow yeh an' get yer letters to yeh an' stuff -- one o' the reasons I was so keen ter take on the job  \"Why aren't you supposed to do magic?\" asked Harry.  \"Oh, well -- I was at Hogwarts meself but I -- er -- got expelled, ter tell yeh the truth. In me third year. They snapped me wand in half an' everything. But Dumbledore let me stay on as gamekeeper. Great man, Dumbledore.\" \"Why were you expelled?\"  \"It's gettin' late and we've got lots ter do tomorrow,\" said Hagrid loudly. \"Gotta get up ter town, get all yer books an' that.\"  He took off his thick black coat and threw it to Harry.  \"You can kip under that,\" he said. \"Don' mind if it wriggles a bit, I think I still got a couple o' dormice in one o' the pockets.\"   CHAPTER FIVE  DIAGON ALLEY  Harry woke early the next morning. Although he could tell it was daylight, he kept his eyes shut tight.  \"It was a dream, he told himself firmly. \"I dreamed a giant called Hagrid came to tell me I was going to a school for wizards. When I open my eyes I'll be at home in my cupboard.\"  There was suddenly a loud tapping noise.  And there's Aunt Petunia knocking on the door, Harry thought, his heart sinking. But he still didn't open his eyes. It had been such a good dream.  Tap. Tap. Tap.  \"All right,\" Harry mumbled, \"I'm getting up.\"  He sat up and Hagrid's heavy coat fell off him. The hut was full of sunlight, the storm was over, Hagrid himself was asleep on the collapsed sofa, and there was an owl rapping its claw on the window, a newspaper held in its beak.  Harry scrambled to his feet, so happy he felt as though a large balloon was swelling inside him. He went straight to the window and jerked it open. The owl swooped in and dropped the newspaper on top of Hagrid, who didn't wake up. The owl then fluttered onto the floor and began to attack Hagrid's coat.  \"Don't do that.\"  Harry tried to wave the owl out of the way, but it snapped its beak fiercely at him and carried on savaging the coat.  \"Hagrid!\" said Harry loudly. \"There's an owl  \"Pay him,\" Hagrid grunted into the sofa.  \"What?\"  \"He wants payin' fer deliverin' the paper. Look in the pockets.\" Hagrid's coat seemed to be made of nothing but pockets -- bunches of keys, slug pellets, balls of string, peppermint humbugs, teabags... finally, Harry pulled out a handful of strange-looking coins.  \"Give him five Knuts,\" said Hagrid sleepily.  \"Knuts?\"  \"The little bronze ones.\"  Harry counted out five little bronze coins, and the owl held out his leg so Harry could put the money into a small leather pouch tied to it. Then he flew off through the open window.  Hagrid yawned loudly, sat up, and stretched.  \"Best be Off, Harry, lots ter do today, gotta get up ter London an' buy all yer stuff fer school.\"  Harry was turning over the wizard coins and looking at them. He had just thought of something that made him feel as though the happy balloon inside him had got a puncture.  \"Um -- Hagrid?\"  \"Mm?\" said Hagrid, who was pulling on his huge boots.  \"I haven't got any money -- and you heard Uncle Vernon last night ... he won't pay for me to go and learn magic.\"  \"Don't worry about that,\" said Hagrid, standing up and scratching his head. \"D'yeh think yer parents didn't leave yeh anything?\"  \"But if their house was destroyed --\"  \"They didn' keep their gold in the house, boy! Nah, first stop fer us is Gringotts. Wizards' bank. Have a sausage, they're not bad cold -- an' I wouldn' say no teh a bit o' yer birthday cake, neither.\"  \"Wizards have banks?\"  \"Just the one. Gringotts. Run by goblins.\"  Harry dropped the bit of sausage he was holding.  \"Goblins?\"  \"Yeah -- so yeh'd be mad ter try an' rob it, I'll tell yeh that. Never mess with goblins, Harry. Gringotts is the safest place in the world fer anything yeh want ter keep safe -- 'cept maybe Hogwarts. As a matter o' fact, I gotta visit Gringotts anyway. Fer Dumbledore. Hogwarts business.\" Hagrid drew himself up proudly. \"He usually gets me ter do important stuff fer him. Fetchin' you gettin' things from Gringotts -- knows he can trust me, see.  \"Got everythin'? Come on, then.\"  Harry followed Hagrid out onto the rock. The sky was quite clear now and the sea gleamed in the sunlight. The boat Uncle Vernon had hired was still there, with a lot of water in the bottom after the storm.  \"How did you get here?\" Harry asked, looking around for another boat. \"Flew,\" said Hagrid.  \"Flew?\"  \"Yeah -- but we'll go back in this. Not s'pposed ter use magic now I've got yeh.\"  They settled down in the boat, Harry still staring at Hagrid, trying to imagine him flying.  \"Seems a shame ter row, though,\" said Hagrid, giving Harry another of his sideways looks."
}