{
  "id": "0f7f15b9c3e88bc5b7954edf2717e7a905e575a2",
  "text": "  His own party had come up on them, so it was his turn to name the names.  Let me present Ser Flement Brax, heir to Hornvale. Lord Gyles of Rosby. Ser Addam Marbrand, Lord Commander of the City Watch. Jalabhar Xho, Prince of the Red Flower Vale. Ser Harys Swyft, my uncle Kevan’s good father by marriage. Ser Merlon Crakehall. Ser Philip Foote and Ser Bronn of the Blackwater, two heroes of our recent battle against the rebel Stannis Baratheon. And mine own squire, young Podrick of House Payne.  The names had a nice ringing sound as Tyrion reeled them off, but the bearers were nowise near as distinguished nor formidable a company as those who accompanied Prince Oberyn, as both of them knew full well.   My lord of Lannister,  said Lady Blackmont,  we have come a long dusty way, and rest and refreshment would be most welcome. Might we continue on to the city?    At once, my lady.  Tyrion turned his horse’s head, and called to Ser Addam Marbrand. The mounted gold cloaks who formed the greatest part of his honor guard turned their horses crisply at Ser Addam’s command, and the column set off for the river and King’s Landing beyond.  Oberyn Nymeros Martell, Tyrion muttered under his breath as he fell in beside the man. The Red Viper of Dorne. And what in the seven hells am I supposed to do with him?  He knew the man only by reputation, to be sure… but the reputation was fearsome. When he was no more than sixteen, Prince Oberyn had been found abed with the paramour of old Lord Yronwood, a huge man of fierce repute and short temper. A duel ensued, though in view of the prince’s youth and high birth, it was only to first blood. Both men took cuts, and honor was satisfied. Yet Prince Oberyn soon recovered, while Lord Yronwood’s wounds festered and killed him. Afterward men whispered that Oberyn had fought with a poisoned sword, and ever thereafter friends and foes alike called him the Red Viper.  That was many years ago, to be sure. The boy of sixteen was a man past forty now, and his legend had grown a deal darker. He had traveled in the Free Cities, leaming the poisoner’s trade and perhaps arts darker still, if rumors could be believed. He had studied at the Citadel, going so far as to forge six links of a maester’s chain before he grew bored. He had soldiered in the Disputed Lands across the narrow sea, riding with the Second Sons for a time before forming his own company. His tourneys, his battles, his duels, his horses, his carnality… it was said that he bedded men and women both, and had begotten bastard girls all over Dorne. The sand snakes, men called his daughters. So far as Tyrion had heard, Prince Oberyn had never fathered a son.  And of course, he had crippled the heir to Highgarden.  There is no man in the Seven Kingdoms who will be less welcome at a Tyrell wedding, thought Tyrion. To send Prince Oberyn to King’s Landing while the city still hosted Lord Mace Tyrell, two of his sons, and thousands of their men-at-arms was a provocation as dangerous as Prince Oberyn himself. A wrong word, an ill-timed jest, a look, that’s all it will take, and our noble allies will be at one another’s throats.   We have met before,  the Dornish prince said lightly to Tyrion as they rode side by side along the kingsroad, past ashen fields and the skeletons of trees.  I would not expect you to remember, though. You were even smaller than you are now.   There was a mocking edge to his voice that Tyrion misliked, but he was not about to let the Dornishman provoke him.  When was this, my lord?  he asked in tones of polite interest.   Oh, many and many a year ago, when my mother ruled in Dorne and your lord father was Hand to a different king.   Not so different as you might think, reflected Tyrion.   It was when I visited Casterly Rock with my mother, her consort, and my sister Elia. I was, oh, fourteen, fifteen, thereabouts, Elia a year older. Your brother and sister were eight or nine, as I recall, and you had just been born.   A queer time to come visiting. His mother had died giving him birth, so the Martells would have found the Rock deep in mouming. His father especially. Lord Tywin seldom spoke of his wife, but Tyrion had heard his uncles talk of the love between them. In those days, his father had been Aerys’s Hand, and many people said that Lord Tywin Lannister ruled the Seven Kingdoms, but Lady Joanna ruled Lord Tywin.  He was not the same man after she died, imp,  his Uncle Gery told him once.  The best part of him died with her.  Gerion had been the youngest of Lord Tytos Lannister’s four sons, and the uncle Tyrion liked best.  But he was gone now, lost beyond the seas, and Tyrion himself had put Lady Joanna in her grave.  Did you find Casterly Rock to your liking, my lord?    Scarcely. Your father ignored us the whole time we were there, after commanding Ser Kevan to see to our entertainment. The cell they gave me had a featherbed to sleep in and Myrish carpets on the floor, but it was dark and windowless, much like a dungeon when you come down to it, as I told Elia at the time."
}