{
  "id": "0fddaec833f09882756662cffe7a135eef0e56ed",
  "text": "  The  next  morning  early  a  company  of  spearmen  was  seen  crossing  the  river,  and  marching  up  the  valley.  They  bore  with  them  the  green  banner of the Elvenking and the blue banner of the Lake, and they advanced until  they stood right before the wall at the Gate.  Again Thorin hailed  them  in a  loud voice: \"Who are you  that come armed for  war to the gates of Thorin son of Thrain, King under the Mountain?\" This time he  was answered.  A  tall  man  stood  forward,  dark  of  hair  and  grim  of  face,  and  he  cried:  \"Hail  Thorin! Why do you fence yourself like a robber in his hold? We are not yet foes,  and  we  rejoice  that  you  are  alive  beyond  our  hope.  We  came  expecting  to  find  none  living  here;  yet  now  that  we  are  met  there  is  matter  for  a  parley  and  a  council.\"  \"Who are you, and of what would you parley?\"  \"I am Bard, and by my hand was the dragon slain and your treasure delivered.  Is that not a matter that concerns you? Moreover I am by right descent the heir of  Girion of Dale,  and  in your hoard  is mingled much of  the wealth of his halls  and  town,  which  of  old  Smaug  stole.  Is  not  that  a  matter  of  which  we  may  speak?  Further  in  his  last  battle  Smaug  destroyed  the  dwellings  of  the men  of  Esgaroth,  and  I  am  yet  the  servant  of  their Master.  I would  speak  for  him  and  ask whether  you  have  no  thought  for  the  sorrow  and misery  of  his  people.  They  aided  you  in  your  distress,  and  in  recompense  you  have  thus  far  brought  ruin  only,  though  doubtless undesigned.\"  Now  these were  fair words and  true,  if proudly and grimly  spoken; and Bilbo  thought  that Thorin would at once admit what  justice was  in  them. He did not, of  course,  expect  that  any one would remember that it was he who discovered all by  himself the dragon's weak spot; and that was just as well, for no one ever did. But  also he did not reckon with the power that gold has upon which a dragon has long   ####-brooded,  nor with  dwarvish  hearts. Long hours  in  the past days Thorin had  spent  in the treasury, and the lust of it was heavy on him. Though he had hunted chiefly  for  the Arkenstone, yet he had  an  eye  for many  another wonderful  thing  that was  lying there, about which were wound old memories of the labours and the sorrows  of his race.  \"You  put  your worst  cause  last  and  in  the  chief  place,\" Thorin  answered.  \"To  the treasure of my people no man has a claim, because Smaug who stole it from us  also  robbed  him  of  life  or  home.  The  treasure  was  not  his  that  his  evil  deeds  should  be  amended  with  a  share  of  it.  The  price  of  the  goods  and  the  assistance  that we  received of  the Lake-men we will fairly pay-in due time. But nothing will  we  give,  not  even  a  loaf's  worth,  under  threat  of  force. While  an  armed host  lies  before our doors, we look on you as foes and thieves.  \"It is in my mind to ask what share of their inheritance you would have paid to  our kindred, had you found the hoard unguarded and us slain.\"  \"A just question,\" replied Bard. \"But you are not dead, and we are not robbers.  Moreover  the  wealthy  may  have  pity  beyond  right  on  the  needy  that  befriended  them when they were in want. And still my other claims remain unanswered.\"  \"I will  not  parley,  as  I  have  said, with  armed men  at my  gate. Nor  at all with  the people of the Elvenking, whom I remember with small kindness. In this debate  they have no place. Begone now ere our arrows fly! And if you would speak with  me  again,  first  dismiss  the  elvish  host  to  the  woods  where  it  belongs,  and  then  return, laying down your arms before you approach the threshold.\"  \"The Elvenking  is my  friend,  and  he  has  succoured  the  people  of  the Lake  in  their need, though they had no claim but friendship on him,\" answered Bard. \"We  will  give  you  time  to  repent  your  words.  Gather  your  wisdom  ere  we  return!\"  Then he departed and went back to the camp.  Ere  many  hours  were  past,  the  banner-bearers  returned,  and  trumpeters  stood  forth and blew a blast:  \"In  the  name  of  Esgaroth  and  the  Forest,\"  one  cried,  \"we  speak  unto  Thorin  Thrain's  son  Oakenshield,  calling  himself  the  King  under  the  Mountain,  and  we  bid him consider well  the claims  that have been urged, or be declared our  foe. At  the  least  he  shall  deliver  one  twelfth  portion  of  the  treasure  unto  Bard,  as  the  dragon-slayer,  and  as  the  heir  of  Girion.  From  that  portion  Bard  will  himself  contribute  to  the  aid  of  Esgaroth;  but  if  Thorin  would  have  the  friendship  and  honour of the lands about, as his sires had of old, then he will give also somewhat  of his own  for  the comfort of  the men of  the Lake.\" Then Thorin seized a bow of   ####-horn  and  shot  an  arrow  at  the  speaker.  It  smote  into  his  shield  and  stuck  there  quivering."
}