{
  "id": "1048312b65a505ccfa1e51d3910dbf3434f848b8",
  "text": "  Ser Loras is a Tyrell, Sansa reminded herself. That other knight was only a Toyne. His brothers had no armies, no way to avenge him but with swords. Yet the more she thought about it all, the more she wondered. Joff might restrain himself for a few turns, perhaps as long as a year, but soon or late he will show his claws, and when he does… the realm might have a second Kingslayer, and there would be war inside the city, as the men of the lion and the men of the rose made the gutters run red.  Sansa was surprised that Margaery did not see it too. She is older than me, she must be wiser. And her father, Lord Tyrell, he knows what he is doing, surely. I am just being silly.  When she told Ser Dontos that she was going to Highgarden to marry Willas Tyrell, she thought he would be relieved and pleased for her. Instead he had grabbed her arm and said,  You cannot!  in a voice as thick with horror as with wine.  I tell you, these Tyrells are only Lannisters with flowers. I beg of you, forget this folly, give your Florian a kiss, and promise you’ll go ahead as we have planned. The night of Joffrey’s wedding, that’s not so long, wear the silver hair net and do as I told you, and afterward we make our escape.  He tried to plant a kiss on her cheek.  Sansa slipped from his grasp and stepped away from him.  I won’t. I can’t. Something would go wrong. When I wanted to escape you wouldn’t take me, and now I don’t need to.   Dontos stared at her stupidly.  But the arrangements are made, sweetling. The ship to take you home, the boat to take you to the ship, your Florian did it all for his sweet Jonquil.    I am sorry for all the trouble I put you to,  she said,  but I have no need of boats and ships now.    But it’s all to see you safe.    I will be safe in Highgarden. Willas will keep me safe.    But he does not know you,  Dontos insisted,  and he will not love you. Jonquil, Jonquil, open your sweet eyes, these Tyrells care nothing for you. It’s your claim they mean to wed.    My claim?  She was lost for a moment.   Sweetling,  he told her,  you are heir to Winterfell.  He grabbed her again, pleading that she must not do this thing, and Sansa wrenched free and left him swaying beneath the heart tree. She had not visited the godswood since.  But she had not forgotten his words, either. The heir to Winterfell, she would think as she lay abed at night. It’s your claim they mean to wed. Sansa had grown up with three brothers. She never thought to have a claim, but with Bran and Rickon dead… It doesn’t matter, there’s still Robb, he’s a man grown now, and soon he’ll wed and have a son. Anyway, Willas Tyrell will have Highgarden, what would he want with Winterfell?  Sometimes she would whisper his name into her pillow just to hear the sound of it.  Willas, Willas, Willas.  Willas was as good a name as Loras, she supposed. They even sounded the same, a little. What did it matter about his leg? Willas would be Lord of Highgarden and she would be his lady.  She pictured the two of them sitting together in a garden with puppies in their laps, or listening to a singer strum upon a lute while they floated down the Mander on a pleasure barge. If I give him sons, he may come to love me. She would name them Eddard and Brandon and Rickon, and raise them all to be as valiant as Ser Loras. And to hate Lannisters, too. In Sansa’s dreams, her children looked just like the brothers she had lost. Sometimes there was even a girl who looked like Arya.  She could never hold a picture of Willas long in her head, though; her imaginings kept turning him back into Ser Loras, young and graceful and beautiful. You must not think of him like that, she told herself. Or else he may see the disappointment in your eyes when you meet, and how could he marry you then, knowing it was his brother you loved? Willas Tyrell was twice her age, she reminded herself constantly, and lame as well, and perhaps even plump and red-faced like his father. But comely or no, he might be the only champion she would ever have.  Once she dreamed it was still her marrying Joff, not Margaery, and on their wedding night he turned into the headsman Ilyn Payne. She woke trembling. She did not want Margaery to suffer as she had, but she dreaded the thought that the Tyrells might refuse to go ahead with the wedding. I warned her, I did, I told her the truth of him. Perhaps Margaery did not believe her. Joff always played the perfect knight with her, as once he had with Sansa. She will see his true nature soon enough. After the wedding if not before. Sansa decided that she would light a candle to the Mother Above the next time she visited the sept, and ask her to protect Margaery from Joffrey’s cruelty. And perhaps a candle to the Warrior as well, for Loras.  She would wear her new gown for the ceremony at the Great Sept of Baelor, she decided as the seamstress took her last measurement. That must be why Cersei is having it made for me, so I will not look shabby at the wedding. She really ought to have a different gown for the feast afterward but she supposed one of her old ones would do."
}