{
  "id": "10db7b6cc0e4a2ca0290d08c408f95aed5325a32",
  "text": " Hideous though his face might be, the worst of his wounds was the one at the juncture of shoulder and arm, where his own mail had been driven back into his armpit by an arrow. Pus and blood still seeped from the discolored flesh whenever Maester Frenken changed his dressing, and any movement sent a stab of agony through him.  In the end, Tyrion settled for a pair of breeches and an oversized bed robe that hung loosely about his shoulders. Bronn yanked his boots onto his feet while Pod went in search of a stick for him to lean on. He drank a cup of dreamwine to fortify himself. The wine was sweetened with honey, with just enough of the poppy to make his wounds bearable for a time.  Even so, he was dizzy by the time he turned the latch, and the descent down the twisting stone steps made his legs tremble. He walked with the stick in one hand and the other on Pod’s shoulder. A serving girl was coming up as they were going down. She stared at them with wide white eyes, as if she were looking at a ghost. The dwarf has risen from the dead, Tyrion thought. And look, he’s uglier than ever, run tell your friends.  Maegor’s Holdfast was the strongest place in the Red Keep, a castle within the castle, surrounded by a deep dry moat lined with spikes. The drawbridge was up for the night when they reached the door. Ser Meryn Trant stood before it in his pale armor and white cloak.  Lower the bridge,  Tyrion commanded him.   The queen’s orders are to raise the bridge at night.  Ser Meryn had always been Cersei’s creature.   The queen’s asleep, and I have business with my father.   There was magic in the name of Lord Tywin Lannister. Grumbling, Ser Meryn Trant gave the command, and the drawbridge was lowered. A second Kingsguard knight stood sentry across the moat. Ser Osmund Kettleblack managed a smile when he saw Tyrion waddling toward him.  Feeling stronger, m’lord?    Much. When’s the next battle? I can scarcely wait.   When Pod and he reached the serpentine steps, however, Tyrion could only gape at them in dismay. I will never climb those by myself, he confessed to himself. Swallowing his dignity, he asked Bronn to carry him, hoping against hope that at this hour there would be no one to see and smile, no one to tell the tale of the dwarf being carried up the steps like a babe in arms.  The outer ward was crowded with tents and pavilions, dozens of them.  Tyrell men,  Podrick Payne explained as they threaded their way through a maze of silk and canvas.  Lord Rowan’s too, and Lord Redwyne’s. There wasn’t room enough for all. In the castle, I mean. Some took rooms. Rooms in the city. In inns and all. They’re here for the wedding. The king’s wedding, King Joffrey’s. Will you be strong enough to attend, my lord?    Ravening weasels could not keep me away.  There was this to be said for weddings over battles, at least; it was less likely that someone would cut off your nose.  Lights still burned dimly behind shuttered windows in the Tower of the Hand. The men on the door wore the crimson cloaks and lion-crested helms of his father’s household guard. Tyrion knew them both, and they admitted him on sight… though neither could bear to look long at his face, he noted.  Within they came upon Ser Addam Marbrand, descending the turnpike stair in the ornate black breastplate and cloth-of-gold cloak of an officer in the City Watch.  My lord,  he said,  how good to see you on your feet. I’d heard—    —rumors of a small grave being dug? Me too. Under the circumstances it seemed best to get up. I hear you’re commander of the City Watch. Shall I offer congratulations or condolences?    Both, I fear.  Ser Addam smiled.  Death and desertion have left me with some forty-four hundred. Only the gods and Littlefinger know how we are to go on paying wages for so many, but your sister forbids me to dismiss any.   Still anxious, Cersei? The battle’s done, the gold cloaks won’t help you now.  Do you come from my father?  he asked.   Aye. I fear I did not leave him in the best of moods. Lord Tywin feels forty-four hundred guardsmen more than sufficient to find one lost squire, but your cousin Tyrek remains missing.   Tyrek was the son of his late Uncle Tygett, a boy of thirteen. He had vanished in the riot, not long after wedding the Lady Ermesande, a suckling babe who happened to be the last surviving heir of House Hayford. And likely the first bride in the history of the Seven Kingdoms to be widowed before she was weaned.  I couldn’t find him either,  confessed Tyrion.   He’s feeding worms,  said Bronn with his usual tact.  Ironhand looked for him, and the eunuch rattled a nice fat purse. They had no more luck than we did. Give it up, ser.   Ser Addam gazed at the sellsword with distaste.  Lord Tywin is stubborn where his blood is concerned. He will have the lad, alive or dead, and I mean to oblige him.  He looked back to Tyrion.  You will find your father in his solar.   My solar, thought Tyrion.  I believe I know the way.   The way was up more steps, but this time he climbed under his own power, with one hand on Pod’s shoulder."
}