{
  "id": "10ed1bcb1c0d8dfac95d47d81d1a7921dc0d9b05",
  "text": "  Bran could not recall the last time he had been in the crypts. It had been before, for certain. When he was little, he used to play down here with Robb and Jon and his sisters.  He wished they were here now; the vault might not have seemed so dark and scary. Summer stalked out in the echoing gloom, then stopped, lifted his head, and sniffed the chill dead air. He bared his teeth and crept backward, eyes glowing golden in the light of the maester’s torch. Even Osha, hard as old iron, seemed uncomfortable.  Grim folk, by the look of them,  she said as she eyed the long row of granite Starks on their stone thrones.   They were the Kings of Winter,  Bran whispered. Somehow it felt wrong to talk too loudly in this place.  Osha smiled.  Winter’s got no king. If you’d seen it, you’d know that, summer boy.    They were the Kings in the North for thousands of years,  Maester Luwin said, lifting the torch high so the light shone on the stone faces. Some were hairy and bearded, shaggy men fierce as the wolves that crouched by their feet. Others were shaved clean, their features gaunt and sharp-edged as the iron longswords across their laps.  Hard men for a hard time. Come.  He strode briskly down the vault, past the procession of stone pillars and the endless carved figures. A tongue of flame trailed back from the upraised torch as he went.  The vault was cavernous, longer than Winterfell itself, and Jon had told him once that there were other levels underneath, vaults even deeper and darker where the older kings were buried. It would not do to lose the light. Summer refused to move from the steps, even when Osha followed the torch, Bran in her arms.   Do you recall your history, Bran?  the maester said as they walked.  Tell Osha who they were and what they did, if you can.   He looked at the passing faces and the tales came back to him. The maester had told him the stories, and Old Nan had made them come alive.  That one is Jon Stark. When the sea raiders landed in the east, he drove them out and built the castle at White Harbor. His son was Rickard Stark, not my father’s father but another Rickard, he took the Neck away from the Marsh King and married his daughter. Theon Stark’s the real thin one with the long hair and the skinny beard. They called him the ‘Hungry Wolf,’ because he was always at war. That’s a Brandon, the tall one with the dreamy face, he was Brandon the Shipwright, because he loved the sea. His tomb is empty. He tried to sail west across the Sunset Sea and was never seen again. His son was Brandon the Burner, because he put the torch to all his father’s ships in grief. There’s Rodrik Stark, who won Bear Island in a wrestling match and gave it to the Mormonts. And that’s Torrhen Stark, the King Who Knelt. He was the last King in the North and the first Lord of Winterfell, after he yielded to Aegon the Conqueror. Oh, there, he’s Cregan Stark. He fought with Prince Aemon once, and the Dragonknight said he’d never faced a finer swordsman.  They were almost at the end now, and Bran felt a sadness creeping over him.  And there’s my grandfather, Lord Rickard, who was beheaded by Mad King Aerys. His daughter Lyanna and his son Brandon are in the tombs beside him. Not me, another Brandon, my father’s brother. They’re not supposed to have statues, that’s only for the lords and the kings, but my father loved them so much he had them done.    The maid’s a fair one,  Osha said.   Robert was betrothed to marry her, but Prince Rhaegar carried her off and raped her,  Bran explained.  Robert fought a war to win her back. He killed Rhaegar on the Trident with his hammer, but Lyanna died and he never got her back at all.    A sad tale,  said Osha,  but those empty holes are sadder.    Lord Eddard’s tomb, for when his time comes,  Maester Luwin said.  Is this where you saw your father in your dream, Bran?    Yes.  The memory made him shiver. He looked around the vault uneasily, the hairs on the back of his neck bristling. Had he heard a noise? Was there someone here?  Maester Luwin stepped toward the open sepulchre, torch in hand.  As you see, he’s not here. Nor will he be, for many a year. Dreams are only dreams, child.  He thrust his arm into the blackness inside the tomb, as into the mouth of some great beast.  Do you see? It’s quite empt—   The darkness sprang at him, snarling.  Bran saw eyes like green fire, a flash of teeth, fur as black as the pit around them. Maester Luwin yelled and threw up his hands. The torch went flying from his fingers, caromed off the stone face of Brandon Stark, and tumbled to the statue’s feet, the flames licking up his legs. In the drunken shifting torchlight, they saw Luwin struggling with the direwolf, beating at his muzzle with one hand while the jaws closed on the other.   Summer!  Bran screamed.  And Summer came, shooting from the dimness behind them, a leaping shadow. He slammed into Shaggydog and knocked him back, and the two direwolves rolled over and over in a tangle of grey and black fur, snapping and biting at each other, while Maester Luwin struggled to his knees, his arm torn and bloody."
}