{
  "id": "110841bb1f5a09a28acc40a4186c66b6cbb128a1",
  "text": " It’s her brother she’ll want, as you know full well.  She had told him as much before, but Catelyn was finding that kings do not listen half so attentively as sons.   I can’t release the Kingslayer, not even if I wanted to. My lords would never abide it.    Your lords made you their king.    And can unmake me just as easy.    If your crown is the price we must pay to have Arya and Sansa returned safe, we should pay it willingly. Half your lords would like to murder Lannister in his cell. If he should die while he’s your prisoner, men will say—    —that he well deserved it,  Robb finished.   And your sisters?  Catelyn asked sharply.  Will they deserve their deaths as well? I promise you, if any harm comes to her brother, Cersei will pay us back blood for blood—    Lannister won’t die,  Robb said.  No one so much as speaks to him without my warrant. He has food, water, clean straw, more comfort than he has any right to. But I won’t free him, not even for Arya and Sansa.   Her son was looking down at her, Catelyn realized. Was it war that made him grow so fast, she wondered, or the crown they had put on his head?  Are you afraid to have Jaime Lannister in the field again, is that the truth of it?   Grey Wind growled, as if he sensed Robb’s anger, and Edmure Tully put a brotherly hand on Catelyn’s shoulder.  Cat, don’t. The boy has the right of this.    Don’t call me the boy,  Robb said, rounding on his uncle, his anger spilling out all at once on poor Edmure, who had only meant to support him.  I’m almost a man grown, and a king—your king, ser. And I don’t fear Jaime Lannister. I defeated him once, I’ll defeat him again if I must, only…  He pushed a fall of hair out of his eyes and gave a shake of the head.  I might have been able to trade the Kingslayer for Father, but…    …but not for the girls?  Her voice was icy quiet.  Girls are not important enough, are they?   Robb made no answer, but there was hurt in his eyes. Blue eyes, Tully eyes, eyes she had given him. She had wounded him, but he was too much his father’s son to admit it.  That was unworthy of me, she told herself. Gods be good, what is to become of me? He is doing his best, trying so hard, I know it, I see it, and yet… I have lost my Ned, the rock my life was built on, I could not bear to lose the girls as well…   I’ll do all I can for my sisters,  Robb said.  If the queen has any sense, she’ll accept my terms. If not, I’ll make her rue the day she refused me.   Plainly, he’d had enough of the subject.  Mother, are you certain you will not consent to go to the Twins? You would be farther from the fighting, and you could acquaint yourself with Lord Frey’s daughters to help me choose my bride when the war is done.   He wants me gone, Catelyn thought wearily. Kings are not supposed to have mothers, it would seem, and I tell him things he does not want to hear.  You’re old enough to decide which of Lord Walder’s girls you prefer without your mother’s help, Robb.    Then go with Theon. He leaves on the morrow. He’ll help the Mallisters escort that lot of captives to Seagard and then take ship for the Iron Islands. You could find a ship as well, and be back at Winterfell with a moon’s turn, if the winds are kind. Bran and Rickon need you.   And you do not, is that what you mean to say?  My lord father has little enough time remaining him. So long as your grandfather lives, my place is at Riverrun with him.    I could command you to go. As king. I could.   Catelyn ignored that.  I’ll say again, I would sooner you sent someone else to Pyke, and kept Theon close to you.    Who better to treat with Balon Greyjoy than his son?    Jason Mallister,  offered Catelyn.  Tytos Blackwood. Stevron Frey. Anyone… but not Theon.   Her son squatted beside Grey Wind, ruffling the wolf’s fur and incidentally avoiding her eyes.  Theon’s fought bravely for us. I told you how he saved Bran from those wildlings in the wolfswood. If the Lannisters won’t make peace, I’ll have need of Lord Greyjoy’s longships.    You’ll have them sooner if you keep his son as hostage.    He’s been a hostage half his life.    For good reason,  Catelyn said.  Balon Greyjoy is not a man to be trusted. He wore a crown himself, remember, if only for a season. He may aspire to wear one again.   Robb stood.  I will not grudge him that. If I’m King in the North, let him be King of the Iron Islands, if that’s his desire. I’ll give him a crown gladly, so long as he helps us bring down the Lannisters.    Robb—    I’m sending Theon. Good day, Mother. Grey Wind, come.  Robb walked off briskly, the direwolf padding beside him.  Catelyn could only watch him go. Her son and now her king. How queer that felt. Command, she had told him back in Moat Cailin. And so he did.  I am going to visit Father,  she announced abruptly.  Come with me, Edmure.    I need to have a word with those new bowmen Ser Desmond is training. I’ll visit him later.   If he still lives, Catelyn thought, but she said nothing. Her brother would sooner face battle than that sickroom."
}