{
  "id": "11a3964048bc15fa94f2d7f4ea7a988d47aad0f6",
  "text": "  Fight with them, Qhorin had said, before he surrendered his own life to Longclaw… but it had not come to that, till now. Once I shed a brother’s blood I am lost. I cross the Wall for good then, and there is no crossing back.  After each day’s march the Magnar summoned him to ask shrewd sharp questions about Castle Black, its garrison and defenses. Jon lied where he dared and feigned ignorance a few times, but Grigg the Goat and Errok listened as well, and they knew enough to make Jon careful. Too blatant a lie would betray him.  But the truth was terrible. Castle Black had no defenses, but for the Wall itself. It lacked even wooden palisades or earthen dikes. The  castle  was nothing more than a cluster of towers and keeps, two-thirds of them falling into ruin. As for the garrison, the Old Bear had taken two hundred on his ranging. Had any returned? Jon could not know. Perhaps four hundred remained at the castle, but most of those were builders or stewards, not rangers.  The Thenns were hardened warriors, and more disciplined than the common run of wildling; no doubt that was why Mance had chosen them. The defenders of Castle Black would include blind Maester Aemon and his half-blind steward Clydas, one-armed Donal Noye, drunken Septon Cellador, Deaf Dick Follard, Three-Finger Hobb the cook, old Ser Wynton Stout, as well as Halder and Toad and Pyp and Albett and the rest of the boys who’d trained with Jon. And commanding them would be red-faced Bowen Marsh, the plump Lord Steward who had been made castellan in Lord Mormont’s absence. Dolorous Edd sometimes called Marsh  the Old Pomegranate,  which fit him just as well as  the Old Bear  fit Mormont.  He’s the man you want in front when the foes are in the field,  Edd would say in his usual dour voice.  He’ll count them right up for you. A regular demon for counting, that one.   If the Magnar takes Castle Black unawares, it will be red slaughter, boys butchered in their beds before they know they are under attack. Jon had to warn them, but how? He was never sent out to forage or hunt, nor allowed to stand a watch alone. And he feared for Ygritte as well. He could not take her, but if he left her, would the Magnar make her answer for his treachery? Two hearts that beat as one…  They shared the same sleeping skins every night, and he went to sleep with her head against his chest and her red hair tickling his chin. The smell of her had become a part of him. Her crooked teeth, the feel of her breast when he cupped it in his hand, the taste of her mouth… they were his joy and his despair. Many a night he lay with Ygritte warm beside him, wondering if his lord father had felt this confused about his mother, whoever she had been. Ygritte set the trap and Mance Rayder pushed me into it.  Every day he spent among the wildlings made what he had to do that much harder. He was going to have to find some way to betray these men, and when he did they would die. He did not want their friendship, any more than he wanted Ygritte’s love. And yet… the Thenns spoke the Old Tongue and seldom talked to Jon at all, but it was different with Jarl’s raiders, the men who’d climbed the Wall. Jon was coming to know them despite himself: gaunt, quiet Errok and gregarious Grigg the Goat, the boys Quort and Bodger, Hempen Dan the ropemaker. The worst of the lot was Del, a horsefaced youth near Jon’s own age, who would talk dreamily of this wildling girl he meant to steal.  She’s lucky, like your Ygritte. She’s kissed by fire.   Jon had to bite his tongue. He didn’t want to know about Del’s girl or Bodger’s mother, the place by the sea that Henk the Helm came from, how Grigg yearned to visit the green men on the Isle of Faces, or the time a moose had chased Toefinger up a tree. He didn’t want to hear about the boil on Big Boil’s arse, how much ale Stone Thumbs could drink, or how Quort’s little brother had begged him not to go with Jarl. Quort could not have been older than fourteen, though he’d already stolen himself a wife and had a child on the way.  Might be he’ll be born in some castle,  the boy boasted.  Born in a castle like a lord!  He was very taken with the  castles  they’d seen, by which he meant watchtowers.  Jon wondered where Ghost was now. Had he gone to Castle Black, or was he was running with some wolfpack in the woods? He had no sense of the direwolf, not even in his dreams. It made him feel as if part of himself had been cut off. Even with Ygritte sleeping beside him, he felt alone. He did not want to die alone.  By that afternoon the trees had begun to thin, and they marched east over gently rolling plains. Grass rose waist high around them, and stands of wild wheat swayed gently when the wind came gusting, but for the most part the day was warm and bright. Toward sunset, however, clouds began to threaten in the west. They soon engulfed the orange sun, and Lenn foretold a bad storm coming. His mother was a woods witch, so all the raiders agreed he had a gift for foretelling the weather."
}