{
  "id": "124c4ab107c0f6d2a66e87f757f2a4322da12aa2",
  "text": "  Melisandre,  he said, with a calm he did not feel.   Onion Knight,  she replied, just as calmly, as if the two of them had met on a stair or in the yard, and were exchanging polite greetings.  Are you well?    Better than I was.    Do you lack for anything?    My king. My son. I lack for them.  He pushed the bowl aside and stood.  Have you come to burn me?   Her strange red eyes studied him through the bars.  This is a bad place, is it not? A dark place, and foul. The good sun does not shine here, nor the bright moon.  She lifted a hand toward the torch in the wall sconce.  This is all that stands between you and the darkness, Onion Knight. This little fire, this gift of R’hllor. Shall I put it out?    No.  He moved toward the bars.  Please.  He did not think he could bear that, to be left alone in utter blackness with no one but the rats for company.  The red woman’s lips curved upward in a smile.  So you have come to love the fire, it would seem.    I need the torch.  His hands opened and closed. I will not beg her. I will not.   I am like this torch, Ser Davos. We are both instruments of R’hllor. We were made for a single purpose—to keep the darkness at bay. Do you believe that?    No.  Perhaps he should have lied, and told her what she wanted to hear, but Davos was too accustomed to speaking truth.  You are the mother of darkness. I saw that under Storm’s End, when you gave birth before my eyes.    Is the brave Ser Onions so frightened of a passing shadow? Take heart, then. Shadows only live when given birth by light, and the king’s fires burn so low I dare not draw off any more to make another son. It might well kill him.  Melisandre moved closer.  With another man, though… a man whose flames still burn hot and high… if you truly wish to serve your king’s cause, come to my chamber one night. I could give you pleasure such as you have never known, and with your life-fire I could make…    …a horror.  Davos retreated from her.  I want no part of you, my lady. Or your god. May the Seven protect me.   Melisandre sighed.  They did not protect Guncer Sunglass. He prayed thrice each day, and bore seven seven-pointed stars upon his shield, but when R’hllor reached out his hand his prayers turned to screams, and he burned. Why cling to these false gods?    I have worshiped them all my life.    All your life, Davos Seaworth? As well say it was so yesterday.  She shook her head sadly.  You have never feared to speak the truth to kings, why do you lie to yourself? Open your eyes, ser knight.    What is it you would have me see?    The way the world is made. The truth is all around you, plain to behold. The night is dark and full of terrors, the day bright and beautiful and full of hope. One is black, the other white. There is ice and there is fire. Hate and love. Bitter and sweet. Male and female. Pain and pleasure. Winter and summer. Evil and good.  She took a step toward him.  Death and life. Everywhere, opposites. Everywhere, the war.    The war?  asked Davos.   The war,  she affirmed.  There are two, Onion Knight. Not seven, not one, not a hundred or a thousand. Two! Do you think I crossed half the world to put yet another vain king on yet another empty throne? The war has been waged since time began, and before it is done, all men must choose where they will stand. On one side is R’hllor, the Lord of Light, the Heart of Fire, the God of Flame and Shadow. Against him stands the Great Other whose name may not be spoken, the Lord of Darkness, the Soul of Ice, the God of Night and Terror. Ours is not a choice between Baratheon and Lannister, between Greyjoy and Stark. It is death we choose, or life. Darkness, or light.  She clasped the bars of his cell with her slender white hands. The great ruby at her throat seemed to pulse with its own radiance.  So tell me, Ser Davos Seaworth, and tell me truly—does your heart burn with the shining light of R’hllor? Or is it black and cold and full of worms?  She reached through the bars and laid three fingers upon his breast, as if to feel the truth of him through flesh and wool and leather.   My heart,  Davos said slowly,  is full of doubts.   Melisandre sighed.  Ahhhh, Davos. The good knight is honest to the last, even in his day of darkness. It is well you did not lie to me. I would have known. The Other’s servants oft hide black hearts in gaudy light, so R’hllor gives his priests the power to see through falsehoods.  She stepped lightly away from the cell.  Why did you mean to kill me?    I will tell you,  said Davos,  if you will tell me who betrayed me.  it could only have been Salladhor Saan, and yet even now he prayed it was not so.  The red woman laughed.  No one betrayed you, onion knight. I saw your purpose in my flames.   The flames.  If you can see the future in these flames, how is it that we burned upon the Blackwater? You gave my sons to the fire… my sons, my ship, my men, all burning…   Melisandre shook her head.  You wrong me, onion knight. Those were no fires of mine."
}