{
  "id": "12b60700f9cdf99784970a86cd124fef3c7c4f51",
  "text": " When I was younger and more fair, I went in caravan to Asshai by the Shadow, to learn from their mages. Ships from many lands come to Asshai, so I lingered long to study the healing ways of distant peoples. A moonsinger of the Jogos Nhai gifted me with her birthing songs, a woman of your own riding people taught me the magics of grass and corn and horse, and a maester from the Sunset Lands opened a body for me and showed me all the secrets that hide beneath the skin.   Ser Jorah Mormont spoke up.  A maester?    Marwyn, he named himself,  the woman replied in the Common Tongue.  From the sea. Beyond the sea. The Seven Lands, he said. Sunset Lands. Where men are iron and dragons rule. He taught me this speech.    A maester in Asshai,  Ser Jorah mused.  Tell me, Godswife, what did this Marwyn wear about his neck?    A chain so tight it was like to choke him, Iron Lord, with links of many metals.   The knight looked at Dany.  Only a man trained in the Citadel of Oldtown wears such a chain,  he said,  and such men do know much of healing.    Why should you want to help my khal?    All men are one flock, or so we are taught,  replied Mirri Maz Duur.  The Great Shepherd sent me to earth to heal his lambs, wherever I might find them.   Qotho gave her a stinging slap.  We are no sheep, maegi.    Stop it,  Dany said angrily.  She is mine. I will not have her harmed.   Khal Drogo grunted.  The arrow must come out, Qotho.    Yes, Great Rider,  Mirri Maz Duur answered, touching her bruised face.  And your breast must be washed and sewn, lest the wound fester.    Do it, then,  Khal Drogo commanded.   Great Rider,  the woman said,  my tools and potions are inside the god’s house, where the healing powers are strongest.    I will carry you, blood of my blood,  Haggo offered.  Khal Drogo waved him away.  I need no man’s help,  he said, in a voice proud and hard. He stood, unaided, towering over them all. A fresh wave of blood ran down his breast, from where Ogo’s arakh had cut off his nipple. Dany moved quickly to his side.  I am no man,  she whispered,  so you may lean on me.  Drogo put a huge hand on her shoulder. She took some of his weight as they walked toward the great mud temple. The three bloodriders followed. Dany commanded Ser Jorah and the warriors of her khas to guard the entrance and make certain no one set the building afire while they were still inside.  They passed through a series of anterooms, into the high central chamber under the onion. Faint light shone down through hidden windows above. A few torches burnt smokily from sconces on the walls. Sheepskins were scattered across the mud floor.  There,  Mirri Maz Duur said, pointing to the altar, a massive blue-veined stone carved with images of shepherds and their flocks. Khal Drogo lay upon it. The old woman threw a handful of dried leaves onto a brazier, filling the chamber with fragrant smoke.  Best if you wait outside,  she told the rest of them.   We are blood of his blood,  Cohollo said.  Here we wait.   Qotho stepped close to Mirri Maz Duur.  Know this, wife of the Lamb God. Harm the khal and you suffer the same.  He drew his skinning knife and showed her the blade.   She will do no harm.  Dany felt she could trust this old, plainfaced woman with her flat nose; she had saved her from the hard hands of her rapers, after all.   If you must stay, then help,  Mirri told the bloodriders.  The Great Rider is too strong for me. Hold him still while I draw the arrow from his flesh.  She let the rags of her gown fall to her waist as she opened a carved chest, and busied herself with bottles and boxes, knives and needles. When she was ready, she broke off the barbed arrowhead and pulled out the shaft, chanting in the singsong tongue of the Lhazareen. She heated a flagon of wine to boiling on the brazier, and poured it over his wounds. Khal Drogo cursed her, but he did not move. She bound the arrow wound with a plaster of wet leaves and turned to the gash on his breast, smearing it with a pale green paste before she pulled the flap of skin back in place. The khal ground his teeth together and swallowed a scream. The godswife took out a silver needle and a bobbin of silk thread and began to close the flesh. When she was done she painted the skin with red ointment, covered it with more leaves, and bound the breast in a ragged piece of lambskin.  You must say the prayers I give you and keep the lambskin in place for ten days and ten nights,  she said.  There will be fever, and itching, and a great scar when the healing is done.   Khal Drogo sat, bells ringing.  I sing of my scars, sheep woman.  He flexed his arm and scowled.   Drink neither wine nor the milk of the poppy,  she cautioned him.  Pain you will have, but you must keep your body strong to fight the poison spirits.    I am khal,  Drogo said.  I spit on pain and drink what I like. Cohollo, bring my vest.  The older man hastened off.   Before,  Dany said to the ugly Lhazareen woman,  I heard you speak of birthing songs…    I know every secret of the bloody bed, Silver Lady, nor have I ever lost a babe,  Mirri Maz Duur replied."
}