{
  "id": "12bd0c0fa1e82ccf96cac746b00816bbb389fbd2",
  "text": " The direwolf shot ahead like a quarrel from a crossbow. Under an outcrop of rock that gave some small degree of shelter from the rain, Sam was feeding the ravens. His boots squished when he moved.  My feet are soaked through,  he admitted miserably.  When I climbed off my horse, I stepped in a hole and went in up to my knees.    Take off your boots and dry your stockings. I’ll find some dry wood. If the ground’s not wet under the rock, we might be able to get a fire burning.  Jon showed Sam the rabbit.  And we’ll feast.    Won’t you be attending Lord Mormont in the hall?    No, but you will. The Old Bear wants you to map for him. Craster says he’ll find Mance Rayder for us.    Oh.  Sam did not look anxious to meet Craster, even if it meant a warm fire.   He said eat first, though. Dry your feet.  Jon went to gather fuel, digging down under deadfalls for the drier wood beneath and peeling back layers of sodden pine needles until he found likely kindling. Even then, it seemed to take forever for a spark to catch. He hung his cloak from the rock to keep the rain off his smoky little fire, making them a small snug alcove.  As he knelt to skin the rabbit, Sam pulled off his boots.  I think there’s moss growing between my toes,  he declared mournfully, wriggling the toes in question.  The rabbit will taste good. I don’t even mind about the blood and all.  He looked away.  Well, only a little…   Jon spitted the carcass, banked the fire with a pair of rocks, and balanced their meal atop them. The rabbit had been a scrawny thing, but as it cooked it smelled like a king’s feast. Other rangers gave them envious looks. Even Ghost looked up hungrily, flames shining in his red eyes as he sniffed.  You had yours before,  Jon reminded him.   Is Craster as savage as the rangers say?  Sam asked. The rabbit was a shade underdone, but tasted wonderful.  What’s his castle like?    A midden heap with a roof and a firepit.  Jon told Sam what he had seen and heard in Craster’s Keep.  By the time the telling was done, it was dark outside and Sam was licking his fingers.  That was good, but now I’d like a leg of lamb. A whole leg, just for me, sauced with mint and honey and cloves. Did you see any lambs?    There was a sheepfold, but no sheep.    How does he feed all his men?    I didn’t see any men. Just Craster and his women and a few small girls. I wonder he’s able to hold the place. His defenses were nothing to speak of, only a muddy dike. You had better go up to the hall and draw that map. Can you find the way?    If I don’t fall in the mud.  Sam struggled back into his boots, collected quill and parchment, and shouldered out into the night, the rain pattering down on his cloak and floppy hat.  Ghost laid his head on his paws and went to sleep by the fire. Jon stretched out beside him, grateful for the warmth. He was cold and wet, but not so cold and wet as he’d been a short time before. Perhaps tonight the Old Bear will learn something that will lead us to Uncle Benjen.  He woke to the sight of his own breath misting in the cold morning air. When he moved, his bones ached. Ghost was gone, the fire burnt out. Jon reached to pull aside the cloak he’d hung over the rock, and found it stiff and frozen. He crept beneath it and stood up in a forest turned to crystal.  The pale pink light of dawn sparkled on branch and leaf and stone. Every blade of grass was carved from emerald, every drip of water turned to diamond. Flowers and mushrooms alike wore coats of glass. Even the mud puddles had a bright brown sheen. Through the shimmering greenery, the black tents of his brothers were encased in a fine glaze of ice.  So there is magic beyond the Wall after all. He found himself thinking of his sisters, perhaps because he’d dreamed of them last night. Sansa would call this an enchantment, and tears would fill her eyes at the wonder of it, but Arya would run out laughing and shouting, wanting to touch it all.   Lord Snow?  he heard. Soft and meek. He turned.  Crouched atop the rock that had sheltered him during the night was the rabbit keeper, wrapped in a black cloak so large it drowned her. Sam’s cloak, Jon realized at once. Why is she wearing Sam’s cloak?  The fat one told me I’d find you here, m’lord,  she said.   We ate the rabbit, if that’s what you came for.  The admission made him feel absurdly guilty.   Old Lord Crow, him with the talking bird, he gave Craster a crossbow worth a hundred rabbits.  Her arms closed over the swell of her belly.  Is it true, m’lord? Are you brother to a king?    A half brother,  he admitted.  I’m Ned Stark’s bastard. My brother Robb is the King in the North. Why are you here?    The fat one, that Sam, he said to see you. He give me his cloak, so no one would say I didn’t belong.    Won’t Craster be angry with you?    My father drank overmuch of the Lord Crow’s wine last night. He’ll sleep most of the day.  Her breath frosted the air in small nervous puffs.  They say the king gives justice and protects the weak."
}