{
  "id": "13ab4d179b4e61276a0ea5319f103a3de87a90c2",
  "text": "  \"Don't you dare call Hagrid pathetic, you foul -- you evil --\"  \"Hermione!\" said Ron weakly, and he tried to grab her hand as she swung it back.  \"Get off, Ron!\"  Hermione pulled out her wand. Malfoy stepped backward. Crabbe and Goyle looked at him for instructions, thoroughly bewildered.  \"C'mon,\" Malfoy muttered, and in a moment, all three of them had disappeared into the passageway to the dungeons.  \"Hermione!\" Ron said again, sounding both stunned and irnpressed.  \"Harry, you'd better beat him in the Quidditch final!\" Hermione said shrilly. \"You just better had, because I can't stand it if Slytherin wins!\"  \"We're due in Charms,\" said Ron, still goggling at Hermione. \"We'd better go.\"  They hurried up the marble staircase toward Professor Flitwick's classroom.  \"You're late, boys!\" said Professor Flitwick reprovingly as Harry opened the classroom door. \"Come along, quickly, wands out, we're experimenting with Cheering Charms today, we've already divided into pairs --\"  Harry and Ron hurried to a desk at the back and opened their bags. Ron looked behind him.  \"Where's Hermione gone?\"  Harry looked around too. Hermione hadn't entered the classroom, yet Harry knew she had been right next to him when he had opened the door.  \"That's weird,\" said Harry, staring at Ron. \"Maybe -- maybe she went to the bathroom or something?\"  But Hermione didn't turn up all lesson.  \"She could've done with a Cheering Charm on her too,\" said Ron as the class left for lunch, all grinning broadly -- the Cheering Charms had left them with a feeling of great contentment.  Hermione wasn't at lunch either. By the time they had finished their apple pie, the after-effects of the Cheering Charms were wearing off, and Harry and Ron had started to get slightly worried.  \"You don't think Malfoy did something to her?\" Ron said anxiously as they hurried upstairs toward Gryffindor Tower.  They passed the security trolls, gave the Fat Lady the password (\"Flibbertigibbet\"), and scrambled through the portrait hole into the common room.  Hermione was sitting at a table, fast asleep, her head resting on an open Arithmancy book. They went to sit down on either side of her. Harry prodded her awake.  \"Wh -- what?\" said Hermione, waking with a start and staring wildly around. \"Is it time to go? W -- which lesson have we got now?\"  \"Divination, but it's not for another twenty minutes,\" said Harry. \"Hermione, why didn't you come to Charms?\"  \"What? Oh no!\" Hermione squeaked. \"I forgot to go to Charms!\"  \"But how could you forget?\" said Harry. \"You were with us till we were right outside the classroom!\"  \"I don't believe it!\" Hermione wailed. \"Was Professor Flitwick angry? Oh, it was Malfoy, I was thinking about him and I lost track of things!\"  \"You know what, Hermione?\" said Ron, looking down at the enormous Arithmancy book Hermione had been using as a pillow. \"I reckon you're cracking up. You're trying to do too much.\"  \"No, I'm not!\" said Hermione, brushing her hair out of her eyes and staring hopelessly around for her bag. \"I just made a mistake, that's all! I'd better go and see Professor Flitwick and say sorry... I'll see you in Divination!\"  Hermione joined them at the foot of the ladder to Professor Trelawneys classroom twenty minutes later, looking extremely harrassed.  \"I can't believe I missed Cheering Charms! And I bet they come up in our exams; Professor Flitwick hinted they might!\"  Together they climbed the ladder into the dim, stifling tower room. Glowing on every little table was a crystal ball full of pearly white mist. Harry, Ron, and Hermione sat down together at the same rickety table.  \"I thought we weren't starting crystal balls until next term,\" Ron muttered, casting a wary eye around for Professor Trelawney, in case she was lurking nearby.  \"Don't complain, this means we've finished palmistry,\" Harry muttered back. \"I was getting sick of her flinching every time she looked at my hands.\"  \"Good day to you!\" said the familiar, misty voice, and Professor Trelawney made her usual dramatic entrance out of the shadows. Parvati and Lavender quivered with excitement, their faces lit by the milky glow of their crystal ball.  \"I have decided to introduce the crystal ball a little earlier than I had planned,\" said Professor Trelawney, sitting with her back to the fire and gazing around. \"The fates have informed me that your examination in June will concern the Orb, and I am anxious to give you sufficient practice.\"  Hermione snorted.  \"Well, honestly... 'the fates have informed her' who sets the exam? She does! What an amazing prediction!\" she said, not troubling to keep her voice low. Harry and Ron choked back laughs.  It was hard to tell whether Professor Trelawney had heard them as her face was hidden in shadow. She continued, however, as though she had not.  \"Crystal gazing is a particularly refined art,\" she said dreamily. \"I do not expect any of you to See when first you peer into the Orb's infinite depths. We shall start by practicing relaxing the conscious mind and external eyes\" -- Ron began to snigger uncontrollably and had to stuff his fist in his mouth to stifle the noise -- \"so as to clear the Inner Eye and the superconscious."
}