{
  "id": "1419a316b3eae2fc5045d0223b5ccf967a4c92e3",
  "text": " \"But I had my wand hidden up my sleeve,\" he assured Padma Patil, who seemed to be a lot keener on Ron now that he was getting so much attention and was making a point of talking to him every time they passed in the corridors.  \"I could've taken those mer-idiots any time I wanted.\" \"What were you going to do, snore at them?\"  said Hermione waspishly.  People had been teasing her so much about being the thing that Viktor Krum would most miss that she was in a rather tetchy mood. Ron's ears went red, and thereafter, he reverted to the bewitched sleep version of events. As they entered March the weather became drier, but cruel winds skinned their hands and faces every time they went out onto the grounds.  There were delays in the post because the owls kept being blown off course.  The brown owl that Harry had sent to Sirius with the dates of the Hogsmeade weekend turned up at breakfast on Friday morning with half its feathers sticking up the wrong way; Harry had no sooner torn off Sirius's reply than it took flight, clearly afraid it was going to be sent outside again. Sirius's letter was almost as short as the previous one.  Be at stile at end of road out of Hogsmeade (past Dervish and  Banges) at two o'clock on Saturday afternoon. Bring as much  food as you can.  \"He hasn't come back to Hogsmeade?\" said Ron incredulously.   \"It looks like it, doesn't it?\" said Hermione.   \"I can't believe him,\" said Harry tensely, \"if he's caught. . .\"  \"Made it so far, though, hasn't he?\" said Ron. \"And it's not like the place is swarming with dementors anymore.\" Harry folded up the letter, thinking. If he was honest with himself, he really wanted to see Sirius again. He therefore approached the final lesson of the afternoon - double Potions - feeling considerably more cheerful than he usually did when descending the steps to the dungeons. Malfoy, Crabbe, and Goyle were standing in a huddle outside the classroom door with Pansy Parkinson's gang of Slytherin girls.  All of them were looking at something Harry couldn't see and sniggering heartily.  Pansys pug-like face peered excitedly around Goyle's broad back as Harry, Ron, and Hermione approached. \"There they are, there they are!\"  she giggled, and the knot of Slytherins broke apart. Harry saw that Pansy had a magazine in her hands - Witch Weekly.  The moving picture on the front showed a curly-haired witch who was smiling toothily and pointing at a large sponge cake with her wand. \"You might find something to interest you in there, Granger!\" Pansy said loudly, and she threw the magazine at Hermione, who caught it, looking startled.  At that moment, the dungeon door opened, and Snape beckoned them all inside. Hermione, Harry, and Ron headed for a table at the back of the dungeon as usual. Once Snape had turned his back on them to write up the ingredients of todays potion on the blackboard, Hermione hastily rifled through the magazine under the desk.  At last, in the center pages, Hermione found what they were looking for.  Harry and Ron leaned in closer.  A color photograph of Harry headed a short piece entitled:  Harry Potter's Secret Heartache  A boy like no other, perhaps - yet a boy suffering all the usual pangs of adolescence, writes Rita Skeeter.  Deprived of love since the tragic demise of his parents, fourteen-year-old Harry Potter thought he had found solace in his steady girlfriend at Hogwarts, Muggle-born Hermione Granger.  Little did he know that he would shortly be suffering yet another emotional blow in a life already littered with personal loss. Miss Granger, a plain but ambitious girl, seems to have a taste for famous wizards that Harry alone cannot satisfy.  Since the arrival at Hogwarts of Viktor Krum, Bulgarian Seeker and hero of the last World Quidditch Cup, Miss Granger has been toying with both boys' affections.  Krum, who is openly smitten with the devious Miss Granger, has already invited her to visit him in Bulgaria over the summer holidays, and insists that he has \"never felt this way about any other girl.\" However, it might not be Miss Granger's doubtful natural charms that have captured these unfortunate boys' interest. \"She's really ugly,\" says Pansy Parkinson, a pretty and vivacious fourth-year student, \"but she'd be well up to making a Love Potion, she's quite brainy. I think that's how she's doing it.\" Love Potions are, of course, banned at Hogwarts, and no doubt Albus Dumbledore will want to investigate these claims.  In the meantime, Harry Potters well-wishers must hope that, next time, he bestows his heart on a worthier candidate.  \"I told you!\"  Ron hissed at Hermione as she stared down at the article.  \"I told you not to annoy Rita Skeeter!  She's made you out to be some sort of- of scarlet woman!\" Hermione stopped looking astonished and snorted with laughter. \"Scarlet woman?\" she repeated, shaking with suppressed giggles as she looked around at Ron. \"It's what my mum calls them,\" Ron muttered, his ears going red. \"If that's the best Rita can do, she's losing her touch,\" said Hermione, still giggling, as she threw Witch Weekly onto the empty chair beside her."
}