{
  "id": "1442ffa2cf2844e6a9c0429ce4b157c807f69320",
  "text": " Belwas was squat but broad, a good fifteen stone of fat and muscle, his great brown gut crisscrossed by faded white scars. He wore baggy pants, a yellow silk bellyband, and an absurdly tiny leather vest dotted with iron studs.  Strong Belwas is hungry!  he roared at everyone and no one in particular.  Strong Belwas will eat now!  Turning, he spied Arstan on the forecastle.  Whitebeard! You will bring food for Strong Belwas!    You may go,  Dany told the squire. He bowed again, and moved off to tend the needs of the man he served.  Ser Jorah watched with a frown on his blunt honest face. Mormont was big and burly, strong of jaw and thick of shoulder. Not a handsome man by any means, but as true a friend as Dany had ever known.  You would be wise to take that old man’s words well salted,  he told her when Whitebeard was out of earshot.   A queen must listen to all,  she reminded him.  The highborn and the low, the strong and the weak, the noble and the venal. One voice may speak you false, but in many there is always truth to be found.  She had read that in a book.   Hear my voice then, Your Grace,  the exile said.  This Arstan Whitebeard is playing you false. He is too old to be a squire, and too well spoken to be serving that oaf of a eunuch.   That does seem queer, Dany had to admit. Strong Belwas was an ex-slave, bred and trained in the fighting pits of Meereen. Magister Illyrio had sent him to guard her, or so Belwas claimed, and it was true that she needed guarding. The Usurper on his Iron Throne had offered land and lordship to any man who killed her. One attempt had been made already, with a cup of poisoned wine. The closer she came to Westeros, the more likely another attack became. Back in Qarth, the warlock Pyat Pree had sent a Sorrowful Man after her to avenge the Undying she’d burned in their House of Dust. Warlocks never forgot a wrong, it was said, and the Sorrowful Men never failed to kill. Most of the Dothraki would be against her as well. Khal Drogo’s kos led khalasars of their own now, and none of them would hesitate to attack her own little band on sight, to slay and slave her people and drag Dany herself back to Vaes Dothrak to take her proper place among the withered crones of the dosh khaleen. She hoped that Xaro Xhoan Daxos was not an enemy, but the Qartheen merchant had coveted her dragons. And there was Quaithe of the Shadow, that strange woman in the red lacquer mask with all her cryptic counsel. Was she an enemy too, or only a dangerous friend? Dany could not say.  Ser Jorah saved me from the poisoner, and Arstan Whitebeard from the manticore. Perhaps Strong Belwas will save me from the next. He was huge enough, with arms like small trees and a great curved arakh so sharp he might have shaved with it, in the unlikely event of hair sprouting on those smooth brown cheeks. Yet he was childlike as well. As a protector, he leaves much to be desired. Thankfully, I have Ser Jorah and my bloodriders. And my dragons, never forget. In time, the dragons would be her most formidable guardians, just as they had been for Aegon the Conqueror and his sisters three hundred years ago. Just now, though, they brought her more danger than protection. In all the world there were but three living dragons, and those were hers; they were a wonder, and a terror, and beyond price.  She was pondering her next words when she felt a cool breath on the back of her neck, and a loose strand of her silver-gold hair stirred against her brow. Above, the canvas creaked and moved, and suddenly a great cry went up from all over Balerion.  Wind!  the sailors shouted.  The wind returns, the wind!   Dany looked up to where the great cog’s sails rippled and belled as the lines thrummed and tightened and sang the sweet song they had missed so for six long days. Captain Groleo rushed aft, shouting commands. The Pentoshi were scrambling up the masts, those that were not cheering. Even Strong Belwas let out a great bellow and did a little dance.  The gods are good!  Dany said.  You see, Jorah? We are on our way once more.    Yes,  he said,  but to what, my queen?   All day the wind blew, steady from the east at first, and then in wild gusts. The sun set in a blaze of red. I am still half a world from Westeros, Dany reminded herself, but every hour brings me closer. She tried to imagine what it would feel like, when she first caught sight of the land she was born to rule. It will be as fair a shore as I have ever seen, I know it. How could it be otherwise?  But later that night, as Balerion plunged onward through the dark and Dany sat crosslegged on her bunk in the captain’s cabin, feeding her dragons— Even upon the sea,  Groleo had said, so graciously,  queens take precedence over captains —a sharp knock came upon the door.  Irri had been sleeping at the foot of her bunk (it was too narrow for three, and tonight was Jhiqui’s turn to share the soft featherbed with her khaleesi), but the handmaid roused at the knock and went to the door."
}