{
  "id": "144946c611a4bde476942b071426d2c4f4c793c3",
  "text": " I arrived in time to prevent that, although you were doing very well on your own, I must say.  \"You got there? You got Hermione's owl?\"  \"We must have crossed in midair. No sooner had I reached London than it became clear to me that the place I should be was the one I had just left. I arrived just in time to pull Quirrell off you.\"  \"It was you.\"  \"I feared I might be too late.\"  \"You nearly were, I couldn't have kept him off the Stone much longer --\"  \"Not the Stone, boy, you -- the effort involved nearly killed you. For one terrible moment there, I was afraid it had. As for the Stone, it has been destroyed.\"  \"Destroyed?\" said Harry blankly. \"But your friend -- Nicolas Flamel --\"  \"Oh, you know about Nicolas?\" said Dumbledore, sounding quite delighted. \"You did do the thing properly, didn't you? Well, Nicolas and I have had a little chat, and agreed it's all for the best.\"  \"But that means he and his wife will die, won't they?\"  \"They have enough Elixir stored to set their affairs in order and then, yes, they will die.\"  Dumbledore smiled at the look of amazement on Harry's face.  \"To one as young as you, I'm sure it seems incredible, but to Nicolas and Perenelle, it really is like going to bed after a very, very long day. After all, to the well-organized mind, death is but the next great adventure. You know, the Stone was really not such a wonderful thing. As much money and life as you could want! The two things most human beings would choose above all -- the trouble is, humans do have a knack of choosing precisely those things that are worst for them.\" Harry lay there, lost for words. Dumbledore hummed a little and smiled at the ceiling.  \"Sir?\" said Harry. \"I've been thinking... sir -- even if the Stone's gone, Vol-, I mean, You-Know- Who --\"  \"Call him Voldemort, Harry. Always use the proper name for things. Fear of a name increases fear of the thing itself.\"  \"Yes, sir. Well, Voldemort's going to try other ways of coming back, isn't he? I mean, he hasn't gone, has he?\"  \"No, Harry, he has not. He is still out there somewhere, perhaps looking for another body to share... not being truly alive, he cannot be killed. He left Quirrell to die; he shows just as little mercy to his followers as his enemies. Nevertheless, Harry, while you may only have delayed his return to power, it will merely take someone else who is prepared to fight what seems a losing battle next time -- and if he is delayed again, and again, why, he may never return to power.\"  Harry nodded, but stopped quickly, because it made his head hurt. Then he said, \"Sir, there are some other things I'd like to know, if you can tell me... things I want to know the truth about....\"  \"The truth.\" Dumbledore sighed. \"It is a beautiful and terrible thing, and should therefore be treated with great caution. However, I shall answer your questions unless I have a very good reason not to, in which case I beg you'll forgive me. I shall not, of course, lie.\"  \"Well... Voldemort said that he only killed my mother because she tried to stop him from killing me. But why would he want to kill me in the first place?\"  Dumbledore sighed very deeply this time.  \"Alas, the first thing you ask me, I cannot tell you. Not today. Not now. You will know, one day... put it from your mind for now, Harry. When you are older... I know you hate to hear this... when you are ready, you will know.\"  And Harry knew it would be no good to argue.  \"But why couldn't Quirrell touch me?\"  \"Your mother died to save you. If there is one thing Voldemort cannot understand, it is love. He didn't realize that love as powerful as your mother's for you leaves its own mark. Not a scar, no visible sign... to have been loved so deeply, even though the person who loved us is gone, will give us some protection forever. It is in your very skin. Quirrell, full of hatred, greed, and ambition, sharing his soul with Voldemort, could not touch you for this reason. It was agony to touch a person marked by something so good.\"  Dumbledore now became very interested in a bird out on the windowsill, which gave Harry time to dry his eyes on the sheet. When he had found his voice again, Harry said, \"And the invisibility cloak - do you know who sent it to me?\"  \"Ah - your father happened to leave it in my possession, and I thought you might like it.\" Dumbledore's eyes twinkled. \"Useful things... your father used it mainly for sneaking off to the kitchens to steal food when he was here.\"  \"And there's something else...\"  \"Fire away.\"  \"Quirrell said Snape --\"  \"Professor Snape, Harry.\" \"Yes, him -- Quirrell said he hates me because he hated my father. Is that true?\"  \"Well, they did rather detest each other. Not unlike yourself and Mr. Malfoy. And then, your father did something Snape could never forgive.\"  \"What?\"  \"He saved his life.\"  \"What?\"  \"Yes...\" said Dumbledore dreamily. \"Funny, the way people's minds work, isn't it? Professor Snape couldn't bear being in your father's debt.... I do believe he worked so hard to protect you this year because he felt that would make him and your father even."
}