{
  "id": "146029888f79fc7bd3f339497c063a7fc16e7659",
  "text": "  \"On my whistle,\" said Madam Hooch. \"Three ... two ... one. . .  With a roar from the crowd to speed them upward, the fourteen players rose toward the leaden sky. Harry flew higher than any of them, squinting around for the Snitch.  *167*  \"All right there, Scarhead?\" yelled Malfoy, shooting underneath him as though to show off the speed of his broom.  Harry had no time to reply. At that very moment, a heavy black Bludger came pelting toward him; he avoided it so narrowly that he felt it ruffle his hair as it passed.  \"Close one, Harry!\" said George, streaking past him with his club in his hand, ready to knock the Bludger back toward a Slytherin. Harry saw George give the Bludger a powerful whack in the direction of Adrian Pucey, but the Bludger changed direction in midair and shot straight for Harry again.  Harry dropped quickly to avoid it, and George managed to hit it hard toward Malfoy. Once again, the Bludger swerved like a boomerang and shot at Harry's head.  Harry put on a burst of speed and zoomed toward the other end of the pitch. He could hear the Bludger whistling along behind him. What was going on? Bludgers never concentrated on one player like this; it was their job to try and unseat as many people as possible ....  Fred Weasley was waiting for the Bludger at the other end. Harry ducked as Fred swung at the Bludger with all his might; the Bludger was knocked off course.  \"Gotcha!\" Fred yelled happily, but he was wrong; as though it was magnetically attracted to Harry, the Bludger pelted after him once more and Harry was forced to fly off at full speed.  It had started to rain; Harry felt heavy drops fall onto his face, splattering onto his glasses. He didn't have a clue what was going on in the rest of the game until he heard Lee Jordan, who was commentating, say, \"Slytherin lead, sixty points to zero ='  *168*  The Slytherins' superior brooms were clearly doing their jobs, and meanwhile the mad Bludger was doing all it could to knock Harry out of the air. Fred and George were now flying so close to him on either side that Harry could see nothing at all except their flailing arms and had no chance to look for the Snitch, let alone catch it.  \"Someone's - tampered - with - this - Bludger -\" Fred grunted, swinging his bat with all his might at it as it launched a new attack on Harry.  \"We need time out,\" said George, trying to signal to Wood and stop the Bludger breaking Harry's nose at the same time.  Wood had obviously got the message. Madam Hooch's whistle rang out and Harry, Fred, and George dived for the ground, still trying to avoid the mad Bludger.  \"What's going on?\" said Wood as the Gryffindor team huddled together, while Slytherins in the crowd jeered. \"We're being flattened. Fred, George, where were you when that Bludger stopped Angelina scoring?\"  \"We were twenty feet above her, stopping the other Bludger from murdering Harry, Oliver,\" said George angrily. \"Someone's fixed it - it won't leave Harry alone. It hasn't gone for anyone else all game. The Slytherins must have done something to it.\"  \"But the Bludgers have been locked in Madam Hooch's office since our last practice, and there was nothing wrong with them then . . . . \" said Wood, anxiously.  Madam Hooch was walking toward them. Over her shoulder, Harry could see the Slytherin team jeering and pointing in his direction.  169  \"Listen,\" said Harry as she came nearer and nearer, \"with you two flying around me all the time the only way I'm going to catch the Snitch is if it flies up my sleeve. Go back to the rest of the team and let me deal with the rogue one.\"  \"Don't be thick,\" said Fred. \"It'll take your head off.\"  Wood was looking from Harry to the Weasleys.  (I Oliver, this is insane,\" said Alicia Spinner angrily. \"You can't let Harry deal with that thing on his own. Let's ask for an inquiry -))  \"If we stop now, we'll have to forfeit the match!\" said Harry. \"And we're not losing to Slytherin just because of a crazy Bludger! Come on, Oliver, tell them to leave me alone!\"  \"This is all your fault,\" George said angrily to Wood. \" `Get the Snitch or die trying,' what a stupid thing to tell him -\"  Madam Hooch had joined them.  \"Ready to resume play?\" she asked Wood.  Wood looked at the determined look on Harry's face.  \"All right,\" he said. \"Fred, George, you heard Harry -leave him alone and let him deal with the Bludger on his own.\"  The rain was falling more heavily now. On Madam Hooch's whistle, Harry kicked hard into the air and heard the telltale whoosh of the Bludger behind him. Higher and higher Harry climbed; he looped and swooped, spiraled, zigzagged, and rolled. Slightly dizzy, he nevertheless kept his eyes wide open, rain was speckling his glasses and ran up his nostrils as he hung upside down, avoiding another fierce dive from the Bludger. He could hear laughter from the crowd; he knew he must look very stupid, but the rogue Bludger was heavy and couldn't change direction as quickly as Harry could; he began a kind of roller-coaster ride around the  *170*  edges of the stadium, squinting through the silver sheets of rain to the Gryffindor goal posts, where Adrian Pucey was trying to get past Wood  A whistling in Harry's ear told him the Bludger had just missed him again; he turned right over and sped in the opposite direction."
}