{
  "id": "147a36735963b3f0dba41ea40801d10f2b176121",
  "text": " That seems singularly cruel. Even for you, Father.    Why, do you plan to mistreat her?  His father sounded more curious than concerned.  The girl’s happiness is not my purpose, nor should it be yours. Our alliances in the south may be as solid as Casterly Rock, but there remains the north to win, and the key to the north is Sansa Stark.    She is no more than a child.    Your sister swears she’s flowered. If so, she is a woman, fit to be wed. You must needs take her maidenhead, so no man can say the marriage was not consummated. After that, if you prefer to wait a year or two before bedding her again, you would be within your rights as her husband.   Shae is all the woman I need just now, he thought, and Sansa’s a girl, no matter what you say.  If your purpose here is to keep her from the Tyrells, why not return her to her mother? Perhaps that would convince Robb Stark to bend the knee.   Lord Tywin’s look was scornful.  Send her to Riverrun and her mother will match her with a Blackwood or a Mallister to shore up her son’s alliances along the Trident. Send her north, and she will be wed to some Manderly or Umber before the moon turns. Yet she is no less dangerous here at court, as this business with the Tyrells should prove. She must marry a Lannister, and soon.    The man who weds Sansa Stark can claim Winterfell in her name,  his uncle Kevan put in.  Had that not occurred to you?    If you will not have the girl, we shall give her to one of your cousins,  said his father.  Kevan, is Lancel strong enough to wed, do you think?   Ser Kevan hesitated.  If we bring the girl to his bedside, he could say the words… but to consummate, no… I would suggest one of the twins, but the Starks hold them both at Riverrun. They have Genna’s boy Tion as well, else he might serve.   Tyrion let them have their byplay; it was all for his benefit, he knew. Sansa Stark, he mused. Soft-spoken sweet-smelling Sansa, who loved silks, songs, chivalry and tall gallant knights with handsome faces. He felt as though he was back on the bridge of boats, the deck shifting beneath his feet.   You asked me to reward you for your efforts in the battle,  Lord Tywin reminded him forcefully.  This is a chance for you, Tyrion, the best you are ever likely to have.  He drummed his fingers impatiently on the table.  I once hoped to marry your brother to Lysa Tully, but Aerys named Jaime to his Kingsguard before the arrangements were complete. When I suggested to Lord Hoster that Lysa might be wed to you instead, he replied that he wanted a whole man for his daughter.   So he wed her to Jon Arryn, who was old enough to be her grandfather. Tyrion was more inclined to be thankful than angry, considering what Lysa Arryn had become.   When I offered you to Dorne I was told that the suggestion was an insult,  Lord Tywin continued.  In later years I had similar answers from Yohn Royce and Leyton Hightower. I finally stooped so low as to suggest you might take the Florent girl Robert deflowered in his brother’s wedding bed, but her father preferred to give her to one of his own household knights.   If you will not have the Stark girl, I shall find you another wife. Somewhere in the realm there is doubtless some little lordling who’d gladly part with a daughter to win the friendship of Casterly Rock. Lady Tanda has offered Lollys…   Tyrion gave a shudder of dismay.  I’d sooner cut it off and feed it to the goats.    Then open your eyes. The Stark girl is young, nubile, tractable, of the highest birth, and still a maid. She is not uncomely. Why would you hesitate?   Why indeed?  A quirk of mine. Strange to say, I would prefer a wife who wants me in her bed.    If you think your whores want you in their bed, you are an even greater fool than I suspected,  said Lord Tywin.  You disappoint me, Tyrion. I had hoped this match would please you.    Yes, we all know how important my pleasure is to you, Father. But there’s more to this. The key to the north, you say? The Greyjoys hold the north now, and King Balon has a daughter. Why Sansa Stark, and not her?  He looked into his father’s cool green eyes with their bright flecks of gold.  Lord Tywin steepled his fingers beneath his chin.  Balon Greyjoy thinks in terms of plunder, not rule. Let him enjoy an autumn crown and suffer a northern winter. He will give his subjects no cause to love him. Come spring, the northmen will have had a bellyful of krakens. When you bring Eddard Stark’s grandson home to claim his birthright, lords and little folk alike will rise as one to place him on the high seat of his ancestors. You are capable of getting a woman with child, I hope?    I believe I am,  he said, bristling.  I confess, I cannot prove it. Though no one can say I have not tried. Why, I plant my little seeds just as often as I can…    In the gutters and the ditches,  finished Lord Tywin,  and in common ground where only bastard weeds take root. It is past time you kept your own garden.  He rose to his feet.  You shall never have Casterly Rock, I promise you."
}