{
  "id": "15e57c874b39c796bb92ed045c8ead05da86efc8",
  "text": "  Bilbo  tried  flapping his hand in front of his nose, but he could not see it at all. Well, perhaps it   ####-is  not  true  to  say  that  they  could  see  nothing:  they  could  see  eyes. They  slept  all  closely  huddled  together,  and  took  it  in  turns  to  watch;  and  when  it  was  Bilbo's  turn  he  would  see  gleams  in  the  darkness  round  them,  and  sometimes  pairs  of  yellow  or  red  or  green  eyes  would  stare  at  him  from  a  little  distance,  and  then  slowly  fade  and  disappear  and  slowly  shine  out  again  in  another  place.  And  sometimes  they  would  gleam  down  from  the  branches  just  above  him;  and  that  was most terrifying. But the eyes that he liked the least were horrible pale bulbous  sort  of  eyes.  \"Insect  eyes\"  he  thought,  \"not  animal  eyes,  only  they  are  much  too  big.\"  Although  it was  not  yet  very  cold,  they  tried  lighting watch-fires at night, but  they  soon  gave  that  up.  It  seemed  to  bring  hundreds  and  hundreds  of  eyes  all  round  them,  though  the  creatures,  whatever  they  were,  were  careful  never  to  let  their bodies show in the little flicker of the flames. Worse still it brought thousands  of  dark-grey  and  black  moths,  some  nearly  as  big  as  your  hand,  flapping  and  whirring  round their ears. They could not stand that, nor the huge bats, black as a  top-hat,  either;  so  they  gave  up  fires  and  sat  at  night  and  dozed  in  the  enormous  uncanny darkness.  All  this  went  on  for  what  seemed  to  the  hobbit  ages  upon  ages;  and  he  was  always  hungry,  for  they were extremely careful with  their provisions. Even  so, as  days  followed  days,  and  still  the  forest  seemed  just  the  same,  they  began  to  get  anxious. The  food would not  last  for  ever:  it was  in  fact  already beginning  to get  low. They tried shooting at the squirrels, and they wasted many arrows before they  managed  to  bring  one  down  on  the  path.  But  when  they  roasted  it,  it  proved  horrible to taste, and they shot no more squirrels.  They  were  thirsty  too,  for  they  had  none  too  much  water,  and  in  all  the  time  they  had  seen  neither  spring  nor  stream.  This  was  their  state  when  one  day  they  found their path blocked by a running water. It flowed fast and strong but not very  wide right across  the way, and  it was black, or  looked  it  in  the gloom. It was well  that  Beorn  had  warned  them  against  it,  or  they  would  have  drunk  from  it,  whatever  its  colour,  and  filled  some  of  their  emptied  skins  at  its  bank. As  it was  they only thought of how to cross it without wetting themselves in its water. There  had  been  a  bridge  of  wood  across,  but  it  had  rotted  and  fallen  leaving  only  the  broken posts near the bank.  Bilbo kneeling on the brink and peering forward cried: \"There is a boat against  the far bank! Now why couldn't it have been this side!\"  \"How far away do you think it is?\" asked Thorin, for by now they knew Bilbo  had the sharpest eyes among them.   ####-\"Not at all far. I shouldn't think above twelve yards.\"  \"Twelve  yards!  I  should  have  thought  it was  thirty  at  least,  but my  eyes  don't  see  as  well  as  they  used  a  hundred  years  ago.  Still  twelve  yards  is  as  good  as  a  mile. We can't jump it, and we daren't try to wade or swim.\"  \"Can any of you throw a rope?\"  \"What's the good of that? The boat is sure to be tied up, even if we could hook  it, which I doubt.\"  \"I  don't  believe  it  is  tied,\"  said Bilbo,  \"though of  course  I  can't be  sure  in  this  light;  but  it  looks  to me  as  if  it was  just  drawn  up  on  the  bank, which  is  low  just  there where the path goes down into the water.\"  \"Dori is the strongest, but Fili is the youngest and still  has the best sight,\" said  Thorin.  \"Come  here  Fili,  and  see  if  you  can  see  the  boat  Mr.  Baggins  is  talking  about.\"  Fili thought he could; so when he had stared a long while to get an idea of the  direction,  the  others  brought  him  a  rope.  They  had  several with  them, and on  the  end  of  the  longest  they  fastened  one  of  the  large  iron  hooks  they  had  used  for  catching  their packs  to  the  straps  about  their  shoulders. Fili  took  this  in his hand,  balanced it for a moment, and then flung it across the stream.  Splash  it  fell  in  the  water!  \"Not  far  enough!\"  said  Bilbo  who  was  peering  forward.  \"A  couple  of  feet  and  you  would  have  dropped  it  on  to  the  boat.  Try  again.  I don't  suppose  the magic  is  strong  enough  to hurt you,  if you  just  touch  a  bit of wet rope.\"  Fili  picked  up  the  hook when  he  had  drawn  it  back,  rather  doubtfully  all  the  same. This time he threw it with greater strength.  \"Steady!\" said Bilbo, \"you have thrown it right into the wood on the other side  now.  Draw  it  back  gently.\"  Fili  hauled  the  rope  back  slowly,  and  after  a  while  Bilbo said:  \"Carefully! It is lying on the boat; let's hope the hook will catch."
}