{
  "id": "15eb8011fc7fb6ad0c4de88f5aa74c5c7da2ab0e",
  "text": " I know wood and rope and water, yes, but how will that serve me now? Where do I find the wind to blow King Stannis to his throne?   The maester laughed at that.  And there you have it, my lord. Words are wind, you know, and you’ve blown mine away with your good sense. His Grace knows what he has in you, I think.    Onions,  said Davos glumly.  That is what he has in me. The King’s Hand should be a highborn lord, someone wise and learned, a battle commander or a great knight…    Ser Ryam Redwyne was the greatest knight of his day, and one of the worst Hands ever to serve a king. Septon Murmison’s prayers worked miracles, but as Hand he soon had the whole realm praying for his death. Lord Butterwell was renowned for wit, Myles Smallwood for courage, Ser Otto Hightower for learning, yet they failed as Hands, every one. As for birth, the dragonkings oft chose Hands from amongst their own blood, with results as various as Baelor Breakspear and Maegor the Cruel. Against this, you have Septon Barth, the blacksmith’s son the Old King plucked from the Red Keep’s library, who gave the realm forty years of peace and plenty.  Pylos smiled.  Read your history, Lord Davos, and you will see that your doubts are groundless.    How can I read history, when I cannot read?    Any man can read, my lord,  said Maester Pylos.  There is no magic needed, nor high birth, I am teaching the art to your son, at the king’s command. Let me teach you as well.   It was a kindly offer, and not one that Davos could refuse. And so every day he repaired to the maester’s chambers high atop Sea Dragon Tower, to frown over scrolls and parchments and great leather tomes and try to puzzle out a few more words. His efforts often gave him headaches, and made him feel as big a fool as Patchface besides. His son Devan was not yet twelve, yet he was well ahead of his father, and for Princess Shireen and Edric Storm reading seemed as natural as breathing. When it came to books, Davos was more a child than any of them. Yet he persisted. He was the King’s Hand now, and a King’s Hand should read.  The narrow twisting steps of Sea Dragon Tower had been a sore trial to Maester Cressen after he broke his hip. Davos still found himself missing the old man. He thought Stannis must as well. Pylos seemed clever and diligent and well-meaning, but he was so young, and the king did not confide in him as he had in Cressen. The old man had been with Stannis so long… Until he ran afoul of Melisandre, and died for it.  At the top of the steps Davos heard a soft jingle of bells that could only herald Patchface. The princess’s fool was waiting outside the maester’s door for her like a faithful hound. Dough-soft and slump-shouldered, his broad face tattooed in a motley pattern of red and green squares, Patchface wore a helm made of a rack of deer antlers strapped to a tin bucket. A dozen bells hung from the tines and rang when he moved… which meant constantly, since the fool seldom stood still. He jingled and jangled his way everywhere he went; small wonder that Pylos had exiled him from Shireen’s lessons.  Under the sea the old fish eat the young fish,  the fool muttered at Davos. He bobbed his head, and his bells clanged and chimed and sang.  I know, I know, oh oh oh.    Up here the young fish teach the old fish,  said Davos, who never felt so ancient as when he sat down to try and read. It might have been different if aged Maester Cressen had been the one teaching him, but Pylos was young enough to be his son.  He found the maester seated at his long wooden table covered with books and scrolls, across from the three children. Princess Shireen sat between the two boys. Even now Davos could take great pleasure in the sight of his own blood keeping company with a princess and a king’s bastard. Devan will be a lord now, not merely a knight. The Lord of the Rainwood. Davos took more pride in that than in wearing the title himself. He reads too. He reads and he writes, as if he had been born to it. Pylos had naught but praise for his diligence, and the master-at-arms said Devan was showing promise with sword and lance as well. And he is a godly lad, too.  My brothers have ascended to the Hall of Light, to sit beside the Lord,  Devan had said when his father told him how his four elder brothers had died.  I will pray for them at the nightfires, and for you as well, Father, so you might walk in the Light of the Lord till the end of your days.    Good morrow to you, Father,  the boy greeted him. He looks so much like Dale did at his age, Davos thought. His eldest had never dressed so fine as Devan in his squire’s raiment, to be sure, but they shared the same square plain face, the same forthright brown eyes, the same thin brown flyaway hair. Devan’s cheeks and chin were dusted with blond hair, a fuzz that would have shamed a proper peach, though the boy was fiercely proud of his  beard.  Just as Dale was proud of his, once. Devan was the oldest of the three children at the table."
}