{
  "id": "15f37d8b6a48bae6b7ab7c9a0c8f87dbbb87a3f8",
  "text": "  The mountain is your mother,  Stonesnake had told him during an easier climb a few days past.  Cling to her, press your face up against her teats, and she won’t drop you.  Jon had made a joke of it, saying how he’d always wondered who his mother was, but never thought to find her in the Frostfangs. It did not seem nearly so amusing now. One step and then another, he thought, clinging tight.  The narrow track ended abruptly where a massive shoulder of black granite thrust out from the side of the mountain. After the bright moonlight, its shadow was so black that it felt like stepping into a cave.  Straight up here,  the ranger said in a quiet voice.  We want to get above them.  He peeled off his gloves, tucked them through his belt, tied one end of his rope around his waist, the other end around Jon.  Follow me when the rope grows taut.  The ranger did not wait for an answer but started at once, moving upward with fingers and feet, faster than Jon would have believed. The long rope unwound slowly. Jon watched him closely, making note of how he went, and where he found each handhold, and when the last loop of hemp uncoiled, he took off his own gloves and followed, much more slowly.  Stonesnake had passed the rope around the smooth spike of rock he was waiting on, but as soon as Jon reached him he shook it loose and was off again. This time there was no convenient cleft when he reached the end of their tether, so he took out his felt-headed hammer and drove a spike deep into a crack in the stone with a series of gentle taps. Soft as the sounds were, they echoed off the stone so loudly that Jon winced with every blow, certain that the wildlings must hear them too. When the spike was secure, Stonesnake secured the rope to it, and Jon started after him. Suck on the mountain’s teat, he reminded himself. Don’t look down. Keep your weight above your feet. Don’t look down. Look at the rock in front of you. There’s a good handhold, yes. Don’t look down. I can catch a breath on that ledge there, all I need to do is reach it. Never look down.  Once his foot slipped as he put his weight on it and his heart stopped in his chest, but the gods were good and he did not fall. He could feel the cold seeping off the rock into his fingers, but he dared not don his gloves; gloves would slip, no matter how tight they seemed, cloth and fur moving between skin and stone, and up here that could kill him. His burned hand was stiffening up on him, and soon it began to ache. Then he ripped open his thumbnail somehow, and after that he left smears of blood wherever he put his hand. He hoped he still had all his fingers by the end of the climb.  Up they went, and up, and up, black shadows creeping across the moonlit wall of rock. Anyone down on the floor of the pass could have seen them easily, but the mountain hid them from the view of the wildlings by their fire. They were close now, though. Jon could sense it. Even so, he did not think of the foes who were waiting for him, all unknowing, but of his brother at Winterfell. Bran used to love to climb. I wish I had a tenth part of his courage.  The wall was broken two-thirds of the way up by a crooked fissure of icy stone. Stonesnake reached down a hand to help him up. He had donned his gloves again, so Jon did the same. The ranger moved his head to the left, and the two of them crawled along the shelf three hundred yards or more, until they could see the dull orange glow beyond the lip of the cliff.  The wildlings had built their watchfire in a shallow depression above the narrowest part of the pass, with a sheer drop below and rock behind to shelter them from the worst of the wind. That same windbreak allowed the black brothers to crawl within a few feet of them, creeping along on their bellies until they were looking down on the men they must kill.  One was asleep, curled up tight and buried beneath a great mound of skins. Jon could see nothing of him but his hair, bright red in the firelight. The second sat close to the flames, feeding them twigs and branches and complaining of the wind in a querulous tone. The third watched the pass, though there was little to see, only a vast bowl of darkness ringed by the snowy shoulders of the mountains. It was the watcher who wore the horn.  Three. For a moment Jon was uncertain. There was only supposed to be two. One was asleep, though. And whether there was two or three or twenty, he still must do what he had come to do. Stonesnake touched his arm, pointed at the wildling with the horn. Jon nodded toward the one by the fire. It felt queer, picking a man to kill. Half the days of his life had been spent with sword and shield, training for this moment. Did Robb feel this way before his first battle? he wondered, but there was no time to ponder the question. Stonesnake moved as fast as his namesake, leaping down on the wildlings in a rain of pebbles. Jon slid Longclaw from its sheath and followed.  It all seemed to happen in a heartbeat. Afterward Jon could admire the courage of the wildling who reached first for his horn instead of his blade."
}