{
  "id": "1672f47bc3965e8314be78ea85ffe376ff8ca2cf",
  "text": "    Orphan boys got no fathers,  Yoren said,  or did you forget that?  The sourleaf had turned his spit red, so it looked like his mouth was bleeding.  The only wolves we got to fear are the ones wear manskin, like those who done for that village.    I wish I was home,  she said miserably. She tried so hard to be brave, to be fierce as a wolverine and all, but sometimes she felt like she was just a little girl after all.  The black brother peeled a fresh sourleaf from the bale in the wagon and stuffed it into his mouth.  Might be I should of left you where I found you, boy. All of you. Safer in the city, seems to me.    I don’t care. I want to go home.    Been bringing men to the Wall for close on thirty years.  Froth shone on Yoren’s lips, like bubbles of blood.  All that time, I only lost three. Old man died of a fever, city boy got snakebit taking a shit, and one fool tried to kill me in my sleep and got a red smile for his trouble.  He drew the dirk across his throat, to show her.  Three in thirty years.  He spat out the old sourleaf.  A ship now, might have been wiser. No chance o’ finding more men on the way, but still… clever man, he’d go by ship, but me… thirty years I been taking this kingsroad.  He sheathed his dirk.  Go to sleep, boy. Hear me?   She did try. Yet as she lay under her thin blanket, she could hear the wolves howling… and another sound, fainter, no more than a whisper on the wind, that might have been screams.      DAVOS  The morning air was dark with the smoke of burning gods.  They were all afire now, Maid and Mother, Warrior and Smith, the Crone with her pearl eyes and the Father with his gilded beard; even the Stranger, carved to look more animal than human. The old dry wood and countless layers of paint and varnish blazed with a fierce hungry light. Heat rose shimmering through the chill air; behind, the gargoyles and stone dragons on the castle walls seemed blurred, as if Davos were seeing them through a veil of tears. Or as if the beasts were trembling, stirring…   An ill thing,  Allard declared, though at least he had the sense to keep his voice low. Dale muttered agreement.   Silence,  said Davos.  Remember where you are.  His sons were good men, but young, and Allard especially was rash. Had I stayed a smuggler, Allard would have ended on the Wall. Stannis spared him from that end, something else I owe him…  Hundreds had come to the castle gates to bear witness to the burning of the Seven. The smell in the air was ugly. Even for soldiers, it was hard not to feel uneasy at such an affront to the gods most had worshiped all their lives.  The red woman walked round the fire three times, praying once in the speech of Asshai, once in High Valyrian, and once in the Common Tongue. Davos understood only the last.  R’hllor, come to us in our darkness,  she called.  Lord of Light, we offer you these false gods, these seven who are one, and him the enemy. Take them and cast your light upon us, for the night is dark and full of terrors.  Queen Selyse echoed the words. Beside her, Stannis watched impassively, his jaw hard as stone under the blue-black shadow of his tight-cropped beard. He had dressed more richly than was his wont, as if for the sept.  Dragonstone’s sept had been where Aegon the Conqueror knelt to pray the night before he sailed. That had not saved it from the queen’s men. They had overturned the altars, pulled down the statues, and smashed the stained glass with warhammers. Septon Barre could only curse them, but Ser Hubard Rambton led his three sons to the sept to defend their gods. The Rambtons had slain four of the queen’s men before the others overwhelmed them. Afterward Guncer Sunglass, mildest and most pious of lords, told Stannis he could no longer support his claim. Now he shared a sweltering cell with the septon and Ser Hubard’s two surviving sons. The other lords had not been slow to take the lesson.  The gods had never meant much to Davos the smuggler, though like most men he had been known to make offerings to the Warrior before battle, to the Smith when he launched a ship, and to the Mother whenever his wife grew great with child. He felt ill as he watched them burn, and not only from the smoke.  Maester Cressen would have stopped this. The old man had challenged the Lord of Light and been struck down for his impiety, or so the gossips told each other. Davos knew the truth. He had seen the maester slip something into the wine cup. Poison. What else could it be? He drank a cup of death to free Stannis from Melisandre, but somehow her god shielded her. He would gladly have killed the red woman for that, yet what chance would he have where a maester of the Citadel had failed? He was only a smuggler raised high, Davos of Flea Bottom, the Onion Knight.  The burning gods cast a pretty light, wreathed in their robes of shifting flame, red and orange and yellow. Septon Barre had once told Davos how they’d been carved from the masts of the ships that had carried the first Targaryens from Valyria."
}