{
  "id": "16731dd15bfc3c4898874d8b245cf5ef78fe2f3c",
  "text": "  He could feel the high stone calling him. Up he went, loping easy at first, then faster and higher, his strong legs eating up the incline. Birds burst from the branches overhead as he raced by, clawing and flapping their way into the sky. He could hear the wind sighing up amongst the leaves, the squirrels chittering to one another, even the sound a pinecone made as it tumbled to the forest floor. The smells were a song around him, a song that filled the good green world.  Gravel flew from beneath his paws as he gained the last few feet to stand upon the crest. The sun hung above the tall pines huge and red, and below him the trees and hills went on and on as far as he could see or smell. A kite was circling far above, dark against the pink sky.  Prince. The man-sound came into his head suddenly, yet he could feel the rightness of it. Prince of the green, prince of the wolfswood. He was strong and swift and fierce, and all that lived in the good green world went in fear of him.  Far below, at the base of the woods, something moved amongst the trees. A flash of grey, quick-glimpsed and gone again, but it was enough to make his ears prick up. Down there beside a swift green brook, another form slipped by, running. Wolves, he knew. His little cousins, chasing down some prey. Now the prince could see more of them, shadows on fleet grey paws. A pack.  He had a pack as well, once. Five they had been, and a sixth who stood aside. Somewhere down inside him were the sounds the men had given them to tell one from the other, but it was not by their sounds he knew them. He remembered their scents, his brothers and his sisters. They all had smelled alike, had smelled of pack, but each was different too.  His angry brother with the hot green eyes was near, the prince felt, though he had not seen him for many hunts. Yet with every sun that set he grew more distant, and he had been the last. The others were far scattered, like leaves blown by the wild wind.  Sometimes he could sense them, though, as if they were still with him, only hidden from his sight by a boulder or a stand of trees. He could not smell them, nor hear their howls by night, yet he felt their presence at his back… all but the sister they had lost. His tail drooped when he remembered her. Four now, not five. Four and one more, the white who has no voice.  These woods belonged to them, the snowy slopes and stony hills, the great green pines and the golden leaf oaks, the rushing streams and blue lakes fringed with fingers of white frost. But his sister had left the wilds, to walk in the halls of man-rock where other hunters ruled, and once within those halls it was hard to find the path back out. The wolf prince remembered.  The wind shifted suddenly.  Deer, and fear, and blood. The scent of prey woke the hunger in him. The prince sniffed the air again, turning, and then he was off, bounding along the ridgetop with jaws half-parted. The far side of the ridge was steeper than the one he’d come up, but he flew surefoot over stones and roots and rotting leaves, down the slope and through the trees, long strides eating up the ground. The scent pulled him onward, ever faster.  The deer was down and dying when he reached her, ringed by eight of his small grey cousins. The heads of the pack had begun to feed, the male first and then his female, taking turns tearing flesh from the red underbelly of their prey. The others waited patiently, all but the tail, who paced in a wary circle a few strides from the rest, his own tail tucked low. He would eat the last of all, whatever his brothers left him.  The prince was downwind, so they did not sense him until he leapt up upon a fallen log six strides from where they fed. The tail saw him first, gave a piteous whine, and slunk away. His pack brothers turned at the sound and bared their teeth, snarling, all but the head male and female.  The direwolf answered the snarls with a low warning growl and showed them his own teeth. He was bigger than his cousins, twice the size of the scrawny tail, half again as large as the two pack heads. He leapt down into their midst, and three of them broke, melting away into the brush. Another came at him, teeth snapping. He met the attack head on, caught the wolf’s leg in his jaws when they met, and flung him aside yelping and limping.  And then there was only the head wolf to face, the great grey male with his bloody muzzle fresh from the prey’s soft belly. There was white on his muzzle as well, to mark him as an old wolf, but when his mouth opened, red slaver ran from his teeth.  He has no fear, the prince thought, no more than me. It would be a good fight. They went for each other.  Long they fought, rolling together over roots and stones and fallen leaves and the scattered entrails of the prey, tearing at each other with tooth and claw, breaking apart, circling each round the other, and bolting in to fight again. The prince was larger, and much the stronger, but his cousin had a pack. The female prowled around them closely, snuffing and snarling, and would interpose herself whenever her mate broke off bloodied."
}