{
  "id": "167ff3f139cc295847c36c4cf67417a4b9a3ca95",
  "text": " It bowed to each of the four tables and then became quite still again.  \"So we've just got to try on the hat!\" Ron whispered to Harry. \"I'll kill Fred, he was going on about wrestling a troll.\"  Harry. smiled weakly. Yes, trying on the hat was a lot better than having to do a spell, but he did wish they could have tried it on without everyone watching. The hat seemed to be asking rather alot; Harry didn't feel brave or quick-witted or any of it at the moment. If only the hat had mentioned a house for people who felt a bit queasy, that would have been the one for him.  Professor McGonagall now stepped forward holding a long roll of parchment.  \"When I call your name, you will put on the hat and sit on the stool to be sorted,\" she said. \"Abbott, Hannah!\"  A pink-faced girl with blonde pigtails stumbled out of line, put on the hat, which fell right down over her eyes, and sat down. A moments pause --  \"HUFFLEPUFF!\" shouted the hat.  The table on the right cheered and clapped as Hannah went to sit down at the Hufflepuff table. Harry saw the ghost of the Fat Friar waving merrily at her.  \"Bones, Susan!\"  \"HUFFLEPUFF!\" shouted the hat again, and Susan scuttled off to sit next to Hannah.  \"Boot, Terry!\"  \"RAVENCLAW!\"  The table second from the left clapped this time; several Ravenclaws stood up to shake hands with Terry as he joined them.  \" Brocklehurst, Mandy\" went to Ravenclaw too, but \"Brown, Lavender\" became the first new Gryffindor, and the table on the far left exploded with cheers; Harry could see Ron's twin brothers catcalling.  \"Bulstrode, Millicent\" then became a Slytherin. Perhaps it was Harry's imagination, after all he'd heard about Slytherin, but he thought they looked like an unpleasant lot. He was starting to feel definitely sick now. He remembered being picked for teams during gym at his old school. He had always been last to be chosen, not because he was no good, but because no one wanted Dudley to think they liked him.  \"Finch-Fletchley, Justin!\"  \"HUFFLEPUFF!\"  Sometimes, Harry noticed, the hat shouted out the house at once, but at others it took a little while to decide. \"Finnigan, Seamus,\" the sandy-haired boy next to Harry in the line, sat on the stool for almost a whole minute before the hat declared him a Gryffindor.  \"Granger, Hermione!\"  Hermione almost ran to the stool and jammed the hat eagerly on her head.  \"GRYFFINDOR!\" shouted the hat. Ron groaned.  A horrible thought struck Harry, as horrible thoughts always do when you're very nervous. What if he wasn't chosen at all? What if he just sat there with the hat over his eyes for ages, until Professor McGonagall jerked it off his head and said there had obviously been a mistake and he'd better get back on the train?  When Neville Longbottom, the boy who kept losing his toad, was called, he fell over on his way to the stool. The hat took a long time to decide with Neville. When it finally shouted, \"GRYFFINDOR,\" Neville ran off still wearing it, and had to jog back amid gales of laughter to give it to \"MacDougal, Morag.\"  Malfoy swaggered forward when his name was called and got his wish at once: the hat had barely touched his head when it screamed, \"SLYTHERIN!\"  Malfoy went to join his friends Crabbe and Goyle, looking pleased with himself.  There weren't many people left now. \"Moon\" \"Nott\" \"Parkinson\" then a pair of twin girls, \"Patil\" and \"Patil\" then \"Perks, Sally-Anne\" and then, at last -- \"Potter, Harry!\"  As Harry stepped forward, whispers suddenly broke out like little hissing fires all over the hall.  \"Potter, did she say?\"  The Harry Potter?\"  The last thing Harry saw before the hat dropped over his eyes was the hall full of people craning to get a good look at him. Next second he was looking at the black inside of the hat. He waited.  Hmm,\" said a small voice in his ear. \"Difficult. Very difficult. Plenty of courage, I see. Not a bad mind either. There's talent, A my goodness, yes -- and a nice thirst to prove yourself, now that's interesting.... So where shall I put you?\"  Harry gripped the edges of the stool and thought, Not Slytherin, not Slytherin.  \"Not Slytherin, eh?\" said the small voice. \"Are you sure? You could be great, you know, it's all here in your head, and Slytherin will help you on the way to greatness, no doubt about that -- no? Well, if you're sure -- better be GRYFFINDOR!\"  Harry heard the hat shout the last word to the whole hall. He took off the hat and walked shakily toward the Gryffindor table. He was so relieved to have been chosen and not put in Slytherin, he hardly noticed that he was getting the loudest cheer yet. Percy the Prefect got up and shook his hand vigorously, while the Weasley twins yelled, \"We got Potter! We got Potter!\" Harry sat down opposite the ghost in the ruff he'd seen earlier. The ghost patted his arm, giving Harry the sudden, horrible feeling he'd just plunged it into a bucket of ice-cold water.  He could see the High Table properly now. At the end nearest him sat Hagrid, who caught his eye and gave him the thumbs up."
}