{
  "id": "16b3443f0da55174b48d35b9f4787957fe2d90ec",
  "text": "  At that moment there was a diversion in the form of a small, redheaded figure in a long nightdress, who appeared in the kitchen, gave a small squeal, and ran out again.  \"Ginny,\" said Ron in an undertone to Harry. \"My sister. She's been talking about you all summer.\"  \"Yeah, she'll be wanting your autograph, Harry,\" Fred said with a grin, but he caught his mother's eye and bent his face over his plate without another word. Nothing more was said until all four plates were clean, which took a surprisingly short time.  \"Blimey, I'm tired,\" yawned Fred, setting down his knife and fork at last. \"I think I'll go to bed and -\"  \"You will not,\" snapped Mrs. Weasley. \"It's your own fault you've been up all night. You're going to de-gnome the garden for me; they're getting completely out of hand again -\"  \"Oh, Mum -\"  \"And you two,\" she said, glaring at Ron and Fred. \"You can go up to bed, dear,\" she added to Harry. \"You didn't ask them to fly that wretched car -\"  But Harry, who felt wide awake, said quickly, \"I'll help Ron. I've never seen a de-gnoming -\"  \"That's very sweet of you, dear, but it's dull work,\" said Mrs. Weasley. \"Now, let's see what Lockhart's got to say on the subject -\"  And she pulled a heavy book from the stack on the mantelpiece. George groaned.  \"Mum, we know how to de-gnome a garden -\"  Harry looked at the cover of Mrs. Weasley's book. Written across it in fancy gold letters were the words Gilderoy Lockhart's Guide to Household Pests. There was a big photograph on the front of a very good- IOI)king wizard with wavy blond hair and bright blue eyes. As always in the wizarding world, the photograph was moving; the wizard, who Harry supposed was Gilderoy Lockhart, kept winking cheekily up at them all. Mrs. Weasley beamed down at him.  \"Oh, he is marvelous,\" she said. \"He knows his household pests, all right, it's a wonderful book . . . .\"  \"Mum fancies him,\" said Fred, in a very audible whisper.  \"Don't be so ridiculous, Fred,\" said Mrs. Weasley, her cheeks rather pink. \"All right, if you think you know better than Lockhart, you can go and get on with it, and woe betide you if there's a single gnome in that garden when I come out to inspect it.\"  Yawning and grumbling, the Weasleys slouched outside with Harry behind them. The garden was large, and in Harry's eyes, exactlY what a garden should be. The Dursleys wouldn't have liked it - there were plenty of weeds, and the grass needed cutting but there were gnarled trees all around the walls, plants Harry had never seen spilling from every flower bed, and a big green pond full of frogs.  \"Muggles have garden gnomes, too, you know,\" Harry told Ron  they crossed the lawn.  \"Yeah, I've seen those things they think are gnomes,\" said Ron, bent double with his head in a peony bush, \"like fat little Santa Clauses with fishing rods . . . .\"  There was a violent scuffling noise, the peony bush shuddered, and Ron straightened up. \"This is a gnome,\" he said grimly.  \"Gerroff me! Gerroff me!\" squealed the gnome.  It was certainly nothing like Santa Claus. It was small and leathery looking, with a large, knobby, bald head exactly like a potato. Ron held it at arm's length as it kicked out at him with its horny little feet; he grasped it around the ankles and turned it upside down.  \"This is what you have to do,\" he said. He raised the gnome above his head (\"Gerroff me!\") and started to swing it in great circles like a lasso. Seeing the shocked look on Harry's face, Ron added, \"It doesn't hurt them - you've just got to make them really dizzy so they can't find their way back to the gnomeholes.\"  He let go of the gnome's ankles: It flew twenty feet into the air and landed with a thud in the field over the hedge.  \"Pitiful,\" said Fred. \"I bet I can get mine beyond that stump.\"  Harry learned quickly not to feel too sorry for the gnomes. He decided just to drop the first one he caught over the hedge, but the gnome, sensing weakness, sank its razor-sharp teeth into Harry's finger and he had a hard job shaking it off - until  \"Wow, Harry - that must've been fifty feet ......  The air was soon thick with flying gnomes.  \"See, they're not too bright,\" said George, seizing five or six gnomes at once. \"The moment they know the de-gnoming's going on they storm up to have a look. You'd think they'd have learned by now just to stay put.\"  Soon, the crowd of gnomes in the field started walking away in a straggling line, their little shoulders hunched.  \"They'll be back,\" said Ron as they watched the gnomes disappear into the hedge on the other side of the field. \"They love it here .... Dad's too soft with them; he thinks they're funny . . . .\"  Just then, the front door slammed.  \"He's back!\" said George. \"Dad's home!\"  They hurried through the garden and back into the house.  Mr. Weasley was slumped in a kitchen chair with his glasses off and his eyes closed. He was a thin man, going bald, but the little hair he had was as red as any of his children's. He was wearing long green robes, which were dusty and travel-worn."
}