{
  "id": "171a9ddd25c70c2f70cfb66a986fdf7f1af26f53",
  "text": "   Hot Pie’s eyes got wide.  There’s ghosts in Harrenhal…   Yoren spat.  There’s for your ghosts.  He tossed the stick down in the mud.  Mount up.   Arya was remembering the stories Old Nan used to tell of Harrenhal. Evil King Harren had walled himself up inside, so Aegon unleashed his dragons and turned the castle into a pyre. Nan said that fiery spirits still haunted the blackened towers. Sometimes men went to sleep safe in their beds and were found dead in the morning, all burnt up. Arya didn’t really believe that, and anyhow it had all happened a long time ago. Hot Pie was being silly; it wouldn’t be ghosts at Harrenhal, it would be knights. Arya could reveal herself to Lady Whent, and the knights would escort her home and keep her safe. That was what knights did; they kept you safe, especially women. Maybe Lady Whent would even help the crying girl.  The river track was no kingsroad, yet it was not half bad for what it was, and for once the wagons rolled along smartly. They saw the first house an hour shy of evenfall, a snug little thatch-roofed cottage surrounded by fields of wheat. Yoren rode out ahead, hallooing, but got no answer.  Dead, might be. Or hiding. Dobber, Rey, with me.  The three men went into the cottage.  Pots is gone, no sign o’ any coin laid by,  Yoren muttered when they returned.  No animals. Run, most like. Might be we met ‘em on the kingsroad.  At least the house and field had not been burned, and there were no corpses about. Tarber found a garden out back, and they pulled some onions and radishes and filled a sack with cabbages before they went on their way.  A little farther up the road, they glimpsed a forester’s cabin surrounded by old trees and neatly stacked logs ready for the splitting, and later a ramshackle stilt-house leaning over the river on poles ten feet tall, both deserted. They passed more fields, wheat and corn and barley ripening in the sun, but here there were no men sitting in trees, nor walking the rows with scythes. Finally the town came into view; a cluster of white houses spread out around the walls of the holdfast, a big sept with a shingled wooden roof, the lord’s towerhouse sitting on a small rise to the west… and no sign of any people, anywhere.  Yoren sat on his horse, frowning through his tangle of beard.  Don’t like it,  he said,  but there it is. We’ll go have us a look. A careful look. See maybe there’s some folk hiding. Might be they left a boat behind, or some weapons we can use.   The black brother left ten to guard the wagons and the whimpery little girl, and split the rest of them into four groups of five to search the town.  Keep your eyes and ears open,  he warned them, before he rode off to the towerhouse to see if there was any sign of the lordling or his guards.  Arya found herself with Gendry, Hot Pie, and Lommy. Squat, kettle-bellied Woth had pulled an oar on a galley once, which made him the next best thing they had to a sailor, so Yoren told him to take them down to the lakefront and see if they could find a boat. As they rode between the silent white houses, gooseprickles crawled up Arya’s arms. This empty town frightened her almost as much as the burnt holdfast where they’d found the crying girl and the one-armed woman. Why would people run off and leave their homes and everything? What could scare them so much?  The sun was low to the west, and the houses cast long dark shadows. A sudden clap of sound made Arya reach for Needle, but it was only a shutter banging in the wind. After the open river shore, the closeness of the town unnerved her.  When she glimpsed the lake ahead between houses and trees, Arya put her knees into her horse, galloping past Woth and Gendry. She burst out onto the grassy sward beside the pebbled shore. The setting sun made the tranquil surface of the water shimmer like a sheet of beaten copper. It was the biggest lake she had ever seen, with no hint of a far shore. She saw a rambling inn to her left, built out over the water on heavy wooden pilings. To her right, a long pier jutted into the lake, and there were other docks farther east, wooden fingers reaching out from the town. But the only boat in view was an upside-down rowboat abandoned on the rocks beneath the inn, its bottom thoroughly rotted out.  They’re gone,  Arya said, dejected. What would they do now?   There’s an inn,  Lommy said, when the others rode up.  Do you think they left any food? Or ale?    Let’s go see,  Hot Pie suggested.   Never you mind about no inn,  snapped Woth.  Yoren said we’re to find a boat.    They took the boats.  Somehow Arya knew it was true; they could search the whole town, and they’d find no more than the upside-down rowboat. Despondent, she climbed off her horse and knelt by the lake. The water lapped softly around her legs. A few lantern bugs were coming out, their little lights blinking on and off. The green water was warm as tears, but there was no salt in it. It tasted of summer and mud and growing things. Arya plunged her face down into it to wash off the dust and dirt and sweat of the day."
}