{
  "id": "178131804c3f605896e9f668e6b50ad49f549ed2",
  "text": " You have to forgive me.    Have to?  It was too late. He should have begun by begging forgiveness. She could not pardon him as she’d intended. She had dragged the wineseller behind her horse until there was nothing left of him. Didn’t the man who brought him deserve the same? This is Jorah, my fierce bear, the right arm that never failed me. I would be dead without him, but…  I can’t forgive you,  she said.  I can’t.    You forgave the old man…    He lied to me about his name. You sold my secrets to the men who killed my father and stole my brother’s throne.    I protected you. I fought for you. Killed for you.   Kissed me, she thought, betrayed me.   I went down into the sewers like a rat. For you.   It might have been kinder if you’d died there. Dany said nothing. There was nothing to say.   Daenerys,  he said,  I have loved you.   And there it was. Three treasons will you know. Once for blood and once for gold and once for love.  The gods do nothing without a purpose, they say. You did not die in battle, so it must be they still have some use for you. But I don’t. I will not have you near me. You are banished, ser. Go back to your masters in King’s Landing and collect your pardon, if you can. Or to Astapor. No doubt the butcher king needs knights.    No.  He reached for her.  Daenerys, please, hear me…   She slapped his hand away.  Do not ever presume to touch me again, or to speak my name. You have until dawn to collect your things and leave this city. If you’re found in Meereen past break of day, I will have Strong Belwas twist your head off. I will. Believe that.  She turned her back on him, her skirts swirling. I cannot bear to see his face.  Remove this liar from my sight,  she commanded. I must not weep. I must not. If I weep I will forgive him. Strong Belwas seized Ser Jorah by the arm and dragged him out. When Dany glanced back, the knight was walking as if drunk, stumbling and slow. She looked away until she heard the doors open and close. Then she sank back onto the ebony bench. He’s gone, then. My father and my mother, my brothers, Ser Willem Darry, Drogo who was my sun-and-stars, his son who died inside me, and now Ser Jorah…   The queen has a good heart,  Daario purred through his deep purple whiskers,  but that one is more dangerous than all the Oznaks and Meros rolled up in one.  His strong hands caressed the hilts of his matched blades, those wanton golden women.  You need not even say the word, my radiance. Only give the tiniest nod, and your Daario shall fetch you back his ugly head.    Leave him be. The scales are balanced now. Let him go home.  Dany pictured Jorah moving amongst old gnarled oaks and tall pines, past flowering thornbushes, grey stones bearded with moss, and little creeks running icy down steep hillsides. She saw him entering a hall built of huge logs, where dogs slept by the hearth and the smell of meat and mead hung thick in the smoky air.  We are done for now,  she told her captains.  It was all she could do not to run back up the wide marble stairs. Irri helped her slip from her court clothes and into more comfortable garb; baggy woolen breeches, a loose felted tunic, a painted Dothraki vest.  You are trembling, Khaleesi,  the girl said as she knelt to lace up Dany’s sandals.   I’m cold,  Dany lied.  Bring me the book I was reading last night.  She wanted to lose herself in the words, in other times and other places. The fat leather-bound volume was full of songs and stories from the Seven Kingdoms. Children’s stories, if truth be told; too simple and fanciful to be true history. All the heroes were tall and handsome, and you could tell the traitors by their shifty eyes. Yet she loved them all the same. Last night she had been reading of the three princesses in the red tower, locked away by the king for the crime of being beautiful.  When her handmaid brought the book, Dany had no trouble finding the page where she had left off, but it was no good. She found herself reading the same passage half a dozen times. Ser Jorah gave me this book as a bride’s gift, the day I wed Khal Drogo. But Daario is right, I shouldn’t have banished him. I should have kept him, or I should have killed him. She played at being a queen, yet sometimes she still felt like a scared little girl. Viserys always said what a dolt I was. Was he truly mad? She closed the book. She could still recall Ser Jorah, if she wished. Or send Daario to kill him.  Dany fled from the choice, out onto the terrace. She found Rhaegal asleep beside the pool, a green and bronze coil basking in the sun. Drogon was perched up atop the pyramid, in the place where the huge bronze harpy had stood before she had commanded it to be pulled down. He spread his wings and roared when he spied her. There was no sign of Viserion, but when she went to the parapet and scanned the horizon she saw pale wings in the far distance, sweeping above the river. He is hunting. They grow bolder every day. Yet it still made her anxious when they flew too far away."
}