{
  "id": "17af97220e4fc2205bf64639c922552f45c21b05",
  "text": ".. I'm impressed.\" fie smiled slightly at the look of surprise on Harry's face. \"That suggests that what you fear most of all is -- fear. Very wise, Harry.\"  Harry didn't know what to say to that, so he drank some mot,, tea.  \"So you've been thinking that I didn't believe you capable of fighting the boggart?\" said Lupin shrewdly.  \"Well... yeah,\" said Harry. He was suddenly feeling a lot happier. \"Professor Lupin, you know the dementors --\"  He was interrupted by a knock on the door.  \"Come in,\" called Lupin.  The door opened, and in came Snape. He was carrying a goblet, which was smoking faintly, and stopped at the sight of Harry, his black eyes narrowing.  \"Ah, Severus,\" said Lupin, smiling. \"Thanks very much. Could you leave it here on the desk for me?\"  Snape set down the smoking goblet, his eyes wandering between Harry and Lupin.  \"I was just showing Harry my grindylow,\" said Lupin pleasantly, pointing at the tank.  \"Fascinating,\" said Snape, without looking at it. \"You should drink that directly, Lupin.\"  \"Yes, Yes, I will,\" said Lupin.  \"I made an entire cauldronful,\" Snape continued. \"If you need more.  \"I should probably take some again tomorrow. Thanks very much, Severus.\"  \"Not at all,\" said Snape, but there was a look in his eye Harry didn't like. He backed out of the room, unsmiling and watchful.  Harry looked curiously at the goblet. Lupin smiled.  \"Professor Snape has very kindly concocted a potion for me,\" he said. \"I have never been much of a potion-brewer and this one is particularly complex.\" He picked up the goblet and sniffed it. \"Pity sugar makes it useless,\" he added, taking a sip and shuddering.  \"Why --?\" Harry began. Lupin looked at him and answered the unfinished question.  \"I've been feeling a bit off-color,\" he said. \"This potion is the only thing that helps. I am very lucky to be working alongside Professor Snape; there aren't many wizards who are up to making it.\"  Professor Lupin took another sip and Harry had a crazy urge to knock the goblet out of his hands.  \"Professor Snape's very interested in the Dark Arts, he blurted out.  \"Really?\" said Lupin, looking only mildly interested as he took another gulp of potion.  \"Some people reckon --\" Harry hesitated, then plunged recklessly on, \"some people reckon he'd do anything to get the Defense Against the Dark Arts job.\"  Lupin drained the goblet and pulled a face.  \"Disgusting,\" he said. \"Well, Harry, I'd better get back to work. see you at the feast later.\"  \"Right,\" said Harry, putting down his empty teacup.  The empty goblet was still smoking.  \"There you go,\" said Ron. \"We got as much as we could carry.\"  A shower of brilliantly colored sweets fell into Harry's lap. It was dusk, and Ron and Hermione had just turned up in the common room, pink-faced from the cold wind and looking as though they'd had the time of their lives.  \"Thanks,\" said Harry, picking up a packet of tiny black Pepper Imps. \"What's Hogsmeade like? Where did you go?\"  By the sound of it -- everywhere. Dervish and Banges, the wizarding equipment shop, Zonko's Joke Shop, into the Three Broomsticks for foaming mugs of hot butterbeer, and many places besides.  \"The post office, Harry! About two hundred owls, all sitting on shelves, all color-coded depending on how fast you want your letter to get there!\"  \"Honeydukes has got a new kind of fudge; they were giving out free samples, there's a bit, look --\"  \"We think we saw an ogre, honestly, they get all sorts at the Three Broomsticks --\"  \"Wish we could have brought you some butterbeer, really warms you up --\"  \"What did you do?\" said Hermione, looking anxious. \"Did you get any work done?\"  \"No,\" said Harry. \"Lupin made me a cup of tea in his office. And then Snape came in....\"  He told them all about the goblet. Ron's mouth fell open.  \"Lupin drank it?\" he gasped. \"Is he mad?\"  Hermione checked her watch.  \"We'd better go down, you know, the feast'll be starting in fiveminutes They hurried through the portrait hole and into the crowd, still discussing Snape.  \"But if he -- you know\" -- Hermione dropped her voice, glancing nervously around -- \"if he was trying to to poison Lupin -- he wouldn't have done it in front of Harry.\"  \"Yeah, maybe,\" said Harry as they reached the entrance hall and crossed into the Great Hall. It had been decorated with hundreds and hundreds of candle-filled pumpkins, a cloud of fluttering live bats, and many flaming orange streamers, which were swimming lazily across the stormy ceiling like brilliant watersnakes.  The food was delicious; even Hermione and Ron, who were full to bursting with Honeydukes sweets, managed second helpings of everything. Harry kept glancing at the staff table. Professor Lupin  looked cheerful and as well as he ever did; he was talking animatedly to tiny little Professor Flitwick, the Charms teacher. Harry moved his eyes along the table, to the place where Snape sat. Was he imagining it, or were Snape's eyes flickering toward Lupin more often than was natural?  The feast finished with an entertainment provided by the Hogwarts ghosts."
}