{
  "id": "17e9e1455dd149c3a99f3eff5b418b07b4ced44f",
  "text": " There was a stink to him too. He smells like a corpse. The man begged them for a drink of wine.   If I’d had any wine, I’d have drunk it myself,  the Hound told him.  I can give you water, and the gift of mercy.   The archer looked at him a long while before he said,  You’re Joffrey’s dog.     My own dog now. Do you want the water?    Aye.  The man swallowed.  And the mercy. Please.   They had passed a small pond a short ways back. Sandor gave Arya his helm and told her to fill it, so she trudged back to the water’s edge. Mud squished over the toe of her boots. She used the dog’s head as a pail. Water ran out through the eyeholes, but the bottom of the helm still held a lot.  When she came back, the archer turned his face up and she poured the water into his mouth. He gulped it down as fast as she could pour, and what he couldn’t gulp ran down his cheeks into the brown blood that crusted his whiskers, until pale pink tears dangled from his beard. When the water was gone he clutched the helm and licked the steel.  Good,  he said.  I wish it was wine, though. I wanted wine.    Me too.  The Hound eased his dagger into the man’s chest almost tenderly, the weight of his body driving the point through his surcoat, ringmail, and the quilting beneath. As he slid the blade back out and wiped it on the dead man, he looked at Arya.  That’s where the heart is, girl. That’s how you kill a man.   That’s one way.  Will we bury him?    Why?  Sandor said.  He don’t care, and we’ve got no spade. Leave him for the wolves and wild dogs. Your brothers and mine.  He gave her a hard look.  First we rob him, though.   There were two silver stags in the archer’s purse, and almost thirty coppers. His dagger had a pretty pink stone in the hilt. The Hound hefted the knife in his hand, then flipped it toward Arya. She caught it by the hilt, slid it through her belt, and felt a little better. It wasn’t Needle, but it was steel. The dead man had a quiver of arrows too, but arrows weren’t much good without a bow. His boots were too big for Arya and too small for the Hound, so those they left. She took his kettle helm as well, even though it came down almost past her nose, so she had to tilt it back to see.  He must have had a horse as well, or he wouldn’t have got away,  Clegane said, peering about,  but it’s bloody well gone, I’d say. No telling how long he’s been here.   By the time they found themselves in the foothills of the Mountains of the Moon, the rains had mostly stopped. Arya could see the sun and moon and stars, and it seemed to her that they were heading eastward.  Where are we going?  she asked again.  This time the Hound answered her.  You have an aunt in the Eyrie. Might be she’ll want to ransom your scrawny arse, though the gods know why. Once we find the high road, we can follow it all the way to the Bloody Gate.   Aunt Lysa. The thought left Arya feeling empty. It was her mother she wanted, not her mother’s sister. She didn’t know her mother’s sister any more than she knew her great uncle Blackfish. We should have gone into the castle. They didn’t really know that her mother was dead, or Robb either. It wasn’t like they’d seen them die or anything. Maybe Lord Frey had just taken them captive. Maybe they were chained up in his dungeon, or maybe the Freys were taking them to King’s Landing so Joffrey could chop their heads off. They didn’t know.  We should go back,  she suddenly decided.  We should go back to the Twins and get my mother. She can’t be dead. We have to help her.    I thought your sister was the one with a head full of songs,  the Hound growled.  Frey might have kept your mother alive to ransom, that’s true. But there’s no way in seven hells I’m going to pluck her out of his castle all by my bloody self.    Not by yourself. I’d come too.   He made a sound that was almost a laugh.  That will scare the piss out of the old man.    You’re just afraid to die!  she said scornfully.  Now Clegane did laugh.  Death don’t scare me. Only fire. Now be quiet, or I’ll cut your tongue out myself and save the silent sisters the bother. It’s the Vale for us.   Arya didn’t think he’d really cut her tongue out; he was just saying that the way Pinkeye used to say he’d beat her bloody. All the same, she wasn’t going to try him. Sandor Clegane was no Pinkeye. Pinkeye didn’t cut people in half or hit them with axes. Not even with the flat of axes.  That night she went to sleep thinking of her mother, and wondering if she should kill the Hound in his sleep and rescue Lady Catelyn herself. When she closed her eyes she saw her mother’s face against the back of her eyelids. She’s so close I could almost smell her…  …and then she could smell her. The scent was faint beneath the other smells, beneath moss and mud and water, and the stench of rotting reeds and rotting men. She padded slowly through the soft ground to the river’s edge, lapped up a drink, the lifted her head to sniff. The sky was grey and thick with cloud, the river green and full of floating things."
}