{
  "id": "17f7db732bc7aac9da8ee8205dfabcc7bb3c6cf3",
  "text": "  Then a sudden gust of cold made his fur stand up, and the air thrilled to the sound of wings. As he lifted his eyes to the ice-white mountain heights above, a shadow plummeted out of the sky. A shrill scream split the air. He glimpsed blue-grey pinions spread wide, shutting out the sun…   Ghost!  Jon shouted, sitting up. He could still feel the talons, the pain.  Ghost, to me!   Ebben appeared, grabbed him, shook him.  Quiet! You mean to bring the wildlings down on us? What’s wrong with you, boy?    A dream,  said Jon feebly.  I was Ghost, I was on the edge of the mountain looking down on a frozen river, and something attacked me. A bird… an eagle, I think…   Squire Dalbridge smiled.  It’s always pretty women in my dreams. Would that I dreamed more often.   Qhorin came up beside him.  A frozen river, you say?    The Milkwater flows from a great lake at the foot of a glacier,  Stonesnake put in.   There was a tree with my brother’s face. The wildlings… there were thousands, more than I ever knew existed. And giants riding mammoths.  From the way the light had shifted, Jon judged that he had been asleep for four or five hours. His head ached, and the back of his neck where the talons had burned through him. But that was in the dream.   Tell me all that you remember, from first to last,  said Qhorin Halfhand.  Jon was confused.  It was only a dream.    A wolf dream,  the Halfhand said.  Craster told the Lord Commander that the wildlings were gathering at the source of the Milkwater. That may be why you dreamed it. Or it may be that you saw what waits for us, a few hours farther on. Tell me.  It made him feel half a fool to talk of such things to Qhorin and the other rangers, but he did as he was commanded. None of the black brothers laughed at him, however. By the time he was done, even Squire Dalbridge was no longer smiling.   Skinchanger?  said Ebben grimly, looking at the Halfhand. Does he mean the eagle? Jon wondered. Or me? Skinchangers and wargs belonged in Old Nan’s stories, not in the world he had lived in all his life. Yet here, in this strange bleak wilderness of rock and ice, it was not hard to believe.   The cold winds are rising. Mormont feared as much. Benjen Stark felt it as well. Dead men walk and the trees have eyes again. Why should we balk at wargs and giants?    Does this mean my dreams are true as well?  asked Squire Dalbridge.  Lord Snow can keep his mammoths, I want my women.    Man and boy I’ve served the Watch, and ranged as far as any,  said Ebben.  I’ve seen the bones of giants, and heard many a queer tale, but no more. I want to see them with my own eyes.    Be careful they don’t see you, Ebben,  Stonesnake said.  Ghost did not reappear as they set out again. The shadows covered the floor of the pass by then, and the sun was sinking fast toward the jagged twin peaks of the huge mountain the rangers named Forktop. If the dream was true… Even the thought scared him. Could the eagle have hurt Ghost, or knocked him off the precipice? And what about the weirwood with his brother’s face, that smelled of death and darkness?  The last ray of sun vanished behind the peaks of Forktop. Twilight filled the Skirling Pass. It seemed to grow colder almost at once. They were no longer climbing. In fact, the ground had begun to descend, though as yet not sharply. It was littered with cracks and broken boulders and tumbled heaps of rock. It will be dark soon, and still no sight of Ghost. It was tearing Jon apart, yet he dare not shout for the direwolf as he would have liked. Other things might be listening as well.   Qhorin,  Squire Dalbridge called softly.  There. Look.   The eagle was perched on a spine of rock far above them, outlined against the darkening sky. We’ve seen other eagles, Jon thought. That need not be the one I dreamed of.  Even so, Ebben would have loosed a shaft at it, but the squire stopped him.  The bird’s well out of bowshot.    I don’t like it watching us.   The squire shrugged.  Nor me, but you won’t stop it. Only waste a good arrow.   Qhorin sat in his saddle, studying the eagle for a long time.  We press on,  he finally said. The rangers resumed their descent.  Ghost, Jon wanted to shout, where are you?  He was about to follow Qhorin and the others when he glimpsed a flash of white between two boulders. A patch of old snow, he thought, until he saw it stir. He was off his horse at once. As he went to his knees, Ghost lifted his head. His neck glistened wetly, but he made no sound when Jon peeled off a glove and touched him. The talons had torn a bloody path through fur and flesh, but the bird had not been able to snap his neck.  Qhorin Halfhand was standing over him.  How bad?   As if in answer, Ghost struggled to his feet.   The wolf is strong,  the ranger said.  Ebben, water. Stonesnake, your skin of wine. Hold him still, Jon.   Together they washed the caked blood from the direwolf’s fur. Ghost struggled and bared his teeth when Qhorin poured the wine into the ragged red gashes the eagle had left him, but Jon wrapped his arms around him and murmured soothing words, and soon enough the wolf quieted."
}