{
  "id": "18332123fc4d6d71498c0ca2fd3a10af892ee801",
  "text": " He grinned at the sight of Ghost, put two fingers in his mouth, and whistled as only a mummer’s boy could whistle. The shrill sound cut through the clamor like a sword. As Jon walked toward the tables, more of the brothers took note, and fell quiet. A hush spread across the cellar, until the only sounds were Jon’s heels clicking on the stone floor, and the soft crackle of the logs in the hearth.  Ser Alliser Thorne shattered the silence.  The turncloak graces us with his presence at last.   Lord Janos was red-faced and quivering.  The beast,  he gasped.  Look! The beast that tore the life from Halfhand. A warg walks among us, brothers. A WARG! This… this creature is not fit to lead us! This beastling is not fit to live!   Ghost bared his teeth, but Jon put a hand on his head.  My lord,  he said,  will you tell me what’s happened here?   Maester Aemon answered, from the far end of the hall.  Your name has been put forth as Lord Commander, Jon.   That was so absurd Jon had to smile.  By who?  he said, looking for his friends. This had to be one of Pyp’s japes, surely. But Pyp shrugged at him, and Grenn shook his head. It was Dolorous Edd Tollett who stood.  By me. Aye, it’s a terrible cruel thing to do to a friend, but better you than me.   Lord Janos started sputtering again.  This, this is an outrage. We ought to hang this boy. Yes! Hang him, I say, hang him for a turncloak and a warg, along with his friend Mance Rayder. Lord Commander? I will not have it, I will not suffer it!   Cotter Pyke stood up.  You won’t suffer it? Might be you had those gold cloaks trained to lick your bloody arse, but you’re wearing a black cloak now.    Any brother may offer any name for our consideration, so long as the man has said his vows,  Ser Denys Mallister said.  Tollett is well within his rights, my lord.   A dozen men started to talk at once, each trying to drown out the others, and before long half the hall was shouting once more. This time it was Ser Alliser Thorne who leapt up on the table, and raised his hands for quiet.  Brothers!  he cried,  this gains us naught. I say we vote. This king who has taken the King’s Tower has posted men at all the doors to see that we do not eat nor leave till we have made a choice. So be it! We will choose, and choose again, all night if need be, until we have our lord… but before we cast our tokens, I believe our First Builder has something to say to us.   Othell Yarwyck stood up slowly, frowning. The big builder rubbed his long lantern jaw and said,  Well, I’m pulling my name out. If you wanted me, you had ten chances to choose me, and you didn’t. Not enough of you, anyway. I was going to say that those who were casting a token for me ought to choose Lord Janos…   Ser Alliser nodded.  Lord Slynt is the best possible—    I wasn’t done, Alliser,  Yarwyck complained.  Lord Slynt commanded the City Watch in King’s Landing, we all know, and he was Lord of Harrenhal…    He’s never seen Harrenhal,  Cotter Pyke shouted out.   Well, that’s so,  said Yarwyck.  Anyway, now that I’m standing here, I don’t recall why I thought Slynt would be such a good choice. That would be sort of kicking King Stannis in the mouth, and I don’t see how that serves us. Might be Snow would be better. He’s been longer on the Wall, he’s Ben Stark’s nephew, and he served the Old Bear as squire.  Yarwyck shrugged.  Pick who you want, just so it’s not me.  He sat down.  Janos Slynt had turned from red to purple, Jon saw, but Ser Alliser Thorne had gone pale. The Eastwatch man was pounding his fist on the table again, but now he was shouting for the kettle. Some of his friends took up the cry.  Kettle!  they roared, as one.  Kettle, kettle, KETTLE!   The kettle was in the corner by the hearth, a big black potbellied thing with two huge handles and a heavy lid. Maester Aemon said a word to Sam and Clydas and they went and grabbed the handles and dragged the kettle over to the table. A few of the brothers were already queueing up by the token barrels as Clydas took the lid off and almost dropped it on his foot. With a raucous scream and a clap of wings, a huge raven burst out of the kettle. It flapped upward, seeking the rafters perhaps, or a window to make its escape, but there were no rafters in the vault, nor windows either. The raven was trapped. Cawing loudly, it circled the hall, once, twice, three times. And Jon heard Samwell Tarly shout,  I know that bird! That’s Lord Mormont’s raven!   The raven landed on the table nearest Jon.  Snow,  it cawed. It was an old bird, dirty and bedraggled.  Snow,  it said again,  Snow, snow, snow.  It walked to the end of the table, spread its wings again, and flew to Jon’s shoulder.  Lord Janos Slynt sat down so heavily he made a thump, but Ser Alliser filled the vault with mocking laughter.  Ser Piggy thinks we’re all fools, brothers,  he said.  He’s taught the bird this little trick. They all say snow, go up to the rookery and hear for yourselves. Mormont’s bird had more words than that."
}