{
  "id": "18440f485b82787134e5504db075935c534e1a59",
  "text": "  That  being  so  it  is  not  surprising  that  the  guards  were  drinking  and  laughing  by  a  fire  in  their  hut,  and  did  not  hear  the  noise  of  the   ####-unpacking  of  the  dwarves  or  the  footsteps  of  the  four  scouts.  Their  astonishment  was enormous when Thorin Oakenshield stepped in through the door.   \"Who  are  you  and what  do  you want?\"  they  shouted  leaping  to  their  feet  and  gipping for weapons.  \"Thorin son of Thrain son of Thror King under the Mountain!\" said the dwarf  in  a  loud  voice,  and  he  looked  it,  in  spite  of  his  torn  clothes  and  draggled  hood.  The  gold  gleamed  on  his  neck  and  waist:  his  eyes  were  dark  and  deep.  \"I  have  come back. I wish to see the Master of your town!\"  Then  there  was  tremendous  excitement.  Some  of  the  more  foolish  ran  out  of  the  hut  as  if  they  expected  the  Mountain  to  go  golden  in  the  night  and  all  the  waters  of  the  lake  to  turn  yellow  right  away.  The  captain  of  the  guard  came  forward.  \"And who are these?\" he asked, pointing to Fili and: Kili and Bilbo.  \"The sons of my father's daughter,\" answered Thorin, \"Fili and Kili of the race  of Durin, and Mr. Baggins who has travelled with us out of the West.\"  \"If you come in peace lay down your arms!\" said the captain.  \"We  have  none,\"  said  Thorin,  and  it  was  true  enough:  their  knives  had  been  taken from them by the wood-elves, and the great sword Orcrist too. Bilbo had his  short sword, hidden as usual, but he said nothing about that. \"We have no need of  weapons,  who  return  at  last  to  our  own  as  spoken  of  old.  Nor  could  we  fight  against so many. Take us to your master!\"  \"He is at feast,\" said the captain.  \"Then all the more reason for taking us to him,\" burst in Fili, who was getting  impatient at these solemnities. \"We are worn and famished after our long road and  we have sick comrades. Now make haste and  let us have no more words, or your  master may have something to say to you.\"  \"Follow me  then,\"  said  the  captain,  and with  six men  about  them he  led  them  over  the bridge  through  the gates and  into  the market-place of the town. This was  a  wide  circle  of  quiet  water  surrounded  by  the  tall  piles  on  which  were  built  the  greater  houses,  and  by  long  wooden  quays  with  many  steps  and  ladders  going  down  to  the  surface  of  the  lake. From  one  great  hall  shone many  lights  and  there  came  the  sound  of many  voices.  They  passed  its  doors  and  stood  blinking  in  the  light looking at long tables filled with folk.  \"I  am Thorin  son  of Thrain  son of Thror King under the Mountain! I return!\"  cried Thorin in a loud voice from the door, before the captain could say anything.  All  leaped  to  their  feet.  The Master  of  the  town  sprang  from  his  great  chair.  But   ####-none  rose  in greater surprise  than  the  raft-men of the elves who were sitting at the  lower end of the hall. Pressing forward before the Master's table they cried:  \"These  are  prisoners  of  our  king  that  have  escaped,  wandering  vagabond  dwarves that could not give any good account of themselves, sneaking through the  woods and molesting our people!\"  \"Is  this  true?\"  asked  the  Master.  As  a  matter  of  fact  he  thought  it  far  more  likely than the return of the King under the Mountain, if any such person had ever  existed.  \"It  is  true  that we were wrongfully waylaid by the Elven-king and imprisoned  without  cause  as  we  journeyed  back  to  our  own  land,\"  answered  Thorin.  \"But  lock  nor  bar  may  hinder  the  homecoming  spoken  of  old.  Nor  is  this  town  in  the  Wood-elves' realm. I speak to the Master of the town of the Men of the lake, not to  the raft-men of the king.\"  Then  the  Master  hesitated  and  looked  from  one  to  the  other.  The  Elvenking  was  very  powerful  in  those  parts  and  the Master wished  for  no  enmity with  him,  nor did he  think much of old songs, giving his mind  to  .trade and tolls, to cargoes  and  gold,  to  which  habit  he  owed  his  position.  Others  were  of  different  mind,  however,  and  quickly  the  matter  was  settled  without  him.  The  news  had  spread  from  the  doors  of  the  hall  like  fire  through  all  the  town.  People  were  shouting  inside  the  hall  and  outside  it. The  quays were  thronged with  hurrying  feet.  Some  began  to  sing  snatches  of  old  songs  concerning  the  return  of  the  King  under  the  Mountain;  that  it was Thror's grandson not Thror himself  that had come back did  not bother them at all. Others took up the song and it rolled loud and high over the  lake.     The King beneath the mountains,  The King of carven stone,  The lord of silver fountains  Shall come into his own!    His crown shall be upholden,  His harp shall be restrung,  His halls shall echo golden  To songs of yore re-sung.    The woods shall wave on mountains  And grass beneath the sun;  His wealth shall flow in fountains  And the rivers golden run."
}