{
  "id": "1850af949737d2ae1765d63514a203e84d7b2da0",
  "text": "  Indeed I have  heard that for them memory is more like to the waking world than to a dream.  Not so for Dwarves.        'But let us talk no more of it. Look to the boat! She is too low in the  water with all this baggage, and  the Great River is swift. I do not wish to  drown my grief in cold water.' He took up  a paddle, and steered towards the  western bank, following Aragorn's boat ahead, which had already moved out of  the middle stream.       So the  Company went on their long way, down the wide  hurrying waters,   borne ever  southwards. Bare woods stalked along either bank, and they could  not see any glimpse of the lands behind. The breeze died  away and the River  flowed without a sound. No voice  of  bird broke the silence.  The  sun grew  misty as the day grew old, until it gleamed in a pale sky  like a high white  pearl. Then it faded into the West, and dusk came  early, followed by a grey  and  starless night. Far into the dark quiet hours they  floated on, guiding  their boats under the overhanging shadows  of the western woods. Great trees  passed  by like ghosts, thrusting their twisted thirsty  roots  through  the  mist down into the water. It was dreary and cold. Frodo sat and  listened to  the  faint lap and  gurgle  of  the River fretting among the  tree-roots and  driftwood near the shore, until  his  head nodded and he fell into an uneasy  sleep.     ####-   Chapter 9. The Great River            Frodo  was roused  by Sam. He found  that  he was  lying, well wrapped,   under tall grey-skinned trees in a quiet corner of the woodlands on the west  bank of the  Great River, Anduin. He had slept the night  away, and the grey  of morning was dim among the bare branches. Gimli was busy with a small fire  near at hand.       They started  again  before   the day  was broad.  Not that most of  the  Company were eager to hurry southwards: they were content that the decision,  which they must make at  latest  when they came  to  Rauros and the Tindrock   Isle, still lay some days ahead; and they let the River  bear them on at its  own  pace,  having no desire to hasten  towards  the perils that lay beyond,  whichever course they  took in  the end. Aragorn  let  them  drift with  the  stream as they wished, husbanding their  strength against weariness to come.   But he insisted that at least they should  start early  each day and journey  on  far into the evening; for he felt  in his heart that  time was pressing,  and he  feared that the Dark Lord  had not been idle while  they lingered in  Lurien.       Nonetheless  they saw no sign of  an enemy that  day, nor the next. The  dull grey hours passed without event. As the third  day of their voyage wore  on the lands changed slowly: the trees  thinned and  then failed altogether.  On  the eastern bank to their left  they saw long formless slopes stretching  up and away toward the sky; brown and withered they  looked, as  if fire had  passed  over them, leaving no  living  blade of green:  an  unfriendly waste  without even a broken tree or a  bold  stone to relieve the  emptiness. They  had come to  the Brown Lands  that lay, vast and  desolate, between Southern  Mirkwood and the hills of the Emyn Muil. What pestilence or war or evil deed  of the Enemy had so blasted all that region even Aragorn could not tell.       Upon the west to their  right the land was treeless  also,  but it  was  flat, and  in many places green  with wide plains of grass. On this side  of  the River they passed forests of great reeds, so tall that they shut out all  view to  the  west,  as  the  little  boats  went   rustling by  along  their  fluttering borders. Their dark withered plumes bent and tossed in  the light  cold airs, hissing softly and sadly. Here and there through  openings  Frodo  could catch sudden  glimpses of rolling meads, and far  beyond them hills in   ####-the  sunset, and  away on  the edge of sight a dark line, where marched  the  southernmost ranks of the Misty Mountains.        There was no sign of living moving  things,  save birds. Of these there  were many: small  fowl whistling  and  piping in  the reeds,  but  they were  seldom seen.  Once  or  twice the  travellers  heard  the rush  and whine of  swan-wings, and looking up they saw a great phalanx streaming along the sky.       `Swans! ' said Sam. `And mighty big ones too! '       `Yes,' said Aragorn, 'and they are black swans.'       `How wide and empty and mournful all this country looks! '  said Frodo.   `I  always imagined  that as one journeyed  south it got warmer and merrier,   until winter was left behind for ever.'       'But we  have not journeyed  far south yet,'  answered Aragorn. `It  is  still winter, and we are far from the sea. Here the world  is cold until the  sudden spring, and we  may yet have snow again. Far away down in the Bay  of  Belfalas, to which Anduin runs, it is warm and merry, maybe, or would be but  for the  Enemy. But here we are  not above sixty  leagues, I guess, south of  the Southfarthing away in your Shire, hundreds of long miles yonder."
}