{
  "id": "187302efc538a1dc7eb543a71422dbaf11cbf707",
  "text": " Nothing but that could have called Fawkes to you.\"  He stroked the phoenix, which had fluttered down onto his knee. Harry grinned awkwardly as Dumbledore watched him.  \"And so you met Tom Riddle,\" said Dumbledore thoughtfully. \"I imagine he was most interested in you . . . . \"  Suddenly, something that was nagging at Harry came tumbling out of his mouth.  \"Professor Dumbledore ... Riddle said I'm like him. Strange likenesses, he said ......  \"Did he, now?\" said Dumbledore, looking thoughtfully at Harry from under his thick silver eyebrows. \"And what do you think, Harry?\"  \"I don't think I'm like him!\" said Harry, more loudly than he'd intended. \"I mean, I'm -- I'm in Gryffindor, I'm . . .\"  But he fell silent, a lurking doubt resurfacing in his mind.  \"Professor,\" he started again after a moment. \"The Sorting Hat told me Id -- Id have done well in Slytherin. Everyone thought I was Slytherin's heir for a while ... because I can speak Parseltongue ....  \"You can speak Parseltongue, Harry,\" said Dumbledore calmly, \"because Lord Voldemort -- who is the last remaining ancestor  *$32*  of Salazar Slytherin -- can speak Parseltongue. Unless I'm much mistaken, he transferred some of his own powers to you the night he gave you that scar. Not something he intended to do, I'm sure ....  \"Voldemort put a bit of himself in me?\" Harry said, thunderstruck.  \"It certainly seems so.\"  \"So I should be in Slytherin,\" Harry said, looking desperately into Dumbledore's face. \"The Sorting Hat could see Slytherin's power in me, and it --\"  \"Put you in Gryffindor,\" said Dumbledore calmly. \"Listen to me, Harry. You happen to have many qualities Salazar Slytherin prized in his hand- picked students. His own very rare gift, Parseltongue - resourcefulness - determination -- a certain disregard for rules,\" he added, his mustache quivering again. \"Yet the Sorting Hat placed you in Gryffindor. You know why that was. Think.\"  \"It only put me in Gryffindor,\" said Harry in a defeated voice, \"because I asked not to go in Slytherin . . . .\"  `Exactly, \"said Dumbledore, beaming once more. \"Which makes you very different from Tom Riddle. It is our choices, Harry, that show what we truly are, far more than our abilities.\" Harry sat motionless in his chair, stunned. \"If you want proof, Harry, that you belong in Gryffindor, I suggest you look more closely at this.\"  Dumbledore reached across to Professor McGonagall's desk, picked up the blood-stained silver sword, and handed it to Harry. Dully, Harry turned it over, the rubies blazing in the firelight. And then he saw the name engraved just below the hilt.  Godric Gryffindor  *333*  \"Only a true Gryffindor could have pulled that out of the hat, Harry,\" said Dumbledore simply.  For a minute, neither of them spoke. Then Dumbledore pulled open one of the drawers in Professor McGonagall's desk and took out a quill and a bottle of ink.  What you need, Harry, is some food and sleep. I suggest you go down to the feast, while I write to Azkaban -- we need our gamekeeper back. And I must draft an advertisement for the Daily Prophet, too,\" he added thoughtfully. \"We'll be needing a new Defense Against the Dark Arts teacher... Dear me, we do seem to run through them, don't we?\"  Harry got up and crossed to the door. He had just reached for the handle, however, when the door burst open so violently that it bounced back off the wall.  Lucius Malfoy stood there, fury in his face. And cowering behind his legs, heavily wrapped in bandages, was Dobby.  \"Good evening, Lucius,\" said Dumbledore pleasantly.  Mr. Malfoy almost knocked Harry over as he swept into the room. Dobby went scurrying in after him, crouching at the hem of his cloak, a look of abject terror on his face.  The elf was carrying a stained rag with which he was attempting to finish cleaning Mr. Malfoys shoes. Apparently Mr. Malfoy had set out in a great hurry, for not only were his shoes half-polished, but his usually sleek hair was disheveled. Ignoring the elf bobbing apologetically around his ankles, he fixed his cold eyes upon Dumbledore.  \"So!\" he said \"You've come back. The governors suspended you, but you still saw fit to return to Hogwarts.\"  *%$4*  \"Well, you see, Lucius,\" said Dumbledore, smiling serenely, \"the other eleven governors contacted me today. It was something like being caught in a hailstorm of owls, to tell the truth. They'd heard that Arthur Weasleys daughter had been killed and wanted me back here at once. They seemed to think I was the best man for the job after all. Very strange tales they told me, too .... Several of them seemed to think that you had threatened to curse their families if they didn't agree to suspend me in the first place.\"  Mr. Malfoy went even paler than usual, but his eyes were still slits of fury.  \"So -- have you stopped the attacks yet?\" he sneered. \"Have you caught the culprit?\"  \"We have,\" said Dumbledore, with a smile.  \"Well?\"said Mr. Malfoy sharply. \"Who is it?\"  \"The same person as last time, Lucius,\" said Dumbledore."
}