{
  "id": "18ae1683365a38399c7d407cd3a5afe0b7d9aa1b",
  "text": "  They say that knights will come from all over the realm to joust and feast in honor of your appointment as Hand of the King.   Arya could see that her father was not very happy about that.  Do they also say this is the last thing in the world I would have wished?   Sansa’s eyes had grown wide as the plates.  A tourney,  she breathed. She was seated between Septa Mordane and Jeyne Poole, as far from Arya as she could get without drawing a reproach from Father.  Will we be permitted to go, Father?    You know my feelings, Sansa. It seems I must arrange Robert’s games and pretend to be honored for his sake. That does not mean I must subject my daughters to this folly.    Oh, please,  Sansa said.  I want to see.   Septa Mordane spoke up.  Princess Myrcella will be there, my lord, and her younger than Lady Sansa. All the ladies of the court will be expected at a grand event like this, and as the tourney is in your honor, it would look queer if your family did not attend.   Father looked pained.  I suppose so. Very well, I shall arrange a place for you, Sansa.  He saw Arya.  For both of you.    I don’t care about their stupid tourney,  Arya said. She knew Prince Joffrey would be there, and she hated Prince Joffrey.  Sansa lifted her head.  It will be a splendid event. You shan’t be wanted.   Anger flashed across Father’s face.  Enough, Sansa. More of that and you will change my mind. I am weary unto death of this endless war you two are fighting. You are sisters. I expect you to behave like sisters, is that understood?   Sansa bit her lip and nodded. Arya lowered her face to stare sullenly at her plate. She could feel tears stinging her eyes. She rubbed them away angrily, determined not to cry.  The only sound was the clatter of knives and forks.  Pray excuse me,  her father announced to the table.  I find I have small appetite tonight.  He walked from the hall.  After he was gone, Sansa exchanged excited whispers with Jeyne Poole. Down the table Jory laughed at a joke, and Hullen started in about horseflesh.  Your warhorse, now, he may not be the best one for the joust. Not the same thing, oh, no, not the same at all.  The men had heard it all before; Desmond, Jacks, and Hullen’s son Harwin shouted him down together, and Porther called for more wine.  No one talked to Arya. She didn’t care. She liked it that way. She would have eaten her meals alone in her bedchamber if they let her. Sometimes they did, when Father had to dine with the king or some lord or the envoys from this place or that place. The rest of the time, they ate in his solar, just him and her and Sansa. That was when Arya missed her brothers most. She wanted to tease Bran and play with baby Rickon and have Robb smile at her. She wanted Jon to muss up her hair and call her  little sister  and finish her sentences with her. But all of them were gone. She had no one left but Sansa, and Sansa wouldn’t even talk to her unless Father made her.  Back at Winterfell, they had eaten in the Great Hall almost half the time. Her father used to say that a lord needed to eat with his men, if he hoped to keep them.  Know the men who follow you,  she heard him tell Robb once,  and let them know you. Don’t ask your men to die for a stranger.  At Winterfell, he always had an extra seat set at his own table, and every day a different man would be asked to join him. One night it would be Vayon Poole, and the talk would be coppers and bread stores and servants. The next time it would be Mikken, and her father would listen to him go on about armor and swords and how hot a forge should be and the best way to temper steel. Another day it might be Hullen with his endless horse talk, or Septon Chayle from the library, or Jory, or Ser Rodrik, or even Old Nan with her stories.  Arya had loved nothing better than to sit at her father’s table and listen to them talk. She had loved listening to the men on the benches too; to freeriders tough as leather, courtly knights and bold young squires, grizzled old men-at-arms. She used to throw snowballs at them and help them steal pies from the kitchen. Their wives gave her scones and she invented names for their babies and played monsters-and-maidens and hide-the-treasure and come-into-my-castle with their children. Fat Tom used to call her  Arya Underfoot,  because he said that was where she always was. She’d liked that a lot better than  Arya Horseface.   Only that was Winterfell, a world away, and now everything was changed. This was the first time they had supped with the men since arriving in King’s Landing. Arya hated it. She hated the sounds of their voices now, the way they laughed, the stories they told. They’d been her friends, she’d felt safe around them, but now she knew that was a lie. They’d let the queen kill Lady, that was horrible enough, but then the Hound found Mycah. Jeyne Poole had told Arya that he’d cut him up in so many pieces that they’d given him back to the butcher in a bag, and at first the poor man had thought it was a pig they’d slaughtered."
}