{
  "id": "18af23966d7a22d1ca456bb278dd7d81aba99ccc",
  "text": " Bronn said they were calling it the dwarf’s penny in the streets.  Spread your legs for the Halfman, now,  they were shouting in the brothels and wine sinks, if the sellsword could be believed.   I will make certain to keep my pouch full of pennies. Even a prince must pay his taxes.    Why should you need to go whoring?  He glanced back to where Ellaria Sand rode among the other women.  Did you tire of your paramour on the road?    Never. We share too much.  Prince Oberyn shrugged.  We have never shared a beautiful blonde woman, however, and Ellaria is curious. Do you know of such a creature?    I am a man wedded.  Though not yet bedded.  I no longer frequent whores.  Unless I want to see them hanged.  Oberyn abruptly changed the subject.  It’s said there are to be seventy-seven dishes served at the king’s wedding feast.    Are you hungry, my prince?    I have hungered for a long time. Though not for food. Pray tell me, when will the justice be served?    Justice.  Yes, that is why he’s here, I should have seen that at once.  You were close to your sister?    As children Elia and I were inseparable, much like your own brother and sister.   Gods, I hope not.  Wars and weddings have kept us well occupied, Prince Oberyn. I fear no one has yet had the time to look into murders sixteen years stale, dreadful as they were. We shall, of course, just as soon as we may. Any help that Dorne might be able to provide to restore the king’s peace would only hasten the beginning of my lord father’s inquiry—    Dwarf,  said the Red Viper, in a tone grown markedly less cordial,  spare me your Lannister lies. Is it sheep you take us for, or fools? My brother is not a bloodthirsty man, but neither has he been asleep for sixteen years. Jon Arryn came to Sunspear the year after Robert took the throne, and you can be sure that he was questioned closely. Him, and a hundred more. I did not come for some mummer’s show of an inquiry. I came for justice for Elia and her children, and I will have it. Starting with this lummox Gregor Clegane… but not, I think, ending there. Before he dies, the Enormity That Rides will tell me whence came his orders, please assure your lord father of that.  He smiled.  An old septon once claimed I was living proof of the goodness of the gods. Do you know why that is, Imp?    No,  Tyrion admitted warily.   Why, if the gods were cruel, they would have made me my mother’s firstborn, and Doran her third. I am a bloodthirsty man, you see. And it is me you must contend with now, not my patient, prudent, and gouty brother.   Tyrion could see the sun shining on the Blackwater Rush half a mile ahead, and on the walls and towers and hills of King’s Landing beyond. He glanced over his shoulder, at the glittering column following them up the kingsroad.  You speak like a man with a great host at his back,  he said,  yet all I see are three hundred. Do you spy that city there, north of the river?    The midden heap you call King’s Landing?    That’s the very one.    Not only do I see it, I believe I smell it now.    Then take a good sniff, my lord. Fill up your nose. Half a million people stink more than three hundred, you’ll find. Do you smell the gold cloaks? There are near five thousand of them. My father’s own sworn swords must account for another twenty thousand. And then there are the roses. Roses smell so sweet, don’t they? Especially when there are so many of them. Fifty, sixty, seventy thousand roses, in the city or camped outside it, I can’t really say how many are left, but there’s more than I care to count, anyway.   Martell gave a shrug.  In Dorne of old before we married Daeron, it was said that all flowers bow before the sun. Should the roses seek to hinder me I’ll gladly trample them underfoot.    As you trampled Willas Tyrell?   The Dornishman did not react as expected.  I had a letter from Willas not half a year past. We share an interest in fine horseflesh. He has never borne me any ill will for what happened in the lists. I struck his breastplate clean, but his foot caught in a stirrup as he fell and his horse came down on top of him. I sent a maester to him afterward, but it was all he could do to save the boy’s leg. The knee was far past mending. If any were to blame, it was his fool of a father. Willas Tyrell was green as his surcoat and had no business riding in such company. The Fat Flower thrust him into tourneys at too tender an age, just as he did with the other two. He wanted another Leo Longthorn, and made himself a cripple.    There are those who say Ser Loras is better than Leo Longthorn ever was,  said Tyrion.   Renly’s little rose? I doubt that.    Doubt it all you wish,  said Tyrion,  but Ser Loras has defeated many good knights, including my brother Jaime.    By defeated, you mean unhorsed, in tourney. Tell me who he’s slain in battle if you mean to frighten me.    Ser Robar Royce and Ser Emmon Cuy, for two. And men say he performed prodigious feats of valor on the Blackwater, fighting beside Lord Renly’s ghost."
}