{
  "id": "1903623adac472cb448862aa65e822476e519882",
  "text": "  \"And you, Potter, will be helping Professor Lockhart answer his fan mail,\" said Professor McGonagall.  \"Oh n - Professor, can't I go and do the trophy room, too?\" said Harry desperately.  \"Certainly not,\" said Professor McGonagall, raising her eyebrows. \"Professor Lockhart requested you particularly. Eight o'clock sharp, both of you.\"  Harry and Ron slouched into the Great Hall in states of deepest gloom, Hermione behind them, wearing a well-you-did-break-school- rules  sort of expression. Harry didn't enjoy his shepherd's pie as much as he'd thought. Both he and Ron felt they'd got the worse deal.  \"Filch'll have me there all night,\" said Ron heavily. \"No magic! There must be about a hundred cups in that room. I'm no good at Muggle cleaning.\"  \"I'd swap anytime,\" said Harry hollowly. \"I've had loads of practice with the Dursleys. Answering Lockhart's fan mail ... he'll be a nightmare ......  Saturday afternoon seemed to melt away, and in what seemed like no time, it was five minutes to eight, and Harry was dragging his feet along the second-floor corridor to Lockhart's office. He gritted his teeth and knocked.  The door flew open at once. Lockhart beamed down at him.  \"Ah, here's the scalawag!\" he said. \"Come in, Harry, come in -\"  Shining brightly on the walls by the light of many candles were countless framed photographs of Lockhart. He had even signed a few of them. Another large pile lay on his desk.    \"You can address the envelopes!\" Lockhart told Harry, as though this was a huge treat. \"This first one's to Gladys Gudgeon, bless her - huge fan of mine -\"  The minutes snailed by. Harry let Lockhart's voice wash over him, occasionally saying, \"Mmm\" and \"Right\" and \"Yeah.\" Now and then he caught a phrase like, \"Fame's a fickle friend, Harry,\" or \"Celebrity is as celebrity does, remember that.\"  The candles burned lower and lower, making the light dance over the many moving faces of Lockhart watching him. Harry moved his aching hand over what felt like the thousandth envelope, writing out Veronica Smethley's address. It must be nearly time to leave, Harry thought miserably, please let it be nearly time...  And then he heard something - something quite apart from the spitting of the dying candles and Lockhart's prattle about his fans.  It was a voice, a voice to chill the bone marrow, a voice of breathtaking, ice-cold venom.  \"Come ... come to me.... Let me rip you.... Let me tear you .... Let me kill you . . . .\"  Harry gave a huge jump and a large lilac blot appeared on Veronica Smethley's street.  \"What?\" he said loudly.  \"I know!\" said Lockhart. \"Six solid months at the top of the best- seller list! Broke all records!\"  \"No,\" said Harry frantically. \"That voice!\"  \"Sorry?\" said Lockhart, looking puzzled. \"What voice?\"  \"That - that voice that said - didn't you hear it?\"  Lockhart was looking at Harry in high astonishment.  * 3-2o *  \"What are you talking about, Harry? Perhaps you're getting a litde drowsy? Great Scott - look at the time! We've been here nearly four hours! Id never have believed it - the time's flown, hasn't it?\"  Harry didn't answer. He was straining his ears to hear the voice again, but there was no sound now except for Lockhart telling him he mustn't expect a treat like this every time he got detention. Feeling dazed, Harry left.  It was so late that the Gryffindor common room was almost empty. Harry went straight up to the dormitory. Ron wasn't back yet. Harry pulled on his pajamas, got into bed, and waited. Half an hour later, Ron arrived, nursing his right arm and bringing a strong smell of polish into the darkened room.  \"My muscles have all seized up,\" he groaned, sinking on his bed. \"Fourteen times he made me buff up that Quidditch cup before he was satisfied. And then I had another slug attack all over a Special Award for Services to the School. Took ages to get the slime off... How was it with Lockhart?\"  Keeping his voice low so as not to wake Neville, Dean, and Seamus, Harry told Ron exactly what he had heard.  \"And Lockhart said he couldn't hear it?\" said Ron. Harry could see him frowning in the moonlight. \"D'you think he was lying? But I don't get it - even someone invisible would've had to open the door.\"  \"I know,\" said Harry, lying back in his four-poster and staring at the canopy above him. \"I don't get it either.\"  * 12-1 *  122 October arrived, spreading a damp chill over the grounds and into the castle. Madam Pomfrey, the nurse, was kept busy by a sudden spate of colds among the staff and students. Her Pepperup potion worked instantly, though it left the drinker smoking at the ears for several hours afterward. Ginny Weasley, who had been looking pale, was bullied into taking some by Percy. The steam pouring from under her vivid hair gave the impression that her whole head was on fire. Raindrops the size of bullets thundered on the castle windows for days on end; the lake rose, the flower beds turned into muddy streams, and Hagrid's pumpkins swelled to the size of garden sheds."
}