{
  "id": "198dd8961c9f0ce436d83cff818dab1953b558bb",
  "text": "  Pod shuffled his feet.  I’m sorry.    Why? Is it your fault that Bronn’s an insolent black-hearted rogue? He’s always been an insolent black-hearted rogue. That’s what I liked about him.  Tyrion poured himself a cup of wine and took it to the window seat. Outside the day was grey and rainy, but the prospect was still more cheerful than his. He could send Podrick Payne questing after Shagga, he supposed, but there were so many hiding places in the deep of the kingswood that outlaws often evaded capture for decades. And Pod sometimes has difficulty finding the kitchens when I send him down for cheese. Timett son of Timett would likely be back in the Mountains of the Moon by now. And despite what he’d told Bronn, going up against Ser Gregor Clegane in his own person would be a bigger farce than Joffrey’s jousting dwarfs. He did not intend to die with gales of laughter ringing in his ears. So much for trial by combat.  Ser Kevan paid him another call later that day, and again the day after. Sansa had not been found, his uncle informed him politely. Nor the fool Ser Dontos, who’d vanished the same night. Did Tyrion have any more witnesses he wished to summon? He did not. How do I bloody well prove I didn’t poison the wine, when a thousand people saw me fill Joff’s cup?  He did not sleep at all that night.  Instead he lay in the dark, staring up at the canopy and counting his ghosts. He saw Tysha smiling as she kissed him, saw Sansa naked and shivering in fear. He saw Joffrey clawing his throat, the blood running down his neck as his face turned black. He saw Cersei’s eyes, Bronn’s wolfish smile, Shae’s wicked grin. Even thought of Shae could not arouse him. He fondled himself, thinking that perhaps if he woke his cock and satisfied it, he might rest more easily afterward, but it was no good.  And then it was dawn, and time for his trial to begin.  It was not Ser Kevan who came for him that morning, but Ser Addam Marbrand with a dozen gold cloaks. Tyrion had broken his fast on boiled eggs, burned bacon, and fried bread, and dressed in his finest.  Ser Addam,  he said.  I had thought my father might send the Kingsguard to escort me to trial. I am still a member of the royal family, am I not?    You are, my lord, but I fear that most of the Kingsguard stand witness against you. Lord Tywin felt it would not be proper for them to serve as your guards.    Gods forbid we do anything improper. Please, lead on.   He was to be tried in the throne room, where Joffrey had died. As Ser Addam marched him through the towering bronze doors and down the long carpet, he felt the eyes upon him. Hundreds had crowded in to see him judged. At least he hoped that was why they had come. For all I know, they’re all witnesses against me. He spied Queen Margaery up in the gallery, pale and beautiful in her mourning. Twice wed and twice widowed, and only sixteen. Her mother stood tall to one side of her, her grandmother small on the other, with her ladies in waiting and her father’s household knights packing the rest of the gallery.  The dais still stood beneath the empty Iron Throne, though all but one table had been removed. Behind it sat stout Lord Mace Tyrell in a gold mantle over green, and slender Prince Oberyn Martell in flowing robes of striped orange, yellow, and scarlet. Lord Tywin Lannister sat between them. Perhaps there’s hope for me yet. The Dornishman and the Highgardener despised each other. If I can find a way to use that…  The High Septon began with a prayer, asking the Father Above to guide them to justice. When he was done the father below leaned forward to say,  Tyrion, did you kill King Joffrey?   He would not waste a heartbeat.  No.    Well, that’s a relief,  said Oberyn Martell dryly.   Did Sansa Stark do it, then?  Lord Tyrell demanded.  I would have, if I’d been her. Yet wherever Sansa was and whatever her part in this might have been, she remained his wife. He had wrapped the cloak of his protection about her shoulders, though he’d had to stand on a fool’s back to do it.  The gods killed Joffrey. He choked on his pigeon pie.   Lord Tyrell reddened.  You would blame the bakers?    Them, or the pigeons. Just leave me out of it.  Tyrion heard nervous laughter, and knew he’d made a mistake. Guard your tongue, you little fool, before it digs your grave.   There are witnesses against you,  Lord Tywin said.  We shall hear them first. Then you may present your own witnesses. You are to speak only with our leave.   There was naught that Tyrion could do but nod.  Ser Addam had told it true; the first man ushered in was Ser Balon Swann of the Kingsguard.  Lord Hand,  he began, after the High Septon had sworn him to speak only truth,  I had the honor to fight beside your son on the bridge of ships. He is a brave man for all his size, and I will not believe he did this thing.   A murmur went through the hall, and Tyrion wondered what mad game Cersei was playing. Why offer a witness that believes me innocent? He soon learned."
}