{
  "id": "1a546e15135e041f5d07288ffc9712f68ee8f67f",
  "text": "  His next present also contained candy -- a large box of Chocolate Frogs from Hermione.  This only left one parcel. Harry picked it up and felt it. It was very light. He unwrapped it.  Something fluid and silvery gray went slithering to the floor where it lay in gleaming folds. Ron gasped.  \"I've heard of those,\" he said in a hushed voice, dropping the box of Every Flavor Beans he'd gotten from Hermione. \"If that's what I think it is -- they're really rare, and really valuable.\"  \"What is it?\"  Harry picked the shining, silvery cloth off the floor. It was strange to the touch, like water woven into material.  \"It's an invisibility cloak,\" said Ron, a look of awe on his face. \"I'm sure it is -- try it on.\"  Harry threw the cloak around his shoulders and Ron gave a yell.  \"It is! Look down!\"  Harry looked down at his feet, but they were gone. He dashed to the mirror. Sure enough, his reflection looked back at him, just his head suspended in midair, his body completely invisible. He pulled the cloak over his head and his reflection vanished completely.  \"There's a note!\" said Ron suddenly. \"A note fell out of it!\"  Harry pulled off the cloak and seized the letter. Written in narrow, loopy writing he had never seen before were the following words: Your father left this in my possession before he died. It is time it was returned to you. Use it well.  A Very Merry Christmas to you.   There was no signature. Harry stared at the note. Ron was admiring the cloak.  \"I'd give anything for one of these,\" he said. \"Anything. What's the matter?\"  \"Nothing,\" said Harry. He felt very strange. Who had sent the cloak? Had it really once belonged to his father?  Before he could say or think anything else, the dormitory door was flung open and Fred and George Weasley bounded in. Harry stuffed the cloak quickly out of sight. He didn't feel like sharing it with anyone else yet.  \"Merry Christmas!\"  \"Hey, look -- Harry's got a Weasley sweater, too!\"  Fred and George were wearing blue sweaters, one with a large yellow F on it, the other a G.  \"Harry's is better than ours, though,\" said Fred, holding up Harry's sweater. \"She obviously makes more of an effort if you're not family.\"  \"Why aren't you wearing yours, Ron?\" George demanded. \"Come on, get it on, they're lovely and warm.\"  \"I hate maroon,\" Ron moaned halfheartedly as he pulled it over his head.  \"You haven't got a letter on yours,\" George observed. \"I suppose she thinks you don't forget your name. But we're not stupid -- we know we're called Gred and Forge.\"  \"What's all th is noise.  Percy Weasley stuck his head through the door, looking disapproving. He had clearly gotten halfway through unwrapping his presents as he, too, carried a lumpy sweater over his arm, which  Fred seized.  \"P for prefect! Get it on, Percy, come on, we're all wearing ours, even Harry got one.\"  \"I -- don't -- want said Percy thickly, as the twins forced the sweater over his head, knocking his glasses askew.  \"And you're not sitting with the prefects today, either,\" said  George. \"Christmas is a time for family.\"  They frog-marched Percy from the room, his arms pinned to his side by his sweater.  Harry had never in all his life had such a Christmas dinner. A hundred fat, roast turkeys; mountains of roast and boiled potatoes; platters of chipolatas; tureens of buttered peas, silver boats of thick, rich gravy and cranberry sauce -- and stacks of wizard crackers every few feet along the table. These fantastic party favors were nothing like the feeble Muggle ones the Dursleys usually bought, with their little plastic toys and their flimsy paper hats inside. Harry pulled a wizard cracker with Fred and it didn't just bang, it went off with a blast like a cannon and engulfed them all in a cloud of blue smoke, while from the inside exploded a rear admiral's hat and several live, white mice. Up at the High Table, Dumbledore had swapped his pointed wizard's hat for a flowered bonnet, and was chuckling merrily at a joke Professor Flitwick had just read him.  Flaming Christmas puddings followed the turkey. Percy nearly broke his teeth on a silver sickle embedded in his slice. Harry watched Hagrid getting redder and redder in the face as he called for more wine, finally kissing Professor McGonagall on the cheek, who, to Harry's amazement, giggled and blushed, her top hat lopsided.  When Harry finally left the table, he was laden down with a stack of things out of the crackers, including a pack of nonexplodable, luminous balloons, a Grow-Your-Own-Warts kit, and his own new wizard chess set. The white mice had disappeared and Harry had a nasty feeling they were going to end up as Mrs. Norris's Christmas dinner.  Harry and the Weasleys spent a happy afternoon having a furious snowball fight on the grounds. Then, cold, wet, and gasping for breath, they returned to the fire in the Gryffindor common room, where Harry broke in his new chess set by losing spectacularly to Ron. He suspected he wouldn't have lost so badly if Percy hadn't tried to help him so much."
}