{
  "id": "1b315295a11b9e2a6b0c2e7b3769d77f407df9f2",
  "text": " He thought he could smell her, but he wasn’t sure. All of them stank alike, and he did not have Summer’s nose to tell one from the other.  Last night I pissed on a king’s foot,  Osha went on.  Might be it was morning, who can say? I was sleeping, but now I’m not.  They all slept a lot, not only Bran. There was nothing else to do, Sleep and eat and sleep again, and sometimes talk a little… but not too much, and only in whispers, just to be safe. Osha might have liked it better if they had never talked at all, but there was no way to quiet Rickon, or to stop Hodor from muttering,  Hodor, hodor, hodor,  endlessly to himself.   Osha,  Bran said,  I saw Winterfell burning.  Off to his left, he could hear the soft sound of Rickon’s breathing.   A dream,  said Osha.   A wolf dream,  said Bran.  I smelled it too. Nothing smells like fire, or blood.    Whose blood?    Men, horses, dogs, everyone. We have to go see.    This scrawny skin of mine’s the only one I got,  said Osha.  That squid prince catches hold o’ me, they’ll strip it off my back with a whip.   Meera’s hand found Bran’s in the darkness and gave his fingers a squeeze.  I’ll go if you’re afraid.   Bran heard fingers fumbling at leather, followed by the sound of steel on flint. Then again. A spark flew, caught. Osha blew softly. A long pale flame awoke, stretching upward like a girl on her toes. Osha’s face floated above it. She touched the flame with the head of a torch. Bran had to squint as the pitch began to burn, filling the world with orange glare. The light woke Rickon, who sat up yawning.  When the shadows moved, it looked for an instant as if the dead were rising as well. Lyanna and Brandon, Lord Rickard Stark their father, Lord Edwyle his father, Lord Willam and his brother Artos the Implacable, Lord Donnor and Lord Beron and Lord Rodwell, one-eyed Lord Jonnel, Lord Barth and Lord Brandon and Lord Cregan who had fought the Dragonknight. On their stone chairs they sat with stone wolves at their feet. This was where they came when the warmth had seeped out of their bodies; this was the dark hall of the dead, where the living feared to tread.  And in the mouth of the empty tomb that waited for Lord Eddard Stark, beneath his stately granite likeness, the six fugitives huddled round their little cache of bread and water and dried meat.  Little enough left,  Osha muttered as she blinked down on their stores.  I’d need to go up soon to steal food in any case, or we’d be down to eating Hodor.    Hodor,  Hodor said, grinning at her.   Is it day or night up there?  Osha wondered.  I’ve lost all count o’ such.    Day,  Bran told her,  but it’s dark from all the smoke.    M’lord is certain?   Never moving his broken body, he reached out all the same, and for an instant he was seeing double. There stood Osha holding the torch, and Meera and Jojen and Hodor, and the double row of tall granite pillars and long dead lords behind them stretching away into darkness… but there was Winterfell as well, grey with drifting smoke, the massive oak-and-iron gates charred and askew, the drawbridge down in a tangle of broken chains and missing planks. Bodies floated in the moat, islands for the crows.   Certain,  he declared.  Osha chewed on that a moment.  I’ll risk a look then. I want the lot o’ you close behind. Meera, get Bran’s basket.    Are we going home?  Rickon asked excitedly.  I want my horse. And I want applecakes and butter and honey, and Shaggy. Are we going where Shaggydog is?    Yes,  Bran promised,  but you have to be quiet.   Meera strapped the wicker basket to Hodor’s back and helped lift Bran into it, easing his useless legs through the holes. He had a queer flutter in his belly. He knew what awaited them above, but that did not make it any less fearful. As they set off, he turned to give his father one last look, and it seemed to Bran that there was a sadness in Lord Eddard’s eyes, as if he did not want them to go. We have to, he thought. It’s time.  Osha carried her long oaken spear in one hand and the torch in the other. A naked sword hung down her back, one of the last to bear Mikken’s mark. He had forged it for Lord Eddard’s tomb, to keep his ghost at rest. But with Mikken slain and the ironmen guarding the armory, good steel had been hard to resist, even if it meant grave-robbing. Meera had claimed Lord Rickard’s blade, though she complained that it was too heavy. Brandon took his namesake’s, the sword made for the uncle he had never known. He knew he would not be much use in a fight, but even so the blade felt good in his hand.  But it was only a game, and Bran knew it.  Their footsteps echoed through the cavernous crypts. The shadows behind them swallowed his father as the shadows ahead retreated to unveil other statues; no mere lords, these, but the old Kings in the North. On their brows they wore stone crowns. Torrhen Stark, the King Who Knelt. Edwyn the Spring King. Theon Stark, the Hungry Wolf. Brandon the Burner and Brandon the Shipwright. Jorah and Jonos, Brandon the Bad, Walton the Moon King, Edderion the Bridegroom, Eyron, Benjen the Sweet and Benjen the Bitter, King Edrick Snowbeard."
}