{
  "id": "1b4fa8cb77457bd8dc4177eac6bd77dbeaeb07e5",
  "text": "       They went forward steadily, but they soon saw that the Road was further   away  than  they  had  imagined. Even without a fog,  their sleep at mid-day  would have prevented them from reaching it  until after nightfall on the day  before.  The dark line they had seen was  not  a line of trees but a line of  bushes growing on the edge  of a deep dike with  a steep wall on the further   side.  Tom said that it had once been  the boundary of a kingdom, but a very  long lime ago. He seemed to remember  something sad about it, and would  not   ####-say much.       They climbed down  and out  of the dike and through a gap  in the wall,  and then  Tom turned due north, for they  had been  bearing  somewhat to the  west. The land was now open and fairly level, and they quickened their pace,  but  the  sun was already sinking low when at  last  they saw a line of tall  trees  ahead,  and they knew that they had come back  to the Road after many  unexpected adventures.  They galloped their ponies  over  the last furlongs,   and halted u nder the long shadows of the trees. They  were on  the  top of a   sloping bank,  and  the Road,  now dim as evening drew on, wound away   below  them. At this point  it ran nearly  from South-west  to North-east,  and  on  their right it  fell quickly down into a wide hollow. It was rutted and bore  many signs of the recent heavy rain; there were pools and pot-holes  full of  water. They rode down the  bank and looked up and down. There was nothing  to  be  seen. 'Well,  here we  are again at  last!'  said  Frodo.  'I suppose  we  haven't  lost more than two days  by  my short  cut through the Forest!  But  perhaps the delay will prove useful  - it may have put them off our trail.'       The others looked at  him.  The shadow of the fear of the  Black Riders  came suddenly over them  again. Ever since they had entered  the Forest they  had thought chiefly of getting back  to  the  Road;  only  now  when it  lay  beneath their feet  did they remember the danger which pursued them, and was  more than likely  to be  lying in wait for  them upon the Road  itself. They  looked anxiously back towards the setting sun,  but  the Road was  brown and  empty.       'Do you  think,'  asked Pippin hesitatingly,  'do you  think we may  be  pursued, tonight?'       'No, I hope not  tonight,' answered Tom Bombadil; 'nor perhaps the next  day. But do not trust my guess; for I  cannot tell  for certain. Out east my  knowledge fails. Tom is not master of  Riders from the Black Land far beyond  his country.'       All the same the hobbits wished he was coming with them. They felt that  he would know how to deal with Black Riders,  if anyone did. They would  soon  now  be going forward  into lands wholly strange to them, and beyond all but  the  most  vague and  distant  legends  of the Shire, and in  the  gathering  twilight they longed for home. A  deep  loneliness and sense  of loss was on    ####-them.  They stood  silent,  reluctant to make  the final  parting, and  only  slowly  became aware that Tom was wishing them farewell, and telling them to  have good heart and to ride on till dark without halting.       'Tom will give you good advice, till this day is over  (after that your  own  luck must go with you and  guide you): four miles along the Road you'll  come  upon a village,  Bree under Bree -hill, with  doors  looking  westward.   There you'll  find an  old inn that  is  called The  Prancing Pony. Barliman  Butterbur is the worthy keeper. There you can stay the night, and afterwards  the morning  will speed you upon your way.  Be  bold, but wary! Keep up your  merry hearts, and ride to meet your fortune!'       They begged him to come at least as far as the inn and  drink once more  with them; but he laughed and refused, saying:       Tom's country ends here: he will not pass the borders.       Tom has his house to mind, and Goldberry is waiting!       Then  he turned, tossed up his hat, leaped on Lumpkin's  back, and rode  up over the bank and away singing into the dusk.       The hobbits climbed up and watched him until he was out of sight.       'I  am sorry  to  take  leave of  Master  Bombadil,' said Sam.  'He's a   caution and  no mistake.  I  reckon  we may go  a  good deal further and see  naught  better,  nor queerer. But  I  won't deny I'll be  glad to  see  this  Prancing  Pony he spoke of. I hope  it'll be like The Green Dragon away back   home! What sort of folk are they in Bree?'       'There  are  hobbits in Bree,'  said Merry,  'as well as  Big  Folk.  I  daresay it will be homelike  enough. The Pony is a good inn by all accounts.   My people ride out there now and again.'       'It may be all we could wish,' said Frodo; 'but it is outside the Shire  all the same. Don't  make yourselves  too much at home! Please remember -all  of you - that the name of Baggins must NOT be mentioned. I am Mr. Underhill,  if any name must be given.'       They now mounted  their ponies and rode off  silently into the evening."
}