{
  "id": "1b63b719e1dfa284967361b8ca24ee70dae43311",
  "text": " And while old Cohollo treated her kindly enough, the others frightened her; Haggo, huge and silent, often glowered as if he had forgotten who she was, and Qotho had cruel eyes and quick hands that liked to hurt. He left bruises on Doreah’s soft white skin whenever he touched her, and sometimes made Irri sob in the night. Even his horses seemed to fear him.  Yet they were bound to Drogo for life and death, so Daenerys had no choice but to accept them. And sometimes she found herself wishing her father had been protected by such men. In the songs, the white knights of the Kingsguard were ever noble, valiant, and true, and yet King Aerys had been murdered by one of them, the handsome boy they now called the Kingslayer, and a second, Ser Barristan the Bold, had gone over to the Usurper. She wondered if all men were as false in the Seven Kingdoms. When her son sat the Iron Throne, she would see that he had bloodriders of his own to protect him against treachery in his Kingsguard.   Khaleesi,  Cohollo said to her, in Dothraki.  Drogo, who is blood of my blood, commands me to tell you that he must ascend the Mother of Mountains this night, to sacrifice to the gods for his safe return.   Only men were allowed to set foot on the Mother, Dany knew. The khal’s bloodriders would go with him, and return at dawn.  Tell my sun-and-stars that I dream of him, and wait anxious for his return,  she replied, thankful. Dany tired more easily as the child grew within her; in truth, a night of rest would be most welcome. Her pregnancy only seemed to have inflamed Drogo’s desire for her, and of late his embraces left her exhausted.  Doreah led her to the hollow hill that had been prepared for her and her khal. It was cool and dim within, like a tent made of earth.  Jhiqui, a bath, please,  she commanded, to wash the dust of travel from her skin and soak her weary bones. It was pleasant to know that they would linger here for a while, that she would not need to climb back on her silver on the morrow.  The water was scalding hot, as she liked it.  I will give my brother his gifts tonight,  she decided as Jhiqui was washing her hair.  He should look a king in the sacred city. Doreah, run and find him and invite him to sup with me.  Viserys was nicer to the Lysene girl than to her Dothraki handmaids, perhaps because Magister Illyrio had let him bed her back in Pentos.  Irri, go to the bazaar and buy fruit and meat. Anything but horseflesh.    Horse is best,  Irri said.  Horse makes a man strong.    Viserys hates horsemeat.    As you say, Khaleesi.   She brought back a haunch of goat and a basket of fruits and vegetables. Jhiqui roasted the meat with sweetgrass and firepods, basting it with honey as it cooked, and there were melons and pomegranates and plums and some queer eastern fruit Dany did not know. While her handmaids prepared the meal, Dany laid out the clothing she’d had made to her brother’s measure: a tunic and leggings of crisp white linen, leather sandals that laced up to the knee, a bronze medallion belt, a leather vest painted with fire-breathing dragons. The Dothraki would respect him more if he looked less a beggar, she hoped, and perhaps he would forgive her for shaming him that day in the grass. He was still her king, after all, and her brother. They were both blood of the dragon.  She was arranging the last of his gifts—a sandsilk cloak, green as grass, with a pale grey border that would bring out the silver in his hair—when Viserys arrived, dragging Doreah by the arm. Her eye was red where he’d hit her.  How dare you send this whore to give me commands,  he said. He shoved the handmaid roughly to the carpet.  The anger took Dany utterly by surprise.  I only wanted… Doreah, what did you say?    Khaleesi, pardons, forgive me. I went to him, as you bid, and told him you commanded him to join you for supper.    No one commands the dragon,  Viserys snarled.  I am your king! I should have sent you back her head!   The Lysene girl quailed, but Dany calmed her with a touch.  Don’t be afraid, he won’t hurt you. Sweet brother, please, forgive her, the girl misspoke herself, I told her to ask you to sup with me, if it pleases Your Grace.  She took him by the hand and drew him across the room.  Look. These are for you.   Viserys frowned suspiciously.  What is all this?    New raiment. I had it made for you.  Dany smiled shyly.  He looked at her and sneered.  Dothraki rags. Do you presume to dress me now?    Please… you’ll be cooler and more comfortable, and I thought… maybe if you dressed like them, the Dothraki…  Dany did not know how to say it without waking his dragon.   Next you’ll want to braid my hair.    I’d never…  Why was he always so cruel? She had only wanted to help.  You have no right to a braid, you have won no victories yet.   It was the wrong thing to say. Fury shone from his lilac eyes, yet he dared not strike her, not with her handmaids watching and the warriors of her khas outside. Viserys picked up the cloak and sniffed at it."
}