{
  "id": "1bb23a61f987600b737572d0b19addb6534145ef",
  "text": "    You do it.  Elmar could be friendly when he needed help, but afterward he would always remember that he was a squire and she was only a serving girl, He liked to boast how he was the son of the Lord of the Crossing, not a nephew or a bastard or a grandson but a trueborn son, and on account of that he was going to marry a princess.  Arya didn’t care about his precious princess, and didn’t like him giving her commands.  I have to bring m’lord water for his basin. He’s in his bedchamber being leeched. Not the regular black leeches but the big pale ones.   Elmar’s eyes got as big as boiled eggs. Leeches terrified him, especially the big pale ones that looked like jelly until they filled up with blood.  I forgot, you’re too skinny to push such a heavy barrel.    I forgot, you’re stupid.  Arya picked up the pail.  Maybe you should get leeched too. There’s leeches in the Neck as big as pigs.  She left him there with his barrel.  The lord’s bedchamber was crowded when she entered. Qyburn was in attendance, and dour Walton in his mail shirt and greaves, plus a dozen Freys, all brothers, half brothers, and cousins. Roose Bolton lay abed, naked. Leeches clung to the inside of his arms and legs and dotted his pallid chest, long translucent things that turned a glistening pink as they fed. Bolton paid them no more mind than he did Arya.   We must not allow Lord Tywin to trap us here at Harrenhal,  Ser Aenys Frey was saying as Arya filled the washbasin. A grey stooped giant of a man with watery red eyes and huge gnarled hands, Ser Aenys had brought fifteen hundred Frey swords south to Harrenhal, yet it often seemed as if he were helpless to command even his own brothers.  The castle is so large it requires an army to hold it, and once surrounded we cannot feed an army. Nor can we hope to lay in sufficient supplies. The country is ash, the villages given over to wolves, the harvest burnt or stolen. Autumn is on us, yet there is no food in store and none being planted. We live on forage, and if the Lannisters deny that to us, we will be down to rats and shoe leather in a moon’s turn.    I do not mean to be besieged here.  Roose Bolton’s voice was so soft that men had to strain to hear it, so his chambers were always strangely hushed.   What, then?  demanded Ser Jared Frey, who was lean, balding, and pockmarked.  Is Edmure Tully so drunk on his victory that he thinks to give Lord Tywin battle in the open field?   If he does he’ll beat them, Arya thought. He’ll beat them as he did on the Red Fork, you’ll see. Unnoticed, she went to stand by Qyburn.   Lord Tywin is many leagues from here,  Bolton said calmly.  He has many matters yet to settle at King’s Landing. He will not march on Harrenhal for some time.   Ser Aenys shook his head stubbornly.  You do not know the Lannisters as we do, my lord. King Stannis thought that Lord Tywin was a thousand leagues away as well, and it undid him.   The pale man in the bed smiled faintly as the leeches nursed of his blood.  I am not a man to be undone, ser.    Even if Riverrun marshals all its strength and the Young Wolf wins back from the west, how can we hope to match the numbers Lord Tywin can send against us? When he comes, he will come with far more power than he commanded on the Green Fork. Highgarden has joined itself to Joffrey’s cause, I remind you!    I had not forgotten.    I have been Lord Tywin’s captive once,  said Ser Hosteen, a husky man with a square face who was said to be the strongest of the Freys.  I have no wish to enjoy Lannister hospitality again.   Ser Harys Haigh, who was a Frey on his mother’s side, nodded vigorously.  If Lord Tywin could defeat a seasoned man like Stannis Baratheon, what chance will our boy king have against him?  He looked round to his brothers and cousins for support, and several of them muttered agreement.   Someone must have the courage to say it,  Ser Hosteen said.  The war is lost. King Robb must be made to see that.   Roose Bolton studied him with pale eyes.  His Grace has defeated the Lannisters every time he has faced them in battle.    He has lost the north,  insisted Hosteen Frey.  He has lost Winterfell! His brothers are dead…   For a moment Arya forgot to breathe. Dead? Bran and Rickon, dead? What does he mean? What does he mean about Winterfell, Joffrey could never take Winterfell, never, Robb would never let him. Then she remembered that Robb was not at Winterfell. He was away in the west, and Bran was crippled, and Rickon only four. It took all her strength to remain still and silent, the way Syrio Forel had taught her, to stand there like a stick of furniture. She felt tears gathering in her eyes, and willed them away. It’s not true, it can’t be true, it’s just some Lannister lie.   Had Stannis won, all might have been different,  Ronel Rivers said wistfully. He was one of Lord Walder’s bastards.   Stannis lost,  Ser Hosteen said bluntly.  Wishing it were otherwise will not make it so. King Robb must make his peace with the Lannisters."
}