{
  "id": "1bfd9ad0172fcedd68f886fa6b86f2b7f9604c18",
  "text": "  \"Without any supper?\" said Snape, a triumphant smile flickering across his gaunt face. \"I didn't think ghosts provided food fit for living people at their parties.\"  \"We weren't hungry,\" said Ron loudly as his stomach gave a huge rumble.  Snape's nasty smile widened.  *143*  \"I suggest, Headmaster, that Potter is not being entirely truthful,\" he said. \"It might be a good idea if he were deprived of certain privileges until he is ready to tell us the whole story. I personally feel he should be taken off the Gryffindor Quidditch team until he is ready to be honest.\"  \"Really, Severus,\" said Professor McGonagall sharply, \"I see no reason to stop the boy playing Quidditch. This cat wasn't hit over the head with a broomstick. There is no evidence at all that Potter has done anything wrong.\"  Dumbledore was giving Harry a searching look. His twinkling light- blue gaze made Harry feel as though he were being X-rayed.  \"Innocent until proven guilty, Severus,\" he said firmly.  Snape looked furious. So did Filch.  \"My cat has been Petrified!\" he shrieked, his eyes popping. \"I want to see some punishment!\"  \"We will be able to cure her, Argus,\" said Dumbledore patiently. \"Professer Sprout recently managed to procure some Mandrakes. As soon as they have reached their full size, I will have a potion made that will revive Mrs. Norris.\"  \"I'll make it,\" Lockhart butted in. \"I must have done it a hundred times. I could whip up a Mandrake Restorative Draught in my sleep -\"  \"Excuse me,\" said Snape icily. \"But I believe I am the Potions master at this school.\"  There was a very awkward pause.  \"You may go,\" Dumbledore said to Harry, Ron, and Hermione.  They went, as quickly as they could without actually running. When they were a floor up from Lockhart's office, they turned into  *144*  an empty classroom and closed the door quietly behind them. Harry squinted at his friends' darkened faces.  \"D'you think I should have told them about that voice I heard?\"  \"No,\" said Ron, without hesitation. \"Hearing voices no one else can hear isn't a good sign, even in the wizarding world.\"  Something in Ron's voice made Harry ask, \"You do believe me, don't you?\"  \"'Course I do,\" said Ron quickly. \"But -you must admit it's weird ......  \"I know it's weird,\" said Harry. \"The whole thing's weird. What was that writing on the wall about? The Cbamber Has Been Opened... What's that supposed to mean?\"  \"You know, it rings a sort of bell,\" said Ron slowly. \"I think someone told me a story about a secret chamber at Hogwarts once ... might've been Bill . . . .\"  \"And what on earth's a Squib?\" said Harry.  To his surprise, Ron stifled a snigger.  \"Well - it's not funny really - but as it's Filch, he said. \"A Squib is someone who was born into a wizarding family but hasn't got any magic powers. Kind of the opposite of Muggle-born wizards, but Squibs are quite unusual. If Filch's trying to learn magic from a Kwikspell course, I reckon he must be a Squib. It would explain a lot. Like why he hates students so much.\" Ron gave a satisfied smile. \"He's bitter.\"  A clock chimed somewhere.  \"Midnight,\" said Harry. \"We'd better get to bed before Snape comes along and tries to frame us for something else.\"  *145*    For a few days, the school could talk of little else but the attack on Mrs. Norris. Filch kept it fresh in everyone's minds by pacing the spot where she had been attacked, as though he thought the attacker might come back. Harry had seen him scrubbing the message on the wall with Mrs. Skower's All-Purpose Magical Mess Remover, but to no effect; the words still gleamed as brightly as ever on the stone. When Filch wasn't guarding the scene of the crime, he was skulking red- eyed through the corridors, lunging out at unsuspecting students and trying to put them in detention for things like \"breathing loudly' and \"looking happy.\"  Ginny Weasley seemed very disturbed by Mrs. Norris's fate. According to Ron, she was a great cat lover.  \"But you haven't really got to know Mrs. Norris,\" Ron told her bracingly. \"Honestly, we're much better off without her.\" Ginny's lip trembled. \"Stuff like this doesn't often happen at Hogwarts,\" Ron assured her. \"They'll catch the maniac who did it and have him out of here in no time. I just hope he's got time to Petrify Filch before he's expelled. I'm only joking -\" Ron added hastily as Ginny blanched.  The attack had also had an effect on Hermione. It was quite usual for Hermione to spend a lot of time reading, but she was now doing almost nothing else. Nor could Harry and Ron get much response from her when they asked what she was up to, and not until the following Wednesday did they find out.  Harry had been held back in Potions, where Snape had made him stay behind to scrape tubeworms off the desks. After a hurried lunch, he went upstairs to meet Ron in the library, and saw Justin Finch- Fletchley, the Hufflepuff boy from Herbology, coming  *146*  toward him. Harry had just opened his mouth to say hello when Justin caught sight of him, turned abruptly, and sped off in the opposite direction."
}