{
  "id": "1c45638bf2e2569e37e5bf276143a2e20e5a1bab",
  "text": " \"They got in on pure talent.\"  The smug look on Malfoy's face flickered.  \"No one asked your opinion, you fiIthy little Mudblood,\" he spat.  Harry knew at once that Malfoy had said something really bad because there was an instant uproar at his words. Flint had to dive in front of Malfoy to stop Fred and George jumping on him, Alicia shrieked, \"How dare you!\" ; and Ron plunged his hand into his robes, pulled out his wand, yelling, \"You'll pay for that one, Malfoy!\" and pointed it furiously under Flint's arm at Malfoys face.  A loud bang echoed around the stadium and a jet of green light shot out of the wrong end of Ron's wand, hitting him in the stomach and sending him reeling backward onto the grass.  12  \"Ron! Ron! Are you all right?\" squealed Hermione.  Ron opened his mouth to speak, but no words came out. Instead he gave an almighty belch and several slugs dribbled out of his mouth onto his lap.  The Slytherin team were paralyzed with laughter. Flint was doubled up, hanging onto his new broomstick for support. Malfoy was on all fours, banging the ground with his fist. The Gryffindors were gathered around Ron, who kept belching large, glistening slugs. Nobody seemed to want to touch him.  \"We'd better get him to Hagrid's, it's nearest,\" said Harry to Hermione, who nodded bravely, and the pair of them pulled Ron up by the arms.  \"What happened, Harry? What happened? Is he ill? But you can cure him, can't you?\" Colin had run down from his seat and was now dancing alongside them as they left the field. Ron gave a huge heave and more slugs dribbled down his front.  \"Oooh,\" said Colin, fascinated and raising his camera. \"Can you hold him still, Harry?\"  \"Get out of the way, Colin!\" said Harry angrily. He and Hermione supported Ron out of the stadium and across the grounds toward the edge of the forest.  \"Nearly there, Ron,\" said Hermione as the gamekeeper's cabin came into view. \"You'll be all right in a minute - almost there -\"  They were within twenty feet of Hagrid's house when the front door opened, but it wasn't Hagrid who emerged. Gilderoy Lockhart, wearing robes of palest mauve today, came striding out.  \"Quick, behind here,\" Harry hissed, dragging Ron behind a nearby bush. Hermione followed, somewhat reluctantly.  *113* *  \"It's a simple matter if you know what you're doing!\" Lockhart was saying loudly to Hagrid. \"If you need help, you know where I am! I'll let you have a copy of my book. I'm surprised you haven't already got one - I'll sign one tonight and send it over. Well, good-bye!\" And he strode away toward the castle.  Harry waited until Lockhart was out of sight, then pulled Ron out of the bush and up to Hagrid's front door. They knocked urgently.  Hagrid appeared at once, looking very grumpy, but his expression brightened when he saw who it was.  \"Bin wonderin' when you'd come ter see me - come in, come in - thought you mighta bin Professor Lockhart back again -\"  Harry and Hermione supported Ron over the threshold into the one- roomed cabin, which had an enormous bed in one corner, a fire crackling merrily in the other. Hagrid didn't seem perturbed by Ron's slug problem, which Harry hastily explained as he lowered Ron into a chair.  \"Better out than in,\" he said cheerfully, plunking a large copper basin in front of him. \"Get 'em all up, Ron.\"  \"I don't think there's anything to do except wait for it to stop,\" said Hermione anxiously, watching Ron bend over the basin. \"That's a difficult curse to work at the best of times, but with a broken wand -\"  Hagrid was bustling around making them tea. His boarhound, Fang, was slobbering over Harry.  \"What did Lockhart want with you, Hagrid?\" Harry asked, scratching Fang's ears.  \"Givin' me advice on gettin' kelpies out of a well,\" growled  *114*  Hagrid, moving a half-plucked rooster off his scrubbed table and setting down the teapot. \"Like I don' know. An' bangin' on about some banshee he banished. If one word of it was true, I'll eat my kettle.\"  It was most unlike Hagrid to criticize a Hogwarts' teacher, and Harry looked at him in surprise. Hermione, however, said in a voice somewhat higher than usual, \"I think you're being a bit unfair. Professor Dumbledore obviously thought he was the best man for the job -\"  \"He was the on' man for the job,\" said Hagrid, offering them a Y  plate of treacle fudge, while Ron coughed squelchily into his basin. \"An' I mean the on' one. Gettin' very difficult ter find anyone fer Y  the Dark Arts job. People aren't too keen ter take it on, see. They're startin' ter think it's jinxed. No one's lasted long fer a while now. So tell me,\" said Hagrid, jerking his head at Ron. \"Who was he tryin' ter curse?\"  \"Malfoy called Hermione something - it must've been really bad, because everyone went wild.\"  \"It was bad,\" said Ron hoarsely, emerging over the tabletop looking pale and sweaty. \"Malfoy called her `Mudblood,' Hagrid -\"  Ron dived out of sight again as a fresh wave of slugs made their appearance. Hagrid looked outraged."
}