{
  "id": "1c75133580521db0324db911160dbbe58693a310",
  "text": " It may be that you will draw some of the northern lords out from behind their stone walls. Aeron will accompany you, and Dagmer Cleftjaw.    May the Drowned God bless our swords,  the priest said.  Theon felt as if he’d been slapped. He was being sent to do reaver’s work, burning fishermen out of their hovels and raping their ugly daughters, and yet it seemed Lord Balon did not trust him sufficiently to do even that much. Bad enough to have to suffer the Damphair’s scowls and chidings. With Dagmer Cleftjaw along as well, his command would be purely nominal.   Asha my daughter,  Lord Balon went on, and Theon turned to see that his sister had slipped in silently,  you shall take thirty longships of picked men round Sea Dragon Point. Land upon the tidal flats north of Deepwood Motte. March quickly, and the castle may fall before they even know you are upon them.   Asha smiled like a cat in cream.  I’ve always wanted a castle,  she said sweetly.   Then take one.   Theon had to bite his tongue. Deepwood Motte was the stronghold of the Glovers. With both Robett and Galbart warring in the south, it would be lightly held, and once the castle fell the ironmen would have a secure base in the heart of the north. I should be the one sent to take Deepwood. He knew Deepwood Motte, he had visited the Glovers several times with Eddard Stark.   Victarion,  Lord Balon said to his brother,  the main thrust shall fall to you. When my sons have struck their blows, Winterfell must respond. You should meet small opposition as you sail up Saltspear and the Fever River. At the headwaters, you will be less than twenty miles from Moat Cailin. The Neck is the key to the kingdom. Already we command the western seas. Once we hold Moat Cailin, the pup will not be able to win back to the north… and if he is fool enough to try, his enemies will seal the south end of the causeway behind him, and Robb the boy will find himself caught like a rat in a bottle.   Theon could keep silent no longer.  A bold plan, Father, but the lords in their castles—   Lord Balon rode over him.  The lords are gone south with the pup. Those who remained behind are the cravens, old men, and green boys. They will yield or fall, one by one. Winterfell may defy us for a year, but what of it? The rest shall be ours, forest and field and hall, and we shall make the folk our thralls and salt wives.   Aeron Damphair raised his arms.  And the waters of wrath will rise high, and the Drowned God will spread his dominion across the green lands!    What is dead can never die,  Victarion intoned. Lord Balon and Asha echoed his words, and Theon had no choice but to mumble along with them. And then it was done.  Outside the rain was falling harder than ever. The rope bridge twisted and writhed under his feet. Theon Greyjoy stopped in the center of the span and contemplated the rocks below. The sound of the waves was a crashing roar, and he could taste the salt spray on his lips. A sudden gust of wind made him lose his footing, and he stumbled to his knees.  Asha helped him rise.  You can’t hold your wine either, brother.   Theon leaned on her shoulder and let her guide him across the rainslick boards.  I liked you better when you were Esgred,  he told her accusingly.  She laughed.  That’s fair. I liked you better when you were nine.       TYRION  Through the door came the soft sound of the high harp, mingled with a trilling of pipes. The singer’s voice was muffled by the thick walls, yet Tyrion knew the verse. I loved a maid as fair as summer, he remembered, with sunlight in her hair…  Ser Meryn Trant guarded the queen’s door this night. His muttered  My lord  struck Tyrion as a tad grudging, but he opened the door nonetheless. The song broke off abruptly as he strode into his sister’s bedchamber.  Cersei was reclining on a pile of cushions. Her feet were bare, her golden hair artfully tousled, her robe a green-and-gold samite that caught the light of the candles and shimmered as she looked up.  Sweet sister,  Tyrion said,  how beautiful you look tonight.  He turned to the singer.  And you as well, cousin. I had no notion you had such a lovely voice.   The compliment made Ser Lancel sulky; perhaps he thought he was being mocked. It seemed to Tyrion that the lad had grown three inches since being knighted. Lancel had thick sandy hair, green Lannister eyes, and a line of soft blond fuzz on his upper lip. At sixteen, he was cursed with all the certainty of youth, unleavened by any trace of humor or self-doubt, and wed to the arrogance that came so naturally to those born blond and strong and handsome. His recent elevation had only made him worse.  Did Her Grace send for you?  the boy demanded.   Not that I recall,  Tyrion admitted.  It grieves me to disturb your revels, Lancel, but as it happens, I have matters of import to discuss with my sister.   Cersei regarded him suspiciously.  If you are here about those begging brothers, Tyrion, spare me your reproaches. I won’t have them spreading their filthy treasons in the streets."
}