{
  "id": "1c85be99853b832872cf02dac5e8a6e55d66b77e",
  "text": " He  had  never  bothered  to wonder  how  the  treasure was  to be removed, certainly never how any part of it that might fall to his share was to  be brought back all the way to Bag-End Under-Hill.  Now  a  nasty  suspicion  began  to  grow  in  his  mind-had  the  dwarves  forgotten  this important point too, or were they laughing in their sleeves at him all the time?  That  is  the effect  that dragon-talk has on the inexperienced. Bilbo of course ought  to have been on his guard; but Smaug had rather an overwhelming personality.   \"I  tell you,\" he  said,  in  an  effort  to  remain  loyal  to his  friends  and  to keep his  end up, \"that gold was only an afterthought with  us. We came over hill and under  hill,  by  wave  and  win,  for  Revenge.  Surely, O  Smaug  the  unassessably wealthy,  you must realize that your success has made you some bitter enemies?\"  Then  Smaug  really  did  laugh-a  devastating  sound  which  shook  Bilbo  to  the  floor, while  far  up  in  the  tunnel  the  dwarves  huddled  together  and  imagined  that  the hobbit had come to a sudden and a nasty end.  \"Revenge!\"  he  snorted,  and  the  light  of  his  eyes  lit  the  the  hall  from  floor  to  ceiling like scarlet lightning. \"Revenge! The King under the Mountain is dead and  where are hi kin  that dare  seek  revenge? Girion Lord of Dale  is dead, and  I have  eaten  his  people  like  a wolf  among  sheep,  and where  are  his  sons'  sons  that  dare  approach me?  I  kill where  I wish  and  none  dare  resist.  I  laid  low  the warriors of  old and their like is not in the world today. Then I was but young and tender. Now  I  am  old  and  strong,  strong  strong.  Thief  in  the  Shadows!\"  he  gloated.  \"My   ####-armour  is  like  tenfold shields, my  teeth are swords, my claws spears,  the shock of  my tail a thunderbolt, my wings a hurricane, and my breath death!\"  \"I  have  always  understood,\"  said  Bilbo  in  a  frightened  squeak,  \"that  dragons  were softer underneath, especially in the region of the–er–chest; but doubtless one  so fortified has thought of that.\"  The dragon stopped short in his boasting. \"Your information is antiquated,\" he  snapped.  \"I  am  armoured  above  and  below  with  iron  scales  and  hard  gems.  No  blade can pierce me.\"  \"I might  have  guessed  it,\"  said Bilbo.  \"Truly  there  can;  nowhere  be found the  equal of Lord Smaug the Impenetrable. What magnificence to possess a waistcoat  of fine diamonds!\"  \"Yes,  it  is  rare  and wonderful,  indeed,\"  said  Smaug  absurdly  pleased. He  did  not  know  that  the  hobbit  had  already  caught  a  glimpse  of  his  peculiar  under- covering on his previous visit, and was itching for a closer view for reasons of his  own. The dragon rolled over. \"Look!\" he said. \"What do you say to that?\"  \"Dazzlingly  marvellous!  Perfect!  Flawless!  Staggering!\"  exclaimed  Bilbo  aloud, but what he thought inside was: \"Old fool! Why there is a large patch in the  hollow of his left breast as bare as a snail out of its shell!\"  After  he  had  seen  that Mr. Baggins'  one  idea was  to  get  away.  \"Well,  I  really  must not detain Your Magnificence any longer,\" he  said, \"or keep you from much  needed  rest.  Ponies  take  some  catching,  I  believe,  after  a  long  start.  And  so  do  burglars,\" he added as a parting shot, as he darted back and fled up the tunnel.  It was an unfortunate remark, for  the dragon spouted  terrific flames after him,  and  fast  though  he  sped  up  the  slope,  he  had  not  gone  nearly  far  enough  to  be  comfortable  before  the  ghastly  head  of  Smaug  was  thrust  against  the  opening  behind.  Luckily  the  whole  head  and  jaws  could  not  squeeze  in,  but  the  nostrils  sent  forth  fire  and  vapour  to  pursue  him,  and  he  was  nearly  overcome,  and  stumbled blindly on in great pain and fear. He had been feeling rather pleased with  the  cleverness  of  his  conversation  with  Smaug,  but  his  mistake  at  the  end  shook  him into better sense.  \"Never  laugh  at  live  dragons,  Bilbo  you  fool!\"  he  said  to  himself,  and  it  became  a  favourite  saying  of  his  later,  and  passed  into  a  proverb.  \"You  aren't  nearly through this adventure yet,\" he added, and that was pretty true as well.    The afternoon was turning into evening when he came out again and stumbled  and  fell  in  a  faint  on  the  'door-step.'  The  dwarves  revived  him,  and  doctored  his  scorches  as well  as  they  could; but  it was  a  long  time before  the hair on  the back   ####-of  his  head  and  his  heels  grew  properly  again:  it had  all been  singed  and  frizzled  right down to the skin. In the meanwhile his friends did their best to cheer him up;  and they were eager for his story, especially wanting to know why the dragon had  made such an awful noise, and how Bilbo had escaped.  But  the  hobbit  was  worried  and  uncomfortable,  and  they  had  difficulty  in  getting anything out of him."
}