{
  "id": "1d76e7979aab4360b5c686509abd495346a41a3d",
  "text": "  I don’t care what you say, I’m going out riding.  Her long horsey face got the stubborn look that meant she was going to do something willful.   Gods be true, Arya, sometimes you act like such a child,  Sansa said.  I’ll go by myself then. It will be ever so much nicer that way. Lady and I will eat all the lemon cakes and just have the best time without you.   She turned to walk off, but Arya shouted after her,  They won’t let you bring Lady either.  She was gone before Sansa could think of a reply, chasing Nymeria along the river.  Alone and humiliated, Sansa took the long way back to the inn, where she knew Septa Mordane would be waiting. Lady padded quietly by her side. She was almost in tears. All she wanted was for things to be nice and pretty, the way they were in the songs. Why couldn’t Arya be sweet and delicate and kind, like Princess Myrcella? She would have liked a sister like that.  Sansa could never understand how two sisters, born only two years apart, could be so different. It would have been easier if Arya had been a bastard, like their half brother Jon. She even looked like Jon, with the long face and brown hair of the Starks, and nothing of their lady mother in her face or her coloring. And Jon’s mother had been common, or so people whispered. Once, when she was littler, Sansa had even asked Mother if perhaps there hadn’t been some mistake. Perhaps the grumkins had stolen her real sister. But Mother had only laughed and said no, Arya was her daughter and Sansa’s trueborn sister, blood of their blood. Sansa could not think why Mother would want to lie about it, so she supposed it had to be true.  As she neared the center of camp, her distress was quickly forgotten. A crowd had gathered around the queen’s wheelhouse. Sansa heard excited voices buzzing like a hive of bees. The doors had been thrown open, she saw, and the queen stood at the top of the wooden steps, smiling down at someone. She heard her saying,  The council does us great honor, my good lords.    What’s happening?  she asked a squire she knew.   The council sent riders from King’s Landing to escort us the rest of the way,  he told her.  An honor guard for the king.   Anxious to see, Sansa let Lady clear a path through the crowd. People moved aside hastily for the direwolf. When she got closer, she saw two knights kneeling before the queen, in armor so fine and gorgeous that it made her blink.  One knight wore an intricate suit of white enameled scales, brilliant as a field of new-fallen snow, with silver chasings and clasps that glittered in the sun. When he removed his helm, Sansa saw that he was an old man with hair as pale as his armor, yet he seemed strong and graceful for all that. From his shoulders hung the pure white cloak of the Kingsguard.  His companion was a man near twenty whose armor was steel plate of a deep forest-green. He was the handsomest man Sansa had ever set eyes upon; tall and powerfully made, with jet-black hair that fell to his shoulders and framed a clean-shaven face, and laughing green eyes to match his armor. Cradled under one arm was an antlered helm, its magnificent rack shimmering in gold.  At first Sansa did not notice the third stranger. He did not kneel with the others. He stood to one side, beside their horses, a gaunt grim man who watched the proceedings in silence. His face was pockmarked and beardless, with deepset eyes and hollow cheeks. Though he was not an old man, only a few wisps of hair remained to him, sprouting above his ears, but those he had grown long as a woman’s. His armor was iron-grey chainmail over layers of boiled leather, plain and unadorned, and it spoke of age and hard use. Above his right shoulder the stained leather hilt of the blade strapped to his back was visible; a two-handed greatsword, too long to be worn at his side.   The king is gone hunting, but I know he will be pleased to see you when he returns,  the queen was saying to the two knights who knelt before her, but Sansa could not take her eyes off the third man. He seemed to feel the weight of her gaze. Slowly he turned his head. Lady growled. A terror as overwhelming as anything Sansa Stark had ever felt filled her suddenly. She stepped backward and bumped into someone.  Strong hands grasped her by the shoulders, and for a moment Sansa thought it was her father, but when she turned, it was the burned face of Sandor Clegane looking down at her, his mouth twisted in a terrible mockery of a smile.  You are shaking, girl,  he said, his voice rasping.  Do I frighten you so much?   He did, and had since she had first laid eyes on the ruin that fire had made of his face, though it seemed to her now that he was not half so terrifying as the other. Still, Sansa wrenched away from him, and the Hound laughed, and Lady moved between them, rumbling a warning. Sansa dropped to her knees to wrap her arms around the wolf. They were all gathered around gaping, she could feel their eyes on her, and here and there she heard muttered comments and titters of laughter."
}