{
  "id": "1d8a2a743b67582095c0abfa6af285c6d872f327",
  "text": " I’m old enough to remember Lord Steffon before the sea took him, and I knew those three sons of his since they got their names. I tell you this—Robert was never the same after he put on that crown. Some men are like swords, made for fighting. Hang them up and they go to rust.    And his brothers?  Jon asked.  The armorer considered that a moment.  Robert was the true steel. Stannis is pure iron, black and hard and strong, yes, but brittle, the way iron gets. He’ll break before he bends. And Renly, that one, he’s copper, bright and shiny, pretty to look at but not worth all that much at the end of the day.   And what metal is Robb? Jon did not ask. Noye was a Baratheon man; likely he thought Joffrey the lawful king and Robb a traitor. Among the brotherhood of the Night’s Watch, there was an unspoken pact never to probe too deeply into such matters. Men came to the Wall from all of the Seven Kingdoms, and old loves and loyalties were not easily forgotten, no matter how many oaths a man swore… as Jon himself had good reason to know. Even Sam—his father’s House was sworn to Highgarden, whose Lord Tyrell supported King Renly. Best not to talk of such things. The Night’s Watch took no sides.  Lord Mormont awaits us,  Jon said.   I won’t keep you from the Old Bear.  Noye clapped him on the shoulder and smiled.  May the gods go with you on the morrow, Snow. You bring back that uncle of yours, you hear?    We will,  Jon promised him.  Lord Commander Mormont had taken up residence in the King’s Tower after the fire had gutted his own. Jon left Ghost with the guards outside the door.  More stairs,  said Sam miserably as they started up.  I hate stairs.    Well, that’s one thing we won’t face in the wood.   When they entered the solar, the raven spied them at once.  Snow!  the bird shrieked. Mormont broke off his conversation.  Took you long enough with those maps.  He pushed the remains of breakfast out of the way to make room on the table.  Put them here. I’ll have a look at them later.   Thoren Smallwood, a sinewy ranger with a weak chin and a weaker mouth hidden under a thin scraggle of beard, gave Jon and Sam a cool look. He had been one of Alliser Thorne’s henchmen, and had no love for either of them.  The Lord Commander’s place is at Castle Black, lording and commanding,  he told Mormont, ignoring the newcomers,  it seems to me.   The raven flapped big black wings.  Me, me, me.    If you are ever Lord Commander, you may do as you please,  Mormont told the ranger,  but it seems to me that I have not died yet, nor have the brothers put you in my place.    I’m First Ranger now, with Ben Stark lost and Ser Jaremy killed,  Smallwood said stubbornly.  The command should be mine.   Mormont would have none of it.  I sent out Ben Stark, and Ser Waymar before him. I do not mean to send you after them and sit wondering how long I must wait before I give you up for lost as well.  He pointed.  And Stark remains First Ranger until we know for a certainty that he is dead. Should that day come, it will be me who names his successor, not you. Now stop wasting my time. We ride at first light, or have you forgotten?   Smallwood pushed to his feet.  As my lord commands.  On the way out, he frowned at Jon, as if it were somehow his fault.   First Ranger!  The Old Bear’s eyes lighted on Sam.  I’d sooner name you First Ranger. He has the effrontery to tell me to my face that I’m too old to ride with him. Do I look old to you, boy?  The hair that had retreated from Mormont’s spotted scalp had regrouped beneath his chin in a shaggy grey beard that covered much of his chest. He thumped it hard.  Do I look frail?   Sam opened his mouth, gave a little squeak. The Old Bear terrified him.  No, my lord,  Jon offered quickly.  You look strong as a… a…    Don’t cozen me, Snow, you know I won’t have it. Let me have a look at these maps.  Mormont pawed through them brusquely, giving each no more than a glance and a grunt.  Was this all you could find?    I… m-m-my lord,  Sam stammered,  there… there were more, b-b-but… the dis-disorder…    These are old,  Mormont complained, and his raven echoed him with a sharp cry of  Old, old.    The villages may come and go, but the hills and rivers will be in the same places,  Jon pointed out.   True enough. Have you chosen your ravens yet, Tarly?    M-m-maester Aemon m-means to p-pick them come evenfall, after the f-f-feeding.    I’ll have his best. Smart birds, and strong.    Strong,  his own bird said, preening.  Strong, strong.    If it happens that we’re all butchered out there, I mean for my successor to know where and how we died.   Talk of butchery reduced Samwell Tarly to speechlessness. Mormont leaned forward.  Tarly, when I was a lad half your age, my lady mother told me that if I stood about with my mouth open, a weasel was like to mistake it for his lair and run down my throat. If you have something to say, say it. Otherwise, beware of weasels.  He waved a brusque dismissal.  Off with you, I’m too busy for folly."
}