{
  "id": "1dade6f5f12bbd7110fa3a47bc573bb36e1c96de",
  "text": "  Fools! They’ll kill you, fools!  She was scarecrow thin, with hollow eyes and bloody feet.  The next morning, a sleek merchant on a grey mare reined up by Yoren and offered to buy his wagons and everything in them for a quarter of their worth.  It’s war, they’ll take what they want, you’ll do better selling to me, my friend.  Yoren turned away with a twist of his crooked shoulders, and spat.  Arya noticed the first grave that same day; a small mound beside the road, dug for a child. A crystal had been set in the soft earth, and Lommy wanted to take it until the Bull told him he’d better leave the dead alone. A few leagues farther on, Praed pointed out more graves, a whole row freshly dug. After that, a day hardly passed without one.  One time Arya woke in the dark, frightened for no reason she could name. Above, the Red Sword shared the sky with half a thousand stars. The night seemed oddly quiet to her, though she could hear Yoren’s muttered snores, the crackle of the fire, even the muffled stirrings of the donkeys. Yet somehow it felt as though the world were holding its breath, and the silence made her shiver. She went back to sleep clutching Needle.  Come morning, when Praed did not awaken, Arya realized that it had been his coughing she had missed. They dug a grave of their own then, burying the sellsword where he’d slept. Yoren stripped him of his valuables before they threw the dirt on him. One man claimed his boots, another his dagger. His mail shirt and helm were parceled out. His longsword Yoren handed to the Bull.  Arms like yours, might be you can learn to use this,  he told him. A boy called Tarber tossed a handful of acorns on top of Praed’s body, so an oak might grow to mark his place.  That evening they stopped in a village at an ivy-covered inn. Yoren counted the coins in his purse and decided they had enough for a hot meal.  We’ll sleep outside, same as ever, but they got a bathhouse here, if any of you feels the need o’ hot water and a lick o’ soap.   Arya did not dare, even though she smelled as bad as Yoren by now, all sour and stinky. Some of the creatures living in her clothes had come all the way from Flea Bottom with her; it didn’t seem right to drown them. Tarber and Hot Pie and the Bull joined the line of men headed for the tubs. Others settled down in front of the bathhouse. The rest crowded into the common room. Yoren even sent Lommy out with tankards for the three in fetters, who’d been left chained up in the back of their wagon.  Washed and unwashed alike supped on hot pork pies and baked apples. The innkeeper gave them a round of beer on the house.  I had a brother took the black, years ago. Serving boy, clever, but one day he got seen filching pepper from m’lord’s table. He liked the taste of it, is all. just a pinch o’ pepper, but Ser Malcolm was a hard man. You get pepper on the Wall?  When Yoren shook his head, the man sighed.  Shame. Lync loved that pepper.   Arya sipped at her tankard cautiously, between spoonfuls of pie still warm from the oven. Her father sometimes let them have a cup of beer, she remembered. Sansa used to make a face at the taste and say that wine was ever so much finer, but Arya had liked it well enough. it made her sad to think of Sansa and her father.  The inn was full of people moving south, and the common room erupted in scorn when Yoren said they were traveling the other way.  You’ll be back soon enough,  the innkeeper vowed.  There’s no going north. Half the fields are burnt, and what folks are left are walled up inside their holdfasts. One bunch rides off at dawn and another one shows up by dusk.    That’s nothing to us,  Yoren insisted stubbornly.  Tully or Lannister, makes no matter. The Watch takes no part.   Lord Tully is my grandfather, Arya thought. It mattered to her, but she chewed her lip and kept quiet, listening.   It’s more than Lannister and Tully,  the innkeeper said.  There’s wild men down from the Mountains of the Moon, try telling them you take no part. And the Starks are in it too, the young lord’s come down, the dead Hand’s son…   Arya sat up straight, straining to hear. Did he mean Robb?   I heard the boy rides to battle on a wolf,  said a yellow-haired man with a tankard in his hand.   Fool’s talk.  Yoren spat.   The man I heard it from, he saw it himself. A wolf big as a horse, he swore.    Swearing don’t make it true, Hod,  the innkeeper said.  You keep swearing you’ll pay what you owe me, and I’ve yet to see a copper.  The common room erupted in laughter, and the man with the yellow hair turned red.   It’s been a bad year for wolves,  volunteered a sallow man in a travel-stained green cloak.  Around the Gods Eye, the packs have grown bolder’n anyone can remember. Sheep, cows, dogs, makes no matter, they kill as they like, and they got no fear of men. It’s worth your life to go into those woods by night.    Ah, that’s more tales, and no more true than the other.    I heard the same thing from my cousin, and she’s not the sort to lie,  an old woman said."
}