{
  "id": "1dbe2ccdfc7c58167333e450ccaae0981fa176b3",
  "text": "  \"Stay, Fang. C'mon, Harry.\" They marched in silence past the Beauxbatons carriage and up toward the castle. \"How dare he,\" Hagrid growled as they strode past the lake.  \"How dare he accuse Dumbledore.  Like Dumbledore'd do anythin' like that.  Like Dumbledore wanted you in the tournament in the firs' place.  Worried!  I dunno when I seen Dumbledore more worried than he's bin lately.  An' you!\"  Hagrid suddenly said angrily to Harry, who looked up at him, taken aback.  \"What were yeh doin', wanderin' off with ruddy Krum?  He's from Durmstrang, Harry! Coulda jinxed yeh right there, couldn he?  Hasn' Moody taught yeh nothin'?  'Magine lettin him lure yeh off on yer own -\" \"Krum's all right!\"  said Harry as they climbed the steps into the entrance hall.  \"He wasn't trying to jinx me, he just wanted to talk about Hermione -\" \"I'll be havin' a few words with her, an' all,\" said Hagrid grimly, stomping up the stairs. \"The less you lot 'ave ter do with these foreigners, the happier yeh'll be.  Yeh can trust any of 'em.\" \"You were getting on all right with Madame Maxime,\" Harry said, annoyed. \"Don' you talk ter me abou' her!\"  said Hagrid, and he looked quite frightening for a moment.  \"I've got her number now!  Tryin' ter get back in me good books, tryin' ter get me ter tell her what's comin in the third task.  Ha!  You can' trust any of'em!\" Hagrid was in such a bad mood, Harry was quite glad to say good-bye to him in front of the Fat Lady.  He clambered through the portrait hole into the common room and hurried straight for the corner where Ron and Hermione were sitting, to tell them what had happened.  CHAPTER TWENTY-NINE - THE DREAM  It comes down to this,\" said Hermione, rubbing her forehead.  \"Either Mr. Crouch attacked Viktor, or somebody else attacked both of them when Viktor wasn't looking.\" \"It must've been Crouch,\" said Ron at once. \"That's why he was gone when Harry and Dumbledore got there.  He'd done a runner.\" \"I don't think so,\" said Harry, shaking his head.  \"He seemed really weak - I don't reckon he was up to Disapparating or anything.\" \"You cant Disapparate on the Hogwarts grounds, haven't I told you enough times?\" said Hermione. \"Okay. . . hows this for a theory,\" said Ron excitedly.  \"Krum attacked Crouch - no, wait for it - and then Stunned himself!\" \"And Mr. Crouch evaporated, did he?\" said Hermione coldly. \"Oh yeah . . .\" It was daybreak. Harry, Ron, and Hermione had crept out of their dormitories very early and hurried up to the Owlery together to send a note to Sirius.  Now they were standing looking out at the misty grounds.  All three of them were puffy-eyed and pale because they had been talking late into the night about Mr. Crouch. \"Just go through it again, Harry,\" said Hermione.  \"What did Mr. Crouch actually say?\" \"I've told you, he wasn't making much sense,\" said Harry.  \"He said he wanted to warn Dumbledore about something.  He definitely mentioned Bertha Jorkins, and he seemed to think she was dead.  He kept saying stuff was his fault. . . . He mentioned his son.\" \"Well, that was his fault,\" said Hermione testily. \"He was out of his mind,\" said Harry.  \"Half the time he seemed to think his wife and son were still alive, and he kept talking to Percy about work and giving him instructions.\" \"And . . . remind me what he said about You-Know-Who?\" said Ron tentatively. \"I've told you,\" Harry repeated dully.  \"He said he's getting stronger.\" There was a pause.  Then Ron said in a falsely confident voice, \"But he was out of his mind, like you said, so half of it was probably just raving. ...\" \"He was sanest when he was trying to talk about Voldemort,\" said Harry, and Ron winced at the sound of the name.  \"He was having real trouble stringing two words together, but that was when he seemed to know where he was, and know what he wanted to do.  He just kept saying he had to see Dumbledore.\" Harry turned away from the window and stared up into the rafters.  The many perches were half-empty; every now and then, another owl would swoop in through one of the windows, returning from its night's hunting with a mouse in its beak. \"If Snape hadn't held me up,\" Harry said bitterly, \"we might've got there in time.  'The headmaster is busy. Potter . . . what's this rubbish, Potter?'  Why couldn't he have just got out of the way?\" \"Maybe he didn't want you to get there!\" said Ron quickly.  \"Maybe - hang on - how fast d'you reckon he could've gotten down to the forest?  D'you reckon he could've beaten you and Dumbledore there?\" \"Not unless he can turn himself into a bat or something,\" said Harry. \"Wouldn't put it past him,\" Ron muttered. \"We need to see Professor Moody,\" said Hermione.  \"We need to find out whether he found Mr. Crouch,\" \"If he had the Marauder's Map on him, it would've been easy,\" said Harry. \"Unless Crouch was already outside the grounds,\" said Ron, \"because it only shows up to the boundaries, doesn't -\" \"Shh!\" said Hermione suddenly. Somebody was climbing the steps up to the Owlery."
}