{
  "id": "1dc4a7c26fe4354fa7e4e10aacd697dea7519ece",
  "text": " Can you make it? Will your aunt and uncle let you come? I really hope you can. If not, I'll see you on the Hogwarts Express on September first!  Love from Hermione  P.S. Ron says Percy's Head Boy. I'll bet Percy's really pleased Ron doesn't seem too happy about it  Harry laughed as he put Herrmone's letter aside and picked up her present. It was very heavy. Knowing Hermione, he was sure it would be a large book full of very difficult spells -- but it wasn't. His heart gave a huge bound as he ripped back the paper and saw a sleek black leather case, with silver words stamped across it, reading Broomstick Servicing Kit.  \"Wow, Hermione!\" Harry whispered, unzipping the case to look inside.  There was a large jar of Fleetwood's High-Finish Handle Polish, a pair of gleaming silver Tall-Twig Clippers, a tiny brass compass to clip on your broom for long journeys, and a Handbook of Do-It-Yourself Broomcare.  Apart from his friends, the thing that Harry missed most about Hogwarts was Quidditch, the most popular sport in the magical world -- highly dangerous, very exciting, and played on broomsticks. Harry happened to be a very good Quidditch player; he had been the youngest person in a century to be picked for one of the Hogwarts House teams. One of Harry's most prized possessions was his Nimbus Two Thousand racing broom.  Harry put the leather case aside and picked up his last parcel. He recognized the untidy scrawl on the brown paper at once: this was from Hagrid, the Hogwarts gamekeeper. He tore off the top layer of paper and glimpsed something green and leathery, but before he could unwrap it properly, the parcel gave a strange quiver, and whatever was inside it snapped loudly -- as though it had jaws.  Harry froze. He knew that Hagrid would never send him anything dangerous on purpose, but then, Hagrid didn't have a normal person's view of what was dangerous. Hagrid had been known to befriend giant spiders, buy vicious, three-headed dogs from men in pubs, and sneak illegal dragon eggs into his cabin.  Harry poked the parcel nervously. It snapped loudly again. Harry reached for the lamp on his bedside table, gripped it firmly in one hand, and raised it over his head, ready to strike. Then he seized the rest of the wrapping paper in his other hand and pulled.  And out fell -- a book. Harry just had time to register its handsome green cover, emblazoned with the golden title The Monster Book of Monsters, before it flipped onto its edge and scuttled sideways along the bed like some weird crab.  \"Uh-oh,\" Harry muttered.  The book toppled off the bed with a loud clunk and shuffled rapidly across the room. Harry followed it stealthily. The book was hiding in the dark space under his desk. Praying that the Dursleys were still fast asleep, Harry got down on his hands and knees and reached toward it.  \"Ouch!\"  The book snapped shut on his hand and then flapped past him, still scuttling on its covers. Harry scrambled around, threw himself forward, and managed to flatten it. Uncle Vernon gave a loud, sleepy grunt in the room next door.  Hedwig and Errol watched interestedly as Harry clamped the struggling book tightly in his arms, hurried to his chest of drawers, and pulled out a belt, which he buckled tightly around it. The Monster Book shuddered angrily, but could no longer flap and snap, so Harry threw it down on the bed and reached for Hagrid's card.  Dear Harry,  Happy Birthday!  Think you might find this useful for next year. Won't say no more here. Tell you when I see you. Hope the Muggles are treating you right.  All the best,  Hagrid  It struck Harry as ominous that Hagrid thought a biting book would come in useful, but he put Hagrid's card up next to Ron's and Hermione's, grinning more broadly than ever. Now there was only the letter from Hogwarts left.  Noticing that it was rather thicker than usual, Harry slit open the envelope, pulled out the first page of parchment within, and read:  Dear Mr. Potter,  Please note that the new school year will begin on September the first. The Hogwarts Express will leave ftom King's Cross station, platform nine and three-quarters, at eleven o'clock.  Third years are permitted to visit the village of Hogsmeade on certain weekends. Please give the enclosed permission form to your parent or guardian to sign.  A list of books for next year is enclosed. Yours sincerely,  Professor M. McGonagall  Deputy Headmistress  Harry pulled out the Hogsmeade permission form and looked at it, no longer grinning. It would be wonderful to visit Hogsmeade on weekends; he knew it was an entirely wizarding village, and he had never set foot there. But how on earth was he going to persuade Uncle Vernon or Aunt Petunia to sign the form?  He looked over at the alarm clock. It was now two o'clock in the morning.  Deciding that he'd worry about the Hogsmeade form when he woke up, Harry got back into bed and reached up to cross off another day on the chart he'd made for himself, counting down the days left until his return to Hogwarts."
}