{
  "id": "1dcccf6d4d2b878c5113ec9ee2691ae547989aba",
  "text": " You call us thieves, but at least a thief has t’ be brave and clever and quick. A kneeler only has t’ kneel.    Harma and the Bag of Bones don’t come raiding for fish and apples. They steal swords and axes. Spices, silks, and furs. They grab every coin and ring and jeweled cup they can find, casks of wine in summer and casks of beef in winter, and they take women in any season and carry them off beyond the Wall.    And what if they do? I’d sooner be stolen by a strong man than be given t’ some weakling by my father.    You say that, but how can you know? What if you were stolen by someone you hated?    He’d have t’ be quick and cunning and brave t’ steal me. So his sons would be strong and smart as well. Why would I hate such a man as that?    Maybe he never washes, so he smells as rank as a bear.    Then I’d push him in a stream or throw a bucket o’ water on him. Anyhow, men shouldn’t smell sweet like flowers.    What’s wrong with flowers?    Nothing, for a bee. For bed I want one o’ these.  Ygritte made to grab the front of his breeches.  Jon caught her wrist.  What if the man who stole you drank too much?  he insisted.  What if he was brutal or cruel?  He tightened his grip to make a point.  What if he was stronger than you, and liked to beat you bloody?    I’d cut his throat while he slept. You know nothing, Jon Snow.  Ygritte twisted like an eel and wrenched away from him.  I know one thing. I know that you are wildling to the bone. It was easy to forget that sometimes, when they were laughing together, or kissing. But then one of them would say something, or do something, and he would suddenly be reminded of the wall between their worlds.   A man can own a woman or a man can own a knife,  Ygritte told him,  but no man can own both. Every little girl learns that from her mother.  She raised her chin defiantly and gave her thick red hair a shake.  And men can’t own the land no more’n they can own the sea or the sky. You kneelers think you do, but Mance is going t’ show you different.   It was a fine brave boast, but it rang hollow. Jon glanced back to make certain the Magnar was not in earshot. Errok, Big Boil, and Hempen Dan were walking a few yards behind them, but paying no attention. Big Boil was complaining of his arse.  Ygritte,  he said in a low voice,  Mance cannot win this war.    He can!  she insisted.  You know nothing, Jon Snow. You have never seen the free folk fight!   Wildlings fought like heroes or demons, depending on who you talked to, but it came down to the same thing in the end. They fight with reckless courage, every man out for glory.  I don’t doubt that you’re all very brave, but when it comes to battle, discipline beats valor every time. In the end Mance will fail as all the Kings-beyond-the-Wall have failed before him. And when he does, you’ll die. All of you.   Ygritte had looked so angry he thought she was about to strike him.  All of us,  she said.  You too. You’re no crow now, Jon Snow. I swore you weren’t, so you better not be.  She pushed him back against the trunk of a tree and kissed him, full on the lips right there in the midst of the ragged column. Jon heard Grigg the Goat urging her on. Someone else laughed. He kissed her back despite all that. When they finally broke apart, Ygritte was flushed.  You’re mine,  she whispered.  Mine, as I’m yours. And if we die, we die. All men must die, Jon Snow. But first we’ll live.    Yes.  His voice was thick.  First we’ll live.   She grinned at that, showing Jon the crooked teeth that he had somehow come to love. Wildling to the bone, he thought again, with a sick sad feeling in the pit of his stomach. He flexed the fingers of his sword hand, and wondered what Ygritte would do if she knew his heart. Would she betray him if he sat her down and told her that he was still Ned Stark’s son and a man of the Night’s Watch? He hoped not, but he dare not take that risk. Too many lives depended on his somehow reaching Castle Black before the Magnar… assuming he found a chance to escape the wildlings.  They had descended the south face of the Wall at Greyguard, abandoned for two hundred years. A section of the huge stone steps had collapsed a century before, but even so the descent was a good deal easier than the climb. From there Styr marched them deep into the Gift, to avoid the Watch’s customary patrols. Grigg the Goat led them past the few inhabited villages that remained in these lands. Aside from a few scattered roundtowers poking the sky like stone fingers, they saw no sign of man. Through cold wet hills and windy plains they marched, unwatched, unseen.  You must not balk, whatever is asked of you, the Halfhand had said. Ride with them, eat with them, fight with them, for as long as it takes. He’d ridden many leagues and walked for more, had shared their bread and salt, and Ygritte’s blankets as well, but still they did not trust him. Day and night the Thenns watched him, alert for any signs of betrayal. He could not get away, and soon it would be too late."
}