{
  "id": "1e6d1d6698d2419cf41558b5cf2716ac2da6f560",
  "text": " It was peaceful here. The thick walls shut out the clamor of the castle, and he could hear birds singing, the murmur of crickets, leaves rustling in a gentle wind. The heart tree was an oak, brown and faceless, yet Ned Stark still felt the presence of his gods. His leg did not seem to hurt so much.  She came to him at sunset, as the clouds reddened above the walls and towers. She came alone, as he had bid her. For once she was dressed simply, in leather boots and hunting greens. When she drew back the hood of her brown cloak, he saw the bruise where the king had struck her. The angry plum color had faded to yellow, and the swelling was down, but there was no mistaking it for anything but what it was.   Why here?  Cersei Lannister asked as she stood over him.   So the gods can see.   She sat beside him on the grass. Her every move was graceful. Her curling blond hair moved in the wind, and her eyes were green as the leaves of summer. It had been a long time since Ned Stark had seen her beauty, but he saw it now.  I know the truth Jon Arryn died for,  he told her.   Do you?  The queen watched his face, wary as a cat.  Is that why you called me here, Lord Stark? To pose me riddles? Or is it your intent to seize me, as your wife seized my brother?    If you truly believed that, you would never have come.  Ned touched her cheek gently.  Has he done this before?    Once or twice.  She shied away from his hand.  Never on the face before. Jaime would have killed him, even if it meant his own life.  Cersei looked at him defiantly.  My brother is worth a hundred of your friend.    Your brother?  Ned said.  Or your lover?    Both.  She did not flinch from the truth.  Since we were children together. And why not? The Targaryens wed brother to sister for three hundred years, to keep the bloodlines pure. And Jaime and I are more than brother and sister. We are one person in two bodies. We shared a womb together. He came into this world holding my foot, our old maester said. When he is in me, I feel… whole.  The ghost of a smile flitted over her lips.   My son Bran…   To her credit, Cersei did not look away.  He saw us. You love your children, do you not?   Robert had asked him the very same question, the morning of the melee. He gave her the same answer.  With all my heart.    No less do I love mine.   Ned thought, If it came to that, the life of some child I did not know, against Robb and Sansa and Arya and Bran and Rickon, what would I do? Even more so, what would Catelyn do, if it were Jon’s life, against the children of her body? He did not know. He prayed he never would.   All three are Jaime’s,  he said. It was not a question.   Thank the gods.   The seed is strong, Jon Arryn had cried on his deathbed, and so it was. All those bastards, all with hair as black as night. Grand Maester Malleon recorded the last mating between stag and lion, some ninety years ago, when Tya Lannister wed Gowen Baratheon, third son of the reigning lord. Their only issue, an unnamed boy described in Malleon’s tome as a large and lusty lad born with a full head of black hair, died in infancy. Thirty years before that a male Lannister had taken a Baratheon maid to wife. She had given him three daughters and a son, each black-haired. No matter how far back Ned searched in the brittle yellowed pages, always he found the gold yielding before the coal.   A dozen years,  Ned said.  How is it that you have had no children by the king?   She lifted her head, defiant.  Your Robert got me with child once,  she said, her voice thick with contempt.  My brother found a woman to cleanse me. He never knew. If truth be told, I can scarcely bear for him to touch me, and I have not let him inside me for years. I know other ways to pleasure him, when he leaves his whores long enough to stagger up to my bedchamber. Whatever we do, the king is usually so drunk that he’s forgotten it all by the next morning.   How could they have all been so blind? The truth was there in front of them all the time, written on the children’s faces. Ned felt sick.  I remember Robert as he was the day he took the throne, every inch a king,  he said quietly.  A thousand other women might have loved him with all their hearts. What did he do to make you hate him so?   Her eyes burned, green fire in the dusk, like the lioness that was her sigil.  The night of our wedding feast, the first time we shared a bed, he called me by your sister’s name. He was on top of me, in me, stinking of wine, and he whispered Lyanna.   Ned Stark thought of pale blue roses, and for a moment he wanted to weep.  I do not know which of you I pity most.   The queen seemed amused by that.  Save your pity for yourself, Lord Stark. I want none of it.    You know what I must do.    Must?  She put her hand on his good leg, just above the knee.  A true man does what he will, not what he must.  Her fingers brushed lightly against his thigh, the gentlest of promises.  The realm needs a strong Hand. Joff will not come of age for years."
}