{
  "id": "1ea4059314b9f5e3033f4b928932bdf65f02d5c8",
  "text": " Then they  hung  up  two  yellow  hoods  and  a  pale  green  one;  and  also  a  sky-blue one with  a  long silver tassel. This last belonged to Thorin, an enormously important dwarf, in  fact  no  other  than  the  great  Thorin  Oakenshield  himself,  who  was  not  at  all  pleased at falling flat on Bilbo's mat with Bifur, Bofur, and Bombur on top of him.  For  one  thing  Bombur  was  immensely  fat  and  heavy.  Thorin  indeed  was  very  haughty,  and  said  nothing  about  service;  but  poor Mr. Baggins  said  he was  sorry  so  many  times,  that  at  last  he  grunted  \"pray  don't  mention  it,\"  and  stopped  frowning.  \"Now we  are  all here!\"  said Gandalf,  looking  at  the  row of  thirteen hoods-the  best  detachable  party  hoods-and his own hat hanging on  the pegs. \"Quite a merry  gathering!  I hope there is something left for the late-comers to eat and drink! What's that?  Tea! No thank you! A little red wine, I think, for me.\" \"And for me,\" said Thorin.  \"And raspberry jam and apple-tart,\" said Bifur. \"And mince-pies and cheese,\" said  Bofur.  \"And  pork-pie  and  salad,\"  said  Bombur.  \"And  more  cakes-and  ale-and  coffee, if you don't mind,\" called the other dwarves through the door.    ####-\"Put  on  a  few  eggs,  there's  a  good  fellow!\"  Gandalf  called  after  him,  as  the  hobbit  stumped  off  to  the  pantries.  \"And  just  bring  out  the  cold  chicken  and  pickles!\"  \"Seems  to  know  as  much  about  the  inside  of  my  larders  as  I  do  myself!\"  thought Mr. Baggins, who was  feeling  positively  flummoxed,  and was  beginning  to wonder whether  a most wretched  adventure  had  not  come  right  into his house.  By  the  time he had got all  the bottles and dishes and knives and forks and glasses  and  plates  and  spoons  and  things  piled  up  on  big  trays,  he  was  getting  very  hot,  and red in the face, and annoyed.  \"Confusticate  and  bebother  these  dwarves!\"  he  said  aloud.  \"Why  don't  they  come and lend a hand?\" Lo and behold! there stood Balin and Dwalin at the door  of  the  kitchen,  and  Fili  and Kili  behind  them,  and  before  he  could  say  knife  they  had  whisked  the  trays  and  a  couple  of  small  tables  into  the  parlour  and  set  out  everything afresh.  Gandalf  sat  at  the  head  of  the  party with  the  thirteen,  dwarves  all  round:  and  Bilbo  sat  on  a  stool  at  the  fireside,  nibbling  at  a  biscuit  (his  appetite  was  quite  taken away), and trying to look as if this was all perfectly  ordinary and. not in the  least  an  adventure. The  dwarves  ate  and  ate,  and  talked  and  talked,  and  time  got  on.  At  last  they  pushed  their  chairs  back,  and  Bilbo  made  a  move  to  collect  the  plates and glasses.  \"I suppose you will all stay to supper?\" he said in his politest unpressing tones.  \"Of  course!\"  said Thorin.  \"And  after. We  shan't  get  through  the  business  till  late,  and we must have some music first. Now to clear up!\"  Thereupon  the  twelve  dwarves-not  Thorin,  he  was  too  important,  and  stayed  talking  to  Gandalf-jumped  to  their  feet  and  made  tall  piles  of  all  the  things.  Off  they went, not waiting for trays, balancing columns of plates, each with a bottle on  the  top,  with  one  hand,  while  the  hobbit  ran  after  them  almost  squeaking  with  fright:  \"please  be  careful!\"  and  \"please,  don't  trouble!  I  can  manage.\"  But  the  dwarves only started to sing:     Chip the glasses and crack the plates!  Blunt the knives and bend the forks!  That's what Bilbo Baggins hates-  Smash the bottles and burn the corks!    Cut the cloth and tread on the fat!  Pour the milk on the pantry floor!  Leave the bones on the bedroom mat!   ####-Splash the wine on every door!    Dump the crocks in a boiling bawl;  Pound them up with a thumping pole;  And when you've finished, if any are whole,  Send them down the hall to roll !    That's what Bilbo Baggins hates!  So, carefully! carefully with the plates!     And  of  course  they  did  none  of  these  dreadful  things,  and  everything  was  cleaned  and  put  away  safe  as  quick  as  lightning,  while  the  hobbit  was  turning  round  and  round  in  the middle of  the kitchen  trying  to  see what  they were doing.  Then  they  went  back,  and  found  Thorin  with  his  feet  on  the  fender  smoking  a  pipe. He was  blowing  the most  enormous  smoke-rings, and wherever he  told one  to  go,  it  went-up  the  chimney,  or  behind  the  clock  on  the  man-telpiece,  or  under  the  table,  or  round  and  round  the  ceiling;  but  wherever  it  went  it  was  not  quick  enough  to escape Gandalf. Pop! he  sent a  smaller  smoke-ring from his short clay- pipe  straight  through  each  one  of  Thorin's.  The  Gandalf's  smoke-ring  would  go  green  and  come  back  to  hover  over  the  wizard's  head.  He  had  quite  a  cloud  of  them  about  him  already,  and  in  the  dim  light  it  made  him  look  strange  and  sorcerous."
}