{
  "id": "1f1d5b0119a0366c4d9cfa3bc2b89ffc242f835d",
  "text": "    Your brother is bigger than me,  Tyrion said with a laugh.  I decline to deliver any message that might get me killed.    Rickon will ask when I’m coming home. Try to explain where I’ve gone, if you can. Tell him he can have all my things while I’m away, he’ll like that.   People seemed to be asking a great deal of him today, Tyrion Lannister thought.  You could put all this in a letter, you know.    Rickon can’t read yet. Bran…  He stopped suddenly.  I don’t know what message to send to Bran. Help him, Tyrion.    What help could I give him? I am no maester, to ease his pain. I have no spells to give him back his legs.    You gave me help when I needed it,  Jon Snow said.   I gave you nothing,  Tyrion said.  Words.    Then give your words to Bran too.    You’re asking a lame man to teach a cripple how to dance,  Tyrion said.  However sincere the lesson, the result is likely to be grotesque. Still, I know what it is to love a brother, Lord Snow. I will give Bran whatever small help is in my power.    Thank you, my lord of Lannister.  He pulled off his glove and offered his bare hand.  Friend.   Tyrion found himself oddly touched.  Most of my kin are bastards,  he said with a wry smile,  but you’re the first I’ve had to friend.  He pulled a glove off with his teeth and clasped Snow by the hand, flesh against flesh. The boy’s grip was firm and strong.  When he had donned his glove again, Jon Snow turned abruptly and walked to the low, icy northern parapet. Beyond him the Wall fell away sharply; beyond him there was only the darkness and the wild. Tyrion followed him, and side by side they stood upon the edge of the world.  The Night’s Watch permitted the forest to come no closer than half a mile of the north face of the Wall. The thickets of ironwood and sentinel and oak that had once grown there had been harvested centuries ago, to create a broad swath of open ground through which no enemy could hope to pass unseen. Tyrion had heard that elsewhere along the Wall, between the three fortresses, the wildwood had come creeping back over the decades, that there were places where grey-green sentinels and pale white weirwoods had taken root in the shadow of the Wall itself, but Castle Black had a prodigious appetite for firewood, and here the forest was still kept at bay by the axes of the black brothers.  It was never far, though. From up here Tyrion could see it, the dark trees looming beyond the stretch of open ground, like a second wall built parallel to the first, a wall of night. Few axes had ever swung in that black wood, where even the moonlight could not penetrate the ancient tangle of root and thorn and grasping limb. Out there the trees grew huge, and the rangers said they seemed to brood and knew not men. It was small wonder the Night’s Watch named it the haunted forest.  As he stood there and looked at all that darkness with no fires burning anywhere, with the wind blowing and the cold like a spear in his guts, Tyrion Lannister felt as though he could almost believe the talk of the Others, the enemy in the night. His jokes of grumkins and snarks no longer seemed quite so droll.   My uncle is out there,  Jon Snow said softly, leaning on his spear as he stared off into the darkness.  The first night they sent me up here, I thought, Uncle Benjen will ride back tonight, and I’ll see him first and blow the horn. He never came, though. Not that night and not any night.    Give him time,  Tyrion said.  Far off to the north, a wolf began to howl. Another voice picked up the call, then another. Ghost cocked his head and listened.  If he doesn’t come back,  Jon Snow promised,  Ghost and I will go find him.  He put his hand on the direwolf’s head.   I believe you,  Tyrion said, but what he thought was, And who will go find you? He shivered.      ARYA  Her father had been fighting with the council again. Arya could see it on his face when he came to table, late again, as he had been so often. The first course, a thick sweet soup made with pumpkins, had already been taken away when Ned Stark strode into the Small Hall. They called it that to set it apart from the Great Hall, where the king could feast a thousand, but it was a long room with a high vaulted ceiling and bench space for two hundred at its trestle tables.   My lord,  Jory said when Father entered. He rose to his feet, and the rest of the guard rose with him. Each man wore a new cloak, heavy grey wool with a white satin border. A hand of beaten silver clutched the woolen folds of each cloak and marked their wearers as men of the Hand’s household guard. There were only fifty of them, so most of the benches were empty.   Be seated,  Eddard Stark said.  I see you have started without me. I am pleased to know there are still some men of sense in this city.  He signaled for the meal to resume. The servants began bringing out platters of ribs, roasted in a crust of garlic and herbs.   The talk in the yard is we shall have a tourney, my lord,  Jory said as he resumed his seat."
}