{
  "id": "1f647d6a312949468fd250649bddda80f418b640",
  "text": " \"Yes.  After a while he began to fight the Imperius Curse just as I had done.  There were periods when he knew what was happening.  My master decided it was no longer safe for my father to leave the house.  He forced him to send letters to the Ministry instead.  He made him write and say he was ill.  But Wormtail neglected his duty.  He was not watchful enough. My father escaped.  My master guessed that he was heading for Hogwarts.  My father was going to tell Dumbledore everything, to confess.  He was going to admit that he had smuggled me from Azkaban. \"My master sent me word of my father's escape.  He told me to stop him at all costs. So I waited and watched.  I used the map I had taken from Harry Potter.  The map that had almost ruined everything.\" \"Map?\"  said Dumbledore quickly.  \"What map is this?\" \"Potter's map of Hogwarts.  Potter saw me on it.  Potter saw me stealing more ingredients for the Polyjuice Potion from Snape's office one night.  He thought I was my father. We have the same first name.  I took the map from Potter that night.  I told him my father hated Dark wizards.  Potter believed my father was after Snape. \"For a week I waited for my father to arrive at Hogwarts.  At last, one evening, the map showed my father entering the grounds.  I pulled on my Invisibility Cloak and went down to meet him.  He was walking around the edge of the forest.  Then Potter came, and Krum.  I waited.  I could not hurt Potter; my master needed him.   Potter ran to get Dumbledore.  I Stunned Krum.  I killed my father.\" \"Noooo!\"  wailed Winky.  \"Master Barty, Master Barty, what is you saying?\" \"You killed your father,\" Dumbledore said, in the same soft voice.  \"What did you do with the body?\" \"Carried it into the forest.  Covered it with the Invisibility Cloak.  I had the map with me.  I watched Potter run into the castle.  He met Snape.  Dumbledore joined them.  I watched Potter bringing Dumbledore out of the castle.  I walked back out of the forest, doubled around behind them, went to meet them.  I told Dumbledore Snape had told me where to come. \"Dumbledore told me to go and look for my father.  I went back to my father's body. Watched the map.  When everyone was gone, I Transfigured my father's body.  He became a bone ... I buried it, while wearing the Invisibility Cloak, in the freshly dug earth in front of Hagrid's cabin.\" There was complete silence now, except for Winky's continued sobs.  Then Dumbledore said, \"And tonight. . .\" \"I offered to carry the Triwizard Cup into the maze before dinner,\" whispered Barty Crouch.  \"Turned it into a Portkey.  My master's plan worked.  He is returned to power and I will be honored by him beyond the dreams of wizards.\" The insane smile lit his features once more, and his head drooped onto his shoulder as Winky wailed and sobbed at his side.  CHAPTER THIRTY-SIX - THE PARTING OF THE WAYS  Dumbledore stood up.  He stared down at Barty Crouch for a moment with disgust on his face.  Then he raised his wand once more and ropes flew out of it, ropes that twisted themselves around Barty Crouch, binding him tightly.  He turned to Professor McGonagall. \"Minerva, could I ask you to stand guard here while I take Harry upstairs?\" \"Of course,\" said Professor McGonagall.  She looked slightly nauseous, as though she had just watched someone being sick.  However, when she drew out her wand and pointed it at Barty Crouch, her hand was quite steady. \"Severus\" - Dumbledore turned to Snape - \"please tell Madam Pomfrey to come down here; we need to get Alastor Moody into the hospital wing.  Then go down into the grounds, find Cornelius Fudge, and bring him up to this office.  He will undoubtedly want to question Crouch himself.  Tell him I will be in the hospital wing in half an hour's time if he needs me.\" Snape nodded silently and swept out of the room. \"Harry?\"  Dumbledore said gently. Harry got up and swayed again; the pain in his leg, which he had not noticed all the time he had been listening to Crouch, now returned in full measure.  He also realized that he was shaking.  Dumbledore gripped his arm and helped him out into the dark corridor. \"I want you to come up to my office first. Harry,\" he said quiedy as they headed up the passageway.  \"Sirius is waiting for us there.\" Harry nodded.  A kind of numbness and a sense of complete unreality were upon him, but he did not care; he was even glad of it.  He didn't want to have to think about anything that had happened since he had first touched the Triwizard Cup.  He didn't want to have to examine the memories, fresh and sharp as photographs, which kept flashing across his mind.  Mad-Eye Moody, inside the trunk.  Wormtail, slumped on the ground, cradling his stump of an arm. Voldemort, rising from the steaming cauldron.  Cedric. . . dead . . . Cedric, asking to be returned to his parents. . . . \"Professor,\" Harry mumbled, \"where are Mr. and Mrs. Diggory?\" \"They are with Professor Sprout,\" said Dumbledore.  His voice, which had been so calm throughout the interrogation of Barty Crouch, shook very slightly for the first time."
}