{
  "id": "1f666d9c50af88d35cae4eeaa0eda2cbf0b2c0be",
  "text": " Gollum  is a   liar,  and you have to sift his words. For instance, he called the  Ring his  \"birthday  present\",  and he  stuck  to  that.  He  said it  came  from  his  grandmother, who  had lots  of beautiful  things of  that kind. A ridiculous  story. I have no doubt  that Smjagol's grandmother was a matriarch,  a great   ####-person in her  way,  but to talk of  her  possessing  many  Elven-rings  was  absurd, and as for giving them away, it was a lie. But a lie with a grain of  truth.       'The  murder  of  Deal haunted  Gollum,  and he had made  up a defence,  repeating  it  to his \"precious\" over and  over again, as he gnawed bones in  the dark, until he almost  believed it. It  was   his birthday. Deal ought to  have given the ring to him. It had  previously turned up  just so as to be a   present. It was his birthday present, and so on, and on.       I  endured  him  as long  as  I could,  but  the truth  was desperately  important, and in the end I  had to be harsh. I put the fear of fire on him,  and wrung  the  true  story  out of  him, bit by  bit,  together  with  much  snivelling  and snarling. He thought  he was misunderstood and ill-used. But  when  he  had  at  last  told  me his history,  as  far  as  the end of  the  Riddle-game  and Bilbo's escape, he would not say any more,  except in  dark  hints. Some other fear was on him greater than mine. He muttered that he was  going  to gel his own back. People would see if he would stand being kicked,  and driven  into  a hole and  then robbed. Gollum had good friends now, good  friends and very strong. They would help him. Baggins would pay for it. That  was his chief thought. He hated Bilbo and cursed his name. What  is more, he  knew where he came from.'       'But how did he find that out?' asked Frodo.       'Well, as for the  name, Bilbo very foolishly told  Gollum himself; and  after that  it  would  not be difficult to discover his country, once Gollum  came out. Oh yes, he came out. His longing for the Ring proved stronger than  his fear of the Orcs, or even of the light. After a year  or two he left the  mountains. You  see, though  still  bound  by desire of it, the Ring was  no  longer devouring him; he began  to revive a little.  He  felt  old , terribly  old, yet less timid, and he was mortally hungry.       'Light, light of Sun and Moon, he still feared and hated, and he always  will, I think; but he was cunning. He found he could hide  from daylight and  moonshine,  and make his way swiftly  and softly by dead of night  with  his  pale cold  eyes,  and  catch  small  frightened or  unwary  things. He  grew  stronger  and  bolder  with new food  and  new air. He  found  his way  into  Mirkwood, as one would expect.'       'Is that where you found him?' asked Frodo.       'I  saw  him there,' answered Gandalf, 'but before that he had wandered  far, following  Bilbo's trail. It was difficult to  learn anything  from him   ####-for certain, for his talk was constantly interrupted  by curses and threats.   \"What had it  got in its pocketses?\" he said. \"It wouldn't say, no precious.  Little cheat. Not a fair  question. It  cheated first, it did. It  broke the  rules. We ought to have squeezed it, yes precious. And we will, precious!\"       'That is a sample of his talk. I don't suppose you want any more. I had  weary days  of it. But from hints dropped among  the snarls I  even gathered  that his padding feet had  taken him  at last to Esgaroth, and even  to  the  streets of Dale, listening secretly and peering. Well, the news of the great  events went far and wide in Wilderland, and many had heard Bilbo's name  and  knew where he came from.  We had made no secret of our return journey to his  home in the West. Gollum's sharp ears would soon learn what he wanted.'       'Then why didn't  he track Bilbo further?' asked Frodo. 'Why didn't  he  come to the Shire?'       'Ah,' said Gandalf, 'now we come to it. I think Gollum tried to. He set  out and  came  back westward, as far as the Great River. But  then he turned  aside. He  was not daunted by  the distance, I am  sure.  No, something else  drew him away. So my friends think, those that hunted him for me.       'The Wood-elves tracked him first, an easy task for them, for his trail  was  still fresh  then. Through Mirkwood and back again it  led them, though  they never  caught him. The wood was full of  the  rumour  of  him, dreadful  tales even among beasts and birds. The  Woodmen said that there was some  new  terror abroad, a ghost that drank blood. It climbed trees to  find nests; it  crept into  holes  to  find  the young; it slipped  through windows  to find  cradles.       'But at the western edge of Mirkwood the trail turned away. It wandered  off southwards and passed out of the Wood-elves' ken, and was lost. And then  I made a great mistake. Yes,  Frodo, and not the first; though I fear it may  prove the  worst. I let the matter be. I let  him go; for I had much else to  think of at that time, and I still trusted the lore of Saruman."
}