{
  "id": "1f94c83cc85804797e8ff9d76db272e620327fea",
  "text": " The girl was no older than two and she cried all the time, a whimpery sound, like something was caught in her throat. Either she couldn’t talk yet or she had forgotten how. The woman’s right arm ended in a bloody stump at her elbow, and her eyes didn’t seem to see anything, even when she was looking right at it. She talked, but she only said one thing.  Please,  she cried, over and over.  Please. Please.  Rorge thought that was funny. He laughed through the hole in his face where his nose had been, and Biter started laughing too, until Murch cursed them and told them to shut up.  Yoren had them fix the woman a place in the back of a wagon.  And be quick about it,  he said.  Come dark, there’ll be wolves here, and worse.    I’m scared,  Hot Pie murmured when he saw the one-armed woman thrashing in the wagon.   Me too,  Arya confessed.  He squeezed her shoulder.  I never truly kicked no boy to death, Arry. I just sold my mommy’s pies, is all.   Arya rode as far ahead of the wagons as she dared, so she wouldn’t have to hear the little girl crying or listen to the woman whisper,  Please.  She remembered a story Old Nan had told once, about a man imprisoned in a dark castle by evil giants. He was very brave and smart and he tricked the giants and escaped… but no sooner was he outside the castle than the Others took him, and drank his hot red blood. Now she knew how he must have felt.  The one-armed woman died at evenfall. Gendry and Cutjack dug her grave on a hillside beneath a weeping willow. When the wind blew, Arya thought she could hear the long trailing branches whispering,  Please. Please. Please.  The little hairs on the back of her neck rose, and she almost ran from the graveside.   No fire tonight,  Yoren told them. Supper was a handful of wild radishes Koss found, a cup of dry beans, water from a nearby brook. The water had a funny taste to it, and Lommy told them it was the taste of bodies, rotting someplace upstream. Hot Pie would have hit him if old Reysen hadn’t pulled them apart.  Arya drank too much water, just to fill her belly with something. She never thought she’d be able to sleep, yet somehow she did. When she woke, it was pitch-black and her bladder was full to bursting. Sleepers huddled all around her, wrapped in blankets and cloaks. Arya found Needle, stood, listened. She heard the soft footfalls of a sentry, men turning in restless sleep, Rorge’s rattling snores, and the queer hissing sound that Biter made when he slept. From a different wagon came the steady rhythmic scrape of steel on stone as Yoren sat, chewing sourleaf and sharpening the edge of his dirk.  Hot Pie was one of the boys on watch.  Where you going?  he asked when he saw Arya heading for the trees.  Arya waved vaguely at the woods.   No you’re not,  Hot Pie said. He had gotten bolder again now that he had a sword on his belt, even though it was just a shortsword and he handled it like a cleaver.  The old man said for everyone to stay close tonight.    I need to make water,  Arya explained.   Well, use that tree right there.  He pointed.  You don’t know what’s out there, Arry. I heard wolves before.   Yoren wouldn’t like it if she fought with him. She tried to look afraid.  Wolves? For true?    I heard,  he assured her.   I don’t think I need to go after all.  She went back to her blanket and pretended to sleep until she heard Hot Pie’s footsteps going away. Then she rolled over and slipped off into the woods on the other side of the camp, quiet as a shadow. There were sentries out this way too, but Arya had no trouble avoiding them. Just to make sure, she went out twice as far as usual. When she was sure there was no one near, she skinned down her breeches and squatted to do her business.  She was making water, her clothing tangled about her ankles, when she heard rustling from under the trees. Hot Pie, she thought in panic, he followed me. Then she saw the eyes shining out from the wood, bright with reflected moonlight. Her belly clenched tight as she grabbed for Needle, not caring if she pissed herself, counting eyes, two four eight twelve, a whole pack…  One of them came padding out from under the trees. He stared at her, and bared his teeth, and all she could think was how stupid she’d been and how Hot Pie would gloat when they found her half-eaten body the next morning. But the wolf turned and raced back into the darkness, and quick as that the eyes were gone. Trembling, she cleaned herself and laced up and followed a distant scraping sound back to camp, and to Yoren. Arya climbed up into the wagon beside him, shaken.  Wolves,  she whispered hoarsely.  In the woods.    Aye. They would be.  He never looked at her.   They scared me.    Did they?  He spat.  Seems to me your kind was fond o’ wolves.    Nymeria was a direwolf.  Arya hugged herself.  That’s different. Anyhow, she’s gone. Jory and I threw rocks at her until she ran off, or else the queen would have killed her.  It made her sad to talk about it.  I bet if she’d been in the city, she wouldn’t have let them cut off Father’s head."
}