{
  "id": "1fc31534bde3479b20476f0d4812ce7a3f07a0f0",
  "text": "  \"This is it,\" said Hagrid, coming to a halt, \"the Leaky Cauldron. It's a famous place.\"  It was a tiny, grubby-looking pub. If Hagrid hadn't pointed it out, Harry wouldn't have noticed it was there. The people hurrying by didn't glance at it. Their eyes slid from the big book shop on one side to the record shop on the other as if they couldn't see the Leaky Cauldron at all. In fact, Harry had the most peculiar feeling that only he and Hagrid could see it. Before he could mention this, Hagrid had steered him inside.  For a famous place, it was very dark and shabby. A few old women were sitting in a corner, drinking tiny glasses of sherry. One of them was smoking a long pipe. A little man in a top hat was talking to the old bartender, who was quite bald and looked like a toothless walnut. The low buzz of chatter stopped when they walked in. Everyone seemed to know Hagrid; they waved and smiled at him, and the bartender reached for a glass, saying, \"The usual, Hagrid?\"  \"Can't, Tom, I'm on Hogwarts business,\" said Hagrid, clapping his great hand on Harry's shoulder and making Harry's knees buckle.   \"Good Lord,\" said the bartender, peering at Harry, \"is this -- can this be --?\"   The Leaky Cauldron had suddenly gone completely still and silent.  \"Bless my soul,\" whispered the old bartender, \"Harry Potter... what an honor.\"  He hurried out from behind the bar, rushed toward Harry and seized his hand, tears in his eyes.  \"Welcome back, Mr. Potter, welcome back.\"  Harry didn't know what to say. Everyone was looking at him. The old woman with the pipe was puffing on it without realizing it had gone out. Hagrid was beaming.  Then there was a great scraping of chairs and the next moment, Harry found himself shaking hands with everyone in the Leaky Cauldron.  \"Doris Crockford, Mr. Potter, can't believe I'm meeting you at last.\"  \"So proud, Mr. Potter, I'm just so proud.\"  \"Always wanted to shake your hand -- I'm all of a flutter.\"  \"Delighted, Mr. Potter, just can't tell you, Diggle's the name, Dedalus Diggle.\"  \"I've seen you before!\" said Harry, as Dedalus Diggle's top hat fell off in his excitement. \"You bowed to me once in a shop.\"  \"He remembers!\" cried Dedalus Diggle, looking around at everyone. \"Did you hear that? He remembers me!\" Harry shook hands again and again -- Doris Crockford kept coming back for more.  A pale young man made his way forward, very nervously. One of his eyes was twitching.  \"Professor Quirrell!\" said Hagrid. \"Harry, Professor Quirrell will be one of your teachers at Hogwarts.\"  \"P-P-Potter,\" stammered Professor Quirrell, grasping Harry's hand, \"c-can't t-tell you how p- pleased I am to meet you.\"  \"What sort of magic do you teach, Professor Quirrell?\"  \"D-Defense Against the D-D-Dark Arts,\" muttered Professor Quirrell, as though he'd rather not think about it. \"N-not that you n-need it, eh, P-P-Potter?\" He laughed nervously. \"You'll be g-getting all your equipment, I suppose? I've g-got to p-pick up a new b-book on vampires, m-myself.\" He looked terrified at the very thought.  But the others wouldn't let Professor Quirrell keep Harry to himself. It took almost ten minutes to get away from them all. At last, Hagrid managed to make himself heard over the babble.  \"Must get on -- lots ter buy. Come on, Harry.\"  Doris Crockford shook Harry's hand one last time, and Hagrid led them through the bar and out into a small, walled courtyard, where there was nothing but a trash can and a few weeds.  Hagrid grinned at Harry.  \"Told yeh, didn't I? Told yeh you was famous. Even Professor Quirrell was tremblin' ter meet yeh -- mind you, he's usually tremblin'.\"  \"Is he always that nervous?\"  \"Oh, yeah. Poor bloke. Brilliant mind. He was fine while he was  studyin' outta books but then he took a year off ter get some firsthand experience.... They say he met vampires in the Black Forest, and there was a nasty bit o' trouble with a hag -- never been the same since. Scared of the students, scared of his own subject now, where's me umbrella?\"  Vampires? Hags? Harry's head was swimming. Hagrid, meanwhile, was counting bricks in the wall above the trash can.  \"Three up... two across he muttered. \"Right, stand back, Harry.\"  He tapped the wall three times with the point of his umbrella.  The brick he had touched quivered -- it wriggled -- in the middle, a small hole appeared -- it grew wider and wider -- a second later they were facing an archway large enough even for Hagrid, an archway onto a cobbled street that twisted and turned out of sight.  \"Welcome,\" said Hagrid, \"to Diagon Alley.\"  He grinned at Harry's amazement. They stepped through the archway. Harry looked quickly over his shoulder and saw the archway shrink instantly back into solid wall.  The sun shone brightly on a stack of cauldrons outside the nearest shop. Cauldrons -- All Sizes - Copper, Brass, Pewter, Silver -- Self-Stirring -- Collapsible, said a sign hanging over them.  \"Yeah, you'll be needin' one,\" said Hagrid, \"but we gotta get yer money first."
}