{
  "id": "1fc784f7e84b241619fd0bc5e02f850cfc8b39fb",
  "text": "  Unlike the Gryffindors, however, they did not seem impressed. The Hufflepuffs, who were usually on excellent terms with the Gryffindors, had turned remarkably cold toward the whole lot of them.  One Herbology lesson was enough to demonstrate this.  It was plain that the Hufflepuffs felt that Harry had stolen their champion's glory; a feeling exacerbated, perhaps, by the fact that Hufflepuff House very rarely got any glory, and that Cedric was one of the few who had ever given them any, having beaten Gryffindor once at Quidditch.  Ernie Macmillan and Justin FinchFletchley, with whom Harry normally got on very well, did not talk to him even though they were repotting Bouncing Bulbs at the same tray - though they did laugh rather unpleasantly when one of the Bouncing Bulbs wriggled free from Harry's grip and smacked him hard in the face.  Ron wasn't talking to Harry either.  Hermione sat between them, making very forced conversation, but though both answered her normally, they avoided making eye contact with each other.  Harry thought even Professor Sprout seemed distant with him - but then, she was Head of Hufflepuff House. He would have been looking forward to seeing Hagrid under normal circumstances, but Care of Magical Creatures meant seeing the Slytherins too - the first time he would come face-to-face with them since becoming champion. Predictably, Malfoy arrived at Hagrid's cabin with his familiar sneer firmly in place. \"Ah, look, boys, it's the champion,\" he said to Crabbe and Goyle the moment he got within earshot of Harry.  \"Got your autograph books?  Better get a signature now, because I doubt he's going to be around much longer. . . . Half the Triwizard champions have died.. . how long d'you reckon you're going to last, Potter?  Ten minutes into the first task's my bet.\" Crabbe and Goyle guffawed sycophantically, but Malfoy had to stop there, because Hagrid emerged from the back of his cabin balancing a teetering tower of crates, each containing a very large Blast-Ended Skrewt.  To the class's horror, Hagrid proceeded to explain that the reason the skrewts had been killing one another was an excess of pent-up energy, and that the solution would be for each student to fix a leash on a skrewt and take it for a short walk.  The only good thing about this plan was that it distracted Malfoy completely. \"Take this thing for a walk?\"  he repeated in disgust, staring into one of the boxes.  \"And where exactly are we supposed to fix the leash?  Around the sting, the blasting end, or the sucker?\" \"Roun' the middle,\" said Hagrid, demonstrating.  \"Er - yeh might want ter put on yer dragon-hide gloves, jus' as an extra precaution, like.  Harry - you come here an' help me with this big one.... Hagrid's real intention, however, was totalk to Harry away from the rest of the class. He waited until everyone else had set off with their skrewts, then turned to Harry and said, very seriously, \"So - yer competin', Harry.  In the tournament.  School champion.\" \"One of the champions,\" Harry corrected him. Hagrid's beetle-black eyes looked very anxious under his wild eyebrows. \"No idea who put yeh in fer it, Harry?\" \"You believe I didn't do it, then?\" said Harry, concealing with difficulty the rush of gratitude he felt at Hagrid's words.  \"Course I do,\" Hagrid grunted.  \"Yeh say it wasn' you, an' I believe yeh - an' Dumbledore believes yer, an' all.\" \"Wish I knew who did do it,\" said Harry bitterly. The pair of them looked out over the lawn; the class was widely scattered now, and all in great difficulty.  The skrewts were now over three feet long, and extremely powerful.  No longer shell-less and colorless, they had developed a kind of thick, grayish, shiny armor.  They looked like a cross between giant scorpions and elongated crabs - but still without recognizable heads or eyes.  They had become immensely strong and very hard to control. \"Look like they're havin' fun, don' they?\"  Hagrid said happily.  Harry assumed he was talking about the skrewts, because his classmates certainly weren't; every now and then, with an alarming bang, one of the skrewts' ends would explode, causing it to shoot forward several yards, and more than one person was being dragged along on their stomach, trying desperately to get back on their feet. \"Ah, I don' know, Harry,\" Hagrid sighed suddenly, looking back down at him with a worried expression on his face.  \"School champion. . . everythin' seems ter happen ter you, doesn' it?\" Harry didn't answer. Yes, everything did seem to happen to him. . . that was more or less what Hermione had said as they had walked around the lake, and that was the reason, according to her, that Ron was no longer talking to him.  The next few days were some of Harry's worst at Hogwarts.  The closest he had ever come to feeling like this had been during those months, in his second year, when a large part of the school had suspected him of attacking his fellow students.  But Ron had been on his side then.  He thought he could have coped with the rest of the school's behavior if he could just have had Ron back as a friend, but he wasn't going to try and persuade Ron to talk to him if Ron didn't want to."
}