{
  "id": "202d3aac3deb75c8cbba6f347eb370f1017027f0",
  "text": "    Men are men,  Whitebeard replied.  Dragons are dragons.   Ser Jorah snorted his disdain.  How profound.  The exile knight had no love for the old man, he’d made that plain from the first.  What do you know of dragons, anyway?    Little enough, that’s true. Yet I served for a time in King’s Landing in the days when King Aerys sat the Iron Throne, and walked beneath the dragonskulls that looked down from the walls of his throne room.    Viserys talked of those skulls,  said Dany.  The Usurper took them down and hid them away. He could not bear them looking down on him upon his stolen throne.  She beckoned Whitebeard closer.  Did you ever meet my royal father?  King Aerys II had died before his daughter was born.   I had that great honor, Your Grace.    Did you find him good and gentle?   Whitebeard did his best to hide his feelings, but they were there, plain on his face.  His Grace was… often pleasant.    Often?  Dany smiled.  But not always?    He could be very harsh to those he thought his enemies.    A wise man never makes an enemy of a king,  said Dany.  Did you know my brother Rhaegar as well?    It was said that no man ever knew Prince Rhaegar, truly. I had the privilege of seeing him in tourney, though, and often heard him play his harp with its silver strings.   Ser Jorah snorted.  Along with a thousand others at some harvest feast. Next you’ll claim you squired for him.    I make no such claim, ser. Myles Mooton was Prince Rhaegar’s squire, and Richard Lonmouth after him. When they won their spurs, he knighted them himself, and they remained his close companions. Young Lord Connington was dear to the prince as well, but his oldest friend was Arthur Dayne.    The Sword of the Morning!  said Dany, delighted.  Viserys used to talk about his wondrous white blade. He said Ser Arthur was the only knight in the realm who was our brother’s peer.   Whitebeard bowed his head.  It is not my place to question the words of Prince Viserys.    King,  Dany corrected.  He was a king, though he never reigned. Viserys, the Third of His Name. But what do you mean?  His answer had not been one that she’d expected.  Ser Jorah named Rhaegar the last dragon once. He had to have been a peerless warrior to be called that, surely?    Your Grace,  said Whitebeard,  the Prince of Dragonstone was a most puissant warrior, but…    Go on,  she urged.  You may speak freely to me.    As you command.  The old man leaned upon his hardwood staff, his brow furrowed.  A warrior without peer… those are fine words, Your Grace, but words win no battles.    Swords win battles,  Ser Jorah said bluntly.  And Prince Rhaegar knew how to use one.    He did, ser, but… I have seen a hundred tournaments and more wars than I would wish, and however strong or fast or skilled a knight may be, there are others who can match him. A man will win one tourney, and fall quickly in the next. A slick spot in the grass may mean defeat, or what you ate for supper the night before. A change in the wind may bring the gift of victory.  He glanced at Ser Jorah.  Or a lady’s favor knotted round an arm.   Mormont’s face darkened.  Be careful what you say, old man.   Arstan had seen Ser Jorah fight at Lannisport, Dany knew, in the tourney Mormont had won with a lady’s favor knotted round his arm. He had won the lady too; Lynesse of House Hightower, his second wife, highborn and beautiful… but she had ruined him, and abandoned him, and the memory of her was bitter to him now.  Be gentle, my knight.  She put a hand on Jorah’s arm.  Arstan had no wish to give offense, I’m certain.    As you say, Khaleesi.  Ser Jorah’s voice was grudging.  Dany turned back to the squire.  I know little of Rhaegar. Only the tales Viserys told, and he was a little boy when our brother died. What was he truly like?   The old man considered a moment.  Able. That above all. Determined, deliberate, dutiful, single-minded. There is a tale told of him… but doubtless Ser Jorah knows it as well.    I would hear it from you.    As you wish,  said Whitebeard.  As a young boy, the Prince of Dragonstone was bookish to a fault. He was reading so early that men said Queen Rhaella must have swallowed some books and a candle whilst he was in her womb. Rhaegar took no interest in the play of other children. The maesters were awed by his wits, but his father’s knights would jest sourly that Baelor the Blessed had been born again. Until one day Prince Rhaegar found something in his scrolls that changed him. No one knows what it might have been, only that the boy suddenly appeared early one morning in the yard as the knights were donning their steel. He walked up to Ser Willem Darry, the master-at-arms, and said, ‘I will require sword and armor. It seems I must be a warrior.’    And he was!  said Dany, delighted.   He was indeed.  Whitebeard bowed.  My pardons, Your Grace. We speak of warriors, and I see that Strong Belwas has arisen. I must attend him.   Dany glanced aft. The eunuch was climbing through the hold amidships, nimble for all his size."
}