{
  "id": "208274c05ccb6905e3edcd84f22b54012e47d527",
  "text": "  Of  the  time  that  followed, one hour  or many, Gimli remembered little. The others pressed on,  but  he  was ever hindmost, pursued  by a groping horror that  seemed always  just  about to seize  him; and a rumour came after him lik e the shadow-sound  of many feet. He  stumbled  on until he  was  crawling  like a beast on  the  ground and felt that he could endure no more: he  must either find an ending  and escape or run back in madness to meet the following fear.       Suddenly he  heard the  tinkle of water, a sound hard and  clear  as  a   stone falling into a dream of dark shadow. Light  grew, and lo! the  company  passed  through another  gateway, high-arched and broad, and a rill  ran out  beside  them;  and  beyond, going  steeply  down, was  a road between  sheer  cliffs, knife-edged against the sky  far above.  So deep and narrow was that  chasm  that  the sky was  dark, and in it small stars  glinted. Yet as Gimli  after learned it was still two hours ere sunset of the day on which they had  set out from Dunharrow; though for all that he could then tell it might have  been twilight in some later year, or in some other world.       The Company now mounted again, and Gimli returned to Legolas. They  rode  in  file, and evening came on and a  deep blue  dusk; and still fear pursued  them. Legolas turning to speak to Gimli looked back and the Dwarf saw before  his face  the glitter in the Elf's  bright  eyes. Behind them rode  Elladan,  last of the Company, but not the last of those that took the downward road.       'The  Dead are following,'  said Legolas. 'I  see shapes  of Men and of  horses,  and  pale  banners  like   shreds   of   cloud,  and   spears  like  winter -thickets on a misty night. The Dead are following.'       'Yes, the Dead ride behind. They have been summoned,' said Elladan.       The Company  came at last out of the ravine, as suddenly as it they had  issued  from  a crack in a wall; and there  lay the uplands  of a great vale  before them,  and the stream  beside them went down with a  cold  voice over  many falls.        'Where  in Middle-earth are we?' said Gimli; and Elladan answered:  'We   ####-have descended  from the uprising of the Morthond, the long chill river that  flows at last to the sea that washes the  walls of Dol Amroth. You  will not  need to ask hereafter how comes its name: Blackroot men call it.'       The  Morthond Vale made a  great  bay that beat up  against  the  sheer   southern faces of the  mountains. Its steep slopes were grass-grown; but all  was grey in that  hour, for the  sun had gone, and  far below lights twinkled  in the homes of Men. The vale was rich and many folk dwelt there.       Then without  turning  Aragorn  cried aloud so  that  all  could  hear:  'Friends, forget your weariness! Ride now, ride!  We  must come to the Stone  of Erech ere this day passes, and long still is the way.' So without looking  back they rode  the mountain-fields, until they came to  a  bridge over  the  growing torrent and found a road that went down into the land.       Lights went out in house  and hamlet as they came, and doors  were shut,  and folk that were  afield cried in terror and ran  wild  like  hunted deer.  Ever there rose the same cry in the gathering  night: 'The King of the Dead!   The King of the Dead is come upon us!'       Bells  wer e ringing far  below, and all men  fled  before  the face  of  Aragorn; but the Grey  Company in their haste rode like hunters, until their  horses were stumbling  with weariness. And thus, just ere midnight, and in a   darkness  as black as the caverns in the  mountains, they came at last to the  Hill of Erech.       Long had the terror of  the Dead lain upon that hill and upon the empty  fields about it. For upon  the  top stood  a  black stone, round  as a great  globe,  the  height  of a man, though its  half  was buried  in the  ground.  Unearthly it looked, as though it had fallen from the sky, as some believed;  but those who remembered still the lore of Westernesse told that it had been  brought out of the ruin of N®menor and there  set by Isildur at his landing .  None of the people of the valley dared to approach it, nor would  they dwell   near;  for  they said  that it was a trysting-place  of  the Shadow-men, and  there  they would  gather in  times  of fear, thronging round  the Stone and  whispering.       To tha t Stone  the Company came and halted in the  dead  of night. Then   Elrohir gave to Aragorn a silver horn, and he blew upon it and  it seemed to  those that stood near  that they heard a sound of answering  horns, as if it  was  an echo in deep caves far away. No other sound they heard, and yet they  were aware of a great host gathered  all about the hill on which they stood;  and a chill wind like the breath of ghosts came down from the mountains. But   ####-Aragorn dismounted, and standing by the Stone he cried in a great voice:       'Oathbreakers, why have ye come?'       And a voice  was heard  out of the  night that answered him, as if from  far away:       'To fulfil our oath and have peace."
}