{
  "id": "209c757061f68f64a57efb3d139f557b9c95fb1c",
  "text": " So long as they could learn which end of a spear did the killing, they might make all the difference.  Do as you say and you’ll not find me ungrateful. You can name your own reward.    Well, m’lord, I haven’t had no woman since I was with Lord Ramsay,  Reek said.  I’ve had my eye on that Palla, and I hear she’s already been had, so…   He had gone too far with Reek to turn back now.  Two hundred men and she’s yours. But a man less and you can go back to fucking pigs.   Reek was gone before the sun went down, carrying a bag of Stark silver and the last of Theon’s hopes. Like as not, I’ll never see the wretch again, he thought bitterly, but even so the chance had to be taken.  That night he dreamed of the feast Ned Stark had thrown when King Robert came to Winterfell. The hall rang with music and laughter, though the cold winds were rising outside. At first it was all wine and roast meat, and Theon was making japes and eyeing the serving girls and having himself a fine time… until he noticed that the room was growing darker. The music did not seem so jolly then; he heard discords and strange silences, and notes that hung in the air bleeding. Suddenly the wine turned bitter in his mouth, and when he looked up from his cup he saw that he was dining with the dead.  King Robert sat with his guts spilling out on the table from the great gash in his belly, and Lord Eddard was headless beside him. Corpses lined the benches below, grey-brown flesh sloughing off their bones as they raised their cups to toast, worms crawling in and out of the holes that were their eyes. He knew them, every one; Jory Cassel and Fat Tom, Porther and Cayn and Hullen the master of horse, and all the others who had ridden south to King’s Landing never to return. Mikken and Chayle sat together, one dripping blood and the other water. Benfred Tallhart and his Wild Hares filled most of a table. The miller’s wife was there as well, and Farlen, even the wildling Theon had killed in the wolfswood the day he had saved Bran’s life.  But there were others with faces he had never known in life, faces he had seen only in stone. The slim, sad girl who wore a crown of pale blue roses and a white gown spattered with gore could only be Lyanna. Her brother Brandon stood beside her, and their father Lord Rickard just behind. Along the walls figures half-seen moved through the shadows, pale shades with long grim faces. The sight of them sent fear shivering through Theon sharp as a knife. And then the tall doors opened with a crash, and a freezing gale blew down the hall, and Robb came walking out of the night. Grey Wind stalked beside, eyes burning, and man and wolf alike bled from half a hundred savage wounds.  Theon woke with a scream, startling Wex so badly that the boy ran naked from the room. When his guards burst in with drawn swords, he ordered them to bring him the maester. By the time Luwin arrived rumpled and sleepy, a cup of wine had steadied Theon’s hands, and he was feeling ashamed of his panic.  A dream,  he muttered,  that was all it was. It meant nothing.    Nothing,  Luwin agreed solemnly. He left a sleeping draught, but Theon poured it down the privy shaft the moment he was gone. Luwin was a man as well as a maester, and the man had no love for him. He wants me to sleep, yes… to sleep and never wake. He’d like that as much as Asha would.  He sent for Kyra, kicked shut the door, climbed on top of her, and fucked the wench with a fury he’d never known was in him, By the time he finished, she was sobbing, her neck and breasts covered with bruises and bite marks. Theon shoved her from the bed and threw her a blanket.  Get out.   Yet even then, he could not sleep.  Come dawn, he dressed and went outside, to walk along the outer walls. A brisk autumn wind was swirling through the battlements. It reddened his cheeks and stung his eyes. He watched the forest go from grey to green below him as light filtered through the silent trees. On his left he could see tower tops above the inner wall, their roofs gilded by the rising sun. The red leaves of the weirwood were a blaze of flame among the green. Ned Stark’s tree, he thought, and Stark’s wood, Stark’s castle, Stark’s sword, Stark’s gods. This is their place, not mine. I am a Greyjoy of Pyke, born to paint a kraken on my shield and sail the great salt sea. I should have gone with Asha.  On their iron spikes atop the gatehouse, the heads waited.  Theon gazed at them silently while the wind tugged on his cloak with small ghostly hands. The miller’s boys had been of an age with Bran and Rickon, alike in size and coloring, and once Reek had flayed the skin from their faces and dipped their heads in tar, it was easy to see familiar features in those misshapen lumps of rotting flesh. People were such fools. If we’d said they were rams’ heads, they would have seen horns.      SANSA  They had been singing in the sept all morning, since the first report of enemy sails had reached the castle. The sound of their voices mingled with the whicker of horses, the clank of steel, and the groaning hinges of the great bronze gates to make a strange and fearful music."
}