{
  "id": "20b1c16c7809a8bbe86319e8c1092f88f6510ecd",
  "text": "    Yes,  she answered,  but if Renly should die…   Stannis looked at his lady with narrowed eyes, until Cressen could not hold his tongue.  It is not to be thought. Your Grace, whatever follies Renly has committed—    Follies? I call them treasons.  Stannis turned back to his wife.  My brother is young and strong, and he has a vast host around him, and these rainbow knights of his.    Melisandre has gazed into the flames, and seen him dead.   Cressen was horrorstruck.  Fratricide… my lord, this is evil, unthinkable… please, listen to me.   Lady Selyse gave him a measured look.  And what will you tell him, Maester? How he might win half a kingdom if he goes to the Starks on his knees and sells our daughter to Lysa Arryn?    I have heard your counsel, Cressen,  Lord Stannis said.  Now I will hear hers. You are dismissed.   Maester Cressen bent a stiff knee. He could feel Lady Selyse’s eyes on his back as he shuffled slowly across the room. By the time he reached the bottom of the steps it was all he could do to stand erect.  Help me,  he said to Pylos.  When he was safe back in his own rooms, Cressen sent the younger man away and limped to his balcony once more, to stand between his gargoyles and stare out to sea. One of Salladhor Saan’s warships was sweeping past the castle, her gaily striped hull slicing through the grey-green waters as her oars rose and fell. He watched until she vanished behind a headland. Would that my fears could vanish so easily. Had he lived so long for this?  When a maester donned his collar, he put aside the hope of children, yet Cressen had oft felt a father nonetheless. Robert, Stannis, Renly… three sons he had raised after the angry sea claimed Lord Steffon. Had he done so ill that now he must watch one kill the other? He could not allow it, would not allow it.  The woman was the heart of it. Not the Lady Selyse, the other one. The red woman, the servants had named her, afraid to speak her name.  I will speak her name,  Cressen told his stone hellhound.  Melisandre. Her.  Melisandre of Asshai, sorceress, shadowbinder, and priestess to R’hllor, the Lord of Light, the Heart of Fire, the God of Flame and Shadow. Melisandre, whose madness must not be allowed to spread beyond Dragonstone.  His chambers seemed dim and gloomy after the brightness of the morning. With fumbling hands, the old man lit a candle and carried it to the workroom beneath the rookery stair, where his ointments, potions, and medicines stood neatly on their shelves. On the bottom shelf behind a row of salves in squat clay jars he found a vial of indigo glass, no larger than his little finger. It rattled when he shook it. Cressen blew away a layer of dust and carried it back to his table. Collapsing into his chair, he pulled the stopper and spilled out the vial’s contents. A dozen crystals, no larger than seeds, rattled across the parchment he’d been reading. They shone like jewels in the candlelight, so purple that the maester found himself thinking that he had never truly seen the color before.  The chain around his throat felt very heavy. He touched one of the crystals lightly with the tip of his little finger. Such a small thing to hold the power of life and death. It was made from a certain plant that grew only on the islands of the Jade Sea, half a world away. The leaves had to be aged, and soaked in a wash of limes and sugar water and certain rare spices from the Summer Isles. Afterward they could be discarded, but the potion must be thickened with ash and allowed to crystallize. The process was slow and difficult, the necessaries costly and hard to acquire. The alchemists of Lys knew the way of it, though, and the Faceless Men of Braavos… and the maesters of his order as well, though it was not something talked about beyond the walls of the Citadel. All the world knew that a maester forged his silver link when he learned the art of healing—but the world preferred to forget that men who knew how to heal also knew how to kill.  Cressen no longer recalled the name the Asshai’i gave the leaf, or the Lysene poisoners the crystal. In the Citadel, it was simply called the strangler. Dissolved in wine, it would make the muscles of a man’s throat clench tighter than any fist, shutting off his windpipe. They said a victim’s face turned as purple as the little crystal seed from which his death was grown, but so too did a man choking on a morsel of food.  And this very night Lord Stannis would feast his bannermen, his lady wife… and the red woman, Melisandre of Asshai.  I must rest, Maester Cressen told himself. I must have all my strength come dark. My hands must not shake, nor my courage flag. It is a dreadful thing I do, yet it must be done. If there are gods, surely they will forgive me. He had slept so poorly of late. A nap would refresh him for the ordeal ahead. Wearily, he tottered off to his bed. Yet when he closed his eyes, he could still see the light of the comet, red and flery and vividly alive amidst the darkness of his dreams."
}