{
  "id": "20d11e7fb06914f72697002a9665605e4ecd443c",
  "text": " . . and as they did so, platform nine and three-quarters materialized in front of them. The Hogwarts Express, a gleaming scarlet steam engine, was already there, clouds of steam billowing from it, through which the many Hogwarts students and parents on the platform appeared like dark ghosts.  Pigwidgeon became noisier than ever in response to the hooting of many owls through the mist.  Harry, Ron, and Hermione set off to find seats, and were soon stowing their luggage in a compartment halfway along the train.  They then hopped back down onto the platform to say good-bye to Mrs. Weasley, Bill, and Charlie. \"I might be seeing you all sooner than you think,\" said Charlie, grinning, as he hugged Ginny good-bye. \"Why?\" said Fred keenly. \"You'll see,\" said Charlie. \"Just don't tell Percy I mentioned it.. . it's 'classified information, until such time as the Ministry sees fit to release it,' after all.\"  \"Yeah, I sort of wish I were back at Hogwarts this year,\" said Bill, hands in his pockets, looking almost wistfully at the train. \"Why?\"  said George impatiently. \"You're going to have an interesting year,\" said Bill, his eyes twinkling. \"I might even get time off to come and watch a bit of it.\" \"A bit of what?\" said Ron. But at that moment, the whistle blew, and Mrs. Weasley chivvied them toward the train doors. \"Thanks for having us to stay, Mrs. Weasley,\" said Hermione as they climbed on board, closed the door, and leaned out of the window to talk to her. \"Yeah, thanks for everything, Mrs. Weasley,\" said Harry. \"Oh it was my pleasure, dears,\" said Mrs. Weasley. \"I'd invite you for Christmas, but...well, I expect you're all going to want to stay at Hogwarts, what with. . . one thing and another.\" \"Mum!\" said Ron irritably.  \"What d'you three know that we don't?\" \"You'll find out this evening, I expect,\" said Mrs. Weasley, smiling. \"It's going to be very exciting - mind you, I'm very glad they've changed the rules -\" \"What rules?\"  said Harry, Ron, Fred, and George together.  \"I'm sure Professor Dumbledore will tell you. . . . Now, behave, won't you?  Won't you, Fred?  And you, George?\" The pistons hissed loudly and the train began to move. \"Tell us what's happening at Hogwarts!\"  Fred bellowed out of the window as Mrs. Weasley, Bill, and Charlie sped away from them.  \"What rules are they changing?\"  But Mrs. Weasley only smiled and waved.  Before the train had rounded the corner, she, Bill, and Charlie had Disapparated. Harry, Ron, and Hermione went back to their compartment.  The thick rain splattering the windows made it very difficult to see out of them.  Ron undid his trunk, pulled out his maroon dress robes, and flung them over Pigwidgeon's cage to muffle his hooting. \"Bagman wanted to tell us what's happening at Hogwarts,\" he said grumpily, sitting down next to Harry.  \"At the World Cup, remember?  But my own mother won't say.  Wonder what --\" \"Shh!\"  Hermione whispered suddenly, pressing her finger to her lips and pointing toward the compartment next to theirs.  Harry and Ron listened, and heard a familiar drawling voice drifting in through the open door. \". . . Father actually considered sending me to Durmstrang rather than Hogwarts, you know.  He knows the headmaster, you see.  Well, you know his opinion of Dumbledore - the man's such a Mudblood-lover - and Durmstrang doesn't admit that sort of riffraff.  But Mother didn't like the idea of me going to school so far away.  Father says Durmstrang takes a far more sensible line than Hogwarts about the Dark Arts.  Durmstrang students actually learn them, not just the defense rubbish we do. . . .\" Hermione got up, tiptoed to the compartment door, and slid it shut, blocking out Malfoy's voice. \"So he thinks Durmstrang would have suited him, does he?\"  she said angrily.  \"I wish he had gone, then we wouldn't have to put up with him.\" \"Durmstrang's another wizarding school?\" said Harry.  \"Yes,\" said Hermione sniffily, \"and it's got a horrible reputation.  According to An Appraisal ofMagical Education in Europe, it puts a lot of emphasis on the Dark Arts.\" \"I think I've heard of it,\" said Ron vaguely.  \"Where is it?  What country?\" \"Well, nobody knows, do they?\"  said Hermione, raising her eyebrows. \"Er - why not?\" said Harry. \"There's traditionally been a lot of rivalry between all the magic schools.  Durmstrang and Beauxbatons like to conceal their whereabouts so nobody can steal their secrets,\" said Hermione matter-of-factly. \"Come off it,\" said Ron, starting to laugh. \"Durmstrang's got to be about the same size as Hogwarts -- how are you going to hide a great big castle?\" \"But Hogwarts is hidden,\" said Hermione, in surprise.  \"Everyone knows that.. . well, everyone who's read Hogwarts, A History, anyway.\" \"Just you, then,\" said Ron.  \"So go on - how d'you hide a place like Hogwarts?\" \"It's bewitched,\" said Hermione.  \"If a Muggle looks at it, all they see is a moldering old ruin with a sign over the entrance saying DANGER, DO NOT ENTER, UNSAFE.\" \"So Durmstrang'll just look like a ruin to an outsider too?\" \"Maybe,\" said Hermione, shrugging, \"or it might have Muggle-repelling charms on it, like the World Cup stadium."
}