{
  "id": "20d563c8cbfd3e765eb72d9b9da2969ae447b6e8",
  "text": "  The river hasn’t run this high since spring,  Edmure said.  And if this rain keeps falling, it will go higher yet.    There’s a bridge further upstream, near Oldstones,  remembered Catelyn, who had often crossed these lands with her father.  It’s older and smaller, but if it still stands—    It’s gone, my lady,  Galbart Glover said.  Washed away even before the one at Fairmarket.   Robb looked to Catelyn.  Is there another bridge?    No. And the fords will be impassable.  She tried to remember.  If we cannot cross the Blue Fork, we’ll have to go around it, through Sevenstreams and Hag’s Mire.    Bogs and bad roads, or none at all,  warned Edmure.  The going will be slow, but we’ll get there, I suppose.    Lord Walder will wait, I’m sure,  said Robb.  Lothar sent him a bird from Riverrun, he knows we are coming.    Yes, but the man is prickly, and suspicious by nature,  said Catelyn.  He may take this delay as a deliberate insult.    Very well, I’ll beg his pardon for our tardiness as well. A sorry king I’ll be, apologizing with every second breath.  Robb made a wry face.  I hope Bolton got across the Trident before the rains began. The kingsroad runs straight north, he’ll have an easy march. Even afoot, he should reach the Twins before us.    And when you’ve joined his men to yours and seen my brother married, what then?  Catelyn asked him.   North.  Robb scratched Grey Wind behind an ear.   By the causeway? Against Moat Cailin?   He gave her an enigmatic smile.  That’s one way to go,  he said, and she knew from his tone that he would say no more. A wise king keeps his own counsel, she reminded herself.  They reached Oldstones after eight more days of steady rain, and made their camp upon the hill overlooking the Blue Fork, within a ruined stronghold of the ancient river kings. Its foundations remained amongst the weeds to show where the walls and keeps had stood, but the local smallfolk had long ago made off with most of the stones to raise their barns and septs and holdfasts. Yet in the center of what once would have been the castle’s yard, a great carved sepulcher still rested, half hidden in waist-high brown grass amongst a stand of ash.  The lid of the sepulcher had been carved into a likeness of the man whose bones lay beneath, but the rain and the wind had done their work. The king had worn a beard, they could see, but otherwise his face was smooth and featureless, with only vague suggestions of a mouth, a nose, eyes, and the crown about the temples. His hands folded over the shaft of a stone warhammer that lay upon his chest. Once the warhammer would have been carved with runes that told its name and history, but all that the centuries had worn away. The stone itself was cracked and crumbling at the corners, discolored here and there by spreading white splotches of lichen, while wild roses crept up over the king’s feet almost to his chest.  It was there that Catelyn found Robb, standing somber in the gathering dusk with only Grey Wind beside him. The rain had stopped for once, and he was bareheaded.  Does this castle have a name?  he asked quietly, when she came up to him.   Oldstones, all the smallfolk called it when I was a girl, but no doubt it had some other name when it was still a hall of kings.  She had camped here once with her father, on their way to Seagard. Petyr was with us too…   There’s a song,  he remembered.  ‘Jenny of Oldstones, with the flowers in her hair.’    We’re all just songs in the end. If we are lucky.  She had played at being Jenny that day, had even wound flowers in her hair. And Petyr had pretended to be her Prince of Dragonflies. Catelyn could not have been more than twelve, Petyr just a boy.  Robb studied the sepulcher.  Whose grave is this?    Here lies Tristifer, the Fourth of His Name, King of the Rivers and the Hills.  Her father had told her his story once.  He ruled from the Trident to the Neck, thousands of years before Jenny and her prince, in the days when the kingdoms of the First Men were falling one after the other before the onslaught of the Andals. The Hammer of justice, they called him. He fought a hundred battles and won nine-and-ninety, or so the singers say, and when he raised this castle it was the strongest in Westeros.  She put a hand on her son’s shoulder.  He died in his hundredth battle, when seven Andal kings joined forces against him. The fifth Tristifer was not his equal, and soon the kingdom was lost, and then the castle, and last of all the line. With Tristifer the Fifth died House Mudd, that had ruled the riverlands for a thousand years before the Andals came.    His heir failed him.  Robb ran a hand over the rough weathered stone.  I had hoped to leave Jeyne with child… we tried often enough, but I’m not certain…    It does not always happen the first time.  Though it did with you.  Nor even the hundredth. You are very young.    Young, and a king,  he said.  A king must have an heir. If I should die in my next battle, the kingdom must not die with me."
}