{
  "id": "21070b39aa41c348cc068497f37edc50b69061eb",
  "text": "\"  Seeing the open door somehow seemed to impress upon all three of them what was facing them. Underneath the cloak, Harry turned to the other two.  \"If you want to go back, I won't blame you,\" he said. \"You can take the cloak, I won't need it now.\"  \"Don't be stupid,\" said Ron.  \"We're coming,\" said Hermione.  Harry pushed the door open.  As the door creaked, low, rumbling growls met their ears. All three of the dog's noses sniffed madly in their direction, even though it couldn't see them.  \"What's that at its feet?\" Hermione whispered.  \"Looks like a harp,\" said Ron. \"Snape must have left it there.\"  \"It must wake up the moment you stop playing,\" said Harry. \"Well, here goes...\"  He put Hagrid's flute to his lips and blew. It wasn't really a tune, but from the first note the beast's eyes began to droop. Harry hardly drew breath. Slowly, the dog's growls ceased -- it tottered on its paws and fell to its knees, then it slumped to the ground, fast asleep.  \"Keep playing,\" Ron warned Harry as they slipped out of the cloak and crept toward the trapdoor. They could feel the dog's hot, smelly breath as they approached the giant heads. \"I think we'll be able to pull the door open,\" said Ron, peering over the dog's back. \"Want to go first, Hermione?\"  \"No, I don't!\"  \"All right.\" Ron gritted his teeth and stepped carefully over the dog's legs. He bent and pulled the ring of the trapdoor, which swung up and open.  \"What can you see?\" Hermione said anxiously.  \"Nothing -- just black -- there's no way of climbing down, we'll just have to drop.\"  Harry, who was still playing the flute, waved at Ron to get his attention and pointed at himself.  \"You want to go first? Are you sure?\" said Ron. \"I don't know how deep this thing goes. Give the flute to Hermione so she can keep him asleep.\"  Harry handed the flute over. In the few seconds' silence, the dog growled and twitched, but the moment Hermione began to play, it fell back into its deep sleep.  Harry climbed over it and looked down through the trapdoor. There was no sign of the bottom.  He lowered himself through the hole until he was hanging on by his fingertips. Then he looked up at Ron and said, \"If anything happens to me, don't follow. Go straight to the owlery and send Hedwig to Dumbledore, right?\"  \"Right,\" said Ron.  \"See you in a minute, I hope...  And Harry let go. Cold, damp air rushed past him as he fell down, down, down and -- FLUMP. With a funny, muffled sort of thump he landed on something soft. He sat up and felt around, his eyes not used to the gloom. It felt as though he was sitting on some sort of plant.  \"It's okay!\" he called up to the light the size of a postage stamp, which was the open trapdoor, \"it's a soft landing, you can jump!\"  Ron followed right away. He landed, sprawled next to Harry.  \"What's this stuff?\" were his first words.  \"Dunno, some sort of plant thing. I suppose it's here to break the fall. Come on, Hermione!\"  The distant music stopped. There was a loud bark from the dog, but Hermione had already jumped. She landed on Harry's other side.  \"We must be miles under the school , she said.  \"Lucky this plant thing's here, really,\" said Ron.  \"Lucky!\" shrieked Hermione. \"Look at you both!\"  She leapt up and struggled toward a damp wall. She had to struggle because the moment she had landed, the plant had started to twist snakelike tendrils around her ankles. As for Harry and Ron, their legs had already been bound tightly in long creepers without their noticing.  Hermione had managed to free herself before the plant got a firm grip on her. Now she watched in horror as the two boys fought to pull the plant off them, but the more they strained against it, the tighter and faster the plant wound around them.  \"Stop moving!\" Hermione ordered them. \"I know what this is -- it's Devil's Snare!\"  \"Oh, I'm so glad we know what it's called, that's a great help,\" snarled Ron, leaning back, trying to stop the plant from curling around his neck. \"Shut up, I'm trying to remember how to kill it!\" said Hermione.  \"Well, hurry up, I can't breathe!\" Harry gasped, wrestling with it as it curled around his chest.  \"Devil's Snare, Devil's Snare... what did Professor Sprout say? -- it likes the dark and the damp  \"So light a fire!\" Harry choked.  \"Yes -- of course -- but there's no wood!\" Hermione cried, wringing her hands.  \"HAVE YOU GONE MAD?\" Ron bellowed. \"ARE YOU A WITCH OR NOT?\"  \"Oh, right!\" said Hermione, and she whipped out her wand, waved it, muttered something, and sent a jet of the same bluebell flames she had used on Snape at the plant. In a matter of seconds, the two boys felt it loosening its grip as it cringed away from the light and warmth. Wriggling and flailing, it unraveled itself from their bodies, and they were able to pull free.  \"Lucky you pay attention in Herbology, Hermione,\" said Harry as he joined her by the wall, wiping sweat off his face.  \"Yeah,\" said Ron, \"and lucky Harry doesn't lose his head in a crisis -- 'there's no wood,' honestly."
}