{
  "id": "21106024eedc9348099a5516bbb7c2c0371e7ffc",
  "text": "  She fled from him, but only as far as the next open door. I know this room, she thought. She remembered those great wooden beams and the carved animal faces that adorned them. And there outside the window, a lemon tree! The sight of it made her heart ache with longing. It is the house with the red door, the house in Braavos. No sooner had she thought it than old Ser Willem came into the room, leaning heavily on his stick.  Little princess, there you are,  he said in his gruff kind voice.  Come,  he said,  come to me, my lady, you’re home now, you’re safe now.  His big wrinkled hand reached for her, soft as old leather, and Dany wanted to take it and hold it and kiss it, she wanted that as much as she had ever wanted anything. Her foot edged forward, and then she thought, He’s dead, he’s dead, the sweet old bear, he died a long time ago. She backed away and ran.  The long hall went on and on and on, with endless doors to her left and only torches to her right. She ran past more doors than she could count, closed doors and open ones, doors of wood and doors of iron, carved doors and plain ones, doors with pulls and doors with locks and doors with knockers. Drogon lashed against her back, urging her on, and Dany ran until she could run no more.  Finally a great pair of bronze doors appeared to her left, grander than the rest. They swung open as she neared, and she had to stop and look. Beyond loomed a cavernous stone hall, the largest she had ever seen. The skulls of dead dragons looked down from its walls. Upon a towering barbed throne sat an old man in rich robes, an old man with dark eyes and long silver-grey hair.  Let him be king over charred bones and cooked meat,  he said to a man below him.  Let him be the king of ashes.  Drogon shrieked, his claws digging through silk and skin, but the king on his throne never heard, and Dany moved on.  Viserys, was her first thought the next time she paused, but a second glance told her otherwise. The man had her brother’s hair, but he was taller, and his eyes were a dark indigo rather than lilac.  Aegon,  he said to a woman nursing a newborn babe in a great wooden bed.  What better name for a king?    Will you make a song for him?  the woman asked.   He has a song,  the man replied.  He is the prince that was promised, and his is the song of ice and fire.  He looked up when he said it and his eyes met Dany’s, and it seemed as if he saw her standing there beyond the door.  There must be one more,  he said, though whether he was speaking to her or the woman in the bed she could not say.  The dragon has three heads.  He went to the window seat, picked up a harp, and ran his fingers lightly over its silvery strings. Sweet sadness filled the room as man and wife and babe faded like the morning mist, only the music lingering behind to speed her on her way.  It seemed as though she walked for another hour before the long hall finally ended in a steep stone stair, descending into darkness. Every door, open or closed, had been to her left. Dany looked back behind her. The torches were going out, she realized with a start of fear. Perhaps twenty still burned. Thirty at most. One more guttered out even as she watched, and the darkness came a little farther down the hall, creeping toward her. And as she listened it seemed as if she heard something else coming, shuffling and dragging itself slowly along the faded carpet. Terror filled her. She could not go back and she was afraid to stay here, but how could she go on? There was no door on her right, and the steps went down, not up.  Yet another torch went out as she stood pondering, and the sounds grew faintly louder. Drogon’s long neck snaked out and he opened his mouth to scream, steam rising from between his teeth. He hears it too. Dany turned to the blank wall once more, but there was nothing. Could there be a secret door, a door I cannot see? Another torch went out. Another. The first door on the right, he said, always the first door on the right. The first door on the right…  It came to her suddenly… is the last door on the left!  She flung herself through. Beyond was another small room with four doors. To the right she went, and to the right, and to the right, and to the right, and to the right, and to the right, and to the right, until she was dizzy and out of breath once more.  When she stopped, she found herself in yet another dank stone chamber… but this time the door opposite was round, shaped like an open mouth, and Pyat Pree stood outside in the grass beneath the trees.  Can it be that the Undying are done with you so soon?  he asked in disbelief when he saw her.   So soon?  she said, confused.  I’ve walked for hours, and still not found them.    You have taken a wrong turning. Come, I will lead you.  Pyat Pree held out his hand.  Dany hesitated. There was a door to her right, still closed…   That’s not the way,  Pyat Pree said firmly, his blue lips prim with disapproval.  The Undying Ones will not wait forever.    Our little lives are no more than a flicker of a moth’s wing to them,  Dany said, remembering."
}