{
  "id": "213d08cadd00b7a338dcae3b4659cfcb0f82b0f1",
  "text": "  Both of them were called Walder Frey. Big Walder said there were bunches of Walders at the Twins, all named after the boys’ grandfather, Lord Walder Frey.  We have our own names at Winterfell,  Rickon told them haughtily when he heard that.  The way their game was played, you laid the log across the water, and one player stood in the middle with the stick. He was the lord of the crossing, and when one of the other players came up, he had to say,  I am the lord of the crossing, who goes there?  And the other player had to make up a speech about who they were and why they should be allowed to cross. The lord could make them swear oaths and answer questions. They didn’t have to tell the truth, but the oaths were binding unless they said  Maybaps,  so the trick was to say  Mayhaps  so the lord of the crossing didn’t notice. Then you could try and knock the lord into the water and you got to be lord of the crossing, but only if you’d said  Mayhaps.  Otherwise you were out of the game. The lord got to knock anyone in the water anytime he pleased, and he was the only one who got to use a stick.  In practice, the game seemed to come down to mostly shoving, hitting, and falling into the water, along with a lot of loud arguments about whether or not someone had said  Mayhaps.  Little Walder was lord of the crossing more often than not.  He was Little Walder even though he was tall and stout, with a red face and a big round belly. Big Walder was sharp-faced and skinny and half a foot shorter.  He’s fifty-two days older than me,  Little Walder explained,  so he was bigger at first, but I grew faster.    We’re cousins, not brothers,  added Big Walder, the little one.  I’m Walder son of Jammos. My father was Lord Walder’s son by his fourth wife. He’s Walder son of Merrett. His grandmother was Lord Walder’s third wife, the Crakehall. He’s ahead of me in the line of succession even though I’m older.    Only by fifty-two days,  Little Walder objected.  And neither of us will ever hold the Twins, stupid.    I will,  Big Walder declared.  We’re not the only Walders either. Ser Stevron has a grandson, Black Walder, he’s fourth in line of succession, and there’s Red Walder, Ser Emmon’s son, and Bastard Walder, who isn’t in the line at all. He’s called Walder Rivers not Walder Frey. Plus there’s girls named Walda.    And Tyr. You always forget Tyr.    He’s Waltyr, not Walder,  Big Walder said airily.  And he’s after us, so he doesn’t matter. Anyhow, I never liked him.   Ser Rodrik decreed that they would share Jon Snow’s old bedchamber, since Jon was in the Night’s Watch and never coming back. Bran hated that; it made him feel as if the Freys were trying to steal Jon’s place.  He had watched wistfully while the Walders contested with Turnip the cook’s boy and Joseth’s girls Bandy and Shyra. The Walders had decreed that Bran should be the judge and decide whether or not people had said  Mayhaps,  but as soon as they started playing they forgot all about him.  The shouts and splashes soon drew others: Palla the kennel girl, Cayn’s boy Calon, Tom Too whose father Fat Tom had died with Bran’s father at King’s Landing. Before very long, every one of them was soaked and muddy. Palla was brown from head to heel, with moss in her hair, breathless from laughter. Bran had not heard so much laughing since the night the bloody raven came. If I had my legs, I’d knock all of them into the water, he thought bitterly. No one would ever be lord of the crossing but me.  Finally Rickon came running into the godswood, Shaggydog at his heels. He watched Turnip and Little Walder struggle for the stick until Turnip lost his footing and went in with a huge splash, arms waving. Rickon yelled,  Me! Me now! I want to play!  Little Walder beckoned him on, and Shaggydog started to follow.  No, Shaggy,  his brother commanded.  Wolves can’t play. You stay with Bran.  And he did…  …until Little Walder had smacked Rickon with the stick, square across his belly. Before Bran could blink, the black wolf was flying over the plank, there was blood in the water, the Walders were shrieking red murder, Rickon sat in the mud laughing, and Hodor came lumbering in shouting  Hodor! Hodor! Hodor!   After that, oddly, Rickon decided he liked the Walders. They never played lord of the crossing again, but they played other games—monsters and maidens, rats and cats, come-into-my-castle, all sorts of things. With Rickon by their side, the Walders plundered the kitchens for pies and honeycombs, raced round the walls, tossed bones to the pups in the kennels, and trained with wooden swords under Ser Rodrik’s sharp eye. Rickon even showed them the deep vaults under the earth where the stonemason was carving father’s tomb.  You had no right!  Bran screamed at his brother when he heard.  That was our place, a Stark place!  But Rickon never cared.  The door to his bedchamber opened. Maester Luwin was carrying a green jar, and this time Osha and Hayhead came with him.  I’ve made you a sleeping draught, Bran."
}