{
  "id": "215bebf77f6e3878724ab5e6dc37c2fded481ff4",
  "text": " Yes.  And so, foot by foot, step by step, the bastard girl led Catelyn across, blind and trembling, while the white mule followed placidly behind them.  The waycastle called Sky was no more than a high, crescent-shaped wall of unmortared stone raised against the side of the mountain, but even the topless towers of Valyria could not have looked more beautiful to Catelyn Stark. Here at last the snow crown began; Sky’s weathered stones were rimed with frost, and long spears of ice hung from the slopes above.  Dawn was breaking in the east as Mya Stone hallooed for the guards, and the gates opened before them. Inside the walls there was only a series of ramps and a great tumble of boulders and stones of all sizes. No doubt it would be the easiest thing in the world to begin an avalanche from here. A mouth yawned in the rock face in front of them.  The stables and barracks are in there,  Mya said.  The last part is inside the mountain. It can be a little dark, but at least you’re out of the wind. This is as far as the mules can go. Past here, well, it’s a sort of chimney, more like a stone ladder than proper steps, but it’s not too bad. Another hour and we’ll be there.   Catelyn looked up. Directly overhead, pale in the dawn light, she could see the foundations of the Eyrie. It could not be more than six hundred feet above them. From below it looked like a small white honeycomb. She remembered what her uncle had said of baskets and winches.  The Lannisters may have their pride,  she told Mya,  but the Tullys are born with better sense. I have ridden all day and the best part of a night. Tell them to lower a basket. I shall ride with the turnips.   The sun was well above the mountains by the time Catelyn Stark finally reached the Eyrie. A stocky, silver-haired man in a sky-blue cloak and hammered moon-and-falcon breastplate helped her from the basket; Ser Vardis Egen, captain of Jon Arryn’s household guard. Beside him stood Maester Colemon, thin and nervous, with too little hair and too much neck.  Lady Stark,  Ser Vardis said,  the pleasure is as great as it is unanticipated.  Maester Colemon bobbed his head in agreement.  Indeed it is, my lady, indeed it is. I have sent word to your sister. She left orders to be awakened the instant you arrived.    I hope she had a good night’s rest,  Catelyn said with a certain bite in her tone that seemed to go unnoticed.  The men escorted her from the winch room up a spiral stair. The Eyrie was a small castle by the standards of the great houses; seven slender white towers bunched as tightly as arrows in a quiver on a shoulder of the great mountain. It had no need of stables nor smithys nor kennels, but Ned said its granary was as large as Winterfell’s, and its towers could house five hundred men. Yet it seemed strangely deserted to Catelyn as she passed through it, its pale stone halls echoing and empty.  Lysa was waiting alone in her solar, still clad in her bed robes. Her long auburn hair tumbled unbound across bare white shoulders and down her back. A maid stood behind her, brushing out the night’s tangles, but when Catelyn entered, her sister rose to her feet, smiling.  Cat,  she said.  Oh, Cat, how good it is to see you. My sweet sister.  She ran across the chamber and wrapped her sister in her arms.  How long it has been,  Lysa murmured against her.  Oh, how very very long.   It had been five years, in truth; five cruel years, for Lysa. They had taken their toll. Her sister was two years the younger, yet she looked older now. Shorter than Catelyn, Lysa had grown thick of body, pale and puffy of face. She had the blue eyes of the Tullys, but hers were pale and watery, never still. Her small mouth had turned petulant. As Catelyn held her, she remembered the slender, high-breasted girl who’d waited beside her that day in the sept at Riverrun. How lovely and full of hope she had been. All that remained of her sister’s beauty was the great fall of thick auburn hair that cascaded to her waist.   You look well,  Catelyn lied,  but… tired.   Her sister broke the embrace.  Tired. Yes. Oh, yes.  She seemed to notice the others then; her maid, Maester Colemon, Ser Vardis.  Leave us,  she told them.  I wish to speak to my sister alone.  She held Catelyn’s hand as they withdrew…  … and dropped it the instant the door closed. Catelyn saw her face change. It was as if the sun had gone behind a cloud.  Have you taken leave of your senses?  Lysa snapped at her.  To bring him here, without a word of permission, without so much as a warning, to drag us into your quarrels with the Lannisters…    My quarrels?  Catelyn could scarce believe what she was hearing. A great fire burned in the hearth, but there was no trace of warmth in Lysa’s voice.  They were your quarrels first, sister. It was you who sent me that cursed letter, you who wrote that the Lannisters had murdered your husband.    To warn you, so you could stay away from them! I never meant to fight them! Gods, Cat, do you know what you’ve done?    Mother?  a small voice said."
}