{
  "id": "2166d1a2499aed13db5d29c2dd697126f5930a1a",
  "text": " He had one brief glimpse of an enormous, high-ceilinged room, large as the Great Hall above it, with mounds of glittering brass pots and pans heaped around the stone walls, and a great brick fireplace at the other end, when something small hurtled toward him from the middle of the room, squealing, \"Harry Potter, sir!  Harry Potter!\" Next second all the wind had been knocked out of him as the squealing elf hit him hard in the midriff, hugging him so tightly he thought his ribs would break. \"D-Dobby?\" Harry gasped. \"It is Dobby, sir, it is!\"  squealed the voice from somewhere around his navel.  \"Dobby has been hoping and hoping to see Harry Potter, sir, and Harry Potter has come to see him, sir!\" Dobby let go and stepped back a few paces, beaming up at Harry, his enormous, green, tennis-ball-shaped eyes brimming with tears of happiness.  He looked almost exactly as Harry remembered him; the pencil-shaped nose, the batlike ears, the long fingers and feet - all except the clothes, which were very different. When Dobby had worked for the Malfoys, he had always worn the same filthy old pillowcase.  Now, however, he was wearing the strangest assortment of garments Harry had ever seen; he had done an even worse job of dressing himself than the wizards at the World Cup.  He was wearing a tea cozy for a hat, on which he had pinned a number of bright badges; a tie patterned with horseshoes over a bare chest, a pair of what looked like children's soccer shorts, and odd socks.  One of these, Harry saw, was the black one Harry had removed from his own foot and tricked Mr. Malfoy into giving Dobby, thereby setting Dobby free.  The other was covered in pink and orange stripes. \"Dobby, what're you doing here?\" Harry said in amazement. \"Dobby has come to work at Hogwarts, sir!\" Dobby squealed excitedly.  \"Professor Dumbledore gave Dobby and Winky jobs, sir! \"Winky?\"  said Harry.  \"She's here too?\" \"Yes, sir, yes!\"  said Dobby, and he seized Harry's hand and pulled him off into the kitchen between the four long wooden tables that stood there.  Each of these tables, Harry noticed as he passed them, was positioned exactly beneath the four House tables above, in the Great Hall. At the moment, they were clear of food, dinner having finished, but he supposed that an hour ago they had been laden with dishes that were then sent up through the ceiling to their counterparts above. At least a hundred little elves were standing around the kitchen, beaming, bowing, and curtsying as Dobby led Harry past them.  They were all wearing the same uniform: a tea towel stamped with the Hogwarts crest, and tied, as Winky's had been, like a toga. Dobby stopped in front of the brick fireplace and pointed. \"Winky, sir!\"  he said. Winky was sitting on a stool by the fire.  Unlike Dobby, she had obviously not foraged for clothes.  She was wearing a neat little skirt and blouse with a matching blue hat, which had holes in it for her large ears.  However, while every one of Dobby's strange collection of garments was so clean and well cared for that it looked brand-new, Winky was plainly not taking care other clothes at all.  There were soup stains all down her blouse and a burn in her skirt. \"Hello, Winky,\" said Harry. Winky's lip quivered. Then she burst into tears, which spilled out of her great brown eyes and splashed down her front, just as they had done at the Quidditch World Cup. \"Oh dear,\" said Hermione.  She and Ron had followed Harry and Dobby to the end of the kitchen.  \"Winky, don't cry, please don't...\" But Winky cried harder than ever.  Dobby, on the other hand, beamed up at Harry. \"Would Harry Potter like a cup of tea?\" he squeaked loudly, over Winky's sobs. \"Er - yeah, okay,\" said Harry. Instantly, about six house-elves came trotting up behind him, bearing a large silver tray laden with a teapot, cups for Harry, Ron, and Hermione, a milk jug, and a large plate of biscuits. \"Good service!\"  Ron said, in an impressed voice.  Hermione frowned at him, but the elves all looked delighted; they bowed very low and retreated. \"How long have you been here, Dobby?\"  Harry asked as Dobby handed around the tea. \"Only a week. Harry Potter, sir!\"  said Dobby happily.  \"Dobby came to see Professor Dumbledore, sir.  You see, sir, it is very difficult for a house-elf who has been dismissed to get a new position, sir, very difficult indeed -\" At this, Winky howled even harder, her squashed-tomato of a nose dribbling all down her front, though she made no effort to stem the flow. \"Dobby has traveled the country for two whole years, sir, trying to find work!\"  Dobby squeaked.  \"But Dobby hasn't found work, sir, because Dobby wants paying now!\" The house-elves all around the kitchen, who had been listening and watching with interest, all looked away at these words, as though Dobby had said something rude and embarrassing.  Hermione, however, said, \"Good for you, Dobby!\" \"Thank you, miss!\"  said Dobby, grinning toothily at her.  \"But most wizards doesn't want a house-elf who wants paying, miss."
}