{
  "id": "2294f692582a63961b7b042a1a87fe6796aa7a29",
  "text": "  He closed the clasp and sat back down again.  And you, Jon Snow?   Jon took another swallow of mead. There is only one tale that he might believe.  You say you were at Winterfell, the night my father feasted King Robert.    I did say it, for I was.    Then you saw us all. Prince Joffrey and Prince Tommen, Princess Myrcella, my brothers Robb and Bran and Rickon, my sisters Arya and Sansa. You saw them walk the center aisle with every eye upon them and take their seats at the table just below the dais where the king and queen were seated.    I remember.    And did you see where I was seated, Mance?  He leaned forward.  Did you see where they put the bastard?   Mance Rayder looked at Jon’s face for a long moment.  I think we had best find you a new cloak,  the king said, holding out his hand.      Daenerys   Across the still blue water came the slow steady beat of drums and the soft swish of oars from the galleys. The great cog groaned in their wake, the heavy lines stretched taut between. Balerion’s sails hung limp, drooping forlorn from the masts. Yet even so, as she stood upon the forecastle watching her dragons chase each other across a cloudless blue sky, Daenerys Targaryen was as happy as she could ever remember being.  Her Dothraki called the sea the poison water, distrusting any liquid that their horses could not drink. On the day the three ships had lifted anchor at Qarth, you would have thought they were sailing to hell instead of Pentos. Her brave young bloodriders had stared off at the dwindling coastline with huge white eyes, each of the three determined to show no fear before the other two, while her handmaids Irri and Jhiqui clutched the rail desperately and retched over the side at every little swell. The rest of Dany’s tiny khalasar remained below decks, preferring the company of their nervous horses to the terrifying landless world about the ships. When a sudden squall had enveloped them six days into the voyage, she heard them through the hatches; the horses kicking and screaming, the riders praying in thin quavery voices each time Balerion heaved or swayed.  No squall could frighten Dany, though. Daenerys Stormborn, she was called, for she had come howling into the world on distant Dragonstone as the greatest storm in the memory of Westeros howled outside, a storm so fierce that it ripped gargoyles from the castle walls and smashed her father’s fleet to kindling.  The narrow sea was often stormy, and Dany had crossed it half a hundred times as a girl, running from one Free City to the next half a step ahead of the Usurper’s hired knives. She loved the sea. She liked the sharp salty smell of the air, and the vastness of horizons bounded only by a vault of azure sky above. It made her feel small, but free as well. She liked the dolphins that sometimes swam along beside Balerion, slicing through the waves like silvery spears, and the flying fish they glimpsed now and again. She even liked the sailors, with all their songs and stories. Once on a voyage to Braavos, as she’d watched the crew wrestle down a great green sail in a rising gale, she had even thought how fine it would be to be a sailor. But when she told her brother, Viserys had twisted her hair until she cried.  You are blood of the dragon,  he had screamed at her.  A dragon, not some smelly fish.   He was a fool about that, and so much else, Dany thought. If he had been wiser and more patient, it would be him sailing west to take the throne that was his by rights. Viserys had been stupid and vicious, she had come to realize, yet sometimes she missed him all the same. Not the cruel weak man he had become by the end, but the brother who had sometimes let her creep into his bed, the boy who told her tales of the Seven Kingdoms, and talked of how much better their lives would be once he claimed his crown.  The captain appeared at her elbow.  Would that this Balerion could soar as her namesake did, Your Grace,  he said in bastard Valyrian heavily flavored with accents of Pentos.  Then we should not need to row, nor tow, nor pray for wind.    Just so, Captain,  she answered with a smile, pleased to have won the man over. Captain Groleo was an old Pentoshi like his master, Illyrio Mopatis, and he had been nervous as a maiden about carrying three dragons on his ship. Half a hundred buckets of seawater still hung from the gunwales, in case of fires. At first Groleo had wanted the dragons caged and Dany had consented to put his fears at ease, but their misery was so palpable that she soon changed her mind and insisted they be freed.  Even Captain Groleo was glad of that, now. There had been one small fire, easily extinguished; against that, Balerion suddenly seemed to have far fewer rats than she’d had before, when she sailed under the name Saduleon. And her crew, once as fearful as they were curious, had begun to take a queer fierce pride in  their  dragons. Every man of them, from captain to cook’s boy, loved to watch the three fly… though none so much as Dany."
}