{
  "id": "22ac9ade5f8547a617ef4c92599253f7e6963140",
  "text": "  With each prayer he took another step, dragging his legs through the snow.  Mother have mercy, Mother have mercy, Mother have mercy.   His own mother was a thousand leagues south, safe with his sisters and his little brother Dickon in the keep at Horn Hill. She can’t hear me, no more than the Mother Above. The Mother was merciful, all the septons agreed, but the Seven had no power beyond the Wall. This was where the old gods ruled, the nameless gods of the trees and the wolves and the snows.  Mercy,  he whispered then, to whatever might be listening, old gods or new, or demons too,  oh, mercy, mercy me, mercy me.   Maslyn screamed for mercy. Why had he suddenly remembered that? It was nothing he wanted to remember. The man had stumbled backward, dropping his sword, pleading, yielding, even yanking off his thick black glove and thrusting it up before him as if it were a gauntlet. He was still shrieking for quarter as the wight lifted him in the air by the throat and near ripped the head off him. The dead have no mercy left in them, and the Others… no, I mustn’t think of that, don’t think, don’t remember, just walk, just walk, just walk.  Sobbing, he took another step.  A root beneath the crust caught his toe, and Sam tripped and fell heavily to one knee, so hard he bit his tongue. He could taste the blood in his mouth, warmer than anything he had tasted since the Fist. This is the end, he thought. Now that he had fallen he could not seem to find the strength to rise again. He groped for a tree branch and clutched it tight, trying to pull himself back to his feet, but his stiff legs would not support him. The mail was too heavy, and he was too fat besides, and too weak, and too tired.   Back on your feet, Piggy,  someone growled as he went past, but Sam paid him no mind. I’ll just lie down in the snow and close my eyes. It wouldn’t be so bad, dying here. He couldn’t possibly be any colder, and after a little while he wouldn’t be able to feel the ache in his lower back or the terrible pain in his shoulders, no more than he could feel his feet. I won’t be the first to die, they can’t say I was. Hundreds had died on the Fist, they had died all around him, and more had died after, he’d seen them. Shivering, Sam released his grip on the tree and eased himself down in the snow. It was cold and wet, he knew, but he could scarcely feel it through all his clothing. He stared upward at the pale white sky as snowflakes drifted down upon his stomach and his chest and his eyelids. The snow will cover me like a thick white blanket. It will be warm under the snow, and if they speak of me they’ll have to say I died a man of the Night’s Watch. I did. I did. I did my duty. No one can say I forswore myself. I’m fat and I’m weak and I’m craven, but I did my duty.  The ravens had been his responsibility. That was why they had brought him along. He hadn’t wanted to go, he’d told them so, he’d told them all what a big coward he was. But Maester Aemon was very old and blind besides, so they had to send Sam to tend to the ravens. The Lord Commander had given him his orders when they made their camp on the Fist.  You’re no fighter. We both know that, boy. If it happens that we’re attacked, don’t go trying to prove otherwise, you’ll just get in the way. You’re to send a message. And don’t come running to ask what the letter should say. Write it out yourself, and send one bird to Castle Black and another to the Shadow Tower.  The Old Bear pointed a gloved finger right in Sam’s face.  I don’t care if you’re so scared you foul your breeches, and I don’t care if a thousand wildlings are coming over the walls howling for your blood, you get those birds off, or I swear I’ll hunt you through all seven hells and make you damn sorry that you didn’t.  And Mormont’s own raven had bobbed its head up and down and croaked,  Sorry, sorry, sorry.   Sam was sorry; sorry he hadn’t been braver, or stronger, or good with swords, that he hadn’t been a better son to his father and a better brother to Dickon and the girls. He was sorry to die too, but better men had died on the Fist, good men and true, not squeaking fat boys like him. At least he would not have the Old Bear hunting him through hell, though. I got the birds off. I did that right, at least. He had written out the messages ahead of time, short messages and simple, telling of an attack on the Fist of the First Men, and then he had tucked them away safe in his parchment pouch, hoping he would never need to send them.  When the horns blew Sam had been sleeping. He thought he was dreaming them at first, but when he opened his eyes snow was falling on the camp and the black brothers were all grabbing bows and spears and running toward the ringwall. Chett was the only one nearby, Maester Aemon’s old steward with the face full of boils and the big wen on his neck. Sam had never seen so much fear on a man’s face as he saw on Chett’s when that third blast came moaning through the trees.  Help me get the birds off,  he pleaded, but the other steward had turned and run off, dagger in hand."
}