{
  "id": "22dffd857252516f804ff838837fe920f48af4c5",
  "text": " You used to buy your swords from him.    Just so. He charged me twice what they were worth, then scolded me for setting them afire.  Thoros laughed.  Your master had it right. I was no very holy priest. I was born youngest of eight, so my father gave me over to the Red Temple, but it was not the path I would have chosen. I prayed the prayers and I spoke the spells, but I would also lead raids on the kitchens, and from time to time they found girls in my bed. Such wicked girls, I never knew how they got there.   I had a gift for tongues, though. And when I gazed into the flames, well, from time to time I saw things. Even so, I was more bother than I was worth, so they sent me finally to King’s Landing to bring the Lord’s light to seven-besotted Westeros. King Aerys so loved fire it was thought he might make a convert. Alas, his pyromancers knew better tricks than I did.   King Robert was fond of me, though, The first time I rode into a mêlée with a flaming sword, Kevan Lannister’s horse reared and threw him and His Grace laughed so hard I thought he might rupture.  The red priest smiled at the memory.  It was no way to treat a blade, though, your master had the right of that too.    Fire consumes,  Lord Beric stood behind them, and there was something in his voice that silenced Thoros at once.  It consumes, and when it is done there is nothing left. Nothing.    Beric. Sweet friend.  The priest touched the lightning lord on the forearm.  What are you saying?    Nothing I have not said before. Six times, Thoros? Six times is too many.  He turned away abruptly.  That night the wind was howling almost like a wolf and there were some real wolves off to the west giving it lessons. Notch, Anguy, and Merrit o’ Moontown had the watch. Ned, Gendry, and many of the others were fast asleep when Arya spied the small pale shape creeping behind the horses, thin white hair flying wild as she leaned upon a gnarled cane. The woman could not have been more than three feet tall. The firelight made her eyes gleam as red as the eyes of Jon’s wolf. He was a ghost too. Arya stole closer, and knelt to watch.  Thoros and Lem were with Lord Beric when the dwarf woman sat down uninvited by the fire. She squinted at them with eyes like hot coals.  The Ember and the Lemon come to honor me again, and His Grace the Lord of Corpses.    An ill-omened name. I have asked you not to use it.    Aye, you have. But the stink of death is fresh on you, my lord.  She had but a single tooth remaining.  Give me wine or I will go. My bones are old. My joints ache when the winds do blow, and up here the winds are always blowing.    A silver stag for your dreams, my lady,  Lord Beric said, with solemn courtesy.  Another if you have news for us.    I cannot eat a silver stag, nor ride one. A skin of wine for my dreams, and for my news a kiss from the great oaf in the yellow cloak.  The little woman cackled.  Aye, a sloppy kiss, a bit of tongue. It has been too long, too long. His mouth will taste of lemons, and mine of bones. I am too old.    Aye,  Lem complained.  Too old for wine and kisses. All you’ll get from me is the flat of my sword, crone.    My hair comes out in handfuls and no one has kissed me for a thousand years. It is hard to be so old. Well, I will have a song then. A song from Tom o’ Sevens, for my news.    You will have your song from Tom,  Lord Beric promised. He gave her the wineskin himself.  The dwarf woman drank deep, the wine running down her chin. When she lowered the skin, she wiped her mouth with the back of a wrinkled hand and said,  Sour wine for sour tidings, what could be more fitting? The king is dead, is that sour enough for you?   Arya’s heart caught in her throat.   Which bloody king is dead, crone?  Lem demanded.   The wet one. The kraken king, m’lords. I dreamt him dead and he died, and the iron squids now turn on one another. Oh, and Lord Hoster Tully’s died too, but you know that, don’t you? In the hall of kings, the goat sits alone and fevered as the great dog descends on him.  The old woman took another long gulp of wine, squeezing the skin as she raised it to her lips.  The great dog. Did she mean the Hound? Or maybe his brother, the Mountain That Rides? Arya was not certain. They bore the same arms, three black dogs on a yellow field. Half the men whose deaths she prayed for belonged to Ser Gregor Clegane; Polliver, Dunsen, Raff the Sweetling, the Tickler, and Ser Gregor himself. Maybe Lord Beric will hang them all.   I dreamt a wolf howling in the rain, but no one heard his grief,  the dwarf woman was saying.  I dreamt such a clangor I thought my head might burst, drums and horns and pipes and screams, but the saddest sound was the little bells. I dreamt of a maid at a feast with purple serpents in her hair, venom dripping from their fangs. And later I dreamt that maid again, slaying a savage giant in a castle built of snow.  She turned her head sharply and smiled through the gloom, right at Arya.  You cannot hide from me, child."
}