{
  "id": "22e4f43fce2d6d44dec21ffe13ece2c1332f96d7",
  "text": "  You have a mother’s heart, and I know His Grace loves his little sweetling. Yet kings must learn to put the needs of the realm before their own desires. I say this offer must be made.   The queen pulled free of the eunuch’s touch.  You would not speak so if you were women. Say what you will, my lords, but Joffrey is too proud to settle for Renly’s leavings. He will never consent.   Tyrion shrugged.  When the king comes of age in three years, he may give or withhold his consent as he pleases. Until then, you are his regent and I am his Hand, and he will marry whomever we tell him to marry. Leavings or no.   Cersei’s quiver was empty.  Make your offer then, but gods save you all if Joff does not like this girl.    I’m so pleased we can agree,  Tyrion said.  Now, which of us shall go to Bitterbridge? We must reach Ser Loras with our offer before his blood can cool.    You mean to send one of the council?    I can scarcely expect the Knight of Flowers to treat with Bronn or Shagga, can I? The Tyrells are proud.   His sister wasted no time trying to twist the situation to her advantage.  Ser Jacelyn Bywater is nobly born. Send him.   Tyrion shook his head.  We need someone who can do more than repeat our words and fetch back a reply. Our envoy must speak for king and council and settle the matter quickly.    The Hand speaks with the king’s voice.  Candlelight gleamed green as wildfire in Cersei’s eyes.  If we send you, Tyrion, it will be as if Joffrey went himself. And who better, You wield words as skillfully as Jaime wields a sword.   Are you that eager to get me out of the city, Cersei?  You are too kind, sister, but it seems to me that a boy’s mother is better fitted to arrange his marriage than any uncle. And you have a gift for winning friends that I could never hope to match.   Her eyes narrowed.  Joff needs me at his side.    Your Grace, my lord Hand,  said Littlefinger,  the king needs both of you here. Let me go in your stead.    You?  What gain does he see in this? Tyrion wondered.   I am of the king’s council, yet not the king’s blood, so I would make a poor hostage. I knew Ser Loras passing well when he was here at court, and gave him no cause to mislike me. Mace Tyrell bears me no enmity that I know of, and I flatter myself that I am not unskilled in negotiation.   He has us. Tyrion did not trust Petyr Baelish, nor did he want the man out of his sight, yet what other choice was left him? It must be Littlefinger or Tyrion himself, and he knew full well that if he left King’s Landing for any length of time, all that he had managed to accomplish would be undone.  There is fighting between here and Bitterbridge,  he said cautiously.  And you can be past certain that Lord Stannis will be dispatching his own shepherds to gather in his brother’s wayward lambs.    I’ve never been frightened of shepherds. It’s the sheep who trouble me. Still, I suppose an escort might be in order.    I can spare a hundred gold cloaks,  Tyrion said.   Five hundred.    Three hundred.    And forty more—twenty knights with as many squires. If I arrive without a knightly tail, the Tyrells will think me of small account.   That was true enough.  Agreed.    I’ll include Horror and Slobber in my party, and send them on to their lord father afterward. A gesture of goodwill. We need Paxter Redwyne, he’s Mace Tyrell’s oldest friend, and a great power in his own right.    And a traitor,  the queen said, balking.  The Arbor would have declared for Renly with all the rest, except that Redwyne knew full well his whelps would suffer for it.    Renly is dead, Your Grace,  Littlefinger pointed out,  and neither Stannis nor Lord Paxter will have forgotten how Redwyne galleys closed the sea during the siege of Storm’s End. Restore the twins and perchance we may win Redwyne’s love.   Cersei remained unconvinced.  The Others can keep his love, I want his swords and sails. Holding tight to those twins is the best way to make certain that we’ll have them.   Tyrion had the answer.  Then let us send Ser Hobber back to the Arbor and keep Ser Horas here. Lord Paxter ought to be clever enough to riddle out the meaning of that, I should think.   The suggestion was carried without protest, but Littlefinger was not done.  We’ll want horses. Swift and strong. The fighting will make remounts hard to come by. A goodly supply of gold will also be needed, for those gifts we spoke of earlier.    Take as much as you require. If the city falls, Stannis will steal it all anyway.    I’ll want my commission in writing. A document that will leave Mace Tyrell in no doubt as to my authority, granting me full power to treat with him concerning this match and any other arrangements that might be required, and to make binding pledges in the king’s name. It should be signed by Joffrey and every member of this council, and bear all our seals.   Tyrion shifted uncomfortably.  Done. Will that be all? I remind you, there’s a long road between here and Bitterbridge.    I’ll be riding it before dawn breaks."
}