{
  "id": "2311d32cd39734fbcc1e442eadbc73c984da1395",
  "text": " Harry grinned back. And there, in the center of the High Table, in a large gold chair, sat Albus Dumbledore. Harry recognized him at once from the card he'd gotten out of the Chocolate Frog on the train. Dumbledore's silver hair was the only thing in the whole hall that shone as brightly as the ghosts. Harry spotted Professor Quirtell, too, the nervous young man from the Leaky Cauldron. He was looking very peculiar in a large purple turban.  And now there were only three people left to be sorted. \"Thomas, Dean,\" a Black boy even taller than Ron, joined Harry at the Gryffindor table. \"Turpin, Lisa,\" became a Ravenclaw and then it was Ron's turn. He was pale green by now. Harry crossed his fingers under the table and a second later the hat had shouted, \"GRYFFINDOR!\"  Harry clapped loudly with the rest as Ron collapsed into the chair next to him.  \"Well done, Ron, excellent,\" said Percy Weasley Pompously across Harry as \"Zabini, Blaise,\" was made a Slytherin. Professor McGonagall rolled up her scroll and took the Sorting Hat away.  Harry looked down at his empty gold plate. He had only just realized how hungry he was. The pumpkin pasties seemed ages ago.  Albus Dumbledore had gotten to his feet. He was beaming at the students, his arms opened wide, as if nothing could have pleased him more than to see them all there.  \"Welcome,\" he said. \"Welcome to a new year at Hogwarts! Before we begin our banquet, I would like to say a few words. And here they are: Nitwit! Blubber! Oddment! Tweak!  \"Thank you!\"  He sat back down. Everybody clapped and cheered. Harry didn't know whether to laugh or not.  \"Is he -- a bit mad?\" he asked Percy uncertainly.  \"Mad?\" said Percy airily. \"He's a genius! Best wizard in the world! But he is a bit mad, yes. Potatoes, Harry?\"  Harry's mouth fell open. The dishes in front of him were now piled with food. He had never seen so many things he liked to eat on one table: roast beef, roast chicken, pork chops and lamb chops, sausages, bacon and steak, boiled potatoes, roast potatoes, fries, Yorkshire pudding, peas, carrots, gravy, ketchup, and, for some strange reason, peppermint humbugs.  The Dursleys had never exactly starved Harry, but he'd never been allowed to eat as much as he liked. Dudley had always taken anything that Harry really wanted, even if It made him sick. Harry piled his plate with a bit of everything except the peppermints and began to eat. It was all delicious.  \"That does look good,\" said the ghost in the ruff sadly, watching Harry cut up his steak,  \"Can't you --?\"  I haven't eaten for nearly four hundred years,\" said the ghost. \"I don't need to, of course, but one does miss it. I don't think I've in troduced myself? Sir Nicholas de Mimsy-Porpington at your service. Resident ghost of Gryffindor Tower.\"  \"I know who you are!\" said Ron suddenly. \"My brothers told me about you -- you're Nearly Headless Nick!\"  \"I would prefer you to call me Sir Nicholas de Mimsy --\" the ghost began stiffly, but sandy-haired Seamus Finnigan interrupted.  \"Nearly Headless? How can you be nearly headless?\"  Sir Nicholas looked extremely miffed, as if their little chat wasn't going at all the way he wanted.  \"Like this,\" he said irritably. He seized his left ear and pulled. His whole head swung off his neck and fell onto his shoulder as if it was on a hinge. Someone had obviously tried to behead him, but not done it properly. Looking pleased at the stunned looks on their faces, Nearly Headless Nick flipped his head back onto his neck, coughed, and said, \"So -- new Gryffindors! I hope you're going to help us win the house championship this year? Gryffindors have never gone so long without winning. Slytherins have got the cup six years in a row! The Bloody Baron's becoming almost unbearable -- he's the Slytherin ghost.\"  Harry looked over at the Slytherin table and saw a horrible ghost sitting there, with blank staring eyes, a gaunt face, and robes stained with silver blood. He was right next to Malfoy who, Harry was pleased to see, didn't look too pleased with the seating arrangements.  \"How did he get covered in blood?\" asked Seamus with great interest.  \"I've never asked,\" said Nearly Headless Nick delicately.  When everyone had eaten as much as they could, the remains of the food faded from the plates, leaving them sparkling clean as before. A moment later the desserts appeared. Blocks of ice cream in every flavor you could think of, apple pies, treacle tarts, chocolate eclairs and jam doughnuts, trifle, strawberries, Jell-O, rice pudding -- \"  As Harry helped himself to a treacle tart, the talk turned to their families.  \"I'm half-and-half,\" said Seamus. \"Me dad's a Muggle. Mom didn't tell him she was a witch 'til after they were married. Bit of a nasty shock for him.\"  The others laughed.  \"What about you, Neville?\" said Ron.  \"Well, my gran brought me up and she's a witch,\" said Neville, \"but the family thought I was all- Muggle for ages. My Great Uncle Algie kept trying to catch me off my guard and force some magic out of me -- he pushed me off the end of Blackpool pier once, I nearly drowned -- but nothing happened until I was eight."
}