{
  "id": "23485aa6d221d20cecfc8f832f7c8e1329b34c60",
  "text": "  \"Due north,\" said Ron, checking the compass on the dashboard. \"Okay, we'll just have to check on it every half hour or so - hold on  And they shot up through the clouds. A minute later, they burst out into a blaze of sunlight.  It was a different world. The wheels of the car skimmed the sea of fluffy cloud, the sky a bright, endless blue under the blinding white sun.  \"All we've got to worry about now are airplanes,\" said Ron.  They looked at each other and started to laugh; for a long time, they couldn't stop.  It was as though they had been plunged into a fabulous dream. This, thought Harry, was surely the only way to travel - past swirls and turrets of snowy cloud, in a car full of hot, bright sunlight, with a fat pack of toffees in the glove compartment, and the prospect of seeing Fred's and George's jealous faces when they  * 71  landed smoothly and spectacularly on the sweeping lawn in front of Hogwarts castle.  They made regular checks on the train as they flew farther and farther north, each dip beneath the clouds showing them a different view. London was soon far behind them, replaced by neat green fields that gave way in turn to wide, purplish moors, a great city alive with cars like multicolored ants, villages with tiny toy churches.  Several uneventful hours later, however, Harry had to admit that some of the fun was wearing off. The toffees had made them extremely thirsty and they had nothing to drink. He and Ron had pulled off their sweaters, but Harry's T-shirt was sticking to the back of his seat and his glasses kept sliding down to the end of his sweaty nose. He had stopped noticing the fantastic cloud shapes now and was thinking longingly of the train miles below, where you could buy ice-cold pumpkin juice from a trolley pushed by a plump witch. Why hadn't they been able to get onto platform nine and three-quarters?  \"Can't be much further, can it?\" croaked Ron, hours later still, as the sun started to sink into their floor of cloud, staining it a deep pink. \"Ready for another check on the train?\"  It was still right below them, winding its way past a snowcapped mountain. It was much darker beneath the canopy of clouds.  Ron put his foot on the accelerator and drove them upward again, but as he did so, the engine began to whine.  Harry and Ron exchanged nervous glances.  \"It's probably just tired,\" said Ron. \"It's never been this far before ......  12  And they both pretended not to notice the whining growing louder and louder as the sky became steadily darker. Stars were blossoming in the blackness. Harry pulled his sweater back on, try ing to ignore the way the windshield wipers were now waving fee bly, as though in protest. \"Not far,\" said Ron, more to the car than to Harry, \"not far now,\" and he patted the dashboard nervously. When they flew back beneath the clouds a little while later, they had to squint through the darkness for a landmark they knew. \"There!\" Harry shouted, making Ron and Hedwig jump. \"Straight ahead!\" Silhouetted on the dark horizon, high on the cliff over the lake, stood the many turrets and towers of Hogwarts castle. But the car had begun to shudder and was losing speed. \"Come on,\" Ron said cajolingly, giving the steering wheel a lit tle shake, \"nearly there, come on -\" The engine groaned. Narrow jets of steam were issuing from un der the hood. Harry found himself gripping the edges of his seat very hard as they flew toward the lake. The car gave a nasty wobble. Glancing out of his window, Harry saw the smooth, black, glassy surface of the water, a mile below. Ron's knuckles were white on the steering wheel. The car wobbled again. \"Come on,\" Ron muttered. They were over the lake - the castle was right ahead - Ron put his foot down. There was a loud clunk, a splutter, and the engine died com pletely.  \"Uh-oh,\" said Ron, into the silence.  The nose of the car dropped. They were falling, gathering speed, heading straight for the solid castle wall.  \"Noooooo!\" Ron yelled, swinging the steering wheel around; they missed the dark stone wall by inches as the car turned in a great arc, soaring over the dark greenhouses, then the vegetable patch, and then out over the black lawns, losing altitude all the time.  Ron let go of the steering wheel completely and pulled his wand out of his back pocket  \"STOP! STOP!\" he yelled, whacking the dashboard and the windshield, but they were still plummeting, the ground flying up toward them  \"WATCH OUT FOR THAT TREE!\" Harry bellowed, lunging for the steering wheel, but too late  CRUNCH.  With an earsplitting bang of metal on wood, they hit the thick tree trunk and dropped to the ground with a heavy jolt. Steam was billowing from under the crumpled hood; Hedwig was shrieking in terror; a golfball-size lump was throbbing on Harry's head where he had hit the windshield; and to his right, Ron let out a low, despairing groan.  \"Are you okay?\" Harry said urgently.  \"My wand,\" said Ron, in a shaky voice. \"Look at my wand -\"  It had snapped, almost in two; the tip was dangling limply, held on by a few splinters."
}