{
  "id": "23b95f41849a40e26811c498e65315122a1a032f",
  "text": " Some of the castle women sobbed to see him go. Weese said he was a great horseman and sword fighter, Lord Tywin’s most daring commander.  I hope he dies, Arya thought as she watched him ride out the gate, his men streaming after him in a double column. I hope they all die. They were going to fight Robb, she knew. Listening to the talk as she went about her work, Arya had learned that Robb had won some great victory in the west. He’d burned Lannisport, some said, or else he meant to burn it. He’d captured Casterly Rock and put everyone to the sword, or he was besieging the Golden Tooth… but something had happened, that much was certain.  Weese had her running messages from dawn to dusk. Some of them even took her beyond the castle walls, out into the mud and madness of the camp. I could flee, she thought as a wagon rumbled past her. I could hop on the back of a wagon and hide, or fall in with the camp followers, no one would stop me. She might have done it if not for Weese. He’d told them more than once what he’d do to anyone who tried to run off on him.  It won’t be no beating, oh, no. I won’t lay a finger on you. I’ll just save you for the Qohorik, yes I will, I’ll save you for the Crippler. Vargo Hoat his name is, and when he gets back he’ll cut off your feet.  Maybe if Weese were dead, Arya thought… but not when she was with him. He could look at you and smell what you were thinking, he always said so.  Weese never imagined she could read, though, so he never bothered to seal the messages he gave her. Arya peeked at them all, but they were never anything good, just stupid stuff sending this cart to the granary and that one to the armory. One was a demand for payment on a gambling debt, but the knight she gave it to couldn’t read. When she told him what it said he tried to hit her, but Arya ducked under the blow, snatched a silver-banded drinking horn off his saddle, and darted away. The knight roared and came after her, but she slid between two wayns, wove through a crowd of archers, and jumped a latrine trench. In his mail he couldn’t keep up. When she gave the horn to Weese, he told her that a smart little Weasel like her deserved a reward.  I’ve got my eye on a plump crisp capon to sup on tonight. We’ll share it, me and you. You’ll like that.   Everywhere she went, Arya searched for Jaqen H’ghar, wanting to whisper another name to him before those she hated were all gone out of her reach, but amidst the chaos and confusion the Lorathi sellsword was not to be found. He still owed her two deaths, and she was worried she would never get them if he rode off to battle with the rest. Finally she worked up the courage to ask one of the gate guards if he’d gone.  One of Lorch’s men, is he?  the man said.  He won’t be going, then. His lordship’s named Ser Amory castellan of Harrenhal. That whole lot’s staying right here, to hold the castle. The Bloody Mummers will be left as well, to do the foraging. That goat Vargo Hoat is like to spit, him and Lorch have always hated each other.   The Mountain would be leaving with Lord Tywin, though. He would command the van in battle, which meant that Dunsen, Polliver, and Raff would all slip between her fingers unless she could find Jaqen and have him kill one of them before they left.   Weasel,  Weese said that afternoon.  Get to the armory and tell Lucan that Ser Lyonel notched his sword in practice and needs a new one. Here’s his mark.  He handed her a square of paper.  Be quick about it now, he’s to ride with Ser Kevan Lannister.   Arya took the paper and ran. The armory adjoined the castle smithy, a long high-roofed tunnel of a building with twenty forges built into its walls and long stone water troughs for tempering the steel. Half of the forges were at work when she entered. The walls rang with the sound of hammers, and burly men in leather aprons stood sweating in the sullen heat as they bent over bellows and anvils. When she spied Gendry, his bare chest was slick with sweat, but the blue eyes under the heavy black hair had the stubborn look she remembered. Arya didn’t know that she even wanted to talk to him. It was his fault they’d all been caught.  Which one is Lucan?  She thrust out the paper.  I’m to get a new sword for Ser Lyonel.    Never mind about Ser Lyonel.  He drew her aside by the arm.  Last night Hot Pie asked me if I heard you yell Winterfell back at the holdfast, when we were all fighting on the wall.    I never did!    Yes you did. I heard you too.    Everyone was yelling stuff,  Arya said defensively.  Hot Pie yelled hot pie. He must have yelled it a hundred times.    It’s what you yelled that matters. I told Hot Pie he should clean the wax out of his ears, that all you yelled was Go to hell! If he asks you, you better say the same.    I will,  she said, even though she thought go to hell was a stupid thing to yell. She didn’t dare tell Hot Pie who she really was. Maybe I should say Hot Pie’s name to Jaqen.   I’ll get Lucan,  Gendry said.  Lucan grunted at the writing (though Arya did not think he could read it), and pulled down a heavy longsword."
}