{
  "id": "23e6fa24ac0d035107c49850fd130b224eadce63",
  "text": "  I don’t know.    I do,  said Lord Commander Mormont.  The cold winds are rising, Snow. Beyond the Wall, the shadows lengthen. Cotter Pyke writes of vast herds of elk, streaming south and east toward the sea, and mammoths as well. He says one of his men discovered huge, misshapen footprints not three leagues from Eastwatch. Rangers from the Shadow Tower have found whole villages abandoned, and at night Ser Denys says they see fires in the mountains, huge blazes that burn from dusk till dawn. Quorin Halfhand took a captive in the depths of the Gorge, and the man swears that Mance Rayder is massing all his people in some new, secret stronghold he’s found, to what end the gods only know. Do you think your uncle Benjen was the only ranger we’ve lost this past year?    Ben Jen,  the raven squawked, bobbing its head, bits of egg dribbling from its beak.  Ben Jen. Ben Jen.    No,  Jon said. There had been others. Too many.   Do you think your brother’s war is more important than ours?  the old man barked.  Jon chewed his lip. The raven flapped its wings at him.  War, war, war, war,  it sang.   It’s not,  Mormont told him.  Gods save us, boy, you’re not blind and you’re not stupid. When dead men come hunting in the night, do you think it matters who sits the Iron Throne?    No.  Jon had not thought of it that way.   Your lord father sent you to us, Jon. Why, who can say?    Why? Why? Why?  the raven called.   All I know is that the blood of the First Men flows in the veins of the Starks. The First Men built the Wall, and it’s said they remember things otherwise forgotten. And that beast of yours… he led us to the wights, warned you of the dead man on the steps. Ser Jaremy would doubtless call that happenstance, yet Ser Jaremy is dead and I’m not.  Lord Mormont stabbed a chunk of ham with the point of his dagger.  I think you were meant to be here, and I want you and that wolf of yours with us when we go beyond the Wall.   His words sent a chill of excitement down Jon’s back.  Beyond the Wall?    You heard me. I mean to find Ben Stark, alive or dead.  He chewed and swallowed.  I will not sit here meekly and wait for the snows and the ice winds. We must know what is happening. This time the Night’s Watch will ride in force, against the King-beyond-the-Wall, the Others, and anything else that may be out there. I mean to command them myself.  He pointed his dagger at Jon’s chest.  By custom, the Lord Commander’s steward is his squire as well… but I do not care to wake every dawn wondering if you’ve run off again. So I will have an answer from you, Lord Snow, and I will have it now. Are you a brother of the Night’s Watch… or only a bastard boy who wants to play at war?   Jon Snow straightened himself and took a long deep breath. Forgive me, Father. Robb, Arya, Bran… forgive me, I cannot help you. He has the truth of it. This is my place.  I am… yours, my lord. Your man. I swear it. I will not run again.   The Old Bear snorted.  Good. Now go put on your sword.       CATELYN  It seemed a thousand years ago that Catelyn Stark had carried her infant son out of Riverrun, crossing the Tumblestone in a small boat to begin their journey north to Winterfell. And it was across the Tumblestone that they came home now, though the boy wore plate and mail in place of swaddling clothes.  Robb sat in the bow with Grey Wind, his hand resting on his direwolf s head as the rowers pulled at their oars. Theon Greyjoy was with him. Her uncle Brynden would come behind in the second boat, with the Greatjon and Lord Karstark.  Catelyn took a place toward the stern. They shot down the Tumblestone, letting the strong current push them past the looming Wheel Tower. The splash and rumble of the great waterwheel within was a sound from her girlhood that brought a sad smile to Catelyn’s face. From the sandstone walls of the castle, soldiers and servants shouted down her name, and Robb’s, and  Winterfell!  From every rampart waved the banner of House Tully: a leaping trout, silver, against a rippling blue-and-red field. It was a stirring sight, yet it did not lift her heart. She wondered if indeed her heart would ever lift again. Oh, Ned…  Below the Wheel Tower, they made a wide turn and knifed through the churning water. The men put their backs into it. The wide arch of the Water Gate came into view, and she heard the creak of heavy chains as the great iron portcullis was winched upward. It rose slowly as they approached, and Catelyn saw that the lower half of it was red with rust. The bottom foot dripped brown mud on them as they passed underneath, the barbed spikes mere inches above their heads. Catelyn gazed up at the bars and wondered how deep the rust went and how well the portcullis would stand up to a ram and whether it ought to be replaced. Thoughts like that were seldom far from her mind these days.  They passed beneath the arch and under the walls, moving from sunlight to shadow and back into sunlight. Boats large and small were tied up all around them, secured to iron rings set in the stone."
}