{
  "id": "243107b67d60084e684136c2c5d1691be8a31ef2",
  "text": "...\"  \"Certainly, certainly,\" said Dumbledore, his eyes twinkling. \"Let me draw you up a chair --\"  And he did indeed draw a chair in midair with his wand, which revolved for a few seconds before falling with a thud between Professors Snape and McGonagall. Professor Trelawney, however, did not sit down; her enormous eyes had been roving around the table, and she suddenly uttered a kind of soft scream.  I dare not, Headmaster! If I join the table, we shall be thirteen! Nothing could be more unlucky! Never forget that when thirteen dine together, the first to rise will be the first to die!\"  \"We'll risk it, Sibyll,\" said Professor McGonagall inpatiendy. \"Do sit down, the turkey's getting stone cold.\"  Professor Trelawney hesitated, then lowered herself into the empty chair, eyes shut and mouth clenched tight, as though expecting a thunderbolt to hit the table. Professor McGonagall poked a large spoon into the nearest tureen.  \"Tripe, Sibyll?\"  Professor Trelawney ignored her. Eyes open again, she looked around once more and said, \"But where is dear Professor Lupin?\"  \"I'm afraid the poor fellow is ill again,\" said Dumbledore, indicating that everybody should start serving themselves. \"Most unfortunate that it should happen on Christmas Day.\"  \"But surely you already knew that, Sibyll?\" said Professor McGonagall, her eyebrows raised.  Professor Trelawney gave Professor McGonagall a very cold look.  \"Certainly I knew, Minerva, 11 she said quietly. \"But one does not parade the fact that one is All- Knowing. I frequently act as though I am not possessed of the Inner Eye, so as not to make others nervous.  \"That explains a great deal,\" said Professor McGonagall tartly.  Professor Trelawney's voice suddenly became a good deal less misty.  \"If you must know, Minerva, I have seen that poor Professor Lupin will not be with us for very long. He seems aware, himself, that his time is short. He positively fled when I offered to crystal gaze for him --\"  \"Imagine that,\" said Professor McGonagall dryly.  I doubt,\" said Dumbledore, in a cheerful but slightly raised voice, which put an end to Professor McGonagall and Professor Trelawney's conversation, \"that Professor Lupin is in any immediate danger. Severus, you've made the potion for him again?\"  \"Yes, Headmaster,\" said Snape. \"W -- what?\" said Harry, scrambling to his feet. \"Why?\"  \"It will need to be checked for jinxes,\" said Professor McGonagall. \"Of course, I'm no expert, but I daresay Madam Hooch and Professor Flitwick will strip it down --\"  \"Strip it down?\" repeated Ron, as though Professor McGonagall was mad.  \"It shouldn't take more than a few weeks,\" said Professor McGonagall. \"You will have it back if we are sure it is jinx-free.\"  \"There's nothing wrong with it!\" said Harry, his voice shaking slightly. \"Honestly, Professor --\"  \"You can't know that, Potter,\" said Professor McGonagall, quite kindly, \"not until you've flown it, at any rate, and I'm afraid that is out of the question until we are certain that it has not been tampered with. I shall keep you informed.\"  Professor McGonagall turned on her heel and carried the Firebolt out of the portrait hole, which closed behind her. Harry stood staring after her, the tin of High-Finish Polish still clutched in his hands. Ron, however, rounded on Hermione.  \"What did you go running to McGonagall for?  Hermione threw her book aside. She was still pink in the face, but stood up and faced Ron defiantly.  \"Because I thought -- and Professor McGonagall agrees with me -- that that broom was probably sent to Harry by Sirius Black!\"  CHAPTER TWELVE  THE PATRONUS  Harry knew that Hermione had meant well, but that didn't stop him from being angry with her. He had been the owner of the best broom in the world for a few short hours, and now, because of her interference, he didn't know whether he would ever see it again. He was positive that there was nothing wrong with the Firebolt now, but what sort of state would it be in once it had been subjected to all sorts of anti-jinx tests?  Ron was furious with Hermione too. As far as he was concerned, the stripping-down of a brand- new Firebolt was nothing less than criminal damage. Hermione, who remained convinced that she had acted for the best, started avoiding the common room. Harry and Ron supposed she had taken refuge in the library and didn't try to persuade her to come back. All in all, they were glad when the rest of the school returned shortly after New Year, and Gryffindor Tower became crowded and noisy again. Wood sought Harry out on the night before term started.  \"Had a good Christmas?\" he said, and then, without waiting for an answer, he sat down, lowered his voice, and said, \"I've been, doing some thinking over Christmas, Harry. After last match, you know. If the dementors come to the next one... I mean... we can't afford you to -- well --\"  Wood broke off, looking awkward.  \"I'm working on it,\" said Harry quickly. \"Professor Lupin said he'd train me to ward off the dementors."
}