{
  "id": "2438262ef11dc4bdd5af40a59f15f060089a98db",
  "text": " Ser Melwyn Sarsfield,  —SER FORLEY PRESTER,  —SER GARTH GREENFIELD, a captive at Raventree Hall,  —SER LYMOND VIKARY, a captive at Wayfarer’s Rest,  —LORD SELMOND STACKSPEAR, —his son, SER STEFFON STACKSPEAR,  —his younger son, SER ALYN STACKSPEAR,  —TERRENCE KENNING, Lord of Kayce, —SER KENNOS OF KAYCE, a knight in his service,  —SER GREGOR CLEGANE, the Mountain That Rides, —POLLIVER, CHISWYCK, RAFF THE SWEETLING, DUNSEN, and THE TICKLER, soldiers in his service,  —{SER AMORY LORCH}, fed to a bear by Vargo Hoat after the fall of Harrenhal.      HOUSE MARTELL   Dorne was the last of the Seven Kingdoms to swear fealty to the Iron Throne. Blood, custom, and history all set the Dornishmen apart from the other kingdoms. At the outbreak of the War of the Five Kings, Dorne took no part. With the betrothal of Myrcella Baratheon to Prince Trystane, Sunspear declared its support for King Joffrey and called its banners. The Martell banner is a red sun pierced by a golden spear. Their words are Unbowed, Unbent, Unbroken.      DORAN NYMEROS MARTELL, Lord of Sunspear, Prince of Dorne, —his wife, MELLARIO, of the Free City of Norvos,  —their children: —PRINCESS ARIANNE, their eldest daughter, heir to Sunspear,  —PRINCE QUENTYN, their elder son,  —PRINCE TRYSTANE, their younger son, betrothed to Myrcella Baratheon,  —his siblings: —his sister, {PRINCESS ELIA}, wife of Prince Rhaegar Targaryen, slain during the Sack of King’s Landing,  —their children: —{PRINCESS RHAENYS}, a young girl, slain during the Sack of King’s Landing,  —{PRINCE AEGON}, a babe, slain during the Sack of King’s Landing,  —his brother, PRINCE OBERYN, called THE RED VIPER, —Prince Oberyn’s paramour, ELLARIA SAND,  —Prince Oberyn’s bastard daughters, OBARA, NYMERIA,TYENE, SARELLA, ELIA, OBELLA, DOREA, LOREZA, called THE SAND SNAKES,  —Prince Oberyn’s companions: —HARMEN ULLER, Lord of Hellholt, —Harmen’s brother, SER ULVVYCK ULLER,  —SER RYON ALLYRION, —Ser Ryon’s natural son, SER DAEMON SAND, the Bastard of Godsgrace,  —DAGOS MANWOODY, Lord of Kingsgrave, —Dagos’s sons, MORS and DICKON,  —Dagos’s brother, SER MYLES MANWOODY,  —SER ARRON QORGYLE,  —SER DEZIEL DALT, the Knight of Lemonwood,  —MYRIA JORDAYNE, heir to the Tor,  —LARRA BLACKMONT, Lady of Blackmont, —her daughter, JYNESSA BLACKMONT,  —her son, PERROS BLACKMONT, a squire,      —his household: —AREO HOTAH, a Norvoshi sellsword, captain of guards,  —MAESTER CALEOTTE, counselor, healer, and tutor,  his lords bannermen: —HARMEN ULLER, Lord of Hellholt,  —EDRIC DAYNE, Lord of Starfall,  —DELONNE ALLYRION, Lady of Godsgrace,  —DAGOS MANWOODY, Lord of Kingsgrave,  —LARRA BLACKMONT, Lady of Blackmont,  —TREMOND GARGALEN, Lord of Salt Shore,  —ANDERS YRONWOOD, Lord of Yronwood,  —NYMELLA TOLAND.      HOUSE TULLY   Lord Edmyn Tully of Riverrun was one of the first of the river lords to swear fealty to Aegon the Conqueror. The victorious Aegon rewarded him by raising House Tully to dominion over all the lands of the Trident. The Tully sigil is a leaping trout, silver, on a field of rippling blue and red. The Tully words are Family, Duty, Honor.      HOSTER TULLY, Lord of Riverrun, —his wife, (LADY MINISA, of House Whent), died in childbed,  —their children: —CATELYN, widow of Lord Eddard Stark of Winterfell, —her eldest son, ROBB STARK, Lord of Winterfell, King in the North, and King of the Trident,  —her daughter, SANSA STARK, a maid of twelve, captive at King’s Landing,  —her daughter, ARYA STARK, ten, missing for a year,  —her son, BRANDON STARK, eight, believed dead,  —her son, RICKON STARK, four, believed dead,  —LYSA, widow of Lord Jon Arryn of the Eyrie, —her son, ROBERT, Lord of the Eyrie and Defender of the Vale, a sickly boy of seven years,  —SER EDMURE, his only son, heir to Riverrun, —Ser Edmure’s friends and companions: —SER MARQ PIPER, heir to Pinkmaiden,  —LORD LYMOND GOODBROOK,  —SER RONALD VANCE, called THE BAD, and his brothers, SER HUGO, SER ELLERY, and KIRTH,  —PATREK MALLISTER, LUCAS BLACKWOOD, SER PERWYN FREY, TRISTAN RYGER,  —SER ROBERT PAEGE,      —his brother, SER BRYNDEN, called The Blackfish,  —his household: —MAESTER VYMAN, counselor, healer, and tutor,  —SER DESMOND GRELL, master-at-arms,  —SER ROBIN RYGER, captain of the guard, —LONG LEW, ELWOOD, DELP, guardsmen,  —UTHERYDES WAYN, steward of Riverrun,  —RYMUND THE RHYMER, a singer,  —his lords bannermen: —JONOS BRACKEN, Lord of the Stone Hedge,  —JASON MALLISTER, Lord of Seagard,  —WALDER FREY, Lord of the Crossing,  —CLEMENT PIPER, Lord of Pinkmaiden. Castle,  —KARYL VANCE, Lord of Wayfarer’s Rest,  —NORBERT VANCE, Lord of Atranta,  —THEOMAR SMALLWOOD, Lord of Acorn Hall, —his wife, LADY RAVELLA, of House Swann,  —their daughter, CARELLEN,  —WILLIAM MOOTON, Lord of Maidenpool,  —SHELLA WHENT, dispossessed Lady of Harrenhal,  —SER HALMON PAEGE.  —TYTOS BLACKWOOD, Lord of Raventree      HOUSE TYRELL   The Tyrells rose to power as stewards to the Kings of the Reach, whose domain included the fertile plains of the southwest from the Dornish marches and Blackwater Rush to the shores of the Sunset Sea."
}