{
  "id": "244c8c50e3a2100250a376fb05b35872f87e2e6a",
  "text": " Arya was given a whole leg, since it was her rabbit. She shared it with Gendry. The rest of them each got a spoonful, even the three in manacles. Jaqen H’ghar thanked her politely for the treat, and Biter licked the grease off his dirty fingers with a blissful look, but Rorge, the noseless one, only laughed and said,  There’s a hunter now. Lumpyface Lumpyhead Rabbitkiller.   Outside a holdfast called Briarwhite, some fieldhands surrounded them in a cornfield, demanding coin for the ears they’d taken. Yoren eyed their scythes and tossed them a few coppers.  Time was, a man in black was feasted from Dorne to Winterfell, and even high lords called it an honor to shelter him under their roofs,  he said bitterly.  Now cravens like you want hard coin for a bite of wormy apple.  He spat.   It’s sweetcorn, better’n a stinking old black bird like you deserves,  one of them answered roughly.  You get out of our field now, and take these sneaks and stabbers with you, or we’ll stake you up in the corn to scare the other crows away.   They roasted the sweetcorn in the husk that night, turning the ears with long forked sticks, and ate it hot right off the cob. Arya thought it tasted wonderful, but Yoren was too angry to eat. A cloud seemed to hang over him, ragged and black as his cloak. He paced about the camp restlessly, muttering to himself.  The next day Koss came racing back to warn Yoren of a camp ahead.  Twenty or thirty men, in mail and halfhelms,  he said.  Some of them are cut up bad, and one’s dying, from the sound of him. With all the noise he was making, I got right up close. They got spears and shields, but only one horse, and that’s lame. I think they been there awhile, from the stink of the place.    See a banner?    Spotted treecat, yellow and black, on a mud-brown field.   Yoren folded a sourleaf into his mouth and chewed.  Can’t say,  he admitted.  Might be one side, might be t’other. If they’re hurt that bad, likely they’d take our mounts no matter who they are. Might be they’d take more than that. I believe we’ll go wide around them.  It took them miles out of their way, and cost them two days at the least, but the old man said it was cheap at the price.  You’ll have time enough on the Wall. The rest o’ your lives, most like. Seems to me there’s no rush to get there.    Arya saw men guarding the fields more and more when they turned north again. Often they stood silently beside the road, giving a cold eye to anyone who passed. Elsewhere they patrolled on horses, riding their fence lines with axes strapped to their saddles. At one place, she spotted a man perched up in a dead tree, with a bow in his hand and a quiver hanging from the branch beside him. The moment he spied them, he notched an arrow to his bowstring, and never looked away until the last wagon was out of sight. All the while, Yoren cursed.  Him in his tree, let’s see how well he likes it up there when the Others come to take him. He’ll scream for the Watch then, that he will.   A day later Dobber spied a red glow against the evening sky.  Either this road went and turned again, or that sun’s setting in the north.   Yoren climbed a rise to get a better look.  Fire,  he announced. He licked a thumb and held it up.  Wind should blow it away from us. Still bears watching.   And watch it they did. As the world darkened, the fire seemed to grow brighter and brighter, until it looked as though the whole north was ablaze. From time to time, they could even smell the smoke, though the wind held steady and the flames never got any closer. By dawn the fire had burned itself out, but none of them slept very well that night.  It was midday when they arrived at the place where the village had been. The fields were a charred desolation for miles around, the houses blackened shells. The carcasses of burnt and butchered animals dotted the ground, under living blankets of carrion crows that rose, cawing furiously, when disturbed. Smoke still drifted from inside the holdfast. Its timber palisade looked strong from afar, but had not proved strong enough.  Riding out in front of the wagons on her horse, Arya saw burnt bodies impaled on sharpened stakes atop the walls, their hands drawn up tight in front of their faces as if to fight off the flames that had consumed them. Yoren called a halt when they were still some distance off, and told Arya and the other boys to guard the wagons while he and Murch and Cutjack went in on foot. A flock of ravens rose from inside the walls when they climbed through the broken gate, and the caged ravens in their wagons called out to them with quorks and raucous shrieks.   Should we go in after them?  Arya asked Gendry after Yoren and the others had been gone a long time.   Yoren said wait.  Gendry’s voice sounded hollow. When Arya turned to look, she saw that he was wearing his helm, all shiny steel and great curving horns.  When they finally returned, Yoren had a little girl in his arms, and Murch and Cutjack were carrying a woman in a sling made of an old torn quilt."
}