{
  "id": "24a464dc728f8b859552fe0acc60db00fa2adf9a",
  "text": " They’d found her wandering riderless through a field the morning after the slaughter. She was a good enough horse, but Arya could not love a coward. Stranger would have fought. Still, she tended the mare as best she knew. It was better than riding double with the Hound. And Craven might have been a coward, but she was young and strong as well. Arya thought that she might be able to outrun Stranger, if it came to it.  The Hound no longer watched her as closely as he had. Sometimes he did not seem to care whether she stayed or went, and he no longer bound her up in a cloak at night. One night I’ll kill him in his sleep, she told herself, but she never did. One day I’ll ride away on Craven, and he won’t be able to catch me, she thought, but she never did that either. Where would she go? Winterfell was gone. Her grandfather’s brother was at Riverrun, but he didn’t know her, no more than she knew him. Maybe Lady Smallwood would take her in at Acorn Hall, but maybe she wouldn’t. Besides, Arya wasn’t even sure she could find Acorn Hall again. Sometimes she thought she might go back to Sharna’s inn, if the floods hadn’t washed it away. She could stay with Hot Pie, or maybe Lord Beric would find her there. Anguy would teach her to use a bow, and she could ride with Gendry and be an outlaw, like Wenda the White Fawn in the songs.  But that was just stupid, like something Sansa might dream. Hot Pie and Gendry had left her just as soon as they could, and Lord Beric and the outlaws only wanted to ransom her, just like the Hound. None of them wanted her around. They were never my pack, not even Hot Pie and Gendry. I was stupid to think so, just a stupid little girl, and no wolf at all.  So she stayed with the Hound. They rode every day, never sleeping twice in the same place, avoiding towns and villages and castles as best they could. Once she asked Sandor Clegane where they were going.  Away,  he said.  That’s all you need to know. You’re not worth spit to me now, and I don’t want to hear your whining. I should have let you run into that bloody castle.    You should have,  she agreed, thinking of her mother.   You’d be dead if I had. You ought to thank me. You ought to sing me a pretty little song, the way your sister did.    Did you hit her with an axe too?    I hit you with the flat of the axe, you stupid little bitch. If I’d hit you with the blade there’d still be chunks of your head floating down the Green Fork. Now shut your bloody mouth. If I had any sense I’d give you to the silent sisters. They cut the tongues out of girls who talk too much.   That wasn’t fair of him to say. Aside from that one time, Arya hardly talked at all. Whole days passed when neither of them said anything. She was too empty to talk, and the Hound was too angry. She could feel the fury in him; she could see it on his face, the way his mouth would tighten and twist, the looks he gave her. Whenever he took his axe to chop some wood for a fire, he would slide into a cold rage, hacking savagely at the tree or the deadfall or the broken limb, until they had twenty times as much kindling and firewood as they’d needed. Sometimes he would be so sore and tired afterward that he would lie down and go right to sleep without even lighting a fire. Arya hated it when that happened, and hated him too. Those were the nights when she stared the longest at the axe. It looks awfully heavy, but I bet I could swing it. She wouldn’t hit him with the flat, either.  Sometimes in their wanderings they glimpsed other people; farmers in their fields, swineherds with their pigs, a milkmaid leading a cow, a squire carrying a message down a rutted road. She never wanted to speak to them either. It was as if they lived in some distant land and spoke a queer alien tongue; they had nothing to do with her, or her with them.  Besides, it wasn’t safe to be seen. From time to time columns of horsemen passed down the winding farm roads, the twin towers of Frey flying before them.  Hunting for stray northmen,  the Hound said when they had passed.  Any time you hear hooves, get your head down fast, it’s not like to be a friend.   One day, in an earthen hollow made by the roots of a fallen oak, they came face to face with another survivor of the Twins. The badge on his breast showed a pink maiden dancing in a swirl of silk, and he told them he was Ser Marq Piper’s man; a bowman, though he’d lost his bow. His left shoulder was all twisted and swollen where it met his arm; a blow from a mace, he said, it had broken his shoulder and smashed his chainmail deep into his flesh.  A northman, it was,  he wept.  His badge was a bloody man, and he saw mine and made a jape, red man and pink maiden, maybe they should get together. I drank to his Lord Bolton, he drank to Ser Marq, and we drank together to Lord Edmure and Lady Roslin and the King in the North. And then he killed me.  His eyes were fever bright when he said that, and Arya could tell that it was true. His shoulder was swollen grotesquely, and pus and blood had stained his whole left side."
}