{
  "id": "259825288496417d399e9683f0f85aae42c15dc1",
  "text": " He could still hear wings, though the eagle was not in sight. Half his world was black.  My eye,  he said in sudden panic, raising a hand to his face.   It’s only blood, Jon Snow. He missed the eye, just ripped your skin up some.   His face was throbbing. Tormund stood over them bellowing, he saw from his right eye as he rubbed blood from his left. Then there were hoofbeats, shouts, and the clacking of old dry bones.   Bag o’ Bones,  roared Tormund,  call off your hellcrow!    There’s your hellcrow!  Rattleshirt pointed at Jon.  Bleeding in the mud like a faithless dog!  The eagle came flapping down to land atop the broken giant’s skull that served him for his helm.  I’m here for him.    Come take him then,  said Tormund,  but best come with sword in hand, for that’s where you’ll find mine. Might be I’ll boil your bones, and use your skull to piss in. Har!    Once I prick you and let the air out, you’ll shrink down smaller’n that girl. Stand aside, or Mance will hear o’ this.   Ygritte stood.  What, is it Mance who wants him?    I said so, didn’t I? Get him up on those black feet.   Tormund frowned down at Jon.  Best go, if it’s the Mance who’s wanting you.   Ygritte helped pull him up.  He’s bleeding like a butchered boar. Look what Orell did t’ his sweet face.   Can a bird hate? Jon had slain the wildling Orell, but some part of the man remained within the eagle. The golden eyes looked out on him with cold malevolence.  I’ll come,  he said. The blood kept running down into his right eye, and his cheek was a blaze of pain. When he touched it his black gloves came away stained with red.  Let me catch my garron.  It was not the horse he wanted so much as Ghost, but the direwolf was nowhere to be seen. He could be leagues away by now, ripping out the throat of some elk. Perhaps that was just as well.  The garron shied away from him when he approached, no doubt frightened by the blood on his face, but Jon calmed him with a few quiet words and finally got close enough to take the reins. As he swung back into the saddle his head whirled. I will need to get this tended, he thought, but not just now. Let the King-beyond-the-Wall see what his eagle did to me. His right hand opened and closed, and he reached down for Longclaw and slung the bastard sword over a shoulder before he wheeled to trot back to where the Lord of Bones and his band were waiting,  Ygritte was waiting too, sitting on her horse with a fierce look on her face.  I am coming too.    Be gone.  The bones of Rattleshirt’s breastplate clattered together.  I was sent for the crow-come-down, none other.    A free woman rides where she will,  Ygritte said.  The wind was blowing snow into Jon’s eyes. He could feel the blood freezing on his face.  Are we talking or riding?    Riding,  said the Lord of Bones.  It was a grim gallop. They rode two miles down the column through swirling snows, then cut through a tangle of baggage wayns to splash across the Milkwater where it took a great loop toward the east. A crust of thin ice covered the river shallows; with every step their horses’ hooves crashed through, until they reached the deeper water ten yards out. The snow seemed be falling even faster on the eastern bank, and the drifts were deeper too. Even the wind is colder. And night was falling too.  But even through the blowing snow, the shape of the great white hill that loomed above the trees was unmistakable. The Fist of the First Men. Jon heard the scream of the eagle overhead. A raven looked down from a soldier pine and quorked as he went past. Had the Old Bear made his attack? Instead of the clash of steel and the thrum of arrows taking flight, Jon heard only the soft crunch of frozen crust beneath his garron’s hooves.  In silence they circled round to the south slope, where the approach was easiest. It was there at the bottom that Jon saw the dead horse, sprawled at the base of the hill, half buried in the snow. Entrails spilled from the belly of the animal like frozen snakes, and one of its legs was gone. Wolves, was Jon’s first thought, but that was wrong. Wolves eat their kill.  More garrons were strewn across the slope, legs twisted grotesquely, blind eyes staring in death. The wildlings crawled over them like flies, stripping them of saddles, bridles, packs, and armor, and hacking them apart with stone axes.   Up,  Rattleshirt told Jon.  Mance is up top.   Outside the ringwall they dismounted to squeeze through a crooked gap in the stones. The carcass of a shaggy brown garron was impaled upon the sharpened stakes the Old Bear had placed inside every entrance. He was trying to get out, not in. There was no sign of a rider.  Inside was more, and worse. Jon had never seen pink snow before. The wind gusted around him, pulling at his heavy sheepskin cloak. Ravens flapped from one dead horse to the next. Are those wild ravens, or our own? Jon could not tell. He wondered where poor Sam was now. And what he was.  A crust of frozen blood crunched beneath the heel of his boot."
}