{
  "id": "25e4149301f22d7bc6a08b10b136cf7cb5fe618d",
  "text": "'       `AII  right! But if I  were you, I'd catch the  big one  that's  loose,  before you send in any report to Lugb®rz. It  won't sound too pretty  to say  you've caught the kitten and let the cat escape.'       The voices began to move away. Sam heard the sound of feet receding. He  was recovering from his shock, and now a wild fury was on him. `I got it all   wrong!  ' he cried. `I knew I  would. Now they've  got him, the  devils! the  filth! Never leave your master, never,  never: that was my right rule. And I  knew  it in my heart. May  I be forgiven!  Now I've got to get  back to him.  Somehow, somehow!  '       He  drew his sword again and  beat on the stone with the  hilt, but  it  only gave out a dull sound. The sword, however, bla zed so brightly now  that  he could see dimly  in its light. To his surprise he noticed  that the great  block was shaped like a heavy door, and  was less than twice his own height.  Above it was a  dark blank  space between the top and the  low  arch of  the  opening.  It was probably only meant to be a stop against the  intrusion  of  Shelob, fastened on the inside with some latch or bolt  beyond the reach  of  her cunning. With  his  remaining  strength  Sam leaped and caught the  top,   scrambled up, and dropped;  and  then he ran  madly, sword blazing in  hand,  round a bend and up a winding tunnel.       The news  that his master was still alive roused him  to a  last effort  beyond thought  of weariness. He could not see anything  ahead. for this new  passage twisted and turned constantly; but  he thought  he was  catching the    ####-two Orcs up: their  voices were growing  nearer again. Now they seemed quite  close.       `That's what I'm going  to do,'  said Shagrat in angry tones.  'Put him  right up in the top chamber.'       `What for? ' growled Gorbag. `Haven't you any lock -ups down below? '       `He's  going out of harm's way,  I  tell  you,' answered Shagrat. 'See?   He's  precious.  I  don't trust  all  my lads,  and  none of yours;  nor you   neither, when you're mad for fun. He's going where I want him, and where you   won't come,  if you  don't keep civil. Up to the top,  I  say. He'll be safe  there.'       `Will  he?'  said Sam. 'You're  forgetting the great big elvish warrior   that's loose!' And with that he raced  round   the last corner, only to  find  that by some trick of the tunnel, or of the hearing which the Ring gave him,  he had misjudged the distance.       The two orc-figures were still some way ahead. He could  see  them now,   black and squat against a red glare. The passage ran straight at last, up an  incline;  and  at  the  end, wide open,  were  great  double doors,  leading  probably to deep  chambers far below the high horn of the tower. Already the  Orcs  with their burden  had  passed inside. Gorbag and Shagrat were drawing  near the gate.       Sam  heard a burst  of hoarse singing, blaring of horns  and banging of  gongs, a hideous clamour. Gorbag and Shagrat were already on the threshold.       Sam yelled  and brandished Sting, but his little  voice was  drowned in  the tumult. No one heeded him.       The  great  doors slammed to. Boom.  The bars  of iron fell  into place  inside. Clang.  The gate was  shut.  Sam  hurled  himself against the bolted  brazen plates and fell senseless to the ground. He  was out in the darkness.  Frodo was alive but taken by the Enemy.      ####-      Here ends the second part of the history of the War of the Ring.         The third  part tells of  the  last defence against the Shadow, and the  end of the mission of the Ring-bearer in  THE RETURN OF THE KING .           ####-####-         * BOOK V *    Chapter 1. Minas Tirith            Pippin  looked out from  the shelter of Gandalf's cloak. He wondered if  he was awake or still sleeping, still in the  swift-moving dream in which he  had  been  wrapped so long since the  great  ride  began. The dark world was  rushing by and  the wind sang loudly in his ears. He could  see nothing  but  the wheeling stars, and away to his right vast shadows against the sky where  the mountains of the  South  marched past.  Sleepily he tried  to reckon the  times and stages of their journey, but his memory was drowsy and uncertain.       There  had been the first  ride at terrible speed without  a  halt, and  then in the dawn he had  seen a pale gleam of gold, and they had come to the  silent  town  and the great empty house on  the  hill.  And  hardly had they  reached its shelter when the winged shadow  had passed  over once again, and  men wilted with fear. But Gandalf had spoken  soft words to him,  and he had  slept in a corner, tired but uneasy, dimly aware of  comings  and goings and   of men talking and Gandalf giving orders. And then  again riding, riding  in  the  night. This was the second, no, the third night since  he had looked in  the Stone. And with that hideous memory he woke fully, and shivered, and the  noise of the wind became filled with menacing voices."
}