{
  "id": "261b01ee76a3fabc8b9084c7ca0c7dbce520f388",
  "text": " A man like Petyr Baelish, who had a gift for rubbing two golden dragons together to breed a third, was invaluable to his Hand. Littlefinger’s rise had been arrow-swift. Within three years of his coming to court, he was master of coin and a member of the small council, and today the crown’s revenues were ten times what they had been under his beleaguered predecessor… though the crown’s debts had grown vast as well. A master juggler was Petyr Baelish.  Oh, he was clever. He did not simply collect the gold and lock it in a treasure vault, no. He paid the king’s debts in promises, and put the king’s gold to work. He bought wagons, shops, ships, houses. He bought grain when it was plentiful and sold bread when it was scarce. He bought wool from the north and linen from the south and lace from Lys, stored it, moved it, dyed it, sold it. The golden dragons bred and multiplied, and Littlefinger lent them out and brought them home with hatchlings.  And in the process, he moved his own men into place. The Keepers of the Keys were his, all four. The King’s Counter and the King’s Scales were men he’d named. The officers in charge of all three mints. Harbormasters, tax farmers, customs sergeants, wool factors, toll collectors, pursers, wine factors; nine of every ten belonged to Littlefinger. They were men of middling birth, by and large; merchants’ sons, lesser lordlings, sometimes even foreigners, but judging from their results, far more able than their highborn predecessors.  No one had ever thought to question the appointments, and why should they? Littlefinger was no threat to anyone. A clever, smiling, genial man, everyone’s friend, always able to find whatever gold the king or his Hand required, and yet of such undistinguished birth, one step up from a hedge knight, he was not a man to fear. He had no banners to call, no army of retainers, no great stronghold, no holdings to speak of, no prospects of a great marriage.  But do I dare touch him? Tyrion wondered. Even if he is a traitor? He was not at all certain he could, least of all now, while the war raged. Given time, he could replace Littlefinger’s men with his own in key positions, but…  A shout rang up from the yard.  Ah, His Grace has killed a hare,  Lord Baelish observed.   No doubt a slow one,  Tyrion said.  My lord, you were fostered at Riverrun. I’ve heard it said that you grew close to the Tullys.    You might say so. The girls especially.    How close?    I had their maidenhoods. Is that close enough?   The lie—Tyrion was fairly certain it was a lie—was delivered with such an air of nonchalance that one could almost believe it. Could it have been Catelyn Stark who lied? About her defloration, and the dagger as well? The longer he lived, the more Tyrion realized that nothing was simple and little was true.  Lord Hoster’s daughters do not love me,  he confessed.  I doubt they would listen to any proposal I might make. Yet coming from you, the same words might fall more sweetly on their ears.     That would depend on the words. If you mean to offer Sansa in return for your brother, waste someone else’s time. Joffrey will never surrender his plaything, and Lady Catelyn is not so great a fool as to barter the Kingslayer for a slip of a girl.    I mean to have Arya as well. I have men searching.    Searching is not finding.    I’ll keep that in mind, my lord. In any case, it was Lady Lysa I hoped you might sway. For her, I have a sweeter offer.    Lysa is more tractable than Catelyn, true… but also more fearful, and I understand she hates you.    She believes she has good reason. When I was her guest in the Eyrie, she insisted that Id murdered her husband and was not inclined to listen to denials.  He leaned forward.  If I gave her Jon Arryn’s true killer, she might think more kindly of me.   That made Littlefinger sit up.  True killer? I confess, you make me curious. Who do you propose?   It was Tyrion’s turn to smile.  Gifts I give my friends, freely. Lysa Arryn would need to understand that.    Is it her friendship you require, or her swords?    Both.   Littlefinger stroked the neat spike of his beard.  Lysa has woes of her own. Clansmen raiding out of the Mountains of the Moon, in greater numbers than ever before… and better armed.    Distressing,  said Tyrion Lannister, who had armed them.  I could help her with that. A word from me…    And what would this word cost her?    I want Lady Lysa and her son to acclaim Joffrey as king, to swear fealty, and to—    —make war on the Starks and Tullys?  Littlefinger shook his head.  There’s the roach in your pudding, Lannister. Lysa will never send her knights against Riverrun.    Nor would I ask it. We have no lack of enemies. I’ll use her power to oppose Lord Renly, or Lord Stannis, should he stir from Dragonstone. In return, I will give her justice for Jon Arryn and peace in the Vale. I will even name that appalling child of hers Warden of the East, as his father was before him.  I want to see him fly, a boy’s voice whispered faintly in memory."
}