{
  "id": "262c2e9bfa890390f65d3cd06ce8e4f34f8e506b",
  "text": "'       Slowly his hand went to his bosom, and slowly he held  aloft the  Phial  of Galadriel. For a moment it glimmered, faint as  a rising star  struggling  in heavy earthward  mists,  and then as its power waxed,  and hope  grew  in  Frodo's  mind, it  began to  burn, and kindled to a  silver flame, a  minute  heart of dazzling light, as though Edrendil  had himself come down  from the  high sunset paths with the last Silmaril upon his brow. The darkness receded  from it until it seemed to shine in the  centre of a globe of  airy crystal,  and the hand that held it sparkled with white fire.       Frodo gazed  in   wonder at this marvellous  gift  that  he  had so long  carried, not guessing its full  worth and potency. Seldom had  he remembered  it on the road, until they came to Morgul Vale, and never had he used it for   fear of its revealing  light.  Aiya Edrendil Elenion Ancalima! he cried, and   ####-knew  not what he had spoken; for it seemed that another voice spoke through  his, clear, untroubled by the foul air of the pit.       But other  potencies  there are in  Middle-earth, powers of night,  and  they are  old and strong. And She that  walked in the darkness had heard the  Elves cry that cry far back in the deeps of time, and she had not heeded it,  and it did  not daunt her now. Even as Frodo spoke he  felt  a great  malice  bent upon him, and a deadly regard considering him. Not far down the tunnel,  between them  and the  opening where  they  had reeled and stumbled, he  was  aware of eyes  growing visible, two great clusters  of many-windowed eyes  --  the  coming menace was unmasked at last.  The radiance of the star -gla ss was  broken and thrown back from their thousand  facets, but behind the glitter a   pale deadly fire began steadily to glow within, a flame kindled in some deep  pit of  evil thought. Monstrous and  abominable eyes they were, bestial  and   yet filled with purpose  and with  hideous delight, gloating over their prey  trapped beyond all hope of escape.       Frodo  and  Sam, horror -stricken, began slowly to back away,  their own  gaze held by the dreadful stare of those baleful eyes; but as they backed so   the eyes  advanced. Frodo's hand wavered, and slowly the Phial drooped. Then  suddenly,  released from  the  holding spell to run  a little while  in vain  panic for the amusement of the eyes, they both turned and fled together; but  even as they ran Frodo looked back and saw with terror that at once the eyes  came leaping up behind. The stench of death was like a cloud about him.       'Stand! stand! ' he cried desperately. `Running is no use.'       Slowly the eyes crept nearer.       `Galadriel! ' he called, and  gathering his  courage  he  lifted up the  Phial once more. The eyes  halted. For a moment  their regard relaxed, as if  some hint of doubt troubled them. Then Frodo's heart flamed  within him, and  without thinking what he did, whether it was folly or despair or  courage, he  took the Phial in  his left  hand,  and  with his right hand drew his sword.  Sting flashed out, and the sharp elven-blade  sparkled in the silver  light,  but at  its edges a  blue fire  flicked. Then holding the star aloft and the  bright sword advanced,  Frodo,  hobbit of the Shire, walked steadily down to  meet the eyes.       They wavered. Doubt  came into them as the light approached. One by one  they dimmed,  and  slowly they drew back. No brightness so  deadly  had ever   afflicted  them  before. From sun  and  moon and star  they  had  been  safe  underground,  but now a star  had descended  into  the  very earth. Still it   ####-approached, and the eyes began to quail. One by one they all went dark; they  turned  away, and a great bulk,  beyond  the light's reach,  heaved its huge  shadow in between. They were gone.       'Master, master!' cried Sam. He was close behind,  his own  sword drawn  and ready. 'Stars  and glory!  But the Elves would make a song  of  that, if  ever they heard of it! And may I live   to tell them and hear them sing.  But  don't go  on, master. Don't go down to that den! Now's our only chance.  Now  let's get out of this foul hole!'       And  so back they turned once more, first walking and then running; for   as they  went the  floor  of   the tunnel rose steeply, and with every stride  they climbed higher  above  the stenches  of  the  unseen lair, and strength  returned  to  limb and  heart.  But still the hatred of  the  Watcher lurked  behind  them, blind for a while,  perhaps,  but undefeated,  still  bent  on  death. And  now there came  a  flow of air  to meet them, cold and thin. The  opening, the tunnel's end, at last it was before them. Panting, yearning for   a roofless place, they flung themselves forward, and  then in amazement they  staggered, tumbling back. The outlet was blocked  with some barrier, but not  of  stone: soft  and a  little  yielding  it  seemed,  and  yet  strong  and  impervious; air filtered through, hut not a  glimmer of any light."
}