{
  "id": "264d4e0a03869d149ca668a2c151fe12b88a56db",
  "text": "  The King-beyond-the-Wall was doing all he could, yet the wildlings remained hopelessly undisciplined, and that made them vulnerable. Here and there within the leagues-long snake that was their line of march were warriors as fierce as any in the Watch, but a good third of them were grouped at either end of the column, in Harma Dogshead’s van and the savage rearguard with its giants, aurochs, and fire flingers. Another third rode with Mance himself near the center, guarding the wayns and sledges and dog carts that held the great bulk of the host’s provisions and supplies, all that remained of the last summer harvest. The rest, divided into small bands under the likes of Rattleshirt, Jarl, Tormund Giantsbane, and the Weeper, served as outriders, foragers, and whips, galloping up and down the column endlessly to keep it moving in a more or less orderly fashion.  And even more telling, only one in a hundred wildlings was mounted. The Old Bear will go through them like an axe through porridge. And when that happened, Mance must give chase with his center, to try and blunt the threat. If he should fall in the fight that must follow, the Wall would be safe for another hundred years, Jon judged. And if not…  He flexed the burned fingers of his sword hand. Longclaw was slung to his saddle, the carved stone wolf’s-head pommel and soft leather grip of the great bastard sword within easy reach.  The snow was falling heavily by the time they caught Tormund’s band, several hours later. Ghost departed along the way, melting into the forest at the scent of prey. The direwolf would return when they made camp for the night, by dawn at the latest. However far he prowled, Ghost always came back… and so, it seemed, did Ygritte.   So,  the girl called when she saw him,  d’you believe us now, Jon Snow? Did you see the giants on their mammoths?    Har!  shouted Tormund, before Jon could reply.  The crow’s in love! He means to marry one!    A giantess?  Longspear Ryk laughed.   No, a mammoth!  Tormund bellowed.  Har!   Ygritte trotted beside Jon as he slowed his garron to a walk. She claimed to be three years older than him, though she stood half a foot shorter; however old she might be, the girl was a tough little thing. Stonesnake had called her a  spearwife  when they’d captured her in the Skirling Pass. She wasn’t wed and her weapon of choice was a short curved bow of horn and weirwood, but  spearwife  fit her all the same. She reminded him a little of his sister Arya, though Arya was younger and probably skinnier. It was hard to tell how plump or thin Ygritte might be, with all the furs and skins she wore.   Do you know ‘The Last of the Giants’?  Without waiting for an answer Ygritte said,  You need a deeper voice than mine to do it proper.  Then she sang,  Ooooooh, I am the last of the giants, my people are gone from the earth.   Tormund Giantsbane heard the words and grinned.  The last of the great mountain giants, who ruled all the world at my birth,  he bellowed back through the snow.  Longspear Ryk joined in, singing,  Oh, the smallfolk have stolen my forests, they’ve stolen my rivers and hills.    And they’ve built a great wall through my valleys, and fished all the fish from my rills,  Ygritte and Tormund sang back at him in turn, in suitably gigantic voices.  Tormund’s sons Toregg and Dormund added their deep voices as well, then his daughter Munda and all the rest. Others began to bang their spears on leathern shields to keep rough time, until the whole war band was singing as they rode.      In stone halls they burn their great fires,  in stone halls they forge their sharp spears.  Whilst I walk alone in the mountains,  with no true companion but tears.  They hunt me with dogs in the daylight,  they hunt me with torches by night.  For these men who are small can never stand tall,  whilst giants still walk in the light.  Oooooooh, I am the LAST of the giants,  so learn well the words of my song.  For when I am gone the singing will fade,  and the silence shall last long and long.      There were tears on Ygritte’s cheeks when the song ended.   Why are you weeping?  Jon asked.  It was only a song. There are hundreds of giants, I’ve just seen them.    Oh, hundreds,  she said furiously.  You know nothing, Jon Snow. You—JON!   Jon turned at the sudden sound of wings. Blue-grey feathers filled his eyes, as sharp talons buried themselves in his face. Red pain lanced through him sudden and fierce as pinions beat round his head. He saw the beak, but there was no time to get a hand up or reach for a weapon. Jon reeled backward, his foot lost the stirrup, his garron broke in panic, and then he was falling. And still the eagle clung to his face, its talons tearing at him as it flapped and shrieked and pecked. The world turned upside down in a chaos of feathers and horseflesh and blood, and then the ground came up to smash him.  The next he knew, he was on his face with the taste of mud and blood in his mouth and Ygritte kneeling over him protectively, a bone dagger in her hand."
}