{
  "id": "26577af5ce79ccc89e3b7f429ed14b6ca4d0608b",
  "text": " And while Harry was sure he had never heard the name T. M. Riddle before, it still seemed to mean something to him, almost as though  * 233 *  Riddle was a friend he'd had when he was very small, and had halfforgotten. But this was absurd. He'd never had friends before Hogwarts, Dudley had made sure of that.  Nevertheless, Harry was determined to find out more about Riddle, so next day at break, he headed for the trophy room to examine Riddle's special award, accompanied by an interested Hermione and a thoroughly unconvinced Ron, who told them he'd seen enough of the trophy room to last him a lifetime.  Riddle's burnished gold shield was tucked away in a corner cabinet. It didn't carry details of why it had been given to him (\"Good thing, too, or it'd be even bigger and Id still be polishing it,\" said Ron). However, they did find Riddle's name on an old Medal for Magical Merit, and on a list of old Head Boys.  \"He sounds like Percy,\" said Ron, wrinkling his nose in disgust. \"Prefect, Head Boy ... probably top of every class -\"  \"You say that like it's a bad thing,\" said Hermione in a slightly hurt voice.  The sun had now begun to shine weakly on Hogwarts again. Inside the castle, the mood had grown more hopeful. There had been no more attacks since those on Justin and Nearly Headless Nick, and Madam Pomfrey was pleased to report that the Mandrakes were becoming moody and secretive, meaning that they were fast leaving childhood.  \"The moment their acne clears up, they'll be ready for repotting again,\" Harry heard her telling Filch kindly one afternoon. \"And after that, it won't be long until we're cutting them up and stewing them. You'll have Mrs. Norris back in no time.\"  * 243 *  Perhaps the Heir of Slytherin had lost his or her nerve, thought Harry. It must be getting riskier and riskier to open the Chamber of Secrets, with the school so alert and suspicious. Perhaps the monster, whatever it was, was even now settling itself down to hibernate for another fifty years ....  Ernie Macmillan of Hufflepuff didn't take this cheerful view. He was still convinced that Harry was the guilty one, that he had \"given himself away\" at the Dueling Club. Peeves wasn't helping matters; he kept popping up in the crowded corridors singing \"Oh, Potter, you rotter . . .\" now with a dance routine to match.  Gilderoy Lockhart seemed to think he himself had made the attacks stop. Harry overheard him telling Professor McGonagall so while the Gryffindors were lining up for Transfiguration.  \"I don't think there'll be any more trouble, Minerva,\" he said, tapping his nose knowingly and winking. \"I think the Chamber has been locked for good this time. The culprit must have known it was only a matter of time before I caught him. Rather sensible to stop now, before I came down hard on him.  \"You know, what the school needs now is a morale-booster. Wash away the memories of last term! I won't say any more just now, but I think I know just the thing . . . .\"  He tapped his nose again and strode off.  Lockhart's idea of a morale-booster became clear at breakfast time on February fourteenth. Harry hadn't had much sleep because of a late- running Quidditch practice the night before, and he hurried down to the Great Hall, slightly late. He thought, for a moment, that he'd walked through the wrong doors.  The walls were all covered with large, lurid pink flowers. Worse  * 235*  still, heart-shaped confetti was falling from the pale blue ceiling. Harry went over to the Gryffindor table, where Ron was sitting looking sickened, and Hermione seemed to have been overcome with giggles.  \"What's going on?\" Harry asked them, sitting down and wiping confetti off his bacon.  Ron pointed to the teachers' table, apparently too disgusted to speak. Lockhart, wearing lurid pink robes to match the decorations, was waving for silence. The teachers on either side of him were looking stony-faced. From where he sat, Harry could see a muscle going in Professor McGonagall's cheek. Snape looked as though someone had just fed him a large beaker of Skele-Gro.  \"Happy Valentine's Day!\" Lockhart shouted. \"And may I thank the forty-six people who have so far sent me cards! Yes, I have taken the liberty of arranging this little surprise for you all - and it doesn't end here!\"  Lockhart clapped his hands and through the doors to the entrance hall marched a dozen surly-looking dwarfs. Not just any dwarfs, however. Lockhart had them all wearing golden wings and carrying harps.  \"My friendly, card-carrying cupids!\" beamed Lockhart. \"They will be roving around the school today delivering your valentines! And the fun doesn't stop here! I'm sure my colleagues will want to enter into the spirit of the occasion! Why not ask Professor Snape to show you how to whip up a Love Potion! And while you're at it, Professor Flitwick knows more about Entrancing Enchantments than any wizard I've ever met, the sly old dog!\"  Professor Flitwick buried his face in his hands. Snape was look  * 236  ing as though the first person to ask him for a Love Potion would be force-fed poison."
}