{
  "id": "26bc483042cb3acb0439df07fd11ff68a73b0cc0",
  "text": "  But they couldn't. Exams were nearly upon them, and instead of lazing around outside, the students were forced to remain inside the castle, trying to bully their brains into concentrating while enticing wafts of summer air drifted in through the windows. Even Fred and George Weasley had been spotted working; they were about to take their O.W.L.s (Ordinary Wizarding Levels). Percy was getting ready to take his N.E.W.T.s (Nastily Exhausting Wizarding Tests), the highest qualification Hogwarts offered. As Percy hoped to enter the Ministry of Magic, he needed top grades. He was becoming increasingly edgy, and gave very severe punishments to anybody who disturbed the quiet of the common room in the evenings. In fact, the only person who seemed more anxious than Percy was Hermione.  Harry and Ron had given up asking her how she was managing to attend several classes at once, but they couldn't restrain themselves when they saw the exam schedule she had drawn up for herself. The first column read:  Monday  9 o'clock, Arithmancy  9 o'clock, Transfiguration  Lunch  1 o'clock, Charms  1 o'clock, Ancient Runes  \"Hermione?\" Ron said cautiously, because she was liable to explode when interrupted these days. \"Er -- are you sure you've copied down these times right?\"  \"What?\" snapped Hermione, picking up the exam schedule and examining it. \"Yes, of course I have.\"  \"Is there any point asking how you're going to sit for two exams at once?\" said Harry.  \"No,\" said Hermione shortly. \"Have either of you seen my copy of Numerology and Gramatica?\"  \"Oh, yeah, I borrowed it for a bit of bedtime reading,\" said Ron, but very quietly. Hermione started shifting heaps of parchment Harry, Ron, and Hermione plenty of opportunity to speak to Hagrid.  \"Beaky's gettin' a bit depressed,\" Hagrid told them, bending low on the pretense of checking that Harry's flobberworm was still alive. \"Bin cooped up too long. But still... we'll know day after tomorrow -- one way or the other --\"  They had Potions that afternoon, which was an unqualified disaster. Try as Harry might, he couldn't get his Confusing Concoction to thicken, and Snape, standing watch with an air of vindictive pleasure, scribbled something that looked suspiciously like a zero onto his notes before moving away.  Then came Astronomy at midnight, up on the tallest tower; History of Magic on Wednesday morning, in which Harry scribbled everything Florean Fortescue had ever told him about medieval witch-hunts, while wishing he could have had one of Fortescue's choco-nut sundaes with him in the stifling classroom. Wednesday afternoon meant Herbology, in the greenhouses under a baking-hot sun; then back to the common room once more, with sunburnt necks, thinking longingly of this time next day, when it would all be over.  Their second to last exam, on Thursday morning, was Defense Against the Dark Arts. Professor Lupin had compiled the most unusual exam any of them had ever taken; a sort of obstacle course outside in the sun, where they had to wade across a deep paddling pool containing a grindylow, cross a series of potholes full of Red Caps, squish their way across a patch of marsh while ignoring misleading directions from a hinkypunk, then climb into an old trunk and battle with a new boggart.  \"Excellent, Harry,\" Lupin muttered as Harry climbed out of the trunk, grinning. \"Full marks.\"  Flushed with his success, Harry hung around to watch Ron and Hermione. Ron did very well until he reached the hinkypunk, which successfully confused him into sinking waist-high into the quagmire. Hermione did everything perfectly until she reached the trunk with the boggart in it. After about a minute inside it, she burst out again, screaming.  \"Hermione!\" said Lupin, startled. \"What's the matter?\"  \"P -- P -- Professor McGonagall!\" Hermione gasped, pointing into the trunk. \"Sh -- she said I'd failed everything!\"  It took a little while to calm Hermione down. When at last she had regained a grip on herself, she, Harry, and Ron went back to the castle. Ron was still slightly inclined to laugh at Hermione's boggart, but an argument was averted by the sight that met them on the top of the steps.  Cornelius Fudge, sweating slightly in his pinstriped cloak, was standing there staring out at the grounds. He started at the sight of Harry.  \"Hello there, Harry!\" he said. \"Just had an exam, I expect? Nearly finished?\"  \"Yes,\" said Harry. Hermione and Ron, not being on speaking terms with the Minister of Magic, hovered awkwardly in the background.  \"Lovely day,\" said Fudge, casting an eye over the lake.  \"Pity... pity...\"  He sighed deeply and looked down at Harry.  \"I'm here on an unpleasant mission, Harry. The Committee for the Disposal of Dangerous Creatures required a witness to the execution of a mad hippogriff. As I needed to visit Hogwarts to check on the Black situation, I was asked to step in.\"  \"Does that mean the appeal's already happened?\" Ron interrupted, stepping forward.  \"No, no, it's scheduled for this afternoon,\" said Fudge, looking curiously at Ron."
}