{
  "id": "26d258a44099c8d88d7743c058e0936e5d9746d1",
  "text": "  Lord Varys makes good use of him.    So the slaver has become a spy,  Ned said with distaste. He handed the letter back.  I would rather he become a corpse.    Varys tells me that spies are more useful than corpses,  Robert said.  Jorah aside, what do you make of his report?    Daenerys Targaryen has wed some Dothraki horselord. What of it? Shall we send her a wedding gift?   The king frowned.  A knife, perhaps. A good sharp one, and a bold man to wield it.   Ned did not feign surprise; Robert’s hatred of the Targaryens was a madness in him. He remembered the angry words they had exchanged when Tywin Lannister had presented Robert with the corpses of Rhaegar’s wife and children as a token of fealty. Ned had named that murder; Robert called it war. When he had protested that the young prince and princess were no more than babes, his new-made king had replied,  I see no babes. Only dragonspawn.  Not even Jon Arryn had been able to calm that storm. Eddard Stark had ridden out that very day in a cold rage, to fight the last battles of the war alone in the south. It had taken another death to reconcile them; Lyanna’s death, and the grief they had shared over her passing.  This time, Ned resolved to keep his temper.  Your Grace, the girl is scarcely more than a child. You are no Tywin Lannister, to slaughter innocents.  It was said that Rhaegar’s little girl had cried as they dragged her from beneath her bed to face the swords. The boy had been no more than a babe in arms, yet Lord Tywin’s soldiers had torn him from his mother’s breast and dashed his head against a wall.   And how long will this one remain an innocent?  Robert’s mouth grew hard.  This child will soon enough spread her legs and start breeding more dragonspawn to plague me.    Nonetheless,  Ned said,  the murder of children… it would be vile… unspeakable…    Unspeakable?  the king roared.  What Aerys did to your brother Brandon was unspeakable. The way your lord father died, that was unspeakable. And Rhaegar… how many times do you think he raped your sister? How many hundreds of times?  His voice had grown so loud that his horse whinnied nervously beneath him. The king jerked the reins hard, quieting the animal, and pointed an angry finger at Ned.  I will kill every Targaryen I can get my hands on, until they are as dead as their dragons, and then I will piss on their graves.   Ned knew better than to defy him when the wrath was on him. If the years had not quenched Robert’s thirst for revenge, no words of his would help.  You can’t get your hands on this one, can you?  he said quietly.  The king’s mouth twisted in a bitter grimace.  No, gods be cursed. Some pox-ridden Pentoshi cheesemonger had her brother and her walled up on his estate with pointy-hatted eunuchs all around them, and now he’s handed them over to the Dothraki. I should have had them both killed years ago, when it was easy to get at them, but Jon was as bad as you. More fool I, I listened to him.    Jon Arryn was a wise man and a good Hand.   Robert snorted. The anger was leaving him as suddenly as it had come.  This Khal Drogo is said to have a hundred thousand men in his horde. What would Jon say to that?    He would say that even a million Dothraki are no threat to the realm, so long as they remain on the other side of the narrow sea,  Ned replied calmly.  The barbarians have no ships. They hate and fear the open sea.   The king shifted uncomfortably in his saddle.  Perhaps. There are ships to be had in the Free Cities, though. I tell you, Ned, I do not like this marriage. There are still those in the Seven Kingdoms who call me Usurper. Do you forget how many houses fought for Targaryen in the war? They bide their time for now, but give them half a chance, they will murder me in my bed, and my sons with me. If the beggar king crosses with a Dothraki horde at his back, the traitors will join him.    He will not cross,  Ned promised.  And if by some mischance he does, we will throw him back into the sea. Once you choose a new Warden of the East—   The king groaned.  For the last time, I will not name the Arryn boy Warden. I know the boy is your nephew, but with Targaryens climbing in bed with Dothraki, I would be mad to rest one quarter of the realm on the shoulders of a sickly child.   Ned was ready for that.  Yet we still must have a Warden of the East. If Robert Arryn will not do, name one of your brothers. Stannis proved himself at the siege of Storm’s End, surely.   He let the name hang there for a moment. The king frowned and said nothing. He looked uncomfortable.   That is,  Ned finished quietly, watching,  unless you have already promised the honor to another.   For a moment Robert had the grace to look startled. Just as quickly, the look became annoyance.  What if I have?    It’s Jaime Lannister, is it not?   Robert kicked his horse back into motion and started down the ridge toward the barrows. Ned kept pace with him. The king rode on, eyes straight ahead.  Yes,  he said at last."
}