{
  "id": "27c484a73864ac5adcf0f4ef5eba86681e80223f",
  "text": "  Mr. Weasley's car was thundering down the slope, headlights glaring, its horn screeching, knocking spiders aside; several were thrown onto their backs, their endless legs waving in the air. The car screeched to a halt in front of Harry and Ron and the doors flew open.  \"Get Fang!\" Harry yelled, diving into the front seat; Ron seized the boarhound around the middle and threw him, yelping, into the back of the car - the doors slammed shut - Ron didn't touch the accelerator but the car didn't need him; the engine roared and they were off, hitting more spiders. They sped up the slope, out of the hollow, and they were soon crashing through the forest, branches  whipping the windows as the car wound its way cleverly through the widest gaps, following a path it obviously knew.  Harry looked sideways at Ron. His mouth was still open in the silent scream, but his eyes weren't popping anymore.  \"Are you okay?\"  Ron stared straight ahead, unable to speak.  They smashed their way through the undergrowth, Fang howling loudly in the back seat, and Harry saw the side mirror snap off as they squeezed past a large oak. After ten noisy, rocky minutes, the trees thinned, and Harry could again see patches of sky.  The car stopped so suddenly that they were nearly thrown into the windshield. They had reached the edge of the forest. Fang flung himself at the window in his anxiety to get out, and when Harry opened the door, he shot off through the trees to Hagrid's house, tail between his legs. Harry got out too, and after a minute or so, Ron seemed to regain the feeling in his limbs and followed, still stiff-necked and staring. Harry gave the car a grateful pat as it reversed back into the forest and disappeared from view.  Harry went back into Hagrid's cabin to get the Invisibility Cloak. Fang was trembling under a blanket in his basket. When Harry got outside again, he found Ron being violently sick in the pumpkin patch.  \"Follow the spiders,\" said Ron weakly, wiping his mouth on his sleeve. \"I'll never forgive Hagrid. We're lucky to be alive.\"  \"I bet he thought Aragog wouldn't hurt friends of his,\" said Harry.  \"That's exactly Hagrid's problem!\" said Ron, thumping the wall of the cabin. \"He always thinks monsters aren't as bad as they're  *280*  made out, and look where it's got him! A cell in Azkaban!\" He was shivering uncontrollably now. \"What was the point of sending us in there? What have we found out, Id like to know?\"  \"That Hagrid never opened the Chamber of Secrets,\" said Harry, throwing the cloak over Ron and prodding him in the arm to make him walk. \"He was innocent.\"  Ron gave a loud snort. Evidently, hatching Aragog in a cupboard wasn't his idea of being innocent.  As the castle loomed nearer Harry twitched the cloak to make sure their feet were hidden, then pushed the creaking front doors ajar. They walked carefully back across the entrance hall and up the marble staircase, holding their breath as they passed corridors where watchful sentries were walking. At last they reached the safety of the Gryffindor common room, where the fire had burned itself into glowing ash. They took off the cloak and climbed the winding stair to their dormitory.  Ron fell onto his bed without bothering to get undressed. Harry, however, didn't feel very sleepy. He sat on the edge of his fourposter, thinking hard about everything Aragog had said.  The creature that was lurking somewhere in the castle, he thought, sounded like a sort of monster Voldemort - even other monsters didn't want to name it. But he and Ron were no closer to finding out what it was, or how it Petrified its victims. Even Hagrid had never known what was in the Chamber of Secrets.  Harry swung his legs up onto his bed and leaned back against his pillows, watching the moon glinting at him through the tower window.  He couldn't see what else they could do. They had hit dead ends  *281*  everywhere. Riddle had caught the wrong person, the Heir of Slytherin had got off, and no one could tell whether it was the same person, or a different one, who had opened the Chamber this time. There was nobody else to ask. Harry lay down, still thinking about what Aragog had said.  He was becoming drowsy when what seemed like their very last hope occurred to him, and he suddenly sat bolt upright.  \"Ron,\" he hissed through the dark, \"Ron -\"  Ron woke with a yelp like Fang's, stared wildly around, and saw Harry.  \"Ron -that girl who died. Aragog said she was found in a bathroom,\" said Harry, ignoring Neville's snufing snores from the corner. \"What if she never left the bathroom? What if she's still there?\"  Ron rubbed his eyes, frowning through the moonlight. And then he understood, too.  \"You don't think - not Moaning Myrtle?\"   A ll those times we were in that bathroom, and she was just  three toilets away,\" said Ron bitterly at breakfast next day,  \"and we could've asked her, and now. . .\"  It had been hard enough trying to look for spiders. Escaping their teachers long enough to sneak into a girls' bathroom, the girls' bathroom, moreover, right next to the scene of the first attack, was going to be almost impossible."
}