{
  "id": "27d197fedb713cff70035cb8a41378a439575e15",
  "text": "  If you are in need of new arms for the Hand’s tourney, you have come to the right shop.  Ned did not bother to correct him.  My work is costly, and I make no apologies for that, my lord,  he said as he filled two matching silver goblets.  You will not find craftsmanship equal to mine anywhere in the Seven Kingdoms, I promise you. Visit every forge in King’s Landing if you like, and compare for yourself. Any village smith can hammer out a shirt of mail; my work is art.   Ned sipped his wine and let the man go on. The Knight of Flowers bought all his armor here, Tobho boasted, and many high lords, the ones who knew fine steel, and even Lord Renly, the king’s own brother. Perhaps the Hand had seen Lord Renly’s new armor, the green plate with the golden antlers? No other armorer in the city could get that deep a green; he knew the secret of putting color in the steel itself, paint and enamel were the crutches of a journeyman. Or mayhaps the Hand wanted a blade? Tobho had learned to work Valyrian steel at the forges of Qohor as a boy. Only a man who knew the spells could take old weapons and forge them anew.  The direwolf is the sigil of House Stark, is it not? I could fashion a direwolf helm so real that children will run from you in the street,  he vowed.  Ned smiled.  Did you make a falcon helm for Lord Arryn?   Tobho Mott paused a long moment and set aside his wine.  The Hand did call upon me, with Lord Stannis, the king’s brother. I regret to say, they did not honor me with their patronage.   Ned looked at the man evenly, saying nothing, waiting. He had found over the years that silence sometimes yielded more than questions. And so it was this time.   They asked to see the boy,  the armorer said,  so I took them back to the forge.    The boy,  Ned echoed. He had no notion who the boy might be.  I should like to see the boy as well.   Tobho Mott gave him a cool, careful look.  As you wish, my lord,  he said with no trace of his former friendliness. He led Ned out a rear door and across a narrow yard, back to the cavernous stone barn where the work was done. When the armorer opened the door, the blast of hot air that came through made Ned feel as though he were walking into a dragon’s mouth. Inside, a forge blazed in each corner, and the air stank of smoke and sulfur. Journeymen armorers glanced up from their hammers and tongs just long enough to wipe the sweat from their brows, while bare-chested apprentice boys worked the bellows.  The master called over a tall lad about Robb’s age, his arms and chest corded with muscle.  This is Lord Stark, the new Hand of the King,  he told him as the boy looked at Ned through sullen blue eyes and pushed back sweat-soaked hair with his fingers. Thick hair, shaggy and unkempt and black as ink. The shadow of a new beard darkened his jaw.  This is Gendry. Strong for his age, and he works hard. Show the Hand that helmet you made, lad.  Almost shyly, the boy led them to his bench, and a steel helm shaped like a bull’s head, with two great curving horns.  Ned turned the helm over in his hands. It was raw steel, unpolished but expertly shaped.  This is fine work. I would be pleased if you would let me buy it.   The boy snatched it out of his hands.  It’s not for sale.   Tobho Mott looked horror-struck.  Boy, this is the King’s Hand. If his lordship wants this helm, make him a gift of it. He honors you by asking.    I made it for me,  the boy said stubbornly.   A hundred pardons, my lord,  his master said hurriedly to Ned.  The boy is crude as new steel, and like new steel would profit from some beating. That helm is journeyman’s work at best. Forgive him and I promise I will craft you a helm like none you have ever seen.    He’s done nothing that requires my forgiveness. Gendry, when Lord Arryn came to see you, what did you talk about?    He asked me questions is all, m’lord.    What sort of questions?   The boy shrugged.  How was I, and was I well treated, and if I liked the work, and stuff about my mother. Who she was and what she looked like and all.    What did you tell him?  Ned asked.  The boy shoved a fresh fall of black hair off his forehead.  She died when I was little. She had yellow hair, and sometimes she used to sing to me, I remember. She worked in an alehouse.    Did Lord Stannis question you as well?    The bald one? No, not him. He never said no word, just glared at me, like I was some raper who done for his daughter.    Mind your filthy tongue,  the master said.  This is the King’s own Hand.  The boy lowered his eyes.  A smart boy, but stubborn. That helm… the others call him bullheaded, so he threw it in their teeth.   Ned touched the boy’s head, fingering the thick black hair.  Look at me, Gendry.  The apprentice lifted his face. Ned studied the shape of his jaw, the eyes like blue ice. Yes, he thought, I see it.  Go back to your work, lad. I’m sorry to have bothered you.  He walked back to the house with the master.  Who paid the boy’s apprentice fee?  he asked lightly."
}