{
  "id": "27e79e1f4483282c3e34dae22c4098235cbcddc3",
  "text": "\"  \"Disguised himself, probably,\" said a Hufflepuff fifth year. \"He could've flown in,\" suggested Dean Thomas.  \"Honestly, am I the only person who's ever bothered to read Hogwarts, A History?\" said Hermione crossly to Harry and Ron.  \"Probably,\" said Ron. \"Why?\"  \"Because the castle's protected by more than walls, You know,,, said Hermione. \"There are all sorts of enchantments on it, to stop people entering by stealth. You can't just Apparate in here. And I'd like to see the disguise that could fool those dementors. They're guarding every single entrance to the grounds. They'd have seen him fly in too. And Fitch knows all the secret passages, they'll have them covered....\"  \"The lights are going out now!\" Percy shouted. \"I want everyone in their sleeping bags and no more talking!\"  The candles all went out at once. The only light now came from the silvery ghosts, who were drifting about talking seriously to the prefects, and the enchanted ceiling, which, like the sky outside, was scattered with stars. What with that, and the whispering that still filled the hall, Harry felt as though he were sleeping outdoors in a light wind.  Once every hour, a teacher would reappear in the hall to check that everything was quiet. Around three in the morning, when many students had finally fallen asleep, Professor Dumbledore came in. Harry watched him looking around for Percy, who had been prowling between the sleeping bags, telling people off for talking. Percy was only a short way away from Harry, Ron, and Hermlone, who quickly pretended to be asleep as Dumbledore's footsteps drew nearer.  \"Any sign of him, Professor?\" asked Percy in a whisper.  \"No. All well here?\"  \"Everything under control, sir.\"  \"Good. There's no point moving them all now. I've found a temporary guardian for the Gryffindor portrait hole. You'll be able to move them back in tomorrow.\"  \"And the Fat Lady, sir?\"  \"Hiding in a map of Argyllshire on the second floor. Apparently she refused to let Black in without the password, so he attacked. She's still very distressed, but once she's calmed down, I'll have Mr. Filch restore her.\"  Harry heard the door of the hall creak open again, and more footsteps.  \"Headmaster?\" It was Snape. Harry kept quite still, listening hard. \"The whole of the third floor has been searched. He's not there. And Filch has done the dungeons; nothing there either.\"  \"What about the Astronomy tower? Professor Trelawney's room? The Owlery?\"  \"All searched.\"  \"Very well, Severus. I didn't really expect Black to linger.\"  \"Have you any theory as to how he got in, Professor?\" asked Snape.  Harry raised his head very slightly off his arms to free his other ear,  \"Many, Severus, each of them as unlikely as the next.\"  Harry opened his eyes a fraction and squinted up to where they stood; Dumbledore's back was to him, but he could see Percy's face, rapt with attention, and Snape's profile, which looked angry.  \"You remember the conversation we had, Headmaster, just before -- ah -- the start of term?\" said Snape, who was barely opening his lips, as though trying to block Percy out of the conversation.  \"I do, Severus,\" said Dumbledore, and there was something like warning in his voice.  \"It seems -- almost impossible -- that Black could have entered the school without inside help. I did express my concerns whet, you appointed --\"  \"I do not believe a single person inside this castle would have helped Black enter it,\" said Dumbledore, and his tone made it so clear that the subject was closed that Snape didn't reply. \"I must go down to the dementors,\" said Dumbledore. I said I would inform them when our search was complete.\"  \"Didn't they want to help, sit?\" said Percy.  \"Oh yes,\" said Dumbledore coldly. \"But I'm afraid no dementor will cross the threshold of this castle while I am headmaster.\"  Percy looked slightly abashed. Dumbledore left the hall, walking quickly and quietly. Snape stood for a moment, watching the headmaster with an expression of deep resentment on his face; then he too left.  Harry glanced sideways at Ron and Hermione. Both of them had their eyes open too, reflecting the starry ceiling.  \"\\What was all that about?\" Ron mouthed.  The school talked of nothing but Sirius Black for the next few days. The theories about how he had entered the castle became wilder and wilder; Hannah Abbott, from Hufflepuff, spent much of their next Herbology class telling anyone who'd listen that Black could turn into a flowering shrub.  The Fat Lady's ripped canvas had been taken off the wall and  Replaced with the portrait of Sir Cadogan and his fat gray pony. Nobody was very happy about this. Sir Cadogan spent half his time challenging people to duels, and the rest thinking up ridiculously complicated passwords, which he changed at least twice a day.  \"He's a complete lunatic,\" said Seamus Finnigan angrily to Percy. \"Can't we get anyone else?\"  \"None of the other pictures wanted the job,\" said Percy. \"Frightened of what happened to the Fat Lady."
}