{
  "id": "2855c182edbdafb119e3597666954dc13a1cba7f",
  "text": " At  last  tired out  they.  rested  on  the  grass  at  its  feet,  and  then  at  evening  began,  their  long  climb  down.    There was excitement  in  the camp  that night.  In  the morning  they prepared  to  move  once  more.  Only  Bofur  and  Bombur  were  left  behind  to  guard  the  ponies  and  such  stores  as  they  had  brought  with  them  from  the  river.  The  others  went  down  the  valley  and  up  the  newly  found  path,  and  so  to  the  narrow  ledge. Along  this  they could carry no bundles or packs, so narrow and breathless was  it, with a  fall  of  a  hundred  and  fifty  feet  beside  them  on  to  sharp  rocks  below;  but  each  of  them  took a good coil of  rope wound  tight about his waist, and  so at  last without  mishap they reached the little grassy bay.   There  they  made  their  third  camp,  hauling  up  what  they  needed  from  below  with  their ropes. Down  the same way  they were able occasionally  to  lower one of  the more  active  dwarves,  such  as Kili,  to  exchange  such  news  as  there was,  or  to  take  a  share  in  the  guard  below,  while  Bofur  was  hauled  up  to  the  higher  camp.  Bombur would not come up either the rope or the path.  \"I am too fat for such fly-walks,\" he said. \"I should turn dizzy and tread on my  beard, and then you would be thirteen again. And the knotted ropes are too slender  for my weight.\" Luckily for him that was not true, as you will see.  In  the  meanwhile  some  of  them  explored  the  ledge  beyond  the  opening  and  found a path  that  led higher and higher on  to  the mountain; but  they did not dare  to venture very  far  that way, nor was  there much use  in  it. Out up  there  a  silence  reigned,  broken  by  no  bird  or  sound  except  that  of  the  wind  in  the  crannies  of  stone. They spoke low and never called or sang, for danger brooded in every rock.  The  others  who  were  busy  with  the  secret  of  the  door  had  no  more  success.  They  were  too  eager  to  trouble  about  the  runes  or  the  moon-letters,  but  tried  without  resting  to  discover where  exactly  in  the  smooth  face  of  the  rock  the  door  was hidden. They had brought picks and tools of many sorts from Lake-town, and  at  first  they  tried  to  use  these.  But  when  they  struck  the  stone  the  handles  splintered and jarred their arms cruelly, and the steel heads broke or bent like lead.  Mining work,  they  saw  clearly was  no  good  against  the magic  that  had  shut  this  door; and they grew terrified, too, of the echoing noise.  Bilbo  found  sitting  on  the  doorstep  lonesome  and  wearisome-there was  not  a  doorstep, of course, really, but they used to call the little grassy space between the  wall  and  the  opening  the  \"doorstep\"  in  fun,  remembering Bilbo's words  long  ago   ####-at  the  unexpected  party  in  his  hobbit-hole,  when  he  said  they  could  sit  on  the  doorstep  till  they  thought  of  something.  And  sit  and  think  they  did,  or  wandered  aimlessly about, and glummer and glummer they became.  Their  spirits  had  risen  a  little  at  the  discovery  of  the path, but now  they  sank  into their boots; and yet they would not give it up and go away. The hobbit was no  longer much brighter than the dwarves. He would do nothing but sit with his back  to  the  rock-face  and  stare  away west  through  the opening, over  the cliff, over  the  wide  lands  to  the black wall of Mirkwood,  and  to  the distances beyond,  in which  he  sometimes  thought  he  could  catch  glimpses  of  the Misty Mountains  small  and  far. If the dwarves asked him what he was doing he answered:  \"You  said  sitting  on  the  doorstep  and  thinking  would  be  my  job,  not  to  mention  getting  inside,  so  I  am  sitting  and  thinking.\" But  I  am  afraid  he was  not  thinking  much  of  the  job,  but  of  what  lay  beyond  the  blue  distance,  the  quiet  Western Land  and  the Hill  and  his  hobbit-hole under  it. A  large grey  stone  lay  in  the centre of the grass and he stared moodily at it or watched the great snails. They  seemed  to  love  the  little  shut-in  bay  with  its  walls  of  cool  rock,  and  there  were  many of them of huge size crawling slowly and stickily along its sides.  \"Tomorrow begins the last week of Autumn,\" said Thorin one day.   \"And winter comes after autumn,\" said Bifur.   \"And  next  year  after  that,\"  said  Dwalin,  \"and  our  beards  will  grow  till  they  hang  down  the  cliff  to  the  valley  before  anything  happens  here.  What  is  our  burglar doing for us?  Since  he  has  got  an  invisible  ring,  and  ought  to  be  a  specially  excellent  performer  now,  I  am  beginning  to  think  he might  go  through  the  Front Gate  and  spy things out a bit!\"  Bilbo  heard  this-the  dwarves  were  on  the  rocks  just  :  above  the  enclosure  where  he  was  sitting-and  \"Good Gracious!\"  he  thought,  \"so  that  is what  they  are  beginning  to  think,  is  it?  It  is  always  poor  me  that  has  to  get  them  out  :  of  their  difficulties, at least since the wizard left."
}