{
  "id": "28666e1599fc7b354fdadaf50c63c70828c3bba8",
  "text": "  There was nothing else for it.  \"Excuse me,\" Harry said to the plump woman.  \"Hello, dear,\" she said. \"First time at Hogwarts? Ron's new, too.\"  She pointed at the last and youngest of her sons. He was tall, thin, and gangling, with freckles, big hands and feet, and a long nose.  \"Yes,\" said Harry. \"The thing is -- the thing is, I don't know how to --\"  \"How to get onto the platform?\" she said kindly, and Harry nodded.  \"Not to worry,\" she said. \"All you have to do is walk straight at the barrier between platforms nine and ten. Don't stop and don't be scared you'll crash into it, that's very important. Best do it at a bit of a run if you're nervous. Go on, go now before Ron.\"  \"Er -- okay,\" said Harry.  He pushed his trolley around and stared at the barrier. It looked very solid.  He started to walk toward it. People jostled him on their way to platforms nine and ten. Harry walked more quickly. He was going to smash right into that barrier and then he'd be in trouble -- leaning forward on his cart, he broke into a heavy run -- the barrier was coming nearer and nearer -- he wouldn't be able to stop -- the cart was out of control -- he was a foot away -- he closed his eyes ready for the crash --  It didn't come... he kept on running... he opened his eyes. A scarlet steam engine was waiting next to a platform packed with people. A sign overhead said Hogwarts Express, eleven O'clock. Harry looked behind him and saw a wrought-iron archway where the barrier had been, with the words Platform Nine and Three-Quarters on it, He had done it.  Smoke from the engine drifted over the heads of the chattering crowd, while cats of every color wound here and there between their legs. Owls hooted to one another in a disgruntled sort of way over the babble and the scraping of heavy trunks.  The first few carriages were already packed with students, some hanging out of the window to talk to their families, some fighting over seats. Harry pushed his cart off down the platform in search of an empty seat. He passed a round-faced boy who was saying, \"Gran, I've lost my toad again.\"  \"Oh, Neville,\" he heard the old woman sigh.  A boy with dreadlocks was surrounded by a small crowd.  \"Give us a look, Lee, go on.\"  The boy lifted the lid of a box in his arms, and the people around him shrieked and yelled as something inside poked out a long, hairy leg.  Harry pressed on through the crowd until he found an empty compartment near the end of the train. He put Hedwig inside first and then started to shove and heave his trunk toward the train door. He tried to lift it up the steps but could hardly raise one end and twice he dropped it painfully on his foot.  \"Want a hand?\" It was one of the red-haired twins he'd followed through the barrier.  \"Yes, please,\" Harry panted.  \"Oy, Fred! C'mere and help!\"  With the twins' help, Harry's trunk was at last tucked away in a corner of the compartment.  \"Thanks,\" said Harry, pushing his sweaty hair out of his eyes.  \"What's that?\" said one of the twins suddenly, pointing at Harry's lightning scar.  \"Blimey,\" said the other twin. \"Are you  \"He is,\" said the first twin. \"Aren't you?\" he added to Harry.  \"What?\" said Harry.  \"Harry Potter, \"chorused the twins.  \"Oh, him,\" said Harry. \"I mean, yes, I am.\"  The two boys gawked at him, and Harry felt himself turning red. Then, to his relief, a voice came floating in through the train's open door.  \"Fred? George? Are you there?\"  \"Coming, Mom.\"  With a last look at Harry, the twins hopped off the train.  Harry sat down next to the window where, half hidden, he could watch the red-haired family on the platform and hear what they were saying. Their mother had just taken out her handkerchief.  \"Ron, you've got something on your nose.\"  The youngest boy tried to jerk out of the way, but she grabbed him and began rubbing the end of his nose.  \"Mom -- geroff\" He wriggled free.  \"Aaah, has ickle Ronnie got somefink on his nosie?\" said one of the twins.  \"Shut up,\" said Ron.  \"Where's Percy?\" said their mother.  \"He's coming now.\"  The oldest boy came striding into sight. He had already changed into his billowing black Hogwarts robes, and Harry noticed a shiny silver badge on his chest with the letter P on it.  \"Can't stay long, Mother,\" he said. \"I'm up front, the prefects have got two compartments to themselves --\"  \"Oh, are you a prefect, Percy?\" said one of the twins, with an air of great surprise. \"You should have said something, we had no idea.\"  \"Hang on, I think I remember him saying something about it,\" said the other twin. \"Once --\"  \"Or twice --\"  \"A minute --\"  \"All summer --\"  \"Oh, shut up,\" said Percy the Prefect.  \"How come Percy gets new robes, anyway?\" said one of the twins.  \"Because he's a prefect,\" said their mother fondly. \"All right, dear, well, have a good term -- send me an owl when you get there.\"  She kissed Percy on the cheek and he left. Then she turned to the twins.  \"Now, you two -- this year, you behave yourselves. If I get one more owl telling me you've -- you've blown up a toilet or --\"  \"Blown up a toilet? We've never blown up a toilet."
}