{
  "id": "28778f0eec81eb5032d5bceab3a45413bf41e911",
  "text": "\" Harry wanted very much to ask whether Mr. Crouch had stopped calling Percy \"Weatherby\" yet, but resisted the temptation. There was no food as yet on the glittering golden plates, but small menus were lying in front of each of them.  Harry picked his up uncertainly and looked around - there were no waiters.  Dumbledore, however, looked carefully down at his own menu, then said very clearly to his plate, \"Pork chops!\" And pork chops appeared. Getting the idea, the rest of the table placed their orders with their plates too.  Harry glanced up at Hermione to see how she felt about this new and more complicated method of dining - surely it meant plenty of extra work for the house-elves? - but for once, Hermione didn't seem to be thinking about S.P.E.W.  She was deep in talk with Viktor Krum and hardly seemed to notice what she was eating. It now occurred to Harry that he had never actually heard Krum speak before, but he was certainly talking now, and very enthusiastically at that. \"Veil, ve have a castle also, not as big as this, nor as comfortable, I am thinking,\" he was telling Hermione.  \"Ve have just four floors, and the fires are lit only for magical purposes.  But ve have grounds larger even than these - though in vinter, ve have very little daylight, so ve are not enjoying them.  But in summer ve are flying every day, over the lakes and the mountains -\" \"Now, now, Viktor!\"  said Karkaroff with a laugh that didn't reach his cold eyes, \"don't go giving away anything else, now, or your charming friend will know exactly where to find us!\" Dumbledore smiled, his eyes twinkling.  \"Igor, all this secrecy ., . one would almost think you didn't want visitors.\" \"Well, Dumbledore,\" said Karkaroff, displaying his yellowing teeth to their fullest extent, \"we are all protective of our private domains, are we not?  Do we not jealously guard the halls of learning that have been entrusted to us?  Are we not right to be proud that we alone know our school's secrets, and right to protect them?\" \"Oh I would never dream of assuming I know all Hogwarts' secrets, Igor,\" said Dumbledore amicably.  \"Only this morning, for instance, I took a wrong turning on the way to the bathroom and found myself in a beautifully proportioned room I have never seen before, containing a really rather magnificent collection of chamber pots.  When I went back to investigate more closely, I discovered that the room had vanished.  But I must keep an eye out for it.  Possibly it is only accessible at five-thirty in the morning.  Or it may only appear at the quarter moon - or when the seeker has an exceptionally full bladder.\" Harry snorted into his plate of goulash.  Percy frowned, but Harry could have sworn Dumbledore had given him a very small wink. Meanwhile Fleur Delacour was criticizing the Hogwarts decorations to Roger Davies. \"Zis is nothing,\" she said dismissively, looking around at the sparkling walls of the Great Hall.  \"At ze Palace of Beauxbatons, we 'ave ice sculptures all around ze dining chamber at Chreestmas. Zey do not melt, of course . . . zey are like 'uge statues of diamond, glittering around ze place.  And ze food is seemply superb.  And we 'ave choirs of wood nymphs, 'oo serenade us as we eat.  We 'ave none of zis ugly armor in ze 'alls, and eef a poltergeist ever entaired into Beauxbatons, 'e would be expelled like zat.\"  She slapped her hand onto the table impatiently. Roger Davies was watching her talk with a very dazed look on his face, and he kept missing his mouth with his fork.  Harry had the impression that Davies was too busy staring at Fleur to take in a word she was saying. \"Absolutely right,\" he said quickly, slapping his own hand down on the table in imitation of Fleur.  \"Like that. Yeah.\" Harry looked around the Hall.  Hagrid was sitting at one of the other staff tables; he was back in his horrible hairy brown suit and gazing up at the top table.  Harry saw him give a small wave, and looking around, saw Madame Maxime return it, her opals glittering in the candlelight. Hermione was now teaching Krum to say her name properly; he kept calling her \"Hermy-own.\" \"Her-my-oh-nee,\" she said slowly and clearly. \"Herm-own-ninny.\" \"Close enough,\" she said, catching Harry's eye and grinning. When all the food had been consumed, Dumbledore stood up and asked the students to do the same.  Then, with a wave of his wand, all the tables zoomed back along the walls leaving the floor clear, and then he conjured a raised platform into existence along the right wall.  A set of drums, several guitars, a lute, a cello, and some bagpipes were set upon it. The \"Weird Sisters now trooped up onto the stage to wildly enthusiastic applause; they were all extremely hairy and dressed in black robes that had been artfully ripped and torn. They picked up their instruments, and Harry, who had been so interested in watching them that he had almost forgotten what was coming, suddenly realized that the lanterns on all the other tables had gone out, and that the other champions and their partners were standing up."
}