{
  "id": "28c8507cd5d6436cfa0760da3df86262035b268b",
  "text": " A wave of laughter followed them down the center aisle toward the king. They must be riding ponies, he concluded… until they came into full view.  The jousters were a pair of dwarfs. One was mounted on an ugly grey dog, long of leg and heavy of jaw. The other rode an immense spotted sow. Painted wooden armor clattered and clacked as the little knights bounced up and down in their saddles. Their shields were bigger than they were, and they wrestled manfully with their lances as they clomped along, swaying this way and that and eliciting gusts of mirth. One knight was all in gold, with a black stag painted on his shield; the other wore grey and white, and bore a wolf device. Their mounts were barded likewise. Tyrion glanced along the dais at all the laughing faces. Joffrey was red and breathless, Tommen was hooting and hopping up and down in his seat, Cersei was chuckling politely, and even Lord Tywin looked mildly amused. Of all those at the high table, only Sansa Stark was not smiling. He could have loved her for that, but if truth be told the Stark girl’s eyes were far away, as if she had not even seen the ludicrous riders loping toward her.  The dwarfs are not to blame, Tyrion decided. When they are done, I shall compliment them and give them a fat purse of silver. And come the morrow, I will find whoever planned this little diversion and arrange for a different sort of thanks.  When the dwarfs reined up beneath the dais to salute the king, the wolf knight dropped his shield. As he leaned over to grab for it, the stag knight lost control of his heavy lance and slammed him across the back. The wolf knight fell off his pig, and his lance tumbled over and boinked his foe on the head. They both wound up on the floor in a great tangle. When they rose, both tried to mount the dog. Much shouting and shoving followed. Finally they regained their saddles, only mounted on each other’s steed, holding the wrong shield and facing backward.  It took some time to sort that out, but in the end they spurred to opposite ends of the hall, and wheeled about for the tilt. As the lords and ladies guffawed and giggled, the little men came together with a crash and a clatter, and the wolf knight’s lance struck the helm of the stag knight and knocked his head clean off. It spun through the air spattering blood to land in the lap of Lord Gyles. The headless dwarf careened around the tables, flailing his arms. Dogs barked, women shrieked, and Moon Boy made a great show of swaying perilously back and forth on his stilts, until Lord Gyles pulled a dripping red melon out of the shattered helm, at which point the stag knight poked his face up out of his armor, and another storm of laughter rocked the hall. The knights waited for it to die, circled around each other trading colorful insults, and were about to separate for another joust when the dog threw its rider to the floor and mounted the sow. The huge pig squealed in distress, while the wedding guests squealed with laughter, especially when the stag knight leapt onto the wolf knight, let down his wooden breeches, and started to pump away frantically at the other’s nether portions.   I yield, I yield,  the dwarf on the bottom screamed.  Good ser, put up your sword!    I would, I would, if you’ll stop moving the sheath!  the dwarf on the top replied, to the merriment of all.  Joffrey was snorting wine from both nostrils. Gasping, he lurched to his feet, almost knocking over his tall two-handed chalice.  A champion,  he shouted.  We have a champion!  The hall began to quiet when it was seen that the king was speaking. The dwarfs untangled, no doubt anticipating the royal thanks.  Not a true champion, though,  said Joff.  A true champion defeats all challengers.  The king climbed up on the table.  Who else will challenge our tiny champion?  With a gleeful smile, he turned toward Tyrion.  Uncle! You’ll defend the honor of my realm, won’t you? You can ride the pig!   The laughter crashed over him like a wave. Tyrion Lannister did not remember rising, nor climbing on his chair, but he found himself standing on the table. The hall was a torchlit blur of leering faces. He twisted his face into the most hideous mockery of a smile the Seven Kingdoms had ever seen.  Your Grace,  he called,  I’ll ride the pig… but only if you ride the dog!   Joff scowled, confused.  Me? I’m no dwarf. Why me?   Stepped right into the cut, Joff.  Why, you’re the only man in the hall that I’m certain of defeating!   He could not have said which was sweeter; the instant of shocked silence, the gale of laughter that followed, or the look of blind rage on his nephew’s face. The dwarf hopped back to the floor well satisfied, and by the time he looked back Ser Osmund and Ser Meryn were helping Joff climb down as well. When he noticed Cersei glaring at him, Tyrion blew her a kiss.  It was a relief when the musicians began to play. The tiny jousters led dog and sow from the hall, the guests returned to their trenchers of brawn, and Tyrion called for another cup of wine."
}