{
  "id": "28dc9a33e68132701310c2af1fe49658d116b84c",
  "text": " The air was colder than a tomb, and more still. He felt a strange relief when they reemerged into the afternoon light on the north side of the Wall.  Sam blinked at the sudden glare and looked around apprehensively.  The wildlings… they wouldn’t… they’d never dare come this close to the Wall. Would they?    They never have.  Jon climbed into his saddle. When Bowen Marsh and their ranger escort had mounted, Jon put two fingers in his mouth and whistled. Ghost came loping out of the tunnel.  The Lord Steward’s garron whickered and backed away from the direwolf.  Do you mean to take that beast?    Yes, my lord,  Jon said. Ghost’s head lifted. He seemed to taste the air. In the blink of an eye he was off, racing across the broad, weed-choked field to vanish in the trees.  Once they had entered the forest, they were in a different world. Jon had often hunted with his father and Jory and his brother Robb. He knew the wolfswood around Winterfell as well as any man. The haunted forest was much the same, and yet the feel of it was very different.  Perhaps it was all in the knowing. They had ridden past the end of the world; somehow that changed everything. Every shadow seemed darker, every sound more ominous. The trees pressed close and shut out the light of the setting sun. A thin crust of snow cracked beneath the hooves of their horses, with a sound like breaking bones. When the wind set the leaves to rustling, it was like a chilly finger tracing a path up Jon’s spine. The Wall was at their backs, and only the gods knew what lay ahead.  The sun was sinking below the trees when they reached their destination, a small clearing in the deep of the wood where nine weirwoods grew in a rough circle. Jon drew in a breath, and he saw Sam Tarly staring. Even in the wolfswood, you never found more than two or three of the white trees growing together; a grove of nine was unheard of. The forest floor was carpeted with fallen leaves, bloodred on top, black rot beneath. The wide smooth trunks were bone pale, and nine faces stared inward. The dried sap that crusted in the eyes was red and hard as ruby. Bowen Marsh commanded them to leave their horses outside the circle.  This is a sacred place, we will not defile it.   When they entered the grove, Samwell Tarly turned slowly looking at each face in turn. No two were quite alike.  They’re watching us,  he whispered.  The old gods.    Yes.  Jon knelt, and Sam knelt beside him.  They said the words together, as the last light faded in the west and grey day became black night.   Hear my words, and bear witness to my vow,  they recited, their voices filling the twilit grove.  Night gathers, and now my watch begins. It shall not end until my death. I shall take no wife, hold no lands, father no children. I shall wear no crowns and win no glory. I shall live and die at my post. I am the sword in the darkness. I am the watcher on the walls. I am the fire that burns against the cold, the light that brings the dawn, the horn that wakes the sleepers, the shield that guards the realms of men. I pledge my life and honor to the Night’s Watch, for this night and all the nights to come.   The woods fell silent.  You knelt as boys,  Bowen Marsh intoned solemnly.  Rise now as men of the Night’s Watch.   Jon held out a hand to pull Sam back to his feet. The rangers gathered round to offer smiles and congratulations, all but the gnarled old forester Dywen.  Best we be starting back, m’lord,  he said to Bowen Marsh.  Dark’s falling, and there’s something in the smell o’ the night that I mislike.   And suddenly Ghost was back, stalking softly between two weirwoods. White fur and red eyes, Jon realized, disquieted. Like the trees…  The wolf had something in his jaws. Something black.  What’s he got there?  asked Bowen Marsh, frowning.   To me, Ghost.  Jon knelt.  Bring it here.   The direwolf trotted to him. Jon heard Samwell Tarly’s sharp intake of breath.   Gods be good,  Dywen muttered.  That’s a hand.       EDDARD  The grey light of dawn was streaming through his window when the thunder of hoofbeats awoke Eddard Stark from his brief, exhausted sleep. He lifted his head from the table to look down into the yard. Below, men in mail and leather and crimson cloaks were making the morning ring to the sound of swords, and riding down mock warriors stuffed with straw. Ned watched Sandor Clegane gallop across the hard-packed ground to drive an iron-tipped lance through a dummy’s head. Canvas ripped and straw exploded as Lannister guardsmen joked and cursed.  Is this brave show for my benefit? he wondered. If so, Cersei was a greater fool than he’d imagined. Damn her, he thought, why is the woman not fled? I have given her chance after chance…  The morning was overcast and grim. Ned broke his fast with his daughters and Septa Mordane. Sansa, still disconsolate, stared sullenly at her food and refused to eat, but Arya wolfed down everything that was set in front of her.  Syrio says we have time for one last lesson before we take ship this evening,  she said."
}