{
  "id": "2933fc2d469f4797e60185ecb347cf9e1bc4e801",
  "text": "\" \"We never thought of her, did we?\"  said Ron slowly.  \"Mind you, she's definitely got giant blood, and she doesn't want to admit it-\" \"Of course she doesn't,\" said Hermione sharply, looking up.  \"Look what happened to Hagrid when Rita found out about his mother.  Look at Fudge, jumping to conclusions about her, just because she's part giant.  Who needs that sort of prejudice?  I'd probably say I had big bones if I knew that's what I'd get for telling the truth.\" Hermione looked at her watch.  \"We haven't done any practicing!\"  she said, looking shocked.  \"We were going to do the Impediment Curse!  We'll have to really get down to it tomorrow!  Come on. Harry, you need to get some sleep.\" Harry and Ron went slowly upstairs to their dormitory.  As Harry pulled on his pajamas, he looked over at Nevilles bed.  True to his word to Dumbledore, he had not told Ron and Hermione about Neville s parents.  As Harry took off his glasses and climbed into his four-poster, he imagined how it must feel to have parents still living but unable to recognize you. He often got sympathy from strangers for being an orphan, but as he listened to Nevilles snores, he thought that Neville deserved it more than he did.  Lying in the darkness, Harry felt a rush of anger and hate toward the people who had tortured Mr. and Mrs. Longbottom. ... He remembered the jeers of the crowd as Crouch's son and his companions had been dragged from the court by the dementors. ... He understood how they had felt. . . . Then he remembered the milk-white face of the screaming boy and realized with a jolt that he had died a year later. . . . It was Voldemort, Harry thought, staring up at the canopy of his bed in the darkness, it all came back to Voldemort. ... He was the one who had torn these families apart, who had ruined all these lives. . . . Ron and Hermione were supposed to be studying for their exams, which would finish on the day of the third task, but they were putting most of their efforts into helping Harry prepare. \"Don't worry about it,\" Hermione said shortly when Harry pointed this out to them and said he didn't mind practicing on his own for a while, \"at least we'll get top marks in Defense Against the Dark Arts.  We'd never have found out about all these hexes in class.\" \"Good training for when we're all Aurors,\" said Ron excitedly, attempting the Impediment Curse on a wasp that had buzzed into the room and making it stop dead in midair. The mood in the castle as they entered June became excited and tense again.  Everyone was looking forward to the third task, which would take place a week before the end of term. Harry was practicing hexes at every available moment.  He felt more confident about this task than either of the others.  Difficult and dangerous though it would undoubtedly be, Moody was right: Harry had managed to find his way past monstrous creatures and enchanted barriers before now, and this time he had some notice, some chance to prepare himself for what lay ahead. Tired of walking in on Harry, Hermione, and Ron all over the school.  Professor McGonagall had given them permission to use the empty Transfiguration classroom at lunchtimes.  Harry had soon mastered the Impediment Curse, a spell to slow down and obstruct attackers; the Reductor Curse, which would enable him to blast solid objects out of his way; and the Four-Point Spell, a useful discovery of Hermiones that would make his wand point due north, therefore enabling him to check whether he was going in the right direction within the maze.  He was still having trouble with the Shield Charm, though.  This was supposed to cast a temporary, invisible wall around himself that deflected minor curses; Hermione managed to shatter it with a well-placed Jelly-Legs Jinx, and Harry wobbled around the room for ten minutes afterward before she had looked up the counter-jinx. \"You're still doing really well, though,\" Hermione said encouragingly, looking down her list and crossing off those spells they had already learned.  \"Some of these are bound to come in handy.\" \"Come and look at this,\" said Ron, who was standing by the window.  He was staring down onto the grounds.  \"What's Malfoy doing?\" Harry and Hermione went to see. Malfoy, Crabbe, and Goyle were standing in the shadow of a tree below.  Crabbe and Goyle seemed to be keeping a lookout; both were smirking.  Malfoy was holding his hand up to his mouth and speaking into it. \"He looks like he's using a walkie-talkie,\" said Harry curiously. \"He can't be,\" said Hermione, \"I've told you, those sorts of things don't work around Hogwarts.  Come on, Harry,\" she added briskly, turning away from the window and moving back into the middle of the room, \"let's try that Shield Charm again.\" Sirius was sending daily owls now. Like Hermione, he seemed to want to concentrate on getting Harry through the last task before they concerned themselves with anything else.  He reminded Harry in every letter that whatever might be going on outside the walls of Hogwarts was not Harry's responsibility, nor was it within his power to influence it."
}