{
  "id": "29416a619f4be794b9a086d37ae68f1c0bd0c10d",
  "text": " I mean for him to sit on it until his hair turns white and his teeth fall out. And not from poison.  Jaime turned to Ser Boros Blount. The man had grown stout in recent years, though he was big-boned enough to carry it.  Ser Boros, you look like a man who enjoys his food. Henceforth you’ll taste everything Tommen eats or drinks.   Ser Osmund Kettleblack laughed aloud and the Knight of Flowers smiled, but Ser Boros turned a deep beet red.  I am no food taster! I am a knight of the Kingsguard!    Sad to say, you are.  Cersei should never have stripped the man of his white cloak. But their father had only compounded the shame by restoring it.  My sister has told me how readily you yielded my nephew to Tyrion’s sellswords. You will find carrots and pease less threatening, I hope. When your Sworn Brothers are training in the yard with sword and shield, you may train with spoon and trencher. Tommen loves applecakes. Try not to let any sellswords make off with them.    You speak to me thus? You?    You should have died before you let Tommen be taken.    As you died protecting Aerys, ser?  Ser Boros lurched to his feet, and clasped the hilt of his sword.  I won’t… I won’t suffer this. You should be the food taster, it seems to me. What else is a cripple good for?   Jaime smiled.  I agree. I am as unfit to guard the king as you are. So draw that sword you’re fondling, and we shall see how your two hands fare against my one. At the end one of us will be dead, and the Kingsguard will be improved.  He rose.  Or, if you prefer, you may return to your duties.    Bah!  Ser Boros hawked up a glob of green phlegm, spat it at Jaime’s feet, and walked out, his sword still in its sheath.  The man is craven, and a good thing. Though fat, aging, and never more than ordinary, Ser Boros could still have hacked him into bloody pieces. But Boros does not know that, and neither must the rest. They feared the man I was; the man I am they’d pity.  Jaime seated himself again and turned to Kettleblack.  Ser Osmund. I do not know you. I find that curious. I’ve fought in tourneys, mêlées, and battles throughout the Seven Kingdoms. I know of every hedge knight, freerider, and upjumped squire of any skill who has ever presumed to break a lance in the lists. So how is it that I have never heard of you, Ser Osmund?    That I couldn’t say, my lord.  He had a great wide smile on his face, did Ser Osmund, as if he and Jaime were old comrades in arms playing some jolly little game.  I’m a soldier, though, not no tourney knight.    Where had you served, before my sister found you?    Here and there, my lord.    I have been to Oldtown in the south and Winterfell in the north. I have been to Lannisport in the west, and King’s Landing in the east. But I have never been to Here. Nor There.  For want of a finger, Jaime pointed his stump at Ser Osmund’s beak of a nose.  I will ask once more. Where have you served?    In the Stepstones. Some in the Disputed Lands. There’s always fighting there. I rode with the Gallant Men. We fought for Lys, and some for Tyrosh.   You fought for anyone who would pay you.  How did you come by your knighthood?    On a battlefield.    Who knighted you?    Ser Robert… Stone. He’s dead now, my lord.    To be sure.  Ser Robert Stone might have been some bastard from the Vale, he supposed, selling his sword in the Disputed Lands. On the other hand, he might be no more than a name Ser Osmund cobbled together from a dead king and a castle wall. What was Cersei thinking when she gave this one a white cloak?  At least Kettleblack would likely know how to use a sword and shield. Sellswords were seldom the most honorable of men, but they had to have a certain skill at arms to stay alive.  Very well, ser,  Jaime said.  You may go.   The man’s grin returned. He left swaggering.   Ser Meryn.  Jaime smiled at the sour knight with the rust-red hair and the pouches under his eyes.  I have heard it said that Joffrey made use of you to chastise Sansa Stark.  He turned the White Book around one-handed.  Here, show me where it is in our vows that we swear to beat women and children.    I did as His Grace commanded me. We are sworn to obey.    Henceforth you will temper that obedience. My sister is Queen Regent. My father is the King’s Hand. I am Lord Commander of the Kingsguard. Obey us. None other.   Ser Meryn got a stubborn look on his face.  Are you telling us not to obey the king?    The king is eight. Our first duty is to protect him, which includes protecting him from himself. Use that ugly thing you keep inside your helm. If Tommen wants you to saddle his horse, obey him. If he tells you to kill his horse, come to me.    Aye. As you command, my lord.    Dismissed.  As he left, Jaime turned to Ser Balon Swann.  Ser Balon, I have watched you tilt many a time, and fought with and against you in mêlées. I’m told you proved your valor a hundred times over during the Battle of the Blackwater. The Kingsguard is honored by your presence.    The honor’s mine, my lord."
}