{
  "id": "29f6ff36f4f55060b0e80f64f272f19ae73bf6b1",
  "text": "'       The  sun climbed to  the noon and then rode slowly  down the sky. Light  clouds  came up out of the sea in the distant South and were blown away upon  the breeze. The sun sank. Shadows rose behind and reached out long arms from  the East. Still the hunters held on.  One day  now had  passed since Boromir   fell, and  the Orcs were yet far ahead. No longer could any sight of them be  seen in the level plains.        As nightshade was closing about  them Aragorn halted. Only twice in the  day's  march had they rested for a brief  while, and twelve leagues  now lay  between them and the eastern wall where they had stood at dawn.       'We have  come at last  to  a hard choice,' he said.  'Shall we  rest by  night, or shall we go on while our will and strength hold?'       'Unless  our enemies rest also, they  will  leave us far  behind, if we  stay to  sleep.' said Legolas. 'Surely even Orcs must pause on  the  march?'  said Gimli. 'Seldom will  Orcs journey in the open under the sun.  yet these  have done so,' said Legolas. 'Certainly they will not rest by night.'       'But if we walk by night, we cannot follow their trail,' said Gimli.       'The trail is straight, and turns  neither right nor left, as far as my  eyes can see,' said Legolas.        'Maybe,  I could  lead you  at guess in the darkness  and  hold  to the  line,'  said  Aragorn;  'but  if we strayed, or they turned aside, then when  light came there might be long delay before the trail was found again.'       'And  there  is  this also,' said Gimli: 'only by day can we see if any  tracks lead away.  If a prisoner should escape, or if one should be  carried  off, eastward,  say, to the Great River,  towards Mordor, we might pass  the  signs and never know it.'       'That  is true,'  said Aragorn. 'But if I  read  the signs back  yonder   rightly, the Orcs of the White Hand prevailed, and the whole company  is now  bound for Isengard. Their present course bears me out.'       'Yet it would  be rash to be sure of  their counsels,' said Gimli. 'And  what of escape? In the dark we  should have passed the signs that led you to  the brooch.'       'The Orcs will  be doubly on their  guard since then, and the prisoners  even wearier,' said Legolas. 'There will  be no  escape again, if we  do not  contrive  it. How  that is to be done cannot  be guessed, but first we  must    ####-overtake them.'       'And yet even I,  Dwarf of many journeys, and not the least hardy of my  folk, cannot run all the way to Isengard without any pause ' said Gimli. 'My  heart burns me too, and I would  have  started sooner but now I must  rest a   little to run the  better. And if we  rest, then the blind night is the time  to do so.'       'I said that  it  was a  hard  choice,' said Aragorn.  'How shall we end  this debate?'       'You are our guide,' said Gimli, 'and you are skilled in the chase. You   shall choose.'       'My heart  bids me go on,'  said Legolas. 'But we must hold together. I  will follow your counsel.'       'You give the choice to an ill chooser,' said Aragorn. 'Since we passed  through the Argonath  my  choices have  gone amiss.' He  fell  silent gazing  north and west into the gathering night for a long while.       'We will  not walk in  the dark,'  he  said at length.   'The  peril  of  missing the trail  or  signs  of  other  coming and  going seems to  me  the  greater. If the  Moon gave enough  light, we would use it, but alas! he sets  early and is yet young and pale.'       'And  tonight he is shrouded anyway,' Gimli murmured.  'Would  that the  Lady had given us a light, such a gift as she gave to Frodo!'       'It will be more needed  where it is bestowed,' said Aragorn. 'With him  lies  the true Quest.  Ours is but a small matter in the great deeds of this  time. A vain pursuit from its beginning, maybe, which no  choice of mine can  mar or mend. Well, I have chosen. So let us use the time as best we may!'       He  cast himself on the ground and fell at once into sleep, for he  had  not slept since their night under the shadow of Tol Brandir. Before dawn was  in the sky he woke and rose.  Gimli  was still deep in slumber,  but Legolas  was standing,  gazing northwards into the darkness, thoughtful and silent as  a young tree in a windless night.        'They are  far far away,' he said sadly, turning to Aragorn. 'I know in  my heart that they have not rested this night.  Only an eagle could overtake  them now.'       'Nonetheless we will still follow as we may,' said Aragorn. Stooping he  roused the Dwarf. 'Come! We must go,' he said. 'The scent is growing cold.'       'But it is still dark,' said Gimli. 'Even Legolas on a  hill-top  could  not see them till the Sun is up.'   ####-     'I fear they have passed beyond my sight from hill or plain, under moon  or sun,' said Legolas.        'Where sight fails the earth may  bring us rumour,' said  Aragorn. 'The  land  must  groan under  their hated  feet.' He stretched  himself  upon the  ground with his ear pressed against the turf."
}