{
  "id": "2a7057653e024baccdf6c940d9d7c00603e02c2f",
  "text": "  Davos knew Fury as well as he knew his own ships. Above her three hundred oars was a deck given over wholly to scorpions, and topside she mounted catapults fore and aft, large enough to fling barrels of burning pitch. A most formidable ship, and very swift as well, although Ser Imry had packed her bow to stern with armored knights and men-at-arms, at some cost to her speed.  The warhorns sounded again, commands drifting back from the Fury. Davos felt a tingle in his missing fingertips.  Out oars,  he shouted.  Form line.  A hundred blades dipped down into the water as the oarmaster’s drum began to boom. The sound was like the beating of a great slow heart, and the oars moved at every stroke, a hundred men pulling as one.  Wooden wings had sprouted from the Wraith and Lady Marya as well. The three galleys kept pace, their blades churning the water.  Slow cruise,  Davos called. Lord Velaryon’s silver-hulled Pride of Driftmark had moved into her position to port of Wraith, and Bold Laughter was coming up fast, but Harridan was only now getting her oars into the water and Seahorse was still struggling to bring down her mast. Davos looked astern. Yes, there, far to the south, that could only be Swordfish, lagging as ever. She dipped two hundred oars and mounted the largest ram in the fleet, though Davos had grave doubts about her captain.  He could hear soldiers shouting encouragement to each other across the water. They’d been little more than ballast since Storm’s End, and were eager to get at the foe, confident of victory. In that, they were of one mind with their admiral, Lord High Captain Ser Imry Florent.  Three days past, he had summoned all his captains to a war council aboard the Fury while the fleet lay anchored at the mouth of the Wendwater, in order to acquaint them with his dispositions. Davos and his sons had been assigned a place in the second line of battle, well out on the dangerous starboard wing.  A place of honor,  Allard had declared, well satisfied with the chance to prove his valor.  A place of peril,  his father had pointed out. His sons had given him pitying looks, even young Maric. The Onion Knight has become an old woman, he could hear them thinking, still a smuggler at heart.  Well, the last was true enough, he would make no apologies for it. Seaworth had a lordly ring to it, but down deep he was still Davos of Flea Bottom, coming home to his city on its three high hills. He knew as much of ships and sails and shores as any man in the Seven Kingdoms, and had fought his share of desperate fights sword to sword on a wet deck. But to this sort of battle he came a maiden, nervous and afraid. Smugglers do not sound warhorns and raise banners. When they smell danger, they raise sail and run before the wind.  Had he been admiral, he might have done it all differently. For a start, he would have sent a few of his swiftest ships to probe upriver and see what awaited them, instead of smashing in headlong. When he had suggested as much to Ser Imry, the Lord High Captain had thanked him courteously, but his eyes were not as polite. Who is this lowborn craven? those eyes asked. Is he the one who bought his knighthood with an onion?  With four times as many ships as the boy king, Ser Imry saw no need for caution or deceptive tactics. He had organized the fleet into ten lines of battle, each of twenty ships. The first two lines would sweep up the river to engage and destroy Joffrey’s little fleet, or  the boy’s toys  as Ser Imry dubbed them, to the mirth of his lordly captains. Those that followed would land companies of archers and spearmen beneath the city walls, and only then join the fight on the river. The smaller, slower ships to the rear would ferry over the main part of Stannis’s host from the south bank, protected by Salladhor Saan and his Lyseni, who would stand out in the bay in case the Lannisters had other ships hidden up along the coast, poised to sweep down on their rear.  To be fair, there was reason for Ser Imry’s haste. The winds had not used them kindly on the voyage up from Storm’s End. They had lost two cogs to the rocks of Shipbreaker Bay on the very day they set sail, a poor way to begin. One of the Myrish galleys had foundered in the Straits of Tarth, and a storm had overtaken them as they were entering the Gullet, scattering the fleet across half the narrow sea. All but twelve ships had finally regrouped behind the sheltering spine of Massey’s Hook, in the calmer waters of Blackwater Bay, but not before they had lost considerable time.  Stannis would have reached the Rush days ago. The kingsroad ran from Storm’s End straight to King’s Landing, a much shorter route than by sea, and his host was largely mounted; near twenty thousand knights, light horse, and freeriders, Renly’s unwilling legacy to his brother. They would have made good time, but armored destriers and twelve-foot lances would avail them little against the deep waters of the Blackwater Rush and the high stone walls of the city."
}