{
  "id": "2a7984cf8b86170a903a6f146f50e84e391ae1ae",
  "text": " But when he rubbed his eyes he saw that the strangers were all in black. They’re men of the Night’s Watch, Jon realized.  Come where? Who are you?   The tall man gestured, and two of the others pulled Jon from the bed. With the lantern leading the way they marched him from his cell and up a half turn of stair, to the Old Bear’s solar. He saw Maester Aemon standing by the fire, his hands folded around the head of a blackthorn cane. Septon Cellador was half drunk as usual, and Ser Wynton Stout was asleep in a window seat. The other brothers were strangers to him. All but one.  Immaculate in his fur-trimmed cloak and polished boots, Ser Alliser Thorne turned to say,  Here’s the turncloak now, my lord. Ned Stark’s bastard, of Winterfell.    I’m no turncloak, Thorne,  Jon said coldly.   We shall see.  In the leather chair behind the table where the Old Bear wrote his letters sat a big, broad, jowly man Jon did not know.  Yes, we shall see,  he said again.  You will not deny that you are Jon Snow, I hope? Stark’s bastard?    Lord Snow, he likes to call himself.  Ser Alliser was a spare, slim man, compact and sinewy, and just now his flinty eyes were dark with amusement.   You’re the one who named me Lord Snow,  said Jon. Ser Alliser had been fond of naming the boys he trained, during his time as Castle Black’s master-at-arms. The Old Bear had sent Thorne to Eastwatch-by-the-Sea. These others must be Eastwatch men. The bird reached Cotter Pyke and he’s sent us help.  How many men have you brought?  he asked the man behind the table.   It’s me who’ll ask the questions,  the jowly man replied.  You’ve been charged with oathbreaking, cowardice, and desertion, Jon Snow. Do you deny that you abandoned your brothers to die on the Fist of the First Men and joined the wildling Mance Rayder, this self-styled King-beyond-the-Wall?    Abandoned…?  Jon almost choked on the word.  Maester Aemon spoke up then.  My lord, Donal Noye and I discussed these issues when Jon Snow first returned to us, and were satisfied by Jon’s explanations.    Well, I am not satisfied, Maester,  said the jowly man.  I will hear these explanations for myself. Yes I will!   Jon swallowed his anger.  I abandoned no one. I left the Fist with Qhorin Halfhand to scout the Skirling Pass. I joined the wildlings under orders. The Halfhand feared that Mance might have found the Horn of Winter…    The Horn of Winter?  Ser Alliser chuckled.  Were you commanded to count their snarks as well, Lord Snow?    No, but I counted their giants as best I could.    Ser,  snapped the jowly man.  You will address Ser Alliser as ser, and myself as m’lord. I am Janos Slynt, Lord of Harrenhal, and commander here at Castle Black until such time as Bowen Marsh returns with his garrison. You will grant us our courtesies, yes. I will not suffer to hear an anointed knight like the good Ser Alliser mocked by a traitor’s bastard.  He raised a hand and pointed a meaty finger at Jon’s face.  Do you deny that you took a wildling woman into your bed?    No.  Jon’s grief over Ygritte was too fresh for him to deny her now.  No, my lord.    I suppose it was also the Halfhand who commanded you to fuck this unwashed whore?  Ser Alliser asked with a smirk.   Ser. She was no whore, ser. The Halfhand told me not to balk, whatever the wildlings asked of me, but… I will not deny that I went beyond what I had to do, that I… cared for her.    You admit to being an oathbreaker, then,  said Janos Slynt.  Half the men at Castle Black visited Mole’s Town from time to time to dig for buried treasures in the brothel, Jon knew, but he would not dishonor Ygritte by equating her with the Mole’s Town whores.  I broke my vows with a woman. I admit that. Yes.    Yes, m’lord!  When Slynt scowled, his jowls quivered. He was as broad as the Old Bear had been, and no doubt would be as bald if he lived to Mormont’s age. Half his hair was gone already, though he could not have been more than forty.   Yes, my lord,  Jon said.  I rode with the wildlings and ate with them, as the Halfhand commanded me, and I shared my furs with Ygritte. But I swear to you, I never turned my cloak. I escaped the Magnar as soon as I could, and never took up arms against my brothers or the realm.   Lord Slynt’s small eyes studied him.  Ser Glendon,  he commanded,  bring in the other prisoner.   Ser Glendon was the tall man who had dragged Jon from his bed. Four other men went with him when he left the room, but they were back soon enough with a captive, a small, sallow, battered man fettered hand and foot. He had a single eyebrow, a widow’s peak, and a mustache that looked like a smear of dirt on his upper lip, but his face was swollen and mottled with bruises, and most of his front teeth had been knocked out.  The Eastwatch men threw the captive roughly to the floor. Lord Slynt frowned down at him.  Is this the one you spoke of?   The captive blinked yellow eyes.  Aye.  Not until that instant did Jon recognize Rattleshirt. He is a different man without his armor, he thought."
}