{
  "id": "2ae3cefb64797835a11c729feee44c86f8d7b5a4",
  "text": " This summer has lasted nine years, Tyrion, and a tenth will soon be upon us. Think on that.    When I was a boy,  Tyrion replied,  my wet nurse told me that one day, if men were good, the gods would give the world a summer without ending. Perhaps we’ve been better than we thought, and the Great Summer is finally at hand.  He grinned.  The Lord Commander did not seem amused.  You are not fool enough to believe that, my lord. Already the days grow shorter. There can be no mistake, Aemon has had letters from the Citadel, findings in accord with his own. The end of summer stares us in the face.  Mormont reached out and clutched Tyrion tightly by the hand.  You must make them understand. I tell you, my lord, the darkness is coming. There are wild things in the woods, direwolves and mammoths and snow bears the size of aurochs, and I have seen darker shapes in my dreams.    In your dreams,  Tyrion echoed, thinking how badly he needed another strong drink.  Mormont was deaf to the edge in his voice.  The fisherfolk near Eastwatch have glimpsed white walkers on the shore.   This time Tyrion could not hold his tongue.  The fisherfolk of Lannisport often glimpse merlings.    Denys Mallister writes that the mountain people are moving south, slipping past the Shadow Tower in numbers greater than ever before. They are running, my lord… but running from what?  Lord Mormont moved to the window and stared out into the night.  These are old bones, Lannister, but they have never felt a chill like this. Tell the king what I say, I pray you. Winter is coming, and when the Long Night falls, only the Night’s Watch will stand between the realm and the darkness that sweeps from the north. The gods help us all if we are not ready.    The gods help me if I do not get some sleep tonight. Yoren is determined to ride at first light.  Tyrion got to his feet, sleepy from wine and tired of doom.  I thank you for all the courtesies you have done me, Lord Mormont.    Tell them, Tyrion. Tell them and make them believe. That is all the thanks I need.  He whistled, and his raven flew to him and perched on his shoulder. Mormont smiled and gave the bird some corn from his pocket, and that was how Tyrion left him.  It was bitter cold outside. Bundled thickly in his furs, Tyrion Lannister pulled on his gloves and nodded to the poor frozen wretches standing sentry outside the Commander’s Keep. He set off across the yard for his own chambers in the King’s Tower, walking as briskly as his legs could manage. Patches of snow crunched beneath his feet as his boots broke the night’s crust, and his breath steamed before him like a banner. He shoved his hands into his armpits and walked faster, praying that Morrec had remembered to warm his bed with hot bricks from the fire.  Behind the King’s Tower, the Wall glimmered in the light of the moon, immense and mysterious. Tyrion stopped for a moment to look up at it. His legs ached of cold and haste.  Suddenly a strange madness took hold of him, a yearning to look once more off the end of the world. It would be his last chance, he thought; tomorrow he would ride south, and he could not imagine why he would ever want to return to this frozen desolation. The King’s Tower was before him, with its promise of warmth and a soft bed, yet Tyrion found himself walking past it, toward the vast pale palisade of the Wall.  A wooden stair ascended the south face, anchored on huge rough-hewn beams sunk deep into the ice and frozen in place. Back and forth it switched, clawing its way upward as crooked as a bolt of lightning. The black brothers assured him that it was much stronger than it looked, but Tyrion’s legs were cramping too badly for him to even contemplate the ascent. He went instead to the iron cage beside the well, clambered inside, and yanked hard on the bell rope, three quick pulls.  He had to wait what seemed an eternity, standing there inside the bars with the Wall to his back. Long enough for Tyrion to begin to wonder why he was doing this. He had just about decided to forget his sudden whim and go to bed when the cage gave a jerk and began to ascend.  He moved upward slowly, by fits and starts at first, then more smoothly. The ground fell away beneath him, the cage swung, and Tyrion wrapped his hands around the iron bars. He could feel the cold of the metal even through his gloves. Morrec had a fire burning in his room, he noted with approval, but the Lord Commander’s tower was dark. The Old Bear had more sense than he did, it seemed.  Then he was above the towers, still inching his way upward. Castle Black lay below him, etched in moonlight. You could see how stark and empty it was from up here; windowless keeps, crumbling walls, courtyards choked with broken stone. Farther off, he could see the lights of Mole’s Town, the little village half a league south along the kingsroad, and here and there the bright glitter of moonlight on water where icy streams descended from the mountain heights to cut across the plains."
}