{
  "id": "2ae97253b653311d764fa2a400970b18d1d59cf4",
  "text": "    The queen will never allow that.    Oh, I think she may. I am her brother, and when you’ve known me longer, you’ll learn that I mean everything I say.    Even the lies?    Especially the lies. Lord Petyr, I sense that you are unhappy with me.    I love you as much as I ever have, my lord. Though I do not relish being played for a fool. if Myrcella weds Trystane Martell, she can scarcely wed Robert Arryn, can she?    Not without causing a great scandal,  he admitted.  I regret my little ruse, Lord Petyr, but when we spoke, I could not know the Dornishmen would accept my offer.   Littlefinger was not appeased.  I do not like being lied to, my lord. Leave me out of your next deception.   Only if you’ll do the same for me, Tyrion thought, glancing at the dagger sheathed at Littlefinger’s hip.  If I have given offense, I am deeply sorry. All men know how much we love you, my lord. And how much we need you.    Try and remember that.  With that Littlefinger left them.   Walk with me, Varys,  said Tyrion. They left through the king’s door behind the throne, the eunuch’s slippers whisking lightly over the stone.   Lord Baelish has the truth of it, you know. The queen will never permit you to send away her guard.    She will. You’ll see to that.   A smile flickered across Varys’s plump lips.  Will I?    Oh, for a certainty. You’ll tell her it is part of my scheme to free Jaime.   Varys stroked a powdered cheek.  This would doubtless involve the four men your man Bronn searched for so diligently in all the low places of King’s Landing. A thief, a poisoner, a mummer, and a murderer.    Put them in crimson cloaks and lion helms, they’ll look no different from any other guardsmen. I searched for some time for a ruse that might get them into Riverrun before I thought to hide them in plain sight. They’ll ride in by the main gate, flying Lannister banners and escorting Lord Eddard’s bones.  He smiled crookedly.  Four men alone would be watched vigilantly. Four among a hundred can lose themselves. So I must send the true guardsmen as well as the false… as you’ll tell my sister.    And for the sake of her beloved brother, she will consent, despite her misgivings.  They made their way down a deserted colonnade.  Still, the loss of her red cloaks will surely make her uneasy.    I like her uneasy,  said Tyrion.  Ser Cleos Frey left that very afternoon, escorted by Vylarr and a hundred red-cloaked Lannister guardsmen. The men Robb Stark had sent joined them at the King’s Gate for the long ride west.  Tyrion found Timett dicing with his Burned Men in the barracks.  Come to my solar at midnight.  Timett gave him a hard one-eyed stare, a curt nod. He was not one for long speeches.  That night he feasted with the Stone Crows and Moon Brothers in the Small Hall, though he shunned the wine for once. He wanted all his wits about him.  Shagga, what moon is this?   Shagga’s frown was a fierce thing.  Black, I think.    In the west, they call that a traitor’s moon. Try not to get too drunk tonight, and see that your axe is sharp.    A Stone Crow’s axe is always sharp, and Shagga’s axes are sharpest of all. Once I cut off a man’s head, but he did not know it until he tried to brush his hair. Then it fell off.    Is that why you never brush yours?  The Stone Crows roared and stamped their feet, Shagga hooting loudest of all.  By midnight, the castle was silent and dark. Doubtless a few gold cloaks on the walls spied them leaving the Tower of the Hand, but no one raised a voice. He was the Hand of the King, and where he went was his own affair.  The thin wooden door split with a thunderous crack beneath the heel of Shagga’s boot. Pieces went flying inward, and Tyrion heard a woman’s gasp of fear. Shagga hacked the door apart with three great blows of his axe and kicked his way through the ruins. Timett followed, and then Tyrion, stepping gingerly over the splinters. The fire had burned down a few glowing embers, and shadows lay thick across the bedchamber. When Timett ripped the heavy curtains off the bed, the naked serving girl stared up with wide white eyes.  Please, my lords,  she pleaded,  don’t hurt me.  She cringed away from Shagga, flushed and fearful, trying to cover her charms with her hands and coming up a hand short.   Go,  Tyrion told her.  It’s not you we want.    Shagga wants this woman.    Shagga wants every whore in this city of whores,  complained Timett son of Timett.   Yes,  Shagga said, unabashed.  Shagga would give her a strong child.    If she wants a strong child, she’ll know whom to seek,  Tyrion said.  Timett, see her out… gently, if you would.   The Burned Man pulled the girl from the bed and half marched, half dragged her across the chamber. Shagga watched them go, mournful as a puppy. The girl stumbled over the shattered door and out into the hall, helped along by a firm shove from Timett. Above their heads, the ravens were screeching.  Tyrion dragged the soft blanket off the bed, uncovering Grand Maester Pycelle beneath."
}