{
  "id": "2b4efe7001b229f42f0825b1e81b86c0663ff3dc",
  "text": " It had been hard to abandon it, but Jon was not so lost to honor as to take it with him. Even Jorah Mormont had not done that, when he fled in disgrace. Doubtless Lord Mormont would find someone more worthy of the blade. Jon felt bad when he thought of the old man. He knew his desertion would be salt in the still-raw wound of his son’s disgrace. That seemed a poor way to repay him for his trust, but it couldn’t be helped. No matter what he did, Jon felt as though he were betraying someone.  Even now, he did not know if he was doing the honorable thing. The southron had it easier. They had their septons to talk to, someone to tell them the gods’ will and help sort out right from wrong. But the Starks worshiped the old gods, the nameless gods, and if the heart trees heard, they did not speak.  When the last lights of Castle Black vanished behind him, Jon slowed his mare to a walk. He had a long journey ahead and only the one horse to see him through. There were holdfasts and farming villages along the road south where he might be able to trade the mare for a fresh mount when he needed one, but not if she were injured or blown.  He would need to find new clothes soon; most like, he’d need to steal them. He was clad in black from head to heel; high leather riding boots, roughspun breeches and tunic, sleeveless leather jerkin, and heavy wool cloak. His longsword and dagger were sheathed in black moleskin, and the hauberk and coif in his saddlebag were black ringmail. Any bit of it could mean his death if he were taken. A stranger wearing black was viewed with cold suspicion in every village and holdfast north of the Neck, and men would soon be watching for him. Once Maester Aemon’s ravens took flight, Jon knew he would find no safe haven. Not even at Winterfell. Bran might want to let him in, but Maester Luwin had better sense. He would bar the gates and send Jon away, as he should. Better not to call there at all.  Yet he saw the castle clear in his mind’s eye, as if he had left it only yesterday; the towering granite walls, the Great Hall with its smells of smoke and dog and roasting meat, his father’s solar, the turret room where he had slept. Part of him wanted nothing so much as to hear Bran laugh again, to sup on one of Gage’s beef-and-bacon pies, to listen to Old Nan tell her tales of the children of the forest and Florian the Fool.  But he had not left the Wall for that; he had left because he was after all his father’s son, and Robb’s brother. The gift of a sword, even a sword as fine as Longclaw, did not make him a Mormont. Nor was he Aemon Targaryen. Three times the old man had chosen, and three times he had chosen honor, but that was him. Even now, Jon could not decide whether the maester had stayed because he was weak and craven, or because he was strong and true. Yet he understood what the old man had meant, about the pain of choosing; he understood that all too well.  Tyrion Lannister had claimed that most men would rather deny a hard truth than face it, but Jon was done with denials. He was who he was; Jon Snow, bastard and oathbreaker, motherless, friendless, and damned. For the rest of his life—however long that might be—he would be condemned to be an outsider, the silent man standing in the shadows who dares not speak his true name. Wherever he might go throughout the Seven Kingdoms, he would need to live a lie, lest every man’s hand be raised against him. But it made no matter, so long as he lived long enough to take his place by his brother’s side and help avenge his father.  He remembered Robb as he had last seen him, standing in the yard with snow melting in his auburn hair. Jon would have to come to him in secret, disguised. He tried to imagine the look on Robb’s face when he revealed himself. His brother would shake his head and smile, and he’d say… he’d say…  He could not see the smile. Hard as he tried, he could not see it. He found himself thinking of the deserter his father had beheaded the day they’d found the direwolves.  You said the words,  Lord Eddard had told him.  You took a vow, before your brothers, before the old gods and the new.  Desmond and Fat Tom had dragged the man to the stump. Bran’s eyes had been wide as saucers, and Jon had to remind him to keep his pony in hand. He remembered the look on Father’s face when Theon Greyjoy brought forth Ice, the spray of blood on the snow, the way Theon had kicked the head when it came rolling at his feet.  He wondered what Lord Eddard might have done if the deserter had been his brother Benjen instead of that ragged stranger. Would it have been any different? It must, surely, surely… and Robb would welcome him, for a certainty. He had to, or else…  It did not bear thinking about. Pain throbbed, deep in his fingers, as he clutched the reins. Jon put his heels into his horse and broke into a gallop, racing down the kingsroad, as if to outrun his doubts. Jon was not afraid of death, but he did not want to die like that, trussed and bound and beheaded like a common brigand."
}