{
  "id": "2b541e8b525c8e9a5300e40c7ca9e1345b0e779e",
  "text": "  Valyrian steel?    Yes,  Lord Tywin said, in a tone of deep satisfaction.  At long last, Father? Valyrian steel blades were scarce and costly, yet thousands remained in the world, perhaps two hundred in the Seven Kingdoms alone. It had always irked his father that none belonged to House Lannister. The old Kings of the Rock had owned such a weapon, but the greatsword Brightroar had been lost when the second King Tommen carried it back to Valyria on his fool’s quest. He had never returned; nor had Uncle Gery, the youngest and most reckless of his father’s brothers, who had gone seeking after the lost sword some eight years past.  Thrice at least Lord Tywin had offered to buy Valyrian longswords from impoverished lesser houses, but his advances had always been firmly rebuffed. The little lordlings would gladly part with their daughters should a Lannister come asking, but they cherished their old family swords.  Tyrion wondered where the metal for this one had come from. A few master armorers could rework old Valyrian steel, but the secrets of its making had been lost when the Doom came to old Valyria.  The colors are strange,  he commented as he turned the blade in the sunlight. Most Valyrian steel was a grey so dark it looked almost black, as was true here as well. But blended into the folds was a red as deep as the grey. The two colors lapped over one another without ever touching, each ripple distinct, like waves of night and blood upon some steely shore.  How did you get this patterning? I’ve never seen anything like it.    Nor I, my lord,  said the armorer.  I confess, these colors were not what I intended, and I do not know that I could duplicate them. Your lord father had asked for the crimson of your House, and it was that color I set out to infuse into the metal. But Valyrian steel is stubborn. These old swords remember, it is said, and they do not change easily. I worked half a hundred spells and brightened the red time and time again, but always the color would darken, as if the blade was drinking the sun from it. And some folds would not take the red at all, as you can see. If my lords of Lannister are displeased, I will of course try again, as many times as you should require, but—    No need,  Lord Tywin said.  This will serve.    A crimson sword might flash prettily in the sun, but if truth be told I like these colors better,  said Tyrion.  They have an ominous beauty… and they make this blade unique. There is no other sword like it in all the world, I should think.    There is one.  The armorer bent over the table and unfolded the bundle of oilcloth, to reveal a second longsword.  Tyrion put down Joffrey’s sword and took up the other. If not twins, the two were at least close cousins. This one was thicker and heavier, a half-inch wider and three inches longer, but they shared the same fine clean lines and the same distinctive color, the ripples of blood and night. Three fullers, deeply incised, ran down the second blade from hilt to point; the king’s sword had only two. Joff’s hilt was a good deal more ornate, the arms of its crossguard done as lions’ paws with ruby claws unsheathed, but both swords had grips of finely tooled red leather and gold lions’ heads for pommels.   Magnificent.  Even in hands as unskilled as Tyrion’s, the blade felt alive.  I have never felt better balance.    It is meant for my son.   No need to ask which son. Tyrion placed Jaime’s sword back on the table beside Joffrey’s, wondering if Robb Stark would let his brother live long enough to wield it. Our father must surely think so, else why have this blade forged?   You have done good work, Master Mott,  Lord Tywin told the armorer.  My steward will see to your payment. And remember, rubies for the scabbards.    I shall, my lord. You are most generous.  The man folded the swords up in the oilcloth, tucked the bundle under one arm, and went to his knee.  It is an honor to serve the King’s Hand. I shall deliver the swords the day before the wedding.    See that you do.   When the guards had seen the armorer out, Tyrion clambered up onto a chair.  So… a sword for Joff, a sword for Jaime, and not even a dagger for the dwarf. Is that the way of it, Father?    The steel was sufficient for two blades, not three. If you have need of a dagger, take one from the armory. Robert left a hundred when he died. Gerion gave him a gilded dagger with an ivory grip and a sapphire pommel for a wedding gift, and half the envoys who came to court tried to curry favor by presenting His Grace with jewel-encrusted knives and silver inlay swords.   Tyrion smiled.  They’d have pleased him more if they’d presented him with their daughters.    No doubt. The only blade he ever used was the hunting knife he had from Jon Arryn, when he was a boy.  Lord Tywin waved a hand, dismissing King Robert and all his knives.  What did you find at the riverfront?    Mud,  said Tyrion,  and a few dead things no one’s bothered to bury. Before we can open the port again, the Blackwater’s going to have to be dredged, the sunken ships broken up or raised."
}