{
  "id": "2b9c90f68eafe6eb7e88f54e33d8c54fd76a1475",
  "text": " Burn it, burn it all.   The last thing Theon Greyjoy saw was Smiler, kicking free of the burning stables with his mane ablaze, screaming, rearing…      TYRION  He dreamed of a cracked stone ceiling and the smells of blood and shit and burnt flesh. The air was full of acrid smoke. Men were groaning and whimpering all around him, and from time to time a scream would pierce the air, thick with pain. When he tried to move, he found that he had fouled his own bedding. The smoke in the air made his eyes water. Am I crying? He must not let his father see. He was a Lannister of Casterly Rock. A lion, I must be a lion, live a lion, die a lion. He hurt so much, though. Too weak to groan, he lay in his own filth and shut his eyes. Nearby someone was cursing the gods in a heavy, monotonous voice. He listened to the blasphemies and wondered if he was dying. After a time the room faded.  He found himself outside the city, walking through a world without color. Ravens soared through a grey sky on wide black wings, while carrion crows rose from their feasts in furious clouds wherever he set his steps. White maggots burrowed through black corruption. The wolves were grey, and so were the silent sisters; together they stripped the flesh from the fallen. There were corpses strewn all over the tourney fields. The sun was a hot white penny, shining down upon the grey river as it rushed around the charred bones of sunken ships. From the pyres of the dead rose black columns of smoke and white-hot ashes. My work, thought Tyrion Lannister. They died at my command.  At first there was no sound in the world, but after a time he began to hear the voices of the dead, soft and terrible. They wept and moaned, they begged for an end to pain, they cried for help and wanted their mothers. Tyrion had never known his mother. He wanted Shae, but she was not there. He walked alone amidst grey shadows, trying to remember…  The silent sisters were stripping the dead men of their armor and clothes. All the bright dyes had leached out from the surcoats of the slain; they were garbed in shades of white and grey, and their blood was black and crusty. He watched their naked bodies lifted by arm and leg, to be carried swinging to the pyres to join their fellows. Metal and cloth were thrown in the back of a white wooden wagon, pulled by two tall black horses.  So many dead, so very many. Their corpses hung limply, their faces slack or stiff or swollen with gas, unrecognizable, hardly human. The garments the sisters took from them were decorated with black hearts, grey lions, dead flowers, and pale ghostly stags. Their armor was all dented and gashed, the chainmail riven, broken, slashed. Why did I kill them all? He had known once, but somehow he had forgotten.  He would have asked one of the silent sisters, but when he tried to speak he found he had no mouth. Smooth seamless skin covered his teeth. The discovery terrified him. How could he live without a mouth? He began to run. The city was not far. He would be safe inside the city, away from all these dead. He did not belong with the dead. He had no mouth, but he was still a living man. No, a lion, a lion, and alive. But when he reached the city walls, the gates were shut against him.  It was dark when he woke again. At first he could see nothing, but after a time the vague outlines of a bed appeared around him. The drapes were drawn, but he could see the shape of carved bedposts, and the droop of the velvet canopy over his head. Under him was the yielding softness of a featherbed, and the pillow beneath his head was goose down. My own bed, I am in my own bed, in my own bedchamber.  It was warm inside the drapes, under the great heap of furs and blankets that covered him. He was sweating. Fever, he thought groggily. He felt so weak, and the pain stabbed through him when he struggled to lift his hand. He gave up the effort. His head felt enormous, as big as the bed, too heavy to raise from the pillow. His body he could scarcely feel at all. How did I come here? He tried to remember. The battle came back in fits and flashes. The fight along the river, the knight who’d offered up his gauntlet, the bridge of ships…  Ser Mandon. He saw the dead empty eyes, the reaching hand, the green fire shining against the white enamel plate. Fear swept over him in a cold rush; beneath the sheets he could feel his bladder letting go. He would have cried out, if he’d had a mouth. No, that was the dream, he thought, his head pounding. Help me, someone help me. Jaime, Shae, Mother, someone… Tysha…  No one heard. No one came. Alone in the dark, he fell back into piss-scented sleep. He dreamed his sister was standing over his bed, with their lord father beside her, frowning. It had to be a dream, since Lord Tywin was a thousand leagues away, fighting Robb Stark in the west. Others came and went as well. Varys looked down on him and sighed, but Littlefinger made a quip. Bloody treacherous bastard, Tyrion thought venomously, we sent you to Bitterbridge and you never came back."
}