{
  "id": "2bc74e5602e5e9185adc731d7ebe2a99df1403b9",
  "text": "  \"- LETTER FROM DUMBLEDORE LAST NIGHT, I THOUGHT YOUR FATHER WOULD DIE OF SHAME, WE DIDN'T BRING YOU UP TO BEHAVE LIKE THIS, YOU AND HARRY COULD BOTH HAVE DIED -\"  Harry had been wondering when his name was going to crop up. He tried very hard to look as though he couldn't hear the voice that was making his eardrums throb.  \"-ABSOLUTELYDISGUSTED - YOUR FATHER'S FACING AN INQUIRY AT WORK, IT'S ENTIRELY YOUR FAULT AND IF YOU PUT ANOTHER TOE OUT OF LINE WE'LL BRING YOU STRAIGHT BACK HOME.\"  A ringing silence fell. The red envelope, which had dropped from Ron's hand, burst into flames and curled into ashes. Harry and Ron sat stunned, as though a tidal wave had just passed over them. A few people laughed and, gradually, a babble of talk broke out again.  Hermione closed Voyages with Vampires and looked down at the top of Ron's head.  * 88  \"Well, I don't know what you expected, Ron, but you -\"  \"Don't tell me I deserved it,\" snapped Ron.  Harry pushed his porridge away. His insides were burning with guilt. Mr. Weasley was facing an inquiry at work. After all Mr. and Mrs. Weasley had done for him over the summer ...  But he had no time to dwell on this; Professor McGonagall was moving along the Gryffindor table, handing out course schedules. Harry took his and saw that they had double Herbology with the Hufepuffs first.  Harry, Ron, and Hermione left the castle together, crossed the vegetable patch, and made for the greenhouses, where the magical plants were kept. At least the Howler had done one good thing: Hermione seemed to think they had now been punished enough and was being perfectly friendly again.  As they neared the greenhouses they saw the rest of the class standing outside, waiting for Professor Sprout. Harry, Ron, and Hermione had only just joined them when she came striding into view across the lawn, accompanied by Gilderoy Lockhart. Professor Sprout's arms were full of bandages, and with another twinge of guilt, Harry spotted the Whomping Willow in the distance, several of its branches now in slings.  Professor Sprout was a squat little witch who wore a patched hat over her flyaway hair; there was usually a large amount of earth on her clothes and her fingernails would have made Aunt Petunia faint. Gilderoy Lockhart, however, was immaculate in sweeping robes of turquoise, his golden hair shining under a perfectly positioned turquoise hat with gold trimming.  \"Oh, hello there!\" he called, beaming around at the assembled  89  students. \"Just been showing Professor Sprout the right way to doctor a Whomping Willow! But I don't want you running away with the idea that I'm better at Herbology than she is! I just happen to have met several of these exotic plants on my travels . . .\"  \"Greenhouse three today, chaps!\" said Professor Sprout, who was looking distinctly disgruntled, not at all her usual cheerful self.  There was a murmur of interest. They had only ever worked in greenhouse one before - greenhouse three housed far more interesting and dangerous plants. Professor Sprout took a large key from her belt and unlocked the door. Harry caught a whiff of damp earth and fertilizer mingling with the heavy perfume of some giant, umbrella- sized flowers dangling from the ceiling. He was about to follow Ron and Hermione inside when Lockhart's hand shot out.  \"Harry! I've been wanting a word - you don't mind if he's a couple of minutes late, do you, Professor Sprout?\"  Judging by Professor Sprout's scowl, she did mind, but Lockhart said, \"That's the ticket,\" and closed the greenhouse door in her face.  \"Harry,\" said Lockhart, his large white teeth gleaming in the sunlight as he shook his head. \"Harry, Harry, Harry.\"  Completely nonplussed, Harry said nothing.  \"When I heard -well, of course, it was all my fault. Could have kicked myself.\"  Harry had no idea what he was talking about. He was about to say so when Lockhart went on, \"Don't know when I've been more shocked. Flying a car to Hogwarts! Well, of course, I knew at once why you'd done it. Stood out a mile. Harry, Harry, Harry.\"  It was remarkable how he could show every one of those brilliant teeth even when he wasn't talking.  90  \"Gave you a taste for publicity, didn't I?\" said Lockhart. \"Gave you the bug. You got onto the front page of the paper with me and you couldn't wait to do it again.\" \"Oh, no, Professor, see -\" \"Harry, Harry, Harry,\" said Lockhart, reaching out and grasping his shoulder. \"I understand. Natural to want a bit more once you've had that first taste - and I blame myself for giving you that, be cause it was bound to go to your head - but see here, young man, you can't start flying cars to try and get yourself noticed. Just calm down, all right? Plenty of time for all that when you're older. Yes, yes, I know what you're thinking! 'It's all right for him, he's an in ternationally famous wizard already!' But when I was twelve, I was just as much of a nobody as you are now. In fact, Id say I was even more of a nobody! I mean, a few people have heard of you, haven't they? All that business with He-\\\"o-Must-Not-Be-Named!\" He glanced at the lightning scar on Harry's forehead."
}