{
  "id": "2c07f27e111675339f3e1a301359794292efffb3",
  "text": " A rift began to grow between Slytherin and the others. Slytherin wished to be more selective about the students admitted to Hogwarts. He believed that magical learning should be kept within all-magic families. He disliked taking students of Muggle parentage, believing them to be untrustworthy. After a while, there was a serious argument on the subject between Slytherin and Gryffindor, and Slytherin left the school.\"  Professor Binns paused again, pursing his lips, looking like a wrinkled old tortoise.  \"Reliable historical sources tell us this much,\" he said. \"But these honest facts have been obscured by the fanciful legend of the Chamber of Secrets. The story goes that Slytherin had built a  *150*  hidden chamber in the castle, of which the other founders knew nothing.  \"Slytherin, according to the legend, sealed the Chamber of Secrets so that none would be able to open it until his own true heir arrived at the school. The heir alone would be able to unseal the Chamber of Secrets, unleash the horror within, and use it to purge the school of all who were unworthy to study magic.\"  There was silence as he finished telling the story, but it wasn't the usual, sleepy silence that filled Professor Binns's classes. There was unease in the air as everyone continued to watch him, hoping for more. Professor Binns looked faintly annoyed.  \"The whole thing is arrant nonsense, of course,\" he said. \"Naturally, the school has been searched for evidence of such a chamber, many times, by the most learned witches and wizards. It does not exist. A tale told to frighten the gullible.\"  Hermione's hand was back in the air.  \"Sir - what exactly do you mean by the `horror within' the Chamber?\"  \"That is believed to be some sort of monster, which the Heir of Slytherin alone can control,\" said Professor Binns in his dry, reedy voice.  The class exchanged nervous looks.  \"I tell you, the thing does not exist,\" said Professor Binns, shuffling his notes. \"There is no Chamber and no monster.\"  \"But, sir,\" said Seamus Finnigan, \"if the Chamber can only be opened by Slytherin's true heir, no one else would be able to find it, would they?\"  \"Nonsense, O'Flaherty,\" said Professor Binns in an aggravated  *151*  tone. \"If a long succession of Hogwarts headmasters and headmistresses haven't found the thing -\"  \"But, Professor,\" piped up Parvati Patil, \"you'd probably have to use Dark Magic to open it -\"  \"Just because a wizard doesn't use Dark Magic doesn't mean he can't, Miss Pennyfeather,\" snapped Professor Binns. \"I repeat, if the likes of Dumbledore -\"  \"But maybe you've got to be related to Slytherin, so Dumbledore couldn't -\" began Dean Thomas, but Professor Binns had had enough.  \"That will do,\" he said sharply. \"It is a myth! It does not exist! There is not a shred of evidence that Slytherin ever built so much as a secret broom cupboard! I regret telling you such a foolish story! We will return, if you please, to history, to solid, believable, verifiable fact!\"  And within five minutes, the class had sunk back into its usual torpor.  \"I always knew Salazar Slytherin was a twisted old loony,\" Ron told Harry and Hermione as they fought their way through the teeming corridors at the end of the lesson to drop off their bags before dinner. \"But I never knew he started all this pure-blood stuff. I wouldn't be in his house if you paid me. Honestly, if the Sorting Hat had tried to put me in Slytherin, I'd've got the train straight back home ......  Hermione nodded fervently, but Harry didn't say anything. His stomach had just dropped unpleasantly.  Harry had never told Ron and Hermione that the Sorting Hat  *152*  had seriously considered putting him in Slytherin. He could remember, as though it were yesterday, the small voice that had spoken in his ear when he'd placed the hat on his head a year before: You could be great, you know, it's all here in your head, and Slytherin would help you on the way to greatness, no doubt about that...  But Harry, who had already heard of Slytherin House's reputa  tion for turning out Dark wizards, had thought desperately, Not Slytherin! and the hat had said, Oh, well, if you're sure ... better be Gryffindor...  As they were shunted along in the throng, Colin Creevy went past.  \"Hiya, Harry!\"  \"Hullo, Colin,\" said Harry automatically.  \"Harry - Harry - a boy in my class has been saying you're  But Colin was so small he couldn~t fight against the tide of people bearing him toward the Great Hall; they heard him squeak, \"See you, Harry!\" and he was gone.  \"What's a boy in his class saying about you?\" Hermione wondered.  \"That I'm Slytherin's heir, I expect,\" said Harry, his stomach dropping another inch or so as he suddenly remembered the way Justin Finch- Fletchley had run away from him at lunchtime.  \"People here'll believe anything,\" said Ron in disgust.  The crowd thinned and they were able to climb the next staircase without difficulty.  \"D'you really think there's a Chamber of Secrets?\" Ron asked Hermione."
}