{
  "id": "2c0951bfa5dcd1185f39ae1e40a606df14b50d81",
  "text": "  \"Gandalf,  dwarves  and Mr. Baggins! We  are  not  together  in  the  house  of  our  friend  and  fellow  conspirator,  this  most  excellent  and  audacious  hobbit-may  the   ####-hair  on  his  toes  never  fall  out!  all  praise  to  his  wine  and  ale!-\"  He  paused  for  breath  and  for  a  polite  remark  from  the  hob-bit,  but  the  compliments were  quite  lost on-poor Bilbo Baggins, who was wagging his mouth in protest at being called  audacious  and worst  of  all  fellow  conspirator,  though  no  noise  came  out,  he was  so flummoxed. So Thorin went on:  \"We  are  met  to  discuss  our  plans,  our  ways,  means,  policy  and  devices.  We  shall soon before the break of day start on our long journey, a journey from which  some  of  us,  or  perhaps  all  of  us  (except  our  friend  and  counsellor,  the  ingenious  wizard Gandalf) may never return. It is a solemn moment. Our object is, I take it,  well known  to us all. To  the estimable Mr. Baggins, and perhaps  to one or  two of  the  younger  dwarves  (I  think  I  should  be  right  in  naming  Kili  and  Fili,  for  instance), the exact situation at the moment may require a little brief explanation-\"  This was  Thorin's  style. He was  an  important  dwarf.  If  he  had  been  allowed,  he  would  probably  have  gone  on  like  this  until  he  was  out  of  breath,  without  telling  any  one  there  'anything  that  was  not  known  already.  But  he  was  rudely  interrupted. Poor Bilbo couldn't bear  it any  longer. At may never  return he began  to feel a shriek coming up  inside, and very soon  it burst out  like  the whistle of an  engine coming out of a tunnel. All the dwarves sprang Bp knocking over the table.  Gandalf struck a blue  light on  the end of his magic staff, and  in  its firework glare  the poor little hobbit could be seen kneeling on the hearth-rug, shaking like a jelly  that was melting. Then he fell flat on  the floor, and kept on calling out  \"struck by  lightning,  struck  by  lightning!\"  over  and  over  again;  and  that  was  all  they  could  get  out  of  him  for  a  long  time.  So  they  took  him  and  laid  him  out  of  the way  on  the drawing-room sofa with a drink at his elbow, and they went back to their dark  business.  \"Excitable  little  fellow,\"  said  Gandalf,  as  they  sat  down  again.  \"Gets  funny  queer  fits,  but  he  is  one  of  the  best,  one  of  the  best-as  fierce  as  a  dragon  in  a  pinch.\"  If  you  have  ever  seen  a  dragon  in  a  pinch,  you will  realize  that  this was  only  poetical  exaggeration  applied  to  any  hobbit,  even  to Old Took's  great-granduncle  Bullroarer, who was so huge (for a hobbit)  that he could ride a horse. He charged  the  ranks  of  the  goblins  of  Mount  Gram  in  the  Battle  of  the  Green  Fields,  and  knocked  their  king  Gol-firnbul's  head  clean  off  with  a  wooden  club.  It  sailed  a  hundred  yards  through  the  air  and  went  down  a  rabbit  hole,  and  in  this  way  the  battle was won and the game of Golf invented at the same moment.  In the meanwhile, however, Bullroarer's gentler descendant was reviving in the  drawing-room.  After  a  while  and  a  drink  he  crept  nervously  to  the  door  of  the   ####-parlour. This is what he heard, Gloin speaking: \"Humph!\" (or some snort more or  less  like  that).  \"Will  he  do,  do  you  think?  It  is  all  very  well  for Gandalf  to  talk  about  this hobbit being  fierce, but one  shriek  like  that  in a moment of excitement  would be enough  to wake  the dragon and all his  relatives, and kill  the  lot of us.  I  think it sounded more like fright than excitement! In fact, if it bad not been for the  sign  on  the  door,  I  should  have  been  sure  we  had  come  to  the  wrong  house.  As  soon  as  I  clapped  eyes  on  the  little  fellow  bobbing  and  puffing  on  the mat,  I  had  my doubts. He looks more like a grocer-than a burglar!\"  Then Mr. Baggins  turned  the handle and went in. The Took side had won. He  suddenly  felt  he would  go without  bed  and  breakfast  to  be  thought  fierce. As  for  little  fellow  bobbing  on  the  mat  it  almost  made  him  really  fierce.  Many  a  time  afterwards  the  Baggins  part  regretted  what  he  did  now,  and  he  said  to  himself:  \"Bilbo, you were a fool; you walked right in and put your foot in it.\"  \"Pardon me,\" he said, \"if I have overheard words that you were saying. I don't  pretend  to  understand  what  you  are  talking  about,  or  your  reference  to  burglars,  but  I  think  I  am  right  in  believing\"  (this  is  what  he  called  being  on  his  dignity)  \"that you  think  I am no good.  I will show you.  I have no signs on my door-it was  painted  a  week  ago-,  and  I  am quite  sure you have  come  to  the wrong house. As  soon as  I  saw  your  funny  faces  on  the  door-step,  I had my doubts. But  treat  it as  the right one. Tell me what you want done, and I will try it, if I have to walk from  here  to  the East of East and fight  the wild Were-worms in the Last Desert."
}