{
  "id": "2c2cf33e97d8f1f564ebc12b10511212dc3db90f",
  "text": "  He can watch over you as you sleep alone in that cold white bed. Until his eyes rot out, that is.    You had best go, Cersei. You’re making me angry.    Oh, an angry cripple. How terrifying.  She laughed.  A pity Lord Tywin Lannister never had a son. I could have been the heir he wanted, but I lacked the cock. And speaking of such, best tuck yours away, brother. It looks rather sad and small, hanging from your breeches like that.   When she was gone Jaime took her advice, fumbling one-handed at his laces. He felt a bone-deep ache in his phantom fingers. I’ve lost a hand, a father, a son, a sister, and a lover, and soon enough I will lose a brother. And yet they keep telling me House Lannister won this war.  Jaime donned his cloak and went downstairs, where he found Ser Boros Blount having a cup of wine in the common room.  When you’re done with your drink, tell Ser Loras I’m ready to see her.   Ser Boros was too much of a coward to do much more than glower.  You are ready to see who?    Just tell Loras.    Aye.  Ser Boros drained his cup.  Aye, Lord Commander.   He took his own good time about it, though, or else the Knight of Flowers proved hard to find. Several hours had passed by the time they arrived, the slim handsome youth and the big ugly maid. Jaime was sitting alone in the round room, leafing idly through the White Book.  Lord Commander,  Ser Loras said,  you wished to see the Maid of Tarth?    I did.  Jaime waved them closer with his left hand.  You have talked with her, I take it?    As you commanded, my lord.    And?   The lad tensed.  I… it may be it happened as she says, ser. That it was Stannis. I cannot be certain.    Varys tells me that the castellan of Storm’s End perished strangely as well,  said Jaime.   Ser Cortnay Penrose,  said Brienne sadly.  A good man.    A stubborn man. One day he stood square in the way of the King of Dragonstone. The next he leapt from a tower.  Jaime stood.  Ser Loras, we will talk more of this later. You may leave Brienne with me.   The wench looked as ugly and awkward as ever, he decided when Tyrell left them. Someone had dressed her in woman’s clothes again, but this dress fit much better than that hideous pink rag the goat had made her wear.  Blue is a good color on you, my lady,  Jaime observed.  It goes well with your eyes.  She does have astonishing eyes.  Brienne glanced down at herself, flustered.  Septa Donyse padded out the bodice, to give it that shape. She said you sent her to me.  She lingered by the door, as if she meant to flee at any second.  You look…    Different?  He managed a half-smile.  More meat on the ribs and fewer lice in my hair, that’s all. The stump’s the same. Close the door and come here.   She did as he bid her.  The white cloak…    …is new, but I’m sure I’ll soil it soon enough.    That wasn’t… I was about to say that it becomes you.   She came closer, hesitant.  Jaime, did you mean what you told Ser Loras? About… about King Renly, and the shadow?   Jaime shrugged.  I would have killed Renly myself if we’d met in battle, what do I care who cut his throat?    You said I had honor…    I’m the bloody Kingslayer, remember? When I say you have honor, that’s like a whore vouchsafing your maidenhood.  He leaned back and looked up at her.  Steelshanks is on his way back north, to deliver Arya Stark to Roose Bolton.    You gave her to him?  she cried, dismayed.  You swore an oath to Lady Catelyn…    With a sword at my throat, but never mind. Lady Catelyn’s dead. I could not give her back her daughters even if I had them. And the girl my father sent with Steelshanks was not Arya Stark.    Not Arya Stark?    You heard me. My lord father found some skinny northern girl more or less the same age with more or less the same coloring. He dressed her up in white and grey, gave her a silver wolf to pin her cloak, and sent her off to wed Bolton’s bastard.  He lifted his stump to point at her.  I wanted to tell you that before you went galloping off to rescue her and got yourself killed for no good purpose. You’re not half bad with a sword, but you’re not good enough to take on two hundred men by yourself.   Brienne shook her head.  When Lord Bolton learns that your father paid him with false coin…    Oh, he knows. Lannisters lie, remember? It makes no matter, this girl serves his purpose just as well. Who is going to say that she isn’t Arya Stark? Everyone the girl was close to is dead except for her sister, who has disappeared.    Why would you tell me all this, if it’s true? You are betraying your father’s secrets.   The Hand’s secrets, he thought. I no longer have a father.  I pay my debts like every good little lion. I did promise Lady Stark her daughters… and one of them is still alive. My brother may know where she is, but if so he isn’t saying. Cersei is convinced that Sansa helped him murder Joffrey.   The wench’s mouth got stubborn.  I will not believe that gentle girl a poisoner. Lady Catelyn said that she had a loving heart. It was your brother."
}