{
  "id": "2c5e51648a9d1e41bc8d2100e4c442abe9c4616b",
  "text": "  There were pigs, last time we come. I bet he’s got hams hid someplace. Smoked and salted hams, and bacon too.    Sausage,  said Dirk.  Them long black ones, they’re like rocks, they keep for years. I bet he’s got a hundred hanging in some cellar.    Oats,  suggested Ollo Lophand.  Corn. Barley.    Corn,  said Mormont’s raven, with a flap of the wings.  Corn, corn, corn, corn, corn.    Enough,  said Lord Commander Mormont over the bird’s raucous calls.  Be quiet, all of you. This is folly.    Apples,  said Garth of Greenaway.  Barrels and barrels of crisp autumn apples. There are apple trees out there, I saw ’em.    Dried berries. Cabbages. Pine nuts.    Corn. Corn. Corn.    Salt mutton. There’s a sheepfold. He’s got casks and casks of mutton laid by, you know he does.   Craster looked fit to spit them all by then. Lord Commander Mormont rose.  Silence. I’ll hear no more such talk.    Then stuff bread in your cars, old man.  Clubfoot Karl pushed back from the table.  Or did you swallow your bloody crumb already?   Sam saw the Old Bear’s face go red.  Have you forgotten who I am? Sit, eat, and be silent. That is a command.   No one spoke. No one moved. All eyes were on the Lord Commander and the big clubfooted ranger, as the two of them stared at each other across the table. It seemed to Sam that Karl broke first, and was about to sit, though sullenly…  …but Craster stood, and his axe was in his hand. The big black steel axe that Mormont had given him as a guest gift.  No,  he growled.  You’ll not sit. No one who calls me niggard will sleep beneath my roof nor eat at my board. Out with you, cripple. And you and you and you.  He jabbed the head of the axe toward Dirk and Garth and Garth in turn.  Go sleep in the cold with empty bellies, the lot o’ you, or…    Bloody bastard!  Sam heard one of the Garths curse. He never saw which one.   Who calls me bastard?  Craster roared, sweeping platter and meat and wine cups from the table with his left hand while lifting the axe with his right.   It’s no more than all men know,  Karl answered.  Craster moved quicker than Sam would have believed possible, vaulting across the table with axe in hand. A woman screamed, Garth Greenaway and Orphan Oss drew knives, Karl stumbled back and tripped over Ser Byam lying wounded on the floor. One instant Craster was coming after him spitting curses. The next he was spitting blood. Dirk had grabbed him by the hair, yanked his head back, and opened his throat ear to ear with one long slash. Then he gave him a rough shove, and the wildling fell forward, crashing face first across Ser Byam. Byam screamed in agony as Craster drowned in his own blood, the axe slipping from his fingers. Two of Craster’s wives were wailing, a third cursed, a fourth flew at Sweet Donnel and tried to scratch his eyes out. He knocked her to the floor. The Lord Commander stood over Craster’s corpse, dark with anger.  The gods will curse us,  he cried.  There is no crime so foul as for a guest to bring murder into a man’s hall. By all the laws of the hearth, we—    There are no laws beyond the Wall, old man. Remember?  Dirk grabbed one of Craster’s wives by the arm, and shoved the point of his bloody dirk up under her chin.  Show us where he keeps the food, or you’ll get the same as he did, woman.    Unhand her.  Mormont took a step.  I’ll have your head for this, you—  Garth of Greenaway blocked his path, and Ollo Lophand yanked him back. They both had blades in hand.  Hold your tongue,  Ollo warned. Instead the Lord Commander grabbed for his dagger. Ollo had only one hand, but that was quick. He twisted free of the old man’s grasp, shoved the knife into Mormont’s belly, and yanked it out again, all red. And then the world went mad.  Later, much later, Sam found himself sitting crosslegged on the floor, with Mormont’s head in his lap. He did not remember how they’d gotten there, or much of anything else that had happened after the Old Bear was stabbed. Garth of Greenaway had killed Garth of Oldtown, he recalled, but not why. Rolley of Sisterton had fallen from the loft and broken his neck after climbing the ladder to have a taste of Craster’s wives. Grenn…  Grenn had shouted and slapped him, and then he’d run away with Giant and Dolorous Edd and some others. Craster still sprawled across Ser Byam, but the wounded knight no longer moaned. Four men in black sat on the bench eating chunks of burned horsemeat while Ollo coupled with a weeping woman on the table.   Tarly.  When he tried to speak, the blood dribbled from the Old Bear’s mouth down into his beard.  Tarly, go. Go.    Where, my lord?  His voice was flat and lifeless. I am not afraid. It was a queer feeling.  There’s no place to go.    The Wall. Make for the Wall. Now.    Now,  squawked the raven.  Now. Now.  The bird walked up the old man’s arm to his chest, and plucked a hair from his beard.   You must. Must tell them.    Tell them what, my lord?  Sam asked politely.   All. The Fist. The wildlings. Dragonglass."
}