{
  "id": "2cc45e66a69a2b180098dc302c1aaf2abfc43d24",
  "text": "   Robb whistled. They heard the faint sound of soft feet on wet leaves. The undergrowth parted, low-hanging branches giving up their accumulation of snow, and Grey Wind and Summer emerged from the green. Summer sniffed the air and growled.   Wolves,  gasped Hali.   Direwolves,  Bran said. Still half-grown, they were as large as any wolf he had ever seen, but the differences were easy to spot, if you knew what to look for. Maester Luwin and Farlen the kennelmaster had taught him. A direwolf had a bigger head and longer legs in proportion to its body, and its snout and jaw were markedly leaner and more pronounced. There was something gaunt and terrible about them as they stood there amid the gently falling snow. Fresh blood spotted Grey Wind’s muzzle.   Dogs,  the big bald man said contemptuously.  Yet I’m told there’s nothing like a wolfskin cloak to warm a man by night.  He made a sharp gesture.  Take them.   Robb shouted,  Winterfell!  and kicked his horse. The gelding plunged down the bank as the ragged men closed. A man with an axe rushed in, shouting and heedless. Robb’s sword caught him full in the face with a sickening crunch and a spray of bright blood. The man with the gaunt stubbly face made a grab for the reins, and for half a second he had them… and then Grey Wind was on him, bearing him down. He fell back into the stream with a splash and a shout, flailing wildly with his knife as his head went under. The direwolf plunged in after him, and the white water turned red where they had vanished.  Robb and Osha matched blows in midstream. Her long spear was a steel-headed serpent, flashing out at his chest, once, twice, three times, but Robb parried every thrust with his longsword, turning the point aside. On the fourth or fifth thrust, the tall woman overextended herself and lost her balance, just for a second. Robb charged, riding her down.  A few feet away, Summer darted in and snapped at Hali. The knife bit at his flank. Summer slid away, snarling, and came rushing in again. This time his jaws closed around her calf. Holding the knife with both hands, the small woman stabbed down, but the direwolf seemed to sense the blade coming. He pulled free for an instant, his mouth full of leather and cloth and bloody flesh. When Hali stumbled and fell, he came at her again, slamming her backward, teeth tearing at her belly.  The sixth man ran from the carnage… but not far. As he went scrambling up the far side of the bank, Grey Wind emerged from the stream, dripping wet. He shook the water off and bounded after the running man, hamstringing him with a single snap of his teeth, and going for the throat as the screaming man slid back down toward the water.  And then there was no one left but the big man, Stiv. He slashed at Bran’s chest strap, grabbed his arm, and yanked. Suddenly Bran was falling. He sprawled on the ground, his legs tangled under him, one foot in the stream. He could not feel the cold of the water, but he felt the steel when Stiv pressed his dagger to his throat.  Back away,  the man warned,  or I’ll open the boy’s windpipe, I swear it.   Robb reined his horse in, breathing hard. The fury went out of his eyes, and his sword arm dropped.  In that moment Bran saw everything. Summer was savaging Hali, pulling glistening blue snakes from her belly. Her eyes were wide and staring. Bran could not tell whether she was alive or dead. The grey stubbly man and the one with the axe lay unmoving, but Osha was on her knees, crawling toward her fallen spear. Grey Wind padded toward her, dripping wet.  Call him off!  the big man shouted.  Call them both off, or the cripple boy dies now!    Grey Wind, Summer, to me,  Robb said.  The direwolves stopped, turned their heads. Grey Wind loped back to Robb. Summer stayed where he was, his eyes on Bran and the man beside him. He growled. His muzzle was wet and red, but his eyes burned.  Osha used the butt end of her spear to lever herself back to her feet. Blood leaked from a wound on the upper arm where Robb had cut her. Bran could see sweat trickling down the big man’s face. Stiv was as scared as he was, he realized.  Starks,  the man muttered,  bloody Starks.  He raised his voice.  Osha, kill the wolves and get his sword.    Kill them yourself,  she replied.  I’ll not be getting near those monsters.   For a moment Stiv was at a loss. His hand trembled; Bran felt a trickle of blood where the knife pressed against his neck. The stench of the man filled his nose; he smelled of fear.  You,  he called out to Robb.  You have a name?    I am Robb Stark, the heir to Winterfell.    This is your brother?    Yes.    You want him alive, you do what I say. Off the horse.   Robb hesitated a moment. Then, slowly and deliberately, he dismounted and stood with his sword in hand.   Now kill the wolves.   Robb did not move.   You do it. The wolves or the boy.    No!  Bran screamed. If Robb did as they asked, Stiv would kill them both anyway, once the direwolves were dead.  The bald man took hold of his hair with his free hand and twisted it cruelly, till Bran sobbed in pain."
}