{
  "id": "2d1ab5496ae0fc696324e8f325cf1064adbe46c8",
  "text": "  The unshaven and the unwashed stared at the riders with dull resentment from behind the line of spears. I like this not one speck, Tyrion thought. Bronn had a score of sellswords scattered through the crowd with orders to stop any trouble before it started. Perhaps Cersei had similarly disposed her Kettleblacks. Somehow Tyrion did not think it would help much. If the fire was too hot, you could hardly keep the pudding from scorching by tossing a handful of raisins in the pot.  They crossed Fishmonger’s Square and rode along Muddy Way before turning onto the narrow, curving Hook to begin their climb up Aegon’s High Hill. A few voices raised a cry of  Joffrey! All hail, all hail!  as the young king rode by, but for every man who picked up the shout, a hundred kept their silence. The Lannisters moved through a sea of ragged men and hungry women, breasting a tide of sullen eyes. Just ahead of him, Cersei was laughing at something Lancel had said, though he suspected her merriment was feigned. She could not be oblivious to the unrest around them, but his sister always believed in putting on the brave show.  Halfway along the route, a wailing woman forced her way between two watchmen and ran out into the street in front of the king and his companions, holding the corpse of her dead baby above her head. It was blue and swollen, grotesque, but the real horror was the mother’s eyes. Joffrey looked for a moment as if he meant to ride her down, but Sansa Stark leaned over and said something to him. The king fumbled in his purse, and flung the woman a silver stag. The coin bounced off the child and rolled away, under the legs of the gold cloaks and into the crowd, where a dozen men began to fight for it. The mother never once blinked. Her skinny arms were trembling from the dead weight of her son.   Leave her, Your Grace,  Cersei called out to the king,  she’s beyond our help, poor thing.   The mother heard her. Somehow the queen’s voice cut through the woman’s ravaged wits. Her slack face twisted in loathing.  Whore!  she shrieked.  Kingslayer’s whore! Brotherfucker!  Her dead child dropped from her arms like a sack of flour as she pointed at Cersei.  Brotherfucker brotherfucker brotherfucker.   Tyrion never saw who threw the dung. He only heard Sansa’s gasp and Joffrey’s bellowed curse, and when he turned his head, the king was wiping brown filth from his cheek. There was more caked in his golden hair and spattered over Sansa’s legs.   Who threw that?  Joffrey screamed. He pushed his fingers into his hair, made a furious face, and flung away another handful of dung.  I want the man who threw that!  he shouted.  A hundred golden dragons to the man who gives him up.    He was up there!  someone shouted from the crowd. The king wheeled his horse in a circle to survey the rooftops and open balconies above them. In the crowd people were pointing, shoving, cursing one another and the king.   Please, Your Grace, let him go,  Sansa pleaded.  The king paid her no heed.  Bring me the man who flung that filth!  Joffrey commanded.  He’ll lick it off me or I’ll have his head. Dog, you bring him here!   Obedient, Sandor Clegane swung down from his saddle, but there was no way through that wall of flesh, let alone to the roof. Those closest to him began to squirm and shove to get away, while others pushed forward to see. Tyrion smelled disaster.  Clegane, leave off, the man is long fled.    I want him!  Joffrey pointed at the roof.  He was up there! Dog, cut through them and bring—   A tumult of sound drowned his last words, a rolling thunder of rage and fear and hatred that engulfed them from all sides.  Bastard!  someone screamed at Joffrey,  bastard monster.  Other voices flung calls of  Whore  and  Brotherfucker  at the queen, while Tyrion was pelted with shouts of  Freak  and  Halfman.  Mixed in with the abuse, he heard a few cries of  Justice  and  Robb, King Robb, the Young Wolf,  of  Stannis!  and even  Renly!  From both sides of the street, the crowd surged against the spear shafts while the gold cloaks struggled to hold the line. Stones and dung and fouler things whistled overhead.  Feed us!  a woman shrieked.  Bread!  boomed a man behind her.  We want bread, bastard!  In a heartbeat, a thousand voices took up the chant. King Joffrey and King Robb and King Stannis were forgotten, and King Bread ruled alone.  Bread,  they clamored.  Bread, bread!   Tyrion spurred to his sister’s side, yelling,  Back to the castle. Now.  Cersei gave a curt nod, and Ser Lancel unsheathed his sword. Ahead of the column, Jacelyn Bywater was roaring commands. His riders lowered their lances and drove forward in a wedge. The king was wheeling his palfrey around in anxious circles while hands reached past the line of gold cloaks, grasping for him. One managed to get hold of his leg, but only for an instant. Ser Mandon’s sword slashed down, parting hand from wrist.  Ride!  Tyrion shouted at his nephew, giving the horse a sharp smack on the rump. The animal reared, trumpeting, and plunged ahead, the press shattering before him."
}