{
  "id": "2d63c428ebe26f57b6e5df4c5123ebf96c6a6001",
  "text": " Nobody bothered them; none of the Gryffindors had anything to say to Harry any more, after all. This was the first night he hadn't been upset by it. Hermione was skimming through all her notes, hoping to come across one of the enchantments they were about to try to break. Harry and Ron didn't talk much. Both of them were thinking about what they were about to do.  Slowly, the room emptied as people drifted off to bed.  \"Better get the cloak,\" Ron muttered, as Lee Jordan finally left, stretching and yawning. Harry ran upstairs to their dark dormitory. He putted out the cloak and then his eyes fell on the flute Hagrid had given him for Christmas. He pocketed it to use on Fluffy -- he didn't feel much like singing.  He ran back down to the common room.  \"We'd better put the cloak on here, and make sure it covers all three of us -- if Filch spots one of our feet wandering along on its own --\"  \"What are you doing?\" said a voice from the corner of the room. Neville appeared from behind an armchair, clutching Trevor the toad, who looked as though he'd been making another bid for freedom.  \"Nothing, Neville, nothing,\" said Harry, hurriedly putting the cloak behind his back.  Neville stared at their guilty faces.  \"You're going out again,\" he said.  \"No, no, no,\" said Hermione. \"No, we're not. Why don't you go to bed, Neville?\"  Harry looked at the grandfather clock by the door. They couldn't afford to waste any more time, Snape might even now be playing Fluffy to sleep.  \"You can't go out,\" said Neville, \"you'll be caught again. Gryffindor will be in even more trouble.\"  \"You don't understand,\" said Harry, \"this is important.\"  But Neville was clearly steeling himself to do something desperate.  I won't let you do it,\" he said, hurrying to stand in front of the portrait hole. \"I'll -- I'll fight you!\"  \"Neville, \"Ron exploded, \"get away from that hole and don't be an idiot --\"  \"Don't you call me an idiot!\" said Neville. I don't think you should be breaking any more rules! And you were the one who told me to stand up to people!\"  \"Yes, but not to us,\" said Ron in exasperation. \"Neville, you don't know what you're doing.\"  He took a step forward and Neville dropped Trevor the toad, who leapt out of sight.  \"Go on then, try and hit me!\" said Neville, raising his fists. \"I'm ready!\"  Harry turned to Hermione.  \"Do something,\" he said desperately.  Hermione stepped forward.  \"Neville,\" she said, \"I'm really, really sorry about this.\"  She raised her wand.  \"Petrificus Totalus!\" she cried, pointing it at Neville.  Neville's arms snapped to his sides. His legs sprang together. His whole body rigid, he swayed where he stood and then fell flat on his face, stiff as a board.  Hermione ran to turn him over. Neville's jaws were jammed together so he couldn't speak. Only his eyes were moving, looking at them in horror.  \"What've you done to him?\" Harry whispered.  \"It's the full Body-Bind,\" said Hermione miserably. \"Oh, Neville, I'm so sorry.\"  \"We had to, Neville, no time to explain,\" said Harry.  \"You'll understand later, Neville,\" said Ron as they stepped over him and pulled on the invisibility cloak.  But leaving Neville lying motionless on the floor didn't feel like a very good omen. In their nervous state, every statue's shadow looked like Filch, every distant breath of wind sounded like Peeves swooping down on them. At the foot of the first set of stairs, they spotted Mrs. Norris skulking near the top.  \"Oh, let's kick her, just this once,\" Ron whispered in Harry's ear, but Harry shook his head. As they climbed carefully around her, Mrs. Norris turned her lamplike eyes on them, but didn't do anything.  They didn't meet anyone else until they reached the staircase up to the third floor. Peeves was bobbing halfway up, loosening the carpet so that people would trip.  \"Who's there?\" he said suddenly as they climbed toward him. He narrowed his wicked black eyes. \"Know you're there, even if I can't see you. Are you ghoulie or ghostie or wee student beastie?\"  He rose up in the air and floated there, squinting at them.  \"Should call Filch, I should, if something's a-creeping around unseen.\"  Harry had a sudden idea.  \"Peeves,\" he said, in a hoarse whisper, \"the Bloody Baron has his own reasons for being invisible.\"  Peeves almost fell out of the air in shock. He caught himself in time and hovered about a foot off the stairs.  \"So sorry, your bloodiness, Mr. Baron, Sir,\" he said greasily. \"My mistake, my mistake -- I didn't see you -- of course I didn't, you're invisible -- forgive old Peevsie his little joke, sir.\"  \"I have business here, Peeves,\" croaked Harry. \"Stay away from this place tonight.\"  \"I will, sir, I most certainly will,\" said Peeves, rising up in the air again. \"Hope your business goes well, Baron, I'll not bother you.\"  And he scooted off  \"Brilliant, Harry!\" whispered Ron.  A few seconds later, they were there, outside the third-floor corridor -- and the door was already ajar.  \"Well, there you are,\" Harry said quietly, \"Snape's already got past Fluffy."
}