{
  "id": "2d9e1146d7c451a6629795dc3e61933c20c74c16",
  "text": " \"I will not be spoken to like that!\"  said Uncle Vernon, trembling with rage. But Harry wasn't going to stand for this.  Gone were the days when he had been forced to take every single one of the Dursleys' stupid rules.  He wasn't following Dudley's diet, and he wasn't going to let Uncle Vernon stop him from going to the Quidditch World Cup, not if he could help it.  Harry took a deep, steadying breath and then said, \"Okay, I can't see the World Cup.  Can I go now, then?  Only I've got a letter to Sirius I want to finish.  You know - my godfather.\" He had done it, he had said the magic words.  Now he watched the purple recede blotchily from Uncle Vernon's face, making it look like badly mixed black currant ice cream. \"You're - you're writing to him, are you?\"  said Uncle Vernon, in a would-be calm voice - but Harry had seen the pupils of his tiny eyes contract with sudden fear. \"Well - yeah,\" said Harry, casually.  \"It's been a while since he heard from me, and, you know, if he doesn't he might start thinking something's wrong.\" He stopped there to enjoy the effect of these words.  He could almost see the cogs working under Uncle Vernon's thick, dark, neatly parted hair.  If he tried to stop Harry writing to Sirius, Sirius would think Harry was being mistreated.  If he told Harry he couldn't go to the Quidditch World Cup, Harry would write and tell Sirius, who would know Harry was being mistreated.  There was only one thing for Uncle Vernon to do.  Harry could see the conclusion forming in his uncle's mind as though the great mustached face were transparent.  Harry tried not to smile, to keep his own face as blank as possible. And then - \"Well, all right then.  You can go to this ruddy ... this stupid ... this World Cup thing. You write and tell these - these Weasleys they're to pick you up, mind.  I haven't got time to go dropping you off all over the country.  And you can spend the rest of the summer there.  And you can tell your - your godfather ... tell him ... tell him you're going.\" \"Okay then,\" said Harry brightly. He turned and walked toward the living room door, fighting the urge to jump into the air and whoop.  He was going ... he was going to the Weasleys', he was going to watch the Quidditch World Cup! Outside in the hall he nearly ran into Dudley, who had been lurking behind the door, clearly hoping to overhear Harry being told off.  He looked shocked to see the broad grin on Harry's face. \"That was an excellent breakfast, wasn't it?\" said Harry.  \"I feel really full, don't you?\" Laughing at the astonished look on Dudley's face, Harry took the stairs three at a time, and hurled himself back into his bedroom. The first thing he saw was that Hedwig was back.  She was sitting in her cage, staring at Harry with her enormous amber eyes, and clicking her beak in the way that meant she was annoyed about something.  Exactly what was annoying her became apparent almost at once. \"OUCH!\" said Harry as what appeared to be a small, gray, feathery tennis ball collided with the side of his head.  Harry massaged the spot furiously, looking up to see what had hit him, and saw a minute owl, small enough to fit into the palm of his hand, whizzing excitedly around the room like a loose firework.  Harry then realized that the owl had dropped a letter at his feet.  Harry bent down, recognized Ron's handwriting, then tore open the envelope.  Inside was a hastily scribbled note.  Harry - DAD GOT THE TICKETS - Ireland versus Bulgaria, Monday night. Mum's writing to the Muggles to ask you to stay.  They might already have the letter, I don't know how fast Muggle post is.  Thought I'd send this with Pig anyway.  Harry stared at the word \"Pig,\" then looked up at the tiny owl now zooming around the light fixture on the ceiling.  He had never seen anything that looked less like a pig.  Maybe he couldn't read Ron's writing.  He went back to the letter:  We're coming for you whether the Muggles like it or not, you can't miss the World Cup, only Mum and Dad reckon it's better if we pretend to ask their permission first.  If they say yes, send Pig back with your answer pronto, and we'll come and get you at five o'clock on Sunday.  If they say no, send Pig back pronto and we'll come and get you at five o'clock on Sunday anyway. Hermione's arriving this afternoon.  Percy's started work - the Department of International Magical Cooperation.  Don't mention anything about Abroad while you're here unless you want the pants bored off you. See you soon - Ron  \"Calm down!\" Harry said as the small owl flew low over his head, twittering madly with what Harry could only assume was pride at having delivered the letter to the right person. \"Come here, I need you to take my answer back!\" The owl fluttered down on top of Hedwig's cage.  Hedwig looked coldly up at it, as though daring it to try and come any closer. Harry seized his eagle-feather quill once more, grabbed a fresh piece of parchment, and wrote:  Ron, it's all okay, the Muggles say I can come."
}