{
  "id": "2e5b2dde45d6f42cc2a94af06672cb6e7286e4e2",
  "text": " Lady Leonette gave her lessons on the high harp, and Lady Janna shared all the choice gossip. Merry Crane always had an amusing story, and little Lady Bulwer reminded her of Arya, though not so fierce.  Closest to Sansa’s own age were the cousins Elinor, Alla, and Megga, Tyrells from junior branches of the House.  Roses from lower on the bush,  quipped Elinor, who was witty and willowy. Megga was round and loud, Alla shy and pretty, but Elinor ruled the three by right of womanhood; she was a maiden flowered, whereas Megga and Alla were mere girls.  The cousins took Sansa into their company as if they had known her all their lives. They spent long afternoons doing needlework and talking over lemon cakes and honeyed wine, played at tiles of an evening, sang together in the castle sept… and often one or two of them would be chosen to share Margaery’s bed, where they would whisper half the night away. Alla had a lovely voice, and when coaxed would play the woodharp and sing songs of chivalry and lost loves. Megga couldn’t sing, but she was mad to be kissed. She and Alla played a kissing game sometimes, she confessed, but it wasn’t the same as kissing a man, much less a king. Sansa wondered what Megga would think about kissing the Hound, as she had. He’d come to her the night of the battle stinking of wine and blood. He kissed me and threatened to kill me, and made me sing him a song.   King Joffrey has such beautiful lips,  Megga gushed, oblivious,  oh, poor Sansa, how your heart must have broken when you lost him. Oh, how you must have wept!   Joffrey made me weep more often than you know, she wanted to say, but Butterbumps was not on hand to drown out her voice, so she pressed her lips together and held her tongue.  As for Elinor, she was promised to a young squire, a son of Lord Ambrose; they would be wed as soon as he won his spurs. He had worn her favor in the Battle of the Blackwater, where he’d slain a Myrish crossbowman and a Mullendore man-at-arms.  Alyn said her favor made him fearless,  said Megga.  He says he shouted her name for his battle cry, isn’t that ever so gallant? Someday I want some champion to wear my favor, and kill a hundred men.  Elinor told her to hush, but looked pleased all the same.  They are children, Sansa thought. They are silly little girls, even Elinor. They’ve never seen a battle, they’ve never seen a man die, they know nothing. Their dreams were full of songs and stories, the way hers had been before Joffrey cut her father’s head off. Sansa pitied them. Sansa envied them.  Margaery was different, though. Sweet and gentle, yet there was a little of her grandmother in her, too. The day before last she’d taken Sansa hawking. It was the first time she had been outside the city since the battle. The dead had been burned or buried, but the Mud Gate was scarred and splintered where Lord Stannis’s rams had battered it, and the hulls of smashed ships could be seen along both sides of the Blackwater, charred masts poking from the shallows like gaunt black fingers. The only traffic was the flat-bottomed ferry that took them across the river, and when they reached the kingswood they found a wilderness of ash and charcoal and dead trees. But the waterfowl teemed in the marshes along the bay, and Sansa’s merlin brought down three ducks while Margaery’s peregrine took a heron in full flight.   Willas has the best birds in the Seven Kingdoms,  Margaery said when the two of them were briefly alone.  He flies an eagle sometimes. You will see, Sansa.  She took her by the hand and gave it a squeeze.  Sister.   Sister. Sansa had once dreamt of having a sister like Margaery; beautiful and gentle, with all the world’s graces at her command. Arya had been entirely unsatisfactory as sisters went. How can I let my sister marry Joffrey? she thought, and suddenly her eyes were full of tears.  Margaery, please,  she said,  you mustn’t.  It was hard to get the words out.  You mustn’t marry him. He’s not like he seems, he’s not. He’ll hurt you.    I shouldn’t think so.  Margaery smiled confidently.  It’s brave of you to warn me, but you need not fear. Joff’s spoiled and vain and I don’t doubt that he’s as cruel as you say, but Father forced him to name Loras to his Kingsguard before he would agree to the match. I shall have the finest knight in the Seven Kingdoms protecting me night and day, as Prince Aemon protected Naerys. So our little lion had best behave, hadn’t he?  She laughed, and said,  Come, sweet sister, let’s race back to the river. It will drive our guards quite mad.  And without waiting for an answer, she put her heels into her horse and flew.  She is so brave, Sansa thought, galloping after her… and yet, her doubts still gnawed at her. Ser Loras was a great knight, all agreed. But Joffrey had other Kingsguard, and gold cloaks and red cloaks besides, and when he was older he would command armies of his own. Aegon the Unworthy had never harmed Queen Naerys, perhaps for fear of their brother the Dragonknight… but when another of his Kingsguard fell in love with one of his mistresses, the king had taken both their heads."
}