{
  "id": "2ebc2f45f3b23528d8833b1a925dd1111d71daf6",
  "text": "  \"Your  own we will  give  back  in  return  for our own.\"  'How came you by it?\" shouted Thorin in gathering rage.  \"I gave it them!\" squeaked Bilbo, who was peeping over the wall, by now, in a  dreadful fright.   ####-\"You!  You!\"  cried  Thorin,  turning  upon  him  and  grasping  him  with  both  hands.  \"You  miserable  hobbit!  You  undersized-burglar!\"  he  shouted  at  a  loss  for  words, and he shook poor Bilbo like a rabbit.  \"By the beard of Durin! I wish I had Gandalf here! Curse him for his choice of  you! May his beard wither! As for you I will throw you to the rocks!\" he cried and  lifted Bilbo in his arms.  \"Stay! Your wish is granted!\" said a voice. The old man with the casket threw  aside  his  hood  and  cloak.  \"Here  is  Gandalf!  And  none  too  soon  it  seems.  If  you  don't  like my Burglar, please don't damage him. Put him down,  and  listen first  to  what he has to say!\"  \"You  all  seem  in  league!\"  said  Thorin  dropping  Bilbo  on  the  top  of  the wall.  \"Never  again will  I  have  dealings with  any wizard  or  his  friends. What  have  you  to say, you descendant of rats?\"  \"Dear  me!  Dear  me!\"  said  Bilbo.  \"I  am  sure  this  is  all  very  uncomfortable.  You may remember saying that I might choose my own fourteenth share? Perhaps  I took it too literally –1 have been told that dwarves are sometimes politer in word  than  in  deed.  The  time  was,  all  the  same,  when  you  seemed  to  think  that  I  had  been of some service. Descendant of rats, indeed! Is this ail the service of you and  your family that I was promised. Thorin? Take it that I have disposed of my share  as I wished, and let it go at that!\"  \"I will,\"  said Thorin  grimly.  \"And  I will  let  you  go  at  that-and may we never  meet again!\" Then he turned and spoke over the wall. \"I am betrayed,\" he said. \"It  was rightly guessed that I could not forbear to redeem the Arkenstone, the treasure  of my house. For it I will give one fourteenth share of the hoard in silver and gold,  setting  aside  the  gems;  but  that  shall  be  accounted  the  promised  share  of  this  traitor, and with that reward he shall depart, and you can divide it as you will. He  will  get  little  enough,  I  doubt  not.  Take  him,  if  you  wish  him  to  live;  and  no  friendship of mine goes with him.  \"Get down now to your friends!\" he said to Bilbo, \"or I will throw you down.\"  \"What about the gold and silver?\" asked Bilbo.  \"That shall follow after, as can be arranged,\" said he.  \"Get down!\"  \"Until then we keep the stone,\" cried Bard.  \"You are not making a very splendid figure as King under the Mountain,\" said  Gandalf. \"But things may change yet.\"   ####-\"They may indeed,\" said Thorin. And already, so strong was the bewilderment  of  the  treasure upon him, he was pondering whether by the help of Dain he might  not recapture the Arkenstone and withhold the share of the reward.  And  so  Bilbo  was  swung  down  from  the  wall,  and  departed  with  nothing  for  all his trouble, except the armour which Thorin had given him already. More than  one of the dwarves 'in their hearts felt shame and pity at his going.  \"Farewell!\" he cried to them. \"We may meet again as friends.\"  \"Be  off!\"  called  Thorin.  \"You  have  mail  upon  you,  which  was  made  by  my  folk,  and  is  too  good  for  you.  It  cannot  be  pierced  .by  arrows;  but  if  you  do  not  hasten, I will sting your miserable feet. So be swift!\"  \"Not so hasty!\" said Bard. \"We will give you until tomorrow. At noon we will  return,  and  see  if  you  have  brought  from  the  hoard  the  portion  that  is  to  be  set  against  the  stone.  If  that  is  done  without  deceit,  then  we  will  depart,  and  the  elf- host will go back to the Forest. In the meanwhile farewell!\"  With  that  they  went  back  to  the  camp;  but  Thorin  sent  messengers  by  Róac  telling Dain of what had passed, and bidding him come with wary speed.  That day passed and the night. The next day the wind shifted west, and the air  was  dark  and  gloomy.  The  morning  was  still  early  when  a  cry  was  heard  in  the  camp.  Runners  came  in  to  report  that  a  host  of  dwarves  had  appeared  round  the  eastern spur of  the Mountain and was now hastening  to Dale. Dain had come. He  had  hurried  on  through  the  night,  and  so  had  come  upon  them  sooner  than  they  had expected. Each one of his folk was clad in a hauberk of steel mail that hung to  his  knees,  and  his  legs were  covered with  hose  of  a  fine  and  flexible metal mesh,  the secret of whose making was possessed by Dain's people.  The  dwarves  are  exceedingly  strong  for  their  height,  but  most  of  these  were  strong  even  for  dwarves.  In  battle  they  wielded  heavy  two-handed mattocks;  but  each of  them had also a  short broad  sword at his  side and a  round  shield  slung at  his  back.  Their  beards  were  forked  and  plaited  and  thrust  into  their  belts."
}