{
  "id": "2ec740fe330d690383cef35393eb0270517ae4e8",
  "text": " By the time he reached the stables, he knew what he must do.  Maester Aemon’s apartments were in a stout wooden keep below the rookery. Aged and frail, the maester shared his chambers with two of the younger stewards, who tended to his needs and helped him in his duties. The brothers joked that he had been given the two ugliest men in the Night’s Watch; being blind, he was spared having to look at them. Clydas was short, bald, and chinless, with small pink eyes like a mole. Chett had a wen on his neck the size of a pigeon’s egg, and a face red with boils and pimples. Perhaps that was why he always seemed so angry.  It was Chett who answered Jon’s knock.  I need to speak to Maester Aemon,  Jon told him.   The maester is abed, as you should be. Come back on the morrow and maybe he’ll see you.  He began to shut the door.  Jon jammed it open with his boot.  I need to speak to him now. The morning will be too late.   Chett scowled.  The maester is not accustomed to being woken in the night. Do you know how old he is?    Old enough to treat visitors with more courtesy than you,  Jon said.  Give him my pardons. I would not disturb his rest if it were not important.    And if I refuse?   Jon had his boot wedged solidly in the door.  I can stand here all night if I must.   The black brother made a disgusted noise and opened the door to admit him.  Wait in the library. There’s wood. Start a fire. I won’t have the maester catching a chill on account of you.   Jon had the logs crackling merrily by the time Chett led in Maester Aemon. The old man was clad in his bed robe, but around his throat was the chain collar of his order. A maester did not remove it even to sleep.  The chair beside the fire would be pleasant,  he said when he felt the warmth on his face. When he was settled comfortably, Chett covered his legs with a fur and went to stand by the door.   I am sorry to have woken you, Maester,  Jon Snow said.   You did not wake me,  Maester Aemon replied.  I find I need less sleep as I grow older, and I am grown very old. I often spend half the night with ghosts, remembering times fifty years past as if they were yesterday. The mystery of a midnight visitor is a welcome diversion. So tell me, Jon Snow, why have you come calling at this strange hour?    To ask that Samwell Tarly be taken from training and accepted as a brother of the Night’s Watch.    This is no concern of Maester Aemon,  Chett complained.   Our Lord Commander has given the training of recruits into the hands of Ser Alliser Thorne,  the maester said gently.  Only he may say when a boy is ready to swear his vow, as you surely know. Why then come to me?    The Lord Commander listens to you,  Jon told him.  And the wounded and the sick of the Night’s Watch are in your charge.    And is your friend Samwell wounded or sick?    He will be,  Jon promised,  unless you help.   He told them all of it, even the part where he’d set Ghost at Rast’s throat. Maester Aemon listened silently, blind eyes fixed on the fire, but Chett’s face darkened with each word.  Without us to keep him safe, Sam will have no chance,  Jon finished.  He’s hopeless with a sword. My sister Arya could tear him apart, and she’s not yet ten. If Ser Alliser makes him fight, it’s only a matter of time before he’s hurt or killed.   Chett could stand no more.  I’ve seen this fat boy in the common hall,  he said.  He is a pig, and a hopeless craven as well, if what you say is true.    Maybe it is so,  Maester Aemon said.  Tell me, Chett, what would you have us do with such a boy?    Leave him where he is,  Chett said.  The Wall is no place for the weak. Let him train until he is ready, no matter how many years that takes. Ser Alliser shall make a man of him or kill him, as the gods will.    That’s stupid,  Jon said. He took a deep breath to gather his thoughts.  I remember once I asked Maester Luwin why he wore a chain around his throat.   Maester Aemon touched his own collar lightly, his bony, wrinkled finger stroking the heavy metal links.  Go on.    He told me that a maester’s collar is made of chain to remind him that he is sworn to serve,  Jon said, remembering.  I asked why each link was a different metal. A silver chain would look much finer with his grey robes, I said. Maester Luwin laughed. A maester forges his chain with study, he told me. The different metals are each a different kind of learning, gold for the study of money and accounts, silver for healing, iron for warcraft. And he said there were other meanings as well. The collar is supposed to remind a maester of the realm he serves, isn’t that so? Lords are gold and knights steel, but two links can’t make a chain. You also need silver and iron and lead, tin and copper and bronze and all the rest, and those are farmers and smiths and merchants and the like. A chain needs all sorts of metals, and a land needs all sorts of people.   Maester Aemon smiled.  And so?    The Night’s Watch needs all sorts too. Why else have rangers and stewards and builders? Lord Randyll couldn’t make Sam a warrior, and Ser Alliser won’t either."
}