{
  "id": "2eda0e04a9cef02aabbcefc9e8ebc09e35beab3e",
  "text": " It wasn’t a bad song, if truth be told. Especially compared to the ones that would be written about him henceforth.  For hands of gold are always cold, but a woman’s hands are warm,  he sang. Perhaps he should write the other verses himself. If he lived so long.  That night, surprisingly, Tyrion Lannister slept long and deep. He rose at first light, well rested and with a hearty appetite, and broke his fast on fried bread, blood sausage, applecakes, and a double helping of eggs cooked with onions and fiery Dornish peppers. Then he begged leave of his guards to attend his champion. Ser Addam gave his consent.  Tyrion found Prince Oberyn drinking a cup of red wine as he donned his armor. He was attended by four of his younger Dornish lordlings.  Good morrow to you, my lord,  the prince said.  Will you take a cup of wine?    Should you be drinking before battle?    I always drink before battle.    That could get you killed. Worse, it could get me killed.   Prince Oberyn laughed.  The gods defend the innocent. You are innocent, I trust?    Only of killing Joffrey,  Tyrion admitted.  I do hope you know what you are about to face. Gregor Clegane is—    —large? So I have heard.    He is almost eight feet tall and must weigh thirty stone, all of it muscle. He fights with a two-handed greatsword, but needs only one hand to wield it. He has been known to cut men in half with a single blow. His armor is so heavy that no lesser man could bear the weight, let alone move in it.   Prince Oberyn was unimpressed.  I have killed large men before. The trick is to get them off their feet. Once they go down, they’re dead.  The Dornishman sounded so blithely confident that Tyrion felt almost reassured, until he turned and said,  Daemon, my spear!  Ser Daemon tossed it to him, and the Red Viper snatched it from the air.   You mean to face the Mountain with a spear?  That made Tyrion uneasy all over again. In battle, ranks of massed spears made for a formidable front, but single combat against a skilled swordsman was a very different matter.   We are fond of spears in Dorne. Besides, it is the only way to counter his reach. Have a look, Lord Imp, but see you do not touch.  The spear was turned ash eight feet long, the shaft smooth, thick, and heavy. The last two feet of that was steel: a slender leaf-shaped spearhead narrowing to a wicked spike. The edges looked sharp enough to shave with. When Oberyn spun the haft between the palms of his hand, they glistened black. Oil? Or poison? Tyrion decided that he would sooner not know.  I hope you are good with that,  he said doubtfully.   You will have no cause for complaint. Though Ser Gregor may. However thick his plate, there will be gaps at the joints. Inside the elbow and knee, beneath the arms… I will find a place to tickle him, I promise you.  He set the spear aside.  It is said that a Lannister always pays his debts. Perhaps you will return to Sunspear with me when the day’s bloodletting is done. My brother Doran would be most pleased to meet the rightful heir to Casterly Rock… especially if he brought his lovely wife, the Lady of Winterfell.   Does the snake think I have Sansa squirreled away somewhere, like a nut I’m hoarding for winter? If so, Tyrion was not about to disabuse him.  A trip to Dorne might be very pleasant, now that I reflect on it.    Plan on a lengthy visit.  Prince Oberyn sipped his wine.  You and Doran have many matters of mutual interest to discuss. Music, trade, history, wine, the dwarf’s penny… the laws of inheritance and succession. No doubt an uncle’s counsel would be of benefit to Queen Myrcella in the trying times ahead.   If Varys had his little birds listening, Oberyn was giving them a ripe earful.  I believe I will have that cup of wine,  said Tyrion. Queen Myrcella? It would have been more tempting if only he did have Sansa tucked beneath his cloak. If she declared for Myrcella over Tommen, would the north follow? What the Red Viper was hinting at was treason. Could Tyrion truly take up arms against Tommen, against his own father? Cersei would spit blood. It might be worth it for that alone.   Do you recall the tale I told you of our first meeting, Imp?  Prince Oberyn asked, as the Bastard of Godsgrace knelt before him to fasten his greaves.  It was not for your tail alone that my sister and I came to Casterly Rock. We were on a quest of sorts. A quest that took us to Starfall, the Arbor, Oldtown, the Shield Islands, Crakehall, and finally Casterly Rock… but our true destination was marriage. Doran was betrothed to Lady Mellario of Norvos, so he had been left behind as castellan of Sunspear. My sister and I were yet unpromised.   Elia found it all exciting. She was of that age, and her delicate health had never permitted her much travel. I preferred to amuse myself by mocking my sister’s suitors. There was Little Lord Lazyeye, Squire Squishlips, one I named the Whale That Walks, that sort of thing. The only one who was even halfway presentable was young Baelor Hightower."
}