{
  "id": "2eeb0883de025b0ac80623d05da921c302511047",
  "text": " No men in the Seven Kingdoms are as bold and true as the knights of the Vale. Would that I could grant you all this honor. Yet I can choose only one.  She gestured.  Ser Vardis Egen, you were ever my lord husband’s good right hand. You shall be our champion.   Ser Vardis had been singularly silent.  My lady,  he said gravely, sinking to one knee,  pray give this burden to another, I have no taste for it. The man is no warrior. Look at him. A dwarf, half my size and lame in the legs. It would be shameful to slaughter such a man and call it justice.   Oh, excellent, Tyrion thought.  I agree.   Lysa glared at him.  You demanded a trial by combat.    And now I demand a champion, such as you have chosen for yourself. My brother Jaime will gladly take my part, I know.    Your precious Kingslayer is hundreds of leagues from here,  snapped Lysa Arryn.   Send a bird for him. I will gladly await his arrival.    You will face Ser Vardis on the morrow.    Singer,  Tyrion said, turning to Marillion,  when you make a ballad of this, be certain you tell them how Lady Arryn denied the dwarf the right to a champion, and sent him forth lame and bruised and hobbling to face her finest knight.    I deny you nothing!  Lysa Arryn said, her voice peeved and shrill with irritation.  Name your champion, Imp… if you think you can find a man to die for you.    If it is all the same to you, I’d sooner find one to kill for me.  Tyrion looked over the long hall. No one moved. For a long moment he wondered if it had all been a colossal blunder.  Then there was a stirring in the rear of the chamber.  I’ll stand for the dwarf,  Bronn called out.      EDDARD  He dreamt an old dream, of three knights in white cloaks, and a tower long fallen, and Lyanna in her bed of blood.  In the dream his friends rode with him, as they had in life. Proud Martyn Cassel, Jory’s father; faithful Theo Wull; Ethan Glover, who had been Brandon’s squire; Ser Mark Ryswell, soft of speech and gentle of heart; the crannogman, Howland Reed; Lord Dustin on his great red stallion. Ned had known their faces as well as he knew his own once, but the years leech at a man’s memories, even those he has vowed never to forget. In the dream they were only shadows, grey wraiths on horses made of mist.  They were seven, facing three. In the dream as it had been in life. Yet these were no ordinary three. They waited before the round tower, the red mountains of Dorne at their backs, their white cloaks blowing in the wind. And these were no shadows; their faces burned clear, even now. Ser Arthur Dayne, the Sword of the Morning, had a sad smile on his lips. The hilt of the greatsword Dawn poked up over his right shoulder. Ser Oswell Whent was on one knee, sharpening his blade with a whetstone. Across his white-enameled helm, the black bat of his House spread its wings. Between them stood fierce old Ser Gerold Hightower, the White Bull, Lord Commander of the Kingsguard.   I looked for you on the Trident,  Ned said to them.   We were not there,  Ser Gerold answered.   Woe to the Usurper if we had been,  said Ser Oswell.   When King’s Landing fell, Ser Jaime slew your king with a golden sword, and I wondered where you were.    Far away,  Ser Gerold said,  or Aerys would yet sit the Iron Throne, and our false brother would burn in seven hells.    I came down on Storm’s End to lift the siege,  Ned told them,  and the Lords Tyrell and Redwyne dipped their banners, and all their knights bent the knee to pledge us fealty. I was certain you would be among them.    Our knees do not bend easily,  said Ser Arthur Dayne.   Ser Willem Darry is fled to Dragonstone, with your queen and Prince Viserys. I thought you might have sailed with him.    Ser Willem is a good man and true,  said Ser Oswell.   But not of the Kingsguard,  Ser Gerold pointed out.  The Kingsguard does not flee.    Then or now,  said Ser Arthur. He donned his helm.   We swore a vow,  explained old Ser Gerold.  Ned’s wraiths moved up beside him, with shadow swords in hand. They were seven against three.   And now it begins,  said Ser Arthur Dayne, the Sword of the Morning. He unsheathed Dawn and held it with both hands. The blade was pale as milkglass, alive with light.   No,  Ned said with sadness in his voice.  Now it ends.  As they came together in a rush of steel and shadow, he could hear Lyanna screaming.  Eddard!  she called. A storm of rose petals blew across a blood-streaked sky, as blue as the eyes of death.   Lord Eddard,  Lyanna called again.   I promise,  he whispered.  Lya, I promise…    Lord Eddard,  a man echoed from the dark.  Groaning, Eddard Stark opened his eyes. Moonlight streamed through the tall windows of the Tower of the Hand.   Lord Eddard?  A shadow stood over the bed.   How… how long?  The sheets were tangled, his leg splinted and plastered. A dull throb of pain shot up his side.   Six days and seven nights.  The voice was Vayon Poole’s. The steward held a cup to Ned’s lips.  Drink, my lord.    What…?    Only water."
}