{
  "id": "2f00e66f8fb9dfb8e25d8b34107328886d85226b",
  "text": " It was enough to weary even a strong man, and the Lord Jon was not young. Small wonder if he seemed melancholy and tired. Or so I thought at the time. Yet now I am less certain.  He gave a ponderous shake of his head.   What can you tell me of his final illness?   The Grand Maester spread his hands in a gesture of helpless sorrow.  He came to me one day asking after a certain book, as hale and healthy as ever, though it did seem to me that something was troubling him deeply. The next morning he was twisted over in pain, too sick to rise from bed. Maester Colemon thought it was a chill on the stomach. The weather had been hot, and the Hand often iced his wine, which can upset the digestion. When Lord Jon continued to weaken, I went to him myself, but the gods did not grant me the power to save him.    I have heard that you sent Maester Colemon away.   The Grand Maester’s nod was as slow and deliberate as a glacier.  I did, and I fear the Lady Lysa will never forgive me that. Maybe I was wrong, but at the time I thought it best. Maester Colemon is like a son to me, and I yield to none in my esteem for his abilities, but he is young, and the young ofttimes do not comprehend the frailty of an older body. He was purging Lord Arryn with wasting potions and pepper juice, and I feared he might kill him.    Did Lord Arryn say anything to you during his final hours?   Pycelle wrinkled his brow.  In the last stage of his fever, the Hand called out the name Robert several times, but whether he was asking for his son or for the king I could not say. Lady Lysa would not permit the boy to enter the sickroom, for fear that he too might be taken ill. The king did come, and he sat beside the bed for hours, talking and joking of times long past in hopes of raising Lord Jon’s spirits. His love was fierce to see.    Was there nothing else? No final words?    When I saw that all hope had fled, I gave the Hand the milk of the poppy, so he should not suffer. Just before he closed his eyes for the last time, he whispered something to the king and his lady wife, a blessing for his son. The seed is strong, he said. At the end, his speech was too slurred to comprehend. Death did not come until the next morning, but Lord Jon was at peace after that. He never spoke again.   Ned took another swallow of milk, trying not to gag on the sweetness of it.  Did it seem to you that there was anything unnatural about Lord Arryn’s death?    Unnatural?  The aged maester’s voice was thin as a whisper.  No, I could not say so. Sad, for a certainty. Yet in its own way, death is the most natural thing of all, Lord Eddard. Jon Arryn rests easy now, his burdens lifted at last.    This illness that took him,  said Ned.  Had you ever seen its like before, in other men?    Near forty years I have been Grand Maester of the Seven Kingdoms,  Pycelle replied.  Under our good King Robert, and Aerys Targaryen before him, and his father Jaehaerys the Second before him, and even for a few short months under Jaehaerys’s father, Aegon the Fortunate, the Fifth of His Name. I have seen more of illness than I care to remember, my lord. I will tell you this: Every case is different, and every case is alike. Lord Jon’s death was no stranger than any other.    His wife thought otherwise.   The Grand Maester nodded.  I recall now, the widow is sister to your own noble wife. If an old man may be forgiven his blunt speech, let me say that grief can derange even the strongest and most disciplined of minds, and the Lady Lysa was never that. Since her last stillbirth, she has seen enemies in every shadow, and the death of her lord husband left her shattered and lost.    So you are quite certain that Jon Arryn died of a sudden illness?    I am,  Pycelle replied gravely.  If not illness, my good lord, what else could it be?    Poison,  Ned suggested quietly.  Pycelle’s sleepy eyes flicked open. The aged maester shifted uncomfortably in his seat.  A disturbing thought. We are not the Free Cities, where such things are common. Grand Maester Aethelmure wrote that all men carry murder in their hearts, yet even so, the poisoner is beneath contempt.  He fell silent for a moment, his eyes lost in thought.  What you suggest is possible, my lord, yet I do not think it likely. Every hedge maester knows the common poisons, and Lord Arryn displayed none of the signs. And the Hand was loved by all. What sort of monster in man’s flesh would dare to murder such a noble lord?    I have heard it said that poison is a woman’s weapon.   Pycelle stroked his beard thoughtfully.  It is said. Women, cravens… and eunuchs.  He cleared his throat and spat a thick glob of phelm onto the rushes. Above them, a raven cawed loudly in the rookery.  The Lord Varys was born a slave in Lys, did you know? Put not your trust in spiders, my lord.   That was scarcely anything Ned needed to be told; there was something about Varys that made his flesh crawl.  I will remember that, Maester. And I thank you for your help. I have taken enough of your time."
}