{
  "id": "2f096ec939e321658b63694eef7da91ed93932c4",
  "text": "  By the end the wench’s face was as swollen and bloody as Jaime’s must have been, and they had knocked out two of her teeth. It did nothing to improve her appearance. Stumbling and bleeding, the two captives were dragged back through the woods to the horses, Brienne limping from the thigh wound he’d given her in the brook. Jaime felt sorry for her. She would lose her maidenhood tonight, he had no doubt. That noseless bastard would have her for a certainty, and some of the others would likely take a turn.  The Dornishman bound them back to back atop Brienne’s plow horse while the other Mummers were stripping Cleos Frey to his skin to divvy up his possessions. Rorge won the bloodstained surcoat with its proud Lannister and Frey quarterings. The arrows had punched holes through lions and towers alike.   I hope you’re pleased, wench,  Jaime whispered at Brienne. He coughed, and spat out a mouthful of blood.  If you’d armed me, we’d never have been taken.  She made no answer. There’s a pig-stubborn bitch, he thought. But brave, yes. He could not take that from her.  When we make camp for the night, you’ll be raped, and more than once,  he warned her.  You’d be wise not to resist. If you fight them, you’ll lose more than a few teeth.   He felt Brienne’s back stiffen against his.  Is that what you would do, if you were a woman?   If I were a woman I’d be Cersei.  If I were a woman, I’d make them kill me. But I’m not.  Jaime kicked their horse to a trot.  Urswyck! A word!   The cadaverous sellsword in the ragged leather cloak reined up a moment, then fell in beside him.  What would you have of me, ser? And mind your tongue, or I’ll chastise you again.    Gold,  said Jaime.  You do like gold?   Urswyck studied him through reddened eyes.  It has its uses, I do confess.   Jaime gave Urswyck a knowing smile.  All the gold in Casterly Rock. Why let the goat enjoy it? Why not take us to King’s Landing, and collect my ransom for yourself? Hers as well, if you like. Tarth is called the Sapphire Isle, a maiden told me once.  The wench squirmed at that, but said nothing.   Do you take me for a turncloak?    Certainly. What else?   For half a heartbeat Urswyck considered the proposition.  King’s Landing is a long way, and your father is there. Lord Tywin may resent us for selling Harrenhal to Lord Bolton.   He’s cleverer than he looks. Jaime had been been looking forward to hanging the wretch while his pockets bulged with gold.  Leave me to deal with my father. I’ll get you a royal pardon for any crimes you have committed. I’ll get you a knighthood.    Ser Urswyck,  the man said, savoring the sound.  How proud my dear wife would be to hear it. If only I hadn’t killed her.  He sighed.  And what of brave Lord Vargo?    Shall I sing you a verse of ‘The Rains of Castamere’? The goat won’t be quite so brave when my father gets hold of him.    And how will he do that? Are your father’s arms so long that they can reach over the walls of Harrenhal and pluck us out?    If need be.  King Harren’s monstrous folly had fallen before, and it could fall again.  Are you such a fool as to think the goat can outfight the lion?   Urswyck leaned over and slapped him lazily across the face. The sheer casual insolence of it was worse than the blow itself. He does not fear me, Jaime realized, with a chill.  I have heard enough, Kingslayer. I would have to be a great fool indeed to believe the promises of an oathbreaker like you.  He kicked his horse and galloped smartly ahead.  Aerys, Jaime thought resentfully. It always turns on Aerys. He swayed with the motion of his horse, wishing for a sword. Two swords would be even better. One for the wench and one for me. We’d die, but we’d take half of them down to hell with us.  Why did you tell him Tarth was the Sapphire Isle?  Brienne whispered when Urswyck was out of earshot.  He’s like to think my father’s rich in gemstones…    You best pray he does.    Is every word you say a lie, Kingslayer? Tarth is called the Sapphire Isle for the blue of its waters.    Shout it a little louder, wench, I don’t think Urswyck heard you. The sooner they know how little you’re worth in ransom, the sooner the rapes begin. Every man here will mount you, but what do you care? Just close your eyes, open your legs, and pretend they’re all Lord Renly.   Mercifully, that shut her mouth for a time.  The day was almost done by the time they found Vargo Hoat, sacking a small sept with another dozen of his Brave Companions. The leaded windows had been smashed, the carved wooden gods dragged out into the sunlight. The fattest Dothraki Jaime had ever seen was sitting on the Mother’s chest when they rode up, prying out her chalcedony eyes with the point of his knife. Nearby, a skinny balding septon hung upside down from the limb of a spreading chestnut tree. Three of the Brave Companions were using his corpse for an archery butt. One of them must have been good; the dead man had arrows through both of his eyes.  When the sellswords spied Urswyck and the captives, a cry went up in half a dozen tongues."
}