{
  "id": "2f13cc84defb4f94e4474d56897f7b0796fc2464",
  "text": "  Gods be damned, look at them all, Tyrion thought, though he knew his father had more men on the field. Their captains led them on armored warhorses, standard-bearers riding alongside with their banners. He glimpsed the bull moose of the Hornwoods, the Karstark sunburst, Lord Cerwyn’s battle-axe, and the mailed fist of the Glovers… and the twin towers of Frey, blue on grey. So much for his father’s certainty that Lord Walder would not bestir himself. The white of House Stark was seen everywhere, the grey direwolves seeming to run and leap as the banners swirled and streamed from the high staffs. Where is the boy? Tyrion wondered.  A warhorn blew. Haroooooooooooooooooooooooo, it cried, its voice as long and low and chilling as a cold wind from the north. The Lannister trumpets answered, da-DA da-DA da-DAAAAAAAAA, brazen and defiant, yet it seemed to Tyrion that they sounded somehow smaller, more anxious. He could feel a fluttering in his bowels, a queasy liquid feeling; he hoped he was not going to die sick.  As the horns died away, a hissing filled the air; a vast flight of arrows arched up from his right, where the archers stood flanking the road. The northerners broke into a run, shouting as they came, but the Lannister arrows fell on them like hail, hundreds of arrows, thousands, and shouts turned to screams as men stumbled and went down. By then a second flight was in the air, and the archers were fitting a third arrow to their bowstrings.  The trumpets blared again, da-DAAA da-DAAA da-DA da-DA da-DAAAAAAA. Ser Gregor waved his huge sword and bellowed a command, and a thousand other voices screamed back at him. Tyrion put his spurs to his horse and added one more voice to the cacophony, and the van surged forward.  The river!  he shouted at his clansmen as they rode.  Remember, hew to the river.  He was still leading when they broke a canter, until Chella gave a bloodcurdling shriek and galloped past him, and Shagga howled and followed. The clansmen charged after them, leaving Tyrion in their dust.  A crescent of enemy spearmen had formed ahead, a double hedgehog bristling with steel, waiting behind tall oaken shields marked with the sunburst of Karstark. Gregor Clegane was the first to reach them, leading a wedge of armored veterans. Half the horses shied at the last second, breaking their charge before the row of spears. The others died, sharp steel points ripping through their chests. Tyrion saw a dozen men go down. The Mountain’s stallion reared, lashing out with iron-shod hooves as a barbed spearhead raked across his neck. Maddened, the beast lunged into the ranks. Spears thrust at him from every side, but the shield wall broke beneath his weight. The northerners stumbled away from the animal’s death throes. As his horse fell, snorting blood and biting with his last red breath, the Mountain rose untouched, laying about him with his two-handed greatsword.  Shagga went bursting through the gap before the shields could close, other Stone Crows hard behind him. Tyrion shouted,  Burned Men! Moon Brothers! After me!  but most of them were ahead of him. He glimpsed Timett son of Timett vault free as his mount died under him in full stride, saw a Moon Brother impaled on a Karstark spear, watched Conn’s horse shatter a man’s ribs with a kick. A flight of arrows descended on them; where they came from he could not say, but they fell on Stark and Lannister alike, rattling off armor or finding flesh. Tyrion lifted his shield and hid beneath it.  The hedgehog was crumbling, the northerners reeling back under the impact of the mounted assault. Tyrion saw Shagga catch a spearman full in the chest as the fool came on at a run, saw his axe shear through mail and leather and muscle and lungs. The man was dead on his feet, the axehead lodged in his breast, yet Shagga rode on, cleaving a shield in two with his left-hand battle-axe while the corpse was bouncing and stumbling bonelessly along on his right. Finally the dead man slid off. Shagga smashed the two axes together and roared.  By then the enemy was on him, and Tyrion’s battle shrunk to the few feet of ground around his horse. A man-at-arms thrust at his chest and his axe lashed out, knocking the spear aside. The man danced back for another try, but Tyrion spurred his horse and rode right over him. Bronn was surrounded by three foes, but he lopped the head off the first spear that came at him, and raked his blade across a second man’s face on his backslash.  A thrown spear came hurtling at Tyrion from the left and lodged in his shield with a woody chunk. He wheeled and raced after the thrower, but the man raised his own shield over his head. Tyrion circled around him, raining axe blows down on the wood. Chips of oak went flying, until the northerner lost his feet and slipped, failing flat on his back with his shield on top of him. He was below the reach of Tyrion’s axe and it was too much bother to dismount, so he left him there and rode after another man, taking him from behind with a sweeping downcut that sent a jolt of impact up his arm."
}