{
  "id": "2f15caf8ef09f4618ffc7912639c7a1c10a656f0",
  "text": "  Mott looked fretful.  You saw the boy. Such a strong boy. Those hands of his, those hands were made for hammers. He had such promise, I took him on without a fee.    The truth now,  Ned urged.  The streets are full of strong boys. The day you take on an apprentice without a fee will be the day the Wall comes down. Who paid for him?    A lord,  the master said reluctantly.  He gave no name, and wore no sigil on his coat. He paid in gold, twice the customary sum, and said he was paying once for the boy, and once for my silence.    Describe him.    He was stout, round of shoulder, not so tall as you. Brown beard, but there was a bit of red in it, I’ll swear. He wore a rich cloak, that I do remember, heavy purple velvet worked with silver threads, but the hood shadowed his face and I never did see him clear.  He hesitated a moment.  My lord, I want no trouble.    None of us wants trouble, but I fear these are troubled times, Master Mott,  Ned said.  You know who the boy is.    I am only an armorer, my lord. I know what I’m told.    You know who the boy is,  Ned repeated patiently.  That is not a question.    The boy is my apprentice,  the master said. He looked Ned in the eye, stubborn as old iron.  Who he was before he came to me, that’s none of my concern.   Ned nodded. He decided that he liked Tobho Mott, master armorer.  If the day ever comes when Gendry would rather wield a sword than forge one, send him to me. He has the look of a warrior. Until then, you have my thanks, Master Mott, and my promise. Should I ever want a helm to frighten children, this will be the first place I visit.   His guard was waiting outside with the horses.  Did you find anything, my lord?  Jacks asked as Ned mounted up.   I did,  Ned told him, wondering. What had Jon Arryn wanted with a king’s bastard, and why was it worth his life?      CATELYN   My lady, you ought cover your head,  Ser Rodrik told her as their horses plodded north.  You will take a chill.    It is only water, Ser Rodrik,  Catelyn replied. Her hair hung wet and heavy, a loose strand stuck to her forehead, and she could imagine how ragged and wild she must look, but for once she did not care. The southern rain was soft and warm. Catelyn liked the feel of it on her face, gentle as a mother’s kisses. It took her back to her childhood, to long grey days at Riverrun. She remembered the godswood, drooping branches heavy with moisture, and the sound of her brother’s laughter as he chased her through piles of damp leaves. She remembered making mud pies with Lysa, the weight of them, the mud slick and brown between her fingers. They had served them to Littlefinger, giggling, and he’d eaten so much mud he was sick for a week. How young they all had been.  Catelyn had almost forgotten. In the north, the rain fell cold and hard, and sometimes at night it turned to ice. It was as likely to kill a crop as nurture it, and it sent grown men running for the nearest shelter. That was no rain for little girls to play in.   I am soaked through,  Ser Rodrik complained.  Even my bones are wet.  The woods pressed close around them, and the steady pattering of rain on leaves was accompanied by the small sucking sounds their horses made as their hooves pulled free of the mud.  We will want a fire tonight, my lady, and a hot meal would serve us both.    There is an inn at the crossroads up ahead,  Catelyn told him. She had slept many a night there in her youth, traveling with her father. Lord Hoster Tully had been a restless man in his prime, always riding somewhere. She still remembered the innkeep, a fat woman named Masha Heddle who chewed sourleaf night and day and seemed to have an endless supply of smiles and sweet cakes for the children. The sweet cakes had been soaked with honey, rich and heavy on the tongue, but how Catelyn had dreaded those smiles. The sourleaf had stained Masha’s teeth a dark red, and made her smile a bloody horror.   An inn,  Ser Rodrik repeated wistfully.  If only… but we dare not risk it. If we wish to remain unknown, I think it best we seek out some small holdfast…  He broke off as they heard sounds up the road; splashing water, the clink of mail, a horse’s whinny.  Riders,  he warned, his hand dropping to the hilt of his sword. Even on the kingsroad, it never hurt to be wary.  They followed the sounds around a lazy bend of the road and saw them; a column of armed men noisily fording a swollen stream. Catelyn reined up to let them pass. The banner in the hand of the foremost rider hung sodden and limp, but the guardsmen wore indigo cloaks and on their shoulders flew the silver eagle of Seagard.  Mallisters,  Ser Rodrik whispered to her, as if she had not known.  My lady, best pull up your hood.   Catelyn made no move. Lord Jason Mallister himself rode with them, surrounded by his knights, his son Patrek by his side and their squires close behind. They were riding for King’s Landing and the Hand’s tourney, she knew. For the past week, the travelers had been thick as flies upon the kingsroad; knights and freeriders, singers with their harps and drums, heavy wagons laden with hops or corn or casks of honey, traders and craftsmen and whores, and all of them moving south."
}