{
  "id": "2f49603bc98a3355c9d343ecccd6136d9aca20a6",
  "text": "    Nice, though. A nice oak tree.  He stepped closer, and sniffed at her.  You even smell nice for a change.    You don’t. You stink.  Arya shoved him back against the anvil and made to run, but Gendry caught her arm. She stuck a foot between his legs and tripped him, but he yanked her down with him, and they rolled across the floor of the smithy. He was very strong, but she was quicker. Every time he tried to hold her still she wriggled free and punched him. Gendry only laughed at the blows, which made her mad. He finally caught both her wrists in one hand and started to tickle her with the other, so Arya slammed her knee between his legs, and wrenched free. Both of them were covered in dirt, and one sleeve was torn on her stupid acorn dress.  I bet I don’t look so nice now,  she shouted.  Tom was singing when they returned to the hall.      My featherbed is deep and soft,  and there I’ll lay you down,  I’ll dress you all in yellow silk,  and on your head a crown.  For you shall be my lady love,  and I shall be your lord.  I’ll always keep you warm and safe,  and guard you with my sword.      Harwin took one look at them and burst out laughing, and Anguy smiled one of his stupid freckly smiles and said,  Are we certain this one is a highborn lady?  But Lem Lemoncloak gave Gendry a clout alongside the head.  You want to fight, fight with me! She’s a girl, and half your age! You keep your hands off o’ her, you hear me?    I started it,  said Arya.  Gendry was just talking.    Leave the boy, Lem,  said Harwin.  Arya did start it, I have no doubt. She was much the same at Winterfell.   Tom winked at her as he sang:      And how she smiled and how she laughed,  the maiden of the tree.  She spun away and said to him,  no featherbed for me.  I’ll wear a gown of golden leaves,  and bind my hair with grass,  But you can be my forest love,  and me your forest lass.       I have no gowns of leaves,  said Lady Smallwood with a small fond smile,  but Carellen left some other dresses that might serve. Come, child, let us go upstairs and see what we can find.   It was even worse than before; Lady Smallwood insisted that Arya take another bath, and cut and comb her hair besides; the dress she put her in this time was sort of lilac-colored, and decorated with little baby pearls. The only good thing about it was that it was so delicate that no one could expect her to ride in it. So the next morning as they broke their fast, Lady Smallwood gave her breeches, belt, and tunic to wear, and a brown doeskin jerkin dotted with iron studs.  They were my son’s things,  she said.  He died when he was seven.    I’m sorry, my lady.  Arya suddenly felt bad for her, and ashamed.  I’m sorry I tore the acorn dress too. It was pretty.    Yes, child. And so are you. Be brave.       Daenerys   In the center of the Plaza of Pride stood a red brick fountain whose waters smelled of brimstone, and in the center of the fountain a monstrous harpy made of hammered bronze. Twenty feet tall she reared. She had a woman’s face, with gilded hair, ivory eyes, and pointed ivory teeth. Water gushed yellow from her heavy breasts. But in place of arms she had the wings of a bat or a dragon, her legs were the legs of an eagle, and behind she wore a scorpion’s curled and venomous tail.  The harpy of Ghis, Dany thought. Old Ghis had fallen five thousand years ago, if she remembered true; its legions shattered by the might of young Valyria, its brick walls pulled down, its streets and buildings turned to ash and cinder by dragonflame, its very fields sown with salt, sulfur, and skulls. The gods of Ghis were dead, and so too its people; these Astapori were mongrels, Ser Jorah said. Even the Ghiscari tongue was largely forgotten; the slave cities spoke the High Valyrian of their conquerors, or what they had made of it.  Yet the symbol of the Old Empire still endured here, though this bronze monster had a heavy chain dangling from her talons, an open manacle at either end. The harpy of Ghis had a thunderbolt in her claws. This is the harpy of Astapor.   Tell the Westerosi whore to lower her eyes,  the slaver Kraznys mo Nakloz complained to the slave girl who spoke for him.  I deal in meat, not metal. The bronze is not for sale. Tell her to look at the soldiers. Even the dim purple eyes of a sunset savage can see how magnificent my creatures are, surely.   Kraznys’s High Valyrian was twisted and thickened by the characteristic growl of Ghis, and flavored here and there with words of slaver argot. Dany understood him well enough, but she smiled and looked blankly at the slave girl, as if wondering what he might have said.   The Good Master Kraznys asks, are they not magnificent?  The girl spoke the Common Tongue well, for one who had never been to Westeros. No older than ten, she had the round flat face, dusky skin, and golden eyes of Naath. The Peaceful People, her folk were called. All agreed that they made the best slaves.   They might be adequate to my needs,  Dany answered."
}