{
  "id": "2f7ce989935d1b5f341c5bf2d2aed023fde38117",
  "text": "  \"What were you doing, Percy?\" said Ron, grinning. \"Go on, tell us, we won't laugh.\"  Percy didn't smile back.  \"Pass me those rolls, Harry, I'm starving.\"  Harry knew the whole mystery might be solved tomorrow without their help, but he wasn't about to pass up a chance to speak to Myrtle if it turned up - and to his delight it did, midmorning, when they were being led to History of Magic by Gilderoy Lockhart.  Lockhart, who had so often assured them that all danger had passed, only to be proved wrong right away, was now wholeheartedly convinced that it was hardly worth the trouble to see them safely down the corridors. His hair wasn't as sleek as usual; it seemed he had been up most of the night, patrolling the fourth floor.  \"Mark my words,\" he said, ushering them around a corner. \"The first words out of those poor Petrified people's mouths will be It was Hagrid.' Frankly, I'm astounded Professor McGonagall thinks all these security measures are necessary.\"  (ti agree, sir,\" said Harry, making Ron drop his books in surprise.  \"Thank you, Harry, said Lockhart graciously while they waited for a long line of Hufflepuffs to pass. \"I mean, we teachers have quite enough to be getting on with, without walking students to classes and standing guard all night ......  \"That's right,\" said Ron, catching on. \"Why don't you leave us here, sir, we've only got one more corridor to go -\"  \"You know, Weasley, I think I will,\" said Lockhart. \"I really should go and prepare my next class -\"  And he hurried off.  \"Prepare his class,\" Ron sneered after him. \"Gone to curl his hair, more like.\"  They let the rest of the Gryffindors draw ahead of them, then darted down a side passage and hurried off toward Moaning Myrtle's bathroom. But just as they were congratulating each other on their brilliant scheme  \"Potter! Weasley! What are you doing?\"  It was Professor McGonagall, and her mouth was the thinnest of thin lines.  \"We were -we were-\" Ron stammered. \"We were going to - to go and see -\"  \"Hermione,\" said Harry. Ron and Professor McGonagall both looked at him.  \"We haven't seen her for ages, Professor,\" Harry went on hurriedly, treading on Ron's foot, \"and we thought we'd sneak into the hospital wing, you know, and tell her the Mandrakes are nearly ready and, er, not to worry -\"  Professor McGonagall was still staring at him, and for a moment, Harry thought she was going to explode, but when she spoke, it was in a strangely croaky voice.  \"Of course,\" she said, and Harry, amazed, saw a tear glistening in her beady eye. \"Of course, I realize this has all been hardest on the friends of those who have been ... I quite understand. Yes,  Potter, of course you may visit Miss Granger. I will inform Professor Binns where you've gone. Tell Madam Pomfrey I have given my permission.\"  Harry and Ron walked away, hardly daring to believe that they'd avoided detention. As they turned the corner, they distinctly heard Professor McGonagall blow her nose.  \"That,\" said Ron fervently, \"was the best story you've ever come up with.\"  They had no choice now but to go to the hospital wing and tell Madam Pomfrey that they had Professor McGonagall's permission to visit Hermione.  Madam Pomfrey let them in, but reluctantly.  \"There's just no point talking to a Petrified. person,\" she said, and they had to admit she had a point when they'd taken their seats next to Hermione. It was plain that Hermione didn't have the faintest inkling that she had visitors, and that they might just as well tell her bedside cabinet not to worry for all the good it would do.  \"Wonder if she did see the attacker, though?\" said Ron, looking sadly at Hermione's rigid face. \"Because if he sneaked up on them all, no one'll ever know . .....  But Harry wasn't looking at Hermione's face. He was more interested in her right hand. It lay clenched on top of her blankets, and bending closer, he saw that a piece of paper was scrunched inside her fist.  Making sure that Madam Pomfrey was nowhere near, he pointed this out to Ron.  \"TG and get it out,\" Ron whispered, shifting his chair so that he blocked Harry from Madam Pomfrey's view.  It was no easy task. Hermione's hand was clamped so tightly around the paper that Harry was sure he was going to tear it. While Ron kept watch he tugged and twisted, and at last, after several tense minutes, the paper came free.  It was a page torn from a very old library book. Harry smoothed it out eagerly and Ron leaned close to read it, too.  Of the many fearsome beasts and monsters that roam our land, there is none more curious or more deadly than the Basilisk, known also as the King of Serpents. This snake, which may reach gigantic size and live many hundreds of years, is born  from a chicken's egg, hatched beneath a toad. Its methods of killing are most wondrous, for aside from its deadly and venomous fangs, the Basilisk has a murderous stare, and all who are fixed with the beam of its eye shall suffer instant death. Spiders flee before the Basilisk, for it is their mortal enemy, and the Basilisk flees only from the crowing of the rooster, which is fatal to it."
}