{
  "id": "2fe59aa84dace3fa3ac733565b74a1442c4aa77d",
  "text": " You don’t need to die now.    I do. My time is done.  Jaqen passed a hand down his face from forehead to chin, and where it went he changed. His cheeks grew fuller, his eyes closer; his nose hooked, a scar appeared on his right cheek where no scar had been before. And when he shook his head, his long straight hair, half red and half white, dissolved away to reveal a cap of tight black curls.  Arya’s mouth hung open.  Who are you?  she whispered, too astonished to be afraid.  How did you do that? Was it hard?   He grinned, revealing a shiny gold tooth.  No harder than taking a new name, if you know the way.    Show me,  she blurted.  I want to do it too.    If you would learn, you must come with me.   Arya grew hesitant.  Where?    Far and away, across the narrow sea.    I can’t. I have to go home. To Winterfell.    Then we must part,  he said,  for I have duties too.  He lifted her hand and pressed a small coin into her palm.  Here.    What is it?    A coin of great value.   Arya bit it. It was so hard it could only be iron.  Is it worth enough to buy a horse?    It is not meant for the buying of horses.    Then what good is it?    As well ask what good is life, what good is death? If the day comes when you would find me again, give that coin to any man from Braavos, and say these words to him—valar morghulis.    Valar morghulis,  Arya repeated. It wasn’t hard. Her fingers closed tight over the coin. Across the yard, she could hear men dying.  Please don’t go, Jaqen.    Jaqen is as dead as Arry,  he said sadly,  and I have promises to keep. Valar morghulis, Arya Stark. Say it again.    Valar morghulis,  she said once more, and the stranger in Jaqen’s clothes bowed to her and stalked off through the darkness, cloak swirling. She was alone with the dead men. They deserved to die, Arya told herself, remembering all those Ser Amory Lorch had killed at the holdfast by the lake.  The cellars under Kingspyre were empty when she returned to her bed of straw. She whispered her names to her pillow, and when she was done she added,  Valar morghulis,  in a small soft voice, wondering what it meant.  Come dawn, Pinkeye and the others were back, all but one boy who’d been killed in the fighting for no reason that anyone could say. Pinkeye went up alone to see how matters stood by light of day, complaining all the while that his old bones could not abide steps. When he returned, he told them that Harrenhal had been taken.  Them Bloody Mummers killed some of Ser Amory’s lot in their beds, and the rest at table after they were good and drunk. The new lord will be here before the day’s out, with his whole host. He’s from the wild north up where that Wall is, and they say he’s a hard one. This lord or that lord, there’s still work to be done. Any foolery and I’ll whip the skin off your back.  He looked at Arya when he said that, but never said a word to her about where she had been the night before.  All morning she watched the Bloody Mummers strip the dead of their valuables and drag the corpses to the Flowstone Yard, where a pyre was laid to dispose of them. Shagwell the Fool hacked the heads off two dead knights and pranced about the castle swinging them by the hair and making them talk.  What did you die of?  one head asked.  Hot weasel soup,  replied the second.  Arya was set to mopping up dried blood. No one said a word to her beyond the usual, but every so often she would notice people looking at her strangely. Robett Glover and the other men they’d freed must have talked about what had happened down in the dungeon, and then Shagwell and his stupid talking heads started in about the weasel soup. She would have told him to shut up, but she was scared to. The fool was half-mad, and she’d heard that he’d once killed a man for not laughing at one of his japes. He better shut his mouth or I’ll put him on my list with the rest, she thought as she scrubbed at a reddish-brown stain. It was almost evenfall when the new master of Harrenhal arrived. He had a plain face, beardless and ordinary, notable only for his queer pale eyes. Neither plump, thin, nor muscular, he wore black ringmail and a spotted pink cloak. The sigil on his banner looked like a man dipped in blood.  On your knees for the Lord of the Dreadfort!  shouted his squire, a boy no older than Arya, and Harrenhal knelt.  Vargo Hoat came forward.  My lord, Harrenhal ith yourth.   The lord gave answer, but too softly for Arya to hear. Robett Glover and Ser Aenys Frey, freshly bathed and clad in clean new doublets and cloaks, came up to join them. After some brief talk, Ser Aenys led them over to Rorge and Biter. Arya was surprised to see them still here; somehow she would have expected them to vanish when Jaqen did. Arya heard the harsh sound of Rorge’s voice, but not what he was saying. Then Shagwell pounced on her, dragging her out across the yard.  My lord, my lord,  he sang, tugging at her wrist,  here’s the weasel who made the soup!    Let go,  Arya said, wriggling out of his grasp."
}