{
  "id": "302a0d3a9e9a990f607020b47ebf8c4eb0824cab",
  "text": "   Dany was lost.  Go? Where should we go?    Asshai, I would say. It lies far to the south, at the end of the known world, yet men say it is a great port. We will find a ship to take us back to Pentos. It will be a hard journey, make no mistake. Do you trust your khas? Will they come with us?    Khal Drogo commanded them to keep me safe,  Dany replied uncertainly,  but if he dies…  She touched the swell of her belly.  I don’t understand. Why should we flee? I am khaleesi. I carry Drogo’s heir. He will be khal after Drogo…   Ser Jorah frowned.  Princess, hear me. The Dothraki will not follow a suckling babe. Drogo’s strength was what they bowed to, and only that. When he is gone, Jhaqo and Pono and the other kos will fight for his place, and this khalasar will devour itself. The winner will want no more rivals. The boy will be taken from your breast the moment he is born. They will give him to the dogs…   Dany hugged herself.  But why?  she cried plaintively.  Why should they kill a little baby?    He is Drogo’s son, and the crones say he will be the stallion who mounts the world. It was prophesied. Better to kill the child than to risk his fury when he grows to manhood.   The child kicked inside her, as if he had heard. Dany remembered the story Viserys had told her, of what the Usurper’s dogs had done to Rhaegar’s children. His son had been a babe as well, yet they had ripped him from his mother’s breast and dashed his head against a wall. That was the way of men.  They must not hurt my son!  she cried.  I will order my khas to keep him safe, and Drogo’s bloodriders will—   Ser Jorah held her by the shoulders.  A bloodrider dies with his khal. You know that, child. They will take you to Vaes Dothrak, to the crones, that is the last duty they owe him in life… when it is done, they will join Drogo in the night lands.   Dany did not want to go back to Vaes Dothrak and live the rest of her life among those terrible old women, yet she knew that the knight spoke the truth. Drogo had been more than her sun-and-stars; he had been the shield that kept her safe.  I will not leave him,  she said stubbornly, miserably. She took his hand again.  I will not.   A stirring at the tent flap made Dany turn her head. Mirri Maz Duur entered, bowing low. Days on the march, trailing behind the khalasar, had left her limping and haggard, with blistered and bleeding feet and hollows under her eyes. Behind her came Qotho and Haggo, carrying the godswife’s chest between them. When the bloodriders caught sight of Drogo’s wound, the chest slipped from Haggo’s fingers and crashed to the floor of the tent, and Qotho swore an oath so foul it seared the air.  Mirri Maz Duur studied Drogo, her face still and dead.  The wound has festered.    This is your work, maegi,  Qotho said. Haggo laid his fist across Mirri’s cheek with a meaty smack that drove her to the ground. Then he kicked her where she lay.   Stop it!  Dany screamed.  Qotho pulled Haggo away, saying,  Kicks are too merciful for a maegi. Take her outside. We will stake her to the earth, to be the mount of every passing man. And when they are done with her, the dogs will use her as well. Weasels will tear out her entrails and carrion crows feast upon her eyes. The flies off the river shall lay their eggs in her womb and drink pus from the ruins of her breasts…  He dug iron-hard fingers into the soft, wobbly flesh under the godswife’s arm and hauled her to her feet.   No,  Dany said.  I will not have her harmed.   Qotho’s lips skinned back from his crooked brown teeth in a terrible mockery of a smile.  No? You say me no? Better you should pray that we do not stake you out beside your maegi. You did this, as much as the other.   Ser Jorah stepped between them, loosening his longsword in its scabbard.  Rein in your tongue, bloodrider. The princess is still your khaleesi.     Only while the blood-of-my-blood still lives,  Qotho told the knight.  When he dies, she is nothing.   Dany felt a tightness inside her.  Before I was khaleesi, I was the blood of the dragon. Ser Jorah, summon my khas.    No,  said Qotho.  We will go. For now… Khaleesi.  Haggo followed him from the tent, scowling.   That one means you no good, Princess,  Mormont said.  The Dothraki say a man and his bloodriders share one life, and Qotho sees it ending. A dead man is beyond fear.    No one has died,  Dany said.  Ser Jorah, I may have need of your blade. Best go don your armor.  She was more frightened than she dared admit, even to herself.  The knight bowed.  As you say.  He strode from the tent.  Dany turned back to Mirri Maz Duur. The woman’s eyes were wary.  So you have saved me once more.    And now you must save him,  Dany said.  Please…    You do not ask a slave,  Mirri replied sharply,  you tell her.  She went to Drogo burning on his mat, and gazed long at his wound.  Ask or tell, it makes no matter. He is beyond a healer’s skills.  The khal’s eyes were closed. She opened one with her fingers.  He has been dulling the hurt with milk of the poppy."
}