{
  "id": "307c0df9f40bbb98e1945d85c099a007112dc5c3",
  "text": " Nearly Headless Nick, Harry noticed, was still holding Sir Patrick's rejection letter..  129 \"I wish there was something I could do for you about the Headless Hunt,\" Harry said. Nearly Headless Nick stopped in his tracks and Harry walked right through him. He wished he hadn't; it was like stepping through an icy shower. \"But there is something you could do for me,\" said Nick excitedly. \"Harry - would I be asking too much - but no, you wouldn't want -\" \"What is it?\" said Harry. \"Well, this Halloween will be my five hundredth deathday,\" said Nearly Headless Nick, drawing himself up and looking dignified. \"Oh,\" said Harry, not sure whether he should look sorry or happy about this. \"Right.\" \"I'm holding a party down in one of the roomier dungeons. Friends will be coming from all over the country. It would be such an honor if you would attend. Mr. Weasley and Miss Granger would be most welcome, too, of course - but I daresay you'd rather go to the school feast?\" He watched Harry on tenterhooks. \"No,\" said Harry quickly, \"I'll come -\" \"My dear boy! Harry Potter, at my deathday party! And\" - he hesitated, looking excited - \"do you think you could possibly mention to Sir Patrick how very frightening and impressive you find me?\" \"Of - of course,\" said Harry. Nearly Headless Nick beamed at him. \"A deathday party?\" said Hermione keenly when Harry had changed at last and joined her and Ron in the common room. \"I bet there aren't many living people who can say they've been to one of those - it'll be fascinating!\".  130 \"Why would anyone want to celebrate the day they died?\" said Ron, who was halfway through his Potions homework and grumpy. \"Sounds dead depressing to me. . . .\" Rain was still lashing the windows, which were now inky black, but inside all looked bright and cheerful. The firelight glowed over the countless squashy armchairs where people sat reading, talking, doing homework or, in the case of Fred and George Weasley, trying to find out what would happen if you fed a Filibuster firework to a salamander. Fred had \"rescued\" the brilliant orange, fire-dwelling lizard from a Care of Magical Creatures class and it was now smouldering gently on a table surrounded by a knot of curious people. Harry was at the point of telling Ron and Hermione about Filch and the Kwikspell course when the salamander suddenly whizzed into the air, emitting loud sparks and bangs as it whirled wildly round the room. The sight of Percy bellowing himself hoarse at Fred and George, the spectacular display of tangerine stars showering from the salamander's mouth, and its escape into the fire, with accompanying explosions, drove both Filch and the Kwikspell envelope from Harry's mind. By the time Halloween arrived, Harry was regretting his rash promise to go to the deathday party. The rest of the school was happily anticipating their Halloween feast; the Great Hall had been decorated with the usual live bats, Hagrid's vast pumpkins had been carved into lanterns large enough for three men to sit in, and there were rumors that Dumbledore had booked a troupe of dancing skeletons for the entertainment. \"A promise is a promise,\" Hermione reminded Harry bossily. \"You said you'd go to the deathday party.\" So at seven o'clock, Harry, Ron, and Hermione walked straight past the doorway to the packed Great Hall, which was glittering invitingly with gold plates and candles, and directed their steps instead toward the dungeons.  .131 The passageway leading to Nearly Headless Nick's party had been lined with candles, too, though the effect was far from cheerful: These were long, thin, jet-black tapers, all burning bright blue, casting a dim, ghostly light even over their own living faces. The temperature dropped with every step they took. As Harry shivered and drew his robes tightly around him, he heard what sounded like a thousand fingernails scraping an enormous blackboard. \"Is that supposed to be music?\" Ron whispered. They turned a corner and saw Nearly Headless Nick standing at a doorway hung with black velvet drapes. \"My dear friends,\" he said mournfully. \"Welcome, welcome . . . so pleased you could come. . . .\" He swept off his plumed hat and bowed them inside. It was an incredible sight. The dungeon was full of hundreds of pearly-white, translucent people, mostly drifting around a crowded dance floor, waltzing to the dreadful, quavering sound of thirty musical saws, played by an orchestra on a raised, black-draped platform. A chandelier overhead blazed midnight-blue with a thousand more black candles. Their breath rose in a mist before them; it was like stepping into a freezer. \"Shall we have a look around?\" Harry suggested, wanting to warm up his feet. \"Careful not to walk through anyone,\" said Ron nervously, and they set off around the edge of the dance floor. They passed a group of gloomy nuns, a ragged man wearing chains, and the Fat Friar, a cheerful Hufflepuff ghost, who was talking to a knight with an arrow sticking out of his forehead. Harry wasn't surprised to see that the Bloody Baron, a gaunt, staring Slytherin ghost covered in silver bloodstains, was being given a wide berth by the other ghosts."
}