{
  "id": "309bba426a65386870344458a450ef75822de63f",
  "text": "  \"Training for the ballet, Potter?\" yelled Malfoy as Harry was forced to do a stupid kind of twirl in midair to dodge the Bludger, and he fled, the Bludger trailing a few feet behind him; and then, glaring back at Malfoy in hatred, he saw it - the Golden Snitch. It was hovering inches above Malfoy's left ear - and Malfoy, busy laughing at Harry, hadn't seen it.  For an agonizing moment, Harry hung in midair, not daring to speed toward Malfoy in case he looked up and saw the Snitch.  WHAM.  He had stayed still a second too long. The Bludger had hit him at last, smashed into his elbow, and Harry felt his arm break. Dimly, dazed by the searing pain in his arm, he slid sideways on his rain-drenched broom, one knee still crooked over it, his right arm dangling useless at his side - the Bludger came pelting back for a second attack, this time W-ming at his face - Harry swerved out of the way, one idea firmly lodged in his numb brain: get to Malfoy.  Through a haze of rain and pain he dived for the shimmering, sneering face below him and saw its eyes widen with fear: Malfoy thought Harry was attacking him.  \"What the -\" he gasped, careening out of Harry's way.  Harry took his remaining hand off his broom and made a wild snatch; he felt his fingers close on the cold Snitch but was now only  *171*  gripping the broom with his legs, and there was a yell from the crowd below as he headed straight for the ground, trying hard not to pass out.  With a splattering thud he hit the mud and rolled off his broom. His arm was hanging at a very strange angle; riddled with pain, he heard, as though from a distance, a good deal of whistling and shouting. He focused on the Snitch clutched in his good hand.  \"Aha,\" he said vaguely. \"We've won.\"  And he fainted.  He came around, rain falling on his face, still lying on the field, with someone leaning over him. He saw a glitter of teeth.  \"Oh, no, not you,\" he moaned.  \"Doesn't know what he's saying,\" said Lockhart loudly to the anxious crowd of Gryffindors pressing around them. \"Not to worry, Harry. I'm about to fix your arm.\"  \"No!\"said Harry. \"I'll keep it like this, thanks ......  He tried to sit up, but the pain was terrible. He heard a familiar clicking noise nearby.  \"I don't want a photo of this, Colin,\" he said loudly.  \"Lie back, Harry,\" said Lockhart soothingly. \"It's a simple charm I've used countless times -\"  \"Why can't I just go to the hospital wing?\" said Harry through clenched teeth.  \"He should really, Professor,\" said a muddy Wood, who couldn't help grinning even though his Seeker was injured. \"Great capture, Harry, really spectacular, your best yet, Id say -\"  Through the thicket of legs around him, Harry spotted Fred and  *112*  George Weasley, wrestling the rogue Bludger into a box. It was still putting up a terrific fight.  \"Stand back,\" said Lockhart, who was rolling up his jade-green sleeves.  \"No - don't -\" said Harry weakly, but Lockhart was twirling his wand and a second later had directed it straight at Harry's arm.  A strange and unpleasant sensation started at Harry's shoulder and spread all the way down to his fingertips. It felt as though his arm was being deflated. He didn't dare look at what was happening. He had shut his eyes, his face turned away from his arm, but his worst fears were realized as the people above him gasped and Colin Creevey began clicking away madly. His arm didn't hurt anymore - nor did it feel remotely like an arm.  \"Ah,\" said Lockhart. \"Yes. Well, that can sometimes happen. But the point is, the bones are no longer broken. That's the thing to bear in mind. So, Harry, just toddle up to the hospital wing - ah, Mr. Weasley, Miss Granger, would you escort him? - and Madam Pomfrey will be able to - er - tidy you up a bit.\"  As Harry got to his feet, he felt strangely lopsided. Taking a deep breath he looked down at his right side. What he saw nearly made him pass out again.  Poking out of the end of his robes was what looked like a thick, flesh- colored rubber glove. He tried to move his fingers. Nothing happened.  Lockhart hadn't mended Harry's bones. He had removed them.  Madam Pomfrey wasn't at all pleased.  \"You should have come straight to me!\" she raged, holding up  *173*  the sad, limp remainder of what, half an hour before, had been a working arm. \"I can mend bones in a second - but growing them back - \"  \"You will be able to, won't you?\" said Harry desperately.  \"I'll be able to, certainly, but it will be painful,\" said Madam Pomfrey grimly, throwing Harry a pair of pajamas. \"You'll have to stay the night ......  Hermione waited outside the curtain drawn around Harry's bed while Ron helped him into his pajamas. It took a while to stuff the rubbery, boneless arm into a sleeve.  \"How can you stick up for Lockhart now, Hermione, eh?\" Ron called through the curtain as he pulled Harry's limp fingers through the cuff. \"If Harry had wanted deboning he would have asked.\"  \"Anyone can make a mistake,\" said Hermione. \"And it doesn't hurt anymore, does it, Harry?\"  \"No,\" said Harry, getting into bed."
}