{
  "id": "31b1393a87d99c5b3628b19e69eb9af9ae46a359",
  "text": " The boy does not want too much. Only half the realm, the release of our captives, hostages, his father’s sword… oh, yes, and his sisters.   The boy sits idle at Riverrun,  Ser Cleos said.  I think he fears to face your father in the field. His strength grows less each day. The river lords have departed, each to defend his own lands.   Is this what Father intended? Tyrion rolled up Stark’s map.  These terms will never do.    Will you at least consent to trade the Stark girls for Tion and Willem?  Ser Cleos asked plaintively.  Tion Frey was his younger brother, Tyrion recalled.  No,  he said gently,  but we’ll propose our own exchange of captives. Let me consult with Cersei and the council. We shall send you back to Riverrun with our terms.   Clearly, the prospect did not cheer him.  My lord, I do not believe Robb Stark will yield easily. It is Lady Catelyn who wants this peace, not the boy.    Lady Catelyn wants her daughters.  Tyrion pushed himself down from the bench, letter and map in hand.  Ser Jacelyn will see that you have food and fire. You look in dire need of sleep, cousin. I will send for you when we know more.   He found Ser Jacelyn on the ramparts, watching several hundred new recruits drilling in the field below. With so many seeking refuge in King’s Landing, there was no lack of men willing to join the City Watch for a full belly and a bed of straw in the barracks, but Tyrion had no illusions about how well these ragged defenders of theirs would fight if it came to battle.   You did well to send for me,  Tyrion said.  I shall leave Ser Cleos in your hands. He is to have every hospitality.    And his escort?  the commander wanted to know.   Give them food and clean garb, and find a maester to see to their hurts. They are not to set foot inside the city, is that understood?  It would never do to have the truth of conditions in King’s Landing reach Robb Stark in Riverrun.   Well understood, my lord.    Oh, and one more thing. The alchemists will be sending a large supply of clay pots to each of the city gates. You’re to use them to train the men who will work your spitfires. Fill the pots with green paint and have them drill at loading and firing. Any man who spatters should be replaced. When they have mastered the paint pots, substitute lamp oil and have them work at lighting the jars and firing them while aflame. Once they learn to do that without burning themselves, they may be ready for wildfire.   Ser Jacelyn scratched at his cheek with his iron hand.  Wise measures. Though I have no love for that alchemist’s piss.    Nor I, but I use what I’m given.   Once back inside his litter, Tyrion Lannister drew the curtains and plumped a cushion under his elbow. Cersei would be displeased to learn that he had intercepted Stark’s letter, but his father had sent him here to rule, not to please Cersei.  It seemed to him that Robb Stark had given them a golden chance. Let the boy wait at Riverrun dreaming of an easy peace. Tyrion would reply with terms of his own, giving the King in the North just enough of what he wanted to keep him hopeful. Let Ser Cleos wear out his bony Frey rump riding to and fro with offers and counters. All the while, their cousin Ser Stafford would be training and arming the new host he’d raised at Casterly Rock. Once he was ready, he and Lord Tywin could smash the Tullys and Starks between them.  Now if only Robert’s brothers would be so accommodating. Glacial as his progress was, still Renly Baratheon crept north and east with his huge southron host, and scarcely a night passed that Tyrion did not dread being awakened with the news that Lord Stannis was sailing his fleet up the Blackwater Rush. Well, it would seem I have a goodly stock of wildfire, but still…  The sound of some hubbub in the street intruded on his worries. Tyrion peered out cautiously between the curtains. They were passing through Cobbler’s Square, where a sizable crowd had gathered beneath the leather awnings to listen to the rantings of a prophet. A robe of undyed wool belted with a hempen rope marked him for one of the begging brothers.   Corruption!  the man cried shrilly.  There is the warning! Behold the Father’s scourge!  He pointed at the fuzzy red wound in the sky. From this vantage, the distant castle on Aegon’s High Hill was directly behind him, with the comet hanging forebodingly over its towers. A clever choice of stage, Tyrion reflected.  We have become swollen, bloated, foul. Brother couples with sister in the bed of kings, and the fruit of their incest capers in his palace to the piping of a twisted little monkey demon. Highborn ladies fornicate with fools and give birth to monsters! Even the High Septon has forgotten the gods! He bathes in scented waters and grows fat on lark and lamprey while his people starve! Pride comes before prayer, maggots rule our castles, and gold is all… but no more! The Rotten Summer is at an end, and the Whoremonger King is brought low! When the boar did open him, a great stench rose to heaven and a thousand snakes slid forth from his belly, hissing and biting!  He jabbed his bony finger back at comet and castle."
}