{
  "id": "31cc3e17d7a9d8643c809ef8ed5c5488da8d78f2",
  "text": " A small crowd of children had gathered to watch her, and beyond she glimpsed women going about their work, and withered old men staring at the flat blue sky with tired eyes, swatting feebly at bloodflies. A count might show a hundred people, no more. Where the other forty thousand had made their camp, only the wind and dust lived now.   Drogo’s khalasar is gone,  she said.   A khal who cannot ride is no khal,  said Jhogo.   The Dothraki follow only the strong,  Ser Jorah said.  I am sorry, my princess. There was no way to hold them. Ko Pono left first, naming himself Khal Pono, and many followed him. Jhaqo was not long to do the same. The rest slipped away night by night, in large bands and small. There are a dozen new khalasars on the Dothraki sea, where once there was only Drogo’s.    The old remain,  said Aggo.  The frightened, the weak, and the sick. And we who swore. We remain.    They took Khal Drogo’s herds, Khaleesi,  Rakharo said.  We were too few to stop them. It is the right of the strong to take from the weak. They took many slaves as well, the khal’s and yours, yet they left some few.    Eroeh?  asked Dany, remembering the frightened child she had saved outside the city of the Lamb Men.   Mago seized her, who is Khal Jhaqo’s bloodrider now,  said Jhogo.  He mounted her high and low and gave her to his khal, and Jhaqo gave her to his other bloodriders. They were six. When they were done with her, they cut her throat.    It was her fate, Khaleesi,  said Aggo.  If I look back I am lost.  It was a cruel fate,  Dany said,  yet not so cruel as Mago’s will be. I promise you that, by the old gods and the new, by the lamb god and the horse god and every god that lives. I swear it by the Mother of Mountains and the Womb of the World. Before I am done with them, Mago and Ko Jhaqo will plead for the mercy they showed Eroeh.   The Dothraki exchanged uncertain glances.  Khaleesi,  the handmaid Irri explained, as if to a child,  Jhaqo is a khal now, with twenty thousand riders at his back.   She lifted her head.  And I am Daenerys Stormhorn, Daenerys of House Targaryen, of the blood of Aegon the Conqueror and Maegor the Cruel and old Valyria before them. I am the dragon’s daughter, and I swear to you, these men will die screaming. Now bring me to Khal Drogo.   He was lying on the bare red earth, staring up at the sun.  A dozen bloodflies had settled on his body, though he did not seem to feel them. Dany brushed them away and knelt beside him. His eyes were wide open but did not see, and she knew at once that he was blind. When she whispered his name, he did not seem to hear. The wound on his breast was as healed as it would ever be, the scar that covered it grey and red and hideous.   Why is he out here alone, in the sun?  she asked them.   He seems to like the warmth, Princess,  Ser Jorah said.  His eyes follow the sun, though he does not see it. He can walk after a fashion. He will go where you lead him, but no farther. He will eat if you put food in his mouth, drink if you dribble water on his lips.   Dany kissed her sun-and-stars gently on the brow, and stood to face Mirri Maz Duur.  Your spells are costly, maegi.    He lives,  said Mirri Maz Duur.  You asked for life. You paid for life.    This is not life, for one who was as Drogo was. His life was laughter, and meat roasting over a firepit, and a horse between his legs. His life was an arakh in his hand and his bells ringing in his hair as he rode to meet an enemy. His life was his bloodriders, and me, and the son I was to give him.   Mirri Maz Duur made no reply.   When will he be as he was?  Dany demanded.   When the sun rises in the west and sets in the east,  said Mirri Maz Duur.  When the seas go dry and mountains blow in the wind like leaves. When your womb quickens again, and you bear a living child. Then he will return, and not before.   Dany gestured at Ser Jorah and the others.  Leave us. I would speak with this maegi alone.  Mormont and the Dothraki withdrew.  You knew,  Dany said when they were gone. She ached, inside and out, but her fury gave her strength.  You knew what I was buying, and you knew the price, and yet you let me pay it.    It was wrong of them to burn my temple,  the heavy, flat-nosed woman said placidly.  That angered the Great Shepherd.    This was no god’s work,  Dany said coldly. If I look back I am lost.  You cheated me. You murdered my child within me.    The stallion who mounts the world will burn no cities now. His khalasar shall trample no nations into dust.    I spoke for you,  she said, anguished.  I saved you.    Saved me?  The Lhazareen woman spat.  Three riders had taken me, not as a man takes a woman but from behind, as a dog takes a bitch. The fourth was in me when you rode past. How then did you save me? I saw my god’s house burn, where I had healed good men beyond counting. My home they burned as well, and in the street I saw piles of heads. I saw the head of a baker who made my bread. I saw the head of a boy I had saved from deadeye fever, only three moons past."
}