{
  "id": "31dc564fc2ac15be374f945df98092f315dc3d9c",
  "text": " Robert came out of hiding to join the fight when the bells began to ring. He slew six men that day, they say. One was Myles Mooton, a famous knight who’d been Prince Rhaegar’s squire. He would have slain the Hand too, but the battle never brought them together. Connington wounded your grandfather Tully sore, though, and killed Ser Denys Arryn, the darling of the Vale. But when he saw the day was lost, he flew off as fast as the griffins on his shield. The Battle of the Bells, they called it after. Robert always said your father won it, not him.   More recent battles had been fought here as well, Arya thought from the look of the place. The town gates were made of raw new wood; outside the walls a pile of charred planks remained to tell what had happened to the old ones.  Stoney Sept was closed up tight, but when the captain of the gate saw who they were, he opened a sally port for them.  How you fixed for food?  Tom asked as they entered.   Not so bad as we were. The Huntsman brought in a flock o’ sheep, and there’s been some trading across the Blackwater. The harvest wasn’t burned south o’ the river. Course, there’s plenty want to take what we got. Wolves one day, Mummers the next. Them that’s not looking for food are looking for plunder, or women to rape, and them that’s not out for gold or wenches are looking for the bloody Kingslayer. Talk is, he slipped right through Lord Edmure’s fingers.    Lord Edmure?  Lem frowned.  Is Lord Hoster dead, then?    Dead or dying. Think Lannister might be making for the Blackwater? It’s the quickest way to King’s Landing, the Huntsman swears.  The captain did not wait for an answer.  He took his dogs out for a sniff round. If Ser Jaime’s hereabouts, they’ll find him. I’ve seen them dogs rip bears apart. Think they’ll like the taste of lion blood?    A chewed-up corpse’s no good to no one,  said Lem.  The Huntsman bloody well knows that, too.    When the westermen came through they raped the Huntsman’s wife and sister, put his crops to the torch, ate half his sheep, and killed the other half for spite. Killed six dogs too, and threw the carcasses down his well. A chewed-up corpse would be plenty good enough for him, I’d say. Me as well.    He’d best not,  said Lem.  That’s all I got to say. He’d best not, and you’re a bloody fool.   Arya rode between Harwin and Anguy as the outlaws moved down the streets where her father once had fought. She could see the sept on its hill, and below it a stout strong holdfast of grey stone that looked much too small for such a big town. But every third house they passed was a blackened shell, and she saw no people.  Are all the townfolk dead?    Only shy.  Anguy pointed out two bowmen on a roof, and some boys with sooty faces crouched in the rubble of an alehouse. Farther on, a baker threw open a shuttered window and shouted down to Lem. The sound of his voice brought more people out of hiding, and Stoney Sept slowly seemed to come to life around them.  In the market square at the town’s heart stood a fountain in the shape of a leaping trout, spouting water into a shallow pool. Women were filling pails and flagons there. A few feet away, a dozen iron cages hung from creaking wooden posts. Crow cages, Arya knew. The crows were mostly outside the cages, splashing in the water or perched atop the bars; inside were men. Lem reined up scowling.  What’s this, now?    Justice,  answered a woman at the fountain.   What, did you run short o’ hempen rope?    Was this done at Ser Wilbert’s decree?  asked Tom.  A man laughed bitterly.  The lions killed Ser Wilbert a year ago. His sons are all off with the Young Wolf, getting fat in the west. You think they give a damn for the likes of us? It was the Mad Huntsman caught these wolves.   Wolves. Arya went cold. Robb’s men, and my father’s. She felt drawn toward the cages. The bars allowed so little room that prisoners could neither sit nor turn; they stood naked, exposed to sun and wind and rain. The first three cages held dead men. Carrion crows had eaten out their eyes, yet the empty sockets seemed to follow her. The fourth man in the row stirred as she passed. Around his mouth his ragged beard was thick with blood and flies. They exploded when he spoke, buzzing around his head.  Water.  The word was a croak.  Please… water…   The man in the next cage opened his eyes at the sound.  Here,  he said.  Here, me.  An old man, he was; his beard was grey and his scalp was bald and mottled brown with age.  There was another dead man beyond the old one, a big red-bearded man with a rotting grey bandage covering his left ear and part of his temple. But the worst thing was between his legs, where nothing remained but a crusted brown hole crawling with maggots. Farther down was a fat man. The crow cage was so cruelly narrow it was hard to see how they’d ever gotten him inside. The iron dug painfully into his belly, squeezing bulges out between the bars. Long days baking in the sun had burned him a painful red from head to heel."
}