{
  "id": "31f485d6ad15f6cfbca7c8928511c6b5cdf6b273",
  "text": "  When they finally came for her in truth, Sansa never heard their footsteps. It was Joffrey who opened her door, not Ser Ilyn but the boy who had been her prince. She was in bed, curled up tight, her curtains drawn, and she could not have said if it was noon or midnight. The first thing she heard was the slam of the door. Then her bed hangings were yanked back, and she threw up a hand against the sudden light and saw them standing over her.   You will attend me in court this afternoon,  Joffrey said.  See that you bathe and dress as befits my betrothed.  Sandor Clegane stood at his shoulder in a plain brown doublet and green mantle, his burned face hideous in the morning light. Behind them were two knights of the Kingsguard in long white satin cloaks.  Sansa drew her blanket up to her chin to cover herself.  No,  she whimpered,  please… leave me be.    If you won’t rise and dress yourself, my Hound will do it for you,  Joffrey said.   I beg of you, my prince…    I’m king now. Dog, get her out of bed.   Sandor Clegane scooped her up around the waist and lifted her off the featherbed as she struggled feebly. Her blanket fell to the floor. Underneath she had only a thin bedgown to cover her nakedness.  Do as you’re bid, child,  Clegane said.  Dress.  He pushed her toward her wardrobe, almost gently.  Sansa backed away from them.  I did as the queen asked, I wrote the letters, I wrote what she told me. You promised you’d be merciful. Please, let me go home. I won’t do any treason, I’ll be good, I swear it, I don’t have traitor’s blood, I don’t. I only want to go home.  Remembering her courtesies, she lowered her head.  As it please you,  she finished weakly.   It does not please me,  Joffrey said.  Mother says I’m still to marry you, so you’ll stay here, and you’ll obey.    I don’t want to marry you,  Sansa wailed.  You chopped off my father’s head!    He was a traitor. I never promised to spare him, only that I’d be merciful, and I was. If he hadn’t been your father, I would have had him torn or flayed, but I gave him a clean death.   Sansa stared at him, seeing him for the first time. He was wearing a padded crimson doublet patterned with lions and a cloth-of-gold cape with a high collar that framed his face. She wondered how she could ever have thought him handsome. His lips were as soft and red as the worms you found after a rain, and his eyes were vain and cruel.  I hate you,  she whispered.  King Joffrey’s face hardened.  My mother tells me that it isn’t fitting that a king should strike his wife. Ser Meryn.   The knight was on her before she could think, yanking back her hand as she tried to shield her face and backhanding her across the ear with a gloved fist. Sansa did not remember failing, yet the next she knew she was sprawled on one knee amongst the rushes. Her head was ringing. Ser Meryn Trant stood over her, with blood on the knuckles of his white silk glove.   Will you obey now, or shall I have him chastise you again?   Sansa’s ear felt numb. She touched it, and her fingertips came away wet and red.  I… as… as you command, my lord.    Your Grace,  Joffrey corrected her.  I shall look for you in court.  He turned and left.  Ser Meryn and Ser Arys followed him out, but Sandor Clegane lingered long enough to yank her roughly to her feet.  Save yourself some pain, girl, and give him what he wants.    What… what does he want? Please, tell me.    He wants you to smile and smell sweet and be his lady love,  the Hound rasped.  He wants to hear you recite all your pretty little words the way the septa taught you. He wants you to love him… and fear him.   After he was gone, Sansa sank back onto the rushes, staring at the wall until two of her bedmaids crept timidly into the chamber.  I will need hot water for my bath, please,  she told them,  and perfume, and some powder to hide this bruise.  The right side of her face was swollen and beginning to ache, but she knew Joffrey would want her to be beautiful.  The hot water made her think of Winterfell, and she took strength from that. She had not washed since the day her father died, and she was startled at how filthy the water became. Her maids sluiced the blood off her face, scrubbed the dirt from her back, washed her hair and brushed it out until it sprang back in thick auburn curls. Sansa did not speak to them, except to give them commands; they were Lannister servants, not her own, and she did not trust them. When the time came to dress, she chose the green silk gown that she had worn to the tourney. She recalled how gallant Joff had been to her that night at the feast. Perhaps it would make him remember as well, and treat her more gently.  She drank a glass of buttermilk and nibbled at some sweet biscuits as she waited, to settle her stomach. It was midday when Ser Meryn returned. He had donned his white armor; a shirt of enameled scales chased with gold, a tall helm with a golden sunburst crest, greaves and gorget and gauntlet and boots of gleaming plate, a heavy wool cloak clasped with a golden lion."
}