{
  "id": "32b88c5a6b9f572e53436be47a723da31763a2e8",
  "text": " \"My boy, you may well be seeing the outcome of poor Hagrid's trouble with the Ministry of Magic! Look closer... Does the hippogriff appear to... have its head?\"  \"Yes,\" said Harry firmly.  \"Are you sure?\" Professor Trelawney urged him. \"Are you quite sure, dear? You don't see it writhing on the ground, perhaps, and a shadowy figure raising an axe behind it?\"  \"No!\" said Harry, starting to feel slightly sick.  \"No blood? No weeping Hagrid?\"  \"No!\" said Harry again, wanting more than ever to leave the room and the heat. \"It looks fine, it's - - flying away...\"  Professor Trelawney sighed.  \"Well, dear, I think we'll leave it there.... A little disappointing... but I'm sure you did your best.\"  Relieved, Harry got up, picked up his bag and turned to go, but then a loud, harsh voice spoke behind him.  \"IT WILL HAPPEN TONIGHT.\"  Harry wheeled around. Professor Trelawney had gone rigid in her armchair; her eyes were unfocused and her mouth sagging.  \"S -- sorry?\" said Harry.  But Professor Trelawney didn't seem to hear him. Her eyes started to roll. Harry sat there in a panic. She looked as though she was about to have some sort of seizure. He hesitated, thinking of running to the hospital wing -- and then Professor Trelawney spoke again, in the same harsh voice, quite unlike her own:  \"THE DARK LORD LIES ALONE AND FRIENDLESS, ABANDONED BY HIS FOLLOWERS. HIS SERVANT HAS BEEN CHAINED THESE TWELVE YEARS. TONIGHT, BEFORE MIDNIGHT... THE SERVANT WILL BREAK FREE AND SET OUT TO REJOIN HIS MASTER. THE DARK LORD WILL RISE AGAIN WITH HIS SERVANTS AID, GREATER AND MORE TERRIBLE THAN EVER HE WAS. TONIGHT... BEFORE MIDNIGHT... THE SERVANT... WILL SET OU... TO REJOIN... HIS MASTER....  Professor Trelawney's head fell forward onto her chest. She made a grunting sort of noise. Harry sat there, staring at her. Then, quite suddenly, Professor Trelawney's head snapped up again.  \"I'm so sorry, dear boy,\" she said dreamily, \"the heat of the day, you know... I drifted off for a moment....\"  Harry sat there, staring at her.  \"Is there anything wrong, my dear?\"  \"You -- you just told me that the -- the Dark Lord's going to rise again... that his servant's going to go back to him.  Professor Trelawney looked thoroughly startled.  \"The Dark Lord? He-Who-Must-Not-Be-Named? My dear boy, that's hardly something to joke about.... Rise again, indeed --\"  ,'But you just said it! You. said the Dark Lord --\"  \"I think you must have dozed off too, dear!\" said Professor Trelawney. \"I would certainly not presume to predict anything quite as far-fetched as that!\"  Harry climbed back down the ladder and the spiral staircase, wondering... had he just heard Professor Trelawney make a real prediction? Or had that been her idea of an impressive end to the test?  Five minutes later he was dashing past the security trolls outside the entrance to Gryffindor Tower, Professor Trelawney's words still resounding in his head. People were striding past him in the opposite direction, laughing and joking, heading for the grounds and a bit of long-awaited freedom; by the time he had reached the portrait hole and entered the common room, it was almost deserted. Over in the corner, however, sat Ron and Hermione.  \"Professor Trelawney,\" Harry panted, \"just told me --\"  But he stopped abruptly at the sight of their faces.  \"Buckbeak lost,\" said Ron weakly. \"Hagrid's just sent this.\"  Hagrid's note was dry this time, no tears had splattered it, yet his hand seemed to have shaken so much as he wrote that it was hardly legible.  Lost appeal. They're going to execute at sunset. Nothing you can do. Don't come down. I don't want you to see it.  Hagrid  \"We've got to go,\" said Harry at once. \"He can't just sit there on his own, waiting for the executioner!\"  \"Sunset, though,\" said Ron, who was staring out the window ill a glazed sort of way. \"We'd never be allowed... 'specially you, Harry....\"  Harry sank his head into his hands, thinking.  \"If we only had the Invisibility Cloak....\"  \"Where is it?\" said Hermione.  Harry told her about leaving it in the passageway under the one-eyed witch.  \"... if Snape sees me anywhere near there again, I'm in serious trouble,\" he finished.  \"That's true,\" said Hermione, getting to her feet. \"If he sees you.... How do you open the witch's hump again?\"  \"You -- you tap it and say, 'Dissendium,'\" said Harry. \"But --\"  Hermione didn't wait for the rest of his sentence; she strode across the room, pushed open the Fat Lady's portrait and vanished from sight.  \"She hasn't gone to get it?\" Ron said, staring after her.  She had. Hermione returned a quarter of an hour later with the silvery cloak folded carefully under her robes.  \"Hermione, I don't know what's gotten, into you lately!\" said Ron, astounded. \"First you hit Malfoy, then you walk out on Professor Trelawney --\"  Hermione looked rather flattered.  They went down to dinner with everybody else, but did not return to Gryffindor Tower afterward. Harry had the cloak hidden down tie front of his robes; he had to keep his arms folded to hide the lump."
}