{
  "id": "32be23a33d96bb306d096359d7d5d3beee630ce9",
  "text": " Their welcome was good, as may   ####-be expected, and the men and their Master were ready to make any bargain for the  future in return for the Elvenking's aid.  Their plans were soon made. With the women and the children, the old and the  unfit,  the  Master  remained  behind;  and  with  him  were  some  men  of  crafts  and  many  skilled  elves;  and  they  busied  themselves  felling  trees,  and  collecting  the  timber  sent  down  from  the  Forest.  Then  they  set  about  raising  many  huts  by  the  shore  against  the  oncoming  winter;  and  also  under  the  Master's  direction  they  began  the planning of a new  town, designed more fair and  large even  than before,  but not  in  the  same place. They  removed northward higher up  the  shore;  for  ever  after  they  had  a  dread  of  the  water  where  the  dragon  lay.  He  would  never  again  return to his golden bed, but was stretched cold as stone, twisted upon the floor of  the  shallows.  There  for  ages  his  huge  bones  could  be  seen  in  calm weather  amid  the  ruined  piles  of  the old  town. But  few dared  to cross  the cursed spot, and none  dared  to dive  into  the shivering water or recover  the precious stones  that fell from  his rotting carcass.  But  all  the men  of  arms  who  were  still  able,  and  the most  of  the  Elvenking's  array,  got  ready  to march  north  to  the Mountain.  It  was  thus  that  in  eleven  days  from the ruin of the town the head of their host passed the rock-gates at the end of  the lake and came into the desolate lands.   ####-<h4>Chapter 15</h4> <br>   The Gathering of the Clouds     Now  we  will  return  to  Bilbo  and  the  dwarves.  All  night  one  of  them  had  watched,  but when morning  came  they  had  not  heard  or  seen  any  sign  of  danger.  But ever more thickly the birds were gathering. Their companies came flying from  the  South;  and  the  crows  that  still  lived  about  the Mountain  were  wheeling  and  crying unceasingly above.  \"Something  strange  is  happening,\"  said  Thorin.  \"The  time  has  gone  for  the  autumn  wanderings;  and  these  are  birds  that  dwell  always  in  the  land;  there  are  starlings  and  flocks  of  finches;  and  far  off  there  are  many  carrion  birds  as  if  a  battle were afoot!\"  Suddenly Bilbo pointed: \"There  is  that old  thrush again!\" he cried. \"He seems  to have escaped, when Smaug  smashed  the mountain-side, but I don't suppose the  snails have!\"  Sure  enough  the  old  thrush was  there,  and  as  Bilbo  pointed,  he  flew  towards  them  and  perched  on  a  stone  near  by. Then  he  fluttered  his wings  and  sang;  then  he  cocked  his  head  on  one  side,  as  if  to  listen;  and  again  he  sang,  and  again  he  listened.  \"I  believe  he  is  trying  to  tell  us  something,\"  said  Balin;  \"but  I  cannot  follow  the  speech  of  such  birds,  it  is  very  quick  and  difficult.  Can  you  make  it  out  Baggins?\"  \"Not very well,\" said Bilbo (as a matter of fact, he could make nothing of it at  all); \"but the old fellow seems .very excited.\"  \"I only wish he was a raven!\" said Balin.  \"I  thought  you  did  not  like  them!  You  seemed  very  shy  of  them,  when  we  came this way before.\"  \"Those  were  crows!  And  nasty  suspicious-looking  creatures  at  that,  and  rude  as  well.  You  must  have  heard  the  ugly  names  they were  calling  after  us. But  the  ravens  are  different.  There  used  to  be  great  friendship  between  them  and  the  people  of  Thror;  and  they  often  brought  us  secret  news,  and were  rewarded with  such bright things as they coveted to hide in their dwellings.  \"They  live many  a  year,  and  their memories  are  long,  and  they  hand  on  their  wisdom to their children. I knew many among the ravens of the rocks when I was  a  dwarf-  lad.  This  very  height  was  once  named  Ravenhill,  because  there  was  a   ####-wise  and  famous  pair,  old  Care  and  his  wife,  that  lived  here  above  the  guard- chamber. But I don't suppose that any of that ancient breed linger here now.\"  No  sooner  had  he  finished  speaking  than  the  old  thrush  gave  a  loud  call,  and  immediately flew away.   \"We may not understand him, but that old bird understands us, I am sure,\" said  Balin. \"Keep watch now, and see what happens!\"  Before  long  there  was  a  fluttering  of  wings,  and  back  came  the  thrush;  and  with him came a most decrepit old bird. He was getting blind, he could hardly fly,  and  the  top of his head was bald. He was an aged raven of great size. He alighted  stiffly  on  the  ground  before  them,  slowly  flapped  his wings,  and  bobbed  towards  Thorin.  \"O  Thorin  son  of  Thrain,  and  Balin  son  of  Fundin,\"  he  croaked  (and  Bilbo  could  understand  what  he  said,  for  he  used  ordinary  language  and  not  bird- speech).  \"I  am  Róac  son  of  Carc.  Carc  is  dead,  but  he  was  well  known  to  you  once."
}