{
  "id": "32d5dd3fc9d0a3f02883c4de71ed71d059bb4d38",
  "text": " Even so, the Myraham had to struggle mightily to keep itself off those rocks.   It must be windy there,  the captain’s daughter observed.  He laughed.  Windy and cold and damp. A miserable hard place, in truth… but my lord father once told me that hard places breed hard men, and hard men rule the world.   The captain’s face was as green as the sea when he came bowing up to Theon and asked,  May we make for port now, milord?    You may,  Theon said, a faint smile playing about his lips. The promise of gold had turned the Oldtowner into a shameless lickspittle. It would have been a much different voyage if a longship from the islands had been waiting at Seagard as he’d hoped. Ironborn captains were proud and willful, and did not go in awe of a man’s blood. The islands were too small for awe, and a longship smaller still. If every captain was a king aboard his own ship, as was often said, it was small wonder they named the islands the land of ten thousand kings. And when you have seen your kings shit over the rail and turn green in a storm, it was hard to bend the knee and pretend they were gods.  The Drowned God makes men,  old King Urron Redhand had once said, thousands of years ago,  but it’s men who make crowns.   A longship would have made the crossing in half the time as well. The Myraham was a wallowing tub, if truth be told, and he would not care to be aboard her in a storm. Still, Theon could not be too unhappy. He was here, undrowned, and the voyage had offered certain other amusements. He put an arm around the captain’s daughter.  Summon me when we make Lordsport,  he told her father.  We’ll be below, in my cabin.  He led the girl away aft, while her father watched them go in sullen silence.  The cabin was the captain’s, in truth, but it had been turned over to Theon’s use when they sailed from Seagard. The captain’s daughter had not been turned over to his use, but she had come to his bed willingly enough all the same. A cup of wine, a few whispers, and there she was. The girl was a shade plump for his taste, with skin as splotchy as oatmeal, but her breasts filled his hands nicely and she had been a maiden the first time he took her. That was surprising at her age, but Theon found it diverting. He did not think the captain approved, and that was amusing as well, watching the man struggle to swallow his outrage while performing his courtesies to the high lord, the rich purse of gold he’d been promised never far from his thoughts.  As Theon shrugged out of his wet cloak, the girl said,  You must be so happy to see your home again, milord. How many years have you been away?     Ten, or close as makes no matter,  he told her.  I was a boy of ten when I was taken to Winterfell. as a ward of Eddard Stark.  A ward in name, a hostage in truth. Half his days a hostage… but no longer. His life was his own again, and nowhere a Stark to be seen. He drew the captain’s daughter close and kissed her on her ear.  Take off your cloak.   She dropped her eyes, suddenly shy, but did as he bid her. When the heavy garment, sodden with spray, fell from her shoulders to the deck, she gave him a little bow and smiled anxiously. She looked rather stupid when she smiled, but he had never required a woman to be clever.  Come here,  he told her.  She did.  I have never seen the Iron Islands.    Count yourself fortunate.  Theon stroked her hair. it was fine and dark, though the wind had made a tangle of it.  The islands are stern and stony places, scant of comfort and bleak of prospect. Death is never far here, and life is mean and meager. Men spend their nights drinking ale and arguing over whose lot is worse, the fisherfolk who fight the sea or the farmers who try and scratch a crop from the poor thin soil. If truth be told, the miners have it worse than either, breaking their backs down in the dark, and for what? Iron, lead, tin, those are our treasures. Small wonder the ironmen of old turned to raiding.   The stupid girl did not seem to be listening.  I could go ashore with you,  she said.  I would, if it please you…    You could go ashore,  Theon agreed, squeezing her breast,  but not with me, I fear.    I’d work in your castle, milord. I can clean fish and bake bread and churn butter. Father says my peppercrab stew is the best he’s ever tasted. You could find me a place in your kitchens and I could make you peppercrab stew.    And warm my bed by night?  He reached for the laces of her bodice and began to undo them, his fingers deft and practiced.  Once I might have carried you home as a prize, and kept you to wife whether you willed it or no. The ironmen of old did such things. A man had his rock wife, his true bride, ironborn like himself, but he had his salt wives too, women captured on raids.   The girl’s eyes grew wide, and not because he had bared her breasts.  I would be your salt wife, milord.    I fear those days are gone.  Theon’s finger circled one heavy teat, spiraling in toward the fat brown nipple.  No longer may we ride the wind with fire and sword, taking what we want."
}