{
  "id": "331505ff8e5db036fa7937485b148b2bce77594d",
  "text": " \"Don't you want to see what Percy's written?\" Harry asked her hastily. Percys letter was short and irritated.  As I am constantly telling the Daily Prophet, Mr. Crouch is taking a well-deserved break. He is sending in regular owls with instructions.  No, I haven't actually seen him, but I think I can be trusted to know my own superior's handwriting.  I have quite enough to do at the moment without trying to quash these ridiculous rumors.  Please don't bother me again unless it's something important.  Happy Easter.  The start of the summer term would normally have meant that Harry was training hard for the last Quidditch match of the season. This year, however, it was the third and final task in the Triwizard Tournament for which he needed to prepare, but he still didn't know what he would have to do.  Finally, in the last week of May, Professor McGonagall held him back in Transfiguration. \"You are to go down to the Quidditch field tonight at nine o'clock. Potter,\" she told him. \"Mr. Bagman will be there to tell the champions about the third task.\" So at half past eight that night. Harry left Ron and Hermione in Gryffindor Tower and went downstairs.  As he crossed the entrance hall, Cedric came up from the Hufflepuff common room. \"What d'you reckon it's going to be?\"  he asked Harry as they went together down the stone steps, out into the cloudy night.  \"Fleur keeps going on about underground tunnels; she reckons we've got to find treasure.\" \"That wouldn't be too bad,\" said Harry, thinking that he would simply ask Hagrid for a niffler to do the job for him. They walked down the dark lawn to the Quidditch stadium, turned through a gap in the stands, and walked out onto the field. \"What've they done to it?\" Cedric said indignantly, stopping dead. The Quidditch field was no longer smooth and flat.  It looked as though somebody had been building long, low walls all over it that twisted and crisscrossed in every direction. \"They're hedges!\" said Harry, bending to examine the nearest one. \"Hello there!\" called a cheery voice. Ludo Bagman was standing in the middle of the field with Krum and Fleur.  Harry and Cedric made their way toward them, climbing over the hedges.  Fleur beamed at Harry as he came nearer.  Her attitude toward him had changed completely since he had saved her sister from the lake. \"Well, what d'you think?\"  said Bagman happily as Harry and Cedric climbed over the last hedge.  \"Growing nicely, aren't they?  Give them a month and Hagrid'll have them twenty feet high.  Don't worry,\" he added, grinning, spotting the less-than-happy expressions on Harrys and Cedric's faces, \"you'll have your Quidditch field back to normal once the task is over! Now, I imagine you can guess what we're making here?\" No one spoke for a moment. Then - \"Maze,\" grunted Krum. \"That's right!\"  said Bagman.  \"A maze.  The third task's really very straightforward.  The Triwizard Cup will be placed in the center of the maze.  The first champion to touch it will receive full marks.\" \"We seemply 'ave to get through the maze?\" said Fleur. \"There will be obstacles,\" said Bagman happily, bouncing on the balls of his feet. \"Hagrid is providing a number of creatures . . . then there will be spells that must be broken ... all that sort of thing, you know.  Now, the champions who are leading on points will get a head start into the maze.\" Bagman grinned at Harry and Cedric. \"Then Mr. Krum will enter . . . then Miss Delacour.  But you'll all be in with a fighting chance, depending how well you get past the obstacles.  Should be fun, eh?\" Harry, who knew only too well the kind of creatures that Hagrid was likely to provide for an event like this, thought it was unlikely to be any fun at all.  However, he nodded politely like the other champions. \"Very well. . . if you haven't got any questions, we'll go back up to the castle, shall we, it's a bit chilly. ...\" Bagman hurried alongside Harry as they began to wend their way out of the growing maze.  Harry had the feeling that Bagman was going to start offering to help him again, but just then, Krum tapped Harry on the shoulder. \"Could I haff a vord?\" \"Yeah, all right,\" said Harry, slightly surprised. \"Vill you valk vith me?\" \"Okay,\" said Harry curiously. Bagman looked slightly perturbed. \"I'll wait for you. Harry, shall I?\" \"No, it's okay, Mr. Bagman,\" said Harry, suppressing a smile, \"I think I can find the castle on my own, thanks.\" Harry and Krum left the stadium together, but Krum did not set a course for the Durmstrang ship.  Instead, he walked toward the forest. \"What're we going this way for?\" said Harry as they passed Hagrid s cabin and the illuminated Beauxbatons carriage. \"Don't vont to be overheard,\" said Krum shortly. When at last they had reached a quiet stretch of ground a short way from the Beauxbatons horses' paddock, Krum stopped in the shade of the trees and turned to face Harry. \"I vant to know,\" he said, glowering, \"vot there is between you and Hermy-own-ninny.\" Harry, who from Krum's secretive manner had expected something much more serious than this, stared up at Krum in amazement."
}