{
  "id": "33763fc23c2646e4f119ee29eb92e476937b58dd",
  "text": " When it was announced that I was to wed Brandon Stark, Petyr challenged for the right to my hand. It was madness. Brandon was twenty, Petyr scarcely fifteen. I had to beg Brandon to spare Petyr’s life. He let him off with a scar. Afterward my father sent him away. I have not seen him since.  She lifted her face to the spray, as if the brisk wind could blow the memories away.  He wrote to me at Riverrun after Brandon was killed, but I burned the letter unread. By then I knew that Ned would marry me in his brother’s place.   Ser Rodrik’s fingers fumbled once again for nonexistent whiskers.  Littlefinger sits on the small council now.    I knew he would rise high,  Catelyn said.  He was always clever, even as a boy, but it is one thing to be clever and another to be wise. I wonder what the years have done to him.   High overhead, the far-eyes sang out from the rigging. Captain Moreo came scrambling across the deck, giving orders, and all around them the Storm Dancer burst into frenetic activity as King’s Landing slid into view atop its three high hills.  Three hundred years ago, Catelyn knew, those heights had been covered with forest, and only a handful of fisherfolk had lived on the north shore of the Blackwater Rush where that deep, swift river flowed into the sea. Then Aegon the Conqueror had sailed from Dragonstone. It was here that his army had put ashore, and there on the highest hill that he built his first crude redoubt of wood and earth.  Now the city covered the shore as far as Catelyn could see; manses and arbors and granaries, brick storehouses and timbered inns and merchant’s stalls, taverns and graveyards and brothels, all piled one on another. She could hear the clamor of the fish market even at this distance. Between the buildings were broad roads lined with trees, wandering crookback streets, and alleys so narrow that two men could not walk abreast. Visenya’s hill was crowned by the Great Sept of Baelor with its seven crystal towers. Across the city on the hill of Rhaenys stood the blackened walls of the Dragonpit, its huge dome collapsing into ruin, its bronze doors closed now for a century. The Street of the Sisters ran between them, straight as an arrow. The city walls rose in the distance, high and strong.  A hundred quays lined the waterfront, and the harbor was crowded with ships. Deepwater fishing boats and river runners came and went, ferrymen poled back and forth across the Blackwater Rush, trading galleys unloaded goods from Braavos and Pentos and Lys. Catelyn spied the queen’s ornate barge, tied up beside a fat-bellied whaler from the Port of Ibben, its hull black with tar, while upriver a dozen lean golden warships rested in their cribs, sails furled and cruel iron rams lapping at the water.  And above it all, frowning down from Aegon’s high hill, was the Red Keep; seven huge drum-towers crowned with iron ramparts, an immense grim barbican, vaulted halls and covered bridges, barracks and dungeons and granaries, massive curtain walls studded with archers’ nests, all fashioned of pale red stone. Aegon the Conqueror had commanded it built. His son Maegor the Cruel had seen it completed. Afterward he had taken the heads of every stonemason, woodworker, and builder who had labored on it. Only the blood of the dragon would ever know the secrets of the fortress the Dragonlords had built, he vowed.  Yet now the banners that flew from its battlements were golden, not black, and where the three-headed dragon had once breathed fire, now pranced the crowned stag of House Baratheon.  A high-masted swan ship from the Summer Isles was beating out from port, its white sails huge with wind. The Storm Dancer moved past it, pulling steadily for shore.   My lady,  Ser Rodrik said,  I have thought on how best to proceed while I lay abed. You must not enter the castle. I will go in your stead and bring Ser Aron to you in some safe place.   She studied the old knight as the galley drew near to a pier. Moreo was shouting in the vulgar Valyrian of the Free Cities.  You would be as much at risk as I would.   Ser Rodrik smiled.  I think not. I looked at my reflection in the water earlier and scarcely recognized myself. My mother was the last person to see me without whiskers, and she is forty years dead. I believe I am safe enough, my lady.   Moreo bellowed a command. As one, sixty oars lifted from the river, then reversed and backed water. The galley slowed. Another shout. The oars slid back inside the hull. As they thumped against the dock, Tyroshi seamen leapt down to tie up. Moreo came bustling up, all smiles.  King’s Landing, my lady, as you did command, and never has a ship made a swifter or surer passage. Will you be needing assistance to carry your things to the castle?    We shall not be going to the castle. Perhaps you can suggest an inn, someplace clean and comfortable and not too far from the river.   The Tyroshi fingered his forked green beard.  Just so. I know of several establishments that might suit your needs."
}