{
  "id": "33cc8dd7080f05c1aac8ac7d81342fca972fb542",
  "text": "  He rounded on his huntsmen.  If you two have played me false—    There’s been only the one trail, my lord, I swear it,  said Gariss defensively.  And the direwolves would never have parted from them boys. Not for long.   That’s so, Theon thought. Summer and Shaggydog might have gone off to hunt, but soon or late they would return to Bran and Rickon.  Gariss, Murch, take four dogs and double back, find where we lost them. Aggar, you watch them, I’ll have no trickery. Farlen and I will follow the direwolves. Give a blast on the horn when you pick up the trail. Two blasts if you catch sight of the beasts themselves. Once we find where they went, they’ll lead us back to their masters.   He took Wex, the Frey boy, and Gynir Rednose to search upstream. He and Wex rode on one side of the brook, Rednose and Walder Frey on the other, each with a pair of hounds. The wolves might have come out on either bank. Theon kept an eye out for tracks, spoor, broken branches, any hint as to where the direwolves might have left the water. He spied the prints of deer, elk, and badger easily enough. Wex surprised a vixen drinking at the stream, and Walder flushed three rabbits from the underbrush and managed to put an arrow in one. They saw the claw marks where a bear had shredded the bark of a tall birch. But of the direwolves there was no sign.  A little farther, Theon told himself. Past that oak, over that rise, past the next bend of the stream, we’ll find something there. He pressed on long after he knew he should turn back, a growing sense of anxiety gnawing at his belly. It was midday when he wrenched Smiler’s head round in disgust and gave up.  Somehow Osha and the wretched boys were eluding him. It should not have been possible, not on foot, burdened with a cripple and a young child. Every passing hour increased the likelihood that they would make good their escape. If they reach a village… The people of the north would never deny Ned Stark’s sons, Robb’s brothers. They’d have mounts to speed them on their way, food. Men would fight for the honor of protecting them. The whole bloody north would rally around them.  The wolves went downstream, that’s all. He clung to that thought. That red bitch will sniff where they came out of the water and we’ll be after them again.  But when they joined up with Farlen’s party, one look at the kennelmaster’s face smashed all of Theon’s hopes to shards.  The only thing those dogs are fit for is a bear baiting,  he said angrily.  Would that I had a bear.    The dogs are not at fault.  Farlen knelt between a mastiff and his precious red bitch, a hand on each.  Running water don’t hold no scents, m’lord.    The wolves had to come out of the stream somewhere.    No doubt they did. Upstream or down. We keep on, we’ll find the place, but which way?    I never knew a wolf to run up a streambed for miles,  said Reek.  A man might. If he knew he was being hunted, he might. But a wolf?   Yet Theon wondered. These beasts were not as other wolves. I should have skinned the cursed things.  It was the same tale all over again when they rejoined Gariss, Murch, and Aggar. The huntsmen had retraced their steps halfway to Winterfell without finding any sign of where the Starks might have parted company with the direwolves. Farlen’s hounds seemed as frustrated as their masters, sniffing forlornly at trees and rocks and snapping irritably at each other.  Theon dared not admit defeat.  We’ll return to the brook. Search again. This time we’ll go as far as we must.    We won’t find them,  the Frey boy said suddenly.  Not so long as the frogeaters are with them. Mudmen are sneaks, they won’t fight like decent folks, they skulk and use poison arrows, You never see them, but they see you. Those who go into the bogs after them get lost and never come out. Their houses move, even the castles like Greywater Watch.  He glanced nervously at greenery that encircled them on all sides.  They might be out there right now, listening to everything we say.   Farlen laughed to show what he thought of that notion.  My dogs would smell anything in them bushes. Be all over them before you could break wind, boy.    Frogeaters don’t smell like men,  Frey insisted.  They have a boggy stink, like frogs and trees and scummy water. Moss grows under their arms in place of hair, and they can live with nothing to eat but mud and breathe swamp water.   Theon was about to tell him what he ought to do with his wet nurse’s fable when Maester Luwin spoke up.  The histories say the crannogmen grew close to the children of the forest in the days when the greenseers tried to bring the hammer of the waters down upon the Neck. It may be that they have secret knowledge.   Suddenly the wood seemed a deal darker than it had a moment before, as if a cloud had passed before the sun. It was one thing to have some fool boy spouting folly, but maesters were supposed to be wise.  The only children that concern me are Bran and Rickon,  Theon said.  Back to the stream."
}