{
  "id": "33d3722465f8227cded578acc3c094f0114575b4",
  "text": "  She dug a silver piece from her pouch.  The boy looked suspiciously at the coin, and then at Jaime’s manacles.  Why’s this one in irons?    Killed some crossbowmen,  said Jaime.  Do you have ale?    Yes.  The boy lowered the crossbow an inch.  Undo your swordbelts and let them fall, and might be we’ll feed you.  He edged around to peer through the thick, diamond-shaped windowpanes and see if any more of them were outside.  That’s a Tully sail.    We come from Riverrun.  Brienne undid the clasp on her belt and let it clatter to the floor. Ser Cleos followed suit.  A sallow man with a pocked doughy face stepped through the cellar door, holding a butcher’s heavy cleaver.  Three, are you? We got horsemeat enough for three. The horse was old and tough, but the meat’s still fresh.    Is there bread?  asked Brienne.   Hardbread and stale oatcakes.   Jaime grinned.  Now there’s an honest innkeep. They’ll all serve you stale bread and stringy meat, but most don’t own up to it so freely.    I’m no innkeep. I buried him out back, with his women.    Did you kill them?    Would I tell you if I did?  The man spat.  Likely it were wolves’ work, or maybe lions, what’s the difference? The wife and I found them dead. The way we see it, the place is ours now.    Where is this wife of yours?  Ser Cleos asked.  The man gave him a suspicious squint.  And why would you be wanting to know that? She’s not here… no more’n you three will be, unless I like the taste of your silver.   Brienne tossed the coin to him. He caught it in the air, bit it, and tucked it away.   She’s got more,  the boy with the crossbow announced.   So she does. Boy, go down and find me some onions.   The lad raised the crossbow to his shoulder, gave them one last sullen look, and vanished into the cellar.   Your son?  Ser Cleos asked.   Just a boy the wife and me took in. We had two sons, but the lions killed one and the other died of the flux. The boy lost his mother to the Bloody Mummers. These days, a man needs someone to keep watch while he sleeps.  He waved the cleaver at the tables.  Might as well sit.   The hearth was cold, but Jaime picked the chair nearest the ashes and stretched out his long legs under the table. The clink of his chains accompanied his every movement. An irritating sound. Before this is done, I’ll wrap these chains around the wench’s throat, see how she likes them then.  The man who wasn’t an innkeep charred three huge horse steaks and fried the onions in bacon grease, which almost made up for the stale oatcakes. Jaime and Cleos drank ale, Brienne a cup of cider. The boy kept his distance, perching atop the cider barrel with his crossbow across his knees, cocked and loaded. The cook drew a tankard of ale and sat with them.  What news from Riverrun?  he asked Ser Cleos, taking him for their leader.  Ser Cleos glanced at Brienne before answering.  Lord Hoster is failing, but his son holds the fords of the Red Fork against the Lannisters. There have been battles.    Battles everywhere. Where are you bound, ser?    King’s Landing.  Ser Cleos wiped grease off his lips.  Their host snorted.  Then you’re three fools. Last I heard, King Stannis was outside the city walls. They say he has a hundred thousand men and a magic sword.   Jaime’s hands wrapped around the chain that bound his wrists, and he twisted it taut, wishing for the strength to snap it in two. Then I’d show Stannis where to sheathe his magic sword.   I’d stay well clear of that kingsroad, if I were you,  the man went on.  it’s worse than bad, I hear. Wolves and lions both, and bands of broken men preying on anyone they can catch.    Vermin,  declared Ser Cleos with contempt.  Such would never dare to trouble armed men.    Begging your pardon, ser, but I see one armed man, traveling with a woman and a prisoner in chains.   Brienne gave the cook a dark look. The wench does hate being reminded that she’s a wench, Jaime reflected, twisting at the chains again. The links were cold and hard against his flesh, the iron implacable. The manacles had chafed his wrists raw.   I mean to follow the Trident to the sea,  the wench told their host.  We’ll find mounts at Maidenpool and ride by way of Duskendale and Rosby. That should keep us well away from the worst of the fighting.   Their host shook his head.  You’ll never reach Maidenpool by river. Not thirty miles from here a couple boats burned and sank, and the channel’s been silting up around them. There’s a nest of outlaws there preying on anyone tries to come by, and more of the same downriver around the Skipping Stones and Red Deer Island. And the lightning lord’s been seen in these parts as well. He crosses the river wherever he likes, riding this way and that way, never still.    And who is this lightning lord?  demanded Ser Cleos Frey.   Lord Beric, as it please you, ser. They call him that ’cause he strikes so sudden, like lightning from a clear sky. It’s said he cannot die.   They all die when you shove a sword through them, Jaime thought."
}