{
  "id": "33fd089b3caf88f0ab78c8dfda43ced1d4f33f8d",
  "text": " When he shifted his weight, his cage creaked and swayed, and Arya could see pale white stripes where the bars had shielded his flesh from the sun.   Whose men were you?  she asked them.  At the sound of her voice, the fat man opened his eyes. The skin around them was so red they looked like boiled eggs floating in a dish of blood.  Water… a drink…    Whose?  she said again.   Pay them no mind, boy,  the townsman told her.  They’re none o’ your concern. Ride on by.    What did they do?  she asked him.   They put eight people to the sword at Tumbler’s Falls,  he said.  They wanted the Kingslayer, but he wasn’t there so they did some rape and murder.  He jerked a thumb toward the corpse with maggots where his manhood ought to be.  That one there did the raping. Now move along.    A swallow,  the fat one called down.  Ha’ mercy, boy, a swallow.  The old one slid an arm up to grasp the bars. The motion made his cage swing violently.  Water,  gasped the one with the flies in his beard.  She looked at their filthy hair and scraggly beards and reddened eyes, at their dry, cracked, bleeding lips. Wolves, she thought again. Like me. Was this her pack? How could they be Robb’s men? She wanted to hit them. She wanted to hurt them. She wanted to cry. They all seemed to be looking at her, the living and the dead alike. The old man had squeezed three fingers out between the bars.  Water,  he said,  water.   Arya swung down from her horse. They can’t hurt me, they’re dying. She took her cup from her bedroll and went to the fountain.  What do you think you’re doing, boy?  the townsman snapped.  They’re no concern o’ yours.  She raised the cup to the fish’s mouth. The water splashed across her fingers and down her sleeve, but Arya did not move until the cup was brimming over. When she turned back toward the cages, the townsman moved to stop her.  You get away from them, boy—    She’s a girl,  said Harwin.  Leave her be.    Aye,  said Lem.  Lord Beric don’t hold with caging men to die of thirst. Why don’t you hang them decent?    There was nothing decent ’bout them things they did at Tumbler’s Falls,  the townsman growled right back at him.  The bars were too narrow to pass a cup through, but Harwin and Gendry offered her a leg up. She planted a foot in Harwin’s cupped hands, vaulted onto Gendry’s shoulders, and grabbed the bars on top of the cage. The fat man turned his face up and pressed his cheek to the iron, and Arya poured the water over him. He sucked at it eagerly and let it run down over his head and cheeks and hands, and then he licked the dampness off the bars. He would have licked Arya’s fingers if she hadn’t snatched them back. By the time she served the other two the same, a crowd had gathered to watch her.  The Mad Huntsman will hear of this,  a man threatened.  He won’t like it. No, he won’t.    He’ll like this even less, then.  Anguy strung his longbow, slid an arrow from his quiver, nocked, drew, loosed. The fat man shuddered as the shaft drove up between his chins, but the cage would not let him fall. Two more arrows ended the other two northmen. The only sound in the market square was the splash of falling water and the buzzing of flies.  Valar morghulis, Arya thought.  On the east side of the market square stood a modest inn with whitewashed walls and broken windows. Half its roof had burnt off recently, but the hole had been patched over. Above the door hung a wooden shingle painted as a peach, with a big bite taken out of it. They dismounted at the stables sitting catty-corner, and Greenbeard bellowed for grooms.  The buxom red-haired innkeep howled with pleasure at the sight of them, then promptly set to tweaking them.  Greenbeard, is it? Or Greybeard? Mother take mercy, when did you get so old? Lem, is that you? Still wearing the same ratty cloak, are you? I know why you never wash it, I do. You’re afraid all the piss will wash out and we’ll see you’re really a knight o’ the Kingsguard! And Tom o’ Sevens, you randy old goat! You come to see that son o’ yours? Well, you’re too late, he’s off riding with that bloody Huntsman. And don’t tell me he’s not yours!    He hasn’t got my voice,  Tom protested weakly.   He’s got your nose, though. Aye, and t’other parts as well, to hear the girls talk.  She spied Gendry then, and pinched him on the check.  Look at this fine young ox. Wait till Alyce sees those arms. Oh, and he blushes like a maid, too. Well, Alyce will fix that for you, boy, see if she don’t.   Arya had never seen Gendry turn so red.  Tansy, you leave the Bull alone, he’s a good lad,  said Tom Sevenstrings.  All we need from you is safe beds for a night.    Speak for yourself, singer.  Anguy slid his arm around a strapping young serving girl as freckly as he was.   Beds we got,  said red-haired Tansy.  There’s never been no lack o’ beds at the Peach. But you’ll all climb in a tub first. Last time you lot stayed under my roof you left your fleas behind.  She poked Greenbeard in the chest.  And yours was green, too."
}