{
  "id": "342e164fce4d0965888413db963570ca82f9c690",
  "text": " \"You could see if they've got anything for Scabbers, and Hermione can get her owl,\"  So they paid for their ice cream and crossed the street to the Magical Menagerie.  There wasn't much room inside. Every inch of wall was hidden by cages. It was smelly and very noisy because the occupants Of these cages were all squeaking, squawking, jabbering, or hissing. The witch behind the counter was already advising a wizard on the care of double-ended newts, so Harry, Ron, and Hermione waited, examining the cages.  A pair of enormous purple toads sat gulping wetly and feasting on dead blowflies. A gigantic tortoise with a jewel-encrusted shell was glittering near the window. Poisonous orange snails were oozing slowly up the side of their glass tank, and a fat white rabbit kept changing into a silk top hat and back again with a loud popping noise. Then there were cats of every color, a noisy cage of ravens, a basket of funny custard-colored furballs that were humming loudly, and on the counter, a vast cage of sleek black rats that were playing some sort of skipping game using their long, bald tails.  The double-ended newt wizard left, and Ron approached the counter.  \"It's my rat,\" he told the witch. \"He been a bit off-color ever since I brought him back from Egypt.\"  \"Bang him on the counter,\" said the witch, pulling a pair of heavy black spectacles out of her pocket.  Ron lifted Scabbers out of his inside pocket and placed him next to the cage of his fellow rats, who stopped their skipping tricks and scuffled to the wire for a better took.  Like nearly everything Ron owned, Scabbers the rat was secondhand (he had once belonged to Ron's brother Percy) and a bit battered. Next to the glossy rats in the cage, he looked especially woebegone.  \"Hm,\" said the witch, picking up Scabbers. \"How old is this rat?\"  \"Dunno,\" said Ron. \"Quite old. He used to belong to my brother.\"  \"What powers does he have?\" said the witch, examining Scabbers closely.  \"Er --\" The truth was that Scabbers had never shown the faintest trace of interesting powers. The witchs eyes moved from Scabbers's tattered left ear to his front paw, which had a toe missing, and tutted loudly.  \"He's been through the mill, this one,\" she said.  \"He was like that when Percy gave him to me,\" said Ron defensively.  \"An ordinary common or garden rat like this can't be expected to live longer than three years or so,\" said the witch. \"Now, if you were looking for something a bit more hard-wearing, you might like one of these --\"  She indicated the black rats, who promptly started skipping again. Ron muttered, \"Show-offs.\"  \"Well, if you Don't want a replacement, you can try this rat tonic,\" said the witch, reaching under the counter and bringing out a small red bottle.  \"Okay,\" said Ron. \"How much -- OUCH!\"  Ron buckled as something huge and orange came soaring from the top of the highest cage, landed on his head, and then propelled itself, spitting madly, at Scabbers.  \"NO, CROOKSHANKS, NO!\" cried the witch, but Scabbers, shot from between her hands like a bar of soap, landed splay-legged on the floor, and then scampered for the door.  \"Scabbers!\" Ron shouted, racing out of the shop after him; Harry followed.  It took them nearly ten minutes to catch Scabbers, who had taken refuge under a wastepaper bin outside Quality Quidditch Supplies. Ron stuffed the trembling rat back into his pocket and straightened up, massaging his head.  \"What was that?\"  \"It was either a very big cat or quite a small tiger,\" said Harry.  \"Where's Hermione?\"  \"Probably getting her owl  They made their way back up the crowded street to the Magical Menagerie. As they reached it, Hermione came out, but she wasn't carrying an owl. Her arms were clamped tightly around the enormous ginger cat.  \"You bought that monster?\" said Ron, his mouth hanging open.  \"He's gorgeous, isn't he?\" said Hermione, glowing.  That was a matter of opinion, thought Harry. The cat's ginger fur was thick and fluffy, but it was definitely a bit bowlegged and its face looked grumpy and oddly squashed, as though it had run headlong into a brick wall. Now that Scabbers was out of sight, however, the cat was purring contentedly in Hermione's arms.  \"Herinione, that thing nearly scalped me!\" said Ron.  \"He didn't mean to, did you, Crookshanks?\" said Hermione.  \"And what about Scabbers?\" said Ron, pointing at the lump in his chest pocket. \"He needs rest and relaxation! How's he going to get it with that thing around?\"  \"That reminds me, you forgot your rat tonic,\" said Hermione, slapping the small red bottle into Ron's hand. \"And stop worrying, Crookshanks will be sleeping in my dormitory and Scabbers in yours, what's the problem? Poor Crookshanks, that witch said he'd been in there for ages; no one wanted him.\"  \"Wonder why,\" said Ron sarcastically as they set off toward the Leaky Cauldron.  They found Mr. Weasley sitting in the bar, reading the Daily prophet.  \"Harry!\" he said, smiling as he looked up. \"How are you?\"  \"Fine, thanks,\" said Harry as he, Ron, and Hermione joined Mr."
}