{
  "id": "34818f50e2c60ef2233eade60a3758a690be84f8",
  "text": "  Sometimes  he  took  a  fancy  for  fish  from the lake, and sometimes neither goblin nor fish came back.  Actually Gollum  lived on a slimy  island of  rock  in  the middle of  the  lake. He  was  watching  Bilbo  now  from  the  distance  with  his  pale  eyes  like  telescopes.  Bilbo could not see him, but he was wondering a lot about Bilbo, for he could see  that he was no goblin at all.  Gollum got  into his boat  and  shot off  from  the  island, while Bilbo was  sitting  on  the  brink  altogether  flummoxed  and  at  the  end  of  his  way  and  his  wits.  Suddenly up came Gollum and whispered and hissed:  \"Bless  us  and  splash  us, my  precioussss!  I  guess  it's  a  choice  feast;  at  least  a  tasty morsel  it'd make  us,  gollum!\" And when  he  said gollum he made a horrible  swallowing  noise  in  his  throat.  That  is  how  he  got  his  name,  though  he  always  called himself 'my precious.'  The  hobbit  jumped  nearly  out  of  his  skin when  the  hiss  came  in  his  ears,  and  he suddenly saw the pale eyes sticking out at him.   ####-\"Who are you?\" he said, thrusting his dagger in front of him.  \"What iss he, my preciouss?\" whispered Gollum (who always spoke to himself  through  never  having  anyone  else  to  speak  to). This  is what  he  had  come  to  find  out,  for  he was  not  really  very  hungry  at  the moment, only  curious; otherwise he  would have grabbed first and whispered afterwards.  \"I  am Mr. Bilbo Baggins.  I  have  lost  the  dwarves  and  I  have  lost  the wizard,  and I don't know where I am; and \"I don't want to know, if only I can get ,away.\"  \"What's  he  got  in  his  handses?\"  said Gollum,  looking  at  the  sword, which  he  did not quite like.  \"A sword, a blade which came out of Gondolin!\"  \"Sssss,\"  said  Gollum,  and  became  quite  polite.  \"Praps  ye  sits  here  and  chats  with  it  a  bitsy,  my  preciousss.  It  like  riddles,  praps  it  does,  does  it?\"  He  was  anxious  to  appear  friendly,  at  any  rate  for  the  moment,  and  until  he  found  out  more  about  the  sword  and  the  hobbit, whether  he was  quite  alone  really, whether  he  was  good  to  eat,  and  whether  Gollum  was  really  hungry.  Riddles were  all  he  could  think  of.  Asking  them,  and  sometimes  guessing  them,  had  been  the  only  game  he  had  ever  played  with  other  funny  creatures  sitting  in  their  holes  in  the  long, long ago, before he lost all his friends and was driven away, alone, and crept  down, down, into the dark under the mountains.  \"Very  well,\"  said  Bilbo,  who  was  anxious  to  agree,  until  he  found  out  more  about  the  creature, whether  he was  quite  alone, whether  he was  fierce  or  hungry,  and whether he was a friend of the goblins.  \"You ask first,\" he said, because he had not had time to think of a riddle.  So Gollum hissed:     What has roots as nobody sees,  Is taller than trees,  Up, up it goes,  And yet never grows?      \"Easy!\" said Bilbo. \"Mountain, I suppose.\"  \"Does  it  guess  easy?  It  must  have  a  competition  with  us,  my  preciouss!  If  precious asks, and it doesn't answer, we eats it, my preciousss. If it asks us, and we  doesn't answer, then we does what it wants, eh? We shows it the way out, yes!\"  \"All  right!\" said Bilbo, not daring  to disagree, and nearly bursting his brain to  think of riddles that could save him from being eaten.     Thirty white horses on a red hill,   ####-First they champ,  Then they stamp,  Then they stand still.     That was all he could think of to ask-the idea of eating was rather on his mind.  It was rather an old one, too, and Gollum knew the answer as well as you do.  \"Chestnuts,  chestnuts,\"  he  hissed.  \"Teeth!  teeth!  my  preciousss;  but  we  has  only six!\" Then he asked his second:     Voiceless it cries,  Wingless flutters,  Toothless bites,  Mouthless mutters.     \"Half  a  moment!\"  cried  Bilbo,  who  was  still  thinking  uncomfortably  about  eating.  Fortunately  he  had  once  heard  something  rather  like  this  before,  and  getting  his  wits  back  he  thought  of  the  answer.  \"Wind,  wind  of  course,\"  he  said,  and  he was  so  pleased  that  he made  up  one  on  the  spot.  \"This'll  puzzle  the  nasty  little underground creature,\" he thought:     An eye in a blue face  Saw an eye in a green face.  \"That eye is like to this eye\"   Said the first eye,  \"But in low place,  Not in  high place.\"      \"Ss, ss, ss,\" said Gollum. He had been underground a long long time, and was  forgetting  this  sort  of  thing.  But  just  as  Bilbo  was  beginning  to  hope  that  the  wretch  would  not  be  able  to  answer,  Gollum  brought  up  memories  of  ages  and  ages and ages before, when he lived with his grandmother in a hole in a bank by a  river, \"Sss, sss, my preciouss,\" he said. \"Sun on the daisies it means, it does.\"  But  these  ordinary  aboveground  everyday  sort  of  riddles  were  tiring  for  him.  Also  they  reminded  him  of  days  when  he  had  been  less  lonely  and  sneaky  and  nasty, and that put him out of temper."
}