{
  "id": "3620d858155c59909a42184334b70743344ae6e3",
  "text": "  Hot Pie was kneading bread, his arms floured up to his elbows.  Pia saw something in the buttery last night.   Arya made a rude noise. Pia was always seeing things in the buttery. Usually they were men.  Can I have a tart?  she asked.  You baked a whole tray.    I need a whole tray. Ser Amory is partial to them.   She hated Ser Amory.  Let’s spit on them.   Hot Pie looked around nervously. The kitchens were full of shadows and echoes, but the other cooks and scullions were all asleep in the cavernous lofts above the ovens.  He’ll know.    He will not,  Arya said.  You can’t taste spit.    If he does, it’s me they’ll whip.  Hot Pie stopped his kneading.  You shouldn’t even be here. It’s the black of night.   It was, but Arya never minded. Even in the black of night, the kitchens were never still; there was always someone rolling dough for the morning bread, stirring a kettle with a long wooden spoon, or butchering a hog for Ser Amory’s breakfast bacon. Tonight it was Hot Pie.   If Pinkeye wakes and finds you gone—  Hot Pie said.   Pinkeye never wakes.  His true name was Mebble, but everyone called him Pinkeye for his runny eyes.  Not once he’s passed out.  Each morning he broke his fast with ale. Each evening he fell into a drunken sleep after supper, wine-colored spit running down his chin. Arya would wait until she heard him snoring, then creep barefoot up the servant’s stair, making no more noise than the mouse she’d been. She carried neither candle nor taper. Syrio had told her once that darkness could be her friend, and he was right. If she had the moon and the stars to see by, that was enough.  I bet we could escape, and Pinkeye wouldn’t even notice I was gone,  she told Hot Pie.   I don’t want to escape. It’s better here than it was in them woods. I don’t want to eat no worms. Here, sprinkle some flour on the board.   Arya cocked her head.  What’s that?    What? I don’t—    Listen with your ears, not your mouth. That was a warhorn. Two blasts, didn’t you hear? And there, that’s the portcullis chains, someone’s going out or coming in. Want to go see?  The gates of Harrenhal had not been opened since the morning Lord Tywin had marched with his host.   I’m making the morning bread,  Hot Pie complained.  Anyhow I don’t like it when it’s dark, I told you.    I’m going. I’ll tell you after. Can I have a tart?    No.   She filched one anyway, and ate it on her way out. It was stuffed with chopped nuts and fruit and cheese, the crust flaky and still warm from the oven. Eating Ser Amory’s tart made Arya feel daring. Barefoot surefoot lightfoot, she sang under her breath. I am the ghost in Harrenhal.  The horn had stirred the castle from sleep; men were coming out into the ward to see what the commotion was about. Arya fell in with the others. A line of ox carts were rumbling under the portcullis. Plunder, she knew at once. The riders escorting the carts spoke in a babble of queer tongues. Their armor glinted pale in the moonlight, and she saw a pair of striped black-and-white zorses. The Bloody Mummers. Arya withdrew a little deeper into the shadows, and watched as a huge black bear rolled by, caged in the back of a wagon. Other carts were loaded down with silver plate, weapons and shields, bags of flour, pens of squealing hogs and scrawny dogs and chickens. Arya was thinking how long it had been since she’d had a slice off a pork roast when she saw the first of the prisoners.  By his bearing and the proud way he held his head, he must have been a lord. She could see mail glinting beneath his torn red surcoat. At first Arya took him for a Lannister, but when he passed near a torch she saw his device was a silver fist, not a lion. His wrists were bound tightly, and a rope around one ankle tied him to the man behind him, and him to the man behind him, so the whole column had to shuffle along in a lurching lockstep. Many of the captives were wounded. If any halted, one of the riders would trot up and give him a lick of the whip to get him moving again. She tried to judge how many prisoners there were, but lost count before she got to fifty. There were twice that many at least. Their clothing was stained with mud and blood, and in the torchlight it was hard to make out all their badges and sigils, but some of those Arya glimpsed she recognized. Twin towers. Sunburst. Bloody man. Battle-axe. The battle-axe is for Cerwyn, and the white sun on black is Karstark. They’re northmen. My father’s men, and Robb’s. She didn’t like to think what that might mean.  The Bloody Mummers began to dismount. Stableboys emerged sleepy from their straw to tend their lathered horses. One of the riders was shouting for ale. The noise brought Ser Amory Lorch out onto the covered gallery above the ward, flanked by two torchbearers. Goat-helmed Vargo Hoat reined up below him.  My lord cathellan,  the sellsword said. He had a thick, slobbery voice, as if his tongue was too big for his mouth.   What’s all this, Hoat?  Ser Amory demanded, frowning."
}