{
  "id": "363772901fde036658e2e5507f1c11019eb403f9",
  "text": " Without the crack of  a twig or the rustle of a leaf they passed and vanished.       For about an hour they went on, silently, in  single file, oppressed by  the gloom and by the  absolute stillness  of the land,  broken only now  and  again  by the  faint rumbling as  of thunder far away or  drum-beats in some    ####-hollow  of  the hills.  Down  from their hiding-place  they  went,  and then  turning  south they steered as straight a course as Gollum could find across  a long broken slope that leaned up towards the mountains. Presently, not far   ahead, looming up  like a black wall, they saw a belt of trees. As they drew  nearer they  became aware  that  these were of vast  size,  very  ancient it  seemed, and still towering high, though their tops were gaunt and broken, as  if tempest and lightning-blast had swept across them, but had failed to kill  them or to shake their fathomless roots.        'The Cross-roads, yes,' whispered Gollum, the first words that had been  spoken  since they left  their hiding-place. 'We must go  that way.' Turning  eastward  now, he led them up  the slope;  and  then suddenly  there  it was  before them: the Southward Road, winding its way about the outer feet of the  mountains, until presently it plunged  into the great ring of trees.        'This is the only way,' whispered Gollum. 'No paths beyond the road. No  paths. We must go to the Cross-roads. But make haste! Be silent! '       As furtively as scouts within the campment of their enemies, they crept  down on to the road, and stole along its westward edge under the stony bank,  grey as the stones themselves,  and soft -footed  as hunting cats.  At length  they reached the trees, and found that they stood in a great  roofless ring,  open in  the middle to the sombre sky; and the spaces between  their immense  boles  were  like the great  dark arches of  some  ruined  hall. In the very  centre four ways met. Behind them lay the road to the  Morannon; before them  it ran out again upon its  long journey south; to their right the road  from  old  Osgiliath  came  climbing up,  and crossing,  passed out eastward  into  darkness: the fourth way, the road they were to take.       Standing there for a moment filled with dread Frodo became aware that a   light was shining;  he  saw it  glowing  on  Sam's face beside  him. Turning  towards it, he saw, beyond an arch of boughs, the road to  Osgiliath running   almost as straight  as  a stretched ribbon down, down, into the West. There,  far away, beyond sad Gondor now overwhelmed in shade,  the  Sun was  sinking,  finding at last the hem of the great slow-rolling pall of cloud, and falling  in an ominous fire towards the yet unsullied Sea. The brief glow fell upon a   huge sitting  figure, still and solemn as the great stone kings of Argonath.  The years had gnawed it, and violent hands had maimed it. Its head was gone,  and in its place was set in mockery a round rough-hewn stone, rudely painted  by savage hands in the likeness of a grinning face with one large red eye in   ####-the midst  of  its forehead. Upon its knees and mighty chair,  and all about  the pedestal,  were idle  scrawls  mixed  with  the foul  symbols  that  the  maggot-folk of Mordor used.       Suddenly, caught by the level beams,  Frodo saw the old king's head: it  was lying rolled away by the  roadside. `Look, Sam!' he cried, startled into  speech. `Look! The king has got a crown again!'       The eyes  were hollow and the  carven  beard was  broken, but about the  high stern forehead there was a coronal of silver and gold. A trailing plant  with flowers like small white stars had bound  itself across the brows as if  in reverence for the fallen king,  and in the crevices  of  his  stony  hair  yellow stonecrop gleamed.       'They cannot conquer for ever!' said Frodo. And then suddenly the brief  glimpse was gone. The Sun dipped and vanished, and  as if at the  shuttering  of a lamp, black night fell.     ####-   Chapter 8. The Stairs of Cirith Ungol            Gollum  was  tugging  at  Frodo's  cloak  and  hissing  with  fear  and  impatience. `We must go,' he said. `We mustn't stand here. Make haste!'       Reluctantly Frodo turned his back on the West and followed as his guide  led  him, out into the darkness of the East. They left the ring of trees and  crept along the road towards the mountains. This road, too, ran straight for   a while,  but  soon it began to  bend  away southwards,  until it came right  under the great shoulder of rock that they had seen from the distance. Black   and  forbidding  it  loomed  above them, darker  than the  dark  sky behind.  Crawl ing  under  its shadow the road  went on,  and rounding it sprang  east   again and began to climb steeply.       Frodo and Sam were  plodding along with heavy hearts, no longer able to   care greatly  about  their  peril. Frodo's head  was  bowed; his burden  was  dragging him down again. As soon as the great  Cross-roads  had been passed,  the weight of it, almost forgotten in Ithilien, had begun to grow once more."
}