{
  "id": "363dfa13bfbfe80f25ba759fe00f278c2475f24a",
  "text": " However, deciding what to do does not take  Ents so  long as going over all the facts  and events that  they have to make  up their  minds  about. Still, it is no use denying, we shall be here a long  time yet: a couple of  days very likely. So I  have brought you a companion.   He  has an ent-house nearby.  Bregalad  is his  Elvish name. He says  he has  already made up his mind and does not need to remain at the Moot. Hm, hm, he  is the nearest thing among us to a hasty Ent. You ought  to get on together.  Good-bye!' Treebeard turned and left them.       Bregalad  stood for some  time surveying the hobbits solemnly; and they   looked at him, wondering when he would show any signs of 'hastiness'. He was  tall, and seemed to be one of the  younger Ents;  he had smooth shining skin  on  his arms and legs; his lips  were ruddy, and his hair was grey-green. He  could bend and  sway like a slender tree in the wind. At last  he spoke, and  his voice though resonant was higher and clearer than Treebeard's.        'Ha, hmm, my friends, let us go  for a walk!' he said. 'I  am Bregalad,  that  is Quickbeam in your language. But it is on ly  a  nickname, of course.  They have called me that ever since I said yes to an elder Ent before he had  finished his question. Also I drink quickly, and go out while some are still   ####-wetting their beards. Come with me!'       He reached down two shapely arms and gave a long -fingered hand to  each  of  the hobbits. All that day  they  walked  about in  the  woods with  him,  singing, and laughing; for Quickbeam  often  laughed. He laughed if the  sun  came out from  behind  a cloud, he laughed  if  they came upon a  stream  or   spring: then  he stooped  and  splashed  his  feet  and head with water;  he  laughed sometimes  at some sound or whisper in  the trees. Whenever he saw a   rowan-tree he halted a  while  with  his  arms stretched out,  and sang, and  swayed as he sang.       At  nightfall  he  brought  them to his ent-house:  nothing more than a   mossy stone set upon turves under a green bank. Rowan-trees grew in a circle  about it, and there was water  (as in all ent-houses), a spring bubbling out  from the bank. They  talked for a while as darkness fell on  the forest. Not  far away  the voices of  the Entmoot  could be heard still going on; but now  they seemed deeper and less  leisurely,  and every  now  and again one great  voice would rise in a high and  quickening music,  while all the others died  away.  But beside them Bregalad  spoke gently  in their  own  tongue, almost  whispering; and they learned that  he belonged to Skinbark's people, and the   country where they had lived had been ravaged. That  seemed  to the  hobbits  quite enough to explain his 'hastiness', at least in the matter of Orcs.       'There were rowan-trees in my home,'  said Bregalad,  softly and sadly,  'rowan-trees that took root when I was an Enting, many many years ago in the  quiet of the  world. The  oldest were planted by the Ents to try  and please  the Entwives;  but  they looked at them and smiled and  said  that they knew  where  whiter blossom and richer fruit were growing. Yet there are no  trees  of all  that race, the people of the Rose, that are  so beautiful to me. And  these trees grew and grew, till the  shadow of each  was like a  green hall,  and  their red  berries in the  autumn  were  a burden,  and a beauty  and a   wonder. Birds used to flock there. I like birds, even when they chatter; and  the  rowan has enough  and  to  spare. But  the birds became  unfriendly and  greedy  and tore at the trees, and threw  the fruit down and did not eat it.  Then  Orcs came  with axes and cut down my trees. I came  and called them by  their long names, but they did not quiver, they did not hear or answer: they  lay dead.       O Orofarnl, Lassemista, Carnimnril!       O rowan fair, upon your hair how white the blossom lay!       O rowan mine, I saw you shine upon a summer's day,   ####-     Your rind so bright, your leaves so light, your voice so cool and soft:       Upon your head how golden-red the crown you bore aloft!       O rowan dead, upon your head your hair is dry and grey;       Your crown is spilled, your voice is stilled for ever and a day.       O Orofarnl, Lassemista, Carnimnril!       The hobbits  fell asleep to the sound of  the soft singing of Bregalad,  that seemed to lament in many tongues the fall of trees that he had loved.       The next day they spent also in his company,  but they  did not  go far  from his 'house'. Most of the time they sat silent under the shelter  of the  bank; for  the wind was colder, and  the clouds closer and greyer; there was  little sunshine,  and in the  distance the voices  of  the Ents at the  Moot  still  rose  and  fell, sometimes  loud  and strong, sometimes low  and sad,  sometimes  quickening, sometimes slow and solemn as a dirge. A  second night  came and  still  the  Ents  held conclave under hurrying  clouds  and fitful  stars."
}