{
  "id": "36bf913124f806c990318b6ec7b7619d5875ad25",
  "text": " He walked the Boneway barefoot to make peace with Dorne, and rescued the Dragonknight from a snakepit. The vipers refused to strike him because he was so pure and holy.   Prince Oberyn smiled.  If you were a viper, my lady, would you want to bite a bloodless stick like Baelor the Blessed? I’d sooner save my fangs for someone juicier…    My prince is playing with you, Lady Sansa,  said the woman Ellaria Sand.  The septons and singers like to say that the snakes did not bite Baelor, but the truth is very different. He was bitten half a hundred times, and should have died from it.    If he had, Viserys would have reigned a dozen years,  said Tyrion,  and the Seven Kingdoms might have been better served. Some believe Baelor was deranged by all that venom.    Yes,  said Prince Oberyn,  but I’ve seen no snakes in this Red Keep of yours. So how do you account for Joffrey?    I prefer not to.  Tyrion inclined his head stiffly.  If you will excuse us. Our litter awaits.  The dwarf helped Sansa up inside and clambered awkwardly after her.  Close the curtains, my lady, if you’d be so good.    Must we, my lord?  Sansa did not want to be shut behind the curtains.  The day is so lovely.    The good people of King’s Landing are like to throw dung at the litter if they see me inside it. Do us both a kindness, my lady. Close the curtains.    She did as he bid her. They sat for a time, as the air grew warm and stuffy around them.  I was sorry about your book, my lord,  she made herself say.   It was Joffrey’s book. He might have learned a thing or two if he’d read it.  He sounded distracted.  I should have known better. I should have seen… a good many things.    Perhaps the dagger will please him more.   When the dwarf grimaced, his scar tightened and twisted.  The boy’s earned himself a dagger, wouldn’t you say?  Thankfully Tyrion did not wait for her reply.  Joff quarreled with your brother Robb at Winterfell. Tell me, was there ill feeling between Bran and His Grace as well?    Bran?  The question confused her.  Before he fell, you mean?  She had to try and think back. It was all so long ago.  Bran was a sweet boy. Everyone loved him. He and Tommen fought with wooden swords, I remember, but just for play.   Tyrion lapsed back into moody silence. Sansa heard the distant clank of chains from outside; the portcullis was being drawn up. A moment later there was a shout, and their litter swayed into motion. Deprived of the passing scenery, she chose to stare at her folded hands, uncomfortably aware of her husand’s mismatched eyes. Why is he looking at me that way?   You loved your brothers, much as I love Jaime.   Is this some Lannister trap to make me speak treason?  My brothers were traitors, and they’ve gone to traitors’ graves. It is treason to love a traitor.    Her little husband snorted.  Robb rose in arms against his rightful king. By law, that made him a traitor. The others died too young to know what treason was.  He rubbed his nose.  Sansa, do you know what happened to Bran at Winterfell?    Bran fell. He was always climbing things, and finally he fell. We always feared he would. And Theon Greyjoy killed him, but that was later.    Theon Greyjoy.  Tyrion sighed.  Your lady mother once accused me… well, I will not burden you with the ugly details. She accused me falsely. I never harmed your brother Bran. And I mean no harm to you.   What does he want me to say?  That is good to know, my lord.  He wanted something from her, but Sansa did not know what it was. He looks like a starving child, but I have no food to give him. Why won’t he leave me be?  Tyrion rubbed at his scarred, scabby nose yet again, an ugly habit that drew the eye to his ugly face.  You have never asked me how Robb died, or your lady mother.    I… would sooner not know. It would give me bad dreams.    Then I will say no more.    That… that’s kind of you.    Oh, yes,  said Tyrion.  I am the very soul of kindness. And I know about bad dreams.       Tyrion   The new crown that his father had given the Faith stood twice as tall as the one the mob had smashed, a glory of crystal and spun gold. Rainbow light flashed and shimmered every time the High Septon moved his head, but Tyrion had to wonder how the man could bear the weight. And even he had to concede that Joffrey and Margaery made a regal couple, as they stood side-by-side between the towering gilded statues of the Father and the Mother.  The bride was lovely in ivory silk and Myrish lace, her skirts decorated with floral patterns picked out in seed pearls. As Renly’s widow, she might have worn the Baratheon colors, gold and black, yet she came to them a Tyrell, in a maiden’s cloak made of a hundred cloth-of-gold roses sewn to green velvet. He wondered if she really was a maiden. Not that Joffrey is like to know the difference.  The king looked near as splendid as his bride, in his doublet of dusky rose, beneath a cloak of deep crimson velvet blazoned with his stag and lion. The crown rested easily on his curls, gold on gold."
}