{
  "id": "36fb2347dead8d4c4ce08a4529f066c9f27fdb9b",
  "text": " The rest of the world was a bleak emptiness of windswept hills and rocky fields spotted with snow.  Finally a thick voice behind him said,  Seven hells, it’s the dwarf,  and the cage jerked to a sudden stop and hung there, swinging slowly back and forth, the ropes creaking.   Bring him in, damn it.  There was a grunt and a loud groaning of wood as the cage slid sideways and then the Wall was beneath him. Tyrion waited until the swinging had stopped before he pushed open the cage door and hopped down onto the ice. A heavy figure in black was leaning on the winch, while a second held the cage with a gloved hand. Their faces were muffled in woolen scarves so only their eyes showed, and they were plump with layers of wool and leather, black on black.  And what will you be wanting, this time of night?  the one by the winch asked.   A last look.   The men exchanged sour glances.  Look all you want,  the other one said.  Just have a care you don’t fall off, little man. The Old Bear would have our hides.  A small wooden shack stood under the great crane, and Tyrion saw the dull glow of a brazier and felt a brief gust of warmth when the winch men opened the door and went back inside. And then he was alone.  It was bitingly cold up here, and the wind pulled at his clothes like an insistent lover. The top of the Wall was wider than the kingsroad often was, so Tyrion had no fear of falling, although the footing was slicker than he would have liked. The brothers spread crushed stone across the walkways, but the weight of countless footsteps would melt the Wall beneath, so the ice would seem to grow around the gravel, swallowing it, until the path was bare again and it was time to crush more stone.  Still, it was nothing that Tyrion could not manage. He looked off to the east and west, at the Wall stretching before him, a vast white road with no beginning and no end and a dark abyss on either side. West, he decided, for no special reason, and he began to walk that way, following the pathway nearest the north edge, where the gravel looked freshest.  His bare cheeks were ruddy with the cold, and his legs complained more loudly with every step, but Tyrion ignored them. The wind swirled around him, gravel crunched beneath his boots, while ahead the white ribbon followed the lines of the hills, rising higher and higher, until it was lost beyond the western horizon. He passed a massive catapult, as tall as a city wall, its base sunk deep into the Wall. The throwing arm had been taken off for repairs and then forgotten; it lay there like a broken toy, half-embedded in the ice.  On the far side of the catapult, a muffled voice called out a challenge.  Who goes there? Halt!   Tyrion stopped.  If I halt too long I’ll freeze in place, Jon,  he said as a shaggy pale shape slid toward him silently and sniffed at his furs.  Hello, Ghost.   Jon Snow moved closer. He looked bigger and heavier in his layers of fur and leather, the hood of his cloak pulled down over his face.  Lannister,  he said, yanking loose the scarf to uncover his mouth.  This is the last place I would have expected to see you.  He carried a heavy spear tipped in iron, taller than he was, and a sword hung at his side in a leather sheath. Across his chest was a gleaming black warhorn, banded with silver.   This is the last place I would have expected to be seen,  Tyrion admitted.  I was captured by a whim. If I touch Ghost, will he chew my hand off?    Not with me here,  Jon promised.  Tyrion scratched the white wolf behind the ears. The red eyes watched him impassively. The beast came up as high as his chest now. Another year, and Tyrion had the gloomy feeling he’d be looking up at him.  What are you doing up here tonight?  he asked.  Besides freezing your manhood off…    I have drawn night guard,  Jon said.  Again. Ser Alliser has kindly arranged for the watch commander to take a special interest in me. He seems to think that if they keep me awake half the night, I’ll fall asleep during morning drill. So far I have disappointed him.   Tyrion grinned.  And has Ghost learned to juggle yet?    No,  said Jon, smiling,  but Grenn held his own against Halder this morning, and Pyp is no longer dropping his sword quite so often as he did.    Pyp?    Pypar is his real name. The small boy with the large ears. He saw me working with Grenn and asked for help. Thorne had never even shown him the proper way to grip a sword.  He turned to look north.  I have a mile of Wall to guard. Will you walk with me?    If you walk slowly,  Tyrion said.   The watch commander tells me I must walk, to keep my blood from freezing, but he never said how fast.   They walked, with Ghost pacing along beside Jon like a white shadow.  I leave on the morrow,  Tyrion said.   I know.  Jon sounded strangely sad.   I plan to stop at Winterfell on the way south. If there is any message that you would like me to deliver…    Tell Robb that I’m going to command the Night’s Watch and keep him safe, so he might as well take up needlework with the girls and have Mikken melt down his sword for horseshoes."
}