{
  "id": "370160f7dd16d16c9203ad423c3e5be28161e20f",
  "text": "  You will do it quietly and without fuss; I only wish that i could do it myself, but in my present condition...Come, Wormtail, one more death and our path to Harry Potter is clear.  I am not asking you to do it alone.  By that time, my faithful serant will have rejoined us --\"  \"I am a faithful servant,\"  said Wormtail, the merest trace of sullenness in his voice.  \"Wormtail, I need somebody with brains, somebody whose loyalty has never wavered, and you, unfortunately, fulfill neither requirement.\"  \"I found you,\" said Wormtail, and there was definitely a sulky edge to his voice now.  \"I was the one who found you.  I brought you Bertha Jorkins.\"  \"That is true,\" said the second man, sounding amused.  \"A stroke of brilliance I would not have thought possible from you, Wormtail -- though, if truth be told, you were not aware how useful she would be when you caught her, were you?\"  \"I -- I thought she might be useful, My Lord --\"  \"Liar,\" said the second voice again, the cruel amusement more pronounced than ever.  \"However, I do not deny that her information was invaluable.  Without it, I could never have formed our plan, and for that, you will have your reward, Wormtail.  I will allow you to perform an essential task for me, one that many of my followers would give their right hands to perform...\"  \"R-really, My Lord?  What -- ?\"  Wormtail sounded terrified again.  \"Ah, Wormtail, you don't want me to spoil the surprise?  Your part will come at the very end...but I promise you, you will have the honor of being just as useful as Bertha Jorkins.\"  \"You...you...\"  Wormtail's voice suddenly sounded hoarse, as though his mouth had gone very dry.  \"You...are going...to kill me too?\"  \"Wormtail, Wormtail,\" said the cold voice silkily, \"why would I kill you?  I killed Bertha because I had to.  She was fit for nothing after my questioning, quite useless.  In any case, awkward questions would have been asked if she had gone back to the Ministry with the news that she had met you on her holidays.  Wizards who are supposed to be dead would do well not to run into Ministry of Magic witches at wayside inns...\"  Wormtail muttered something so quietly that Frank could not hear it, but it made the second man laugh -- an entirely mirthless laugh, cold as his speech.  \"We could have modified her memory?  But Memory Charms can be broken by a powerful wizard, as I proved when I questioned her.  It would be an insult to her memory not to use the information I extracted from her, Wormtail.\"  Out in the corridor, Frank suddenly became aware that the hand gripping his walking stick was slippery with sweat.  The man with the cold voice had killed a woman.  He was talking about it without any kind of remorse -- with amusement.  He was dangerous -- a madman.  And he was planning more murders -- this boy, Harry Potter, whoever he was -- was in danger --  Frank knew what he must do.  Now, if ever, was the time to go to the police.  He would creep out of the house and head straight for the telephone box in the village...but the cold voice was speaking again, and Frank remained where he was, frozen to the spot, listening with all his might.  \"One more murder...my faithful servant at Hogwarts...Harry Potter is as good as mine, Wormtail.  It is decided.  There will be no more argument.  But quiet...I think I hear Nagini...\"  And the second man's voice changed.  He started making noises such as Frank had never heard before; he was hissing and spitting without drawing breath.  Frank thought he must be having some sort of fit or seizure.  And then Frank heard movement behind him in the dark passageway.  He turned to look, and found himself paralyzed with fright.  Something was slithering toward him along the dark corridor floor, and as it drew nearer to the sliver of firelight, he realized with a thrill of terror that it was a gigantic snake, at least twelve feet long.  Horrified, transfixed, Frank stared as its undulating body cut a wide, curving track through the thick dust on the floor, coming closer and closer -- What was he to do?  The only means of escape was into the room where the two men sat plotting murder, yet if he stayed where he was the snake would surely kill him --  But before he had made his decision, the snake was level with him, and then, incredibly, miraculously, it was passing; it was following the spitting, hissing noises made by the cold voice beyond the door, and in seconds, the tip of its diamond-patterned tail had vanished through the gap.  There was sweat on Frank's forehead now, and the hand on the walking stick was trembling.  Inside the room, the cold voice was continuing to hiss, and Frank was visited by a strange idea, an impossible idea...This man could talk to snakes.  Frank didn't understand what was going on.  He wanted more than anything to be back in his bed with his hot-water bottle.  The problem was that his legs didn't seem to want to move.  As he stood there shaking and trying to master himself, the cold voice switched abruptly to English again."
}