{
  "id": "372148a203450387202e47c9eb7c0c1a63575cc3",
  "text": " Jon searched the sky until he found the Ice Dragon, then turned the mare north for the Wall and Castle Black. The throb of pain in his thigh muscle made him wince as he put his heels into the old man’s horse. I am going home, he told himself. But if that was true, why did he feel so hollow?  He rode till dawn, while the stars stared down like eyes.      Daenerys   Her Dothraki scouts had told her how it was, but Dany wanted to see for herself. Ser Jorah Mormont rode with her through a birchwood forest and up a slanting sandstone ridge.  Near enough,  he warned her at the crest.  Dany reined in her mare and looked across the fields, to where the Yunkish host lay athwart her path. Whitebeard had been teaching her how best to count the numbers of a foe.  Five thousand,  she said after a moment.   I’d say so.  Ser Jorah pointed.  Those are sellswords on the flanks. Lances and mounted bowmen, with swords and axes for the close work. The Second Sons on the left wing, the Stormcrows to the right. About five hundred men apiece. See the banners?   Yunkai’s harpy grasped a whip and iron collar in her talons instead of a length of chain. But the sellswords flew their own standards beneath those of the city they served: on the right four crows between crossed thunderbolts, on the left a broken sword.  The Yunkai’i hold the center themselves,  Dany noted. Their officers looked indistinguishable from Astapor’s at a distance; tall bright helms and cloaks sewn with flashing copper disks.  Are those slave soldiers they lead?    In large part. But not the equal of Unsullied. Yunkai is known for training bed slaves, not warriors.    What say you? Can we defeat this army?    Easily,  Ser Jorah said.   But not bloodlessly.  Blood aplenty had soaked into the bricks of Astapor the day that city fell, though little of it belonged to her or hers.   We might win a battle here, but at such cost we cannot take the city.    That is ever a risk, Khaleesi. Astapor was complacent and vulnerable. Yunkai is forewarned.   Dany considered. The slaver host seemed small compared to her own numbers, but the sellswords were ahorse. She’d ridden too long with Dothraki not to have a healthy respect for what mounted warriors could do to foot. The Unsullied could withstand their charge, but my freedmen will be slaughtered.  The slavers like to talk,  she said.  Send word that I will hear them this evening in my tent. And invite the captains of the sellsword companies to call on me as well. But not together. The Stormcrows at midday, the Second Sons two hours later.    As you wish,  Ser Jorah said.  But if they do not come—    They’ll come. They will be curious to see the dragons and hear what I might have to say, and the clever ones will see it for a chance to gauge my strength.  She wheeled her silver mare about.  I’ll await them in my pavilion.   Slate skies and brisk winds saw Dany back to her host. The deep ditch that would encircle her camp was already half dug, and the woods were full of Unsullied lopping branches off birch trees to sharpen into stakes. The eunuchs could not sleep in an unfortified camp, or so Grey Worm insisted. He was there watching the work. Dany halted a moment to speak with him.  Yunkai has girded up her loins for battle.    This is good, Your Grace. These ones thirst for blood.   When she had commanded the Unsullied to choose officers from amongst themselves, Grey Worm had been their overwhelming choice for the highest rank. Dany had put Ser Jorah over him to train him for command, and the exile knight said that so far the young eunuch was hard but fair, quick to learn, tireless, and utterly unrelenting in his attention to detail.   The Wise Masters have assembled a slave army to meet us.    A slave in Yunkai learns the way of seven sighs and the sixteen seats of pleasure, Your Grace. The Unsullied learn the way of the three spears. Your Grey Worm hopes to show you.   One of the first things Dany had done after the fall of Astapor was abolish the custom of giving the Unsullied new slave names every day. Most of those born free had returned to their birth names; those who still remembered them, at least. Others had called themselves after heroes or gods, and sometimes weapons, gems, and even flowers, which resulted in soldiers with some very peculiar names, to Dany’s ears. Grey Worm had remained Grey Worm. When she asked him why, he said,  It is a lucky name. The name this one was born to was accursed. That was the name he had when he was taken for a slave. But Grey Worm is the name this one drew the day Daenerys Stormborn set him free.    If battle is joined, let Grey Worm show wisdom as well as valor,  Dany told him.  Spare any slave who runs or throws down his weapon. The fewer slain, the more remain to join us after.    This one will remember.    I know he will. Be at my tent by midday. I want you there with my other officers when I treat with the sellsword captains.  Dany spurred her silver on to camp.  Within the perimeter the Unsullied had established, the tents were going up in orderly rows, with her own tall golden pavilion at the center."
}