{
  "id": "376475111893899881d02d2882959ccee4aaf36c",
  "text": " \"What is that supposed to be?\" He was holding up something that looked to Harry like a long, maroon velvet dress. It had a moldy-looking lace frill at the collar and matching lace cuffs. There was a knock on the door, and Mrs. Weasley entered, carrying an armful of freshly laundered Hogwarts robes.  \"Here you are,\" she said, sorting them into two piles. \"Now, mind you pack them properly so they don't crease.\" \"Mum, you've given me Ginny's new dress,\" said Ron, handing it out to her. \"Of course I haven't,\" said Mrs. Weasley. \"That's for you. Dress robes.\" \"What?\" said Ron, looking horror-struck. \"Dress robes!\" repeated Mrs. Weasley. \"It says on your school list that you're supposed to have dress robes this year. . . robes for formal occasions.\" \"You've got to be kidding,\" said Ron in disbelief.  \"I'm not wearing that, no way.\" \"Everyone wears them, Ron!\" said Mrs. Weasley crossly. \"They're all like that! Your father's got some for smart parties!\" \"I'll go starkers before I put that on,\" said Ron stubbornly. \"Don't be so silly,\" said Mrs. Weasley. \"You've got to have dress robes, they're on your list!  I got some for Harry too. . . show him, Harry... .\" In some trepidation, Harry opened the last parcel on his camp bed. It wasn't as bad as he had expected, however; his dress robes didn't have any lace on them at all - in fact, they were more or less the same as his school ones, except that they were bottle green instead of black. \"I thought they'd bring out the color of your eyes, dear,\" said Mrs. Weasley fondly. \"Well, they're okay!\" said Ron angrily, looking at Harry's robes. \"Why couldn't I have some like that?\" \"Because. . . well, I had to get yours secondhand, and there wasn't a lot of choice!\" said Mrs. Weasley, flushing.  Harry looked away. He would willingly have split all the money in his Gringotts vault with the Weasleys, but he knew they would never take it. \"I'm never wearing them,\" Ron was saying stubbornly. \"Never.\" \"Fine,\" snapped Mrs. Weasley. \"Go naked. And, Harry, make sure you get a picture of him.  Goodness knows I could do with a laugh.\" She left the room, slamming the door behind her.  There was a funny spluttering noise from behind them.  Pigwidgeon was choking on an overlarge Owl Treat. \"Why is everything I own rubbish?\" said Ron furiously, striding across the room to unstick Pigwidgeon's beak.   CHAPTER ELEVEN - ABOARD THE HOGWART EXPRESS    There was a definite end-of-the-holidays gloom in the air when Harry awoke next morning.  Heavy rain was still splattering against the window as he got dressed in jeans and a sweatshirt; they would change into their school robes on the Hogwarts Express.   He, Ron, Fred, and George had just reached the first-floor landing on their way down to breakfast, when Mrs. Weasley appeared at the foot of the stairs, looking harassed.   \"Arthur!\"  she called up the staircase. \"Arthur!  Urgent message from the Ministry!\"   Harry flattened himself against the wall as Mr. Weasley came clattering past with his robes on back-to-front and hurtled out of sight.  When Harry and the others entered the kitchen, they saw Mrs. Weasley rummaging anxiously in the drawers - \"I've got a quill here somewhere!\" - and Mr. Weasley bending over the fire, talking to - Harry shut his eyes hard and opened them again to make sure that they were working properly. Amos Diggory's head was sitting in the middle of the flames like a large, bearded egg. It was talking very fast, completely unperturbed by the sparks flying around it and the flames licking its ears. \". . . Muggle neighbors heard bangs and shouting, so they went and called those what-d'you-call-'ems - please-men. Arthur, you've got to get over there --\" \"Here!\" said Mrs. Weasley breathlessly, pushing a piece of parchment, a bottle of ink, and a crumpled quill into Mr. Weasley's hands. \"- it's a real stroke of luck I heard about it,\" said Mr. Diggory's head.  \"I had to come into the office early to send a couple of owls, and I found the Improper Use of Magic lot all setting off -- if Rita Skeeter gets hold of this one, Arthur --\" \"What does Mad-Eye say happened?\"  asked Mr. Weasley, unscrewing the ink bottle, loading up his quill, and preparing to take notes. Mr. Diggory's head rolled its eyes.  \"Says he heard an intruder in his yard. Says he was creeping toward the house, but was ambushed by his dustbins.\" \"What did the dustbins do?\" asked Mr. Weasley, scribbling frantically. \"Made one hell of a noise and fired rubbish everywhere, as far as I can tell,\" said Mr. Diggory.  \"Apparently one of them was still rocketing around when the please-men turned up -\" Mr. Weasley groaned. \"And what about the intruder?\" \"Arthur, you know Mad-Eye,\" said Mr. Diggory's head, rolling its eyes again. \"Someone creeping into his yard in the dead of night?  More likely there's a very shell-shocked cat wandering around somewhere, covered in potato peelings.  But if the Improper Use of Magic lot get their hands on Mad-Eye, he's had it -- think of his record -- we've got to get him off on a minor charge, something in your department -- what are exploding dustbins worth?\" \"Might be a caution,\" said Mr."
}