{
  "id": "38430adff67b1ae8773684ae88a263c93469f4b2",
  "text": "  The  result  of  his  words  was  that  for  the  moment  the  people  quite  forgot  their  idea  of  a  new  king,  and  turned  their angry  thoughts  towards Thorin and his company. Wild and bitter  words were shouted from many sides; and some of those who had before sung the  old  songs  loudest,  were  now  heard  as  loudly  crying  that  the  dwarves  had  stirred  the dragon up against them deliberately!  \"Fools!\" said Bard. \"Why waste words and wrath on those unhappy creatures?  Doubtless  they  perished  first  in  fire,  before  Smaug  came  to  us.\"  Then  even  as  he  was  speaking,  the  thought  came  into  his  heart  of  the  fabled  treasure  of  the  Mountain lying without guard or owner, and he fell suddenly silent. He thought of  the Master's  words,  and  of  Dale  rebuilt,  and  filled  with  golden  bells,  if  he  could  but find the men.  At  length  he  spoke  again:  \"This  is  no  time  for  angry  words.  Master,  or  for  considering weighty plans of change. There is work to do. I serve you still-though  after  a  while  I  may  think  again  of  your  words  and  go  North  with  any  that  will  follow me.\"  Then  he  strode  off  to  help  in  the  ordering  of  the  camps  and  in  the  care  of  the  sick  and  the  wounded.  But  the  Master  scowled  at  his  back  as  he  went,  and  remained  sitting  on  the  ground. He  thought much  but  said  little,  unless  it was  to  call  loudly  for  men  to  bring  him  fire  and  food.  Now  everywhere  Bard  went  he  found  talk  running  like  fire  among  the  people  concerning  the  vast  treasure  that  was  now  unguarded.  Men  spoke  of  the  recompense  for  all  their  harm  that  they  would soon get from it, and wealth over and to spare with which to buy rich things  from  the  South;  and  it  cheered  them  greatly  in  their  plight.  That was as well,  for  the night was bitter and miserable. Shelters could be contrived for few (the Master   ####-had one)  and  there was  little  food  (even  the Master went  short). Many  took  ill of  wet  and  cold  and  sorrow  that  night,  and  afterwards  died,  who  had  escaped  uninjured from the ruin of the town; and in the days that followed there was much  sickness and great hunger.   Meanwhile  Bard  took  the  lead,  and  ordered  things  as  he  wished,  though  always  in  the  Master's  name,  and  he  had  a  hard  task  to  govern  the  people  and  direct  the  preparations  for  their  protection  and  housing.  Probably  most  of  them  would  have  perished  in  the winter  that  now  hurried  after  autumn,  if  help  had  not  been to hand. But help came swiftly; for Bard at once had speedy messengers sent  up  the  river  to  the Forest  to ask  the aid of  the King of  the Elves of  the Wood, and  these messengers had found a host already on the move, although it was then only  the third day after the fall of Smaug.  The Elvenking had received news from his own messengers and from the birds  that  loved  his  folk,  and  already  knew  much  of  what  had  happened.  Very  great  indeed was  the commotion among all  things with wings  that dwelt on  the borders  of  the Desolation of  the Dragon. The  air was  filled with  circling  flocks,  and  their  swift-flying messengers  flew  here  and  there  across  the  sky.  Above  the  borders  of  the  Forest  there  was  whistling,  crying  and  piping.  Far  over  Mirkwood  tidings  spread: \"Smaug is dead!\" Leaves rustled and startled ears were lifted. Even before  the  Elvenking  rode  forth  the  news  had  passed west  right  to  the  pinewoods  of  the  Misty Mountains; Beorn had heard it in his wooden house, and the goblins were at  council in their caves.  \"That  will  be  the  last  we  shall  hear  of  Thorin  Oakenshield,  I  fear,\"  said  the  king. \"He would have done better to have remained my guest. It is an ill wind, all  the  same,\"  he  added,  \"that  blows  no  one  any  good.\"  For  he  too  had  not  forgotten  the legend of the wealth of Thror. So it was that Bard's messengers found him now  marching  with  many  spearmen  and  bowmen;  and  crows  were  gathered  thick,  above him,  for  they  thought  that war was awakening again,  such as had not been  in  those parts  for a  long age. But  the king, when he  received  the prayers of Bard,  had  pity,  for  he  was  the  lord  of  a  good  and  kindly  people;  so  turning  his march,  which  had  at  first  been  direct  towards  the  Mountain,  he  hastened  now  down  the  river  to  the  Long  Lake.  He  had  not  boats  or  rafts  enough  for  his  host,  and  they  were  forced  to  go  the  slower way  by  foot;  but  great  store  of  goods he sent ahead  by water. Still elves are light–footed, and though they were not in these days much  used  to  the  marches  and  the  treacherous  lands  between  the  Forest  and  the  Lake,  their going was swift. Only five days after the death of the dragon they came upon  the  shores and  looked on  the  ruins of  the  town."
}