{
  "id": "38ab1ee18e28924f455189cc42d40aa586989006",
  "text": " I understand. But why are you warning me?\" A sudden, unpleasant thought struck him. \"Hang on - this hasn't got anything to do with Vol- - sorry - with You-Know-Who, has it?  You could just shake or nod,\" he added hastily as Dobby's head tilted worryingly close to the wall again.  Slowly, Dobby shook his head.  \"Not -not He- Who-Must-Not-Be-Named, sir ='  But Dobby's eyes were wide and he seemed to be trying to give Harry a hint. Harry, however, was completely lost.  \"He hasn't got a brother, has he?\"  Dobby shook his head, his eyes wider than ever.  \"Well then, I can't think who else would have a chance of making horrible things happen at Hogwarts,\" said Harry. \"I mean, there's Dumbledore, for one thing - you know who Dumbledore is, don't you?\"  Dobby bowed his head.  \"Albus Dumbledore is the greatest headmaster Hogwarts has ever had. Dobby knows it, sir. Dobby has heard Dumbledore's powers rival those of He-Who-Must-Not-Be-Named at the height of his strength. But, sir\" - Dobby's voice dropped to an urgent whisper - \"there are powers Dumbledore doesn't ... powers no decent wizard. . .\"  And before Harry could stop him, Dobby bounded off the bed, seized Harry's desk lamp, and started beating himself around the head with earsplitting yelps.  A sudden silence fell downstairs. Two seconds later Harry, heart thudding madly, heard Uncle Vernon coming into the hall, calling, \"Dudley must have left his television on again, the little tyke!\"  \"Quick! In the closet!\" hissed Harry, stuffing Dobby in, shutting the door, and flinging himself onto the bed just as the door handle turned.  \"What - the - devil - are - you - doing?\" said Uncle Vernon through gritted teeth, his face horribly close to Harry's. \"You've just ruined the punch line of my Japanese golfer joke .... One more sound and you'll wish you'd never been born, boy!\"  He stomped flat-footed from the room.  Shaking, Harry let Dobby out of the closet.  \"See what it's like here?\" he said. \"See why I've got to go back to Hogwarts? It's the only place I've got -well, I think I've got friends. \"  \"Friends who don't even write to Harry Potter?\" said Dobby slyly.  \"I expect they've just been - wait a minute,\" said Harry, frowning. \"How do you know my friends haven't been writing to me?\"  Dobby shuffled his feet.  \"Harry Potter mustn't be angry with Dobby. Dobby did it for the best - \"  \"Have you been stopping my letters?\"  \"Dobby has them here, sir,\" said the elf. Stepping nimbly out of Harry's reach, he pulled a thick wad of envelopes from the inside of the pillowcase he was wearing. Harry could make out Hermione's neat writing, Ron's untidy scrawl, and even a scribble that looked as though it was from the Hogwarts gamekeeper, Hagrid.  Dobby blinked anxiously up at Harry.  \"Harry Potter mustn't be angry... Dobby hoped ... if Harry Potter thought his friends had forgotten him ... Harry Potter might not want to go back to school, sir . .....  Harry wasn't listening. He made a grab for the letters, but Dobby jumped out of reach.  \"Harry Potter will have them, sir, if he gives Dobby his word  that he will not return to Hogwarts. Ah, sir, this is a danger you must not face! Say you won't go back, sir!\"  \"No,\" said Harry angrily. \"Give me my friends' letters!\"  \"Then Harry Potter leaves Dobby no choice,\" said the elf sadly.  Before Harry could move, Dobby had darted to the bedroom door, pulled it open, and sprinted down the stairs.  Mouth dry, stomach lurching, Harry sprang after him, trying not to make a sound. He jumped the last six steps, landing catlike on the hall carpet, looking around for Dobby. From the dining room he heard Uncle Vernon saying, \". . . tell Petunia that very funny story about those American plumbers, Mr. Mason. She's been dying to hear. . . \"  Harry ran up the hall into the kitchen and felt his stomach disappear.  Aunt Petunia's masterpiece of a pudding, the mountain of cream and sugared violets, was floating up near the ceiling. On top of a cupboard in the corner crouched Dobby.  \"No,\" croaked Harry. \"Please ... they'll kill me ......  \"Harry Potter must say he's not going back to school -\"  \"Dobby ... please ...  \"Say it, sir -\"  \"I can't -\"  Dobby gave him a tragic look.  \"Then Dobby must do it, sir, for Harry Potter's own good.\"  The pudding fell to the floor with a heart-stopping crash. Cream splattered the windows and walls as the dish shattered. With a crack like a whip, Dobby vanished.  There were screams from the dining room and Uncle Vernon  burst into the kitchen to find Harry, rigid with shock, covered from head to foot in Aunt Petunias pudding.  At first, it looked as though Uncle Vernon would manage to gloss the whole thing over. (\"Just our nephew - very disturbed   meeting strangers upsets him, so we kept him upstairs  ) He  shooed the shocked Masons back into the dining room, promised Harry he would flay him to within an inch of his life when the Ma sons had left, and handed him a mop. Aunt Petunia dug some ice cream out of the freezer and Harry, still shaking, started scrubbing the kitchen clean."
}