{
  "id": "38dcd51f2d2bbe34d045f9e9a54fe08065f250c8",
  "text": "  His  fire  belched  forth,  the   ####-hall  smoked,  he  shook  the mountain-roots. He  thrust his head  in vain  at  the  little  hole,  and  then  coiling  his  length  together,  roaring  like  thunder  underground,  he  sped  from  his  deep  lair  through  its  great  door,  out  into  the  huge  passages  of  the  mountain-palace and up towards the Front Gate.  To  hunt  the  whole  mountain  till  he  had  caught  the  thief  and  had  torn  and  trampled  him  was  his  one  thought.  He  issued  from  the  Gate,  the  waters  rose  in  fierce  whistling  steam,  and  up  he  soared  blazing  into  the  air  and  settled  on  the  mountain-top  in  a  spout of green  and  scarlet  flame. The dwarves heard  the  awful  rumour  of  his  flight,  and  they  crouched  against  the  walls  of  the  grassy  terrace  cringing  under  boulders,  hoping  somehow  to  escape  the  frightful  eyes  of  the  hunting dragon.  There they would have all been killed, if it had not been for Bilbo once again.  \"Quick! Quick!\" he gasped. \"The door! The tunnel! It's no good here.\"  Roused  by  these  words  they  were  just  about  to  creep  inside  the  tunnel  when  Bifur gave a cry: \"My cousins! Bombur and Bofur – we have forgotten them, they  are down in the valley!\"  \"They will be slain, and all our ponies too, and all out stores lost,\" moaned the  others. \"We can do nothing.\"  \"Nonsense!\"  said  Thorin,  recovering  his  dignity.  \"We  cannot  leave  them.  Get  inside Mr. Baggins and Balin, and you two Fili and Kili-the dragon shan't have all  of us. Now you others, where are the ropes? Be quick!\"  Those  were  perhaps  the  worst  moments  they  had  been  through  yet.  The  horrible sounds of Smaug's anger were echoing  in  the stony hollows  far above; at  any  moment  he  might  come  blazing  down  or  fly  whirling  round  and  find  them  there,  near  the  perilous  cliff's  edge  hauling  madly  on  the  ropes.  Up  came  Bofur,  and  still  all  was  safe.  Up  came  Bombur,  puffing  and  blowing  while  the  ropes  creaked, and still all was safe. Up came some tools and bundles of stores, and then  danger was upon them. A whirring noise was heard. A red light touched the points  of  standing  rocks.  The  dragon  came.  They  had  barely  time  to  fly  back  to  the  tunnel, pulling and dragging in their bundles, when Smaug came hurtling from the  North, licking the mountain-sides with flame, beating his great wings with a noise  like a roaring wind. His hot breath shrivelled  the grass before  the door, and drove  in  through  the  crack  they  had  left  and  scorched  them  as  they  lay  hid.  Flickering  fires  leaped  up  and  black  rock-shadows  danced.  Then  darkness  fell  as  he  passed  again.  The ponies screamed with terror, burst their ropes and galloped wildly off. The  dragon swooped and turned to pursue them, and was gone.   ####-\"That'll be the end of our poor beasts!\" said Thorin.  \"Nothing  can  escape  Smaug  once  he  sees  it.  Here  we  are  and  here  we  shall  have to stay, unless any one fancies tramping the long open miles back to the river  with Smaug on the watch!\"  It  was  not  a  pleasant  thought!  They  crept  further  down  the  tunnel,  and  there  they  lay  and  shivered  though  it  was  warm  and  stuffy,  until  dawn  came  pale  through  the  crack  of  the  door. Every  now  and  again  through  the  night  they  could  hear the roar of the flying dragon grow and then pass and fade, as he hunted round  and round the mountain-sides.  He  guessed  from  the  ponies,  and  from  the  traces  of  the  camps  he  had  discovered,  that men had  come up  from  the  river  and  the  lake  and had  scaled  the  mountain-side  from  the  valley  where  the  ponies  had  been  standing;  but  the  door  withstood his searching eye, and the little high-walled bay had kept out his fiercest  flames.  Long  he  had  hunted  in  vain  till  the  dawn  chilled  his  wrath  and  he  went  back to his golden couch to sleep – and to gather new strength.  He would not  forget or  forgive  the  theft, not  if a  thousand years turned him to  smouldering  stone,  but  he  could  afford  to  wait.  Slow  and  silent  he  crept  back  to  his lair and half closed his eyes.  When  morning  came  the  terror  of  the  dwarves  grew  less.  They  realized  that  dangers  of  this  kind  were  inevitable  in  dealing  with  such  a  guardian,  and  that  it  was  no  good  giving  up  their  quest  yet.  Nor  could  they  get  away  just  now,  as  Thorin  had  pointed  out. Their  ponies were  lost  or  killed,  and  they would  have  to  wait  some  time  before  Smaug  relaxed  his  watch  sufficiently  for  them  to dare  the  long way on  foot. Luckily  they had  saved  enough of  their  stores  to  last  them  still  for some time.  They debated  long on what was  to be done, but  they could  think of no way of  getting  rid  of  Smaug  –  which  had  always  been  a  weak  point  in  their  plans,  as  Bilbo  felt  inclined  to  point  out."
}