{
  "id": "3a1d9535ed538e57b32b58bd91d3e9db69b1984a",
  "text": " Only those who have matters of import to set before us are like to make the journey.   Bran gazed up at the rough stone ceiling above his head. Robb would tell him not to play the boy, he knew. He could almost hear him, and their lord father as well. Winter is coming, and you are almost a man grown, Bran. You have a duty.  When Hodor came bustling in, smiling and humming tunelessly, he found the boy resigned to his fate. Together they got him washed and brushed.  The white wool doublet today,  Bran commanded.  And the silver brooch. Ser Rodrik will want me to look lordly.  As much as he could, Bran preferred to dress himself, but there were some tasks—pulling on breeches, lacing his boots—that vexed him. They went quicker with Hodor’s help. Once he had been taught to do something, he did it deftly. His hands were always gentle, though his strength was astonishing.  You could have been a knight too, I bet,  Bran told him.  If the gods hadn’t taken your wits, you would have been a great knight.    Hodor?  Hodor blinked at him with guileless brown eyes, eyes innocent of understanding.   Yes,  said Bran.  Hodor.  He pointed.  On the wall beside the door hung a basket, stoutly made of wicker and leather, with holes cut for Bran’s legs. Hodor slid his arms through the straps and cinched the wide belt tight around his chest, then knelt beside the bed. Bran used the bars sunk into the wall to support himself as he swung the dead weight of his legs into the basket and through the holes.   Hodor,  Hodor said again, rising. The stableboy stood near seven feet tall all by himself; on his back Bran’s head almost brushed the ceiling. He ducked low as they passed through the door. One time Hodor smelled bread baking and ran to the kitchens, and Bran got such a crack that Maester Luwin had to sew up his scalp. Mikken had given him a rusty old visorless helm from the armory, but Bran seldom troubled to wear it. The Walders laughed whenever they saw it on his head.  He rested his hands on Hodor’s shoulders as they descended the winding stair. Outside, the sounds of sword and shield and horse already rang through the yard. It made a sweet music. I’ll just have a look, Bran thought, a quick look, that’s all.  The White Harbor lordlings would emerge later in the morning, with their knights and men-at-arms. Until then, the yard belonged to their squires, who ranged in age from ten to forty. Bran wished he were one of them so badly that his stomach hurt with the wanting.  Two quintains had been erected in the courtyard, each a stout post supporting a spinning crossbeam with a shield at one end and a padded butt at the other. The shields had been painted red-and-gold, though the Lannister lions were lumpy and misshapen, and already well scarred by the first boys to take a tilt at them.  The sight of Bran in his basket drew stares from those who had not seen it before, but he had learned to ignore stares. At least he had a good view; on Hodor’s back, he towered over everyone. The Walders were mounting up, he saw. They’d brought fine armor up from the Twins, shining silver plate with enameled blue chasings. Big Walder’s crest was shaped like a castle, while Little Walder favored streamers of blue and grey silk. Their shields and surcoats also set them apart from each other. Little Walder quartered the twin towers of Frey with the brindled boar of his grandmother’s House and the plowman of his mother’s: Crakehall and Darry, respectively. Big Walder’s quarterings were the tree-and-ravens of House Blackwood and the twining snakes of the Paeges. They must be hungry for honor, Bran thought as he watched them take up their lances. A Stark needs only the direwolf.  Their dappled grey coursers were swift, strong, and beautifully trained. Side by side they charged the quintains. Both hit the shields cleanly and were well past before the padded butts came spinning around. Little Walder struck the harder blow, but Bran thought Big Walder sat his horse better. He would have given both his useless legs for the chance to ride against either.  Little Walder cast his splintered lance aside, spied Bran, and reined up.  Now there’s an ugly horse,  he said of Hodor.   Hodor’s no horse,  Bran said.   Hodor,  said Hodor.  Big Walder trotted up to join his cousin.  Well, he’s not as smart as a horse, that’s for certain.  A few of the White Harbor lads poked each other and laughed.   Hodor.  Beaming genially, Hodor looked from one Frey to the other, oblivious to their taunting.  Hodor hodor?   Little Walder’s mount whickered.  See, they’re talking to each other. Maybe hodor means ‘I love you’ in horse.    You shut up, Frey.  Bran could feel his color rising.  Little Walder spurred his horse closer, giving Hodor a bump that pushed him backward.  What will you do if I don’t?    He’ll set his wolf on you, cousin,  warned Big Walder.   Let him. I always wanted a wolfskin cloak.    Summer would tear your fat head off,  Bran said.  Little Walder banged a mailed fist against his breastplate."
}