{
  "id": "3a23ad97125a37bcb0ade7b39a9e465765168ae5",
  "text": " Some of our chaps ought to have  been sent.'       'And  what difference would that have made,  pray?' said Merry. 'We are  not used to footpads in this country, but we know how to deal with them.'       'Footpads, eh?'  said the man: 'So that's your tone, is  it? Change it,  or we'll change  it for you.  You little folk are getting too  uppish. Don't   you trust too much in the Boss's kind heart. Sharkey's come now and he'll do  what Sharkey says.'       'And what may that be?' said Frodo quietly.       'This country wants waking up and setting to rights,' said the ruffian,  'and Sharkey's going to do it; and make it hard, if you drive him to it. You   need a  bigger Boss. And you'll get one  before the year is  out, if there's  any more trouble. Then you'll learn a thing or two, you little rat-folk.'       'Indeed. I am glad to hear of your plans,' said Frodo. 'I am on  my way  to call on Mr. Lotho, and he may be interested to hear of them too.'       The ruffian laughed. 'Lotho! He knows all right. Don't you worry. He'll  do what  Sharkey says. Because if a  Boss  gives trouble, we can change him.   ####-See? And if little folks try to push in where they're not wanted, we can put  them out of mischief. See?'       'Yes, I see,' said Frodo.  'For one thing, I see that you're behind the  times  and the news here. Much has happened  since you  left the South. Your  day is over, and all other ruffians'. The Dark Tower has  fallen, and  there  is  a  King in  Gondor. And  Isengard has been destroyed,  and your precious  master is  a beggar in  the wilderness. I passed him on the road. The King's  messengers will ride up the Greenway now not bullies from Isengard. '       The  man stared at him  and smiled.  'A  beggar in  the wilderness!' he  mocked.  'Oh, is he  indeed? Swagger it, swagger it, my little cock -a -whoop.   But that won't  stop us  living  in this fat  little country  where you have  lazed long enough. And' - he snapped his fingers in Frodo's face   -  'King's  messengers! That for them! When I see one, I'll take notice, perhaps.'       This was too much for  Pippin. His thoughts  went back to  the Field of  Cormallen, and here was a squint-eyed rascal calling the Ring-bearer  'little  cock -a -whoop'. He cast back his cloak, flashed out his sword, and the silver   and sable of Gondor gleamed on him as he rode forward.       'I  am a  messenger of  the  King,' he  said. 'You are speaking  to the  King's friend,  and one  of the most renowned in all the lands  of the West.  You are a ruffian and a fool. Down on your knees in the road and ask pardon,  or I will set this troll's bane in you!'       The sword glinted in the westering sun. Merry and Sam drew their swords  also a nd rode  up to support  Pippin;  but Frodo did  not move. The ruffians  gave back. Scaring  Breeland peasants, and  bullying bewildered hobbits, had  been their work. Fearless  hobbits with  bright swords and grim faces were a   great surprise.  And there  was a note in the voices of these newcomers that  they had not heard before. It chilled them with fear.       'Go!'  said Merry. 'If you trouble this  village again, you will regret  it.'  The three  hobbits  came  on, and then  the ruffians  turned and  fled  running away up the Hobbiton Road; but they blew their horns as they ran.       'Well, we've come back none too soon,' said Merry.       'Not a day too soon. Perhaps too late, at any rate to save Lotho,' said  Frodo. 'Miserable fool, but I am sorry for him.'       'Save Lotho? Whatever do you mean?' said Pippin. 'Destroy  him I should  say.'       'I don't think you quite understand things, Pippin,' said Frodo. 'Lotho  never meant things to come to this pass. He has been a wicked fool, but he's   ####-caught now. The  ruffians are on top, gathering, robbing  and bullying,  and  running or ruining things  as they  like, in his name.  And not  in his name  even for much longer. He's a  prisoner in Bag  End  now,  I expect, and very  frightened. We ought to try and rescue him.'       'Well I  am staggered!' said  Pippin.  'Of all the ends to  our journey  that is the very last I should  have thought  of: to have to fight half-orcs  and ruffians in the Shire itself - to rescue Lotho Pimple!'       'Fight?'  said  Frodo.  'Well,  I  suppose it  may  come  to  that. But  remember: there is to be  no  slaying of hobbits, not even if they have gone  over to the other side. Really gone over, I mean; not just obeying ruffians'  orders  because they  are  frightened.  No hobbit has ever killed another on   purpose in the Shire, and it is not to begin now. And nobody is to be killed  at all,  if it  can be helped. Keep your tempers and hold your hands  to the  last possible moment!'       'But  if  there  are many of  these  ruffians,'  said  Merry,  'it will  certainly mean fighting. You won't rescue Lotho, or the Shire, just by being  shocked and sad, my dear Frodo.'       'No,'  said Pippin. 'It  won't be  so easy scaring them  a second time."
}