{
  "id": "3a245c8071fc5f32f3bf77d16343519f8b7f3411",
  "text": " The memory still gave him bad dreams. He had been as helpless as a baby, no more able to defend himself than Rickon would have been. Less, even… Rickon would have kicked them, at the least. It shamed him. He was only a few years younger than Robb; if his brother was almost a man grown, so was he. He should have been able to protect himself.  A year ago, before, he would have visited the town even if it meant climbing over the walls by himself. In those days he could run down stairs, get on and off his pony by himself, and wield a wooden sword good enough to knock Prince Tommen in the dirt. Now he could only watch, peering out through Maester Luwin’s lens tube. The maester had taught him all the banners: the mailed fist of the Glovers, silver on scarlet; Lady Mormont’s black bear; the hideous flayed man that went before Roose Bolton of the Dreadfort; a bull moose for the Hornwoods; a battle-axe for the Cerwyns; three sentinel trees for the Tallharts; and the fearsome sigil of House Umber, a roaring giant in shattered chains.  And soon enough he learned the faces too, when the lords and their sons and knights retainer came to Winterfell to feast. Even the Great Hall was not large enough to seat all of them at once, so Robb hosted each of the principal bannermen in turn. Bran was always given the place of honor at his brother’s right hand. Some of the lords bannermen gave him queer hard stares as he sat there, as if they wondered by what right a green boy should be placed above them, and him a cripple too.   How many is it now?  Bran asked Maester Luwin as Lord Karstark and his sons rode through the gates in the outer wall.   Twelve thousand men, or near enough as makes no matter.    How many knights?    Few enough,  the maester said with a touch of impatience.  To be a knight, you must stand your vigil in a sept, and be anointed with the seven oils to consecrate your vows. In the north, only a few of the great houses worship the Seven. The rest honor the old gods, and name no knights… but those lords and their sons and sworn swords are no less fierce or loyal or honorable. A man’s worth is not marked by a ser before his name. As I have told you a hundred times before.    Still,  said Bran,  how many knights?   Maester Luwin sighed.  Three hundred, perhaps four… among three thousand armored lances who are not knights.    Lord Karstark is the last,  Bran said thoughtfully.  Robb will feast him tonight.    No doubt he will.    How long before… before they go?    He must march soon, or not at all,  Maester Luwin said.  The winter town is full to bursting, and this army of his will eat the countryside clean if it camps here much longer. Others are waiting to join him all along the kingsroad, barrow knights and crannogmen and the Lords Manderly and Flint. The fighting has begun in the riverlands, and your brother has many leagues to go.    I know.  Bran felt as miserable as he sounded. He handed the bronze tube back to the maester, and noticed how thin Luwin’s hair had grown on top. He could see the pink of scalp showing through. It felt queer to look down on him this way, when he’d spent his whole life looking up at him, but when you sat on Hodor’s back you looked down on everyone.  I don’t want to watch anymore. Hodor, take me back to the keep.    Hodor,  said Hodor.  Maester Luwin tucked the tube up his sleeve.  Bran, your lord brother will not have time to see you now. He must greet Lord Karstark and his sons and make them welcome.    I won’t trouble Robb. I want to visit the godswood.  He put his hand on Hodor’s shoulder.  Hodor.   A series of chisel-cut handholds made a ladder in the granite of the tower’s inner wall. Hodor hummed tunelessly as he went down hand under hand, Bran bouncing against his back in the wicker seat that Maester Luwin had fashioned for him. Luwin had gotten the idea from the baskets the women used to carry firewood on their backs; after that it had been a simple matter of cutting legholes and attaching some new straps to spread Bran’s weight more evenly. It was not as good as riding Dancer, but there were places Dancer could not go, and this did not shame Bran the way it did when Hodor carried him in his arms like a baby. Hodor seemed to like it too, though with Hodor it was hard to tell. The only tricky part was doors. Sometimes Hodor forgot that he had Bran on his back, and that could be painful when he went through a door.  For near a fortnight there had been so many comings and goings that Robb ordered both portcullises kept up and the drawbridge down between them, even in the dead of night. A long column of armored lancers was crossing the moat between the walls when Bran emerged from the tower; Karstark men, following their lords into the castle. They wore black iron halfhelms and black woolen cloaks patterned with the white sunburst. Hodor trotted along beside them, smiling to himself, his boots thudding against the wood of the drawbridge. The riders gave them queer looks as they went by, and once Bran heard someone guffaw."
}