{
  "id": "3a509651b08cf8d16a51aaf8a357d373191a2fb3",
  "text": " In the name of the king and council.    How is King Joffrey taking the news?  Tyrion asked with a certain black amusement.   Cersei has not seen fit to tell him yet,  Lord Tywin said.  She fears he might insist on marching against Renly himself.    With what army?  Tyrion asked.  You don’t plan to give him this one, I hope?    He talks of leading the City Watch,  Lord Tywin said.   If he takes the Watch, he’ll leave the city undefended,  Ser Kevan said.  And with Lord Stannis on Dragonstone…    Yes.  Lord Tywin looked down at his son.  I had thought you were the one made for motley, Tyrion, but it would appear that I was wrong.    Why, Father,  said Tyrion,  that almost sounds like praise.  He leaned forward intently.  What of Stannis? He’s the elder, not Renly. How does he feel about his brother’s claim?   His father frowned.  I have felt from the beginning that Stannis was a greater danger than all the others combined. Yet he does nothing. Oh, Varys hears his whispers. Stannis is building ships, Stannis is hiring sellswords, Stannis is bringing a shadowbinder from Asshai. What does it mean? Is any of it true?  He gave an irritated shrug.  Kevan, bring us the map.   Ser Kevan did as he was bid. Lord Tywin unrolled the leather, smoothing it flat.  Jaime has left us in a bad way. Roose Bolton and the remnants of his host are north of us. Our enemies hold the Twins and Moat Cailin. Robb Stark sits to the west, so we cannot retreat to Lannisport and the Rock unless we choose to give battle. Jaime is taken, and his army for all purposes has ceased to exist. Thoros of Myr and Beric Dondarrion continue to plague our foraging parties. To our east we have the Arryns, Stannis Baratheon sits on Dragonstone, and in the south Highgarden and Storm’s End are calling their banners.   Tyrion smiled crookedly.  Take heart, Father. At least Rhaegar Targaryen is still dead.    I had hoped you might have more to offer us than japes, Tyrion,  Lord Tywin Lannister said.  Ser Kevan frowned over the map, forehead creasing.  Robb Stark will have Edmure Tully and the lords of the Trident with him now. Their combined power may exceed our own. And with Roose Bolton behind us… Tywin, if we remain here, I fear we might be caught between three armies.    I have no intention of remaining here. We must finish our business with young Lord Stark before Renly Baratheon can march from Highgarden. Bolton does not concern me. He is a wary man, and we made him warier on the Green Fork. He will be slow to give pursuit. So… on the morrow, we make for Harrenhal. Kevan, I want Ser Addam’s outriders to screen our movements. Give him as many men as he requires, and send them out in groups of four. I will have no vanishings.    As you say, my lord, but… why Harrenhal? That is a grim, unlucky place. Some call it cursed.    Let them,  Lord Tywin said.  Unleash Ser Gregor and send him before us with his reavers. Send forth Vargo Hoat and his freeriders as well, and Ser Amory Lorch. Each is to have three hundred horse. Tell them I want to see the riverlands afire from the Gods Eye to the Red Fork.    They will burn, my lord,  Ser Kevan said, rising.  I shall give the commands.  He bowed and made for the door.  When they were alone, Lord Tywin glanced at Tyrion.  Your savages might relish a bit of rapine. Tell them they may ride with Vargo Hoat and plunder as they like—goods, stock, women, they may take what they want and burn the rest.    Telling Shagga and Timett how to pillage is like telling a rooster how to crow,  Tyrion commented,  but I should prefer to keep them with me.  Uncouth and unruly they might be, yet the wildlings were his, and he trusted them more than any of his father’s men. He was not about to hand them over.   Then you had best learn to control them. I will not have the city plundered.    The city?  Tyrion was lost.  What city would that be?    King’s Landing. I am sending you to court.   It was the last thing Tyrion Lannister would ever have anticipated.  He reached for his wine, and considered for a moment as he sipped.  And what am I to do there?    Rule,  his father said curtly.  Tyrion hooted with laughter.  My sweet sister might have a word or two to say about that!    Let her say what she likes. Her son needs to be taken in hand before he ruins us all. I blame those jackanapes on the council—our friend Petyr, the venerable Grand Maester, and that cockless wonder Lord Varys. What sort of counsel are they giving Joffrey when he lurches from one folly to the next? Whose notion was it to make this Janos Slynt a lord? The man’s father was a butcher, and they grant him Harrenhal. Harrenhal, that was the seat of kings! Not that he will ever set foot inside it, if I have a say. I am told he took a bloody spear for his sigil. A bloody cleaver would have been my choice.  His father had not raised his voice, yet Tyrion could see the anger in the gold of his eyes.  And dismissing Selmy, where was the sense in that? Yes, the man was old, but the name of Barristan the Bold still has meaning in the realm."
}