{
  "id": "3a772a00310dd1a544c68a986aa319885acd8429",
  "text": " The lantern bathed the grisly scene in a sullen reddish light. Pyp turned aside to retch, and Jon found himself envying Maester Aemon his blindness.  Noye and his men had been waiting within, behind a gate of heavy iron bars like the two Pyp had just unlocked. The two crossbows had gotten off a dozen quarrels as the giant struggled toward them. Then the spearmen must have come to the fore, stabbing through the bars. Still the giant found the strength to reach through, twist the head off Spotted Pate, seize the iron gate, and wrench the bars apart. Links of broken chain lay strewn across the floor. One giant. All this was the work of one giant.   Are they all dead?  Maester Aemon asked softly.   Yes. Donal was the last.  Noye’s sword was sunk deep in the giant’s throat, halfway to the hilt. The armorer had always seemed such a big man to Jon, but locked in the giant’s massive arms he looked almost like a child.  The giant crushed his spine. I don’t know who died first.  He took the lantern and moved forward for a better look.  Mag.  I am the last of the giants. He could feel the sadness there, but he had no time for sadness.  It was Mag the Mighty. The king of the giants.   He needed sun then. It was too cold and dark inside the tunnel, and the stench of blood and death was suffocating. Jon gave the lantern back to Clydas, squeezed around the bodies and through the twisted bars, and walked toward the daylight to see what lay beyond the splintered door.  The huge carcass of a dead mammoth partially blocked the way. One of the beast’s tusks snagged his cloak and tore it as he edged past. Three more giants lay outside, half buried beneath stone and slush and hardened pitch. He could see where the fire had melted the Wall, where great sheets of ice had come sloughing off in the heat to shatter on the blackened ground. He looked up at where they’d come from. When you stand here it seems immense, as if it were about to crush you.  Jon went back inside to where the others waited.  We need to repair the outer gate as best we can and then block up this section of the tunnel. Rubble, chunks of ice, anything. All the way to the second gate, if we can. Ser Wynton will need to take command, he’s the last knight left, but he needs to move now, the giants will be back before we know it. We have to tell him—    Tell him what you will,  said Maester Aemon, gently.  He will smile, nod, and forget. Thirty years ago Ser Wynton Stout came within a dozen votes of being Lord Commander. He would have made a fine one. Ten years ago he would still have been capable. No longer. You know that as well as Donal did, Jon.   It was true.  You give the order, then,  Jon told the maester.  You have been on the Wall your whole life, the men will follow you. We have to close the gate.    I am a maester chained and sworn. My order serves, Jon. We give counsel, not commands.    Someone must—    You. You must lead.    No.    Yes, Jon. It need not be for long. Only until such time as the garrison returns. Donal chose you, and Qhorin Halfhand before him. Lord Commander Mormont made you his steward. You are a son of Winterfell, a nephew of Benjen Stark. It must be you or no one. The Wall is yours, Jon Snow.       Arya   She could feel the hole inside her every morning when she woke. It wasn’t hunger, though sometimes there was that too. It was a hollow place, an emptiness where her heart had been, where her brothers had lived, and her parents. Her head hurt too. Not as bad as it had at first, but still pretty bad. Arya was used to that, though, and at least the lump was going down. But the hole inside her stayed the same. The hole will never feel any better, she told herself when she went to sleep.  Some mornings Arya did not want to wake at all. She would huddle beneath her cloak with her eyes squeezed shut and try to will herself back to sleep. If the Hound would only have left her alone, she would have slept all day and all night.  And dreamed. That was the best part, the dreaming. She dreamed of wolves most every night. A great pack of wolves, with her at the head. She was bigger than any of them, stronger, swifter, faster. She could outrun horses and outfight lions. When she bared her teeth even men would run from her, her belly was never empty long, and her fur kept her warm even when the wind was blowing cold. And her brothers and sisters were with her, many and more of them, fierce and terrible and hers. They would never leave her.  But if her nights were full of wolves, her days belonged to the dog. Sandor Clegane made her get up every morning, whether she wanted to or not. He would curse at her in his raspy voice, or yank her to her feet and shake her. Once he dumped a helm full of cold water all over her head. She bounced up sputtering and shivering and tried to kick him, but he only laughed.  Dry off and feed the bloody horses,  he told her, and she did.  They had two now, Stranger and a sorrel palfrey mare Arya had named Craven, because Sandor said she’d likely run off from the Twins the same as them."
}