{
  "id": "3b4575614b1124039c740bfa1f00407c2d83f959",
  "text": " I do not know. My son may be a king, but I am no queen… only a mother who would keep her children safe, however she could.    I am not made to be a mother. I need to fight.    Then fight… but for the living, not the dead. Renly’s enemies are Robb’s enemies as well.   Brienne stared at the ground and shuffled her feet.  I do not know your son, my lady.  She looked up.  I could serve you. If you would have me.   Catelyn was startled.  Why me?   The question seemed to trouble Brienne.  You helped me. In the pavilion… when they thought that I had… that I had…    You were innocent.    Even so, you did not have to do that. You could have let them kill me. I was nothing to you.   Perhaps I did not want to be the only one who knew the dark truth of what had happened there, Catelyn thought.  Brienne, I have taken many wellborn ladies into my service over the years, but never one like you. I am no battle commander.    No, but you have courage. Not battle courage perhaps but… I don’t know… a kind of woman’s courage. And I think, when the time comes, you will not try and hold me back. Promise me that. That you will not hold me back from Stannis.   Catelyn could still hear Stannis saying that Robb’s turn too would come in time. It was like a cold breath on the back of her neck.  When the time comes, I will not hold you back.   The tall girl knelt awkwardly, unsheathed Renly’s longsword, and laid it at her feet.  Then I am yours, my lady. Your liege man, or… whatever you would have me be. I will shield your back and keep your counsel and give my life for yours, if need be. I swear it by the old gods and the new.    And I vow that you shall always have a place by my hearth and meat and mead at my table, and pledge to ask no service of you that might bring you into dishonor. I swear it by the old gods and the new. Arise.  As she clasped the other woman’s hands between her own, Catelyn could not help but smile. How many times did I watch Ned accept a man’s oath of service? She wondered what he would think if he could see her now.  They forded the Red Fork late the next day, upstream of Riverrun where the river made a wide loop and the waters grew muddy and shallow. The crossing was guarded by a mixed force of archers and pikemen wearing the eagle badge of the Mallisters. When they saw Catelyn’s banners, they emerged from behind their sharpened stakes and sent a man over from the far bank to lead her party across.  Slow and careful like, milady,  he warned as he took the bridle of her horse.  We’ve planted iron spikes under the water, y’see, and there’s caltrops scattered among them rocks there. It’s the same on all the fords, by your brother’s command.   Edmure thinks to fight here. The realization gave her a queasy feeling in the bowels, but she held her tongue.  Between the Red Fork and the Tumblestone, they joined a stream of smallfolk making for the safety of Riverrun. Some were driving animals before them, others pulling wayns, but they made way as Catelyn rode past, and cheered her with cries of  Tully!  or  Stark!  Half a mile from the castle, she passed through a large encampment where the scarlet banner of the Blackwoods waved above the lord’s tent. Lucas took his leave of her there, to seek out his father, Lord Tytos. The rest rode on.  Catelyn spied a second camp strung out along the bank north of the Tumblestone, familiar standards flapping in the wind—Marq Piper’s dancing maiden, Darry’s plowman, the twining red-and-white snakes of the Paeges. They were all her father’s bannermen, lords of the Trident. Most had left Riverrun before she had, to defend their own lands. If they were here again, it could only mean that Edmure had called them back. Gods save us, it’s true, he means to offer battle to Lord Tywin.  Something dark was dangling against the walls of Riverrun, Catelyn saw from a distance. When she rode close, she saw dead men hanging from the battlements, slumped at the ends of long ropes with hempen nooses tight around their necks, their faces swollen and black. The crows had been at them, but their crimson cloaks still showed bright against the sandstone walls.   They have hanged some Lannisters,  Hal Mollen observed.   A pretty sight,  Ser Wendel Manderly said cheerfully.   Our friends have begun without us,  Perwyn Frey jested. The others laughed, all but Brienne, who gazed up at the row of bodies unblinking, and neither spoke nor smiled.  If they have slain the Kingslayer, then my daughters are dead as well. Catelyn spurred her horse to a canter. Hal Mollen and Robin Flint raced past at a gallop, halooing to the gatehouse. The guards on the walls had doubtless spied her banners some time ago, for the portcullis was up as they approached.  Edmure rode out from the castle to meet her, surrounded by three of her father’s sworn men—great-bellied Ser Desmond Grell the master-at-arms, Utherydes Wayn the steward, and Ser Robin Ryger, Riverrun’s big bald captain of guards. They were all three of an age with Lord Hoster, men who had spent their lives in her father’s service."
}