{
  "id": "3b9ef3017a2f162d523674b2667ec2220f4a4f69",
  "text": " A single hard word to end the matter.   Kingslayer,  Ned said. The rumors were true, then. He rode on dangerous ground now, he knew.  An able and courageous man, no doubt,  he said carefully,  but his father is Warden of the West, Robert. In time Ser Jaime will succeed to that honor. No one man should hold both East and West.  He left unsaid his real concern; that the appointment would put half the armies of the realm into the hands of Lannisters.   I will fight that battle when the enemy appears on the field,  the king said stubbornly.  At the moment, Lord Tywin looms eternal as Casterly Rock, so I doubt that Jaime will be succeeding anytime soon. Don’t vex me about this, Ned, the stone has been set.    Your Grace, may I speak frankly?    I seem unable to stop you,  Robert grumbled. They rode through tall brown grasses.   Can you trust Jaime Lannister?    He is my wife’s twin, a Sworn Brother of the Kingsguard, his life and fortune and honor all bound to mine.    As they were bound to Aerys Targaryen’s,  Ned pointed out.   Why should I mistrust him? He has done everything I have ever asked of him. His sword helped win the throne I sit on.   His sword helped taint the throne you sit on, Ned thought, but he did not permit the words to pass his lips.  He swore a vow to protect his king’s life with his own. Then he opened that king’s throat with a sword.    Seven hells, someone had to kill Aerys!  Robert said, reining his mount to a sudden halt beside an ancient barrow.  If Jaime hadn’t done it, it would have been left for you or me.    We were not Sworn Brothers of the Kingsguard,  Ned said. The time had come for Robert to hear the whole truth, he decided then and there.  Do you remember the Trident, Your Grace?    I won my crown there. How should I forget it?    You took a wound from Rhaegar,  Ned reminded him.  So when the Targaryen host broke and ran, you gave the pursuit into my hands. The remnants of Rhaegar’s army fled back to King’s Landing. We followed. Aerys was in the Red Keep with several thousand loyalists. I expected to find the gates closed to us.   Robert gave an impatient shake of his head.  Instead you found that our men had already taken the city. What of it?    Not our men,  Ned said patiently.  Lannister men. The lion of Lannister flew over the ramparts, not the crowned stag. And they had taken the city by treachery.   The war had raged for close to a year. Lords great and small had flocked to Robert’s banners; others had remained loyal to Targaryen. The mighty Lannisters of Casterly Rock, the Wardens of the West, had remained aloof from the struggle, ignoring calls to arms from both rebels and royalists. Aerys Targaryen must have thought that his gods had answered his prayers when Lord Tywin Lannister appeared before the gates of King’s Landing with an army twelve thousand strong, professing loyalty. So the mad king had ordered his last mad act. He had opened his city to the lions at the gate.   Treachery was a coin the Targaryens knew well,  Robert said. The anger was building in him again.  Lannister paid them back in kind. It was no less than they deserved. I shall not trouble my sleep over it.    You were not there,  Ned said, bitterness in his voice. Troubled sleep was no stranger to him. He had lived his lies for fourteen years, yet they still haunted him at night.  There was no honor in that conquest.    The Others take your honor!  Robert swore.  What did any Targaryen ever know of honor? Go down into your crypt and ask Lyanna about the dragon’s honor!    You avenged Lyanna at the Trident,  Ned said, halting beside the king. Promise me, Ned, she had whispered.   That did not bring her back.  Robert looked away, off into the grey distance.  The gods be damned. It was a hollow victory they gave me. A crown… it was the girl I prayed them for. Your sister, safe… and mine again, as she was meant to be. I ask you, Ned, what good is it to wear a crown? The gods mock the prayers of kings and cowherds alike.    I cannot answer for the gods, Your Grace… only for what I found when I rode into the throne room that day,  Ned said.  Aerys was dead on the floor, drowned in his own blood. His dragon skulls stared down from the walls. Lannister’s men were everywhere. Jaime wore the white cloak of the Kingsguard over his golden armor. I can see him still. Even his sword was gilded. He was seated on the Iron Throne, high above his knights, wearing a helm fashioned in the shape of a lion’s head. How he glittered!    This is well known,  the king complained.   I was still mounted. I rode the length of the hall in silence, between the long rows of dragon skulls. It felt as though they were watching me, somehow. I stopped in front of the throne, looking up at him. His golden sword was across his legs, its edge red with a king’s blood. My men were filling the room behind me. Lannister’s men drew back. I never said a word. I looked at him seated there on the throne, and I waited. At last Jaime laughed and got up."
}