{
  "id": "3be2eff516ad413f2672558b4906a7dc0ba2a663",
  "text": " She screamed.  Hey-nonny, hey-nonny, hey-nonny-hey.  The wind flapped her skirts up and bit at her bare legs with cold teeth. She could feel snowflakes melting on her cheeks. Sansa flailed, found Lysa’s thick auburn braid, and clutched it tight.  My hair!  her aunt shrieked.  Let go of my hair!  She was shaking, sobbing. They teetered on the edge. Far off, she heard the guards pounding on the door with their spears, demanding to be let in. Marillion broke off his song.   Lysa! What’s the meaning of this?  The shout cut through the sobs and heavy breathing. Footsteps echoed down the High Hall.  Get back from there! Lysa, what are you doing?  The guards were still beating at the door; Littlefinger had come in the back way, through the lords’ entrance behind the dais.  As Lysa turned, her grip loosened enough for Sansa to rip free. She stumbled to her knees, where Petyr Baelish saw her. He stopped suddenly.  Alayne. What is the trouble here?    Her.  Lady Lysa grabbed a handful of Sansa’s hair.  She’s the trouble. She kissed you.    Tell her,  Sansa begged.  Tell her we were just building a castle…    Be quiet!  her aunt screamed.  I never gave you leave to speak. No one cares about your castle.    She’s a child, Lysa. Cat’s daughter. What did you think you were doing?    I was going to marry her to Robert! She has no gratitude. No… no decency. You are not hers to kiss. Not hers! I was teaching her a lesson, that was all.    I see.  He stroked his chin.  I think she understands now. Isn’t that so, Alayne?    Yes,  sobbed Sansa.  I understand.    I don’t want her here.  Her aunt’s eyes were shiny with tears.  Why did you bring her to the Vale, Petyr? This isn’t her place. She doesn’t belong here.    We’ll send her away, then. Back to King’s Landing, if you like.  He took a step toward them.  Let her up, now. Let her away from the door.    NO!  Lysa gave Sansa’s head another wrench. Snow eddied around them, making their skirts snap noisily.  You can’t want her. You can’t. She’s a stupid empty-headed little girl. She doesn’t love you the way I have. I’ve always loved you. I’ve proved it, haven’t I?  Tears ran down her aunt’s puffy red face.  I gave you my maiden’s gift. I would have given you a son too, but they murdered him with moon tea, with tansy and mint and wormwood, a spoon of honey and a drop of pennyroyal. It wasn’t me, I never knew, I only drank what Father gave me…    That’s past and done, Lysa. Lord Hoster’s dead, and his old maester as well.  Littlefinger moved closer.  Have you been at the wine again? You ought not to talk so much. We don’t want Alayne to know more than she should, do we? Or Marillion?   Lady Lysa ignored that.  Cat never gave you anything. It was me who got you your first post, who made Jon bring you to court so we could be close to one another. You promised me you would never forget that.    Nor have I. We’re together, just as you always wanted, just as we always planned. Just let go of Sansa’s hair…    I won’t! I saw you kissing in the snow. She’s just like her mother. Catelyn kissed you in the godswood, but she never meant it, she never wanted you. Why did you love her best? It was me, it was always meeee!    I know, love.  He took another step.  And I am here. All you need to do is take my hand, come on.  He held it out to her.  There’s no cause for all these tears.    Tears, tears, tears,  she sobbed hysterically.  No need for tears… but that’s not what you said in King’s Landing. You told me to put the tears in Jon’s wine, and I did. For Robert, and for us! And I wrote Catelyn and told her the Lannisters had killed my lord husband, just as you said. That was so clever… you were always clever, I told Father that, I said Petyr’s so clever, he’ll rise high, he will, he will, and he’s sweet and gentle and I have his little baby in my belly… Why did you kiss her? Why? We’re together now, we’re together after so long, so very long, why would you want to kiss herrrrrr?    Lysa,  Petyr sighed,  after all the storms we’ve suffered, you should trust me better. I swear, I shall never leave your side again, for as long as we both shall live.    Truly?  she asked, weeping.  Oh, truly?    Truly. Now unhand the girl and come give me a kiss.   Lysa threw herself into Littlefinger’s arms, sobbing. As they hugged, Sansa crawled from the Moon Door on hands and knees and wrapped her arms around the nearest pillar. She could feel her heart pounding. There was snow in her hair and her right shoe was missing. It must have fallen. She shuddered, and hugged the pillar tighter.  Littlefinger let Lysa sob against his chest for a moment, then put his hands on her arms and kissed her lightly.  My sweet silly jealous wife,  he said, chuckling.  I’ve only loved one woman, I promise you.   Lysa Arryn smiled tremulously.  Only one? Oh, Petyr, do you swear it? Only one?    Only Cat.  He gave her a short, sharp shove.  Lysa stumbled backward, her feet slipping on the wet marble. And then she was gone. She never screamed."
}