{
  "id": "3c3b4342c046b431d78b7184ca305d242578f113",
  "text": "    Unless…  said Catelyn.   Yes?  Ser Brynden prompted.   Unless he must leave Harrenhal,  she said,  to face some other threat.   Her uncle looked at her thoughtfully.  Lord Renly.    King Renly.  If she would ask help from the man, she would need to grant him the style he had claimed for himself.   Perhaps.  The Blackfish smiled a dangerous smile.  He’ll want something, though.    He’ll want what kings always want,  she said.  Homage.       TYRION  Janos Slynt was a butcher’s son, and he laughed like a man chopping meat.  More wine?  Tyrion asked him.   I should not object,  Lord Janos said, holding out his cup. He was built like a keg, and had a similar capacity.  I should not object at all. That’s a fine red. From the Arbor?    Dornish.  Tyrion gestured, and his serving man poured. But for the servants, he and Lord Janos were alone in the Small Hall, at a small candlelit table surrounded by darkness.  Quite the find. Dornish wines are not often so rich.    Rich,  said the big frog-faced man, taking a healthy gulp. He was not a man for sipping, Janos Slynt. Tyrion had made note of that at once.  Yes, rich, that’s the very word I was searching for, the very word. You have a gift for words, Lord Tyrion, if I might say so. And you tell a droll tale. Droll, yes.    I’m pleased you think so… but I’m not a lord, as you are. A simple Tyrion will suffice for me, Lord Janos.    As you wish.  He took another swallow, dribbling wine on the front of his black satin doublet. He was wearing a cloth-of-gold half cape fastened with a miniature spear, its point enameled in dark red. And he was well and truly drunk.  Tyrion covered his mouth and belched politely. Unlike Lord Janos he had gone easy on the wine, but he was very full. The first thing he had done after taking up residence in the Tower of the Hand was inquire after the finest cook in the city and take her into his service. This evening they had supped on oxtail soup, summer greens tossed with pecans, grapes, red fennel, and crumbled cheese, hot crab pie, spiced squash, and quails drowned in butter. Each dish had come with its own wine. Lord Janos allowed that he had never eaten half so well.  No doubt that will change when you take your seat in Harrenhal,  Tyrion said.   For a certainty. Perhaps I should ask this cook of yours to enter my service, what do you say?    Wars have been fought over less,  he said, and they both had a good long laugh.  You’re a bold man to take Harrenhal for your seat. Such a grim place, and huge… costly to maintain. And some say cursed as well.    Should I fear a pile of stone?  He hooted at the notion.  A bold man, you said. You must be bold, to rise. As I have. To Harrenhal, yes! And why not? You know. You are a bold man too, I sense. Small, mayhap, but bold.    You are too kind. More wine?    No. No, truly, I… oh, gods be damned, yes. Why not? A bold man drinks his fill!    Truly.  Tyrion filled Lord Slynt’s cup to the brim.  I have been glancing over the names you put forward to take your place as Commander of the City Watch.    Good men. Fine men. Any of the six will do, but I’d choose Allar Deem. My right arm. Good good man. Loyal. Pick him and you won’t be sorry. If he pleases the king.    To be sure.  Tyrion took a small sip of his own wine.  I had been considering Ser Jacelyn Bywater. He’s been captain on the Mud Gate for three years, and he served with valor during Balon Greyjoy’s Rebellion. King Robert knighted him at Pyke. And yet his name does not appear on your list.   Lord Janos Slynt took a gulp of wine and sloshed it around in his mouth for a moment before swallowing.  Bywater. Well. Brave man, to be sure, yet… he’s rigid, that one. A queer dog. The men don’t like him. A cripple too, lost his hand at Pyke, that’s what got him knighted. A poor trade, if you ask me, a hand for a ser.  He laughed.  Ser Jacelyn thinks overmuch of himself and his honor, as I see it. You’ll do better leaving that one where he is, my lor—Tyrion. Allar Deem’s the man for you.    Deem is little loved in the streets, I am told.    He’s feared. That’s better.    What was it I heard of him? Some trouble in a brothel?    That. Not his fault, my lor—Tyrion. No. He never meant to kill the woman, that was her own doing. He warned her to stand aside and let him do his duty.    Still… mothers and children, he might have expected she’d try to save the babe.  Tyrion smiled.  Have some of this cheese, it goes splendidly with the wine. Tell me, why did you choose Deem for that unhappy task?    A good commander knows his men, Tyrion. Some are good for one job, some for another. Doing for a babe, and her still on the tit, that takes a certain sort. Not every man’d do it. Even if it was only some whore and her whelp.    I suppose that’s so,  said Tyrion, hearing only some whore and thinking of Shae, and Tysha long ago, and all the other women who had taken his coin and his seed over the years.  Slynt went on, oblivious.  A hard man for a hard job, is Deem."
}