{
  "id": "3c6e9534681f429837e568f77697373763b062d0",
  "text": "  He couldn't believe how happy he felt; he had Ron back on his side, he'd gotten through the first task, and he wouldn't have to face the second one for three months. \"Blimey, this is heavy,\" said Lee Jordan, picking up the golden egg, which Harry had left on a table, and weighing it in his hands.  \"Open it, Harry, go on!  Let's just see what's inside it!\" \"He's supposed to work out the clue on his own,\" Hermione said swiftly.  \"It's in the tournament rules. . . .\" \"I was supposed to work out how to get past the dragon on my own too,\" Harry muttered, so only Hermione could hear him, and she grinned rather guiltily. \"Yeah, go on, Harry, open it!\"  several people echoed. Lee passed Harry the egg, and Harry dug his fingernails into the groove that ran all the way around it and prised it open. It was hollow and completely empty - but the moment Harry opened it, the most horrible noise, a loud and screechy wailing, filled the room.  The nearest thing to it Harry had ever heard was the ghost orchestra at Nearly Headless Nick's deathday party, who had all been playing the musical saw. \"Shut it!\"  Fred bellowed, his hands over his ears. \"What was that?\"  said Seamus Finnigan, staring at the egg as Harry slammed it shut again.  \"Sounded like a banshee ... Maybe you've got to get past one of those next, Harry!\" \"It was someone being tortured!\" said Neville, who had gone very white and spilled sausage rolls all over the floor.  \"You're going to have to fight the Cruciatus Curse!\" \"Don't be a prat, Neville, that's illegal,\" said George.  \"They wouldn't use the Cruciatus Curse on the champions.  I thought it sounded a bit like Percy singing . .. maybe you've got to attack him while he's in the shower. Harry.\" \"Want a jam tart, Hermione?\" said Fred. Hermione looked doubtfully at the plate he was offering her. Fred grinned. \"It's all right,\" he said. \"I haven't done anything to them.  It's the custard creams you've got to watch -\" Neville, who had just bitten into a custard cream, choked and spat it out. Fred laughed. \"Just my little joke, Neville.. . .\" Hermione took a jam tart. Then she said, \"Did you get all this from the kitchens, Fred?\" \"Yep,\" said Fred, grinning at her. He put on a high-pitched squeak and imitated a house-elf.  \"'Anything we can get you, sir, anything at all!'  They're dead helpful... get me a roast ox if I said I was peckish.\" \"How do you get in there?\" Hermione said in an innocently casual sort of voice. \"Easy,\" said Fred, \"concealed door behind a painting of a bowl of fruit. Just tickle the pear, and it giggles and -\" He stopped and looked suspiciously at her. \"Why?\" \"Nothing,\" said Hermione quickly. \"Going to try and lead the house-elves out on strike now, are you?\" said George. \"Going to give up all the leaflet stuff and try and stir them up into rebellion?\" Several people chortled. Hermione didn't answer. \"Don't you go upsetting them and telling them they've got to take clothes and salaries!\" said Fred warningly.  \"You'll put them off their cooking!\" Just then, Neville caused a slight diversion by turning into a large canary. \"Oh - sorry, Neville!\" Fred shouted over all the laughter. \"I forgot - it was the custard creams we hexed -\" Within a minute, however, Neville had molted, and once his feathers had fallen off, he reappeared looking entirely normal.  He even joined in laughing. \"Canary Creams!\" Fred shouted to the excitable crowd.  \"George and I invented them - seven Sickles each, a bargain!\" It was nearly one in the morning when Harry finally went up to the dormitory with Ron, Neville, Seamus, and Dean.  Before he pulled the curtains of his four-poster shut.  Harry set his tiny model of the Hungarian Horntail on the table next to his bed, where it yawned, curled up, and closed its eyes.  Really, Harry thought, as he pulled the hangings on his four-poster closed, Hagrid had a point.. . they were all right, really, dragons. . . .  The start of December brought wind and sleet to Hogwarts.  Drafty though the castle always was in winter.  Harry was glad of its fires and thick walls every time he passed the Durmstrang ship on the lake, which was pitching in the high winds, its black sails billowing against the dark skies.  He thought the Beauxbatons caravan was likely to be pretty chilly too. Hagrid, he noticed, was keeping Madame Maxime's horses well provided with their preferred drink of single-malt whiskey; the fumes wafting from the trough in the comer of their paddock was enough to make the entire Care of Magical Creatures class light-headed.  This was unhelpful, as they were still tending the horrible skrewts and needed their wits about them. \"I'm not sure whether they hibernate or not,\" Hagrid told the shivering class in the windy pumpkin patch next lesson.  \"Thought we'd jus' try an see if they fancied a kip . . . we'll jus' settle 'em down in these boxes. . . .\" There were now only ten skrewts left; apparently their desire to kill one another had not been exercised out of them.  Each of them was now approaching six feet in length."
}