{
  "id": "3c764a53528ef1617a45327b514ced4bce13bb77",
  "text": " Finally he said, \"Now, don't be offended or anything, but neither of you are that good at chess --\"  \"We're not offended,\" said Harry quickly. \"Just tell us what to do.\"  \"Well, Harry, you take the place of that bishop, and Hermione, YOU 90 next to him instead of that castle.\"  \"What about you?\"  \"I'm going to be a knight,\" said Ron.  The chessmen seemed to have been listening, because at these words a knight, a bishop, and a castle turned their backs on the white pieces and walked off the board, leaving three empty squares that Harry, Ron, and Hermione took.  \"White always plays first in chess,\" said Ron, peering across the board. \"Yes... look...\"  A white pawn had moved forward two squares.  Ron started to direct the black pieces. They moved silently wherever he sent them. Harry's knees were trembling. What if they lost?  \"Harry -- move diagonally four squares to the right.\"  Their first real shock came when their other knight was taken. The white queen smashed him to the floor and dragged him off the board, where he lay quite still, facedown.  \"Had to let that happen,\" said Ron, looking shaken. \"Leaves you free to take that bishop, Hermione, go on.\"  Every time one of their men was lost, the white pieces showed no mercy. Soon there was a huddle of limp black players slumped along the wall. Twice, Ron only just noticed in time that Harry and Hermione were in danger. He himself darted around the board, taking almost as many white pieces as they had lost black ones.  \"We're nearly there,\" he muttered suddenly. \"Let me think let me think...\"  The white queen turned her blank face toward him.  \"Yes...\" said Ron softly, \"It's the only way... I've got to be taken.\"  \"NOF Harry and Hermione shouted.  \"That's chess!\" snapped Ron. \"You've got to make some sacrifices! I take one step forward and she'll take me -- that leaves you free to checkmate the king, Harry!\"  \"But --\"  \"Do you want to stop Snape or not?\"  \"Ron --\"  \"Look, if you don't hurry up, he'll already have the Stone!\"  There was no alternative.  \"Ready?\" Ron called, his face pale but determined. \"Here I go - now, don't hang around once you've won.\"  He stepped forward, and the white queen pounced. She struck Ron hard across the head with her stone arm, and he crashed to the floor - Hermione screamed but stayed on her square - the white queen dragged Ron to one side. He looked as if he'd been knocked out.  Shaking, Harry moved three spaces to the left.  The white king took off his crown and threw it at Harry's feet. They had won. The chessmen parted and bowed, leaving the door ahead clear. With one last desperate look back at Ron, Harry and Hermione charged through the door and up the next passageway.  \"What if he's --?\"  \"He'll be all right,\" said Harry, trying to convince himself. \"What do you reckon's next?\"  \"We've had Sprout's, that was the Devil's Snare; Flitwick must've put charms on the keys; McGonagall transfigured the chessmen to make them alive; that leaves Quirrell's spell, and Snape's.\"  They had reached another door.  \"All right?\" Harry whispered.  \"Go on.\"  Harry pushed it open.  A disgusting smell filled their nostrils, making both of them pull their robes up over their noses. Eyes watering, they saw, flat on the floor in front of them, a troll even larger than the one they had tackled, out cold with a bloody lump on its head.  \"I'm glad we didn't have to fight that one,\" Harry whispered as they stepped carefully over one of its massive legs. \"Come on, I can't breathe.\"  He pulled open the next door, both of them hardly daring to look at what came next - but there was nothing very frightening in here, just a table with seven differently shaped bottles standing on it in a line.  \"Snape's,\" said Harry. \"What do we have to do?\"  They stepped over the threshold, and immediately a fire sprang up behind them in the doorway. It wasn't ordinary fire either; it was purple. At the same instant, black flames shot up in the doorway leading onward. They were trapped.  \"Look!\" Hermione seized a roll of paper lying next to the bottles. Harry looked over her shoulder to read it:  Danger lies before you, while safety lies behind,  Two of us will help you, which ever you would find,  One among us seven will let you move ahead,  Another will transport the drinker back instead,  Two among our number hold only nettle wine,  Three of us are killers, waiting bidden in line.  Choose, unless you wish to stay here forevermore,  To help you in your choice, we give you these clues four:  First, however slyly the poison tries to hide  You will always find some on nettle wine's left side;  Second, different are those who stand at either end,  But if you would move onward, neither is your friend;  Third, as you see clearly, all are different size,  Neither dwarf nor giant holds death in their insides;  Fourth, the second left and the second on the right  Are twins once you taste them, though different at first sight.  Hermione let out a great sigh and Harry, amazed, saw that she was smiling, the very last thing he felt like doing."
}