{
  "id": "3c9ae72522738e228a5b9c84c33df9680084a27a",
  "text": "    Robb will beat him too.  He turned Dancer’s head toward the stables, oblivious to the puzzled stares the Cerwyns gave him. His blood was roaring in his ears, and had he not been strapped onto his saddle he might well have fallen.  That night Bran prayed to his father’s gods for dreamless sleep. If the gods heard, they mocked his hopes, for the nightmare they sent was worse than any wolf dream.   Fly or die!  cried the three-eyed crow as it pecked at him. He wept and pleaded but the crow had no pity. It put out his left eye and then his right, and when he was blind in the dark it pecked at his brow, driving its terrible sharp beak deep into his skull. He screamed until he was certain his lungs must burst. The pain was an axe splitting his head apart, but when the crow wrenched out its beak all slimy with bits of bone and brain, Bran could see again. What he saw made him gasp in fear. He was clinging to a tower miles high, and his fingers were slipping, nails scrabbling at the stone, his legs dragging him down, stupid useless dead legs.  Help me!  he cried. A golden man appeared in the sky above him and pulled him up.  The things I do for love,  he murmured softly as he tossed him out kicking into empty air.      TYRION   I do not sleep as I did when I was younger,  Grand Maester Pycelle told him, by way of apology for the dawn meeting.  I would sooner be up, though the world be dark, than lie restless abed, fretting on tasks undone,  he said—though his heavy-lidded eyes made him look half-asleep as he said it.  In the airy chambers beneath the rookery, his girl served them boiled eggs, stewed plums, and porridge, while Pycelle served the pontifications.  In these sad times, when so many hunger, I think it only fitting to keep my table spare.    Commendable,  Tyrion admitted, breaking a large brown egg that reminded him unduly of the Grand Maester’s bald spotted head.  I take a different view. If there is food I eat it, in case there is none on the morrow.  He smiled.  Tell me, are your ravens early risers as well?   Pycelle stroked the snowy beard that flowed down his chest.  To be sure. Shall I send for quill and ink after we have eaten?    No need.  Tyrion laid the letters on the table beside his porridge, twin parchments tightly rolled and sealed with wax at both ends.  Send your girl away, so we can talk.    Leave us, child,  Pycelle commanded. The serving girl hurried from the room.  These letters, now…    For the eyes of Doran Martell, Prince of Dorne.  Tyrion peeled the cracked shell away from his egg and took a bite. It wanted salt.  One letter, in two copies. Send your swiftest birds. The matter is of great import.    I shall dispatch them as soon as we have broken our fast.    Dispatch them now. Stewed plums will keep. The realm may not. Lord Renly is leading his host up the roseroad, and no one can say when Lord Stannis will sail from Dragonstone.   Pycelle blinked.  If my lord prefers—    He does.    I am here to serve.  The maester pushed himself ponderously to his feet his chain of office clinking softly. It was a heavy thing, a dozen maester’s collars threaded around and through each other and ornamented with gemstones. And it seemed to Tyrion that the gold and silver and platinum links far outnumbered those of baser metals.  Pycelle moved so slowly that Tyrion had time to finish his egg and taste the plums—overcooked and watery, to his taste—before the sound of wings prompted him to rise. He spied the raven, dark in the dawn sky, and turned briskly toward the maze of shelves at the far end of the room.  The maester’s medicines made an impressive display; dozens of pots sealed with wax, hundreds of stoppered vials, as many milkglass bottles, countless jars of dried herbs, each container neatly labeled in Pycelle’s precise hand. An orderly mind, Tyrion reflected, and indeed, once you puzzled out the arrangement, it was easy to see that every potion had its place. And such interesting things. He noted sweetsleep and nightshade, milk of the poppy, the tears of Lys, powdered greycap, wolfsbane and demon’s dance, basilisk venom, blindeye, widow’s blood…  Standing on his toes and straining upward, he managed to pull a small dusty bottle off the high shelf. When he read the label, he smiled and slipped it up his sleeve.  He was back at the table peeling another egg when Grand Maester Pycelle came creeping down the stairs.  It is done, my lord.  The old man seated himself.  A matter like this… best done promptly, indeed, indeed… of great import, you say?    Oh, yes.  The porridge was too thick, Tyrion felt, and wanted butter and honey. To be sure, butter and honey were seldom seen in King’s Landing of late, though Lord Gyles kept them well supplied in the castle. Half of the food they ate these days came from his lands or Lady Tanda’s. Rosby and Stokeworth lay near the city to the north, and were yet untouched by war.   The Prince of Dorne, himself. Might I ask…    Best not.    As you say.  Pycelle’s curiosity was so ripe that Tyrion could almost taste it."
}