{
  "id": "3ceca37b9ffb7a6383d50cd9f8d1fe9550313ae0",
  "text": " He wasn't in Great Wizards of the Twentieth Century, or Notable Magical Names of Our Time; he was missing, too, from Important Modern Magical Discoveries, and A Study of Recent Developments in Wizardry. And then, of course, there was the sheer size of the library; tens of thousands of books; thousands of shelves; hundreds of narrow rows.  Hermione took out a list of subjects and titles she had decided to search while Ron strode off down a row of books and started pulling them off the shelves at random. Harry wandered over to the Restricted Section. He had been wondering for a while if Flamel wasn't somewhere in there. Unfortunately, you needed a specially signed note from one of the teachers to look in any of the restricted books, and he knew he'd never get one. These were the books containing powerful Dark Magic never taught at Hogwarts, and only read by older students studying advanced Defense Against the Dark Arts.  \"What are you looking for, boy?\"  \"Nothing,\" said Harry.  Madam Pince the librarian brandished a feather duster at him.  \"You'd better get out, then. Go on -- out!\"  Wishing he'd been a bit quicker at thinking up some story, Harry left the library. He, Ron, and Hermione had already agreed they'd better not ask Madam Pince where they could find Flamel. They were sure she'd be able to tell them, but they couldn't risk Snape hearing what they were up to.  Harry waited outside in the corridor to see if the other two had found anything, but he wasn't very hopeful. They had been looking for two weeks, after A, but as they only had odd moments between lessons it wasn't surprising they'd found nothing. What they really needed was a nice long search without Madam Pince breathing down their necks.  Five minutes later, Ron and Hermione joined him, shaking their heads. They went off to lunch.  \"You will keep looking while I'm away, won't you?\" said Hermione. \"And send me an owl if you find anything.\"  \"And you could ask your parents if they know who Flamel is,\" said Ron. \"It'd be safe to ask them.\"  \"Very safe, as they're both dentists,\" said Hermione.  Once the holidays had started, Ron and Harry were having too good a time to think much about Flamel. They had the dormitory to themselves and the common room was far emptier than usual, so they were able to get the good armchairs by the fire. They sat by the hour eating anything they could spear on a toasting fork -- bread, English muffins, marshmallows -- and plotting ways of getting Malfoy expelled, which were fun to talk about even if they wouldn't work.  Ron also started teaching Harry wizard chess. This was exactly like Muggle chess except that the figures were alive, which made it a lot like directing troops in battle. Ron's set was very old and battered. Like everything else he owned, it had once belonged to someone else in his family -- in this case, his grandfather. However, old chessmen weren't a drawback at all. Ron knew them so well he never had trouble getting them to do what he wanted.  Harry played with chessmen Seamus Finnigan had lent him, and they didn't trust him at all. He wasn't a very good player yet and they kept shouting different bits of advice at him, which was confusing. \"Don't send me there, can't you see his knight? Send him, we can afford to lose him.\" On Christmas Eve, Harry went to bed looking forward to the next day for the food and the fun, but not expecting any presents at all. When he woke early in the morning, however, the first thing he saw was a small pile of packages at the foot of his bed.  \"Merry Christmas,\" said Ron sleepily as Harry scrambled out of bed and pulled on his bathrobe.  \"You, too,\" said Harry. \"Will you look at this? I've got some presents!\"  \"What did you expect, turnips?\" said Ron, turning to his own pile, which was a lot bigger than Harry's.  Harry picked up the top parcel. It was wrapped in thick brown paper and scrawled across it was To Harry, from Hagrid. Inside was a roughly cut wooden flute. Hagrid had obviously whittled it himself. Harry blew it -- it sounded a bit like an owl.  A second, very small parcel contained a note.  We received your message and enclose your Christmas present. From Uncle Vernon and Aunt Petunia. Taped to the note was a fifty-pence piece.  \"That's friendly,\" said Harry.  Ron was fascinated by the fifty pence.  \"Weird!\" he said, 'NMat a shape! This is money?\"  \"You can keep it,\" said Harry, laughing at how pleased Ron was. \"Hagrid and my aunt and uncle -- so who sent these?\"  \"I think I know who that one's from,\" said Ron, turning a bit pink and pointing to a very lumpy parcel. \"My mom. I told her you didn't expect any presents and -- oh, no,\" he groaned, \"she's made you a Weasley sweater.\"  Harry had torn open the parcel to find a thick, hand-knitted sweater in emerald green and a large box of homemade fudge.  \"Every year she makes us a sweater,\" said Ron, unwrapping his own, \"and mine's always maroon.\"  \"That's really nice of her,\" said Harry, trying the fudge, which was very tasty."
}