{
  "id": "3d22dc978cde8670d6c2f30af1965c7e248ee3f2",
  "text": " Nothing else remained of a curtain wall that had once stood as high as Winterfell’s. The wooden keep was gone entirely, rotted away a thousand years past, with not so much as a timber to mark where it had stood. All that was left of the great stronghold of the First Men were three towers… three where there had once been twenty, if the taletellers could be believed.  The Gatehouse Tower looked sound enough, and even boasted a few feet of standing wall to either side of it. The Drunkard’s Tower, off in the bog where the south and west walls had once met, leaned like a man about to spew a bellyful of wine into the gutter. And the tall, slender Children’s Tower, where legend said the children of the forest had once called upon their nameless gods to send the hammer of the waters, had lost half its crown. It looked as if some great beast had taken a bite out of the crenellations along the tower top, and spit the rubble across the bog. All three towers were green with moss. A tree was growing out between the stones on the north side of the Gatehouse Tower, its gnarled limbs festooned with ropy white blankets of ghostskin.   Gods have mercy,  Ser Brynden exclaimed when he saw what lay before them.  This is Moat Cailin? It’s no more than a—    —death trap,  Catelyn finished.  I know how it looks, Uncle. I thought the same the first time I saw it, but Ned assured me that this ruin is more formidable than it seems. The three surviving towers command the causeway from all sides, and any enemy must pass between them. The bogs here are impenetrable, full of quicksands and suckholes and teeming with snakes. To assault any of the towers, an army would need to wade through waist-deep black muck, cross a moat full of lizard-lions, and scale walls slimy with moss, all the while exposing themselves to fire from archers in the other towers.  She gave her uncle a grim smile.  And when night falls, there are said to be ghosts, cold vengeful spirits of the north who hunger for southron blood.   Ser Brynden chuckled.  Remind me not to linger here. Last I looked, I was southron myself.   Standards had been raised atop all three towers. The Karstark sunburst hung from the Drunkard’s Tower, beneath the direwolf; on the Children’s Tower it was the Greatjon’s giant in shattered chains. But on the Gatehouse Tower, the Stark banner flew alone. That was where Robb had made his seat. Catelyn made for it, with Ser Brynden and Ser Wendel behind her, their horses stepping slowly down the log-and-plank road that had been laid across the green-and-black fields of mud.  She found her son surrounded by his father’s lords bannermen, in a drafty hall with a peat fire smoking in a black hearth. He was seated at a massive stone table, a pile of maps and papers in front of him, talking intently with Roose Bolton and the Greatjon. At first he did not notice her… but his wolf did. The great grey beast was lying near the fire, but when Catelyn entered he lifted his head, and his golden eyes met hers. The lords fell silent one by one, and Robb looked up at the sudden quiet and saw her.  Mother?  he said, his voice thick with emotion.  Catelyn wanted to run to him, to kiss his sweet brow, to wrap him in her arms and hold him so tightly that he would never come to harm… but here in front of his lords, she dared not. He was playing a man’s part now, and she would not take that away from him. So she held herself at the far end of the basalt slab they were using for a table. The direwolf got to his feet and padded across the room to where she stood. It seemed bigger than a wolf ought to be.  You’ve grown a beard,  she said to Robb, while Grey Wind sniffed her hand.  He rubbed his stubbled jaw, suddenly awkward.  Yes.  His chin hairs were redder than the ones on his head.   I like it.  Catelyn stroked the wolfs head, gently.  It makes you look like my brother Edmure.  Grey Wind nipped at her fingers, playful, and trotted back to his place by the fire.  Ser Helman Tallhart was the first to follow the direwolf across the room to pay his respects, kneeling before her and pressing his brow to her hand.  Lady Catelyn,  he said,  you are fair as ever, a welcome sight in troubled times.  The Glovers followed, Galbart and Robett, and Greatjon Umber, and the rest, one by one. Theon Greyjoy was the last.  I had not looked to see you here, my lady,  he said as he knelt.   I had not thought to be here,  Catelyn said,  until I came ashore at White Harbor, and Lord Wyman told me that Robb had called the banners. You know his son, Ser Wendel.  Wendel Manderly stepped forward and bowed as low as his girth would allow.  And my uncle, Ser Brynden Tully, who has left my sister’s service for mine.    The Blackfish,  Robb said.  Thank you for joining us, ser. We need men of your courage. And you, Ser Wendel, I am glad to have you here. Is Ser Rodrik with you as well, Mother? I’ve missed him.    Ser Rodrik is on his way north from White Harbor. I have named him castellan and commanded him to hold Winterfell till our return."
}