{
  "id": "3d309bb69b75df90da598da26692de958f5149eb",
  "text": " . . Potter!\" Harry never knew whether or not he had actually dropped off to sleep - his fantasies of flying like Krum might well have slipped into actual dreams - all he knew was that, quite suddenly, Mr. Weasley was shouting. \"Get up! Ron - Harry - come on now, get up, this is urgent!\"  Harry sat up quickly and the top of his head hit canvas. \"S' matter?\" he said. Dimly, he could tell that something was wrong.  The noises in the campsite had changed. The singing had stopped.  He could hear screams, and the sound of people running.  He slipped down from the bunk and reached for his clothes, but Mr. Weasley, who had pulled on his jeans over his own pajamas, said, \"No time, Harry - just grab a jacket and get outside - quickly!\" Harry did as he was told and hurried out of the tent, Ron at his heels. By the light of the few fires that were still burning, he could see people running away into the woods, fleeing something that was moving across the field toward them, something that was emitting odd flashes of light and noises like gunfire.  Loud jeering, roars of laughter, and drunken yells were drifting toward them; then came a burst of strong green light, which illuminated the scene. A crowd of wizards, tightly packed and moving together with wands pointing straight upward, was marching slowly across the field. Harry squinted at them. . . . They didn't seem to have faces. . . . Then he realized that their heads were hooded and their faces masked.  High above them, floating along in midair, four struggling figures were being contorted into grotesque shapes.  It was as though the masked wizards on the ground were puppeteers, and the people above them were marionettes operated by invisible strings that rose from the wands into the air. Two of the figures were very small. More wizards were joining the marching group, laughing and pointing up at the floating bodies.  Tents crumpled and fell as the marching crowd swelled.  Once or twice Harry saw one of the marchers blast a tent out of his way with his wand.  Several caught fire.  The screaming grew louder. The floating people were suddenly illuminated as they passed over a burning tent and Harry recognized one of them:  Mr. Roberts, the campsite manager.  The other three looked as though they might be his wife and children.  One of the marchers below flipped Mrs. Roberts upside down with his wand; her nightdress fell down to reveal voluminous drawers and she struggled to cover herself up as the crowd below her screeched and hooted with glee. \"That's sick,\" Ron muttered, watching the smallest Muggle child, who had begun to spin like a top, sixty feet above the ground, his head flopping limply from side to side. \"That is really sick. . . .\" Hermione and Ginny came hurrying toward them, pulling coats over their nightdresses, with Mr. Weasley right behind them.  At the same moment, Bill, Charlie, and Percy emerged from the boys' tent, fully dressed, with their sleeves rolled up and their wands out. \"We're going to help the Ministry!\"  Mr. Weasley shouted over all the noise, rolling up his own sleeves.  \"You lot - get into the woods, and stick together.  I'll come and fetch you when we've sorted this out!\" Bill, Charlie, and Percy were already sprinting away toward the oncoming marchers; Mr. Weasley tore after them. Ministry wizards were dashing from every direction toward the source of the trouble.  The crowd beneath the Roberts family was coming ever closer. \"C'mon,\" said Fred, grabbing Ginny's hand and starting to pull her toward the wood. Harry, Ron, Hermione, and George followed. They all looked back as they reached the trees. The crowd beneath the Roberts family was larger than ever; they could see the Ministry wizards trying to get through it to the hooded wizards in the center, but they were having great difficulty. It looked as though they were scared to perform any spell that might make the Roberts family fall. The colored lanterns that had lit the path to the stadium had been extinguished.  Dark figures were blundering through the trees; children were crying; anxious shouts and panicked voices were reverberating around them in the cold night air.  Harry felt himself being pushed hither and thither by people whose faces he could not see.  Then he heard Ron yell with pain. \"What happened?\"  said Hermione anxiously, stopping so abruptly that Harry walked into her.  \"Ron, where are you? Oh this is stupid - lumos!\" She illuminated her wand and directed its narrow beam across the path. Ron was lying sprawled on the ground. \"Tripped over a tree root,\" he said angrily, getting to his feet again. \"Well, with feet that size, hard not to,\" said a drawling voice from behind them. Harry, Ron, and Hermione turned sharply. Draco Malfoy was standing alone nearby, leaning against a tree, looking utterly relaxed.  His arms folded, he seemed to have been watching the scene at the campsite through a gap in the trees. Ron told Malfoy to do something that Harry knew he would never have dared say in front of Mrs."
}