{
  "id": "3d662502c4f4f6b059cd3130ebcd3b948f0a0190",
  "text": " Dobber wrestled a man off the walk, and Lommy smashed his head with a rock before he could rise, and hooted until he saw the knife in Dobber’s belly and realized he wouldn’t be getting up either. Arya jumped over a dead boy no older than Jon, lying with his arm cut off. She didn’t think she’d done it, but she wasn’t sure. She heard Qyle beg for mercy before a knight with a wasp on his shield smashed his face in with a spiked mace. Everything smelled of blood and smoke and iron and piss, but after a time it seemed like that was only one smell. She never saw how the skinny man got over the wall, but when he did she fell on him with Gendry and Hot Pie. Gendry’s sword shattered on the man’s helm, tearing it off his head. Underneath he was bald and scared-looking, with missing teeth and a speckly grey beard, but even as she was feeling sorry for him she was killing him, shouting,  Winterfell! Winterfell!  while Hot Pie screamed  Hot Pie!  beside her as he hacked at the man’s scrawny neck.  When the skinny man was dead, Gendry stole his sword and leapt down into the yard to fight some more. Arya looked past him, and saw steel shadows running through the holdfast, firelight shining off mail and blades, and she knew that they’d gotten over the wall somewhere, or broken through at the postern. She jumped down beside Gendry, landing the way Syrio had taught her. The night rang to the clash of steel and the cries of the wounded and dying. For a moment Arya stood uncertain, not knowing which way to go. Death was all around her.  And then Yoren was there, shaking her, screaming in her face.  Boy!  he yelled, the way he always yelled it.  Get out, it’s done, we’ve lost. Herd up all you can, you and him and the others, the boys, you get them out. Now!    How?  Arya said.   That trap,  he screamed.  Under the barn.   Quick as that he was gone, off to fight, sword in hand. Arya grabbed Gendry by the arm.  He said go,  she shouted,  the barn, the way out.  Through the slits of his helm, the Bull’s eyes shone with reflected fire. He nodded. They called Hot Pie down from the wall and found Lommy Greenhands where he lay bleeding from a spear thrust through his calf. They found Gerren too, but he was hurt too bad to move. As they were running toward the barn, Arya spied the crying girl sitting in the middle of the chaos, surrounded by smoke and slaughter. She grabbed her by the hand and pulled her to her feet as the others raced ahead. The girl wouldn’t walk, even when slapped. Arya dragged her with her right hand while she held Needle in the left. Ahead, the night was a sullen red. The barn’s on fire, she thought. Flames were licking up its sides from where a torch had fallen on straw, and she could hear the screaming of the animals trapped within. Hot Pie stepped out of the barn.  Arry, come on! Lommy’s gone, leave her if she won’t come!   Stubbornly, Arya dragged all the harder, pulling the crying girl along. Hot Pie scuttled back inside, abandoning them… but Gendry came back, the fire shining so bright on his polished helm that the horns seemed to glow orange. He ran to them, and hoisted the crying girl up over his shoulder.  Run!   Rushing through the barn doors was like running into a furnace. The air was swirling with smoke, the back wall a sheet of fire ground to roof. Their horses and donkeys were kicking and rearing and screaming. The poor animals, Arya thought. Then she saw the wagon, and the three men manacled to its bed. Biter was flinging himself against the chains, blood running down his arms from where the irons clasped his wrists. Rorge screamed curses, kicking at the wood.  Boy!  called Jaqen H’ghar.  Sweet boy!   The open trap was only a few feet ahead, but the fire was spreading fast, consuming the old wood and dry straw faster than she would have believed. Arya remembered the Hound’s horrible burned face.  Tunnel’s narrow,  Gendry shouted.  How do we get her through?    Pull her,  Arya said.  Push her.    Good boys, kind boys,  called Jaqen H’ghar, coughing.   Get these fucking chains off!  Rorge screamed.  Gendry ignored them.  You go first, then her, then me. Hurry, it’s a long way.    When you split the firewood,  Arya remembered,  where did you leave the axe?    Out by the haven.  He spared a glance for the chained men.  I’d save the donkeys first. There’s no time.    You take her!  she yelled.  You get her out! You do it!  The fire beat at her back with hot red wings as she fled the burning barn. It felt blessedly cool outside, but men were dying all around her. She saw Koss throw down his blade to yield, and she saw them kill him where he stood. Smoke was everywhere. There was no sign of Yoren, but the axe was where Gendry had left it, by the woodpile outside the haven. As she wrenched it free, a mailed hand grabbed her arm. Spinning, Arya drove the head of the axe hard between his legs. She never saw his face, only the dark blood seeping between the links of his hauberk. Going back into that barn was the hardest thing she ever did."
}