{
  "id": "3d6832a1671504ad1bd317343f0b505e83ad9c1b",
  "text": " Some sang too that Thror  and Thrain would  come  back  one  day  and  gold would  flow  in  rivers  through  the  mountain-gates, and all that land would be filled with new song and new laughter.  But this pleasant legend did not much affect their daily business.    As  soon  as  the  raft  of  barrels  came  in  sight boats  rowed out  from  the piles of  the  town,  and  voices  hailed  the  raft-steerers. Then  ropes were  cast  and oars were  pulled,  and  soon  the  raft  was  drawn  out  of  the  current  of  the  Forest  River  and  towed  away  round  the  high  shoulder  of  rock  into  the  little  bay  of  Lake-town.  There  it  was  moored  not  far  from  the  shoreward  head  of  the  great  bridge.  Soon  men would come up  from  the South and  take  some of  the casks away, and others  they would fill with goods they had brought to be taken back up the stream to the  Wood-elves' home. In the meanwhile the barrels were left afloat while the elves of  the raft and the boatmen went to feast in Lake-town.  They would have been surprised, if they could have seen what happened down  by  the  shore,  after  they  had  gone  and  the  shades  of  night  had  fallen. First  of  all  a  barrel was  cut  loose  by Bilbo  and  pushed  to  the  shore  and  opened. Groans  came  from  inside,  and  out  crept  a most  unhappy  dwarf. Wet  straw was  in  his  draggled  beard;  he  was  so  sore  and  stiff,  so  bruised  and  buffeted  he  could  hardly  stand  or  stumble through the shallow water to lie groaning on the shore. He had a famished  and a savage look like a dog that has been chained and forgotten in a kennel for a  week.  It was Thorin,  but  you  could  only  have  told  it  by his golden chain, and by  the  colour  of  his  now  dirty  and  tattered  sky-blue  hood  with  its  tarnished  silver  tassel. It was some time before he would be even polite to the hobbit.  \"Well,  are  you  alive  or  are  you  dead?\"  asked  Bilbo  quite  crossly.  Perhaps  he  had  forgotten  that he had had  at  least one good meal more  than  the dwarves,  and  also  the use of his  arms  and  legs, not  to  speak of  a greater  allowance of  air.  \"Are  you still in prison, or are you free? If you want food, and if you want to go on with  this silly adventure- it's yours after all and not mine-you had better slap your arms  and rub your legs and try and help me get the others out while there is a chance!\"   ####-Thorin  of  course  saw  the  sense  of  this,  so  after  a  few  more  groans  he  got  up  and  helped  the  hobbit as well as he could.  In  the darkness  floundering  in  the cold  water  they had a difficult and very nasty  job  finding which were  the  right barrels.  Knocking  outside  and  calling  only  discovered  about  six  dwarves  that  could  answer.  They  were  unpacked  and  helped  ashore where  they  sat  or  lay muttering  and  moaning;  they  were  so  soaked  and  bruised  and  cramped  that  they  could  hardly yet realize their release or be properly thankful for it.  Dwalin  and  Balin  were  two  of  the most  unhappy,  and  it  was  no  good  asking  them  to  help.  Bifur  and  Bofur  were  less  knocked  about  and  drier,  but  they  lay  down  and  would  do  nothing.  Fili  and  Kili,  however,  who  were  young  (for  dwarves) and had also been packed more neatly with plenty of  straw  into  smaller  casks, came out more or less smiling, with only a bruise or two and a stiffness that  soon wore off.  \"I hope I never smell the smell of apples again!\" said Fili. \"My tub was full of  it.  To  smell  apples  everlastingly  when  you  can  scarcely  move  and  are  cold  and  sick  with  hunger  is  maddening.  I  could  eat  anything  in  the  wide  world  now,  for  hours on end-but not an apple!\"  With  the willing help of Fili  and Kili, Thorin  and Bilbo  at  last discovered  the  remainder  of  the  company  and  got  them  out.  Poor  fat  Bombur  was  asleep  or  senseless; Dori, Nori, Ori, Oin and Gloin were waterlogged and seemed only half  alive; they all had to be carried one by one and laid helpless on the shore.  \"Well! Here we are!\" said Thorin. \"And I suppose we ought to thank our stars  and Mr. Baggins. I am sure he has a right to expect it, though I wish he could have  arranged  a  more  comfortable  journey.  Still-all  very  much  at  your  service  once  more, Mr. Baggins. No doubt we shall feel properly grateful, when we are fed and  recovered. In the meanwhile what next?\"  \"I suggest Lake-town,\" said Bilbo, \"What else is there?\" Nothing else could, of  course, be suggested; so leaving the others Thorin and Fili and Kili and the hobbit  went  along  the  shore  to  the  great  bridge. There were  guards  at  the  head  of  it,  but  they were  not  keeping very careful watch,  for  it was  so  long  since  there had been  any  real  need. Except  for  occasional  squabbles  about  river-tolls they were friends  with the Wood-elves. Other folk were far away; and some of the younger people in  the town openly doubted the existence of any dragon in the mountain, and laughed  at  the greybeards and gammers who  said  that  they had  seen him  flying  in  the  sky  in  their  young  days."
}