{
  "id": "3db049cb58165e266fa3ab6cbf17f221eee9c3bf",
  "text": "  No one could wait for the holidays to start. While the Gryffindor common room and the Great Hall had roaring fires, the drafty corridors had become icy and a bitter wind rattled the windows in the classrooms. Worst of all were Professor Snape's classes down in the dungeons, where their breath rose in a mist before them and they kept as close as possible to their hot cauldrons.  \"I do feel so sorry,\" said Draco Malfoy, one Potions class, \"for all those people who have to stay at Hogwarts for Christmas because they're not wanted at home.\"  He was looking over at Harry as he spoke. Crabbe and Goyle chuckled. Harry, who was measuring out powdered spine of lionfish, ignored them. Malfoy had been even more unpleasant than usual since the Quidditch match. Disgusted that the Slytherins had lost, he had tried to get everyone laughing at how a wide-mouthed tree frog would be replacing Harry as Seeker next. Then he'd realized that nobody found this funny, because they were all so impressed at the way Harry had managed to stay on his bucking broomstick. So Malfoy, jealous and angry, had gone back to taunting Harry about having no proper family.  It was true that Harry wasn't going back to Privet Drive for Christmas. Professor McGonagall had come around the week before, making a list of students who would be staying for the holidays, and Harry had signed up at once. He didn't feel sorry for himself at all; this would probably be the best Christmas he'd ever had. Ron and his brothers were staying, too, because Mr. and Mrs. Weasley were going to Romania to visit Charlie.  When they left the dungeons at the end of Potions, they found a large fir tree blocking the corridor ahead. Two enormous feet sticking out at the bottom and a loud puffing sound told them that Hagrid was behind it.  \"Hi, Hagrid, want any help?\" Ron asked, sticking his head through the branches.  \"Nah, I'm all right, thanks, Ron.\"  \"Would you mind moving out of the way?\" came Malfoys cold drawl from behind them. \"Are you trying to earn some extra money, Weasley? Hoping to be gamekeeper yourself when you leave Hogwarts, I suppose -- that hut of Hagrid's must seem like a palace compared to what your family's used to.\"  Ron dived at Malfoy just as Snape came up the stairs.  \"WEASLEY!\"  Ron let go of the front of Malfoy's robes.  \"He was provoked, Professor Snape,\" said Hagrid, sticking his huge hairy face out from behind the tree. \"Malfoy was insultin' his family.\"  \"Be that as it may, fighting is against Hogwarts rules, Hagrid,\" said Snape silkily. \"Five points from Gryffindor, Weasley, and be grateful it isn't more. Move along, all of you.\"  Malfoy, Crabbe, and Goyle pushed roughly past the tree, scattering needles everywhere and smirking.  \"I'll get him,\" said Ron, grinding his teeth at Malfoy's back, \"one of these days, I'll get him --\"  \"I hate them both,\" said Harry, \"Malfoy and Snape.\"  \"Come on, cheer up, it's nearly Christmas,\" said Hagrid. \"Tell yeh what, come with me an' see the Great Hall, looks a treat.\"  So the three of them followed Hagrid and his tree off to -the Great Hall, where Professor McGonagall and Professor Flitwick were busy with the Christmas decorations.  \"Ah, Hagrid, the last tree -- put it in the far corner, would you?\"  The hall looked spectacular. Festoons of holly and mistletoe hung all around the walls, and no less than twelve towering Christmas trees stood around the room, some sparkling with tiny icicles, some glittering with hundreds of candles.  \"How many days you got left until yer holidays?\" Hagrid asked.  \"Just one,\" said Hermione. \"And that reminds me -Harry, Ron, we've got half an hour before lunch, we should be in the library.\"  \"Oh yeah, you're right,\" said Ron, tearing his eyes away from Professor Flitwick, who had golden bubbles blossoming out of his wand and was trailing them over the branches of the new tree.  \"The library?\" said Hagrid, following them out of the hall. \"Just before the holidays? Bit keen, aren't yeh?\"  \"Oh, we're not working,\" Harry told him brightly. \"Ever since you mentioned Nicolas Flamel we've been trying to find out who he is.\"  \"You what?\" Hagrid looked shocked. \"Listen here -- I've told yeh -- drop it. It's nothin' to you what that dog's guardin'.\"  \"We just want to know who Nicolas Flamel is, that's all,\" said Hermione.  \"Unless you'd like to tell us and save us the trouble?\" Harry added. \"We must've been through hundreds of books already and we can't find him anywhere -- just give us a hint -- I know I've read his name somewhere.\"  \"I'm sayin' nothin, said Hagrid flatly.  \"Just have to find out for ourselves, then,\" said Ron, and they left Hagrid looking disgruntled and hurried off to the library.  They had indeed been searching books for Flamel's name ever since Hagrid had let it slip, because how else were they going to find out what Snape was trying to steal? The trouble was, it was very hard to know where to begin, not knowing what Flamel might have done to get himself into a book."
}