{
  "id": "3e032529e8b891453116d5df802e0dcd872703d0",
  "text": "  Tell me, does the Citadel approve of you bedding the serving wenches, Maester?   The old man was as naked as the girl, though he made a markedly less attractive sight. For once, his heavy-lidded eyes were open wide.  W-what is the meaning of this? I am an old man, your loyal servant…   Tyrion hoisted himself onto the bed.  So loyal that you sent only one of my letters to Doran Martell. The other you gave to my sister.    N-no,  squealed Pycelle.  No, a falsehood, I swear it, it was not me. Varys, it was Varys, the Spider, I warned you—    Do all maesters lie so poorly? I told Varys that I was giving Prince Doran my nephew Tommen to foster. I told Littlefinger that I planned to wed Myrcella to Lord Robert of the Eyrie. I told no one that I had offered Myrcella to the Dornish… that truth was only in the letter I entrusted to you.   Pycelle clutched for a corner of the blanket.  Birds are lost, messages stolen or sold… it was Varys, there are things I might tell you of that eunuch that would chill your blood…    My lady prefers my blood hot.    Make no mistake, for every secret the eunuch whispers in your ear, he holds seven back. And Littlefinger, that one…    I know all about Lord Petyr. He’s almost as untrustworthy as you. Shagga, cut off his manhood and feed it to the goats.   Shagga hefted the huge double-bladed axe.  There are no goats, Halfman.    Make do.   Roaring, Shagga leapt forward. Pycelle shrieked and wet the bed, urine spraying in all directions as he tried to scramble back out of reach. The wildling caught him by the end of his billowy white beard and hacked off three-quarters of it with a single slash of the axe.   Timett, do you suppose our friend will be more forthcoming without those whiskers to hide behind?  Tyrion used a bit of the sheet to wipe the piss off his boots.   He will tell the truth soon.  Darkness pooled in the empty pit of Timett’s burned eye.  I can smell the stink of his fear.   Shagga tossed a handful of hair down to the rushes, and seized what beard was left.  Hold still, Maester,  urged Tyrion.  When Shagga gets angry, his hands shake.    Shagga’s hands never shake,  the huge man said indignantly, pressing the great crescent blade under Pycelle’s quivering chin and sawing through another tangle of beard.   How long have you been spying for my sister?  Tyrion asked.  Pycelle’s breathing was rapid and shallow.  All I did, I did for House Lannister.  A sheen of sweat covered the broad dome of the old man’s brow, and wisps of white hair clung to his wrinkled skin.  Always… for years… your lord father, ask him, I was ever his true servant…’twas I who bid Aerys open his gates…   That took Tyrion by surprise. He had been no more than an ugly boy at Casterly Rock when the city fell.  So the Sack of King’s Landing was your work as well?    For the realm! Once Rhaegar died, the war was done. Aerys was mad, Viserys too young, Prince Aegon a babe at the breast, but the realm needed a king… I prayed it should be your good father, but Robert was too strong, and Lord Stark moved too swiftly…    How many have you betrayed, I wonder? Aerys, Eddard Stark, me… King Robert as well? Lord Arryn, Prince Rhaegar? Where does it begin, Pycelle?  He knew where it ended.  The axe scratched at the apple of Pycelle’s throat and stroked the soft wobbly skin under his jaw, scraping away the last hairs.  You… were not here,  he gasped when the blade moved upward to his cheeks.  Robert… his wounds… if you had seen them, smelled them, you would have no doubt…    Oh, I know the boar did your work for you… but if he’d left the job half done, doubtless you would have finished it.    He was a wretched king… vain, drunken, lecherous… he would have set your sister aside, his own queen… please… Renly was plotting to bring the Highgarden maid to court, to entice his brother… it is the gods’ own truth…    And what was Lord Arryn plotting?    He knew,  Pycelle said.  About… about…    I know what he knew about,  snapped Tyrion, who was not anxious for Shagga and Timett to know as well.   He was sending his wife back to the Eyrie, and his son to be fostered on Dragonstone… he meant to act…    So you poisoned him first.    No.  Pycelle struggled feebly. Shagga growled and grabbed his head. The clansman’s hand was so big he could have crushed the maester’s skull like an eggshell had he squeezed.  Tyrion tsked at him.  I saw the tears of Lys among your potions. And you sent away Lord Arryn’s own maester and tended him yourself, so you could make certain that he died.    A falsehood!    Shave him closer,  Tyrion suggested.  The throat again.   The axe swept back down, rasping over the skin. A thin film of spit bubbled on Pycelle’s lips as his mouth trembled.  I tried to save Lord Arryn. I vow—    Careful now, Shagga, you’ve cut him.   Shagga growled.  Dolf fathered warriors, not barbers.   When he felt the blood trickling down his neck and onto his chest, the old man shuddered, and the last strength went out of him. He looked shrunken, both smaller and frailer than he had been when they burst in on him."
}