{
  "id": "3e3700e8afc60ff3e17cf909ab8e4a98c2030cff",
  "text": "  The boy drew himself up tall.  I am Edric Storm,  he announced.  King Robert’s son.    Of course you are.  Davos had known that almost at once. The lad had the prominent ears of a Florent, but the hair, the eyes, the jaw, the cheekbones, those were all Baratheon.   Did you know my father?  Edric Storm demanded.   I saw him many a time while calling on your uncle at court, but we never spoke.    My father taught me to fight,  the boy said proudly.  He came to see me almost every year, and sometimes we trained together. On my last name day he sent me a warhammer just like his, only smaller. They made me leave it at Storm’s End, though. Is it true my uncle Stannis cut off your fingers?    Only the last joint. I still have fingers, only shorter.    Show me.   Davos peeled his glove off. The boy studied his hand carefully.  He did not shorten your thumb?    No.  Davos coughed.  No, he left me that.    He should not have chopped any of your fingers,  the lad decided.  That was ill done.    I was a smuggler.    Yes, but you smuggled him fish and onions.    Lord Stannis knighted me for the onions, and took my fingers for the smuggling.  He pulled his glove back on.   My father would not have chopped your fingers.    As you say, my lord.  Robert was a different man than Stannis, true enough. The boy is like him. Aye, and like Renly as well. That thought made him anxious.  The boy was about to say something more when they heard steps. Davos turned. Ser Axell Florent was coming down the garden path with a dozen guards in quilted jerkins. On their breasts they wore the fiery heart of the Lord of Light. Queen’s men, Davos thought. A cough came on him suddenly.  Ser Axell was short and muscular, with a barrel chest, thick arms, bandy legs, and hair growing from his ears. The queen’s uncle, he had served as castellan of Dragonstone for a decade, and had always treated Davos courteously, knowing he enjoyed the favor of Lord Stannis. But there was neither courtesy nor warmth in his tone as he said,  Ser Davos, and undrowned. How can that be?    Onions float, ser. Have you come to take me to the king?    I have come to take you to the dungeon.  Ser Axell waved his men forward.  Seize him, and take his dirk. He means to use it on our lady.       Jaime   Jaime was the first to spy the inn. The main building hugged the south shore where the river bent, its long low wings outstretched along the water as if to embrace travelers sailing downstream. The lower story was grey stone, the upper whitewashed wood, the roof slate. He could see stables as well, and an arbor heavy with vines.  No smoke from the chimneys,  he pointed out as they approached.  Nor lights in the windows.    The inn was still open when last I passed this way,  said Ser Cleos Frey.  They brewed a fine ale. Perhaps there is still some to be had in the cellars.    There may be people,  Brienne said.  Hiding. Or dead.    Frightened of a few corpses, wench?  Jaime said.  She glared at him.  My name is—    —Brienne, yes. Wouldn’t you like to sleep in a bed for a night, Brienne? We’d be safer than on the open river, and it might be prudent to find what’s happened here.   She gave no answer, but after a moment she pushed at the tiller to angle the skiff in toward the weathered wooden dock. Ser Cleos scrambled to take down the sail. When they bumped softly against the pier, he climbed out to tie them up. Jaime clambered after him, made awkward by his chains.  At the end of the dock, a flaking shingle swung from an iron post, painted with the likeness of a king upon his knees, his hands pressed together in the gesture of fealty. Jaime took one look and laughed aloud.  We could not have found a better inn.    Is this some special place?  the wench asked, suspicious.  Ser Cleos answered.  This is the Inn of the Kneeling Man, my lady. It stands upon the very spot where the last King in the North knelt before Aegon the Conqueror to offer his submission. That’s him on the sign, I suppose.    Torrhen had brought his power south after the fall of the two kings on the Field of Fire,  said Jaime,  but when he saw Aegon’s dragon and the size of his host, he chose the path of wisdom and bent his frozen knees.  He stopped at the sound of a horse’s whinny.  Horses in the stable. One at least.  And one is all I need to put the wench behind me.  Let’s see who’s home, shall we?  Without waiting for an answer, Jaime went clinking down the dock, put a shoulder to the door, shoved it open…  …and found himself eye to eye with a loaded crossbow. Standing behind it was a chunky boy of fifteen.  Lion, fish, or wolf?  the lad demanded.   We were hoping for capon.  Jaime heard his companions entering behind him.  The crossbow is a coward’s weapon.    It’ll put a bolt through your heart all the same.    Perhaps. But before you can wind it again my cousin here will spill your entrails on the floor.    Don’t be scaring the lad, now,  Ser Cleos said.   We mean no harm,  the wench said.  And we have coin to pay for food and drink."
}