{
  "id": "3eb541f776e2b8e1721dcf11e4e98c5468de5eaa",
  "text": "  \"Yeah... can't've tied him up properly,\" said Hagrid, gazing happily out over the grounds. \"I was worried this mornin', mind... thought he mighta met Professor Lupin on the grounds, but Lupin says he never ate anythin' las' night....\"  \"What?\" said Harry quickly.  \"Blimey, haven' yeh heard?\" said Hagrid, his smile fading a little. He lowered his voice, even though there was nobody in sight. \"Er -- Snape told all the Slytherins this mornin'.... Thought everyone'd know by now... Professor Lupin's a werewolf, see. An' he was loose on the grounds las' night.... He's packin' now, o' course.  \"He's packing?\" said Harry, alarmed. \"Why?\"  \"Leavin', isn' he?\" said Hagrid, looking surprised that Harry had to ask. \"Resigned firs' thing this mornin'. Says he can't risk it happenin again.  Harry scrambled to his feet.  \"I'm going to see him,\" he said to Ron and Hermione.  \"But if he's resigned --\"  \"-- doesn't sound like there's anything we can do --\"  \"I don't care. I still want to see him. I'll meet you back here.\"  Lupin's office door was open. He had already packed most of his things. The grindylow's empty tank stood next to his battered old suitcase, which was open and nearly full. Lupin was bending over something on his desk and looked up only when Harry knocked on the door.  \"I saw you coming,\" said Lupin, smiling. He pointed to the parchment he had been poring over. It was the Marauder's Map.  \"I just saw Hagrid,\" said Harry. \"And he said you'd resigned. It's not true, is it?\"  \"I'm afraid it is,\" said Lupin. He started opening his desk drawers and taking out the contents.  \"Why?\" said Harry. \"The Ministry of Magic don't think you were helping Sirius, do they?\"  Lupin crossed to the door and closed it behind Harry.  \"No. Professor Dumbledore managed to convince Fudge that I was trying to save your lives.\" He sighed. \"That was the final straw for Severus. I think the loss of the Order of Merlin hit him hard. So he -- er -- accidentally let slip that I am a werewolf this morning at breakfast.\"  \"You're not leaving just because of that!\" said Harry.  Lupin smiled wryly.  \"This time tomorrow, the owls will start arriving from parents.... They will not want a werewolf teaching their children, Harry. And after last night, I see their point. I could have bitten any of you.... That must never happen again.\"  \"You're the best Defense Against the Dark Arts- teacher we've ever had!\" said Harry. \"Don't go!\"  Lupin shook his head and didn't speak. He carried on emptying his drawers. Then, while Harry was trying to think of a good argument to make him stay, Lupin said, \"From what the headmaster told me this morning, you saved a lot of lives last night, Harry. if I'm proud of anything I've done this year, it's how much you've learned.... Tell me about your Patronus.\"  \"How d'you know about that?\" said Harry, distracted.  \"What else could have driven the dementors back?\"  Harry told Lupin what had happened. When he'd finished, Lupin was smiling again.  \"Yes, your father was always a stag when he transformed,\" he said. \"You guessed right... that's why we called him Prongs.\"  Lupin threw his last few books into his case, closed the desk drawers, and turned to look at Harry.  \"Here -- I brought this from the Shrieking Shack last night,\" he said, handing Harry back the Invisibility Cloak. \"And...\" He hesitated, then held out the Marauder's Map too. \"I am no longer your teacher, so I don't feel guilty about giving you back this as well. It's no use to me, and I daresay you, Ron, and Hermione will find uses for it.\"  Harry took the map and grinned.  \"You told me Moony, Wormtail, Padfoot, and Prongs would've wanted to lure me out of school... you said they'd have thought it was funny.\"  \"And so we would have,\" said Lupin, now reaching down to close his case. \"I have no hesitation in saying that James would have been highly disappointed if his son had never found any of the secret passages out of the castle.\"  There was a knock on the door. Harry hastily stuffed the Marauder's Map and the Invisibility Cloak into his pocket.  It was Professor Dumbledore. He didn't look surprised to see Harry there.  \"Your carriage is at the gates, Remus,\" he said.  \"Thank You, Headmaster.\"  Lupin picked up his old suitcase and the empty grindylow tank.  \"Well -- good-bye, Harry,\" he said, smiling. \"It has been a real pleasure teaching you. I feel sure we'll meet again sometime. Headmaster, there is no need to see me to the gates, I can manage....\"  Harry had the impression that Lupin wanted to leave as quickly as possible.  \"Good-bye, then, Remus,\" said Dumbledore soberly. Lupin shifted the grindylow tank slightly so that he and Dumbledore could shake hands. Then, with a final nod to Harry and a swift smile, Lupin left the office.  Harry sat down in his vacated chair, staring glumly at the floor. He heard the door close and looked up. Dumbledore was still there.  \"Why so miserable, Harry?\" he said quietly. \"You should be very proud of yourself after last night."
}