{
  "id": "3f10d6022f93014ddcc15e5514b39023a8339822",
  "text": "       'There is a great power in  them, and they seem able to wrap themselves  in shadow: it  is difficult to see  them moving. But  they do. They can move  very quickly, if  they are angry.  You  stand still  looking at the weather,   ####-maybe, or listening to the rustling of  the wind, and then  suddenly you find  that  you  are in the middle of a wood with great  groping trees  all around  you. They still have voices, and can speak with the Ents  -- that is why they  are called Huorns, Treebeard says  -- but they  have  become queer and  wild.   Danger ous. I should be terrified of meeting them, if there were no true Ents  about to look after them.       'Well, in the early night  we crept  down a  long ravine into the upper   end of the Wizard's Vale, the Ents with all their rustling Huorns behind. We  could  not see them, of course,  but the whole air  was full of creaking. It  was very dark, a  cloudy  night. They moved at a great speed as soon as they  had left  the hills,  and made a noise like a rushing wind. The Moon did not  appear through the clouds, and  not long after midnight there was a tall wood  all round  the north side of Isengard. There was  no  sign of enemies nor of  any  challenge. There was a light gleaming from  a high window in the tower,  that was all.       'Treebeard and a few more Ents crept  on, right round to within sight of  the great gates. Pippin  and I were with him. We were sitting on Treebeard's  shoulders, and  I could feel the quivering tenseness  in  him. But even when  they are roused, Ents can be very cautious and patient. They stood  still  as  carved stones, breathing and listening.       'Then all at once there was  a tremendous stir. Trumpets blared and the  walls of Isengard  echoed. We thought that we had  been discovered, and that  battle was  going to  begin. But nothing of  the sort.  All Saruman's people  were marching away. I  don't know much about this war, or about the  Horsemen  of Rohan, but Saruman seems to have meant to finish off the king and all his  men with one final blow. He emptied Isengard. I  saw  the  enemy go: endless  lines  of marching Orcs; and troops  of  them mounted on  great wolves.  And  there were battalions of Men, too. Many  of them carried torches, and in the  flare I could see  their faces. Most of them were ordinary men,  rather tall  and dark-haired, and grim but not particularly  evil -looking. But there were  some  others that were  horrible: man-high, but  with goblin-faces,  sallow,   leering,  squint-eyed.  Do  you  know,  they  reminded  me at  once of  that  Southerner at Bree: only he was not  so obviously orc-like as  most of these  were.'       'I  thought of him too,' said Aragorn.  'We had many of these half-orcs  to deal with at Helm's  Deep. It seems plain  now that that Southerner was a    ####-spy of Saruman's; but whether he was working  with the Black Riders,  or for  Saruman alone, I do not know.  It is difficult with these  evil folk to know  when they are in league, and when they are cheating one another.'       'Well, of all sorts together, there must have  been ten thousand at the  very least,' said Merry.  'They took an hour to  pass out of the gates. Some  went off down the highway  to the  Fords, and some turned  away µ  and  went  eastward. A bridge has  been built down there, about  a mile away, where the  river  runs in a very deep channel. You could see i t  now, if  you stood up.  They were all singing with harsh voices, and laughing, making a hideous din.  I thought things looked very black for Rohan. But Treebeard did not move. He  said: 'My business is with Isengard tonight, with rock and stone.'       'But, though I could not see what was happening  in the dark, I believe  that Huorns began to move south, as soon as the gates were shut again. Their  business  was with Orcs I think.  They  were  far  down  the valley  in  the  morning; or any rate there was a shadow there that one couldn't see through.        'As soon as Saruman had sent off all his army, our turn came. Treebeard  put us down, and went up to the gates, and began hammering on the doors, and  calling for Saruman. There was no answer, except arrows  and stones from the  walls. But arrows are no  use against Ents. They hurt  them, of  course, and  infuriate them:  like stinging flies. But an  Ent  can  be  stuck as full of  orc-arrows  as  a pin -cushion,  and take no serious  harm.  They  cannot  be  poisoned,  for one thing; and their skin seems to be very thick, and tougher   than bark.  It takes a  very  heavy axe-stroke to wound them seriously. They  don't like axes. But there would have to be a great many axe -men to one Ent:  a man  that hacks once at  an  Ent  never  gets a chance of a second blow. A  punch from an Ent-fist crumples up iron like thin tin.       'When Treebeard had got a few  arrows  in  him, he began to warm up, to   get positively \"hasty\", as he would say. He let  out a great hoom-hom, and a   dozen more Ents came striding up."
}