{
  "id": "3f16c8d473dc770e84789312928d076b9674a562",
  "text": "   No,  Dany replied.  No.   Jhogo understood that. One of the others barked out a comment, and the Dothraki laughed. Irri told her,  Quaro thinks you should take an ear to teach him respect.   Her brother was on his knees, his fingers digging under the leather coils, crying incoherently, struggling for breath. The whip was tight around his windpipe.   Tell them I do not wish him harmed,  Dany said.  Irri repeated her words in Dothraki. Jhogo gave a pull on the whip, yanking Viserys around like a puppet on a string. He went sprawling again, freed from the leather embrace, a thin line of blood under his chin where the whip had cut deep.   I warned him what would happen, my lady,  Ser Jorah Mormont said.  I told him to stay on the ridge, as you commanded.    I know you did,  Dany replied, watching Viserys. He lay on the ground, sucking in air noisily, red-faced and sobbing. He was a pitiful thing. He had always been a pitiful thing. Why had she never seen that before? There was a hollow place inside her where her fear had been.   Take his horse,  Dany commanded Ser Jorah. Viserys gaped at her. He could not believe what he was hearing; nor could Dany quite believe what she was saying. Yet the words came.  Let my brother walk behind us back to the khalasar.  Among the Dothraki, the man who does not ride was no man at all, the lowest of the low, without honor or pride.  Let everyone see him as he is.    No!  Viserys screamed. He turned to Ser Jorah, pleading in the Common Tongue with words the horsemen would not understand.  Hit her, Mormont. Hurt her. Your king commands it. Kill these Dothraki dogs and teach her.   The exile knight looked from Dany to her brother; she barefoot, with dirt between her toes and oil in her hair, he with his silks and steel. Dany could see the decision on his face.  He shall walk, Khaleesi,  he said. He took her brother’s horse in hand while Dany remounted her silver.  Viserys gaped at him, and sat down in the dirt. He kept his silence, but he would not move, and his eyes were full of poison as they rode away. Soon he was lost in the tall grass. When they could not see him anymore, Dany grew afraid.  Will he find his way back?  she asked Ser Jorah as they rode.   Even a man as blind as your brother should be able to follow our trail,  he replied.   He is proud. He may be too shamed to come back.   Jorah laughed.  Where else should he go? If he cannot find the khalasar, the khalasar will most surely find him. It is hard to drown in the Dothraki sea, child.   Dany saw the truth of that. The khalasar was like a city on the march, but it did not march blindly. Always scouts ranged far ahead of the main column, alert for any sign of game or prey or enemies, while outriders guarded their flanks. They missed nothing, not here, in this land, the place where they had come from. These plains were a part of them… and of her, now.   I hit him,  she said, wonder in her voice. Now that it was over, it seemed like some strange dream that she had dreamed.  Ser Jorah, do you think… he’ll be so angry when he gets back… She shivered.  I woke the dragon, didn’t I?   Ser Jorah snorted.  Can you wake the dead, girl? Your brother Rhaegar was the last dragon, and he died on the Trident. Viserys is less than the shadow of a snake.   His blunt words startled her. It seemed as though all the things she had always believed were suddenly called into question.  You… you swore him your sword…    That I did, girl,  Ser Jorah said.  And if your brother is the shadow of a snake, what does that make his servants?  His voice was bitter.   He is still the true king. He is…   Jorah pulled up his horse and looked at her.  Truth now. Would you want to see Viserys sit a throne?   Dany thought about that.  He would not be a very good king, would he?    There have been worse… but not many.  The knight gave his heels to his mount and started off again.  Dany rode close beside him.  Still,  she said,  the common people are waiting for him. Magister Illyrio says they are sewing dragon banners and praying for Viserys to return from across the narrow sea to free them.    The common people pray for rain, healthy children, and a summer that never ends,  Ser Jorah told her.  It is no matter to them if the high lords play their game of thrones, so long as they are left in peace.  He gave a shrug.  They never are.   Dany rode along quietly for a time, working his words like a puzzle box. It went against everything that Viserys had ever told her to think that the people could care so little whether a true king or a usurper reigned over them. Yet the more she thought on Jorah’s words, the more they rang of truth.   What do you pray for, Ser Jorah?  she asked him.   Home,  he said. His voice was thick with longing.   I pray for home too,  she told him, believing it.  Ser Jorah laughed.  Look around you then, Khaleesi.   But it was not the plains Dany saw then. It was King’s Landing and the great Red Keep that Aegon the Conqueror had built."
}