{
  "id": "3fa99507df86b2af97b1c64c161d22917905d0a0",
  "text": "  \"Pass the frying pan.\"  \"You've forgotten the magic word,\" said Harry irritably.  The effect of this simple sentence on the rest of the family was incredible: Dudley gasped and fell off his chair with a crash that shook the whole kitchen; Mrs. Dursley gave a small scream and clapped her hands to her mouth; Mr. Dursley jumped to his feet, veins throbbing in his temples.  \"I meant `please'!\" said Harry quickly. \"I didn't mean -\"  \"WHAT HAVE I TOLD YOU,\" thundered his uncle, spraying spit over the table, \"ABOUT SAYING THE `M' WORD IN OUR HOUSE?\"  \"But I -\"  \"HOW DARE YOU THREATEN DUDLEY!\" roared Uncle Vernon, pounding the table with his fist.  \"I just -\"  \"I WARNED YOU! I WILL NOT TOLERATE MENTION OF YOUR ABNORMALITY UNDER THIS ROOF!\"  Harry stared from his purple-faced uncle to his pale aunt, who was trying to heave Dudley to his feet.  \"All right,\" said Harry, \"all right. . . \"  Uncle Vernon sat back down, breathing like a winded rhinoceros and watching Harry closely out of the corners of his small, sharp eyes.  Ever since Harry had come home for the summer holidays, Uncle Vernon had been treating him like a bomb that might go off at any moment, because Harry Potter wasn't a normal boy. As a matter of fact, he was as not normal as it is possible to be.  Harry Potter was a wizard - a wizard fresh from his first year at Hogwarts School of Witchcraft and Wizardry. And if the Dursleys were unhappy to have him back for the holidays, it was nothing to how Harry felt.  He missed Hogwarts so much it was like having a constant stomachache. He missed the castle, with its secret passageways and ghosts, his classes (though perhaps not Snape, the Potions master), the mail arriving by owl, eating banquets in the Great Hall, sleeping in his four-poster bed in the tower dormitory, visiting the gamekeeper, Hagrid, in his cabin next to the Forbidden Forest in the grounds, and, especially, Quidditch, the most popular sport in the wizarding world (six tall goal posts, four flying balls, and fourteen players on broomsticks).  All Harry's spellbooks, his wand, robes, cauldron, and top-of-the-line Nimbus Two Thousand broomstick had been locked in a cupboard under the stairs by Uncle Vernon the instant Harry had come home. What did the Dursleys care if Harry lost his place on the House Quidditch team because he hadn't practiced all summer? What was it to the Dursleys if Harry went back to school without any of his homework done? The Dursleys were what wizards called Muggles (not a drop of magical blood in their veins),  and as far as they were concerned, having a wizard in the family was a matter of deepest shame. Uncle Vernon had even padlocked Harry's owl, Hedwig, inside her cage, to stop her from carrying messages to anyone in the wizarding world.  Harry looked nothing like the rest of the family. Uncle Vernon was large and neckless, with an enormous black mustache; Aunt Petunia was horse-faced and bony; Dudley was blond, pink, and porky. Harry, on the other hand, was small and skinny, with brilliant green eyes and jet-black hair that was always untidy. He wore round glasses, and on his forehead was a thin, lightning-shaped scar.  It was this scar that made Harry so particularly unusual, even for a wizard. This scar was the only hint of Harry's very mysterious past, of the reason he had been left on the Dursleys' doorstep eleven years before.  At the age of one year old, Harry had somehow survived a curse from the greatest Dark sorcerer of all time, Lord Voldemort, whose name most witches and wizards still feared to speak. Harry's parents had died in Voldemort's attack, but Harry had escaped with his lightning scar, and somehow - nobody understood why Voldemort's powers had been destroyed the instant he had failed to kill Harry.  So Harry had been brought up by his dead mother's sister and her husband. He had spent ten years with the Dursleys, never understanding why he kept making odd things happen without meaning to, believing the Dursleys' story that he had got his scar in the car crash that had killed his parents.  And then, exactly a year ago, Hogwarts had written to Harry,  and the whole story had come out. Harry had taken up his place at wizard school, where he and his scar were famous ... but now the school year was over, and he was back with the Dursleys for the summer, back to being treated like a dog that had rolled in something smelly.  The Dursleys hadn't even remembered that today happened to be Harry's twelfth birthday. Of course, his hopes hadn't been high; they'd never given him a real present, let alone a cake - but to ignore it completely ...  At that moment, Uncle Vernon cleared his throat importantly and said, \"Now, as we all know, today is a very important day.\"  Harry looked up, hardly daring to believe it.  \"This could well be the day I make the biggest deal of my career, \" said Uncle Vernon.   Harry went back to his toast. Of course, he thought bitterly, Un cle Vernon was talking about the stupid dinner party."
}