{
  "id": "3fac112f805b738468cadd087cddd735068f62dd",
  "text": " \"We've got to go! If the basilisk comes -\"  \"It won't come until it is called,\" said Riddle calmly.  Harry lowered Ginny back onto the floor, unable to hold her up any longer.  \"What d'you mean?\" he said. \"Look, give me my wand, I might need it -\"  Riddle's smile broadened.  \"You won't be needing it,\" he said.  *%08*  Harry stared at him.  \"What d'you mean, I won't be -?\"  \"I've waited a long time for this, Harry Potter,\" said Riddle. \"For the chance to see you. To speak to you.\"  \"Look,\" said Harry, losing patience, \"I don't think you get it. We're in the Chamber of Secrets. We can talk later -\"  \"We're going to talk now,\" said Riddle, still smiling broadly, and he pocketed Harry's wand.  Harry stared at him. There was something very funny going on here ....  \"How did Ginny get like this?\" he asked slowly.  \"Well, that's an interesting question,\" said Riddle pleasantly. \"And quite a long story. I suppose the real reason Ginny Weasley's like this is because she opened her heart and spilled all her secrets to an invisible stranger.\"  \"What are you talking about?\" said Harry.  \"The diary,\" said Riddle. `My diary. Little Ginny's been writing in it for months and months, telling me all her pitiful worries and woes - how her brothers tease her, how she had to come to school with secondhand robes and books, how\" -Riddle's eyes glinted \"how she didn't think famous, good, great Harry Potter would ever like her . . . .\"  All the time he spoke, Riddle's eyes never left Harry's face. There was an almost hungry look in them.  \"It's very boring, having to listen to the silly little troubles of an eleven- year-old girl,\" he went on. \"But I was patient. I wrote back. I was sympathetic, I was kind. Ginny simply loved me. No one's ever understood me like you, Tom .... I'm so glad I've got this diary to  *309*  confide in .... It's like having a friend I can carry around in my pocket . . . .  Riddle laughed, a high, cold laugh that didn't suit him. It made the hairs stand up on the back of Harry's neck.  \"If I say it myself, Harry, I've always been able to charm the people I needed. So Ginny poured out her soul to me, and her soul happened to be exactly what I wanted .... I grew stronger and stronger on a diet of her deepest fears, her darkest secrets. I grew powerful, far more powerful than little Miss Weasley. Powerful enough to start feeding Miss Weasley a few of my secrets, to start pouring a little of my soul back into her. . .\"  \"What d'you mean?\" said Harry, whose mouth had gone very dry.  \" Haven't you guessed yet, Harry Potter?\" said Riddle softly. \"Ginny Weasley opened the Chamber of Secrets. She strangled the school roosters and daubed threatening messages on the walls. She set the Serpent of Slytherin on four Mudbloods, and the Squib's cat.  \"No,\" Harry whispered.  \"Yes,\" said Riddle, calmly. \"Of course, she didn't know what she was doing at first. It was very amusing. I wish you could have seen her new diary entries ... far more interesting, they became .... Dear Tom,\" he recited, watching Harry's horrified face, `I think I'm losing my memory. There are rooster feathers all over my robes and 1 don't know how they got there. Dear Tom, l can't remember what 1 did on the night of Halloween, but a cat was attacked and I've got paint all down my front. Dear Tom, Percy keeps telling me I'm pale and I'm not myself. I think he suspects me... There was another attack today  *310  and I don't know where I was. Tom, what am I going to do? I think I'm going mad... I think I'm the one attacking everyone, Tom!\"  Harry's fists were clenched, the nails digging deep into his Palms.  \"it took a very long time for stupid little Ginny to stop trusting her diary,\" said Riddle. \"But she finally became suspicious and tried to dispose of it. And that's where you came in, Harry. You found it, and I couldn't have been more delighted. Of all the people who could have picked it up, it was you, the very person I was most anxious to meet . . . .\"  \"And why did you want to meet me?\" said Harry. Anger was coursing through him, and it was an effort to keep his voice steady.  \"Well, you see, Ginny told me all about you, Harry,\" said Riddle. \"Your whole fascinating history. \" His eyes roved over the lightning scar on Harry's forehead, and their expression grew hungrier. \"I knew I must find out more about you, talk to you, meet you if I could. So I decided to show you my famous capture of that great oaf, Hagrid, to gain your trust -\"  \"Hagrid's my friend,\" said Harry, his voice now shaking. \"And you framed him, didn't you? I thought you made a mistake, but -\"  Riddle laughed his high laugh again.  \"It was my word against Hagrid's, Harry. Well, you can imagine how it looked to old Armando Dippet. On the one hand, Tom Riddle, poor but brilliant, parentless but so brave, school prefect, model student ... on the other hand, big, blundering Hagrid, in trouble every other week, trying to raise werewolf cubs under his bed, sneaking off to the Forbidden Forest to wrestle trolls ."
}