{
  "id": "3fb37563cdfac605e9ee2f473c98a543563f2f6f",
  "text": "... Dunno if we've learned enough.. . \"I definitely haven't,\" came Nevihle's gloomy voice from behind Fred and George. \"I expect my gran'd want me to try, though.  She's always going on about how I should be upholding the family honor. I'll just have to -- oops. . .\" Neville's foot had sunk right through a step halfway up the staircase.  There were many of these trick stairs at Hogwarts; it was second nature to most of the older students to jump this particular step, but Neville's memory was notoriously poor.  Harry and Ron seized him under the armpits and pulled him out, while a suit of armor at the top of the stairs creaked and clanked, laughing wheezily. \"Shut it, you,\" said Ron, banging down its visor as they passed.  They made their way up to the entrance to Gryffindor Tower, which was concealed behind a large portrait of a fat lady in a pink silk dress. \"Password?\" she said as they approached. \"Balderdash,\" said George, \"a prefect downstairs told me.\"  The portrait swung forward to reveal a hole in the wall through which they all climbed. A crackling fire warmed the circular common room, which was full of squashy armchairs and tables. Hermione cast the merrily dancing flames a dark look, and Harry distinctly heard her mutter  \"Slave labor\" before bidding them good night and disappearing through the doorway to the girls' dormitory. Harry, Ron, and Neville climbed up the last, spiral staircase until they reached their own dormitory, which was situated at the top of the tower.  Five four-poster beds with deep crimson hangings stood against the walls, each with its owner's trunk at the foot.  Dean and Seamus were already getting into bed; Seamus had pinned his Ireland rosette to his headboard, and Dean had tacked up a poster of Viktor Krum over his bedside table.  His old poster of the West Ham football team was pinned right next to it. \"Mental,\" Ron sighed, shaking his head at the completely stationary soccer players. Harry, Ron, and Neville got into their pajamas and into bed.  Someone - a house-elf, no doubt - had placed warming pans between the sheets. It was extremely comfortable, lying there in bed and listening to the storm raging outside. \"I might go in for it, you know,\" Ron said sleepily through the darkness, \"if Fred and George find out how to. . . the tournament. . . you never know, do you?\"  \"S'pose not. .. .\" Harry rolled over in bed, a series of dazzling new pictures forming in his mind's eye. . . . He had hoodwinked the impartial judge into believing he was seventeen. . . he had become Hogwarts champion. . . he was standing on the grounds, his arms raised in triumph in front of the whole school, all of whom were applauding and screaming. . . he had just won the Triwizard Tournament.  Cho's face stood out particularly clearly in the blurred crowd, her face glowing with admiration.... Harry grinned into his pillow, exceptionally glad that Ron couldn't see what he could.   CHAPTER THIRTEEN - MAD-EYE MOODY    The storm had blown itself out by the following morning, though the ceiling in the Great Hall was still gloomy; heavy clouds of pewter gray swirled overhead as Harry, Ron, and Hermione examined their new course schedules at breakfast.  A few seats along, Fred, George, and Lee Jordan were discussing magical methods of aging themselves and bluffing their way into the Triwizard Tournament.   \"Today's not bad.. . outside all morning,\" said Ron, who was running his finger down the Monday column of his schedule.  \"Herbology with the Hufflepuffs and Care of Magical Creatures... damn it, we're still with the Slytherins. . . .\"   \"Double Divination this afternoon,\" Harry groaned, looking down.  Divination was his least favorite subject, apart from Potions.  Professor Trelawney kept predicting Harry's death, which he found extremely annoying.   \"You should have given it up like me, shouldn't you?\" said Hermione briskly, buttering herself some toast. \"Then you'd be doing something sensible like Arithmancy.\"   \"You're eating again, I notice,\" said Ron, watching Hermione adding liberal amounts of jam to her toast too.   \"I've decided there are better ways of making a stand about elf rights,\" said Hermione haughtily.   \"Yeah. . . and you were hungry,\" said Ron, grinning.   There was a sudden rustling noise above them, and a hundred owls came soaring through the open windows carrying the morning mail.  Instinctively, Harry looked up, but there was no sign of white among the mass of brown and gray.  The owls circled the tables, looking for the people to whom their letters and packages were addressed.  A large tawny owl soared down to Neville Longbottom and deposited a parcel into his lap - Neville almost always forgot to pack something.  On the other side of the Hall Draco Malfoy's eagle owl had landed on his shoulder, carrying what looked like his usual supply of sweets and cakes from home.  Trying to ignore the sinking feeling of disappointment in his stomach, Harry returned to his porridge.  Was it possible that something had happened to Hedwig, and that Sirius hadn't even got his letter?   His preoccupation lasted all the way across the sodden vegetable patch until they arrived in greenhouse three, but here he was distracted by Professor Sprout showing the class the ugliest plants Harry had ever seen."
}