{
  "id": "3fd83e6eefd27a837c6e17465a621e37524f06f1",
  "text": "        'Five leagues or  one,' said Gimli; 'we cannot escape them in this bare  land. Shall we wait for them here or go on our way?'       'We will wait,' said Aragorn. 'I  am weary, and our hunt has failed. Or  at least  others were before us; for these horsemen are riding back down the  orc-trail. We may get new s from them.'       'Or spears,' said Gimli.       'There are three empty saddles, but I see no hobbits,' said Legolas.       'I did not say that we should hear good news,' said  Aragorn. 'But evil  or good we will await it here.'       The three companions now left the hill-top, where they might be an easy   mark against the pale sky, and they walked slowly down the northward  slope.  A little  above the hill's foot they halted, and wrapping their cloaks about  them, they sat huddled together upon the faded grass. The time passed slowly  and heavily. The wind was thin and searching. Gimli was uneasy.       'What do you know of these horsemen, Aragorn?' he said. 'Do we sit here  waiting for sudden death?'       'I have been among them,' answered Aragorn. 'They are proud and wilful,  but they are true-hearted, generous in thought and deed; bold but not cruel;  wise but unlearned,  writing no books  but  singing many  songs,  after  the  manner of the children of Men before the Dark Years. But I do not know  what  has happened here of late, nor in what mind the Rohirrim may now  be between  the traitor  Saruman and the threat of  Sauron.  They  have  long  been  the  friends of the people of Gondor, though they are not akin to them. It was in  forgotten years long ago that Eorl the Young brought them out of  the North,   and  their  kinship  is rather  with  the  Bardings  of  Dale, and with  the  Beornings of the Wood,  among whom may still be seen many men tall and  fair,  as are the Riders of Rohan. At least they will not love the Orcs.'       'But Gandalf spoke of a  rumour that they pay tribute to Mordor '  said  Gimli.       'I believe it no more than did Boromir,' answered Aragorn.       'You will soon learn the truth,' said Legolas. 'Already they approach.'       At length even Gimli could  hear the distant  beat of  galloping hoofs.  The horsemen,  following  the trail, had  turned  from the  river,   and were  drawing near the downs. They were riding like the wind.   ####-     Now the  cries  of clear strong voices  came ringing over  the  fields.  Suddenly they swept up with a noise like thunder, and  the foremost horseman  swerved, passing by  the  foot  of  the  hill,  and  leading  the  host  back   southward along the western skirts of the downs. After him they rode: a long  line of mail-clad men. swift, shining, fell and fair to look upon.       Their horses were of great stature, strong and clean-limbed; their grey  coats  glistened, their  long tails flowed  in the  wind, their  manes  were  braided on their proud necks. The Men that rode them matched them well: tall  and long-limbed; their hair, flaxen -pale,  flowed under  their  light helms,   and streamed in long braids behind them; their faces were stern and keen. In  their  hands were tall  spears of ash,  painted  shields were slung at their  backs, long swords were at their belts, their burnished skirts of  mail hung  down upon their knees.        In pairs  they galloped  by, and though every now  and then one rose in  his  stirrups  and  gazed ahead  and to  either side, they appeared  not  to  perceive  the three strangers sitting silently and  watching them. The  host   had almost passed  when  suddenly Aragorn  st ood  up, and  called in a  loud  voice:       'What news from the North, Riders of Rohan?'       With astonishing speed and  skill they  checked  their steeds, wheeled,  and came charging round.  Soon the three companions  found  themselves  in a   ring of horsemen  moving in a running circle, up the hill -slope  behind them  and down,  round and round  them, and  drawing  ever inwards. Aragorn  stood  silent, and  the other two  sat  without  moving, wondering what  way things  would turn.       Without a word or cry, suddenly, the Riders halted. A thicket of spears  were  pointed towards the strangers; and some  of the  horsemen had bows  in  hand, and their  arrows were  already fitted  to the  string. Then one  rode  forward, a tall man, taller than  all the rest; from  his helm as a crest  a   white horsetail flowed. He advanced  until the point of his spear was within  a foot of Aragorn's breast. Aragorn did not stir.       'Who are  you,  and what are you doing  in this  land?' said the Rider,  using the  Common Speech of the West, in manner and tone like  to the speech  of Boromir, Man of Gondor.       'I am called Strider,' answered Aragorn. 'I came out of the North. I am  hunting Orcs.'       The Rider leaped from  his horse. Giving his spear to another  who rode   ####-up and dismounted at his side, he drew his sword and stood face to face with   Aragorn, surveying him keenly, and not  without wonder."
}