{
  "id": "40360890754894ac7d65e86b88fd666af02ce451",
  "text": " Dazed, feeling as though his ribs were broken, Harry tried to stand up; he could hear it growling as it skidded around for a new attack.  Ron was on his feet. As the dog sprang back toward them he pushed Harry aside; the dog's jaws fastened instead around Ron's outstretched arm. Harry lunged forward, he seized a handful of the brute's hair, but it was dragging Ron away as easily as though he were a rag doll --  Then, out of nowhere, something hit Harry so hard across the face he was knocked off his feet again. He heard Hermione shriek with pain and fall too.  Harry groped for his wand, blinking blood out of his eyes  \"Lumos!\"he whispered.  The wandlight showed him the trunk of a thick tree; they had chased Scabbers into the shadow of the Whomping Willow and its branches were creaking as though in a high wind, whipping backward and forward to stop them going nearer.  And there, at the base of the trunk, was the dog, dragging Ron backward into a large gap in the roots -- Ron was fighting furiously, but his head and torso were slipping out of sight --  \"Ron!\" Harry shouted, trying to follow, but a heavy branch whipped lethally through the air and he was forced backward again.  All they could see now was one of Ron's legs, which he had hooked around a root in an effort to stop the dog from pulling him farther underground -- but a horrible crack cut the air like a gunshot; Ron's leg had broken, and a moment later, his foot vanished from sight.  \"Harry -- we've got to go for help --\" Hermione gasped; she was bleeding too; the Willow had cut her across the shoulder.  \"No! That thing's big enough to eat him; we haven't got time --\"  \"Harry -- we're never going to get through without help --\"  Another branch whipped down at them, twigs clenched like knuckles.  \"If that dog can get in, we can,\" Harry panted, darting here and there, trying to find a way through the vicious, swishing branches, but he couldn't get an inch nearer to the tree roots without being in range of the tree's blows.  \"Oh, help, help,\" Hermione whispered frantically, dancing U._ certainly on the spot, \"Please...\"  Crookshanks darted forward. He slithered between the battering branches like a snake and placed his front paws upon a knot on the trunk.  Abruptly, as though the tree had been turned to marble, it stopped moving. Not a leaf twitched or shook.  \"Crookshanks!\" Hermione whispered uncertainly. She now grasped Harry's arm painfully hard. \"How did he know --?\"  \"He's friends with that dog,\" said Harry grimly. \"I've seen them together. Come on -- and keep your wand out --\"  They covered the distance to the trunk in seconds, but before they had reached the gap in the roots, Crookshanks had slid into it with a flick of his bottlebrush tail. Harry went next; he crawled forward, headfirst, and slid down an earthy slope to the bottom of a very low tunnel. Crookshanks was a little way along, his eyes flashing in the light from Harry's wand. Seconds later, Hermione slithered down beside him.  \"Where's Ron?\" she whispered in a terrified voice.  \"This way,\" said Harry, setting off, bent-backed, after Crookshanks.  \"Where does this tunnel come out?\" Hermione asked breathlessly from behind him.  \"I don't know... It's marked on the Marauder's Map but Fred and George said no one's ever gotten into it.... It goes off the edge of the map, but it looked like it was heading for Hogsmeade...\"  They moved as fast as they could, bent almost double; ahead of them, Crookshanks's tail bobbed in and out of view. On and on went the passage; it felt at least as long as the one to Honeydukes.... All Harry could think of was Ron and what the enormous dog might be doing to him.... He was drawing breath in sharp, painful gasps, running at a crouch....  And then the tunnel began to rise; moments later it twisted, and Crookshanks had gone. instead, Harry could see a patch of dim light through a small opening.  He and Hermione paused, gasping for breath, edging forward. Both raised their wands to see what lay beyond.  It was a room, a very disordered, dusty room. Paper was peeling from the walls; there were stains all over the floor; every piece of furniture was broken as though somebody had smashed it. The windows were all boarded up.  Harry glanced at Hermione, who looked very frightened but nodded.  Harry pulled himself out of the hole, staring around. The room was deserted, but a door to their right stood open, leading to a shadowy hallway. Hermione suddenly grabbed Harry's arm again. Her wide eyes were traveling around the boarded windows.  \"Harry,\" she whispered, \"I think we're in the Shrieking Shack.\"  Harry looked around. His eyes fell on a wooden chair near them. Large chunks had been torn out of it; one of the legs had been ripped off entirely.  \"Ghosts didn't do that,\" he said slowly.  At that moment, there was a creak overhead. Something had Moved upstairs. Both of them looked up at the ceiling. Hermione's grip on Harry's arm was so tight he was losing feeling in-his fingers."
}