{
  "id": "4042cbf52598d8cc3376170d8671d2ae8b781ff5",
  "text": "  They were only away a matter of minutes, perhaps  a quarter  of an  hour. Then Gandalf came back to us, and he seemed relieved, almost merry. He  did say he was glad to see us, then.       '\"But Gandalf,\" I cried, \"where have you  been?  And have you seen  the  others?\"       '\"Wherever  I have been, I am back,\"  he answered in the genuine Gandalf  manner. \"Yes, I have seen some of the others. But news must wait.  This is a   perilous night,  and I  must ride fast. But the dawn may be brighter; and if  so, we shall  meet  again.  Take  care  of  yourselves,  and keep away  from  Orthanc! Good-bye!\"       'Treebeard was very thoughtful after Gandalf had gone. He had evidently  learnt a lot in a short time and was digesting it. He looked at us and said:  \"Hm, well, I find you are not such  hasty  folk as I thought. You  said much  less than you might, and  not more than you should. Hm, this is  a bundle of  news and no mistake! Well, now Treebeard must get busy again.\"       'Before he went, we got a little news out of him; and it  did not cheer   us  up at all. But for the moment we thought more about you three than about  Frodo and Sam, or about poor Boromir. For we gathered that there was a great  battle going on, or soon would be, and that  you were in it, and might never   come out of it.   ####-     '\"Huorns will help,\"  said Treebeard. Then he went  away and we did not   see him again until this morning.       'It was deep night. We lay  on  top of a pile  of stone,  and could see  nothing beyond  it.  Mist  or shadows  blotted out  everything like  a great  blanket  all  round us. The air seemed hot and  heavy; and it  was  full  of  rustlings,  creakings,  and  a  murmur  like voices  passing. I  think  that  hundreds more of the Huorns must have been passing by to help in the battle.  Later  there was  a  great  rumble  of  thunder away south, and  flashes  of  lightning   far  away  across  Rohan.  Every  now  and  then  we  could  see  mountain-peaks, miles and miles away, stab  out suddenly,  black  and white,  and then vanish. And behind us there were  noises like thunder in hills, but  different. At times the whole valley echoed.       'It  must have been  about midnight when  the Ents broke  the  dams and  poured all the gathered waters through a gap in the northern wall, down into  Isengard. The  Huorn-dark had passed,  and the  thunder had rolled away. The  Moon was sinking behind the western mountains.        'Isengard began to fill up with black  creeping streams and pools. They  glittered  in the  last  light of the Moon,  as  they spread over the plain.  Every now and  then the waters  found their  way down  into  some  shaft  or   spouthole. Great  white steams hissed up. Smoke rose in billows.  There were  explosions and gusts  of fire. One great  coil of  vapour  went whirling up,  twisting round and round Orthanc, until it looked like a tall peak of cloud,  fiery underneath and moonlit above. And still more water poured in, until at  last Isengard looked like a huge flat saucepan, all steaming and bubbling.'       'We saw  a cloud of smoke and steam from  the  south last night when we  came to the mouth of Nan Curunnr,' said Aragorn. 'We feared that Saruman  was  brewing some new devilry for us.'       'Not he!' said Pippin. 'He was probably  choking and  not laughing  any  more. By  the morning, yesterday morning, the water  had sunk down  into all  the holes,  and there was a dense fog. We took refuge in that guardroom over  there; and we had  rather a fright. The lake began  to overflow and pour out  through the old  tunnel,  and the  water was rapidly rising up the steps. We  thought we were  going to get caught  like  Orcs in a  hole; but we  found a   winding stair at the back of  the  store-room that brought  us out on top of  the arch. It was a squeeze to get  out, as the passages had been cracked and  half blocked with fallen stone  near the top. There  we sat high up above the   ####-floods  and watched the drowning of Isengard. The  Ents kept  on pouring  in  more water, till all the fires were quenched and every cave filled. The fogs  slowly gathered together  and steamed up into  a huge umbrella of  cloud: it  must have been  a mile high. In the evening there  was a great rainbow  over   the eastern hills; and then the sunset was blotted out by a thick drizzle on  the mountain-sides. It  all went very quiet. A few wolves howled mournfully,  far away. The Ents stopped the  inflow in the  night, and sent the Isen back   into its old course. And that was the end of it all.       'Since then  the water has  been sinking  again. There  must be outlets  somewhere from the caves underneath, I think. If Saruman peeps out of any of  his  windows, it must look an untidy, dreary mess. We  felt very lonely. Not   even  a visible Ent  to talk to in all the ruin;  and no  news. We spent the  night up on top there above the arch,  and it was cold and  damp and we  did  not sleep.  We  had a feeling  that anything  might  happen  at  any minute."
}