{
  "id": "404d2bff75cb34e8cc3ed1f6556510ce4ed66f24",
  "text": "  My lord, I do not understand you.    I do not require your understanding. Only your service. Ser Cortnay will be dead within the day. Melisandre has seen it in the flames of the future. His death and the manner of it. He will not die in knightly combat, needless to say.  Stannis held out his cup, and Devan filled it again from the flagon.  Her flames do not lie. She saw Renly’s doom as well. On Dragonstone she saw it, and told Selyse. Lord Velaryon and your friend Salladhor Saan would have had me sail against Joffrey, but Melisandre told me that if I went to Storm’s End, I would win the best part of my brother’s power, and she was right.    B-but,  Davos stammered,  Lord Renly only came here because you had laid siege to the castle. He was marching toward King’s Landing before, against the Lannisters, he would have—   Stannis shifted in his seat, frowning.  Was, would have, what is that? He did what he did. He came here with his banners and his peaches, to his doom… and it was well for me he did. Melisandre saw another day in her flames as well. A morrow where Renly rode out of the south in his green armor to smash my host beneath the walls of King’s Landing. Had I met my brother there, it might have been me who died in place of him.    Or you might have joined your strength to his to bring down the Lannisters,  Davos protested.  Why not that? If she saw two futures, well… both cannot be true.   King Stannis pointed a finger.  There you err, Onion Knight. Some lights cast more than one shadow. Stand before the nightfire and you’ll see for yourself. The flames shift and dance, never still. The shadows grow tall and short, and every man casts a dozen. Some are fainter than others, that’s all. Well, men cast their shadows across the future as well. One shadow or many. Melisandre sees them all.   You do not love the woman. I know that, Davos, I am not blind. My lords mislike her too. Estermont thinks the flaming heart ill-chosen and begs to fight beneath the crowned stag as of old. Ser Guyard says a woman should not be my standard-bearer. Others whisper that she has no place in my war councils, that I ought to send her back to Asshai, that it is sinful to keep her in my tent of a night. Aye, they whisper… while she serves.    Serves how?  Davos asked, dreading the answer.   As needed.  The king looked at him.  And you?    I…  Davos licked his lips.  I am yours to command. What would you have me do?    Nothing you have not done before. Only land a boat beneath the castle, unseen, in the black of night. Can you do that?    Yes. Tonight?   The king gave a curt nod.  You will need a small boat. Not Black Betha. No one must know what you do.   Davos wanted to protest. He was a knight now, no longer a smuggler, and he had never been an assassin. Yet when he opened his mouth, the words would not come. This was Stannis, his just lord, to whom he owed all he was. And he had his sons to consider as well. Gods be good, what has she done to him?   You are quiet,  Stannis observed.  And should remain so, Davos told himself, yet instead he said,  My liege, you must have the castle, I see that now, but surely there are other ways. Cleaner ways. Let Ser Cortnay keep the bastard boy and he may well yield.    I must have the boy, Davos. Must. Melisandre has seen that in the flames as well.   Davos groped for some other answer.  Storm’s End holds no knight who can match Ser Guyard or Lord Caron, or any of a hundred others sworn to your service. This single combat… could it be that Ser Cortnay seeks for a way to yield with honor? Even if it means his own life?   A troubled look crossed the king’s face like a passing cloud.  More like he plans some treachery. There will be no combat of champions. Ser Cortnay was dead before he ever threw that glove. The flames do not lie, Davos.   Yet they require me to make them true, he thought. It had been a long time since Davos Seaworth felt so sad.  And so it was that he found himself once more crossing Shipbreaker Bay in the dark of night, steering a tiny boat with a black sail. The sky was the same, and the sea. The same salt smell was in the air, and the water chuckling against the hull was just as he remembered it. A thousand flickering campfires burned around the castle, as the fires of the Tyrells and Redwynes had sixteen years before. But all the rest was different.  The last time it was life I brought to Storm’s End, shaped to look like onions. This time it is death, in the shape of Melisandre of Asshai. Sixteen years ago, the sails had cracked and snapped with every shift of wind, until he’d pulled them down and gone on with muffled oars. Even so, his heart had been in his gullet. The men on the Redwyne galleys had grown lax after so long, however, and they had slipped through the cordon smooth as black satin. This time, the only ships in sight belonged to Stannis, and the only danger would come from watchers on the castle walls. Even so, Davos was taut as a bowstring.  Melisandre huddled upon a thwart, lost in the folds of a dark red cloak that covered her from head to heels, her face a paleness beneath the cowl."
}