{
  "id": "4061fa64a2a27272db296a44114e431d6e3d85d3",
  "text": " 'Am I right  in  guessing that you are the  Gluin, one of the twelve companions of the  great  Thorin Oakenshield?'       `Quite  right,'  answered  the dwarf,  gathering up  the  cushions  and  courteously assist ing  Frodo back  into his seat. 'And I do  not ask, for  I  have  already been  told that you  are  the  kinsman and adopted heir of our  friend Bilbo the renowned. Allow me to congratulate you on your recovery.'       `Thank you very much,' said Frodo.       'You have had  some very strange  adventures, I hear,'  said  Gluin. 'I   wonder greatly  what brings  four hobbits  on so long a journey. Nothing like  it  has happened  since Bilbo came with us. But perhaps I should not inquire  too closely, since Elrond and Gandalf do not seem disposed to talk of this?'       'I  think  we  will not  speak  of it,  at least not  yet,' said  Frodo  politely.       He guessed that  even in Elrond's house the matter of  the Ring was not  one for casual talk; and in any case he wished to forget his  troubles for a   time. 'But  I am  equally  curious,'  he  added,  `to learn what  brings  so  important a dwarf so far from the Lonely Mountain.'       Gluin looked at him. 'If you have not heard, I  think we will not speak  yet  of that either. Master  Elrond will summon us all ere long,  I believe,  and  then we shall all hear many things. But there is much else that  may be  told.'       Throughout the  rest  of  the  meal  they talked  together,  but  Frodo  listened more than he spoke; for the news of the Shire, apart from the Ring,  seemed small and far-away and unimportant. while  Gluin had much to tell  of  events in the northern regions of Wilderland.  Frodo  learned that Grimbeorn  the Old, son of  Beorn, was now the lord  of  many sturdy men ,  and to their   land between the Mountains and Mirkwood neither orc nor wolf dared to go.        'lndeed,' said Gluin,  `if it were not for  the  Beornings, the passage   ####-from  Dale  to Rivendell  would long  ago  have become  impossible. They are  valiant men and keep open  the High Pass  and the Ford of Carrock. But their  tolls are high,' he added with a shake of his  head;  `and like Beorn of old  they are not over fond of dwarves. Still, they are trusty,  and that is much  in these days. Nowhere are there any men so friendly to  us  as the  Men  of  Dale. They  are  good  folk,  the Bardings. The  grandson of Bard the Bowman  rules  them,  Brand son of Bain  son of Bard. He is a  strong king.  and his  realm now reaches far south and east of Esgaroth.'       'And what of your own people?' asked Frodo.       `There is much  to tell, good and bad,' said  Gluin; 'yet it  is mostly  good:  we have so far been fortunate, though  we do not escape the shadow of  these  times. If you  really  wish  to  hear of us, I will tell  you tidings  gladly.  But stop  me when  you are  weary!  Dwarves'  tongues  run  on when  speaking of their handiwork, they say.'       And with that  Gluin embarked on a long  account of the doings  of  the  Dwarf-kingdom.  He  was delighted  to have found  so polite a  listener; for   Frodo showed no sign of weariness and made no attempt to change the subject,  though  actually he  soon  got rather lost among the strange names of people  and places that he had never heard of before. He was interested, however, to  hear that Dbin was  still  King under the  Mountain, and was now old (having  passed  his two hundred  and fiftieth year), venerable, and fabulously rich.  Of the ten companions who had survived the Battle of Five Armies  seven were  still with him: Dwalin, Gluin, Dori, Nori,  Bifur, Bofur, and Bombur. Bombur  was now so fat that he could not move himself from his couch to his chair at  table, and it took six young dwarves to lift him.       'And what has become of Balin and Ori and Uin?' asked Frodo.       A shadow passed  over Gluin's face.  `We do not know,' he answered. 'It  is largely  on account of  Balin that I have come to ask the advice of those  that dwell in Rivendell. But tonight let us speak of merrier things!'       Gluin began then  to talk  of the works of  his  people,  telling Frodo  about their  great  labours in Dale  and under the  Mountain. 'We have  done  well,' he  said. `But  in  metalwork  we cannot rival  our fathers, many  of  whose. secrets are lost. We make good armour and keen swords, but  we cannot  again make mail or blade  to match  those  that were  made before the dragon  came. Only in mining and building have we surpassed the old days. You should  see  the  waterways of Dale,  Frodo, and the fountains, and  the pools!  You   should  see  the  stone-paved roads  of  many  colours! And  the  halls  and   ####-cavernous streets under the earth with  arches  carved  like trees;  and the  terraces and  towers upon the Mountain's  sides! Then you would  see that we  have not been idle.'       'I will come and see them, if  ever I can,' said  Frodo. 'How surprised  Bilbo would have been to see all the changes in the Desolation of Smaug!'       Gluin looked at Frodo and smiled."
}