{
  "id": "409316e85e3200c62722410d9a0366de0b71bedc",
  "text": " And no one had raised a voice or drawn a blade or anything, not Harwin who always talked so bold, or Alyn who was going to be a knight, or Jory who was captain of the guard. Not even her father.   He was my friend,  Arya whispered into her plate, so low that no one could hear. Her ribs sat there untouched, grown cold now, a thin film of grease congealing beneath them on the plate. Arya looked at them and felt ill. She pushed away from the table.   Pray, where do you think you are going, young lady?  Septa Mordane asked.   I’m not hungry.  Arya found it an effort to remember her courtesies.  May I be excused, please?  she recited stiffly.   You may not,  the septa said.  You have scarcely touched your food. You will sit down and clean your plate.    You clean it!  Before anyone could stop her, Arya bolted for the door as the men laughed and Septa Mordane called loudly after her, her voice rising higher and higher.  Fat Tom was at his post, guarding the door to the Tower of the Hand. He blinked when he saw Arya rushing toward him and heard the septa’s shouts.  Here now, little one, hold on,  he started to say, reaching, but Arya slid between his legs and then she was running up the winding tower steps, her feet hammering on the stone while Fat Tom huffed and puffed behind her.  Her bedchamber was the only place that Arya liked in all of King’s Landing, and the thing she liked best about it was the door, a massive slab of dark oak with black iron bands. When she slammed that door and dropped the heavy crossbar, nobody could get into her room, not Septa Mordane or Fat Tom or Sansa or Jory or the Hound, nobody! She slammed it now.  When the bar was down, Arya finally felt safe enough to cry.  She went to the window seat and sat there, sniffling, hating them all, and herself most of all. It was all her fault, everything bad that had happened. Sansa said so, and Jeyne too.  Fat Tom was knocking on her door.  Arya girl, what’s wrong?  he called out.  You in there?    No!  she shouted. The knocking stopped. A moment later she heard him going away. Fat Tom was always easy to fool.  Arya went to the chest at the foot of her bed. She knelt, opened the lid, and began pulling her clothes out with both hands, grabbing handfuls of silk and satin and velvet and wool and tossing them on the floor. It was there at the bottom of the chest, where she’d hidden it. Arya lifted it out almost tenderly and drew the slender blade from its sheath.  Needle.  She thought of Mycah again and her eyes filled with tears. Her fault, her fault, her fault. If she had never asked him to play at swords with her…  There was a pounding at her door, louder than before.  Arya Stark, you open this door at once, do you hear me?   Arya spun around, with Needle in her hand.  You better not come in here!  she warned. She slashed at the air savagely.   The Hand will hear of this!  Septa Mordane raged.   I don’t care,  Arya screamed.  Go away.    You will rue this insolent behavior, young lady, I promise you that.  Arya listened at the door until she heard the sound of the septa’s receding footsteps.  She went back to the window, Needle in hand, and looked down into the courtyard below. If only she could climb like Bran, she thought; she would go out the window and down the tower, run away from this horrible place, away from Sansa and Septa Mordane and Prince Joffrey, from all of them. Steal some food from the kitchens, take Needle and her good boots and a warm cloak. She could find Nymeria in the wild woods below the Trident, and together they’d return to Winterfell, or run to Jon on the Wall. She found herself wishing that Jon was here with her now. Then maybe she wouldn’t feel so alone.  A soft knock at the door behind her turned Arya away from the window and her dreams of escape.  Arya,  her father’s voice called out.  Open the door. We need to talk.   Arya crossed the room and lifted the crossbar. Father was alone. He seemed more sad than angry. That made Arya feel even worse.  May I come in?  Arya nodded, then dropped her eyes, ashamed. Father closed the door.  Whose sword is that?    Mine.  Arya had almost forgotten Needle, in her hand.   Give it to me.   Reluctantly Arya surrendered her sword, wondering if she would ever hold it again. Her father turned it in the light, examining both sides of the blade. He tested the point with his thumb.  A bravo’s blade,  he said.  Yet it seems to me that I know this maker’s mark. This is Mikken’s work.   Arya could not lie to him. She lowered her eyes.  Lord Eddard Stark sighed.  My nine-year-old daughter is being armed from my own forge, and I know nothing of it. The Hand of the King is expected to rule the Seven Kingdoms, yet it seems I cannot even rule my own household. How is it that you come to own a sword, Arya? Where did you get this?   Arya chewed her lip and said nothing. She would not betray Jon, not even to their father.  After a while, Father said,  I don’t suppose it matters, truly.  He looked down gravely at the sword in his hands."
}