{
  "id": "40a9c46c661cbf4adb02f4cccb69d97cf15ec8c7",
  "text": " Inside were mounds of gold coins. Columns of silver. Heaps of little bronze Knuts.  \"All yours,\" smiled Hagrid.  All Harry's -- it was incredible. The Dursleys couldn't have known about this or they'd have had it from him faster than blinking. How often had they complained how much Harry cost them to keep? And all the time there had been a small fortune belonging to him, buried deep under London.  Hagrid helped Harry pile some of it into a bag.  \"The gold ones are Galleons,\" he explained. \"Seventeen silver Sickles to a Galleon and twenty-nine Knuts to a Sickle, it's easy enough. Right, that should be enough fer a couple o' terms, we'll keep the rest safe for yeh.\" He turned to Griphook. \"Vault seven hundred and thirteen now, please, and can we go more slowly?\"  \"One speed only,\" said Griphook.  They were going even deeper now and gathering speed. The air became colder and colder as they hurtled round tight corners. They went rattling over an underground ravine, and Harry leaned over the side to try to see what was down at the dark bottom, but Hagrid groaned and pulled him back by the scruff of his neck.  Vault seven hundred and thirteen had no keyhole.  \"Stand back,\" said Griphook importantly. He stroked the door gently with one of his long fingers and it simply melted away.  \"If anyone but a Gringotts goblin tried that, they'd be sucked through the door and trapped in there,\" said Griphook.  \"How often do you check to see if anyone's inside?\" Harry asked.  \"About once every ten years,\" said Griphook with a rather nasty grin.  Something really extraordinary had to be inside this top security vault, Harry was sure, and he leaned forward eagerly, expecting to see fabulous jewels at the very least -- but at first he thought it was empty. Then he noticed a grubby little package wrapped up in brown paper lying on the floor. Hagrid picked it up and tucked it deep inside his coat. Harry longed to know what it was, but knew better than to ask.  \"Come on, back in this infernal cart, and don't talk to me on the way back, it's best if I keep me mouth shut,\" said Hagrid.  One wild cart ride later they stood blinking in the sunlight outside Gringotts. Harry didn't know where to run first now that he had a bag full of money. He didn't have to know how many Galleons there were to a pound to know that he was holding more money than he'd had in his whole life -- more money than even Dudley had ever had.  \"Might as well get yer uniform,\" said Hagrid, nodding toward Madam Malkin's Robes for All Occasions. \"Listen, Harry, would yeh mind if I slipped off fer a pick-me-up in the Leaky Cauldron? I hate them Gringotts carts.\" He did still look a bit sick, so Harry entered Madam Malkin's shop alone, feeling nervous.  Madam Malkin was a squat, smiling witch dressed all in mauve.  \"Hogwarts, clear?\" she said, when Harry started to speak. \"Got the lot here -- another young man being fitted up just now, in fact. \"  In the back of the shop, a boy with a pale, pointed face was standing on a footstool while a second witch pinned up his long black robes. Madam Malkin stood Harry on a stool next to him) slipped a long robe over his head, and began to pin it to the right length.  \"Hello,\" said the boy, \"Hogwarts, too?\"  \"Yes,\" said Harry.  \"My father's next door buying my books and mother's up the street looking at wands,\" said the boy. He had a bored, drawling voice. \"Then I'm going to drag them off to took at racing brooms. I don't see why first years can't have their own. I think I'll bully father into getting me one and I'll smuggle it in somehow.\"  Harry was strongly reminded of Dudley.  \"Have you got your own broom?\" the boy went on.  \"No,\" said Harry.  \"Play Quidditch at all?\"  \"No,\" Harry said again, wondering what on earth Quidditch could be.  \"I do -- Father says it's a crime if I'm not picked to play for my house, and I must say, I agree. Know what house you'll be in yet?\"  \"No,\" said Harry, feeling more stupid by the minute.  \"Well, no one really knows until they get there, do they, but I know I'll be in Slytherin, all our family have been -- imagine being in Hufflepuff, I think I'd leave, wouldn't you?\" \"Mmm,\" said Harry, wishing he could say something a bit more interesting.  \"I say, look at that man!\" said the boy suddenly, nodding toward the front window. Hagrid was standing there, grinning at Harry and pointing at two large ice creams to show he couldn't come in.  \"That's Hagrid,\" said Harry, pleased to know something the boy didn't. \"He works at Hogwarts.\"  \"Oh,\" said the boy, \"I've heard of him. He's a sort of servant, isn't he?\"  \"He's the gamekeeper,\" said Harry. He was liking the boy less and less every second.  \"Yes, exactly. I heard he's a sort of savage -- lives in a hut on the school grounds and every now and then he gets drunk, tries to do magic, and ends up setting fire to his bed.\"  \"I think he's brilliant,\" said Harry coldly.  \"Do you?\" said the boy, with a slight sneer. \"Why is he with you? Where are your parents?\"  \"They're dead,\" said Harry shortly."
}