{
  "id": "40b97fbcef49398171884a794fd29b61ca702ddc",
  "text": "  \"Come!\" called Gandalf.  \"There  is yet  time  for council. Let Dain  son of Nain  come swiftly to us!\"    So  began  a  battle  that  none  had  expected; and  it was called  the Battle of Five  Armies,  and  it  was  very  terrible.  Upon  one  side  were  the  Goblins  and  the  wild  Wolves, and upon  the other were Elves and Men and Dwarves. This  is how  it  fell  out.  Ever  since  the  fall  of  the Great Goblin  of  the Misty Mountains  the hatred of  their  race  for  the  dwarves  had  been  rekindled  to  fury. Messengers  had  passed  to  and fro between all their cities, colonies and strongholds; for they resolved now to  win  the  dominion  of  the  North.  Tidings  they  had  gathered  in  secret  ways; and  in  all  the  mountains  there  was  a  forging  and  an  arming.  Then  they  marched  and  gathered by hill  and valley, going  ever by  tunnel or under dark, until  around  and  beneath the great mountain Gundabad of the North, where was their capital, a vast  host  was  assembled  ready  to  sweep  down  in  time  of  storm  unawares  upon  the  South. Then  they  learned of  the death of Smaug,  and  joy was  in  their hearts:  and  they hastened night  after night  through  the mountains,  and  came  thus  at  last on  a  sudden  from  the  North  hard  on  the  heels  of  Dain.  Not  even  the  ravens  knew  of  their  coming  until  they  came  out  in  the  broken  lands  which  divided  the  Lonely  Mountain from the hills behind. How much Gandalf knew cannot be said, but it is  plain that he had not expected this sudden assault.                                                                 *  Son of Azog   ####-This is the plan that he made in council with the Elvenking and with Bard; and  with  Dain,  for  the  dwarf-lord  now  joined  them:  the  Goblins  were  the  foes  of  all,  and at  their coming all other quarrels were  forgotten. Their only hope was  to  lure  the  goblins  into  the  valley  between  the  arms  of  the Mountain;  and  themselves  to  man  the  great  spurs  that  struck  south  and  east. Yet  this would  be  perilous,  if  the  goblins  were  in  sufficient  numbers  to  overrun  the  Mountain  itself,  and  so  attack  them also  from behind and above; but there was no time for make any other plan,  or to summon any help.  Soon  the  thunder  passed,  rolling  away  to  the  South-East;  but  the  bat-cloud  came,  flying  lower,  over  the  shoulder  of  the  Mountain,  and  whirled  above  them  shutting out the light and filling them with dread.  \"To  the  Mountain!\"  called  Bard.  \"To  the  Mountain!  Let  us  take  our  places  while there is yet time!\"  On  the Southern spur,  in  its  lower slopes and  in  the  rocks at  its  feet,  the Elves  were  set;  on  the  Eastern  spur  were men  and  dwarves.  But  Bard  and  some  of  the  nimblest of men and elves climbed  to  the height of  the Eastern  shoulder  to gain a  view  to  the North. Soon  they could see  the  lands before  the Mountain's  feet black  with a hurrying multitude. Ere long the vanguard swirled round the spur's end and  came  rushing  into  Dale.  These  were  the  swiftest  wolf-riders,  and  already  their  cries  and  howls  rent  the  air  afar.  A  few  brave  men  were  strung  before  them  to  make  a  feint  of  resistance,  and many  there  fell  before  the  rest  drew  back  and fled  to  either  side.  As  Gandalf  had  hoped,  the  goblin  army  had  gathered  behind  the  resisted  vanguard,  and  poured  now  in  rage  into  the  valley,  driving  wildly  up  between  the  arms  of  the  Mountain,  seeking  for  the  foe.  Their  banners  were  countless, black and red, and they came on like a tide in fury and disorder.   It  was  a  terrible  battle.  The  most  dreadful  of  all  Bilbo's  experiences,  and  the  one which  at  the  time he hated most  – which is to say it was the one he was most  proud  of,  and  most  fond  of  recalling  long  afterwards,  although  he  was  quite  unimportant in it. Actually I must say he put on his ring early in the business, and  vanished  from  sight,  if  not  from  all  danger.  A  magic  ring  of  that  sort  is  not  a  complete  protection  in  a  goblin  charge,  nor  does  it  stop  flying  arrows  and  wild  spears;  but  it  does  help  in  getting  out  of  the way,  and  it  prevents  your  head  from  being specially chosen for a sweeping stroke by a goblin swordsman.  The  elves  were  the  first  to  charge.  Their  hatred  for  the  goblins  is  cold  and  bitter. Their spears and swords shone  in  the gloom with a gleam of chill flame, so  deadly  was  the  wrath  of  the  hands  that  held  them.  As  soon  as  the  host  of  their  enemies was dense  in  the valley,  they sent against  it a shower of arrows, and each   ####-flickered  as  it  fled  as  if with  stinging  fire.  Behind  the  arrows  a  thousand  of  their  spearmen  leapt  down  and  charged.  The  yells  were  deafening.  The  rocks  were  stained  black  with  goblin  blood."
}