{
  "id": "40f289730f5b3dd5badb6b22dabf397bdb857bdf",
  "text": " Sansa kept looking at the stubby little candle, anxious that it might go out. Old Nan had told her there were spiders down here, and rats as big as dogs. Robb smiled when she said that.  There are worse things than spiders and rats,  he whispered.  This is where the dead walk.  That was when they heard the sound, low and deep and shivery. Baby Bran had clutched at Arya’s hand.  When the spirit stepped out of the open tomb, pale white and moaning for blood, Sansa ran shrieking for the stairs, and Bran wrapped himself around Robb’s leg, sobbing. Arya stood her ground and gave the spirit a punch. It was only Jon, covered with flour.  You stupid,  she told him,  you scared the baby,  but Jon and Robb just laughed and laughed, and pretty soon Bran and Arya were laughing too.  The memory made Arya smile, and after that the darkness held no more terrors for her. The stableboy was dead, she’d killed him, and if he jumped out at her she’d kill him again. She was going home. Everything would be better once she was home again, safe behind Winterfell’s grey granite walls.  Her footsteps sent soft echoes hurrying ahead of her as Arya plunged deeper into the darkness.      SANSA  They came for Sansa on the third day.  She chose a simple dress of dark grey wool, plainly cut but richly embroidered around the collar and sleeves. Her fingers felt thick and clumsy as she struggled with the silver fastenings without the benefit of servants. Jeyne Poole had been confined with her, but Jeyne was useless. Her face was puffy from all her crying, and she could not seem to stop sobbing about her father.   I’m certain your father is well,  Sansa told her when she had finally gotten the dress buttoned right.  I’ll ask the queen to let you see him.  She thought that kindness might lift Jeyne’s spirits, but the other girl just looked at her with red, swollen eyes and began to cry all the harder. She was such a child.  Sansa had wept too, the first day. Even within the stout walls of Maegor’s Holdfast, with her door closed and barred, it was hard not to be terrified when the killing began. She had grown up to the sound of steel in the yard, and scarcely a day of her life had passed without hearing the clash of sword on sword, yet somehow knowing that the fighting was real made all the difference in the world. She heard it as she had never heard it before, and there were other sounds as well, grunts of pain, angry curses, shouts for help, and the moans of wounded and dying men. In the songs, the knights never screamed nor begged for mercy.  So she wept, pleading through her door for them to tell her what was happening, calling for her father, for Septa Mordane, for the king, for her gallant prince. If the men guarding her heard her pleas, they gave no answer. The only time the door opened was late that night, when they thrust Jeyne Poole inside, bruised and shaking.  They’re killing everyone,  the steward’s daughter had shrieked at her. She went on and on. The Hound had broken down her door with a warhammer, she said. There were bodies on the stair of the Tower of the Hand, and the steps were slick with blood. Sansa dried her own tears as she struggled to comfort her friend. They went to sleep in the same bed, cradled in each other’s arms like sisters.  The second day was even worse. The room where Sansa had been confined was at the top of the highest tower of Maegor’s Holdfast. From its window, she could see that the heavy iron portcullis in the gatehouse was down, and the drawbridge drawn up over the deep dry moat that separated the keep-within-a-keep from the larger castle that surrounded it. Lannister guardsmen prowled the walls with spears and crossbows to hand. The fighting was over, and the silence of the grave had settled over the Red Keep. The only sounds were Jeyne Poole’s endless whimpers and sobs.  They were fed—hard cheese and fresh-baked bread and milk to break their fast, roast chicken and greens at midday, and a late supper of beef and barley stew—but the servants who brought the meals would not answer Sansa’s questions. That evening, some women brought her clothes from the Tower of the Hand, and some of Jeyne’s things as well, but they seemed nearly as frightened as Jeyne, and when she tried to talk to them, they fled from her as if she had the grey plague. The guards outside the door still refused to let them leave the room.   Please, I need to speak to the queen again,  Sansa told them, as she told everyone she saw that day.  She’ll want to talk to me, I know she will. Tell her I want to see her, please. If not the queen, then Prince Joffrey, if you’d be so kind. We’re to marry when we’re older.   At sunset on the second day, a great bell began to ring. Its voice was deep and sonorous, and the long slow clanging filled Sansa with a sense of dread. The ringing went on and on, and after a while they heard other bells answering from the Great Sept of Baelor on Visenya’s Hill. The sound rumbled across the city like thunder, warning of the storm to come."
}