{
  "id": "415973fee4414ff0d237ae52ffefed6903810837",
  "text": "  \"She was Head of Cedric's house, and knew him best.\" They had reached the stone gargoyle.  Dumbledore gave the password, it sprang aside, and he and Harry went up the moving spiral staircase to the oak door.  Dumbledore pushed it open. Sirius was standing there.  His face was white and gaunt as it had been when he had escaped Azkaban.  In one swift moment, he had crossed the room. \"Harry, are you all right?  I knew it - I knew something like this - what happened?\" His hands shook as he helped Harry into a chair in front of the desk. \"What happened?\"  he asked more urgently. Dumbledore began to tell Sirius everything Barty Crouch had said.  Harry was only half listening.  So tired every bone in his body was aching, he wanted nothing more than to sit here, undisturbed, for hours and hours, until he fell asleep and didn't have to think or feel anymore. There was a soft rush of wings.  Fawkes the phoenix had left his perch, flown across the office, and landed on Harry's knee. \"'Lo, Fawkes,\" said Harry quietly.  He stroked the phoenix's beautiful scarlet-and-gold plumage.  Fawkes blinked peacefully up at him.  There was something comforting about his warm weight. Dumbledore stopped talking.  He sat down opposite Harry, behind his desk.  He was looking at Harry, who avoided his eyes.  Dumbledore was going to question him.  He was going to make Harry relive everything. \"I need to know what happened after you touched the Portkey in the maze.  Harry,\" said Dumbledore. \"We can leave that till morning, can't we, Dumbledore?\"  said Sirius harshly.  He had put a hand on Harrys shoulder.  \"Let him have a sleep.  Let him rest.\" Harry felt a rush of gratitude toward Sirius, but Dumbledore took no notice of Sirius's words.  He leaned forward toward Harry. Very unwillingly, Harry raised his head and looked into those blue eyes. \"If I thought I could help you,\" Dumbledore said gently, \"by putting you into an enchanted sleep and allowing you to postpone the moment when you would have to think about what has happened tonight, I would do it.  But I know better.  Numbing the pain for a while will make it worse when you finally feel it.  You have shown bravery beyond anything I could have expected of you.  I ask you to demonstrate your courage one more time.  I ask you to tell us what happened.\" The phoenix let out one soft, quavering note.  It shivered in the air, and Harry felt as though a drop of hot liquid had slipped down his throat into his stomach, warming him, and strengthening him. He took a deep breath and began to tell them.  As he spoke, visions of everything that had passed that night seemed to rise before his eyes; he saw the sparkling surface of the potion that had revived Voldemort; he saw the Death Eaters Apparating between the graves around them; he saw Cedric's body, lying on the ground beside the cup. Once or twice, Sirius made a noise as though about to say something, his hand still tight on Harry's shoulder, but Dumbledore raised his hand to stop him, and Harry was glad of this, because it was easier to keep going now he had started.  It was even a relief; he felt almost as though something poisonous were being extracted from him.  It was costing him every bit of determination he had to keep talking, yet he sensed that once he had finished, he would feel better. When Harry told of Wormtail piercing his arm with the dagger, however, Sirius let out a vehement exclamation and Dumbledore stood up so quickly that Harry started.  Dumbledore walked around the desk and told Harry to stretch out his arm.  Harry showed them both the place where his robes were torn and the cut beneath them. \"He said my blood would make him stronger than if he'd used someone else's,\" Harry told Dumbledore.  \"He said the protection my - my mother left in me - he'd have it too.  And he was right - he could touch me without hurting himself, he touched my face.\" For a fleeting instant, Harry thought he saw a gleam of something like triumph in Dumbledore's eyes.  But next second. Harry was sure he had imagined it, for when Dumbledore had returned to his seat behind the desk, he looked as old and weary as Harry had ever seen him. \"Very well,\" he said, sitting down again.  \"Voldemort has overcome that particular barrier.  Harry, continue, please.\" Harry went on; he explained how Voldemort had emerged from the cauldron, and told them all he could remember of Voldemort's speech to the Death Eaters.  Then he told how Voldemort had untied him, returned his wand to him, and prepared to duel. But when he reached the part where the golden beam of light had connected his and Voldemort's wands, he found his throat obstructed.  He tried to keep talking, but the memories of what had come out of Voldemort's wand were flooding into his mind.  He could see Cedric emerging, see the old man, Bertha Jorkins ... his father . . . his mother . . . He was glad when Sirius broke the silence. \"The wands connected?\"  he said, looking from Harry to Dumbledore.  \"Why?\" Harry looked up at Dumbledore again, on whose face there was an arrested look."
}