{
  "id": "4173a66a2b1c03c59b799471d4f1cdfb61c1d43c",
  "text": "       `I like  that! ' said Sam. `I  should  like  to learn it. In Moria,  in   Khazad-dym!  But it makes the darkness seem heavier, thinking  of all  those   lamps. Are there piles of jewels and gold lying about here st ill?  '       Gimli was silent. Having sung his song he would say no more.       `Piles  of jewels? ' said  Gandalf. `No. The Orcs have often  plundered  Moria; there is nothing left in the upper halls. And since the dwarves fled,  no one dares to seek the shafts and treasuries down in the deep places: they  are drowned in water --or in a shadow of fear.'       `Then what do the dwarves want to come back for? ' asked Sam.       'For mithril,' answered  Gandalf. `The  wealth of Moria was not in gold  and jewels, the toys of the Dwarves; nor in iron, their servant. Such things  they found here, it is true, especially iron; but they did not need to delve  for  them:  all things that they  desired they could obtain in  traffic. For   here alone in the world was found Moria -silver, or true-silver as some  have  called it: mithril is the Elvish name. The Dwarves have a name which they do  not tell. Its worth was  ten times that of gold, and now it is beyond price;  for little is left above  ground, and even the Orcs dare not  delve here for  it. The lodes lead away  north towards  Caradhras, and down to darkness. The  Dwarves  tell  no tale;  but  even as  mithril  was the  foundation of their  wealth, so  also it was their destruction: they delved too greedily and  too  deep,  and disturbed that from which they fled,  Durin's  Bane. Of what they  brought to light the Orcs  have gathered nearly all, and given it in tribute  to Sauron, who covets it.       `Mithril!  All  folk desired it.  It could be  beaten  like copper, and   ####-polished like glass; and the Dwarves could make of it a metal, light and yet  harder  than tempered steel. Its beauty  was like to  that of common silver,  but  the  beauty  of mithril  did not tarnish  or grow dim.  The Elves dearly  loved it, and among many uses they  made of it ithildin , starmoon, which you  saw  upon  the doors. Bilbo had a  corslet of mithril-rings that Thorin gave  him. I wonder what has become of it? Gathering dust  still in Michel Delving  Mathom-house, I suppose.'       `What?  ' cried  Gimli,  startled  out of  his  silence. `A  corslet of  Moria -silver? That was a kingly gift! '       'Yes,' said  Gandalf. `I never told him, but its worth was greater than  the value of the whole Shire and everything in it.'       Frodo said nothing, but he put his hand under his tunic and touched the  rings of his mail-shirt. He felt staggered to think that he had been walking  about with the price of the Shire under his jacket. Had Bilbo known? He felt  no doubt that Bilbo knew quite  well.  It was indeed a kingly gift. But  now  his thoughts  had been carried away  from the dark  Mines, to  Rivendell, to  Bilbo,  and to Bag  End in  the days while Bilbo was  still there. He wished  with  all his  heart  that he was back  there, and in those days, mowing the   lawn, or pottering among the flowers, and that he had never heard  of Moria,  or mithril --  or the Ring.       A deep silence fell.  One by one the others  fell  asleep. Frodo was on  guard. As if it were a breath that came in through unseen doors  out of deep  places,  dread  came  over him. His hands were cold  and his  brow  damp. He  listened. All his mind was given to listening and  nothing else for two slow  hours; but he heard no sound, not even the imagined echo of a footfall.       His  watch  was nearly over, when, far  off  where he guessed  that the  western  archway stood,  he  fancied  that he could  see two pale points  of  light, almost  like  luminous eyes. He started. His head had nodded. `I must   have  nearly fallen asleep on guard,' he thought. `I  was on  the edge  of a  dream.' He stood up and rubbed his eyes, and remained standing, peering into  the dark, until he was relieved by Legolas.       When he lay down  he quickly went to  sleep, but  it seemed to him that  the  dream went on: he  heard whispers, and saw the two pale points of light   approaching, slowly. He woke and  found that the others were speaking softly  near him, and that a  dim light  was falling on his face. High  up above the  eastern  archway through a shaft near  the roof came  a long pale gleam; and  across the hall  through  the  northern  arch light also glimmered faint and   ####-distantly.       Frodo sat up. `Good morning!  ' said  Gandalf: `For morning it is again  at last. I was right,  you see.  We  are high up on the east  side of Moria.  Before today is over we ought to find the Great  Gates and see the waters of  Mirrormere lying in the Dimrill Dale before us.'       'I shall be glad,' said Gimli. `I have looked on  Moria, and it is very  great, but it has become dark and dreadful; and we have found no  sign  of my  kindred. I doubt now that Balin ever came here.'       After they had breakfasted Gandalf decided to go on again at  once."
}