{
  "id": "41d7f56d7c177634e47462b7c9cab7d26b65bd29",
  "text": " I’d sooner have them dead, he thought bitterly. It is better to be seen as cruel than foolish.  Wisps of pale mist threaded between the trees. Sentinels and soldier pines grew thick about here, and there was nothing as dark and gloomy as an evergreen forest. The ground was uneven, and the fallen needles disguised the softness of the turf and made the footing treacherous for the horses, so they had to go slowly. Not as slowly as a man carrying a cripple, though, or a bony harridan with a four-year-old on her back. He told himself to be patient. He’d have them before the day was out.  Maester Luwin trotted up to him as they were following a game trail along the lip of a ravine.  Thus far hunting seems indistinguishable from riding through the woods, my lord.   Theon smiled.  There are similarities. But with hunting, there’s blood at the end.    Must it be so? This flight was great folly, but will you not be merciful? These are your foster brothers we seek.    No Stark but Robb was ever brotherly toward me, but Bran and Rickon have more value to me living than dead.    The same is true of the Reeds. Moat Cailin sits on the edge of the bogs. Lord Howland can make your uncle’s occupation a visit to hell if he chooses, but so long as you hold his heirs he must stay his hand.   Theon had not considered that. In truth, he had scarcely considered the mudmen at all, beyond eyeing Meera once or twice and wondering if she was still a maiden.  You may be right. We will spare them if we can.    And Hodor too, I hope. The boy is simple, you know that. He does as he is told. How many times has he groomed your horse, soaped your saddle, scoured your mail?   Hodor was nothing to him.  if he does not fight us, we will let him live.  Theon pointed a finger.  But say one word about sparing the wildling, and you can die with her. She swore me an oath, and pissed on it.   The maester inclined his head.  I make no apologies for oathbreakers. Do what you must. I thank you for your mercy.   Mercy, thought Theon as Luwin dropped back. There’s a bloody trap. Too much and they call you weak, too little and you’re monstrous. Yet the maester had given him good counsel, he knew. His father thought only in terms of conquest, but what good was it to take a kingdom if you could not hold it? Force and fear could carry you only so far. A pity Ned Stark had taken his daughters south; elsewise Theon could have tightened his grip on Winterfell by marrying one of them. Sansa was a pretty little thing too, and by now likely even ripe for bedding. But she was a thousand leagues away, in the clutches of the Lannisters. A shame.  The wood grew ever wilder. The pines and sentinels gave way to huge dark oaks. Tangles of hawthorn concealed treacherous gullies and cuts. Stony hills rose and fell. They passed a crofter’s cottage, deserted and overgown, and skirted a flooded quarry where the still water had a sheen as grey as steel. When the dogs began to bay, Theon figured the fugitives were near at hand. He spurred Smiler and followed at a trot, but what he found was only the carcass of a young elk… or what remained of it.  He dismounted for a closer look. The kill was still fresh, and plainly the work of wolves. The dogs sniffed round it eagerly, and one of the mastiffs buried his teeth in a haunch until Farlen shouted him off. No part of this animal has been butchered, Theon realized. The wolves ate, but not the men. Even if Osha did not want to risk a fire, she ought to have cut them a few steaks. It made no sense to leave so much good meat to rot.  Farlen, are you certain we’re on the right trail?  he demanded.  Could your dogs be chasing the wrong wolves?    My bitch knows the smell of Summer and Shaggy well enough.    I hope so. For your sake.   Less than an hour later, the trail led down a slope toward a muddy brook swollen by the recent rains. It was there the dogs lost the scent. Farlen and Wex waded across with the hounds and came back shaking their heads while the animals ranged up and down the far bank, sniffing.  They went in here, m’lord, but I can’t see where they come out,  the kennelmaster said.  Theon dismounted and knelt beside the stream. He dipped a hand in it. The water was cold.  They won’t have stayed long in this,  he said.  Take half the dogs downstream, I’ll go up—   Wex clapped his hands together loudly.   What is it?  Theon said.  The mute boy pointed.  The ground near the water was sodden and muddy. The tracks the wolves had left were plain enough.  Pawprints, yes. So?   Wex drove his heel into the mud, and pivoted his foot this way and that. It left a deep gouge.  Joseth understood.  A man the size of Hodor ought to have left a deep print in this mud,  he said.  More so with the weight of a boy on his back. Yet the only boot prints here are our own. See for yourself.   Appalled, Theon saw it was true. The wolves had gone into the turgid brown water alone.  Osha must have turned aside back of us. Before the elk, most likely. She sent the wolves on by themselves, hoping we’d chase after them."
}