{
  "id": "42e2656dcc6db59f53cb0609bc2293f76b7304dc",
  "text": " Flickering orange light fell through the ancient iron bars from the torch in the sconce on the wall outside, but the back half of the cell remained drenched in gloom. It was dank as well, as might be expected on an isle such as Dragonstone, where the sea was never far. And there were rats, as many as any dungeon could expect to have and a few more besides.  But Davos could not complain of chill. The smooth stony passages beneath the great mass of Dragonstone were always warm, and Davos had often heard it said they grew warmer the farther down one went. He was well below the castle, he judged, and the wall of his cell often felt warm to his touch when he pressed a palm against it. Perhaps the old tales were true, and Dragonstone was built with the stones of hell.  He was sick when they first brought him here. The cough that had plagued him since the battle grew worse, and a fever took hold of him as well. His lips broke with blood blisters, and the warmth of the cell did not stop his shivering. I will not linger long, he remembered thinking. I will die soon, here in the dark.  Davos soon found that he was wrong about that, as about so much else. Dimly he remembered gentle hands and a firm voice, and young Maester Pylos looking down on him. He was given hot garlic broth to drink, and milk of the poppy to take away his aches and shivers. The poppy made him sleep and while he slept they leeched him to drain off the bad blood. Or so he surmised, by the leech marks on his arms when he woke. Before very long the coughing stopped, the blisters vanished, and his broth had chunks of whitefish in it, and carrots and onions as well. And one day he realized that he felt stronger than he had since Black Betha shattered beneath him and flung him in the river.  He had two gaolers to tend him. One was broad and squat, with thick shoulders and huge strong hands. He wore a leather brigantine dotted with iron studs, and once a day brought Davos a bowl of oaten porridge. Sometimes he sweetened it with honey or poured in a bit of milk. The other gaoler was older, stooped and sallow, with greasy unwashed hair and pebbled skin. He wore a doublet of white velvet with a ring of stars worked upon the breast in golden thread. It fit him badly, being both too short and too loose, and was soiled and torn besides. He would bring Davos plates of meat and mash, or fish stew, and once even half a lamprey pie. The lamprey was so rich he could not keep it down, but even so, it was a rare treat for a prisoner in a dungeon.  Neither sun nor moon shone in the dungeons; no windows pierced the thick stone walls. The only way to tell day from night was by his gaolers. Neither man would speak to him, though he knew they were no mutes; sometimes he heard them exchange a few brusque words as the watch was changing. They would not even tell him their names, so he gave them names of his own. The short strong one he called Porridge, the stooped sallow one Lamprey, for the pie. He marked the passage of days by the meals they brought, and by the changing of the torches in the sconce outside his cell.  A man grows lonely in the dark, and hungers for the sound of a human voice. Davos would talk to the gaolers whenever they came to his cell, whether to bring him food or change his slops pail. He knew they would be deaf to pleas for freedom or mercy; instead he asked them questions, hoping perhaps one day one might answer.  What news of the war?  he asked, and  Is the king well?  He asked after his son Devan, and the Princess Shireen, and Salladhor Saan.  What is the weather like?  he asked, and  Have the autumn storms begun yet? Do ships still sail the narrow sea?   It made no matter what he asked; they never answered, though sometimes Porridge gave him a look, and for half a heartbeat Davos would think that he was about to speak. With Lamprey there was not even that much. I am not a man to him, Davos thought, only a stone that eats and shits and speaks. He decided after a while that he liked Porridge much the better. Porridge at least seemed to know he was alive, and there was a queer sort of kindness to the man. Davos suspected that he fed the rats; that was why there were so many. Once he thought he heard the gaoler talking to them as if they were children, but perhaps he’d only dreamed that.  They do not mean to let me die, he realized. They are keeping me alive, for some purpose of their own. He did not like to think what that might be. Lord Sunglass had been confined in the cells beneath Dragonstone for a time, as had Ser Hubard Rambton’s sons; all of them had ended on the pyre. I should have given myself to the sea, Davos thought as he sat staring at the torch beyond the bars. Or let the sail pass me by, to perish on my rock. I would sooner feed crabs than flames.  Then one night as he was finishing his supper, Davos felt a queer flush come over him. He glanced up through the bars, and there she stood in shimmering scarlet with her great ruby at her throat, her red eyes gleaming as bright as the torch that bathed her."
}