{
  "id": "434c507a4b87cf58f5cbd49cda2b1673dacb14f3",
  "text": " Sometimes he could hear them talking to one another, but he did not understand the words. Their voices buzzed in his ears like wasps muffled in thick felt.  He wanted to ask if they’d won the battle. We must have, else I’d be a head on a spike somewhere. If I live, we won. He did not know what pleased him more: the victory, or the fact he had been able to reason it out. His wits were coming back to him, however slowly. That was good. His wits were all he had.  The next time he woke, the draperies had been pulled back, and Podrick Payne stood over him with a candle. When he saw Tyrion open his eyes he ran off. No, don’t go, help me, help, he tried to call, but the best he could do was a muffled moan. I have no mouth. He raised a hand to his face, his every movement pained and fumbling. His fingers found stiff cloth where they should have found flesh, lips, teeth. Linen. The lower half of his face was bandaged tightly, a mask of hardened plaster with holes for breathing and feeding.  A short while later Pod reappeared. This time a stranger was with him, a maester chained and robed.  My lord, you must be still,  the man murmured.  You are grievous hurt. You will do yourself great injury. Are you thirsty?   He managed an awkward nod. The maester inserted a curved copper funnel through the feeding hole over his mouth and poured a slow trickle down his throat. Tyrion swallowed, scarcely tasting. Too late he realized the liquid was milk of the poppy. By the time the maester removed the funnel from his mouth, he was already spiraling back to sleep.  This time he dreamed he was at a feast, a victory feast in some great hall. He had a high seat on the dais, and men were lifting their goblets and hailing him as hero. Marillion was there, the singer who’d journeyed with them through the Mountains of the Moon. He played his woodharp and sang of the Imp’s daring deeds. Even his father was smiling with approval. When the song was over, Jaime rose from his place, commanded Tyrion to kneel, and touched him first on one shoulder and then on the other with his golden sword, and he rose up a knight. Shae was waiting to embrace him. She took him by the hand, laughing and teasing, calling him her giant of Lannister.  He woke in darkness to a cold empty room. The draperies had been drawn again. Something felt wrong, turned around, though he could not have said what. He was alone once more. Pushing back the blankets, he tried to sit, but the pain was too much and he soon subsided, breathing raggedly. His face was the least part of it. His right side was one huge ache, and a stab of pain went through his chest whenever he lifted his arm. What’s happened to me? Even the battle seemed half a dream when he tried to think back on it. I was hurt more badly than I knew. Ser Mandon…  The memory frightened him, but Tyrion made himself hold it, turn it in his head, stare at it hard. He tried to kill me, no mistake. That part was not a dream. He would have cut me in half if Pod had not… Pod, where’s Pod?  Gritting his teeth, he grabbed hold of the bed hangings and yanked. The drapes ripped free of the canopy overhead and tumbled down, half on the rushes and half on him. Even that small effort had dizzied him. The room whirled around him, all bare walls and dark shadows, with a single narrow window. He saw a chest he’d owned, an untidy pile of his clothing, his battered armor. This is not my bedchamber, he realized. Not even the Tower of the Hand. Someone had moved him. His shout of anger came out as a muffled moan. They have moved me here to die, he thought as he gave up the struggle and closed his eyes once more. The room was dank and cold, and he was burning.  He dreamed of a better place, a snug little cottage by the sunset sea. The walls were lopsided and cracked and the floor had been made of packed earth, but he had always been warm there, even when they let the fire go out. She used to tease me about that, he remembered. I never thought to feed the fire, that had always been a servant’s task.  We have no servants,  she would remind me, and I would say,  You have me, I’m your servant,  and she would say,  A lazy servant. What do they do with lazy servants in Casterly Rock, my lord?  and he would tell her,  They kiss them.  That would always make her giggle.  They do not neither. They beat them, I bet,  she would say, but he would insist,  No, they kiss them, just like this.  He would show her how.  They kiss their fingers first, every one, and they kiss their wrists, yes, and inside their elbows. Then they kiss their funny ears, all our servants have funny ears. Stop laughing! And they kiss their cheeks and they kiss their noses with the little bump in them, there, so, like that, and they kiss their sweet brows and their hair and their lips, their… mmmm… mouths… so…   They would kiss for hours, and spend whole days doing no more than lolling in bed, listening to the waves, and touching each other. Her body was a wonder to him, and she seemed to find delight in his."
}