{
  "id": "43fb36d79a1ac1d98dcdbe88342fe665cf15695d",
  "text": "  Mother!  he wailed.  With every eye on the king, somehow the man on the floor wrested a spear away from one of the gold cloaks, and used it to push himself back to his feet.  The throne denies him!  he cried.  He is no king!   Cersei was running toward the throne, but Lord Tywin remained still as stone. He had only to raise a finger, and Ser Meryn Trant moved forward with drawn sword. The end was quick and brutal. The gold cloaks seized the knight by the arms.  No king!  he cried again as Ser Meryn drove the point of his longsword through his chest.  Joff fell into his mother’s arms. Three maesters came hurrying forward, to bundle him out through the king’s door. Then everyone began talking at once. When the gold cloaks dragged off the dead man, he left a trail of bright blood across the stone floor. Lord Baelish stroked his beard while Varys whispered in his ear. Will they dismiss us now? Sansa wondered. A score of captives still waited, though whether to pledge fealty or shout curses, who could say?  Lord Tywin rose to his feet.  We continue,  he said in a clear strong voice that silenced the murmurs.  Those who wish to ask pardon for their treasons may do so. We will have no more follies.  He moved to the Iron Throne and there seated himself on a step, a mere three feet off the floor.  The light outside the windows was fading by the time the session drew to a close. Sansa felt limp with exhaustion as she made her way down from the gallery. She wondered how badly Joffrey had cut himself. They say the Iron Throne can be perilous cruel to those who were not meant to sit it.  Back in the safety of her own chambers, she hugged a pillow to her face to muffle a squeal of joy. Oh, gods be good, he did it, he put me aside in front of everyone. When a serving girl brought her supper, she almost kissed her. There was hot bread and fresh-churned butter, a thick beef soup, capon and carrots, and peaches in honey. Even the food tastes sweeter, she thought.  Come dark, she slipped into a cloak and left for the godswood. Ser Osmund Kettleblack was guarding the drawbridge in his white armor. Sansa tried her best to sound miserable as she bid him a good evening. From the way he leered at her, she was not sure she had been wholly convincing.  Dontos waited in the leafy moonlight.  Why so sadface?  Sansa asked him gaily.  You were there, you heard. Joff put me aside, he’s done with me, he’s…   He took her hand.  Oh, Jonquil, my poor Jonquil, you do not understand. Done with you? They’ve scarcely begun.   Her heart sank.  What do you mean?    The queen will never let you go, never. You are too valuable a hostage. And Joffrey… sweetling, he is still king. If he wants you in his bed, he will have you, only now it will be bastards he plants in your womb instead of trueborn sons.    No,  Sansa said, shocked.  He let me go, he…   Ser Dontos planted a slobbery kiss on her ear.  Be brave. I swore to see you home, and now I can. The day has been chosen.    When?  Sansa asked.  When will we go?    The night of Joffrey’s wedding. After the feast. All the necessary arrangements have been made. The Red Keep will be full of strangers. Half the court will be drunk and the other half will be helping Joffrey bed his bride. For a little while, you will be forgotten, and the confusion will be our friend.    The wedding won’t be for a moon’s turn yet. Margaery Tyrell is at Highgarden, they’ve only now sent for her.    You’ve waited so long, be patient awhile longer. Here, I have something for you.  Ser Dontos fumbled in his pouch and drew out a silvery spiderweb, dangling it between his thick fingers. It was a hair net of fine-spun silver, the strands so thin and delicate the net seemed to weigh no more than a breath of air when Sansa took it in her fingers. Small gems were set wherever two strands crossed, so dark they drank the moonlight.  What stones are these?    Black amethysts from Asshai. The rarest kind, a deep true purple by daylight.    It’s very lovely,  Sansa said, thinking, It is a ship I need, not a net for my hair.   Lovelier than you know, sweet child. It’s magic, you see. It’s justice you hold. It’s vengeance for your father.  Dontos leaned close and kissed her again.  It’s home.       THEON  Maester Luwin came to him when the first scouts were seen outside the walls.  My lord prince,  he said,  you must yield.   Theon stared at the platter of oakcakes, honey, and blood sausage they’d brought him to break his fast. Another sleepless night had left his nerves raw, and the very sight of food sickened him.  There has been no reply from my uncle?    None,  the maester said.  Nor from your father on Pyke.    Send more birds.    It will not serve. By the time the birds reach—    Send them!  Knocking the platter of food aside with a swipe of his arm, he pushed off the blankets and rose from Ned Stark’s bed naked and angry.  Or do you want me dead? Is that it, Luwin? The truth now.   The small grey man was unafraid.  My order serves."
}