{
  "id": "44209ce00e28425f32c3c99a37069833b279909d",
  "text": " He hung the kettle above the flames while he gathered the rest of his ingredients. The Old Bear was particular about his hot spiced wine. So much cinnamon and so much nutmeg and so much honey, not a drop more. Raisins and nuts and dried berries, but no lemon, that was the rankest sort of southron heresy—which was queer, since he always took lemon in his morning beer. The drink must be hot to warm a man properly, the Lord Commander insisted, but the wine must never be allowed to come to a boil. Jon kept a careful eye on the kettle.  As he worked, he could hear the voices from inside the tent. Jarman Buckwell said,  The easiest road up into the Frostfangs is to follow the Milkwater back to its source. Yet if we go that path, Rayder will know of our approach, certain as sunrise.    The Giant’s Stair might serve,  said Ser Mallador Locke,  or the Skirling Pass, if it’s clear.   The wine was steaming. Jon lifted the kettle off the fire, filled eight cups, and carried them into the tent. The Old Bear was peering at the crude map Sam had drawn him that night back in Craster’s Keep. He took a cup from Jon’s tray, tried a swallow of wine, and gave a brusque nod of approval. His raven hopped down his arm.  Corn,  it said.  Corn. Corn.   Ser Ottyn Wythers waved the wine away.  I would not go into the mountains at all,  he said in a thin, tired voice.  The Frostfangs have a cruel bite even in summer, and now… if we should be caught by a storm…    I do not mean to risk the Frostfangs unless I must,  said Mormont.  Wildlings can no more live on snow and stone than we can. They will emerge from the heights soon, and for a host of any size, the only route is along the Milkwater. If so, we are strongly placed here. They cannot hope to slip by us.    They may not wish to. They are thousands, and we will be three hundred when the Halfhand reaches us.  Ser Mallador accepted a cup from Jon.   If it comes to battle, we could not hope for better ground than here,  declared Mormont.  We’ll strengthen the defenses. Pits and spikes, caltrops scattered on the slopes, every breach mended. Jarman, I’ll want your sharpest eyes as watchers. A ring of them, all around us and along the river, to warn of any approach. Hide them up in trees. And we had best start bringing up water too, more than we need. We’ll dig cisterns. It will keep the men occupied, and may prove needful later.    My rangers—  started Thoren Smallwood.   Your rangers will limit their ranging to this side of the river until the Halfhand reaches us. After that, we’ll see. I will not lose more of my men.    Mance Rayder might be massing his host a day’s ride from here, and we’d never know,  Smallwood complained.   We know where the wildlings are massing,  Mormont came back.  We had it from Craster. I mislike the man, but I do not think he lied to us in this.    As you say.  Smallwood took a sullen leave. The others finished their wine and followed, more courteously.   Shall I bring you supper, my lord?  Jon asked.   Corn,  the raven cried. Mormont did not answer at once. When he did he said only,  Did your wolf find game today?    He’s not back yet.    We could do with fresh meat.  Mormont dug into a sack and offered his raven a handful of corn.  You think I’m wrong to keep the rangers close?    That’s not for me to say, my lord.    It is if you’re asked.    If the rangers must stay in sight of the Fist, I don’t see how they can hope to find my uncle,  Jon admitted.   They can’t.  The raven pecked at the kernels in the Old Bear’s palm.  Two hundred men or ten thousand, the country is too vast.  The corn gone, Mormont turned his hand over.   You would not give up the search?    Maester Aemon thinks you clever.  Mormont moved the raven to his shoulder. The bird tilted its head to one side, little eyes a-glitter.  The answer was there.  Is it… it seems to me that it might be easier for one man to find two hundred than for two hundred to find one.   The raven gave a cackling scream, but the Old Bear smiled through the grey of his beard.  This many men and horses leave a trail even Aemon could follow. On this hill, our fires ought to be visible as far off as the foothills of the Frostfangs. If Ben Stark is alive and free, he will come to us, I have no doubt.    Yes,  said Jon,  but… what if…    …he’s dead?  Mormont asked, not unkindly.  Jon nodded, reluctantly.   Dead,  the raven said.  Dead. Dead.    He may come to us anyway,  the Old Bear said.  As Othor did, and Jafer Flowers. I dread that as much as you, Jon, but we must admit the possibility.    Dead,  his raven cawed, ruffling its wings. Its voice grew louder and more shrill.  Dead.   Mormont stroked the bird’s black feathers, and stifled a sudden yawn with the back of his hand.  I will forsake supper, I believe. Rest will serve me better. Wake me at first light.    Sleep well, my lord.  Jon gathered up the empty cups and stepped outside. He heard distant laughter, the plaintive sound of pipes. A great blaze was crackling in the center of the camp, and he could smell stew cooking."
}