{
  "id": "449191decd6345104655465e9273ac471c522405",
  "text": "  I  have heard  that  there are  still  forgotten  treasures  of  old  to  be  found  in  the  deserted  caverns  of  the mines  of Moria,  since  the  dwarf  and goblin war.\"  Thorin  pondered  these  words.  \"I  will  keep  this  sword  in  honour,\"  he  said.  \"May it soon cleave goblins once again!\"  \"A  wish  that  is  likely  to  be  granted  soon  enough  in  the  mountains!\"  said  Elrond.  \"But  show  me  now  your  map!\"  He  took  it  and  gazed  long  at  it,  and  he  shook  his  head;  for  if  he  did  not  altogether  approve  of  dwarves  and  their  love  of  gold, he hated dragons and their cruel wickedness, and he grieved to remember the  ruin  of  the  town  of  Dale  and  its  merry  bells,  and  the  burned  banks  of  the  bright  River Running. The moon was  shining  in  a  broad  silver  crescent. He  held  up  the  map  and  the  white  light  shone  through  it.  \"What  is  this?\"  he  said.  \"There  are  moon-letters  here,  beside  the  plain  runes  which  say  'five  feet  high  the  door  and  three may walk abreast.' \"  \"What  are moon-letters?\" asked  the hobbit  full of excitement. He  loved maps,  as  I  have  told  you  before;  and  he  also  liked  runes  and  letters  and  cunning  handwriting, though when he wrote himself it was a bit thin and spidery.   \"Moon-letters  are  rune-letters,  but  you  cannot  see  them,\"  said  Elrond,  \"not  when  you  look  straight  at  them.  They  can  only  be  seen  when  the  moon  shines  behind  them,  and what  is more, with  the more  cunning  sort  it must  be  a moon  of  the  same  shape  and  season  as  the  day  when  they  were  written.  The  dwarves  invented  them  and  wrote  them  with  silver  pens,  as  your  friends  could  tell  you.  These  must  have  been  written  on  a midsummer's  eve  in  a  crescent moon,  a  long  while ago.\"  \"What  do  they  say?\"  asked Gandalf  and Thorin  together,  a  bit  vexed  perhaps  that even Elrond should have found this out first, though really there had not been  a  chance  before,  and  there  would  not  have  been  another  until  goodness  knows  when.   ####-\"Stand  by  the  grey  stone  when  the  thrush  knocks,\"  read  Elrond,  \"and  the  setting sun with the last light of Durin's Day will shine upon the key-hole.\"  \"Durin,  Durin!\"  said  Thorin.  \"He  was  the  father  of  the  fathers  of  the  eldest  race of Dwarves, the Longbeards, and my first ancestor: I am his heir.\"  \"Then what is Durin's Day?\" asked Elrond.  \"The  first day of  the dwarves' New Year,\" said Thorin, \"is as all should know  the first, day of the last moon of Autumn on the threshold of Winter. We still call it  Durin's  Day  when  the  last  moon  of  Autumn  and  the  sun  are  in  the  sky  together.  But this will not help us much, I fear, for it passes our skill in these days to guess  when such a time will come again.\"  \"That remains to be seen,\" said Gandalf. \"Is there any more writing?\"  \"None  to  be  seen  by  this  moon,\"  said  Elrond,  and  he  gave  the  map  back  to  Thorin; and then they went down to the water to see the elves dance and sing upon  the midsummer's eve.  The  next  morning  was  a  midsummer's  morning  as  fair  and  fresh  as  could  be  dreamed: blue sky and never a cloud, and the sun dancing on the water. Now they  rode away amid songs of farewell and good speed, with their hearts ready for more  adventure,  and  with  a  knowledge  of  the  road  they  must  follow  over  the  Misty  Mountains to the land beyond.   ####-<h4>Chapter 4 </h4> <br>  Over Hill and Under Hill     There  were  many  paths  that  led  up  into  those  mountains,  and  many  passes  over them. But most of the paths were cheats and deceptions and led nowhere or to  bad ends; and most of the passes were infested by evil things and dreadful dangers.  The  dwarves  and  the  hobbit,  helped  by  the  wise  advice  of  Elrond  and  the  knowledge and memory of Gandalf, took the right road to the right pass.  Long  days  after  they  had  climbed  out  of  the  valley  and  left  the  Last  Homely  House  miles  behind,  they  were  still  going  up  and  up  and  up.  It  was  a  hard  path  and  a  dangerous  path,  a  crooked  way  and  a  lonely  and  a  long.  Now  they  could  look  back  over  the  lands  they  had  left,  laid  out  behind  them  far  below.  Far,  far  away in the West, where things were blue and faint, Bilbo knew there lay his own  country  of  safe  and  comfortable  things,  and  his  little  hobbit-hole. He shivered.  It  was  getting  bitter  cold  up  here,  and  the  wind  came  shrill  among  the  rocks.  Boulders,  too,  at  times  came  galloping  down  the  mountain-sides,  let  loose  by  midday  sun  upon  the  snow,  and  passed  among  them  (which  was  lucky),  or  over  their heads (which was alarming). The nights were comfortless and chill, and they  did not dare  to sing or  talk  too  loud,  for  the echoes were uncanny, and  the silence  seemed  to  dislike  being  broken-except by  the noise of water and  the wail of wind  and the crack of stone."
}