{
  "id": "44b1397dbe297a9edb5e8e677ad3a62533e60511",
  "text": " She felt like a child once more, only thirteen and all alone, not ready for what was about to happen to her.  They rode out together as the stars came out, leaving the khalasar and the grass palaces behind. Khal Drogo spoke no word to her, but drove his stallion at a hard trot through the gathering dusk. The tiny silver bells in his long braid rang softly as he rode.  I am the blood of the dragon,  she whispered aloud as she followed, trying to keep her courage up.  I am the blood of the dragon. I am the blood of the dragon.  The dragon was never afraid.  Afterward she could not say how far or how long they had ridden, but it was full dark when they stopped at a grassy place beside a small stream. Drogo swung off his horse and lifted her down from hers. She felt as fragile as glass in his hands, her limbs as weak as water. She stood there helpless and trembling in her wedding silks while he secured the horses, and when he turned to look at her, she began to cry.  Khal Drogo stared at her tears, his face strangely empty of expression.  No,  he said. He lifted his hand and rubbed away the tears roughly with a callused thumb.   You speak the Common Tongue,  Dany said in wonder.   No,  he said again.  Perhaps he had only that word, she thought, but it was one word more than she had known he had, and somehow it made her feel a little better. Drogo touched her hair lightly, sliding the silver-blond strands between his fingers and murmuring softly in Dothraki. Dany did not understand the words, yet there was warmth in the tone, a tenderness she had never expected from this man.  He put his finger under her chin and lifted her head, so she was looking up into his eyes. Drogo towered over her as he towered over everyone. Taking her lightly under the arms, he lifted her and seated her on a rounded rock beside the stream. Then he sat on the ground facing her, legs crossed beneath him, their faces finally at a height.  No,  he said.   Is that the only word you know?  she asked him.  Drogo did not reply. His long heavy braid was coiled in the dirt beside him. He pulled it over his right shoulder and began to remove the bells from his hair, one by one. After a moment Dany leaned forward to help. When they were done, Drogo gestured. She understood. Slowly, carefully, she began to undo his braid.  It took a long time. All the while he sat there silently, watching her. When she was done, he shook his head, and his hair spread out behind him like a river of darkness, oiled and gleaming. She had never seen hair so long, so black, so thick.  Then it was his turn. He began to undress her.  His fingers were deft and strangely tender. He removed her silks one by one, carefully, while Dany sat unmoving, silent, looking at his eyes. When he bared her small breasts, she could not help herself. She averted her eyes and covered herself with her hands.  No,  Drogo said. He pulled her hands away from her breasts, gently but firmly, then lifted her face again to make her look at him.  No,  he repeated.   No,  she echoed back at him.  He stood her up then and pulled her close to remove the last of her silks. The night air was chilly on her bare skin. She shivered, and gooseflesh covered her arms and legs. She was afraid of what would come next, but for a while nothing happened. Khal Drogo sat with his legs crossed, looking at her, drinking in her body with his eyes.  After a while he began to touch her. Lightly at first, then harder. She could sense the fierce strength in his hands, but he never hurt her. He held her hand in his own and brushed her fingers, one by one. He ran a hand gently down her leg. He stroked her face, tracing the curve of her ears, running a finger gently around her mouth. He put both hands in her hair and combed it with his fingers. He turned her around, massaged her shoulders, slid a knuckle down the path of her spine.  It seemed as if hours passed before his hands finally went to her breasts. He stroked the soft skin underneath until it tingled. He circled her nipples with his thumbs, pinched them between thumb and forefinger, then began to pull at her, very lightly at first, then more insistently, until her nipples stiffened and began to ache.  He stopped then, and drew her down onto his lap. Dany was flushed and breathless, her heart fluttering in her chest. He cupped her face in his huge hands and looked into his eyes.  No?  he said, and she knew it was a question.  She took his hand and moved it down to the wetness between her thighs.  Yes,  she whispered as she put his finger inside her.      EDDARD  The summons came in the hour before the dawn, when the world was still and grey.  Alyn shook him roughly from his dreams and Ned stumbled into the predawn chill, groggy from sleep, to find his horse saddled and the king already mounted. Robert wore thick brown gloves and a heavy fur cloak with a hood that covered his ears, and looked for all the world like a bear sitting a horse.  Up, Stark!  he roared.  Up, up! We have matters of state to discuss."
}