{
  "id": "44db662ae815eb19851e0030bb152f544e9df3c1",
  "text": " Harry dropped lower, narrowly avoiding a Ravenclaw Chaser, scanning the field frantically -- a glint of gold, a flutter of tiny wings -- the Snitch was circling the Gryffindor goal post --  Harry accelerated, eyes fixed on the speck of gold ahead -- but just then, Cho appeared out of thin air, blocking him --  \"HARRY, THIS IS NO TIME TO BE A GENTLEMAN!\" Wood roared as Harry swerved to avoid a collision. \"KNOCK HER OFF HER BROOM IF YOU HAVE TO!\"  Harry turned and caught sight of Cho; she was grinning. The Snitch had vanished again. Harry turned his Firebolt upward and was soon twenty feet above the game. Out of the corner of his eye, he saw Cho following him.... She'd decided to mark him rather than search for the Snitch herself... All right, then... if she wanted to tail him, she'd have to take the consequences....  He dived again, and Cho, thinking he'd seen the Snitch, tried to follow; Harry pulled out of the dive very sharply; she hurtled downward; he rose fast as a bullet once more, and then saw it, for the third time -- the Snitch was glittering way above the field at the Ravenclaw end.  He accelerated; so, many feet below, did Cho. He was winning, gaining on the Snitch with every second -- then --  \"Oh!\" screamed Cho, pointing.  Distracted, Harry looked down.  Three dementors, three tall, black, hooded dementors, were looking up at him.  He didn't stop to think. Plunging a hand down the neck of his robes, he whipped out his wand and roared, \"Expecto patronum!\"  Something silver-white, something enormous, erupted from the end of his wand. He knew it had shot directly at the dementors but didn't pause to watch; his mind still miraculously clear, he looked ahead -- he was nearly there. He stretched out the hand still grasping his wand and just managed to close his fingers over the small, struggling Snitch.  Madam Hooch's whistle sounded. Harry turned around in midair and saw six scarlet blurs bearing down on him; next moment, the whole team was hugging him so hard he was nearly pulled off his broom. Down below he could hear the roars of the Gryffindors in the crowd.  \"That's my boy!\" Wood kept yelling. Alicia, Angelina, and Katie had all kissed Harry; Fred had him in a grip so tight Harry felt as though his head would come off In complete disarray, the team managed to make its way back to the ground. Harry got off his broom and looked up to see a gaggle of Gryffindor supporters sprinting onto the field, Ron in the lead. Before he knew it, he had been engulfed by the cheering crowd.  \"Yes!\" Ron yelled, yanking Harry's arm into the air. \"Yes! Yes!\"  \"Well done, Harry!\" said Percy, looking delighted. \"Ten Galleons to me! Must find Penelope, excuse me --\"  \"Good for you, Harry!\" roared Seamus Finnigan.  \"Ruddy brilliant!\" boomed Hagrid over the heads of the milling Gryffindors.  \"That was quite some Patronus,\" said a voice in Harry's ear.  Harry turned around to see Professor Lupin, who looked both shaken and pleased.  \"The dementors didn't affect me at all!\" Harry said excitedly. \"I didn't feel a thing!\"  \"That would be because they -- er -- weren't dementors,\" said Professor Lupin. \"Come and see -- \"  He led Harry out of the crowd until they were able to see the edge of the field.  \"You gave Mr. Malfoy quite a fright,\" said Lupin.  Harry stared. Lying in a crumpled heap on the ground were Malfoy, Crabbe, Goyle, and Marcus Flint, the Slytherin team Captain, all struggling to remove themselves from long, black, hooded robes. It looked as though Malfoy had been standing on Goyle's shoulders. Standing over them, with an expression of the utmost fury on her face, was Professor McGonagall.  \"An unworthy trick!\" she was shouting. \"A low and cowardly attempt to sabotage the Gryffindor Seeker! Detention for all of you, and fifty points from Slytherin! I shall be speaking to Professor Dumbledore about this, make no mistake! Ah, here he comes now!\"  If anything could have set the seal on Gryffindor's victory, it was this. Ron, who had fought his way through to Harry's side, doubled up with laughter as they watched Malfoy fighting to extricate himself from the robe, Goyle's head still stuck inside it.  \"Come on, Harry!\" said George, fighting his way over. \"Party! Gryffindor common room, now!\"  \"Right,\" said Harry, and feeling happier than he had in ages, he and the rest of the team led the way, still in their scarlet robes, out of the stadium and back up to the castle.  It felt as though they had already won the Quidditch Cup; the party went on all day and well into the night. Fred and George Weasley disappeared for a couple of hours and returned with armfuls of bottles of butterbeer, pumpkin fizz, and several bags full of Honeydukes sweets.  \"How did you do that?\" squealed Angelina Johnson as George started throwing Peppermint Toads into the crowd.  \"With a little help from Moony, Wormtail, Padfoot, and Prongs,\" Fred muttered in Harry's ear.  Only one person wasn't joining in the festivities. Hermione, incredibly, was sitting in a corner, attempting to read an enormous book entitled Home Life and Social Habits of British Muggles."
}