{
  "id": "458c2d03a7239660db67e75fcb4a643cc031fb04",
  "text": " From some way off, or so it seemed, he thought he heard a cry:  'Hoy!  Frodo! Hoy!' It was away eastward, on his left as he stood  under the  great  stones, staring and straining into the gloom. He plunged off  in  the  direction of the call, and found himself going steeply uphill.       As he struggled  on he called again,  and kept on calling more and more  frantically; but he heard no answer for some time, and then it  seemed faint  and far ahead  and high above him. 'Frodo! Hoy!' came the thin voices out of  the  mist:  and then  a cry that sounded  like  help, help!  often repeated,  ending  with a  last help!  that trailed off into a  long wail  suddenly cut  short.  He stumbled forward  with all the speed he could towards  the cries;   but the light was now gone, and clinging night had closed about him, so that  it was impossible to be sure of any direction. He seemed all the time  to be  climbing up and up.       Only the change in the level of the ground at his feet told him when he   at last came to the top of a ridge or hill. He was  weary, sweating  and yet  chilled. It was wholly dark.   ####-     'Where are you?' he cried out miserably.       There was no reply. He stood listening. He was suddenly aware  that  it  was getting very cold, and that up here a wind was beginning to blow, an icy   wind. A change was coming in the weather. The mist  was flowing  past him  now  in shreds and  tatters. His breath was smoking, and  the darkness  was  less  near and  thick. He looked up  and saw with  surprise  that faint stars were  appearing  overhead amid the  strands of hurrying cloud  and  fog.  The wind  began to hiss over the grass.        He imagined suddenly that he  caught a muffled cry, and he made towards  it; and even as he went forward the mist was rolled up and thrust aside, and  the  starry sky  was  unveiled.  A glance showed him  that he was now  facing  southwards and was on a round hill-top, which he must  have climbed from the  north.  Out  of the east  the  biting wind was blowing. To his  right  there  loomed against the westward stars a dark  black  shape. A great barrow stood  there.       'Where are you?' he cried again, both angry and afraid.       'Here!'  said a voice, deep and cold,  that seemed  to come out of  the  ground. 'I am waiting for you!'       'No!' said Frodo; but  he did not run away. His knees gave, and he fell  on the ground. Nothing happened, and there was no sound. Trembling he  looked  up,  in time to see a tall dark  figure like a shadow against the stars.  It  leaned over him. He thought there were two eyes, very cold though lit with a  pale light  that seemed to come from  some  remote  distance.  Then  a  grip  stronger and colder than iron seized him. The icy touch froze his bones, and  he remembered no more.       When  he came to  himself again, for a  moment he could  recall nothing  except a sense  of  dread. Then  suddenly  he  knew  that he was imprisoned,  caught hopelessly; he was in a barrow. A  Barrow-wight had taken him, and he  was probably already under the  dreadful  spells of  the Barrow-wights about  which whispered tales spoke. He dared not move, but lay as he found himself:  flat on his back upon a cold stone with his hands on his breast.       But though his fear was so great that it seemed to be part  of the very  darkness that was round him, he found himself as he lay thinking about Bilbo  Baggins and his stories, of their jogging along together in the lanes of the  Shire and  talking about roads and adventures.  There  is  a seed of courage   ####-hidden (often deeply, it is true) in the heart of the fattest and most timid  hobbit, wailing for some final  and desperate danger to  make it grow. Frodo  was neither  very  fat nor very  timid; indeed,  though he did not  know it,  Bilbo (and Gandalf) had thought him the best hobbit in the Shire. He thought  he had come to the end of his adventure, and a terrible end, but the thought  hardened him.  He found himself stiffening,  as if for a final spring; he no  longer felt limp like a helpless prey.       As he lay there, thinking and getting a hold of himself, he noticed all  at once  that the darkness was slowly giving way:  a pale greenish light was  growing round him. It did not  at first show him what kind of a place he was  in, for the light  seemed to be  coming out of himself,  and from  the floor   beside  him, and had not yet reached the roof or wall. He  turned, and there  in  the  cold glow he saw lying beside him Sam, Pippin, and Merry. They were  on their backs, and their faces looked deathly pale;  and they were  clad in  white. About them lay many treasures, of  gold maybe,  though in that  light   they  looked cold and unlovely.  On their  heads  were circlets, gold  chains  were about their waists, and on their fingers were many rings. Swords lay by   their sides, and shields were  at their feet. But across their  three  necks  lay one long naked sword.       Suddenly a  song began: a cold  murmur, rising and  falling."
}