{
  "id": "464ad1d81ed4ed5a08c69e392d23aa763f580d56",
  "text": " The girl was a whore, you see. Jaime arranged the whole affair, the road, the outlaws, all of it. He thought it was time I had a woman. He paid double for a maiden, knowing it would be my first time.   After Jaime had made his confession, to drive home the lesson, Lord Tywin brought my wife in and gave her to his guards. They paid her fair enough. A silver for each man, how many whores command that high a price? He sat me down in the corner of the barracks and bade me watch, and at the end she had so many silvers the coins were slipping through her fingers and rolling on the floor, she…  The smoke was stinging his eyes. Tyrion cleared his throat and turned away from the fire, to gaze out into darkness.  Lord Tywin had me go last,  he said in a quiet voice.  And he gave me a gold coin to pay her, because I was a Lannister, and worth more.   After a time he heard the noise again, the rasp of steel on stone as Bronn sharpened his sword.  Thirteen or thirty or three, I would have killed the man who did that to me.   Tyrion swung around to face him.  You may get that chance one day. Remember what I told you. A Lannister always pays his debts.  He yawned.  I think I will try and sleep. Wake me if we’re about to die.   He rolled himself up in the shadowskin and shut his eyes. The ground was stony and cold, but after a time Tyrion Lannister did sleep. He dreamt of the sky cell. This time he was the gaoler, not the prisoner, big, with a strap in his hand, and he was hitting his father, driving him back, toward the abyss…   Tyrion.  Bronn’s warning was low and urgent.  Tyrion was awake in the blink of an eye. The fire had burned down to embers, and the shadows were creeping in all around them. Bronn had raised himself to one knee, his sword in one hand and his dirk in the other. Tyrion held up a hand: stay still, it said.  Come share our fire, the night is cold,  he called out to the creeping shadows.  I fear we’ve no wine to offer you, but you’re welcome to some of our goat.   All movement stopped. Tyrion saw the glint of moonlight on metal.  Our mountain,  a voice called out from the trees, deep and hard and unfriendly.  Our goat.    Your goat,  Tyrion agreed.  Who are you?    When you meet your gods,  a different voice replied,  say it was Gunthor son of Gurn of the Stone Crows who sent you to them.  A branch cracked underfoot as he stepped into the light; a thin man in a horned helmet, armed with a long knife.   And Shagga son of Dolf.  That was the first voice, deep and deadly. A boulder shifted to their left, and stood, and became a man. Massive and slow and strong he seemed, dressed all in skins, with a club in his right hand and an axe in his left. He smashed them together as he lumbered closer.  Other voices called other names, Conn and Torrek and Jaggot and more that Tyrion forgot the instant he heard them; ten at least. A few had swords and knives; others brandished pitchforks and scythes and wooden spears. He waited until they were done shouting out their names before he gave them answer.  I am Tyrion son of Tywin, of the Clan Lannister, the Lions of the Rock. We will gladly pay you for the goat we ate.    What do you have to give us, Tyrion son of Tywin?  asked the one who named himself Gunthor, who seemed to be their chief.   There is silver in my purse,  Tyrion told them.  This hauberk I wear is large for me, but it should fit Conn nicely, and the battle-axe I carry would suit Shagga’s mighty hand far better than that wood-axe he holds.    The halfman would pay us with our own coin,  said Conn.   Conn speaks truly,  Gunthor said.  Your silver is ours. Your horses are ours. Your hauberk and your battle-axe and the knife at your belt, those are ours too. You have nothing to give us but your lives. How would you like to die, Tyrion son of Tywin?    In my own bed, with a belly full of wine and a maiden’s mouth around my cock, at the age of eighty,  he replied.  The huge one, Shagga, laughed first and loudest. The others seemed less amused.  Conn, take their horses,  Gunthor commanded.  Kill the other and seize the halfinan. He can milk the goats and make the mothers laugh.   Bronn sprang to his feet.  Who dies first?    No!  Tyrion said sharply.  Gunthor son of Gurn, hear me. My House is rich and powerful. If the Stone Crows will see us safely through these mountains, my lord father will shower you with gold.    The gold of a lowland lord is as worthless as a halfman’s promises,  Gunthor said.   Half a man I may be,  Tyrion said,  yet I have the courage to face my enemies. What do the Stone Crows do, but hide behind rocks and shiver with fear as the knights of the Vale ride by?   Shagga gave a roar of anger and clashed club against axe. Jaggot poked at Tyrion’s face with the fire-hardened point of a long wooden spear. He did his best not to flinch.  Are these the best weapons you could steal?  he said.  Good enough for killing sheep, perhaps… if the sheep do not fight back. My father’s smiths shit better steel."
}