{
  "id": "4690b47eae105d64e8df1796dade401251e988bc",
  "text": "\" He gave Harry's broom a look of fervent admiration, then said, \"Okay, everyone, let's go -- \"  And at long last, Harry mounted his Firebolt, and kicked off from the ground.  It was better than he'd ever dreamed. The Firebolt turned with the lightest touch; it seemed to obey his thoughts rather than his grip; it sped across the field at such speed that the stadium turned into a green-and-gray blur; Harry turned it so sharply that Alicia Spinnet screamed, then he went into a perfectly controlled dive, brushing the grassy field with his toes before rising thirty, forty, fifty feet into the air again.  \"Harry, I'm letting the Snitch out!\" Wood called.  Harry turned and raced a Bludger toward the goal posts; he outstripped it easily, saw the Snitch dart out from behind Wood, and within ten seconds had caught it tightly in his hand.  The team cheered madly. Harry let the Snitch go again, gave it a minute's head start, then tore after it, weaving in and out of the others; he spotted it lurking near Katie Bell's knee, looped her easily, and caught it again.  It was the best practice ever; the team, inspired by the presence of the Firebolt in their midst, performed their best moves faultlessly, and by the time they hit the ground again, Wood didn't have a single criticism to make, which, as George Weasley pointed out, was a first.  \"I can't see what's going to stop us tomorrow!\" said Wood. \"Not unless -- Harry, you've sorted out your dementor problem, haven't you?\"  \"Yeah,\" said Harry, thinking of his feeble Patronus and wishing it were stronger.  \"The dementors won't turn up again, Oliver. Dumbledore'd go ballistic,\" said Fred confidently.  \"Well, let's hope not,\" said Wood. \"Anyway -- good work, everyone. Let's get back to the tower... turn in early --\"  \"I'm staying out for a bit; Ron wants a go on the Firebolt,\" Harry told Wood, and while the rest of the team headed off to the locker rooms, Harry strode over to Ron, who vaulted the barrier to the stands and came to meet him. Madam Hooch had fallen asleep in her seat.  \"Here you go,\" said Harry, handing Ron the Firebolt.  Ron, an expression of ecstasy on his face, mounted the broom and zoomed off into the gathering darkness while Harry walked around the edge of the field, watching him. Night had fallen before Madam Hooch awoke with a start, told Harry and Ron off for not waking her, and insisted that they go back to the castle.  Harry shouldered the Firebolt and he and Ron walked out of the shadowy stadium, discussing the Firebolt's superbly smooth action, its phenomenal acceleration, and its pinpoint turning. They were halfway toward the castle when Harry, glancing to his left, saw something that made his heart turn over -- a pair of eyes, gleaming out of the darkness.  Harry stopped dead, his heart banging against his ribs.  \"What's the matter?\" said Ron.  Harry pointed. Ron pulled out his wand and muttered, \"Lumos!\"  A beam of light fell across the grass, hit the bottom of a tree, and illuminated its branches; there, crouching among the budding leaves, was Crookshanks.  \"Get out of here!\" Ron roared, and he stooped down and seized a stone lying on the grass, but before he could do anything else, Crookshanks had vanished with one swish of his long ginger tail.  \"See?\" Ron said furiously, chucking the stone down again. \"She's still letting him wander about wherever he wants -- probably washing down Scabbers with a couple of birds now....\"  Harry didn't say anything. He took a deep breath as relief seeped through him; he had been sure for a moment that those eyes had belonged to the Grim. They set off for the castle once more. slightly ashamed of his moment of panic, Harry didn't say anything to Ron -- nor did he look left or right until they had reached the well-lit entrance hall.  Harry went down to breakfast the next morning with the rest of the boys in his dormitory, all of whom seemed to think the Firebolt deserved a sort of guard of honor. As Harry entered the Great Hall, heads turned in the direction of the Firebolt, and there was a good deal of excited muttering. Harry saw, with enormous satisfaction, that the Slytherin team were all looking thunderstruck.  \"Did you see his face?\" said Ron gleefully, looking back at Malfay. \"He can't believe it! This is brilliant!\"  Wood, too, was basking in the reflected glory of the Firebolt.  \"Put it here, Harry,\" he said, laying the broom in the middle of the table and carefully turning it so that its name faced upward. People from the Ravenclaw and Hufflepuff tables were soon coming over to look. Cedric Diggory came over to congratulate Harry on having acquired such a superb replacement for his Nimbus, and Percy's Ravenclaw girlfriend, Penelope Clearwater, asked if she could actually hold the Firebolt.  \"Now, now, Penny, no sabotage!\" said Percy heartily as she examined the Firebolt closely. \"Penelope and I have got a bet on,\" he told the team. \"Ten Galleons on the outcome of the match!\"  Penelope put the Firebolt down again, thanked Harry, and went back to her table."
}