{
  "id": "470150b965d4fb5d1e3612df5756b96184668771",
  "text": " \"Nothing,\" he said.  But Krum glowered at him, and Harry, somehow struck anew by how tall Krum was, elaborated.  \"We're friends.  She's not my girlfriend and she never has been.  It's just that Skeeter woman making things up.\" \"Hermy-own-ninny talks about you very often,\" said Krum, looking suspiciously at Harry. \"Yeah,\" said Harry, \"because were friends.\" He couldn't quite believe he was having this conversation with Viktor Krum, the famous International Quidditch player.  It was as though the eighteen-year-old Krum thought he. Harry, was an equal - a real rival - \"You haff never . . . you haff not...\" \"No,\" said Harry very firmly. Krum looked slightly happier.  He stared at Harry for a few seconds, then said, \"You fly very veil.  I vos votching at the first task.\" \"Thanks,\" said Harry, grinning broadly and suddenly feeling much taller himself.  \"I saw you at the Quidditch World Cup.  The Wronski Feint, you really -\" But something moved behind Krum in the trees, and Harry, who had some experience of the sort of thing that lurked in the forest, instinctively grabbed Krum's arm and pulled him around. \"Vot is it?\" Harry shook his head, staring at the place where he'd seen movement.  He slipped his hand inside his robes, reaching for his wand. Suddenly a man staggered out from behind a tall oak.  For a moment, Harry didn't recognize him . . . then he realized it was Mr. Crouch. He looked as though he had been traveling for days.  The knees of his robes were ripped and bloody, his face scratched; he was unshaven and gray with exhaustion.  His neat hair and mustache were both in need of a wash and a trim.  His strange appearance, however, was nothing to the way he was behaving.  Muttering and gesticulating, Mr. Crouch appeared to be talking to someone that he alone could see.  He reminded Harry vividly of an old tramp he had seen once when out shopping with the Dursleys.  That man too had been conversing wildly with thin air; Aunt Petunia had seized Dudley's hand and pulled him across the road to avoid him; Uncle Vernon had then treated the family to a long rant about what he would like to do with beggars and vagrants. \"Vosn't he a judge?\" said Krum, staring at Mr. Crouch.  \"Isn't he vith your Ministry?\" Harry nodded, hesitated for a moment, then walked slowly toward Mr. Crouch, who did not look at him, but continued to talk to a nearby tree. \"... and when you've done that, Weatherby, send an owl to Dumbledore confirming the number of Durmstrang students who will be attending the tournament, Karkaroff has just sent word there will be twelve. . . .\" \"Mr. Crouch?\" said Harry cautiously. \"... and then send another owl to Madame Maxime, because she might want to up the number of students she's bringing, now Karkaroff's made it a round dozen ... do that, Weatherby, will you? Will you? Will...\" Mr. Crouch's eyes were bulging.  He stood staring at the tree, muttering soundlessly at it.  Then he staggered sideways and fell to his knees. \"Mr. Crouch?\" Harry said loudly. \"Are you all right?\" Crouch's eyes were rolling in his head.  Harry looked around at Krum, who had followed him into the trees, and was looking down at Crouch in alarm. \"Vot is wrong with him?\" \"No idea,\" Harry muttered.  \"Listen, you'd better go and get someone -\" \"Dumbledore!\" gasped Mr. Crouch. He reached out and seized a handful of Harrys robes, dragging him closer, though his eyes were staring over Harry's head.  \"I need... see ... Dumbledore. ...\" \"Okay,\" said Harry, \"if you get up, Mr. Crouch, we can go up to the-\" \"I've done . . . stupid . . . thing . . .\" Mr. Crouch breathed.  He looked utterly mad.  His eyes were rolling and bulging, and a trickle of spittle was sliding down his chin.  Every word he spoke seemed to cost him a terrible effort.  \"Must. . . tell. . . Dumbledore . . .\" \"Get up, Mr. Crouch,\" said Harry loudly and clearly.  \"Get up, I'll take you to Dumbledore!\" Mr, Crouch's eyes rolled forward onto Harry. \"Who ... you?\" he whispered. \"I'm a student at the school,\" said Harry, looking around at Krum for some help, but Krum was hanging back, looking extremely nervous. \"You're not... his?\" whispered Crouch, his mouth sagging. \"No,\" said Harry, without the faintest idea what Crouch was talking about. \"Dumbledore's?\" \"That's right,\" said Harry. Crouch was pulling him closer; Harry tried to loosen Crouch's grip on his robes, but it was too powerful. \"Warn ... Dumbledore ...\" \"I'll get Dumbledore if you let go of me,\" said Harry.  \"Just let go, Mr. Crouch, and I'll get him.. . .\" \"Thank you, Weatherby, and when you have done that, I would like a cup of tea.  My wife and son will be arriving shortly, we are attending a concert tonight with Mr. and Mrs. Fudge.\" Crouch was now talking fluently to a tree again, and seemed completely unaware that Harry was there, which surprised Harry so much he didn't notice that Crouch had released him. \"Yes, my son has recently gained twelve O.W.L.S, most satisfactory, yes, thank you, yes, very proud indeed.  Now, if you could bring me that memo from the Andorran Minister of Magic, I think I will have time to draft a response."
}