{
  "id": "47aba33166ab11bfeced1df896aee41508f8b510",
  "text": " The gold cloaks found her wandering naked on Sowbelly Row.  Tyrek was still missing, as was the High Septon’s crystal crown. Nine gold cloaks had been slain, two score wounded. No one had troubled to count how many of the mob had died.   I want Tyrek found, alive or dead,  Tyrion said curtly when Bywater was done.  He’s no more than a boy. Son to my late uncle Tygett. His father was always kind to me.    We’ll find him. The septon’s crown as well.    The Others can bugger each other with the septon’s crown, for all I care.    When you named me to command the Watch, you told me you wanted plain truth, always.    Somehow I have a feeling I am not going to like whatever you’re about to say,  Tyrion said gloomily.   We held the city today, my lord, but I make no promises for the morrow. The kettle is close to boiling. So many thieves and murderers are abroad that no man’s house is safe, the bloody flux is spreading in the stews along Pisswater Bend, there’s no food to be had for copper nor silver. Where before you heard only mutterings from the gutter, now there’s open talk of treason in guildhalls and markets.    Do you need more men?    I do not trust half the men I have now. Slynt tripled the size of the Watch, but it takes more than a gold cloak to make a watchman. There are good men and loyal among the new recruits, but also more brutes, sots, cravens, and traitors than you’d care to know. They’re half-trained and undisciplined, and what loyalty they have is to their own skins. If it comes to battle, they’ll not hold, I fear.    I never expected them to,  said Tyrion.  Once our walls are breeched, we are lost, I’ve known that from the start.    My men are largely drawn from the smallfolk. They walk the same streets, drink in the same winesinks, spoon down their bowls of brown in the same pot-shops. Your eunuch must have told you, there is small love for the Lannisters in King’s Landing. Many still remember how your lord father sacked the city, when Aerys opened the gates to him. They whisper that the gods are punishing us for the sins of your House—for your brother’s murder of King Aerys, for the butchery of Rhaegar’s children, for the execution of Eddard Stark and the savagery of Joffrey’s justice. Some talk openly of how much better things were when Robert was king, and hint that times would be better again with Stannis on the throne. In pot-shops and winesinks and brothels, you hear these things—and in the barracks and guardhalls as well, I fear.    They hate my family, is that what you are telling me?    Aye… and will turn on them, if the chance comes.    Me as well?    Ask your eunuch.    I’m asking you.   Bywater’s deep-set eyes met the dwarf’s mismatched ones, and did not blink.  You most of all, my lord.    Most of all?  The injustice was like to choke him.  It was Joffrey who told them to eat their dead, Joffrey who set his dog on them. How could they blame me?    His Grace is but a boy. In the streets, it is said that he has evil councillors. The queen has never been known as a friend to the commons, nor is Lord Varys called the Spider out of love… but it is you they blame most. Your sister and the eunuch were here when times were better under King Robert, but you were not. They say that you’ve filled the city with swaggering sellswords and unwashed savages, brutes who take what they want and follow no laws but their own. They say you exiled Janos Slynt because you found him too bluff and honest for your liking. They say you threw wise and gentle Pycelle into the dungeons when he dared raise his voice against you. Some even claim that you mean to seize the Iron Throne for your own.    Yes, and I am a monster besides, hideous and misshapen, never forget that.  His hand coiled into a fist.  I’ve heard enough. We both have work to attend to. Leave me.   Perhaps my lord father was right to despise me all these years, if this is the best I can achieve, Tyrion thought when he was alone. He stared down at the remains of his supper, his belly roiling at the sight of the cold greasy capon. Disgusted, he pushed it away, shouted for Pod, and sent the boy running to summon Varys and Bronn. My most trusted advisers are a eunuch and a sellsword, and my lady’s a whore. What does that say of me?  Bronn complained of the gloom when he arrived, and insisted on a fire in the hearth. It was blazing by the time Varys made his appearance.  Where have you been?  Tyrion demanded.   About the king’s business, my sweet lord.    Ah, yes, the king,  Tyrion muttered.  My nephew is not fit to sit a privy, let alone the Iron Throne.   Varys shrugged.  An apprentice must be taught his trade.    Half the ’prentices on Reeking Lane could rule better than this king of yours.  Bronn seated himself across the table and pulled a wing off the capon.  Tyrion had made a practice of ignoring the sellsword’s frequent insolences, but tonight he found it galling.  I don’t recall giving you leave to finish my supper.    You didn’t look to be eating it,  Bronn said through a mouthful of meat."
}