{
  "id": "4816716d633057442024a47972d9e8ab31c79d4a",
  "text": "  The voice  seemed far away and immeasurably dreary, sometimes high in the air and thin,  sometimes like a low moan from the ground. Out of the formless stream of sad  but horrible sounds, strings  of words would now and again shape  themselves:   grim,  hard,  cold  words,  heartless and miserable. The night  was  railing  against the morning of  which it was bereaved,  and the cold was cursing the  warmth for which it hungered. Frodo was chilled to the marrow. After a while  the song became clearer, and  with  dread in  his heart he perceived that it  had changed into an incantation:       Cold be hand and heart and bone,       and cold be sleep under stone:       never mare to wake on stony bed,       never, till the Sun fails and the Moon is dead.       In the black wind the stars shall die,       and still on gold here let them lie,       till the dark lord lifts his hand       over dead sea and withered land.       He heard behind his head a creaking and scraping sound. Raising himself   ####-on one arm he looked, and saw now in the pale light that they were in a kind  of  passage which  behind them turned a corner. Round the corner a long  arm  was groping, walking on its fingers towards Sam, who was lying nearest,  and  towards the hilt of the sword that lay upon him.       At first Frodo felt as if he  had indeed been turned into stone by  the  incantation.  Then a wild thought  of escape came to him. He wondered if  he  put on the Ring, whether the Barrow-wight  would miss him, and he might find  some way ou t.  He thought  of himself running free  over the grass, grieving  for Merry, and Sam,  and Pippin,  but free and alive  himself. Gandalf would   admit that there had been nothing else he could do.       But the courage that had been  awakened in  him was now   too strong: he  could not  leave his friends so easily.  He wavered, groping  in his pocket,  and then fought with himself again; and as he did so  the arm  crept nearer.  Suddenly  resolve  hardened  in him,  and  he seized a  short sword that lay  beside him, and kneeling he stooped  low over the bodies of  his companions.   With what strength he had he hewed  at the crawling  arm near the wrist, and  the hand broke off; but at the  same moment the sword  splintered up to  the   hilt.  There  was a shriek and the light vanished. In  the  dark there was a   snarling noise.       Frodo fell  forward over Merry, and Merry's face felt cold. All at once  back  into  his mind, from which it had disappeared with the first coming of  the  fog,  came the  memory  of the house down  under the Hill,  and  of Tom  singing. He remembered  the rhyme  that  Tom  had taught  them. In  a  small  desperate voice  he began: Ho!  Tom  Bombadil!  and with that name his voice  seemed to grow  strong: it had a full and lively sound, and the dark chamber   echoed as if to drum and trumpet.       Ho! Tom Bombadil, Tom Bombadillo!       By water, wood and hill, by the reed and willow,        By fire, sun and moon, harken now and hear us!       Come, Tom Bombadil, for our need is near us!       There  was a sudden deep  silence, in which Frodo could hear his  heart  beating. After a long slow moment he heard plain, but far away, as if it was  coming down through the  ground or through thick walls,  an  answering voice  singing:       Old Tom Bombadil is a merry fellow,        Bright blue his jacket is, and his boots are yellow.        None has ever caught him yet, for Tom, he is the master:   ####-     His songs are stronger songs, and his feet are faster.       There was a loud rumbling sound, as of stones rolling and  falling, and  suddenly  light  streamed  in,  real  light, the plain light of  day.  A low  door -like opening appeared  at the end of the  chamber beyond  Frodo's feet;   and there was Tom's head (hat, feather, and all) framed against the light of  the sun  rising red  behind him. The light fell upon the floor, and upon the  faces of the three  hobbits lying beside Frodo. They  did not stir,  but the  sickly hue had left them. They  looked now as  if they were only very deeply   asleep.       Tom stooped, removed his hat, and came into the dark chamber, singing:        Get out, you old Wight! Vanish in the sunlight!       Shrivel like the cold mist, like the winds go wailing,       Out into the barren lands far beyond the mountains!       Come never here again! Leave your barrow empty!       Lost and forgotten be, darker than the darkness,       Where gates stand for ever shut, till the world is mended.       At these words there was a cry and part of the inner end of the chamber   fell in  with a crash.  Then  there was  a long trailing shriek, fading away  into an unguessable distance; and after that silence.       'Come, friend Frodo!' said Tom. 'Let us get out on to clean  grass! You   must help me bear them.'       Together  they  carried  out Merry, Pippin, and Sam.  As Frodo left the  barrow  for the last  time he thought he saw a severed hand wriggling still,  like  a wounded  spider, in a heap of fallen  earth."
}