{
  "id": "48460b86427b805f1e356fb1f88b435095371b5f",
  "text": "   The very one, though he named himself Aerion Brightflame. One night, in his cups, he drank a jar of wildfire, after telling his friends it would transform him into a dragon, but the gods were kind and it transformed him into a corpse. Not quite a year after, King Maekar died in battle against an outlaw lord.   Jon was not entirely innocent of the history of the realm; his own maester had seen to that.  That was the year of the Great Council,  he said.  The lords passed over Prince Aerion’s infant son and Prince Daeron’s daughter and gave the crown to Aegon.    Yes and no. First they offered it, quietly, to Aemon. And quietly he refused. The gods meant for him to serve, not to rule, he told them. He had sworn a vow and would not break it, though the High Septon himself offered to absolve him. Well, no sane man wanted any blood of Aerion’s on the throne, and Daeron’s girl was a lackwit besides being female, so they had no choice but to turn to Aemon’s younger brother—Aegon, the Fifth of His Name. Aegon the Unlikely, they called him, born the fourth son of a fourth son. Aemon knew, and rightly, that if he remained at court those who disliked his brother’s rule would seek to use him, so he came to the Wall. And here he has remained, while his brother and his brother’s son and his son each reigned and died in turn, until Jaime Lannister put an end to the line of the Dragonkings.    King,  croaked the raven. The bird flapped across the solar to land on Mormont’s shoulder.  King,  it said again, strutting back and forth.   He likes that word,  Jon said, smiling.   An easy word to say. An easy word to like.    King,  the bird said again.   I think he means for you to have a crown, my lord.    The realm has three kings already, and that’s two too many for my liking.  Mormont stroked the raven under the beak with a finger, but all the while his eyes never left Jon Snow.  It made him feel odd.  My lord, why have you told me this, about Maester Aemon?    Must I have a reason?  Mormont shifted in his seat, frowning.  Your brother Robb has been crowned King in the North. You and Aemon have that in common. A king for a brother.    And this too,  said Jon.  A vow.   The Old Bear gave a loud snort, and the raven took flight, flapping in a circle about the room,  Give me a man for every vow I’ve seen broken and the Wall will never lack for defenders.    I’ve always known that Robb would be Lord of Winterfell.   Mormont gave a whistle, and the bird flew to him again and settled on his arm.  A lord’s one thing, a king’s another.  He offered the raven a handful of corn from his pocket.  They will garb your brother Robb in silks, satins, and velvets of a hundred different colors, while you live and die in black ringmail. He will wed some beautiful princess and father sons on her. You’ll have no wife, nor will you ever hold a child of your own blood in your arms. Robb will rule, you will serve. Men will call you a crow. Him they’ll call Your Grace. Singers will praise every little thing he does, while your greatest deeds all go unsung. Tell me that none of this troubles you, Jon… and I’ll name you a liar, and know I have the truth of it.   Jon drew himself up, taut as a bowstring.  And if it did trouble me, what might I do, bastard as I am?    What will you do?  Mormont asked.  Bastard as you are?    Be troubled,  said Jon,  and keep my vows.       CATELYN  Her son’s crown was fresh from the forge, and it seemed to Catelyn Stark that the weight of it pressed heavy on Robb’s head.  The ancient crown of the Kings of Winter had been lost three centuries ago, yielded up to Aegon the Conqueror when Torrhen Stark knelt in submission. What Aegon had done with it no man could say. Lord Hoster’s smith had done his work well, and Robb’s crown looked much as the other was said to have looked in the tales told of the Stark kings of old; an open circlet of hammered bronze incised with the runes of the First Men, surmounted by nine black iron spikes wrought in the shape of longswords. Of gold and silver and gemstones, it had none; bronze and iron were the metals of winter, dark and strong to fight against the cold.  As they waited in Riverrun’s Great Hall for the prisoner to be brought before them, she saw Robb push back the crown so it rested upon the thick auburn mop of his hair; moments later, he moved it forward again; later he gave it a quarter turn, as if that might make it sit more easily on his brow. It is no easy thing to wear a crown, Catelyn thought, watching, especially for a boy of fifteen years.  When the guards brought in the captive, Robb called for his sword. Olyvar Frey offered it up hilt first, and her son drew the blade and laid it bare across his knees, a threat plain for all to see.  Your Grace, here is the man you asked for,  announced Ser Robin Ryger, captain of the Tully household guard.   Kneel before the king, Lannister!  Theon Greyjoy shouted. Ser Robin forced the prisoner to his knees.  He did not look a lion, Catelyn reflected."
}