{
  "id": "4849e247853aac54a06b160ec110c1a5a7aa4d7b",
  "text": " . . it was almost like seeing You-Know-Who back again.\" \"I don't get it,\" said Ron, frowning.  \"I mean. . . it's still only a shape in the sky. . . \"Ron, You-Know-Who and his followers sent the Dark Mark into the air whenever they killed,\" said Mr. Weasley.  \"The terror it inspired. . . you have no idea, you're too young. Just picture coming home and finding the Dark Mark hovering over your house, and knowing what you're about to find inside. . . .\"  Mr. Weasley winced. \"Everyone's worst fear. . . the very worst.. There was silence for a moment. Then Bill, removing the sheet from his arm to check on his cut, said, \"Well, it didn't help us tonight, whoever conjured it.  It scared the Death Eaters away the moment they saw it.  They all Disapparated before we'd got near enough to unmask any of them.  We caught the Robertses before they hit the ground, though.  They're having their memories modified right now.\" \"Death Eaters?\" said Harry. \"What are Death Eaters?\" \"It's what You-Know-Who's supporters called themselves,\" said Bill.  \"I think we saw what's left of them tonight - the ones who managed to keep themselves out of Azkaban, anyway.\" \"We can't prove it was them, Bill,\" said Mr. Weasley.  \"Though it probably was,\" he added hopelessly. \"Yeah, I bet it was!\" said Ron suddenly . \"Dad, we met Draco Malfoy in the woods, and he as good as told us his dad was one of those nutters in masks!  And we all know the Malfoys were right in with You-Know-Who!\" \"But what were Voldemort's supporters -\" Harry began. Everybody flinched - like most of the wizarding world, the Weasleys always avoided saying Voldemort's name. \"Sorry,\" said Harry quickly. \"What were You-Know-Who's supporters up to, levitating Muggles? I mean, what was the point?\" \"The point?\" said Mr. Weasley with a hollow laugh.  \"Harry, that's their idea of fun. Half the Muggle killings back when You-Know-Who was in power were done for fun.  I suppose they had a few drinks tonight and couldn't resist reminding us all that lots of them are still at large.  A nice little reunion for them,\" he finished disgustedly. \"But if they were the Death Eaters, why did they Disapparate when they saw the Dark Mark?\" said Ron.  \"They'd have been pleased to see it, wouldn't they?\"  \"Use your brains, Ron,\" said Bill. \"If they really were Death Eaters, they worked very hard to keep out of Azkaban when You-Know-Who lost power, and told all sorts of lies about him forcing them to kill and torture people.  I bet they'd be even more frightened than the rest of us to see him come back.  They denied they'd ever been involved with him when he lost his powers, and went back to their daily lives. . . . I don't reckon he'd be over-pleased with them, do you?\" \"So. . . whoever conjured the Dark Mark. . .\" said Hermione slowly, \"were they doing it to show support for the Death Eaters, or to scare them away?\" \"Your guess is as good as ours, Hermione,\" said Mr. Weasley. \"But I'll tell you this. . . it was only the Death Eaters who ever knew how to conjure it. I'd be very surprised if the person who did it hadn't been a Death Eater once, even if they're not now. . Listen, it's very late, and if your mother hears what's happened she'll be worried sick. We'll get a few more hours sleep and then try and get an early Portkey out of here.\" Harry got back into his bunk with his head buzzing. He knew he ought to feel exhausted: It was nearly three in the morning, but he felt wide-awake - wide-awake, and worried. Three days ago - it felt like much longer, but it had only been three days - he had awoken with his scar burning.  And tonight, for the first time in thirteen years, Lord Voldemort's mark had appeared in the sky.  What did these things mean? He thought of the letter he had written to Sirius before leaving Privet Drive.  Would Sirius have gotten it yet?  When would he reply?  Harry lay looking up at the canvas, but no flying fantasies came to him now to ease him to sleep, and it was a long time after Charlie's snores filled the tent that Harry finally dozed off.  CHAPTER TEN - MAYHEM AT THE MINISTRY    Mr. Weasley woke them after only a few hours sleep.  He used magic to pack up the tents, and they left the campsite as quickly as possible, passing Mr. Roberts at the door of his cottage.  Mr. Roberts had a strange, dazed look about him, and he waved them off with a vague \"Merry Christmas.\"   \"He'll be all right,\" said Mr. Weasley quietly as they marched off onto the moor. \"Sometimes, when a person's memory's modified, it makes him a bit disorientated for a while...and that was a big thing they had to make him forget.\"   They heard urgent voices as they approached the spot where the Portkeys lay, and when they reached it, they found a great number of witches and wizards gathered around Basil, the keeper of the Portkeys, all clamoring to get away from the campsite as quickly as possible. Mr. Weasley had a hurried discussion with Basil; they joined the queue, and were able to take an old rubber tire back to Stoatshead Hill before the sun had really risen."
}