{
  "id": "486cf5352ea0f3f52c350bd0457db0c06a5ed67a",
  "text": " It would be faster than riding, I think.   He looked dubious.  Did you ever sail a boat?    You put up the sail,  she said,  and the wind pushes it.    What if the wind is blowing the wrong way?    Then there’s oars to row.    Against the current?  Gendry frowned.  Wouldn’t that be slow? And what if the boat tips over and we fall into the water? It’s not our boat anyway, it’s the inn’s.   We could take it. Arya chewed her lip and said nothing. They dismounted in front of stables. There were no other horses to be seen, but Arya noticed fresh manure in many of the stalls.  One of us should watch the horses,  she said, wary.  Tom overheard her.  There’s no need for that, Squab. Come eat, they’ll be safe enough.    I’ll stay,  Gendry said, ignoring the singer.  You can come get me after you’ve had some food.   Nodding, Arya set off after Hot Pie and Lem. Her sword was still in its sheath across her back, and she kept a hand close to the hilt of the dagger she had stolen from Roose Bolton, in case she didn’t like whatever they found within.  The painted sign above the door showed a picture of some old king on his knees. Inside was the common room, where a very tall ugly woman with a knobby chin stood with her hands on her hips, glaring.  Don’t just stand there, boy,  she snapped.  Or are you a girl? Either one, you’re blocking my door. Get in or get out. Lem, what did I tell you about my floor? You’re all mud.    We shot a duck.  Lem held it out like a peace banner.  The woman snatched it from his hand.  Anguy shot a duck, is what you’re meaning. Get your boots off, are you deaf or just stupid?  She turned away.  Husband!  she called loudly.  Get up here, the lads are back. Husband!   Up the cellar steps came a man in a stained apron, grumbling. He was a head shorter than the woman, with a lumpy face and loose yellowish skin that still showed the marks of some pox.  I’m here, woman, quit your bellowing. What is it now?    Hang this,  she said, handing him the duck.  Anguy shuffled his feet.  We were thinking we might eat it, Sharna. With lemons. If you had some.    Lemons. And where would we get lemons? Does this look like Dorne to you, you freckled fool? Why don’t you hop out back to the lemon trees and pick us a bushel, and some nice olives and pomegranates too.  She shook a finger at him.  Now, I suppose I could cook it with Lem’s cloak, if you like, but not till it’s hung for a few days. You’ll eat rabbit, or you won’t eat. Roast rabbit on a spit would be quickest, if you’ve got a hunger. Or might be you’d like it stewed, with ale and onions.   Arya could almost taste the rabbit.  We have no coin, but we brought some carrots and cabbages we could trade you.    Did you now? And where would they be?    Hot Pie, give her the cabbages,  Arya said, and he did, though he approached the old woman as gingerly as if she were Rorge or Biter or Vargo Hoat.  The woman gave the vegetables a close inspection, and the boy a closer one.  Where is this hot pie?    Here. Me. It’s my name. And she’s… ah… Squab.    Not under my roof. I give my diners and my dishes different names, so as to tell them apart. Husband!   Husband had stepped outside, but at her shout he hurried back.  The duck’s hung. What is it now, woman?    Wash these vegetables,  she commanded.  The rest of you, sit down while I start the rabbits. The boy will bring you drink.  She looked down her long nose at Arya and Hot Pie.  I am not in the habit of serving ale to children, but the cider’s run out, there’s no cows for milk, and the river water tastes of war, with all the dead men drifting downstream. If I served you a cup of soup full of dead flies, would you drink it?    Arry would,  said Hot Pie.  I mean, Squab.    So would Lem,  offered Anguy with a sly smile.   Never you mind about Lem,  Sharna said.  It’s ale for all.  She swept off toward the kitchen.  Anguy and Tom Sevenstrings took the table near the hearth while Lem was hanging his big yellow cloak on a peg. Hot Pie plopped down heavily on a bench at the table by the door, and Arya wedged herself in beside him.  Tom unslung his harp.  A lonely inn on a forest road,  he sang, slowly picking out a tune to go with the words.  The innkeep’s wife was plain as a toad.    Shut up with that now or we won’t be getting no rabbit,  Lem warned him.  You know how she is.   Arya leaned close to Hot Pie.  Can you sail a boat?  she asked. Before he could answer, a thickset boy of fifteen or sixteen appeared with tankards of ale. Hot Pie took his reverently in both hands, and when he sipped he smiled wider than Arya had ever seen him smile.  Ale,  he whispered,  and rabbit.    Well, here’s to His Grace,  Anguy the Archer called out cheerfully, lifting a toast.  Seven save the king!    All twelve o’them,  Lem Lemoncloak muttered. He drank, and wiped the foam from his mouth with the back of his hand.  Husband came bustling in through the front door, with an apron full of washed vegetables.  There’s strange horses in the stable,  he announced, as if they hadn’t known."
}