{
  "id": "48d754934bfaf8ce5d244656240793a6106ceb69",
  "text": " 'Even the Elves  do  likewise  at need, and  blindfolded we crossed the borders of fair Lothlurien. Gimli  the dwarf took   it ill, but the hobbits endured it.'       `It is to no place so fair that I shall lead you,' said Faramir. 'But I  am glad that you will take this willingly and not by force.'       He called softly  and immediately Mablung and Damrod stepped out of the  trees  and  came  back  to  him.  'Blindfold  these guests,'  said  Faramir.  `Securely, but not so as to discomfort  them. Do not  tie  their hands. They  will  give their word not to try and see.  I  could trust them to shut their  eyes of their  own accord, but  eyes will blink, if  the  feet stumble. Lead  them so that they do not falter.'       With green scarves the  two guards  now bound up the hobbits'  eyes and  drew their hoods down almost  to their mouths; then  quickly  they took each  one by  the hand and went on their way. All that Frodo and Sam knew of  this  last mile of the road they learned from guessing in the dark. After a little  they found that  they were  on a  path descending  steeply; soon  it grew so  narrow that they went in  single file, brushing a stony wall on either side;  their  guards steered them  from  behind with  hands  laid  firmly on  their  shoulders. Now and again they came  to  rough  places  and were  lifted from  their feet for a  while,  and then  set down again. Always  the noise of the  running water  was  on their right hand, and it grew  nearer and louder.  At  length  they  were  halted.  Quickly Mablung and  Damrod turned them  about,  several times, and they lost all sense of direction. They climbed  upwards a   little: it seemed cold and the noise  of the stream had become  faint.  Then  they were picked up  and carried down, down many steps, and round a  corner.   ####-Suddenly they heard  the water again, loud now,  rushing and  splashing. All  round them it seemed, and  they felt a fine rain  on their hands and cheeks.  At last they were set on their  feet once  more. For a moment they stood so,  half fearful, blindfold, not knowing where they were; and no one spoke.       Then came the voice of Faramir close behind. `Let  them see! ' he said.  The scarves  were  removed and  their hoods drawn back, and they blinked and  gasped.       They stood on a wet floor of polished  stone, the doorstep, as it were,  of a rough-hewn gate of rock opening dark behind them. But  in  front a thin  veil  of water was hung, so  near that Frodo cou ld  have put an outstretched  arm into it. It  faced westward. The level shafts  of the setting sun behind  beat  upon it, and the red  light was broken  into many flickering  beams of  ever -changing  colour. It  was as if  they  stood  at  the  window  of  some  elven-tower, curtained with threaded  jewels  of silver and  gold, and ruby,  sapphire and amethyst, all kindled with an unconsuming fire.       'At least by good chance we  came at the  right hour  to reward you for   your patience,' said Faramir.  `This is the  Window  of the Sunset,  Henneth  Annyn,  fairest  of all the falls of Ithilien, land  of  many fountains. Few  strangers have ever seen it. But there is no kingly hall behind to match it.  Enter now and see! '       Even as he spoke the sun sank, and the fire faded in the flowing water.   They  turned and passed under  the low forbidding  arch. At  once they found  themselves in a rock -chamber, wide and rough, with an  uneven stooping roof.   A  few torches were kindled  and cast a dim  light on the  glisten ing walls.   Many men were already there. Others were  still coming in by twos and threes  through a dark narrow door on one side. As their eyes grew accustomed to the  gloom the hobbits saw that the cave was larger than they had guessed and was  filled with gr eat store of arms and victuals.        'Well, here is  our refuge,'  said Faramir. `Not a place of  great ease  but here you may pass  the night in peace. It is dry at least,  and there is  food, though no fire. At one  time the water flowed  down  through this cave  and out  of the  arch, but its  course was changed further  up the gorge, by  workmen  of old, and the stream sent down in a fall  of  doubled height over   the rocks  far above.  All the ways  into this grot were then sealed against   the entry of water   or aught else, all save one. There are now but  two ways  out:  that passage yonder by which you entered  blindfold,  and  through the   Window-curtain into  a deep  bowl  filled  with knives of  stone. Now rest a    ####-while, until the evening meal is set.'       The hobbits  were taken to a corner and given a  low bed to lie on,  if  they wished. Meanwhile  men busied themselves about the cave, quietly and in  orderly  quickness. Light  tables  were taken from the walls and  set  up on  trestles and laden  with gear .  This was plain and unadorned  for  the  most  part,  but  all well and fairly,  made:  round platters, bowls and dishes of  glazed brown clay or turned box-wood, smooth and clean."
}