{
  "id": "49199e4b5b70de4b2edadeb46f909bf2d9481816",
  "text": " By law Sansa is next in line of succession, so Winterfell and the north would pass to her.  His mouth tightened.  To her, and her lord husband. Tyrion Lannister. I cannot allow that. I will not allow that. That dwarf must never have the north.    No,  Catelyn agreed.  You must name another heir, until such time as Jeyne gives you a son.  She considered a moment.  Your father’s father had no siblings, but his father had a sister who married a younger son of Lord Raymar Royce, of the junior branch. They had three daughters, all of whom wed Vale lordlings. A Waynwood and a Corbray, for certain. The youngest… it might have been a Templeton, but…    Mother.  There was a sharpness in Robb’s tone.  You forget. My father had four sons.   She had not forgotten; she had not wanted to look at it, yet there it was.  A Snow is not a Stark.    Jon’s more a Stark than some lordlings from the Vale who have never so much as set eyes on Winterfell.    Jon is a brother of the Night’s Watch, sworn to take no wife and hold no lands. Those who take the black serve for life.    So do the knights of the Kingsguard. That did not stop the Lannisters from stripping the white cloaks from Ser Barristan Selmy and Ser Boros Blount when they had no more use for them. If I send the Watch a hundred men in Jon’s place, I’ll wager they find some way to release him from his vows.   He is set on this. Catelyn knew how stubborn her son could be.  A bastard cannot inherit.    Not unless he’s legitimized by a royal decree,  said Robb.  There is more precedent for that than for releasing a Sworn Brother from his oath.    Precedent,  she said bitterly.  Yes, Aegon the Fourth legitimized all his bastards on his deathbed. And how much pain, grief, war, and murder grew from that? I know you trust Jon. But can you trust his sons? Or their sons? The Blackfyre pretenders troubled the Targaryens for five generations, until Barristan the Bold slew the last of them on the Stepstones. If you make Jon legitimate, there is no way to turn him bastard again. Should he wed and breed, any sons you may have by Jeyne will never be safe.    Jon would never harm a son of mine.    No more than Theon Greyjoy would harm Bran or Rickon?   Grey Wind leapt up atop King Tristifer’s crypt, his teeth bared. Robb’s own face was cold.  That is as cruel as it is unfair. Jon is no Theon.    So you pray. Have you considered your sisters? What of their rights? I agree that the north must not be permitted to pass to the Imp, but what of Arya? By law, she comes after Sansa… your own sister, trueborn…    …and dead. No one has seen or heard of Arya since they cut Father’s head off. Why do you lie to yourself? Arya’s gone, the same as Bran and Rickon, and they’ll kill Sansa too once the dwarf gets a child from her. Jon is the only brother that remains to me. Should I die without issue, I want him to succeed me as King in the North. I had hoped you would support my choice.    I cannot,  she said.  In all else, Robb. In everything. But not in this… this folly. Do not ask it.    I don’t have to. I’m the king.  Robb turned and walked off, Grey Wind bounding down from the tomb and loping after him.  What have I done? Catelyn thought wearily, as she stood alone by Tristifer’s stone sepulcher. First I anger Edmure, and now Robb, but all I have done is speak the truth. Are men so fragile they cannot bear to hear it? She might have wept then, had not the sky begun to do it for her. It was all she could do to walk back to her tent, and sit there in the silence.  In the days that followed, Robb was everywhere and anywhere; riding at the head of the van with the Greatjon, scouting with Grey Wind, racing back to Robin Flint and the rearguard. Men said proudly that the Young Wolf was the first to rise each dawn and the last to sleep at night, but Catelyn wondered whether he was sleeping at all. He grows as lean and hungry as his direwolf.   My lady,  Maege Mormont said to her one morning as they rode through a steady rain,  you seem so somber. Is aught amiss?   My lord husband is dead, as is my father. Two of my sons have been murdered, my daughter has been given to a faithless dwarf to bear his vile children, my other daughter is vanished and likely dead, and my last son and my only brother are both angry with me. What could possibly be amiss? That was more truth than Lady Maege would wish to hear, however.  This is an evil rain,  she said instead.  We have suffered much, and there is more peril and more grief ahead. We need to face it boldly, with horns blowing and banners flying bravely. But this rain beats us down. The banners hang limp and sodden, and the men huddle under their cloaks and scarcely speak to one another. Only an evil rain would chill our hearts when most we need them to burn hot.   Dacey Mormont looked up at the sky.  I would sooner have water raining down on me than arrows.   Catelyn smiled despite herself.  You are braver than I am, I fear. Are all your Bear Island women such warriors?    She-bears, aye,  said Lady Maege."
}