{
  "id": "4932145cfd1dac1da3e458048c7479527c0b501a",
  "text": " And it’s getting dark.  The Reeds decided that they would sleep in the kitchens, a stone octagon with a broken dome. It looked to offer better shelter than most of the other buildings, even though a crooked weirwood had burst up through the slate floor beside the huge central well, stretching slantwise toward the hole in the roof, its bone-white branches reaching for the sun. It was a queer kind of tree, skinnier than any other weirwood that Bran had ever seen and faceless as well, but it made him feel as if the old gods were with him here, at least.  That was the only thing he liked about the kitchens, though. The roof was mostly there, so they’d be dry if it rained again, but he didn’t think they would ever get warm here. You could feel the cold seeping up through the slate floor. Bran did not like the shadows either, or the huge brick ovens that surrounded them like open mouths, or the rusted meat hooks, or the scars and stains he saw in the butcher’s block along one wall. That was where the Rat Cook chopped the prince to pieces, he knew, and he baked the pie in one of these ovens.  The well was the thing he liked the least, though. It was a good twelve feet across, all stone, with steps built into its side, circling down and down into darkness. The walls were damp and covered with niter, but none of them could see the water at the bottom, not even Meera with her sharp hunter’s eyes.  Maybe it doesn’t have a bottom,  Bran said uncertainly.  Hodor peered over the knee-high lip of the well and said,  HODOR!  The word echoed down the well,  Hodorhodorhodorhodor,  fainter and fainter,  hodorhodorhodorhodor,  until it was less than a whisper. Hodor looked startled. Then he laughed, and bent to scoop a broken piece of slate off the floor.   Hodor, don’t!  said Bran, but too late. Hodor tossed the slate over the edge.  You shouldn’t have done that. You don’t know what’s down there. You might have hurt something, or… or woken something up.   Hodor looked at him innocently.  Hodor?   Far, far, far below, they heard the sound as the stone found water. It wasn’t a splash, not truly. It was more a gulp, as if whatever was below had opened a quivering gelid mouth to swallow Hodor’s stone. Faint echoes traveled up the well, and for a moment Bran thought he heard something moving, thrashing about in the water.  Maybe we shouldn’t stay here,  he said uneasily.   By the well?  asked Meera.  Or in the Nightfort?    Yes,  said Bran.  She laughed, and sent Hodor out to gather wood. Summer went too. It was almost dark by then, and the direwolf wanted to hunt.  Hodor returned alone with both arms full of deadwood and broken branches. Jojen Reed took his flint and knife and set about lighting a fire while Meera boned the fish she’d caught at the last stream they’d crossed. Bran wondered how many years had passed since there had last been a supper cooked in the kitchens of the Nightfort. He wondered who had cooked it too, though maybe it was better not to know.  When the flames were blazing nicely Meera put the fish on. At least it’s not a meat pie. The Rat Cook had cooked the son of the Andal king in a big pie with onions, carrots, mushrooms, lots of pepper and salt, a rasher of bacon, and a dark red Dornish wine. Then he served him to his father, who praised the taste and had a second slice. Afterward the gods transformed the cook into a monstrous white rat who could only eat his own young. He had roamed the Nightfort ever since, devouring his children, but still his hunger was not sated.  It was not for murder that the gods cursed him,  Old Nan said,  nor for serving the Andal king his son in a pie. A man has a right to vengeance. But he slew a guest beneath his roof, and that the gods cannot forgive.    We should sleep,  Jojen said solemnly, after they were full. The fire was burning low. He stirred it with a stick.  Perhaps I’ll have another green dream to show us the way.   Hodor was already curled up and snoring lightly. From time to time he thrashed beneath his cloak, and whimpered something that might have been  Hodor.  Bran wriggled closer to the fire. The warmth felt good, and the soft crackling of flames soothed him, but sleep would not come. Outside the wind was sending armies of dead leaves marching across the courtyards to scratch faintly at the doors and windows. The sounds made him think of Old Nan’s stories. He could almost hear the ghostly sentinels calling to each other atop the Wall and winding their ghostly warhorns. Pale moonlight slanted down through the hole in the dome, painting the branches of the weirwood as they strained up toward the roof. It looked as if the tree was trying to catch the moon and drag it down into the well. Old gods, Bran prayed, if you hear me, don’t send a dream tonight. Or if you do, make it a good dream. The gods made no answer.  Bran made himself close his eyes. Maybe he even slept some, or maybe he was just drowsing, floating the way you do when you are half awake and half asleep, trying not to think about Mad Axe or the Rat Cook or the thing that came in the night."
}