{
  "id": "498929a4353ce76fbecb87c1ba313decfd2f6cce",
  "text": " Who  are you and where do you come from, may I ask?\"  \"You  may  indeed!  I  come  from  under  the  hill,  and  under  hills  and  over  the  hills my paths led. And through the air, I am he that walks unseen.\"  \"So I can well believe,\" said Smaug, \"but that is hardly our usual name.\"  \"I am  the clue-finder, the web-cutter, the stinging fly. I as chosen for the lucky  number.\"  \"Lovely  titles!\"  sneered  the  dragon.  \"But  lucky  numbers  don't  always  come  off.\"  \"I  am  he  that  buries  his  friends  alive  and  drowns  them  and  draws  them  alive  again from the water. I came from the end of a bag, but no bag went over me.\"  \"These don't sound so creditable,\" scoffed Smaug.  \"I  am  the  friend  of  bears  and  the  guest  of  eagles.  I  am  Ringwinner  and  Luckwearer;  and  I  am  Barrel-rider,\" went  on Bilbo  beginning  to  be  pleased with  his riddling.  \"That's  better!\"  said  Smaug.  \"But  don't  let  your  imagination  run  away  with  you!\"     ####-This  of  course  is  the way  to  talk  to  dragons,  if  you  don't want  to  reveal  your  proper  name  (which  is  wise),  and  don't  want  to  infuriate  them  by  a  flat  refusal  (which is also very wise). No dragon can resist the fascination of riddling talk and  of wasting time trying to understand it. There was a lot here which Smaug did not  understand  at  all  (though  I  expect  you  do,  since  you  know  all  about  Bilbo's  adventures  to which  he was  referring), but he  thought he understood enough, and  he chuckled in his wicked inside.  \"I  thought so  last night,\" he smiled  to himself. \"Lake-men, some nasty scheme  of those miserable tub-trading Lake-men, or I'm a lizard. I haven't been down that  way for an age and an age; but I will soon alter that!\"  \"Very  well,  O  Barrel-rider!\"  he  said  aloud.  \"Maybe  Barrel  was  your  pony's  name;  and maybe  not,  though  it was  fat  enough. You may walk  unseen,  but  you  did  not  walk  all  the  way.  Let  me  tell  you  I  ate  six  ponies  last  night  and  I  shall  catch and eat all the others before long. In return for the excellent meal I will give  you  one  piece  of  advice  for  your  good:  don't  have more  to  do with  dwarves  than  you can help!\"  \"Dwarves!\" said Bilbo in pretended surprise.  \"Don't talk to me!\" said Smaug. \"I know the smell (and taste) of dwarf-no one  better.  Don't  tell  me  that  I  can  eat  a  dwarf-ridden  pony  and  not  know  it!  You'll  come  to  a  bad  end,  if  you  go with  such  friends. Thief Barrel-rider. I don't mind if  you go back and tell them so from me.\"  But he did not tell Bilbo that there was one smell he could not make out at all,  hobbit-smell; it was quite outside his experience and puzzled him mightily.   \"I  suppose  you  got  a  fair  price  for  that  cup  last  night?\"  he  went  on.  \"Come  now,  did  you? Nothing  at  all! Well,  that's  just  like  them. And  I  suppose  they  are  skulking  outside,  and  your  job  is  to  do  all  the  dangerous work  and  get what  you  can  when  I'm  not  looking-for  them?  And  you  will  get  a  fair  share?  Don't  you  believe it! If you get off alive, you will be lucky.\"    Bilbo  was  now  beginning  to  feel  really  uncomfortable.  Whenever  Smaug's  roving  eye,  seeking  for  him  in  the  shadows,  flashed  across  him,  he  trembled,  and  an unaccountable desire seized hold of him to rush out and reveal himself and tell  all  the  truth  to  Smaug.  In  fact  he  was  in  grievous  danger  of  coming  under  the  dragon-spell. But plucking up courage he spoke again.  \"You  don't  know  everything, O  Smaug  the Mighty,\"  said  he.  \"Not  gold  alone  brought us hither.\"   ####-\"Ha! Ha! You  admit  the  'us',\"  laughed Smaug. \"Why not say  'us fourteen' and  be  done  with  it.  Mr.  Lucky  Number?  I  am  pleased  to  hear  that  you  had  other  business  in  these  parts  besides  my  gold.  In  that  case  you  may,  perhaps,  not  altogether waste your time.  \"I don't know if it has occurred to you that, even if you could steal the gold bit  by bit-a matter of a hundred years or so – you could not get it very far? Not much  use  on  the  mountain-side? Not much use  in  the  forest? Bless me! Had you never  thought  of  the  catch?  A  fourteenth  share,  I  suppose,  Or  something  like  it,  those  were  the  terms,  eh?  But  what  about  delivery? What  about  cartage? What  about  armed guards and tolls?\" And Smaug laughed aloud. He had a wicked and a wily  heart,  and  he  knew  his  guesses  were  not  far  out,  though  he  suspected  that  the  Lake-men were at the back of the plans, and that most of the plunder was meant to  stop  there  in  the  town  by  the  shore  that  in  his  young  days  had  been  called  Esgaroth.  You will hardly believe  it, but poor Bilbo was  really very  taken aback. So far  all  his.  thoughts  and  energies  had  been  concentrated  on  getting  to  the  Mountain  and  finding  the  entrance."
}