{
  "id": "4a15fd6ddda1451a19784567fcdac1c87f742f79",
  "text": "   A wolf,  a man said, and someone else said,  Seven hells, that’s a direwolf,  and the first man said,  What’s it doing in camp?  and the Hound’s rasping voice replied,  The Starks use them for wet nurses,  and Sansa realized that the two stranger knights were looking down on her and Lady, swords in their hands, and then she was frightened again, and ashamed. Tears filled her eyes.  She heard the queen say,  Joffrey, go to her.   And her prince was there.   Leave her alone,  Joffrey said. He stood over her, beautiful in blue wool and black leather, his golden curls shining in the sun like a crown. He gave her his hand, drew her to her feet.  What is it, sweet lady? Why are you afraid? No one will hurt you. Put away your swords, all of you. The wolf is her little pet, that’s all.  He looked at Sandor Clegane.  And you, dog, away with you, you’re scaring my betrothed.   The Hound, ever faithful, bowed and slid away quietly through the press. Sansa struggled to steady herself. She felt like such a fool. She was a Stark of Winterfell, a noble lady, and someday she would be a queen.  It was not him, my sweet prince,  she tried to explain.  It was the other one.   The two stranger knights exchanged a look.  Payne?  chuckled the young man in the green armor.  The older man in white spoke to Sansa gently.  Ofttimes Ser Ilyn frightens me as well, sweet lady. He has a fearsome aspect.    As well he should.  The queen had descended from the wheelhouse. The spectators parted to make way for her.  If the wicked do not fear the Mng’s Justice, you have put the wrong man in the office.   Sansa finally found her words.  Then surely you have chosen the right one, Your Grace,  she said, and a gale of laughter erupted all around her.   Well spoken, child,  said the old man in white.  As befits the daughter of Eddard Stark. I am honored to know you, however irregular the manner of our meeting. I am Ser Barristan Selmy, of the Kingsguard.  He bowed.  Sansa knew the name, and now the courtesies that Septa Mordane had taught her over the years came back to her.  The Lord Commander of the Kingsguard,  she said,  and councillor to Robert our king and to Aerys Targaryen before him. The honor is mine, good knight. Even in the far north, the singers praise the deeds of Barristan the Bold.   The green knight laughed again.  Barristan the Old, you mean. Don’t flatter him too sweetly, child, he thinks overmuch of himself already.  He smiled at her.  Now, wolf girl, if you can put a name to me as well, then I must concede that you are truly our Hand’s daughter.   Joffrey stiffened beside her.  Have a care how you address my betrothed.    I can answer,  Sansa said quickly, to quell her prince’s anger. She smiled at the green knight.  Your helmet bears golden antlers, my lord. The stag is the sigil of the royal House. King Robert has two brothers. By your extreme youth, you can only be Renly Baratheon, Lord of Storm’s End and councillor to the king, and so I name you.   Ser Barristan chuckled.  By his extreme youth, he can only be a prancing jackanapes, and so I name him.   There was general laughter, led by Lord Renly himself. The tension of a few moments ago was gone, and Sansa was beginning to feel comfortable… until Ser Ilyn Payne shouldered two men aside, and stood before her, unsmiling. He did not say a word. Lady bared her teeth and began to growl, a low rumble full of menace, but this time Sansa silenced the wolf with a gentle hand to the head.  I am sorry if I offended you, Ser Ilyn,  she said.  She waited for an answer, but none came. As the headsman looked at her, his pale colorless eyes seemed to strip the clothes away from her, and then the skin, leaving her soul naked before him. Still silent, he turned and walked away.  Sansa did not understand. She looked at her prince.  Did I say something wrong, Your Grace? Why will he not speak to me?    Ser Ilyn has not been feeling talkative these past fourteen years,  Lord Renly commented with a sly smile.  Joffrey gave his uncle a look of pure loathing, then took Sansa’s hands in his own.  Aerys Targaryen had his tongue ripped out with hot pincers.    He speaks most eloquently with his sword, however,  the queen said,  and his devotion to our realm is unquestioned.  Then she smiled graciously and said,  Sansa, the good councillors and I must speak together until the king returns with your father. I fear we shall have to postpone your day with Myrcella. Please give your sweet sister my apologies. Joffrey, perhaps you would be so kind as to entertain our guest today.    It would be my pleasure, Mother,  Joffrey said very formally. He took her by the arm and led her away from the wheelhouse, and Sansa’s spirits took flight. A whole day with her prince! She gazed at Joffrey worshipfully. He was so gallant, she thought. The way he had rescued her from Ser Ilyn and the Hound, why, it was almost like the songs, like the time Serwyn of the Mirror Shield saved the Princess Daeryssa from the giants, or Prince Aemon the Dragonknight championing Queen Naerys’s honor against evil Ser Morgil’s slanders."
}