{
  "id": "4a79232d0d7e146d5c4678d48af516fce3ada5dc",
  "text": " Dogs barked and whined and horses screamed in terror. Howls shuddered through the night; the howls of the man-pack, wails of fear and wild shouts, laughter and screams. No beast was as noisy as man. He pricked up his ears and listened, and his brother growled at every sound. They prowled under the trees as a piney wind blew ashes and embers through the sky. In time the flames began to dwindle, and then they were gone. The sun rose grey and smoky that morning.  Only then did he leave the trees, stalking slow across the fields. His brother ran with him, drawn to the smell of blood and death. They padded silent through the dens the men had built of wood and grass and mud. Many and more were burned and many and more were collapsed; others stood as they had before. Yet nowhere did they see or scent a living man. Crows blanketed the bodies and leapt into the air screeching when his brother and he came near. The wild dogs slunk away before them.  Beneath the great grey cliffs a horse was dying noisily, struggling to rise on a broken leg and screaming when he fell. His brother circled round him, then tore out his throat while the horse kicked feebly and rolled his eyes. When he approached the carcass his brother snapped at him and laid back his ears, and he cuffed him with a forepaw and bit his leg. They fought amidst the grass and dirt and falling ashes beside the dead horse, until his brother rolled on his back in submission, tail tucked low. One more bite at his upturned throat; then he fed, and let his brother feed, and licked the blood off his black fur.  The dark place was pulling at him by then, the house of whispers where all men were blind. He could feel its cold fingers on him. The stony smell of it was a whisper up the nose. He struggled against the pull. He did not like the darkness. He was wolf. He was hunter and stalker and slayer, and he belonged with his brothers and sisters in the deep woods, running free beneath a starry sky. He sat on his haunches, raised his head, and howled. I will not go, he cried. I am wolf, I will not go. Yet even so the darkness thickened, until it covered his eyes and filled his nose and stopped his ears, so he could not see or smell or hear or run, and the grey cliffs were gone and the dead horse was gone and his brother was gone and all was black and still and black and cold and black and dead and black…   Bran,  a voice was whispering softly.  Bran, come back. Come back now, Bran. Bran…   He closed his third eye and opened the other two, the old two, the blind two. In the dark place all men were blind. But someone was holding him. He could feel arms around him, the warmth of a body snuggled close. He could hear Hodor singing  Hodor, hodor, hodor,  quietly to himself.   Bran?  It was Meera’s voice.  You were thrashing, making terrible noises. What did you see?    Winterfell.  His tongue felt strange and thick in his mouth. One day when I come back I won’t know how to talk anymore.  It was Winterfell. It was all on fire. There were horse smells, and steel, and blood. They killed everyone, Meera.   He felt her hand on his face, stroking back his hair.  You’re all sweaty,  she said.  Do you need a drink?    A drink,  he agreed. She held a skin to his lips, and Bran swallowed so fast the water ran out of the corner of his mouth. He was always weak and thirsty when he came back. And hungry too. He remembered the dying horse, the taste of blood in his mouth, the smell of burnt flesh in the morning air.  How long?    Three days,  said Jojen. The boy had come up softfoot, or perhaps he had been there all along; in this blind black world, Bran could not have said.  We were afraid for you.    I was with Summer,  Bran said.   Too long. You’ll starve yourself. Meera dribbled a little water down your throat, and we smeared honey on your mouth, but it is not enough.    I ate,  said Bran.  We ran down an elk and had to drive off a treecat that tried to steal him.  The cat had been tan-and-brown, only half the size of the direwolves, but fierce. He remembered the musky smell of him, and the way he had snarled down at them from the limb of the oak.   The wolf ate,  Jojen said.  Not you. Take care, Bran. Remember who you are.   He remembered who he was all too well; Bran the boy, Bran the broken. Better Bran the beastling. Was it any wonder he would sooner dream his Summer dreams, his wolf dreams? Here in the chill damp darkness of the tomb his third eye had finally opened. He could reach Summer whenever he wanted, and once he had even touched Ghost and talked to Jon. Though maybe he had only dreamed that. He could not understand why Jojen was always trying to pull him back now. Bran used the strength of his arms to squirm to a sitting position.  I have to tell Osha what I saw. Is she here? Where did she go?   The wildling woman herself gave answer.  Nowhere, m’lord. I’ve had my fill o’ blundering in the black.  He heard the scrape of a heel on stone, turned his head toward the sound, but saw nothing."
}