{
  "id": "4a9fb96032b9ee2c3862ccb52b5361a496902c8c",
  "text": " The bracken cracked and rustled, as he  twisted and turned.       'What's the matter?' asked Merry. 'Are you lying on an ant-hill?'       'No,'  said Pippin, 'but  I'm not  comfortable. I wonder how long it is  since I slept in a bed?'       Merry  yawned. 'Work  it out on your fingers!' he said.  'But you  must   know how long it is since we left Lurien.'       'Oh, that!' said Pippin. 'I mean a real bed in a bedroom.'       'Well,  Rivendell  then,'  said  Merry.  'But  I could  sleep  anywhere  tonight.'       'You had the luck, Merry,' said Pippin softly, after a long pause. 'You   were riding with Gandalf.'       'Well, what of it?'       'Did you get any news, any information out of him?'       'Yes, a good deal. More than usual. But you heard it all or most of it:  you were close by,  and we were talking no secrets. But you  can go with him  tomorrow, if you think you can get more out of him-and if he'll have you.'       'Can I? Good! But he's close, isn't he? Not changed at all.'       'Oh  yes, he is!'  said Merry,  waking  up  a little, and  beginning to  wonder what was bothering his companion. 'He has grown, or something. He  can  be  both  kinder  and  more alarming, merrier and more solemn than before, I  think. He has changed; but  we have not had a chance to see  how  much, yet.  But th ink of the last part of that  business  with Saruman! Remember Saruman  was  once Gandalf's superior: head  of  the  Council, whatever  that  may be   ####-exactly. He was Saruman the White. Gandalf is the  White  now.  Saruman  came  when he was told, and  his rod was taken;  and then he was just told  to go,  and he went!'       'Well, if Gandalf has changed at all, then he's closer than ever that's  all,' Pippin argued. 'That-glass  ball, now. He seemed mighty  pleased  with  it. He knows or  guesses something about i t. But does he tell  us  what? No,  not  a word. Yet I picked it up, and I saved  it  from rolling into  a pool.  Here, I'll take that, my lad -- that's all. I wonder what it  is? It felt so  very heavy.' Pippin's voice fell very low as if he was talking to h imself.        'Hullo!' said  Merry. 'So that's what is bothering you? Now, Pippin  my  lad, don't  forget Gildor's  saying  --  the one Sam  used to quote:  Do  not  meddle in the at Fairs of Wizards, for they are subtle and quick to anger.'       'But  our  whole  life for  months  has been  one long meddling  in the  affairs  of Wizards,' said Pippin.  'I  should like a bit  of information as  well as danger. I should like a look at that ball.'       'Go to  sleep!'  said Merry. 'You'll  get information enough, sooner or  later. My  dear Pippin, no Took ever beat a  Brandybuck for inquisitiveness;   but is this the time, I ask you?'       'All right! What's the harm in my  telling you  what  I should like:  a   look  at that stone? I know I can't have it, with old Ganda lf sitting on it,  like a hen on an egg. But it doesn't help much to get no more from you  than  a you-can't-have-it so-go-to-sleep!'       'Well, what else could  I say?' said Merry. 'I'm sorry, Pippin, but you   really must wait  till the  morning.  I'll  be as curious as you  like after   breakfast, and I'll  help in any  way I can at wizard-wheedling. But I can't   keep awake  any  longer. If I yawn any more, I shall split at the ears. Good   night!'       Pippin said no more. He lay still now, but sleep remained far away; and  it was not  encouraged by  the  sound of Merry breathing softly, asleep in a   few minutes  after saying good night. 'The thought of  the dark globe seemed  to grow stronger as all grew quiet.  Pippin felt  again its  weight  in  his  hands, and saw again the mysterious red depths into which he had  looked for  a moment. He tossed and turned and tried to think of something else.       At last he could stand it no longer. He got up and looked round. It was  chilly, and he wrapped  his cloak about him.   The  moon was shining cold and  white, down into  the  dell, and  the shadows of the bushes were black.  All   ####-about lay sleeping shapes. The  two guards were not in view: they were up on  the hill, perhaps, or hidden in the bracken. Driven by some  impulse that he  did not understand,  Pippin  walked  softly to  where Gandalf lay. He looked  down at him. The wizard seemed asleep, but with lids not fully closed: there  was a  glitter  of eyes under his long  lashes. Pippin stepped back hastily.  But  Gandalf  made no sign;  and drawn forward once more, half  against  his  will, the hobbit crept up again from behind the wizard's head. He was rolled  in  a blanket, with  his cloak  spread over  the  top; and close beside him,  between his right  side and  his  bent arm,  there was a hummock,  something  round wrapped in a dark cloth; his hand seemed only just to have slipped off   it to the ground.       Hardly breathing, Pippin  crept nearer, foot by  foot. At last he knelt  down. Then he put his hands out  stealthily, and slowly  lifted the lump up:  it did not  seem quite  so heavy as he  had  expected."
}