{
  "id": "4b357ef3ea1215ba9e99fd28fa25b495a0033206",
  "text": " Invisible Baggins (of whom he began to have a very high opinion  indeed) had altogether failed to think of something clever.   The  other  dwarves  quite  agreed when  they  got  the message. They  all  thought  their  own  shares  in  the  treasure  (which  they  quite  regarded  as  theirs,  in  spite  of  their plight  and  the  still unconquered dragon) would  suffer  seriously if the Wood- elves  claimed  part  of  it,  and  they  all  trusted  Bilbo.  Just  what  Gandalf  had  said  would  happen,  you  see.  Perhaps  that  war  part  of  his  reason  for  going  off  and  leaving them.  Bilbo,  however,  did  not  feel  nearly  so  hopeful  as  they  did.  He  did  not  like  being depended on by everyone, and he wished he had the wizard at hand. But that  was no use: probably all the dark distance of Mirkwood lay between them. He sat  and  thought  and  thought,  until  his  head  nearly  burst,  but  no  bright  idea  would  come. One  invisible  ring was  a  very  fine  thing,  but  it was  not much  good  among  fourteen. But of course, as you have guessed, he did  rescue his  friends  in  the end,  and  this  is  how  it  happened.  One  day,  nosing  and  wandering  about.  Bilbo  discovered  a  very  interesting  thing:  the  great  gates  were  not  the  only  entrance  to  the  caves.  A  stream  flowed  under  part  of  the  lowest  regions  of  the  palace,  and  joined the Forest River some way further to the east, beyond the steep slope out of  which  the  main  mouth  opened.  Where  this  underground watercourse  came  forth  from the hillside there was a water-gate. There the rocky roof came down close to  the surface of the stream, and from it a portcullis could be dropped right to the bed  of  the  river  to  prevent  anyone  coming  in  or  out  that way. But  the  portcullis was  often open,  for a good deal of  traffic went out and  in by  the water-gate. If anyone  had come in that way, he would have found himself in a dark rough tunnel leading  deep into the heart of the hill; but at one point where it  passed under the caves the  roof  had  been  cut  away  and  covered  with  great  oaken  trapdoors.  These  opened  upwards  into  the  king's  cellars.  There  stood  barrels,  and  barrels,  and  barrels;  for  the Wood-elves, and especially their king, were very fond of wine, though no vines  grew in those parts. The wine, and other goods, were brought from far away, from  their kinsfolk in the South, or from the vineyards of Men in distant lands.  Hiding  behind  one  of  the  largest  barrels  Bilbo  discovered  the  trapdoors  and  their  use,  and  lurking  there,  listening  to  the  talk of  the king's  servants, he  learned  how the wine and other goods came up the rivers, or over land, to the Long Lake.  It  seemed  a  town of Men  still  throve  there, built out on bridges  far  into  the water   ####-as  a  protection  against  enemies  of  all  sorts,  and  especially  against  the  dragon  of  the  Mountain.  From  Lake-town  the  barrels  were  brought  up  the  Forest  River.  Often they were just tied together like big rafts and poled or rowed up the stream;  sometimes they were loaded on to flat boats.  When  the  barrels  were  empty  the  elves  cast  them  through  the  trapdoors,  opened  the  water-gate,  and  out  the  barrels  floated  on  the  stream,  bobbing  along,  until they were carried by the current to a place far down the river where the bank  jutted  out,  near  to  the  very  eastern  edge  of Mirkwood. There  they were  collected  and  tied  together  and  floated  back  to  Lake-town,  which  stood  close  to  the  point  where the Forest River flowed into the Long Lake.    For  some  time Bilbo  sat and  thought about  this water-gate, and wondered if it  could  be  used  for  the  escape  of  his  friends,  and  at  last  he  had  the  desperate  beginnings of a plan.  The  evening meal had been  taken  to  the prisoners. The guards were  tramping  away  down  the  passages  taking  the  torch-light  with  them  and  leaving  everything  in  darkness.  Then  Bilbo  heard  the  king's  butler  bidding  the  chief  of  the  guards  good-night.  \"Now come with me,\" he said, \"and taste the new wine that has just come in. I  shall be hard at work tonight clearing the cellars of the empty wood, so let us have  a drink first to help the labour.\"  \"Very good,\" laughed the chief of the guards. \"I'll taste with you, and see if it is  fit for the king's table. There is a feast tonight and it would not do to send up poor  stuff!\"    When  he  heard  this  Bilbo  was  all  in  a  flutter,  for  he  saw  that  luck  was  with  him  and  he  had  a  chance  at  once  to  try  his  desperate  plan.  He  followed  the  two  elves, until  they entered a small cellar and sat down at a  table on which  two  large  flagons were set. Soon they began to drink and laugh merrily. Luck of an unusual  kind was with Bilbo  then.  It must be potent wine  to make a wood-elf drowsy; but  this wine, it would seem, was the heady vintage of the great gardens of Dorwinion,  not  meant  for  his  soldiers  or  his  servants,  but  for  the  king's  feasts  only,  and  for  smaller bowls, not for the butler's great flagons."
}