{
  "id": "4b7342762fc2206fc977258ad609bc735247d435",
  "text": "  Their  caps  were  of  iron  and  they  were  shod  with  iron,  and  their  faces  were  grim.  Trumpets  called  men  and  elves  to  arms.  Before  long  the  dwarves  could  be  seen  coming  up  the  valley  at  a  great  pace.  They  halted  between  the  river  and  the  eastern  spur;  but  a  few  held  on  their  way,  and  crossing  the  river  drew  near  the  camp;  and  there  they  laid  down  their weapons  and  held  up  their  hands  in  sign  of  peace. Bard went out to meet them, and with him went Bilbo.  \"We  are  sent  from  Dain  son  of  Nain,\"  they  said  when  questioned.  \"We  are  hastening  to our kinsmen  in  the Mountain, since we learn that the kingdom of old  is  renewed. But who  are  you  that  sit  in  the  plain  as  foes  before  defended walls?\"   ####-This, of. course, in the polite and rather old-fashioned language of such occasions,  meant simply: \"You have no business  here. We are going on, so make way or we  shall fight you!\" They meant to push on between the Mountain and the loop of the  river, for the narrow land there did not seem to be strongly guarded.  Bard,  of  course,  refused  to  allow  the  dwarves  to  go  straight  on  to  the  Mountain. He was  determined  to wait  until  the  gold  and  silver  had  been  brought  out in exchange for the Arkenstone: for he did not believe that this would be done,  if  once  the  fortress  was manned  with  so  large  and  warlike  a  company.  They  had  brought with  them a great store of supplies; for  the dwarves can carry very heavy  burdens,  and  nearly  all  of  Dain's  folks,  in  spite  of  their  rapid  march,  bore  huge  packs  on  their  backs  in  addition  to  their  weapons.  They  would  stand  a  siege  for  weeks,  and  by  that  time yet more dwarves might  come,  and yet more,  for Thorin  had many relatives. Also they would be able to reopen and guard some other gate,  so that the besiegers would have to encircle the whole mountain; and for that they  had not sufficient numbers.  These  were,  in  fact,  precisely  their  plans  (for  the  raven-messengers  had  been  busy between Thorin and Dain); but  for  the moment  the way was barred, so after  angry  words  the  dwarf-messengers  retired  muttering  in  their  beards.  Bard  then  sent messengers  at  once  to  the Gate; but  they  found no gold or payment. Arrows  came forth as soon as they were within shot, and they hastened back in dismay. In  the  camp  all  was  now  astir,  as  if  for  battle;  for  the  dwarves  of  Dain  were  advancing along the eastern bank.  \"Fools!\"  laughed  Bard,  \"to  come  thus  beneath  the  Mountain's  arm!  They  do  not understand war above ground, whatever they may know of battle in the mines.  There  are many  of  our  archers  and  spearmen  now  hidden  in  the  rocks  upon  their  right  flank. Dwarf-mail may  be  good,  but  they will  soon be hard put  to  it. Let us  set on them now from both sides, before they are fully rested!\"  But  the  Elvenking  said:  \"Long will  I  tarry,  ere  I  begin  this war  for  gold.  The  dwarves cannot press us, unless we will, or do anything  that we cannot mark. Let  us  hope  still  for  something  that  will  bring  reconciliation.  Our  advantage  in  numbers will be enough, if in the end it must come to unhappy blows.\"  But he reckoned without the dwarves. The knowledge that the Arkenstone was  in  the  hands  of  the  besiegers  burned  in  their  thoughts;  also  they  guessed  the  hesitation of Bard and his friends, and resolved to strike while they debated.  Suddenly  without  a  signal  they  sprang  silently  forward  to  attack.  Bows  twanged and arrows whistled; battle was about to be joined.   ####-Still  more  suddenly  a  darkness  came  on  with  dreadful  swiftness!  A  black  cloud  hurried  over  the  sky. Winter  thunder  on  a wild wind  rolled  roaring  up  and  rumbled  in  the  Mountain,  and  lightning  lit  its  peak.  And  beneath  the  thunder  another  blackness  could  be  seen  whirling  forward;  but  it  did  not  come  with  the  wind,  it  came  from  the  North,  like  a  vast  cloud  of  birds,  so  dense  that  no  light  could be seen between their wings.  \"Halt!\"  cried  Gandalf,  who  appeared  suddenly,  and  stood  alone,  with  arms  uplifted, between  the advancing dwarves and  the  ranks awaiting  them. \"Halt!\" he  called  in  a  voice  like  thunder,  and  his  staff  blazed  forth  with  a  flash  like  the  lightning.  \"Dread  has  come  upon  you  all!  Alas!  it  has  come  more  swiftly  than  I  guessed. The Goblins  are upon you! Bolg*  of the North is coming. O Dain! whose  father  you  slew  in  Moria.  Behold!  the  bats  are  above  his  army  like  a  sea  of  locusts. They ride upon wolves and Wargs are in their train!\"  Amazement  and  confusion  fell  upon  them  all.  Even  as  Gandalf  had  been  speaking  the  darkness  grew.  The  dwarves  halted  and  gazed  at  the  sky.  The  elves  cried out with many voices."
}