{
  "id": "4b8c7c05787d9646abb8067cd71229c1265e4cf7",
  "text": "  \"I've already had some,\" said Harry. \"Professor Lupin gave me some. He gave it to all of us.\"  \"Did he, now?\" said Madam Pomfrey approvingly. \"So we've finally got a Defense Against the Dark Arts teacher who knows his remedies?\"  \"Are you sure you feel all right, Potter?\" Professor McGonagall said sharply.  \"Yes, \"said Harry.  \"Very well. Kindly wait outside while I have a quick word with Miss Granger about her course schedule, then we can go down to the feast together.\"  Harry went back into the corridor with Madam Pomfrey, who left for the hospital wing, muttering to herself He had to wait only a few minutes; then Hermione emerged looking very happy about something, followed by Professor McGonagall, and the three of them made their way back down the marble staircase to the Great Hall.  It was a sea of pointed black hats; each of the long House tables was lined with students, their faces glimmering by the light of thousands of candles, which were floating over the tables in midair. Professor Flitwick, who was a tiny little wizard with a shock of white hair, was carrying an ancient hat and a three-legged stool out of the hall.  \"Oh,\" said Hermione softly, \"we've missed the Sorting!\"  New students at Hogwarts were sorted into Houses by trying on the sorting Hat, which shouted out the House they were best suited to (Gryffindor, Ravenclaw, Hufflepuff, or Slytherin). Professor McGonagall strode off toward her empty seat at the staff table, and Harry and Hermione set off in the other direction, as quietly as possible, toward the Gryffindor table. People looked around at them as they passed along the back of the hall, and a few of them pointed at Harry. Had the story of his collapsing in front of the dementor traveled that fast?  He and Hermione sat down on either side of Ron, who had saved them seats.  \"What was all that about?\" he muttered to Harry.  Harry started to explain in a whisper, but at that moment the headmaster stood up to speak, and he broke off.  Professor Dumbledore, though very old, always gave an impression of great energy. He had several feet of long silver hair and beard, half-moon spectacles, and an extremely crooked nose. He was often described as the greatest wizard of the age, but that wasn't why Harry respected him. You couldn't help trusting Albus Dumbledore, and as Harry watched him beaming around at the students, he felt really calm for the first time since the dementor had entered the train compartment.  \"Welcome!\" said Dumbledore, the candlelight shimmering on his beard. \"Welcome to another year at Hogwarts! I have a few things to say to you all, and as one of them is very serious, I think it best to get it out of the way before you become befuddled by our excellent feast....\"  Dumbledore cleared his throat and continued, \"As you will all be aware after their search of the Hogwarts Express, our school is presently playing host to some of the dementors of Azkaban, who are here on Ministry of Magic business.\"  He paused, and Harry remembered what Mr. Weasley had said about Dumbledore not being happy with the dementors guarding the school.  \"They are stationed at every entrance to the grounds,\" Dumbledore continued, \"and while they are with us, I must make it plain that nobody is to leave school without permission. Dementors are not to be fooled by tricks or disguises -- or even Invisibility Cloaks,\" he added blandly, and Harry and Ron glanced at each other. \"It is not in the nature of a dementor to understand pleading or excuses. I therefore warn each and every one of you to give them no reason to harm you. I look to the prefects, and our new Head Boy and Girl, to make sure that no student runs afoul of the dementors,\" he said.  Percy, who was sitting a few seats down from Harry, puffed out his chest again and stared around impressively. Dumbledore paused again; he looked very seriously around the hall, and nobody moved or made a sound.  \"On a happier note,\" he continued, I am pleased to welcome two new teachers to our ranks this year.  \"First, Professor Lupin, who has kindly consented to fill the post of Defense Against the Dark Arts teacher.\"  There was some scattered, rather unenthusiastic applause. Only those who had been in the compartment on the train with Professor Lupin clapped hard, Harry among them. Professor Lupin looked particularly shabby next to all the other teachers in their best robes.  \"Look at Snape!\" Ron hissed in Harry's ear.  Professor Snape, the Potions master, was staring along the staff table at Professor Lupin. It was common knowledge that Snape ,anted the Defense Against the Dark Arts job, but even Harry, who hated Snape, was startled at the expression twisting his thin, sallow face. it was beyond anger: it was loathing. Harry knew that expression only too well; it was the look Snape wore every time he set eyes on Harry.  \"As to our second new appointment,\" Dumbledore continued as the lukewarm applause for Professor Lupin died away. \"Well, I am sorry to tell you that Professor Kettleburn, our Care of Magical Creatures teacher, retired at the end of last year in order to enjoy more time with his remaining limbs."
}