{
  "id": "4b8da08462240d6d696c21b072269559a19aae6b",
  "text": "\"  \"Look in it properly, go on, stand where I am.\"  Harry stepped aside, but with Ron in front of the mirror, he couldn't see his family anymore, just Ron in his paisley pajamas.  Ron, though, was staring transfixed at his image.  \"Look at me!\" he said.  \"Can you see all your family standing around you?\"  \"No -- I'm alone -- but I'm different -- I look older -- and I'm head boy!\"  \"What?\"  \"I am -- I'm wearing the badge like Bill used to -- and I'm holding the house cup and the Quidditch cup -- I'm Quidditch captain, too.  Ron tore his eyes away from this splendid sight to look excitedly at Harry.  \"Do you think this mirror shows the future?\"  \"How can it? All my family are dead -- let me have another look --\"  \"You had it to yourself all last night, give me a bit more time.\"  \"You're only holding the Quidditch cup, what's interesting about that? I want to see my parents.\"  \"Don't push me --\"  A sudden noise outside in the corridor put an end to their discussion. They hadn't realized how loudly they had been talking.  \"Quick!\"  Ron threw the cloak back over them as the luminous eyes of Mrs. Norris came round the door. Ron and Harry stood quite still, both thinking the same thing -- did the cloak work on cats? After what seemed an age, she turned and left.  \"This isn't safe -- she might have gone for Filch, I bet she heard us. Come on.\"  And Ron pulled Harry out of the room.  The snow still hadn't melted the next morning.  \"Want to play chess, Harry?\" said Ron.  \"No.\"  \"Why don't we go down and visit Hagrid?\"  \"No... you go...\"  \"I know what you're thinking about, Harry, that mirror. Don't go back tonight.\"  \"Why not?\"  \"I dunno, I've just got a bad feeling about it -- and anyway, you've had too many close shaves already. Filch, Snape, and Mrs. Norris are wandering around. So what if they can't see you? What if they walk into you? What if you knock something over?\"  \"You sound like Hermione.\"  \"I'm serious, Harry, don't go.\"  But Harry only had one thought in his head, which was to get back in front of the mirror, and Ron wasn't going to stop him.  That third night he found his way more quickly than before. He was walking so fast he knew he was making more noise than was wise, but he didn't meet anyone.  And there were his mother and father smiling at him again, and one of his grandfathers nodding happily. Harry sank down to sit on the floor in front of the mirror. There was nothing to stop him from staying here all night with his family. Nothing at all.  Except --  \"So -- back again, Harry?\"  Harry felt as though his insides had turned to ice. He looked behind him. Sitting on one of the desks by the wall was none other than Albus Dumbledore. Harry must have walked straight past him, so desperate to get to the mirror he hadn't noticed him.  \" -- I didn't see you, sir.\"  \"Strange how nearsighted being invisible can make you,\" said Dumbledore, and Harry was relieved to see that he was smiling.  \"So,\" said Dumbledore, slipping off the desk to sit on the floor with Harry, \"you, like hundreds before you, have discovered the delights of the Mirror of Erised.\"  \"I didn't know it was called that, Sir.\"  \"But I expect you've realized by now what it does?\"  \"It -- well -- it shows me my family --\"  \"And it showed your friend Ron himself as head boy.\"  \"How did you know --?\"  \"I don't need a cloak to become invisible,\" said Dumbledore gently. \"Now, can you think what the Mirror of Erised shows us all?\"  Harry shook his head.  \"Let me explain. The happiest man on earth would be able to use the Mirror of Erised like a normal mirror, that is, he would look into it and see himself exactly as he is. Does that help?\"  Harry thought. Then he said slowly, \"It shows us what we want... whatever we want...\"  \"Yes and no,\" said Dumbledore quietly. \"It shows us nothing more or less than the deepest, most desperate desire of our hearts. You, who have never known your family, see them standing around you. Ronald Weasley, who has always been overshadowed by his brothers, sees himself standing alone, the best of all of them. However, this mirror will give us neither knowledge or truth. Men have wasted away before it, entranced by what they have seen, or been driven mad, not knowing if what it shows is real or even possible.  \"The Mirror will be moved to a new home tomorrow, Harry, and I ask you not to go looking for it again. If you ever do run across it, you will now be prepared. It does not do to dwell on dreams and forget to live, remember that. Now, why don't you put that admirable cloak back on and get off to bed?\"  Harry stood up.  \"Sir -- Professor Dumbledore? Can I ask you something?\"  \"Obviously, you've just done so,\" Dumbledore smiled. \"You may ask me one more thing, however.\"  \"What do you see when you look in the mirror?\"  \"I? I see myself holding a pair of thick, woolen socks.\"  Harry stared.  \"One can never have enough socks,\" said Dumbledore. \"Another Christmas has come and gone and I didn't get a single pair. People will insist on giving me books."
}