{
  "id": "4b94842e7a423d2b5b94952dc31c59a135ed6011",
  "text": " Old men, Catelyn realized.  Edmure wore a blue-and-red cloak over a tunic embroidered with silver fish. From the look of him, he had not shaved since she rode south; his beard was a fiery bush.  Cat, it is good to have you safely back. When we heard of Renly’s death, we feared for your life. And Lord Tywin is on the march as well.    So I am told. How fares our father?    One day he seems stronger, the next…  He shook his head.  He’s asked for you. I did not know what to tell him.    I will go to him soon,  she vowed.  Has there been word from Storm’s End since Renly died? Or from Bitterbridge?  No ravens came to men on the road, and Catelyn was anxious to know what had happened behind her.   Nothing from Bitterbridge. From Storm’s End, three birds from the castellan, Ser Cortnay Penrose, all carrying the same plea. Stannis has him surrounded by land and sea. He offers his allegiance to whatsoever king will break the siege. He fears for the boy, he says. What boy would that be, do you know?    Edric Storm,  Brienne told them.  Robert’s bastard son.   Edmure looked at her curiously.  Stannis has sworn that the garrison might go free, unharmed, provided they yield the castle within the fortnight and deliver the boy into his hands, but Ser Cortnay will not consent.   He risks all for a baseborn boy whose blood is not even his own, Catelyn thought.  Did you send him an answer?   Edmure shook his head.  Why, when we have neither help nor hope to offer? And Stannis is no enemy of ours.   Ser Robin Ryger spoke.  My lady, can you tell us the manner of Lord Renly’s death? The tales we’ve heard have been queer.    Cat,  her brother said,  some say you killed Renly. Others claim it was some southron woman.  His glance lingered on Brienne.   My king was murdered,  the girl said quietly,  and not by Lady Catelyn. I swear it on my sword, by the gods old and new.    This is Brienne of Tarth, the daughter of Lord Selwyn the Evenstar, who served in Renly’s Rainbow Guard,  Catelyn told them.  Brienne, I am honored to acquaint you with my brother Ser Edmure Tully, heir to Riverrun. His steward Utherydes Wayn. Ser Robin Ryger and Ser Desmond Grell.    Honored,  said Ser Desmond. The others echoed him. The girl flushed, embarrassed even at this commonplace courtesy. If Edmure thought her a curious sort of lady, at least he had the grace not to say so.   Brienne was with Renly when he was killed, as was I,  said Catelyn,  but we had no part in his death.  She did not care to speak of the shadow, here in the open with men all around, so she waved a hand at the bodies.  Who are these men you’ve hanged?   Edmure glanced up uncomfortably.  They came with Ser Cleos when he brought the queen’s answer to our peace offer.   Catelyn was shocked.  You’ve killed envoys?    False envoys,  Edmure declared.  They pledged me their peace and surrendered their weapons, so I allowed them freedom of the castle, and for three nights they ate my meat and drank my mead whilst I talked with Ser Cleos. On the fourth night, they tried to free the Kingslayer.  He pointed up.  That big brute killed two guards with naught but those ham hands of his, caught them by the throats and smashed their skulls together while that skinny lad beside him was opening Lannister’s cell with a bit of wire, gods curse him. The one on the end was some sort of damned mummer. He used my own voice to command that the River Gate be opened. The guardsmen swear to it, Enger and Delp and Long Lew, all three. If you ask me, the man sounded nothing like me, and yet the oafs were raising the portcullis all the same.   This was the Imp’s work, Catelyn suspected; it stank of the same sort of cunning he had displayed at the Eyrie. Once, she would have named Tyrion the least dangerous of the Lannisters. Now she was not so certain.  How is it you caught them?    Ah, as it happened, I was not in the castle. I’d crossed the Tumblestone to, ah…    You were whoring or wenching. Get on with the tale.   Edmure’s cheeks flamed as red as his beard.  It was the hour before dawn, and I was only then returning. When Long Lew saw my boat and recognized me, he finally thought to wonder who was standing below barking commands, and raised a cry.    Tell me the Kingslayer was retaken.    Yes, though not easily. Jaime got hold of a sword, slew Poul Pernford and Ser Desmond’s squire Myles, and wounded Delp so badly that Maester Vyman fears he’ll soon die as well. It was a bloody mess. At the sound of steel, some of the other red cloaks rushed to join him, barehand or no. I hanged those beside the four who freed him, and threw the rest in the dungeons. Jaime too. We’ll have no more escapes from that one. He’s down in the dark this time, chained hand and foot and bolted to the wall.    And Cleos Frey?    He swears he knew naught of the plot. Who can say? The man is half Lannister, half Frey, and all liar. I put him in Jaime’s old tower cell.    You say he brought terms?    If you can call them that. You’ll like them no more than I did, I promise."
}