{
  "id": "4bbb01fa3d900f59ac6fcc9bf639fcb41c805945",
  "text": " \"Put it this way. Potter,\" Moody muttered finally, \"they say old Mad-Eye's obsessed with catching Dark wizards . . . but I'm nothing - nothing - compared to Barty Crouch.\" He continued to stare at the map. Harry was burning to know more. \"Professor Moody?\" he said again.  \"D'you think... could this have anything to do with . . . maybe Mr. Crouch thinks there's something going on. ...\" \"Like what?\" said Moody sharply. Harry wondered how much he dare say.  He didn't want Moody to guess that he had a source of information outside Hogwarts; that might lead to tricky questions about Sirius. \"I don't know,\" Harry muttered, \"odd stuffs been happening lately, hasn't it?  It's been in the Daily Prophet... the Dark Mark at the World Cup, and the Death Eaters and everything....\" Both of Moody's mismatched eyes widened. \"You're a sharp boy. Potter,\" he said.  His magical eye roved back to the Marauder's Map.  \"Crouch could be thinking along those lines,\" he said slowly.  \"Very possible. . . there have been some funny rumors flying around lately - helped along by Rita Skeeter, of course.  It's making a lot of people nervous, I reckon.\"  A grim smile twisted his lopsided mouth.  \"Oh if there's one thing I hate,\" he muttered, more to himself than to Harry, and his magical eye was fixed on the left-hand corner of the map, \"its a Death Eater who walked free. ...\" Harry stared at him. Could Moody possibly mean what Harry thought he meant? \"And now I want to ask you a question. Potter,\" said Moody in a more businesslike tone. Harrys heart sank; he had thought this was coming.  Moody was going to ask where he had got this map, which was a very dubious magical object - and the story of how it had fallen into his hands incriminated not only him, but his own father, Fred and George Weasley, and Professor Lupin, their last Defense Against the Dark Arts teacher.  Moody waved the map in front of Harry, who braced himself- \"Can I borrow this?\" \"Oh!\" said Harry. He was very fond of his map, but on the other hand, he was extremely relieved that Moody wasn't asking where he'd got it, and there was no doubt that he owed Moody a favor. \"Yeah, okay.\" \"Good boy,\" growled Moody. \"I can make good use of this . .. this might be exactly what I've been looking for. . . . Right, bed, Potter, come on, now. ...\" They climbed to the top of the stairs together, Moody still examining the map as though it was a treasure the like of which he had never seen before.  They walked in silence to the door of Moody's office, where he stopped and looked up at Harry. \"You ever thought of a career as an Auror, Potter?\" \"No,\" said Harry, taken aback. \"You want to consider it,\" said Moody, nodding and looking at Harry thoughtfully. \"Yes, indeed ... and incidentally ... I'm guessing you werent Just taking that egg for a walk tonight?\"  \"Er - no,\" said Harry, grinning. \"I've been working out the clue.\" Moody winked at him, his magical eye going haywire again. \"Nothing like a nighttime stroll to give you ideas, Potter. . .. See you in the morning....\" He went back into his office, staring down at the Marauders Map again, and closed the door behind him. Harry walked slowly back to Gryffindor Tower, lost in thought about Snape, and Crouch, and what it all meant.... Why was Crouch pretending to be ill, if he could manage to get to Hogwarts when he wanted to?  What did he think Snape was concealing in his office? And Moody thought he. Harry, ought to be an Auror!  Interesting idea.. . but somehow. Harry thought, as he got quietly into his four-poster ten minutes later, the egg and the cloak now safely back in his trunk, he thought he'd like to check how scarred the rest of them were before he chose it as a career.  CHAPTER TWENTY-SIX - THE SECOND TASK  You said you'd already worked out that egg clue!\" said Hermione indignantly. \"Keep your voice down!\"  said Harry crossly.  \"I just need to - sort of fine-tune it, all right?\" He, Ron, and Hermione were sitting at the very back of the Charms class with a table to themselves.  They were supposed to be practicing the opposite of the Summoning Charm today - the Banishing Charm.  Owing to the potential for nasty accidents when objects kept flying across the room.  Professor Flitwick had given each student a stack of cushions on which to practice, the theory being that these wouldn't hurt anyone if they went off target.  It was a good theory, but it wasn't working very well.  Neville's aim was so poor that he kept accidentally sending much heavier things flying across the room - Professor Flitwick, for instance. \"Just forget the egg for a minute, all right?\"  Harry hissed as Professor Flitwick went whizzing resignedly past them, landing on top of a large cabinet.  \"I'm trying to tell you about Snape and Moody. ...\" This class was an ideal cover for a private conversation, as everyone was having far too much fun to pay them any attention.  Harry had been recounting his adventures of the previous night in whispered installments for the last half hour."
}