{
  "id": "4bc11b43033edfffd39f34f60bfad8ebf4c0ad31",
  "text": " He sat up,  and felt the soft pillows yield to  his hands, and he lay  down again relieved. He seemed to hear the echo of words in his  ears: 'Fear   nothing! Have peace until the morning! Heed no nightly noises!' Then he went  to sleep again.       It  was the  sound of  water  that Merry heard falling  into  his quiet  sleep:   water  streaming  down   gently,  and  then   spreading,  spreading  irresistibly all round  the  house  into a  dark shoreless pool. It  gurgled  under the walls, and was  rising slowly but surely. 'I shall be drowned!' he  thought. It will find its  way in,  and then I shall drown.' He felt that he  was  lying  in a soft slimy bog,  and  springing up  he set  his fool on the  corner of  a  cold hard  flagstone. Then he  remembered where he was and lay  down again. He seemed to hear or remember hearing: 'Nothing passes doors  or  windows save moonlight  and  starlight  and  the wind off  the  hill-top.' A  little  breath of sweet air moved  the  curtain. He breathed deep  and  fell  asleep again.       As far  as  he could  remember, Sam slept  through the  night  in  deep  content, if logs are contented.       They woke  up, all four  at  once, in the morning light. Tom was moving  about the room whistling like a starling. When he heard them stir he clapped  his hands, and cried:  'Hey! Come merry dol! derry dol! My hearties!' He drew  back the  yellow curtains, and  the hobbits  saw that these  had covered the  windows, at either end of the room, one looking east  and the other  looking   west.       They leapt up  refreshed. Frodo  ran  to the eastern window, and  found  himself looking into a kitchen-garden grey with dew. He had half expected to  see turf right up to the  walls, turf all pocked  with hoof-prints. Actually  his view was screened  by a  tall line of beans on poles; but above and  far  beyond them the grey top of the hill loomed up against the sunrise. It was a   pale  morning: in the East,  behind long  clouds like lines  of  soiled wool  stained red at the  edges, lay glimmering deeps of  yellow. The sky spoke of  rain to come; but the light was broadening quickly,  and the red  flowers on  the beans began to glow against the wet green leaves.        Pippin looked out of  the western window, down into a pool of mist. The   Forest  was hidden  under a fog. It was  like looking down  on to  a sloping  cloud-roof from above. There was a fold or channel where the mist was broken  into many plumes and billows; the valley of  the Withywindle. The stream ran  down  the hill on the left and vanished into the white shadows. Near at hand   ####-was a flower -garden and a clipped  hedge silver -netted, and beyond that grey  shaven grass pale with dew-drops. There was no willow-tree to be seen.       'Good  morning,  merry  friends!' cried Tom, opening the eastern window  wide. A cool air flowed in; it had a  rainy smell. 'Sun  won't show her face  much today. I'm thinking. I have been walking wide, leaping on the hilltops,   since the grey dawn began, nosing wind and weather, wet grass underfoot, wet  sky above me.  I wakened Goldberry singing under  window;  but  nought  wakes  hobbit-folk in  the early morning. In the night little  folk wake up in  the  darkness, and sleep after light has come! Ring  a  ding dillo! Wake now,  my   merry friends! Forget the nightly noises! Ring  a ding dillo del! derry del,  my  hearties!  If you  come  soon you'll find breakfast on the table. If you   come late you'll get grass and rain-water!'       Needless  to  say - not that Tom's threat  sounded  very  serious  - the  hobbits came soon, and left the table late and only when it was beginning lo   look rather empty. Neither Tom nor Goldberry  were there. Tom could be heard  about  the house, clattering in the kitchen, and up and down the stairs, and  singing  here  and  there  outside.  The  room  looked   westward  over  the  mist -clouded valley, and the  window was open. Water dripped  down  from the  thatched  eaves above. Before  they had  finished  breakfast the  clouds had  joined into  an  unbroken roof,  and  a  straight grey rain came softly  and  steadily down. Behind its deep curtain the Forest was completely veiled.       As they looked out of  the window there came falling gently as if it was  flowing down the rain out of the sky, the clear  voice  of Goldberry singing  up above them. They could hear  few  words, but it seemed plain to them that  the  song was a rain-song, as sweet as  showers on dry hills,  that told the  tale  of a river from the  spring in the highlands to the Sea far below. The  hobbits listened with delight; and Frodo was glad in his  heart, and blessed  the kindly weather,  because it delayed them from departing. The  thought of  going had been heavy upon him from  the moment  he awoke; but he guessed  now  that they would not go further that day.       The upper wind settled in the West and deeper and wetter clouds  rolled  up  to spill their laden rain on the  bare heads of the Downs."
}