{
  "id": "4c3bd5f8ceaadcae949ab7ad3f2b807800479805",
  "text": "  Harry made a mental note never to accept so much as a crisp from Fred and George in future.  He still hadn't forgotten Dudley and the Ton-Tongue Toffee. Snow was falling thickly upon the castle and its grounds now.  The pale blue Beauxbatons carriage looked like a large, chilly, frosted pumpkin next to the iced gingerbread house that was Hagrid's cabin, while the Durmstrang ship's portholes were glazed with ice, the rigging white with frost.  The house-elves down in the kitchen were outdoing themselves with a series of rich, warming stews and savory puddings, and only Fleur Delacour seemed to be able to find anything to complain about. \"It is too 'eavy, all zis 'Ogwarts food,\" they heard her saying grumpily as they left the Great Hall behind her one evening (Ron skulking behind Harry, keen not to be spotted by Fleur).  \"I will not fit into my dress robes!\" \"Oooh there's a tragedy,\" Hermione snapped as Fleur went out into the entrance hall. \"She really thinks a lot of herself, that one, doesn't she?\" \"Hermione - who are you going to the ball with?\" said Ron. He kept springing this question on her, hoping to startle her into a response by asking it when she least expected it.  However, Hermione merely frowned and said, \"I'm not telling you, you'll just make fun of me.\" \"You're joking, Weasley!\" said Malfoy, behind them. \"You're not telling me someone's asked that to the ball?  Not the long-molared Mudblood?\"                                                ; Harry and Ron both whipped around, but Hermione said loudly, waving to somebody over Malfoys shoulder, \"Hello, Professor Moody!\" Malfoy went pale and jumped backward, looking wildly around for Moody, but he was still up at the staff table, finishing his stew. \"Twitchy little ferret, aren't you, Malfoy?\" said Hermione scathingly, and she, Harry, and Ron went up the marble staircase laughing heartily. \"Hermione,\" said Ron, looking sideways at her, suddenly frowning, \"your teeth ...\" \"What about them?\" she said. \"Well, they're different. . . I've just noticed. . . .\" \"Of course they are - did you expect me to keep those fangs Malfoy gave me?\" \"No, I mean, they're different to how they were before he put that hex on you. . . . They're all... straight and - and normal-sized.\" Hermione suddenly smiled very mischievously, and Harry noticed it too: It was a very different smile from the one he remembered. \"Well. . . when I went up to Madam Pomfrey to get them shrunk, she held up a mirror and told me to stop her when they were back to how they normally were,\" she said. \"And I just. . . let her carry on a bit.\"  She smiled even more widely.  \"Mum and Dad won't be too pleased. I've been trying to persuade them to let me shrink them for ages, but they wanted me to carry on with my braces.  You know, they're dentists, they just don't think teeth and magic should - look!  Pigwidgeons back!\" Ron's tiny owl was twittering madly on the top of the icicle-laden banisters, a scroll of parchment tied to his leg.  People passing him were pointing and laughing, and a group of third-year girls paused and said, \"Oh look at the weeny owl!  Isn't he cute?\" Stupid little feathery git!\"  Ron hissed, hurrying up the stairs and snatching up Pigwidgeon.  \"You bring letters to the addressee!  You don't hang around showing off!\" Pigwidgeon hooted happily, his head protruding over Ron's fist. The third-year girls all looked very shocked. \"Clear off!\"  Ron snapped at them, waving the fist holding Pigwidgeon, who hooted more happily than ever as he soared through the air.  \"Here - take it, Harry,\" Ron added in an undertone as the third-year girls scuttled away looking scandalized.  He pulled Sirius's reply off Pigwidgeons leg.  Harry pocketed it, and they hurried back to Gryffindor Tower to read it. Everyone in the common room was much too busy in letting off more holiday steam to observe what anyone else was up to.  Ron, Harry, and Hermione sat apart from everyone else by a dark window that was gradually filling up with snow, and Harry read out:  Dear Harry, Congratulations on getting past the Horntail.  Whoever put your name in that goblet shouldn't be feeling too happy right now!  I was going to suggest a Conjunctivitus Curse, as a dragon's eyes are its weakest point - \"That's what Krum did!\" Hermione whispered - but your way was better, I'm impressed. Don't get complacent, though. Harry.  You've only done one task; whoever put you in for the tournament's got plenty more opportunity if they're trying to hurt you.  Keep your eyes open -particularly when the person we discussed is around and concentrate on keeping yourself out of trouble. Keep in touch, I still want to hear about anything unusual.  Sirius  \"He sounds exactly like Moody,\" said Harry quietly, tucking the letter away again inside his robes. \"'Constant vigilance!'  You'd think I walk around with my eyes shut, banging off the walls. ...\" \"But he's right, Harry,\" said Hermione, \"you have still got two tasks to do. You really ought to have a look at that egg, you know, and start working out what it means."
}