{
  "id": "4c45394e56377e8eee7285909dc0de1cd0a33b22",
  "text": "  The lord regarded her. Only his eyes moved; they were very pale, the color of ice.  How old are you, child?   She had to think for a moment to remember.  Ten.    Ten, my lord,  he reminded her.  Are you fond of animals?    Some kinds. My lord.   A thin smile twitched across his lips.  But not lions, it would seem. Nor manticores.   She did not know what to say to that, so she said nothing.   They tell me you are called Weasel. That will not serve. What name did your mother give you?   She bit her lip, groping for another name. Lommy had called her Lumpyhead, Sansa used Horseface, and her father’s men once dubbed her Arya Underfoot, but she did not think any of those were the sort of name he wanted.   Nymeria,  she said.  Only she called me Nan for short.    You will call me my lord when you speak to me, Nan,  the lord said mildly.  You are too young to be a Brave Companion, I think, and of the wrong sex. Are you afraid of leeches, child?    They’re only leeches. My lord.    My squire could take a lesson from you, it would seem. Frequent leechings are the secret of a long life. A man must purge himself of bad blood. You will do, I think. For so long as I remain at Harrenhal, Nan, you shall be my cupbearer, and serve me at table and in chambers.   This time she knew better than to say that she’d sooner work in the stables.  Yes, your lord. I mean, my lord.   The lord waved a hand.  Make her presentable,  he said to no one in particular,  and make certain she knows how to pour wine without spilling it.  Turning away, he lifted a hand and said,  Lord Hoat, see to those banners above the gatehouse.   Four Brave Companions climbed to the ramparts and hauled down the lion of Lannister and Ser Amory’s own black manticore. In their place they raised the flayed man of the Dreadfort and the direwolf of Stark. And that evening, a page named Nan poured wine for Roose Bolton and Vargo Hoat as they stood on the gallery, watching the Brave Companions parade Ser Amory Lorch naked through the middle ward. Ser Amory pleaded and sobbed and clung to the legs of his captors, until Rorge pulled him loose, and Shagwell kicked him down into the bear pit.  The bear is all in black, Arya thought. Like Yoren. She filled Roose Bolton’s cup, and did not spill a drop.      DAENERYS  In this city of splendors, Dany had expected the House of the Undying Ones to be the most splendid of all, but she emerged from her palanquin to behold a grey and ancient ruin.  Long and low, without towers or windows, it coiled like a stone serpent through a grove of black-barked trees whose inky blue leaves made the stuff of the sorcerous drink the Qartheen called shade of the evening. No other buildings stood near. Black tiles covered the palace roof, many fallen or broken; the mortar between the stones was dry and crumbling. She understood now why Xaro Xhoan Daxos called it the Palace of Dust. Even Drogon seemed disquieted by the sight of it. The black dragon hissed, smoke seeping out between his sharp teeth.   Blood of my blood,  Jhogo said in Dothraki,  this is an evil place, a haunt of ghosts and maegi. See how it drinks the morning sun? Let us go before it drinks us as well.   Ser Jorah Mormont came up beside them.  What power can they have if they live in that?    Heed the wisdom of those who love you best,  said Xaro Xhoan Daxos, lounging inside the palanquin.  Warlocks are bitter creatures who eat dust and drink of shadows. They will give you naught. They have naught to give.   Aggo put a hand on his arakh.  Khaleesi, it is said that many go into the Palace of Dust, but few come out.    It is said,  Jhogo agreed.   We are blood of your blood,  said Aggo,  sworn to live and die as you do. Let us walk with you in this dark place, to keep you safe from harm.    Some places even a khal must walk alone,  Dany said.   Take me, then,  Ser Jorah urged.  The risk—    Queen Daenerys must enter alone, or not at all.  The warlock Pyat Pree stepped out from under the trees. Has he been there all along? Dany wondered.  Should she turn away now, the doors of wisdom shall be closed to her forevermore.    My pleasure barge awaits, even now,  Xaro Xhoan Daxos called out.  Turn away from this folly, most stubborn of queens. I have flutists who will soothe your troubled soul with sweet music, and a small girl whose tongue will make you sigh and melt.   Ser Jorah Mormont gave the merchant prince a sour look.  Your Grace, remember Mirri Maz Duur.    I do,  Dany said, suddenly decided.  I remember that she had knowledge. And she was only a maegi.   Pyat Pree smiled thinly.  The child speaks as sagely as a crone. Take my arm, and let me lead you.    I am no child.  Dany took his arm nonetheless.  It was darker than she would have thought under the black trees, and the way was longer. Though the path seemed to run straight from the street to the door of the palace, Pyat Pree soon turned aside. When she questioned him, the warlock said only,  The front way leads in, but never out again."
}