{
  "id": "4c731a87e2db0a74982da5d70e75ca0355323da4",
  "text": " Or have you forgotten Rodrik and Maron, who were your own blood?    I forget nothing.  Ned Stark had killed neither of his brothers, in truth. Rodrik had been slain by Lord Jason Mallister at Seagard, Maron crushed in the collapse of the old south tower… but Stark would have done for them just as quick had the tide of battle chanced to sweep them together.  I remember my brothers very well,  Theon insisted. Chiefly he remembered Rodrik’s drunken cuffs and Maron’s cruel japes and endless lies.  I remember when my father was a king too.  He took out Robb’s letter and thrust it forward.  Here. Read it… Your Grace.   Lord Balon broke the seal and unfolded the parchment. His black eyes flicked back and forth.  So the boy would give me a crown again,  he said,  and all I need do is destroy his enemies.  His thin lips twisted in a smile.   By now Robb is at the Golden Tooth,  Theon said.  Once it falls, he’ll be through the hills in a day. Lord Tywin’s host is at Harrenhal, cut off from the west. The Kingslayer is a captive at Riverrun. Only Ser Stafford Lannister and the raw green levies he’s been gathering remain to oppose Robb in the west. Ser Stafford will put himself between Robb’s army and Lannisport, which means the city will be undefended when we descend on it by sea. If the gods are with us, even Casterly Rock itself may fall before the Lannisters so much as realize that we are upon them.   Lord Balon grunted.  Casterly Rock has never fallen.    Until now.  Theon smiled. And how sweet that will be.  His father did not return the smile.  So this is why Robb Stark sends you back to me, after so long? So you might win my consent to this plan of his?    It is my plan, not Robb’s,  Theon said proudly. Mine, as the victory will be mine, and in time the crown.  I will lead the attack myself, if it please you. As my reward I would ask that you grant me Casterly Rock for my own seat, once we have taken it from the Lannisters.  With the Rock, he could hold Lannisport and the golden lands of the west. It would mean wealth and power such as House Greyjoy had never known.   You reward yourself handsomely for a notion and a few lines of scribbling.  His father read the letter again.  The pup says nothing about a reward. Only that you speak for him, and I am to listen, and give him my sails and swords, and in return he will give me a crown.  His flinty eyes lifted to meet his son’s.  He will give me a crown,  he repeated, his voice growing sharp.   A poor choice of words, what is meant is—    What is meant is what is said. The boy will give me a crown. And what is given can be taken away.  Lord Balon tossed the letter onto the brazier, atop the necklace. The parchment curled, blackened, and took flame.  Theon was aghast.  Have you gone mad?   His father laid a stinging backhand across his cheek.  Mind your tongue. You are not in Winterfell now, and I am not Robb the Boy, that you should speak to me so. I am the Greyjoy, Lord Reaper of Pyke, King of Salt and Rock, Son of the Sea Wind, and no man gives me a crown. I pay the iron price. I will take my crown, as Urron Redhand did five thousand years ago.   Theon edged backward, away from the sudden fury in his father’s tone.  Take it, then,  he spat, his cheek still tingling.  Call yourself King of the Iron islands, no one will care… until the wars are over, and the victor looks about and spies the old fool perched off his shore with an iron crown on his head.   Lord Balon laughed.  Well, at the least you are no craven. No more than I’m a fool. Do you think I gather my ships to watch them rock at anchor? I mean to carve out a kingdom with fire and sword… but not from the west, and not at the bidding of King Robb the Boy. Casterly Rock is too strong, and Lord Tywin too cunning by half. Aye, we might take Lannisport, but we should never keep it. No. I hunger for a different plum… not so juicy sweet, to be sure, yet it hangs there ripe and undefended.   Where? Theon might have asked, but by then he knew.      DAENERYS  The Dothraki named the comet shierak qiya, the Bleeding Star. The old men muttered that it omened ill, but Daenerys Targaryen had seen it first on the night she had burned Khal Drogo, the night her dragons had awakened. It is the herald of my coming, she told herself as she gazed up into the night sky with wonder in her heart. The gods have sent it to show me the way.  Yet when she put the thought into words, her handmaid Doreah quailed.  That way lies the red lands, Khaleesi. A grim place and terrible, the riders say.    The way the comet points is the way we must go,  Dany insisted… though in truth, it was the only way open to her.  She dare not turn north onto the vast ocean of grass they called the Dothraki sea. The first khalasar they met would swallow up her ragged band, slaying the warriors and slaving the rest. The lands of the Lamb Men south of the river were likewise closed to them. They were too few to defend themselves even against that unwarlike folk, and the Lhazareen had small reason to love them."
}