{
  "id": "4c947b5ba892d2578eae307db1028719f33f0b54",
  "text": " He watched her charming Lancel with eyes as green as the rope of emeralds around her slim white throat, and smiled a small sly smile to himself. I know your secret, Cersei, he thought. His sister had oft called upon the High Septon of late, to seek the blessings of the gods in their coming struggle with Lord Stannis… or so she would have him believe. In truth, after a brief call at the Great Sept of Baelor, Cersei would don a plain brown traveler’s cloak and steal off to meet a certain hedge knight with the unlikely name of Ser Osmund Kettleblack, and his equally unsavory brothers Osney and Osfryd. Lancel had told him all about them. Cersei meant to use the Kettleblacks to buy her own force of sellswords.  Well, let her enjoy her plots. She was much sweeter when she thought she was outwitting him. The Kettleblacks would charm her, take her coin, and promise her anything she asked, and why not, when Bronn was matching every copper penny, coin for coin? Amiable rogues all three, the brothers were in truth much more skilled at deceit than they’d ever been at bloodletting. Cersei had managed to buy herself three hollow drums; they would make all the fierce booming sounds she required, but there was nothing inside. It amused Tyrion no end.  Horns blew fanfares as Lionstar and Lady Lyanna pushed out from shore, moving downriver to clear the way for Seaswift. A few cheers went up from the crush along the banks, as thin and ragged as the clouds scuttling overhead. Myrcella smiled and waved from the deck. Behind her stood Arys Oakheart, his white cloak streaming. The captain ordered lines cast off, and oars pushed the Seaswift out into the lusty current of the Blackwater Rush, where her sails blossomed in the wind—common white sails, as Tyrion had insisted, not sheets of Lannister crimson. Prince Tommen sobbed.  You mew like a suckling babe,  his brother hissed at him.  Princes aren’t supposed to cry.    Prince Aemon the Dragonknight cried the day Princess Naerys wed his brother Aegon,  Sansa Stark said,  and the twins Ser Arryk and Ser Erryk died with tears on their cheeks after each had given the other a mortal wound.    Be quiet, or I’ll have Ser Meryn give you a mortal wound,  Joffrey told his betrothed. Tyrion glanced at his sister, but Cersei was engrossed in something Ser Balon Swann was telling her. Can she truly be so blind as to what he is? he wondered.  Out on the river, Bold Wind unshipped her oars and glided downstream in the wake of Seaswift. Last came King Robert’s Hammer, the might of the royal fleet… or at least that portion that had not fled to Dragonstone last year with Stannis. Tyrion had chosen the ships with care, avoiding any whose captains might be of doubtful loyalty, according to Varys… but as Varys himself was of doubtful loyalty, a certain amount of apprehension remained. I rely too much on Varys, he reflected. I need my own informers. Not that I’d trust them either. Trust would get you killed.  He wondered again about Littlefinger. There had been no word from Petyr Baelish since he had ridden off for Bitterbridge. That might mean nothing—or everything. Even Varys could not say. The eunuch had suggested that perhaps Littlefinger had met some misfortune on the roads. He might even be slain. Tyrion had snorted in derision.  If Littlefinger is dead, then I’m a giant.  More likely, the Tyrells were balking at the proposed marriage. Tyrion could scarcely blame them. If I were Mace Tyrell, I would sooner have Joffrey’s head on a pike than his cock in my daughter.  The little fleet was well out into the bay when Cersei indicated that it was time to go. Bronn brought Tyrion’s horse and helped him mount. That was Podrick Payne’s task, but they had left Pod back at the Red Keep. The gaunt sellsword made for a much more reassuring presence than the boy would have.  The narrow streets were lined by men of the City Watch, holding back the crowd with the shafts of their spears. Ser Jacelyn Bywater went in front, heading a wedge of mounted lancers in black ringmail and golden cloaks. Behind him came Ser Aron Santagar and Ser Balon Swann, bearing the king’s banners, the lion of Lannister and crowned stag of Baratheon.  King Joffrey followed on a tall grey palfrey, a golden crown set upon his golden curls. Sansa Stark rode a chesnut mare at his side, looking neither right nor left, her thick auburn hair flowing to her shoulders beneath a net of moonstones. Two of the Kingsguard flanked the couple, the Hound on the king’s right hand and Ser Mandon Moore to the left of the Stark girl.  Next came Tommen, snuffling, with Ser Preston Greenfield in his white armor and cloak, and then Cersei, accompanied by Ser Lancel and protected by Meryn Trant and Boros Blount. Tyrion fell in with his sister. After them followed the High Septon in his litter, and a long tail of other courtiers—Ser Horas Redwyne, Lady Tanda and her daughter, Jalabhar Xho, Lord Gyles Rosby, and the rest. A double column of guardsmen brought up the rear."
}