{
  "id": "4cc99f86539fffc92bc36b9f67dc3380ff5a9611",
  "text": "  Music was coming from somewhere. Riddle whirled around to stare down the empty Chamber. The music was growing louder. It was eerie, spine-tingling, unearthly; it lifted the hair on Harry's scalp and made his heart feel as though it was swelling to twice its normal size. Then, as the music reached such a pitch that Harry felt it vibrating inside his own ribs, flames erupted at the top of the nearest pillar.  A crimson bird the size of a swan had appeared, piping its weird music to the vaulted ceiling. It had a glittering golden tail as long as a peacock's and gleaming golden talons, which were gripping a ragged bundle.  A second later, the bird was flying straight at Harry. It dropped the ragged thing it was carrying at his feet, then landed heavily on his shoulder. As it folded its great wings, Harry looked up and saw it had a long, sharp golden beak and a beady black eye.  The bird stopped singing. It sat still and warm next to Harry's cheek, gazing steadily at Riddle.   \"That's a phoenix  said Riddle, staring shrewdly back at it.   \"Fawkes?\" Harry breathed, and he felt the bird's golden claws squeeze his shoulder gently  \"And that -\" said Riddle, now eyeing the ragged thing that Fawkes had dropped, \"that's the old school Sorting Hat -\"  So it was. Patched, frayed, and dirty, the hat lay motionless at Harry's feet.  Riddle began to laugh again. He laughed so hard that the dark chamber rang with it, as though ten Riddles were laughing at once  \"This is what Dumbledore sends his defender! A songbird and an old hat! Do you feel brave, Harry Potter? Do you feel safe now?\"  Harry didn't answer. He might not see what use Fawkes or the Sorting Hat were, but he was no longer alone, and he waited for Riddle to stop laughing with his courage mounting.  \"To business, Harry,\" said Riddle, still smiling broadly. \"Twice - in your past, in my future - we have met. And twice I failed to kill you. How did you survive? Tell me everything. The longer you talk,\" he added softly, \"the longer you stay alive.\"  Harry was thinking fast, weighing his chances. Riddle had the wand. He, Harry, had Fawkes and the Sorting Hat, neither of which would be much good in a duel. It looked bad, all right ... but the longer Riddle stood there, the more life was dwindling out of Ginny ... and in the meantime, Harry noticed suddenly, Riddle's outline was becoming clearer, more solid .... If it had to be a fight between him and Riddle, better sooner than later.  \"No one knows why you lost your powers when you attacked me,\" said Harry abruptly. \"I don't know myself But I know why you couldn't kill me. Because my mother died to save me. My common Muggle-born mother,\" he added, shaking with suppressed rage. \"She stopped you killing me. And I've seen the real you, I saw you last year. You're a wreck. You're barely alive. That's where all your power got you. You're in hiding. You're ugly, you're foul -\"  *%16*  Riddle's face contorted. Then he forced it into an awful smile. \"So. Your mother died to save you. Yes, that's a powerful countercharm. I can see now ... there is nothing special about you, after all. I wondered, you see. There are strange likenesses between us, after all. Even you must have noticed. Both half-bloods, orphans, raised by Muggles. Probably the only two Parselmouths to come to Hogwarts since the great Slytherin himself We even look something alike ... but after all, it was merely a lucky chance that saved you from me. That's all I wanted to know.\"  Harry stood, tense, waiting for Riddle to raise his wand. But Riddle's twisted smile was widening again.  \"Now, Harry, I'm going to teach you a little lesson. Let's match the powers of Lord Voldemort, Heir of Salazar Slytherin, against famous Harry Potter, and the best weapons Dumbledore can give him . . . .\"  He cast an amused eye over Fawkes and the Sorting Hat, then walked away. Harry, fear spreading up his numb legs, watched Ridthe stop between the high pillars and look up into the stone face of Slytherin, high above him in the half-darkness. Riddle opened his mouth wide and hissed - but Harry understood what he was saying ....  \"Speak to me, Slytherin, greatest of the Hogwarts Four. \"  Harry wheeled around to look up at the statue, Fawkes swaying on his shoulder.  Slytherin's gigantic stone face was moving. Horrorstruck, Harry saw his mouth opening, wider and wider, to make a huge black hole.   And something was stirring inside the statue's mouth. Something was slithering up from its depths. 3 1  Harry backed away until he hit the dark Chamber wall, and as he shut his eyes tight he felt Fawkes' wing sweep his cheek as he took flight. Harry wanted to shout, \"Don't leave me!\" but what chance did a phoenix have against the king of serpents?  Something huge hit the stone floor of the Chamber. Harry felt it shudder - he knew what was happening, he could sense it, could almost see the giant serpent uncoiling itself from Slytherin's mouth. Then he heard Riddle's hissing voice:  \"Kill him."
}