{
  "id": "4cd0d855c8f646ff7e3d0dc4c0b1b8abb5bfbce0",
  "text": " Now, what do you want to say?    We want to cross,  Catelyn told him.   Oh, do you? That’s blunt. Why should I let you?   For a moment her anger flared.  If you were strong enough to climb your own battlements, Lord Frey, you would see that my son has twenty thousand men outside your walls.    They’ll be twenty thousand fresh corpses when Lord Tywin gets here,  the old man shot back.  Don’t you try and frighten me, my lady. Your husband’s in some traitor’s cell under the Red Keep, your father’s sick, might be dying, and Jaime Lannister’s got your brother in chains. What do you have that I should fear? That son of yours? I’ll match you son for son, and I’ll still have eighteen when yours are all dead.    You swore an oath to my father,  Catelyn reminded him.  He bobbed his head side to side, smiling.  Oh, yes, I said some words, but I swore oaths to the crown too, it seems to me. Joffrey’s the king now, and that makes you and your boy and all those fools out there no better than rebels. If I had the sense the gods gave a fish, I’d help the Lannisters boil you all.    Why don’t you?  she challenged him.  Lord Walder snorted with disdain.  Lord Tywin the proud and splendid, Warden of the West, Hand of the King, oh, what a great man that one is, him and his gold this and gold that and lions here and lions there. I’ll wager you, he eats too many beans, he breaks wind just like me, but you’ll never hear him admit it, oh, no. What’s he got to be so puffed up about anyway? Only two sons, and one of them’s a twisted little monster. I’ll match him son for son, and I’ll still have nineteen and a half left when all of his are dead!  He cackled.  If Lord Tywin wants my help, he can bloody well ask for it.   That was all Catelyn needed to hear.  I am asking for your help, my lord,  she said humbly.  And my father and my brother and my lord husband and my sons are asking with my voice.   Lord Walder jabbed a bony finger at her face.  Save your sweet words, my lady. Sweet words I get from my wife. Did you see her? Sixteen she is, a little flower, and her honey’s only for me. I wager she gives me a son by this time next year. Perhaps I’ll make him heir, wouldn’t that boil the rest of them?    I’m certain she will give you many sons.   His head bobbed up and down.  Your lord father did not come to the wedding. An insult, as I see it. Even if he is dying. He never came to my last wedding either. He calls me the Late Lord Frey, you know. Does he think I’m dead? I’m not dead, and I promise you, I’ll outlive him as I outlived his father. Your family has always pissed on me, don’t deny it, don’t lie, you know it’s true. Years ago, I went to your father and suggested a match between his son and my daughter. Why not? I had a daughter in mind, sweet girl, only a few years older than Edmure, but if your brother didn’t warm to her, I had others he might have had, young ones, old ones, virgins, widows, whatever he wanted. No, Lord Hoster would not hear of it. Sweet words he gave me, excuses, but what I wanted was to get rid of a daughter.   And your sister, that one, she’s full as bad. It was, oh, a year ago, no more, Jon Arryn was still the King’s Hand, and I went to the city to see my sons ride in the tourney. Stevron and Jared are too old for the lists now, but Danwell and Hosteen rode, Perwyn as well, and a couple of my bastards tried the melee. If I’d known how they’d shame me, I would never have troubled myself to make the journey. Why did I need to ride all that way to see Hosteen knocked off his horse by that Tyrell whelp? I ask you. The boy’s half his age, Ser Daisy they call him, something like that. And Danwell was unhorsed by a hedge knight! Some days I wonder if those two are truly mine. My third wife was a Crakehall, all of the Crakehall women are sluts. Well, never mind about that, she died before you were born, what do you care?   I was speaking of your sister. I proposed that Lord and Lady Arryn foster two of my grandsons at court, and offered to take their own son to ward here at the Twins. Are my grandsons unworthy to be seen at the king’s court? They are sweet boys, quiet and mannerly. Walder is Merrett’s son, named after me, and the other one… heh, I don’t recall… he might have been another Walder, they’re always naming them Walder so I’ll favor them, but his father… which one was his father now?  His face wrinkled up.  Well, whoever he was, Lord Arryn wouldn’t have him, or the other one, and I blame your lady sister for that. She frosted up as if I’d suggested selling her boy to a mummer’s show or making a eunuch out of him, and when Lord Arryn said the child was going to Dragonstone to foster with Stannis Baratheon, she stormed off without a word of regrets and all the Hand could give me was apologies. What good are apologies? I ask you.   Catelyn frowned, disquieted.  I had understood that Lysa’s boy was to be fostered with Lord Tywin at Casterly Rock.    No, it was Lord Stannis,  Walder Frey said irritably.  Do you think I can’t tell Lord Stannis from Lord Tywin? They’re both bungholes who think they’re too noble to shit, but never mind about that, I know the difference."
}