{
  "id": "4cf5bb72c40307f449e76f3d83640e42bef21b44",
  "text": " They fought with blunted weapons in a chaos of mud and blood, small troops fighting together and then turning on each other as alliances formed and fractured, until only one man was left standing. The victor was the red priest, Thoros of Myr, a madman who shaved his head and fought with a flaming sword. He had won melees before; the fire sword frightened the mounts of the other riders, and nothing frightened Thoros. The final tally was three broken limbs, a shattered collarbone, a dozen smashed fingers, two horses that had to be put down, and more cuts, sprains, and bruises than anyone cared to count. Ned was desperately pleased that Robert had not taken part.  That night at the feast, Eddard Stark was more hopeful than he had been in a great while. Robert was in high good humor, the Lannisters were nowhere to be seen, and even his daughters were behaving. Jory brought Arya down to join them, and Sansa spoke to her sister pleasantly.  The tournament was magnificent,  she sighed.  You should have come. How was your dancing?    I’m sore all over,  Arya reported happily, proudly displaying a huge purple bruise on her leg.   You must be a terrible dancer,  Sansa said doubtfully.  Later, while Sansa was off listening to a troupe of singers perform the complex round of interwoven ballads called the  Dance of the Dragons,  Ned inspected the bruise himself.  I hope Forel is not being too hard on you,  he said.  Arya stood on one leg. She was getting much better at that of late.  Syrio says that every hurt is a lesson, and every lesson makes you better.   Ned frowned. The man Syrio Forel had come with an excellent reputation, and his flamboyant Braavosi style was well suited to Arya’s slender blade, yet still… a few days ago, she had been wandering around with a swatch of black silk tied over her eyes. Syrio was teaching her to see with her ears and her nose and her skin, she told him. Before that, he had her doing spins and back flips.  Arya, are you certain you want to persist in this?   She nodded.  Tomorrow we’re going to catch cats.    Cats.  Ned sighed.  Perhaps it was a mistake to hire this Braavosi. If you like, I will ask Jory to take over your lessons. Or I might have a quiet word with Ser Barristan. He was the finest sword in the Seven Kingdoms in his youth.    I don’t want them,  Arya said.  I want Syrio.   Ned ran his fingers through his hair. Any decent master-at-arms could give Arya the rudiments of slash-and-parry without this nonsense of blindfolds, cartwheels, and hopping about on one leg, but he knew his youngest daughter well enough to know there was no arguing with that stubborn jut of jaw.  As you wish,  he said. Surely she would grow tired of this soon.  Try to be careful.    I will,  she promised solemnly as she hopped smoothly from her right leg to her left.  Much later, after he had taken the girls back through the city and seen them both safe in bed, Sansa with her dreams and Arya with her bruises, Ned ascended to his own chambers atop the Tower of the Hand. The day had been warm and the room was close and stuffy. Ned went to the window and unfastened the heavy shutters to let in the cool night air. Across the Great Yard, he noticed the flickering glow of candlelight from Littlefinger’s windows. The hour was well past midnight. Down by the river, the revels were only now beginning to dwindle and die.  He took out the dagger and studied it. Littlefinger’s blade, won by Tyrion Lannister in a tourney wager, sent to slay Bran in his sleep. Why? Why would the dwarf want Bran dead? Why would anyone want Bran dead?  The dagger, Bran’s fall, all of it was linked somehow to the murder of Jon Arryn, he could feel it in his gut, but the truth of Jon’s death remained as clouded to him as when he had started. Lord Stannis had not returned to King’s Landing for the tourney. Lysa Arryn held her silence behind the high walls of the Eyrie. The squire was dead, and Jory was still searching the whorehouses. What did he have but Robert’s bastard?  That the armorer’s sullen apprentice was the king’s son, Ned had no doubt. The Baratheon look was stamped on his face, in his jaw, his eyes, that black hair. Renly was too young to have fathered a boy of that age, Stannis too cold and proud in his honor. Gendry had to be Robert’s.  Yet knowing all that, what had he learned? The king had other baseborn children scattered throughout the Seven Kingdoms. He had openly acknowledged one of his bastards, a boy of Bran’s age whose mother was highborn. The lad was being fostered by Lord Renly’s castellan at Storm’s End.  Ned remembered Robert’s first child as well, a daughter born in the Vale when Robert was scarcely more than a boy himself. A sweet little girl; the young lord of Storm’s End had doted on her. He used to make daily visits to play with the babe, long after he had lost interest in the mother. Ned was often dragged along for company, whether he willed it or not. The girl would be seventeen or eighteen now, he realized; older than Robert had been when he fathered her."
}