{
  "id": "4d1811a83913c93d9b10506275500c1e7b770218",
  "text": "  He  turned away and mounted his pony. But as he started off, Rosie  ran down the  steps.       'I think you look fine, Sam,'  she  said. 'Go on now! But  take care of  yourself, and come straight back as soon as you have settled the ruffians!'       When  Sam  got back  he found the  whole village roused. Already, apart   from many younger lads,  more  than a hundred sturdy hobbits were  assembled  with axes, and heavy  hammers, and  long knives, and stout staves: and a few  had hunting-bows. More were still coming in from outlying farms.       Some of the village-folk had lit  a large fire, just to enliven things,   and also because it was one of the things forbidden by the Chief. It  burned  bright as  night came on. Others at Merry's orders  were setting up barriers  across the road at each end of the  village. When  the Shirriffs  came up to  the lower  one  they were  dumbfounded; but  as soon as they saw how  things  were, most of  them took off  their  feathers and joined in  the revolt. The  others slunk away.       Sam found Frodo and his friends by the  fire talking to old Tom Cotton,  while an admiring crowd of Bywater folk stood round and stared.       'Well, what's the next move?' said Farmer Cotton.   ####-     'I  can't  say,'  said Frodo, 'until  I  know more. How  many  of these  ruffians are there?'       'That's  hard  to tell,' said  Cotton. 'They moves  about and comes and  goes. There's  sometimes  fifty of them  in their sheds up Hobbiton way; but  they go out  from there roving round,  thieving  or \"gathering\" as they call  it. Still there's seldom  less  than a score  round the  Boss, as they names  him. He's at Bag End, or was; but he don't go outside the rounds now. No one  s seen him at all, in fact, for a week or two; but the Men  don't let no one  go near.'       'Hobbiton's not their only place, is it?' said Pippin.       'No, more's the pity,' said Cotton. 'There's a  good few down south  in  Longbottom and by Sarn Ford, I hear; and some more lurking in the Woody  End;  and they've sheds at Waymeet.  And then there's  the Lockholes, as they call   'em:  the old  storage-tunnels  at  Michel Delving  that  they've made  into  prisons  for  those as stand up to  them. Still I  reckon there's  not above  three hundred of  them in the Shire all told, and  maybe less. We can master   them, if we stick together.'       'Have they got any weapons?' asked Merry.       'Whips,  knives, and  clubs, enough for their dirty  work:  that's  all  they've showed so far,' said Cotton. 'But I dare say they've got other gear,  if it comes to fighting. Some have bows, anywa y. They've shot one or two  of  our folk.'       'There  you are, Frodo!' said Merry. 'I knew we should have  to  fight.  Well, they started the killing.'       'Not exactly,' said Cotton. 'Leastways not the  shooting. Tooks started  that. You see our dad Mr. Peregrin, he's never had no truck with this Lotho,  not  from the beginning: said that if anyone was going to play the chief  at  this time of day,  it would  be the right Thain of the Shire and no upstart.  And when Lotho sent his Men they got no  change out of him. Tooks are lucky,  they've got those deep holes in the Green Hills,  the Great  Smials and all,  and the  ruffians can't come at 'em; and they won't let the ruffians come on  their land.  If they  do, Tooks hunt  'em. Tooks shot three for prowling and  robbing.  After  that the  ruffians turned nastier. And they  keep  a pretty  close watch on Tookland. No one gets in nor out of it now.'       'Good  for the  Tooks!' cried Pippin.  'But someone is going  to get in  again, now. I am off to the Smials. Anyone coming with me to Tuckborough?'   ####-     Pippin rode off with half  a dozen lads on ponies.  'See you soon!'  he  cried. 'It's only  fourteen miles or so over the fields. I'll bring you back   an army of Tooks in the morning.' Merry blew  a horn-call after them as they  rode off into the gathering night. The people cheered.       'All the same,' said Frodo to all those who stood near, 'I wish for  no  killing; not even of the ruffians, unless  it must be done, to  prevent them  from hurting hobbits.'       'All right! '  said Merry.  'But  we shall be having  a visit  from  the  Hobbiton gang any time  now, I  think. They  won't come just to  talk things  over.  We'll try to deal with them  neatly, but  we must be prepared for the  worst. Now I've got a plan.'       'Very good,' said Frodo. 'You make the arrangements.'       Just  then  some hobbits, who had  been sent out towards Hobbiton, came  running in. 'They're coming!' they said. 'A score or more. But two have gone   off west across country.'       'To Waymeet, that'll be, ' said  Cotton,  'to fetch  more  of  the gang.  Well, it's fifteen mile each way. We needn't trouble about them just yet.'       Merry  hurried off to  give orders. Farmer Cotton cleared  the  street,  sending everyone indoors, except the  older  hobbits who  had weapons of some  sort."
}