{
  "id": "4dcebb6438ac2ad30f883bf96a01f1328395b256",
  "text": " See you five o'clock tomorrow. Can't wait. Harry  He folded this note up very small, and with immense difficulty, tied it to the tiny owl's leg as it hopped on the spot with excitement.  The moment the note was secure, the owl was off again; it zoomed out of the window and out of sight. Harry turned to Hedwig. \"Feeling up to a long journey?\" he asked her. Hedwig hooted in a dignified sort of a way. \"Can you take this to Sirius for me?\" he said, picking up his letter. \"Hang on ... I just want to finish it.\" He unfolded the parchment and hastily added a postscript.  If you want to contact me, I'll be at my friend Ron Weasley's for the rest of the summer. His dad's got us tickets for the Quidditch World Cup!  The letter finished, he tied it to Hedwig's leg; she kept unusually still, as though determined to show him how a real post owl should behave. \"I'll be at Ron's when you get back, all right?\" Harry told her. She nipped his finger affectionately, then, with a soft swooshing noise, spread her enormous wings and soared out of the open window. Harry watched her out of sight, then crawled under his bed, wrenched up the loose floorboard, and pulled out a large chunk of birthday cake.  He sat there on the floor eating it, savoring the happiness that was flooding through him.  He had cake, and Dudley had nothing but grapefruit; it was a bright summer's day, he would be leaving Privet Drive tomorrow, his scar felt perfectly normal again, and he was going to watch the Quidditch World Cup.  It was hard, just now, to feel worried about anything - even Lord Voldemort.  CHAPTER FOUR - BACK TO THE BURROW  By twelve o'clock the next day, Harry's school trunk was packed with his school things and all his most prized possessions - the Invisibility Cloak he had inherited from his father, the broomstick he had gotten from Sirius, the enchanted map of Hogwarts he had been given by Fred and George Weasley last year.  He had emptied his hiding place under the loose floorboard of all food, double-checked every nook and cranny of his bedroom for forgotten spellbooks or quills, and taken down the chart on the wall counting down the days to September the first, on which he liked to cross off the days remaining until his return to Hogwarts. The atmosphere inside number four, Privet Drive was extremely tense. The imminent arrival at their house of an assortment of wizards was making the Dursleys uptight and irritable. Uncle Vernon had looked downright alarmed when Harry informed him that the Weasleys would be arriving at five o'clock the very next day. \"I hope you told them to dress properly, these people,\" he snarled at once.  \"I've seen the sort of stuff your lot wear.  They'd better have the decency to put on normal clothes, that's all.\" Harry felt a slight sense of foreboding. He had rarely seen Mr. or Mrs. Weasley wearing anything that the Dursleys would call \"normal.\"  Their children might don Muggle clothing during the holidays, but Mr. and Mrs. Weasley usually wore long robes in varying states of shabbiness.  Harry wasn't bothered about what the neighbors would think, but he was anxious about how rude the Dursleys might be to the Weasleys if they turned up looking like their worst idea of wizards. Uncle Vernon had put on his best suit.  To some people, this might have looked like a gesture of welcome, but Harry knew it was because Uncle Vernon wanted to look impressive and intimidating.  Dudley, on the other hand, looked somehow diminished.  This was not because the diet was at last taking effect, but due to fright.  Dudley had emerged from his last encounter with a fully grown wizard with a curly pig's tail poking out of the seat of his trousers, and Aunt Petunia and Uncle Vernon had had to pay for its removal at a private hospital in London.  It wasn't altogether surprising, therefore, that Dudley kept running his hand nervously over his backside, and walking sideways from room to room, so as not to present the same target to the enemy. Lunch was an almost silent meal.  Dudley didn't even protest at the food (cottage cheese and grated celery).  Aunt Petunia wasn't, eating anything at all.  Her arms were folded, her lips were pursed, and she seemed to be chewing her tongue, as though biting back the furious diatribe she longed to throw at Harry. \"They'll be driving, of course?\" Uncle Vernon barked across the table. \"Er,\" said Harry. He hadn't thought of that. How were the Weasleys going to pick him up?  They didn't have a car anymore; the old Ford Anglia they had once owned was currently running wild in the Forbidden Forest at Hogwarts.  But Mr. Weasley had borrowed a Ministry of Magic car last year; possibly he would do the same today? \"I think so,\" said Harry. Uncle Vernon snorted into his mustache.  Normally, Uncle Vernon would have asked what car Mr. Weasley drove; he tended to judge other men by how big and expensive their cars were.  But Harry doubted whether Uncle Vernon would have taken to Mr. Weasley even if he drove a Ferrari."
}