{
  "id": "4de56fe7871754f5992a4c51fcd414a3f12d3cbf",
  "text": "   There have been many  lords in the green fields in my time, and I have never  learned their speech or their  names. They will be wanting man-food, and you  know all  about that, I guess.  So find what you think  is fit for a king to  eat,  if you can.\" And that is the end of the story. Though I should like to  know who this Wormtongue is. Was he really the king's counsellor?'       'He was,' said  Aragorn; 'and also  Saruman's spy and servant in Rohan.  Fate has not been  kinder to him than he deserves. The sight of the  ruin of  all  that  he  thought  so  strong and  magnificent  must  have  been almost  punishment enough. But I fear that worse awaits him.'       'Yes, I  don't suppose Treebeard sent him to Orthanc out of  kindness,'  said Merry.  'He seemed rather grimly delighted  with the business  and  was  laughing to himself when he went to get his bathe and drink. We spent a busy  time after that, searching the flotsam, and rummaging about. We found two or   three  store-rooms  in different  places nearby,  above the flood-level. But  Treebeard  sent  some  Ents down, and they  carried off  a great deal of the  stuff.       '\"We want man-food for twenty-five,\" the Ents said, so you can see that  somebody  had  counted your  company carefully before you arrived. You three  were  evidently meant to go  with the  great people. But you  would  not have   fared any better. We kept as good as we sent, I promise you. Better, because  we sent no drink.       '\"What about drink?\" I said to the Ents.        '\"There is water of Isen,\" they said, \"and that is good enough for Ents  and Men.\" But I hope that the Ents may have found time to brew some of their  draughts from the mountain-springs, and we shall see Gandalf's beard curling   ####-when he returns. After the Ents had gone, we felt tired,  and hungry. But we  did not grumble  -- our labours  had  been well rewarded. It was through our   search  for  man-food that Pippin  discovered the prize of  all the flotsam,  those  Hornblower  barrels.  \"Pipe-weed  is better after food,\" said Pippin;  that is how the situation arose.'       'We understand it all perfectly now,' said Gimli.       'All except one thing,' said  Aragorn: 'leaf  from the Southfarthing in  Isengard.  The more  I consider it, the more curious I find it. I have never   been in Isengard,  but I have journeyed  in this  land, and I know  well the  empty countries that lie between Rohan and the Shire. Neither goods nor folk  have passed that  way for  many a long year, not openly. Saruman  had secret  dealings with someone  in  the Shire, I  guess. Wormtongues may  be found in  other houses than King Thjoden's. Was there a date on the barrels?'       'Yes,' said Pippin. 'It was the 1417 crop, that is last year's; no, the  year before, of course, now: a good year.'       'Ah well, whatever evil  was  afoot is over now, I  hope; or else it is  beyond our reach  at pr esent,' said Aragorn. 'Yet I think I shall mention it  to Gandalf, small matter though it may seem among his great affairs.'       'I wonder what he is doing,' said Merry. 'The  afternoon is getting on.  Let us go and look round! You can enter Isengard now at  any rate,  Strider,   if you want to. But it is not a very cheerful sight.'   ####-     Chapter 10. The Voice of Saruman            They passed through the ruined tunnel and stood upon a heap of  stones,  gazing at the  dark rock of Orthanc, and its many windows, a menace still in  the  desolation  that  lay  all about  it.  The waters  had  now  nearly all  subsided.  Here  and  there  gloomy pools  remained,  covered with  scum and  wreckage; but most of the wide circle was bare again, a  wilderness of slime  and tumbled  rock, pitted with  blackened holes, and  dotted  with posts and  pillars  leaning  drunkenly this  way and that. At the rim of the  shattered  bowl  there lay vast mounds and slopes, like the shingles cast up by a great  storm; and  beyond them the  green and  tangled valley  ran up into the long   ravine  between the  dark arms  of  the mountains. Across the waste they saw  riders picking their way; they were coming from the north  side, and already  they were drawing near to Orthanc.       'There is  Gandalf, and Thjoden and his men!' said Legolas. 'Let  us go  and meet them!'       'Walk warily!' said Merry. 'There are loose  slabs that may tilt up and  throw you down into a pit, if you don't take care.'       They  followed what was  left of  the road from  the gates  to Orthanc,  going slowly,  for  the flag-stones  were cracked  and  slimed.  The riders,   seeing them approach, halted under the  shadow of  the  rock and  waited for   them. Gandalf rode forward to meet them.       'Well, Treebeard and I have had some interesting  discussions, and made  a few plans,' he said; 'and we have  all had  some much-needed  rest. Now we  must  be going  on again.  I hope  you companions  have all rested, too, and  refreshed yourselves?'       'We have,' said Merry."
}