{
  "id": "4ed3c6fd66a6c1b8118c62d2780bf6cf4c9a37e9",
  "text": " She floated.  When she was clean, her handmaids helped her from the water. Irri and Jhiqui fanned her dry, while Doreah brushed her hair until it fell like a river of liquid silver down her back. They scented her with spiceflower and cinnamon; a touch on each wrist, behind her ears, on the tips of her milk-heavy breasts. The last dab was for her sex. Irri’s finger felt as light and cool as a lover’s kiss as it slid softly up between her lips.  Afterward, Dany sent them all away, so she might prepare Khal Drogo for his final ride into the night lands. She washed his body clean and brushed and oiled his hair, running her fingers through it for the last time, feeling the weight of it, remembering the first time she had touched it, the night of their wedding ride. His hair had never been cut. How many men could die with their hair uncut? She buried her face in it and inhaled the dark fragrance of the oils. He smelled like grass and warm earth, like smoke and semen and horses. He smelled like Drogo. Forgive me, sun of my life, she thought. Forgive me for all I have done and all I must do. I paid the price, my star, but it was too high, too high…  Dany braided his hair and slid the silver rings onto his mustache and hung his bells one by one. So many bells, gold and silver and bronze. Bells so his enemies would hear him coming and grow weak with fear. She dressed him in horsehair leggings and high boots, buckling a belt heavy with gold and silver medallions about his waist. Over his scarred chest she slipped a painted vest, old and faded, the one Drogo had loved best. For herself she chose loose sandsilk trousers, sandals that laced halfway up her legs, and a vest like Drogo’s.  The sun was going down when she called them back to carry his body to the pyre. The Dothraki watched in silence as Jhogo and Aggo bore him from the tent. Dany walked behind them. They laid him down on his cushions and silks, his head toward the Mother of Mountains far to the northeast.   Oil,  she commanded, and they brought forth the jars and poured them over the pyre, soaking the silks and the brush and the bundles of dry grass, until the oil trickled from beneath the logs and the air was rich with fragrance.  Bring my eggs,  Dany commanded her handmaids. Something in her voice made them run.  Ser Jorah took her arm.  My queen, Drogo will have no use for dragon’s eggs in the night lands. Better to sell them in Asshai. Sell one and we can buy a ship to take us back to the Free Cities. Sell all three and you will be a wealthy woman all your days.    They were not given to me to sell,  Dany told him.  She climbed the pyre herself to place the eggs around her sun-and-stars. The black beside his heart, under his arm. The green beside his head, his braid coiled around it. The cream-and-gold down between his legs. When she kissed him for the last time, Dany could taste the sweetness of the oil on his lips.  As she climbed down off the pyre, she noticed Mirri Maz Duur watching her.  You are mad,  the godswife said hoarsely.   Is it so far from madness to wisdom?  Dany asked.  Ser Jorah, take this maegi and bind her to the pyre.    To the… my queen, no, hear me…    Do as I say.  Still he hesitated, until her anger flared.  You swore to obey me, whatever might come. Rakharo, help him.   The godswife did not cry out as they dragged her to Khal Drogo’s pyre and staked her down amidst his treasures. Dany poured the oil over the woman’s head herself.  I thank you, Mirri Maz Duur,  she said,  for the lessons you have taught me.    You will not hear me scream,  Mirri responded as the oil dripped from her hair and soaked her clothing.   I will,  Dany said,  but it is not your screams I want, only your life. I remember what you told me. Only death can pay for life.  Mirri Maz Duur opened her mouth, but made no reply. As she stepped away, Dany saw that the contempt was gone from the maegi’s flat black eyes; in its place was something that might have been fear. Then there was nothing to be done but watch the sun and look for the first star.  When a horselord dies, his horse is slain with him, so he might ride proud into the night lands. The bodies are burned beneath the open sky, and the khal rises on his fiery steed to take his place among the stars. The more fiercely the man burned in life, the brighter his star will shine in the darkness.  Jhogo spied it first.  There,  he said in a hushed voice. Dany looked and saw it, low in the east. The first star was a comet, burning red. Bloodred; fire red; the dragon’s tail. She could not have asked for a stronger sign.  Dany took the torch from Aggo’s hand and thrust it between the logs. The oil took the fire at once, the brush and dried grass a heartbeat later. Tiny flames went darting up the wood like swift red mice, skating over the oil and leaping from bark to branch to leaf. A rising heat puffed at her face, soft and sudden as a lover’s breath, but in seconds it had grown too hot to bear. Dany stepped backward."
}