{
  "id": "4ef2340328a92bfb66da9c71a1604495d9ffae52",
  "text": "  The night is dark and full of terrors.   He knew the phrase, some prayer of her faith. It makes no matter, I have a faith of my own.  Only children fear the dark,  he told her. Yet even as he said the words, he heard Patchface take up his song again.  The shadows come to dance, my lord, dance my lord, dance my lord.    Now here is a riddle,  Melisandre said.  A clever fool and a foolish wise man.  Bending, she picked up Patchface’s helm from where it had fallen and set it on Cressen’s head. The cowbells rang softly as the tin bucket slid down over his ears.  A crown to match your chain, Lord Maester,  she announced. All around them, men were laughing.  Cressen pressed his lips together and fought to still his rage. She thought he was feeble and helpless, but she would learn otherwise before the night was done. Old he might be, yet he was still a maester of the Citadel.  I need no crown but truth,  he told her, removing the fool’s helm from his head.   There are truths in this world that are not taught at Oldtown.  Melisandre turned from him in a swirl of red silk and made her way back to the high table, where King Stannis and his queen were seated. Cressen handed the antlered tin bucket back to Patchface, and made to follow.  Maester Pylos sat in his place.  The old man could only stop and stare.  Maester Pylos,  he said at last.  You… you did not wake me.    His Grace commanded me to let you rest.  Pylos had at least the grace to blush.  He told me you were not needed here.   Cressen looked over the knights and captains and lords sitting silent. Lord Celtigar, aged and sour, wore a mantle patterned with red crabs picked out in garnets. Handsome Lord Velaryon chose sea-green silk, the white gold seahorse at his throat matching his long fair hair. Lord Bar Emmon, that plump boy of fourteen, was swathed in purple velvet trimmed with white seal, Ser Axell Florent remained homely even in russet and fox fur, pious Lord Sunglass wore moonstones at throat and wrist and finger, and the Lysene captain Salladhor Saan was a sunburst of scarlet satin, gold, and jewels. Only Ser Davos dressed simply, in brown doublet and green wool mantle, and only Ser Davos met his gaze, with pity in his eyes.   You are too ill and too confused to be of use to me, old man.  It sounded so like Lord Stannis’s voice, but it could not be, it could not.  Pylos will counsel me henceforth. Already he works with the ravens, since you can no longer climb to the rookery. I will not have you kill yourself in my service.   Maester Cressen blinked. Stannis, my lord, my sad sullen boy, son I never had, you must not do this, don’t you know how I have cared for you, lived for you, loved you despite all? Yes, loved you, better than Robert even, or Renly, for you were the one unloved, the one who needed me most. Yet all he said was,  As you command, my lord, but… but I am hungry. Might not I have a place at your table?  At your side, I belong at your side…  Ser Davos rose from the bench.  I should be honored if the maester would sit here beside me, Your Grace.    As you will.  Lord Stannis turned away to say something to Melisandre, who had seated herself at his right hand, in the place of high honor. Lady Selyse was on his left, flashing a smile as bright and brittle as her jewels.  Too far, Cressen thought dully, looking at where Ser Davos was seated. Half of the lords bannermen were between the smuggler and the high table. I must be closer to her if I am to get the strangler into her cup, yet how?  Patchface was capering about as the maester made his slow way around the table to Davos Seaworth.  Here we eat fish,  the fool declared happily, waving a cod about like a scepter.  Under the sea, the fish eat us. I know, I know, oh, oh, oh.   Ser Davos moved aside to make room on the bench.  We all should be in motley tonight,  he said gloomily as Cressen seated himself,  for this is fool’s business we’re about. The red woman has seen victory in her flames, so Stannis means to press his claim, no matter what the numbers. Before she’s done we’re all like to see what Patchface saw, I fear—the bottom of the sea.   Cressen slid his hands up into his sleeves as if for warmth. His fingers found the hard lumps the crystals made in the wool.  Lord Stannis.   Stannis turned from the red woman, but it was Lady Selyse who replied.  King Stannis. You forget yourself, Maester.    He is old, his mind wanders,  the king told her gruffly.  What is it, Cressen? Speak your mind.    As you intend to sail, it is vital that you make common cause with Lord Stark and Lady Arryn…    I make common cause with no one,  Stannis Baratheon said.   No more than light makes common cause with darkness.  Lady Selyse took his hand.  Stannis nodded.  The Starks seek to steal half my kingdom, even as the Lannisters have stolen my throne and my own sweet brother the swords and service and strongholds that are mine by rights. They are all usurpers, and they are all my enemies.   I have lost him, Cressen thought, despairing."
}