{
  "id": "4ef4a64df7490af9cf76af1680b8f0b893fd9223",
  "text": " She is old enough for the khal,  Illyrio told him, not for the first time.  Look at her. That silver-gold hair, those purple eyes… she is the blood of old Valyria, no doubt, no doubt… and highborn, daughter of the old king, sister to the new, she cannot fail to entrance our Drogo.  When he released her hand, Daenerys found herself trembling.   I suppose,  her brother said doubtfully.  The savages have queer tastes. Boys, horses, sheep…    Best not suggest this to Khal Drogo,  Illyrio said.  Anger flashed in her brother’s lilac eyes.  Do you take me for a fool?   The magister bowed slightly.  I take you for a king. Kings lack the caution of common men. My apologies if I have given offense.  He turned away and clapped his hands for his bearers.  The streets of Pentos were pitch-dark when they set out in Illyrio’s elaborately carved palanquin. Two servants went ahead to light their way, carrying ornate oil lanterns with panes of pale blue glass, while a dozen strong men hoisted the poles to their shoulders. It was warm and close inside behind the curtains. Dany could smell the stench of Illyrio’s pallid flesh through his heavy perfumes.  Her brother, sprawled out on his pillows beside her, never noticed. His mind was away across the narrow sea.  We won’t need his whole khalasar,  Viserys said. His fingers toyed with the hilt of his borrowed blade, though Dany knew he had never used a sword in earnest.  Ten thousand, that would be enough, I could sweep the Seven Kingdoms with ten thousand Dothraki screamers. The realm will rise for its rightful king. Tyrell, Redwyne, Darry, Greyjoy, they have no more love for the Usurper than I do. The Dornishmen burn to avenge Elia and her children. And the smallfolk will be with us. They cry out for their king.  He looked at Illyrio anxiously.  They do, don’t they?    They are your people, and they love you well,  Magister Illyrio said amiably.  In holdfasts all across the realm, men lift secret toasts to your health while women sew dragon banners and hide them against the day of your return from across the water.  He gave a massive shrug.  Or so my agents tell me.   Dany had no agents, no way of knowing what anyone was doing or thinking across the narrow sea, but she mistrusted Illyrio’s sweet words as she mistrusted everything about Illyrio. Her brother was nodding eagerly, however.  I shall kill the Usurper myself,  he promised, who had never killed anyone,  as he killed my brother Rhaegar. And Lannister too, the Kingslayer, for what he did to my father.    That would be most fitting,  Magister Illyrio said. Dany saw the smallest hint of a smile playing around his full lips, but her brother did not notice. Nodding, he pushed back a curtain and stared off into the night, and Dany knew he was fighting the Battle of the Trident once again.  The nine-towered manse of Khal Drogo sat beside the waters of the bay, its high brick walls overgrown with pale ivy. It had been given to the khal by the magisters of Pentos, Illyrio told them. The Free Cities were always generous with the horselords.  It is not that we fear these barbarians,  Illyrio would explain with a smile.  The Lord of Light would hold our city walls against a million Dothraki, or so the red priests promise… yet why take chances, when their friendship comes so cheap?   Their palanquin was stopped at the gate, the curtains pulled roughly back by one of the house guards. He had the copper skin and dark almond eyes of a Dothraki, but his face was hairless and he wore the spiked bronze cap of the Unsullied. He looked them over coldly. Magister Illyrio growled something to him in the rough Dothraki tongue; the guardsman replied in the same voice and waved them through the gates.  Dany noticed that her brother’s hand was clenched tightly around the hilt of his borrowed sword. He looked almost as frightened as she felt.  Insolent eunuch,  Viserys muttered as the palanquin lurched up toward the manse.  Magister Illyrio’s words were honey.  Many important men will be at the feast tonight. Such men have enemies. The khal must protect his guests, yourself chief among them, Your Grace. No doubt the Usurper would pay well for your head.    Oh, yes,  Viserys said darkly.  He has tried, Illyrio, I promise you that. His hired knives follow us everywhere. I am the last dragon, and he will not sleep easy while I live.   The palanquin slowed and stopped. The curtains were thrown back, and a slave offered a hand to help Daenerys out. His collar, she noted, was ordinary bronze. Her brother followed, one hand still clenched hard around his sword hilt. It took two strong men to get Magister Illyrio back on his feet.  Inside the manse, the air was heavy with the scent of spices, pinchfire and sweet lemon and cinnamon. They were escorted across the entry hall, where a mosaic of colored glass depicted the Doom of Valyria. Oil burned in black iron lanterns all along the walls. Beneath an arch of twining stone leaves, a eunuch sang their coming."
}