{
  "id": "4f62439fc25c62376f99116f905a16ba7ac18502",
  "text": " Cursing, the king thrust the point of the sword into the damp earth and beat out the flames against his leg.   Lord, cast your light upon us!  Melisandre called out.   For the night is dark and full of terrors,  Selyse and her queen’s men replied. Should I speak the words as well? Davos wondered. Do I owe Stannis that much? Is this fiery god truly his own? His shortened fingers twitched.  Stannis peeled off the glove and let it fall to the ground. The gods in the pyre were scarcely recognizable anymore. The head fell off the Smith with a puff of ash and embers. Melisandre sang in the tongue of Asshai, her voice rising and falling like the tides of the sea. Stannis untied his singed leather cape and listened in silence. Thrust in the ground, Lightbringer still glowed ruddy hot, but the flames that clung to the sword were dwindling and dying.  By the time the song was done, only charwood remained of the gods, and the king’s patience had run its course. He took the queen by the elbow and escorted her back into Dragonstone, leaving Lightbringer where it stood. The red woman remained a moment to watch as Devan knelt with Byren Farring and rolled up the burnt and blackened sword in the king’s leather cloak. The Red Sword of Heroes looks a proper mess, thought Davos.  A few of the lords lingered to speak in quiet voices upwind of the fire. They fell silent when they saw Davos looking at them. Should Stannis fall, they will pull me down in an instant. Neither was he counted one of the queen’s men, that group of ambitious knights and minor lordlings who had given themselves to this Lord of Light and so won the favor and patronage of Lady—no, Queen, remember?—Selyse.  The fire had started to dwindle by the time Melisandre and the squires departed with the precious sword. Davos and his sons joined the crowd making its way down to the shore and the waiting ships.  Devan acquitted himself well,  he said as they went.   He fetched the glove without dropping it, yes,  said Dale.  Allard nodded.  That badge on Devan’s doublet, the fiery heart, what was that? The Baratheon sigil is a crowned stag.    A lord can choose more than one badge,  Davos said.  Dale smiled.  A black ship and an onion, Father?   Allard kicked at a stone.  The Others take our onion… and that flaming heart. It was an ill thing to burn the Seven.    When did you grow so devout?  Davos said.  What does a smuggler’s son know of the doings of gods?    I’m a knight’s son, Father. If you won’t remember, why should they?     A knight’s son, but not a knight,  said Davos.  Nor will you ever be, if you meddle in affairs that do not concern you. Stannis is our rightful king, it is not for us to question him. We sail his ships and do his bidding. That is all.    As to that, Father,  Dale said,  I mislike these water casks they’ve given me for Wraith. Green pine. The water will spoil on a voyage of any length.    I got the same for Lady Marya,  said Allard.  The queen’s men have laid claim to all the seasoned wood.    I will speak to the king about it,  Davos promised. Better it come from him than from Allard. His sons were good fighters and better sailors, but they did not know how to talk to lords. They were lowborn, even as I was, but they do not like to recall that. When they look at our banner, all they see is a tall black ship flying on the wind. They close their eyes to the onion.  The port was as crowded as Davos had ever known it. Every dock teemed with sailors loading provisions, and every inn was packed with soldiers dicing or drinking or looking for a whore… a vain search, since Stannis permitted none on his island. Ships lined the strand; war galleys and fishing vessels, stout carracks and fat-bottomed cogs. The best berths had been taken by the largest vessels: Stannis’s flagship Fury rocking between Lord Steffon and Stag of the Sea, Lord Velaryon’s silver-hulled Pride of Driftmark and her three sisters, Lord Celtigar’s ornate Red Claw, the ponderous Swordfish with her long iron prow. Out to sea at anchor rode Salladhor Saan’s great Valyrian amongst the striped hulls of two dozen smaller Lysene galleys.  A weathered little inn sat on the end of the stone pier where Black Betha, Wraith, and Lady Marya shared mooring space with a half-dozen other galleys of one hundred oars or less. Davos had a thirst. He took his leave of his sons and turned his steps toward the inn. Out front squatted a waist-high gargoyle, so eroded by rain and salt that his features were all but obliterated. He and Davos were old friends, though. He gave a pat to the stone head as he went in.  Luck,  he murmured.  Across the noisy common room, Salladhor Saan sat eating grapes from a wooden bowl. When he spied Davos, he beckoned him closer.  Ser knight, come sit with me. Eat a grape. Eat two. They are marvelously sweet.  The Lyseni was a sleek, smiling man whose flamboyance was a byword on both sides of the narrow sea. Today he wore flashing cloth-of-silver, with dagged sleeves so long the ends of them pooled on the floor."
}