{
  "id": "4f7df969059e119c27c5624a3df1e24286b32d04",
  "text": "\"  *328*  Relief -- warm, sweeping, glorious relief -- swept over Harry. \"W- what's that?\" said Mr. Weasley in a stunned voice. \"YouKnow-Who? En-enchant Ginny? But Ginny's not ... Ginny hasn't been ... has she?\"  \"It was this diary,\" said Harry quickly, picking it up and showing it to Dumbledore. \"Riddle wrote it when he was sixteen . . . .\"  Dumbledore took the diary from Harry and peered keenly down his long, crooked nose at its burnt and soggy pages.  \"Brilliant,\" he said softly. \"Of course, he was probably the most brilliant student Hogwarts has ever seen.\" He turned around to the Weasleys, who were looking utterly bewildered.  \"Very few people know that Lord Voldemort was once called Tom Riddle. I taught him myself, fifty years ago, at Hogwarts. He disappeared after leaving the school ... traveled far and wide ... sank so deeply into the Dark Arts, consorted with the very worst of our kind, underwent so many dangerous, magical transformations, that when he resurfaced as Lord Voldemort, he was barely recognizable. Hardly anyone connected Lord Voldemort with the clever, handsome boy who was once Head Boy here.\"  \"But, Ginny,\" said Mrs. Weasley. \"What's our Ginny got to do with - with -- him?\"  \"His d-diaryl\" Ginny sobbed. \"I've b-been writing in it, and he's been w-writing back all year --\"  \"tinny!\" said Mr. Weasley, flabbergasted. \"Haven't I taught you anything. What have I always told you? Never trust anything that can think for itself if you can't see where it keeps its brain?  Why didn't you show the diary to me, or your mother? A suspicious object like that, it was clearly full of Dark Magic ='  *329*  \"I d-didn't know,\" sobbed Ginny. \"I found it inside one of the books Mum got me. I th-thought someone had just left it in there and forgotten about it --\"  \"Miss Weasley should go up to the hospital wing right away,\" Dumbledore interrupted in a firm voice. \"This has been a terrible ordeal for her. There will be no punishment. Older and wiser wizards than she have been hoodwinked by Lord Voldemort.\" He strode over to the door and opened it. \"Bed rest and perhaps a large, steaming mug of hot chocolate. I always find that cheers me up,\" he added, twinkling kindly down at her. \"You will find that Madam Pomfrey is still awake. She's just giving out Mandrake juice -- I daresay the basilisk's victims will be waking up any moment.\"  \"So Hermione's okay!\" said Ron brightly.  \"There has been no lasting harm done, Ginny,\" said Dumbledore.  Mrs. Weasley led Ginny out, and Mr. Weasley followed, still looking deeply shaken.  \"You know, Minerva,\" Professor Dumbledore said thoughtfully to Professor McGonagall, \"I think all this merits a good feast. Might I ask you to go and alert the kitchens?\"  \"Right,\" said Professor McGonagall crisply, also moving to the door. \"I'll leave you to deal with Potter and Weasley, shall I?\"  \"Certainly,\" said Dumbledore.  She left, and Harry and Ron gazed uncertainly at Dumbledore. What exactly had Professor McGonagall meant, deal with them? Surely - surely - they weren't about to be punished?  \"I seem to remember telling you both that I would have to expel you if you broke any more school rules, said Dumbledore.  *%30*  Ron opened his mouth in horror.  \"Which goes to show that the best of us must sometimes eat our words,\" Dumbledore went on, smiling. \"You will both receive Special Awards for Services to the School and -- let me see - yes, I think two hundred points apiece for Gryffindor.\"  Ron went as briglitly pink as Lockhart's valentine flowers and closed his mouth again.  \"But one of us seems to be keeping mightily quiet about his part in this dangerous adventure,\" Dumbledore added. \"Why so modest, Gilderoy?\"  Harry gave a start. He had completely forgotten about Lockhart. He turned and saw that Lockhart was standing in a corner of the room, still wearing his vague smile. When Dumbledore addressed him, Lockhart looked over his shoulder to see who he was talking to.  \"Professor Dumbledore,\" Ron said quickly, \"there was an accident down in the Chamber of Secrets. Professor Lockhart --\"  \"Am I a professor?\" said Lockhart in mild surprise. \"Goodness. I expect I was hopeless, was I?\"  \"He tried to do a Memory Charm and the wand backfired,\" Ron explained quietly to Dumbledore.  \"Dear me,\" said Dumbledore, shaking his head, his long silver mustache quivering. \"Impaled upon your own sword, Gilderoy!\"  \"Sword?\" said Lockhart dimly. \"Haven't got a sword. That boy has, though.\" He pointed at Harry. \"He'll lend you one.\"  \"Would you mind taking Professor Lockhart up to the infirmary, too?\" Dumbledore said to Ron. \"Id like a few more words with Harry .....  Lockhart ambled out. Ron cast a curious look back at Dumbledore and Harry as he closed the door.  Dumbledore crossed to one of the chairs by the fire.  \"Sit down, Harry,\" he said, and Harry sat, feeling unaccountably nervous.  \"First of all, Harry, I want to thank you,\" said Dumbledore, eyes twinkling again. \"You must have shown me real loyalty down in the Chamber."
}