{
  "id": "4fb6e7502b069a9bf70e7a0b0e7efcbcf5770b97",
  "text": " Would it were not so!   Would that this thing had come to me!'       'Comfort yourself!'  said Gandalf.  'In  no  case  would  Boromir  have  brought it to you. He is dead, and died well; may he sleep in peace! Yet you   deceive yourself. He would have stretched out  his hand to this  thing,  and  taking it he would have fallen. He would have kept it  for his own, and when   he returned you would not have known your son.'       The face of Denethor set  hard and cold. 'You found Boromir less apt to  your hand, did you not?' he said softly.  'But I who  was his father say that  he would have  brought it to me.  You are wise,  maybe, Mithrandir, yet with  all your subtleties you have not all wisdom.  Counsels may be found that are  neither the  webs  of wizards  nor the haste of fools. I have in this matter  more lore and wisdom than you deem. '       'What then is your wisdom?' said Gandalf.       'Enough to  perceive  that there are two follies to avoid. To  use this  thing is  perilous. At  this  hour, to send it  in  the hands  of a  witless  halfling into the land of the Enemy himself, as you  have done, and this son  of mine, that is madness.'       'And the Lord Denethor what would he have done?'       'Neither. But most surely  not  for any argument would he have set this  thing at a hazard beyond all bu t a  fool's hope, risking our utter ruin,  if  the  Enemy  should  recover what he lost. Nay, it  should  have  been  kept,  hidden, hidden  dark and deep. Not used, I say, unless  at the uttermost end  of need, but set beyond his grasp, save by a victory so  final that what then  befell would not trouble us, being dead.'       'You  think,  as  is your wont, my lord, of Gondor only,' said Gandalf.  'Yet there are other men and other lives, and time still to be.  And for me,  I pity even his slaves.'       'And wher e  will other  men look for help, if  Gondor  falls?' answered  Denethor. 'If I had this thing  now in  the deep  vaults of this citadel, we  should not then  shake with  dread  under this gloom, fearing the worst, and  our counsels would  be  undisturbed. If you do not trust  me  to endure  the   ####-test, you do not know me yet.'       'Nonetheless I do not trust you,' said Gandalf. 'Had I done so, I could  have sent this thing hither to  your keeping  and  spared myself and  others  much  anguish.  And now hearing  you speak  I trust you  less, no  more than  Boromir. Nay, stay your wrath! I do  not trust myself in this, and I refused  this thing, even as  a  freely given gift. You  are strong and can still  in  some matters govern  yourself, Denethor; yet if you had received this thing,   it  would  have  overthrown  you.  Were  it  buried  beneath  the  roots  of  Mindolluin, still it would burn  your mind away, as the darkness grows,  and  the yet worse things follow that soon shall come upon us.'       For a moment the eyes of Denethor glowed again as he faced Gandalf, and  Pippin felt  once  more the  strain between  their wills;  but now almost it  seemed  as if their glances were like blades  from eye to eye, flickering as  they  fenced. Pippin trembled fearing  some  dreadful  stroke.  But suddenly   Denethor relaxed and grew cold again. He shrugged his shoulders.        'If I had! If you had!' he said. 'Such words and ifs are  vain.  It has  gone into the Shadow, and only time will show  what  doom awaits it  and us.   The time will not  be long. In what is left, let all who fight  the Enemy in  their fashion be at one, and keep hope while they may, and after hope  still  the hardihood to die  free.' He turned to  Faramir.  'What think  you of the  garrison at Osgiliath?'       'It is not strong,'  said Faramir. 'I have sent the company of Ithilien  to strengthen it, as I have said.'       'Not enough, I deem,' said Denethor. 'It is  there that the first  blow  will fall. They will have need of some stout captain there.'       'There  and  elsewhere  in many places,' said Faramir, and sighed. 'Alas  for my brother, whom I too loved!' He rose. 'May I have your leave, father?'  And then he swayed and leaned upon his father's chair.       'You are weary, I see,' said Denethor.  'You  have ridden  fast and far,  and under shadows of evil in the air, I am told.'       'Let us not speak of that!' said Faramir.       'Then  we  will  not,'  said  Denethor. 'Go  now and  rest as you  may.  Tomorrow's need will be sterner.'       All now took leave of the Lor d of the City and went to rest  while they  still could.  Outside there  was a starless blackness as Gandalf with Pippin  beside  him bearing a small torch, made  his way to their  lodging. They did   not speak until they were behind closed  doors. Then  at  last  Pippin  took    ####-Gandalf's hand.       'Tell me,' he  said, 'is there any hope? For Frodo, I mean; or at least  mostly for Frodo.'       Gandalf put his hand on Pippin's head. 'There never was much  hope,' he  answered.  'Just a  fool's hope,  as  I have  been told. And when I heard of  Cirith Ungol------' He broke  off and  strode to  the window as if his  eyes  could pierce the night  in the East."
}