{
  "id": "501d6127a6b7d6f95281f87c5b58dadb26f7a982",
  "text": "    That’s unkind.  Sansa could feel her heart fluttering in her chest.  You’re frightening me. I want to go now.    No one could withstand him,  the Hound rasped.  That’s truth enough. No one could ever withstand Gregor. That boy today, his second joust, oh, that was a pretty bit of business. You saw that, did you? Fool boy, he had no business riding in this company. No money, no squire, no one to help him with that armor. That gorget wasn’t fastened proper. You think Gregor didn’t notice that? You think Ser Gregor’s lance rode up by chance, do you? Pretty little talking girl, you believe that, you’re empty-headed as a bird for true. Gregor’s lance goes where Gregor wants it to go. Look at me. Look at me!  Sandor Clegane put a huge hand under her chin and forced her face up. He squatted in front of her, and moved the torch close.  There’s a pretty for you. Take a good long stare. You know you want to. I’ve watched you turning away all the way down the kingsroad. Piss on that. Take your look.   His fingers held her jaw as hard as an iron trap. His eyes watched hers. Drunken eyes, sullen with anger. She had to look.  The right side of his face was gaunt, with sharp cheekbones and a grey eye beneath a heavy brow. His nose was large and hooked, his hair thin, dark. He wore it long and brushed it sideways, because no hair grew on the other side of that face.  The left side of his face was a ruin. His ear had been burned away; there was nothing left but a hole. His eye was still good, but all around it was a twisted mass of scar, slick black flesh hard as leather, pocked with craters and fissured by deep cracks that gleamed red and wet when he moved. Down by his jaw, you could see a hint of bone where the flesh had been seared away.  Sansa began to cry. He let go of her then, and snuffed out the torch in the dirt.  No pretty words for that, girl? No little compliment the septa taught you?  When there was no answer, he continued.  Most of them, they think it was some battle. A siege, a burning tower, an enemy with a torch. One fool asked if it was dragonsbreath.  His laugh was softer this time, but just as bitter.  I’ll tell you what it was, girl,  he said, a voice from the night, a shadow leaning so close now that she could smell the sour stench of wine on his breath.  I was younger than you, six, maybe seven. A woodcarver set up shop in the village under my father’s keep, and to buy favor he sent us gifts. The old man made marvelous toys. I don’t remember what I got, but it was Gregor’s gift I wanted. A wooden knight, all painted up, every joint pegged separate and fixed with strings, so you could make him fight. Gregor is five years older than me, the toy was nothing to him, he was already a squire, near six foot tall and muscled like an ox. So I took his knight, but there was no joy to it, I tell you. I was scared all the while, and true enough, he found me. There was a brazier in the room. Gregor never said a word, just picked me up under his arm and shoved the side of my face down in the burning coals and held me there while I screamed and screamed. You saw how strong he is. Even then, it took three grown men to drag him off me. The septons preach about the seven hells. What do they know? Only a man who’s been burned knows what hell is truly like.   My father told everyone my bedding had caught fire, and our maester gave me ointments. Ointments! Gregor got his ointments too. Four years later, they anointed him with the seven oils and he recited his knightly vows and Rhaegar Targaryen tapped him on the shoulder and said, ‘Arise, Ser Gregor.’   The rasping voice trailed off. He squatted silently before her, a hulking black shape shrouded in the night, hidden from her eyes. Sansa could hear his ragged breathing. She was sad for him, she realized. Somehow, the fear had gone away.  The silence went on and on, so long that she began to grow afraid once more, but she was afraid for him now, not for herself. She found his massive shoulder with her hand.  He was no true knight,  she whispered to him.  The Hound threw back his head and roared. Sansa stumbled back, away from him, but he caught her arm.  No,  he growled at her,  no, little bird, he was no true knight.   The rest of the way into the city, Sandor Clegane said not a word. He led her to where the carts were waiting, told a driver to take them back to the Red Keep, and climbed in after her. They rode in silence through the King’s Gate and up torchlit city streets. He opened the postern door and led her into the castle, his burned face twitching and his eyes brooding, and he was one step behind her as they climbed the tower stairs. He took her safe all the way to the corridor outside her bedchamber.   Thank you, my lord,  Sansa said meekly.  The Hound caught her by the arm and leaned close.  The things I told you tonight,  he said, his voice sounding even rougher than usual.  If you ever tell Joffrey… your sister, your father… any of them…    I won’t,  Sansa whispered."
}