{
  "id": "502d4b0c73b6d0bc71b35e2906cdfc127ba993ea",
  "text": " 'Won't you tell us some more, or sing us one of the  songs?'       'Yes, I will indeed,' said Treebeard, seeming pleased with the request.  'But  I  cannot  tell it properly, only in short; and then  we  must end our  talk: tomorrow we have councils to call, and work to do, and maybe a journey  to begin.'       'It is rather a strange and sad story,' he went on after a pause. 'When  the  world  was young, and the woods were  wide  and wild,  the Ents and the  Entwives  --  and  there  were  Entmaidens  then:  ah!   the  loveliness  of  Fimbrethil, of Wandlimb the  lightfooted, in the days of our  youth! -- they  walked  together  and they  housed together.  But our  hearts did not  go on  growing in the same way: the Ents gave their love to things that they met in  the world, and the Entwives gave their thought to other things, for the Ents  loved the great trees; and the wild woods, and the slopes of the high hills;  and they drank of the mountain-streams, and ate only such fruit as the trees   ####-let fall in their path;  and they learned of  the Elves and  spoke  with the  Trees. But  the Entwives gave their  minds to the  lesser trees, and to  the  meads in the sunshine  beyond the feet of the forests; and they saw the sloe  in the thicket, and  the wild apple and the cherry blossoming in spring, and  the green herbs in the waterlands in summer, and the seeding grasses in  the  autumn  fields. They  did  not desire  to  speak with these things; but they  wished  them to  hear and obey what was said to  them. The  Entwives ordered  them to  grow  according to  their wishes, and bear leaf and fruit to  their  liking; for the Entwives desired order, and plenty, and peace (by which they  meant that things should remain  where they had set them).  So the  Entwives  made gardens to live in. But  we Ents went on wandering, and we only came to  the gardens  now and again. Then when the  Darkness came  in  the North, the  Entwives crossed  the Great  River, and made new  gardens,  and  tilled  new  fields, and  we saw  them more seldom. After the Darkness was overthrown the  land of the Entwives blossomed richly,  and their  fields were full of corn.  Many men learned the crafts of  the  Entwives and honoured them greatly; but  we were only a legend to them, a secret in the heart of the forest. Yet here  we still are,  while  all  the gardens of the Entwives are  wasted: Men call  them the Brown Lands now.       'I remember it was  long ago --  in the time of  the war between Sauron  and the Men of the Sea -- desire came over me to see Fimbrethil  again. Very  fair she was still in my eyes, when I had last seen her, though  little like  the  Entmaiden  of old.  For  the Entwives were bent  and  browned  by their   labour; their hair  parched  by the sun to the hue  of ripe corn  and  their  cheeks  like  red apples.  Yet their eyes were still  the eyes  of  our  own  people.  We  crossed  over Anduin and came to  their  land:  but  we found a   desert: it was all  burned and uprooted, for war had passed over it. But the  Entwives were not there. Long  we called, and long we searched; and we asked  all  folk  that  we  met which way the Entwives had gone. Some said they had  never seen them;  and  some said that they had seen them walking  away west,  and some said east, and others south. But nowhere that we went could we find  them. Our sorrow was very great. Yet the wild  wood called, and we  returned  to it. For many years we used to go out every now and again and look for the  Entwives.  walking far and wide and  calling  them by their beautiful names.   But as time passed we went  more  seldom and  wandered less far. And now the  Entwives are only a memory for us, and our  beards  are  long and  grey. The  Elves made many songs concerning the Search of  the  Ents,  and some of  the   ####-songs passed into the tongues of  Men. But we made  no songs about it, being  content to chant  their beautiful names when we thought of the Entwives.  We  believe that we may meet again in  a time to come, and perhaps we shall find  somewhere  a  land where we can live together and both be content. But it is  foreboded  that tha t will only be  when we have  both  lost all  that we now  have.  And  it may  well be that that time is  drawing near at last. For  if  Sauron of old destroyed the gardens, the Enemy today seems likely  to wither  all the woods.        'There  was  an Elvish  song  that  spoke  of this, or at  least  so  I  understand  it. It used to be sung up and down the Great River. It was never  an Entish song, mark you: it would have been a very long song in Entish! But  we  know it by heart, and  hum it now and again. This  is how it runs in your  tongue:       ENT.       When Spring unfolds the beechen leaf, and sap is in the bough;       When light is on the wild-wood stream, and wind is on the brow;        When stride is long, and breath is deep, and keen the mountain -air,       Come back to me! Come back to me, and say my land is fair!         entwife."
}