{
  "id": "50c0e3d4affd1407309dc49eba4ce53e87262260",
  "text": "  Grenn was standing his ground as Jon had taught him, giving Albett more than he cared for, but Pyp was hard-pressed. Rast had two years and forty pounds on him. Jon stepped up behind him and rang the raper’s helm like a bell. As Rast went reeling, Pyp slid in under his guard, knocked him down, and leveled a blade at his throat. By then Jon had moved on. Facing two swords, Albett backed away.  I yield,  he shouted.  Ser Alliser Thorne surveyed the scene with disgust.  The mummer’s farce has gone on long enough for today.  He walked away. The session was at an end.  Dareon helped Halder to his feet. The quarryman’s son wrenched off his helm and threw it across the yard.  For an instant, I thought I finally had you, Snow.    For an instant, you did,  Jon replied. Under his mail and leather, his shoulder was throbbing. He sheathed his sword and tried to remove his helm, but when he raised his arm, the pain made him grit his teeth.   Let me,  a voice said. Thick-fingered hands unfastened helm from gorget and lifted it off gently.  Did he hurt you?    I’ve been bruised before.  He touched his shoulder and winced. The yard was emptying around them.  Blood matted the fat boy’s hair where Halder had split his helm asunder.  My name is Samwell Tarly, of Horn…  He stopped and licked his lips.  I mean, I was of Horn Hill, until I… left. I’ve come to take the black. My father is Lord Randyll, a bannerman to the Tyrells of Highgarden. I used to be his heir, only…  His voice trailed off.   I’m Jon Snow, Ned Stark’s bastard, of Winterfell.   Samwell Tarly nodded.  I… if you want, you can call me Sam. My mother calls me Sam.    You can call him Lord Snow,  Pyp said as he came up to join them.  You don’t want to know what his mother calls him.    These two are Grenn and Pypar,  Jon said.   Grenn’s the ugly one,  Pyp said.  Grenn scowled.  You’re uglier than me. At least I don’t have ears like a bat.    My thanks to all of you,  the fat boy said gravely.   Why didn’t you get up and fight?  Grenn demanded.   I wanted to, truly. I just… I couldn’t. I didn’t want him to hit me anymore.  He looked at the ground.  I… I fear I’m a coward. My lord father always said so.   Grenn looked thunderstruck. Even Pyp had no words to say to that, and Pyp had words for everything. What sort of man would proclaim himself a coward?  Samwell Tarly must have read their thoughts on their faces. His eyes met Jon’s and darted away, quick as frightened animals.  I… I’m sorry,  he said.  I don’t mean to… to be like I am.  He walked heavily toward the armory.  Jon called after him.  You were hurt,  he said.  Tomorrow you’ll do better.   Sam looked mournfully back over one shoulder.  No I won’t,  he said, blinking back tears.  I never do better.   When he was gone, Grenn frowned.  Nobody likes cravens,  he said uncomfortably.  I wish we hadn’t helped him. What if they think we’re craven too?    You’re too stupid to be craven,  Pyp told him.   I am not,  Grenn said.   Yes you are. If a bear attacked you in the woods, you’d be too stupid to run away.    I would not,  Grenn insisted.  I’d run away faster than you.  He stopped suddenly, scowling when he saw Pyp’s grin and realized what he’d just said. His thick neck flushed a dark red. Jon left them there arguing as he returned to the armory, hung up his sword, and stripped off his battered armor.  Life at Castle Black followed certain patterns; the mornings were for swordplay, the afternoons for work. The black brothers set new recruits to many different tasks, to learn where their skills lay. Jon cherished the rare afternoons when he was sent out with Ghost ranging at his side to bring back game for the Lord Commander’s table, but for every day spent hunting, he gave a dozen to Donal Noye in the armory, spinning the whetstone while the one-armed smith sharpened axes grown dull from use, or pumping the bellows as Noye hammered out a new sword. Other times he ran messages, stood at guard, mucked out stables, fletched arrows, assisted Maester Aemon with his birds or Bowen Marsh with his counts and inventories.  That afternoon, the watch commander sent him to the winch cage with four barrels of fresh-crushed stone, to scatter gravel over the icy footpaths atop the Wall. It was lonely and boring work, even with Ghost along for company, but Jon found he did not mind. On a clear day you could see half the world from the top of the Wall, and the air was always cold and bracing. He could think here, and he found himself thinking of Samwell Tarly… and, oddly, of Tyrion Lannister. He wondered what Tyrion would have made of the fat boy. Most men would rather deny a hard truth than face it, the dwarf had told him, grinning. The world was full of cravens who pretended to be heroes; it took a queer sort of courage to admit to cowardice as Samwell Tarly had.  His sore shoulder made the work go slowly. It was late afternoon before Jon finished graveling the paths. He lingered on high to watch the sun go down, turning the western sky the color of blood."
}