{
  "id": "50d0e0ba349a1f43ca30047904bd8df289f5bd55",
  "text": " He’s drunk, Arya realized with dismay. He drank too much too fast, with no food in his belly. And the Tickler was sliding around the wall to get behind him. She grabbed the second wine cup and flung it at him, but he was quicker than the squire had been and ducked his head in time. The look he gave her then was cold with promise. Is there gold hidden in the village? she could hear him ask. The stupid squire was clutching the edge of a table and pulling himself to his knees. Arya could taste the beginnings of panic in the back of her throat. Fear cuts deeper than swords. Fears cuts deeper…  Sandor gave a grunt of pain. The burned side of his face ran red from temple to cheek, and the stub of his ear was gone. That seemed to make him angry. He drove back Polliver with a furious attack, hammering at him with the old nicked longsword he had swapped for in the hills. The bearded man gave way, but none of the cuts so much as touched him. And then the Tickler leapt over a bench quick as a snake, and slashed at the back of the Hound’s neck with the edge of his short sword.  They’re killing him. Arya had no more cups, but there was something better to throw. She drew the dagger they’d robbed off the dying archer and tried to fling it at the Tickler the way he’d done. It wasn’t the same as throwing a rock or a crabapple, though. The knife wobbled, and hit him in the arm hilt first. He never even felt it. He was too intent on Clegane.  As he stabbed, Clegane twisted violently aside, winning himself half a heartbeat’s respite. Blood ran down his face and from the gash in his neck. Both of the Mountain’s men came after him hard, Polliver hacking at his head and shoulders while the Tickler darted in to stab at back and belly. The heavy stone flagon was still on the table. Arya grabbed it with two hands, but as she lifted it someone grabbed her arm. The flagon slipped from her fingers and crashed to the floor. Wrenched around, she found herself nose to nose with the squire. You stupid, you forgot all about him. His big white pimple had burst, she saw.   Are you the puppy’s puppy?  He had his sword in his right hand and her arm in his left, but her own hands were free, so she jerked his knife from its sheath and sheathed it again in his belly, twisting. He wasn’t wearing mail or even boiled leather, so it went right in, the same way Needle had when she killed the stableboy at King’s Landing. The squire’s eyes got big and he let go of her arm. Arya spun to the door and wrenched the Tickler’s knife from the wall.  Polliver and the Tickler had driven the Hound into a corner behind a bench, and one of them had given him an ugly red gash on his upper thigh to go with his other wounds. Sandor was leaning against the wall, bleeding and breathing noisily. He looked as though he could barely stand, let alone fight.  Throw down the sword, and we’ll take you back to Harrenhal,  Polliver told him.   So Gregor can finish me himself?   The Tickler said,  Maybe he’ll give you to me.    If you want me, come get me.  Sandor pushed away from the wall and stood in a half-crouch behind the bench, his sword held across his body.   You think we won’t?  said Polliver.  You’re drunk.    Might be,  said the Hound,  but you’re dead.  His foot lashed out and caught the bench, driving it hard into Polliver’s shins. Somehow the bearded man kept his feet, but the Hound ducked under his wild slash and brought his own sword up in a vicious backhand cut. Blood spattered on the ceiling and walls. The blade caught in the middle of Polliver’s face, and when the Hound wrenched it loose half his head came with it.  The Tickler backed away. Arya could smell his fear. The shortsword in his hand suddenly seemed almost a toy against the long blade the Hound was holding, and he wasn’t armored either. He moved swiftly, light on his feet, never taking his eyes off Sandor Clegane. It was the easiest thing in the world for Arya to step up behind him and stab him.   Is there gold hidden in the village?  she shouted as she drove the blade up through his back.  Is there silver? Gems?  She stabbed twice more.  Is there food? Where is Lord Beric?  She was on top of him by then, still stabbing.  Where did he go? How many men were with him? How many knights? How many bowmen? How many, how many, how many, how many, how many, how many? Is there gold in the village?   Her hands were red and sticky when Sandor dragged her off him.  Enough,  was all he said. He was bleeding like a butchered pig himself, and dragging one leg when he walked.   There’s one more,  Arya reminded him.  The squire had pulled the knife out of his belly and was trying to stop the blood with his hands. When the Hound yanked him upright, he screamed and started to blubber like a baby.  Mercy,  he wept,  please. Don’t kill me. Mother have mercy.    Do I look like your bloody mother?  The Hound looked like nothing human.  You killed this one too,  he told Arya.  Pricked him in his bowels, that’s the end of him."
}