{
  "id": "50d8f32719b70604f947259739b633cf36887a40",
  "text": "    They said no.  The wine tasted of pomegranates and hot summer days.  They said it with great courtesy, to be sure, but under all the lovely words, it was still no.    Did you flatter them?    Shamelessly.    Did you weep?    The blood of the dragon does not weep,  she said testily.  Xaro sighed.  You ought to have wept.  The Qartheen wept often and easily; it was considered a mark of the civilized man.  The men we bought, what did they say?    Mathos said nothing. Wendello praised the way I spoke. The Exquisite refused me with the rest, but he wept afterward.    Alas, that Qartheen should be so faithless.  Xaro was not himself of the Pureborn, but he had told her whom to bribe and how much to offer.  Weep, weep, for the treachery of men.   Dany would sooner have wept for her gold. The bribes she’d tendered to Mathos Mallarawan, Wendello Qar Deeth, and Egon Emeros the Exquisite might have bought her a ship, or hired a score of sellswords.  Suppose I sent Ser Jorah to demand the return of my gifts?  she asked.   Suppose a Sorrowful Man came to my palace one night and killed you as you slept,  said Xaro. The Sorrowful Men were an ancient sacred guild of assassins, so named because they always whispered,  I am so sorry,  to their victims before they killed them. The Qartheen were nothing if not polite.  It is wisely said that it is easier to milk the Stone Cow of Faros than to wring gold from the Pureborn.   Dany did not know where Faros was, but it seemed to her that Qarth was full of stone cows. The merchant princes, grown vastly rich off the trade between the seas, were divided into three jealous factions: the Ancient Guild of Spicers, the Tourmaline Brotherhood, and the Thirteen, to which Xaro belonged. Each vied with the others for dominance, and all three contended endlessly with the Pureborn. And brooding over all were the warlocks, with their blue lips and dread powers, seldom seen but much feared.  She would have been lost without Xaro. The gold that she had squandered to open the doors of the Hall of a Thousand Thrones was largely a product of the merchant’s generosity and quick wits. As the rumor of living dragons had spread through the east, ever more seekers had come to learn if the tale was true—and Xaro Xhoan Daxos saw to it that the great and the humble alike offered some token to the Mother of Dragons.  The trickle he started soon swelled to a flood. Trader captains brought lace from Myr, chests of saffron from Yi Ti, amber and dragonglass out of Asshai. Merchants offered bags of coin, silversmiths rings and chains. Pipers piped for her, tumblers tumbled, and jugglers juggled, while dyers draped her in colors she had never known existed. A pair of Jogos Nhai presented her with one of their striped zorses, black and white and fierce. A widow brought the dried corpse of her husband, covered with a crust of silvered leaves; such remnants were believed to have great power, especially if the deceased had been a sorcerer, as this one had. And the Tourmaline Brotherhood pressed on her a crown wrought in the shape of a three-headed dragon; the coils were yellow gold, the wings silver, the heads carved from jade, ivory, and onyx.  The crown was the only offering she’d kept. The rest she sold, to gather the wealth she had wasted on the Pureborn. Xaro would have sold the crown too—the Thirteen would see that she had a much finer one, he swore—but Dany forbade it.  Viserys sold my mother’s crown, and men called him a beggar. I shall keep this one, so men will call me a queen.  And so she did, though the weight of it made her neck ache.  Yet even crowned, I am a beggar still, Dany thought. I have become the most splendid beggar in the world, but a beggar all the same. She hated it, as her brother must have. All those years of running from city to city one step ahead of the Usurper’s knives, pleading for help from archons and princes and magisters, buying our food with flattery. He must have known how they mocked him. Small wonder he turned so angry and bitter. In the end it had driven him mad. It will do the same to me if I let it. Part of her would have liked nothing more than to lead her people back to Vaes Tolorro, and make the dead city bloom. No, that is defeat. I have something Viserys never had. I have the dragons. The dragons are all the difference.  She stroked Rhaegal. The green dragon closed his teeth around the meat of her hand and nipped hard. Outside, the great city murmured and thrummed and seethed, all its myriad voices blending into one low sound like the surge of the sea.  Make way, you Milk Men, make way for the Mother of Dragons,  Jhogo cried, and the Qartheen moved aside, though perhaps the oxen had more to do with that than his voice. Through the swaying draperies, Dany caught glimpses of him astride his grey stallion. From time to time he gave one of the oxen a flick with the silver-handled whip she had given him. Aggo guarded on her other side, while Rakharo rode behind the procession, watching the faces in the crowd for any sign of danger."
}