{
  "id": "514cfb35b781ae30c84245abc480798e31481431",
  "text": "  Outside, wagons and riders were still pouring through the castle gates, and the yard was a chaos of mud and horseflesh and shouting men. The king had not yet arrived, he was told. Since the ugliness on the Trident, the Starks and their household had ridden well ahead of the main column, the better to separate themselves from the Lannisters and the growing tension. Robert had hardly been seen; the talk was he was traveling in the huge wheelhouse, drunk as often as not. If so, he might be hours behind, but he would still be here too soon for Ned’s liking. He had only to look at Sansa’s face to feel the rage twisting inside him once again. The last fortnight of their journey had been a misery. Sansa blamed Arya and told her that it should have been Nymeria who died. And Arya was lost after she heard what had happened to her butcher’s boy. Sansa cried herself to sleep, Arya brooded silently all day long, and Eddard Stark dreamed of a frozen hell reserved for the Starks of Winterfell.  He crossed the outer yard, passed under a portcullis into the inner bailey, and was walking toward what he thought was the Tower of the Hand when Littlefinger appeared in front of him.  You’re going the wrong way, Stark. Come with me.   Hesitantly, Ned followed. Littlefinger led him into a tower, down a stair, across a small sunken courtyard, and along a deserted corridor where empty suits of armor stood sentinel along the walls. They were relics of the Targaryens, black steel with dragon scales cresting their helms, now dusty and forgotten.  This is not the way to my chambers,  Ned said.   Did I say it was? I’m leading you to the dungeons to slit your throat and seal your corpse up behind a wall,  Littlefinger replied, his voice dripping with sarcasm.  We have no time for this, Stark. Your wife awaits.    What game are you playing, Littlefinger? Catelyn is at Winterfell, hundreds of leagues from here.    Oh?  Littlefinger’s grey-green eyes glittered with amusement.  Then it appears someone has managed an astonishing impersonation. For the last time, come. Or don’t come, and I’ll keep her for myself.  He hurried down the steps.  Ned followed him warily, wondering if this day would ever end. He had no taste for these intrigues, but he was beginning to realize that they were meat and mead to a man like Littlefinger.  At the foot of the steps was a heavy door of oak and iron. Petyr Baelish lifted the crossbar and gestured Ned through. They stepped out into the ruddy glow of dusk, on a rocky bluff high above the river.  We’re outside the castle,  Ned said.   You are a hard man to fool, Stark,  Littlefinger said with a smirk.  Was it the sun that gave it away, or the sky? Follow me. There are niches cut in the rock. Try not to fall to your death, Catelyn would never understand.  With that, he was over the side of the cliff, descending as quick as a monkey.  Ned studied the rocky face of the bluff for a moment, then followed more slowly. The niches were there, as Littlefinger had promised, shallow cuts that would be invisible from below, unless you knew just where to look for them. The river was a long, dizzying distance below. Ned kept his face pressed to the rock and tried not to look down any more often than he had to.  When at last he reached the bottom, a narrow, muddy trail along the water’s edge, Littlefinger was lazing against a rock and eating an apple. He was almost down to the core.  You are growing old and slow, Stark,  he said, flipping the apple casually into the rushing water.  No matter, we ride the rest of the way.  He had two horses waiting. Ned mounted up and trotted behind him, down the trail and into the city.  Finally Baelish drew rein in front of a ramshackle building, three stories, timbered, its windows bright with lamplight in the gathering dusk. The sounds of music and raucous laughter drifted out and floated over the water. Beside the door swung an ornate oil lamp on a heavy chain, with a globe of leaded red glass.  Ned Stark dismounted in a fury.  A brothel,  he said as he seized Littlefinger by the shoulder and spun him around.  You’ve brought me all this way to take me to a brothel.    Your wife is inside,  Littlefinger said.  It was the final insult.  Brandon was too kind to you,  Ned said as he slammed the small man back against a wall and shoved his dagger up under the little pointed chin beard.   My lord, no,  an urgent voice called out.  He speaks the truth.  There were footsteps behind him.  Ned spun, knife in hand, as an old white-haired man hurried toward them. He was dressed in brown roughspun, and the soft flesh under his chin wobbled as he ran.  This is no business of yours,  Ned began; then, suddenly, the recognition came. He lowered the dagger, astonished.  Ser Rodrik?   Rodrik Cassel nodded.  Your lady awaits you upstairs.   Ned was lost.  Catelyn is truly here? This is not some strange jape of Littlefinger’s?  He sheathed his blade.   Would that it were, Stark,  Littlefinger said.  Follow me, and try to look a shade more lecherous and a shade less like the King’s Hand."
}