{
  "id": "5199f23cadf15393ec5561c5e4afc69236ff5ad1",
  "text": "  Two lean dark shapes emerged from behind the broken tower, padding slowly through the rubble. Rickon gave a happy shout of  Shaggy!  and the black direwolf came bounding toward him. Summer advanced more slowly, rubbed his head up against Bran’s arm, and licked his face.   We should go,  said Jojen.  So much death will bring other wolves besides Summer and Shaggydog, and not all on four feet.    Aye, soon enough,  Osha agreed,  but we need food, and there may be some survived this, Stay together. Meera, keep your shield up and guard our backs.   It took the rest of the morning to make a slow circuit of the castle. The great granite walls remained, blackened here and there by fire but otherwise untouched. But within, all was death and destruction. The doors of the Great Hall were charred and smoldering, and inside the rafters had given way and the whole roof had crashed down onto the floor. The green and yellow panes of the glass gardens were all in shards, the trees and fruits and flowers torn up or left exposed to die. Of the stables, made of wood and thatch, nothing remained but ashes, embers, and dead horses. Bran thought of his Dancer, and wanted to weep. There was a shallow steaming lake beneath the Library Tower, and hot water gushing from a crack in its side. The bridge between the Bell Tower and the rookery had collapsed into the yard below, and Maester Luwin’s turret was gone. They saw a dull red glow shining up through the narrow cellar windows beneath the Great Keep, and a second fire still burning in one of the storehouses.  Osha called softly through the blowing smoke as they went, but no one answered. They saw one dog worrying at a corpse, but he ran when he caught the scents of the direwolves; the rest had been slain in the kennels. The maester’s ravens were paying court to some of the corpses, while the crows from the broken tower attended others. Bran recognized Poxy Tym, even though someone had taken an axe to his face. One charred corpse, outside the ashen shell of Mother’s sept, sat with his arms drawn up and his hands balled into hard black fists, as if to punch anyone who dared approach him.  If the gods are good,  Osha said in a low angry voice,  the Others will take them that did this work.    It was Theon,  Bran said blackly.   No. Look.  She pointed across the yard with her spear.  That’s one of his ironmen. And there. And that’s Greyjoy’s warhorse, see? The black one with the arrows in him.  She moved among the dead, frowning.  And here’s Black Lorren.  He had been hacked and cut so badly that his beard looked a reddish-brown now.  Took a few with him, he did.  Osha turned over one of the other corpses with her foot.  There’s a badge. A little man, all red.    The flayed man of the Dreadfort,  said Bran.  Summer howled, and darted away.   The godswood.  Meera Reed ran after the direwolf, her shield and frog spear to hand. The rest of them trailed after, threading their way through smoke and fallen stones. The air was sweeter under the trees. A few pines along the edge of the wood had been scorched, but deeper in the damp soil and green wood had defeated the flames.  There is a power in living wood,  said Jojen Reed, almost as if he knew what Bran was thinking,  a power strong as fire.   On the edge of the black pool, beneath the shelter of the heart tree, Maester Luwin lay on his belly in the dirt. A trail of blood twisted back through damp leaves where he had crawled. Summer stood over him, and Bran thought he was dead at first, but when Meera touched his throat, the maester moaned.  Hodor?  Hodor said mournfully.  Hodor?   Gently, they eased Luwin onto his back. He had grey eyes and grey hair, and once his robes had been grey as well, but they were darker now where the blood had soaked through.  Bran,  he said softly when he saw him sitting tall on Hodor’s back.  And Rickon too.  He smiled.  The gods are good. I knew…    Knew?  said Bran uncertainly.   The legs, I could tell… the clothes fit, but the muscles in his legs… poor lad…  He coughed, and blood came up from inside him.  You vanished… in the woods… how, though?    We never went,  said Bran.  Well, only to the edge, and then doubled back. I sent the wolves on to make a trail, but we hid in Father’s tomb.    The crypts.  Luwin chuckled, a froth of blood on his lips. When the maester tried to move, he gave a sharp gasp of pain.  Tears filled Bran’s eyes. When a man was hurt you took him to the maester, but what could you do when your maester was hurt?   We’ll need to make a litter to carry him,  said Osha.   No use,  said Luwin.  I’m dying, woman.    You can’t,  said Rickon angrily.  No you can’t.  Beside him, Shaggydog bared his teeth and growled.  The maester smiled.  Hush now, child, I’m much older than you. I can… die as I please.    Hodor, down,  said Bran. Hodor went to his knees beside the maester.   Listen,  Luwin said to Osha,  the princes… Robb’s heirs. Not… not together… do you hear?   The wildling woman leaned on her spear."
}