{
  "id": "51c8bcbb3ff3ba5a1819f848971a7faa631ecc8f",
  "text": " Harry noticed that they seemed to be straining to escape the straps holding them inside the box.  \"Stand back,\" Wood warned Harry. He bent down and freed one of the Bludgers.  At once, the black ball rose high in the air and then pelted straight at Harry's face. Harry swung at it with the bat to stop it from breaking his nose, and sent it zigzagging away into the air -- it zoomed around their heads and then shot at Wood, who dived on top of it and managed to pin it to the ground.  \"See?\" Wood panted, forcing the struggling Bludger back into the crate and strapping it down safely. \"The Bludgers rocket around, trying to knock players off their brooms. That's why you have two Beaters on each team -- the Weasley twins are ours -- it's their job to protect their side from the Bludgers and try and knock them toward the other team. So -- think you've got all that?\"  \"Three Chasers try and score with the Quaffle; the Keeper guards the goal posts; the Beaters keep the Bludgers away from their team,\" Harry reeled off.  \"Very good,\" said Wood.  \"Er -- have the Bludgers ever killed anyone?\" Harry asked, hoping he sounded offhand.  \"Never at Hogwarts. We've had a couple of broken jaws but nothing worse than that. Now, the last member of the team is the  Seeker. That's you. And you don't have to worry about the Quaffle or the Bludgers unless they crack my head open.\"  \"Don't worry, the Weasleys are more than a match for the Bludgers -- I mean, they're like a pair of human Bludgers themselves.\"  Wood reached into the crate and took out the fourth and last ball. Compared with the Quaffle and the Bludgers, it was tiny, about the size of a large walnut. It was bright gold and had little fluttering silver wings.  \"This,\" said Wood, \"is the Golden Snitch, and it's the most important ball of the lot. It's very hard to catch because it's so fast and difficult to see. It's the Seeker's job to catch it. You've got to weave in and out of the Chasers, Beaters, Bludgers, and Quaffle to get it before the other team's Seeker, because whichever Seeker catches the Snitch wins his team an extra hundred and fifty points, so they  nearly always win. That's why Seekers get fouled so much. A game of Quidditch only ends when the Snitch is caught, so it can go on for ages -- I think the record is three months, they had to keep bringing on substitutes so the players could get some sleep. \"Well, that's it -- any questions?\"  Harry shook his head. He understood what he had to do all right, it was doing it that was going to be the problem.  \"We won't practice with the Snitch yet,\" said Wood, carefully shutting it back inside the crate, \"it's too dark, we might lose it. Let's try you out with a few of these.\"  He pulled a bag of ordinary golf balls out of his pocket and a few minutes later, he and Harry were up in the air, Wood throwing the golf balls as hard as he could in every direction for Harry to catch.  Harry didn't miss a single one, and Wood was delighted. After half an hour, night had really fallen and they couldn't carry on.  \"That Quidditch cup'll have our name on it this year,\" said Wood happily as they trudged back up to the castle. \"I wouldn't be surprised if you turn out better than Charlie Weasley, and he could have played for England if he hadn't gone off chasing dragons.\"  Perhaps it was because he was now so busy, what with Quidditch practice three evenings a week on top of all his homework, but Harry could hardly believe it when he realized that he'd already been at Hogwarts two months. The castle felt more like home than Privet Drive ever had. His lessons, too, were becoming more and more interesting now that they had mastered the basics.  On Halloween morning they woke to the delicious smell of baking pumpkin wafting through the corridors. Even better, Professor Flitwick announced in Charms that he thought they were ready to start making objects fly, something they had all been dying to try since they'd seen him make Neville's toad zoom around the classroom. Professor Flitwick put the class into pairs to practice. Harry's partner was Seamus Finnigan (which was a relief, because Neville had been trying to catch his eye). Ron, however, was to be working with Hermione Granger. It was hard to tell whether Ron or Hermione was angrier about this. She hadn't spoken to either of them since the day Harry's broomstick had arrived.  \"Now, don't forget that nice wrist movement we've been practicing!\" squeaked Professor Flitwick, perched on top of his pile of books as usual. \"Swish and flick, remember, swish and flick. And saying the magic words properly is very important, too -- never forget Wizard Baruffio, who said 's' instead of 'f' and found himself on the floor with a buffalo on his chest.\"  It was very difficult. Harry and Seamus swished and flicked, but the feather they were supposed to be sending skyward just lay on the desktop. Seamus got so impatient that he prodded it with his wand and set fire to it -- Harry had to put it out with his hat."
}