{
  "id": "521b5e24381ed978cce2cb0fc5c7982d95e060bb",
  "text": " They have narrow windows set high in the walls. The second level has the smaller cells where highborn captives are held. They have no windows, but torches in the halls cast light through the bars. On the third level the cells are smaller and the doors are wood. The black cells, men call them. That was where you were kept, and Eddard Stark before you. But there is a level lower still. Once a man is taken down to the fourth level, he never sees the sun again, nor hears a human voice, nor breathes a breath free of agonizing pain. Maegor had the cells on the fourth level built for torment.  They had reached the bottom of the steps. An unlighted door opened before them.  This is the fourth level. Give me your hand, my lord. It is safer to walk in darkness here. There are things you would not wish to see.   Tyrion hung back a moment. Varys had already betrayed him once. Who knew what game the eunuch was playing? And what better place to murder a man than down in the darkness, in a place that no one knew existed? His body might never be found.  On the other hand, what choice did he have? To go back up the steps and walk out the main gate? No, that would not serve.  Jaime would not be afraid, he thought, before he remembered what Jaime had done to him. He took the eunuch by the hand and let himself be led through the black, following the soft scrape of leather on stone. Varys walked quickly, from time to time whispering,  Careful, there are three steps ahead,  or,  The tunnel slopes downward here, my lord.  I arrived here a King’s Hand, riding through the gates at the head of my own sworn men, Tyrion reflected, and I leave like a rat scuttling through the dark, holding hands with a spider.  A light appeared ahead of them, too dim to be daylight, and grew as they hurried toward it. After a while he could see it was an arched doorway, closed off by another iron gate. Varys produced a key. They stepped through into a small round chamber. Five other doors opened off the room, each barred in iron. There was an opening in the ceiling as well, and a series of rungs set in the wall below, leading upward. An ornate brazier stood to one side, fashioned in the shape of a dragon’s head. The coals in the beast’s yawning mouth had burnt down to embers, but they still glowed with a sullen orange light. Dim as it was, the light was welcome after the blackness of the tunnel.  The juncture was otherwise empty, but on the floor was a mosaic of a three-headed dragon wrought in red and black tiles. Something niggled at Tyrion for a moment. Then it came to him. This is the place Shae told me of, when Varys first led her to my bed.  We are below the Tower of the Hand.    Yes.  Frozen hinges screamed in protest as Varys pulled open a long-closed door. Flakes of rust drifted to the floor.  This will take us out to the river.   Tyrion walked slowly to the ladder, ran his hand across the lowest rung.  This will take me up to my bedchamber.    Your lord father’s bedchamber now.   He looked up the shaft.  How far must I climb?    My lord, you are too weak for such follies, and there is besides no time. We must go.    I have business above. How far?    Two hundred and thirty rungs, but whatever you intend—    Two hundred and thirty rungs, and then?    The tunnel to the left, but hear me—    How far along to the bedchamber?  Tyrion lifted a foot to the lowest rung of the ladder.   No more than sixty feet. Keep one hand on the wall as you go. You will feel the doors. The bedchamber is the third.  He sighed.  This is folly, my lord. Your brother has given you your life back. Would you cast it away, and mine with it?    Varys, the only thing I value less than my life just now is yours. Wait for me here.  He turned his back on the eunuch and began to climb, counting silently as he went.  Rung by rung, he ascended into darkness. At first he could see the dim outline of each rung as he grasped it, and the rough grey texture of the stone behind, but as he climbed the black grew thicker. Thirteen fourteen fifteen sixteen. By thirty, his arms trembled with the strain of pulling. He paused a moment to catch his breath and glanced down. A circle of faint light shone far below, half obscured by his own feet. Tyrion resumed his ascent. Thirty-nine forty forty-one. By fifty, his legs burned. The ladder was endless, numbing. Sixty-eight sixty-nine seventy. By eighty, his back was a dull agony. Yet still he climbed. He could not have said why. One thirteen one fourteen one fifteen.  At two hundred and thirty, the shaft was black as pitch, but he could feel the warm air flowing from the tunnel to his left, like the breath of some great beast. He poked about awkwardly with a foot and edged off the ladder. The tunnel was even more cramped than the shaft. Any man of normal size would have had to crawl on hands and knees, but Tyrion was short enough to walk upright. At last, a place made for dwarfs. His boots scuffed softly against the stone. He walked slowly, counting steps, feeling for gaps in the walls."
}