{
  "id": "523e835d5194a51d8d01c37eb675ac932b5d88ba",
  "text": " With her help, he vanquished his rivals to rule all Dorne. The Rhoynar influence remains strong. Thus Dornish rulers style themselves  Prince  rather than  King.  Under Dornish law, lands and titles pass to the eldest child, not the eldest male. Dorne, alone of the Seven Kingdoms, was never conquered by Aegon the Dragon. It was not permanently joined to the realm until two hundred years later, and then by marriage and treaty, not the sword. Peaceable King Daeron II succeeded where the warriors had failed by wedding the Dornish princess Myriah and giving his own sister in marriage to the reigning Prince of Dorne. The Martell banner is a red sun pierced by a golden spear. Their words are Unbowed, Unbent, Unbroken.    DORAN NYMEROS MARTELL, Lord of Sunspear, Prince of Dorne,  —his wife, MELLARIO, of the Free City of Norvos,  —their children:    —PRINCESS ARIANNE, their eldest daughter, heir to Sunspear,  —PRINCE QUENTYN, their eldest son,  —PRINCE TRYSTANE, their younger son,    —his siblings:    —his sister, {PRINCESS ELIA}, wed to Prince Rhaegar Targaryen, slain during the Sack of King’s Landing,  —their children:    —{PRINCESS RHAENYS}, a young girl, slain during the Sack of King’s Landing,  —{PRINCE AEGON}, a babe, slain during the Sack of King’s Landing,      —his brother, PRINCE OBERYN, the Red Viper,    —his household:    —AREO HOTAH, a Norvashi sellsword, captain of guards,  —MAESTER CALEOTTE, counselor, healer, and tutor,    —his knights and lords bannermen:    —EDRIC DAYNE, Lord of Starfall,      The principal houses sworn to Sunspear include Jordayne, Santagar, Allyrion, Toland, Yronwood, Wyl, Fowler, and Dayne.      THE OLD DYNASTY  HOUSE TARGARYEN  The Targaryens are the blood of the dragon, descended from the high lords of the ancient Freehold of Valyria, their heritage proclaimed in a striking (some say inhuman) beauty, with lilac or indigo or violet eyes and hair of silver-gold or platinum white.    Aegon the Dragon’s ancestors escaped the Doom of Valyria and the chaos and slaughter that followed to settle on Dragonstone, a rocky island in the narrow sea. It was from there that Aegon and his sisters sailed to conquer the Seven Kingdoms. To preserve the blood royal and keep it pure, House Targaryen has often followed the Valyrian custom of wedding brother to sister. Aegon himself took both his sisters to wife, and fathered sons on each. The Targaryen banner is a three-headed dragon, red on black, the three heads representing Aegon and his sisters. The Targaryen words are Fire and Blood.    THE TARGARYEN SUCCESSION  Dated By Years After Aegon’s Landing    1-37 Aegon I Aegon the Conqueror, Aegon the Dragon,    37-42 Aenys I Son of Aegon and Rhaenys,    42-48 Maegor I Maegor the Cruel, son of Aegon and Visenya,    48-103 Jaehaerys I The Old King, the Conciliator, Aenys’ son,    103-129 Viserys I Grandson to Jaehaerys,    129-131 Aegon II Eldest son of Viserys,  [Aegon II’s ascent was disputed by his sister Rhaenyra, a year his elder. Both perished in the war between them, called by singers the Dance of the Dragons.]    131-157 Aegon III The Dragonbane, Rhaenyra’s son,  [The last of the Targaryen dragons died during the reign of Aegon III.]    157-161 Daeron I The Young Dragon, the Boy King, eldest son of Aegon III,  [Daeron conquered Dorne, but was unable to hold it, and died young.]    161-171 Baelor I The Beloved, the Blessed, septon and king, second son of Aegon III,    171-172 Viserys II Fourth son of Aegon III,    172-184 Aegon IV The Unworthy, eldest son of Viserys,  [His younger brother, Prince Aemon the Dragonknight, was champion and some say lover to Queen Naerys.]    184-209 Daeron II Queen Naerys’ son, by Aegon or Aemon,  [Daeron brought Dorne into the realm by wedding the Dornish princess Myriah.]    209-221 Aerys I Second son to Daeron II (left no issue),    221-233 Maekar I Fourth son of Daeron II,    233-259 Aegon V The Unlikely, Maekar’s fourth son,    259-262 Jaehaerys II Second son of Aegon the Unlikely,    262-283 Aerys II The Mad King, only son to Jaehaerys,  Therein the line of the dragon kings ended, when Aerys II was dethroned and killed, along with his heir, the crown prince Rhaegar Targaryen, slain by Robert Baratheon on the Trident.      THE LAST TARGARYENS    {KING AERYS TARGARYEN}, the Second of His Name, slain by Jaime Lannister during the Sack of King’s Landing,  —His sister and wife, {QUEEN RHAELLA} of House Targaryen, died in childbed on Dragonstone,  —Their children:  —{PRINCE RHAEGAR}, heir to the Iron Throne, slain by Robert Baratheon on the Trident,    —His wife, {PRINCESS ELIA} of House Martell, slain during the Sack of King’s Landing,  —Their children:    —{PRINCESS RHAENYS}, a young girl, slain during the sack of King’s Landing,  —{PRINCE AEGON}, a babe, slain during the sack of King’s Landing,      —PRINCE VISERYS, styling himself Viserys, the Third of His Name, Lord of the Seven Kingdoms, called the Beggar King,  —PRINCESS DAENERYS, called Daenerys Stormborn, a maid of thirteen years."
}