{
  "id": "524c4c4c975b477373a499102ee0c3a083ac8d41",
  "text": " He's a danger to himself\"  Lockhart peered good-naturedly up at them all.  \"Hello,\" he said. \"Odd sort of place, this, isn't it? Do you live here?\"  \"No,\" said Ron, raising his eyebrows at Harry.  Harry bent down and looked up the long, dark pipe.  \"Have you thought how we're going to get back up this?\" he said to Ron.  *324*  Ron shook his head, but Fawkes the phoenix had swooped past Harry and was now fluttering in front of him, his beady eyes bright in the dark. He was waving his long golden tail feathers. Harry looked uncertainly at him.  \"He looks like he wants you to grab hold. . .\" said Ron, looking perplexed. \"But you're much too heavy for a bird to pull up there -\"  \"Fawkes,\" said Harry, \"isn't an ordinary bird.\" He turned quickly to the others. \"We've got to hold on to each other. Ginny, grab Ron's hand. Professor Lockhart --\"  \"He means you,\" said Ron sharply to Lockhart.  \"You hold Ginny's other hand --\"  Harry tucked the sword and the Sorting Hat into his belt, Ron took hold of the back of Harry's robes, and Harry reached out and took hold of Fawkes's strangely hot tail feathers.  An extraordinary lightness seemed to spread through his whole body and the next second, in a rush of wings, they were flying upward through the pipe. Harry could hear Lockhart dangling below him, saying, \"Amazing! Amazing! This is just like magic!\" The chill air was whipping through Harry's hair, and before he'd stopped enjoying the ride, it was over -- all four of them were hitting the wet floor of Moaning Myrtle's bathroom, and as Lockhart straightened his hat, the sink that hid the pipe was sliding back into place.  Myrtle goggled at them.  \"You're alive,\" she said blankly to Harry.  \"There's no need to sound so disappointed,\" he said grimly, wiping flecks of blood and slime off his glasses.  * 325*  \"Oh, well ... Id just been thinking ... if you had died, you'd have been welcome to share my toilet,\" said Myrtle, blushing silver.  \"Urgh!\" said Ron as they left the bathroom for the dark, deserted corridor outside. \"Harry! I think Myrtle's grown fond of you! You've got competition, Ginny!\"  But tears were still flooding silently down Ginny's face.  \"Where now?\" said Ron, with an anxious look at Ginny. Harry pointed.  Fawkes was leading the way, glowing gold along the corridor. They strode after him, and moments later, found themselves outside Professor McGonagall's office.  Harry knocked and pushed the door open.  G F-I A P T E IR  k' I G 14 T V V N  DO  Y'$ REWARD  or a moment there was silence as Harry, Ron, Ginny, and Lockhart stood in the doorway, covered in muck and slime and (in Harry's case) blood. Then there was a scream.  \"Ginny!\"  It was Mrs. Weasley, who had been sitting crying in front of the fire. She leapt to her feet, closely followed by Mr. Weasley, and both of them flung themselves on their daughter.  Harry, however, was looking past them. Professor Dumbledore was standing by the mantelpiece, beaming, next to Professor McGonagall, who was taking great, steadying gasps, clutching her chest. Fawkes went whooshing past Harry's ear and settled on Dumbledore's shoulder, just as Harry found himself and Ron being swept into Mrs. Weasleys tight embrace.  \"You saved her! You saved her! How did you do it?\"  \"I think we'd all like to know that,\" said Professor McGonagall weakly.      Mrs. Weasley let go of Harry, who hesitated for a moment, then walked over to the desk and laid upon it the Sorting Hat, the rubyencrusted sword, and what remained of Riddle's diary.  Then he started telling them everything. For nearly a quarter of an hour he spoke into the rapt silence: He told them about hearing the disembodied voice, how Hermione had finally realized that he was hearing a basilisk in the pipes; how he and Ron had followed the spiders into the forest, that Aragog had told them where the last victim of the basilisk had died; how he had guessed that Moaning Myrtle had been the victim, and that the entrance to the Chamber of Secrets might be in her bathroom ....  \"Very well,\" Professor McGonagall prompted him as he paused, \"so you found out where the entrance was -- breaking a hundred school rules into pieces along the way, I might add - but how on earth did you all get out of there alive, Potter?\"  So Harry, his voice now growing hoarse from all this talking, told them about Fawkes's timely arrival and about the Sorting Hat giving him the sword. But then he faltered. He had so far avoided mentioning Riddle's diary -- or Ginny. She was standing with her head against Mrs. Weasley's shoulder, and tears were still coursing silently down her cheeks. What if they expelled her? Harry thought in panic. Riddle's diary didn't work anymore .... How could they prove it had been he who'd made her do it all?  Instinctively, Harry looked at Dumbledore, who smiled faintly, the firelight glancing off his half-moon spectacles.  \"\\What interests me most,\" said Dumbledore gently, \"is how Lord Voldemort managed to enchant Ginny, when my sources tell me he is currently in hiding in the forests of Albania."
}