{
  "id": "529a99319981860488b31f3eef1002fc2199e7b8",
  "text": "  \"Harry -- make sure you win,\" said Percy, in an urgent whisper. \"I haven't got ten Galleons. Yes, I'm coming, Penny!\" And-he bustled off to join her in a piece of toast.  \"Sure you can manage that broom, Potter?\" said a cold, drawling voice.  Draco Malfoy had arrived for a closer look, Crabbe and Coyle right behind him.  \"Yeah, reckon so,\" said Harry casually.  \"Got plenty of special features, hasn't it?\" said Malfoy, eyes glittering maliciously. \"Shame it doesn't come with a parachute -- in case you get too near a dementor.\"  Crabbe and Goyle sniggered.  \"Pity you can't attach an extra arm to yours, Malfoy,\" said Harry. \"Then it could catch the Snitch for you.\"  The Gryffindor team laughed loudly. Malfoy's pale eyes narrowed, and he stalked away. They watched him rejoin the rest of the Slytherin team, who put their heads together, no doubt asking Malfoy whether Harry's broom really was a Firebolt.  At a quarter to eleven, the Gryffindor team set off for the locker rooms. The weather couldn't have been more different from their match against Hufflepuff. It was a clear, cool day with a very light breeze; there would be no visibility problems this time, and Harry, though nervous, was starting to feel the excitement only a Quidditch match could bring. They could hear the rest of the school moving into the stadium beyond. Harry took off his black school robes, removed his wand from his pocket, and stuck it inside the T-shirt he was going to wear under his Quidditch robes. He only hoped he wouldn't need it. He wondered suddenly whether Professor Lupin was in the crowd, watching.  \"You know what we've got to do,\" said Wood as they prepared to leave the locker rooms. \"If we lose this match, we're out of the running. just -- just fly like you did in practice yesterday, and we'll be okay!\"  They walked out onto the field to tumultuous applause. The Ravenclaw team, dressed in blue, were already standing in the middle of the field. Their Seeker, Cho Chang, was the only girl on their team. She was shorter than Harry by about a head, and Harry couldn't help noticing, nervous as he was, that she was extremely pretty. She smiled at Harry as the teams faced each other behind their captains, and he felt a slight lurch in the region of his stomach that he didn't think had anything to do with nerves.  \"Wood, Davies, shake hands,\" Madam Hooch said briskly, and Wood shook hands with the Ravenclaw Captain.  \"Mount your brooms... on my whistle... three -- two -- one --\"  Harry kicked off into the air and the Firebolt zoomed higher and faster than any other broom; he soared around the stadium and began squinting around for the Snitch, listening all the while to the commentary, which was being provided by the Weasley twins' friend Lee Jordan.  \"They're off, and the big excitement this match is the Firebolt that Harry Potter is flying for Gryffindor. According to Which Broomstick, the Firebolt's going to be the broom of choice for the national teams at this year's World Championship --\"  \"Jordan, would you mind telling us what's going on in the match?\" interrupted Professor McGonagall's voice.  \"Right you are, Professor -- just giving a bit of background information -- the Firebolt, incidentally, has a built-in auto-brake and --\"  \"Jordan!\"  \"Okay, okay, Gryffindor in possession, Katie Bell of Gryffindor, heading for goal...\"  Harry streaked past Katie in the opposite direction, gazing around for a glint of gold and noticing that Cho Chang was tailing him closely. She was undoubtedly a very good flier -- she kept cutting across him, forcing him to change direction.  \"Show her your acceleration, Harry!\" Fred yelled as he whooshed past in pursuit of a Bludger that was aiming for Alicia.  Harry urged the Firebolt forward as they rounded the Ravenclaw goal posts and Cho fell behind. Just as Katie succeeded in scoring the first goal of the match, and the Gryffindor end of the field went wild, he saw it -- the Snitch was close to the ground, flitting near one of the barriers.  Harry dived; Cho saw what he was doing and tore after him -- Harry was speeding up, excitement flooding him; dives were his speciality, he was ten feet away --  Then a Bludger, hit by one of the Ravenclaw Beaters, came pelting out of nowhere; Harry veered off course, avoiding it by an inch, and in those few, crucial seconds, the Snitch had vanished.  There was a great \"Ooooooh\" of disappointment from the Gryffindor supporters, but much applause for their Beater from the Ravenclaw end. George Weasley vented his feelings by hitting the second Bludger directly at the offending Beater, who was forced to roll right over in midair to avoid it.  \"Gryffindor leads by eighty points to zero, and look at that Firebolt go! Potter's really putting it through its paces now, see it turn -- Chang's Comet is just no match for it, the Firebolt's precision- balance is really noticeable in these long --\"  \"JORDAN! ARE YOU BEING PAID TO ADVERTISE FIREBOLTS? GET ON WITH THE COMMENTARY!\"  Ravenclaw was pulling back; they had now scored three goals, which put Gryffindor only fifty points ahead -- if Cho got the Snitch before him, Ravenclaw would win."
}