{
  "id": "52f617c7d6c62cb31ee0e632afa43d315e01c565",
  "text": "  Her silver shied as the merchant prince Xaro Xhoan Daxos rode up to her; the horses could not abide the close presence of camels, she had found.  If you see here anything that you would desire, O most beautiful of women, you have only to speak and it is yours,  Xaro called down from his ornate horned saddle.   Qarth itself is hers, she has no need of baubles,  blue-lipped Pyat Pree sang out from her other side.  It shall be as I promised, Khaleesi. Come with me to the House of the Undying, and you shall drink of truth and wisdom.    Why should she need your Palace of Dust, when I can give her sunlight and sweet water and silks to sleep in?  Xaro said to the warlock.  The Thirteen shall set a crown of black jade and fire opals upon her lovely head.    The only palace I desire is the red castle at King’s Landing, my lord Pyat.  Dany was wary of the warlock; the maegi Mirri Maz Duur had soured her on those who played at sorcery.  And if the great of Qarth would give me gifts, Xaro, let them give me ships and swords to win back what is rightfully mine.   Pyat’s blue lips curled upward in a gracious smile.  it shall be as you command, Khaleesi.  He moved away, swaying with his camel’s motion, his long beaded robes trailing behind.   The young queen is wise beyond her years,  Xaro Xhoan Daxos murmured down at her from his high saddle.  There is a saying in Qarth. A warlock’s house is built of bones and lies.    Then why do men lower their voices when they speak of the warlocks of Qarth? All across the east, their power and wisdom are revered.    Once they were mighty,  Xaro agreed,  but now they are as ludicrous as those feeble old soldiers who boast of their prowess long after strength and skill have left them. They read their crumbling scrolls, drink shade-of-the-evening until their lips turn blue, and hint of dread powers, but they are hollow husks compared to those who went before. Pyat Pree’s gifts will turn to dust in your hands, I warn you.  He gave his camel a lick of his whip and sped away.   The crow calls the raven black,  muttered Ser Jorah in the Common Tongue of Westeros. The exile knight rode at her right hand, as ever. For their entrance into Qarth, he had put away his Dothraki garb and donned again the plate and mail and wool of the Seven Kingdoms half a world away.  You would do well to avoid both those men, Your Grace.    Those men will help me to my crown,  she said.  Xaro has vast wealth, and Pyat Pree—    —pretends to power,  the knight said brusquely. On his dark green surcoat, the bear of House Mormont stood on its hind legs, black and fierce. Jorah looked no less ferocious as he scowled at the crowd that filled the bazaar.  I would not linger here long, my queen. I mislike the very smell of this place.   Dany smiled.  Perhaps it’s the camels you’re smelling. The Qartheen themselves seem sweet enough to my nose.    Sweet smells are sometimes used to cover foul ones.   My great bear, Dany thought. I am his queen, but I will always be his cub as well, and he will always guard me. It made her feel safe, but sad as well. She wished she could love him better than she did.  Xaro Xhoan Daxos had offered Dany the hospitality of his home while she was in the city. She had expected something grand. She had not expected a palace larger than many a market town. It makes Magister Illyrio’s manse in Pentos look like a swineherd’s hovel, she thought. Xaro swore that his home could comfortably house all of her people and their horses besides; indeed, it swallowed them. An entire wing was given over to her. She would have her own gardens, a marble bathing pool, a scrying tower and warlock’s maze. Slaves would tend her every need. In her private chambers, the floors were green marble, the walls draped with colorful silk hangings that shimmered with every breath of air.  You are too generous,  she told Xaro Xhoan Daxos.   For the Mother of Dragons, no gift is too great.  Xaro was a languid, elegant man with a bald head and a great beak of a nose crusted with rubies, opals, and flakes of jade.  On the morrow, you shall feast upon peacock and lark’s tongue, and hear music worthy of the most beautiful of women. The Thirteen will come to do you homage, and all the great of Qarth.   All the great of Qarth will come to see my dragons, Dany thought, yet she thanked Xaro for his kindness before she sent him on his way. Pyat Pree took his leave as well, vowing to petition the Undying Ones for an audience.  A honor rare as summer snows.  Before he left he kissed her bare feet with his pale blue lips and pressed on her a gift, a jar of ointment that he swore would let her see the spirits of the air. Last of the three seekers to depart was Quaithe the shadowbinder. From her Dany received only a warning.  Beware,  the woman in the red lacquer mask said.   Of whom?    Of all. They shall come day and night to see the wonder that has been born again into the world, and when they see they shall lust. For dragons are fire made flesh, and fire is power."
}