{
  "id": "5394d953cb7c380a9a13baa31d10a769241a9e96",
  "text": " Someone would find him lying dead in his own blood, and then the hue and cry would go up. They would wake Lord Bolton and search Harrenhal from crenel to cellar, and when they did they would find the map and the dagger missing, along with some swords from the armory, bread and cheese from the kitchens, a baker boy, a ’prentice smith, and a cupbearer called Nan… or Weasel, or Arry, depending on who you asked.  The Lord of the Dreadfort would not come after them himself. Roose Bolton would stay abed, his pasty flesh dotted with leeches, giving commands in his whispery soft voice. His man Walton might lead the hunt, the one they called Steelshanks for the greaves he always wore on his long legs. Or perhaps it would be slobbery Vargo Hoat and his sellswords, who named themselves the Brave Companions. Others called them Bloody Mummers (though never to their faces), and sometimes the Footmen, for Lord Vargo’s habit of cutting off the hands and feet of men who displeased him.  If they catch us, he’ll cut off our hands and feet, Arya thought, and then Roose Bolton will peel the skin off us. She was still dressed in her page’s garb, and on the breast over her heart was sewn Lord Bolton’s sigil, the flayed man of the Dreadfort.  Every time she looked back, she half expected to see a blaze of torches pouring out the distant gates of Harrenhal or rushing along the tops of its huge high walls, but there was nothing. Harrenhal slept on, until it was lost in darkness and hidden behind the trees.  When they crossed the first stream, Arya turned her horse aside and led them off the road, following the twisting course of the water for a quarter-mile before finally scrambling out and up a stony bank. If the hunters brought dogs, that might throw them off the scent, she hoped. They could not stay on the road. There is death on the road, she told herself, death on all the roads.  Gendry and Hot Pie did not question her choice. She had the map, after all, and Hot Pie seemed almost as terrified of her as of the men who might be coming after them. He had seen the guard she’d killed. It’s better if he’s scared of me, she told herself. That way he’ll do like I say, instead of something stupid.  She should be more frightened herself, she knew. She was only ten, a skinny girl on a stolen horse with a dark forest ahead of her and men behind who would gladly cut off her feet. Yet somehow she felt calmer than she ever had in Harrenhal. The rain had washed the guard’s blood off her fingers, she wore a sword across her back, wolves were prowling through the dark like lean grey shadows, and Arya Stark was unafraid. Fear cuts deeper than swords, she whispered under her breath, the words that Syrio Forel had taught her, and Jaqen’s words too, valar morghulis.  The rain stopped and started again and stopped once more and started, but they had good cloaks to keep the water off. Arya kept them moving at a slow steady pace. It was too black beneath the trees to ride any faster; the boys were no horsemen, neither one, and the soft broken ground was treacherous with half-buried roots and hidden stones. They crossed another road, its deep ruts filled with runoff, but Arya shunned it. Up and down the rolling hills she took them, through brambles and briars and tangles of underbrush, along the bottoms of narrow gullies where branches heavy with wet leaves slapped at their faces as they passed.  Gendry’s mare lost her footing in the mud once, going down hard on her hindquarters and spilling him from the saddle, but neither horse nor rider was hurt, and Gendry got that stubborn look on his face and mounted right up again. Not long after, they came upon three wolves devouring the corpse of a fawn. When Hot Pie’s horse caught the scent, he shied and bolted. Two of the wolves fled as well, but the third raised his head and bared his teeth, prepared to defend his kill.  Back off,  Arya told Gendry.  Slow, so you don’t spook him.  They edged their mounts away, until the wolf and his feast were no longer in sight. Only then did she swing about to ride after Hot Pie, who was clinging desperately to the saddle as he crashed through the trees.  Later they passed through a burned village, threading their way carefully between the shells of blackened hovels and past the bones of a dozen dead men hanging from a row of apple trees. When Hot Pie saw them he began to pray, a thin whispered plea for the Mother’s mercy, repeated over and over. Arya looked up at the fleshless dead in their wet rotting clothes and said her own prayer. Ser Gregor, it went, Dunsen, Polliver, Raff the Sweetling. The Tickler and the Hound. Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei. She ended it with valar morghulis, touched Jaqen’s coin where it nestled under her belt, and then reached up and plucked an apple from among the dead men as she rode beneath them. It was mushy and overripe, but she ate it worms and all.  That was the day without a dawn. Slowly the sky lightened around them, but they never saw the sun."
}