{
  "id": "539762a03d58b8c584592068623509f6275bfa3d",
  "text": "  And to seal the bargain, I will give her my niece.   He had the pleasure of seeing a look of genuine surprise in Petyr Baelish’s grey-green eyes.  Myrcella?    When she comes of age, she can wed little Lord Robert. Until such time, she’ll be Lady Lysa’s ward at the Eyrie.    And what does Her Grace the queen think of this ploy?  When Tyrion shrugged, Littlefinger burst into laughter.  I thought not. You’re a dangerous little man, Lannister. Yes, I could sing this song to Lysa.  Again the sly smile, the mischief in his glance.  If I cared to.   Tyrion nodded, waiting, knowing Littlefinger could never abide a long silence.   So,  Lord Petyr continued after a pause, utterly unabashed,  what’s in your pot for me?    Harrenhal.   It was interesting to watch his face. Lord Petyr’s father had been the smallest of small lords, his grandfather a landless hedge knight; by birth, he held no more than a few stony acres on the windswept shore of the Fingers. Harrenhal was one of the richest plums in the Seven Kingdoms, its lands broad and rich and fertile, its great castle as formidable as any in the realm… and so large as to dwarf Riverrun, where Petyr Baelish had been fostered by House Tully, only to be brusquely expelled when he dared raise his sights to Lord Hoster’s daughter.  Littlefinger took a moment to adjust the drape of his cape, but Tyrion had seen the flash of hunger in those sly cat’s eyes. I have him, he knew.  Harrenhal is cursed,  Lord Petyr said after a moment, trying to sound bored.   Then raze it to the ground and build anew to suit yourself. You’ll have no lack of coin. I mean to make you liege lord of the Trident. These river lords have proven they cannot be trusted. Let them do you fealty for their lands.    Even the Tullys?    If there are any Tullys left when we are done.   Littlefinger looked like a boy who had just taken a furtive bite from a honeycomb. He was trying to watch for bees, but the honey was so sweet.  Harrenhal and all its lands and incomes,  he mused.  With a stroke, you’d make me one of the greatest lords in the realm. Not that I’m ungrateful, my lord, but—why?    You served my sister well in the matter of the succession.    As did Janos Slynt. On whom this same castle of Harrenhal was quite recently bestowed—only to be snatched away when he was no longer of use.   Tyrion laughed.  You have me, my lord. What can I say? I need you to deliver the Lady Lysa. I did not need Janos Slynt.  He gave a crooked shrug.  I’d sooner have you seated in Harrenhal than Renly seated on the Iron Throne. What could be plainer?    What indeed. You realize that I may need to bed Lysa Arryn again to get her consent to this marriage?    I have little doubt you’ll be equal to the task.    I once told Ned Stark that when you find yourself naked with an ugly woman, the only thing to do is close your eyes and get on with it.  Littlefinger steepled his fingers and gazed into Tyrion’s mismatched eyes.  Give me a fortnight to conclude my affairs and arrange for a ship to carry me to Gulltown.    That will do nicely.   His guest rose.  This has been quite the pleasant morning, Lannister. And profitable… for both of us, I trust.  He bowed, his cape a swirl of yellow as he strode out the door.  Two, thought Tyrion.  He went up to his bedchamber to await Varys, who would soon be making an appearance. Evenfall, he guessed. Perhaps as late as moonrise, though he hoped not. He hoped to visit Shae tonight. He was pleasantly surprised when Galt of the Stone Crows informed him not an hour later that the powdered man was at his door.  You are a cruel man, to make the Grand Maester squirm so,  the eunuch scolded.  The man cannot abide a secret.    Is that a crow I hear, calling the raven black? Or would you sooner not hear what I’ve proposed to Doran Martell?   Varys giggled.  Perhaps my little birds have told me.    Have they, indeed?  He wanted to hear this.  Go on.    The Dornishmen thus far have held aloof from these wars. Doran Martell has called his banners, but no more. His hatred for House Lannister is well known, and it is commonly thought he will join Lord Renly. You wish to dissuade him.    All this is obvious,  said Tyrion.   The only puzzle is what you might have offered for his allegiance. The prince is a sentimental man, and he still mourns his sister Elia and her sweet babe.    My father once told me that a lord never lets sentiment get in the way of ambition… and it happens we have an empty seat on the small council, now that Lord Janos has taken the black.    A council seat is not to be despised,  Varys admitted,  yet will it be enough to make a proud man forget his sister’s murder?    Why forget?  Tyrion smiled.  I’ve promised to deliver his sister’s killers, alive or dead, as he prefers. After the war is done, to be sure.   Varys gave him a shrewd look.  My little birds tell me that Princess Elia cried a… certain name… when they came for her.    Is a secret still a secret if everyone knows it?  In Casterly Rock, it was common knowledge that Gregor Clegane had killed Elia and her babe."
}