{
  "id": "53a92b8fe7a545b6138acbeb24251ffd5eedf5e1",
  "text": " He was looking pale and stunned.  \"Percy's in shock,\" George told Harry quietly. \"That Ravenclaw girl - Penelope Clearwater - she's a prefect. I don't think he thought the monster would dare attack a prefect.\"  But Harry was only half-listening. He didn't seem to be able to get rid of the picture of Hermione, lying on the hospital bed as though carved out of stone. And if the culprit wasn't caught soon, he was looking at a lifetime back with the Dursleys. Tom Riddle had turned Hagrid in because he was faced with the prospect of a Muggle orphanage if the school closed. Harry now knew exactly how he had felt.  \"What're we going to do?\" said Ron quietly in Harry's ear. \"D'you think they suspect Hagrid?\"  \"We've got to go and talk to him,\" said Harry, making up his mind. \"I can't believe it's him this time, but if he set the monster loose last time he'll know how to get inside the Chamber of Secrets, and that's a start.\" \"But McGonagall said we've got to stay in our tower unless we're in class -\" \"I think,\" said Harry, more quietly still, \"it's time to get my dad's old cloak out again.\"  Harry had inherited) ust one thing from his father: a long and sil very Invisibility Cloak. It was their only chance of sneaking out of the school to visit Hagrid without anyone knowing about it. They went to bed at the usual time, waited until Neville, Dean, and Sea mus had stopped discussing the Chamber of Secrets and finally fallen asleep, then got up, dressed again, and threw the cloak over themselves. The journey through the dark and deserted castle corridors wasn't enjoyable. Harry, who had wandered the castle at night sev eral times before, had never seen it so crowded after sunset. Teach ers, prefects, and ghosts were marching the corridors in pairs, staring around for any unusual activity. Their Invisibility Cloak didn't stop them making any noise, and there was a particularly tense moment when Ron stubbed his toe only yards from the spot where Snape stood standing guard. Thankfully, Snape sneezed at almost exactly the moment Ron swore. It was with relief that they reached the oak front doors and eased them open. It was a clear, starry night. They hurried toward the lit windows of Hagrid's house and pulled off the cloak only when they were right outside his front door.  Seconds after they had knocked, Hagrid flung it open. They found themselves face-to-face with him aiming a crossbow at them. Fang the boarhound barked loudly behind him.  \"Oh,\" he said, lowering the weapon and staring at them. \"What're you two doin' here?\"  \"What's that for?\" said Harry, pointing at the crossbow as they stepped inside.  \"Nothin' - nothin' - \" Hagrid muttered. \"I've bin expectin' doesn' matter - Sit down - I'll make tea -\"  He hardly seemed to know what he was doing. He nearly extinguished the fire, spilling water from the kettle on it, and then smashed the teapot with a nervous jerk of his massive hand.  \"Are you okay, Hagrid?\" said Harry. \"Did you hear about Hermione?\"  \"Oh, I heard, all righ',\" said Hagrid, a slight break in his voice.  He kept glancing nervously at the windows. He poured them both large mugs of boiling water (he had forgotten to add tea bags) and was just putting a slab of fruitcake on a plate when there was a loud knock on the door.  Hagrid dropped the fruitcake. Harry and Ron exchanged panicstricken looks, then threw the Invisibility Cloak back over themselves and retreated into a corner. Hagrid checked that they were hidden, seized his crossbow, and flung open his door once more.  \"Good evening, Hagrid.\"  It was Dumbledore. He entered, looking deadly serious, and was followed by a second, very odd-looking man.  The stranger had rumpled gray hair and an anxious expression, and was wearing a strange mixture of clothes: a pinstriped suit, a  scarlet tie, a long black cloak, and pointed purple boots. Under his arm he carried a lime-green bowler.  \"That's Dad's boss!\" Ron breathed. \"Cornelius Fudge, the Minister of Magic!\"  Harry elbowed Ron hard to make him shut up.  Hagrid had gone pale and sweaty. He dropped into one of his chairs and looked from Dumbledore to Cornelius Fudge.  \"Bad business, Hagrid,\" said Fudge in rather clipped tones. \"Very bad business. Had to come. Four attacks on Muggle-borns. Things've gone far enough. Ministry's got to act.\"  \"I never,\" said Hagrid, looking imploringly at Dumbledore. \"You know I never, Professor Dumbledore, sir -\"  \"I want it understood, Cornelius, that Hagrid has my full confidence,\" said Dumbledore, frowning at Fudge.  \"Look, Albus,\" said Fudge, uncomfortably. \"Hagrid's record's against him. Ministry's got to do something - the school governors have been in touch -\"  \"Yet again, Cornelius, I tell you that taking Hagrid away will not help in the slightest,\" said Dumbledore. His blue eyes were full of a fire Harry had never seen before.  \"Look at it from my point of view,\" said Fudge, fidgeting with his bowler. \"I'm under a lot of pressure. Got to be seen to be doing something."
}