{
  "id": "53d4ff64e2cc81bc43956c3aed8c4015eb0276d0",
  "text": " The Dark Power was deep in  thought, and the Eye  turned inward, pondering tidings of doubt and danger: a  bright sword, and a    ####-stern  and kingly face  it  saw, and for  a while it gave  little thought to  other things;  and  all its great  stronghold, gate on  gate,  and tower  on  tower, was wrapped in a brooding gloom.       Frodo and Sam gazed out in  mingled loathing and wonder on this hateful  land. Between them and  the smoking mountain, and about  it north and south,  all seemed ruinous and dead, a  desert burned  and choked. They wondered  how  the Lord of  this realm maintained  and  fed his  slaves and his armies. Yet  armies he had.  As far as their  eyes could reach, along the  skirts  of the  Morgai and away southward,  there were camps, some  of tents,  some  ordered  like small towns. One of the largest of these was right below them. Barely a   mile  out into  the  plain it clustered like some huge nest of insects, with  straight dreary streets of huts  and  long low drab buildings. About it  the  ground  was  busy  with folk  going  to and  fro; a  wide  road  ran from it  south-east to join the  Morgul-way, and along it  many  lines of small black   shapes were hurrying.       'I don't like the look of things at all,' said Sam. 'Pretty hopeless, I  call it  - saving that where there's such  a lot of folk  there must be wells  or water, not to mention  food. And these  are Men not Orcs,  or  my eyes are  all wrong.'       Neither  he nor Frodo knew  anything of  the great slave-worked  fields  away south  in this wide realm, beyond the fumes of the Mountain by the dark  sad waters  of Lake  N®rnen; nor of  the great roads that ran away  east and  south to tributary lands, from which the soldiers of the Tower  brought long   waggon-trains of goods  and booty and fresh  slaves. Here  in  the northward  regions were the mines and forges, and the musterings of  long-planned  war;  and  here the  Dark  Power, moving its armies like pieces on the  board, was  gathering them together. Its first moves, the first feelers of its strength,  had been  checked  upon  its western  line, southward and northward. For the  moment  it withdrew  them,  and  brought  up new forces, massing  them about  Cirith Gorgor for an avenging stroke. And if it had also been its purpose to  defend the Mountain against all approach, it could scarcely have done more.       'Well!' Sam went on. 'Whatever they have to eat and drink, we can't get  it. There's no way down that I can see. And we couldn't cross  all that open  country crawling with enemies, even if we did get down.'       'Still  we  shall  have to  try,'  said  Frodo.  'It's  no worse than I  expected. I never hoped to get across. I can't see any  hope  of it now. But   ####-I've  still  got  to do the best I can. At  present that  is to avoid  being  captured  as long as possible.  So we must still go northwards, I think, and  see what it is like where the open plain is narrower.'       'I guess what it'll be like,' said  Sam. 'Where it's narrower the  Orcs  and Men will just be packed closer. You'll see, Mr. Frodo.'       'I dare say I shall, if  we ever get so  far,'  said  Frodo  and turned  away.       They  soon  found that it was impossible  to  make their way  along the  crest of  the Morgai, or anywhere along its  higher levels, pathless as they  were  and scored with deep ghylls. In the end they were  forced to  go  back   down the ravine that they had  climbed and seek for a way  along the valley.  It was  rough going,  for  they  dared not  cross  over  to the  path on the  westward side. After a mile or more  they  saw,  huddled in a  hollow at the  cliff's foot,  the orc-hold that  they had guessed  was near at hand: a wall  and a cluster of stone huts set about the dark mouth of a cave. There was no   movement to be seen, but the hobbits crept by cautiously, keeping as much as  they  could  to the thorn-brakes that  grew thickly at this point along both  sides of the old water -course.       They went two or three miles further, and  the orc-hold was hidden from  sight behind them; but  they had hardly begun  to breathe  more freely again  when harsh and loud they heard orc-voices. Quickly  they  slunk out of sight  behind a brown and stunted bush.  The voices drew nearer. Presently two orcs  came  into view. One was  clad in ragged  brown and was armed with a  bow of  horn;  it was of  a small  breed, black -skinned,  with  wide  and  snuffling  nostrils:  evidently  a   tracker  of  some  kind.  The  other  was   a  big  fighting-orc, like those of Shagrat's company, bearing the token of the Eye.  He  also had  a  bow at his back and carried  a short broad-headed spear. As  usual they  were  quarrelling, and  being of  different breeds they used the  Common Speech a fter their fashion.       Hardly  twenty  paces  from where the  hobbits  lurked  the  small  orc  stopped. 'Nar!' it snarled. 'I'm going  home.' It  pointed across the valley  to  the orc-hold."
}