{
  "id": "53f30083d3695071a9034376e3ae277e54399d4b",
  "text": "  There seemed nothing else to do. It was no good crawling back down to Gollum's  water. Perhaps if he followed him, Gollum might lead him to some way of escape  without meaning to.  \"Curse  it!  curse  it!  curse  it!\"  hissed  Gollum.  \"Curse  the  Baggins!  It's  gone!  What has it got in its pocketses? Oh we guess, we guess, my precious. He's found  it, yes he must have. My birthday-present.\"  Bilbo  pricked  up  his  ears.  He  was  at  last  beginning  to  guess  himself.  He  hurried  a  little,  getting  as  close  as  he  dared  behind  Gollum,  who  was  still  going  quickly,  not  looking  back,  but  turning  his  head  from  side  to  side,  as Bilbo  could  see from the faint glimmer on the walls.  \"My birthday-present! Curse it! How did we lose it, my precious? Yes, that's it.  When we came  this way  last, when we  twisted  that nassty young squeaker. That's  it. Curse it! It slipped from us, after all these ages and ages! It's gone, gollum.\"  Suddenly Gollum sat down and began to weep, a whistling and gurgling sound  horrible  to  listen  to.  Bilbo  halted  and  flattened  himself  against  the  tunnel-wall.  After a while Gollum stopped weeping and began to talk. He seemed to be having  an argument with himself.  \"It's  no  good  going  back  there  to  search,  no.  We  doesn't  remember  all  the  places we've  visited. And  it's  no  use.  The  Baggins  has  got  it  in  its  pocketses;  the  nassty noser has found it, we says.\"  \"We  guesses,  precious,  only  guesses.  We  can't  know  till  we  find  the  nassty  creature and squeezes it. But it doesn't know what the present can do, does it? It'll  just  keep  it  in  its  pocketses.  It  doesn't  know,  and  it  can't  go  far.  It's  lost  itself, the  nassty nosey thing. It doesn't know the way out It said so.\"  \"It  said  so, yes; but  it's  tricksy.  It doesn't  say what  it means.  It won't  say what  it's got in its pocketses. It knows. It knows a way in, it must know a way out, yes.  It's off to the back-door. To the back-door, that's it.\"  \"The goblinses will catch it then. It can't get out that way, precious.\"  \"Ssss,  sss,  gollum!  Goblinses!  Yes,  but  if  it's  got  the  present,  our  precious  present,  then  goblinses  will  get  it,  gollum!  They'll  find  it,  they'll  find  out what  it  does. We shan't ever be safe again, never, gollum! One of  the goblinses will put  it   ####-on, and  then no one will  see him. He'll be  there but not  seen. Not even our clever  eyeses  will  notice  him;  and  he'll  come  creepsy  and  tricksy  and  catch  us,  gollum,  gollum!\"  \"Then let's stop talking, precious, and make haste. If the Baggins has gone that  way, we must go quick and see. Go! Not far now. Make haste!\"  With  a  spring Gollum got up  and  started  shambling off  at  a great pace. Bilbo  hurried  after  him,  still  cautiously,  though  his  chief  fear  now  was  of  tripping  on  another snag and falling with a noise. His head was in a whirl of hope and wonder.  It  seemed  that  the  ring  he  had  was  a  magic  ring:  it  made  you  invisible!  He  had  heard  of  such  things,  of  course,  in old old  tales; but  it was hard  to believe  that he  really  had  found  one,  by  accident.  Still  there  it was: Gollum with  his  bright  eyes  had passed him by, only a yard to one side.  On  they  went,  Gollum  flip-flapping  ahead,  hissing  and  cursing;  Bilbo  behind  going  as  softly  as  a  hobbit  can.  Soon  they  came  to  places  where,  as  Bilbo  had  noticed  on  the way  down,  side-passages opened, this way and that. Gollum began  at once to count them.  \"One  left,  yes. One  right,  yes. Two  right,  yes,  yes. Two  left,  yes,  yes.\" And so  on and on.  As  the count grew he slowed down, and he began  to get shaky and weepy; for  he  was  leaving  the  water  further  and  further  behind,  and  he  was  getting  afraid.  Goblins  might  be  about,  and  he  had  lost  his  ring.  At  last  he  stopped  by  a  low  opening, on their left as they went up.  \"Seven  right,  yes.  Six  left,  yes!\"  he  whispered.  \"This  is  it.  This  is  the  way  to  the back-door, yes. Here's the passage!\"  He  peered  in,  and  shrank  back.  \"But  we  durstn't  go  in,  precious,  no  we  durstn't. Goblinses down there. Lots of goblinses. We smells them. Ssss!\"  \"What shall we do? Curse them and crush them! We must wait here, precious,  wait a bit and see.\"  So  they  came  to  a  dead  stop. Gollum  had  brought  Bilbo  to  the way  out  after  all,  but  Bilbo  could  not  get  in!  There was Gollum  sitting humped up  right  in  the  opening,  and his  eyes gleamed  cold  in his head,  as he  swayed  it  from  side  to  side  between his knees.  Bilbo  crept  away  from  the  wall  more  quietly  than  a  mouse;  but  Gollum  stiffened  at  once,  and  sniffed,  and  his  eyes  went  green.  He  hissed  softly  but  menacingly. He could not see  the hobbit, but now he was on  the alert, and he had  other senses  that  the darkness had sharpened: hearing and smell."
}