{
  "id": "53fcc8760e1d55ba530cdccced6f33a66c5b005d",
  "text": " Only here, where the King in the North threw back every army that tried to cross the Neck, did the rule of the First Men endure. The Andals burnt out the weirwood groves, hacked down the faces, slaughtered the children where they found them, and everywhere proclaimed the triumph of the Seven over the old gods. So the children fled north—   Summer began to howl.  Maester Luwin broke off, startled. When Shaggydog bounded to his feet and added his voice to his brother’s, dread clutched at Bran’s heart.  It’s coming,  he whispered, with the certainty of despair. He had known it since last night, he realized, since the crow had led him down into the crypts to say farewell. He had known it, but he had not believed. He had wanted Maester Luwin to be right. The crow, he thought, the three-eyed crow…  The howling stopped as suddenly as it had begun. Summer padded across the tower floor to Shaggydog, and began to lick at a mat of bloody fur on the back of his brother’s neck. From the window came a flutter of wings.  A raven landed on the grey stone sill, opened its beak, and gave a harsh, raucous rattle of distress.  Rickon began to cry. His arrowheads fell from his hand one by one and clattered on the floor. Bran pulled him close and hugged him.  Maester Luwin stared at the black bird as if it were a scorpion with feathers. He rose, slow as a sleepwalker, and moved to the window. When he whistled, the raven hopped onto his bandaged forearm. There was dried blood on its wings.  A hawk,  Luwin murmured,  perhaps an owl. Poor thing, a wonder it got through.  He took the letter from its leg.  Bran found himself shivering as the maester unrolled the paper.  What is it?  he said, holding his brother all the harder.   You know what it is, boy,  Osha said, not unkindly. She put her hand on his head.  Maester Luwin looked up at them numbly, a small grey man with blood on the sleeve of his grey wool robe and tears in his bright grey eyes.  My lords,  he said to the sons, in a voice gone hoarse and shrunken,  we… we shall need to find a stonecarver who knew his likeness well…       SANSA  In the tower room at the heart of Maegor’s Holdfast, Sansa gave herself to the darkness.  She drew the curtains around her bed, slept, woke weeping, and slept again. When she could not sleep she lay under her blankets shivering with grief. Servants came and went, bringing meals, but the sight of food was more than she could bear. The dishes piled up on the table beneath her window, untouched and spoiling, until the servants took them away again.  Sometimes her sleep was leaden and dreamless, and she woke from it more tired than when she had closed her eyes. Yet those were the best times, for when she dreamed, she dreamed of Father. Waking or sleeping, she saw him, saw the gold cloaks fling him down, saw Ser Ilyn striding forward, unsheathing Ice from the scabbard on his back, saw the moment… the moment when… she had wanted to look away, she had wanted to, her legs had gone out from under her and she had fallen to her knees, yet somehow she could not turn her head, and all the people were screaming and shouting, and her prince had smiled at her, he’d smiled and she’d felt safe, but only for a heartbeat, until he said those words, and her father’s legs… that was what she remembered, his legs, the way they’d jerked when Ser Ilyn… when the sword…  Perhaps I will die too, she told herself, and the thought did not seem so terrible to her. If she flung herself from the window, she could put an end to her suffering, and in the years to come the singers would write songs of her grief. Her body would lie on the stones below, broken and innocent, shaming all those who had betrayed her. Sansa went so far as to cross the bedchamber and throw open the shutters… but then her courage left her, and she ran back to her bed, sobbing.  The serving girls tried to talk to her when they brought her meals, but she never answered them. Once Grand Maester Pycelle came with a box of flasks and bottles, to ask if she was ill. He felt her brow, made her undress, and touched her all over while her bedmaid held her down. When he left he gave her a potion of honeywater and herbs and told her to drink a swallow every night. She drank it all right then and went back to sleep.  She dreamt of footsteps on the tower stair, an ominous scraping of leather on stone as a man climbed slowly toward her bedchamber, step by step. All she could do was huddle behind her door and listen, trembling, as he came closer and closer. It was Ser Ilyn Payne, she knew, coming for her with Ice in his hand, coming to take her head. There was no place to run, no place to hide, no way to bar the door. Finally the footsteps stopped and she knew he was just outside, standing there silent with his dead eyes and his long pocked face. That was when she realized she was naked. She crouched down, trying to cover herself with her hands, as her door began to swing open, creaking, the point of the greatsword poking through…  She woke murmuring,  Please, please, I’ll be good, I’ll be good, please don’t,  but there was no one to hear."
}