{
  "id": "53fe641b497dd15af20dc822a537fa72005b63d3",
  "text": " And later these two brothers came before him, freeriders from the Dornish Marches, and pledged their swords to the service of the king. Father accepted their oaths…   Jeyne yawned.  Are there any lemon cakes?   Sansa did not like being interrupted, but she had to admit, lemon cakes sounded more interesting than most of what had gone on in the throne room.  Let’s see,  she said.  The kitchen yielded no lemon cakes, but they did find half of a cold strawberry pie, and that was almost as good. They ate it on the tower steps, giggling and gossiping and sharing secrets, and Sansa went to bed that night feeling almost as wicked as Arya.  The next morning she woke before first light and crept sleepily to her window to watch Lord Beric form up his men. They rode out as dawn was breaking over the city, with three banners going before them; the crowned stag of the king flew from the high staff, the direwolf of Stark and Lord Beric’s own forked lightning standard from shorter poles. It was all so exciting, a song come to life; the clatter of swords, the flicker of torchlight, banners dancing in the wind, horses snorting and whinnying, the golden glow of sunrise slanting through the bars of the portcullis as it jerked upward. The Winterfell men looked especially fine in their silvery mail and long grey cloaks.  Alyn carried the Stark banner. When she saw him rein in beside Lord Beric to exchange words, it made Sansa feel ever so proud. Alyn was handsomer than Jory had been; he was going to be a knight one day.  The Tower of the Hand seemed so empty after they left that Sansa was even pleased to see Arya when she went down to break her fast.  Where is everyone?  her sister wanted to know as she ripped the skin from a blood orange.  Did Father send them to hunt down Jaime Lannister?   Sansa sighed.  They rode with Lord Beric, to behead Ser Gregor Clegane.  She turned to Septa Mordane, who was eating porridge with a wooden spoon.  Septa, will Lord Beric spike Ser Gregor’s head on his own gate or bring it back here for the king?  She and Jeyne Poole had been arguing over that last night.  The septa was horror-struck.  A lady does not discuss such things over her porridge. Where are your courtesies, Sansa? I swear, of late you’ve been near as bad as your sister.    What did Gregor do?  Arya asked.   He burned down a holdfast and murdered a lot of people, women and children too.   Arya screwed up her face in a scowl.  Jaime Lannister murdered Jory and Heward and Wyl, and the Hound murdered Mycah. Somebody should have beheaded them.    It’s not the same,  Sansa said.  The Hound is Joffrey’s sworn shield. Your butcher’s boy attacked the prince.    Liar,  Arya said. Her hand clenched the blood orange so hard that red juice oozed between her fingers.   Go ahead, call me all the names you want,  Sansa said airily.  You won’t dare when I’m married to Joffrey. You’ll have to bow to me and call me Your Grace.  She shrieked as Arya flung the orange across the table. It caught her in the middle of the forehead with a wet squish and plopped down into her lap.   You have juice on your face, Your Grace,  Arya said.  It was running down her nose and stinging her eyes. Sansa wiped it away with a napkin. When she saw what the fruit in her lap had done to her beautiful ivory silk dress, she shrieked again.  You’re horrible,  she screamed at her sister.  They should have killed you instead of Lady!   Septa Mordane came lurching to her feet.  Your lord father will hear of this! Go to your chambers, at once. At once!    Me too?  Tears welled in Sansa’s eyes.  That’s not fair.    The matter is not subject to discussion. Go!   Sansa stalked away with her head up. She was to be a queen, and queens did not cry. At least not where people could see. When she reached her bedchamber, she barred the door and took off her dress. The blood orange had left a blotchy red stain on the silk.  I hate her!  she screamed. She balled up the dress and flung it into the cold hearth, on top of the ashes of last night’s fire. When she saw that the stain had bled through onto her underskirt, she began to sob despite herself. She ripped off the rest of her clothes wildly, threw herself into bed, and cried herself back to sleep.  It was midday when Septa Mordane knocked upon her door.  Sansa. Your lord father will see you now.   Sansa sat up.  Lady,  she whispered. For a moment it was as if the direwolf was there in the room, looking at her with those golden eyes, sad and knowing. She had been dreaming, she realized. Lady was with her, and they were running together, and… and… trying to remember was like trying to catch the rain with her fingers. The dream faded, and Lady was dead again.   Sansa.  The rap came again, sharply.  Do you hear me?    Yes, Septa,  she called out.  Might I have a moment to dress, please?  Her eyes were red from crying, but she did her best to make herself beautiful.  Lord Eddard was bent over a huge leather-bound book when Septa Mordane marched her into the solar, his plaster-wrapped leg stiff beneath the table."
}