{
  "id": "54402e54c5120cdaff87eca13e9c69756e71130d",
  "text": " \"Who's giv ing out signed photos?\" Harry started to speak but he was cut short as Lockhart flung an arm around his shoulders and thundered jovially, \"Shouldn't have asked! We meet again, Harry!\" Pinned to Lockhart's side and burning with humiliation, Harry saw Malfoy slide smirking back into the crowd. \"Come on then, Mr. Creevey,\" said Lockhart, beaming at Colin. \"A double portrait, can't do better than that, and we'll both sign it for you.\" Colin fumbled for his camera and took the picture as the bell rang behind them, signaling the start of afternoon classes. \"Off you go, move along there,\" Lockhart called to the crowd, and he set off back to the castle with Harry, who was wishing he knew a good Vanishing Spell, still clasped to his side. \"A word to the wise, Harry,\" said Lockhart paternally as they entered the building through a side door. \"I covered up for you back there with young Creevey - if he was photographing me, too, your schoolmates won't think you're setting yourself up so much . . . .\" Deaf to Harry's stammers, Lockhart swept him down a corridor lined with staring students and up a staircase. \"Let me just say that handing out signed pictures at this stage of your career isn't sensible - looks a tad bigheaded, Harry, to be frank. There may well come a time when, like me, you'll need to keep a stack handy wherever you go, but\" - he gave a little chor tle - \"I don't think you're quite there yet.\" They had reached Lockhart's classroom and he let Harry go at  98  last. Harry yanked his robes straight and headed for a seat at the very back of the class, where he busied himself with piling all seven of Lockhart's books in front of him, so that he could avoid looking at the real thing.  The rest of the class came clattering in, and Ron and Hermione sat down on either side of Harry.  \"You could've fried an egg on your face\" said Ron. \"You'd better hope Creevey doesn't meet Ginny, or they'll be starting a Harry Potter fan club.\"  \"Shut up,\" snapped Harry. The last thing he needed was for Lockhart to hear the phrase \"Harry Potter fan club.\"  When the whole class was seated, Lockhart cleared his throat loudly and silence fell. He reached forward, picked up Neville Longbottom's copy of Travels with Trolls, and held it up to show his own, winking portrait on the front.  \"Me,\" he said, pointing at it and winking as well. \"Gilderoy Lockhart, Order of Merlin, Third Class, Honorary Member of the Dark Force Defense League, and five-time winner of Witch Weekly's Most- Charming-Smile Award - but I don't talk about that. I didn't get rid of the Bandon Banshee by smiling at her!\"  He waited for them to laugh; a few people smiled weakly.  \"I see you've all bought a complete set of my books -well done. I thought we'd start today with a little quiz. Nothing to worry about  just to check how well you've read them, how much you've taken in -\"  When he had handed out the test papers he returned to the front of the class and said, \"You have thirty minutes - start - now!\"  Harry looked down at his paper and read:   1. What is Gilderoy Lockhart 's favorite color?  2. What is Gilderoy Lockhart's secret ambition?  3. What, in your opinion, is Gilderoy Lockhart's greatest achievement to date?  On and on it went, over three sides of paper, right down to:  54. When is Gilderoy Lockhart's birthday, and what would his ideal gift be?  Half an hour later, Lockhart collected the papers and rifled through them in front of the class.  \"Tut, tut - hardly any of you remembered that my favorite color is lilac. I say so in Year with the Yeti. And a few of you need to read Wanderings with Werewolves more carefully - I clearly state in chapter twelve that my ideal birthday gift would be harmony between all magic and non-magic peoples - though I wouldn't say no to a large bottle of Ogdeds Old Firewhisky!\"  He gave them another roguish wink. Ron was now staring at Lockhart with an expression of disbelief on his face; Seamus Finnigan and Dean Thomas, who were sitting in front, were shaking with silent laughter. Hermione, on the other hand, was listening to Lockhart with rapt attention and gave a start when he mentioned her name.  \". . . but Miss Hermione Granger knew my secret ambition is to rid the world of evil and market my own range of hair-care potions - good girl! In fact\" - he flipped her paper over - \"full marks! Where is Miss Hermione Granger?\"  *100*  Hermione raised a trembling hand.  \"Excellent!\" beamed Lockhart. \"Quite excellent! Take ten points for Gryffindor! And so - to business -\"  He bent down behind his desk and lifted a large, covered cage onto it.  \"Now - be warned! It is my job to arm you against the foulest creatures known to wizardkind! You may find yourselves facing your worst fears in this room. Know only that no harm can befall you whilst I am here. All I ask is that you remain calm.\"  In spite of himself, Harry leaned around his pile of books for a better look at the cage. Lockhart placed a hand on the cover. Dean and Seamus had stopped laughing now."
}