{
  "id": "5477d756badbaa9c86f10643a0725fd9bc3444d6",
  "text": "    I’ll make time for him on the morrow.  Whether truly loyal or merely desperate, a compliant river lord might have his uses.  See that he’s given a comfortable chamber and a hot meal. Send him a new pair of boots as well, good ones, courtesy of King Joffrey.  A show of generosity never hurt.  Bronn gave a curt nod.  There’s also a great gaggle of bakers, butchers, and greengrocers clamoring to be heard.    I told them last time, I have nothing to give them.  Only a thin trickle of food was coming into King’s Landing, most of it earmarked for castle and garrison. Prices had risen sickeningly high on greens, roots, flour, and fruit, and Tyrion did not want to think about what sorts of flesh might be going into the kettles of the pot-shops down in Flea Bottom. Fish, he hoped. They still had the river and the sea… at least until Lord Stannis sailed.   They want protection. Last night a baker was roasted in his own oven. The mob claimed he charged too much for bread.    Did he?    He’s not apt to deny it.    They didn’t eat him, did they?    Not that I’ve heard.    Next time they will,  Tyrion said grimly.  I give them what protection I can. The gold cloaks—    They claim there were gold cloaks in the mob,  Bronn said.  They’re demanding to speak to the king himself.    Fools.  Tyrion had sent them off with regrets; his nephew would send them off with whips and spears. He was half-tempted to allow it… but no, he dare not. Soon or late, some enemy would march on King’s Landing, and the last thing he wanted was willing traitors within the city walls.  Tell them King Joffrey shares their fears and will do all he can for them.    They want bread, not promises.    If I give them bread today, on the morrow I’ll have twice as many at the gates. Who else?    A black brother down from the Wall. The steward says he brought some rotted hand in a jar.   Tyrion smiled wanly.  I’m surprised no one ate it. I suppose I ought to see him. It’s not Yoren, perchance?    No. Some knight. Thorne.    Ser Alliser Thorne?  Of all the black brothers he’d met on the Wall, Tyrion Lannister had liked Ser Alliser Thorne the least. A bitter, mean-spirited man with too great a sense of his own worth.  Come to think on it, I don’t believe I care to see Ser Alliser just now. Find him a snug cell where no one has changed the rushes in a year, and let his hand rot a little more.   Bronn snorted laughter and went his way, while Tyrion struggled up the serpentine steps. As he limped across the outer yard, he heard the portcullis rattling up. His sister and a large party were waiting by the main gate.  Mounted on her white palfrey, Cersei towered high above him, a goddess in green.  Brother,  she called out, not warmly. The queen had not been pleased by the way he’d dealt with Janos Slynt.   Your Grace.  Tyrion bowed politely.  You look lovely this morning.  Her crown was gold, her cloak ermine. Her retinue sat their mounts behind her: Ser Boros Blount of the Kingsguard, wearing white scale and his favorite scowl; Ser Balon Swann, bow slung from his silver-inlay saddle; Lord Gyles Rosby, his wheezing cough worse than ever; Hallyne the Pyromancer of the Alchemists’ Guild; and the queen’s newest favorite, their cousin Ser Lancel Lannister, her late husband’s squire upjumped to knight at his widow’s insistence. Vylarr and twenty guardsmen rode escort.  Where are you bound this day, sister?  Tyrion asked.   I’m making a round of the gates to inspect the new scorpions and spitfires. I would not have it thought that all of us are as indifferent to the city’s defense as you seem to be.  Cersei fixed him with those clear green eyes of hers, beautiful even in their contempt.  I am informed that Renly Baratheon has marched from Highgarden. He is making his way up the roseroad, with all his strength behind him.    Varys gave me the same report.    He could be here by the full moon.    Not at his present leisurely pace,  Tyrion assured her.  He feasts every night in a different castle, and holds court at every crossroads he passes.    And every day, more men rally to his banners. His host is now said to be a hundred thousand strong.    That seems rather high.    He has the power of Storm’s End and Highgarden behind him, you little fool,  Cersei snapped down at him.  All the Tyrell bannermen but for the Redwynes, and you have me to thank for that. So long as I hold those poxy twins of his, Lord Paxter will squat on the Arbor and count himself fortunate to be out of it.    A pity you let the Knight of Flowers slip through your pretty fingers. Still, Renly has other concerns besides us. Our father at Harrenhal, Robb Stark at Riverrun… were I he, I would do much as he is doing. Make my progress, flaunt my power for the realm to see, watch, wait. Let my rivals contend while I bide my own sweet time. If Stark defeats us, the south will fall into Renly’s hands like a windfall from the gods, and he’ll not have lost a man. And if it goes the other way, he can descend on us while we are weakened."
}