{
  "id": "54b29d2fe58757a102a652f4248e2d07445a6933",
  "text": "  \"Marge's ill,\" he informed Aunt Petunia. \"Ate a funny whelk. --.\"  \"Dad!\" said Dudley suddenly. \"Dad, Harry's got something!\"  Harry was on the point of unfolding his letter, which was written on the same heavy parchment as the envelope, when it was jerked sharply out of his hand by Uncle Vernon.  \"That's mine!\" said Harry, trying to snatch it back.  \"Who'd be writing to you?\" sneered Uncle Vernon, shaking the letter open with one hand and glancing at it. His face went from red to green faster than a set of traffic lights. And it didn't stop there. Within seconds it was the grayish white of old porridge.  \"P-P-Petunia!\" he gasped.  Dudley tried to grab the letter to read it, but Uncle Vernon held it high out of his reach. Aunt Petunia took it curiously and read the first line. For a moment it looked as though she might faint. She clutched her throat and made a choking noise.  \"Vernon! Oh my goodness -- Vernon!\"  They stared at each other, seeming to have forgotten that Harry and Dudley were still in the room. Dudley wasn't used to being ignored. He gave his father a sharp tap on the head with his Smelting stick.  \"I want to read that letter,\" he said loudly. want to read it,\" said Harry furiously, \"as it's mine.\"  \"Get out, both of you,\" croaked Uncle Vernon, stuffing the letter back inside its envelope.  Harry didn't move.  I WANT MY LETTER!\" he shouted.  \"Let me see it!\" demanded Dudley.  \"OUT!\" roared Uncle Vernon, and he took both Harry and Dudley by the scruffs of their necks and threw them into the hall, slamming the kitchen door behind them. Harry and Dudley promptly had a furious but silent fight over who would listen at the keyhole; Dudley won, so Harry, his glasses dangling from one ear, lay flat on his stomach to listen at the crack between door and floor.  \"Vernon,\" Aunt Petunia was saying in a quivering voice, \"look at the address -- how could they possibly know where he sleeps? You don't think they're watching the house?\"  \"Watching -- spying -- might be following us,\" muttered Uncle Vernon wildly.  \"But what should we do, Vernon? Should we write back? Tell them we don't want --\"  Harry could see Uncle Vernon's shiny black shoes pacing up and down the kitchen.  \"No,\" he said finally. \"No, we'll ignore it. If they don't get an answer... Yes, that's best... we won't do anything....  \"But --\"  \"I'm not having one in the house, Petunia! Didn't we swear when we took him in we'd stamp out that dangerous nonsense?\"  That evening when he got back from work, Uncle Vernon did something he'd never done before; he visited Harry in his cupboard.  \"Where's my letter?\" said Harry, the moment Uncle Vernon had squeezed through the door. \"Who's writing to me?\"  \"No one. it was addressed to you by mistake,\" said Uncle Vernon shortly. \"I have burned it.\"  \"It was not a mistake,\" said Harry angrily, \"it had my cupboard on it.\"  \"SILENCE!\" yelled Uncle Vernon, and a couple of spiders fell from the ceiling. He took a few deep breaths and then forced his face into a smile, which looked quite painful.  \"Er -- yes, Harry -- about this cupboard. Your aunt and I have been thinking... you're really getting a bit big for it... we think it might be nice if you moved into Dudley's second bedroom.  \"Why?\" said Harry.  \"Don't ask questions!\" snapped his uncle. \"Take this stuff upstairs, now.\"  The Dursleys' house had four bedrooms: one for Uncle Vernon and Aunt Petunia, one for visitors (usually Uncle Vernon's sister, Marge), one where Dudley slept, and one where Dudley kept all the toys and things that wouldn't fit into his first bedroom. It only took Harry one trip upstairs to move everything he owned from the cupboard to this room. He sat down on the bed and stared around him. Nearly everything in here was broken. The month-old video camera was lying on top of a small, working tank Dudley had once driven over the next door neighbor's dog; in the corner was Dudley's first-ever television set, which he'd put his foot through when his favorite program had been canceled; there was a large birdcage, which had once held a parrot that Dudley had swapped at school for a real air rifle, which was up on a shelf with the end all bent because Dudley had sat on it. Other shelves were full of books. They were the only things in the room that looked as though they'd never been touched.  From downstairs came the sound of Dudley bawling at his mother, I don't want him in there... I need that room... make him get out....\"  Harry sighed and stretched out on the bed. Yesterday he'd have given anything to be up here. Today he'd rather be back in his cupboard with that letter than up here without it.  Next morning at breakfast, everyone was rather quiet. Dudley was in shock. He'd screamed, whacked his father with his Smelting stick, been sick on purpose, kicked his mother, and thrown his tortoise through the greenhouse roof, and he still didn't have his room back. Harry was thinking about this time yesterday and bitterly wishing he'd opened the letter in the hall."
}