{
  "id": "5521ba7976a8a9db80e5ec6c93ec126a34069584",
  "text": "  \"DON'T BELIEVE IT!\" Hermione screamed.  Lupin let go of Black and turned to her. She had raised herself off the floor and was pointing at Lupin, wild-eyed. \"You -- you --\"  \"Hermione --\"  \"-- you and him!\"  \"Hermione, calm down --\"  \"I didn't tell anyone!\" Hermione shrieked. \"I've been covering up for you --\"  \"Hermione, listen to me, please'\" Lupin shouted. \"I can explain --\"  Harry could feel himself shaking, not with fear, but with a fresh wave of fury.  \"I trusted you,\" he shouted at Lupin, his voice wavering, out of control, \"and all the time you've been his friend!\"  \"You're wrong,\" said Lupin. \"I haven't been Sirius's friend, but I am now -- Let me explain....\"  \"NO!\" Hermione screamed. \"Harry, don't trust him, he's been helping Black get into the castle, he wants you dead too -- he's a werewolf!\"  There was a ringing silence. Everyone's eyes were now on Lupin, who looked remarkably calm, though rather pale.  \"Not at all up to your usual standard, Hermione,\" he said. \"Only one out of three, I'm afraid. I have not been helping Sirius get into the castle and I certainly don't want Harry dead. An odd shiver passed over his face. \"But I won't deny that I am a werewolf.\"  Ron made a valiant effort to get up again but fell back with a whimper of pain. Lupin made toward him, looking concerned, but Ron gasped, \"Get away ftom me, werewolf!\"  Lupin stopped dead. Then, with an obvious effort, he turned to Hermione and said, \"How long have you known?\"  \"Ages,\" Hermione whispered. \"Since I did Professor Snape's essay...\"  \"He'll be delighted,\" said Lupin coolly. \"He assigned that essay hoping someone would realize what my symptoms meant.... Did you check the lunar chart and realize that I was always ill at the full moon? Or did you realize that the boggart changed into the moon when it saw me?\"  \"Both,\" Hermione said quietly.  Lupin forced a laugh.  \"You're the cleverest witch of your age I've ever met, Hermione.\"  \"I'm not,\" Hermione whispered. \"If I'd been a bit cleverer, I'd have told everyone what you are!\"  \"But they already know,\" said Lupin. \"At least, the staff do.\"  \"Dumbledore hired you when he knew you were a werewolf. Ron gasped. \"Is he mad?\"  \"Some of the staff thought so,\" said Lupin. \"He had to work very hard to convince certain teachers that I'm trustworthy --\"  \"AND HE WAS WRONG!\" Harry yelled. \"YOUVE BEEN HELPING HIM ALL THE TIME!\" He was pointing at Black, who suddenly crossed to the four-poster bed and sank onto it, his face hidden in one shaking hand. Crookshanks leapt up beside him and stepped onto his lap, purring. Ron edged away from both of them, dragging his leg.  I have not been helping Sirius,\" said Lupin. \"If you'll give me a chance, I'll explain. Look --\"  He separated Harry's, Ron's and Hermione's wands and threw each back to its owner; Harry caught his, stunned.  There, said Lupin, sticking his own wand back into his belt \"You're armed, we're not. Now will you listen?\"  Harry didn't know what to think. Was it a trick?  \"If you haven't been helping him,\" he said, with a furious glance at Black, \"how did you know he was here?\"  \"The map,\" said Lupin. \"The Marauder's Map. I was in my office examining it --\"  \"You know how to work it?\" Harry said suspiciously.  \"Of course I know how to work it,\" said Lupin, waving his hand impatiently. \"I helped write it. I'm Moony -- that was my friends' nickname for me at school.\"  \"You wrote --?\"  \"The important thing is, I was watching it carefully this evening, because I had an idea that you, Ron, and Hermione might try and sneak out of the castle to visit Hagrid before his hippogriff was executed. And I was right, wasn't I\"  He had started to pace up and down, looking at them. Little patches of dust rose at his feet.  \"You might have been wearing your father's old cloak, Harry--\"  \"How d'you know about the cloak?\"  \"The number of times I saw James disappearing under it...,\" said Lupin, waving an impatient hand again. \"The point is, even if you're wearing an Invisibility Cloak, you still show up on the Marauder's Map. I watched you cross the grounds and enter Hagrid's hut. Twenty minutes later, you left Hagrid, and set off back toward the castle. But you were now accompanied by somebody else.\"  \"What?\" said Harry. \"No, we weren't!\"  I couldn't believe my eyes,\" said Lupin, still pacing, and ignoring Harry's interruption. \"I thought the map must be malfunctioning. How could he be with you?\" \"No one was with us!\" said Harry.  \"And then I saw another dot, moving fast toward you, labeled Sirius Black.... I saw him collide with you; I watched as he pulled two of you into the Whomping Willow --\"  \"One of us!\" Ron said angrily.  \"No, Ron,\" said Lupin. \"Two of you.\"  He had stopped his pacing, his eyes moving over Ron.  \"Do you think I could have a look at the rat?\" he said evenly.  \"What?\" said Ron. \"What's Scabbers got to do with it?\"  \"Everything,\" said Lupin. \"Could I see him, please?\"  Ron hesitated, then put a hand inside his robes. Scabbers emerged, thrashing desperately; Ron had to seize his long bald tail to stop him escaping."
}