{
  "id": "5567ee833d21409697130becfea6dadb1bc9ab51",
  "text": " Brandon Stark, Rickon Stark, Arya Stark. Sansa stifled a gasp. Arya. They wanted Arya to present herself and swear an oath… it must mean her sister had fled on the galley, she must be safe at Winterfell by now…  Grand Maester Pycelle rolled up the list, tucked it up his left sleeve, and pulled another parchment from his right. He cleared his throat and resumed.  In the place of the traitor Eddard Stark, it is the wish of His Grace that Tywin Lannister, Lord of Casterly Rock and Warden of the West, take up the office of Hand of the King, to speak with his voice, lead his armies against his enemies, and carry out his royal will. So the king has decreed. The small council consents.   In the place of the traitor Stannis Baratheon, it is the wish of His Grace that his lady mother, the Queen Regent Cersei Lannister, who has ever been his staunchest support, be seated upon his small council, that she may help him rule wisely and with justice. So the king has decreed. The small council consents.   Sansa heard a soft murmuring from the lords around her, but it was quickly stilled. Pycelle continued.   It is also the wish of His Grace that his loyal servant, Janos Slynt, Commander of the City Watch of King’s Landing, be at once raised to the rank of lord and granted the ancient seat of Harrenhal with all its attendant lands and incomes, and that his sons and grandsons shall hold these honors after him until the end of time. It is moreover his command that Lord Slynt be seated immediately upon his small council, to assist in the governance of the realm. So the king has decreed. The small council consents.   Sansa glimpsed motion from the corner of her eye as Janos Slynt made his entrance. This time the muttering was louder and angrier. Proud lords whose houses went back thousands of years made way reluctantly for the balding, frog-faced commoner as he marched past. Golden scales had been sewn onto the black velvet of his doublet and rang together softly with each step. His cloak was checked black-and-gold satin. Two ugly boys who must have been his sons went before him, struggling with the weight of a heavy metal shield as tall as they were. For his sigil he had taken a bloody spear, gold on a night-black field. The sight of it raised goose prickles up and down Sansa’s arms.  As Lord Slynt took his place, Grand Maester Pycelle resumed.  Lastly, in these times of treason and turmoil, with our beloved Robert so lately dead, it is the view of the council that the life and safety of King Joffrey is of paramount importance…  He looked to the queen.  Cersei stood.  Ser Barristan Selmy, stand forth.   Ser Barristan had been standing at the foot of the Iron Throne, as still as any statue, but now he went to one knee and bowed his head.  Your Grace, I am yours to command.    Rise, Ser Barristan,  Cersei Lannister said.  You may remove your helm.    My lady?  Standing, the old knight took off his high white helm, though he did not seem to understand why.   You have served the realm long and faithfully, good ser, and every man and woman in the Seven Kingdoms owes you thanks. Yet now I fear your service is at an end. It is the wish of king and council that you lay down your heavy burden.    My… burden? I fear I… I do not…   The new-made lord, Janos Slynt, spoke up, his voice heavy and blunt.  Her Grace is trying to tell you that you are relieved as Lord Commander of the Kingsguard.   The tall, white-haired knight seemed to shrink as he stood there, scarcely breathing.  Your Grace,  he said at last.  The Kingsguard is a Sworn Brotherhood. Our vows are taken for life. Only death may relieve the Lord Commander of his sacred trust.    Whose death, Ser Barristan?  The queen’s voice was soft as silk, but her words carried the whole length of the hall.  Yours, or your king’s?    You let my father die,  Joffrey said accusingly from atop the Iron Throne.  You’re too old to protect anybody.   Sansa watched as the knight peered up at his new king. She had never seen him look his years before, yet now he did.  Your Grace,  he said.  I was chosen for the White Swords in my twenty-third year. It was all I had ever dreamed, from the moment I first took sword in hand. I gave up all claim to my ancestral keep. The girl I was to wed married my cousin in my place, I had no need of land or sons, my life would be lived for the realm. Ser Gerold Hightower himself heard my vows… to ward the king with all my strength… to give my blood for his… I fought beside the White Bull and Prince Lewyn of Dorne… beside Ser Arthur Dayne, the Sword of the Morning. Before I served your father, I helped shield King Aerys, and his father Jaehaerys before him… three kings…    And all of them dead,  Littlefinger pointed out.   Your time is done,  Cersei Lannister announced.  Joffrey requires men around him who are young and strong. The council has determined that Ser Jaime Lannister will take your place as the Lord Commander of Sworn Brothers of the White Swords.    The Kingslayer,  Ser Barristan said, his voice hard with contempt."
}