{
  "id": "557b79d6c6a032af20eb7b006dae899403d2bb7c",
  "text": " Come, Boromir! We will carry them.'   ####-     Soon afterwards they came  upon another stream that ran down  from  the  west, and joined  its  bubbling water with the hurrying Silverlode. Together   they plunged over a fall of green-hued  stone, and foamed  down into a dell.   About  it stood fir-trees, short and bent,  and  its  sides were  steep  and  clothed with harts-tongue  and shrubs of whortle-berry. At the  bottom there  was  a level  space  through  which the stream flowed  noisily  over shining  pebbles. Here they rested.  It was now  nearly three hours  after noon,  and  they  had  come  only  a few  miles  from  the  Gates. Already  the sun  was  westering.       While Gimli and the two  younger hobbits kindled a  fire of brush-  and  fir-wood, and drew  water, Aragorn tended Sam and Frodo. Sam's wound was  not  deep, but  it looked ugly, and  Aragorn's face  was grave as he examined it.  After a moment he looked up with relief.        'Good luck, Sam! '  he said. 'Many  have received worse  than  this  in  payment for the slaying of their first orc. The  cut is not poisoned, as the  wounds of orc-blades too often are. It should  heal well when  I have tended  it. Bathe it when Gimli has heated water.'       He opened his pouch  and drew out  some withered leaves.  `They are dry  and some of their virtue has one, he said, but here I have still some of the  leaves of athelas that I gathered near Weather top. Crush  one in the  water,  and wash the wound clean, and I will bind it. Now it is your turn. Frodo! '       'I am all right,'  said Frodo, reluctant  to have his garments touched.  `AII I needed was some food and a little rest.'       `No! ' said Aragorn. `We must have a  look and see what the  hammer and  the  anvil have  done  to you. I still marvel  that  you are  alive at all.'  Gently he stripped off Frodo's old jacket and worn tunic, and gave a gasp of  wonder. Then he laughed. The silver corslet shimmered  before his eyes  like  the light upon a rippling sea. Carefully he took it  off and held it up, and  the gems on it glittered like stars.  and the sound of the shaken rings  was  like the tinkle of rain in a pool.       `Look, my friends!' he called.  `H ere's a pretty hobbit -skin to wrap an  elven-princeling in! If it were known that  hobbits had  such hides, all the  hunters of Middle-earth would be riding to the Shire.'       `And all the arrows of all the hunters  in the world would be in vain,'  said  Gimli, gazing at the mail in wonder. `It is a mithril-coat. Mithril! I  have never seen or  heard tell of one so fair. Is this the coat that Gandalf   ####-spoke of? Then he undervalued it. But it was well given! '       `I have  often wondered what you and Bilbo  wer e doing, so close in his  little room,'  said Merry. 'Bless the old hobbit! I love him more than ever.  I hope we get a chance of telling him about it! '       There was a dark and blackened bruise on Frodo's right side and breast.  Under the mail there was a shirt of soft leather, but at one point the rings  had been driven through it into the flesh. Frodo's left side also was scored  and bruised where he had been hurled against the  wall. While the others set   the  food ready.  Aragorn  bathed the hurts  with wa ter in which athelas was  steeped. The pungent fragrance filled  the dell, and all  those who  stooped  over the steaming water felt refreshed and strengthened. Soon Frodo felt the  pain leave him,  and his breath grew  easy: though he was stiff and sore  to  the touch for many days. Aragorn bound some soft pads of cloth at his side.        `The mail is marvellously light,' he said. `Put it on again, if you can  bear it. My heart is glad  to know that you have  such a coat. Do not lay it  aside, even  in sleep,  unless fortune brings you where you  are safe for  a   while; and that will seldom chance while your quest lasts.'       When they  had eaten, the Company got ready to go on. They  put out the   fire and hid all  traces of it. Then climbing out of the dell they  took  to  the  road  again.  They  had  not  gone far before the sun  sank  behind the  westward  heights  and  great  shadows crept down  the mountain-sides.  Dusk   veiled their  feet,  and  mist  rose in the hollows. Away  in  the east  the  evening light lay pale upon the dim lands of distant plain and wood. Sam and  Frodo  now  feeling eased  and greatly refreshed were  able  to go at a fair  pace,  and  with only one brief halt Aragorn  led the Company on  for nearly  three more hours.        It was  dark. Deep  night had fallen. There  were  many clear stars, hut  the fast -waning moon  would not be seen till late. Gimli  and  Frodo were at  the rear, walking softly and not speaking, listening for any sound  upon the  road behind. At length Gimli broke the silence.       'Not a sound but the wind,' he  said. `There are no goblins near, or my  ears are made of wood. It is to be  hoped that the Orcs will be content with  driving us from Moria."
}