{
  "id": "55876f0e8c23b5e85f8b1b1ccbbb071d1fb31272",
  "text": " Some people, like Neville, had paid up just to stop Hermione from glowering at them. A few seemed mildly interested in what she had to say, but were reluctant to take a more active role in campaigning.  Many regarded the whole thing as a joke. Ron now rolled his eyes at the ceiling, which was flooding them all in autumn sunlight, and Fred became extremely interested in his bacon (both twins had refused to buy a S.P.E.W. badge).  George, however, leaned in toward Hermione. \"Listen, have you ever been down in the kitchens, Hermione?\" \"No, of course not,\" said Hermione curtly, \"I hardly think students are supposed to -\" \"Well, we have,\" said George, indicating Fred, \"loads of times, to nick food.  And we've met them, and they're happy.  They think they've got the best job in the world -\" \"That's because they're uneducated and brainwashed!\"  Hermione began hotly, but her next few words were drowned out by the sudden whooshing noise from overhead, which announced the arrival of the post owls.  Harry looked up at once, and saw Hedwig soaring toward him.  Hermione stopped talking abruptly; she and Ron watched Hedwig anxiously as she fluttered down onto Harry's shoulder, folded her wings, and held out her leg wearily. Harry pulled off Sirius's reply and offered Hedwig his bacon rinds, which she ate gratefully.  Then, checking that Fred and George were safely immersed in further discussions about the Triwizard Tournament, Harry read out Sirius's letter in a whisper to Ron and Hermione.  Nice try, Harry. I'm back in the country and well hidden.  I want you to keep me posted on everything that's going on at Hogwarts.  Don't use Hedwig, keep changing owls, and don't worry about me, just watch out for yourself Don't forget what I said about your scar.   Sirius    \"Why d'you have to keep changing owls?\"  Ron asked in a low voice.   \"Hedwig'll attract too much attention,\" said Hermione at once. \"She stands out.  A snowy owl that keeps returning to wherever he's hiding. . . I mean, they're not native birds, are they?\"   Harry rolled up the letter and slipped it inside his robes, wondering whether he felt more or less worried than before.  He supposed that Sirius managing to get back without being caught was something.  He couldn't deny either that the idea that Sirius was much nearer was reassuring; at least he wouldn't have to wait so long for a response every time he wrote. \"Thanks, Hedwig,\" he said, stroking her. She hooted sleepily, dipped her beak briefly into his goblet of orange juice, then took off again, clearly desperate for a good long sleep in the Owlery. There was a pleasant feeling of anticipation in the air that day.  Nobody was very attentive in lessons, being much more interested in the arrival that evening of the people from Beauxbatons and Durmstrang; even Potions was more bearable than usual, as it was half an hour shorter.  When the bell rang early, Harry, Ron, and Hermione hurried up to Gryffindor Tower, deposited their bags and books as they had been instructed, pulled on their cloaks, and rushed back downstairs into the entrance hall. The Heads of Houses were ordering their students into lines. \"Weasley, straighten your hat,\" Professor McGonagall snapped at Ron.  \"Miss Patil, take that ridiculous thing out of your hair.\" Parvati scowled and removed a large ornamental butterfly from the end of her plait. \"Follow me, please,\" said Professor McGonagall.  \"First years in front. . . no pushing.. . They filed down the steps and lined up in front of the castle.  It was a cold, clear evening; dusk was falling and a pale, transparent-looking moon was already shining over the Forbidden Forest.  Harry, standing between Ron and Hermione in the fourth row from the front, saw Dennis Creevey positively shivering with anticipation among the other first years. \"Nearly six,\" said Ron, checking his watch and then staring down the drive that led to the front gates.  \"How d'you reckon they're coming?  The train?\" \"I doubt it,\" said Hermione. \"How, then?  Broomsticks?\"  Harry suggested, looking up at the starry sky.  \"I don't think so. . . not from that far away.. . \"A Portkey?\" Ron suggested.  \"Or they could Apparate - maybe you're allowed to do it under seventeen wherever they come from?\" \"You can't Apparate inside the Hogwarts grounds, how often do I have to tell you?\" said Hermione impatiently. They scanned the darkening grounds excitedly, but nothing was moving; everything was still, silent, and quite as usual.  Harry was starting to feel cold.  He wished they'd hurry up. .. . Maybe the foreign students were preparing a dramatic entrance. . . . He remembered what Mr. Weasley had said back at the campsite before the Quidditch World Cup:  \"always the same - we can't resist showing off when we get together. ..\" And then Dumbledore called out from the back row where he stood with the other teachers - \"Aha!  Unless I am very much mistaken, the delegation from Beauxbatons approaches!\" \"Where?\" said many students eagerly, all looking in different directions."
}