{
  "id": "55c0e965e3f4cfa03a5e4ce96c0435efece77531",
  "text": " \"Must have squeezed it too hard. Did the same thing at Colonel Fubster's the other day. No need to fuss, Petunia, I have a very firm grip...\"  But Aunt Petunia and Uncle Vernon were both looking at Harry suspiciously, so he decided he'd better skip dessert and escape from the table as soon as he could.  Outside in the hall, he leaned against the wall, breathing deeply It had been a long time since he'd lost control and made something explode. He couldn't afford to let it happen again. The Hogsmeade form wasn't the only thing at stake -- if he carried on like that, he'd be in trouble with the Ministry of Magic.  Harry was still an underage wizard, and he was forbidden by wizard law to do magic outside school. His record wasn't exactly clean either. Only last summer he'd gotten an official warning that had stated quite clearly that if the Ministry got wind of any more magic in Privet Drive, Harry would face expulsion from Hogwarts.  He heard the Dursleys leaving the table and hurried upstairs out of the way.  Harry got through the next three days by forcing himself to think about his Handbook of Do-It-Yourself Broomcare whenever Aunt Marge started on him. This worked quite well, though it seemed to give him a glazed look, because Aunt Marge started voicing the opinion that he was mentally subnormal.  At last, at long last, the final evening of Marge's stay arrived. Aunt Petunia cooked a fancy dinner and Uncle Vernon uncorked several bottles of wine. They got all the way through the soup and the salmon without a single mention of Harry's faults; during the lemon meringue pie, Uncle Vernon bored them A with a long talk about Grunnings, his drill-making company; then Aunt Petunia made coffee and Uncle Vernon brought out a bottle of brandy.  \"Can I tempt you, Marge?\"  Aunt Marge had already had quite a lot of wine. Her huge face was very red.  \"Just a small one, then,\" she chuckled. \"A bit more than that... and a bit more... that's the ticket.\"  Dudley was eating his fourth slice of pie. Aunt Petunia was sipping coffee with her little finger sticking out. Harry really wanted to disappear into his bedroom, but he met Uncle Vernon's angry little eyes and knew he would have to sit it out.  \"Aah,\" said Aunt Marge, smacking her lips and putting the empty brandy glass back down. \"Excellent nosh, Petunia. It's normally just a fry-up for me of an evening, with twelve dogs to look after....\" She burped richly and patted her great tweed stomach. \"Pardon me. But I do like to see a healthy-sized boy,\" she went on, winking at Dudley. \"You'll be a proper-sized man, Dudders, like your father. Yes, I'll have a spot more brandy, Vernon....\"  \"Now, this one here --\"  She jerked her head at Harry, who felt his stomach clench. The Handbook, he thought quickly.  \"This one's got a mean, runty look about him. You get that with dogs. I had Colonel Fubster drown one last year. Ratty little thing it was- Weak. Underbred.\"  Harry was trying to remember page twelve of his book: A Charm to Cure Reluctant Reversers. \"It all comes down to blood, as I was saying the other day.  Bad blood will out. Now, I'm saying nothing against your family, Petunia\" she patted Aunt Petunia's bony hand with her shovellike one \"but your sister was a bad egg. They turn up in the best families. Then she ran off with a wastrel and here's the result right in front of us.\"  Harry was staring at his plate, a funny ringing in his ears. Grasp your broom firmly by the tail, he thought. But he couldn't remember what came next. Aunt Marge's voice seemed to be boring into him like one of Uncle Vernon's drills.  \"This Potter, 5) said Aunt Marge loudly, seizing the brandy bottle and splashing more into her glass and over the tablecloth, \"you never told me what he did?\"  Uncle Vernon and Aunt Petunia were looking extremely tense. Dudley had even looked up from his pie to gape at his parents.  \"He -- didn't work,\" said Uncle Vernon, with half a glance at Harry. \"Unemployed.\"  \"As I expected!\" said Aunt Marge, taking a huge swig of brandy and wiping her chin on her sleeve. \"A no-account, good-for-nothing, lazy scrounger who --\"  \"He was not,\" said Harry suddenly. The table went very quiet. Harry was shaking all over. He had never felt so angry in his life.  \"MORE BRANDY!\" yelled Uncle Vernon, who had gone very white. He emptied the bottle into Aunt Marge's glass. \"You, boy,\" he snarled at Harry. \"Go to bed, go on --\"  \"No, Vernon,\" hiccuped Aunt Marge, holding up a hand, her tiny bloodshot eyes fixed on Harry's. \"Go on, boy, go on. Proud of your parents, are you? They go and get themselves killed in a car crash (drunk, I expect) --\"  'They didn't die in a car crash!\" said Harry, who found himself on his feet.  \"They died in a car crash, you nasty little liar, and left you to be a burden on their decent, hardworking relatives!\" screamed Aunt Marge, swelling with fury. \"You are an insolent, ungrateful little --\"  But Aunt Marge suddenly stopped speaking. For a moment, it looked as though words had failed her."
}