{
  "id": "55da1cb0a6fe8db05807e76d7dbd9e051f9f8a84",
  "text": " Mail gauntlets hid his wasted hands, and made him look almost strong again. His massive oak-and-iron shield was set by his left side, his hunting horn to his right. The rest of the boat was filled with driftwood and kindling and scraps of parchment, and stones to make it heavy in the water. His banner flew from the prow, the leaping trout of Riverrun.  Seven were chosen to push the funereal boat to the water, in honor of the seven faces of god. Robb was one, Lord Hoster’s liege lord. With him were the Lords Bracken, Blackwood, Vance, and Mallister, Ser Marq Piper… and Lame Lothar Frey, who had come down from the Twins with the answer they had awaited. Forty soldiers rode in his escort, commanded by Walder Rivers, the eldest of Lord Walder’s bastard brood, a stern, grey-haired man with a formidable reputation as a warrior. Their arrival, coming within hours of Lord Hoster’s passing, had sent Edmure into a rage.  Walder Frey should be flayed and quartered!  he’d shouted.  He sends a cripple and a bastard to treat with us, tell me there is no insult meant by that.    I have no doubt that Lord Walder chose his envoys with care,  she replied.  It was a peevish thing to do, a petty sort of revenge, but remember who we are dealing with. The Late Lord Frey, Father used to call him. The man is ill-tempered, envious, and above all prideful.   Blessedly, her son had shown better sense than her brother. Robb had greeted the Freys with every courtesy, found barracks space for the escort, and quietly asked Ser Desmond Grell to stand aside so Lothar might have the honor of helping to send Lord Hoster on his last voyage. He has learned a rough wisdom beyond his years, my son. House Frey might have abandoned the King in the North, but the Lord of the Crossing remained the most powerful of Riverrun’s bannermen, and Lothar was here in his stead.  The seven launched Lord Hoster from the water stair, wading down the steps as the portcullis was winched upward. Lothar Frey, a soft-bodied portly man, was breathing heavily as they shoved the boat out into the current. Jason Mallister and Tytos Blackwood, at the prow, stood chest deep in the river to guide it on its way.  Catelyn watched from the battlements, waiting and watching as she had waited and watched so many times before. Beneath her, the swift wild Tumblestone plunged like a spear into the side of the broad Red Fork, its blue-white current churning the muddy red-brown flow of the greater river. A morning mist hung over the water, as thin as gossamer and the wisps of memory.  Bran and Rickon will be waiting for him, Catelyn thought sadly, as once I used to wait.  The slim boat drifted out from under the red stone arch of the Water Gate, picking up speed as it was caught in the headlong rush of the Tumblestone and pushed out into the tumult where the waters met. As the boat emerged from beneath the high sheltering walls of the castle, its square sail filled with wind, and Catelyn saw sunlight flashing on her father’s helm. Lord Hoster Tully’s rudder held true, and he sailed serenely down the center of the channel, into the rising sun.   Now,  her uncle urged. Beside him, her brother Edmure—Lord Edmure now in truth, and how long would that take to grow used to?—nocked an arrow to his bowstring. His squire held a brand to its point. Edmure waited until the flame caught, then lifted the great bow, drew the string to his ear, and let fly. With a deep thrum, the arrow sped upward. Catelyn followed its flight with her eyes and heart, until it plunged into the water with a soft hiss, well astern of Lord Hoster’s boat.  Edmure cursed softly.  The wind,  he said, pulling a second arrow.  Again.  The brand kissed the oil-soaked rag behind the arrowhead, the flames went licking up, Edmure lifted, pulled, and released. High and far the arrow flew. Too far. It vanished in the river a dozen yards beyond the boat, its fire winking out in an instant. A flush was creeping up Edmure’s neck, red as his beard.  Once more,  he commanded, taking a third arrow from the quiver. He is as tight as his bowstring, Catelyn thought.  Ser Brynden must have seen the same thing.  Let me, my lord,  he offered.   I can do it,  Edmure insisted. He let them light the arrow, jerked the bow up, took a deep breath, drew back the arrow. For a long moment he seemed to hesitate while the fire crept up the shaft, crackling. Finally he released. The arrow flashed up and up, and finally curved down again, falling, falling… and hissing past the billowing sail.  A narrow miss, no more than a handspan, and yet a miss.  The Others take it!  her brother swore. The boat was almost out of range, drifting in and out among the river mists. Wordless, Edmure thrust the bow at his uncle.   Swiftly,  Ser Brynden said, He nocked an arrow, held it steady for the brand, drew and released before Catelyn was quite sure that the fire had caught… but as the shot rose, she saw the flames trailing through the air, a pale orange pennon. The boat had vanished in the mists."
}