{
  "id": "565acf095ac37998342f7f7f62b99e6574d2b4c4",
  "text": "  \"Then you might not have to witness an execution at A!\" said Eon stoutly. \"The hippogriff might get off!\"  Before Fudge could answer, two wizards came through the castle doors behind him. One was so ancient he appeared to be withering before their very eyes; the other was tall and strapping, with a thin back mustache. Harry gathered that they were representatives of the Committee for the Disposal of Dangerous Creatures, because tie very old wizard squinted toward Hagrid's cabin and said in a feeble voice, \"Dear, dear, I'm getting too old for this.... Two o'clock, isn't it, Fudge?\"  The black-mustached man was fingering something in his belt; Harry looked and saw that he was running one broad thumb along the blade of a shining axe. Ron opened his mouth to say something, but Hermione nudged him hard in the ribs and jerked her head toward the entrance hall.  \"Why'd you stop me?\" said Ron angrily as they entered the Great Hall for lunch. \"Did you see them? They've even got the axe ready! This isn't justice!\"  \"Ron, your dad works for the Ministry, you can't go saying things like that to his boss!\" said Hermione, but she too looked very upset. \"As long as Hagrid keeps his head this time, and argue, hi case properly, they can't possibly execute Buckbeak....\"  But Harry could tell Hermione didn't really believe what she was saying. All around them, people were talking excitedly as they ate their lunch, happily anticipating the end of the exams that afternoon, but Harry, Ron, and Hermione, lost in worry about Hagrid and Buckbeak, didn't join in.  Harry's and Ron's last exam was Divination; Hermione's, Muggle Studies. They walked up the marble staircase together; Hermione left them on the first floor and Harry and Ron proceeded all the way up to the seventh, where many of their class were sitting on the spiral staircase to Professor Trelawney's classroom, trying to cram in a bit of last-minute studying.  \"She's seeing us all separately,\" Neville informed them as they went to sit down next to him. He had his copy of Unfogging the Future open on his lap at the pages devoted to crystal gazing. \"Have either of you ever seen anything in a crystal ball?\" he asked them unhappily.  \"Nope,\" said Ron in an offhand voice. He kept checking his watch; Harry. knew that he was counting down the time until Buckbeak's appeal started.  The line of people outside the classroom shortened very slowly. As each person climbed back down the silver ladder, the rest of the class hissed, \"What did she ask? Was it okay?\"  But they all refused to say.  \"She says the crystal ball's told her that if I tell you, I'll have a horrible accident!\" squeaked Neville as he clambered back down the ladder toward Harry and Ron, who had now reached the landing.  \"That's convenient,\" snorted Ron. \"You know, I'm starting to think Hermione was right about her\" -- he jabbed his thumb toward the trapdoor overhead -- \"she's a right old fraud.\"  \"Yeah,\" said Harry, looking at his own watch. It-was now two o'clock. \"Wish she'd hurry up...\"  Parvati came back down the ladder glowing with pride.  \"She says I've got all the makings of a true Seer,\" she informed Harry and Ron. \"I saw loads of stuff... Well, good luck!\"  She hurried off down the spiral staircase toward Lavender.  \"Ronald Weasley,\" said the familiar, misty voice from over their heads. Ron grimaced at Harry and climbed the silver ladder out of sight. Harry was now the only person left to be tested. He settled himself on the floor with his back against the wall, listening to a fly buzzing in the sunny window, his mind across the grounds with Hagrid.  Finally, after about twenty minutes, Ron's large feet reappeared on the ladder.  \"How'd it go?\" Harry asked him, standing up.  \"Rubbish,\" said Ron. \"Couldn't see a thing, so I made some stuff up. Don't think she was convinced, though....\"  \"Meet you in the common room,\" Harry muttered as Professor Trelawney's voice called, \"Harry Potter!\"  The tower room was hotter than ever before; the curtains were closed, the fire was alight, and the usual sickly scent made Harry cough as he stumbled through the clutter of chairs and table to where Professor Trelawney sat waiting for him before a large crystal ball.  \"Good day, my dear,\" she said softly. \"If you would kindly gaze into the Orb.... Take your time, now... then tell me what you see within it....\"  Harry bent over the crystal ball and stared, stared as hard as he could, willing it to show him something other than swirling white fog, but nothing happened.  \"Well?\" Professor Trelawney prompted delicately. \"What do you see?\"  The heat was overpowering and his nostrils were stinging with the perfumed smoke wafting from the fire beside them. He thought of what Ron had just said, and decided to pretend.  \"Er --\" said Harry, \"a dark shape... um...\"  \"What does it resemble?\" whispered Professor Trelawney. \"Think, now...\"  Harry cast his mind around and it landed on Buckbeak.  \"A hippogriff,\" he said firmly.  \"Indeed!\" whispered Professor Trelawney, scribbling keenly on the parchment perched upon her knees."
}