{
  "id": "569743d025bea576eef171c42cbbd2ec3211fd68",
  "text": " Another spasm of pain twisted up his leg, and the next he knew he was flat on his back again.  There’s some mistake,  he insisted.  At Queenscrown I saw a direwolf, a grey direwolf… grey… it knew me.  If Bran was dead, could some part of him live on in his wolf, as Orell lived within his eagle?   Drink this.  Grenn held a cup to his lips. Jon drank. His head was full of wolves and eagles, the sound of his brothers’ laughter. The faces above him began to blur and fade. They can’t be dead. Theon would never do that. And Winterfell… grey granite, oak and iron, crows wheeling around the towers, steam rising off the hot pools in the godswood, the stone kings sitting on their thrones… how could Winterfell be gone?  When the dreams took him, he found himself back home once more, splashing in the hot pools beneath a huge white weirwood that had his father’s face. Ygritte was with him, laughing at him, shedding her skins till she was naked as her name day, trying to kiss him, but he couldn’t, not with his father watching. He was the blood of Winterfell, a man of the Night’s Watch. I will not father a bastard, he told her. I will not. I will not.  You know nothing, Jon Snow,  she whispered, her skin dissolving in the hot water, the flesh beneath sloughing off her bones until only skull and skeleton remained, and the pool bubbled thick and red.      Catelyn   They heard the Green Fork before they saw it, an endless susurrus, like the growl of some great beast. The river was a boiling torrent, half again as wide as it had been last year, when Robb had divided his army here and vowed to take a Frey to bride as the price of his crossing. He needed Lord Walder and his bridge then, and he needs them even more now. Catelyn’s heart was full of misgivings as she watched the murky green waters swirl past. There is no way we will ford this, nor swim across, and it could be a moon’s turn before these waters fall again.  As they neared the Twins, Robb donned his crown and summoned Catelyn and Edmure to ride beside him. Ser Raynald Westerling bore his banner, the direwolf of Stark on its ice-white field.  The gatehouse towers emerged from the rain like ghosts, hazy grey apparitions that grew more solid the closer they rode. The Frey stronghold was not one castle but two; mirror images in wet stone standing on opposite sides of the water, linked by a great arched bridge. From the center of its span rose the Water Tower, the river running straight and swift below. Channels had been cut from the banks, to form moats that made each twin an island. The rains had turned the moats to shallow lakes.  Across the turbulent waters, Catelyn could see several thousand men encamped around the eastern castle, their banners hanging like so many drowned cats from the lances outside their tents. The rain made it impossible to distinguish colors and devices. Most were grey, it seemed to her, though beneath such skies the whole world seemed grey.   Tread lightly here, Robb,  she cautioned her son.  Lord Walder has a thin skin and a sharp tongue, and some of these sons of his will doubtless take after their father. You must not let yourself be provoked.    I know the Freys, Mother. I know how much I wronged them, and how much I need them. I shall be as sweet as a septon.   Catelyn shifted her seat uncomfortably.  If we are offered refreshment when we arrive, on no account refuse. Take what is offered, and eat and drink where all can see. If nothing is offered, ask for bread and cheese and a cup of wine.    I’m more wet than hungry…    Robb, listen to me. Once you have eaten of his bread and salt, you have the guest right, and the laws of hospitality protect you beneath his roof.   Robb looked more amused than afraid.  I have an army to protect me, Mother, I don’t need to trust in bread and salt. But if it pleases Lord Walder to serve me stewed crow smothered in maggots, I’ll eat it and ask for a second bowl.   Four Freys rode out from the western gatehouse, wrapped in heavy cloaks of thick grey wool. Catelyn recognized Ser Ryman, son of the late Ser Stevron, Lord Walder’s firstborn. With his father dead, Ryman was heir to the Twins. The face she saw beneath his hood was fleshy, broad, and stupid. The other three were likely his own sons, Lord Walder’s great grandsons.  Edmure confirmed as much.  Edwyn is eldest, the pale slender man with the constipated look. The wiry one with the beard is Black Walder, a nasty bit of business. Petyr is on the bay, the lad with the unfortunate face. Petyr Pimple, his brothers call him. Only a year or two older than Robb, but Lord Walder married him off at ten to a woman thrice his age. Gods, I hope Roslin doesn’t take after him.   They halted to let their hosts come to them. Robb’s banner drooped on its staff, and the steady sound of rainfall mingled with the rush of the swollen Green Fork on their right. Grey Wind edged forward, tail stiff, watching through slitted eyes of dark gold. When the Freys were a half-dozen yards away Catelyn heard him growl, a deep rumble that seemed almost one with rush of the river."
}