{
  "id": "56d2f2c684703fabbfe3818ef20f870edc5be059",
  "text": " Crouch raised his eyebrows at Bagman. \"We agreed not to make the announcement until all the details -\" \"Oh details!\"  said Bagman, waving the word away like a cloud of midges.  \"They've signed, haven't they?  They've agreed, haven't they?  I bet you anything these kids'll know soon enough anyway.  I mean, it's happening at Hogwarts -\" \"Ludo, we need to meet the Bulgarians, you know,\" said Mr. Crouch sharply, cutting Bagman's remarks short.  \"Thank you for the tea, Weatherby.\" He pushed his undrunk tea back at Percy and waited for Ludo to rise; Bagman struggled to his feet, swigging down the last of his tea, the gold in his pockets chinking merrily. \"See you all later!\"  he said. \"You'll be up in the Top Box with me - I'm commentating!\"  He waved, Barty Crouch nodded curtly, and both of them Disapparated. \"What's happening at Hogwarts, Dad?\"  said Fred at once.  \"What were they talking about?\" \"You'll find out soon enough,\" said Mr.Weasley, smiling. \"It's classified information, until such time as the Ministry decides to release it,\" said Percy stiffly.  \"Mr. Crouch was quite right not to disclose it.\" \"Oh shut up, Weatherby,\" said Fred. A sense of excitement rose like a palpable cloud over the campsite as the afternoon wore on.  By dusk, the still summer air itself seemed to be quivering with anticipation, and as darkness spread like a curtain over the thousands of waiting wizards, the last vestiges of pretence disappeared:  the Ministry seemed to have bowed to the inevitable and stopped fighting the signs of blatant magic now breaking out everywhere. Salesmen were Apparating every few feet, carrying trays and pushing carts full of extraordinary merchandise.  There were luminous rosettes - green for Ireland, red for Bulgaria - which were squealing the names of the players, pointed green hats bedecked with dancing shamrocks, Bulgarian scarves adorned with lions that really roared, flags from both countries that played their national anthems as they were waved; there were tiny models of Firebolts that really flew, and collectible figures of famous players, which strolled across the palm of your hand, preening themselves. \"Been saving my pocket money all summer for this,\" Ron told Harry as they and Hermione strolled through the salesmen, buying souvenirs.  Though Ron purchased a dancing shamrock hat and a large green rosette, he also bought a small figure of Viktor Krum, the Bulgarian Seeker.  The miniature Krum walked backward and forward over Ron's hand, scowling up at the green rosette above him. \"Wow, look at these!\"  said Harry, hurrying over to a cart piled high with what looked like brass binoculars, except that they were covered with all sorts of weird knobs and dials. \"Omnioculars,\" said the saleswizard eagerly.  \"You can replay action ... slow everything down ... and they flash up a play-by- play breakdown if you need it.  Bargain - ten Galleons each.\" \"Wish I hadn't bought this now,\" said Ron, gesturing at his dancing shamrock hat and gazing longingly at the Omnioculars. \"Three pairs,\" said Harry firmly to the wizard. \"No - don't bother,\" said Ron, going red.  He was always touchy about the fact that Harry, who had inherited a small fortune from his parents, had much more money than he did. \"You won't be getting anything for Christmas,\" Harry told him, thrusting Omnioculars into his and Hermione's hands.  \"For about ten years, mind.\" \"Fair enough,\" said Ron, grinning. \"Oooh, thanks, Harry,\" said Hermione.  \"And I'll get us some programs, look -\" Their money bags considerably lighter, they went back to the tents.  Bill, Charlie, and Ginny were all sporting green rosettes too, and Mr. Weasley was carrying an Irish flag.  Fred and George had no souvenirs as they had given Bagman all their gold. And then a deep, booming gong sounded somewhere beyond the woods, and at once, green and red lanterns blazed into life in the trees, lighting a path to the field. \"It's time!\" said Mr. Weasley, looking as excited as any of them.  \"Come on, let's go!\"  CHAPTER EIGHT - THE QUIDDITCH WORLD CUP  Clutching their purchases, Mr. Weasley in the lead, they all hurried into the wood, following the lantern-lit trail.  They could hear the sounds of thousands of people moving around them, shouts and laughter, snatches of singing.  The atmosphere of feverish excitement was highly infectious; Harry couldn't stop grinning.  They walked through the wood for twenty minutes, talking and joking loudly, until at last they emerged on the other side and found themselves in the shadow of a gigantic stadium.  Though Harry could see only a fraction of the immense gold walls surrounding the field, he could tell that ten cathedrals would fit comfortably inside it. \"Seats a hundred thousand,\" said Mr. Weasley, spotting the awestruck look on Harry's face.  \"Ministry task force of five hundred have been working on it all year.  Muggle Repelling Charms on every inch of it.  Every time Muggles have got anywhere near here all year, they've suddenly remembered urgent appointments and had to dash away again ."
}