{
  "id": "5707120b9b1bacd66ab7a2ca32838d56c1494a8f",
  "text": " You’ve had your share of grief, I know. We are sorry for your losses.   Sansa glanced at Margaery.  I was saddened when I heard of Lord Renly’s death, Your Grace. He was very gallant.    You are kind to say so,  answered Margaery.  Her grandmother snorted.  Gallant, yes, and charming, and very clean. He knew how to dress and he knew how to smile and he knew how to bathe, and somehow he got the notion that this made him fit to be king. The Baratheons have always had some queer notions, to be sure. It comes from their Targaryen blood, I should think.  She sniffed.  They tried to marry me to a Targaryen once, but I soon put an end to that.    Renly was brave and gentle, Grandmother,  said Margaery.  Father liked him as well, and so did Loras.    Loras is young,  Lady Olenna said crisply,  and very good at knocking men off horses with a stick. That does not make him wise. As to your father, would that I’d been born a peasant woman with a big wooden spoon, I might have been able to beat some sense into his fat head.    Mother,  Lady Alerie scolded.   Hush, Alerie, don’t take that tone with me. And don’t call me Mother. If I’d given birth to you, I’m sure I’d remember. I’m only to blame for your husband, the lord oaf of Highgarden.    Grandmother,  Margaery said,  mind your words, or what will Sansa think of us?     She might think we have some wits about us. One of us, at any rate.  The old woman turned back to Sansa.  It’s treason, I warned them, Robert has two sons, and Renly has an older brother, how can he possibly have any claim to that ugly iron chair? Tut-tut, says my son, don’t you want your sweetling to be queen? You Starks were kings once, the Arryns and the Lannisters as well, and even the Baratheons through the female line, but the Tyrells were no more than stewards until Aegon the Dragon came along and cooked the rightful King of the Reach on the Field of Fire. If truth be told, even our claim to Highgarden is a bit dodgy, just as those dreadful Florents are always whining. ‘What does it matter?’ you ask, and of course it doesn’t, except to oafs like my son. The thought that one day he may see his grandson with his arse on the Iron Throne makes Mace puff up like… now, what do you call it? Margaery, you’re clever, be a dear and tell your poor old half-daft grandmother the name of that queer fish from the Summer Isles that puffs up to ten times its own size when you poke it.    They call them puff fish, Grandmother.    Of course they do. Summer Islanders have no imagination. My son ought to take the puff fish for his sigil, if truth be told. He could put a crown on it, the way the Baratheons do their stag, mayhap that would make him happy. We should have stayed well out of all this bloody foolishness if you ask me, but once the cow’s been milked there’s no squirting the cream back up her udder. After Lord Puff Fish put that crown on Renly’s head, we were into the pudding up to our knees, so here we are to see things through. And what do you say to that, Sansa?   Sansa’s mouth opened and closed. She felt very like a puff fish herself.  The Tyrells can trace their descent back to Garth Greenhand,  was the best she could manage at short notice.  The Queen of Thorns snorted.  So can the Florents, the Rowans, the Oakhearts, and half the other noble houses of the south. Garth liked to plant his seed in fertile ground, they say. I shouldn’t wonder that more than his hands were green.    Sansa,  Lady Alerie broke in,  you must be very hungry. Shall we have a bite of boar together, and some lemon cakes?    Lemon cakes are my favorite,  Sansa admitted.   So we have been told,  declared Lady Olenna, who obviously had no intention of being hushed.  That Varys creature seemed to think we should be grateful for the information. I’ve never been quite sure what the point of a eunuch is, if truth be told. It seems to me they’re only men with the useful bits cut off. Alerie, will you have them bring the food, or do you mean to starve me to death? Here, Sansa, sit here next to me, I’m much less boring than these others. I hope that you’re fond of fools.   Sansa smoothed down her skirts and sat.  I think… fools, my lady? You mean… the sort in motley?    Feathers, in this case. What did you imagine I was speaking of? My son? Or these lovely ladies? No, don’t blush, with your hair it makes you look like a pomegranate. All men are fools, if truth be told, but the ones in motley are more amusing than ones with crowns. Margaery, child, summon Butterbumps, let us see if we can’t make Lady Sansa smile. The rest of you be seated, do I have to tell you everything? Sansa must think that my granddaughter is attended by a flock of sheep.   Butterbumps arrived before the food, dressed in a jester’s suit of green and yellow feathers with a floppy coxcomb. An immense round fat man, as big as three Moon Boys, he came cartwheeling into the hall, vaulted onto the table, and laid a gigantic egg right in front of Sansa.  Break it, my lady,  he commanded."
}