{
  "id": "578a4dac47de66f70a9e5ce763669f3c20a985d3",
  "text": "  \"It's okay, Hermione,\" said Harry quickly. \"We'll take you up to the hospital wing. Madam Pomfrey never asks too many questions ......  It took a long time to persuade Hermione to leave the bathroom. Moaning Myrtle sped them on their way with a hearty guffaw. \"Wait till everyone finds out you've got a tail!\"  ermione remained in the hospital wing for several weeks. There was a flurry of rumor about her disappearance when the rest of the school arrived back from their Christmas holidays, because of course everyone thought that she had been attacked. So many students filed past the hospital wing trying to catch a glimpse of her that Madam Pomfrey took out her curtains again and placed them around Hermione's bed, to spare her the shame of being seen with a furry face.  Harry and Ron went to visit her every evening. When the new term started, they brought her each day's homework.  \"If Id sprouted whiskers, Id take a break from work,\" said Ron, tipping a stack of books onto Hermione's bedside table one evening.  \"Don't be silly, Ron, I've got to keep up,\" said Hermione briskly. Her spirits were greatly improved by the fact that all the hair had  * \"21 *    gone from her face and her eyes were turning slowly back to brown. \"I don't suppose you've got any new leads?\" she added in a whisper, so that Madam Pomfrey couldn't hear her.  \"Nothing,\" said Harry gloomily.  \"I was so sure it was Malfoy,\" said Ron, for about the hundredth time.  \"What's that?\" asked Harry, pointing to something gold sticking out from under Hermione's pillow.  \"Just a get well card,\" said Hermione hastily, trying to poke it out of sight, but Ron was too quick for her. He pulled it out, flicked it open, and read aloud:  \"To Miss Granger, wishing you a speedy recovery, from your concerned teacher, Professor Gilderoy Lockhart, Order of Merlin, Third Class, Honorary Member of the Dark Force Defense League, and five-time winner of Witch Weekly's Most- Charming-Smile Award. \"  Ron looked up at Hermione, disgusted.  \"You sleep with this under your pillow?\"  But Hermione was spared answering by Madam Pomfrey sweeping over with her evening dose of medicine.  \"Is Lockhart the smarmiest bloke you've ever met, or what?\" Ron said to Harry as they left the infirmary and started up the stairs toward Gryffindor Tower. Snape had given them so much homework, Harry thought he was likely to be in the sixth year before he finished it. Ron was just saying he wished he had asked Hermione how many rat tails you were supposed to add to a HairRaising Potion when an angry outburst from the floor above reached their ears.  \"That's Filch,\" Harry muttered as they hurried up the stairs and paused, out of sight, listening hard.  * 228*  \"You don't think someone else's been attacked?\" said Ron tensely.  They stood still, their heads inclined toward Flich's voice, which sounded quite hysterical.  `= even more work for me! Mopping all night, like I haven't got enough to do! No, this is the final straw, I'm going to Dumbledore -\"  His footsteps receded along the out-of-sight corridor and they heard a distant door slam.  They poked their heads around the corner. Filch had clearly been manning his usual lookout post: They were once again on the spot where Mrs. Norris had been attacked. They saw at a glance what Filch had been shouting about. A great flood of water stretched over half the corridor, and it looked as though it was still seeping from under the door of Moaning Myrtle's bathroom. Now that Filch had stopped shouting, they could hear Myrtle's wails echoing off the bathroom walls.  \"Now what's up with her?\" said Ron.  \"Let's go and see,\" said Harry, and holding their robes over their ankles they stepped through the great wash of water to the door bearing its OUT OF ORDER sign, ignored it as always, and entered.  Moaning Myrtle was crying, if possible, louder and harder than ever before. She seemed to be hiding down her usual toilet. It was dark in the bathroom because the candles had been extinguished in the great rush of water that had left both walls and floor soaking wet.  \"What's up, Myrtle?\" said Harry.  \"Who's that?\" glugged Myrtle miserably. \"Come to throw something else at me?\"  Harry waded across to her stall and said, \"Why would I throw something at you?\"  *229*  \"Don't ask me,\" Myrtle shouted, emerging with a wave of yet more water, which splashed onto the already sopping floor. \"Here I am, minding my own business, and someone thinks it's funny to throw a book at me ......  \"But it can't hurt you if someone throws something at you,\" said Harry, reasonably. \"I mean, it'd just go right through you, wouldn't it?\"  He had said the wrong thing. Myrtle puffed herself up and shrieked, \"Let's all throw books at Myrtle, because she can't feel it! Ten points if you can get it through her stomach! Fifty points if it goes through her head! Well, ha, ha, ha! What a lovely game, I don't think!\"  \"Who threw it at you, anyway?\" asked Harry.  \"I don't know... I was just sitting in the U-bend, thinking about death, and it fell right through the top of my head,\" said Myrtle, glaring at them."
}