{
  "id": "57963e5930b6dc6ce79948794435bccf502d1f3a",
  "text": "  No,  Ned had told him, bemused. Could it be that Lord Renly, who looked so like a young Robert, had conceived a passion for a girl he fancied to be a young Lyanna? That struck him as more than passing queer.  Jory held out the doublet, and Ned slid his hands through the armholes.  Perhaps Lord Stannis will return for Robert’s tourney,  he said as Jory laced the garment up the back.   That would be a stroke of fortune, my lord,  Jory said.  Ned buckled on a longsword.  In other words, not bloody likely.  His smile was grim.  Jory draped Ned’s cloak across his shoulders and clasped it at the throat with the Hand’s badge of office.  The armorer lives above his shop, in a large house at the top of the Street of Steel. Alyn knows the way, my lord.   Ned nodded.  The gods help this potboy if he’s sent me off haring after shadows.  It was a slim enough staff to lean on, but the Jon Arryn that Ned Stark had known was not one to wear jeweled and silvered plate. Steel was steel; it was meant for protection, not ornament. He might have changed his views, to be sure. He would scarcely have been the first man who came to look on things differently after a few years at court… but the change was marked enough to make Ned wonder.   Is there any other service I might perform?    I suppose you’d best begin visiting whorehouses.    Hard duty, my lord.  Jory grinned.  The men will be glad to help. Porther has made a fair start already.   Ned’s favorite horse was saddled and waiting in the yard. Varly and Jacks fell in beside him as he rode through the yard. Their steel caps and shirts of mail must have been sweltering, yet they said no word of complaint. As Lord Eddard passed beneath the King’s Gate into the stink of the city, his grey and white cloak streaming from his shoulders, he saw eyes everywhere and kicked his mount into a trot. His guard followed.  He looked behind him frequently as they made their way through the crowded city streets. Tomard and Desmond had left the castle early this morning to take up positions on the route they must take, and watch for anyone following them, but even so, Ned was uncertain. The shadow of the King’s Spider and his little birds had him fretting like a maiden on her wedding night.  The Street of Steel began at the market square beside the River Gate, as it was named on maps, or the Mud Gate, as it was commonly called. A mummer on stilts was striding through the throngs like some great insect, with a horde of barefoot children trailing behind him, hooting. Elsewhere, two ragged boys no older than Bran were dueling with sticks, to the loud encouragement of some and the furious curses of others. An old woman ended the contest by leaning out of her window and emptying a bucket of slops on the heads of the combatants. In the shadow of the wall, farmers stood beside their wagons, bellowing out,  Apples, the best apples, cheap at twice the price,  and  Blood melons, sweet as honey,  and  Turnips, onions, roots, here you go here, here you go, turnips, onions, roots, here you go here.   The Mud Gate was open, and a squad of City Watchmen stood under the portcullis in their golden cloaks, leaning on spears. When a column of riders appeared from the west, the guardsmen sprang into action, shouting commands and moving the carts and foot traffic aside to let the knight enter with his escort. The first rider through the gate carried a long black banner. The silk rippled in the wind like a living thing; across the fabric was blazoned a night sky slashed with purple lightning.  Make way for Lord Beric!  the rider shouted.  Make way for Lord Beric!  And close behind came the young lord himself, a dashing figure on a black courser, with red-gold hair and a black satin cloak dusted with stars.  Here to fight in the Hand’s tourney, my lord?  a guardsman called out to him.  Here to win the Hand’s tourney,  Lord Beric shouted back as the crowd cheered.  Ned turned off the square where the Street of Steel began and followed its winding path up a long hill, past blacksmiths working at open forges, freeriders haggling over mail shirts, and grizzled ironmongers selling old blades and razors from their wagons. The farther they climbed, the larger the buildings grew. The man they wanted was all the way at the top of the hill, in a huge house of timber and plaster whose upper stories loomed over the narrow street. The double doors showed a hunting scene carved in ebony and weirwood. A pair of stone knights stood sentry at the entrance, armored in fanciful suits of polished red steel that transformed them into griffin and unicorn. Ned left his horse with Jacks and shouldered his way inside.  The slim young serving girl took quick note of Ned’s badge and the sigil on his doublet, and the master came hurrying out, all smiles and bows.  Wine for the King’s Hand,  he told the girl, gesturing Ned to a couch.  I am Tobho Mott, my lord, please, please, put yourself at ease.  He wore a black velvet coat with hammers embroidered on the sleeves in silver thread, Around his neck was a heavy silver chain and a sapphire as large as a pigeon’s egg."
}