{
  "id": "5797c0d5c590c5862d027ae9c22b590fae4c8883",
  "text": "   Ser Loras gave her a modest smile.  I spoke only a simple truth, that any man with eyes could see.   He doesn’t remember, Sansa realized, startled. He is only being kind to me, he doesn’t remember me or the rose or any of it. She had been so certain that it meant something, that it meant everything. A red rose, not a white.  It was after you unhorsed Ser Robar Royce,  she said, desperately.  He took his hand from her arm.  I slew Robar at Storm’s End, my lady.  It was not a boast; he sounded sad.  Him, and another of King Renly’s Rainbow Guard as well, yes. Sansa had heard the women talking of it round the well, but for a moment she’d forgotten.  That was when Lord Renly was killed, wasn’t it? How terrible for your poor sister.    For Margaery?  His voice was tight.  To be sure. She was at Bitterbridge, though. She did not see.    Even so, when she heard…   Ser Loras brushed the hilt of his sword lightly with his hand. Its grip was white leather, its pommel a rose in alabaster.  Renly is dead. Robar as well. What use to speak of them?   The sharpness in his tone took her aback.  I… my lord, I… I did not mean to give offense, ser.    Nor could you, Lady Sansa,  Ser Loras replied, but all the warmth had gone from his voice. Nor did he take her arm again.  They ascended the serpentine steps in a deepening silence.  Oh, why did I have to mention Ser Robar? Sansa thought. I’ve ruined everything. He is angry with me now. She tried to think of something she might say to make amends, but all the words that came to her were lame and weak. Be quiet, or you will only make it worse, she told herself.  Lord Mace Tyrell and his entourage had been housed behind the royal sept, in the long slate-roofed keep that had been called the Maidenvault since King Baelor the Blessed had confined his sisters therein, so the sight of them might not tempt him into carnal thoughts. Outside its tall carved doors stood two guards in gilded halfhelms and green cloaks edged in gold satin, the golden rose of Highgarden sewn on their breasts. Both were seven-footers, wide of shoulder and narrow of waist, magnificently muscled. When Sansa got close enough to see their faces, she could not tell one from the other. They had the same strong jaws, the same deep blue eyes, the same thick red mustaches.  Who are they?  she asked Ser Loras, her discomfit forgotten for a moment.   My grandmother’s personal guard,  he told her.  Their mother named them Erryk and Arryk, but Grandmother can’t tell them apart, so she calls them Left and Right.   Left and Right opened the doors, and Margaery Tyrell herself emerged and swept down the short flight of steps to greet them.  Lady Sansa,  she called,  I’m so pleased you came. Be welcome.   Sansa knelt at the feet of her future queen.  You do me great honor, Your Grace.    Won’t you call me Margaery? Please, rise. Loras, help the Lady Sansa to her feet. Might I call you Sansa?    If it please you.  Ser Loras helped her up.  Margaery dismissed him with a sisterly kiss, and took Sansa by the hand.  Come, my grandmother awaits, and she is not the most patient of ladies.   A fire was crackling in the hearth, and sweet-swelling rushes had been scattered on the floor. Around the long trestle table a dozen women were seated.  Sansa recognized only Lord Tyrell’s tall, dignified wife, Lady Alerie, whose long silvery braid was bound with jeweled rings. Margaery performed the other introductions. There were three Tyrell cousins, Megga and Alla and Elinor, all close to Sansa’s age. Buxom Lady Janna was Lord Tyrell’s sister, and wed to one of the green-apple Fossoways; dainty, bright-eyed Lady Leonette was a Fossoway as well, and wed to Ser Garlan. Septa Nysterica had a homely pox-scarred face but seemed jolly. Pale, elegant Lady Graceford was with child, and Lady Bulwer was a child, no more than eight. And  Merry  was what she was to call boisterous plump Meredyth Crane, but most definitely not Lady Merryweather, a sultry black-eyed Myrish beauty.  Last of all, Margaery brought her before the wizened white-haired doll of a woman at the head of the table.  I am honored to present my grandmother the Lady Olenna, widow to the late Luthor Tyrell, Lord of Highgarden, whose memory is a comfort to us all.   The old woman smelled of rosewater. Why, she’s just the littlest bit of a thing. There was nothing the least bit thorny about her.  Kiss me, child,  Lady Olenna said, tugging at Sansa’s wrist with a soft spotted hand.  It is so kind of you to sup with me and my foolish flock of hens.   Dutifully, Sansa kissed the old woman on the cheek.  It is kind of you to have me, my lady.    I knew your grandfather, Lord Rickard, though not well.    He died before I was born.    I am aware of that, child. It’s said that your Tully grandfather is dying too. Lord Hoster, surely they told you? An old man, though not so old as me. Still, night falls for all of us in the end, and too soon for some. You would know that more than most, poor child."
}