{
  "id": "57b5a1bd11f169eebfb7ee522b570f15a4bd792a",
  "text": "  Behind him, someone chuckled.  I have not always treated my servants with kindness. I have gambled. I have even cheated, I blush to admit. I have said many cruel and malicious things about the noble lords and ladies of the court.  That drew outright laughter.  Once I—    Silence!  Lysa Arryn’s pale round face had turned a burning pink.  What do you imagine you are doing, dwarf?   Tyrion cocked his head to one side.  Why, confessing my crimes, my lady—   Catelyn Stark took a step forward.  You are accused of sending a hired knife to slay my son Bran in his bed, and of conspiring to murder Lord Jon Arryn, the Hand of the King.   Tyrion gave a helpless shrug.  Those crimes I cannot confess, I fear. I know nothing of any murders.   Lady Lysa rose from her weirwood throne.  I will not be made mock of. You have had your little jape, Imp. I trust you enjoyed it. Ser Vardis, take him back to the dungeon… but this time find him a smaller cell, with a floor more sharply sloped.    Is this how justice is done in the Vale?  Tyrion roared, so loudly that Ser Vardis froze for an instant.  Does honor stop at the Bloody Gate? You accuse me of crimes, I deny them, so you throw me into an open cell to freeze and starve.  He lifted his head, to give them all a good look at the bruises Mord had left on his face.  Where is the king’s justice? Is the Eyrie not part of the Seven Kingdoms? I stand accused, you say. Very well. I demand a trial! Let me speak, and let my truth or falsehood be judged openly, in the sight of gods and men.   A low murmuring filled the High Hall. He had her, Tyrion knew. He was highborn, the son of the most powerful lord in the realm, the brother of the queen. He could not be denied a trial. Guardsmen in sky-blue cloaks had started toward Tyrion, but Ser Vardis bid them halt and looked to Lady Lysa.  Her small mouth twitched in a petulant smile.  If you are tried and found to be guilty of the crimes for which you stand accused, then by the king’s own laws, you must pay with your life’s blood. We keep no headsman in the Eyrie, my lord of Lannister. Open the Moon Door.   The press of spectators parted. A narrow weirwood door stood between two slender marble pillars, a crescent moon carved in the white wood. Those standing closest edged backward as a pair of guardsmen marched through. One man removed the heavy bronze bars; the second pulled the door inward. Their blue cloaks rose snapping from their shoulders, caught in the sudden gust of wind that came howling through the open door. Beyond was the emptiness of the night sky, speckled with cold uncaring stars.   Behold the king’s justice,  Lysa Arryn said. Torch flames fluttered like pennons along the walls, and here and there the odd torch guttered out.   Lysa, I think this unwise,  Catelyn Stark said as the black wind swirled around the hall.  Her sister ignored her.  You want a trial, my lord of Lannister. Very well, a trial you shall have. My son will listen to whatever you care to say, and you shall hear his judgment. Then you may leave… by one door or the other.   She looked so pleased with herself, Tyrion thought, and small wonder. How could a trial threaten her, when her weakling son was the lord judge? Tyrion glanced at her Moon Door. Mother, I want to see him fly! the boy had said. How many men had the snot-nosed little wretch sent through that door already?   I thank you, my good lady, but I see no need to trouble Lord Robert,  Tyrion said politely.  The gods know the truth of my innocence. I will have their verdict, not the judgment of men. I demand trial by combat.   A storm of sudden laughter filled the High Hall of the Arryns. Lord Nestor Royce snorted, Ser Willis chuckled, Ser Lyn Corbray guffawed, and others threw back their heads and howled until tears ran down their faces. Marillion clumsily plucked a gay note on his new woodharp with the fingers of his broken hand. Even the wind seemed to whistle with derision as it came skirling through the Moon Door.  Lysa Arryn’s watery blue eyes looked uncertain. He had caught her off balance.  You have that right, to be sure.   The young knight with the green viper embroidered on his surcoat stepped forward and went to one knee.  My lady, I beg the boon of championing your cause.    The honor should be mine,  old Lord Hunter said.  For the love I bore your lord husband, let me avenge his death.    My father served Lord Jon faithfully as High Steward of the Vale,  Ser Albar Royce boomed.  Let me serve his son in this.    The gods favor the man with the just cause,  said Ser Lyn Corbray,  yet often that turns out to be the man with the surest sword. We all know who that is.  He smiled modestly.  A dozen other men all spoke at once, clamoring to be heard. Tyrion found it disheartening to realize so many strangers were eager to kill him. Perhaps this had not been such a clever plan after all.  Lady Lysa raised a hand for silence.  I thank you, my lords, as I know my son would thank you if he were among us."
}