{
  "id": "57ca137f95168f1a45be7e636446a4c14f5bf958",
  "text": " A mob of ragged boys raced by, screeching and flailing at each other with sticks. Why do boys so love to play at war? Catelyn wondered if Rymund was the answer. The singer’s voice swelled as he neared the end of his song.  And red the grass beneath his feet,  and red his banners bright,  and red the glow of setting sun  that bathed him in its light.   Come on, come on,  the great lord called,   my sword is hungry still.   And with a cry of savage rage,  They swarmed across the rill…   Fighting is better than this waiting,  Brienne said.  You don’t feel so helpless when you fight. You have a sword and a horse, sometimes an axe. When you’re armored it’s hard for anyone to hurt you.    Knights die in battle,  Catelyn reminded her.  Brienne looked at her with those blue and beautiful eyes.  As ladies die in childbed. No one sings songs about them.    Children are a battle of a different sort.  Catelyn started across the yard.  A battle without banners or warhorns, but no less fierce. Carrying a child, bringing it into the world… your mother will have told you of the pain…    I never knew my mother,  Brienne said.  My father had ladies… a different lady every year, but…    Those were no ladies,  Catelyn said.  As hard as birth can be, Brienne, what comes after is even harder. At times I feel as though I am being torn apart. Would that there were five of me, one for each child, so I might keep them all safe.    And who would keep you safe, my lady?   Her smile was wan and tired.  Why, the men of my House. Or so my lady mother taught me. My lord father, my brother, my uncle, my husband, they will keep me safe… but while they are away from me, I suppose you must fill their place, Brienne.   Brienne bowed her head.  I shall try, my lady.   Later that day, Maester Vyman brought a letter. She saw him at once, hoping for some word from Robb, or from Ser Rodrik in Winterfell, but the message proved to be from one Lord Meadows, who named himself castellan of Storm’s End. It was addressed to her father, her brother, her son,  or whoever now holds Riverrun.  Ser Cortnay Penrose was dead, the man wrote, and Storm’s End had opened its gate to Stannis Baratheon, the trueborn and rightful heir. The castle garrison had sworn their swords to his cause, one and all, and no man of them had suffered harm.   Save Cortnay Penrose,  Catelyn murmured. She had never met the man, yet she grieved to hear of his passing.  Robb should know of this at once,  she said.  Do we know where he is?    At last word he was marching toward the Crag, the seat of House Westerling,  said Maester Vyman.  If I dispatched a raven to Ashemark, it may be that they could send a rider after him.    Do so.   Catelyn read the letter again after the maester was gone.  Lord Meadows says nothing of Robert’s bastard,  she confided to Brienne.  I suppose he yielded the boy with the rest, though I confess, I do not understand why Stannis wanted him so badly.    Perhaps he fears the boy’s claim.    A bastard’s claim? No, it’s something else… what does this child look like?    He is seven or eight, comely, with black hair and bright blue eyes. Visitors oft thought him Lord Renly’s own son.    And Renly favored Robert.  Catelyn had a glimmer of understanding.  Stannis means to parade his brother’s bastard before the realm, so men might see Robert in his face and wonder why there is no such likeness in Joffrey.    Would that mean so much?    Those who favor Stannis will call it proof. Those who support Joffrey will say it means nothing.  Her own children had more Tully about them than Stark. Arya was the only one to show much of Ned in her features. And Jon Snow, but he was never mine. She found herself thinking of Jon’s mother, that shadowy secret love her husband would never speak of. Does she grieve for Ned as I do? Or did she hate him for leaving her bed for mine? Does she pray for her son as I have prayed for mine?  They were uncomfortable thoughts, and futile. If Jon had been born of Ashara Dayne of Starfall, as some whispered, the lady was long dead; if not, Catelyn had no clue who or where his mother might be. And it made no matter. Ned was gone now, and his loves and his secrets had all died with him.  Still, she was struck again by how strangely men behaved when it came to their bastards. Ned had always been fiercely protective of Jon, and Ser Cortnay Penrose had given up his life for this Edric Storm, yet Roose Bolton’s bastard had meant less to him than one of his dogs, to judge from the tone of the queer cold letter Edmure had gotten from him not three days past. He had crossed the Trident and was marching on Harrenhal as commanded, he wrote.  A strong castle, and well garrisoned, but His Grace shall have it, if I must kill every living soul within to make it so.  He hoped His Grace would weigh that against the crimes of his bastard son, whom Ser Rodrik Cassel had put to death.  A fate he no doubt earned,  Bolton had written.  Tainted blood is ever treacherous, and Ramsay’s nature was sly, greedy, and cruel."
}