{
  "id": "582854acde52e0e175d791b842e624b0bc941c87",
  "text": "  Harry opened his mouth to say he was sure they'd be able to mend it up at the school, but he never even got started. At that very moment, something hit his side of the car with the force of a  * Y4 *  charging bull, sending him lurching sideways into Ron, just as an equally heavy blow hit the roof.  \"What's happen -?\"  Ron gasped, staring through the windshield, and Harry looked around just in time to see a branch as thick as a python smash into it. The tree they had hit was attacking them. Its trunk was bent almost double, and its gnarled boughs were pummeling every inch of the car it could reach.  \"Aaargh!\" said Ron as another twisted limb punched a large dent into his door; the windshield was now trembling under a hail of blows from knuckle-like twigs and a branch as thick as a battering ram was pounding furiously on the roof, which seemed to be caving  \"Run for it!\" Ron shouted, throwing his full weight against his door, but next second he had been knocked backward into Harry's lap by a vicious uppercut from another branch.  \"We're done for!\" he moaned as the ceiling sagged, but suddenly the floor of the car was vibrating - the engine had restarted.  \"Reverse!\" Harry yelled, and the car shot backward; the tree was still trying to hit them; they could hear its roots creaking as it almost ripped itself up, lashing out at them as they sped out of reach.  \"That,\" panted Ron, \"was close. Well done, car -\"  The car, however, had reached the end of its tether. With two sharp clunks, the doors flew open and Harry felt his seat tip sideways: Next thing he knew he was sprawled on the damp ground. Loud thuds told him that the car was ejecting their luggage from the trunk; Hedwig's cage flew through the air and burst open; she rose out of it with an angry screech and sped off toward the castle  Y5  without a backward look. Then, dented, scratched, and steaming, the car rumbled off into the darkness, its rear lights blazing angrily.  \"Come back!\" Ron yelled after it, brandishing his broken wand. \"Dad'll kill me!\"  But the car disappeared from view with one last snort from its exhaust.  \"Can you believe our luck?\" said Ron miserably, bending down to pick up Scabbers. \"Of all the trees we could've hit, we had to get one that hits back.\"  He glanced over his shoulder at the ancient tree, which was still flailing its branches threateningly.  \"Come on,\" said Harry wearily, \"we'd better get up to the school ......  It wasn't at all the triumphant arrival they had pictured. Stiff, cold, and bruised, they seized the ends of their trunks and began dragging them up the grassy slope, toward the great oak front doors.  \"I think the feast's already started,\" said Ron, dropping his trunk at the foot of the front steps and crossing quietly to look through a brightly lit window. \"Hey - Harry - come and look - it's the Sorting!\"  Harry hurried over and, together, he and Ron peered in at the Great Hall.  Innumerable candles were hovering in midair over four long, crowded tables, making the golden plates and goblets sparkle. Overhead, the bewitched ceiling, which always mirrored the sky outside, sparkled with stars.  Through the forest of pointed black Hogwarts hats, Harry saw a long line of scared-looking first years fiIing into the Hall. Ginny  * 76  was among them, easily visible because of her vivid Weasley ha-ir. Meanwhile, Professor McGonagall, a bespectacled witch with her hair in a tight bun, was placing the famous Hogwarts Sorting Hat on a stool before the newcomers.  Every year, this aged old hat, patched, frayed, and dirty, sorted new students into the four Hogwarts houses (Gryffindor, Hufflepuff, Ravenclaw, and Slytherin). Harry well remembered putting it on, exactly one year ago, and waiting, petrified, for its decision as it muttered aloud in his ear. For a few horrible seconds he had feared that the hat was going to put him in Slytherin, the house that had turned out more Dark witches and wizards than any other -but he had ended up in Gryffindor, along with Ron, Hermione, and the rest of the Weasleys. Last term, Harry and Ron had helped Gryffindor win the House Championship, beating Slytherin for the first time in seven years.  A very small, mousy-haired boy had been called forward to place the hat on his head. Harry's eyes wandered past him to where Professor Dumbledore, the headmaster, sat watching the Sorting from the staff table, his long silver beard and half-moon glasses shining brightly in the candlelight. Several seats along, Harry saw Gilderoy Lockhart, dressed in robes of aquamarine. And there at the end was Hagrid, huge and hairy, drinking deeply from his goblet.  \"Hang on. . . \" Harry muttered to Ron. \"There's an empty chair at the staff table .... Where's Snape?\"  Professor Severus Snape was Harry's least favorite teacher. Harry also happened to be Snape's least favorite student. Cruel, sarcastic, and disliked by everybody except the students from his own house (Slytherin), Snape taught Potions.  \"Maybe he's ill!\" said Ron hopefully."
}