{
  "id": "5828c45d3e29bd319f6efd0064999317a5c996df",
  "text": " Even Jeyne Poole was not so blind as to think this man was fair. Yet when Arya looked at him again, she saw it; the remains of a forked purple lightning bolt on the cracked enamel of his breastplate.   Rocks and trees and rivers, that’s what your realm is made of,  the Hound was saying.  Do the rocks need defending? Robert wouldn’t have thought so. If he couldn’t fuck it, fight it, or drink it, it bored him, and so would you… you brave companions.   Outrage swept the hollow hill.  Call us that name again, dog, and you’ll swallow that tongue.  Lem drew his longsword.  The Hound stared at the blade with contempt.  Here’s a brave man, baring steel on a bound captive. Untie me, why don’t you? We’ll see how brave you are then.  He glanced at the Mad Huntsman behind him.  How about you? Or did you leave all your courage in your kennels?    No, but I should have left you in a crow cage.  The Huntsman drew a knife.  I might still.   The Hound laughed in his face.   We are brothers here,  Thoros of Myr declared.  Holy brothers, sworn to the realm, to our god, and to each other.    The brotherhood without banners.  Tom Sevenstrings plucked a string.  The knights of the hollow hill.    Knights?  Clegane made the word a sneer.  Dondarrion’s a knight, but the rest of you are the sorriest lot of outlaws and broken men I’ve ever seen. I shit better men than you.    Any knight can make a knight,  said the scarecrow that was Beric Dondarrion,  and every man you see before you has felt a sword upon his shoulder. We are the forgotten fellowship.    Send me on my way and I’ll forget you too,  Clegane rasped.  But if you mean to murder me, then bloody well get on with it. You took my sword, my horse, and my gold, so take my life and be done with it… but spare me this pious bleating.    You will die soon enough, dog,  promised Thoros,  but it shan’t be murder, only justice.    Aye,  said the Mad Huntsman,  and a kinder fate than you deserve for all your kind have done. Lions, you call yourselves. At Sherrer and the Mummer’s Ford, girls of six and seven years were raped, and babes still on the breast were cut in two while their mothers watched. No lion ever killed so cruel.    I was not at Sherrer, nor the Mummer’s Ford,  the Hound told him.  Lay your dead children at some other door.   Thoros answered him.  Do you deny that House Clegane was built upon dead children? I saw them lay Prince Aegon and Princess Rhaenys before the Iron Throne. By rights your arms should bear two bloody infants in place of those ugly dogs.   The Hound’s mouth twitched.  Do you take me for my brother? Is being born Clegane a crime?    Murder is a crime.    Who did I murder?    Lord Lothar Mallery and Ser Gladden Wylde,  said Harwin.   My brothers Lister and Lennocks,  declared Jack-Be-Lucky.   Goodman Beck and Mudge the miller’s son, from Donnelwood,  an old woman called from the shadows.   Merriman’s widow, who loved so sweet,  added Greenbeard.   Them septons at Sludgy Pond.    Ser Andrey Charlton. His squire Lucas Roote. Every man, woman, and child in Fieldstone and Mousedown Mill.    Lord and Lady Deddings, that was so rich.   Tom Sevenstrings took up the count.  Alyn of Winterfell, Joth Quickbow, Little Matt and his sister Randa, Anvil Ryn. Ser Ormond. Ser Dudley. Pate of Mory, Pate of Lancewood, Old Pate, and Pate of Shermer’s Grove. Blind Wyl the Whittler. Goodwife Maerie. Maerie the Whore. Becca the Baker. Ser Raymun Darry, Lord Darry, young Lord Darry. The Bastard of Bracken. Fletcher Will. Harsley. Goodwife Nolla—    Enough.  The Hound’s face was tight with anger.  You’re making noise. These names mean nothing. Who were they?    People,  said Lord Beric.  People great and small, young and old. Good people and bad people, who died on the points of Lannister spears or saw their bellies opened by Lannister swords.    It wasn’t my sword in their bellies. Any man who says it was is a bloody liar.    You serve the Lannisters of Casterly Rock,  said Thoros.   Once. Me and thousands more. Is each of us guilty of the crimes of the others?  Clegane spat.  Might be you are knights after all. You lie like knights, maybe you murder like knights.   Lem and Jack-Be-Lucky began to shout at him, but Dondarrion raised a hand for silence.  Say what you mean, Clegane.    A knight’s a sword with a horse. The rest, the vows and the sacred oils and the lady’s favors, they’re silk ribbons tied round the sword. Maybe the sword’s prettier with ribbons hanging off it, but it will kill you just as dead. Well, bugger your ribbons, and shove your swords up your arses. I’m the same as you. The only difference is, I don’t lie about what I am. So kill me, but don’t call me a murderer while you stand there telling each other that your shit don’t stink. You hear me?   Arya squirted past Greenbeard so fast he never saw her.  You are a murderer!  she screamed.  You killed Mycah, don’t say you never did. You murdered him!   The Hound stared at her with no flicker of recognition.  And who was this Mycah, boy?    I’m not a boy! But Mycah was."
}