{
  "id": "59164637281e5b90e291e773df3340a93550692d",
  "text": " And this is only hranna, child. There are a hundred kinds of grass out there, grasses as yellow as lemon and as dark as indigo, blue grasses and orange grasses and grasses like rainbows. Down in the Shadow Lands beyond Asshai, they say there are oceans of ghost grass, taller than a man on horseback with stalks as pale as milkglass. It murders all other grass and glows in the dark with the spirits of the damned. The Dothraki claim that someday ghost grass will cover the entire world, and then all life will end.   That thought gave Dany the shivers.  I don’t want to talk about that now,  she said.  It’s so beautiful here, I don’t want to think about everything dying.    As you will, Khaleesi,  Ser Jorah said respectfully.  She heard the sound of voices and turned to look behind her. She and Mormont had outdistanced the rest of their party, and now the others were climbing the ridge below them. Her handmaid Irri and the young archers of her khas were fluid as centaurs, but Viserys still struggled with the short stirrups and the flat saddle. Her brother was miserable out here. He ought never have come. Magister Illyrio had urged him to wait in Pentos, had offered him the hospitality of his manse, but Viserys would have none of it. He would stay with Drogo until the debt had been paid, until he had the crown he had been promised.  And if he tries to cheat me, he will learn to his sorrow what it means to wake the dragon,  Viserys had vowed, laying a hand on his borrowed sword. Illyrio had blinked at that and wished him good fortune.  Dany realized that she did not want to listen to any of her brother’s complaints right now. The day was too perfect. The sky was a deep blue, and high above them a hunting hawk circled. The grass sea swayed and sighed with each breath of wind, the air was warm on her face, and Dany felt at peace. She would not let Viserys spoil it.   Wait here,  Dany told Ser Jorah.  Tell them all to stay. Tell them I command it.   The knight smiled. Ser Jorah was not a handsome man. He had a neck and shoulders like a bull, and coarse black hair covered his arms and chest so thickly that there was none left for his head. Yet his smiles gave Dany comfort.  You are learning to talk like a queen, Daenerys.    Not a queen,  said Dany.  A khaleesi.  She wheeled her horse about and galloped down the ridge alone.  The descent was steep and rocky, but Dany rode fearlessly, and the joy and the danger of it were a song in her heart. All her life Viserys had told her she was a princess, but not until she rode her silver had Daenerys Targaryen ever felt like one.  At first it had not come easy. The khalasar had broken camp the morning after her wedding, moving east toward Vaes Dothrak, and by the third day Dany thought she was going to die. Saddle sores opened on her bottom, hideous and bloody. Her thighs were chafed raw, her hands blistered from the reins, the muscles of her legs and back so wracked with pain that she could scarcely sit. By the time dusk fell, her handmaids would need to help her down from her mount.  Even the nights brought no relief. Khal Drogo ignored her when they rode, even as he had ignored her during their wedding, and spent his evenings drinking with his warriors and bloodriders, racing his prize horses, watching women dance and men die. Dany had no place in these parts of his life. She was left to sup alone, or with Ser Jorah and her brother, and afterward to cry herself to sleep. Yet every night, some time before the dawn, Drogo would come to her tent and wake her in the dark, to ride her as relentlessly as he rode his stallion. He always took her from behind, Dothraki fashion, for which Dany was grateful; that way her lord husband could not see the tears that wet her face, and she could use her pillow to muffle her cries of pain. When he was done, he would close his eyes and begin to snore softly and Dany would lie beside him, her body bruised and sore, hurting too much for sleep.  Day followed day, and night followed night, until Dany knew she could not endure a moment longer. She would kill herself rather than go on, she decided one night…  Yet when she slept that night, she dreamt the dragon dream again. Viserys was not in it this time. There was only her and the dragon. Its scales were black as night, wet and slick with blood. Her blood, Dany sensed. Its eyes were pools of molten magma, and when it opened its mouth, the flame came roaring out in a hot jet. She could hear it singing to her, She opened her arms to the fire, embraced it, let it swallow her whole, let it cleanse her and temper her and scour her clean. She could feel her flesh sear and blacken and slough away, could feel her blood boil and turn to steam, and yet there was no pain. She felt strong and new and fierce.  And the next day, strangely, she did not seem to hurt quite so much. It was as if the gods had heard her and taken pity. Even her handmaids noticed the change.  Khaleesi,  Jhiqui said,  what is wrong? Are you sick?    I was,  she answered, standing over the dragon’s eggs that Illyrio had given her when she wed."
}