{
  "id": "59323265b903223645857cbc72332b75faac7698",
  "text": " \"  The basilisk was moving toward Harry; he could hear its heavy body slithering heavily across the dusty floor. Eyes still tightly shut, Harry began to run blindly sideways, his hands outstretched, feeling his way - Voldemort was laughing  Harry tripped. He fell hard onto the stone and tasted blood the serpent was barely feet from him, he could hear it coming  There was a loud, explosive spitting sound right above him, and then something heavy hit Harry so hard that he was smashed into the wall. Waiting for fangs to sink through his body he heard more mad hissing, something thrashing wildly off the pillars  He couldn't help it - he opened his eyes wide enough to squint at what was going on.  The enormous serpent, bright, poisonous green, thick as an oak trunk, had raised itself high in the air and its great blunt head was weaving drunkenly between the pillars. As Harry trembled, ready to close his eyes if it turned, he saw what had distracted the snake.  Fawkes was soaring around its head, and the basilisk was snapping furiously at him with fangs long and thin as sabers  Fawkes dived. His long golden beak sank out of sight and a  *318*  sudden shower of dark blood spattered the floor. The snake's tail thrashed, narrowly missing Harry, and before Harry could shut his eyes, it turned - Harry looked straight into its face and saw that its eyes, both its great, bulbous yellow eyes, had been punctured by the phoenix; blood was streaming to the floor, and the snake was spitting in agony.  \"NO!\" Harry heard Riddle screaming. \"LEAVE THE BIRD! LEAVE THE BIRD! THE BOY IS BEHIND YOU. YOU CAN STILL SMELL HIM. KILL HIMI\"  The blinded serpent swayed, confused, still deadly. Fawkes was circling its head, piping his eerie song, jabbing here and there at its scaly nose as the blood poured from its ruined eyes.  \"Help me, help me,\" Harry muttered wildly, \"someone - anyone  The snake's tail whipped across the floor again. Harry ducked. Something soft hit his face.  The basilisk had swept the Sorting Hat into Harry's arms. Harry seized it. It was all he had left, his only chance - he rammed it onto his head and threw himself flat onto the floor as the basilisk's tail swung over him again.  Help me - help me - Harry thought, his eyes screwed tight under the hat. Please help me  There was no answering voice. Instead, the hat contracted, as though an invisible hand was squeezing it very tightly.  Something very hard and heavy thudded onto the top of Harry's head, almost knocking him out. Stars winking in front of his eyes, he grabbed the top of the hat to pull it off and felt something long and hard beneath it.  3 19  A gleaming silver sword had appeared inside the hat, its handle glittering with rubies the size of eggs.  \"KILL THE BOY! LEAVE THE BIRD! THE BOY IS BEHIND YOU. SNIFF -- SMELL HIM.\"  Harry was on his feet, ready. The basilisk's head was falling, its body coiling around, hitting pillars as it twisted to face him. He could see the vast, bloody eye sockets, see the mouth stretching wide, wide enough to swallow him whole, lined with fangs long as his sword, thin, glittering, venomous -  It lunged blindly -- Harry dodged and it hit the Chamber wall. It lunged again, and its forked tongue lashed Harry's side. He raised the sword in both his hands -  The basilisk lunged again, and this time its aim was true -- Harry threw his whole weight behind the sword and drove it to the hilt into the roof of the serpent's mouth -  But as warm blood drenched Harry's arms, he felt a searing pain just above his elbow. One long, poisonous fang was sinking deeper and deeper into his arm and it splintered as the basilisk keeled over sideways and fell, twitching, to the floor.  Harry slid down the wall. He gripped the fang that was spreading poison through his body and wrenched it out of his arm. But he knew it was too late. White-hot pain was spreading slowly and steadily from the wound. Even as he dropped the fang and watched his own blood soaking his robes, his vision went foggy. The Chamber was dissolving in a whirl of dull color.  A patch of scarlet swam past, and Harry heard a soft clatter of claws beside him.  \"Fawkes,\" said Harry thickly. \"You were fantastic, Fawkes . . . .\"  1,520  He felt the bird lay its beautiful head on the spot where the serpent's fang had pierced him.  He could hear echoing footsteps and then a dark shadow moved in front of him.  \"You're dead, Harry Potter,\" said Riddle's voice above him. \"Dead. Even Dumbledore's bird knows it. Do you see what he's doing, Potter? He's crying.\"  Harry blinked. Fawke's head slid in and out of focus. Thick, pearly tears were trickling down the glossy feathers.  \"I'm going to sit here and watch you die, Harry Potter. Take your time. I'm in no hurry.\"  Harry felt drowsy. Everything around him seemed to be spinning.  \"So ends the famous Harry Potter,\" said Riddle's distant voice. \"Alone in the Chamber of Secrets, forsaken by his friends, defeated at last by the Dark Lord he so unwisely challenged."
}