{
  "id": "5977bcaf71c0da479ef27983c0b3f072cf6e34df",
  "text": " The following day, two more girls asked him, a second year and (to his horror) a fifth year who looked as though she might knock him out if he refused. \"She was quite good-looking,\" said Ron fairly, after he'd stopped laughing. \"She was a foot taller than me,\" said Harry, still unnerved. \"Imagine what I'd look like trying to dance with her.\" Hermione's words about Krum kept coming back to him. \"They only like him because he's famous!\"  Harry doubted very much if any of the girls who had asked to be his partner so far would have wanted to go to the ball with him if he hadn't been a school champion.  Then he wondered if this would bother him if Cho asked him. On the whole. Harry had to admit that even with the embarrassing prospect of opening the ball before him, life had definitely improved since he had got through the first task.  He wasn't attracting nearly as much unpleasantness in the corridors anymore, which he suspected had a lot to do with Cedric - he had an idea Cedric might have told the Hufflepuffs to leave Harry alone, in gratitude for Harry's tip-off about the dragons.  There seemed to be fewer Support Cedric Diggory! badges around too.  Draco Malfoy, of course, was still quoting Rita Skeeter's article to him at every possible opportunity, but he was getting fewer and fewer laughs out of it - and just to heighten Harry's feeling of well-being, no story about Hagrid had appeared in the Daily Prophet. \"She didn' seem very int'rested in magical creatures, ter tell yeh the truth,\" Hagrid said, when Harry, Ron, and Hermione asked him how his interview with Rita Skeeter had gone during the last Care of Magical Creatures lesson of the term.  To their very great relief, Hagrid had given up on direct contact with the skrewts now, and they were merely sheltering behind his cabin today, sitting at a trestle table and preparing a fresh selection of food with which to tempt the skrewts. \"She jus' wanted me ter talk about you, Harry,\" Hagrid continued in a low voice.  \"Well, I told her we'd been friends since I went ter fetch yeh from the Dursleys.  'Never had to tell him off in four years?'  she said.  'Never played you up in lessons, has he?'  I told her no, an she didn' seem happy at all.  Yeh'd think she wanted me to say yeh were horrible, Harry.\" \" 'Course she did,\" said Harry, throwing lumps of dragon liver into a large metal bowl and picking up his knife to cut some more.  \"She can't keep writing about what a tragic little hero I am, it'll get boring.\" \"She wants a new angle, Hagrid,\" said Ron wisely as he shelled salamander eggs.  \"You were supposed to say Harry's a mad delinquent!\" \"But he's not!\" said Hagrid, looking genuinely shocked. \"She should've interviewed Snape,\" said Harry grimly. \"He'd give her the goods on me any day.  'Potter has been crossing lines ever since he first arrived at this school. . . .'\" \"Said that, did he?\"  said Hagrid, while Ron and Hermione laughed.  \"Well, yeh might've bent a few rules. Harry, bu' yeh're all righ' really, aren' you?\" \"Cheers, Hagrid,\" said Harry, grinning. \"You coming to this ball thing on Christmas Day, Hagrid?\"  said Ron. \"Though' I might look in on it, yeah,\" said Hagrid gruffly.  \"Should be a good do, I reckon.  You'll be openin the dancin', won yeh, Harry?  Who're you takin'?\" \"No one, yet,\" said Harry, feeling himself going red again.  Hagrid didn't pursue the subject. The last week of term became increasingly boisterous as it progressed. Rumors about the Yule Ball were flying everywhere, though Harry didn't believe half of them - for instance, that Dumbledore had bought eight hundred barrels of mulled mead from Madam Rosmerta. It seemed to be fact, however, that he had booked the Weird Sisters.  Exactly who or what the Weird Sisters were Harry didn't know, never having had access to a wizard's wireless, but he deduced from the wild excitement of those who had grown up listening to the WWN (Wizarding Wireless Network) that they were a very famous musical group. Some of the teachers, like little Professor Flitwick, gave up trying to teach them much when their minds were so clearly elsewhere; he allowed them to play games in his lesson on Wednesday, and spent most of it talking to Harry about the perfect Summoning Charm Harry had used during the first task of the Triwizard Tournament.  Other teachers were not so generous.  Nothing would ever deflect Professor Binns, for example, from plowing on through his notes on goblin rebellions - as Binns hadn't let his own death stand in the way of continuing to teach, they supposed a small thing like Christmas wasn't going to put him off.  It was amazing how he could make even bloody and vicious goblin riots sound as boring as Percys cauldron-bottom report.  Professors McGonagall and Moody kept them working until the very last second of their classes too, and Snape, of course, would no sooner let them play games in class than adopt Harry.  Staring nastily around at them all, he informed them that he would be testing them on poison antidotes during the last lesson of the term."
}