{
  "id": "59b042b8eb28f222d7304ef8ed7e1b827b5096ef",
  "text": " Ser Wendel laughed.  Nothing’s more like to bring a Lannister running than a threat to his gold.    How did the king ever take the Tooth?  Ser Perwyn Frey asked his bastard brother.  That’s a hard strong keep, and it commands the hill road.    He never took it. He slipped around it in the night. It’s said the direwolf showed him the way, that Grey Wind of his. The beast sniffed out a goat track that wound down a defile and up along beneath a ridge, a crooked and stony way, yet wide enough for men riding single file. The Lannisters in their watchtowers got not so much a glimpse of them.  Rivers lowered his voice.  There’s some say that after the battle, the king cut out Stafford Lannister’s heart and fed it to the wolf.    I would not believe such tales,  Catelyn said sharply.  My son is no savage.    As you say, my lady. Still, it’s no more than the beast deserved. That is no common wolf, that one. The Greatjon’s been heard to say that the old gods of the north sent those direwolves to your children.   Catelyn remembered the day when her boys had found the pups in the late summer snows. There had been five, three male and two female for the five trueborn children of House Stark… and a sixth, white of fur and red of eye, for Ned’s bastard son Jon Snow. No common wolves, she thought. No indeed.  That night as they made their camp, Brienne sought out her tent.  My lady, you are safely back among your own now, a day’s ride from your brother’s castle. Give me leave to go.   Catelyn should not have been surprised. The homely young woman had kept to herself all through their journey, spending most of her time with the horses, brushing out their coats and pulling stones from their shoes. She had helped Shadd cook and clean game as well, and soon proved that she could hunt as well as any. Any task Catelyn asked her to turn her hand to, Brienne had performed deftly and without complaint, and when she was spoken to she answered politely, but she never chattered, nor wept, nor laughed. She had ridden with them every day and slept among them every night without ever truly becoming one of them.  It was the same when she was with Renly, Catelyn thought. At the feast, in the melee, even in Renly’s pavilion with her brothers of the Rainbow Guard. There are walls around this one higher than Winterfell’s.   If you left us, where would you go?  Catelyn asked her.   Back,  Brienne said.  To Storm’s End.    Alone.  It was not a question.  The broad face was a pool of still water, giving no hint of what might live in the depths below.  Yes.    You mean to kill Stannis.   Brienne closed her thick callused fingers around the hilt of her sword.  The sword that had been his.  I swore a vow. Three times I swore. You heard me.    I did,  Catelyn admitted. The girl had kept the rainbow cloak when she discarded the rest of her bloodstained clothing, she knew. Brienne’s own things had been left behind during their flight, and she had been forced to clothe herself in odd bits of Ser Wendel’s spare garb, since no one else in their party had garments large enough to fit her.  Vows should be kept, I agree, but Stannis has a great host around him, and his own guards sworn to keep him safe.    I am not afraid of his guards. I am as good as any of them. I should never have fled.    Is that what troubles you, that some fool might call you craven?  She sighed.  Renly’s death was no fault of youts. You served him valiantly, but when you seek to follow him into the earth, you serve no one.  She stretched out a hand, to give what comfort a touch could give.  I know how hard it is—   Brienne shook off her hand.  No one knows.    You’re wrong,  Catelyn said sharply.  Every morning, when I wake, I remember that Ned is gone. I have no skill with swords, but that does not mean that I do not dream of riding to King’s Landing and wrapping my hands around Cersei Lannister’s white throat and squeezing until her face turns black.   The Beauty raised her eyes, the only part of her that was truly beautiful.  If you dream that, why would you seek to hold me back? Is it because of what Stannis said at the parley?   Was it? Catelyn glanced across the camp. Two men were walking sentry, spears in hand.  I was taught that good men must fight evil in this world, and Renly’s death was evil beyond all doubt. Yet I was also taught that the gods make kings, not the swords of men. If Stannis is our rightful king—    He’s not. Robert was never the rightful king either, even Renly said as much. Jaime Lannister murdered the rightful king, after Robert killed his lawful heir on the Trident. Where were the gods then? The gods don’t care about men, no more than kings care about peasants.    A good king does care.    Lord Renly… His Grace, he… he would have been the best king, my lady, he was so good, he…    He is gone, Brienne,  she said, as gently as she could.  Stannis and Joffrey remain… and so does my son.    He wouldn’t… you’d never make a peace with Stannis, would you? Bend the knee? You wouldn’t…    I will tell you true, Brienne."
}