{
  "id": "5a2225066df589129fb69f53bd7bd936a6376603",
  "text": " It took him a while to persuade her to wake up and then to look at him, as she kept shuffling around on her perch, showing him her tail.  She was evidently still furious about his lack of gratitude the previous night.  In the end, it was Harry suggesting she might be too tired, and that perhaps he would ask Ron to borrow Pigwidgeon, that made her stick out her leg and allow him to tie the letter to it. \"Just find him, all right?\"  Harry said, stroking her back as he carried her on his arm to one of the holes in the wall.  \"Before the dementors do.\" She nipped his finger, perhaps rather harder than she would ordinarily have done, but hooted softly in a reassuring sort of way all the same.  Then she spread her wings and took off into the sunrise.  Harry watched her fly out of sight with the familiar feeling of unease back in his stomach.  He had been so sure that Sirius's reply would alleviate his worries rather than increasing them. \"That was a lie, Harry,\" said Hermione sharply over breakfast, when he told her and Ron what he had done.  \"You didn't imagine your scar hurting and you know it.\" \"So what?\" said Harry. \"He's not going back to Azkaban because of me.\" \"Drop it,\" said Ron sharply to Hermione as she opened her mouth to argue some more, and for once, Hermione heeded him, and fell silent. Harry did his best not to worry about Sirius over the next couple of weeks.  True, he could not stop himself from looking anxiously around every morning when the post owls arrived, nor, late at night before he went to sleep, prevent himself from seeing horrible visions of Sirius, cornered by dementors down some dark London street, but betweentimes he tried to keep his mind off his godfather.  He wished he still had Quidditch to distract him; nothing worked so well on a troubled mind as a good, hard training session.  On the other hand, their lessons were becoming more difficult and demanding than ever before, particularly Moody's Defense Against the Dark Arts. To their surprise, Professor Moody had announced that he would be putting the Imperius Curse on each of them in turn, to demonstrate its power and to see whether they could resist its effects. \"But - but you said it's illegal, Professor,\" said Hermione uncertainly as Moody cleared away the desks with a sweep of his wand, leaving a large clear space in the middle of the room. \"You said - to use it against another human was -\" \"Dumbledore wants you taught what it feels like,\" said Moody, his magical eye swiveling onto Hermione and fixing her with an eerie, unblinking stare.  \"If you'd rather learn the hard way - when someone's putting it on you so they can control you completely - fine by me. You're excused.  Off you go.\"  He pointed one gnarled finger toward the door.  Hermione went very pink and muttered something about not meaning that she wanted to leave.  Harry and Ron grinned at each other.  They knew Hermione would rather eat bubotuber pus than miss such an important lesson. Moody began to beckon students forward in turn and put the Imperius Curse upon them.  Harry watched as, one by one, his classmates did the most extraordinary things under its influence.  Dean Thomas hopped three times around the room, singing the national anthem. Lavender Brown imitated a squirrel.  Neville performed a series of quite astonishing gymnastics he would certainly not have been capable of in his normal state.  Not one of them seemed to be able to fight off the curse, and each of them recovered only when Moody had removed it. \"Potter,\" Moody growled, \"you next.\" Harry moved forward into the middle of the classroom, into the space that Moody had cleared of desks.  Moody raised his wand, pointed it at Harry, and said, '1mperio!\" It was the most wonderful feeling.  Harry felt a floating sensation as every thought and worry in his head was wiped gently away, leaving nothing but a vague, untraceable happiness. He stood there feeling immensely relaxed, only dimly aware of everyone watching him. And then he heard Mad-Eye Moody's voice, echoing in some distant chamber of his empty brain:  Jump onto the desk. . . jump onto the desk. . . Harry bent his knees obediently, preparing to spring. Jump onto the desk.... Why, though?  Another voice had awoken in the back of his brain.  Stupid thing to do, really, said the voice. Jump onto the desk.... No, I don't think I will, thanks, said the other voice, a little more firmly. . . no, I don't really want to. Jump! NOW! The next thing Harry felt was considerable pain.  He had both jumped and tried to prevent himself from jumping - the result was that he'd smashed headlong into the desk knocking it over, and, by the feeling in his legs, fractured both his kneecaps. \"Now, that's more like it!\"  growled Moody's voice, and suddenly, Harry felt the empty, echoing feeling in his head disappear.  He remembered exactly what was happening, and the pain in his knees seemed to double. \"Look at that, you lot. . . Potter fought!  He fought it, and he damn near beat it!  We'll try that again, Potter, and the rest of you, pay attention - watch his eyes, that's where you see it - very good, Potter, very good indeed!  They'll have trouble controlling you!\"  \"The way he talks,\" Harry muttered as he hobbled out of the Defense Against the Dark Arts class an hour later (Moody had insisted on putting Harry through his paces four times in a row, until Harry could throw off the curse entirely), \"you'd think we were all going to be attacked any second."
}