{
  "id": "5a4aff15c4b286a09b03caf3110e5ec46beaf8b6",
  "text": " They had brought only one blanket apiece. 'Let us light  a fire,'  he said. 'I  care  no longer for the  danger. Let the Orcs come as  thick as summer-moths round a candle!'       'If those  unhappy hobbits are astray in the woods, it  might draw them   ####-hither,' said Legolas.        'And it might draw other things, neither Orc nor Hobbit,' said Aragorn.  'We are  near to the mountain-marches of the traitor Saruman. Also we are on  the  very edge of Fangorn,  and  it is  perilous to touch  the trees of that  wood, it is said.'       'But  the Rohirrim  made a  great burning here yesterday,'  said Gimli,  'and  they felled  trees for the fire, as can be seen.  Yet they passed  the  night after safely here, when their labour was ended.'       'They were  many,' said  Aragorn,  'and they  do not heed the wrath  of  Fangorn, for they come here seldom, and they do not go under  the trees. But  our paths are likely to lead us into the very forest itself. So have a care!   Cut no living wood!'       'There  is no need,' said  Gimli. 'The Riders have  left chip and bough  enough, and there is dead wood lying in plenty.' He went off to gather fuel,  and busied himself with building and kindling a fire; but Aragorn sat silent  with his back to the great tree, deep in thought; and Legolas stood alone in  the open, looking towards the profound  shadow of the wood, leaning forward,  as one who listens to voices calling from a distance.       When the  Dwarf had  a  small bright blaze going, the three  companions  drew close  to  it and sat together,  shrouding  the light with their hooded  forms. Legolas looked up at the boughs of the tree reaching out above them.        'Look!' he said. 'The tree is glad of the fire!'       It  may  have  been  that the dancing  shadows tricked their eyes,  but  certainly to each  of the companions the  boughs appeared to be bending this  way and that so as to come  above the flames, wh ile  the upper branches were  stooping down; the brown  leaves  now stood  out  stiff, and rubbed together   like many cold cracked hands taking comfort in the warmth.       There was a silence, for suddenly the dark  and unknown forest, so near  at hand,  made  itself  felt  as  a great  brooding presence, full  of secret  purpose. After a while Legolas spoke again.       'Celeborn warned us not to go far into Fangorn,' he said. 'Do you  know  why, Aragorn? What are the fables of the forest that Boromir had heard?'       'I have heard many  tales  in Gondor and elsewhere,' said Aragorn, 'but  if it were not for the words of Celeborn I should deem them only fables that  Men have made as true knowledge fades. I had thought of  asking you what  was  the truth of the  matter . And if an Elf of the Wood does not know, how shall    ####-a Man answer?'       'You  have  journeyed  further  than  I,'  said Legolas. 'I  have heard  nothing of this in my own land, save only songs that  tell how the  Onodrim,   that Men  call Ents,  dwelt there  long ago; for Fangorn is old, old  even as  the Elves would reckon it.'       'Yes,  it  is  old,'  said  Aragorn,  'as  old  as the  forest  by  the  Barrow-downs, and it is  far greater. Elrond says that the two are akin, the  last  strongholds  of  the  mighty  woods of the  Elder Days, in  which  the   Firstborn roamed while Men still slept. Yet Fangorn holds some secret of its  own. What it is I do not know.'       'And  I  do not wish to know,' said Gimli. 'Let nothing that  dwells in  Fangorn be troubled on my account!'       They  now drew  lots for the watches, and the lot for  the first  watch  fell to Gimli. The others lay down. Almost at once sleep laid hold  on them.  'Gimli!' said  Aragorn drowsily. 'Remember, it is perilous  to  cut bough or   twig from  a living tree  in Fangorn. But do not stray far in search of dead  wood. Let the fire die rather! Call me at need!'       With  that  he  fell asleep.  Legolas already lay motionless, his  fair  hands folded upon  his breast,  his eyes unclosed, blending living night and  deep dream, as is the way with Elves. Gimli sat hunched by the fire, running  his thumb  thoughtfully along  the edge of  his axe. The tree rustled. There  was no other sound.       Suddenly  Gimli looked up, and there just on the edge of the fire-light  stood an old bent man, leaning on a staff, and wrapped in a great cloak; his  wide-brimmed hat was pulled  down over his eyes. Gimli sprang up, too  amazed  for the moment to  cry out, though at once the thought flashed into his mind   that Saruman had caught them. Both Aragorn and Legolas, roused by his  sudden  movement, sat up and stared. The old man did not speak or make, sign.       'Well, father,  what can we do  for you?'  said Aragorn, leaping to his  feet. 'Come and be warm, if you are cold!'  He strode  forward, but the  old  man was gone. There  was  no trace of him to be found near at hand, and they  did not dare to wander far. The moon had set and the night was very dark.       Suddenly Legolas gave a cry."
}