{
  "id": "5abe9422055f1b839e475e0f836912b9543e6163",
  "text": " \"Does he still think I entered myself?\" \"Well. . . no, I don't think so . . . not really,\" said Hermione awkwardly.   \"What's that supposed to mean, 'not really'?\"   \"Oh Harry, isn't it obvious?\" Hermione said despairingly. \"He's jealous!\"   \"Jealous?\" Harry said incredulously.  \"Jealous of what?  He wants to make a prat of himself in front of the whole school, does he?\" \"Look,\" said Hermione patiently, \"it's always you who gets all the attention, you know it is.  I know it's not your fault,\" she added quickly, seeing Harry open his mouth furiously.  \"I know you don't ask for it.. . but - well - you know, Ron's got all those brothers to compete against at home, and you're his best friend, and you're really famous - he's always shunted to one side whenever people see you, and he puts up with it, and he never mentions it, but I suppose this is just one time too many. . . \"Great,\" said Harry bitterly.  \"Really great.  Tell him from me I'll swap any time he wants.  Tell him from me he's welcome to it.... People gawping at my forehead everywhere I go. . .\" \"I'm not teiling him anything,\" Hermione said shortly.  \"Tell him yourself.  It's the only way to sort this out.\" \"I'm not running around after him trying to make him grow up!\"  Harry said, so loudly that several owls in a nearby tree took flight in alarm.  \"Maybe he'll believe I'm not enjoying myself once I've got my neck broken or -\" \"That's not funny,\" said Hermione quietly. \"That's not funny at all.\"  She looked extremely anxious.  \"Harry, I've been thinking - you know what we've got to do, don't you? Straight away, the moment we get back to the castle?\" \"Yeah, give Ron a good kick up the -\" \"Write to Sirius.  You've got to tell him what's happened.  He asked you to keep him posted on everything that's going on at Hogwarts. . . . It's almost as if he expected something like this to happen.  I brought some parchment and a quill out with me -\" \"Come off it,\" said Harry, looking around to check that they couldn't be overheard, but the grounds were quite deserted.  \"He came back to the country just because my scar twinged. He'll probably come bursting right into the castle if I tell him someone's entered me in the Triwizard Tournament -\"   \"He'd want you to tell him,\" said Hermione sternly.  \"He's going to find out anyway.\"   \"How?\"   \"Harry, this isn't going to be kept quiet,\" said Hermione, very seriously.  \"This tournament's famous, and you're famous.  I'll be really surprised if there isn't anything in the Daily Prophet about you competing. . . . You're already in half the books about You-Know-Who, you know.. . and Sirius would rather hear it from you, I know he would.\"   \"Okay, okay, I'll write to him,\" said Harry, throwing his last piece of toast into the lake. They both stood and watched it floating there for a moment, before a large tentacle rose out of the water and scooped it beneath the surface.  Then they returned to the castle.   \"Whose owl am I going to use?\" Harry said as they climbed the stairs. \"He told me not to use Hedwig again.\"   \"Ask Ron if you can borrow -\"   \"I'm not asking Ron for anything,\" Harry said flatly.   \"Well, borrow one of the school owls, then, anyone can use them,\" said Hermione.   They went up to the Owlery. Hermione gave Harry a piece of parchment, a quill, and a bottle of ink, then strolled around the long lines of perches, looking at all the different owls, while Harry sat down against a wall and wrote his letter.  Dear Sirius, You told me to keep you posted on what's happening at Hogwarts, so here goes - I don't know if you've heard, but the Triwizard Tournament's happening this year and on Saturday night I got picked as a fourth champion. I don't who put my name in the Goblet of Fire, because I didn't.  The other Hogwarts champion is Cedric Diggory,  from Hufflepuff    He paused at this point, thinking. He had an urge to say something about the large weight of anxiety that seemed to have settled inside his chest since last night, but he couldn't think how to translate this into words, so he simply dipped his quill back into the ink bottle and wrote,   Hope you're okay, and Buckbeak  -  Harry    \"Finished,\" he told Hermione, getting to his feet and brushing straw off his robes.  At this, Hedwig fluttered down onto his shoulder and held out her leg.   \"I can't use you,\" Harry told her, looking around for the school owls.  \"I've got to use one of these.\"   Hedwig gave a very loud hoot and took off so suddenly that her talons cut into his shoulder.  She kept her back to Harry all the time he was tying his letter to the leg of a large barn owl.  When the barn owl had flown off, Harry reached out to stroke Hedwig, but she clicked her beak furiously and soared up into the rafters out of reach.   \"First Ron, then you,\" Harry said angrily.  \"This isn't my fault.\" If Harry had thought that matters would improve once everyone got used to the idea of him being champion, the following day showed him how mistaken he was.  He could no longer avoid the rest of the school once he was back at lessons - and it was clear that the rest of the school, just like the Gryffindors, thought Harry had entered himself for the tournament."
}