{
  "id": "5aeaa9c9d723bb8a76faecfa086904dc932f0755",
  "text": "  Nothing about any of it.  If you ask me.  Fudge is forcing them to keep quiet.\" \"He'll never keep Rita quiet,\" said Harry.  \"Not on a story like this.\" \"Oh, Rita hasn't written anything at all since the third task,\" said Hermione in an oddly constrained voice.  \"As a matter of fact,\" she added, her voice now trembling slightly, \"Rita Skeeter isn't going to be writing anything at all for a while.  Not unless she wants me to spill the beans on her.\" \"What are you talking about?\" said Ron. \"I found out how she was listening in on private conversations when she wasn't supposed to be coming onto the grounds,\" said Hermione in a rush. Harry had the impression that Hermione had been dying to tell them this for days, but that she had restrained herself in light of everything else that had happened. \"How was she doing it?\"  said Harry at once. \"How did you find out?\"  said Ron, staring at her. \"Well, it was you, really, who gave me the idea. Harry,\" she said. \"Did I?\"  said Harry, perplexed.  \"How?\" \"Bugging,\" said Hermione happily. \"But you said they didn't work -\" \"Oh not electronic bugs,\" said Hermione.  \"No, you see ... Rita Skeeter\" - Hermiones voice trembled with quiet triumph - \"is an unregistered Animagus.  She can turn -\" Hermione pulled a small sealed glass jar out other bag. \"- into a beetle.\" \"You're kidding,\" said Ron.  \"You haven't.. . she's not...\" \"Oh yes she is,\" said Hermione happily, brandishing the jar at them. Inside were a few twigs and leaves and one large, fat beetle. \"That's never - you're kidding -\" Ron whispered, lifting the jar to his eyes. \"No, I'm not,\" said Hermione, beaming.  \"I caught her on the windowsill in the hospital wing.  Look very closely, and you'll notice the markings around her antennae are exactly like those foul glasses she wears.\" Harry looked and saw that she was quite right.  He also remembered something. \"There was a beetle on the statue the night we heard Hagrid telling Madame Maxime about his mum!\" \"Exactly,\" said Hermione.  \"And Viktor pulled a beetle out of my hair after we'd had our conversation by the lake.  And unless I'm very much mistaken, Rita was perched on the windowsill of the Divination class the day your scar hurt.  She's been buzzing around for stories all year.\" \"When we saw Malfoy under that tree ...\" said Ron slowly. \"He was talking to her, in his hand,\" said Hermione.  \"He knew, of course.  That's how she's been getting all those nice little interviews with the Slytherins.  They wouldn't care that she was doing something illegal, as long as they were giving her horrible stuff about us and Hagrid.\" Hermione took the glass jar back from Ron and smiled at the beetle, which buzzed angrily against the glass. \"I've told her I'll let her out when we get back to London,\" said Hermione.  \"I've put an Unbreakable Charm on the jar, you see, so she can't transform.  And I've told her she's to keep her quill to herself for a whole year.  See if she can't break the habit of writing horrible lies about people.\" Smiling serenely, Hermione placed the beetle back inside her schoolbag. The door of the compartment slid open. \"Very clever. Granger,\" said Draco Malfoy. Crabbe and Goyle were standing behind him.  All three of them looked more pleased with themselves, more arrogant and more menacing, than Harry had ever seen them. \"So,\" said Malfoy slowly, advancing slightly into the compartment and looking slowly around at them, a smirk quivering on his lips.  \"You caught some pathetic reporter, and Potter's Dumbledore's favorite boy again.  Big deal.\" His smirk widened.  Crabbe and Goyle leered. \"Trying not to think about it, are we?\"  said Malfoy softly, looking around at all three of them.  \"Trying to pretend it hasn't happened?\" \"Get out,\" said Harry. He had not been this close to Malfoy since he had watched him muttering to Crabbe and Goyle during Dumbledores speech about Cedric.  He could feel a kind of ringing in his ears. His hand gripped his wand under his robes. \"You've picked the losing side, Potter!  I warned you!  I told you you ought to choose your company more carefully, remember?  When we met on the train, first day at Hogwarts?  I told you not to hang around with riffraff like this!\"  He jerked his head at Ron and Hermione. \"Too late now. Potter!  They'll be the first to go, now the Dark Lord's back!  Mudbloods and Muggle-lovers first!  Well - second - Diggory was the f-\" It was as though someone had exploded a box of fireworks within the compartment. Blinded by the blaze of the spells that had blasted from every direction, deafened by a series of bangs, Harry blinked and looked down at the floor. Malfoy, Crabbe, and Goyle were all lying unconscious in the doorway.  He, Ron, and Hermione were on their feet, all three of them having used a different hex.  Nor were they the only ones to have done so. \"Thought we'd see what those three were up to,\" said Fred matter-of-factly, stepping onto Goyle and into the compartment.  He had his wand out, and so did George, who was careful to tread on Malfoy as he followed Fred inside."
}