{
  "id": "5b08b11cfea94dc1f31f0c8dc8af8ac6a496f648",
  "text": " Soon the  road began to  fall gently but steadily into the dusk. A  star  came out above the trees in  the darkening East before them.  They went  abreast  and in step, to keep up  their spirits.  After  a time, as the stars  grew thicker and  brighter, the  feeling of disquiet left them, and they no longer listened  for the sound of  hoofs. They began to hum softly, as hobbits have a way of doing as they walk  along,  especially  when  they  are drawing near to home at night. With most   hobbits  it  is  a supper -song  or a bed-song;  but these  hobbits  hummed a   walking-song (though not, of course, without any mention of supper and bed).  Bilbo Baggins had made the words, to a tune  that  was as old as  the hills,  and taught  it to Frodo as they walked in the  lanes of the Water -valley and  talked about Adventure.       Upon the hearth the fire is red,       Beneath the roof there is a bed;       But not yet weary are our feet,       Still round the corner we may meet       A sudden tree or standing stone       That none have seen but we alone.       Tree and flower and leaf and grass,       Let them pass! Let them pass!       Hill and water under sky,       Pass them by! Pass them by!         Still round the corner there may  wait       A new road or a secret gate,   ####-     And though we pass them by today,       Tomorrow we may come this way       And take the hidden paths that run       Towards the Moon or to the Sun.       Apple, thorn, and nut and sloe,       Let them go! Let them go!       Sand and stone and pool and dell,       Fare you well! Fare you well!         Home is behind, the world ahead,       And there are many paths to tread       Through shadows to the edge of night,       Until the stars are all alight.       Then world behind and home ahead,       We'll wander back to home and bed.       Mist and twilight, cloud and shade,       Away shall fade! Away shall fade!       Fire and lamp, and meat and bread,       And then to bed! And then to bed!       The song ended. 'And now to bed! And now to bed!' sang Pippin in a high  voice.       'Hush!' said Frodo. 'I think I hear hoofs again.'       They slopped suddenly  and  stood as silent as tree-shadows, listening.  There was a sound of hoofs in the lane, some way behind, but coming slow and  clear down the wind. Quickly and quietly they slipped off the path, and  ran  into the deeper shade under the oak-trees.       'Don't let  us go too far!' said Frodo. 'I don't want to be seen, but I  want to see if it is another Black Rider.'       'Very well!' said Pippin. 'But don't forget the sniffing!'       The hoofs drew nearer. They had no time to find any hiding-place better   than the general  darkness under the trees; Sam and Pippin crouched behind a  large tree-bole, while  Frodo  crept back a few yards  towards  the lane. It  showed grey and pale, a line  of fading light through the wood. Above it the  stars were thick in the dim sky, but there was no moon.       The sound of hoofs stopped. As Frodo watched he saw something dark pass  across  the lighter  space between two trees, and then halt. It looked  like  the  black shade of a horse led by a smaller black  shadow. The black shadow   ####-stood close  to the point where they had left the  path, and it  swayed from  side to side. Frodo thought he heard the sound of  snuffling. The shadow bent  to the ground, and then began to crawl towards him.       Once more the desire to slip on the Ring came over Frodo; but this time  it was stronger than before. So strong that, almost before he  realized what  he was  doing, his hand was groping  in his pocket. But at that moment there  came  a sound  like mingled song and laughter. Clear voices rose and fell in   the starlit air. The black shadow straightened up and retreated.  It climbed  on to the  shadowy  horse  and  seemed  to  vanish  across the lane into the  darkness on the other side. Frodo breathed again.       'Elves!' exclaimed Sam in a hoarse whisper. 'Elves, sir!' He would have  burst  out of the trees and dashed off towards  the voices, if they  had not  pulled him back.       'Yes,  it  is Elves,' said  Frodo. 'One can meet them sometimes  in the  Woody End.  They don't live in the Shire, but they  wander into it in Spring  and  Autumn,  out  of their own  lands away  beyond the  Tower Hills.  I  am  thankful that they do! You did not  see, but  that Black  Rider stopped just   here and was actually crawling towards us when the song began. As soon as he  heard the voices he slipped away.'       'What  about the Elves?'  said  Sam, too  excited  to trouble about the  rider. 'Can't we go and see them?'       'Listen! They are coming this way,' said Frodo. 'We have only to wait.'  The singing drew nearer. One clear voice rose now above  the others.  It was  singing in the fair elven-tongue, of which Frodo knew only a little, and the  others knew nothing. Yet  the sound blending with the melody seemed to shape  itself  in their thought into words which they only partly understood."
}