{
  "id": "5b2e0943489be7706fb4bb82e8389a30e0fcb36d",
  "text": " We ought ride on.    But,  said Cleos,  you said yourself—    Then.  When I thought the inn deserted.  Now I have a full belly, and a moonlight ride will be just the thing.  He smiled for the wench.  But unless you mean to throw me over the back of that plow horse like a sack of flour, someone had best do something about these irons. It’s difficult to ride with your ankles chained together.   Brienne frowned at the chain. The man who wasn’t an innkeep rubbed his jaw.  There’s a smithy round back of the stable.    Show me,  Brienne said.   Yes,  said Jaime,  and the sooner the better. There’s far too much horse shit about here for my taste. I would hate to step in it.  He gave the wench a sharp look, wondering if she was bright enough to take his meaning.  He hoped she might strike the irons off his wrists as well, but Brienne was still suspicious. She split the ankle chain in the center with a half-dozen sharp blows from the smith’s hammer delivered to the blunt end of a steel chisel. When he suggested that she break the wrist chain as well, she ignored him.   Six miles downriver you’ll see a burned village,  their host said as he was helping them saddle the horses and load their packs. This time he directed his counsel at Brienne.  The road splits there. If you turn south, you’ll come on Ser Warren’s stone towerhouse. Ser Warren went off and died, so I couldn’t say who holds it now, but it’s a place best shunned. You’d do better to follow the track through the woods, south by east.    We shall,  she answered.  You have my thanks.   More to the point, he has your gold. Jaime kept the thought to himself. He was tired of being disregarded by this huge ugly cow of a woman.  She took the plow horse for herself and assigned the palfrey to Ser Cleos. As threatened, Jaime drew the one-eyed gelding, which put an end to any thoughts he might have had of giving his horse a kick and leaving the wench in his dust.  The man and the boy came out to watch them leave. The man wished them luck and told them to come back in better times, while the lad stood silent, his crossbow under his arm.  Take up the spear or maul,  Jaime told him,  they’ll serve you better.  The boy stared at him distrustfully. So much for friendly advice. He shrugged, turned his horse, and never looked back.  Ser Cleos was all complaints as they rode out, still in mourning for his lost featherbed. They rode east, along the bank of the moonlit river. The Red Fork was very broad here, but shallow, its banks all mud and reeds. Jaime’s mount plodded along placidly, though the poor old thing had a tendency to want to drift off to the side of his good eye. It felt good to be mounted once more. He had not been on a horse since Robb Stark’s archers had killed his destrier under him in the Whispering Wood.  When they reached the burned village, a choice of equally unpromising roads confronted them; narrow tracks, deeply rutted by the carts of farmers hauling their grain to the river. One wandered off toward the southeast and soon vanished amidst the trees they could see in the distance, while the other, straighter and stonier, arrowed due south. Brienne considered them briefly, and then swung her horse onto the southern road. Jaime was pleasantly surprised; it was the same choice he would have made.   But this is the road the innkeep warned us against,  Ser Cleos objected.   He was no innkeep.  She hunched gracelessly in the saddle, but seemed to have a sure seat nonetheless.  The man took too great an interest in our choice of route, and those woods… such places are notorious haunts of outlaws. He may have been urging us into a trap.    Clever wench.  Jaime smiled at his cousin.  Our host has friends down that road, I would venture. The ones whose mounts gave that stable such a memorable aroma.    He may have been lying about the river as well, to put us on these horses,  the wench said,  but I could not take the risk. There will be soldiers at the ruby ford and the crossroads.   Well, she may be ugly but she’s not entirely stupid. Jaime gave her a grudging smile.  The ruddy light from the upper windows of the stone towerhouse gave them warning of its presence a long way off, and Brienne led them off into the fields. Only when the stronghold was well to the rear did they angle back and find the road again.  Half the night passed before the wench allowed that it might be safe to stop. By then all three of them were drooping in their saddles. They sheltered in a small grove of oak and ash beside a sluggish stream. The wench would allow no fire, so they shared a midnight supper of stale oatcakes and salt fish. The night was strangely peaceful. The half-moon sat overhead in a black felt sky, surrounded by stars. Off in the distance, some wolves were howling. One of their horses whickered nervously. There was no other sound. The war has not touched this place, Jaime thought. He was glad to be here, glad to be alive, glad to be on his way back to Cersei.   I’ll take the first watch,  Brienne told Ser Cleos, and Frey was soon snoring softly."
}