{
  "id": "5b93cf0e24e9d15fee0338349b517ad64ab9b0d4",
  "text": " The end of the long summer was near at hand. Winter is coming.  A few villagers eyed the direwolves anxiously as the riders went past, and one man dropped the wood he was carrying as he shrank away in fear, but most of the townfolk had grown used to the sight. They bent the knee when they saw the boys, and Robb greeted each of them with a lordly nod.  With his legs unable to grip, the swaying motion of the horse made Bran feel unsteady at first, but the huge saddle with its thick horn and high back cradled him comfortingly, and the straps around his chest and thighs would not allow him to fall. After a time the rhythm began to feel almost natural. His anxiety faded, and a tremulous smile crept across his face.  Two serving wenches stood beneath the sign of the Smoking Log, the local alehouse. When Theon Greyjoy called out to them, the younger girl turned red and covered her face. Theon spurred his mount to move up beside Robb.  Sweet Kyra,  he said with a laugh.  She squirms like a weasel in bed, but say a word to her on the street, and she blushes pink as a maid. Did I ever tell you about the night that she and Bessa—    Not where my brother can hear, Theon,  Robb warned him with a glance at Bran.  Bran looked away and pretended not to have heard, but he could feel Greyjoy’s eyes on him. No doubt he was smiling. He smiled a lot, as if the world were a secret joke that only he was clever enough to understand. Robb seemed to admire Theon and enjoy his company, but Bran had never warmed to his father’s ward.  Robb rode closer.  You are doing well, Bran.    I want to go faster,  Bran replied.  Robb smiled.  As you will.  He sent his gelding into a trot. The wolves raced after him. Bran snapped the reins sharply, and Dancer picked up her pace. He heard a shout from Theon Greyjoy, and the hoofbeats of the other horses behind him.  Bran’s cloak billowed out, rippling in the wind, and the snow seemed to rush at his face. Robb was well ahead, glancing back over his shoulder from time to time to make sure Bran and the others were following. He snapped the reins again. Smooth as silk, Dancer slid into a gallop. The distance closed. By the time he caught Robb on the edge of the wolfswood, two miles beyond the winter town, they had left the others well behind.  I can ride!  Bran shouted, grinning. It felt almost as good as flying.   I’d race you, but I fear you’d win.  Robb’s tone was light and joking, yet Bran could tell that something was troubling his brother underneath the smile.   I don’t want to race.  Bran looked around for the direwolves. Both had vanished into the wood.  Did you hear Summer howling last night?    Grey Wind was restless too,  Robb said. His auburn hair had grown shaggy and unkempt, and a reddish stubble covered his jaw, making him look older than his fifteen years.  Sometimes I think they know things… sense things…  Robb sighed.  I never know how much to tell you, Bran. I wish you were older.    I’m eight now!  Bran said.  Eight isn’t so much younger than fifteen, and I’m the heir to Winterfell, after you.    So you are.  Robb sounded sad, and even a little scared.  Bran, I need to tell you something. There was a bird last night. From King’s Landing. Maester Luwin woke me.   Bran felt a sudden dread. Dark wings, dark words, Old Nan always said, and of late the messenger ravens had been proving the truth of the proverb. When Robb wrote to the Lord Commander of the Night’s Watch, the bird that came back brought word that Uncle Benjen was still missing. Then a message had arrived from the Eyrie, from Mother, but that had not been good news either. She did not say when she meant to return, only that she had taken the Imp as prisoner. Bran had sort of liked the little man, yet the name Lannister sent cold fingers creeping up his spine. There was something about the Lannisters, something he ought to remember, but when he tried to think what, he felt dizzy and his stomach clenched hard as a stone. Robb spent most of that day locked behind closed doors with Maester Luwin, Theon Greyjoy, and Hallis Mollen. Afterward, riders were sent out on fast horses, carrying Robb’s commands throughout the north. Bran heard talk of Moat Cailin, the ancient stronghold the First Men had built at the top of the Neck. No one ever told him what was happening, yet he knew it was not good.  And now another raven, another message. Bran clung to hope.  Was the bird from Mother? Is she coming home?    The message was from Alyn in King’s Landing. Jory Cassel is dead. And Wyl and Heward as well. Murdered by the Kingslayer.  Robb lifted his face to the snow, and the flakes melted on his cheeks.  May the gods give them rest.   Bran did not know what to say. He felt as if he’d been punched. Jory had been captain of the household guard at Winterfell since before Bran was born.  They killed Jory?  He remembered all the times Jory had chased him over the roofs. He could picture him striding across the yard in mail and plate, or sitting at his accustomed place on the bench in the Great Hall, joking as he ate."
}