{
  "id": "5bb3781e9be26caf2485d7d479612ad6f6b067cb",
  "text": "  Bran picked one up.  It’s made of glass.  Curious, Rickon drifted closer to peer over the table.   Dragonglass,  Osha named it as she sat down beside Luwin, bandagings in hand.   Obsidian,  Maester Luwin insisted, holding out his wounded arm.  Forged in the fires of the gods, far below the earth. The children of the forest hunted with that, thousands of years ago. The children worked no metal. In place of mail, they wore long shirts of woven leaves and bound their legs in bark, so they seemed to melt into the wood. In place of swords, they carried blades of obsidian.    And still do.  Osha placed soft pads over the bites on the maester’s forearm and bound them tight with long strips of linen.  Bran held the arrowhead up close. The black glass was slick and shiny. He thought it beautiful.  Can I keep one?    As you wish,  the maester said.   I want one too,  Rickon said.  I want four. I’m four.   Luwin made him count them out.  Careful, they’re still sharp. Don’t cut yourself.    Tell me about the children,  Bran said. It was important.   What do you wish to know?    Everything.   Maester Luwin tugged at his chain collar where it chafed against his neck.  They were people of the Dawn Age, the very first, before kings and kingdoms,  he said.  In those days, there were no castles or holdfasts, no cities, not so much as a market town to be found between here and the sea of Dorne. There were no men at all. Only the children of the forest dwelt in the lands we now call the Seven Kingdoms.   They were a people dark and beautiful, small of stature, no taller than children even when grown to manhood. They lived in the depths of the wood, in caves and crannogs and secret tree towns. Slight as they were, the children were quick and graceful. Male and female hunted together, with weirwood bows and flying snares. Their gods were the gods of the forest, stream, and stone, the old gods whose names are secret. Their wise men were called greenseers, and carved strange faces in the weirwoods to keep watch on the woods. How long the children reigned here or where they came from, no man can know.   But some twelve thousand years ago, the First Men appeared from the east, crossing the Broken Arm of Dorne before it was broken. They came with bronze swords and great leathern shields, riding horses. No horse had ever been seen on this side of the narrow sea. No doubt the children were as frightened by the horses as the First Men were by the faces in the trees. As the First Men carved out holdfasts and farms, they cut down the faces and gave them to the fire. Horror-struck, the children went to war. The old songs say that the greenseers used dark magics to make the seas rise and sweep away the land, shattering the Arm, but it was too late to close the door. The wars went on until the earth ran red with blood of men and children both, but more children than men, for men were bigger and stronger, and wood and stone and obsidian make a poor match for bronze. Finally the wise of both races prevailed, and the chiefs and heroes of the First Men met the greenseers and wood dancers amidst the weirwood groves of a small island in the great lake called Gods Eye.   There they forged the Pact. The First Men were given the coastlands, the high plains and bright meadows, the mountains and bogs, but the deep woods were to remain forever the children’s, and no more weirwoods were to be put to the axe anywhere in the realm. So the gods might bear witness to the signing, every tree on the island was given a face, and afterward, the sacred order of green men was formed to keep watch over the Isle of Faces.   The Pact began four thousand years of friendship between men and children. In time, the First Men even put aside the gods they had brought with them, and took up the worship of the secret gods of the wood. The signing of the Pact ended the Dawn Age, and began the Age of Heroes.   Bran’s fist curled around the shiny black arrowhead.  But the children of the forest are all gone now, you said.    Here, they are,  said Osha, as she bit off the end of the last bandage with her teeth.  North of the Wall, things are different. That’s where the children went, and the giants, and the other old races.   Maester Luwin sighed.  Woman, by rights you ought to be dead or in chains. The Starks have treated you more gently than you deserve. It is unkind to repay them for their kindness by filling the boys’ heads with folly.    Tell me where they went,  Bran said.  I want to know.    Me too,  Rickon echoed.   Oh, very well,  Luwin muttered.  So long as the kingdoms of the First Men held sway, the Pact endured, all through the Age of Heroes and the Long Night and the birth of the Seven Kingdoms, yet finally there came a time, many centuries later, when other peoples crossed the narrow sea.   The Andals were the first, a race of tall, fair-haired warriors who came with steel and fire and the seven-pointed star of the new gods painted on their chests. The wars lasted hundreds of years, but in the end the six southron kingdoms all fell before them."
}