{
  "id": "5c407a9f97d63decb2113abb7775445a8eeb26c0",
  "text": "  Might be you’ll do. We’ll put you on a tower with a longbow, but if you bloody well fall off don’t come crying to me.   He could see the kingsroad wending its way south through stony brown fields and over windswept hills. The Magnar would be coming up that road before the day was done, his Thenns marching behind him with axes and spears in their hands and their bronze-and-leather shields on their backs. Grigg the Goat, Quort, Big Boil, and the rest will be coming as well. And Ygritte. The wildlings had never been his friends, he had not allowed them to be his friends, but her…  He could feel the throb of pain where her arrow had gone through the meat and muscle of his thigh. He remembered the old man’s eyes too, and the black blood rushing from his throat as the storm cracked overhead. But he remembered the grotto best of all, the look of her naked in the torchlight, the taste of her mouth when it opened under his. Ygritte, stay away. Go south and raid, go hide in one of those roundtowers you liked so well. You’ll find nothing here but death.  Across the yard, one of the bowmen on the roof of the old Flint Barracks had unlaced his breeches and was pissing through a crenel. Mully, he knew from the man’s greasy orange hair. Men in black cloaks were visible on other roofs and tower tops as well, though nine of every ten happened to be made of straw.  The scarecrow sentinels,  Donal Noye called them. Only we’re the crows, Jon mused, and most of us were scared enough.  Whatever you called them, the straw soldiers had been Maester Aemon’s notion. They had more breeches and jerkins and tunics in the storerooms than they’d had men to fill them, so why not stuff some with straw, drape a cloak around their shoulders, and set them to standing watches? Noye had placed them on every tower and in half the windows. Some were even clutching spears, or had crossbows cocked under their arms. The hope was that the Thenns would see them from afar and decide that Castle Black was too well defended to attack.  Jon had six scarecrows sharing the roof of the King’s Tower with him, along with two actual breathing brothers. Deaf Dick Follard sat in a crenel, methodically cleaning and oiling the mechanism of his crossbow to make sure the wheel turned smoothly, while the Oldtown boy wandered restlessly around the parapets, fussing with the clothes on straw men. Maybe he thinks they will fight better if they’re posed just right. Or maybe this waiting is fraying his nerves the way it’s fraying mine.  The boy claimed to be eighteen, older than Jon, but he was green as summer grass for all that. Satin, they called him, even in the wool and mail and boiled leather of the Night’s Watch; the name he’d gotten in the brothel where he’d been born and raised. He was pretty as a girl with his dark eyes, soft skin, and raven’s ringlets. Half a year at Castle Black had toughened up his hands, however, and Noye said he was passable with a crossbow. Whether he had the courage to face what was coming, though…  Jon used the crutch to limp across the tower top. The King’s Tower was not the castle’s tallest—the high, slim, crumbling Lance held that honor, though Othell Yarwyck had been heard to say it might topple any day. Nor was the King’s Tower strongest—the Tower of Guards beside the kingsroad would be a tougher nut to crack. But it was tall enough, strong enough, and well placed beside the Wall, overlooking the gate and the foot of the wooden stair.  The first time he had seen Castle Black with his own eyes, Jon had wondered why anyone would be so foolish as to build a castle without walls. How could it be defended?   It can’t,  his uncle told him.  That is the point. The Night’s Watch is pledged to take no part in the quarrels of the realm. Yet over the centuries certain Lords Commander, more proud than wise, forgot their vows and near destroyed us all with their ambitions. Lord Commander Runcel Hightower tried to bequeathe the Watch to his bastard son. Lord Commander Rodrik Flint thought to make himself King-beyond-the-Wall. Tristan Mudd, Mad Marq Rankenfell, Robin Hill… did you know that six hundred years ago, the commanders at Snowgate and the Nightfort went to war against each other? And when the Lord Commander tried to stop them, they joined forces to murder him? The Stark in Winterfell had to take a hand… and both their heads. Which he did easily, because their strongholds were not defensible. The Night’s Watch had nine hundred and ninety-six Lords Commander before Jeor Mormont, most of them men of courage and honor… but we have had cowards and fools as well, our tyrants and our madmen. We survive because the lords and kings of the Seven Kingdoms know that we pose no threat to them, no matter who should lead us. Our only foes are to the north, and to the north we have the Wall.   Only now those foes have gotten past the Wall to come up from the south, Jon reflected, and the lords and kings of the Seven Kingdoms have forgotten us. We are caught between the hammer and the anvil."
}