{
  "id": "5ca8785164fac0d5e8e15bf2928a650462aae2e7",
  "text": "  William  choked.  \"Shut  yer  mouth!\"  he  said  as  soon  as  he  could.  \"Yer  can't  expect  folk  to stop here  for ever  just  to be et by you and Bert. You've et a village  and a half between yer, since we come down from the mountains. How much more   ####-d'yer want? And time's been up our way, when yer'd have said 'thank yer Bill' for a  nice bit o'  fat valley mutton  like what  this  is.\" He  took a big bite off a  sheep's  leg  he was toasting, and wiped his lips on his sleeve.  Yes, I am afraid trolls do behave like that, even those with only one head each.  After  hearing  all  this  Bilbo  ought  to  have  done  something  at  once.  Either  he  should  have  gone  back  quietly  and  warned  his  friends  that  there  were  three  fair- sized  trolls  at  hand  in  a  nasty  mood,  quite  likely  to  try  toasted  dwarf,  or  even  pony,  for  a  change;  or  else  he  should  have  done  a  bit  of  good  quick  burgling.  A  really  first-class  and  legendary  burglar would  at  this  point  have  picked  the  trolls'  pockets-it  is  nearly  always  worthwhile  if  you  can  manage  it-,  pinched  the  very  mutton off the spite, purloined the beer, and walked off without their noticing him.  Others more practical but with less professional pride would perhaps have stuck a  dagger  into  each  of  them  before  they observed  it. Then  the night could have been  spent cheerily.   Bilbo knew  it. He had  read of a good many  things he had never seen or done.  He  was  very  much  alarmed,  as  well  as  disgusted;  he  wished  himself  a  hundred  miles away, and yet-and yet somehow he could not go straight back to Thorin and  Company empty-handed. So he stood and hesitated in the shadows. Of the various  burglarious  proceedings  he  had  heard  of  picking  the  trolls'  pockets  seemed  the  least difficult, so at last he crept behind a tree just behind William.  Bert and Tom went off  to  the barrel. William was having another drink. Then  Bilbo  plucked  up  courage  and  put  his  little  hand  in William's  enormous  pocket.  There was a purse in it, as big as a bag to Bilbo. \"Ha!\" thought he warming to his  new work as he lifted it carefully out, \"this is a beginning!\"  It was! Trolls' purses are the mischief, and this was no exception. \" 'Ere, 'oo are  you?\"  it  squeaked,  as  it  left  the  pocket;  and  William  turned  round  at  once  and  grabbed Bilbo by the neck, before he could duck behind the tree.  \"Blimey, Bert, look what I've copped!\" said William.  \"What is it?\" said the others coming up.  \"Lumme, if I knows! What are yer?\"  \"Bilbo  Baggins,  a  bur—  a  hobbit,\"  said  poor  Bilbo,  shaking  all  over,  and  wondering how to make owl-noises before they throttled him.  \"A  burrahobbit?\"  said  they  a  bit  startled.  Trolls  are  slow  in  the  uptake,  and  mighty suspicious about anything new to them.  \"What's a burrahobbit got to do with my pocket, anyways?\" said William.  \"And can yer cook 'em?\" said Tom.  \"Yer can try,\" said Bert, picking up a skewer.    ####-\"He wouldn't make  above  a mouthful,\"  said William, who  had  already  had  a  fine supper, \"not when he was skinned and boned.\"  \"P'raps  there  are more  like  him  round  about,  and we might make  a  pie,\"  said  Bert.  \"Here  you,  are  there  any  more  of  your  sort  a-sneakin'  in  these  here woods,  yer  nassty  little  rabbit,\"  said  he  looking  at  the  hobbit's  furry  feet;  and  he  picked  him up by the toes and shook him.  \"Yes,  lots,\"  said  Bilbo,  before  he  remembered  not  to  give  his  friends  away.  \"No, none at all, not one,\" he said immediately afterwards.  \"What  d'yer  mean?\"  said  Bert,  holding  him  right  away  up,  by  the  hair  this  time.  \"What I say,\" said Bilbo gasping. \"And please don't cook me, kind sirs! I am a  good  cook myself,  and  cook  bet-ter  than  I cook,  if you  see what  I mean.  I'll cook  beautifully for you, a perfectly beautiful breakfast for you, if only you won't have  me for supper.\"  \"Poor  little blighter,\"  said William. He had  already had  as much  supper  as he  could hold; also he had had lots of beer. \"Poor little blighter! Let him go!\"  \"Not  till  he  says  what  he  means  by  lots  and  none  at  all,\"  said  Bert.  \"I  don't  want to have me throat cut in me sleep. Hold his toes in the fire, till he talks!\"  \"I won't have it,\" said William. \"I caught him anyway.\"  \"You're a fat fool, William,\" said Bert, \"as I've said afore this evening.\"  \"And you're a lout!\"  \"And  I won't  take  that  from you. Bill Huggins,\"  says Bert, and puts his  fist  in  William's eye.  Then  there  was  a  gorgeous  row.  Bilbo  had  just  enough  wits  left,  when  Bert  dropped  him  on  the  ground,  to  scramble  out  of  the way  of  their  feet,  before  they  were  fighting  like  dogs,  and  calling  one  another  all  sorts  of  perfectly  true  and  applicable  names  in  very  loud  voices.  Soon  they  were  locked  in  one  another's  arms,  and  rolling  nearly  into  the  fire  kicking  and  thumping, while Tom whacked  at  then  both  with  a  branch  to  bring  them  to  their  senses-and  that  of  course  only  made  them  madder  than  ever."
}