{
  "id": "5d3319a7839ce19802ff4d5d1610c07b8f6d2930",
  "text": "  Does your wolf have steel teeth, to bite through plate and mail?    Enough!  Maester Luwin’s voice cracked through the clangor of the yard as loud as a thunderclap. How much he had overheard, Bran could not say… but it was enough to anger him, clearly.  These threats are unseemly, and I’ll hear no more of them. Is this how you behave at the Twins, Walder Frey?    If I want to.  Atop his courser, Little Walder gave Luwin a sullen glare, as if to say, You are only a maester, who are you to reproach a Frey of the Crossing?   Well, it is not how Lady Stark’s wards ought behave at Winterfell. What’s at the root of this?  The maester looked at each boy in turn.  One of you will tell me, I swear, or—    We were having a jape with Hodor,  confessed Big Walder.  I am sorry if we offended Prince Bran. We only meant to be amusing.  He at least had the grace to look abashed.  Little Walder only looked peevish.  And me,  he said.  I was only being amusing too.   The bald spot atop the maester’s head had turned red, Bran could see; if anything, Luwin was more angry than before.  A good lord comforts and protects the weak and helpless,  he told the Freys.  I will not have you making Hodor the butt of cruel jests, do you hear me? He’s a goodhearted lad, dutiful and obedient, which is more than I can say for either of you.  The maester wagged a finger at Little Walder.  And you will stay out of the godswood and away from those wolves, or answer for it.  Sleeves flapping, he turned on his heels, stalked off a few paces, and glanced back.  Bran. Come. Lord Wyman awaits.    Hodor, go with the maester,  Bran commanded.   Hodor,  said Hodor. His long strides caught up with the maester’s furiously pumping legs on the steps of the Great Keep. Maester Luwin held the door open, and Bran hugged Hodor’s neck and ducked as they went through.   The Walders—  he began.   I’ll hear no more of that, it’s done.  Maester Luwin looked worn-out and frayed.  You were right to defend Hodor, but you should never have been there. Ser Rodrik and Lord Wyman have broken their fast already while they waited for you. Must I come myself to fetch you, as if you were a little child?    No,  Bran said, ashamed.  I’m sorry. I only wanted…    I know what you wanted,  Maester Luwin said, more gently.  Would that it could be, Bran. Do you have any questions before we begin this audience?    Will we talk of the war?    You will talk of naught.  The sharpness was back in Luwin’s voice.  You are still a child of eight…    Almost nine!    Eight,  the maester repeated firmly.  Speak nothing but courtesies unless Ser Rodrik or Lord Wyman puts you a question.   Bran nodded.  I’ll remember.    I will say nothing to Ser Rodrik of what passed between you and the Frey boys.    Thank you.   They put Bran in his father’s oak chair with the grey velvet cushions, behind a long plank-and-trestle table. Ser Rodrik sat on his right hand and Maester Luwin to his left, armed with quills and inkpots and a sheaf of blank parchment to write down all that transpired. Bran ran a hand across the rough wood of the table and begged Lord Wyman’s pardons for being late.   Why, no prince is ever late,  the Lord of White Harbor responded amiably.  Those who arrive before him have come early, that’s all.  Wyman Manderly had a great booming laugh. it was small wonder he could not sit a saddle; he looked as if he outweighed most horses. As windy as he was vast, he began by asking Winterfell to confirm the new customs officers he had appointed for White Harbor. The old ones had been holding back silver for King’s Landing rather than paying it over to the new King in the North.  King Robb needs his own coinage as well,  he declared,  and White Harbor is the very place to mint it.  He offered to take charge of the matter, as it please the king, and went from that to speak of how he had strengthened the port’s defenses, detailing the cost of every improvement.  In addition to a mint, Lord Manderly also proposed to build Robb a warfleet.  We have had no strength at sea for hundreds of years, since Brandon the Burner put the torch to his father’s ships. Grant me the gold and within the year I will float you sufficient galleys to take Dragonstone and King’s Landing both.   Bran’s interest pricked up at talk of warships. No one asked him, but he thought Lord Wyman’s notion a splendid one. In his mind’s eye he could see them already. He wondered if a cripple had ever commanded a warship. But Ser Rodrik promised only to send the proposal on to Robb for his consideration, while Maester Luwin scratched at the parchment.  Midday came and went. Maester Luwin sent Poxy Tym down to the kitchens, and they dined in the solar on cheese, capons, and brown oatbread. While tearing apart a bird with fat fingers, Lord Wyman made polite inquiry after Lady Hornwood, who was a cousin of his.  She was born a Manderly, you know. Perhaps, when her grief has run its course, she would like to be a Manderly again, eh?  He took a bite from a wing, and smiled broadly."
}