{
  "id": "5db87d29b9d870888a6bd49369a9fc992bde3fca",
  "text": "      HOUSE FREY   Powerful, wealthy, and numerous, the Freys are bannermen to House Tully, but they have not always been diligent in their duty. When Robert Baratheon met Rhaegar Targaryen on the Trident, the Freys did not arrive until the battle was done, and thereafter Lord Hoster Tully always called Lord Walder  the Late Lord Frey.  It is also said of Walder Frey that he is the only lord in the Seven Kingdoms who could field an army out of his breeches.      At the onset of the War of the Five Kings, Robb Stark won Lord Walder’s allegiance by pledging to wed one of his daughters or granddaughters. Two of Lord Walder’s grandsons were sent to Winterfell to be fostered.      WALDER FREY, Lord of the Crossing, —by his first wife, {LADY PERRA, of House Royce}: —{SER STEVRON}, their eldest son, died after the Battle of Oxcross, —m. {Corenna Swann, died of a wasting illness},  —Stevron’s eldest son, SER RYMAN, heir to the Twins, —Ryman’s son, EDWYN, wed to Janyce Hunter, —Edwyn’s daughter, WALDA, a girl of eight,  —Ryman’s son, WALDER, called BLACK WALDER,  —Ryman’s son, PETYR, called PETYR PIMPLE, —m. Mylenda Caron,  —Petyr’s daughter, PERRA, a girl of five,    —m. {Jeyne Lydden, died in a fall from a horse},  —Stevron’s son, AEGON, a halfwit called JINGLEBELL,  —Stevron’s daughter, {MAEGELLE, died in childbed}, m. Ser Dafyn Vance, —Maegelle’s daughter, MARIANNE, a maiden,  —Maegelle’s son, WALDER VANCE, a squire,  —Maegelle’s son, PATREK VANCE,  —m. {Marsella Waynwood, died in childbed},  —Stevron’s son, WALTON, m. Deana Hardyng, —Walton’s son, STEFFON, called THE SWEET,  —Walton’s daughter, WALDA, called FAIR WALDA,  —Walton’s son, BRYAN, a squire,    —SER EMMON, m. Genna of House Lannister, —Emmon’s son, SER CLEOS, m. Jeyne Darry, —Cleos’s son, TYWIN, a squire of eleven,  —Cleos’s son, WILLEM, a page at Ashemark, nine,  —Emmon’s son, SER LYONEL, m. Melesa Crakehall,  —Emmon’s son, TION, a captive at Riverrun,  —Emmon’s son, WALDER, called RED WALDER, fourteen, a squire at Casterly Rock,  —SER AENYS, m. {Tyana Wylde, died in childbed}, —Aenys’s son, AEGON BLOODBORN, an outlaw,  —Aenys’s son, RHAEGAR, m. Jeyne Beesbury, —Rhaegar’s son, ROBERT, a boy of thirteen,  —Rhaegar’s daughter, WALDA, a girl of ten, called WHITE WALDA,  —Rhaegar’s son, JONOS, a boy of eight,    —PERRIANE, m. Ser Leslyn Haigh, —Perriane’s son, SER HARYS HAIGH, —Harys’s son, WALDER HAIGH, a boy of four,  —Perriane’s son, SER DONNEL HAIGH,  —Perriane’s son, ALYN HAIGH, a squire,      —by his second wife, {LADY CYRENNA, of House Swann}: —SER JARED, their eldest son, m. {Alys Frey}, —Jared’s son, SER TYTOS, m. Zhoe Blanetree, —Tytos’s daughter, ZIA, a maid of fourteen,  —Tytos’s son, ZACHERY, a boy of twelve, training at the Sept of Oldtown,  —Jared’s daughter, KYRA, m. Ser Garse Goodbrook, —Kyra’s son, WALDER GOODBROOK, a boy of nine,  —Kyra’s daughter, JEYNE GOODBROOK, six,    —SEPTON LUCEON, in service at the Great Sept of Baelor in King’s Landing,      —by his third wife, {LADY AMAREI of House Crakehall}: —SER HOSTEEN, their eldest son, m. Bellena Hawick, —Hosteen’s son, SER ARWOOD, m. Ryella Royce, —Arwood’s daughter, RYELLA, a girl of five,  —Arwood’s twin sons, ANDROW and ALYN, three,    —LADY LYTHENE, m. Lord Lucias Vypren, —Lythene’s daughter, ELYANA, m. Ser Jon Wylde, —Elyana’s son, RICKARD WYLDE, four,  —Lythene’s son, SER DAMON VYPREN,  —SYMOND, m. Betharios of Braavos, —Symond’s son, ALESANDER, a singer,  —Symond’s daughter, ALYX, a maid of seventeen,  —Symond’s son, BRADAMAR, a boy of ten, fostered on Braavos as a ward of Oro Tendyris, a merchant of that city,  —SER DANWELL, m. Wynafrei Whent, —{many stillbirths and miscarriages},  —MERRETT, m. Mariya Darry, —Merrett’s daughter, AMEREI, called AMI, a widow of sixteen, m. {Ser Pate of the Blue Fork},  —Merrett’s daughter, WALDA, called FAT WALDA, a wife of fifteen years, m. Lord Roose Bolton,  —Merrett’s daughter, MARISSA, a maid of thirteen,  —Merrett’s son, WALDER, called LITTLE WALDER, a boy of seven, taken captive at Winterfell while a ward of Lady Catelyn Stark,  —SER GEREMY, drowned, m. Carolei Waynwood, —Geremy’s son, SANDOR, a boy of twelve, a squire to Ser Donnel Waynwood,  —Geremy’s daughter, CYNTHEA, a girl of nine, a ward of Lady Anya Waynwood,  —SER RAYMUND, m. Beony Beesbury, —Raymund’s son, ROBERT, sixteen, in training at the Citadel in Oldtown,  —Raymund’s son, MALWYN, fifteen, apprenticed to an alchemist in Lys,  —Raymund’s twin daughters, SERRA and SARRA, maiden girls of fourteen,  —Raymund’s daughter, CERSEI, six, called LITTLE BEE,      —by his fourth wife, {LADY ALYSSA, of House Blackwood}: —LOTHAR, their eldest son, called LAME LOTHAR, m. Leonella Lefford, —Lothar’s daughter, TYSANE, a girl of seven,  —Lothar’s daughter, WALDA, a girl of four,  —Lothar’s daughter, EMBERLEI, a girl of two,  —SER JAMMOS, m. Sallei Paege, —Jammos’s son, WALDER, called BIG WALDER, a boy of eight, taken captive at Winterfell. While a ward of Lady Catelyn Stark,  —Jammos’s twin sons, DICKON and MATHIS, five,  —SER WHALEN, m."
}