{
  "id": "5de2845a21e1587c80d6c305564a843569f573c5",
  "text": " Lysa whirled, her heavy robe swirling around her. Robert Arryn, Lord of the Eyrie, stood in the doorway, clutching a ragged cloth doll and looking at them with large eyes. He was a painfully thin child, small for his age and sickly all his days, and from time to time he trembled. The shaking sickness, the maesters called it.  I heard voices.   Small wonder, Catelyn thought; Lysa had almost been shouting. Still, her sister looked daggers at her.  This is your aunt Catelyn, baby. My sister, Lady Stark. Do you remember?   The boy glanced at her blankly.  I think so,  he said, blinking, though he had been less than a year old the last time Catelyn had seen him.  Lysa seated herself near the fire and said,  Come to Mother, my sweet one.  She straightened his bedclothes and fussed with his fine brown hair.  Isn’t he beautiful? And strong too, don’t you believe the things you hear. Jon knew. The seed is strong, he told me. His last words. He kept saying Robert’s name, and he grabbed my arm so hard he left marks. Tell them, the seed is strong. His seed. He wanted everyone to know what a good strong boy my baby was going to be.    Lysa,  Catelyn said,  if you’re right about the Lannisters, all the more reason we must act quickly. We—    Not in front of the baby,  Lysa said.  He has a delicate temper, don’t you, sweet one?    The boy is Lord of the Eyrie and Defender of the Vale,  Catelyn reminded her,  and these are no times for delicacy. Ned thinks it may come to war.    Quiet!  Lysa snapped at her.  You’re scaring the boy.  Little Robert took a quick peek over his shoulder at Catelyn and began to tremble. His doll fell to the rushes, and he pressed himself against his mother.  Don’t be afraid, my sweet baby,  Lysa whispered.  Mother’s here, nothing will hurt you.  She opened her robe and drew out a pale, heavy breast, tipped with red. The boy grabbed for it eagerly, buried his face against her chest, and began to suck. Lysa stroked his hair.  Catelyn was at a loss for words. Jon Arryn’s son, she thought incredulously. She remembered her own baby, three-year-old Rickon, half the age of this boy and five times as fierce. Small wonder the lords of the Vale were restive. For the first time she understood why the king had tried to take the child away from his mother to foster with the Lannisters…   We’re safe here,  Lysa was saying. Whether to her or to the boy, Catelyn was not sure.   Don’t be a fool,  Catelyn said, the anger rising in her.  No one is safe. If you think hiding here will make the Lannisters forget you, you are sadly mistaken.   Lysa covered her boy’s ear with her hand.  Even if they could bring an army through the mountains and past the Bloody Gate, the Eyrie is impregnable. You saw for yourself. No enemy could ever reach us up here.   Catelyn wanted to slap her. Uncle Brynden had tried to warn her, she realized.  No castle is impregnable.    This one is,  Lysa insisted.  Everyone says so. The only thing is, what am I to do with this Imp you have brought me?    Is he a bad man?  the Lord of the Eyrie asked, his mother’s breast popping from his mouth, the nipple wet and red.   A very bad man,  Lysa told him as she covered herself,  but Mother won’t let him harm my little baby.    Make him fly,  Robert said eagerly.  Lysa stroked her son’s hair.  Perhaps we will,  she murmured.  Perhaps that is just what we will do.       EDDARD  He found Littlefinger in the brothel’s common room, chatting amiably with a tall, elegant woman who wore a feathered gown over skin as black as ink. By the hearth, Heward and a buxom wench were playing at forfeits. From the look of it, he’d lost his belt, his cloak, his mail shirt, and his right boot so far, while the girl had been forced to unbutton her shift to the waist. Jory Cassel stood beside a rain-streaked window with a wry smile on his face, watching Heward turn over tiles and enjoying the view.  Ned paused at the foot of the stair and pulled on his gloves.  It’s time we took our leave. My business here is done.   Heward lurched to his feet, hurriedly gathering up his things.  As you will, my lord,  Jory said.  I’ll help Wyl bring round the horses.  He strode to the door.  Littlefinger took his time saying his farewells. He kissed the black woman’s hand, whispered some joke that made her laugh aloud, and sauntered over to Ned.  Your business,  he said lightly,  or Robert’s? They say the Hand dreams the king’s dreams, speaks with the king’s voice, and rules with the king’s sword. Does that also mean you fuck with the king’s—    Lord Baelish,  Ned interrupted,  you presume too much. I am not ungrateful for your help. It might have taken us years to find this brothel without you. That does not mean I intend to endure your mockery. And I am no longer the King’s Hand.    The direwolf must be a prickly beast,  said Littlefinger with a sharp twist of his mouth.  A warm rain was pelting down from a starless black sky as they walked to the stables. Ned drew up the hood of his cloak."
}