{
  "id": "5e23c12e73cfd1799d864ee5a50d2448baf16b16",
  "text": "\"  \"Great idea though, thanks, Mom.\"  \"It's not funny. And look after Ron.\"  \"Don't worry, ickle Ronniekins is safe with us.\"  \"Shut up,\" said Ron again. He was almost as tall as the twins already and his nose was still pink where his mother had rubbed it.  \"Hey, Mom, guess what? Guess who we just met on the train?\"  Harry leaned back quickly so they couldn't see him looking.  \"You know that black-haired boy who was near us in the station? Know who he is?\"  \"Who?\"  \"Harry Potter!\"  Harry heard the little girl's voice.  \"Oh, Mom, can I go on the train and see him, Mom, eh please....\"  \"You've already seen him, Ginny, and the poor boy isn't something you goggle at in a zoo. Is he really, Fred? How do you know?\"  \"Asked him. Saw his scar. It's really there - like lightning.\"  \"Poor dear - no wonder he was alone, I wondered. He was ever so polite when he asked how to get onto the platform.\"  \"Never mind that, do you think he remembers what You-Know-Who looks like?\"  Their mother suddenly became very stern.  \"I forbid you to ask him, Fred. No, don't you dare. As though he needs reminding of that on his first day at school.\"  \"All right, keep your hair on.\"  A whistle sounded.  \"Hurry up!\" their mother said, and the three boys clambered onto the train. They leaned out of the window for her to kiss them good-bye, and their younger sister began to cry.  \"Don't, Ginny, we'll send you loads of owls.\"  \"We'll send you a Hogwarts toilet seat.\"  \"George!\"  \"Only joking, Mom.\"  The train began to move. Harry saw the boys' mother waving and their sister, half laughing, half crying, running to keep up with the train until it gathered too much speed, then she fell back and waved.  Harry watched the girl and her mother disappear as the train rounded the corner. Houses flashed past the window. Harry felt a great leap of excitement. He didn't know what he was going to but it had to be better than what he was leaving behind.  The door of the compartment slid open and the youngest redheaded boy came in.  \"Anyone sitting there?\" he asked, pointing at the seat opposite Harry. \"Everywhere else is full.\"  Harry shook his head and the boy sat down. He glanced at Harry and then looked quickly out of the window, pretending he hadn't looked. Harry saw he still had a black mark on his nose.  \"Hey, Ron.\"  The twins were back.  \"Listen, we're going down the middle of the train -- Lee Jordan's got a giant tarantula down there.\"  \"Right,\" mumbled Ron.  \"Harry,\" said the other twin, \"did we introduce ourselves? Fred and George Weasley. And this is Ron, our brother. See you later, then.  \"Bye,\" said Harry and Ron. The twins slid the compartment door shut behind them.  \"Are you really Harry Potter?\" Ron blurted out.  Harry nodded.  \"Oh -well, I thought it might be one of Fred and George's jokes,\" said Ron. \"And have you really got -- you know...\"  He pointed at Harry's forehead.  Harry pulled back his bangs to show the lightning scar. Ron stared.  \"So that's where You-Know-Who  \"Yes,\" said Harry, \"but I can't remember it.\"  \"Nothing?\" said Ron eagerly.  \"Well -- I remember a lot of green light, but nothing else.\"  \"Wow,\" said Ron. He sat and stared at Harry for a few moments, then, as though he had suddenly realized what he was doing, he looked quickly out of the window again.  \"Are all your family wizards?\" asked Harry, who found Ron just as interesting as Ron found him.  \"Er -- Yes, I think so,\" said Ron. \"I think Mom's got a second cousin who's an accountant, but we never talk about him.\"  \"So you must know loads of magic already.\"  The Weasleys were clearly one of those old wizarding families the pale boy in Diagon Alley had talked about.  \"I heard you went to live with Muggles,\" said Ron. \"What are they like?\"  \"Horrible -well, not all of them. My aunt and uncle and cousin are, though. Wish I'd had three wizard brothers.\"  \"Five,\" said Ron. For some reason, he was looking gloomy. \"I'm the sixth in our family to go to Hogwarts. You could say I've got a lot to live up to. Bill and Charlie have already left -- Bill was head boy and Charlie was captain of Quidditch. Now Percy's a prefect. Fred and George mess around a lot, but they still get really good marks and everyone thinks they're really funny. Everyone expects me to do as well as the others, but if I do, it's no big deal, because they did it first. You never get anything new, either, with five brothers. I've got Bill's old robes, Charlie's old wand, and Percy's old rat.\"  Ron reached inside his jacket and pulled out a fat gray rat, which was asleep.  \"His name's Scabbers and he's useless, he hardly ever wakes up. Percy got an owl from my dad for being made a prefect, but they couldn't aff -- I mean, I got Scabbers instead.\"  Ron's ears went pink. He seemed to think he'd said too much, because he went back to staring out of the window.  Harry didn't think there was anything wrong with not being able to afford an owl. After all, he'd never had any money in his life until a month ago, and he told Ron so, all about having to wear Dudley's old clothes and never getting proper birthday presents."
}