{
  "id": "5e4c1489f26acac8efcbc27b3d7bd5e9912ad28a",
  "text": "  The inn beneath the sign of the broken anvil stood within sight of those walls, near the Gate of the Gods where they had entered that morning. As they rode into its courtyard, a boy ran out to help Tyrion down from his horse.  Take your men back to the castle,  he told Vylarr.  I’ll be spending the night here.   The captain looked dubious.  Will you be safe, my lord?    Well, as to that, Captain, when I left the inn this morning it was full of Black Ears. One is never quite safe when Chella daughter of Cheyk is about.  Tyrion waddled toward the door, leaving Vylarr to puzzle at his meaning.  A gust of merriment greeted him as he shoved into the inn’s common room. He recognized Chella’s throaty chuckle and the lighter music of Shae’s laughter. The girl was seated by the hearth, sipping wine at a round wooden table with three of the Black Ears he’d left to guard her and a plump man whose back was to him. The innkeeper, he assumed… until Shae called Tyrion by name and the intruder rose.  My good lord, I am so pleased to see you,  he gushed, a soft eunuch’s smile on his powdered face.  Tyrion stumbled.  Lord Varys. I had not thought to see you here.  The Others take him, how did he find them so quickly?   Forgive me if I intrude,  Varys said.  I was taken by a sudden urge to meet your young lady.    Young lady,  Shae repeated, savoring the words.  You’re half right, m’lord. I’m young.   Eighteen, Tyrion thought. Eighteen, and a whore, but quick of wit, nimble as a cat between the sheets, with large dark eyes and fine black hair and a sweet, soft, hungry little mouth… and mine! Damn you, eunuch.  I fear I’m the intruder, Lord Varys,  he said with forced courtesy.  When I came in, you were in the midst of some merriment.    M’lord Varys complimented Chella on her ears and said she must have killed many men to have such a fine necklace,  Shae explained. It grated on him to hear her call Varys m’lord in that tone; that was what she called him in their pillow play.  And Chella told him only cowards kill the vanquished.    Braver to leave the man alive, with a chance to cleanse his shame by winning back his ear,  explained Chella, a small dark woman whose grisly neckware was hung with no less than forty-six dried, wrinkled ears. Tyrion had counted them once.  Only so can you prove you do not fear your enemies.   Shae hooted.  And then m’lord says if he was a Black Ear he’d never sleep, for dreams of one-eared men.    A problem I will never need face,  Tyrion said.  I’m terrified of my enemies, so I kill them all.   Varys giggled.  Will you take some wine with us, my lord?    I’ll take some wine.  Tyrion seated himself beside Shae. He understood what was happening here, if Chella and the girl did not. Varys was delivering a message. When he said, I was taken by a sudden urge to meet your young lady, what he meant was, You tried to hide her, but I knew where she was, and who she was, and here I am. He wondered who had betrayed him. The innkeeper, that boy in the stable, a guard on the gate… or one of his own?   I always like to return to the city through the Gate of the Gods,  Varys told Shae as he filled the wine cups.  The carvings on the gatehouse are exquisite, they make me weep each time I see them. The eyes… so expressive, don’t you think? They almost seem to follow you as you ride beneath the portcullis.    I never noticed, m’lord,  Shae replied.  I’ll look again on the morrow, if it please you.   Don’t bother, sweetling, Tyrion thought, swirling the wine in the cup. He cares not a whit about carvings. The eyes he boasts of are his own. What he means is that he was watching, that he knew we were here the moment we passed through the gates.   Do be careful, child,  Varys urged.  King’s Landing is not wholly safe these days. I know these streets well, and yet I almost feared to come today, alone and unarmed as I was. Lawless men are everywhere in this dark time, oh, yes. Men with cold steel and colder hearts.  Where I can come alone and unarmed, others can come with swords in their fists, he was saying.  Shae only laughed.  If they try and bother me, they’ll be one ear short when Chella runs them off.   Varys hooted as if that was the funniest thing he had ever heard, but there was no laughter in his eyes when he turned them on Tyrion.  Your young lady has an amiable way to her. I should take very good care of her if I were you.    I intend to. Any man who tries to harm her—well, I’m too small to be a Black Ear, and I make no claims to courage.  See? I speak the same tongue you do, eunuch. Hurt her, and I’ll have your head.   I will leave you.  Varys rose.  I know how weary you must be. I only wished to welcome you, my lord, and tell you how very pleased I am by your arrival. We have dire need of you on the council. Have you seen the comet?    I’m short, not blind,  Tyrion said. Out on the kingsroad, it had seemed to cover half the sky, outshining the crescent moon.   In the streets, they call it the Red Messenger,  Varys said."
}