{
  "id": "5e8059c34a8d87802ca9b6d3228d8bce03e324f5",
  "text": "  \"I don't know,\" she said, frowning. \"Dumbledore couldn't cure  * 1,5 % *  Mrs. Norris, and that makes me think that whatever attacked her might not be - well - human.\"  As she spoke, they turned a corner and found themselves at the end of the very corridor where the attack had happened. They stopped and looked. The scene was just as it had been that night, except that there was no stiff cat hanging from the torch bracket, and an empty chair stood against the wall bearing the message \"The Chamber of Secrets has been Opened.\"  \"That's where Filch has been keeping guard,\" Ron muttered.  They looked at each other. The corridor was deserted.  \"Can't hurt to have a poke around,\" said Harry, dropping his bag and getting to his hands and knees so that he could crawl along, searching for clues.  \"Scorch marks!\" he said. \"Here - and here -\"  \"Come and look at this!\" said Hermione. \"This is funny . . . .\"  Harry got up and crossed to the window next to the message on the wall. Hermione was pointing at the topmost pane, where around twenty spiders were scuttling, apparently fighting to get through a small crack. A long, silvery thread was dangling like a rope, as though they had all climbed it in their hurry to get outside.  \"Have you ever seen spiders act like that?\" said Hermione wonderingly.  \"No,\" said Harry, \"have you, Ron? Ron?\"  He looked over his shoulder. Ron was standing well back and seemed to be fighting the impulse to run.  \"What's up?\" said Harry.  \"I - don't - like - spiders,\" said Ron tensely.  \"I never knew that,\" said Hermione, looking at Ron in surprise. \"You've used spiders in Potions loads of times ......  *154*  \"I don't mind them dead,\" said Ron, who was carefully looking anywhere but at the window. \"I just don't like the way they move ....  Hermione giggled.  \"It's not funny,\" said Ron, fiercely. \"If you must know, when I was three, Fred turned my - my teddy bear into a great big fiIthy spider because I broke his toy broomstick .... You wouldn't like them either if you'd been holding your bear and suddenly it had too many legs and. . . \"  He broke off, shuddering. Hermione was obviously still trying not to laugh. Feeling they had better get off the subject, Harry said, \"Remember all that water on the floor? Where did that come from? Someone's mopped it up.\"  \"It was about here,\" said Ron, recovering himself to walk a few paces past Filch's chair and pointing. \"Level with this door.\"  He reached for the brass doorknob but suddenly withdrew his hand as though he'd been burned.  \"What's the matter?\" said Harry.  \"Can't go in there,\" said Ron gruffly. \"That's a girls' toilet.\"  \"Oh, Ron, there won't be anyone in there,\" said Hermione, standing up and coming over. \"That's Moaning Myrtle's place. Come on, let's have a look.\"  And ignoring the large OUT of ORDER sign, she opened the door.  It was the gloomiest, most depressing bathroom Harry had ever set foot in. Under a large, cracked, and spotted mirror were a row of chipped sinks. The floor was damp and reflected the dull light given off by the stubs of a few candles, burning low in their holders; the wooden doors to the stalls were flaking and scratched and one of them was dangling off its hinges.  * -L 5,5  Hermione put her fingers to her lips and set off toward the end stall. When she reached it she said, \"Hello, Myrtle, how are you?\"  Harry and Ron went to look. Moaning Myrtle was floating above the tank of the toilet, picking a spot on her chin.  \"This is a girls' bathroom,\" she said, eyeing Ron and Harry suspiciously. \"They're not girls.\"  \"No,\" Hermione agreed. \"I just wanted to show them how er - nice it is in here.\"  She waved vaguely at the dirty old mirror and the damp floor.  \"Ask her if she saw anything,\" Harry mouthed at Hermione.  \"What are you whispering?\" said Myrtle, staring at him.  \"Nothing,\" said Harry quickly. \"We wanted to ask -\"  \"I wish people would stop talking behind my back!\" said Myrtle, in a voice choked with tears. \"I do have feelings, you know, even if I am dead -\"  \"Myrtle, no one wants to upset you,\" said Hermione. \"Harry only -\"  \"No one wants to upset me! That's a good one!\" howled Myrtle. \"My life was nothing but misery at this place and now people come along ruining my death!\"  \"We wanted to ask you if you've seen anything funny lately,\" said Hermione quickly. \"Because a cat was attacked right outside your front door on Halloween.\"  \"Did you see anyone near here that night?\" said Harry.  \"I wasn't paying attention,\" said Myrtle dramatically. \"Peeves upset me so much I came in here and tried to kill myself Then, of course, I remembered that I'm - that I'm \"  \"Already dead,\" said Ron helpfully.  * IL 56*  Myrtle gave a tragic sob, rose up in the air, turned over, and dived headfirst into the toilet, splashing water all over them and vanishing from sight, although from the direction of her muffled sobs, she had come to rest somewhere in the U-bend.  Harry and Ron stood with their mouths open, but Hermione shrugged wearily and said, \"Honestly, that was almost cheerful for Myrtle ."
}