{
  "id": "5f41fddee287cc230376accb438a14b2cdfd11c6",
  "text": " \"What did the Dark Lord take from you?\" said Moody. \"Blood,\" said Harry, raising his arm.  His sleeve was ripped where Wormtail's dagger had torn it. Moody let out his breath in a long, low hiss. \"And the Death Eaters?  They returned?\" \"Yes,\" said Harry.  \"Loads of them . . .\" \"How did he treat them?\"  Moody asked quietly.  \"Did he forgive them?\" But Harry had suddenly remembered.  He should have told Dumbledore, he should have said it straightaway - \"There's a Death Eater at Hogwarts!  There's a Death Eater here - they put my name in the Goblet of Fire, they made sure I got through to the end -\" Harry tried to get up, but Moody pushed him back down. \"I know who the Death Eater is,\" he said quietly. \"Karkaroff?\"  said Harry wildly.  \"Where is he?  Have you got him?  Is he locked up?\" \"Karkaroff?\" said Moody with an odd laugh.  \"Karkaroff fled tonight, when he felt the Dark Mark burn upon his arm.  He betrayed too many faithful supporters of the Dark Lord to wish to meet them . . . but I doubt he will get far.  The Dark Lord has ways of tracking his enemies.\" \"Karkaroff's gone?  He ran away?  But then - he didn't put my name in the goblet?\" \"No,\" said Moody slowly.  \"No, he didn't.  It was I who did that.\" Harry heard, but didn't believe. \"No, you didn't,\" he said.  \"You didn't do that. . . you can't have done...\" \"I assure you I did,\" said Moody, and his magical eye swung around and fixed upon the door, and Harry knew he was making sure that there was no one outside it.  At the same time, Moody drew out his wand and pointed it at Harry. \"He forgave them, then?\"  he said.  \"The Death Eaters who went free?  The ones who escaped Azkaban?\" \"What?\"  said Harry. He was looking at the wand Moody was pointing at him.  This was a bad joke, it had to be. \"I asked you,\" said Moody quietly, \"whether he forgave the scum who never even went to look for him.  Those treacherous cowards who wouldn't even brave Azkaban for him.  The faithless, worthless bits of filth who were brave enough to cavort in masks at the Quidditch World Cup, but fled at the sight of the Dark Mark when I fired it into the sky.\" \"You fired . . . What are you talking about. . . ?\" \"I told you. Harry ... I told you.  If there's one thing I hate more than any other, it's a Death Eater who walked free.  They turned their backs on my master when he needed them most.  I expected him to punish them.  I expected him to torture them.  Tell me he hurt them, Harry. . . .\"  Moody's face was suddenly lit with an insane smile.  \"Tell me he told them that I, I alone remained faithful... prepared to risk everything to deliver to him the one thing he wanted above all... you\" \"You didn't... it - it can't be you. ...\" \"Who put your name in the Goblet of Fire, under the name of a different school?  I did. Who frightened off every person I thought might try to hurt you or prevent you from winning the tournament?  I did.  Who nudged Hagrid into showing you the dragons?  I did.  Who helped you see the only way you could beat the dragon?  I did\" Moody's magical eye had now left the door.  It was fixed upon Harry.  His lopsided mouth leered more widely than ever. \"It hasn't been easy, Harry, guiding you through these tasks without arousing suspicion.  I have had to use every ounce of cunning I possess, so that my hand would not be detectable in your success.  Dumbledore would have been very suspicious if you had managed everything too easily.  As long as you got into that maze, preferably with a decent head start - then, I knew, I would have a chance of getting rid of the other champions and leaving your way clear.  But I also had to contend with your stupidity.  The second task . . . that was when I was most afraid we would fail.  I was keeping watch on you, Potter.  I knew you hadn't worked out the egg's clue, so I had to give you another hint -\" \"You didn't,\" Harry said hoarsely.  \"Cedric gave me the clue -\" \"Who told Cedric to open it underwater?  I did.  I trusted that he would pass the information on to you.  Decent people are so easy to manipulate, Potter.  I was sure Cedric would want to repay you for telling him about the dragons, and so he did.  But even then, Potter, even then you seemed likely to fail.  I was watching all the time ... all those hours in the library.  Didn't you realize that the book you needed was in your dormitory all along?  I planted it there early on, I gave it to the Longbottom boy, don't you remember?  Magical Water Plants of the Mediterranean.  It would have told you all you needed to know about gillyweed.  I expected you to ask everyone and anyone you could for help.  Longbottom would have told you in an instant.  But you did not. . . you did not. . . . You have a streak of pride and independence that might have ruined all. \"So what could I do?  Feed you information from another innocent source.  You told me at the Yule Ball a house-elf called Dobby had given you a Christmas present.  I called the elf to the staffroom to collect some robes for cleaning."
}