{
  "id": "5f8fd9277f43c819d7185c48770332776a90f194",
  "text": " It was cold  but its touch was clean, and  as he went on and it  mounted to his knees, he  felt that the stain of travel and all weariness was washed from his limbs.        When all  the Company had crossed, they sat and rested and ate a little  food; and Legolas  told them  tales of Lothlurien that the Elves of Mirkwood   still  kept  in their  hearts, of sunlight and starlight upon the meadows by   ####-the Great River before the world was grey.       At  length  a  silence fell, and they  heard the music of the waterfall  running sweetly  in the shadows. Almost Frodo fancied that he  could  hear a  voice singing, mingled with the sound of the water.       `Do you hear the voice of Nimrodel? ' asked Legolas. 'I will sing you a   song  of the maiden Nimrodel, who bore the same  name  as the stream  besi de  which she lived lung ago. It is a fair song in our woodland tongue; but this  is how it runs in the  Westron Speech, as some in Rivendell now sing it.' In  a soft voice hardly to be heard amid the rustle of the leaves above them  he  began:       An Elven-maid there was of old,       A shining star by day:       Her mantle white was hemmed with gold,       Her shoes of silver-grey.         A star was bound upon her brows,       A light was on her hair       As sun upon the golden boughs       In Lurien the fair.         Her hair was long, her limbs were white,       And fair she was and free;       And in the wind she went as light       As leaf of linden-tree.         Beside the falls of Nimrodel,       By water clear and cool,       Her voice as falling silver fell       Into the shining pool.         Where now she wanders none can tell,       In sunlight or in shade;       For lost of yore was Nimrodel       And in the mountains strayed.         The elven-ship in haven grey       Beneath the mountain -lee   ####-     Awaited her for many a day       Beside the roaring sea.         A wind by night in Northern lands       Arose, and loud it cried,       And drove the ship from elven-strands       Across the streaming tide.         When dawn came dim the land was lost,       The mountains sinking grey       Beyond the heaving waves that tossed       Their plumes of blinding spray.         Amroth beheld the fading shore       Now low beyond the swell,       And cursed the faithless ship that bore       Him far from Nimrodel.         Of old he was an Elven-king,       A lord of tree and glen,       When golden were the boughs in spring       In fair Lothlurien.         From helm to sea they saw him leap,       As arrow from the string,       And dive into the water deep,       As mew upon the wing.         The wind was in his flowing hair,       The foam about him shone;       Afar they saw him strong and fair       Go riding like a swan.         But from the West has come no word,       And on the Hither Shore       No tidings Elven-folk have heard       Of Amroth evermore.   ####-     The voice of Legolas faltered, and the  song ceased. 'I cannot sing any  more,' he said. 'That is  but a part, for I have forgotten much.  It is long  and  sad,  for  it  tells  how sorrow came  upon Lothlurien,  Lurien  of the  Blossom, when the Dwarves awakened  evil in the mountains.'       `But the Dwarves did not make the evil,' said Gimli.       `I said not  so; yet evil came,' answered Legolas sadly.  `Then many of  the Elves  of  Nimrodel's kindred left their dwellings and departed  and she  was  lost far in  the South, in  the passes of the White Mountains;  and she  came  not to  the ship where  Amroth her  lover waited for  her. But  in the  spring when the wind is in the new leaves the echo of her voice may still be   heard by the falls that bear her name. And when the wind is in the South the  voice  of Amroth comes up from the sea; for  Nimrodel flows into Silverlode,  that Elves call Celebrant, and Celebrant into Anduin  the Great. and  Anduin  flows into  the  Bay of Belfalas  whence the  Elves of Lurien set  sa il. But  neither Nimrodel nor Amroth ever came back.       'It is told  that she had a house built in the branches  of a tree that  grew  near the falls; for that  was the custom  of the  Elves of  Lurien, to  dwell in the trees, and maybe it is so still. Ther efore they were called the  Galadhrim, the Tree-people. Deep  in  their forest the trees are very great.  The people of the woods did not delve in the  ground like Dwarves, nor build  strong places of stone before the Shadow came.'       `And even in  these la tter days dwelling in the trees might  be thought  safer than sitting on the  ground,' said  Gimli. He looked across the stream  to the road that led back to Dimrill Dale, and then up into the roof of dark  boughs above.       `Your  words bring good counsel, Gimli,' said Aragorn. `We cannot build  a house, but  tonight we  will do as the Galadhrim  and seek  refuge  in the  tree-tops, if we can. We have sat here beside  the road  already longer than  was wise.'       The Company now turned aside from the path, and  went into the shadow of  the deeper woods,  westward along  the mountain-stream away from  Silverlode."
}