{
  "id": "5fd3c19a9bc6275218a9ca2c17d8754ab1ed06bd",
  "text": "  \"What a night,\" he mumbled, groping for the teapot as they all sat down around him. \"Nine raids. Nine! And old Mundungus Fletcher tried to put a hex on me when I had my back turned ......  Mr. Weasley took a long gulp of tea and sighed.  \"Find anything, Dad?\" said Fred eagerly.  \"All I got were a few shrinking door keys and a biting kettle,\" yawned Mr. Weasley. \"There was some pretty nasty stuff that wasn't my department, though. Mortlake was taken away for questioning about some extremely odd ferrets, but that's the Committee on Experimental Charms, thank goodness ......  \"Why would anyone bother making door keys shrink?\" said George.  \"Just Muggle-baiting,\" sighed Mr. Weasley. \"Sell them a key that keeps shrinking to nothing so they can never find it when they need it .... Of course, it's very hard to convict anyone because no Muggle would admit their key keeps shrinking - they'll insist they just keep losing it. Bless them, they'll go to any lengths to ignore magic, even if it's staring them in the face .... But the things our lot have taken to enchanting, you wouldn't believe -\"  \"LIKE CARS, FOR INSTANCE?\"  Mrs. Weasley had appeared, holding a long poker like a sword. Mr. Weasley's eyes jerked open. He stared guiltily at his wife.  \"C-cars, Molly, dear?\"  \"Yes, Arthur, cars,\" said Mrs. Weasley, her eyes flashing. \"Imagine a wizard buying a rusty old car and telling his wife all he wanted to do with it was take it apart to see how it worked, while really he was enchanting it to make it fly.\"  Mr. Weasley blinked.  \"Well, dear, I think you'll find that he would be quite within the law to do that, even if - er - he maybe would have done better to, um, tell his wife the truth .... There's a loophole in the law, you'll find .... As long as he wasn't intending to fly the car, the fact that the car could fly wouldn't -\"  \"Arthur Weasley, you made sure there was a loophole when you wrote that law!\" shouted Mrs. Weasley. \"Just so you could carry on tinkering with all that Muggle rubbish in your shed! And for your information, Harry arrived this morning in the car you weren't intending to fly!\"  \"Harry?\" said Mr. Weasley blankly. \"Harry who?\"  He looked around, saw Harry, and jumped.  \"Good lord, is it Harry Potter? Very pleased to meet you, Ron's told us so much about -\"  \"Your sons flew that car to Harry's house and back last night.\"  shouted Mrs. Weasley. \"What have you got to say about that, eh?\"  \"Did you really?\" said Mr. Weasley eagerly. \"Did it go all right? I - I mean,\" he faltered as sparks flew from Mrs. Weasley's eyes, \"that - that was very wrong, boys - very wrong indeed ......  \"Let's leave them to it,\" Ron muttered to Harry as Mrs. Weasley swelled like a bullfrog. \"Come on, I'll show you my bedroom.\"  They slipped out of the kitchen and down a narrow passageway to an uneven staircase, which wound its way, zigzagging up  through the house. On the third landing, a door stood ajar. Harry just caught sight of a pair of bright brown eyes staring at him before it closed with a snap.  \"Ginny,\" said Ron. \"You don't know how weird it is for her to be this shy. She never shuts up normally -\"  They climbed two more flights until they reached a door with peeling paint and a small plaque on it, saying RONALD'S ROOM.  Harry stepped in, his head almost touching the sloping ceiling, and blinked. It was like walking into a furnace: Nearly everything in Ron's room seemed to be a violent shade of orange: the bedspread, the walls, even the ceiling. Then Harry realized that Ron had covered nearly every inch of the shabby wallpaper with posters of the same seven witches and wizards, all wearing bright orange robes, carrying broomsticks, and waving energetically.  \"Your Quidditch team?\" said Harry.  \"The Chudley Cannons,\" said Ron, pointing at the orange bedspread, which was emblazoned with two giant black C's and a speeding cannonball. \"Ninth in the league.\"  Ron's school spellbooks were stacked untidily in a corner, next to a pile of comics that all seemed to feature The Adventures of Martin Miggs, the Mad Muggle. Ron's magic wand was lying on top of a fish tank full of frog spawn on the windowsill, next to his fat gray rat, Scabbers, who was snoozing in a patch of sun.  Harry stepped over a pack of Self-Shuffling playing cards on the floor and looked out of the tiny window. In the field far below he could see a gang of gnomes sneaking one by one back through the Weasleys' hedge. Then he turned to look at Ron, who was watching him almost nervously, as though waiting for his opinion.  \"It's a bit small,\" said Ron quickly. \"Not like that room you had with the Muggles. And I'm right underneath the ghoul in the attic; he's always banging on the pipes and groaning ...... But Harry, grinning widely, said, \"This is the best house I've ever been in.\" Ron's ears went pink. .  C H4 A P T E R  V O U R  AT F L 0 V RR 11 $ H AND BLOTTS  ife at the Burrow was as different as possible from life on Privet Drive. The Dursleys liked everything neat and ordered; the Weasleys' house burst with the strange and unexpected."
}