{
  "id": "609ac42c59e8285d1eb42c256869f5c344a124f2",
  "text": " Lord of Winterfell, Hand of the King, Warden of the North, the mighty Eddard Stark, of a line eight thousand years old… but Ilyn Payne’s blade went through his neck all the same, didn’t it? Do you remember the dance he did when his head came off his shoulders?   Sansa hugged herself, suddenly cold.  Why are you always so hateful? I was thanking you…    Just as if I was one of those true knights you love so well, yes. What do you think a knight is for, girl? You think it’s all taking favors from ladies and looking fine in gold plate? Knights are for killing.  He laid the edge of his longsword against her neck, just under her ear. Sansa could feel the sharpness of the steel.  I killed my first man at twelve. I’ve lost count of how many I’ve killed since then. High lords with old names, fat rich men dressed in velvet, knights puffed up like bladders with their honors, yes, and women and children too—they’re all meat, and I’m the butcher. Let them have their lands and their gods and their gold. Let them have their sers.  Sandor Clegane spat at her feet to show what he thought of that.  So long as I have this,  he said, lifting the sword from her throat,  there’s no man on earth I need fear.   Except your brother, Sansa thought, but she had better sense than to say it aloud. He is a dog, just as he says. A half-wild, mean-tempered dog that bites any hand that tries to pet him, and yet will savage any man who tries to hurt his masters.  Not even the men across the river?   Clegane’s eyes turned toward the distant fires.  All this burning.  He sheathed his sword.  Only cowards fight with fire.    Lord Stannis is no coward.    He’s not the man his brother was either. Robert never let a little thing like a river stop him.    What will you do when he crosses?    Fight. Kill. Die, maybe.    Aren’t you afraid? The gods might send you down to some terrible hell for all the evil you’ve done.    What evil?  He laughed.  What gods?    The gods who made us all.    All?  he mocked.  Tell me, little bird, what kind of god makes a monster like the Imp, or a halfwit like Lady Tanda’s daughter? If there are gods, they made sheep so wolves could eat mutton, and they made the weak for the strong to play with.    True knights protect the weak.   He snorted.  There are no true knights, no more than there are gods. If you can’t protect yourself, die and get out of the way of those who can. Sharp steel and strong arms rule this world, don’t ever believe any different.   Sansa backed away from him.  You’re awful.    I’m honest. It’s the world that’s awful. Now fly away, little bird, I’m sick of you peeping at me.   Wordless, she fled. She was afraid of Sandor Clegane… and yet, some part of her wished that Ser Dontos had a little of the Hound’s ferocity. There are gods, she told herself, and there are true knights too. All the stories can’t be lies.  That night Sansa dreamed of the riot again. The mob surged around her, shrieking, a maddened beast with a thousand faces. Everywhere she turned she saw faces twisted into monstrous inhuman masks. She wept and told them she had never done them hurt, yet they dragged her from her horse all the same.  No,  she cried,  no, please, don’t, don’t,  but no one paid her any heed. She shouted for Ser Dontos, for her brothers, for her dead father and her dead wolf, for gallant Ser Loras who had given her a red rose once, but none of them came. She called for the heroes from the songs, for Florian and Ser Ryam Redwyne and Prince Aemon the Dragonknight, but no one heard. Women swarmed over her like weasels, pinching her legs and kicking her in the belly, and someone hit her in the face and she felt her teeth shatter. Then she saw the bright glimmer of steel. The knife plunged into her belly and tore and tore and tore, until there was nothing left of her down there but shiny wet ribbons.  When she woke, the pale light of morning was slanting through her window, yet she felt as sick and achy as if she had not slept at all. There was something sticky on her thighs. When she threw back the blanket and saw the blood, all she could think was that her dream had somehow come true. She remembered the knives inside her, twisting and ripping. She squirmed away in horror, kicking at the sheets and falling to the floor, breathing raggedly, naked, bloodied, and afraid.  But as she crouched there, on her hands and knees, understanding came.  No, please,  Sansa whimpered,  please, no.  She didn’t want this happening to her, not now, not here, not now, not now, not now, not now.  Madness took hold of her. Pulling herself up by the bedpost, she went to the basin and washed between her legs, scrubbing away all the stickiness. By the time she was done, the water was pink with blood. When her maidservants saw it they would know. Then she remembered the bedclothes. She rushed back to the bed and stared in horror at the dark red stain and the tale it told. All she could think was that she had to get rid of it, or else they’d see."
}