{
  "id": "60d7ee3aff321744f9583cd4b1b27d24948fa361",
  "text": " It’s good that he can make a jape of it, Jon thought. Someone has to. Three days ago, one of those breakfast arrows had caught Red Alyn of the Rosewood in the leg. You could still see his body at the foot of the Wall, if you cared to lean out far enough. Jon had to think that it was better for them to smile at Pyp’s jest than to brood over Alyn’s corpse.  The mantlets were slanting wooden shields, wide enough for five of the free folk to hide behind. The archers pushed them close, then knelt behind them to loose their arrows through slits in the wood. The first time the wildlings rolled them out, Jon had called for fire arrows and set a half-dozen ablaze, but after that Mance started covering them with raw hides. All the fire arrows in the world couldn’t make them catch now. The brothers had even started wagering as to which of the straw sentinels would collect the most arrows before they were done. Dolorous Edd was leading with four, but Othell Yarwyck, Tumberjon, and Watt of Long Lake had three apiece. It was Pyp who’d started naming the scarecrows after their missing brothers, too.  It makes it seem as if there’s more of us,  he said.   More of us with arrows in our bellies,  Grenn complained, but the custom did seem to give his brothers heart, so Jon let the names stand and the wagering continue.  On the edge of the Wall an ornate brass Myrish eye stood on three spindly legs. Maester Aemon had once used it to peer at the stars, before his own eyes had failed him. Jon swung the tube down to have a look at the foe. Even at this distance there was no mistaking Mance Rayder’s huge white tent, sewn together from the pelts of snow bears. The Myrish lenses brought the wildlings close enough for him to make out faces. Of Mance himself he saw no sign this morning, but his woman Dalla was outside tending the fire, while her sister Val milked a she-goat beside the tent. Dalla looked so big it was a wonder she could move. The child must be coming very soon, Jon thought. He swiveled the eye east and searched amongst the tents and trees till he found the turtle. That will be coming very soon as well. The wildlings had skinned one of the dead mammoths during the night, and they were lashing the raw bloody hide over the turtle’s roof, one more layer on top of the sheepskins and pelts. The turtle had a rounded top and eight huge wheels, and under the hides was a stout wooden frame. When the wildlings had begun knocking it together, Satin thought they were building a ship. Not far wrong. The turtle was a hull turned upside down and opened fore and aft; a longhall on wheels.   It’s done, isn’t it?  asked Grenn.   Near enough.  Jon shoved away the eye.  It will come today, most like. Did you fill the barrels?    Every one. They froze hard during the night, Pyp checked.   Grenn had changed a great deal from the big, clumsy, red-necked boy Jon had first befriended. He had grown half a foot, his chest and shoulders had thickened, and he had not cut his hair nor trimmed his beard since the Fist of the First Men. It made him look as huge and shaggy as an aurochs, the mocking name that Ser Alliser Thorne had hung on him during training. He looked weary now, though. When Jon said as much, he nodded.  I heard their axes all night. Couldn’t sleep for all the chopping.    Then go sleep now.    I don’t need—    You do. I want you rested. Go on, I’m not going to let you sleep through the fight.  He made himself smile.  You’re the only one who can move those bloody barrels.   Grenn went off muttering, and Jon returned to the far eye, searching the wildling camp. From time to time an arrow would sail past overhead, but he had learned to ignore those. The range was long and the angle was bad, the chances of being hit were small. He still saw no sign of Mance Rayder in the camp, but he spied Tormund Giantsbane and two of his sons around the turtle. The sons were struggling with the mammoth hide while Tormund gnawed on the roast leg of a goat and bellowed orders. Elsewhere he found the wildling skinchanger, Varamyr Sixskins, walking through the trees with his shadowcat dogging his heels.  When he heard the rattle of the winch chains and the iron groan of the cage door opening, he knew it would be Hobb bringing their breakfast as he did every morning. The sight of Mance’s turtle had robbed Jon of his appetite. Their oil was all but gone, and the last barrel of pitch had been rolled off the Wall two nights ago. They would soon run short of arrows as well, and there were no fletchers making more. And the night before last, a raven had come from the west, from Ser Denys Mallister. Bowen Marsh had chased the wildlings all the way to the Shadow Tower, it seemed, and then farther, down into the gloom of the Gorge. At the Bridge of Skulls he had met the Weeper and three hundred wildlings and won a bloody battle. But the victory had been a costly one. More than a hundred brothers slain, among them Ser Endrew Tarth and Ser Aladale Wynch. The Old Pomegranate himself had been carried back to the Shadow Tower sorely wounded."
}