{
  "id": "611053cda005016e6c0e36a786127bb3b68ca090",
  "text": " It opened to the north, so the glows of the fires within would not be visible from the Wall. Even if by some mischance a patrol should happen to pass atop the Wall tonight, they would see nothing but hills and pines and the icy sheen of starlight on a half-frozen lake. Mance Rayder had planned his thrust well.  Within the rock, the passage descended twenty feet before it opened out onto a space as large as Winterfell’s Great Hall. Cookfires burned amongst the columns, their smoke rising to blacken the stony ceiling. The horses had been hobbled along one wall, beside a shallow pool. A sinkhole in the center of the floor opened on what might have been an even greater cavern below, though the darkness made it hard to tell. Jon could hear the soft rushing sound of an underground stream somewhere below as well.  Jarl was with the Magnar; Mance had given them the joint command. Styr was none too pleased by that, Jon had noted early on. Mance Rayder had called the dark youth a  pet  of Val, who was sister to Dalla, his own queen, which made Jarl a sort of good brother once removed to the King-beyond-the-Wall. The Magnar plainly resented sharing his authority. He had brought a hundred Thenns, five times as many men as Jarl, and often acted as if he had the sole command. But it would be the younger man who got them over the ice, Jon knew. Though he could not have been older than twenty, Jarl had been raiding for eight years, and had gone over the Wall a dozen times with the likes of Alfyn Crowkiller and the Weeper, and more recently with his own band.  The Magnar was direct.  Jarl has warned me of crows, patrolling on high. Tell me all you know of these patrols.   Tell me, Jon noted, not tell us, though Jarl stood right beside him. He would have liked nothing better than to refuse the brusque demand, but he knew Styr would put him to death at the slightest disloyalty, and Ygritte as well, for the crime of being his.  There are four men in each patrol, two rangers and two builders,  he said.  The builders are supposed to make note of cracks, melting, and other structural problems, while the rangers look for signs of foes. They ride mules.    Mules?  The earless man frowned.  Mules are slow.    Slow, but more surefooted on the ice. The patrols often ride atop the Wall, and aside from Castle Black, the paths up there have not been graveled for long years. The mules are bred at Eastwatch, and specially trained to their duty.    They often ride atop the Wall? Not always?    No. One patrol in four follows the base instead, to search for cracks in the foundation ice or signs of tunneling.   The Magnar nodded.  Even in far Thenn we know the tale of Arson Iceaxe and his tunnel.   Jon knew the tale as well. Arson Iceaxe had been halfway through the Wall when his tunnel was found by rangers from the Nightfort. They did not trouble to disturb him at his digging, only sealed the way behind with ice and stone and snow. Dolorous Edd used to say that if you pressed your ear flat to the Wall, you could still hear Arson chipping away with his axe.   When do these patrols go out? How often?   Jon shrugged.  It changes. I’ve heard that Lord Commander Qorgyle used to send them out every third day from Castle Black to Eastwatch-by-the-Sea, and every second day from Castle Black to the Shadow Tower. The Watch had more men in his day, though. Lord Commander Mormont prefers to vary the number of patrols and the days of their departure, to make it more difficult for anyone to know their comings and goings. And sometimes the Old Bear will even send a larger force to one of the abandoned castles for a fortnight or a moon’s turn.  His uncle had originated that tactic, Jon knew. Anything to make the enemy unsure.   Is Stonedoor manned at present?  asked Jarl.  Greyguard?   So we’re between those two, are we? Jon kept his face carefully blank.  Only Eastwatch, Castle Black, and the Shadow Tower were manned when I left the Wall. I can’t speak to what Bowen Marsh or Ser Denys might have done since.    How many crows remain within the castles?  asked Styr.   Five hundred at Castle Black. Two hundred at Shadow Tower, perhaps three hundred at Eastwatch.  Jon added three hundred men to the count. If only it were that easy…  Jarl was not fooled, however.  He’s lying,  he told Styr.  Or else including those they lost on the Fist.    Crow,  the Magnar warned,  do not take me for Mance Rayder. If you lie to me, I will have your tongue.    I’m no crow, and won’t be called a liar.  Jon flexed the fingers of his sword hand.  The Magnar of Thenn studied Jon with his chilly grey eyes.  We shall learn their numbers soon enough,  he said after a moment.  Go. I will send for you if I have further questions.   Jon bowed his head stiffly, and went. If all the wildlings were like Styr, it would be easier to betray them. The Thenns were not like other free folk, though. The Magnar claimed to be the last of the First Men, and ruled with an iron hand. His little land of Thenn was a high mountain valley hidden amongst the northernmost peaks of the Frostfangs, surrounded by cave dwellers, Hornfoot men, giants, and the cannibal clans of the ice rivers."
}