{
  "id": "61367ccbbe6f9c577ff7bb20e2f9808a01507282",
  "text": " Next second, the sink began to move; the sink, in fact, sank, right out of sight, leaving a large pipe exposed, a pipe wide enough for a man to slide into.  Harry heard Ron gasp and looked up again. He had made up his mind what he was going to do.  *300*  \"I'm going down there,\" he said. .  He couldn't not go, not now they had found the entrance to the Chamber, not if there was even the faintest, slimmest, wildest chance that Ginny might be alive.  \"Me too,\" said Ron.  There was a pause.  \"Well, you hardly seem to need me,\" said Lockhart, with a shadow of his old smile. \"I'll just -\"  He put his hand on the door knob, but Ron and Harry both pointed their wands at him.  \"You can go first,\" Ron snarled.  White-faced and wandless, Lockhart approached the opening.  \"Boys,\" he said, his voice feeble. \"Boys, what good will it do?\"  Harry jabbed him in the back with his wand. Lockhart slid his legs into the pipe.  \"I really don't think -\" he started to say, but Ron gave him a push, and he slid out of sight. Harry followed quickly. He lowered himself slowly into the pipe, then let go.  It was like rushing down an endless, slimy, dark slide. He could see more pipes branching off in all directions, but none as large as theirs, which twisted and turned, sloping steeply downward, and he knew that he was falling deeper below the school than even the dungeons. Behind him he could hear Ron, thudding slightly at the curves.  And then, just as he had begun to worry about what would happen when he hit the ground, the pipe leveled out, and he shot out of the end with a wet thud, landing on the damp floor of a dark stone tunnel large enough to stand in. Lockhart was getting to his  *301  feet a little ways away, covered in slime and white as a ghost. Harry stood aside as Ron came whizzing out of the pipe, too.  \"We must be miles under the school,\" said Harry, his voice echoing in the black tunnel.  \"Under the lake, probably,\" said Ron, squinting around at the dark, slimy walls.  All three of them turned to stare into the darkness ahead.  \"Lumos!\" Harry muttered to his wand and it lit again. \"C'mon,\" he said to Ron and Lockhart, and off they went, their footsteps slapping loudly on the wet floor.  The tunnel was so dark that they could only see a little distance ahead. Their shadows on the wet walls looked monstrous in the wandlight.  \"Remember,\" Harry said quietly as they walked cautiously forward, \"any sign of movement, close your eyes right away . .....  But the tunnel was quiet as the grave, and the first unexpected sound they heard was a loud crunch as Ron stepped on what turned out to be a rat's skull. Harry lowered his wand to look at the floor and saw that it was littered with small animal bones. Trying very hard not to imagine what Ginny might look like if they found her, Harry led the way forward, around a dark bend in the tunnel.  \"Harry - there's something up there -\" said Ron hoarsely, grabbing Harry's shoulder.  They froze, watching. Harry could just see the outline of something huge and curved, lying right across the tunnel. It wasn't moving.  \"Maybe it's asleep,\" he breathed, glancing back at the other two. Lockhart's hands were pressed over his eyes. Harry turned back to look at the thing, his heart beating so fast it hurt.  * 302 *  Very slowly, his eyes as narrow as he could make them and still see, Harry edged forward, his wand held high.  The light slid over a gigantic snake skin, of a vivid, poisonous green, lying curled and empty across the tunnel floor. The creature that had shed it must have been twenty feet long at least.  \"Blimey,\" said Ron weakly.  There was a sudden movement behind them. Gilderoy Lockhart's knees had given way.  \"Get up,\" said Ron sharply, pointing his wand at Lockhart.  Lockhart got to his feet - then he dived at Ron, knocking him to the ground.  Harry jumped forward, but too late - Lockhart was straightening up, panting, Ron's wand in his hand and a gleaming smile back on his face.  \"The adventure ends here, boys!\" he said. \"I shall take a bit of this skin back up to the school, tell them I was too late to save the girl, and that you two tragically lost your minds at the sight of her mangled body - say good-bye to your memories!\"  He raised Ron's Spellotaped wand high over his head and yelled, \"Obliviate!\"  The wand exploded with the force of a small bomb. Harry flung his arms over his head and ran, slipping over the coils of snake skin, out of the way of great chunks of tunnel ceiling that were thundering to the floor. Next moment, he was standing alone, gazing at a solid wall of broken rock.  \"Ron!\" he shouted. \"Are you okay? Ron!\"  \"I'm here!\" came Ron's muffled voice from behind the rockfall. \"I'm okay - this git's not, though - he got blasted by the wand ='  *303*  There was a dull thud and a loud \"ow!\" It sounded as though Ron had just kicked Lockhart in the shins.  \"What now?\" Ron's voice said, sounding desperate. \"We can't get through - it'll take ages ......  Harry looked up at the tunnel ceiling."
}