{
  "id": "61406f4fefe9e160591be0b7180e663bc2e7a893",
  "text": "  He kissed Ser Garlan on a bearded cheek as the cheers rose all around them.  Sansa felt curiously light-headed. I am free. She could feel eyes upon her. I must not smile, she reminded herself. The queen had warned her; no matter what she felt inside, the face she showed the world must look distraught.  I will not have my son humiliated,  Cersei said.  Do you hear me?    Yes. But if I’m not to be queen, what will become of me?    That will need to be determined. For the moment, you shall remain here at court, as our ward.    I want to go home.   The queen was irritated by that.  You should have learned by now, none of us get the things we want.   I have, though, Sansa thought. I am free of Joffrey. I will not have to kiss him, nor give him my maidenhood, nor bear him children. Let Margaery Tyrell have all that, poor girl.  By the time the outburst died down, the Lord of Highgarden had been seated at the council table, and his sons had joined the other knights and lordlings beneath the windows. Sansa tried to look forlorn and abandoned as other heroes of the Battle of the Blackwater were summoned forth to receive their rewards.  Paxter Redwyne, Lord of the Arbor, marched down the length of the hall flanked by his twin sons Horror and Slobber, the former limping from a wound taken in the battle. After them followed Lord Mathis Rowan in a snowy doublet with a great tree worked upon the breast in gold thread; Lord Randyll Tarly, lean and balding, a greatsword across his back in a jeweled scabbard; Ser Kevan Lannister, a thickset balding man with a close-trimmed beard; Ser Addam Marbrand, coppery hair streaming to his shoulders; the great western lords Lydden, Crakehall, and Brax.  Next came four of lesser birth who had distinguished themselves in the fighting: the one-eyed knight Ser Philip Foote, who had slain Lord Bryce Caron in single combat; the freerider Lothor Brune, who’d cut his way through half a hundred Fossoway men-at-arms to capture Ser Jon of the green apple and kill Ser Bryan and Ser Edwyd of the red, thereby winning himself the name Lothor Apple-Eater; Willit, a grizzled man-atarms in the service of Ser Harys Swyft, who’d pulled his master from beneath his dying horse and defended him against a dozen attackers; and a downy-cheeked squire named Josmyn Peckledon, who had killed two knights, wounded a third, and captured two more, though he could not have been more than fourteen. Willit was borne in on a litter, so grievous were his wounds.  Ser Kevan had taken a seat beside his brother Lord Tywin. When the heralds had finished telling of each hero’s deeds, he rose.  It is His Grace’s wish that these good men be rewarded for their valor. By his decree, Ser Philip shall henceforth be Lord Philip of House Foote, and to him shall go all the lands, rights, and incomes of House Caron. Lothor Brune to be raised to the estate of knighthood, and granted land and keep in the riverlands at war’s end. To Josmyn Peckledon, a sword and suit of plate, his choice of any warhorse in the royal stables, and knighthood as soon as he shall come of age. And lastly, for Goodman Willit, a spear with a silver-banded haft, a hauberk of new-forged ringmail, and a full helm with visor. Further, the goodman’s sons shall be taken into the service of House Lannister at Casterly Rock, the elder as a squire and the younger as a page, with the chance to advance to knighthood if they serve loyally and well. To all this, the King’s Hand and the small council consent.   The captains of the king’s warships Wildwind, Prince Aemon, and River Arrow were honored next, along with some under officers from Godsgrace, Lance, Lady of Silk, and Ramshead. As near as Sansa could tell, their chief accomplishment had been surviving the battle on the river, a feat that few enough could boast. Hallyne the Pyromancer and the masters of the Alchemists’ Guild received the king’s thanks as well, and Hallyne was raised to the style of lord, though Sansa noted that neither lands nor castle accompanied the title, which made the alchemist no more a true lord than Varys was. A more significant lordship by far was granted to Ser Lancel Lannister. Joffrey awarded him the lands, castle, and rights of House Darry, whose last child lord had perished during the fighting in the riverlands,  leaving no trueborn heirs of lawful Darry blood, but only a bastard cousin.   Ser Lancel did not appear to accept the title; the talk was, his wound might cost him his arm or even his life. The Imp was said to be dying as well, from a terrible cut to the head.  When the herald called,  Lord Petyr Baelish,  he came forth dressed all in shades of rose and plum, his cloak patterned with mockingbirds. She could see him smiling as he knelt before the Iron Throne. He looks so pleased. Sansa had not heard of Littlefinger doing anything especially heroic during the battle, but it seemed he was to be rewarded all the same.  Ser Kevan got back to his feet.  It is the wish of the King’s Grace that his loyal councillor Petyr Baelish be rewarded for faithful service to crown and realm."
}