{
  "id": "614592b3c3aa7e4c5bd7209857e730bd97b7538c",
  "text": " Has she called Lord Arryn’s banners, do you know? Will the knights of the Vale come join us?    Only one,  she said,  the best of them, my uncle… but Brynden Blackfish was a Tully first. My sister is not about to stir beyond her Bloody Gate.   Robb took it hard.  Mother, what are we going to do? I brought this whole army together, eighteen thousand men, but I don’t… I’m not certain…  He looked to her, his eyes shining, the proud young lord melted away in an instant, and quick as that he was a child again, a fifteen-year-old boy looking to his mother for answers.  It would not do.   What are you so afraid of, Robb?  she asked gently.   I…  He turned his head away, to hide the first tear.  If we march… even if we win… the Lannisters hold Sansa, and Father. They’ll kill them, won’t they?    They want us to think so.    You mean they’re lying?    I do not know, Robb. What I do know is that you have no choice. If you go to King’s Landing and swear fealty, you will never be allowed to leave. If you turn your tail and retreat to Winterfell, your lords will lose all respect for you. Some may even go over to the Lannisters. Then the queen, with that much less to fear, can do as she likes with her prisoners. Our best hope, our only true hope, is that you can defeat the foe in the field. If you should chance to take Lord Tywin or the Kingslayer captive, why then a trade might very well be possible, but that is not the heart of it. So long as you have power enough that they must fear you, Ned and your sister should be safe. Cersei is wise enough to know that she may need them to make her peace, should the fighting go against her.    What if the fighting doesn’t go against her?  Robb asked.  What if it goes against us?   Catelyn took his hand.  Robb, I will not soften the truth for you. If you lose, there is no hope for any of us. They say there is naught but stone at the heart of Casterly Rock. Remember the fate of Rhaegar’s children.   She saw the fear in his young eyes then, but there was a strength as well.  Then I will not lose,  he vowed.   Tell me what you know of the fighting in the riverlands,  she said. She had to learn if he was truly ready.   Less than a fortnight past, they fought a battle in the hills below the Golden Tooth,  Robb said.  Uncle Edmure had sent Lord Vance and Lord Piper to hold the pass, but the Kingslayer descended on them and put them to flight. Lord Vance was slain. The last word we had was that Lord Piper was falling back to join your brother and his other bannermen at Riverrun, with Jaime Lannister on his heels. That’s not the worst of it, though. All the time they were battling in the pass, Lord Tywin was bringing a second Lannister army around from the south. It’s said to be even larger than Jaime’s host.   Father must have known that, because he sent out some men to oppose them, under the king’s own banner. He gave the command to some southron lordling, Lord Erik or Derik or something like that, but Ser Raymun Darry rode with him, and the letter said there were other knights as well, and a force of Father’s own guardsmen. Only it was a trap. Lord Derik had no sooner crossed the Red Fork than the Lannisters fell upon him, the king’s banner be damned, and Gregor Clegane took them in the rear as they tried to pull back across the Mummer’s Ford. This Lord Derik and a few others may have escaped, no one is certain, but Ser Raymun was killed, and most of our men from Winterfell. Lord Tywin has closed off the kingsroad, it’s said, and now he’s marching north toward Harrenhal, burning as he goes.   Grim and grimmer, thought Catelyn. It was worse than she’d imagined.  You mean to meet him here?  she asked.   If he comes so far, but no one thinks he will,  Robb said.  I’ve sent word to Howland Reed, Father’s old friend at Greywater Watch. If the Lannisters come up the Neck, the crannogmen will bleed them every step of the way, but Galbart Glover says Lord Tywin is too smart for that, and Roose Bolton agrees. He’ll stay close to the Trident, they believe, taking the castles of the river lords one by one, until Riverrun stands alone. We need to march south to meet him.   The very idea of it chilled Catelyn to the bone. What chance would a fifteen-year-old boy have against seasoned battle commanders like Jaime and Tywin Lannister?  Is that wise? You are strongly placed here. It’s said that the old Kings in the North could stand at Moat Cailin and throw back hosts ten times the size of their own.    Yes, but our food and supplies are running low, and this is not land we can live off easily. We’ve been waiting for Lord Manderly, but now that his sons have joined us, we need to march.   She was hearing the lords bannermen speaking with her son’s voice, she realized. Over the years, she had hosted many of them at Winterfell, and been welcomed with Ned to their own hearths and tables. She knew what sorts of men they were, each one. She wondered if Robb did.  And yet there was sense in what they said. This host her son had assembled was not a standing army such as the Free Cities were accustomed to maintain, nor a force of guardsmen paid in coin."
}