{
  "id": "614d3755f72f6a0adb862c01c82adfa6c41ef0b2",
  "text": " From bits and pieces of overheard conversations Sansa knew that Jon Arryn’s bannermen resented Lysa’s marriage and begrudged Petyr his authority as Lord Protector of the Vale. The senior branch of House Royce was close to open revolt over her aunt’s failure to aid Robb in his war, and the Waynwoods, Redforts, Belmores, and Templetons were giving them every support. The mountain clans were being troublesome as well, and old Lord Hunter had died so suddenly that his two younger sons were accusing their elder brother of having murdered him. The Vale of Arryn might have been spared the worst of the war, but it was hardly the idyllic place that Lady Lysa had made it out to be.  I am not going back to sleep, Sansa realized. My head is all a tumult. She pushed her pillow away reluctantly, threw back the blankets, went to her window, and opened the shutters.  Snow was falling on the Eyrie.  Outside the flakes drifted down as soft and silent as memory. Was this what woke me? Already the snowfall lay thick upon the garden below, blanketing the grass, dusting the shrubs and statues with white and weighing down the branches of the trees. The sight took Sansa back to cold nights long ago, in the long summer of her childhood.  She had last seen snow the day she’d left Winterfell. That was a lighter fall than this, she remembered. Robb had melting flakes in his hair when he hugged me, and the snowball Arya tried to make kept coming apart in her hands. It hurt to remember how happy she had been that morning. Hullen had helped her mount, and she’d ridden out with the snowflakes swirling around her, off to see the great wide world. I thought my song was beginning that day, but it was almost done.  Sansa left the shutters open as she dressed. It would be cold, she knew, though the Eyrie’s towers encircled the garden and protected it from the worst of the mountain winds. She donned silken smallclothes and a linen shift, and over that a warm dress of blue lambswool. Two pairs of hose for her legs, boots that laced up to her knees, heavy leather gloves, and finally a hooded cloak of soft white fox fur.  Her maid rolled herself more tightly in her blanket as the snow began to drift in the window. Sansa eased open the door, and made her way down the winding stair. When she opened the door to the garden, it was so lovely that she held her breath, unwilling to disturb such perfect beauty. The snow drifted down and down, all in ghostly silence, and lay thick and unbroken on the ground. All color had fled the world outside. It was a place of whites and blacks and greys. White towers and white snow and white statues, black shadows and black trees, the dark grey sky above. A pure world, Sansa thought. I do not belong here.  Yet she stepped out all the same. Her boots tore ankle-deep holes into the smooth white surface of the snow, yet made no sound. Sansa drifted past frosted shrubs and thin dark trees, and wondered if she were still dreaming. Drifting snowflakes brushed her face as light as lover’s kisses, and melted on her cheeks. At the center of the garden, beside the statue of the weeping woman that lay broken and half-buried on the ground, she turned her face up to the sky and closed her eyes. She could feel the snow on her lashes, taste it on her lips. It was the taste of Winterfell. The taste of innocence. The taste of dreams.  When Sansa opened her eyes again, she was on her knees. She did not remember falling. It seemed to her that the sky was a lighter shade of grey. Dawn, she thought. Another day. Another new day. It was the old days she hungered for. Prayed for. But who could she pray to? The garden had been meant for a godswood once, she knew, but the soil was too thin and stony for a weirwood to take root. A godswood without gods, as empty as me.  She scooped up a handful of snow and squeezed it between her fingers. Heavy and wet, the snow packed easily. Sansa began to make snowballs, shaping and smoothing them until they were round and white and perfect. She remembered a summer’s snow in Winterfell when Arya and Bran had ambushed her as she emerged from the keep one morning. They’d each had a dozen snowballs to hand, and she’d had none. Bran had been perched on the roof of the covered bridge, out of reach, but Sansa had chased Arya through the stables and around the kitchen until both of them were breathless. She might even have caught her, but she’d slipped on some ice. Her sister came back to see if she was hurt. When she said she wasn’t, Arya hit her in the face with another snowball, but Sansa grabbed her leg and pulled her down and was rubbing snow in her hair when Jory came along and pulled them apart, laughing.  What do I want with snowballs? She looked at her sad little arsenal. There’s no one to throw them at. She let the one she was making drop from her hand. I could build a snow knight instead, she thought. Or even…  She pushed two of her snowballs together, added a third, packed more snow in around them, and patted the whole thing into the shape of a cylinder."
}