{
  "id": "620e256b70bb8b66a89681a24c92ad9dc9a0e128",
  "text": "  Where will I find my lord father?    He has taken the inn at the crossroads for his quarters.   Tyrion laughed. The inn at the crossroads! Perhaps the gods were just after all.  I will see him at once.    As you say, my lord.  Ser Flement wheeled his horse about and shouted commands. Three rows of stakes were pulled from the ground to make a hole in the line. Tyrion led his party through.  Lord Tywin’s camp spread over leagues. Chella’s estimate of twenty thousand men could not be far wrong. The common men camped out in the open, but the knights had thrown up tents, and some of the high lords had erected pavilions as large as houses. Tyrion spied the red ox of the Presters, Lord Crakehall’s brindled boar, the burning tree of Marbrand, the badger of Lydden. Knights called out to him as he cantered past, and men-at-arms gaped at the clansmen in open astonishment.  Shagga was gaping back; beyond a certainty, he had never seen so many men, horses, and weapons in all his days. The rest of the mountain brigands did a better job of guarding their faces, but Tyrion had no doubts that they were full as much in awe. Better and better. The more impressed they were with the power of the Lannisters, the easier they would be to command.  The inn and its stables were much as he remembered, though little more than tumbled stones and blackened foundations remained where the rest of the village had stood. A gibbet had been erected in the yard, and the body that swung there was covered with ravens. At Tyrion’s approach they took to the air, squawking and flapping their black wings. He dismounted and glanced up at what remained of the corpse. The birds had eaten her lips and eyes and most of her cheeks, baring her stained red teeth in a hideous smile.  A room, a meal, and a flagon of wine, that was all I asked,  he reminded her with a sigh of reproach.  Boys emerged hesitantly from the stables to see to their horses. Shagga did not want to give his up.  The lad won’t steal your mare,  Tyrion assured him.  He only wants to give her some oats and water and brush out her coat.  Shagga’s coat could have used a good brushing too, but it would have been less than tactful to mention it.  You have my word, the horse will not be harmed.   Glaring, Shagga let go his grip on the reins.  This is the horse of Shagga son of Dolf,  he roared at the stableboy.   If he doesn’t give her back, chop off his manhood and feed it to the goats,  Tyrion promised.  Provided you can find some.   A pair of house guards in crimson cloaks and lion-crested helms stood under the inn’s sign, on either side of the door. Tyrion recognized their captain.  My father?    In the common room, m’lord.    My men will want meat and mead,  Tyrion told him.  See that they get it.  He entered the inn, and there was Father.  Tywin Lannister, Lord of Casterly Rock and Warden of the West, was in his middle fifties, yet hard as a man of twenty. Even seated, he was tall, with long legs, broad shoulders, a flat stomach. His thin arms were corded with muscle. When his once-thick golden hair had begun to recede, he had commanded his barber to shave his head; Lord Tywin did not believe in half measures. He razored his lip and chin as well, but kept his side-whiskers, two great thickets of wiry golden hair that covered most of his cheeks from ear to jaw. His eyes were a pale green, flecked with gold. A fool more foolish than most had once jested that even Lord Tywin’s shit was flecked with gold. Some said the man was still alive, deep in the bowels of Casterly Rock.  Ser Kevan Lannister, his father’s only surviving brother, was sharing a flagon of ale with Lord Tywin when Tyrion entered the common room. His uncle was portly and balding, with a close-cropped yellow beard that followed the line of his massive jaw. Ser Kevan saw him first.  Tyrion,  he said in surprise.   Uncle,  Tyrion said, bowing.  And my lord father. What a pleasure to find you here.   Lord Tywin did not stir from his chair, but he did give his dwarf son a long, searching look.  I see that the rumors of your demise were unfounded.    Sorry to disappoint you, Father,  Tyrion said.  No need to leap up and embrace me, I wouldn’t want you to strain yourself.  He crossed the room to their table, acutely conscious of the way his stunted legs made him waddle with every step. Whenever his father’s eyes were on him, he became uncomfortably aware of all his deformities and shortcomings.  Kind of you to go to war for me,  he said as he climbed into a chair and helped himself to a cup of his father’s ale.   By my lights, it was you who started this,  Lord Tywin replied.  Your brother Jaime would never have meekly submitted to capture at the hands of a woman.    That’s one way we differ, Jaime and I. He’s taller as well, you may have noticed.   His father ignored the sally.  The honor of our House was at stake. I had no choice but to ride. No man sheds Lannister blood with impunity.    Hear Me Roar,  Tyrion said, grinning. The Lannister words."
}