{
  "id": "632b9e6a12ce68639c603bdbb8c354c8cc1bfbbc",
  "text": "  \"What a pile of old rubbish.\" She looked over at the Slytherins, who were all watching her and Harry closely across the room to see if they had been upset by the article.  Hermione gave them a sarcastic smile and a wave, and she, Harry, and Ron started unpacking the ingredients they would need for their Wit-Sharpening Potion. \"There's something funny, though,\" said Hermione ten minutes later, holding her pestle suspended over a bowl of scarab beetles.  \"How could Rita Skeeter have known . . . ?\" \"Known what?\" said Ron quickly. \"You haven't been mixing up Love Potions, have you?\" \"Don't be stupid,\" Hermione snapped, starting to pound up her beetles again. \"No, it's just. . . how did she know Viktor asked me to visit him over the summer?\" Hermione blushed scarlet as she said this and determinedly avoided Ron's eyes. \"What?\" said Ron, dropping his pestle with a loud clunk. \"He asked me right after he'd pulled me out of the lake,\" Hermione muttered.  \"After he'd got rid of his shark's head.  Madam Pomfrey gave us both blankets and then he sort of pulled me away from the judges so they wouldn't hear, and he said, if I wasn't doing anything over the summer, would I like to -\" \"And what did you say?\"  said Ron, who had picked up his pestle and was grinding it on the desk, a good six inches from his bowl, because he was looking at Hermione. \"And he did say he'd never felt the same way about anyone else,\" Hermione went on, going so red now that Harry could almost feel the heat coming from her, \"but how could Rita Skeeter have heard him?  She wasn't there ... or was she?  Maybe she has got an Invisibility Cloak; maybe she sneaked onto the grounds to watch the second task. ...\" \"And what did you say?\" Ron repeated, pounding his pestle down so hard that it dented the desk. \"Well, I was too busy seeing whether you and Harry were okay to-\" \"Fascinating though your social life undoubtedly is. Miss Granger,\" said an icy voice right behind them, and all three of them jumped, \"I must ask you not to discuss it in my class. Ten points from Gryffindor.\" Snape had glided over to their desk while they were talking. The whole class was now looking around at them; Malfoy took the opportunity to flash POTTER STINKS across the dungeon at Harry. \"Ah . . . reading magazines under the table as well?\" Snape added, snatching up the copy of Witch Weekly.  \"A further ten points from Gryffindor ... oh but of course ...\" Snapes black eyes glittered as they fell on Rita Skeeter's article.  \"Potter has to keep up with his press cuttings. . . .\" The dungeon rang with the Slytherins' laughter, and an unpleasant smile curled Snape's thin mouth.  To Harry's fury, he began to read the article aloud. \"'Harry Potter's Secret Heartache. . . dear, dear.  Potter, what's ailing you now?  'A boy like no other, perhaps. . .'\" Harry could feel his face burning.  Snape was pausing at the end of every sentence to allow the Slytherins a hearty laugh.  The article sounded ten times worse when read by Snape. Even Hermione was blushing scarlet now. \"'. . . Harry Potter's well-wishers must hope that, next time, he bestows his heart upon a worthier candidate.'  How very touching,\" sneered Snape, rolling up the magazine to continued gales of laughter from the Slytherins.  \"Well, I think I had better separate the three of you, so you can keep your minds on your potions rather than on your tangled love lives. Weasley, you stay here. Miss Granger, over there, beside Miss Parkinson. Potter - that table in front of my desk. Move. Now.\" Furious, Harry threw his ingredients and his bag into his cauldron and dragged it up to the front of the dungeon to the empty table.  Snape followed, sat down at his desk and watched Harry unload his cauldron.  Determined not to look at Snape, Harry resumed the mashing of his scarab beetles, imagining each one to have Snape's face. \"All this press attention seems to have inflated your already over-large head. Potter,\" said Snape quietly, once the rest of the class had settled down again. Harry didn't answer. He knew Snape was trying to provoke him; he had done this before.  No doubt he was hoping for an excuse to take a round fifty points from Gryffindor before the end of the class. \"You might be laboring under the delusion that the entire wizarding world is impressed with you,\" Snape went on, so quietly that no one else could hear him (Harry continued to pound his scarab beetles, even though he had already reduced them to a very fine powder), \"but I don't care how many times your picture appears in the papers.  To me. Potter, you are nothing but a nasty little boy who considers rules to be beneath him.\" Harry tipped the powdered beetles into his cauldron and started cutting up his ginger roots.  His hands were shaking slightly out of anger, but he kept his eyes down, as though he couldn't hear what Snape was saying to him. \"So I give you fair warning, Potter,\" Snape continued in a sorter and more dangerous voice, \"pint-sized celebrity or not - if I catch you breaking into my office one more time -\" \"I haven't been anywhere near your office!\"  said Harry angrily, forgetting his feigned deafness."
}