{
  "id": "63c36d2c95da6722e9e9b3f276f0cad9b14b0437",
  "text": "  Put it away. Please.    Flaying Theon will not bring my brothers back,  Robb said.  I want his head, not his skin.    He is Balon Greyjoy’s only living son,  Lord Bolton said softly, as if they had forgotten,  and now rightful King of the Iron Islands. A captive king has great value as a hostage.    Hostage?  The word raised Catelyn’s hackles. Hostages were oft exchanged.  Lord Bolton, I hope you are not suggesting that we free the man who killed my sons.    Whoever wins the Seastone Chair will want Theon Greyjoy dead,  Bolton pointed out.  Even in chains, he has a better claim than any of his uncles. Hold him, I say, and demand concessions from the ironborn as the price of his execution.   Robb considered that reluctantly, but in the end he nodded.  Yes. Very well. Keep him alive, then. For the present. Hold him secure at the Dreadfort till we’ve retaken the north.   Catelyn turned back to Roose Bolton.  Ser Wendel said something of Lannisters on the Trident?    He did, my lady. I blame myself. I delayed too long before leaving Harrenhal. Aenys Frey departed several days before me and crossed the Trident at the ruby ford, though not without difficulty. But by the time we came up the river was a torrent. I had no choice but to ferry my men across in small boats, of which we had too few. Two-thirds of my strength was on the north side when the Lannisters attacked those still waiting to cross. Norrey, Locke, and Burley men chiefly, with Ser Wylis Manderly and his White Harbor knights as rear guard. I was on the wrong side of the Trident, powerless to help them. Ser Wylis rallied our men as best he could, but Gregor Clegane attacked with heavy horse and drove them into the river. As many drowned as were cut down. More fled, and the rest were taken captive.   Gregor Clegane was always ill news, Catelyn reflected. Would Robb need to march south again to deal with him? Or was the Mountain coming here?  Is Clegane across the river, then?    No.  Bolton’s voice was soft, but certain.  I left six hundred men at the ford. Spearmen from the rills, the mountains, and the White Knife, a hundred Hornwood longbows, some freeriders and hedge knights, and a strong force of Stout and Cerwyn men to stiffen them. Ronnel Stout and Ser Kyle Condon have the command. Ser Kyle was the late Lord Cerwyn’s right hand, as I’m sure you know, my lady. Lions swim no better than wolves. So long as the river runs high, Ser Gregor will not cross.    The last thing we need is the Mountain at our backs when we start up the causeway,  said Robb.  You did well, my lord.    Your Grace is too kind. I suffered grievous losses on the Green Fork, and Glover and Tallhart worse at Duskendale.    Duskendale.  Robb made the word a curse.  Robett Glover will answer for that when I see him, I promise you.    A folly,  Lord Bolton agreed,  but Glover was heedless after he learned that Deepwood Motte had fallen. Grief and fear will do that to a man.   Duskendale was done and cold; it was the battles still to come that worried Catelyn.  How many men have you brought my son?  she asked Roose Bolton pointedly.  His queer colorless eyes studied her face a moment before he answered.  Some five hundred horse and three thousand foot, my lady. Dreadfort men, in chief, and some from Karhold. With the loyalty of the Karstarks so doubtful now, I thought it best to keep them close. I regret there are not more.    It should be enough,  said Robb.  You will have command of my rear guard, Lord Bolton. I mean to start for the Neck as soon as my uncle has been wedded and bedded. We’re going home.       Arya   The outriders came on them an hour from the Green Fork, as the wayn was slogging down a muddy road.   Keep your head down and your mouth shut,  the Hound warned her as the three spurred toward them; a knight and two squires, lightly armored and mounted on fast palfreys. Clegane cracked his whip at the team, a pair of old drays that had known better days. The wayn was creaking and swaying, its two huge wooden wheels squeezing mud up out of the deep ruts in the road with every turn. Stranger followed, tied to the wagon.  The big bad-tempered courser wore neither armor, barding, nor harness, and the Hound himself was garbed in splotchy green roughspun and a soot-grey mantle with a hood that swallowed his head. So long as he kept his eyes down you could not see his face, only the whites of his eyes peering out. He looked like some down-at-heels farmer. A big farmer, though. And under the roughspun was boiled leather and oiled mail, Arya knew. She looked like a farmer’s son, or maybe a swineherd. And behind them were four squat casks of salt pork and one of pickled pigs’ feet.  The riders split and circled them for a look before they came up close. Clegane drew the wayn to a halt and waited patiently on their pleasure. The knight bore spear and sword while his squires carried longbows. The badges on their jerkins were smaller versions of the sigil sewn on their master’s surcoat; a black pitchfork on a golden bar sinister, upon a russet field."
}