{
  "id": "63df1ca28d42a6f2c3d830c7a5f546fc18b78c67",
  "text": "  \"Oh, no,\" said Ron, pale as the Bloody Baron.  \"It's the girls' bathroom!\" Harry gasped.  \"Hermione!\" they said together.  It was the last thing they wanted to do, but what choice did they have? Wheeling around, they sprinted back to the door and turned the key, fumbling in their panic. Harry pulled the door open and they ran inside.  Hermione Granger was shrinking against the wall opposite, looking as if she was about to faint. The troll was advancing on her, knocking the sinks off the walls as it went.  \"Confuse it!\" Harry said desperately to Ron, and, seizing a tap, he threw it as hard as he could against the wall.  The troll stopped a few feet from Hermione. It lumbered around, blinking stupidly, to see what had made the noise. Its mean little eyes saw Harry. It hesitated, then made for him instead, lifting its club as it went.  \"Oy, pea-brain!\" yelled Ron from the other side of the chamber, and he threw a metal pipe at it. The troll didn't even seem to notice the pipe hitting its shoulder, but it heard the yell and paused again, turning its ugly snout toward Ron instead, giving Harry time to run around it.  \"Come on, run, run!\" Harry yelled at Hermione, trying to pull her toward the door, but she couldn't move, she was still flat against the wall, her mouth open with terror.  The shouting and the echoes seemed to be driving the troll berserk. It roared again and started toward Ron, who was nearest and had no way to escape.  Harry then did something that was both very brave and very stupid: He took a great running jump and managed to fasten his arms around the troll's neck from behind. The troll couldn't feel Harry hanging there, but even a troll will notice if you stick a long bit of wood up its nose, and Harry's wand had still been in his hand when he'd jumped -- it had gone straight up one of the troll's nostrils.  Howling with pain, the troll twisted and flailed its club, with Harry clinging on for dear life; any second, the troll was going to rip him off or catch him a terrible blow with the club.  Hermione had sunk to the floor in fright; Ron pulled out his own wand -- not knowing what he was going to do he heard himself cry the first spell that came into his head: \"Wingardium Leviosa!\"  The club flew suddenly out of the troll's hand, rose high, high up into the air, turned slowly over -- and dropped, with a sickening crack, onto its owner's head. The troll swayed on the spot and then fell flat on its face, with a thud that made the whole room tremble.  Harry got to his feet. He was shaking and out of breath. Ron was standing there with his wand still raised, staring at what he had done.  It was Hermione who spoke first.  \"Is it -- dead?\"  I don't think so,\" said Harry, I think it's just been knocked out.\"  He bent down and pulled his wand out of the troll's nose. It was covered in what looked like lumpy gray glue.  \"Urgh -- troll boogers.\"  He wiped it on the troll's trousers.  A sudden slamming and loud footsteps made the three of them look up. They hadn't realized what a racket they had been making, but of course, someone downstairs must have heard the crashes and the troll's roars. A moment later, Professor McGonagall had come bursting into the room, closely followed by Snape, with Quirrell bringing up the rear. Quirrell took one look at the troll, let out a faint whimper, and sat quickly down on a toilet, clutching his heart.  Snape bent over the troll. Professor McGonagall was looking at Ron and Harry. Harry had never seen her look so angry. Her lips were white. Hopes of winning fifty points for Gryffindor faded quickly from Harry's mind.  \"What on earth were you thinking of?\" said Professor McGonagall, with cold fury in her voice. Harry looked at Ron, who was still standing with his wand in the air. \"You're lucky you weren't killed. Why aren't you in your dormitory?\"  Snape gave Harry a swift, piercing look. Harry looked at the floor. He wished Ron would put his wand down.  Then a small voice came out of the shadows.  \"Please, Professor McGonagall -- they were looking for me.\"  \"Miss Granger!\"  Hermione had managed to get to her feet at last.  I went looking for the troll because I -- I thought I could deal with it on my own -- you know, because I've read all about them.\"  Ron dropped his wand. Hermione Granger, telling a downright lie to a teacher? \"If they hadn't found me, I'd be dead now. Harry stuck his wand up its nose and Ron knocked it out with its own club. They didn't have time to come and fetch anyone. It was about to finish me off when they arrived.\"  Harry and Ron tried to look as though this story wasn't new to them.  \"Well -- in that case...\" said Professor McGonagall, staring at the three of them, \"Miss Granger, you foolish girl, how could you think of tackling a mountain troll on your own?\"  Hermione hung her head. Harry was speechless. Hermione was the last person to do anything against the rules, and here she was, pretending she had, to get them out of trouble. It was as if Snape had started handing out sweets."
}