{
  "id": "63e54d125d40c32dd1125498d41aa7a44d738069",
  "text": " The singers had given them the names of gods: Balerion, Meraxes, Vhaghar. Tyrion had stood between their gaping jaws, wordless and awed. You could have ridden a horse down Vhaghar’s gullet, although you would not have ridden it out again. Meraxes was even bigger. And the greatest of them, Balerion, the Black Dread, could have swallowed an aurochs whole, or even one of the hairy mammoths said to roam the cold wastes beyond the Port of Ibben.  Tyrion stood in that dank cellar for a long time, staring at Balerion’s huge, empty-eyed skull until his torch burned low, trying to grasp the size of the living animal, to imagine how it must have looked when it spread its great black wings and swept across the skies, breathing fire.  His own remote ancestor, King Loren of the Rock, had tried to stand against the fire when he joined with King Mern of the Reach to oppose the Targaryen conquest. That was close on three hundred years ago, when the Seven Kingdoms were kingdoms, and not mere provinces of a greater realm. Between them, the Two Kings had six hundred banners flying, five thousand mounted knights, and ten times as many freeriders and men-at-arms. Aegon Dragonlord had perhaps a fifth that number, the chroniclers said, and most of those were conscripts from the ranks of the last king he had slain, their loyalties uncertain.  The hosts met on the broad plains of the Reach, amidst golden fields of wheat ripe for harvest. When the Two Kings charged, the Targaryen army shivered and shattered and began to run. For a few moments, the chroniclers wrote, the conquest was at an end… but only for those few moments, before Aegon Targaryen and his sisters joined the battle.  It was the only time that Vhaghar, Meraxes, and Balerion were all unleashed at once. The singers called it the Field of Fire.  Near four thousand men had burned that day, among them King Mern of the Reach. King Loren had escaped, and lived long enough to surrender, pledge his fealty to the Targaryens, and beget a son, for which Tyrion was duly grateful.   Why do you read so much?   Tyrion looked up at the sound of the voice. Jon Snow was standing a few feet away, regarding him curiously. He closed the book on a finger and said,  Look at me and tell me what you see.   The boy looked at him suspiciously.  Is this some kind of trick? I see you. Tyrion Lannister.   Tyrion sighed.  You are remarkably polite for a bastard, Snow. What you see is a dwarf. You are what, twelve?    Fourteen,  the boy said.   Fourteen, and you’re taller than I will ever be. My legs are short and twisted, and I walk with difficulty. I require a special saddle to keep from falling off my horse. A saddle of my own design, you may be interested to know. It was either that or ride a pony. My arms are strong enough, but again, too short. I will never make a swordsman. Had I been born a peasant, they might have left me out to die, or sold me to some slaver’s grotesquerie. Alas, I was born a Lannister of Casterly Rock, and the grotesqueries are all the poorer. Things are expected of me. My father was the Hand of the King for twenty years. My brother later killed that very same king, as it turns out, but life is full of these little ironies. My sister married the new king and my repulsive nephew will be king after him. I must do my part for the honor of my House, wouldn’t you agree? Yet how? Well, my legs may be too small for my body, but my head is too large, although I prefer to think it is just large enough for my mind. I have a realistic grasp of my own strengths and weaknesses. My mind is my weapon. My brother has his sword, King Robert has his warhammer, and I have my mind… and a mind needs books as a sword needs a whetstone, if it is to keep its edge.  Tyrion tapped the leather cover of the book.  That’s why I read so much, Jon Snow.   The boy absorbed that all in silence. He had the Stark face if not the name: long, solemn, guarded, a face that gave nothing away. Whoever his mother had been, she had left little of herself in her son.  What are you reading about?  he asked.   Dragons,  Tyrion told him.   What good is that? There are no more dragons,  the boy said with the easy certainty of youth.   So they say,  Tyrion replied.  Sad, isn’t it? When I was your age, used to dream of having a dragon of my own.    You did?  the boy said suspiciously. Perhaps he thought Tyrion was making fun of him.   Oh, yes. Even a stunted, twisted, ugly little boy can look down over the world when he’s seated on a dragon’s back.  Tyrion pushed the bearskin aside and climbed to his feet.  I used to start fires in the bowels of Casterly Rock and stare at the flames for hours, pretending they were dragonfire. Sometimes I’d imagine my father burning. At other times, my sister.  Jon Snow was staring at him, a look equal parts horror and fascination. Tyrion guffawed.  Don’t look at me that way, bastard. I know your secret. You’ve dreamt the same kind of dreams.    No,  Jon Snow said, horrified.  I wouldn’t…    No? Never?  Tyrion raised an eyebrow."
}