{
  "id": "63e9b8dfdc9774a33f334baea1267a8e53b719c6",
  "text": " Well, dry leather and old wood, what could you expect? The blade, now… you’d need a fire a hundred times as hot to harm the blade.  Mormont shoved the scabbard across the rough oak planks.  I had the rest made anew. Take it.    Take it,  echoed his raven, preening.  Take it, take it.   Awkwardly, Jon took the sword in hand. His left hand; his bandaged right was still too raw and clumsy. Carefully he pulled it from its scabbard and raised it level with his eyes.  The pommel was a hunk of pale stone weighted with lead to balance the long blade. It had been carved into the likeness of a snarling wolf’s head, with chips of garnet set into the eyes. The grip was virgin leather, soft and black, as yet unstained by sweat or blood. The blade itself was a good half foot longer than those Jon was used to, tapered to thrust as well as slash, with three fullers deeply incised in the metal. Where Ice was a true two-handed greatsword, this was a hand-and-a-halfer, sometimes named a  bastard sword.  Yet the wolf sword actually seemed lighter than the blades he had wielded before. When Jon turned it sideways, he could see the ripples in the dark steel where the metal had been folded back on itself again and again.  This is Valyrian steel, my lord,  he said wonderingly. His father had let him handle Ice often enough; he knew the look, the feel.   It is,  the Old Bear told him.  It was my father’s sword, and his father’s before him. The Mormonts have carried it for five centuries. I wielded it in my day and passed it on to my son when I took the black.   He is giving me his son’s sword. Jon could scarcely believe it. The blade was exquisitely balanced. The edges glimmered faintly as they kissed the light.  Your son—    My son brought dishonor to House Mormont, but at least he had the grace to leave the sword behind when he fled. My sister returned it to my keeping, but the very sight of it reminded me of Jorah’s shame, so I put it aside and thought no more of it until we found it in the ashes of my bedchamber. The original pommel was a bear’s head, silver, yet so worn its features were all but indistinguishable. For you, I thought a white wolf more apt. One of our builders is a fair stonecarver.   When Jon had been Bran’s age, he had dreamed of doing great deeds, as boys always did. The details of his feats changed with every dreaming, but quite often he imagined saving his father’s life. Afterward Lord Eddard would declare that Jon had proved himself a true Stark, and place Ice in his hand. Even then he had known it was only a child’s folly; no bastard could ever hope to wield a father’s sword. Even the memory shamed him. What kind of man stole his own brother’s birthright? I have no right to this, he thought, no more than to Ice. He twitched his burned fingers, feeling a throb of pain deep under the skin.  My lord, you honor me, but—    Spare me your but’s, boy,  Lord Mormont interrupted.  I would not be sitting here were it not for you and that beast of yours. You fought bravely… and more to the point, you thought quickly. Fire! Yes, damn it. We ought to have known. We ought to have remembered. The Long Night has come before. Oh, eight thousand years is a good while, to be sure… yet if the Night’s Watch does not remember, who will?    Who will,  chimed the talkative raven.  Who will.   Truly, the gods had heard Jon’s prayer that night; the fire had caught in the dead man’s clothing and consumed him as if his flesh were candle wax and his bones old dry wood. Jon had only to close his eyes to see the thing staggering across the solar, crashing against the furniture and flailing at the flames. It was the face that haunted him most; surrounded by a nimbus of fire, hair blazing like straw, the dead flesh melting away and sloughing off its skull to reveal the gleam of bone beneath.  Whatever demonic force moved Othor had been driven out by the flames; the twisted thing they had found in the ashes had been no more than cooked meat and charred bone. Yet in his nightmare he faced it again… and this time the burning corpse wore Lord Eddard’s features. It was his father’s skin that burst and blackened, his father’s eyes that ran liquid down his cheeks like jellied tears. Jon did not understand why that should be or what it might mean, but it frightened him more than he could say.   A sword’s small payment for a life,  Mormont concluded.  Take it, I’ll hear no more of it, is that understood?    Yes, my lord.  The soft leather gave beneath Jon’s fingers, as if the sword were molding itself to his grip already. He knew he should be honored, and he was, and yet…  He is not my father. The thought leapt unbidden to Jon’s mind. Lord Eddard Stark is my father. I will not forget him, no matter how many swords they give me. Yet he could scarcely tell Lord Mormont that it was another man’s sword he dreamt of…   I want no courtesies either,  Mormont said,  so thank me no thanks. Honor the steel with deeds, not words.   Jon nodded.  Does it have a name, my lord?    It did, once."
}