{
  "id": "640e7e2c0610e62e54003c886cabe33ddf78eb2c",
  "text": " The direwolf was still limping, but a little less each day, it seemed to Bran. The gods had heard.   Maybe we should try another castle,  Meera said to her brother.  Maybe we could get through the gate somewhere else. I could go scout if you wanted, I’d make better time by myself.   Bran shook his head.  If you go east there’s Deep Lake, then Queensgate. West is Icemark. But they’ll be the same, only smaller. All the gates are sealed except the ones at Castle Black, Eastwatch, and the Shadow Tower.   Hodor said,  Hodor,  to that, and the Reeds exchanged a look.  At least I should climb to the top of the Wall,  Meera decided.  Maybe I’ll see something up there.    What could you hope to see?  Jojen asked.   Something,  said Meera, and for once she was adamant.  It should be me. Bran raised his head to look up at the Wall, and imagined himself climbing inch by inch, squirming his fingers into cracks in the ice and kicking footholds with his toes. That made him smile in spite of everything, the dreams and the wildlings and Jon and everything. He had climbed the walls of Winterfell when he was little, and all the towers too, but none of them had been so high, and they were only stone. The Wall could look like stone, all grey and pitted, but then the clouds would break and the sun would hit it differently, and all at once it would transform, and stand there white and blue and glittering. It was the end of the world, Old Nan always said. On the other side were monsters and giants and ghouls, but they could not pass so long as the Wall stood strong. I want to stand on top with Meera, Bran thought. I want to stand on top and see.  But he was a broken boy with useless legs, so all he could do was watch from below as Meera went up in his stead.  She wasn’t really climbing, the way he used to climb. She was only walking up some steps that the Night’s Watch had hewn hundreds and thousands of years ago. He remembered Maester Luwin saying the Nightfort was the only castle where the steps had been cut from the ice of the Wall itself. Or maybe it had been Uncle Benjen. The newer castles had wooden steps, or stone ones, or long ramps of earth and gravel. Ice is too treacherous. It was his uncle who’d told him that. He said that the outer surface of the Wall wept icy tears sometimes, though the core inside stayed frozen hard as rock. The steps must have melted and refrozen a thousand times since the last black brothers left the castle, and every time they did they shrunk a little and got smoother and rounder and more treacherous.  And smaller. It’s almost like the Wall was swallowing them back into itself. Meera Reed was very surefooted, but even so she was going slowly, moving from nub to nub. In two places where the steps were hardly there at all she got down on all fours. It will be worse when she comes down, Bran thought, watching. Even so, he wished it was him up there. When she reached the top, crawling up the icy knobs that were all that remained of the highest steps, Meera vanished from his sight.   When will she come down?  Bran asked Jojen.   When she is ready. She will want to have a good look… at the Wall and what’s beyond. We should do the same down here.    Hodor?  said Hodor, doubtfully.   We might find something,  Jojen insisted.  Or something might find us. Bran couldn’t say it, though; he did not want Jojen to think he was craven.  So they went exploring, Jojen Reed leading, Bran in his basket on Hodor’s back, Summer padding by their side. Once the direwolf bolted through a dark door and returned a moment later with a grey rat between his teeth. The Rat Cook, Bran thought, but it was the wrong color, and only as big as a cat. The Rat Cook was white, and almost as huge as a sow…  There were a lot of dark doors in the Nightfort, and a lot of rats. Bran could hear them scurrying through the vaults and cellars, and the maze of pitch-black tunnels that connected them. Jojen wanted to go poking around down there, but Hodor said  Hodor  to that, and Bran said  No.  There were worse things than rats down in the dark beneath the Nightfort.   This seems an old place,  Jojen said as they walked down a gallery where the sunlight fell in dusty shafts through empty windows.   Twice as old as Castle Black,  Bran said, remembering.  It was the first castle on the Wall, and the largest.  But it had also been the first abandoned, all the way back in the time of the Old King. Even then it had been three-quarters empty and too costly to maintain. Good Queen Alysanne had suggested that the Watch replace it with a smaller, newer castle at a spot only seven miles east, where the Wall curved along the shore of a beautiful green lake. Deep Lake had been paid for by the queen’s jewels and built by the men the Old King had sent north, and the black brothers had abandoned the Nightfort to the rats.  That was two centuries past, though. Now Deep Lake stood as empty as the castle it had replaced, and the Nightfort…   There are ghosts here,  Bran said."
}