{
  "id": "641b4446a2cac068065bfcadbe61351308c4d7b0",
  "text": "\" She bustled out of the tent and he heard her go next door and say, \"How does it feel now, Diggory?\" Harry didn't want to sit still:  He was too full of adrenaline.  He got to his feet, wanting to see what was going on outside, but before he'd reached the mouth of the tent, two people had come darting inside - Hermione, followed closely by Ron. \"Harry, you were brilliant!\"   Hermione said squeakily. There were fingernail marks on her face where she had been clutching it in fear.  \"You were amazing!  You really were!\" But Harry was looking at Ron, who was very white and staring at Harry as though he were a ghost. \"Harry,\" he said, very seriously, \"whoever put your name in that goblet - I - I reckon they're trying to do you in!\" It was as though the last few weeks had never happened - as though Harry were meeting Ron for the first time, right after he'd been made champion. \"Caught on, have you?\"  said Harry coldly.  \"Took you long enough.\" Hermione stood nervously between them, looking from one to the other.  Ron opened his mouth uncertainly.  Harry knew Ron was about to apologize and suddenly he found he didn't need to hear it. \"It's okay,\" he said, before Ron could get the words out.  \"Forget it.\"  \"No,\" said Ron, \"I shouldn't've -\" \"Forget it, \"Harry said. Ron grinned nervously at him, and Harry grinned back  Hermione burst into tears. \"There's nothing to cry about!\"  Harry told her, bewildered.   \"You two are so stupid!\" she shouted, stamping her foot on the ground, tears splashing down her front.  Then, before either of them could stop her, she had given both of them a hug and dashed away, now positively howling. \"Barking mad,\" said Ron, shaking his head.  \"Harry, c'mon, they'll be putting up your scores. . . .\" Picking up the golden egg and his Firebolt, feeling more elated than he would have believed possible an hour ago, Harry ducked out of the tent, Ron by his side, talking fast. \"You were the best, you know, no competition.  Cedric did this weird thing where he Transfigured a rock on the ground. . . turned it into a dog. . . he was trying to make the dragon go for the dog instead of him.  Well, it was a pretty cool bit of Transfiguration, and it sort of worked, because he did get the egg, but he got burned as well - the dragon changed its mind halfway through and decided it would rather have him than the Labrador; he only just got away. And that Fleur girl tried this sort of charm, I think she was trying to put it into a trance - well, that kind of worked too, it went all sleepy, but then it snored, and this great jet of flame shot out, and her skirt caught fire - she put it out with a bit of water out of her wand.  And Krum - you won't believe this, but he didn't even think of flying!  He was probably the best after you, though.  Hit it with some sort of spell right in the eye.  Only thing is, it went trampling around in agony and squashed half the real eggs - they took marks off for that, he wasn't supposed to do any damage to them.\" Ron drew breath as he and Harry reached the edge of the enclosure.  Now that the Horntail had been taken away, Harry could see where the five judges were sitting - right at the other end, in raised seats draped in gold. \"It's marks out of ten from each one,\" Ron said, and Harry squinting up the field, saw the first judge - Madame Maxime - raise her wand in the air.  What hooked like a long silver ribbon shot out of it, which twisted itself into a large figure eight. \"Not bad!\" said Ron as the crowd applauded.  \"I suppose she took marks off for your shoulder. . . Mr. Crouch came next. He shot a number nine into the air. \"Looking good!\"  Ron yelled, thumping Harry on the back. Next, Dumbledore.  He too put up a nine.  The crowd was cheering harder than ever. Ludo Bagman - ten. \"Ten?\" said Harry in disbelief.  \"But. . . I got hurt. . . . What's he playing at?\" \"Harry, don't complain!\" Ron yelled excitedly. And now Karkaroff raised his wand. He paused for a moment, and then a number shot out of his wand too - four. \"What?\" Ron bellowed furiously. \"Four?  You lousy, biased scum-bag, you gave Krum ten!\" But Harry didn't care, he wouldn't have cared if Karkaroff had given him zero; Ron's indignation on his behalf was worth about a hundred points to him.  He didn't tell Ron this, of course, but his heart felt lighter than air as he turned to leave the enclosure.  And it wasn't just Ron. . . those weren't only Gryffindors cheering in the crowd.  When it had come to it, when they had seen what he was facing, most of the school had been on his side as well as Cedric's. . . . He didn't care about the Slytherins, he could stand whatever they threw at him now. \"You're tied in first place, Harry!  You and Krum!\"  said Charlie Weasley, hurrying to meet them as they set off back toward the school.  \"Listen, I've got to run, I've got to go and send Mum an owl, I swore I'd tell her what happened - but that was unbelievable!  Oh yeah - and they told me to tell you you've got to hang around for a few more minutes."
}