{
  "id": "642392877b529719decf047e9f6455b1407a5028",
  "text": " \"You knew I'm a -- a wizard?\"  \"Knew!\" shrieked Aunt Petunia suddenly. \"Knew! Of course we knew! How could you not be, my dratted sister being what she was? Oh, she got a letter just like that and disappeared off to that-that school-and came home every vacation with her pockets full of frog spawn, turning teacups into rats. I was the only one who saw her for what she was -- a freak! But for my mother and father, oh no, it was Lily this and Lily that, they were proud of having a witch in the family!\"  She stopped to draw a deep breath and then went ranting on. It seemed she had been wanting to say all this for years.  \"Then she met that Potter at school and they left and got married and had you, and of course I knew you'd be just the same, just as strange, just as -- as -- abnormal -- and then, if you please, she went and got herself blown up and we got landed with you!\"  Harry had gone very white. As soon as he found his voice he said, \"Blown up? You told me they died in a car crash!\"  \"CAR CRASH!\" roared Hagrid, jumping up so angrily that the Dursleys scuttled back to their corner. \"How could a car crash kill Lily an' James Potter? It's an outrage! A scandal! Harry Potter not knowin' his own story when every kid in our world knows his name!\" \"But why? What happened?\" Harry asked urgently.  The anger faded from Hagrid's face. He looked suddenly anxious.  \"I never expected this,\" he said, in a low, worried voice. \"I had no idea, when Dumbledore told me there might be trouble gettin' hold of yeh, how much yeh didn't know. Ah, Harry, I don' know if I'm the right person ter tell yeh -- but someone 3 s gotta -- yeh can't go off ter Hogwarts not knowin'.\"  He threw a dirty look at the Dursleys.  \"Well, it's best yeh know as much as I can tell yeh -- mind, I can't tell yeh everythin', it's a great myst'ry, parts of it....\"  He sat down, stared into the fire for a few seconds, and then said, \"It begins, I suppose, with -- with a person called -- but it's incredible yeh don't know his name, everyone in our world knows --\"  \"Who? \"  \"Well -- I don' like sayin' the name if I can help it. No one does.\"  \"Why not?\"  \"Gulpin' gargoyles, Harry, people are still scared. Blimey, this is difficult. See, there was this wizard who went... bad. As bad as you could go. Worse. Worse than worse. His name was...\"  Hagrid gulped, but no words came out.  \"Could you write it down?\" Harry suggested.  \"Nah -can't spell it. All right -- Voldemort. \" Hagrid shuddered. \"Don' make me say it again. Anyway, this -- this wizard, about twenty years ago now, started lookin' fer followers. Got 'em, too -- some were afraid, some just wanted a bit o' his power, 'cause he was gettin' himself power, all right. Dark days, Harry. Didn't know who ter trust, didn't dare get friendly with strange wizards or witches... terrible things happened. He was takin' over. 'Course, some stood up to him -- an' he killed 'em. Horribly. One o' the only safe places left was Hogwarts. Reckon Dumbledore's the only one You-Know-Who was afraid of. Didn't dare try takin' the school, not jus' then, anyway.  \"Now, yer mum an' dad were as good a witch an' wizard as I ever knew. Head boy an' girl at Hogwarts in their day! Suppose the myst'ry is why You-Know-Who never tried to get 'em on his side before... probably knew they were too close ter Dumbledore ter want anythin' ter do with the Dark Side.  \"Maybe he thought he could persuade 'em... maybe he just wanted 'em outta the way. All anyone knows is, he turned up in the village where you was all living, on Halloween ten years ago. You was just a year old. He came ter yer house an' -- an' --\"  Hagrid suddenly pulled out a very dirty, spotted handkerchief and blew his nose with a sound like a foghorn.  \"Sorry,\" he said. \"But it's that sad -- knew yer mum an' dad, an' nicer people yeh couldn't find -- anyway...\"  \"You-Know-Who killed 'em. An' then -- an' this is the real myst'ry of the thing -- he tried to kill you, too. Wanted ter make a clean job of it, I suppose, or maybe he just liked killin' by then. But he couldn't do it. Never wondered how you got that mark on yer forehead? That was no ordinary cut. That's what yeh get when a Powerful, evil curse touches yeh -- took care of yer mum an' dad an' yer house, even -- but it didn't work on you, an' that's why yer famous, Harry. No one ever lived after he decided ter kill 'em, no one except you, an' he'd killed some o' the best witches an' wizards of the age -- the McKinnons, the Bones, the Prewetts -- an' you was only a baby, an' you lived.\"  Something very painful was going on in Harry's mind. As Hagrid's story came to a close, he saw again the blinding flash of green light, more clearly than he had ever remembered it before -- and he remembered something else, for the first time in his life: a high, cold, cruel laugh.  Hagrid was watching him sadly.  \"Took yeh from the ruined house myself, on Dumbledore's orders. Brought yeh ter this lot...\"  \"Load of old tosh,\" said Uncle Vernon."
}