{
  "id": "642ca7f7762896fc28e1b2f1e1b554063b11a5d6",
  "text": " They were the heart of the matter; there were more than twenty of them.  I know your sigil as well: the twin towers of Frey. How fares your good lord, sers?   Their captain rose.  Lord Walder is well, my lady. He plans to take a new wife on his ninetieth name day, and has asked your lord father to honor the wedding with his presence.   Tyrion Lannister sniggered. That was when Catelyn knew he was hers.  This man came a guest into my house, and there conspired to murder my son, a boy of seven,  she proclaimed to the room at large, pointing. Ser Rodrik moved to her side, his sword in hand.  In the name of King Robert and the good lords you serve, I call upon you to seize him and help me return him to Winterfell to await the king’s justice.   She did not know what was more satisfying: the sound of a dozen swords drawn as one or the look on Tyrion Lannister’s face.      SANSA  Sansa rode to the Hand’s tourney with Septa Mordane and Jeyne Poole, in a litter with curtains of yellow silk so fine she could see right through them. They turned the whole world gold. Beyond the city walls, a hundred pavilions had been raised beside the river, and the common folk came out in the thousands to watch the games. The splendor of it all took Sansa’s breath away; the shining armor, the great chargers caparisoned in silver and gold, the shouts of the crowd, the banners snapping in the wind… and the knights themselves, the knights most of all.   It is better than the songs,  she whispered when they found the places that her father had promised her, among the high lords and ladies. Sansa was dressed beautifully that day, in a green gown that brought out the auburn of her hair, and she knew they were looking at her and smiling.  They watched the heroes of a hundred songs ride forth, each more fabulous than the last. The seven knights of the Kingsguard took the field, all but Jaime Lannister in scaled armor the color of milk, their cloaks as white as freshfallen snow. Ser Jaime wore the white cloak as well, but beneath it he was shining gold from head to foot, with a lion’s-head helm and a golden sword. Ser Gregor Clegane, the Mountain That Rides, thundered past them like an avalanche. Sansa remembered Lord Yohn Royce, who had guested at Winterfell two years before.  His armor is bronze, thousands and thousands of years old, engraved with magic runes that ward him against harm,  she whispered to Jeyne. Septa Mordane pointed out Lord Jason Mallister, in indigo chased with silver, the wings of an eagle on his helm. He had cut down three of Rhaegar’s bannermen on the Trident. The girls giggled over the warrior priest Thoros of Myr, with his flapping red robes and shaven head, until the septa told them that he had once scaled the walls of Pyke with a flaming sword in hand.  Other riders Sansa did not know; hedge knights from the Fingers and Highgarden and the mountains of Dorne, unsung freeriders and new-made squires, the younger sons of high lords and the heirs of lesser houses. Younger men, most had done no great deeds as yet, but Sansa and Jeyne agreed that one day the Seven Kingdoms would resound to the sound of their names. Ser Balon Swann. Lord Bryce Caron of the Marches. Bronze Yohn’s heir, Ser Andar Royce, and his younger brother Ser Robar, their silvered steel plate filigreed in bronze with the same ancient runes that warded their father. The twins Ser Horas and Ser Hobber, whose shields displayed the grape cluster sigil of the Redwynes, burgundy on blue. Patrek Mallister, Lord Jason’s son. Six Freys of the Crossing: Ser Jared, Ser Hosteen, Ser Danwell, Ser Emmon, Ser Theo, Ser Perwyn, sons and grandsons of old Lord Walder Frey, and his bastard son Martyn Rivers as well.  Jeyne Poole confessed herself frightened by the look of Jalabhar Xho, an exile prince from the Summer Isles who wore a cape of green and scarlet feathers over skin as dark as night, but when she saw young Lord Beric Dondarrion, with his hair like red gold and his black shield slashed by lightning, she pronounced herself willing to marry him on the instant.  The Hound entered the lists as well, and so too the king’s brother, handsome Lord Renly of Storm’s End. Jory, Alyn, and Harwin rode for Winterfell and the north.  Jory looks a beggar among these others,  Septa Mordane sniffed when he appeared. Sansa could only agree. Jory’s armor was blue-grey plate without device or ornament, and a thin grey cloak hung from his shoulders like a soiled rag. Yet he acquitted himself well, unhorsing Horas Redwyne in his first joust and one of the Freys in his second. In his third match, he rode three passes at a freerider named Lothor Brune whose armor was as drab as his own. Neither man lost his seat, but Brune’s lance was steadier and his blows better placed, and the king gave him the victory. Alyn and Harwin fared less well; Harwin was unhorsed in his first tilt by Ser Meryn of the Kingsguard, while Alyn fell to Ser Balon Swann.  The jousting went all day and into the dusk, the hooves of the great warhorses pounding down the lists until the field was a ragged wasteland of torn earth."
}