{
  "id": "6434c99ac4dc07e86af7d6ff869aaa9aebe05fe6",
  "text": "  Dreary  as  had  been  his  imprisonment and  unpleasant  as  was  his  position  (to  say  nothing  of  the  poor  dwarves  underneath  him)  still,  he  had  been  more  lucky  than  he  had  guessed.  The  talk  was  all  of  the  trade  that  came  and  went  on  the  waterways  and  the  growth  of  the  traffic  on  the  river, as  the  roads out of  the East  towards Mirkwood vanished or  fell  into disuse;  and of the bickerings of the Lake-men and the Wood-elves about the upkeep of the  Forest River and the care of the banks.  Those  lands  had  changed  much  since  the  days  when  dwarves  dwelt  in  the  Mountain,  days  which  most  people  now  remembered  only  as  a  very  shadowy  tradition.  They  had  changed  even  in  recent  years,  and  since  the  last  news  that  Gandalf  had  had  of  them.  Great  floods  and  rains  had  swollen  the  waters  that  flowed  east;  and  there had been  an  earthquake or  two  (which  some were  inclined  to attribute to the dragon-alluding to him chiefly with a curse and an ominous nod  in  the  direction  of  the  Mountain).  The  marshes  and  bogs  had  spread  wider  and  wider  on  either  side.  Paths  had  vanished,  and many  a  rider  and wanderer  too,  if  they  had  tried  to  find  the  lost  ways  across.  The  elf-road  through  the wood which  the dwarves had followed on the advice of Beorn now came to a doubtful and little  used  end  at  the  eastern  edge  of  the  forest;  only  the  river offered any  longer a safe   ####-way  from  the  skirts  of  Mirkwood  in  the  North  to  the  mountain-shadowed plains  beyond, and the river was guarded by the Wood-elves' king.  So  you  see Bilbo  had  come  in  the  end  by  the  only  road  that was  any  good.  It  might have  been  some  comfort  to Mr. Baggins  shivering on  the barrels,  if he had  known  that  news  of  this  had  reached  Gandalf  far  away  and  given  him  great  anxiety, and  that he was  in  fact  finishing his other business  (which does not come  into this tale) and getting ready to come in search of Thorin's company. But Bilbo  did not know it.  All he knew was that the river seemed to go on and on and on for ever, and he  was  hungry,  and  had  a  nasty  cold  in  the  nose,  and  did  not  like  the  way  the  Mountain seemed to frown at him and threaten him as it drew ever nearer. After a  while, however,  the  river  took a more southerly course and  the Mountain  receded  again,  and  at  last,  late  in  the  day  the  shores  grew  rocky,  the  river  gathered  all  its  wandering  waters  together  into  a  deep  and  rapid  flood,  and  they  swept  along  at  great speed.  The  sun had  set when  turning with another  sweep  towards  the East  the  forest- river  rushed  into  the  Long  Lake.  There  it  had  a  wide  mouth  with  stony  clifflike  gates at either side whose feet were piled with shingles. The Long Lake! Bilbo had  never  imagined  that  any  water  that  was  not  the  sea  could  look  so  big.  It  was  so  wide  that  the  opposite  shores  looked  small  and  far,  but  it  was  so  long  that  its  northerly end, which pointed towards the Mountain, could not be  seen at all. Only  from the map did Bilbo know that away up there, where the stars of the Wain were  already  twinkling,  the  Running  River  came  down  into  the  lake  from  Dale  and  with  the  Forest  River  filled  with  deep  waters  what  must  once  have  been  a  great  deep  rocky  valley. At  the  southern  end  the  doubled waters  poured  out  again  over  high waterfalls  and  ran  away  hurriedly  to  unknown  lands.  In  the  still  evening  air  the noise of the falls could be heard like a distant roar.   Not  far  from  the mouth  of  the Forest River was the strange town he heard the  elves speak of in the king's cellars. It was not built on the shore, though there were  a  few  huts  and  buildings  there,  but  right  out  on  the  surface  of  the  lake,  protected  from  the swirl of  the entering river by a promontory of rock which formed a calm  bay. A great  . bridge made of wood ran out to where on huge piles made of forest  trees  was  built  a  busy  wooden  town,  not  a  town  of  elves  but  of  Men,  who  still  dared  to  dwell  here  under  the  shadow  of  the  distant  dragon-mountain. They  still  throve  on  the  trade  that  came  up  the  great  river  from  the  South  and  was  carted  past  the  falls  to  their  town;  but  in  the  great  days  of  old,  when  Dale  in  the  North  was rich and prosperous, they had been wealthy and powerful, and there had been   ####-fleets  of  boats  on  the  waters,  and  some  were  filled  with  gold  and  some  with  warriors  in  armour,  and  there  had  been  wars  and  deeds  which  were  now  only  a  legend.  The  rotting  piles  of  a  greater  town  could  still  be  seen  along  the  shores  when the waters sank in a drought.  But men  remembered  little of  all  that,  though  some  still  sang old  songs of  the  dwarf-kings  of  the Mountain,  Thror  and  Thrain  of  the  race  of  Durin,  and  of  the  coming of the Dragon, and the fall of the lords of Dale."
}