{
  "id": "64872230514e7cd75ca1e784b59f527ac01d0544",
  "text": "  I only want to be loyal.    Loyal,  the dwarf mused,  and far from any Lannisters. I can scarce blame you for that. When I was your age, I wanted the same thing.  He smiled.  They tell me you visit the godswood every day. What do you pray for, Sansa?   I pray for Robb’s victory and Joffrey’s death… and for home. For Winterfell.  I pray for an end to the fighting.    We’ll have that soon enough. There will be another battle, between your brother Robb and my lord father, and that will settle the issue.   Robb will beat him, Sansa thought. He beat your uncle and your brother Jaime, he’ll beat your father too.  It was as if her face were an open book, so easily did the dwarf read her hopes.  Do not take Oxcross too much to heart, my lady,  he told her, not unkindly.  A battle is not a war, and my lord father is assuredly not my uncle Stafford. The next time you visit the godswood, pray that your brother has the wisdom to bend the knee. Once the north returns to the king’s peace, I mean to send you home.  He hopped down off the window seat and said,  You may sleep here tonight. I’ll give you some of my own men as a guard, some Stone Crows perhaps—    No,  Sansa blurted out, aghast. If she was locked in the Tower of the Hand, guarded by the dwarf’s men, how would Ser Dontos ever spirit her away to freedom?   Would you prefer Black Ears? I’ll give you Chella if a woman would make you more at ease.    Please, no, my lord, the wildlings frighten me.   He grinned.  Me as well. But more to the point, they frighten Joffrey and that nest of sly vipers and lickspittle dogs he calls a Kingsguard. With Chella or Timett by your side, no one would dare offer you harm.    I would sooner return to my own bed.  A lie came to her suddenly, but it seemed so right that she blurted it out at once.  This tower was where my father’s men were slain. Their ghosts would give me terrible dreams, and I would see their blood wherever I looked.   Tyrion Lannister studied her face.  I am no stranger to nightmares, Sansa. Perhaps you are wiser than I knew. Permit me at least to escort you safely back to your own chambers.       CATELYN  It was full dark before they found the village. Catelyn found herself wondering if the place had a name. If so, its people had taken that knowledge with them when they fled, along with all they owned, down to the candles in the sept. Ser Wendel lit a torch and led her through the low door.  Within, the seven walls were cracked and crooked. God is one, Septon Osmynd had taught her when she was a girl, with seven aspects, as the sept is a single building, with seven walls. The wealthy septs of the cities had statues of the Seven and an altar to each. In Winterfell, Septon Chayle hung carved masks from each wall. Here Catelyn found only rough charcoal drawings. Ser Wendel set the torch in a sconce near the door, and left to wait outside with Robar Royce.  Catelyn studied the faces. The Father was bearded, as ever. The Mother smiled, loving and protective. The Warrior had his sword sketched in beneath his face, the Smith his hammer. The Maid was beautiful, the Crone wizened and wise.  And the seventh face… the Stranger was neither male nor female, yet both, ever the outcast, the wanderer from far places, less and more than human, unknown and unknowable. Here the face was a black oval, a shadow with stars for eyes. It made Catelyn uneasy. She would get scant comfort there.  She knelt before the Mother.  My lady, look down on this battle with a mother’s eyes. They are all sons, every one. Spare them if you can, and spare my own sons as well. Watch over Robb and Bran and Rickon. Would that I were with them.   A crack ran down through the Mother’s left eye. It made her look as if she were crying. Catelyn could hear Ser Wendel’s booming voice, and now and again Ser Robar’s quiet answers, as they talked of the coming battle. Otherwise the night was still. Not even a cricket could be heard, and the gods kept their silence. Did your old gods ever answer you, Ned? she wondered. When you knelt before your heart tree, did they hear you?  Flickering torchlight danced across the walls, making the faces seem half alive, twisting them, changing them. The statues in the great septs of the cities wore the faces the stonemasons had given them, but these charcoal scratchings were so crude they might be anyone. The Father’s face made her think of her own father, dying in his bed at Riverrun. The Warrior was Renly and Stannis, Robb and Robert, Jaime Lannister and Jon Snow. She even glimpsed Arya in those lines, just for an instant. Then a gust of wind through the door made the torch sputter, and the semblance was gone, washed away in orange glare.  The smoke was making her eyes burn. She rubbed at them with the heels of her scarred hands. When she looked up at the Mother again, it was her own mother she saw. Lady Minisa Tully had died in childbed, trying to give Lord Hoster a second son. The baby had perished with her, and afterward some of the life had gone out of Father."
}