{
  "id": "6491d4e631eba828a027d33e672dc463ae720ef0",
  "text": " It is an ill that no leech can  wholly cure, not even Gandalf.'       'Then let all who are to ride with me rest now,' said Gandalf. 'We will  journey under the shadow of evening. It is  as well;  for  it is my  counsel  that all our comings and goings should be as  secret as may  be, henceforth.   ####-But do not command many  men to go with you, Thjoden. We go to  a parley  not  to a fight.'       The King then chose  men that  were unhurt and had swift horses, and he  sent them forth with tidings of the victory into every vale of the Mark; and  they bore his summons also, bidding all men, young and old, to come in haste  to Edoras. There the Lord of the Mark  would  hold an  assembly  of all that  could bear arms, on the second day after the full moon. To  ride with him to   Isengard the King chose Jomer and twenty men of his household. With   Gandalf  would go  Aragorn, and Legolas, and Gimli. In spite  of his hurt  the  dwarf  would not stay behind.       'It  was only a  feeble blow and the cap turned it;' he said. 'It would  take more than such an orc-scratch to keep me back.'       'I will tend it, while you rest,' said Aragorn.       The king now returned to the Hornburg, and slept, such a sleep of quie t  as he had not known for many years,  and the remainder of his chosen company  rested also. But the others, all that  were not  hurt  or wounded,  began  a   great labour; for many had fallen  in the battle and lay dead upon the field  or in the Deep.       No  Orcs remained alive; their bodies were uncounted. But  a great many  of the hillmen had given themselves up; and they were afraid,  and cried for   mercy.       The Men of the Mark took their weapons from them, and set them to work.       'Help  now  to  repa ir  the  evil  in  which  you  have  joined,'  said  Erkenbrand;  'and afterwards you  shall take an oath never again to pass the  Fords of Isen in arms, nor to march  with the  enemies of Men;  and then you  shall go free back to your land. For you have been deluded  by Saruman. Many  of  you  have got  death  as  the  reward  of your trust in him; but had you   conquered, little better would your wages have been.'       The men of Dunland were amazed, for Saruman had told  them that the men  of Rohan were cruel and burned their captives alive.       In the  midst of  the field before the Hornburg two mounds were raised,  and  beneath them  were laid  all  the Riders of the Mark who  fell  in  the  defence, those of the  East Dales upon one side, and  those of Westfold upon   the  other. In a_ grave alone  under the shadow  of  the Hornburg  lay Hbma,  captain of the King's guard. He fell before the Gate.   ####-     The Orcs  were piled in great heaps, away  from the mounds  of Men, not  far  from  the eaves of the forest. And the people  were  troubled in  their  minds; for the  heaps of carrion were too great  for burial or for  burning.  They had little wood for firing, and none would have dared to take an axe to  the strange trees, even if Gandalf had not warned them to hurt  neither bark  nor bough at their great peril.       'Let the Orcs lie,' said Gandalf. 'The morning may bring new counsel.'       In  the  afternoon the King's company prepared  to depart.  The work of  burial was then but beginning; and Thjoden mourned for the loss of Hbma, his  captain,  and cast the first earth upon  his grave. 'Great injury indeed has  Saruman  done  to me and all  this land,' he said; 'and  I will remember it,  when we meet.'       The sun was already drawing near the hills upon the west  of the Coomb,   when  at last  Thjoden and Gandalf and their companions  rode down from  the  Dike. Behind them were gathered a great host,  both of the Riders and of the  people of Westfold, old and young, women and children, who had come out  from  the caves. A song of victory they sang with clear voices; and then they fell  silent, wondering what would chance,  for their  eyes were on the trees  and  they feared them.       The Riders came to the wood, and they halted; horse and  man, they were  unwilling  to  pass in. T he trees were grey and menacing, and a shadow  or a   mist  was about them. The ends of their long  sweeping boughs hung down like  searching  fingers, their roots  stood up from the ground like the  limbs of  strange monsters,  and  dark  caverns opened benea th them.  But Gandalf went  forward, leading the company, and where the road from  the Hornburg  met the  trees they saw now an opening like an arched gate  under mighty  boughs; and  through  it  Gandalf passed,  and they followed him. Then to their amazement  they  found that the road ran on, and the Deeping-stream  beside it; and the  sky was open above  and  full of golden light. But on either side the  great  aisles  of the  wood  were  already  wrapped in  dusk,  stretching away into  impenetrable shadows; and there  they  heard the  creaking  and  groaning of   boughs, and far cries, and a rumour of  wordless  voices, murmuring angrily."
}