{
  "id": "64b41db654d1ef6a4fe084ee0091c0d146c19d6a",
  "text": "  I promise.   It was not enough.  If you ever tell anyone,  he finished,  I’ll kill you.       EDDARD   I stood last vigil for him myself,  Ser Barristan Selmy said as they looked down at the body in the back of the cart.  He had no one else. A mother in the Vale, I am told.   In the pale dawn light, the young knight looked as though he were sleeping. He had not been handsome, but death had smoothed his rough-hewn features and the silent sisters had dressed him in his best velvet tunic, with a high collar to cover the ruin the lance had made of his throat. Eddard Stark looked at his face, and wondered if it had been for his sake that the boy had died. Slain by a Lannister bannerman before Ned could speak to him; could that be mere happenstance? He supposed he would never know.   Hugh was Jon Arryn’s squire for four years,  Selmy went on.  The king knighted him before he rode north, in Jon’s memory. The lad wanted it desperately, yet I fear he was not ready.   Ned had slept badly last night and he felt tired beyond his years.  None of us is ever ready,  he said.   For knighthood?    For death.  Gently Ned covered the boy with his cloak, a bloodstained bit of blue bordered in crescent moons. When his mother asked why her son was dead, he reflected bitterly, they would tell her he had fought to honor the King’s Hand, Eddard Stark.  This was needless. War should not be a game.  Ned turned to the woman beside the cart, shrouded in grey, face hidden but for her eyes. The silent sisters prepared men for the grave, and it was ill fortune to look on the face of death.  Send his armor home to the Vale. The mother will want to have it.    It is worth a fair piece of silver,  Ser Barristan said.  The boy had it forged special for the tourney. Plain work, but good. I do not know if he had finished paying the smith.    He paid yesterday, my lord, and he paid dearly,  Ned replied. And to the silent sister he said,  Send the mother the armor. I will deal with this smith.  She bowed her head.  Afterward Ser Barristan walked with Ned to the king’s pavilion. The camp was beginning to stir. Fat sausages sizzled and spit over firepits, spicing the air with the scents of garlic and pepper. Young squires hurried about on errands as their masters woke, yawning and stretching, to meet the day. A serving man with a goose under his arm bent his knee when he caught sight of them.  M’lords,  he muttered as the goose honked and pecked at his fingers. The shields displayed outside each tent heralded its occupant: the silver eagle of Seagard, Bryce Caron’s field of nightingales, a cluster of grapes for the Redwynes, brindled boar, red ox, burning tree, white ram, triple spiral, purple unicorn, dancing maiden, blackadder, twin towers, horned owl, and last the pure white blazons of the Kingsguard, shining like the dawn.   The king means to fight in the melee today,  Ser Barristan said as they were passing Ser Meryn’s shield, its paint sullied by a deep gash where Loras Tyrell’s lance had scarred the wood as he drove him from his saddle.   Yes,  Ned said grimly. Jory had woken him last night to bring him that news. Small wonder he had slept so badly.  Ser Barristan’s look was troubled.  They say night’s beauties fade at dawn, and the children of wine are oft disowned in the morning light.    They say so,  Ned agreed,  but not of Robert.  Other men might reconsider words spoken in drunken bravado, but Robert Baratheon would remember and, remembering, would never back down.  The king’s pavilion was close by the water, and the morning mists off the river had wreathed it in wisps of grey. It was all of golden silk, the largest and grandest structure in the camp. Outside the entrance, Robert’s warhammer was displayed beside an immense iron shield blazoned with the crowned stag of House Baratheon.  Ned had hoped to discover the king still abed in a wine-soaked sleep, but luck was not with him. They found Robert drinking beer from a polished horn and roaring his displeasure at two young squires who were trying to buckle him into his armor.  Your Grace,  one was saying, almost in tears,  it’s made too small, it won’t go.  He fumbled, and the gorget he was trying to fit around Robert’s thick neck tumbled to the ground.   Seven hells!  Robert swore.  Do I have to do it myself? Piss on the both of you. Pick it up. Don’t just stand there gaping, Lancel, pick it up!  The lad jumped, and the king noticed his company.  Look at these oafs, Ned. My wife insisted I take these two to squire for me, and they’re worse than useless. Can’t even put a man’s armor on him properly. Squires, they say. I say they’re swineherds dressed up in silk.   Ned only needed a glance to understand the difficulty.  The boys are not at fault,  he told the king.  You’re too fat for your armor, Robert.   Robert Baratheon took a long swallow of beer, tossed the empty horn onto his sleeping furs, wiped his mouth with the back of his hand, and said darkly,  Fat? Fat, is it? Is that how you speak to your king?  He let go his laughter, sudden as a storm."
}