{
  "id": "64c84f5686d2c72de58a065a5eb3661fdaf142b3",
  "text": "  By the time he had grasped it, two more grindylows had risen out of the weed, had seized handfuls of Harry's robes, and were attempting to drag him down. \"Relashio!\"  Harry shouted, except that no sound came out. ... A large bubble issued from his mouth, and his wand, instead of sending sparks at the grindylows, pelted them with what seemed to be a jet of boiling water, for where it struck them, angry red patches appeared on their green skin.  Harry pulled his ankle out of the grindylows grip and swam, as fast as he could, occasionally sending more jets of hot water over his shoulder at random; every now and then he felt one of the grindylows snatch at his foot again, and he kicked out, hard; finally, he felt his foot connect with a horned skull, and looking back, saw the dazed grindylow floating away, cross-eyed, while its fellows shook their fists at Harry and sank back into the weed. Harry slowed down a little, slipped his wand back inside his robes, and looked around, listening again.  He turned full circle in the water, the silence pressing harder than ever against his eardrums.  He knew he must be even deeper in the lake now, but nothing was moving but the rippling weed. \"How are you getting on?\" Harry thought he was having a heart attack.  He whipped around and saw Moaning Myrtle floating hazily in front of him, gazing at him through her thick, pearly glasses. \"Myrtle!\" Harry tried to shout - but once again, nothing came out of his mouth but a very large bubble.  Moaning Myrtle actually giggled. \"You want to try over there!\" she said, pointing.  \"I won't come with you. ... I don't like them much, they always chase me when I get too close. ...\" Harry gave her the thumbs-up to show his thanks and set off once more, careful to swim a bit higher over the weed to avoid any more grindylows that might be lurking there. He swam on for what felt like at least twenty minutes.  He was passing over vast expanses of black mud now, which swirled murkily as he disturbed the water.  Then, at long last, he heard a snatch of haunting mersong.  \"An hour long you'll have to look,  And to recover what we took...\"  Harry swam faster and soon saw a large rock emerge out of the muddy water ahead.  It had paintings of merpeople on it; they were carrying spears and chasing what looked like the giant squid.  Harry swam on past the rock, following the mersong.  \". . . your time's half gone, so tarry not  Lest what you seek stays here to rot. ...\"  A cluster of crude stone dwellings stained with algae loomed suddenly out of the gloom on all sides.  Here and there at the dark windows, Harry saw faces . . . faces that bore no resemblance at all to the painting of the mermaid in the prefects' bathroom. . . . The merpeople had grayish skin and long, wild, dark green hair.  Their eyes were yellow, as were their broken teeth, and they wore thick ropes of pebbles around their necks. They leered at Harry as he swam past; one or two of them emerged from their caves to watch him better, their powerful, silver fish tails beating the water, spears clutched in their hands. Harry sped on, staring around, and soon the dwellings became more numerous; there were gardens of weed around some of them, and he even saw a pet grindylow tied to a stake outside one door.  Merpeople were emerging on all sides now, watching him eagerly, pointing at his webbed hands and gills, talking behind their hands to one another.  Harry sped around a corner and a very strange sight met his eyes. A whole crowd of merpeople was floating in front of the houses that lined what looked like a mer-version of a village square.  A choir of merpeople was singing in the middle, calling the champions toward them, and behind them rose a crude sort of statue; a gigantic merperson hewn from a boulder.  Four people were bound tightly to the tail of the stone merperson. Ron was tied between Hermione and Cho Chang.  There was also a girl who looked no older than eight, whose clouds of silvery hair made Harry feel sure that she was Fleur Delacour's sister.  All four of them appeared to be in a very deep sleep.  Their heads were lolling onto their shoulders, and fine streams of bubbles kept issuing from their mouths. Harry sped toward the hostages, half expecting the merpeople to lower their spears and charge at him, but they did nothing.  The ropes of weed tying the hostages to the statue were thick, slimy, and very strong.  For a fleeting second he thought of the knife Sirius had bought him for Christmas - locked in his trunk in the castle a quarter of a mile away, no use to him whatsoever. He looked around.  Many of the merpeople surrounding them were carrying spears.  He swam swiftly toward a seven-foot-tall merman with a long green beard and a choker of shark fangs and tried to mime a request to borrow the spear.  The merman laughed and shook his head. \"We do not help,\" he said in a harsh, croaky voice. \"Come ON!\"  Harry said fiercely (but only bubbles issued from his mouth), and he tried to pull the spear away from the merman, but the merman yanked it back, still shaking his head and laughing."
}