{
  "id": "651a99064de9b4f21c01cb196e0ef1dc689ef0ce",
  "text": " Next, tell me what's always the last thing to mend, The middle of middle and end of the end? And finally give me the sound often heard During the search for a hard-to-find word. Now string them together, and answer me this, Which creature would you be unwilling to kiss?\"  Harry gaped at her. \"Could I have it again . . . more slowly?\" he asked tentatively.  She blinked at him, smiled, and repeated the poem.  \"All the clues add up to a creature I wouldn't want to kiss?\" Harry asked. She merely smiled her mysterious smile.  Harry took that for a \"yes.\"  Harry cast his mind around. There were plenty of animals he wouldn't want to kiss; his immediate thought was a Blast-Ended Skrewt, but something told him that wasn't the answer.  He'd have to try and work out the clues. . . . \"A person in disguise,\" Harry muttered, staring at her, \"who lies ... er ... that'd be a - an impostor.  No, that's not my guess!  A - a spy?  I'll come back to that. . . could you give me the next clue again, please?\" She repeated the next lines of the poem. \"'The last thing to mend,'\" Harry repeated. \"Er ... no idea . . . 'middle of middle' . . . could I have the last bit again?\" She gave him the last four lines. \"'The sound often heard during the search for a hard-to-find word,'\" said Harry.  \"Er . . . that'd be ... er ... hang on - 'er'!  Er's a sound!\" The sphinx smiled at him. \"Spy ... er ... spy ... er ...\" said Harry, pacing up and down. \"A creature I wouldn't want to kiss . . . a spider!\" The sphinx smiled more broadly.  She got up, stretched her front legs, and then moved aside for him to pass. \"Thanks!\" said Harry, and, amazed at his own brilliance, he dashed forward. He had to be close now, he had to be. ... His wand was telling him he was bang on course; as long as he didn't meet anything too horrible, he might have a chance. . . . Harry broke into a run.  He had a choice of paths up ahead. \"Point Me!\" he whispered again to his wand, and it spun around and pointed him to the right-hand one.  He dashed up this one and saw light ahead. The Triwizard Cup was gleaming on a plinth a hundred yards away.  Suddenly a dark figure hurtled out onto the path in front of him. Cedric was going to get there first.  Cedric was sprinting as fast as he could toward the cup, and Harry knew he would never catch up, Cedric was much taller, had much longer legs - Then Harry saw something immense over a hedge to his left, moving quickly along a path that intersected with his own; it was moving so fast Cedric was about to run into it, and Cedric, his eyes on the cup, had not seen it - \"Cedric!\" Harry bellowed. \"On your left!\" Cedric looked around just in time to hurl himself past the thing and avoid colliding with it, but in his haste, he tripped.  Harry saw Cedric's wand fly out of his hand as a gigantic spider stepped into the path and began to bear down upon Cedric. \"Stupefy!\" Harry yelled; the spell hit the spider's gigantic, hairy black body, but for all the good it did, he might as well have thrown a stone at it; the spider jerked, scuttled around, and ran at Harry instead. \"Stupefy!  Impedimenta!  Stupefy!\" But it was no use - the spider was either so large, or so magical, that the spells were doing no more than aggravating it.  Harry had one horrifying glimpse of eight shining black eyes and razor-sharp pincers before it was upon him. He was lifted into the air in its front legs; struggling madly, he tried to kick it; his leg connected with the pincers and next moment he was in excruciating pain. He could hear Cedric yelling \"Stupefy!\" too, but his spell had no more effect than Harry's - Harry raised his wand as the spider opened its pincers once more and shouted \"Expelliarmus!\" It worked - the Disarming Spell made the spider drop him, but that meant that Harry fell twelve feet onto his already injured leg, which crumpled beneath him.  Without pausing to think, he aimed high at the spider's underbelly, as he had done with the skrewt, and shouted \"Stupefy!''just as Cedric yelled the same thing. The two spells combined did what one alone had not:  The spider keeled over sideways, flattening a nearby hedge, and strewing the path with a tangle of hairy legs. \"Harry!\" he heard Cedric shouting. \"You all right? Did it fall on you?\" \"No,\" Harry called back, panting.  He looked down at his leg.  It was bleeding freely. He could see some sort of thick, gluey secretion from the spider's pincers on his torn robes.  He tried to get up, but his leg was shaking badly and did not want to support his weight.  He leaned against the hedge, gasping for breath, and looked around. Cedric was standing feet from the Triwizard Cup, which was gleaming behind him. \"Take it, then,\" Harry panted to Cedric. \"Go on, take it. You're there.\" But Cedric didn't move.  He merely stood there, looking at Harry.  Then he turned to stare at the cup.  Harry saw the longing expression on his face in its golden light.  Cedric looked around at Harry again, who was now holding onto the hedge to support himself."
}