{
  "id": "653619a1d7ab0f02088fbfc5010c48b8d2860083",
  "text": " 'Look, Aragorn! Did I not warn you?   ####-There is the old man.  All in dirty  grey  rags: that is why I could not see  him at first.'       Aragorn  looked and beheld a  bent figure moving slowly. It was not far  away. It looked like  an old beggar-man, walking wearily, leaning on a rough  staff. His head was bowed,  and he did not look towards them. In other lands  they would have greeted him with kind words; but now they stood silent, each  feeling a strange expectancy: something was  approaching that  held a hidden  power -or menace.       Gimli gazed with wide eyes for a while, as step by step the figure drew  nearer. Then suddenly, unable to contain himself longer, he burst out: 'Your   bow,  Legolas! Bend  it!  Get ready! It is Saruman. Do not let him speak, or  put a spell upon us! Shoot first!'       Legolas  took  his  bow and bent  it, slowly  and  as if some other will  resisted him. He held an arrow loosely in his hand but did not fit it to the  string. Aragorn stood silent, his face was watchful and intent.       'Why are  you waiting? What is the  matter with  you?' said Gimli in  a   hissing whisper.       'Legolas is right,' said Aragorn quietly. 'We may not  shoot an old man  so, at unawares and unchallenged, whatever fear or doubt be on us. Watch and  wait!'       At that moment the old man quickened  his pace and came with surprising  speed to the  foot of the  rock -wall. Then suddenly he looked up, while they   stood motionless looking down. There was no sound.       They  could not see his face: he was hooded, and above the hood he wore  a wide-brimmed hat, so that all his  features were over -shadowed, except for   the end  of his  nose and his grey beard. Yet it seemed  to  Aragorn that he  caught the gleam  of  eyes keen and bright  from  within  the shadow  of the  hooded brows.        At last the old man  broke the silence.  'Well met indeed , my friends,'  he said  in  a soft  voice. 'I wish to  speak to you. Will  you come down or   shall I come up?' Without waiting for an answer he began to climb.       'Now!' said Gimli. 'Stop him, Legolas!'       'Did I not say that I wished to speak to you?'  said the old man.  'Put  away that bow, Master Elf!'       The bow  and arrow fell from Legolas' hands, and his arms hung loose at  his sides.       'And you, Master Dwarf, pray  take your hand from your axe-haft, till I   ####-am up! You will not need such arguments. '       Gimli started and then stood still as stone, staring, while the old man  sprang up the rough steps as nimbly as a  goat. All weariness seemed to have  left him. As he stepped up on to the shelf there was a  gleam, too brief for  certainty, a quick glint  of  white, as if some garment shrouded by the grey  rags had been for an instant revealed The intake  of Gimli's breath could be  heard as a loud hiss in the silence.       'Well met, I say again!' said the old man, coming towards them. When he  was a few feet away, he stood, stooping over his staff, with his head thrust   forward, peering at them from under  his hood. 'And what may you be doing in  these  parts? An Elf, a Man, and  a Dwarf. all  clad  in  elvish fashion. No  doubt there is a tale worth hearing behind it all. Such things are not often  seen here.'       'You speak as one that knows Fangorn well,' said Aragorn. 'Is that so?'       'Not well,' said  the  old man: 'that would be the study of many lives.   But I come here now and again.'       'Might we know your name, and then hear what it is that you have to say  to us?'  said Aragorn. 'The morning passes, and we have an errand  that will  not wait.'       'As  for what I wished to say, I  have said it: What  may you be doing,  and  what  tale can  you tell of yourselves? As for my name!'  He broke off,   laughing  long  and  softly. Aragorn  felt a shudder run  through him at the  sound, a  strange  cold  thrill; and yet  it was not  fear or terror that he  felt: rather it was  like  the  sudden bite of a keen air,  or the slap of a   cold rain that wakes an uneasy sleeper.       'My name!' said the  old  man again. 'Have you not guessed it  already?   You have heard  it before, I  think. Yes, you have heard it before. But come  now, what of your tale?'       The three companions stood silent and made no answer.       'There are some who would begin to doubt whether your  errand is fit to  tell,' said the  old man. 'Happily I know something of it.  You are tracking  the footsteps of two young hobbits, I believe. Yes, hobbits. Don't stare, as  if you had  never heard the strange  name before. You have,  and so have  I.  Well, they climbed up  here  the day before yesterday; and  they met someone  that they did not expect. Does that comfort you? And  now  you would like to  know where they were taken? Well, well, maybe I can give you some news  about   ####-that.  But why are we standing? Your errand, you see, is no longer as urgent   as you thought. Let us sit down and be more at ease.'       The old man turned away  and went  towards a heap of fallen stones  and  rock at the  foot of the cliff  behind."
}