{
  "id": "6544bd021b4ae8d9f0a381322f9cdb58e42f4c40",
  "text": "  Theon held his hands two feet apart.  Daryn Hornwood came between us, and died for it.    Why do you tell me this?  Dagmer asked.  It was me who put your first sword in your hand. I know you are no craven.    Does my father?   The hoary old warrior looked as if he had bitten into something he did not like the taste of.  It is only… Theon, the Boy Wolf is your friend, and these Starks had you for ten years.    I am no Stark.  Lord Eddard saw to that.  I am a Greyjoy, and I mean to be my father’s heir. How can I do that unless I prove myself with some great deed?    You are young. Other wars will come, and you shall do your great deeds. For now, we are commanded to harry the Stony Shore.    Let my uncle Aeron see to it. I’ll give him six ships, all but Foamdrinker and Sea Bitch, and he can burn and drown to his god’s surfeit.    The command was given you, not Aeron Damphair.    So long as the harrying is done, what does it matter? No priest could do what I mean to, nor what I ask of you. I have a task that only Dagmer Cleftjaw can accomplish.   Dagmer took a long draught from his horn.  Tell me.   He is tempted, Theon thought. He likes this reaver’s work no better than I do.  If my sister can take a castle, so can I.    Asha has four or five times the men we do.   Theon allowed himself a sly smile.  But we have four times the wits, and five times the courage.    Your father—    —will thank me, when I hand him his kingdom. I mean to do a deed that the harpers will sing of for a thousand years.   He knew that would give Dagmer pause. A singer had made a song about the axe that cracked his jaw in half, and the old man loved to hear it. Whenever he was in his cups he would call for a reaving song, something loud and stormy that told of dead heroes and deeds of wild valor. His hair is white and his teeth are rotten, but he still has a taste for glory.   What would my part be in this scheme of yours, boy?  Dagmer Cleftjaw asked after a long silence, and Theon knew he had won.   To strike terror into the heart of the foe, as only one of your name could do. You’ll take the great part of our force and march on Torrhen’s Square. Helman Tallhart took his best men south, and Benfred died here with their sons. His uncle Leobald will remain, with some small garrison.  If I had been able to question Benfred, I would know just how small.  Make no secret of your approach. Sing all the brave songs you like. I want them to close their gates.    Is this Torrhen’s Square a strong keep?    Strong enough. The walls are stone, thirty feet high, with square towers at each corner and a square keep within.    Stone walls cannot be fired. How are we to take them? We do not have the numbers to storm even a small castle.    You will make camp outside their walls and set to building catapults and siege engines.    That is not the Old Way. Have you forgotten? Ironmen fight with swords and axes, not by flinging rocks. There is no glory in starving out a foeman.    Leobald will not know that. When he sees you raising siege towers, his old woman’s blood will run cold, and he will bleat for help. Stay your archers, Uncle, and let the raven fly. The castellan at Winterfell is a brave man, but age has stiffened his wits as well as his limbs. When he learns that one of his king’s bannermen is under attack by the fearsome Dagmer Cleftjaw, he will summon his strength and ride to Tallhart’s aid. It is his duty. Ser Rodrik is nothing if not dutiful.    Any force he summons will be larger than mine,  Dagmer said,  and these old knights are more cunning than you think, or they would never have lived to see their first grey hair. You set us a battle we cannot hope to win, Theon. This Torrhen’s Square will never fall.   Theon smiled.  It’s not Torrhen’s Square I mean to take.       ARYA  Confusion and clangor ruled the castle. Men stood on the beds of wagons loading casks of wine, sacks of flour, and bundles of new-fletched arrows. Smiths straightened swords, knocked dents from breastplates, and shoed destriers and pack mules alike. Mail shirts were tossed in barrels of sand and rolled across the lumpy surface of the Flowstone Yard to scour them clean. Weese’s women had twenty cloaks to mend, a hundred more to wash. The high and humble crowded into the sept together to pray. Outside the walls, tents and pavilions were coming down. Squires tossed pails of water over cookfires, while soldiers took out their oilstones to give their blades one last good lick. The noise was a swelling tide: horses blowing and whickering, lords shouting commands, men-at-arms trading curses, camp followers squabbling.  Lord Tywin Lannister was marching at last.  Ser Addam Marbrand was the first of the captains to depart, a day before the rest. He made a gallant show of it, riding a spirited red courser whose mane was the same copper color as the long hair that streamed past Ser Addam’s shoulders. The horse was barded in bronze-colored trappings dyed to match the rider’s cloak and emblazoned with the burning tree."
}