{
  "id": "657b84e6e0e416a1649cb15f59db071fb52628f3",
  "text": " The Stormcrows turned their cloaks, the slaves broke, and the Second Sons were too drunk to fight, just as you said. Two hundred dead, Yunkai’i for the most part. Their slaves threw down their spears and ran, and their sellswords yielded. We have several thousand captives.    Our own losses?    A dozen. If that many.   Only then did she allow herself to smile.  Rise, my good brave bear. Was Grazdan taken? Or the Titan’s Bastard?    Grazdan went to Yunkai to deliver your terms.  Ser Jorah got to his feet.  Mero fled, once he realized the Stormcrows had turned. I have men hunting him. He shouldn’t escape us long.    Very well,  Dany said.  Sellsword or slave, spare all those who will pledge me their faith. If enough of the Second Sons will join us, keep the company intact.   The next day they marched the last three leagues to Yunkai. The city was built of yellow bricks instead of red; elsewise it was Astapor all over again, with the same crumbling walls and high stepped pyramids, and a great harpy mounted above its gates. The wall and towers swarmed with crossbowmen and slingers. Ser Jorah and Grey Worm deployed her men, Irri and Jhiqui raised her pavilion, and Dany sat down to wait.  On the morning of the third day, the city gates swung open and a line of slaves began to emerge. Dany mounted her silver to greet them. As they passed, little Missandei told them that they owed their freedom to Daenerys Stormborn, the Unburnt, Queen of the Seven Kingdoms of Westeros and Mother of Dragons.   Mhysa!  a brown-skinned man shouted out at her. He had a child on his shoulder, a little girl, and she screamed the same word in her thin voice.  Mhysa! Mhysa!   Dany looked at Missandei.  What are they shouting?    It is Ghiscari, the old pure tongue. It means ‘Mother.’   Dany felt a lightness in her chest. I will never bear a living child, she remembered. Her hand trembled as she raised it. Perhaps she smiled. She must have, because the man grinned and shouted again, and others took up the cry.  Mhysa!  they called.  Mhysa! MHYSA!  They were all smiling at her, reaching for her, kneeling before her.  Maela,  some called her while others cried  Aelalla  or  Qathei  or  Tato,  but whatever the tongue it all meant the same thing. Mother. They are calling me Mother.  The chant grew, spread, swelled. It swelled so loud that it frightened her horse, and the mare backed and shook her head and lashed her silver-grey tail. It swelled until it seemed to shake the yellow walls of Yunkai. More slaves were streaming from the gates every moment, and as they came they took up the call. They were running toward her now, pushing, stumbling, wanting to touch her hand, to stroke her horse’s mane, to kiss her feet. Her poor bloodriders could not keep them all away, and even Strong Belwas grunted and growled in dismay.  Ser Jorah urged her to go, but Dany remembered a dream she had dreamed in the House of the Undying.  They will not hurt me,  she told him.  They are my children, Jorah.  She laughed, put her heels into her horse, and rode to them, the bells in her hair ringing sweet victory. She trotted, then cantered, then broke into a gallop, her braid streaming behind. The freed slaves parted before her.  Mother,  they called from a hundred throats, a thousand, ten thousand.  Mother,  they sang, their fingers brushing her legs as she flew by.  Mother, Mother, Mother!       Arya   When Arya saw the shape of a great hill looming in the distance, golden in the afternoon sun, she knew it at once. They had come all the way back to High Heart.  By sunset they were at the top, making camp where no harm could come to them. Arya walked around the circle of weirwood stumps with Lord Beric’s squire Ned, and they stood on top of one watching the last light fade in the west. From up here she could see a storm raging to the north, but High Heart stood above the rain. It wasn’t above the wind, though; the gusts were blowing so strongly that it felt like someone was behind her, yanking on her cloak. Only when she turned, no one was there.  Ghosts, she remembered. High Heart is haunted.  They built a great fire atop the hill, and Thoros of Myr sat crosslegged beside it, gazing deep into the flames as if there was nothing else in all the world.   What is he doing?  Arya asked Ned.   Sometimes he sees things in the flames,  the squire told her.  The past. The future. Things happening far away.   Arya squinted at the fire to see if she could see what the red priest was seeing, but it only made her eyes water and before long she turned away. Gendry was watching the red priest as well.  Can you truly see the future there?  he asked suddenly.  Thoros turned from the fire, sighing.  Not here. Not now. But some days, yes, the Lord of Light grants me visions.   Gendry looked dubious.  My master said you were a sot and a fraud, as bad a priest as there ever was.    That was unkind.  Thoros chuckled.  True, but unkind. Who was this master of yours? Did I know you, boy?    I was ’prenticed to the master armorer Tobho Mott, on the Street of Steel."
}