{
  "id": "65e146550af2c7cf854e6ee7000ed37497a01788",
  "text": " The wood crackled, louder and louder. Mirri Maz Duur began to sing in a shrill, ululating voice. The flames whirled and writhed, racing each other up the platform. The dusk shimmered as the air itself seemed to liquefy from the heat. Dany heard logs spit and crack. The fires swept over Mirri Maz Duur. Her song grew louder, shriller… then she gasped, again and again, and her song became a shuddering wail, thin and high and full of agony.  And now the flames reached her Drogo, and now they were all around him. His clothing took fire, and for an instant the khal was clad in wisps of floating orange silk and tendrils of curling smoke, grey and greasy. Dany’s lips parted and she found herself holding her breath. Part of her wanted to go to him as Ser Jorah had feared, to rush into the flames to beg for his forgiveness and take him inside her one last time, the fire melting the flesh from their bones until they were as one, forever.  She could smell the odor of burning flesh, no different than horseflesh roasting in a firepit. The pyre roared in the deepening dusk like some great beast, drowning out the fainter sound of Mirri Maz Duur’s screaming and sending up long tongues of flame to lick at the belly of the night. As the smoke grew thicker, the Dothraki backed away, coughing. Huge orange gouts of fire unfurled their banners in that hellish wind, the logs hissing and cracking, glowing cinders rising on the smoke to float away into the dark like so many newborn fireflies. The heat beat at the air with great red wings, driving the Dothraki back, driving off even Mormont, but Dany stood her ground. She was the blood of the dragon, and the fire was in her.  She had sensed the truth of it long ago, Dany thought as she took a step closer to the conflagration, but the brazier had not been hot enough. The flames writhed before her like the women who had danced at her wedding, whirling and singing and spinning their yellow and orange and crimson veils, fearsome to behold, yet lovely, so lovely, alive with heat. Dany opened her arms to them, her skin flushed and glowing. This is a wedding, too, she thought. Mirri Maz Duur had fallen silent. The godswife thought her a child, but children grow, and children learn.  Another step, and Dany could feel the heat of the sand on the soles of her feet, even through her sandals. Sweat ran down her thighs and between her breasts and in rivulets over her cheeks, where tears had once run. Ser Jorah was shouting behind her, but he did not matter anymore, only the fire mattered. The flames were so beautiful, the loveliest things she had ever seen, each one a sorcerer robed in yellow and orange and scarlet, swirling long smoky cloaks. She saw crimson firelions and great yellow serpents and unicorns made of pale blue flame; she saw fish and foxes and monsters, wolves and bright birds and flowering trees, each more beautiful than the last. She saw a horse, a great grey stallion limned in smoke, its flowing mane a nimbus of blue flame. Yes, my love, my sun-and-stars, yes, mount now, ride now.  Her vest had begun to smolder, so Dany shrugged it off and let it fall to the ground. The painted leather burst into sudden flame as she skipped closer to the fire, her breasts bare to the blaze, streams of milk flowing from her red and swollen nipples. Now, she thought, now, and for an instant she glimpsed Khal Drogo before her, mounted on his smoky stallion, a flaming lash in his hand. He smiled, and the whip snaked down at the pyre, hissing.  She heard a crack, the sound of shattering stone. The platform of wood and brush and grass began to shift and collapse in upon itself. Bits of burning wood slid down at her, and Dany was showered with ash and cinders. And something else came crashing down, bouncing and rolling, to land at her feet; a chunk of curved rock, pale and veined with gold, broken and smoking. The roaring filled the world, yet dimly through the firefall Dany heard women shriek and children cry out in wonder.  Only death can pay for life.  And there came a second crack, loud and sharp as thunder, and the smoke stirred and whirled around her and the pyre shifted, the logs exploding as the fire touched their secret hearts. She heard the screams of frightened horses, and the voices of the Dothraki raised in shouts of fear and terror, and Ser Jorah calling her name and cursing. No, she wanted to shout to him, no, my good knight, do not fear for me. The fire is mine. I am Daenerys Stormborn, daughter of dragons, bride of dragons, mother of dragons, don’t you see? Don’t you SEE? With a belch of flame and smoke that reached thirty feet into the sky, the pyre collapsed and came down around her. Unafraid, Dany stepped forward into the firestorm, calling to her children.  The third crack was as loud and sharp as the breaking of the world.  When the fire died at last and the ground became cool enough to walk upon, Ser Jorah Mormont found her amidst the ashes, surrounded by blackened logs and bits of glowing ember and the burnt bones of man and woman and stallion."
}