{
  "id": "661c4b2fb2bb635372eeac900c767471125a20aa",
  "text": "  \"Who shall we sit on first?\" said the voice.  \"Better sit on  the  last fellow first,\" said Bert, whose eye had been damaged by  Thorin. He thought Tom was talking.  \"Don't talk to yerself!\" said Tom. \"But if you wants to sit on the last one, sit on  him. Which is he?\"  \"The one with the yellow stockings,\" said Bert.  \"Nonsense, the one with the grey stockings,\" said a voice like William's.  \"I made sure it was yellow,\" said Bert.  \"Yellow it was,\" said William.  \"Then what did yer say it was grey for?\" said Bert.  \"I never did. Tom said it.\"  \"That I never did!\" said Tom. \"It was you.\"  \"Two to one, so shut yer mouth!\" said Bert.  \"Who are you a-talkin' to?\" said William.   ####-\"Now  stop  it!\"  said  Tom  and  Bert  together.  \"The  night's  gettin'  on,  and  dawn  comes early. Let's get on with it!\"  \"Dawn  take  you  all,  and  be  stone  to  you!\"  said  a  voice  that  sounded  like  William's. But  it wasn't. For  just  at  that moment  the  light  came over  the hill,  and  there  was  a  mighty  twitter  in  the  branches.  William  never  spoke  for  he  stood  turned  to  stone  as  he  stooped;  and  Bert  and  Tom  were  stuck  like  rocks  as  they  looked at him. And there they stand to this day,  all alone, unless the birds perch on  them; for trolls, as you probably know, must be underground before dawn, or they  go  back  to  the  stuff  of  the  mountains  they  are  made  of,  and  never  move  again.  That is what had happened to Bert and Tom and William.  \"Excellent!\"  said Gandalf, as he  stepped  from behind a  tree, and helped Bilbo  to  climb  down  out  of  a  thorn-bush.  Then  Bilbo  understood.  It  was  the  wizard's  voice  that  had  kept  the  trolls  bickering  and  quarrelling,  until  the  light  came  and  made an end of them.  The  next  thing  was  to  untie  the  sacks  and  let  out  the  dwarves.  They  were  nearly  suffocated,  and  very  annoyed:  they  had  not  at  all  enjoyed  lying  there  listening  to  the  trolls  making  plans  for  roasting  them  and  squashing  them  and  mincing  them.  They  had  to  hear  Bilbo's  account  of  what  had  happened  to  him  twice over, before they were satisfied.   \"Silly time to go practising pinching and pocket-picking,\" said Bombur, \"when  what we wanted was fire and food!\"  \"And  that's  just  what  you  wouldn't  have  got  of  those  fellows  without  a  struggle, in any case,\" said Gandalf.  \"Anyhow you are wasting time now. Don't you realize that the trolls must have  a cave or a hole dug  somewhere near  to hide  from  the  sun  in? We must  look  into  it!\"  They  searched  about,  and  soon  found  the  marks  of  trolls'  stony  boots  going  away  through  the  trees.  They  followed  the  tracks  up  the  hill,  until  hidden  by  bushes  they  came  on  a  big  door  of  stone  leading  to  a  cave.  But  they  could  not  open it, not though they all pushed while Gandalf tried various incantations.  \"Would  this  be  any  good?\"  asked  Bilbo,  when  they  were  getting  tired  and  angry.  \"I  found  it  on  the  ground  where  the  trolls  had  their  fight.\"  He  held  out  a  largish key, though no doubt William had thought it very small and secret. It must  have fallen out of his pocket, very luckily, before he was turned to stone.  \"Why on earth didn't you mention it before?\" they cried.  Gandalf  grabbed  it  and  fitted  it  into  the  key-hole. Then  the  stone door  swung  back  with  one  big  push,  and  they  all  went  inside.  There were  bones  on  the  floor   ####-and  a  nasty  smell  was  in  the  air;  but  there  was  a  good  deal  of  food  jumbled  carelessly  on  shelves  and  on  the  ground,  among  an  untidy  litter  of  plunder,  of  all  sorts from brass buttons to pots full of gold coins standing in a corner. There were  lots  of  clothes,  too,  hanging  on  the  walls-too  small  for  trolls,  I  am  afraid  they  belonged  to  victims-and  among  them  were  several  swords  of  various  makes,  shapes,  and  sizes.  Two  caught  their  eyes  particularly,  because  of  their  beautiful  scabbards  and  jewelled  hilts.  Gandalf  and  Thorin  each  took  one  of  these;  and  Bilbo took a knife in a leather sheath. It would have made only a tiny pocket-knife  for a troll, but it was as good as a short sword for the hobbit.  \"These look like good blades,\" said the wizard, half drawing them and looking  at them curiously. \"They were not made by any troll, nor by any smith among men  in  these  parts  and  days;  but when we  can  read  the  runes  on  them, we  shall  know  more about them.\"  \"Let's  get  out  of  this  horrible  smell!\"  said  Fili  So  they  carried  out  the  pots  of  coins, and such food as was un-touched and looked fit to eat, also one barrel of ale  which  was  still  full.  By  that  time  they  felt  like  breakfast,  and  being  very  hungry  they  did  not  turn  their  noses  up  at what  they had got  from  the  trolls'  larder. Their  own  provisions were  very  scanty."
}