{
  "id": "66cbf13be88d3aa7a52b167fd15371c240261428",
  "text": " Sylwa Paege, —Whalen’s son, HOSTER, a boy of twelve, a squire to Ser Damon Paege,  —Whalen’s daughter, MERIANNE, called MERRY, a girl of eleven,  —LADY MORYA, m. Ser Flement Brax, —Morya’s son, ROBERT BRAX, nine, fostered at Casterly Rock as a page,  —Morya’s son, WALDER BRAX, a boy of six,  —Morya’s son, JON BRAX, a babe of three,  —TYTA, called TYTA THE MAID, a maid of twenty-nine,      —by his fifth wife, {LADY SARYA of House Whent}: —no progeny,      —by his sixth wife, {LADY BETHANY of House Rosby}: —SER PERWYN, their eldest son,  —SER BENFREY, m. Jyanna Frey, a cousin, —Benfrey’s daughter, DELLA, called DEAF DELLA, a girl of three,  —Benfrey’s son, OSMUND, a boy of two,  —MAESTER WILLAMEN, in service at Longbow Hall,  —OLYVAR, squire to Robb Stark,  —ROSLIN, a maid of sixteen,      —by his seventh wife, {LADY ANNARA of House Farring}: —ARWYN, a maid of fourteen,  —WENDEL, their eldest son, a boy of thirteen, fostered at Seagard as a page,  —COLMAR, promised to the Faith, eleven,  —WALTYR, called TYR, a boy of ten,  —ELMAR, formerly betrothed to Arya Stark, a boy of nine,  —SHIREI, a girl of six,      —by his eighth wife, LADY JOYEUSE of House Erenford, —no progeny as yet,      —Lord Walder’s natural children, by sundry mothers, —WALDER RIVERS, called BASTARD WALDER, —Bastard Walder’s son, SER AEMON RIVERS,  —Bastard Walder’s daughter, WALDA RIVERS,  —MAESTER MELWYS, in service at Rosby,  —JEYNERIVERS, MARTYNRIVERS, RYGERRIVERS, RONELRIVERS, MELLARARIVERS, others.      HOUSE LANNISTER   The Lannisters of Casterly Rock remain the principal support of King Joffrey’s claim to the Iron Throne. They boast of descent from Lann the Clever, the legendary trickster of the Age of Heroes. The gold of Casterly Rock and the Golden Tooth has made them the wealthiest of the Great Houses. The Lannister sigil is a golden lion upon a crimson field. Their words are Hear Me Roar!      TYWIN LANNISTER, Lord of Casterly Rock, Warden of the West, Shield of Lannisport, and Hand of the King, —his son, SER JAIME, called THE KINGSLAYER, a twin to Queen Cersei, Lord Commander of the Kingsguard, and Warden of the East, a captive at Riverrun, —his daughter, QUEEN CERSEI, twin to Jaime, widow of King Robert I Baratheon, Queen Regent for her son Joffrey, —her son, KING JOFFREY BARATHEON, a boy of thirteen,  —her daughter, PRINCESS MYRCELLA BARATHEON, a girl of nine, a ward of Prince Doran Martell in Dorne,  —her son, PRINCE TOMMEN BARATHEON, a boy of eight, heir to the Iron Throne,  —his dwarf son, TYRION, called THE IMP, called HALFMAN, wounded and scarred on the Blackwater,    —his siblings: —SER KEVAN, Lord Tywin’s eldest brother, —Ser Kevan’s wife, DORNA, of House Swyft,  —their son, SER LANCEL, formerly a squire to King Robert, wounded and near death,  —their son, WILLEM, twin to Martyn, a squire, captive at Riverrun,  —their son, MARTYN, twin to Willem, a squire, a captive with Robb Stark,  —their daughter, JANEI, a girl of two,  —GENNA, his sister, wed to Ser Emmon Frey, —their son, SER CLEOS FREY, a captive at Riverrun,  —their son, SER LYONEL,  —their son, TION FREY, a squire, captive at Riverrun,  —their son, WALDER, called RED WALDER, a squire at Casterly Rock,  —{SER TYGETT}, his second brother, died of a pox, —Tygett’s widow, DARLESSA, of House Marbrand,  —their son, TYREK, squire to the king, missing,  —{GERION}, his youngest brother, lost at sea, —Gerion’s bastard daughter, JOY, eleven,      —his cousin, {SER STAFFORD LANNISTER}, brother to the late Lady Joanna, slain at Oxcross, —Ser Stafford’s daughters, CERENNA and MYRIELLE,  —Ser Stafford’s son, SER DAVEN,  —his cousins: —SER DAMION LANNISTER, m. Lady Shiera Crakehall, —his son, SER LUCION,  —his daughter, LANNA, m. Lord Antario Jast,  —MARGOT, m. Lord Titus Peake,      —his household: —MAESTER CREYLEN, healer, tutor, and counselor,  —VYLARR, captain-of-guards, —LUM and RED LESTER, guardsmen,  —WHITESMILE WAT, a singer,  —SER BENEDICT BROOM, master-at-arms,      —his lords bannermen: —DAMON MARBRAND, Lord of Ashemark, —SER ADDAM MARBRAND, his son and heir,  —ROLAND CRAKEHALL, Lord of Crakehall, —his brother, {SER BURTON CRAKEHALL}, killed by Lord Beric Dondarrion and his outlaws,  —his son and heir, SER TYBOLT CRAKEHALL,  —his second son, SER LYLE CRAKEHALL, called STRONGBOAR, a captive at Pinkmaiden Castle,  —his youngest son, SER MERLON CRAKEHALL,  —ANDROS BRAXI, Lord of Hornvale, drowned during the Battle of the Camps, —his brother, {SER RUPERT BRAX}, slain at Oxcross,  —his eldest son, SER TYTOS BRAX, now Lord of Hornvale, a captive at the Twins,  —his second son, {SER ROBERT BRAX}, slain at the Battle of the Fords,  —his third son, SER FLEMENT BRAX, now heir,  —{LORD LEO LEFFORD}, drowned at the Stone Mill,  —REGENARD ESTREN, Lord of Wyndhall, a captive at the Twins,  —GAWEN WESTERLING, Lord of the Crag, a captive at Seagard, —his wife, LADY SYBELL, of House Spicer, —her brother, SER ROLPH SPICER,  —her cousin, SER SAMWELL SPICER,  —their children: —SER RAYNALD WESTERLING,  —JEYNE, a maid of sixteen years,  —ELEYNA, a girl of twelve,  —ROLLAM, a boy of nine,    —LEWYS LYDDEN, Lord of the Deep Den,  —LORD ANTARIO JAST, a captive at Pinkmaiden Castle,  —LORD PHILIP PLUMM, —his sons, SER DENNIS PLUMM, SER PETER PLUMM, and SER HARWYN PLUMM, called HARDSTONE,  —QUENTEN BANEFORT, Lord of Banefort, a captive of Lord Jonos Bracken,  —his knights and captains: —SER HARYS SWYFT, good-father to Ser Kevan Lannister, —Ser Harys’s son, SER STEFFON SWYFT, —Ser Steffon’s daughter, JOANNA,  —Ser Harys’s daughter, SHIERLE, m."
}