{
  "id": "66dfe516ccfe3cf229f349600df5bf466aaa5c50",
  "text": " 'It's in day that  hobbits  must hide now, yes in day.'       `Oh come! ' said Sam.  'We must rest for a bit, even if we get up again  in the middle of the night. There'll still be hours of dark then time enough  for you to take us a long march, if you know the way.'   ####-     Gollum  reluctantly agreed  to  this, and  he  turned  back towards the  trees, working eastward for a  while along the straggling edges of the wood.   He would not rest on the ground so near the evil road, and after some debate  they  all climbed  up into  the  crotch of  a  large  holm-oak, whose  thick   branches springing together from  the trunk made a good  hiding-place and  a  fairly comfortable refuge.  Night fell and it grew altogether dark under the  canopy of the  tree.  Frodo and Sam drank a  little water and ate some bread  and dried fruit, but Gollum at once curled up and went to sleep. The hobbits  did not shut their eyes.       It must have been a little after midnight when Gollum woke up: suddenly  they were aware of his pale eyes unlidded gleaming at them. He  listened and  sniffed,  which seemed,  as  they had noticed before,  his  usual method  of  discovering the time of night.       'Are we rested? Have we had beautiful sleep?' he said. 'Let's go!'       'We aren't, and we haven't,' growled Sam. 'But we'll go if we must.'       Gollum dropped at once  from  the branches of the tree on to all fours,   and the hobbits followed more slowly.       As  soon  as they  were down they  went  on again  with Gollum leading,   eastwards, up the  dark sloping  land. They could see little,  for the night  was  now so deep that  they were  hardly aware of the  stems of trees before  they stumbled  against them. The ground  became more broken  and walking  was  more  difficult, but Gollum seemed in no  way troubled. He  led them through  thickets and wastes of brambles; sometimes round  the lip of a deep cleft or   dark pit, sometimes down into black bush-shrouded hollows and out again; but  if ever they went a little downward, always the further slope was longer and  steeper. They were climbing steadily. At their first  halt they looked back,  and they could  dimly perceive the roofs of the forest they   had left behind  lying like  a  vast  dense shadow, a darker night under the  dark blank sky.  There seemed to be a great  blackness looming slowly out of the East, eating   up the faint blurred stars. Later the sinking moon escaped from the pursuing  cloud, but it was ringed all about with a sickly yellow glare.       At last  Gollum  turned  to the hobbits. 'Day soon,' he  said. 'Hobbits  must hurry. Not safe to stay in the open in these places. Make haste! '       He quickened his pace, and they  followed him wearily.  Soon they began  to climb up on to a great hog-back of land. For the most part it was covered  with a thick growth of gorse and whortleberry, and  low tough thorns, though   ####-here and there clearings opened, the scars of recent fires. The gorse-bushes  became  more frequent  as they  got nearer the  top; very old and  tall they  were, gaunt and leggy below but thick above, and already  putting out yellow  flowers  that  glimmered in the gloom and gave a faint  sweet scent. So tall  were the spiny  thickets that the  hobbits could  walk upright  under  them,  passing through long dry aisles carpeted with a deep prickly mould.       On the further edge of this broad hill-back they stayed their march and   crawled for hiding  underneath a  tangled  knot  of  thorns.  Their  twisted  boughs, stooping to the ground, were overridden  by a clambering maze of old  briars. Deep inside there  was  a hollow hall, raftered with dead branch and  bramble, and roofed with the first leaves and  shoots  of spring. There they  lay for a  while, too tired yet to eat; and peering out through the holes in  the covert they watched for the slow growth of day.       But no  day  came, only a dead brown twilight. In the East  there was a   dull red glare under the lowering cloud: it  was not the red of dawn. Across  the tumbled lands between, the mountains of the Ephel D®ath frowned at  them,  black and shapeless below where night lay thick and did not pass away, above  with  jagged  tops  and edges outlined  hard and  menacing against the fiery  glow. Away to their right a great shoulder of the mountains  stood out, dark  and black amid the shadows, thrusting westward.       `Which way do we go from here?' asked Frodo. `Is that the opening of-of  the Morgul Valley, away over there beyond that black mass? '       `Need we think about it yet?' said Sam, `Surely we're not going to move  any more today, if day it is?'       `Perhaps not, perhaps not,' said Gollum.  `But we must go soon, to  the  Cross-roads.  Yes,  to  the  Cross-roads. That's the  way  over  ther e  yes,  Master.'       The red glare over Mordor  died  away. The twilight deepened  as  great  vapours rose in the East and crawled above them. Frodo and Sam took a little  food and then  lay down,  but Gollum was restless."
}