{
  "id": "675d2041881513458e4bbb5e98874c9c68b2e7ef",
  "text": "   And Arya, well… Ned’s visitors would oft mistake her for a stableboy if they rode into the yard unannounced. Arya was a trial, it must be said. Half a boy and half a wolf pup. Forbid her anything and it became her heart’s desire. She had Ned’s long face, and brown hair that always looked as though a bird had been nesting in it. I despaired of ever making a lady of her. She collected scabs as other girls collect dolls, and would say anything that came into her head. I think she must be dead too.  When she said that, it felt as though a giant hand were squeezing her chest.  I want them all dead, Brienne. Theon Greyjoy first, then Jaime Lannister and Cersei and the Imp, every one, every one. But my girls… my girls will…    The queen… she has a little girl of her own,  Brienne said awkwardly.  And sons too, of an age with yours. When she hears, perhaps she… she may take pity, and…    Send my daughters back unharmed?  Catelyn smiled sadly.  There is a sweet innocence about you, child. I could wish… but no. Robb will avenge his brothers. Ice can kill as dead as fire. Ice was Ned’s greatsword. Valyrian steel, marked with the ripples of a thousand foldings, so sharp I feared to touch it. Robb’s blade is dull as a cudgel compared to Ice. It will not be easy for him to get Theon’s head off, I fear. The Starks do not use headsmen. Ned always said that the man who passes the sentence should swing the blade, though he never took any joy in the duty. But I would, oh, yes.  She stared at her scarred hands, opened and closed them, then slowly raised her eyes.  I’ve sent him wine.    Wine?  Brienne was lost.  Robb? Or… Theon Greyjoy?    The Kingslayer.  The ploy had served her well with Cleos Frey. I hope you’re thirsty, Jaime. I hope your throat is dry and tight.  I would like you to come with me.    I am yours to command, my lady.    Good.  Catelyn rose abruptly.  Stay, finish your meal in peace. I will send for you later. At midnight.    So late, my lady?    The dungeons are windowless. One hour is much like another down there, and for me, all hours are midnight.  Her footsteps rang hollowly when Catelyn left the hall. As she climbed to Lord Hoster’s solar, she could hear them outside, shouting,  Tully!  and  A cup! A cup to the brave young lord!  My father is not dead, she wanted to shout down at them. My sons are dead, but my father lives, damn you all, and he is your lord still.  Lord Hoster was deep in sleep.  He had a cup of drearnwine not so long ago, my lady,  Maester Vyman said.  For the pain. He will not know you are here.    It makes no matter,  Catelyn said. He is more dead than alive, yet more alive than my poor sweet sons.   My lady, is there aught I might do for you? A sleeping draught, perhaps?    Thank you, Maester, but no. I will not sleep away my grief. Bran and Rickon deserve better from me. Go and join the celebration, I will sit with my father for a time.    As you will, my lady.  Vyman bowed and left her.  Lord Hoster lay on his back, mouth open, his breath a faint whistling sigh. One hand hung over the edge of the mattress, a pale frail fleshless thing, but warm when she touched it. She slid her fingers through his and closed them. No matter how tightly I hold him, I cannot keep him here, she thought sadly. Let him go. Yet her fingers would not seem to unbend.   I have no one to talk with, Father,  she told him.  I pray, but the gods do not answer.  Lightly she kissed his hand. The skin was warm, blue veins branching like rivers beneath his pale translucent skin. Outside the greater rivers flowed, the Red Fork and the Tumblestone, and they would flow forever, but not so the rivers in her father’s hand. Too soon that current would grow still.  Last night I dreamed of that time Lysa and I got lost while riding back from Seagard. Do you remember? That strange fog came up and we fell behind the rest of the party. Everything was grey, and I could not see a foot past the nose of my horse. We lost the road. The branches of the trees were like long skinny arms reaching out to grab us as we passed. Lysa started to cry, and when I shouted the fog seemed to swallow the sound. But Petyr knew where we were, and he rode back and found us…   But there’s no one to find me now, is there? This time I have to find our own way, and it is hard, so hard.   I keep remembering the Stark words. Winter has come, Father. For me. For me. Robb must fight the Greyjoys now as well as the Lannisters, and for what? For a gold hat and an iron chair? Surely the land has bled enough. I want my girls back, I want Robb to lay down his sword and pick some homely daughter of Walder Frey to make him happy and give him sons. I want Bran and Rickon back, I want…  Catelyn hung her head.  I want,  she said once more, and then her words were gone.  After a time the candle guttered and went out. Moonlight slanted between the slats of the shutters, laying pale silvery bars across her father’s face. She could hear the soft whisper of his labored breathing, the endless rush of waters, the faint chords of some love song drifting up from the yard, so sad and sweet."
}