{
  "id": "678bb6af150c2a395643964566ba1ce3da2fc39b",
  "text": "'       Saruman rose to his feet, and stared at Frodo. There was a strange look   in his  eyes of mingled wonder and  respect and  hatred.  'You  have  grown,  Halfling,' he said. 'Yes, you have grown very much. You are wise, and cruel.  You  have  robbed  my revenge of  sweetness,  and  now  I must go  hence  in  bitterness, in debt to your mercy.  I hate it and you! Well, I go and I will  trouble you no more. But do  not expect me to wish you health and long life.  You will have neither. But that is not my doing. I merely foretell.'       He walked away, and  the hobbits made a lane for him to pass; but their  knuckles whitened as  they gripped  on their  weapons. Wormtongue hesitated,  and then followed his master.       'Wormtongue!' called Frodo. 'You need not follow him. I know of no evil   you have done to me. You can  have rest and food here for a while, until you   are stronger and can go your own ways.'       Wormtongue  halted  and  looked  back at  him, half  prepared  to  stay.  Saruman turned.  'No evil?'  he  cackled. 'Oh no! Even when he sneaks out at  night it is only to look at the stars. But did I hear someone ask where poor   Lotho is hiding? You know, don't you, Worm? Will you tell them?'       Wormtongue cowered down and whimpered: 'No, no!'       'Then I  will,'  said Saruman.  'Worm killed  your  Chief,  poor little   ####-fellow, your nice little Boss. Didn't you, Worm? Stabbed him in his sleep, I  believe.  Buried him, I hope;  though Worm has been very hungry lately.  No,  Worm is not really nice. You had better leave him to me.'       A look of wild hatred came into Wormtongue's red eyes. 'You told me to;   you made me do it,' he hissed.       Saruman laughed. 'You do what Sharkey says,  always, don't  you,  Worm?   Well,  now  he  says:  follow!'  He  kicked  Wormtongue in  the face  as  he  grovelled, and  turned and made off. But at that something snapped: suddenly  Wormtongue rose up, drawing a hidden knife, and then with a snarl like a dog  he sprang on Saruman's back, jerked his head back, cut his throat, and  with  a yell  ran off  down the lane. Before Frodo could recover or  speak a word,  three hobbit-bows twanged and Wormtongue fell dead.       To the dismay of those that stood by, about the  body of Saruman a grey  mist gathered, and  rising slowly to a great height like smoke  from a fire,  as a pale shrouded  figure it loomed over the Hill. For a moment it wavered,   looking to the West; but out of the West came a cold wind, and it bent away,   and with a sigh dissolved into nothing.       Frodo looked down at the body with pity and horror, for as he looked it  seemed that long years of death were suddenly revealed in it, and it shrank,  and the shrivelled face became rags of skin upon a hideous skull. Lifting up  the skirt  of the dirty cloak  that sprawled beside  it, he covered it over,  and turned away.       'And  that's  the end of that,'  said Sam. 'A nasty end,  and I  wish I  needn't have seen it; but it's a good riddance.'       'And the very last end of the War, I hope,' said Merry.       'I hope so,' said Frodo and sighed. 'The very last stroke. But to think   that it  should fall here, at the very  door  of Bag End! Among all my hopes  and fears at least I never expected that.'       'I shan't call it  the end, till we've cleared  up  the mess,' said Sam  gloomily. 'And that'll take a lot of time and work.'     ####-   Chapter 9. The Grey Havens            The clearing up certainly needed a lot of work, but  it took  less time  than Sam had feared. The day  after the battle Frodo  rode to Michel Delving  and released the prisoners from  the Lockholes. One  of the first  that they  found was  poor Fredegar Bolger, Fatty no longer. He had been taken when the  ruffians smoked  out a band of rebels that  he  led from their hidings up in  the Brockenbores by the hills of Scary.       'You  would have  done better  to  come with us  after  all,  poor  old  Fredegar!' said Pippin, as they carried him out too weak to walk.       He opened an eye and tried gallantly to  smile. 'Who's this young giant   with the loud voice?' he  whispered. 'Not little Pippin! What's your size in  hats now?'       Then  there  was Lobelia. Poor thing, she looked very old and thin when  they rescued her  from a dark and narrow  cell. She insisted on hobbling out  on her own feet; and she had such a welcome, and there was such clapping and  cheering when she appeared,  leaning on Frodo's arm but still clutching  her   umbrella, that she was quite touched, and drove away in tears. She had never  in her life been popular before. But she was crushed  by the news of  Lotho's  murder, and she would' not return to Bag End. She gave it back to Frodo, and  went to her own people, the Bracegirdles of Hardbottle.       When the poor  creature died next Spring-she  was after all more than a   hundred years  old  - Frodo was  surprised and much  moved: she had left all   that remained of her money and of Lotho's for him to use in helping  hobbits  made homeless by the troubles."
}