{
  "id": "6795f195162cae52b266f0e30b519f6a6b4786d8",
  "text": "  I hope you are right, child,  he sighed, in tones that said she was wrong.  The sun was well to the west by the time the slope began to flatten beneath the hooves of their horses. The road widened and grew straight, and for the first time Catelyn noticed wildflowers and grasses growing. Once they reached the valley floor, the going was faster and they made good time, cantering through verdant greenwoods and sleepy little hamlets, past orchards and golden wheat fields, splashing across a dozen sunlit streams. Her uncle sent a standard-bearer ahead of them, a double banner flying from his staff; the moon-and-falcon of House Arryn on high, and below it his own black fish. Farm wagons and merchants’ carts and riders from lesser houses moved aside to let them pass.  Even so, it was full dark before they reached the stout castle that stood at the foot of the Giant’s Lance. Torches flickered atop its ramparts, and the horned moon danced upon the dark waters of its moat. The drawbridge was up and the portcullis down, but Catelyn saw lights burning in the gatehouse and spilling from the windows of the square towers beyond.   The Gates of the Moon,  her uncle said as the party drew rein. His standard-bearer rode to the edge of the moat to hail the men in the gatehouse.  Lord Nestor’s seat. He should be expecting us. Look up.   Catelyn raised her eyes, up and up and up. At first all she saw was stone and trees, the looming mass of the great mountain shrouded in night, as black as a starless sky. Then she noticed the glow of distant fires well above them; a tower keep, built upon the steep side of the mountain, its lights like orange eyes staring down from above. Above that was another, higher and more distant, and still higher a third, no more than a flickering spark in the sky. And finally, up where the falcons soared, a flash of white in the moonlight. Vertigo washed over her as she stared upward at the pale towers, so far above.   The Eyrie,  she heard Marillion murmur, awed.  The sharp voice of Tyrion Lannister broke in.  The Arryns must not be overfond of company. If you’re planning to make us climb that mountain in the dark, I’d rather you kill me here.    We’ll spend the night here and make the ascent on the morrow,  Brynden told him.   I can scarcely wait,  the dwarf replied.  How do we get up there? I’ve no experience at riding goats.    Mules,  Brynden said, smiling.   There are steps carved into the mountain,  Catelyn said. Ned had told her about them when he talked of his youth here with Robert Baratheon and Jon Arryn.  Her uncle nodded.  It is too dark to see them, but the steps are there. Too steep and narrow for horses, but mules can manage them most of the way. The path is guarded by three waycastles, Stone and Snow and Sky. The mules will take us as far up as Sky.   Tyrion Lannister glanced up doubtfully.  And beyond that?   Brynden smiled.  Beyond that, the path is too steep even for mules. We ascend on foot the rest of the way. Or perchance you’d prefer to ride a basket. The Eyrie clings to the mountain directly above Sky, and in its cellars are six great winches with long iron chains to draw supplies up from below. If you prefer, my lord of Lannister, I can arrange for you to ride up with the bread and beer and apples.   The dwarf gave a bark of laughter.  Would that I were a pumpkin,  he said.  Alas, my lord father would no doubt be most chagrined if his son of Lannister went to his fate like a load of turnips. If you ascend on foot, I fear I must do the same. We Lannisters do have a certain pride.    Pride?  Catelyn snapped. His mocking tone and easy manner made her angry.  Arrogance, some might call it. Arrogance and avarice and lust for power.    My brother is undoubtedly arrogant,  Tyrion Lannister replied.  My father is the soul of avarice, and my sweet sister Cersei lusts for power with every waking breath. I, however, am innocent as a little lamb. Shall I bleat for you?  He grinned.  The drawbridge came creaking down before she could reply, and they heard the sound of oiled chains as the portcullis was drawn up. Men-at-arms carried burning brands out to light their way, and her uncle led them across the moat. Lord Nestor Royce, High Steward of the Vale and Keeper of the Gates of the Moon, was waiting in the yard to greet them, surrounded by his knights.  Lady Stark,  he said, bowing. He was a massive, barrel-chested man, and his bow was clumsy.  Catelyn dismounted to stand before him.  Lord Nestor,  she said. She knew the man only by reputation; Bronze Yohn’s cousin, from a lesser branch of House Royce, yet still a formidable lord in his own right.  We have had a long and tiring journey. I would beg the hospitality of your roof tonight, if I might.    My roof is yours, my lady,  Lord Nestor returned gruffly,  but your sister the Lady Lysa has sent down word from the Eyrie. She wishes to see you at once. The rest of your party will be housed here and sent up at first light.   Her uncle swung off his horse."
}