{
  "id": "6809a083e8038b8a8ac3ebf5a93a670e41819cd5",
  "text": "  Very well, you’ve seen it. You may return to your duties now. And remember what I said. Your brothers will chose a Lord Commander tonight, or I shall make them wish they had.   Maester Aemon was lost in thought as Sam helped him down the narrow turnpike stair. But as they were crossing the yard, he said,  I felt no heat. Did you, Sam?    Heat? From the sword?  He thought back.  The air around it was shimmering, the way it does above a hot brazier.    Yet you felt no heat, did you? And the scabbard that held this sword, it is wood and leather, yes? I heard the sound when His Grace drew out the blade. Was the leather scorched, Sam? Did the wood seem burnt or blackened?    No,  Sam admitted.  Not that I could see.   Maester Aemon nodded. Back in his own chambers, he asked Sam to set a fire and help him to his chair beside the hearth.  It is hard to be so old,  he sighed as he settled onto the cushion.  And harder still to be so blind. I miss the sun. And books. I miss books most of all.  Aemon waved a hand.  I shall have no more need of you till the choosing.    The choosing… Maester, isn’t there something you could do? What the king said of Lord Janos…    I recall,  Maester Aemon said,  but Sam, I am a maester, chained and sworn. My duty is to counsel the Lord Commander, whoever he might be. It would not be proper for me to be seen to favor one contender over another.    I’m not a maester,  said Sam.  Could I do something?   Aemon turned his blind white eyes toward Sam’s face, and smiled softy.  Why, I don’t know, Samwell. Could you?   I could, Sam thought. I have to. He had to do it right away, too. If he hesitated he was certain to lose his courage. I am a man of the Night’s Watch, he reminded himself as he hurried across the yard. I am. I can do this. There had been a time when he had quaked and squeaked if Lord Mormont so much as looked at him, but that was the old Sam, before the Fist of the First Men and Craster’s Keep, before the wights and Coldhands, and the Other on his dead horse. He was braver now. Gilly made me braver, he’d told Jon. It was true. It had to be true.  Cotter Pyke was the scarier of the two commanders, so Sam went to him first, while his courage was still hot. He found him in the old Shieldhall, dicing with three of his Eastwatch men and a red-headed sergeant who had come from Dragonstone with Stannis.  When Sam begged leave to speak with him, though, Pyke barked an order, and the others took the dice and coins and left them.  No man would ever call Cotter Pyke handsome, though the body under his studded brigantine and roughspun breeches was lean and hard and wiry strong. His eyes were small and close-set, his nose broken, his widow’s peak as sharply pointed as the head of a spear. The pox had ravaged his face badly, and the beard he’d grown to hide the scars was thin and scraggly.   Sam the Slayer!  he said, by way of greeting.  Are you sure you stabbed an Other, and not some child’s snow knight?   This isn’t starting well.  It was the dragonglass that killed it, my lord,  Sam explained feebly.   Aye, no doubt. Well, out with it, Slayer. Did the maester send you to me?    The maester?  Sam swallowed.  I… I just left him, my lord.  That wasn’t truly a lie, but if Pyke chose to read it wrong, it might make him more inclined to listen. Sam took a deep breath and launched into his plea.  Pyke cut him off before he’d said twenty words.  You want me to kneel down and kiss the hem of Mallister’s pretty cloak, is that it? I might have known. You lordlings all flock like sheep. Well, tell Aemon that he’s wasted your breath and my time. If anyone withdraws it should be Mallister. The man’s too bloody old for the job, maybe you ought to go tell him that. We choose him, and we’re like to be back here in a year, choosing someone else.    He’s old,  Sam agreed,  but he’s well ex-experienced.    At sitting in his tower and fussing over maps, maybe. What does he plan to do, write letters to the wights? He’s a knight, well and good, but he’s not a fighter, and I don’t give a kettle of piss who he unhorsed in some fool tourney fifty years ago. The Halfhand fought all his battles, even an old blind man should see that. And we need a fighter more than ever with this bloody king on top of us. Today it’s ruins and empty fields, well and good, but what will His Grace want come the morrow? You think Mallister has the belly to stand up to Stannis Baratheon and that red bitch?  He laughed.  I don’t.    You won’t support him, then?  said Sam, dismayed.   Are you Sam the Slayer or Deaf Dick? No, I won’t support him.  Pyke jabbed a finger at his face.  Understand this, boy. I don’t want the bloody job, and never did. I fight best with a deck beneath me, not a horse, and Castle Black is too far from the sea. But I’ll be buggered with a red-hot sword before I turn the Night’s Watch over to that preening eagle from the Shadow Tower. And you can run back to the old man and tell him I said so, if he asks.  He stood."
}