{
  "id": "682162032b8e0c336971233035024e355de659a2",
  "text": " 'Not alone!'       'Come, come!' said Gandalf. 'We are all friends here. Or should be; for   the laughter  of Mordor will be our only reward, if we quarrel. My errand is  pressing.  Here at least is  my sword, goodman Hbma. Keep it well. Glamdring  it  is  called,  for the Elves made  it long ago.  Now  let me  pass.  Come,  Aragorn!'       Slowly Aragorn unbuckled  his belt  and  himself set  his sword upright  against the wall. 'Here I set it,' he  said; 'but I command you not to touch  it, nor to  permit any other to lay hand on  it. In this elvish heath dwells  the Blade  that was Broken and has been made again. Telchar first wrought it  in the deeps of time. Death shall come to any man that draws Elendil's sword  save Elendil's heir.'       The guard stepped back and looked with  amazement on Aragorn. 'It seems  that you are come on the wings  of song out of the forgotten days he said. It  shall be, lord, as you command.       'Well,' said Gimli, 'if it  has And®ril to keep it company, my  axe may   ####-stay here, too, without shame'; and  he laid it on the floor. 'Now then,  if  all is as you wish, let us go and speak with your master.'       The guard still  hesitated. 'Your staff,' he  said to Gandalf. 'Forgive  me, but that too must be left at the doors.'       'Foolishness!' said Gandalf. 'Prudence is one thing, but discourtesy is  another. I am old. If I may  not  lean on my stick  as I go, then I will sit  out here, until it pleases Thjoden to hobble out himself to speak with me.'       Aragorn laughed. 'Every man has something too dear to trust to another.  But  would you  part an old  man from his suppor t? Come, will you not let us  enter?'       'The staff  in the hand of a wizard may  be more  than a prop for  age'  said Hbma. He looked hard at  the ash -staff on which Gandalf leaned. 'Yet in  doubt a man of worth will trust to his own wisdom. I believe you are friends  and folk worthy of honour, who have no evil purpose. You may go in.'       The guards now lifted the heavy bars of the doors and swung them slowly  inwards grumbling on  their great hinges. The travellers entered. Inside  it  seemed  dark and warm after the clear air  upon the hill.  The hall was long  and wide and filled  with shadows and half lights; mighty pillars upheld its  lofty roof. But  here and there bright  sunbeams fell  in glimmering  shafts  from  the  eastern windows, high under the deep eaves. Through the louver in  the roof, above the thin wisps  of  issuing smoke,  the sky showed  pale and  blue.  As their  eyes changed, the travellers  perceived  that the floor was  paved  with  stones  of  many  hues;  branching  runes  and strange  devices  intertwined  beneath their feet. They  saw now that  the pillars were richly  carved,  gleaming dully with gold and half-seen  colours.  Many woven cloths  were hung upon  the  walls,  and over their  wide spaces  marched figures of  ancient legend, some  dim with years,  some darkling in the shade. But  upon  one form the sunlight fell: a young man upon a white horse. He was blowing a   great horn, and his yellow hair was flying in the wind. The horse's head was  lifted,  and its  nostrils were wide and red  as it neighed, smelling battle  afar. Foaming water, green and white, rushed and curled about its knees.       'Behold  Eorl the Young!'  said Aragorn. 'Thus he rode out of the North  to the Battle of the Field of Celebrant.'       Now the four companions  went forward, past the clear wood-fire burning  upon the long hearth in  the midst of the hall. Then they halted. At the far  end of the house, beyond the hearth and facing north towards  the doors, was  a dais with three steps; and  in the  middle of the dais was a great  gilded   ####-chair. Upon it sat a man so bent with age that he seemed almost a dwarf; but  his white  hair was  long and thick and fell  in great braids from beneath a   thin golden circle set upon his brow.  In the centre upon his forehead shone  a single white diamond. His beard was laid like snow upon his knees; but his  eyes  still  burned  with  a bright  light,  glinting  as  he  gazed at  the  strangers. Behind his  chair  stood  a woman clad in white. At his feet upon  the  steps sat  a  wizened  figure of a  man,  with  a  pale  wise face  and  heavy-lidded eyes.        There was a silence. The old  man  did not move in his chair. At length  Gandalf spoke.  'Hail, Thjoden son of Thengel!  I have returned. For behold!   the  storm  comes,  and now all  friends should  gather together,  lest each  singly be destroyed.'       Slowly the old man rose to his feet, leaning heavily upon a short black   staff  with a handle of  white bone; and now  the strangers  saw that,  bent  though he was, he was still tall and must in youth  have been high and proud  indeed.       'I greet you,'  he said,  'and maybe you look for welcome. But truth to  tell your welcome is  doubtful here,  Master Gandalf.  You have ever  been a   herald  of  woe. Troubles follow you like crows,  and ever  the oftener  the  worse."
}