{
  "id": "682fbfee1860928c1bdd6e53b79810d46a13a601",
  "text": "  And when you have it, what then? Some secrets are safer kept hidden. Some secrets are too dangerous to share, even with those you love and trust. Ned slid the dagger that Catelyn had brought him out of the sheath on his belt. The Imp’s knife. Why would the dwarf want Bran dead? To silence him, surely. Another secret, or only a different strand of the same web?  Could Robert be part of it? He would not have thought so, but once he would not have thought Robert could command the murder of women and children either. Catelyn had tried to warn him. You knew the man, she had said. The king is a stranger to you. The sooner he was quit of King’s Landing, the better. If there was a ship sailing north on the morrow, it would be well to be on it.  He summoned Vayon Poole again and sent him to the docks to make inquiries, quietly but quickly.  Find me a fast ship with a skilled captain,  he told the steward.  I care nothing for the size of its cabins or the quality of its appointments, so long as it is swift and safe. I wish to leave at once.   Poole had no sooner taken his leave than Tomard announced a visitor.  Lord Baelish to see you, m’lord.   Ned was half-tempted to turn him away, but thought better of it. He was not free yet; until he was, he must play their games.  Show him in, Tom.   Lord Petyr sauntered into the solar as if nothing had gone amiss that morning. He wore a slashed velvet doublet in cream-and-silver, a grey silk cloak trimmed with black fox, and his customary mocking smile.  Ned greeted him coldly.  Might I ask the reason for this visit, Lord Baelish?    I won’t detain you long, I’m on my way to dine with Lady Tanda. Lamprey pie and roast suckling pig. She has some thought to wed me to her younger daughter, so her table is always astonishing. If truth be told, I’d sooner marry the pig, but don’t tell her. I do love lamprey pie.    Don’t let me keep you from your eels, my lord,  Ned said with icy disdain.  At the moment, I cannot think of anyone whose company I desire less than yours.    Oh, I’m certain if you put your mind to it, you could come up with a few names. Varys, say. Cersei. Or Robert. His Grace is most wroth with you. He went on about you at some length after you took your leave of us this morning. The words insolence and ingratitude came into it frequently, I seem to recall.   Ned did not honor that with a reply. Nor did he offer his guest a seat, but Littlefinger took one anyway.  After you stormed out, it was left to me to convince them not to hire the Faceless Men,  he continued blithely.  Instead Varys will quietly let it be known that we’ll make a lord of whoever does in the Targaryen girl.   Ned was disgusted.  So now we grant titles to assassins.   Littlefinger shrugged.  Titles are cheap. The Faceless Men are expensive. If truth be told, I did the Targaryen girl more good than you with all your talk of honor. Let some sellsword drunk on visions of lordship try to kill her. Likely he’ll make a botch of it, and afterward the Dothraki will be on their guard. If we’d sent a Faceless Man after her, she’d be as good as buried.   Ned frowned.  You sit in council and talk of ugly women and steel kisses, and now you expect me to believe that you tried to protect the girl? How big a fool do you take me for?    Well, quite an enormous one, actually,  said Littlefinger, laughing.   Do you always find murder so amusing, Lord Baelish?    It’s not murder I find amusing, Lord Stark, it’s you. You rule like a man dancing on rotten ice. I daresay you will make a noble splash. I believe I heard the first crack this morning.    The first and last,  said Ned.  I’ve had my fill.    When do you mean to return to Winterfell, my lord?    As soon as I can. What concern is that of yours?    None… but if perchance you’re still here come evenfall, I’d be pleased to take you to this brothel your man Jory has been searching for so ineffectually.  Littlefinger smiled.  And I won’t even tell the Lady Catelyn.       CATELYN   My lady, you should have sent word of your coming,  Ser Donnel Waynwood told her as their horses climbed the pass.  We would have sent an escort. The high road is not as safe as it once was, for a party as small as yours.    We learned that to our sorrow, Ser Donnel,  Catelyn said. Sometimes she felt as though her heart had turned to stone; six brave men had died to bring her this far, and she could not even find it in her to weep for them. Even their names were fading.  The clansmen harried us day and night. We lost three men in the first attack, and two more in the second, and Lannister’s serving man died of a fever when his wounds festered. When we heard your men approaching, I thought us doomed for certain.  They had drawn up for a last desperate fight, blades in hand and backs to the rock. The dwarf had been whetting the edge of his axe and making some mordant jest when Bronn spotted the banner the riders carried before them, the moon-and-falcon of House Arryn, sky-blue and white. Catelyn had never seen a more welcome sight."
}