{
  "id": "6869f8c1d51f20d613b7762821ccdfe7e9fa7f50",
  "text": " Harry jumped; he had almost forgotten that the Dursleys were there. Uncle Vernon certainly seemed to have got back his courage. He was glaring at Hagrid and his fists were clenched.  \"Now, you listen here, boy,\" he snarled, \"I accept there's something strange about you, probably nothing a good beating wouldn't have cured -- and as for all this about your parents, well, they were weirdos, no denying it, and the world's better off without them in my opinion -- asked for all they got, getting mixed up with these wizarding types -- just what I expected, always knew they'd come to a sticky end --\"  But at that moment, Hagrid leapt from the sofa and drew a battered pink umbrella from inside his coat. Pointing this at Uncle Vernon like a sword, he said, \"I'm warning you, Dursley -I'm warning you -- one more word... \"  In danger of being speared on the end of an umbrella by a bearded giant, Uncle Vernon's courage failed again; he flattened himself against the wall and fell silent.  \"That's better,\" said Hagrid, breathing heavily and sitting back down on the sofa, which this time sagged right down to the floor.  Harry, meanwhile, still had questions to ask, hundreds of them.  \"But what happened to Vol--, sorry -- I mean, You-Know-Who?\"  \"Good question, Harry. Disappeared. Vanished. Same night he tried ter kill you. Makes yeh even more famous. That's the biggest myst'ry, see... he was gettin' more an' more powerful -- why'd he go?  \"Some say he died. Codswallop, in my opinion. Dunno if he had enough human left in him to die. Some say he's still out there, bidin' his time, like, but I don' believe it. People who was on his side came back ter ours. Some of 'em came outta kinda trances. Don~ reckon they could've done if he was comin' back.  \"Most of us reckon he's still out there somewhere but lost his powers. Too weak to carry on. 'Cause somethin' about you finished him, Harry. There was somethin' goin' on that night he hadn't counted on -- I dunno what it was, no one does -- but somethin' about you stumped him, all right.\"  Hagrid looked at Harry with warmth and respect blazing in his eyes, but Harry, instead of feeling pleased and proud, felt quite sure there had been a horrible mistake. A wizard? Him? How could he possibly be? He'd spent his life being clouted by Dudley, and bullied by Aunt Petunia and Uncle Vernon; if he was really a wizard, why hadn't they been turned into warty toads every time they'd tried to lock him in his cupboard? If he'd once defeated the greatest sorcerer in the world, how come Dudley had always been able to kick him around like a football?  \"Hagrid,\" he said quietly, \"I think you must have made a mistake. I don't think I can be a wizard.\"  To his surprise, Hagrid chuckled.  \"Not a wizard, eh? Never made things happen when you was scared or angry?\"  Harry looked into the fire. Now he came to think about it... every odd thing that had ever made his aunt and uncle furious with him had happened when he, Harry, had been upset or angry... chased by Dudley's gang, he had somehow found himself out of their reach... dreading going to school with that ridiculous haircut, he'd managed to make it grow back... and the very last time Dudley had hit him, hadn't he got his revenge, without even realizing he was doing it? Hadn't he set a boa constrictor on him?  Harry looked back at Hagrid, smiling, and saw that Hagrid was positively beaming at him.  \"See?\" said Hagrid. \"Harry Potter, not a wizard -- you wait, you'll be right famous at Hogwarts.\"  But Uncle Vernon wasn't going to give in without a fight.  \"Haven't I told you he's not going?\" he hissed. \"He's going to Stonewall High and he'll be grateful for it. I've read those letters and he needs all sorts of rubbish -- spell books and wands and --\"  \"If he wants ter go, a great Muggle like you won't stop him,\" growled Hagrid. \"Stop Lily an' James Potter' s son goin' ter Hogwarts! Yer mad. His name's been down ever since he was born. He's off ter the finest school of witchcraft and wizardry in the world. Seven years there and he won't know himself. He'll be with youngsters of his own sort, fer a change, an' he'll be under the greatest headmaster Hogwarts ever had Albus Dumbled--\"  \"I AM NOT PAYING FOR SOME CRACKPOT OLD FOOL To TEACH HIM MAGIC TRICKS!\" yelled Uncle Vernon.  But he had finally gone too far. Hagrid seized his umbrella and whirled it over his head, \"NEVER,\" he thundered, \"- INSULT- ALBUS- DUMBLEDORE- IN- FRONT- OF- ME!\"  He brought the umbrella swishing down through the air to point at Dudley -- there was a flash of violet light, a sound like a firecracker, a sharp squeal, and the next second, Dudley was dancing on the spot with his hands clasped over his fat bottom, howling in pain. When he turned his back on them, Harry saw a curly pig's tail poking through a hole in his trousers.  Uncle Vernon roared. Pulling Aunt Petunia and Dudley into the other room, he cast one last terrified look at Hagrid and slammed the door behind them.  Hagrid looked down at his umbrella and stroked his beard."
}