{
  "id": "699d8e996cd52487de75bcecfd8c3f7a3f66e612",
  "text": " And  if Lugb®rz wanted him, you'd  have to go and get him. Nice for you. But there  was more than one.'       At this point Sam began to listen  more attentively and pressed his ear  against the stone.       'Who cut the cords she'd  put round  him, Shagrat? Same one  as cut the  web. Didn't you see that? And who stuck a pin into Her Ladyship? Same one, I  reckon. And where is he? Where is he, Shagrat? '       Shagrat made no reply.       `You may  well put  your  thinking cap on,  if you've  got one. It's no  laughing matter. No  one, no one  has ever stuck a  pin in Shelob before, as  you  should  know well enough.  There's no  grief in that; but think -there's  someone  loose hereabouts  as is more dangerous than any other  damned rebel  that ever  walked since the bad old times, since the  Great Siege. Something   has slipped.'       `And what is it then? ' growled Shagrat.       `By all the  signs, Captain  Shagrat, I'd say there's  a  large warrior   loose,  Elf most likely, with an elf-sword anyway, and an axe as well maybe:  and he's loose in your bounds, too, and you've never spotted him. Very funny  indeed! ' Gorbag spat. Sam smiled grimly at this description of himself.        'Ah well, you always did take a gloomy  view.'  said  Shagrat. 'You can  read the signs how you like, but there  may be  other   ways to explain them.  Anyhow. I've  got watchers  at every point, and  I'm  going to deal with one  thing at a  time. When  I've had  a look at the fellow we have caught,  then  I'll begin to worry     1cb2     ####-about something else.'       `It's my guess you won't find much in that little fellow,' said Gorbag.  'He may have had nothing to  do  with the real mischief. The big fellow with  the sharp sword doesn't seem to have thought him  worth much  anyhow  -- just   left him lying: regular elvish trick.'       `We'll see. Come on now! We've talked enough. Let's go  and have a look  at the prisoner!       `What  are  you going to do with him? Don't forget I spotted him first.  If there's any game, me and my lads must be in it.'       'Now, now,' growled  Shagrat. 'I  have my  orders. And it's more than my  belly's worth, or yours, to break 'em. Any trespasser found by the  guard is  to  be held at the  tower. Prisoner is  to be stripped. Full description  of  every  article, garment, weapon,  letter,  ring. or trinket is to be sent to  Lugb®rz at once, and to  Lugb®rz only . And  the prisoner is to be  kept safe   and intact,  under pain  of death for every member  of  the guard, until  He  sends or comes Himself. That's plain enough,  and that's what I'm  going  to  do.'       'Stripped, eh? ' said Gorbag. 'What, teeth, nails, hair, and all? '       `No,  none of that. He's for Lugb®rz,  I tell you. He's wanted safe and  whole.'       'You'll find that difficult,' laughed Gorbag. 'He's nothing but carrion  now. What Lugb®rz will do with such  stuff I can't guess. He might as well go  in the pot.'       'You  fool,'  snarled Shagrat.  'You've been talking very  clever,  but  there's a lot you don't  know, though most other folk do. You'll be  for the  pot or for Shelob, if you don't take  care. Carrion! Is that all you know of  Her Ladyship? When she binds with cords,  she's after meat. She  doesn't eat  dead meat, nor suck cold blood. This fellow isn't dead! '       Sam reeled, clutching at the stone. He felt as if  the whole dark world  was turning upside  down. So great was the shock that he almost swooned, but  even as he fought to keep a hold on his senses, deep inside him he was aware  of the  comment: 'You  fool, he  isn't dead, and your heart  knew  it. Don't   trust your head, Samwise, it is not the best part  of you. The  trouble with  you is that you never really had any hope. Now what is to be done? ' Fur the   moment nothing, but to prop himself against the  unmoving  stone and listen,  listen to the vile orc-voices.       `Garn!'  said  Shagrat. 'She's got more than  one  poison.  When  she's   ####-hunting, she just gives 'em a dab in the neck and  they go as limp as  boned  fish, and then she has her way with them. D'you remember old Ufthak? We lost   him for days.  Then we found him in a corner;  hanging up he was, but he was  wide awake  and glaring. How we laughed! She'd  forgotten him, maybe, but  we  didn't  touch him-no  good interfering with Her. Nar  -- this  little filth,  he'll wake up, in  a few hours; and  beyond feeling a  bit sick for  a  hit,  he'll be  all right. Or would  be,  if Lugb®rz  would let him alone. And  of  course, beyond wondering where he is and what's happened to him.'       'And what's going to happen to him,' laughed Gorbag. 'We can tell him a   few stories at  any rate, if we can't do a nything else. I don't suppose he's  ever been in lovely Lugb®rz, so he may  like to know what to expect. This is  going to be more funny than I thought. Let's go!'       `There's going to be no fun, I tell  you,' said Shagrat.  'And he's got  to be kept safe, or we're all as good as dead."
}