{
  "id": "69a0fb5abf08afda61bfbf1b4b1b8841f96c8995",
  "text": " At first he thought the bands around it were bronze, but when he moved closer he realized they were gold. Old gold, more brown than yellow, and graven with runes.   Ygritte said you never found the horn.    Did you think only crows could lie? I liked you well enough, for a bastard… but I never trusted you. A man needs to earn my trust.   Jon faced him.  If you’ve had the Horn of Joramun all along, why haven’t you used it? Why bother building turtles and sending Thenns to kill us in our beds? If this horn is all the songs say, why not just sound it and be done?   It was Dalla who answered him, Dalla great with child, lying on her pile of furs beside the brazier.  We free folk know things you kneelers have forgotten. Sometimes the short road is not the safest, Jon Snow. The Horned Lord once said that sorcery is a sword without a hilt. There is no safe way to grasp it.   Mance ran a hand along the curve of the great horn.  No man goes hunting with only one arrow in his quiver,  he said.  I had hoped that Styr and Jarl would take your brothers unawares, and open the gate for us. I drew your garrison away with feints and raids and secondary attacks. Bowen Marsh swallowed that lure as I knew he would, but your band of cripples and orphans proved to be more stubborn than anticipated. Don’t think you’ve stopped us, though. The truth is, you are too few and we are too many. I could continue the attack here and still send ten thousand men to cross the Bay of Seals on rafts and take Eastwatch from the rear. I could storm the Shadow Tower too, I know the approaches as well as any man alive. I could send men and mammoths to dig out the gates at the castles you’ve abandoned, all of them at once.    Why don’t you, then?  Jon could have drawn Longclaw then, but he wanted to hear what the wildling had to say.   Blood,  said Mance Rayder.  I’d win in the end, yes, but you’d bleed me, and my people have bled enough.    Your losses haven’t been that heavy.    Not at your hands.  Mance studied Jon’s face.  You saw the Fist of the First Men. You know what happened there. You know what we are facing.    The Others…    They grow stronger as the days grow shorter and the nights colder. First they kill you, then they send your dead against you. The giants have not been able to stand against them, nor the Thenns, the ice river clans, the Hornfoots.    Nor you?    Nor me.  There was anger in that admission, and bitterness too deep for words.  Raymun Redbeard, Bael the Bard, Gendel and Gorne, the Horned Lord, they all came south to conquer, but I’ve come with my tail between my legs to hide behind your Wall.  He touched the horn. Again.  If I sound the Horn of Winter, the Wall will fall. Or so the songs would have me believe. There are those among my people who want nothing more…    But once the Wall is fallen,  Dalla said,  what will stop the Others?   Mance gave her a fond smile.  It’s a wise woman I’ve found. A true queen.  He turned back to Jon.  Go back and tell them to open their gate and let us pass. If they do, I will give them the horn, and the Wall will stand until the end of days.   Open the gate and let them pass. Easy to say, but what must follow? Giants camping in the ruins of Winterfell? Cannibals in the wolfswood, chariots sweeping across the barrowlands, free folk stealing the daughters of shipwrights and silversmiths from White Harbor and fishwives off the Stony Shore?  Are you a true king?  Jon asked suddenly.   I’ve never had a crown on my head or sat my arse on a bloody throne, if that’s what you’re asking,  Mance replied.  My birth is as low as a man’s can get, no septon’s ever smeared my head with oils, I don’t own any castles, and my queen wears furs and amber, not silk and sapphires. I am my own champion, my own fool, and my own harpist. You don’t become King-beyond-the-Wall because your father was. The free folk won’t follow a name, and they don’t care which brother was born first. They follow fighters. When I left the Shadow Tower there were five men making noises about how they might be the stuff of kings. Tormund was one, the Magnar another. The other three I slew, when they made it plain they’d sooner fight than follow.    You can kill your enemies,  Jon said bluntly,  but can you rule your friends? If we let your people pass, are you strong enough to make them keep the king’s peace and obey the laws?    Whose laws? The laws of Winterfell and King’s Landing?  Mance laughed.  When we want laws we’ll make our own. You can keep your king’s justice too, and your king’s taxes. I’m offering you the horn, not our freedom. We will not kneel to you.    What if we refuse the offer?  Jon had no doubt that they would. The Old Bear might at least have listened, though he would have balked at the notion of letting thirty or forty thousand wildlings loose on the Seven Kingdoms. But Alliser Thorne and Janos Slynt would dismiss the notion out of hand.   If you refuse,  Mance Rayder said,  Tormund Giantsbane will sound the Horn of Winter three days hence, at dawn."
}