{
  "id": "69b04cf20ae6a2074436c1a9621652e0582eeb0c",
  "text": " As if  a dark  veil had  been withdrawn, the Mirror   grew grey, and then clear. There was sun shining, and the branches  of trees  were waving and tossing in the  wind. But before Sam could make  up his mind  what it  was that he saw, the  light faded; and  now he thought he saw Frodo  with  a pale face lying fast asleep under a great dark cliff. Then he seemed  to see  himself going along  a dim passage, and climbing an endless  winding  stair. It came to him suddenly that he was looking urgently  for  something,  but what it was he  did not know. Like a dream the vision  shifted and  went   back, and he  saw the trees again. But this time they were not so close, and   he could see what was  going on: they were not waving in the wind, they were  falling, crashing to the ground.       `Hi!' cried Sam  in  an  outraged  voice.  'There's  that Ted  Sandyman  a-cutting down trees as he  shouldn't. They didn't ought to be  felled: it's  that avenue beyond the Mill that shades the road to Bywater. I  wish I could   get at Ted, and I'd fell him ! '       But  now  Sam  noticed  that the Old  Mill had  vanished,  and  a large  red-brick building was being put up  where it had stood. Lots of  folk  were  busily  at work. There was a tall red chimney nearby.  Black smoke seemed to  cloud the surface of the Mirror.       'There's some devilry at work in the Shire,' he said. 'Elrond knew what  he  was about when he wanted to send Mr. Merry back.' Then suddenly Sam  gave  a cry and sprang away. 'I can't stay here,' he said wildly. `I must go home.   ####-They've dug up Bagshot Row, and there's the  poor old gaffer  going down the  Hill with his bits of things on a barrow. I must go home! '       'You cannot go home alone,' said the Lady. 'You did not wish to go home  without your master before you looked in the Mirror, and  yet  you knew that  evil things might well be happening in the  Shire.  Remember that the Mirror  shows many things, and not all have yet come to pass. Some never come to be,  unless those that behold the visions turn aside  from their path to  prevent  them. The Mirror is dangerous as a guide of deeds.'       Sam  sat on  the  ground and  put his head in his hands. `I  wish I had  never come  here, and I don't want to see  no  more magic,' he said and fell  silent. After a moment he spoke again thickly, as if struggling with  tears.  `No, I'll go home by the long road with Mr. Frodo, or  not at all,' he said.  `But I hope I  do  get  back some  day. If  what  I've  seen turns out true,  somebody's going to catch it hot! '       `Do you now  wish to look , Frodo? '  said  the Lady Galadriel. `You did  not wish to see Elf-magic and were content.'       `Do you advise me to look? ' asked Frodo.       'No,' she said. `I do not counsel you one way or the other. I am  not a   counsellor.  You may  learn something, a nd  whether what you  see be fair or  evil, that  may be profitable,  and yet it may not. Seeing is both good  and  perilous. Yet  I think, Frodo, that you have courage and  wisdom enough  for  the venture, or I would not have brought you here. Do as you will!   '       `I will look,' said Frodo, and he climbed on the pedestal and bent over   the  dark  water.  At once the Mirror  cleared  and  he  saw  a twilit land.  Mountains  loomed dark in the distance against a pale sky. A  long grey road  wound back out of sight.  Far away a figure came slowly down the road, faint  and  small at  first,  but  growing  larger and  clearer  as it  approached.  Suddenly Frodo realized that it reminded  him  of Gandalf. He  almost called  aloud the wizard's name, and then he saw that  the figure was clothed not in  grey but in  white, in  a white  that shone faintly in the dusk; and  in its  hand  there was  a white staff. The  head was so bowed that he could see  no  face,  and  presently the figure turned aside round  a bend in the road  and  went out  of  the Mirror's  view. Doubt came into Frodo's  mind:  was this a   vision of Gandalf on one of his  many  lonely  journeys long  ago, or was it  Saruman?        The vision now  changed. Brief and  small but  very vivid  he  caught a   glimpse of  Bilbo  walking restlessly about his room. The table was littered   ####-with disordered papers; rain was beating on the windows.       Then there  was a pause, and after  it many swift scenes followed  that  Frodo in some way knew to be parts of a great history in which he had become  involved. The mist cleared and he saw a sight which he had never seen before  but knew at once: the Sea. Darkness fell. The sea rose  and raged in a great  storm. Then  he saw  against  the  Sun, sinking  blood-red into a  wrack  of  clouds,  the black outline  of a tall ship with torn sails riding up  out of  the  West.  Then a wide river flowing through a  populous city. Then a white   fortress with seven towers. And then again a ship with  black sails, but now  it was morning again, and the water rippled with light, and a banner bearing   the  emblem of a white tree shone in the sun."
}