{
  "id": "69b636f2eaf401f44d6e64544e0a38cf15efd607",
  "text": " Diggory deposited his elf on the ground at his feet. The other Ministry wizards were all staring at Mr. Crouch. For a few seconds Crouch remained transfixed, his eyes blazing in his white face as he stared down at Winky. Then he appeared to come to life again. \"This - cannot - be,\" he said jerkily. \"No -\" He moved quickly around Mr. Diggory and strode off toward the place where he had found Winky. \"No point, Mr. Crouch,\" Mr. Diggory called after him. \"There's no one else there.\" But Mr. Crouch did not seem prepared to take his word for it. They could hear him moving around and the rustling of leaves as he pushed the bushes aside, searching. \"Bit embarrassing,\" Mr. Diggory said grimly, looking down at Winky's unconscious form. \"Barty Crouch's house-elf. . . I mean to say...\" \"Come off it, Amos,\" said Mr. Weasley quietly, \"you don't seriously think it was the elf?  The Dark Mark's a wizard's sign.  It requires a wand.\" \"Yeah,\" said Mr. Diggory, \"and she had a wand.\" \"What?\" said Mr. Weasley. \"Here, look.\" Mr. Diggory held up a wand and showed it to Mr. Weasley. \"Had it in her hand. So that's clause three of the Code of Wand Use broken, for a start. No non-human creature is permitted to carry or use a wand.\" Just then there was another pop, and Ludo Bagman Apparated right next to Mr. Weasley.  Looking breathless and disorientated, he spun on the spot, goggling upward at the emerald-green skull.  \"The Dark Mark!\" he panted, almost trampling Winky as he turned inquiringly to his colleagues.  \"Who did it?  Did you get them?  Barry!  What's going on?\" Mr. Crouch had returned empty-handed.  His face was still ghostly white, and his hands and his toothbrush mustache were both twitching. \"Where have you been, Barty?\" said Bagman. \"Why weren't you at the match? Your elf was saving you a seat too - gulping gargoyles!\"  Bagman had just noticed Winky lying at his feet.  \"What happened to her?\" \"I have been busy, Ludo,\" said Mr. Crouch, still talking in the same jerky fashion, barely moving his lips.  \"And my elf has been stunned.\" \"Stunned? By you lot, you mean? But why - ?\"  Comprehension dawned suddenly on Bagman's round, shiny face; he looked up at the skull, down at Winky, and then at Mr. Crouch. \"No!\" he said. \"Winky?  Conjure the Dark Mark?  She wouldn't know how!  She'd need a wand, for a start!\" \"And she had one,\" said Mr. Diggory.  \"I found her holding one, Ludo.  If it's all right with you, Mr. Crouch, I think we should hear what she's got to say for herself.\" Crouch gave no sign that he had heard Mr. Diggory, but Mr. Diggory seemed to take his silence for assent.  He raised his own wand, pointed it at Winky, and said, \"Ennervate!\" Winky stirred feebly. Her great brown eyes opened and she blinked several times in a bemused sort of way. Watched by the silent wizards, she raised herself shakily into a sitting position. She caught sight of Mr. Diggory's feet, and slowly, tremulously, raised her eyes to stare up into his face; then, more slowly still, she looked up into the sky. Harry could see the floating skull reflected twice in her enormous, glassy eyes. She gave a gasp, looked wildly around the crowded clearing, and burst into terrified sobs. \"Elf!\" said Mr. Diggory sternly. \"Do you know who I am?  I'm a member of the Department for the Regulation and Control of Magical Creatures!\" Winky began to rock backward and forward on the ground, her breath coming in sharp bursts.  Harry was reminded forcibly of Dobby in his moments of terrified disobedience. \"As you see, elf, the Dark Mark was conjured here a short while ago,\" said Mr. Diggory. \"And you were discovered moments later, right beneath it!  An explanation, if you please!\" \"I - I - I is not doing it, sir!\" Winky gasped. \"I is not knowing how, sir!\" \"You were found with a wand in your hand!\" barked Mr. Diggory, brandishing it in front of her.  And as the wand caught the green light that was filling the clearing from the skull above, Harry recognized it \"Hey - that's mine!\" he said Everyone in the clearing looked at him. \"Excuse me?\" said Mr. Diggory, incredulously. \"That's my wand!\" said Harry. \"I dropped it!\" \"You dropped it?\" repeated Mr. Diggory in disbelief.  \"Is this a confession?  You threw it aside after you conjured the Mark?\" \"Amos, think who you're talking to!\"  said Mr. Weasley, very angrily.  \"Is Harry Potter likely to conjure the Dark Mark?\"  \"Er - of course not,\" mumbled Mr. Diggory. \"Sorry. . . carried away. . \"I didn't drop it there, anyway,\" said Harry, jerking his thumb toward the trees beneath the skull. \"I missed it right after we got into the wood.\" \"So,\" said Mr. Diggory, his eyes hardening as he turned to look at Winky again, cowering at his feet.  \"You found this wand, eh, elf?  And you picked it up and thought you'd have some fun with it, did you?\" \"I is not doing magic with it, sir!\"  squealed Winky, tears streaming down the sides of her squashed and bulbous nose.  \"I is. . . I is. . . I is just picking it up, sir! i is not making the Dark Mark, sir, i is not knowing how!\" \"It wasn't her!\" said Hermione."
}