{
  "id": "69cb2397fcca89e520406c3753266c4946476292",
  "text": "  Without food, clothing, weapons.  He had locked away every sword and axe in Winterfell, but no doubt some had been hidden from him.  I’ll have the names of all those who aided them. All those who turned a blind eye.  The only sound was the wind.  Come first light, I mean to bring them back.  He hooked his thumbs through his swordbelt.  I need huntsmen. Who wants a nice warm wolfskin to see them through the winter? Gage?  The cook had always greeted him cheerfully when he returned from the hunt, to ask whether he’d brought anything choice for the table, but he had nothing to say now. Theon walked back the way he had come, searching their faces for the least sign of guilty knowledge.  The wild is no place for a cripple. And Rickon, young as he is, how long will he last out there? Nan, think how frightened he must be.  The old woman had nattered at him for ten years, telling her endless stories, but now she gaped at him as if he were some stranger.  I might have killed every man of you and given your women to my soldiers for their pleasure, but instead I protected you. Is this the thanks you offer?  Joseth who’d groomed his horses, Farlen who’d taught him all he knew of hounds, Barth the brewer’s wife who’d been his first—not one of them would meet his eyes. They hate me, he realized.  Reek stepped close.  Strip off their skins,  he urged, his thick lips glistening.  Lord Bolton, he used to say a naked man has few secrets, but a flayed man’s got none.   The flayed man was the sigil of House Bolton, Theon knew; ages past, certain of their lords had gone so far as to cloak themselves in the skins of dead enemies. A number of Starks had ended thus. Supposedly all that had stopped a thousand years ago, when the Boltons had bent their knees to Winterfell. Or so they say, but old ways die hard, as well I know.   There will be no flaying in the north so long as I rule in Winterfell,  Theon said loudly. I am your only protection against the likes of him, he wanted to scream. He could not be that blatant, but perhaps some were clever enough to take the lesson.  The sky was greying over the castle walls. Dawn could not be far off.  Joseth, saddle Smiler and a horse for yourself. Murch, Gariss, Poxy Tym, you’ll come as well.  Murch and Gariss were the best huntsmen in the castle, and Tym was a fine bowman.  Aggar, Rednose, Gelmarr, Reek, Wex.  He needed his own to watch his back.  Farlen, I’ll want hounds, and you to handle them.   The grizzled kennelmaster crossed his arms.  And why would I care to hunt down my own trueborn lords, and babes at that?   Theon moved close.  I am your trueborn lord now, and the man who keeps Palla safe.   He saw the defiance die in Farlen’s eyes.  Aye, m’lord.   Stepping back, Theon glanced about to see who else he might add.  Maester Luwin,  he announced.   I know nothing of hunting.   No, but I don’t trust you in the castle in my absence.  Then it’s past time you learned.    Let me come too. I want that wolfskin cloak.  A boy stepped forward, no older than Bran. It took Theon a moment to remember him.  I’ve hunted lots of times before,  Walder Frey said.  Red deer and elk, and even boar.   His cousin laughed at him.  He rode on a boar hunt with his father, but they never let him near the boar.   Theon look at the boy doubtfully.  Come if you like, but if you can’t keep up, don’t think that I’ll nurse you along.  He turned back to Black Lorren.  Winterfell is yours in my absence. If we do not return, do with it as you will.  That bloody well ought to have them praying for my success.  They assembled by the Hunter’s Gate as the first pale rays of the sun brushed the top of the Bell Tower, their breath frosting in the cold morning air. Gelmarr had equipped himself with a longaxe whose reach would allow him to strike before the wolves were on him. The blade was heavy enough to kill with a single blow. Aggar wore steel greaves. Reek arrived carrying a boar spear and an overstuffed washerwoman’s sack bulging with god knows what. Theon had his bow; he needed nothing else. Once he had saved Bran’s life with an arrow. He hoped he would not need to take it with another, but if it came to that, he would.  Eleven men, two boys, and a dozen dogs crossed the moat. Beyond the outer wall, the tracks were plain to read in the soft ground; the pawprints of the wolves, Hodor’s heavy tread, the shallower marks left by the feet of the two Reeds. Once under the trees, the stony ground and fallen leaves made the trail harder to see, but by then Farlen’s red bitch had the scent. The rest of the dogs were close behind, the hounds sniffing and barking, a pair of monstrous mastiffs bringing up the rear. Their size and ferocity might make the difference against a cornered direwolf.  He’d have guessed that Osha might run south to Ser Rodrik, but the trail led north by northwest, into the very heart of the wolfswood. Theon did not like that one bit. It would be a bitter irony if the Starks made for Deepwood Motte and delivered themselves right into Asha’s hands."
}