{
  "id": "6a09081bb2162eba395dfb0e1a9552d542cdea1b",
  "text": " But so ends  all  hope  of  starting early,  and  slipping away quietly! We might as  well have  blown a   horn to announce our departure. That was part of their plan, no doubt.'   ####-     'There is one crumb of comfort,' said Merry, 'and more than a  crumb, I  hope: we  can have  breakfast while we wait  - and sit down to it.  Let's get  hold of Nob!'       In the end there was more  than three hours'  delay. Bob came back with  the  report  that  no horse or pony was to be got for love  or  money in the  neighbourhood - except one: Bill Ferny had  one that he might possibly sell.   'A poor old half-starved creature it is,'  said Bob; 'but he won't part with  it for less than thrice its worth, seeing how  you're placed, not if I knows  Bill Ferny.'       'Bill  Ferny?'  said Frodo. 'Isn't there some trick? Wouldn't the beast   bolt back to him with all our stuff, or help in tracking us, or something?'       'I wonder,' said Strider. 'But I cannot imagine any animal running home  to him, once  it got  away.  I  fancy this  is only an  afterthought of kind  Master  Ferny's: just a  way of increasing his profits  from the affair. The  chief  danger is that the poor beast is probably at  death's door. But there  does not seem any choice. What does he want for it?'       Bill Ferny's price was twelve  silver pennies; and  that  was indeed at  least  three times the pony's value in those pans. It  proved to  be a bony,  underfed, and dispirited  animal; but  it did  not look like dying just yet.  Mr. Butterbur paid for it himself, and offered Merry  another eighteen pence  as  some  compensation  for  the  lost animals. He was an  honest  man,   and  well-off as things were reckoned  in Bree;  but thirty silver pennies was  a   sore blow to him, and being cheated by Bill Ferny made it harder to bear.       As a matter of fact he came out on the right side in the end. It turned  out later that only one  horse had been actually stolen. The others had been  driven off, or  had  bolted in terror, and were found wandering in different  corners  of  the  Bree-land.  Merry's  ponies  had  escaped altogether,  and  eventually (having a good deal of sense) they made their way to the Downs in  search of Fatty Lumpkin. So they came under  the care  of Tom Bombadil for a   while, and were well-off. But when  news of the events at Bree came to Tom's  ears, he sent them to Mr. Butterbur, who thus got five good beasts at a very  fair price. They had  to work harder in Bree, but  Bob treated them well; so  on the whole  they were lucky: they missed a dark and dangerous journey. But  they never came to Rivendell.       However, in the meanwhile for all Mr. Butterbur knew his money was gone  for  good, or  for bad.  And he had other troubles. For  there  was a  great  commotion as soon as  the remaining  guests were astir and heard news of the   ####-raid  on the inn. The southern travellers had lost several horses and blamed  the innkeeper loudly, until it became known that one of their own number had  also  disappeared  in the  night,  none  other than Bill Ferny's squint-eyed  companion. Suspicion fell on him at once.       'If you pick up with  a  horse-thief, and  bring him to my house,' said  Butterbur angrily, 'you ought to pay  for all the damage yourselves and  not  come shouting at me. Go and ask Ferny where your handsome friend is!' But it  appeared that he was nobody's friend, and nobody could recollect when he had  joined their party.       After  their  breakfast the  hobbits had to re-pack,  and get  together   further  supplies for  the  longer  journey  they were now expecting. It was  close on ten o'clock before they at last got off. By  that time the whole of  Bree was buzzing with excitement. Frodo's vanishing trick; the appearance of  the black  horsemen; the robbing of the stables; and not least the news that  Strider  the Ranger  had joined the  mysterious hobbits, made such a tale as  would last for  many  uneventful years. Most of  the inhabitants of Bree and   Staddle, and many  even  from Combe and Archet, were crowded in the  road  to  see the travellers start. The other  guests in  the inn were at the doors or   hanging out of the windows.       Strider had changed his mind, and  he decided  to leave Bree by the main  road. Any attempt to set  off across country at once would only make matters  worse: half the inhabitants would follow them,  to see what they were up to,   and to prevent them from trespassing.       They said farewell to Nob and Bob, and took leave of Mr. Butterbur with  many thanks. 'I  hope we shall  meet again some  day, when things are  merry  once more,' said Frodo. 'I  should like nothing better than  to stay in your  house in peace for a while.'       They tramped off, anxious and downhearted, under the eyes of the crowd.  Not  all  the faces were friendly, nor all the words that were shouted.  But  Strider seemed to be held in awe by most of the Bree-landers, and those that  he stared at shut their mouths and drew away."
}