{
  "id": "6a19f9dda4f3ec5402955eb67dd5041462ffd442",
  "text": "    Your father?  Bronn asked.   Or my brother Jaime,  Tyrion said.  We shall know soon enough.  He surveyed his ragged band of brigands: near three hundred Stone Crows, Moon Brothers, Black Ears, and Burned Men, and those just the seed of the army he hoped to grow. Gunthor son of Gurn was raising the other clans even now. He wondered what his lord father would make of them in their skins and bits of stolen steel. If truth be told, he did not know what to make of them himself. Was he their commander or their captive? Most of the time, it seemed to be a little of both.  It might be best if I rode down alone,  he suggested.   Best for Tyrion son of Tywin,  said Ulf, who spoke for the Moon Brothers.  Shagga glowered, a fearsome sight to see.  Shagga son of Dolf likes this not. Shagga will go with the boyman, and if the boyman lies, Shagga will chop off his manhood—    —and feed it to the goats, yes,  Tyrion said wearily.  Shagga, I give you my word as a Lannister, I will return.    Why should we trust your word?  Chella was a small hard woman, flat as a boy, and no fool.  Lowland lords have lied to the clans before.    You wound me, Chella,  Tyrion said.  Here I thought we had become such friends. But as you will. You shall ride with me, and Shagga and Conn for the Stone Crows, Ulf for the Moon Brothers, and Timett son of Timett for the Burned Men.  The clansmen exchanged wary looks as he named them.  The rest shall wait here until I send for you. Try not to kill and maim each other while I’m gone.   He put his heels to his horse and trotted off, giving them no choice but to follow or be left behind. Either was fine with him, so long as they did not sit down to talk for a day and a night. That was the trouble with the clans; they had an absurd notion that every man’s voice should be heard in council, so they argued about everything, endlessly. Even their women were allowed to speak. Small wonder that it had been hundreds of years since they last threatened the Vale with anything beyond an occasional raid. Tyrion meant to change that.  Brorm rode with him. Behind them—after a quick bit of grumbling—the five clansmen followed on their undersize garrons, scrawny things that looked like ponies and scrambled up rock walls like goats.  The Stone Crows rode together, and Chella and Ulf stayed close as well, as the Moon Brothers and Black Ears had strong bonds between them. Timett son of Timett rode alone. Every clan in the Mountains of the Moon feared the Burned Men, who mortified their flesh with fire to prove their courage and (the others said) roasted babies at their feasts. And even the other Burned Men feared Timett, who had put out his own left eye with a white-hot knife when he reached the age of manhood. Tyrion gathered that it was more customary for a boy to burn off a nipple, a finger, or (if he was truly brave, or truly mad) an ear. Timett’s fellow Burned Men were so awed by his choice of an eye that they promptly named him a red hand, which seemed to be some sort of a war chief.   I wonder what their king burned off,  Tyrion said to Bronn when he heard the tale. Grinning, the sellsword had tugged at his crotch… but even Bronn kept a respectful tongue around Timett. If a man was mad enough to put out his own eye, he was unlikely to be gentle to his enemies.  Distant watchers peered down from towers of unmortared stone as the party descended through the foothills, and once Tyrion saw a raven take wing. Where the high road twisted between two rocky outcrops, they came to the first strong point. A low earthen wall four feet high closed off the road, and a dozen crossbowmen manned the heights. Tyrion halted his followers out of range and rode to the wall alone.  Who commands here?  he shouted up.  The captain was quick to appear, and even quicker to give them an escort when he recognized his lord’s son. They trotted past blackened fields and burned holdfasts, down to the riverlands and the Green Fork of the Trident. Tyrion saw no bodies, but the air was full of ravens and carrion crows; there had been fighting here, and recently.  Half a league from the crossroads, a barricade of sharpened stakes had been erected, manned by pikemen and archers. Behind the line, the camp spread out to the far distance. Thin fingers of smoke rose from hundreds of cookfires, mailed men sat under trees and honed their blades, and familiar banners fluttered from staffs thrust into the muddy ground.  A party of mounted horsemen rode forward to challenge them as they approached the stakes. The knight who led them wore silver armor inlaid with amethysts and a striped purple-and-silver cloak. His shield bore a unicorn sigil, and a spiral horn two feet long jutted up from the brow of his horsehead helm. Tyrion reined up to greet him.  Ser Flement.   Ser Flement Brax lifted his visor.  Tyrion,  he said in astonishment.  My lord, we all feared you dead, or…  He looked at the clansmen uncertainly.  These… companions of yours…    Bosom friends and loyal retainers,  Tyrion said."
}