{
  "id": "6a6eb011aa568baaf143c0769b357ac448068d15",
  "text": " Theon watched his face. When his chin quivered under those stiff white whiskers, he knew just what the old man was seeing. He is not surprised, he thought with sadness, but the fear is there.   This is craven,  Ser Rodrik said.  To use a child so… this is despicable.    Oh, I know,  said Theon.  It’s a dish I tasted myself, or have you forgotten? I was ten when I was taken from my father’s house, to make certain he would raise no more rebellions.    It is not the same!   Theon’s face was impassive.  The noose I wore was not made of hempen rope, that’s true enough, but I felt it all the same. And it chafed, Ser Rodrik. It chafed me raw.  He had never quite realized that until now, but as the words came spilling out he saw the truth of them.   No harm was ever done you.    And no harm will be done your Beth, so long as you—   Ser Rodrik never gave him the chance to finish.  Viper,  the knight declared, his face red with rage beneath those white whiskers.  I gave you the chance to save your men and die with some small shred of honor, Turncloak. I should have known that was too much to ask of a childkiller.  His hand went to the hilt of his sword.  I ought cut you down here and now and put an end to your lies and deceits. By the gods, I should.   Theon did not fear a doddering old man, but those watching archers and that line of knights were a different matter. If the swords came out his chances of getting back to the castle alive were small to none.  Forswear your oath and murder me, and you will watch your little Beth strangle at the end of a rope.   Ser Rodrik’s knuckles had gone white, but after a moment he took his hand off the swordhilt.  Truly, I have lived too long.    I will not disagree, ser. Will you accept my terms?    I have a duty to Lady Catelyn and House Stark.    And your own House? Beth is the last of your blood.   The old knight drew himself up straight.  I offer myself in my daughter’s place. Release her, and take me as your hostage. Surely the castellan of Winterfell is worth more than a child.    Not to me.  A valiant gesture, old man, but I am not that great a fool.  Not to Lord Manderly or Leobald Tallhart either, I’d wager.  Your sorry old skin is worth no more to them than any other man’s.  No, I’ll keep the girl… and keep her safe, so long as you do as I’ve commanded you. Her life is in your hands.    Gods be good, Theon, how can you do this? You know I must attack, have sworn…    If this host is still in arms before my gate when the sun sets, Beth will hang,  said Theon.  Another hostage will follow her to the grave at first light, and another at sunset. Every dawn and every dusk will mean a death, until you are gone. I have no lack of hostages.  He did not wait for a reply, but wheeled Smiler around and rode back toward the castle. He went slowly at first, but the thought of those archers at his back soon drove him to a canter. The small heads watched him come from their spikes, their tarred and flayed faces looming larger with every yard; between them stood little Beth Cassel, noosed and crying. Theon put his heel into Smiler and broke into a hard gallop. Smiler’s hooves clattered on the drawbridge, like drumbeats.  In the yard he dismounted and handed his reins to Wex.  It may stay them,  he told Black Lorren.  We’ll know by sunset. Take the girl in till then, and keep her somewhere safe.  Under the layers of leather, steel, and wool, he was slick with sweat.  I need a cup of wine. A vat of wine would do even better.   A fire had been laid in Ned Stark’s bedchamber. Theon sat beside it and filled a cup with a heavy-bodied red from the castle vaults, a wine as sour as his mood. They will attack, he thought gloomily, staring at the flames. Ser Rodrik loves his daughter, but he is still castellan, and most of all a knight. Had it been Theon with a noose around his neck and Lord Balon commanding the army without, the warhorns would already have sounded the attack, he had no doubt. He should thank the gods that Ser Rodrik was not ironborn. The men of the green lands were made of softer stuff, though he was not certain they would prove soft enough.  If not, if the old man gave the command to storm the castle regardless, Winterfell would fall; Theon entertained no delusions on that count. His seventeen might kill three, four, five times their own number, but in the end they would be overwhelmed.  Theon stared at the flames over the rim of his wine goblet, brooding on the injustice of it all.  I rode beside Robb Stark in the Whispering Wood,  he muttered. He had been frightened that night, but not like this. It was one thing to go into battle surrounded by friends, and another to perish alone and despised. Mercy, he thought miserably.  When the wine brought no solace, Theon sent Wex to fetch his bow and took himself to the old inner ward. There he stood, loosing shaft after shaft at the archery butts until his shoulders ached and his fingers were bloody, pausing only long enough to pull the arrows from the targets for another round."
}