{
  "id": "6adce10f2bd49b212327a76830952960065921e9",
  "text": " \"Priori Incantatem,\" he muttered. His eyes gazed into Harry's and it was almost as though an invisible beam of understanding shot between them. \"The Reverse Spell effect?\"  said Sirius sharply. \"Exactly,\" said Dumbledore.  \"Harry's wand and Voldemorts wand share cores.  Each of them contains a feather from the tail of the same phoenix.  This phoenix, in fact,\" he added, and he pointed at the scarlet-and-gold bird, perching peacefully on Harry's knee. \"My wand's feather came from Fawkes?\"  Harry said, amazed. \"Yes,\" said Dumbledore.  \"Mr. Ollivander wrote to tell me you had bought the second wand, the moment you left his shop four years ago.\" \"So what happens when a wand meets its brother?\"  said Sirius. \"They will not work properly against each other,\" said Dumbledore.  \"If, however, the owners of the wands force the wands to do battle ... a very rare effect will take place.  One of the wands will force the other to regurgitate spells it has performed - in reverse.  The most recent first. . . and then those which preceded it. . . .\" He looked interrogatively at Harry, and Harry nodded. \"Which means,\" said Dumbledore slowly, his eyes upon Harry's face, \"that some form of Cedric must have reappeared.\" Harry nodded again. \"Diggory came back to life?\"  said Sirius sharply. \"No spell can reawaken the dead,\" said Dumbledore heavily. \"All that would have happened is a kind of reverse echo.  A shadow of the living Cedric would have emerged from the wand . . . am I correct, Harry?\" \"He spoke to me,\" Harry said.  He was suddenly shaking again.  \"The . . . the ghost Cedric, or whatever he was, spoke.\" \"An echo,\" said Dumbledore, \"which retained Cedric's appearance and character.  I am guessing other such forms appeared . . . less recent victims of Voldemort's wand....\" \"An old man,\" Harry said, his throat still constricted.  \"Bertha Jorkins.  And . . .\" \"Your parents?\"  said Dumbledore quietly. \"Yes,\" said Harry. Sirius's grip on Harry's shoulder was now so tight it was painful. \"The last murders the wand performed,\" said Dumbledore, nodding.  \"In reverse order. More would have appeared, of course, had you maintained the connection.  Very well, Harry, these echoes, these shadows . .. what did they do?\" Harry described how the figures that had emerged from the wand had prowled the edges of the golden web, how Voldemort had seemed to fear them, how the shadow of Harry's mother had told him what to do, how Cedric's had made its final request. At this point.  Harry found he could not continue.  He looked around at Sirius and saw that he had his face in his hands. Harry suddenly became aware that Fawkes had left his knee.  The phoenix had fluttered to the floor.  It was resting its beautiful head against  Harry's injured leg, and thick, pearly tears were falling from its eyes onto the wound left by the spider.  The pain vanished.  The skin mended.  His leg was repaired. \"I will say it again,\" said Dumbledore as the phoenix rose into the air and resettled itself upon the perch beside the door.  \"You have shown bravery beyond anything I could have expected of you tonight.  Harry.  You have shown bravery equal to those who died fighting Voldemort at the height of his powers.  You have shouldered a grown wizard's burden and found yourself equal to it - and you have now given us all we have a right to expect.  You will come with me to the hospital wing.  I do not want you returning to the dormitory tonight.  A Sleeping Potion, and some peace . . . Sirius, would you like to stay with him?\" Sirius nodded and stood up.  He transformed back into the great black dog and walked with Harry and Dumbledore out of the office, accompanying them down a flight of stairs to the hospital wing. When Dumbledore pushed open the door. Harry saw Mrs. Weasley, Bill, Ron, and Hermione grouped around a harassed-looking Madam Pomfrey.  They appeared to be demanding to know where Harry was and what had happened to him.  All of them whipped around as Harry, Dumbledore, and the black dog entered, and Mrs. Weasley let out a kind of muffled scream. \"Harry!  Oh Harry!\" She started to hurry toward him, but Dumbledore moved between them. \"Molly,\" he said, holding up a hand, \"please listen to me for a moment.  Harry has been through a terrible ordeal tonight.  He has just had to relive it for me.  What he needs now is sleep, and peace, and quiet.  If he would like you all to stay with him,\" he added, looking around at Ron, Hermione, and Bill too, \"you may do so.  But I do not want you questioning him until he is ready to answer, and certainly not this evening.\" Mrs. Weasley nodded.  She was very white.  She rounded on Ron, Hermione, and Bill as though they were being noisy, and hissed,  \"Did you hear?  He needs quiet!\" \"Headmaster,\" said Madam Pomfrey, staring at the great black dog that was Sirius, \"may I ask what - ?\" \"This dog will be remaining with Harry for a while,\" said Dumbledore simply.  \"I assure you, he is extremely well trained.  Harry - I will wait while you get into bed."
}