{
  "id": "6afed569446a38729b2e01da21bdc1a5de1e92cd",
  "text": " Three-quarters of the quays need repair, and some may have to be torn down and rebuilt. The entire fish market is gone, and both the River Gate and the King’s Gate are splintered from the battering Stannis gave them and should be replaced. I shudder to think of the cost.  If you do shit gold, Father, find a privy and get busy, he wanted to say, but he knew better.   You will find whatever gold is required.    Will I? Where? The treasury is empty, I’ve told you that. We’re not done paying the alchemists for all that wildfire, or the smiths for my chain, and Cersei’s pledged the crown to pay half the costs of Joff’s wedding—seventy-seven bloody courses, a thousand guests, a pie full of doves, singers, jugglers…    Extravagance has its uses. We must demonstrate the power and wealth of Casterly Rock for all the realm to see.    Then perhaps Casterly Rock should pay.    Why? I have seen Littlefinger’s accounts. Crown incomes are ten times higher than they were under Aerys.    As are the crown’s expenses. Robert was as generous with his coin as he was with his cock. Littlefinger borrowed heavily. From you, amongst others. Yes, the incomes are considerable, but they are barely sufficient to cover the usury on Littlefinger’s loans. Will you forgive the throne’s debt to House Lannister?    Don’t be absurd.    Then perhaps seven courses would suffice. Three hundred guests instead of a thousand. I understand that a marriage can be just as binding without a dancing bear.    The Tyrells would think us niggardly. I will have the wedding and the waterfront. If you cannot pay for them, say so, and I shall find a master of coin who can.   The disgrace of being dismissed after so short a time was not something Tyrion cared to suffer.  I will find your money.    You will,  his father promised,  and while you are about it, see if you can find your wife’s bed as well.   So the talk has reached even him.  I have, thank you. It’s that piece of furniture between the window and the hearth, with the velvet canopy and the mattress stuffed with goose down.    I am pleased you know of it. Now perhaps you ought to try and know the woman who shares it with you.   Woman? Child, you mean.  Has a spider been whispering in your ear, or do I have my sweet sister to thank?  Considering the things that went on beneath Cersei’s blankets, you would think she’d have the decency to keep her nose out of his.  Tell me, why is it that all of Sansa’s maids arc women in Cersei’s service? I am sick of being spied upon in my own chambers.    If you mislike your wife’s servants, dismiss them and hire ones more to your liking. That is your right. It is your wife’s maidenhood that concerns me, not her maids. This… delicacy puzzles me. You seem to have no difficulty bedding whores. Is the Stark girl made differently?    Why do you take so much bloody interest in where I put my cock?  Tyrion demanded.  Sansa is too young.    She is old enough to be Lady of Winterfell once her brother is dead. Claim her maidenhood and you will be one step closer to claiming the north. Get her with child, and the prize is all but won. Do I need to remind you that a marriage that has not been consummated can be set aside?    By the High Septon or a Council of Faith. Our present High Septon is a trained seal who barks prettily on command. Moon Boy is more like to annul my marriage than he is.    Perhaps I should have married Sansa Stark to Moon Boy. He might have known what to do with her.   Tyrion’s hands clenched on the arms of his chair.  I have heard all I mean to hear on the subject of my wife’s maidenhead. But so long as we are discussing marriage, why is it that I hear nothing of my sister’s impending nuptials? As I recall—   Lord Tywin cut him off.  Mace Tyrell has refused my offer to marry Cersei to his heir Willas.    Refused our sweet Cersei?  That put Tyrion in a much better mood.   When I first broached the match to him, Lord Tyrell seemed well enough disposed,  his father said.  A day later, all was changed. The old woman’s work. She hectors her son unmercifully. Varys claims she told him that your sister was too old and too used for this precious one-legged grandson of hers.    Cersei must have loved that.  He laughed.  Lord Tywin gave him a chilly look.  She does not know. Nor will she. It is better for all of us if the offer was never made. See that you remember that, Tyrion. The offer was never made.    What offer?  Tyrion rather suspected that Lord Tyrell might come to regret this rebuff.   Your sister will be wed. The question is, to whom? I have several thoughts—  Before he could get to them, there was a rap at the door and a guardsman stuck in his head to announce Grand Maester Pycelle.  He may enter,  said Lord Tywin.  Pycelle tottered in on a cane, and stopped long enough to give Tyrion a look that would curdle milk. His once-magnificent white beard, which someone had unaccountably shaved off, was growing back sparse and wispy, leaving him with unsightly pink wattles to dangle beneath his neck."
}