{
  "id": "6b1d292d8fcc53f7cde08925d81c1ccf9be586e7",
  "text": " Do you  forget  that you were  in my  kingdom,  using  the  road  that  my  people  made?  Did  you  not  three  times  pursue  and  trouble  my  people  in  the  forest  and  '  rouse  the  spiders  with  your  riot  and  clamour?  After  all  the  disturbance  you  have  made  I  have  a  right  to  know  what  brings you here, and if you will not tell me now, I will keep you all in prison until  you have learned sense and manners!\"  Then he ordered  the dwarves  each  to be put  in  a  separate  cell  and  to be given  food and drink, but not  to be allowed  to pass  the doors of  their  little prisons, until  one at  least of  them was willing  to  tell him all he wanted  to know. But be did not  tell  them  that  Thorin  was  also  a  prisoner  with  him.  It  was  Bilbo  who  found  that  out.    Poor  Mr.  Baggins  –  it  was  a  weary  long  time  that  he  lived  in  that  place  all  alone,  and  always  in  hiding,  never  daring  to  take  off  his  ring,  hardly  daring  to  sleep,  even  tucked  away  in  the  darkest  and  remotest  comers  he  could  find.  For  something  to  do  he  took  to wandering  about  the  Elven-king's palace. Magic shut  the  gates,  but  be  could  sometimes  get  out,  if  he  was  quick.  Companies  of  the  Wood-elves,  sometimes with  the  king  at  their  head, would  from  time  to  time  ride  out  to hunt, or  to other business  in  the woods and in the lands to the East. Then if  Bilbo  was  very  nimble,  he  could  slip  out  just  behind  them;  though  it  was  a   ####-dangerous  thing  to do. More  than once he was nearly caught  in  the doors, as  they  clashed  together  when  the  last  elf  passed;  yet  he  did  not  dare  to  march  among  them  because  of  his  shadow  (altogether  thin  and wobbly  as  it was  in  torch-light),  or  for  fear  of  being  bumped  into  and  discovered. And when  he  did  go  out, which  was  not  very  often,  he  did  no  good.  He  did  not  wish  to  desert  the  dwarves, and  indeed he did not know where in the world to go without them. He could not keep  up  with  the  hunting  elves  all  the  time  they  were  out,  so  he  never  discovered  the  ways  out  of  the wood,  and was  left  to wander miserably  in  the  forest,  terrified  of  losing  himself,  until  a  chance  came  of  returning. He was  hungry  too  outside,  for  he was  no  hunter;  but  inside  the  caves  he  could  pick  up  a  living  of  some  sort  by  stealing  food  from  store  or  table  when  no  one  was  at  hand.  \"I  am  like  a  burglar  that  can't  get  away,  but must  go  on miserably  burgling  the  same  house  day  after  day,\"  he  thought.  \"This  is  the  dreariest  and  dullest  part  of  all  this  wretched,  tiresome,  uncomfortable  adventure!  I  wish  I  was  back  in  my  hobbit-hole  by my  own warm fireside with the lamp shining!\" He often wished, too, that he could get  a message for help sent to the wizard, but that of course was quite impossible; and  he soon  realized  that  if anything was  to be done,  it would have  to be done by Mr.  Baggins, alone and unaided.  Eventually,  after  a week  or  two  of  this  sneaking  sort  of  life,  by watching  and  following  the  guards  and  taking  what  chances  he  could,  he  managed  to  find  out  where each dwarf was kept. He found all their twelve cells in different parts of the  palace,  and  after  a  time  he  got  to  know  his  way  about  very  well.  What  was  his  surprise one day to overhear some of the guards talking and to learn that there was  another dwarf in prison too, in a specially deep dark place. He guessed at once, of  course,  that  that was  Thorin;  and  after  a while he  found  that his guess was  right.  At  last  after  many  difficulties  he  managed  to  find  the  place  when  no  one  was  about, and to have a word with the chief of the dwarves. Thorin was too wretched  to  be  angry  any  longer  at  his  misfortunes,  and  was  even  beginning  to  think  of  telling the king all about his treasure and his quest (which shows how low-spirited  he had become), when he heard Bilbo's little voice at his keyhole. He could hardly  believe  his  ears.  Soon  however  he  made  up  his  mind  that  he  could  not  be  mistaken, and he came  to  the door and had a  long whispered  talk with  the hobbit  on the other side.  So  it was  that Bilbo was  able  to  take  secretly Thorin's message  to  each of  the  other  imprisoned  dwarves,  telling  them  that  Thorin  their  chief was  also  in prison  close  at  hand,  and  that  no  one was  to  reveal  their  errand  to  the  long,  not  yet,  not  before  Thorin  gave  the  word.  For  Thorin  had  taken  heart  again  hearing  how  the   ####-hobbit  had  rescued  his  companions  from  the  spiders,  and  was  determined  once  more  not  to  ransom  himself  with  promises  to  the  king  of  a  share  in  the  treasure,  until  all  hope  of  escaping  in  any  other  way  had  disappeared;  until  in  fact  the  remarkable Mr."
}