{
  "id": "6b5b4e9ef94a16920cb044c2feace7efc33b42bb",
  "text": "  You may enter. They may not.   A small victory, he thought, but sweet. He had passed his first test. Tyrion Lannister shouldered through the door, feeling almost tall. Five members of the king’s small council broke off their discussion suddenly.  You,  his sister Cersei said in a tone that was equal parts disbelief and distaste.   I can see where Joffrey learned his courtesies.  Tyrion paused to admire the pair of Valyrian sphinxes that guarded the door, affecting an air of casual confidence. Cersei could smell weakness the way a dog smells fear.   What are you doing here?  His sister’s lovely green eyes studied him without the least hint of affection.   Delivering a letter from our lord father.  He sauntered to the table and placed the tightly rolled parchment between them.  The eunuch Varys took the letter and turned it in his delicate powdered hands.  How kind of Lord Tywin. And his scaling wax is such a lovely shade of gold.  Varys gave the seal a close inspection.  It gives every appearance of being genuine.    Of course it’s genuine.  Cersei snatched it out of his hands. She broke the wax and unrolled the parchment.  Tyrion watched her read. His sister had taken the king’s seat for herself—he gathered Joffrey did not often trouble to attend council meetings, no more than Robert had—so Tyrion climbed up into the Hand’s chair. it seemed only appropriate.   This is absurd,  the queen said at last.  My lord father has sent my brother to sit in his place in this council. He bids us accept Tyrion as the Hand of the King, until such time as he himself can join us.   Grand Maester Pycelle stroked his flowing white beard and nodded ponderously.  It would seem that a welcome is in order.    Indeed.  Jowly, balding Janos Slynt looked rather like a frog, a smug frog who had gotten rather above himself.  We have sore need of you, my lord. Rebellion everywhere, this grim omen in the sky, rioting in the city streets…    And whose fault is that, Lord Janos?  Cersei lashed out.  Your gold cloaks are charged with keeping order. As to you, Tyrion, you could better serve us on the field of battle.   He laughed.  No, I’m done with fields of battle, thank you. I sit a chair better than a horse, and I’d sooner hold a wine goblet than a battle-axe. All that about the thunder of the drums, sunlight flashing on armor, magnificent destriers snorting and prancing? Well, the drums gave me headaches, the sunlight flashing on my armor cooked me up like a harvest day goose, and those magnificent destriers shit everywhere. Not that I am complaining. Compared to the hospitality I enjoyed in the Vale of Arryn, drums, horseshit, and fly bites are my favorite things.   Littlefinger laughed.  Well said, Lannister. A man after my own heart.   Tyrion smiled at him, remembering a certain dagger with a dragonbone hilt and a Valyrian steel blade. We must have a talk about that, and soon. He wondered if Lord Petyr would find that subject amusing as well.  Please,  he told them,  do let me be of service, in whatever small way I can.   Cersei read the letter again.  How many men have you brought with you?     A few hundred. My own men, chiefly. Father was loath to part with any of his. He is fighting a war, after all.    What use will your few hundred men be if Renly marches on the city, or Stannis sails from Dragonstone? I ask for an army and my father sends me a dwarf. The king names the Hand, with the consent of council. Joffrey named our lord father.    And our lord father named me.    He cannot do that. Not without Joff’s consent.    Lord Tywin is at Harrenhal with his host, if you’d care to take it up with him,  Tyrion said politely.  My lords, perchance you would permit me a private word with my sister?   Varys slithered to his feet, smiling in that unctuous way he had.  How you must have yearned for the sound of your sweet sister’s voice. My lords, please, let us give them a few moments together. The woes of our troubled realm shall keep.   Janos Slynt rose hesitantly and Grand Maester Pycelle ponderously, yet they rose. Littlefinger was the last.  Shall I tell the steward to prepare chambers in Maegor’s Holdfast?    My thanks, Lord Petyr, but I will be taking Lord Stark’s former quarters in the Tower of the Hand.   Littlefinger laughed.  You’re a braver man than me, Lannister. You do know the fate of our last two Hands?    Two? If you mean to frighten me, why not say four?    Four?  Littlefinger raised an eyebrow.  Did the Hands before Lord Arryn meet some dire end in the Tower? I’m afraid I was too young to pay them much mind.    Aerys Targaryen’s last Hand was killed during the Sack of King’s Landing, though I doubt he’d had time to settle into the Tower. He was only Hand for a fortnight. The one before him was burned to death. And before them came two others who died landless and penniless in exile, and counted themselves lucky. I believe my lord father was the last Hand to depart King’s Landing with his name, properties, and parts all intact."
}