{
  "id": "6b5e5ce10251b73c6620a16a46414855fbccff24",
  "text": "  Ah, damn you, Ned, why are you always right?   The squires smiled nervously until the king turned on them.  You. Yes, both of you. You heard the Hand. The king is too fat for his armor. Go find Ser Aron Santagar. Tell him I need the breastplate stretcher. Now! What are you waiting for?   The boys tripped over each other in their haste to be quit of the tent. Robert managed to keep a stern face until they were gone. Then he dropped back into a chair, shaking with laughter.  Ser Barristan Selmy chuckled with him. Even Eddard Stark managed a smile. Always, though, the graver thoughts crept in. He could not help taking note of the two squires: handsome boys, fair and well made. One was Sansa’s age, with long golden curls; the other perhaps fifteen, sandy-haired, with a wisp of a mustache and the emerald-green eyes of the queen.   Ah, I wish I could be there to see Santagar’s face,  Robert said.  I hope he’ll have the wit to send them to someone else. We ought to keep them running all day!    Those boys,  Ned asked him.  Lannisters?   Robert nodded, wiping tears from his eyes.  Cousins. Sons of Lord Tywin’s brother. One of the dead ones. Or perhaps the live one, now that I come to think on it. I don’t recall. My wife comes from a very large family, Ned.   A very ambitious family, Ned thought. He had nothing against the squires, but it troubled him to see Robert surrounded by the queen’s kin, waking and sleeping. The Lannister appetite for offices and honors seemed to know no bounds.  The talk is you and the queen had angry words last night.   The mirth curdled on Robert’s face.  The woman tried to forbid me to fight in the melee. She’s sulking in the castle now, damn her. Your sister would never have shamed me like that.    You never knew Lyanna as I did, Robert,  Ned told him.  You saw her beauty, but not the iron underneath. She would have told you that you have no business in the melee.    You too?  The king frowned.  You are a sour man, Stark. Too long in the north, all the juices have frozen inside you. Well, mine are still running.  He slapped his chest to prove it.   You are the king,  Ned reminded him.   I sit on the damn iron seat when I must. Does that mean I don’t have the same hungers as other men? A bit of wine now and again, a girl squealing in bed, the feel of a horse between my legs? Seven hells, Ned, I want to hit someone.   Ser Barristan Selmy spoke up.  Your Grace,  he said,  it is not seemly that the king should ride into the melee. It would not be a fair contest. Who would dare strike you?   Robert seemed honestly taken aback.  Why, all of them, damn it. If they can. And the last man left standing…    …will be you,  Ned finished. He saw at once that Selmy had hit the mark. The dangers of the melee were only a savor to Robert, but this touched on his pride.  Ser Barristan is right. There’s not a man in the Seven Kingdoms who would dare risk your displeasure by hurting you.   The king rose to his feet, his face flushed.  Are you telling me those prancing cravens will let me win?    For a certainty,  Ned said, and Ser Barristan Selmy bowed his head in silent accord.  For a moment Robert was so angry he could not speak. He strode across the tent, whirled, strode back, his face dark and angry. He snatched up his breastplate from the ground and threw it at Barristan Selmy in a wordless fury. Selmy dodged.  Get out,  the king said then, coldly.  Get out before I kill you.   Ser Barristan left quickly. Ned was about to follow when the king called out again.  Not you, Ned.   Ned turned back. Robert took up his horn again, filled it with beer from a barrel in the corner, and thrust it at Ned.  Drink,  he said brusquely.   I’ve no thirst—    Drink. Your king commands it.   Ned took the horn and drank. The beer was black and thick, so strong it stung the eyes.  Robert sat down again.  Damn you, Ned Stark. You and Jon Arryn, I loved you both. What have you done to me? You were the one should have been king, you or Jon.    You had the better claim, Your Grace.    I told you to drink, not to argue. You made me king, you could at least have the courtesy to listen when I talk, damn you. Look at me, Ned. Look at what kinging has done to me. Gods, too fat for my armor, how did it ever come to this?    Robert…    Drink and stay quiet, the king is talking. I swear to you, I was never so alive as when I was winning this throne, or so dead as now that I’ve won it. And Cersei… I have Jon Arryn to thank for her. I had no wish to marry after Lyanna was taken from me, but Jon said the realm needed an heir. Cersei Lannister would be a good match, he told me, she would bind Lord Tywin to me should Viserys Targaryen ever try to win back his father’s throne.  The king shook his head.  I loved that old man, I swear it, but now I think he was a bigger fool than Moon Boy. Oh, Cersei is lovely to look at, truly, but cold… the way she guards her cunt, you’d think she had all the gold of Casterly Rock between her legs. Here, give me that beer if you won’t drink it."
}