{
  "id": "6b92e22852bcae3db75b63275b017b09467bd749",
  "text": " What was happening to her?  I don’t understand,  she said, more loudly. Why was it so hard to talk here?  Help me. Show me.   …help her… the whispers mocked… show her…  Then phantoms shivered through the murk, images in indigo. Viserys screamed as the molten gold ran down his cheeks and filled his mouth. A tall lord with copper skin and silver-gold hair stood beneath the banner of a fiery stallion, a burning city behind him. Rubies flew like drops of blood from the chest of a dying prince, and he sank to his knees in the water and with his last breath murmured a woman’s name… mother of dragons, daughter of death… Glowing like sunset, a red sword was raised in the hand of a blue-eyed king who cast no shadow. A cloth dragon swayed on poles amidst a cheering crowd. From a smoking tower, a great stone beast took wing, breathing shadow fire… mother of dragons, slayer of lies… Her silver was trotting through the grass, to a darkling stream beneath a sea of stars. A corpse stood at the prow of a ship, eyes bright in his dead face, grey lips smiling sadly. A blue flower grew from a chink in a wall of ice, and filled the air with sweetness… mother of dragons, bride of fire…  Faster and faster the visions came, one after the other, until it seemed as if the very air had come alive. Shadows whirled and danced inside a tent, boneless and terrible. A little girl ran barefoot toward a big house with a red door. Mirri Maz Duur shrieked in the flames, a dragon bursting from her brow. Behind a silver horse the bloody corpse of a naked man bounced and dragged. A white lion ran through grass taller than a man. Beneath the Mother of Mountains, a line of naked crones crept from a great lake and knelt shivering before her, their grey heads bowed. Ten thousand slaves lifted bloodstained hands as she raced by on her silver, riding like the wind.  Mother!  they cried.  Mother, mother!  They were reaching for her, touching her, tugging at her cloak, the hem of her skirt, her foot, her leg, her breast. They wanted her, needed her, the fire, the life, and Dany gasped and opened her arms to give herself to them…  But then black wings buffeted her round the head, and a scream of fury cut the indigo air, and suddenly the visions were gone, ripped away, and Dany’s gasp turned to horror. The Undying were all around her, blue and cold, whispering as they reached for her, pulling, stroking, tugging at her clothes, touching her with their dry cold hands, twining their fingers through her hair. All the strength had left her limbs. She could not move. Even her heart had ceased to beat. She felt a hand on her bare breast, twisting her nipple. Teeth found the soft skin of her throat. A mouth descended on one eye, licking, sucking, biting…  Then indigo turned to orange, and whispers turned to screams. Her heart was pounding, racing, the hands and mouths were gone, heat washed over her skin, and Dany blinked at a sudden glare. Perched above her, the dragon spread his wings and tore at the terrible dark heart, ripping the rotten flesh to ribbons, and when his head snapped forward, fire flew from his open jaws, bright and hot. She could hear the shrieks of the Undying as they burned, their high thin papery voices crying out in tongues long dead. Their flesh was crumbling parchment, their bones dry wood soaked in tallow. They danced as the flames consumed them; they staggered and writhed and spun and raised blazing hands on high, their fingers bright as torches.  Dany pushed herself to her feet and bulled through them. They were light as air, no more than husks, and they fell at a touch. The whole room was ablaze by the time she reached the door.  Drogon,  she called, and he flew to her through the fire.  Outside a long dim passageway stretched serpentine before her, lit by the flickering orange glare from behind. Dany ran, searching for a door, a door to her right, a door to her left, any door, but there was nothing, only twisty stone walls, and a floor that seemed to move slowly under her feet, writhing as if to trip her. She kept her feet and ran faster, and suddenly the door was there ahead of her, a door like an open mouth.  When she spilled out into the sun, the bright light made her stumble. Pyat Pree was gibbering in some unknown tongue and hopping from one foot to the other. When Dany looked behind her, she saw thin tendrils of smoke forcing their way through cracks in the ancient stone walls of the Palace of Dust, and rising from between the black tiles of the roof.  Howling curses, Pyat Pree drew a knife and danced toward her, but Drogon flew at his face. Then she heard the crack of Jhogo’s whip, and never was a sound so sweet. The knife went flying, and an instant later Rakharo was slamming Pyat to the ground. Ser Jorah Mormont knelt beside Dany in the cool green grass and put his arm around her shoulder.      TYRION   If you die stupidly, I’m going to feed your body to the goats,  Tyrion threatened as the first load of Stone Crows pushed off from the quay."
}