{
  "id": "6b9bf7eae9c50f70819c71727aadef4e3fa7268e",
  "text": " It had been built long ago when the traffic  on the roads had been far greater. For Bree stood at an old meeting of ways;   another ancient road  crossed  the  East  Road  just outside (he dike at the  western end of the village, and in former days Men and other folk of various  sorts had travelled much on it. Strange as News from Bree was still a saying   ####-in the  Eastfarthing, descending from  those days,  when  news  from  North,  South, and East could be heard in the inn,  and when  the Shire-hobbits used  to go more often to hear it.  But the Northern Lands had long been desolate,   and  the  North  Road  was now  seldom  used: it was  grass-grown,  and  the  Bree-folk called it the Greenway.       The Inn  of Bree  was still  there, however, and  the  innkeeper was an  important person. His house was a meeting place for the idle, talkative, and  inquisitive  among the inhabitants, large and  small, of the four  villages;   and a resort of Rangers and other wanderers, and for such travellers (mostly  dwarves) as still journeyed on the East Road, to and from the Mountains.        It  was  dark,  and  white  stars  were  shining,  when  Frodo and  his  companions came at last to the Greenway-crossing and drew near the  village.  They came to the West -gate and found it shut, but  at the door  of the lodge  beyond it, there was a man sitting. He jumped up and  fetched a lantern  and  looked over  the gate at them in surprise.       'What do you want, and where do you come from?' he asked gruffly.       'We are making for  the inn here,' answered Frodo.  'We are  journeying  east and cannot go further tonight.'       'Hobbits! Four  hobbits! And what's more,  out  of  the Shire  by their  talk,' said the gatekeeper, softly as if  speaking to himself. He  stared at  them darkly for a moment, and then slowly  opened the gate and let them ride  through.       'We don't  often see Shire-folk riding on the Road  at  night,' he went  on, as they halted  a moment by his door. 'You'll pardon  my wondering  what  business takes you away east of Bree! What may your names be, might I ask?'       'Our names and our business are our own,  and this does not seem a good   place  to  discuss them,' said Frodo, not liking the look of  the man or  the  tone of his voice.       'Your  business is  your  own, no doubt,'  said  the man; 'but it's  my  business to ask questions after nightfall.'       'We  are hobbits  from Buckland, and we have a  fancy to travel and  to  stay at the  inn here,' put  in Merry. 'I am  Mr. Brandybuck. Is that enough  for  you?  The Bree-folk used  to be fair-spoken to travellers,  or so I had  heard.'       'All right, all right!' said the man.  'I  meant no offence. But you'll  find  maybe that more  folk  than old Harry  at the  gate will be asking you   questions. There's queer folk about. If you go  on to  The Pony, you'll find   ####-you're oat the only guests.'       He wished  them  good night, and they said no more; but Frodo could see  in  the lantern-light  that the  man was still eyeing them curiously. He was  glad to  hear  the gate clang  to  behind  them,  as they rode  forward.  He  wondered why the man was  so suspicious, and whether any one had been  asking  for news of a party of hobbits. Could  it have been Gandalf? He  might  have  arrived, while they  were delayed in the Forest and the Downs. But there was  something in the look and the voice of the gatekeeper that made him uneasy.        The man stared after the hobbits for a moment, and then he went back to   his house. As soon as his  back was turned, a dark figure climbed quickly in   over the gate and melted into the shadows of the village street.       The  hobbits rode on up a  gentle slope, passing a few detached  houses,  and  drew up outside the  inn. The houses looked large  and strange to them.   Sam stared up at the inn  with its three  storeys and many windows, and felt  his  heart sink. He  had imagined  himself meeting giants taller than trees,  and other creatures  even more terrifying, some time or other  in the course  of his journey; but at the moment he was finding his first sight of  Men and  their tall houses quite enough, indeed too much for the dark end of a tiring  day. He  pictured  black horses standing all  saddled in  the shadows of the  inn-yard, and Black Riders peering out of dark upper windows.       'We  surely aren't going  to stay here for the night,  are we, sir?' he  exclaimed. 'If there are hobbit-folk  in these  pans, why  don't we look for   some  that would be willing to take us in? It would be more homelike.'       'What's wrong with the inn?' said Frodo. 'Tom Bombadil  recommended it.  I expect it's homelike enough inside.'       Even from the outside the inn looked a pleasant house to familiar eyes.  It had a front on  the Road, and two wings running  back on land partly  cut  out  of the lower  slopes of the hill, so  that at the rear the second-floor  windows were level  with the  ground."
}