{
  "id": "6be7c8d34e227d4ace39cb78013249b2f4a1d562",
  "text": " Elsewhere the golden dome of the Temple of the Graces blazed bright, and bronze stars winked along the walls where the light of the rising sun touched the spikes on the helms of the Unsullied. On the terrace, a few flies stirred sluggishly. A bird began to chirp in the persimmon tree, and then two more. Dany cocked her head to hear their song, but it was not long before the sounds of the waking city drowned them out.  The sounds of my city.  That morning she summoned her captains and commanders to the garden, rather than descending to the audience chamber.  Aegon the Conqueror brought fire and blood to Westeros, but afterward he gave them peace, prosperity, and justice. But all I have brought to Slaver’s Bay is death and ruin. I have been more khal than queen, smashing and plundering, then moving on.    There is nothing to stay for,  said Brown Ben Plumm.   Your Grace, the slavers brought their doom on themselves,  said Daario Naharis.   You have brought freedom as well,  Missandei pointed out.   Freedom to starve?  asked Dany sharply.  Freedom to die? Am I a dragon, or a harpy?  Am I mad? Do I have the taint?   A dragon,  Ser Barristan said with certainty.  Meereen is not Westeros, Your Grace.    But how can I rule seven kingdoms if I cannot rule a single city?  He had no answer to that. Dany turned away from them, to gaze out over the city once again.  My children need time to heal and learn. My dragons need time to grow and test their wings. And I need the same. I will not let this city go the way of Astapor. I will not let the harpy of Yunkai chain up those I’ve freed all over again.  She turned back to look at their faces.  I will not march.    What will you do then, Khaleesi?  asked Rakharo.   Stay,  she said.  Rule. And be a queen.       Jaime   The king sat at the head of the table, a stack of cushions under his arse, signing each document as it was presented to him.   Only a few more, Your Grace,  Ser Kevan Lannister assured him.  This is a bill of attainder against Lord Edmure Tully, stripping him of Riverrun and all its lands and incomes, for rebelling against his lawful king. This is a similar attainder, against his uncle Ser Brynden Tully, the Blackfish.  Tommen signed them one after the other, dipping the quill carefully and writing his name in a broad childish hand.  Jaime watched from the foot of the table, thinking of all those lords who aspired to a seat on the king’s small council. They can bloody well have mine. If this was power, why did it taste like tedium? He did not feel especially powerful, watching Tommen dip his quill in the inkpot again. He felt bored.  And sore. Every muscle in his body ached, and his ribs and shoulders were bruised from the battering they’d gotten, courtesy of Ser Addam Marbrand. Just thinking of it made him wince. He could only hope the man would keep his mouth shut. Jaime had known Marbrand since he was a boy, serving as a page at Casterly Rock; he trusted him as much as he trusted anyone. Enough to ask him to take up shields and tourney swords. He had wanted to know if he could fight with his left hand.  And now I do. The knowledge was more painful than the beating that Ser Addam had given him, and the beating was so bad he could hardly dress himself this morning. If they had been fighting in earnest, Jaime would have died two dozen deaths. It seemed so simple, changing hands. It wasn’t. Every instinct he had was wrong. He had to think about everything, where once he’d just moved. And while he was thinking, Marbrand was thumping him. His left hand couldn’t even seem to hold a longsword properly; Ser Addam had disarmed him thrice, sending his blade spinning.   This grants said lands, incomes, and castle to Ser Emmon Frey and his lady wife, Lady Genna.  Ser Kevan presented another sheaf of parchments to the king. Tommen dipped and signed.  This is a decree of legitimacy for a natural son of Lord Roose Bolton of the Dreadfort. And this names Lord Bolton your Warden of the North.  Tommen dipped, signed, dipped, signed.  This grants Ser Rolph Spicer title to the castle Castamere and raises him to the rank of lord.  Tommen scrawled his name.  I should have gone to Ser Ilyn Payne, Jaime reflected. The King’s Justice was not a friend as Marbrand was, and might well have beat him bloody… but without a tongue, he was not like to boast of it afterward. All it would take would be one chance remark by Ser Addam in his cups, and the whole world would soon know how useless he’d become. Lord Commander of the Kingsguard. It was a cruel jape, that… though not quite so cruel as the gift his father had sent him.   This is your royal pardon for Lord Gawen Westerling, his lady wife, and his daughter Jeyne, welcoming them back into the king’s peace,  Ser Kevan said.  This is a pardon for Lord Jonos Bracken of Stone Hedge. This is a pardon for Lord Vance. This for Lord Goodbrook. This for Lord Mooton of Maidenpool.   Jaime pushed himself to his feet.  You seem to have these matters well in hand, Uncle."
}