{
  "id": "6bee00183ce22e4c109ff5517dc0735fda6eebc0",
  "text": " Your brother won it from Lord Baelish at the tourney on Prince Joffrey’s name day.   Lannister poured, drank, poured, and stared into his wine cup.  This wine seems to be improving as I drink it. Imagine that. I seem to remember that dagger, now that you describe it. Won it, you say? How?    Wagering on you when you tilted against the Knight of Flowers.  Yet when she heard her own words Catelyn knew she had gotten it wrong.  No… was it the other way?    Tyrion always backed me in the lists,  Jaime said,  but that day Ser Loras unhorsed me. A mischance, I took the boy too lightly, but no matter. Whatever my brother wagered, he lost… but that dagger did change hands, I recall it now. Robert showed it to me that night at the feast. His Grace loved to salt my wounds, especially when drunk. And when was he not drunk?   Tyrion Lannister had said much the same thing as they rode through the Mountains of the Moon, Catelyn remembered. She had refused to believe him. Petyr had sworn otherwise, Petyr who had been almost a brother, Petyr who loved her so much he fought a duel for her hand… and yet if Jaime and Tyrion told the same tale, what did that mean? The brothers had not seen each other since departing Winterfell more than a year ago.  Are you trying to deceive me?  Somewhere there was a trap here.   I’ve admitted to shoving your precious urchin out a window, what would it gain me to lie about this knife?  He tossed down another cup of wine.  Believe what you will, I’m past caring what people say of me. And it’s my turn. Have Robert’s brothers taken the field?    They have.    Now there’s a niggardly response. Give me more than that, or your next answer will be as poor.    Stannis marches against King’s Landing,  she said grudgingly.  Renly is dead, murdered at Bitterbridge by his brother, through some black art I do not understand.    A pity,  Jaime said.  I rather liked Renly, though Stannis is quite another tale. What side have the Tyrells taken?    Renly, at first. Now, I could not say.    Your boy must be feeling lonely.    Robb was sixteen a few days past… a man grown, and a king. He’s won every battle he’s fought. The last word we had from him, he had taken the Crag from the Westerlings.    He hasn’t faced my father yet, has he?    When he does, he’ll defeat him. As he did you.    He took me unawares. A craven’s trick.    You dare talk of tricks? Your brother Tyrion sent us cutthroats in envoy’s garb, under a peace banner.    If it were one of your sons in this cell, wouldn’t his brothers do as much for him?   My son has no brothers, she thought, but she would not share her pain with a creature such as this.  Jaime drank some more wine.  What’s a brother’s life when honor is at stake, eh?  Another sip.  Tyrion is clever enough to realize that your son will never consent to ransom me.   Catelyn could not deny it.  Robb’s bannermen would sooner see you dead. Rickard Karstark in particular. You slew two of his sons in the Whispering Wood.    The two with the white sunburst, were they?  Jaime gave a shrug.  If truth be told, it was your son that I was trying to slay. The others got in my way. I killed them in fair fight, in the heat of battle. Any other knight would have done the same.    How can you still count yourself a knight, when you have forsaken every vow you ever swore?   Jaime reached for the flagon to refill his cup.  So many vows… they make you swear and swear. Defend the king. Obey the king. Keep his secrets. Do his bidding. Your life for his. But obey your father. Love your sister. Protect the innocent. Defend the weak. Respect the gods. Obey the laws. It’s too much. No matter what you do, you’re forsaking one vow or the other.  He took a healthy swallow of wine and closed his eyes for an instant, leaning his head back against the patch of nitre on the wall.  I was the youngest man ever to wear the white cloak.    And the youngest to betray all it stood for, Kingslayer.    Kingslayer,  he pronounced carefully.  And such a king he was!  He lifted his cup.  To Aerys Targaryen, the Second of His Name, Lord of the Seven Kingdoms and Protector of the Realm. And to the sword that opened his throat. A golden sword, don’t you know. Until his blood ran red down the blade. Those are the Lannister colors, red and gold.   As he laughed, she realized the wine had done its work; Jaime had drained most of the flagon, and he was drunk.  Only a man like you would be proud of such an act.    I told you, there are no men like me. Answer me this, Lady Stark—did your Ned ever tell you the manner of his father’s death? Or his brother’s?    They strangled Brandon while his father watched, and then killed Lord Rickard as well.  An ugly tale, and sixteen years old. Why was he asking about it now?   Killed, yes, but how?    The cord or the axe, I suppose.   Jaime took a swallow, wiped his mouth.  No doubt Ned wished to spare you. His sweet young bride, if not quite a maiden. Well, you wanted truth. Ask me. We made a bargain, I can deny you nothing."
}