{
  "id": "6c33e654f7028a459bce8892614d3713e838a735",
  "text": "\"  Harry nodded, but he couldn't shake off a lurking feeling that there was something he'd forgotten to do, something important. When he tried to explain this, Hermione said, \"That's just the exams. I woke up last night and was halfway through my Transfiguration notes before I remembered we'd done that one.\"  Harry was quite sure the unsettled feeling didn't have anything to do with work, though. He watched an owl flutter toward the school across the bright blue sky, a note clamped in its mouth. Hagrid was the only one who ever sent him letters. Hagrid would never betray Dumbledore. Hagrid would never tell anyone how to get past Fluffy... never... but --  Harry suddenly jumped to his feet.  \"Where're you going?\" said Ron sleepily.  \"I've just thought of something,\" said Harry. He had turned white. \"We've got to go and see Hagrid, now.\"  \"Why?\" panted Hermione, hurrying to keep up.  \"Don't you think it's a bit odd,\" said Harry, scrambling up the grassy slope, \"that what Hagrid wants more than anything else is a dragon, and a stranger turns up who just happens to have an egg in his pocket? How many people wander around with dragon eggs if it's against wizard law? Lucky they found Hagrid, don't you think? Why didn't I see it before?\"  \"What are you talking about?\" said Ron, but Harry, sprinting across the grounds toward the forest, didn't answer.  Hagrid was sitting in an armchair outside his house; his trousers and sleeves were rolled up, and he was shelling peas into a large bowl.  \"Hullo,\" he said, smiling. \"Finished yer exams? Got time fer a drink?\"  \"Yes, please,\" said Ron, but Harry cut him off.  \"No, we're in a hurry. Hagrid, I've got to ask you something. You know that night you won Norbert? What did the stranger you were playing cards with look like?\"  \"Dunno,\" said Hagrid casually, \"he wouldn' take his cloak off.\"  He saw the three of them look stunned and raised his eyebrows.  \"It's not that unusual, yeh get a lot o' funny folk in the Hog's Head -- that's the pub down in the village. Mighta bin a dragon dealer, mightn' he? I never saw his face, he kept his hood up.\"  Harry sank down next to the bowl of peas. \"What did you talk to him about, Hagrid? Did you mention Hogwarts at all?\"  \"Mighta come up,\" said Hagrid, frowning as he tried to remember. \"Yeah... he asked what I did, an' I told him I was gamekeeper here.... He asked a bit about the sorta creatures I took after... so I told him... an' I said what I'd always really wanted was a dragon... an' then... I can' remember too well, 'cause he kept buyin' me drinks.... Let's see... yeah, then he said he had the dragon egg an' we could play cards fer it if I wanted... but he had ter be sure I could handle it, he didn' want it ter go ter any old home.... So I told him, after Fluffy, a dragon would be easy...\"  \"And did he -- did he seem interested in Fluffy?\" Harry asked, try ing to keep his voice calm.  \"Well -- yeah -- how many three-headed dogs d'yeh meet, even around Hogwarts? So I told him, Fluffy's a piece o' cake if yeh know how to calm him down, jus' play him a bit o' music an' he'll go straight off ter sleep --\"  Hagrid suddenly looked horrified.  \"I shouldn'ta told yeh that!\" he blurted out. \"Forget I said it! Hey -- where're yeh goin'?\"  Harry, Ron, and Hermione didn't speak to each other at all until they came to a halt in the entrance hall, which seemed very cold and gloomy after the grounds.  \"We've got to go to Dumbledore,\" said Harry. \"Hagrid told that stranger how to get past Fluffy, and it was either Snape or Voldemort under that cloak -- it must've been easy, once he'd got Hagrid drunk. I just hope Dumbledore believes us. Firenze might back us up if Bane doesn't stop him. Where's Dumbledore's office?\"  They looked around, as if hoping to see a sign pointing them in the right direction. They had never been told where Dumbledore lived, nor did they know anyone who had been sent to see him.  \"We'll just have to --\" Harry began, but a voice suddenly rang across the hall.  \"What are you three doing inside?\"  It was Professor McGonagall, carrying a large pile of books.  \"We want to see Professor Dumbledore,\" said Hermione, rather bravely, Harry and Ron thought.  \"See Professor Dumbledore?\" Professor McGonagall repeated, as though this was a very fishy thing to want to do. \"Why?\"  Harry swallowed -- now what?  \"It's sort of secret,\" he said, but he wished at once he hadn't, because Professor McGonagall's nostrils flared.  \"Professor Dumbledore left ten minutes ago,\" she said coldly. \"He received an urgent owl from the Ministry of Magic and flew off for London at once.\"  \"He's gone?\" said Harry frantically. \"Now?\"  \"Professor Dumbledore is a very great wizard, Potter, he has many demands on his time --  \"But this is important.\"  \"Something you have to say is more important than the Ministry of Magic, Potter.  \"Look,\" said Harry, throwing caution to the winds, \"Professor -- it's about the Sorcerer's tone --\"  Whatever Professor McGonagall had expected, it wasn't that."
}