{
  "id": "6cdb0d1b7a253ab69955843618b8d10d4044b810",
  "text": " Though at least his father was giving him significant work to do. He won’t name me heir to Casterly Rock, but he’ll make use of me wherever he can, Tyrion thought, as a captain of gold cloaks waved them through the Mud Gate.  The Three Whores still dominated the market square inside the gate, but they stood idle now, and the boulders and barrels of pitch had all been trundled away. There were children climbing the towering wooden structures, swarming up like monkeys in roughspun to perch on the throwing arms and hoot at each other.   Remind me to tell Ser Addam to post some gold cloaks here,  Tyrion told Bronn as they rode between two of the trebuchets.  Some fool boy’s like to fall off and break his back.  There was a shout from above, and a clod of manure exploded on the ground a foot in front of them. Tyrion’s mare reared and almost threw him.  On second thoughts,  he said when he had the horse in hand,  let the poxy brats splatter on the cobbles like overripe melons.   He was in a black mood, and not just because a few street urchins wanted to pelt him with dung. His marriage was a daily agony. Sansa Stark remained a maiden, and half the castle seemed to know it. When they had saddled up this morning, he’d heard two of the stableboys sniggering behind his back. He could almost imagine that the horses were sniggering as well. He’d risked his skin to avoid the bedding ritual, hoping to preserve the privacy of his bedchamber, but that hope had been dashed quick enough. Either Sansa had been stupid enough to confide in one of her bedmaids, every one of whom was a spy for Cersei, or Varys and his little birds were to blame.  What difference did it make? They were laughing at him all the same. The only person in the Red Keep who didn’t seem to find his marriage a source of amusement was his lady wife.  Sansa’s misery was deepening every day. Tyrion would gladly have broken through her courtesy to give her what solace he might, but it was no good. No words would ever make him fair in her eyes. Or any less a Lannister. This was the wife they had given him, for all the rest of his life, and she hated him.  And their nights together in the great bed were another source of torment. He could no longer bear to sleep naked, as had been his custom. His wife was too well trained ever to say an unkind word, but the revulsion in her eyes whenever she looked on his body was more than he could bear. Tyrion had commanded Sansa to wear a sleeping shift as well. I want her, he realized. I want Winterfell, yes, but I want her as well, child or woman or whatever she is. I want to comfort her. I want to hear her laugh. I want her to come to me willingly, to bring me her joys and her sorrows and her lust. His mouth twisted in a bitter smile. Yes, and I want to be tall as Jaime and as strong as Ser Gregor the Mountain too, for all the bloody good it does.  Unbidden, his thoughts went to Shae. Tyrion had not wanted her to hear the news from any lips but his own, so he had commanded Varys to bring her to him the night before his wedding. They met again in the eunuch’s chambers, and when Shae began to undo the laces of his jerkin, he’d caught her by the wrist and pushed her away.  Wait,  he said,  there is something you must hear. On the morrow I am to be wed…   …to Sansa Stark. I know.   He was speechless for an instant. Even Sansa did not know, not then.  How could you know? Did Varys tell you?    Some page was telling Ser Tallad about it when I took Lollys to the sept. He had it from this serving girl who heard Ser Kevan talking to your father.  She wriggled free of his grasp and pulled her dress up over her head. As ever, she was naked underneath.  I don’t care. She’s only a little girl. You’ll give her a big belly and come back to me.   Some part of him had hoped for less indifference. Had hoped, he jeered bitterly, but now you know better, dwarf. Shae is all the love you’re ever like to have.  Muddy Way was crowded, but soldiers and townfolk alike made way for the Imp and his escort. Hollow-eyed children swarmed underfoot, some looking up in silent appeal whilst others begged noisily. Tyrion pulled a big fistful of coppers from his purse and tossed them in the air, and the children went running for them, shoving and shouting. The lucky ones might be able to buy a heel of stale bread tonight. He had never seen markets so crowded, and for all the food the Tyrells were bringing in, prices remained shockingly high. Six coppers for a melon, a silver stag for a bushel of corn, a dragon for a side of beef or six skinny piglets. Yet there seemed no lack of buyers. Gaunt men and haggard women crowded around every wagon and stall, while others even more ragged looked on sullenly from the mouths of alleys.   This way,  Bronn said, when they reached the foot of the Hook.  If you still mean to…?    I do.  The riverfront had made a convenient excuse, but Tyrion had another purpose today. It was not a task he relished, but it must be done. They turned away from Aegon’s High Hill, into the maze of smaller streets that clustered around the foot of Visenya’s."
}