{
  "id": "6d40cbb285cd3cec030055ea409b25eb6bc8f947",
  "text": " Your skies were too grey, your wines too sweet, your women too chaste, your food too bland… and you yourself were the greatest disappointment of all.    I had just been born. What did you expect of me?    Enormity,  the black-haired prince replied.  You were small, but far-famed. We were in Oldtown at your birth, and all the city talked of was the monster that had been born to the King’s Hand, and what such an omen might foretell for the realm.    Famine, plague, and war, no doubt.  Tyrion gave a sour smile.  It’s always famine, plague, and war. Oh, and winter, and the long night that never ends.    All that,  said Prince Oberyn,  and your father’s fall as well. Lord Tywin had made himself greater than King Aerys, I heard one begging brother preach, but only a god is meant to stand above a king. You were his curse, a punishment sent by the gods to teach him that he was no better than any other man.    I try, but he refuses to learn.  Tyrion gave a sigh.  But do go on, I pray you. I love a good tale.    And well you might, since you were said to have one, a stiff curly tail like a swine’s. Your head was monstrous huge, we heard, half again the size of your body, and you had been born with thick black hair and a beard besides, an evil eye, and lion’s claws. Your teeth were so long you could not close your mouth, and between your legs were a girl’s privates as well as a boy’s.    Life would be much simpler if men could fuck themselves, don’t you agree? And I can think of a few times when claws and teeth might have proved useful. Even so, I begin to see the nature of your complaint.   Bronn gave out with a chuckle, but Oberyn only smiled.  We might never have seen you at all but for your sweet sister. You were never seen at table or hall, though sometimes at night we could hear a baby howling down in the depths of the Rock. You did have a monstrous great voice, I must grant you that. You would wail for hours, and nothing would quiet you but a woman’s teat.    Still true, as it happens.   This time Prince Oberyn did laugh.  A taste we share. Lord Gargalen once told me he hoped to die with a sword in his hand, to which I replied that I would sooner go with a breast in mine.   Tyrion had to grin.  You were speaking of my sister?    Cersei promised Elia to show you to us. The day before we were to sail, whilst my mother and your father were closeted together, she and Jaime took us down to your nursery. Your wet nurse tried to send us off, but your sister was having none of that. ‘He’s mine’, she said, ‘and you’re just a milk cow, you can’t tell me what to do. Be quiet or I’ll have my father cut your tongue out. A cow doesn’t need a tongue, only udders.’    Her Grace learned charm at an early age,  said Tyrion, amused by the notion of his sister claiming him as hers. She’s never been in any rush to claim me since, the gods know.   Cersei even undid your swaddling clothes to give us a better look,  the Dornish prince continued.  You did have one evil eye, and some black fuzz on your scalp. Perhaps your head was larger than most… but there was no tail, no beard, neither teeth nor claws, and nothing between your legs but a tiny pink cock. After all the wonderful whispers, Lord Tywin’s Doom turned out to be just a hideous red infant with stunted legs. Elia even made the noise that young girls make at the sight of infants, I’m sure you’ve heard it. The same noise they make over cute kittens and playful puppies. I believe she wanted to nurse you herself, ugly as you were. When I commented that you seemed a poor sort of monster, your sister said, ‘He killed my mother’, and twisted your little cock so hard I thought she was like to pull it off. You shrieked, but it was only when your brother Jaime said, ‘Leave him be, you’re hurting him’, that Cersei let go of you. ‘It doesn’t matter’, she told us. ‘Everyone says he’s like to die soon. He shouldn’t even have lived this long.’   The sun was shining bright above them, and the day was pleasantly warm for autumn, but Tyrion Lannister went cold all over when he heard that. My sweet sister. He scratched at the scar of his nose and gave the Dornishman a taste of his  evil eye.  Now why would he tell such a tale? Is he testing me, or simply twisting my cock as Cersei did, so he can hear me scream?  Be sure and tell that story to my father. It will delight him as much as it did me. The part about my tail, especially. I did have one, but he had it lopped off.   Prince Oberyn had a chuckle.  You’ve grown more amusing since last we met.    Yes, but I meant to grow taller.    While we are speaking of amusement, I heard a curious tale from Lord Buckler’s steward. He claimed that you had put a tax on women’s privy purses.    It is a tax on whoring,  said Tyrion, irritated all over again. And it was my bloody father’s notion.  Only a penny for each, ah… act. The King’s Hand felt it might help improve the morals of the city.  And pay for Joffrey’s wedding besides. Needless to say, as master of coin, Tyrion had gotten all the blame for it."
}