{
  "id": "6d7dbc64dea964abc68a6199167a4694792223cb",
  "text": " Neville was cowering in his front row seat.  \"I must ask you not to scream,\" said Lockhart in a low voice. \"It might provoke them.\"  As the whole class held its breath, Lockhart whipped off the cover.  \"Yes,\" he said dramatically. \"Freshly caught Cornish pixies. \"  Seamus Finnigan couldn't control himself. He let out a snort of laughter that even Lockhart couldn't mistake for a scream of terror.  \"Yes?\" He smiled at Seamus.  \"Well, they're not - they're not very - dangerous, are they?\" Seamus choked.  \"Don't be so sure!\" said Lockhart, waggling a finger annoyingly at Seamus. \"Devilish tricky little blighters they can be!\"  The pixies were electric blue and about eight inches high, with pointed faces and voices so shrill it was like listening to a lot of budgies arguing. The moment the cover had been removed, they  *101*  had started jabbering and rocketing around, rattling the bars and making bizarre faces at the people nearest them.  \"Right, then,\" Lockhart said loudly. \"Let's see what you make of them!\" And he opened the cage.  It was pandemonium. The pixies shot in every direction like rockets. Two of them seized Neville by the ears and lifted him into the air. Several shot straight through the window, showering the back row with broken glass. The rest proceeded to wreck the classroom more effectively than a rampaging rhino. They grabbed ink bottles and sprayed the class with them, shredded books and papers, tore pictures from the walls, up-ended the waste basket, grabbed bags and books and threw them out of the smashed window; within minutes, half the class was sheltering under desks and Neville was swinging from the iron chandelier in the ceiling.  \"Come on now - round them up, round them up, they're only pixies,\" Lockhart shouted.  He rolled up his sleeves, brandished his wand, and bellowed,  \"Peskipiksi Pesternomi!\"  It had absolutely no effect; one of the pixies seized his wand and threw it out of the window, too. Lockhart gulped and dived under his own desk, narrowly avoiding being squashed by Neville, who fell a second later as the chandelier gave way.  The bell rang and there was a mad rush toward the exit. In the relative calm that followed, Lockhart straightened up, caught sight of Harry, Ron, and Hermione, who were almost at the door, and said, \"Well, I'll ask you three to just nip the rest of them back into their cage.\" He swept past them and shut the door quickly behind him.  *102*  \"Can you believe him?\" roared Ron as one of the remaining pixies bit him painfully on the ear.  \"He just wants to give us some hands-on experience,\" said Hermione, immobilizing two pixies at once with a clever Freezing Charm and stuffing them back into their cage.  \"Hands on? \"said Harry, who was trying to grab a pixie dancing out of reach with its tongue out. \"Hermione, he didn't have a clue what he was doing -\"  \"Rubbish,\" said Hermione. \"You've read his books - look at all those amazing things he's done -\"  \"He says he's done,\" Ron muttered.   arry spent a lot of time over the next few days dodging out of sight whenever he saw Gilderoy Lockhart coming down a corridor. Harder to avoid was Colin Creevey, who seemed to have memorized Harry's schedule. Nothing seemed to give Colin a bigger thrill than to say, \"All right, Harry?\" six or seven times a day and hear, \"Hello, Colin,\" back, however exasperated Harry sounded when he said it.  Hedwig was still angry with Harry about the disasterous car journey and Ron's wand was still malfunctioning, surpassing itself on Friday morning by shooting out of Ron's hand in Charms and hitting tiny old Professor Flitwick squarely between the eyes, creating a large, throbbing green boil where it had struck. So with one thing and another, Harry was quite glad to reach the weekend. He, Ron, and Hermione were planning to visit Hagrid on Saturday morning. Harry, however, was shaken awake several hours earlier  *104*    than he would have liked by Oliver Wood, Captain of the Gryffindor Quidditch team.  \"Whassamatter?\" said Harry groggily.  \"Quidditch practice!\" said Wood. \"Come on!\"  Harry squinted at the window. There was a thin mist hanging across the pink-and-gold sky. Now that he was awake, he couldn't understand how he could have slept through the racket the birds were making.  \"Oliver,\" Harry croaked. \"It's the crack of dawn.\"  \"Exactly,\" said Wood. He was a tall and burly sixth year and, at the moment, his eyes were gleaming with a crazed enthusiasm. \"It's part of our new training program. Come on, grab your broom, and let's go,\" said Wood heartily. \"None of the other teams have started training yet; we're going to be first off the mark this year -\"  Yawning and shivering slightly, Harry climbed out of bed and tried to find his Quidditch robes.  \"Good man,\" said Wood. \"Meet you on the field in fifteen minutes.  When he'd found his scarlet team robes and pulled on his cloak for warmth, Harry scribbled a note to Ron explaining where he'd gone and went down the spiral staircase to the common room, his Nimbus Two Thousand on his shoulder."
}