{
  "id": "6e03274e6a4669f2904441ac0cc76a27b65b7238",
  "text": " Falling, the flaming arrow was swallowed up as well… but only for a heartbeat. Then, sudden as hope, they saw the red bloom flower. The sails took fire, and the fog glowed pink and orange. For a moment Catelyn saw the outline of the boat clearly, wreathed in leaping flames.  Watch for me, little cat, she could hear him whisper.  Catelyn reached out blindly, groping for her brother’s hand, but Edmure had moved away, to stand alone on the highest point of the battlements. Her uncle Brynden took her hand instead, twining his strong fingers through hers. Together they watched the little fire grow smaller as the burning boat receded in the distance.  And then it was gone… drifting downriver still, perhaps, or broken up and sinking. The weight of his armor would carry Lord Hoster down to rest in the soft mud of the riverbed, in the watery halls where the Tullys held eternal court, with schools of fish their last attendants.  No sooner had the burning boat vanished from their sight than Edmure walked off. Catelyn would have liked to embrace him, if only for a moment; to sit for an hour or a night or the turn of a moon to speak of the dead and mourn. Yet she knew as well as he that this was not the time; he was Lord of Riverrun now, and his knights were falling in around him, murmuring condolences and promises of fealty, walling him off from something as small as a sister’s grief. Edmure listened, hearing none of the words.   It is no disgrace to miss your shot,  her uncle told her quietly.  Edmure should hear that. The day my own lord father went downriver, Hoster missed as well.    With his first shaft.  Catelyn had been too young to remember, but Lord Hoster had often told the tale.  His second found the sail.  She sighed. Edmure was not as strong as he seemed. Their father’s death had been a mercy when it came at last, but even so her brother had taken it hard.  Last night in his cups he had broken down and wept, full of regrets for things undone and words unsaid. He ought never to have ridden off to fight his battle on the fords, he told her tearfully; he should have stayed at their father’s bedside.  I should have been with him, as you were,  he said.  Did he speak of me at the end? Tell me true, Cat. Did he ask for me?   Lord Hoster’s last word had been  Tansy,  but Catelyn could not bring herself to tell him that.  He whispered your name,  she lied, and her brother had nodded gratefully and kissed her hand. If he had not tried to drown his grief and guilt, he might have been able to bend a bow, she thought to herself, sighing, but that was something else she dare not say.  The Blackfish escorted her down from the battlements to where Robb stood among his bannermen, his young queen at his side. When he saw her, her son took her silently in his arms.   Lord Hoster looked as noble as a king, my lady,  murmured Jeyne.  Would that I had been given the chance to know him.    And I to know him better,  added Robb.   He would have wished that too,  said Catelyn.  There were too many leagues between Riverrun and Winterfell.  And too many mountains and rivers and armies between Riverrun and the Eyrie, it would seem. Lysa had made no reply to her letter.  And from King’s Landing came only silence as well. By now she had hoped that Brienne and Ser Cleos would have reached the city with their captive. It might even be that Brienne was on her way back, and the girls with her. Ser Cleos swore he would make the Imp send a raven once the trade was made. He swore it! Ravens did not always win through. Some bowman could have brought the bird down and roasted him for supper. The letter that would have set her heart at ease might even now be lying by the ashes of some campfire beside a pile of raven bones.  Others were waiting to offer Robb their consolations, so Catelyn stood aside patiently while Lord Jason Mallister, the Greatjon, and Ser Rolph Spicer spoke to him each in turn. But when Lothar Frey approached, she gave his sleeve a tug. Robb turned, and waited to hear what Lothar would say.   Your Grace.  A plump man in his middle thirties, Lothar Frey had close-set eyes, a pointed beard, and dark hair that fell to his shoulders in ringlets. A leg twisted at birth had earned him the name Lame Lothar. He had served as his father’s steward for the past dozen years.  We are loath to intrude upon your grief, but perhaps you might grant us audience tonight?    It would be my pleasure,  said Robb.  It was never my wish to sow enmity between us.    Nor mine to be the cause of it,  said Queen Jeyne.  Lothar Frey smiled.  I understand, as does my lord father. He instructed me to say that he was young once, and well remembers what it is like to lose one’s heart to beauty.   Catelyn doubted very much that Lord Walder had said any such thing, or that he had ever lost his heart to beauty. The Lord of the Crossing had outlived seven wives and was now wed to his eighth, but he spoke of them only as bedwarmers and brood mares. Still, the words were fairly spoken, and she could scarce object to the compliment."
}