{
  "id": "6ed0ee4e65f4660408918b3ac0b6a35eca2c0a02",
  "text": "  He liked it best when he was with Ron and Hermione and they were talking about other things, or else letting him sit in silence while they played chess.  He felt as though all three of them had reached an understanding they didn't need to put into words; that each was waiting for some sign, some word, of what was going on outside Hogwarts - and that it was useless to speculate about what might be coming until they knew anything for certain.  The only time they touched upon the subject was when Ron told Harry about a meeting Mrs. Weasley had had with Dumbledore before going home. \"She went to ask him if you could come straight to us this summer,\" he said.  \"But he wants you to go back to the Dursleys, at least at first.\" \"Why?\" said Harry. \"She said Dumbledore's got his reasons,\" said Ron, shaking his head darkly.  \"I suppose we've got to trust him, haven't we?\" The only person apart from Ron and Hermione that Harry felt able to talk to was Hagrid.  As there was no longer a Defense Against the Dark Arts teacher, they had those lessons free.  They used the one on Thursday afternoon to go down and visit Hagrid in his cabin.  It was a bright and sunny day; Fang bounded out of the open door as they approached, barking and wagging his tail madly. \"Who's that?\" called Hagrid, coming to the door.  \"Harry!\" He strode out to meet them, pulled Harry into a one-armed hug, ruffled his hair, and said, \"Good ter see yeh, mate.  Good ter see yeh.\" They saw two bucket-size cups and saucers on the wooden table in front of the fireplace when they entered Hagrid's cabin. \"Bin havin' a cuppa with Olympe,\" Hagrid said.  \"She's jus' left.\" \"Who?\"  said Ron curiously. \"Madame Maxime, o' course!\"  said Hagrid. \"You two made up, have you?\"  said Ron. \"Dunno what yeh're talkin' about,\" said Hagrid airily, fetching more cups from the dresser.  When he had made tea and offered around a plate of doughy cookies, he leaned back in his chair and surveyed Harry closely through his beetle-black eyes. \"You all righ'?\"  he said gruffly \"Yeah,\" said Harry. \"No, yeh're not,\" said Hagrid.  \"Course yeh're not. But yeh will be.\" Harry said nothing. \"Knew he was goin' ter come back,\" said Hagrid, and Harry, Ron, and Hermione looked up at him, shocked.  \"Known it fer years.  Harry.  Knew he was out there, bidin' his time.  It had ter happen.  Well, now it has, an' we'll jus' have ter get on with it.  We'll fight.  Migh' be able ter stop him before he gets a good hold.  That's Dumbledores plan, anyway. Great man, Dumbledore.  'S long as we've got him, I'm not too worried.\" Hagrid raised his bushy eyebrows at the disbelieving expressions on their faces. \"No good sittin' worryin' abou' it,\" he said.  \"What's comin' will come, an we'll meet it when it does.  Dumbledore told me wha' you did. Harry.\" Hagrid's chest swelled as he looked at Harry. \"Yeh did as much as yer father would've done, an' I can' give yeh no higher praise than that.\" Harry smiled back at him.  It was the first time he'd smiled in days.  \"What's Dumbledore asked you to do, Hagrid?\"  he asked.  \"He sent Professor McGonagall to ask you and Madame Maxime to meet him - that night.\" \"Got a little job fer me over the summer,\" said Hagrid.  \"Secret, though.  I'm not s'pposed ter talk abou' it, no, not even ter you lot.  Olympe - Madame Maxime ter you - might be comin' with me.  I think she will.  Think I got her persuaded.\" \"Is it to do with Voldemort?\" Hagrid flinched at the sound of the name. \"Migh' be,\" he said evasively.  \"Now . . . who'd like ter come an' visit the las' skrewt with me?  I was jokin' - jokin'!\" he added hastily, seeing the looks on their faces.  It was with a heavy heart that Harry packed his trunk up in the dormitory on the night before his return to Privet Drive.  He was dreading the Leaving Feast, which was usually a cause for celebration, when the winner of the Inter-House Championship would be announced. He had avoided being in the Great Hall when it was full ever since he had left the hospital wing, preferring to eat when it was nearly empty to avoid the stares of his fellow students. When he, Ron, and Hermione entered the Hall, they saw at once that the usual decorations were missing.  The Great Hall was normally decorated with the winning House's colors for the Leaving Feast.  Tonight, however, there were black drapes on the wall behind the teachers' table.  Harry knew instantly that they were there as a mark of respect to Cedric. The real Mad-Eye Moody was at the staff table now, his wooden leg and his magical eye back in place.  He was extremely twitchy, jumping every time someone spoke to him.  Harry couldn't blame him; Moodys fear of attack was bound to have been increased by his ten-month imprisonment in his own trunk.  Professor Karkaroff s chair was empty.  Harry wondered, as he sat down with the other Gryffindors, where Karkaroff was now, and whether Voldemort had caught up with him. Madame Maxime was still there.  She was sitting next to Hagrid.  They were talking quietly together."
}