{
  "id": "6ed2dee620145f0ae2cd3e48caa15f24e7ce1a5a",
  "text": " The bear roared, reared. He saw Jaime and Brienne again and lumbered toward them. More crossbows fired, the quarrels ripping through fur and flesh. At such short range, the bowmen could hardly miss. The shafts hit as hard as maces, but the bear took another step. The poor dumb brave brute. When the beast swiped at him, he danced aside, shouting, kicking sand. The bear turned to follow his tormentor, and took another two quarrels in the back. He gave one last rumbling growl, settled back onto his haunches, stretched out on the bloodstained sand, and died.  Brienne got back to her knees, clutching the sword and breathing short ragged breaths. Steelshanks’s archers were winding their crossbows and reloading while the Bloody Mummers shouted curses and threats at them. Rorge and Three Toes had swords out, Jaime saw, and Zollo was uncoiling his whip.   You thlew my bear!  Vargo Hoat shrieked.   And I’ll serve you the same if you give me trouble,  Steelshanks threw back.  We’re taking the wench.    Her name is Brienne,  Jaime said.  Brienne, the maid of Tarth. You are still maiden, I hope?   Her broad homely face turned red.  Yes.    Oh, good,  Jaime said.  I only rescue maidens.  To Hoat he said,  You’ll have your ransom. For both of us. A Lannister pays his debts. Now fetch some ropes and get us out of here.    Bugger that,  Rorge growled.  Kill them, Hoat. Or you’ll bloody well wish you had!   The Qohorik hesitated. Half his men were drunk, the northmen stone sober, and there were twice as many. Some of the crossbowmen had reloaded by now.  Pull them out,  Hoat said, and then, to Jaime,  I hath chothen to be merthiful. Tell your lord father.    I will, my lord.  Not that it will do you any good.  Not until they were half a league from Harrenhal and out of range of archers on the walls did Steelshanks Walton let his anger show.  Are you mad, Kingslayer? Did you mean to die? No man can fight a bear with his bare hands!    One bare hand and one bare stump,  Jaime corrected.  But I hoped you’d kill the beast before the beast killed me. Elsewise, Lord Bolton would have peeled you like an orange, no?   Steelshanks cursed him roundly for a fool of Lannister, spurred his horse, and galloped away up the column.   Ser Jaime?  Even in soiled pink satin and torn lace, Brienne looked more like a man in a gown than a proper woman.  I am grateful, but… you were well away. Why come back?   A dozen quips came to mind, each crueler than the one before, but Jaime only shrugged.  I dreamed of you,  he said.      Catelyn   Rob bid farewell to his young queen thrice. Once in the godswood before the heart tree, in sight of gods and men. The second time beneath the portcullis, where Jeyne sent him forth with a long embrace and a longer kiss. And finally an hour beyond the Tumblestone, when the girl came galloping up on a well-lathered horse to plead with her young king to take her along.  Robb was touched by that, Catelyn saw, but abashed as well. The day was damp and grey, a drizzle had begun to fall, and the last thing he wanted was to call a halt to his march so he could stand in the wet and console a tearful young wife in front of half his army. He speaks her gently, she thought as she watched them together, but there is anger underneath.  All the time the king and queen were talking, Grey Wind prowled around them, stopping only to shake the water from his coat and bare his teeth at the rain. When at last Robb gave Jeyne one final kiss, dispatched a dozen men to take her back to Riverrun, and mounted his horse once more, the direwolf raced off ahead as swift as an arrow loosed from a longbow.   Queen Jeyne has a loving heart, I see,  said Lame Lothar Frey to Catelyn.  Not unlike my own sisters. Why, I would wager a guess that even now Roslin is dancing round the Twins chanting ‘Lady Tully, Lady Tully, Lady Roslin Tully.’ By the morrow she’ll be holding swatches of Riverrun red-and-blue to her cheek to picture how she’ll look in her bride’s cloak.  He turned in the saddle to smile at Edmure.  But you are strangely quiet, Lord Tully. How do you feel, I wonder?    Much as I did at the Stone Mill just before the warhorns sounded,  Edmure said, only half in jest.  Lothar gave a good-natured laugh.  Let us pray your marriage ends as happily, my lord.   And may the gods protect us if it does not. Catelyn pressed her heels into her horse, leaving her brother and Lame Lothar to each other’s company.  It had been her who had insisted that Jeyne remain at Riverrun, when Robb would sooner have kept her by his side. Lord Walder might well construe the queen’s absence from the wedding as another slight, yet her presence would have been a different sort of insult, salt in the old man’s wound.  Walder Frey has a sharp tongue and a long memory,  she had warned her son.  I do not doubt that you are strong enough to suffer an old man’s rebukes as the price of his allegiance, but you have too much of your father in you to sit there while he insults Jeyne to her face."
}