{
  "id": "6ee17d556dfe0f274d4a216dc00c9bc0e4707071",
  "text": " Wood shattered, and the Hound reeled, fighting to keep his seat. Sansa gasped. A ragged cheer went up from the commons.   I wonder how I ought spend your money,  Littlefinger called down to Lord Renly.  The Hound just managed to stay in his saddle. He jerked his mount around hard and rode back to the lists for the second pass. Jaime Lannister tossed down his broken lance and snatched up a fresh one, jesting with his squire. The Hound spurred forward at a hard gallop. Lannister rode to meet him. This time, when Jaime shifted his seat, Sandor Clegane shifted with him. Both lances exploded, and by the time the splinters had settled, a riderless blood bay was trotting off in search of grass while Ser Jaime Lannister rolled in the dirt, golden and dented.  Sansa said,  I knew the Hound would win.   Littlefinger overheard.  If you know who’s going to win the second match, speak up now before Lord Renly plucks me clean,  he called to her. Ned smiled.   A pity the Imp is not here with us,  Lord Renly said.  I should have won twice as much.   Jaime Lannister was back on his feet, but his ornate lion helmet had been twisted around and dented in his fall, and now he could not get it off. The commons were hooting and pointing, the lords and ladies were trying to stifle their chuckles, and failing, and over it all Ned could hear King Robert laughing, louder than anyone. Finally they had to lead the Lion of Lannister off to a blacksmith, blind and stumbling.  By then Ser Gregor Clegane was in position at the head of the lists. He was huge, the biggest man that Eddard Stark had ever seen. Robert Baratheon and his brothers were all big men, as was the Hound, and back at Winterfell there was a simpleminded stableboy named Hodor who dwarfed them all, but the knight they called the Mountain That Rides would have towered over Hodor. He was well over seven feet tall, closer to eight, with massive shoulders and arms thick as the trunks of small trees. His destrier seemed a pony in between his armored legs, and the lance he carried looked as small as a broom handle.  Unlike his brother, Ser Gregor did not live at court. He was a solitary man who seldom left his own lands, but for wars and tourneys. He had been with Lord Tywin when King’s Landing fell, a new-made knight of seventeen years, even then distinguished by his size and his implacable ferocity. Some said it had been Gregor who’d dashed the skull of the infant prince Aegon Targaryen against a wall, and whispered that afterward he had raped the mother, the Dornish princess Elia, before putting her to the sword. These things were not said in Gregor’s hearing.  Ned Stark could not recall ever speaking to the man, though Gregor had ridden with them during Balon Greyjoy’s rebellion, one knight among thousands. He watched him with disquiet. Ned seldom put much stock in gossip, but the things said of Ser Gregor were more than ominous. He was soon to be married for the third time, and one heard dark whisperings about the deaths of his first two wives. It was said that his keep was a grim place where servants disappeared unaccountably and even the dogs were afraid to enter the hall. And there had been a sister who had died young under queer circumstances, and the fire that had disfigured his brother, and the hunting accident that had killed their father. Gregor had inherited the keep, the gold, and the family estates. His younger brother Sandor had left the same day to take service with the Lannisters as a sworn sword, and it was said that he had never returned, not even to visit.  When the Knight of Flowers made his entrance, a murmur ran through the crowd, and he heard Sansa’s fervent whisper,  Oh, he’s so beautiful.  Ser Loras Tyrell was slender as a reed, dressed in a suit of fabulous silver armor polished to a blinding sheen and filigreed with twining black vines and tiny blue forget-me-nots. The commons realized in the same instant as Ned that the blue of the flowers came from sapphires; a gasp went up from a thousand throats. Across the boy’s shoulders his cloak hung heavy. It was woven of forget-me-nots, real ones, hundreds of fresh blooms sewn to a heavy woolen cape.  His courser was as slim as her rider, a beautiful grey mare, built for speed. Ser Gregor’s huge stallion trumpeted as he caught her scent. The boy from Highgarden did something with his legs, and his horse pranced sideways, nimble as a dancer. Sansa clutched at his arm.  Father, don’t let Ser Gregor hurt him,  she said. Ned saw she was wearing the rose that Ser Loras had given her yesterday. Jory had told him about that as well.   These are tourney lances,  he told his daughter.  They make them to splinter on impact, so no one is hurt.  Yet he remembered the dead boy in the cart with his cloak of crescent moons, and the words were raw in his throat.  Ser Gregor was having trouble controlling his horse. The stallion was screaming and pawing the ground, shaking his head. The Mountain kicked at the animal savagely with an armored boot."
}