{
  "id": "6f1ec3d24230b29423a1876a3f8176baf245d32f",
  "text": " Bran had never seen the old knight look so fierce.  No,  he kept saying.  No. No. No.    They don’t fight very well,  Bran said dubiously. He scratched Summer idly behind the ears as the direwolf tore at a haunch of meat. Bones crunched between his teeth.   For a certainty,  Maester Luwin agreed with a deep sigh. The maester was peering through his big Myrish lens tube, measuring shadows and noting the position of the comet that hung low in the morning sky.  Yet given time… Ser Rodrik has the truth of it, we need men to walk the walls. Your lord father took the cream of his guard to King’s Landing, and your brother took the rest, along with all the likely lads for leagues around. Many will not come back to us, and we must needs find the men to take their places.   Bran stared resentfully at the sweating boys below.  If I still had my legs, I could beat them all.  He remembered the last time he’d held a sword in his hand, when the king had come to Winterfell. It was only a wooden sword, yet he’d knocked Prince Tommen down half a hundred times.  Ser Rodrik should teach me to use a poleaxe. If I had a poleaxe with a big long haft, Hodor could be my legs. We could be a knight together.    I think that… unlikely,  Maester Luwin said.  Bran, when a man fights, his arms and legs and thoughts must be as one.   Below in the yard, Ser Rodrik was yelling.  You fight like a goose. He pecks you and you peck him harder. Parry! Block the blow. Goose fighting will not suffice. If those were real swords, the first peck would take your arm off!  One of the other boys laughed, and the old knight rounded on him.  You laugh. You. Now that is gall. You fight like a hedgehog…    There was a knight once who couldn’t see,  Bran said stubbornly, as Ser Rodrik went on below.  Old Nan told me about him. He had a long staff with blades at both ends and he could spin it in his hands and chop two men at once.    Symeon Star-Eyes,  Luwin said as he marked numbers in a book.  When he lost his eyes, he put star sapphires in the empty sockets, or so the singers claim. Bran, that is only a story, like the tales of Florian the Fool. A fable from the Age of Heroes.  The maester tsked.  You must put these dreams aside, they will only break your heart.   The mention of dreams reminded him.  I dreamed about the crow again last night. The one with three eyes. He flew into my bedchamber and told me to come with him, so I did. We went down to the crypts. Father was there, and we talked. He was sad.    And why was that?  Luwin peered through his tube.   It was something to do about Jon, I think.  The dream had been deeply disturbing, more so than any of the other crow dreams.  Hodor won’t go down into the crypts.   The maester had only been half listening, Bran could tell. He lifted his eye from the tube, blinking.  Hodor won’t…    Go down into the crypts. When I woke, I told him to take me down, to see if Father was truly there. At first he didn’t know what I was saying, but I got him to the steps by telling him to go here and go there, only then he wouldn’t go down. He just stood on the top step and said ‘Hodor,’ like he was scared of the dark, but I had a torch. It made me so mad I almost gave him a swat in the head, like Old Nan is always doing.  He saw the way the maester was frowning and hurriedly added,  I didn’t, though.    Good. Hodor is a man, not a mule to be beaten.    In the dream I flew down with the crow, but I can’t do that when I’m awake,  Bran explained.   Why would you want to go down to the crypts?    I told you. To look for Father.   The maester tugged at the chain around his neck, as he often did when he was uncomfortable.  Bran, sweet child, one day Lord Eddard will sit below in stone, beside his father and his father’s father and all the Starks back to the old Kings in the North… but that will not be for many years, gods be good. Your father is a prisoner of the queen in King’s Landing. You will not find him in the crypts.    He was there last night. I talked to him.    Stubborn boy,  the maester sighed, setting his book aside.  Would you like to go see?    I can’t. Hodor won’t go, and the steps are too narrow and twisty for Dancer.    I believe I can solve that difficulty.   In place of Hodor, the wildling woman Osha was summoned. She was tall and tough and uncomplaining, willing to go wherever she was commanded.  I lived my life beyond the Wall, a hole in the ground won’t fret me none, m’lords,  she said.   Summer, come,  Bran called as she lifted him in wiry-strong arms. The direwolf left his bone and followed as Osha carried Bran across the yard and down the spiral steps to the cold vault under the earth. Maester Luwin went ahead with a torch. Bran did not even mind—too badly—that she carried him in her arms and not on her back. Ser Rodrik had ordered Osha’s chain struck off, since she had served faithfully and well since she had been at Winterfell. She still wore the heavy iron shackles around her ankles—a sign that she was not yet wholly trusted—but they did not hinder her sure strides down the steps."
}