{
  "id": "6f9c7a720834c4c94210f85822747961db5d1ad5",
  "text": "..or had that been the pain in his scar?  And who had the old man been?  For there had definitely been an old man; Harry had watched him fall to the ground.  It was all becoming confused.  Harry put his face into his hands, blocking out his bedroom, trying to hold on to the picture of that dimly lit room, but it was like trying to keep water in his cupped hands; the details were now trickling away as fast as he tried to hold on to them...Voldemort and Wormtail had been talking about someone they had killed, though Harry could not remember the name...and they had been plotting to kill someone else...him!  Harry took his face out of his hands, opened his eyes, and stared around his bedroom as though expecting to see something unusual there.  As it happened, there was an extraordinary number of unusual things in this room.  A large wooden trunk stood open at the foot of his bed, revealing a cauldron, broomstick, black robes, and assorted spellbooks.  Rolls of parchment littered that part of his desk that was not taken up by the large, empty cage in which his snowy owl, Hedwig, usually perched.  On the floor beside his bed a book lay open; Harry had been reading it before he fell asleep last night.  The pictures in this book were all moving.  Men in bright orange robes were zooming in and out of sight on broomsticks, throwing a red ball to one another.  Harry walked over to the book, picked it up, and watched on of the wizards score a spectacular goal by putting the ball through a fifty-foot-high hoop.  Then he snapped the book shut.  Even Quidditch -- in Harry's opinion, the best sport in the world -- couldn't distract him at the moment.  He placed Flying with the Cannons on his bedside table, crossed to the window, and drew back the curtains to survey the street below.  Privet Drive looked exactly as a respectable suburban street would be expected to look inthe early hours of Saturday morning.  All the curtains were closed.  As far as Harry could see through the darkness, there wasn't a living creature in sight, not even a cat.  And yet...and yet...Harry went restlessly back to the bed and sat down on it, running a finger over his scar again.  It wasn't the pain that bothered him; Harry was no stranger to pain and injury.  He had lost all the bones from his right arm once and had them painfully regrown in a night.  The same arm had been pierced by a venemous foot-long fang not long afterward.  Only last year Harry had fallen fifty feet from an airborn broomstick.  He was used to bizarre accidents and injuries; they were unavoidable if you attended Hogwarts School of Witchcraft and Wizardry and had a knack for attracting a lot of trouble.  No, the thing that was bothering Harry was the last time his scar had hurt him, it had been because Voldemort had been close by...But Voldemort couldn't be here, now...The idea of Voldemort lurking in Privet Drive was absurd, impossible...  Harry listened closely to the silence around him.  Was he half expecting to hear the creak of a stair or the swish of a cloak?  And then he jumped slightly as he heard his cousin Dudley give a tremendous grunting snore from the next room.  Harry shook himself mentally; he was being stupid.  There was no one in the house with him except Uncle Vernon, Aunt Petunia, and Dudley, and they were plainly still asleep, their dreams untroubled and painless.  Asleep was the way Harry liked the Dursleys best; it wasn't as though they were ever any help to him awake.  Uncle Vernon, Aunt Petunia, and Dudley were Harry's only living relatives.  They were Muggles who hated and despised magic in any form, which meant that Harry was about as welcome in their house as dry rot.  They had explained away Harry's long absences at Hogwarts over the last three years by telling everyone that he went to St. Brutus's Secure Center for Incurably Criminal Boys.  They knew perfectly well that, as an underage wizard, Harry wasn't allowed to use magic outside Hogwarts, but they were still apt to blame him for anything that went wrong about the house.  Harry had never been able to confide in them or tell them anything about his life in the wizarding world.  The very idea of going to them when they awoke, and telling them about his scar hurting him, and about his worries about Voldemort, was laughable.  And yet it was because of Voldemort that Harry had come to live with the Dursleys in the first place.  If it hadn't been for Voldemort, Harry would not have had the lightning scar on his forehead.  If it hadn't been for Voldemort, Harry would still have had parents...  Harry had been a year old the night that Voldemort -- the most powerful Dark wizard for a century, a wizard who had been gaining power steadily for eleven years -- arrived at his house and killed his father and mother.  Voldemort had then turned his wand on Harry; he had performed the curse that had disposed of many full-grown witches and wizards in his steady rise to power -- and, incredibly, it had not worked."
}