{
  "id": "6fd6c035b58efba1e7850d4584497d9296b020f5",
  "text": " . . .\"  The double attack on Justin and Nearly Headless Nick turned what had hitherto been nervousness into real panic. Curiously, it was Nearly Headless Nick's fate that seemed to worry people most. What could possibly do that to a ghost? people asked each other; what terrible power could harm someone who was already dead? There was almost a stampede to book seats on the Hogwarts Express so that students could go home for Christmas.  \"At this rate, we'll be the only ones left,\" Ron told Harry and Hermione. \"Us, Malfoy, Crabbe, and Goyle. What a jolly holiday it's going to be.\"  Crabbe and Goyle, who always did whatever Malfoy did, had signed up to stay over the holidays, too. But Harry was glad that most people were leaving. He was tired of people skirting around him in the corridors, as though he was about to sprout fangs or spit poison; tired of all the muttering, pointing, and hissing as he passed.  *209*  Fred and George, however, found all this very funny. They went out of their way to march ahead of Harry down the corridors, shouting, \"Make way for the Heir of Slytherin, seriously evil wizard coming through ......  Percy was deeply disapproving of this behavior.  \"It is not a laughing matter,\" he said coldly.  \"Oh, get out of the way, Percy,\" said Fred. \"Harry's in a hurry.\"  \"Yeah, he's off to the Chamber of Secrets for a cup of tea with his fanged servant,\" said George, chortling.  Ginny didn't find it amusing either.  \"Oh, don't,\" she wailed every time Fred asked Harry loudly who he was planning to attack next, or when George pretended to ward Harry off with a large clove of garlic when they met.  Harry didn't mind; it made him feel better that Fred and George, at least, thought the idea of his being Slytherin's heir was quite ludicrous. But their antics seemed to be aggravating Draco Malfoy, who looked increasingly sour each time he saw them at it.  \"It's because he's bursting to say it's really him,\" said Ron knowingly. \"You know how he hates anyone beating him at anything, and you're getting all the credit for his dirty work.\"  \"Not for long,\" said Hermione in a satisfied tone. \"The Polyjuice Potion's nearly ready. We'll be getting the truth out of him any day now.\"  At last the term ended, and a silence deep as the snow on the grounds descended on the castle. Harry found it peaceful, rather than gloomy, and enjoyed the fact that he, Hermione, and the Weasleys had the run of Gryffindor Tower, which meant they could  *210*  play Exploding Snap loudly without bothering anyone, and practice dueling in private. Fred, George, and Ginny had chosen to stay at school rather than visit Bill in Egypt with Mr. and Mrs. Weasley. Percy, who disapproved of what he termed their childish behavior, didn't spend much time in the Gryffindor common room. He had already told them pompously that he was only staying over Christmas because it was his duty as a prefect to support the teachers during this troubled time.  Christmas morning dawned, cold and white. Harry and Ron, the only ones left in their dormitory, were woken very early by Hermione, who burst in, fully dressed and carrying presents for them both.  \"Wake up,\" she said loudly, pulling back the curtains at the window.  \"Hermione - you're not supposed to be in here -\" said Ron, shielding his eyes against the light.  \"Merry Christmas to you, too,\" said Hermione, throwing him his present. \"I've been up for nearly an hour, adding more lacewings to the potion. It's ready.\"  Harry sat up, suddenly wide awake.  \"Are you sure?\"  \"Positive,\" said Hermione, shifting Scabbers the rat so that she could sit down on the end of Ron's four-poster. \"If we're going to do it, I say it should be tonight.\"  At that moment, Hedwig swooped into the room, carrying a very small package in her beak.  \"Hello,\" said Harry happily as she landed on his bed. \"Are you speaking to me again?\"  211  She nibbled his ear in an affectionate sort of way, which was a far better present than the one that she had brought him, which turned out to be from the Dursleys. They had sent Harry a toothpick and a note telling him to find out whether he'd be able to stay at Hogwarts for the summer vacation, too.  The rest of Harry's Christmas presents were far more satisfactory. Hagrid had sent him a large tin of treacle fudge, which Harry decided to soften by the fire before eating; Ron had given him a book called Flying with the Cannons, a book of interesting facts about his favorite Quidditch team, and Hermione had bought him a luxury eagle-feather quill. Harry opened the last present to find a new, hand-knitted sweater from Mrs. Weasley and a large plum cake. He read her card with a fresh surge of guilt, thinking about Mr. Weasley's car (which hadn't been seen since its crash with the Whomping Willow), and the bout of rule-breaking he and Ron were planning next.  No one, not even someone dreading taking Polyjuice Potion later, could fail to enjoy Christmas dinner at Hogwarts.  The Great Hall looked magnificent."
}