{
  "id": "6fdb00b95215121fe634fca1366641cea8541db0",
  "text": "   Theon found that amusing.  Who did he marry?    The widow o’ Hornwood, m’lord.    That crone? Was he blind? She has teats like empty wineskins, dry and withered.    It wasn’t her teats he wed her for, m’lord.   The ironmen slammed shut the tall doors at the foot of the hall. From the high seat, Bran could see about twenty of them. He probably left some guards on the gates and the armory. Even so, there couldn’t be more than thirty.  Theon raised his hands for quiet.  You all know me—    Aye, we know you for a sack of steaming dung!  shouted Mikken, before the bald man drove the butt of his spear into his gut, then smashed him across the face with the shaft. The smith stumbled to his knees and spat out a tooth.   Mikken, you be silent.  Bran tried to sound stern and lordly, the way Robb did when he made a command, but his voice betrayed him and the words came out in a shrill squeak.   Listen to your little lordling, Mikken,  said Theon.  He has more sense than you do.   A good lord protects his people, he reminded himself.  I’ve yielded Winterfell to Theon.    Louder, Bran. And call me prince.   He raised his voice.  I have yielded Winterfell to Prince Theon. All of you should do as he commands you.    Damned if I will!  bellowed Mikken.  Theon ignored the outburst.  My father has donned the ancient crown of salt and rock, and declared himself King of the Iron Islands. He claims the north as well, by right of conquest. You are all his subjects.    Bugger that.  Mikken wiped the blood from his mouth.  I serve the Starks, not some treasonous squid of—aah.  The butt of the spear smashed him face first into the stone floor.   Smiths have strong arms and weak heads,  observed Theon.  But if the rest of you serve me as loyally as you served Ned Stark, you’ll find me as generous a lord as you could want.  on his hands and knees, Mikken spat blood. Please don’t, Bran wished at him, but the blacksmith shouted,  If you think you can hold the north with this sorry lot o’—   The bald man drove the point of his spear into the back of Mikken’s neck. Steel slid through flesh and came out his throat in a welter of blood. A woman screamed, and Meera wrapped her arms around Rickon. It’s blood he drowned on, Bran thought numbly. His own blood.   Who else has something to say?  asked Theon Greyjoy.   Hodor hodor hodor hodor,  shouted Hodor, eyes wide.   Someone kindly shut that halfwit up.   Two ironmen began to beat Hodor with the butts of their spears. The stableboy dropped to the floor, trying to shield himself with his hands.   I will be as good a lord to you as Eddard Stark ever was.  Theon raised his voice to be heard above the smack of wood on flesh.  Betray me, though, and you’ll wish you hadn’t. And don’t think the men you see here are the whole of my power. Torrhen’s Square and Deepwood Motte will soon be ours as well, and my uncle is sailing up the Saltspear to seize Moat Cailin. If Robb Stark can stave off the Lannisters, he may reign as King of the Trident hereafter, but House Greyjoy holds the north now.    Stark’s lords will fight you,  the man Reek called out.  That bloated pig at White Harbor for one, and them Umbers and Karstarks too. You’ll need men. Free me and I’m yours.   Theon weighed him a moment.  You’re cleverer than you smell, but I could not suffer that stench.    Well,  said Reek,  I could wash some. If I was free.    A man of rare good sense.  Theon smiled.  Bend the knee.  one of the ironmen handed Reek a sword, and he laid it at Theon’s feet and swore obedience to House Greyjoy and King Balon. Bran could not look. The green dream was coming true.   M’lord Greyjoy!  Osha stepped past Mikken’s body.  I was brought here captive too. You were there the day I was taken.   I thought you were a friend, Bran thought, hurt.   I need fighters,  Theon declared,  not kitchen sluts.    It was Robb Stark put me in the kitchens. For the best part of a year, I’ve been left to scour kettles, scrape grease, and warm the straw for this one.  She threw a look at Gage.  I’ve had a bellyful of it. Put a spear in my hand again.    I got a spear for you right here,  said the bald man who’d killed Mikken. He grabbed his crotch, grinning.  Osha drove her bony knee up between his legs.  You keep that soft pink thing.  She wrested the spear from him and used the butt to knock him off his feet.  I’ll have me the wood and iron.  The bald man writhed on the floor while the other reavers sent up gales of laughter.  Theon laughed with the rest.  You’ll do,  he said.  Keep the spear; Stygg can find another. Now bend the knee and swear.   When no one else rushed forward to pledge service, they were dismissed with a warning to do their work and make no trouble. Hodor was given the task of bearing Bran back to his bed. His face was all ugly from the beating, his nose swollen and one eye closed.  Hodor,  he sobbed between cracked lips as he lifted Bran in huge strong arms and bloody hands and carried him back out into the rain.      ARYA   There’s ghosts, I know there is."
}