{
  "id": "700904f39e1139361e5170468984f2454a716b52",
  "text": " The holidays would be the perfect time to use the Polyjuice Potion and try to worm a confession out of him.  Unfortunately, the potion was only half finished. They still  * 3-85*  needed the bicorn horn and the boomslang skin, and the only place they were going to get them was from Snape's private stores. Harry privately felt he'd rather face Slytherin's legendary monster than let Snape catch him robbing his office.  \"What we need,\" said Hermione briskly as Thursday afternoon's double Potions lesson loomed nearer, \"is a diversion. Then one of us can sneak into Snape's office and take what we need.\"  Harry and Ron looked at her nervously.  \"I think Id better do the actual stealing,\" Hermione continued in a matter-of-fact tone. \"You two will be expelled if you get into any more trouble, and I've got a clean record. So all you need to do is cause enough mayhem to keep Snape busy for five minutes or so.  Harry smiled feebly. Deliberately causing mayhem in Snape's Potions class was about as safe as poking a sleeping dragon in the eye.  Potions lessons took place in one of the large dungeons. Thursday afternoon's lesson proceeded in the usual way. Twenty cauldrons stood steaming between the wooden desks, on which stood brass scales and jars of ingredients. Snape prowled through the fumes, making waspish remarks about the Gryffindors' work while the Slytherins sniggered appreciatively. Draco Malfoy, who was Snape's favorite student, kept flicking puffer-fish eyes at Ron and Harry, who knew that if they retaliated they would get detention faster than you could say \"Unfair.\"  Harry's Swelling Solution was far too runny, but he had his mind on more important things. He was waiting for Hermione's signal, and he hardly listened as Snape paused to sneer at his watery  *186*  potion. When Snape turned and walked off to bully Neville, Hermione caught Harry's eye and nodded.  Harry ducked swiftly down behind his cauldron, pulled one of Fred's Filibuster fireworks out of his pocket, and gave it a quick prod with his wand. The firework began to fizz and sputter. Knowing he had only seconds, Harry straightened up, took aim, and lobbed it into the air; it landed right on target in Goyle's cauldron.  Goyle's potion exploded, showering the whole class. People shrieked as splashes of the Swelling Solution hit them. Malfoy got a faceful and his nose began to swell like a balloon; Goyle blundered around, his hands over his eyes, which had expanded to the size of a dinner plate - Snape was trying to restore calm and find out what had happened. Through the confusion, Harry saw Hermione slip quietly into Snape's office.  \"Silence! SILENCE!\" Snape roared. \"Anyone who has been splashed, come here for a Deflating Draft - when I find out who did this -\"  Harry tried not to laugh as he watched Malfoy hurry forward, his head drooping with the weight of a nose like a small melon. As half the class lumbered up to Snape's desk, some weighted down with arms like clubs, others unable to talk through gigantic puffedup lips, Harry saw Hermione slide back into the dungeon, the front of her robes bulging.  When everyone had taken a swig of antidote and the various swellings had subsided, Snape swept over to Goyle's cauldron and scooped out the twisted black remains of the firework. There was a sudden hush.  *187*  \"If I ever find out who threw this,\" Snape whispered, \"I shall make sure that person is expelled.\"  Harry arranged his face into what he hoped was a puzzled expression. Snape was looking right at him, and the bell that rang ten minutes later could not have been more welcome.  \"He knew it was me,\" Harry told Ron and Hermione as they hurried back to Moaning Myrtle's bathroom. \"I could tell.\"  Hermione threw the new ingredients into the cauldron and began to stir feverishly.  \"It'll be ready in two weeks,\" she said happily.  \"Snape can't prove it was you,\" said Ron reassuringly to Harry. \"What can he do?\"  \"Knowing Snape, something foul,\" said Harry as the potion frothed and bubbled.  A week later, Harry, Ron, and Hermione were walking across the entrance hall when they saw a small knot of people gathered around the notice board, reading a piece of parchment that had just been pinned up. Seamus Finnigan and Dean Thomas beckoned them over, looking excited.  \"They're starting a Dueling Club!\" said Seamus. \"First meeting tonight! I wouldn't mind dueling lessons; they might come in handy one of these days ......  \"What, you reckon Slytherin's monster can duel?\" said Ron, but he, too, read the sign with interest.  \"Could be useful,\" he said to Harry and Hermione as they went into dinner. \"Shall we go?\"  Harry and Hermione were all for it, so at eight o'clock that  *188*  evening they hurried back to the Great Hall. The long dining tables had vanished and a golden stage had appeared along one wall, lit by thousands of candles floating overhead. The ceiling was velvety black once more and most of the school seemed to be packed beneath it, all carrying their wands and looking excited."
}