{
  "id": "702099728295ebc723de4f67580b04d48efc66dc",
  "text": "  .132 \"Oh, no,\" said Hermione, stopping abruptly. \"Turn back, turn back, I don't want to talk to Moaning Myrtle -\" \"Who?\" said Harry as they backtracked quickly. \"She haunts one of the toilets in the girls' bathroom on the first floor,\" said Hermione. \"She haunts a toilet?\" \"Yes. It's been out-of-order all year because she keeps having tantrums and flooding the place. I never went in there anyway if I could avoid it; it's awful trying to have a pee with her wailing at you -\" \"Look, food!\" said Ron. On the other side of the dungeon was a long table, also covered in black velvet. They approached it eagerly but next moment had stopped in their tracks, horrified. The smell was quite disgusting. Large, rotten fish were laid on handsome silver platters; cakes, burned charcoal-black, were heaped on salvers; there was a great maggoty haggis, a slab of cheese covered in furry green mold and, in pride of place, an enormous gray cake in the shape of a tombstone, with tar-like icing forming the words, Sir Nicholas de Mimsy-Porpington died 31st October, 1492 Harry watched, amazed, as a portly ghost approached the table, crouched low, and walked through it, his mouth held wide so that it passed through one of the stinking salmon. \"Can you taste it if you walk though it?\" Harry asked him. \"Almost,\" said the ghost sadly, and he drifted away.  .133 \"I expect they've let it rot to give it a stronger flavor,\" said Hermione knowledgeably, pinching her nose and leaning closer to look at the putrid haggis. \"Can we move? I feel sick,\" said Ron. They had barely turned around, however, when a little man swooped suddenly from under the table and came to a halt in midair before them. \"Hello, Peeves,\" said Harry cautiously. Unlike the ghosts around them, Peeves the Poltergeist was the very reverse of pale and transparent. He was wearing a bright orange party hat, a revolving bow tie, and a broad grin on his wide, wicked face. \"Nibbles?\" he said sweetly, offering them a bowl of peanuts covered in fungus. \"No thanks,\" said Hermione. \"Heard you talking about poor Myrtle,\" said Peeves, his eyes dancing. \"Rude you was about poor Myrtle.\" He took a deep breath and bellowed, \"OY! MYRTLE!\" \"Oh, no, Peeves, don't tell her what I said, she'll be really upset,\" Hermione whispered frantically. \"I didn't mean it, I don't mind her - er, hello, Myrtle.\" The squat ghost of a girl had glided over. She had the glummest face Harry had ever seen, half-hidden behind lank hair and thick, pearly spectacles. \"What?\" she said sulkily. \"How are you, Myrtle?\" said Hermione in a falsely bright voice. \"It's nice to see you out of the toilet.\"  .134 Myrtle sniffed. \"Miss Granger was just talking about you -\" said Peeves slyly in Myrtle's ear. \"Just saying - saying - how nice you look tonight,\" said Hermione, glaring at Peeves. Myrtle eyed Hermione suspiciously. \"You're making fun of me,\" she said, silver tears welling rapidly in her small, see-through eyes. \"No - honestly - didn't I just say how nice Myrtle's looking?\" said Hermione, nudging Harry and Ron painfully in the ribs. \"Oh, yeah -\" \"She did -\" \"Don't lie to me,\" Myrtle gasped, tears now flooding down her face, while Peeves chuckled happily over her shoulder. \"D'you think I don't know what people call me behind my back? Fat Myrtle! Ugly Myrtle! Miserable, moaning, moping Myrtle!\" \"You've forgotten pimply,\" Peeves hissed in her ear. Moaning Myrtle burst into anguished sobs and fled from the dungeon. Peeves shot after her, pelting her with moldy peanuts, yelling, \"Pimply! Pimply!\" \"Oh, dear,\" said Hermione sadly. Nearly Headless Nick now drifted toward them through the crowd.  .135 \"Enjoying yourselves?\" \"Oh, yes,\" they lied. \"Not a bad turnout,\" said Nearly Headless Nick proudly. \"The Wailing Widow came all the way up from Kent. . . . It's nearly time for my speech, I'd better go and warn the orchestra. . . .\" The orchestra, however, stopped playing at that very moment. They, and everyone else in the dungeon, fell silent, looking around in excitement, as a hunting horn sounded. \"Oh, here we go,\" said Nearly Headless Nick bitterly. Through the dungeon wall burst a dozen ghost horses, each ridden by a headless horseman. The assembly clapped wildly; Harry started to clap, too, but stopped quickly at the sight of Nick's face. The horses galloped into the middle of the dance floor and halted, rearing and plunging. At the front of the pack was a large ghost who held his bearded head under his arm, from which position he was blowing the horn. The ghost leapt down, lifted his head high in the air so he could see over the crowd (everyone laughed), and strode over to Nearly Headless Nick, squashing his head back onto his neck. \"Nick!\" he roared. \"How are you? Head still hanging in there?\" He gave a hearty guffaw and clapped Nearly Headless Nick on the shoulder. \"Welcome, Patrick,\" said Nick stiffly. \"Live 'uns!\" said Sir Patrick, spotting Harry, Ron, and Hermione and giving a huge, fake jump of astonishment, so that his head fell off again (the crowd howled with laughter)."
}