{
  "id": "7047b5a31241770f357b654cff753b3e32c0897c",
  "text": "   A splendid cup,  said Joffrey,  but we’ll need to chip the wolf off and put a squid in its place, I think.   Sansa pretended that she had not heard.   Margaery and I shall drink deep at the feast, good father.  Joffrey lifted the chalice above his head, for everyone to admire.   The damned thing’s as tall as I am,  Tyrion muttered in a low voice.  Half a chalice and Joff will be falling down drunk.   Good, she thought. Perhaps he’ll break his neck.  Lord Tywin waited until last to present the king with his own gift: a longsword. Its scabbard was made of cherrywood, gold, and oiled red leather, studded with golden lions’ heads. The lions had ruby eyes, she saw. The ballroom fell silent as Joffrey unsheathed the blade and thrust the sword above his head. Red and black ripples in the steel shimmered in the morning light.   Magnificent,  declared Mathis Rowan.   A sword to sing of, sire,  said Lord Redwyne.   A king’s sword,  said Ser Kevan Lannister.  King Joffrey looked as if he wanted to kill someone right then and there, he was so excited. He slashed at the air and laughed.  A great sword must have a great name, my lords! What shall I call it?   Sansa remembered Lion’s Tooth, the sword Arya had flung into the Trident, and Hearteater, the one he’d made her kiss before the battle. She wondered if he’d want Margaery to kiss this one.  The guests were shouting out names for the new blade. Joff dismissed a dozen before he heard one he liked.  Widow’s Wail!  he cried.  Yes! It shall make many a widow, too!  He slashed again.  And when I face my uncle Stannis it will break his magic sword clean in two.  Joff tried a downcut, forcing Ser Balon Swann to take a hasty step backward. Laughter rang through the hall at the look on Ser Balon’s face.   Have a care, Your Grace,  Ser Addam Marbrand warned the king.  Valyrian steel is perilously sharp.    I remember.  Joffrey brought Widow’s Wail down in a savage twohanded slice, onto the book that Tyrion had given him. The heavy leather cover parted at a stroke.  Sharp! I told you, I am no stranger to Valyrian steel.  It took him half a dozen further cuts to hack the thick tome apart, and the boy was breathless by the time he was done. Sansa could feel her husband struggling with his fury as Ser Osmund Kettleblack shouted,  I pray you never turn that wicked edge on me, sire.    See that you never give me cause, ser.  Joffrey flicked a chunk of Lives of Four Kings off the table at swordpoint, then slid Widow’s Wail back into its scabbard.   Your Grace,  Ser Garlan Tyrell said.  Perhaps you did not know. In all of Westeros there were but four copies of that book illuminated in Kaeth’s own hand.    Now there are three.  Joffrey undid his old swordbelt to don his new one.  You and Lady Sansa owe me a better present, Uncle Imp. This one is all chopped to pieces.   Tyrion was staring at his nephew with his mismatched eyes.  Perhaps a knife, sire. To match your sword. A dagger of the same fine Valyrian steel… with a dragonbone hilt, say?   Joff gave him a sharp look.  You… yes, a dagger to match my sword, good.  He nodded.  A… a gold hilt with rubies in it. Dragonbone is too plain.    As you wish, Your Grace.  Tyrion drank another cup of wine. He might have been all alone in his solar for all the attention he paid Sansa. But when the time came to leave for the wedding, he took her by the hand.  As they were crossing the yard, Prince Oberyn of Dorne fell in beside them, his black-haired paramour on his arm. Sansa glanced at the woman curiously. She was baseborn and unwed, and had borne two bastard daughters for the prince, but she did not fear to look even the queen in the eye. Shae had told her that this Ellaria worshiped some Lysene love goddess.  She was almost a whore when he found her, m’lady,  her maid confided,  and now she’s near a princess.  Sansa had never been this close to the Dornishwoman before. She is not truly beautiful, she thought, but something about her draws the eye.   I once had the great good fortune to see the Citadel’s copy of Lives of Four Kings,  Prince Oberyn was telling her lord husband.  The illuminations were wondrous to behold, but Kaeth was too kind by half to King Viserys.   Tyrion gave him a sharp look.  Too kind? He scants Viserys shamefully, in my view. It should have been Lives of Five Kings.   The prince laughed.  Viserys hardly reigned a fortnight.    He reigned more than a year,  said Tyrion.  Oberyn gave a shrug.  A year or a fortnight, what does it matter? He poisoned his own nephew to gain the throne and then did nothing once he had it.    Baelor starved himself to death, fasting,  said Tyrion.  His uncle served him loyally as Hand, as he had served the Young Dragon before him. Viserys might only have reigned a year, but he ruled for fifteen, while Daeron warred and Baelor prayed.  He made a sour face.  And if he did remove his nephew, can you blame him? Someone had to save the realm from Baelor’s follies.   Sansa was shocked.  But Baelor the Blessed was a great king."
}