{
  "id": "7063884b1b6b467b04a502cd9f0d4bbe8dc3314b",
  "text": "\" \"Oh Bagman's likable enough, of course,\" said Percy dismissively, \"but how he ever got to be Head of Department ... when I compare him to Mr. Crouch!  I can't see Mr. Crouch losing a member of our department and not trying to find out what's happened to them.  You realize Bertha Jorkins has been missing for over a month now?  Went on holiday to Albania and never came back?\" \"Yes, I was asking Ludo about that,\" said Mr. Weasley, frowning.  \"He says Bertha's gotten lost plenty of times before now - though must say, if it was someone in my department, I'd be worried. . . .\" \"Oh Bertha's hopeless, all right,\" said Percy.  \"I hear she's been shunted from department to department for years, much more trouble than she's worth ... but all the same, Bagman ought to be trying to find her.  Mr. Crouch has been taking a personal interest, she worked in our department at one time, you know, and I think Mr. Crouch was quite fond of her - but Bagman just keeps laughing and saying she probably misread the map and ended up in Australia instead of Albania.  However\" - Percy heaved an impressive sigh and took a deep swig of elderflower wine - \"we've got quite enough on our plates at the Department of International Magical Cooperation without trying to find members of other departments too.  As you know, we've got another big event to organize right after the World Cup.\" Percy cleared his throat significantly and looked down toward the end of the table where Harry, Ron, and Hermione were sitting.  \"You know the one I'm talking about, Father.\" He raised his voice slightly.  \"The top-secret one.\" Ron rolled his eyes and muttered to Harry and Hermione, \"He's been trying to get us to ask what that event is ever since he started work.  Probably an exhibition of thick-bottomed cauldrons.\" In the middle of the table, Mrs. Weasley was arguing with Bill about his earring, which seemed to be a recent acquisition. \". . . with a horrible great fang on it. Really, Bill, what do they say at the bank?\" \"Mum,.no one at the bank gives a damn how I dress as long as I bring home plenty of treasure,\" said Bill patiently. \"And your hair's getting silly, dear,\" said Mrs. Weasley, fingering her wand lovingly.\" I wish you'd let me give it a trim. . . .\" \"I like it,\" said Ginny, who was sitting beside Bill.  \"You're so old-fashioned, Mum. Anyway, it's nowhere near as long as Professor Dumbledore's....\" Next to Mrs. Weasley, Fred, George, and Charlie were all talking spiritedly about the World Cup. \"It's got to be Ireland,\" said Charlie thickly, through a mouthful of potato.  \"They flattened Peru in the semifinals.\" \"Bulgaria has got Viktor Krum, though,\" said Fred. \"Krum's one decent player, Ireland has got seven,\" said Charlie shortly.  \"I wish England had got through.  That was embarrassing, that was.\" \"What happened?\" said Harry eagerly, regretting more than ever his isolation from the wizarding world when he was stuck on Privet Drive. \"Went down to Transylvania, three hundred and ninety to ten,\" said Charlie gloomily. \"Shocking performance.  And Wales lost to Uganda, and Scotland was slaughtered by Luxembourg.\" Harry had been on the Gryffindor House Quidditch team ever since his first year at Hogwarts and owned one of the best racing brooms in the world, a Firebolt.  Flying came more naturally to Harry than anything else in the magical world, and he played in the position of Seeker on the Gryffindor House team. Mr. Weasley conjured up candles to light the darkening garden before they had their homemade strawberry ice cream, and by the time they had finished, moths were fluttering low over the table, and the warm air was perfumed with the smells of grass and honeysuckle.  Harry was feeling extremely well fed and at peace with the world as he watched several gnomes sprinting through the rosebushes, laughing madly and closely pursued by Crookshanks. Ron looked carefully up the table to check that the rest of the family were all busy talking, then he said very quietly to Harry, \"So - have you heard from Sirius lately?\" Hermione looked around, listening closely. \"Yeah,\" said Harry softly, \"twice.  He sounds okay.  I wrote to him yesterday.  He might write back while I'm here.\" He suddenly remembered the reason he had written to Sirius, and for a moment was on the verge of telling Ron and Hermione about his scar hurting again, and about the dream that had awoken him ... but he really didn't want to worry them just now, not when he himself was feeling so happy and peaceful. \"Look at the time,\" Mrs. Weasley said suddenly, checking her wristwatch.  \"You really should be in bed, the whole lot of you you'll be up at the crack of dawn to get to the Cup. Harry, if you leave your school list out, I'll get your things for you tomorrow in Diagon Alley.  I'm getting everyone else's.  There might not be time after the World Cup, the match went on for five days last time.\" \"Wow - hope it does this time!\" said Harry enthusiastically. \"Well, I certainly don't,\" said Percy sanctimoniously."
}