{
  "id": "7100ada75f6541049416fad6d53cd19cfbe66718",
  "text": "  You don’t feel your wounds then, or the ache in your back from the weight of the armor, or the sweat running down into your eyes. You stop feeling, you stop thinking, you stop being you, there is only the fight, the foe, this man and then the next and the next and the next, and you know they are afraid and tired but you’re not, you’re alive, and death is all around you but their swords move so slowly, you can dance through them laughing.  Battle fever. I am half a man and drunk with slaughter, let them kill me if they can!  They tried. Another spearman ran at him. Tyrion lopped off the head of his spear, then his hand, then his arm, trotting around him in a circle. An archer, bowless, thrust at him with an arrow, holding it as if it were a knife. The destrier kicked at the man’s thigh to send him sprawling, and Tyrion barked laughter. He rode past a banner planted in the mud, one of Stannis’s fiery hearts, and chopped the staff in two with a swing of his axe. A knight rose up from nowhere to hack at his shield with a two-handed greatsword, again and again, until someone thrust a dagger under his arm. One of Tyrion’s men, perhaps. He never saw.   I yield, ser,  a different knight called out, farther down the river.  Yield. Ser knight, I yield to you. My pledge, here, here.  The man lay in a puddle of black water, offering up a lobstered gauntlet in token of submission. Tyrion had to lean down to take it from him. As he did, a pot of wildfire burst overhead, spraying green flame. In the sudden stab of light he saw that the puddle was not black but red. The gauntlet still had the knight’s hand in it. He flung it back.  Yield,  the man sobbed hopelessly, helplessly. Tyrion reeled away.  A man-at-arms grabbed the bridle of his horse and thrust at Tyrion’s face with a dagger. He knocked the blade aside and buried the axe in the nape of the man’s neck. As he was wresting it free, a blaze of white appeared at the edge of his vision. Tyrion turned, thinking to find Ser Mandon Moore beside him again, but this was a different white knight. Ser Balon Swann wore the same armor, but his horse trappings bore the battling black-and-white swans of his House. He’s more a spotted knight than a white one, Tyrion thought inanely. Every bit of Ser Balon was spattered with gore and smudged by smoke. He raised his mace to point downriver. Bits of brain and bone clung to its head.  My lord, look.   Tyrion swung his horse about to peer down the Blackwater. The current still flowed black and strong beneath, but the surface was a roil of blood and flame. The sky was red and orange and garish green.  What?  he said. Then he saw.  Steel-clad men-at-arms were clambering off a broken galley that had smashed into a pier. So many, where are they coming from? Squinting into the smoke and glare, Tyrion followed them back out into the river. Twenty galleys were jammed together out there, maybe more, it was hard to count. Their oars were crossed, their hulls locked together with grappling lines, they were impaled on each other’s rams, tangled in webs of fallen rigging. One great hulk floated hull up between two smaller ships. Wrecks, but packed so closely that it was possible to leap from one deck to the other and so cross the Blackwater.  Hundreds of Stannis Baratheon’s boldest were doing just that. Tyrion saw one great fool of a knight trying to ride across, urging a terrified horse over gunwales and oars, across tilting decks slick with blood and crackling with green fire. We made them a bloody bridge, he thought in dismay. Parts of the bridge were sinking and other parts were afire and the whole thing was creaking and shifting and like to burst asunder at any moment, but that did not seem to stop them.  Those are brave men,  he told Ser Balon in admiration.  Let’s go kill them.   He led them through the guttering fires and the soot and ash of the riverfront, pounding down a long stone quay with his own men and Ser Balon’s behind him. Ser Mandon fell in with them, his shield a ragged ruin. Smoke and cinders swirled through the air, and the foe broke before their charge, throwing themselves back into the water, knocking over other men as they fought to climb up. The foot of the bridge was a half-sunken enemy galley with Dragonsbane painted on her prow, her bottom ripped out by one of the sunken hulks Tyrion had placed between the quays. A spearman wearing the red crab badge of House Celtigar drove the point of his weapon up through the chest of Balon Swann’s horse before he could dismount, spilling the knight from the saddle. Tyrion hacked at the man’s head as he flashed by, and by then it was too late to rein up. His stallion leapt from the end of the quay and over a splintered gunwale, landing with a splash and a scream in ankle-deep water. Tyrion’s axe went spinning, followed by Tyrion himself, and the deck rose up to give him a wet smack.  Madness followed. His horse had broken a leg and was screaming horribly. Somehow he managed to draw his dagger, and slit the poor creature’s throat."
}