{
  "id": "715b031d8746fd8e26136ce152650a2911db01b7",
  "text": " \"How did you find out where he was?\"  Black put one of his clawlike hands inside his robes and took out a crumpled piece of paper, which he smoothed flat and held out to show the others.  It was the photograph of Ron and his family that had appeared in the Daily Prophet the previous summer, and there, on Ron's shoulder, was Scabbers.  \"How did you get this?\" Lupin asked Black, thunderstruck.  \"Fudge,\" said Black. \"When he came to inspect Azkaban last year, he gave me his paper. And there was Peter, on the front page on this boy's shoulder... I knew him at once... how many times had I seen him transform? And the caption said the boy would be going back to Hogwarts... to where Harry was...  \"My God,\" said Lupin softly, staring from Scabbers to the picture in the paper and back again. \"His front paw...\"  \"What about it?\" said Ron defiantly.  \"He's got a toe missing,\" said Black.  \"Of course,\" Lupin breathed. \"So simple... so brilliant... he cut it off himself?\"  \"Just before he transformed,\" said Black. \"When I cornered him, he yelled for the whole street to hear that I'd betrayed Lily and James. Then, before I could curse him, he blew apart the street with the wand behind his back, killed everyone within twenty feet of himself -- and sped down into the sewer with the other rats....\"  \"Didn't you ever hear, Ron?\" said Lupin. \"The biggest bit of Peter they found was his finger.\"  \"Look, Scabbers probably had a fight with another rat or something! He's been in my family for ages, right --\"  \"Twelve years, in fact,\" said Lupin. \"Didn't you ever wonder why he was living so long?\"  \"We -- we've been taking good care of him!\" said Ron.  \"Not looking too good at the moment, though, is he?\" said Lupin. \"I'd guess he's been losing weight ever since he heard Sirius was on the loose again....\"  \"He's been scared of that mad cat!\" said Ron, nodding toward Crookshanks, who was still purring on the bed.  But that wasn't right, Harry thought suddenly... Scabbers had been looking ill before he met Crookshanks... ever since Ron's return from Egypt... since the time when Black had escaped....  \"This cat isn't mad,\" said Black hoarsely. He reached out a bony hand and stroked Crookshanks's fluffy head. \"He's the most intelligent of his kind I've ever met. He recognized Peter for what he was right away. And when he met me, he knew I was no dog. It was a while before he trusted me.... Finally, I managed to communicate to him what I was after, and he's been helping me. .. \"What do you mean?\" breathed Hermione.  \"He tried to bring Peter to me, but couldn't... so he stole the passwords into Gryffindor Tower for me.... As I understand it, he took them from a boy's bedside table....\"  Harry's brain seemed to be sagging under the weight of what he was hearing. It was absurd... and yet...  \"But Peter got wind of what was going on and ran for it.\" croaked Black. \"This cat -- Crookshanks, did you call him? -- told me Peter had left blood on the sheets.... I supposed he bit himself... Well, faking his own death had worked once.\"  These words jolted Harry to his senses.  \"And why did he fake his death?\" he said furiously. \"Because he knew you were about to kill him like you killed my parents!\"  \"No,\" said Lupin, \"Harry-\"  \"And now you've come to finish him off!\"  \"Yes, I have,\" said Black, with an evil look at Scabbers.  \"Then I should've let Snape take you!\" Harry shouted.  \"Harry,\" said Lupin hurriedly, \"don't you see? All this time we've thought Sirius betrayed your parents, and Peter tracked him down -- but it was the other way around, don't you see? Peter betrayed your mother and father -- Sirius tracked Peter down --\"  \"THAT'S NOT TRUE!\" Harry yelled. \"HE WAS THEIR SECRET-KEEPER! HE SAID SO BEFORE YOU TURNED UP. HE SAID HE KILLED THEM!\"  He was pointing at Black, who shook his head slowly; the sunken eyes were suddenly over bright.  \"Harry... I as good as killed them,\" he croaked. \"I persuaded Lily and James to change to Peter at the last moment, persuaded them to use him as Secret-Keeper instead of me.... I'm to blame, I know it.... The night they died, I'd arranged to check on Peter, make sure he was still safe, but when I arrived at his hiding place, he'd gone. Yet there was no sign of a struggle. It didn't feel right. I was scared. I set out for your parents' house straight away. And when I saw their house, destroyed, and their bodies... I realized what Peter must've done... what I'd done....\"  His voice broke. He turned away.  \"Enough of this,\" said Lupin, and there was a steely note in his voice Harry had never heard before. \"There's one certain way to prove what really happened. Ron, give me that rat.\"  \"What are you going to do with him if I give him to you?\" Ron asked Lupin tensely.  \"Force him to show himself,\" said Lupin. \"If he really is a rat, it won't hurt him.\"  Ron hesitated. Then at long last, he held out Scabbers and Lupin took him. Scabbers began to squeak without stopping, twisting and turning, his tiny black eyes bulging in his head."
}