{
  "id": "71694726585928f7b28a6ef066dbf10ae703b688",
  "text": " The rest were melted away into the green.  Yet when she looked across the valley to the far ridge, she saw the Greatjon’s riders emerge from the darkness beneath the trees. They were in a long line, an endless line, and as they burst from the wood there was an instant, the smallest part of a heartbeat, when all Catelyn saw was the moonlight on the points of their lances, as if a thousand willowisps were coming down the ridge, wreathed in silver flame.  Then she blinked, and they were only men, rushing down to kill or die.  Afterward, she could not claim she had seen the battle. Yet she could hear, and the valley rang with echoes. The crack of a broken lance, the clash of swords, the cries of  Lannister  and  Winterfell  and  Tully! Riverrun and Tully!  When she realized there was no more to see, she closed her eyes and listened. The battle came alive around her. She heard hoofbeats, iron boots splashing in shallow water, the woody sound of swords on oaken shields and the scrape of steel against steel, the hiss of arrows, the thunder of drums, the terrified screaming of a thousand horses. Men shouted curses and begged for mercy, and got it (or not), and lived (or died). The ridges seemed to play queer tricks with sound. Once she heard Robb’s voice, as clear as if he’d been standing at her side, calling,  To me! To me!  And she heard his direwolf, snarling and growling, heard the snap of those long teeth, the tearing of flesh, shrieks of fear and pain from man and horse alike. Was there only one wolf? It was hard to be certain.  Little by little, the sounds dwindled and died, until at last there was only the wolf. As a red dawn broke in the east, Grey Wind began to howl again.  Robb came back to her on a different horse, riding a piebald gelding in the place of the grey stallion he had taken down into the valley. The wolf’s head on his shield was slashed half to pieces, raw wood showing where deep gouges had been hacked in the oak, but Robb himself seemed unhurt. Yet when he came closer, Catelyn saw that his mailed glove and the sleeve of his surcoat were black with blood.  You’re hurt,  she said.  Robb lifted his hand, opened and closed his fingers.  No,  he said.  This is… Torrhen’s blood, perhaps, or…  He shook his head.  I do not know.   A mob of men followed him up the slope, dirty and dented and grinning, with Theon and the Greatjon at their head. Between them they dragged Ser Jaime Lannister. They threw him down in front of her horse.  The Kingslayer,  Hal announced, unnecessarily.  Lannister raised his head.  Lady Stark,  he said from his knees. Blood ran down one cheek from a gash across his scalp, but the pale light of dawn had put the glint of gold back in his hair.  I would offer you my sword, but I seem to have mislaid it.    It is not your sword I want, ser,  she told him.  Give me my father and my brother Edmure. Give me my daughters. Give me my lord husband.    I have mislaid them as well, I fear.    A pity,  Catelyn said coldly.   Kill him, Robb,  Theon Greyjoy urged.  Take his head off.    No,  her son answered, peeling off his bloody glove.  He’s more use alive than dead. And my lord father never condoned the murder of prisoners after a battle.    A wise man,  Jaime Lannister said,  and honorable.    Take him away and put him in irons,  Catelyn said.   Do as my lady mother says,  Robb commanded,  and make certain there’s a strong guard around him. Lord Karstark will want his head on a pike.    That he will,  the Greatjon agreed, gesturing. Lannister was led away to be bandaged and chained.   Why should Lord Karstark want him dead?  Catelyn asked.  Robb looked away into the woods, with the same brooding look that Ned often got.  He… he killed them…    Lord Karstark’s sons,  Galbart Glover explained.   Both of them,  said Robb.  Torrhen and Eddard. And Daryn Hornwood as well.    No one can fault Lannister on his courage,  Glover said.  When he saw that he was lost, he rallied his retainers and fought his way up the valley, hoping to reach Lord Robb and cut him down. And almost did.    He mislaid his sword in Eddard Karstark’s neck, after he took Torrhen’s hand off and split Daryn Hornwood’s skull open,  Robb said.  All the time he was shouting for me. If they hadn’t tried to stop him—    —I should then be mourning in place of Lord Karstark,  Catelyn said.  Your men did what they were sworn to do, Robb. They died protecting their liege lord. Grieve for them. Honor them for their valor. But not now. You have no time for grief. You may have lopped the head off the snake, but three quarters of the body is still coiled around my father’s castle. We have won a battle, not a war.    But such a battle!  said Theon Greyjoy eagerly.  My lady, the realm has not seen such a victory since the Field of Fire. I vow, the Lannisters lost ten men for every one of ours that fell. We’ve taken close to a hundred knights captive, and a dozen lords bannermen. Lord Westerling, Lord Banefort, Ser Garth Greenfield, Lord Estren, Ser Tytos Brax, Mallor the Dornishman… and three Lannisters besides Jaime, Lord Tywin’s own nephews, two of his sister’s sons and one of his dead brother’s…    And Lord Tywin?  Catelyn interrupted."
}