{
  "id": "72841009401d40ee1d1ee75ef1502b8e47016613",
  "text": " I’ve heard his lordship say this war began when the Hand sent him out to bring the king’s justice to Gregor Clegane, and that’s how he means for it to end.  He gave her shoulder a reassuring pat.  You best mount up, milady. It’s a long day’s ride to Acorn Hall, but at the end of it we’ll have a roof above our heads and a hot supper in our bellies.   It was a long day’s ride, but as dusk was settling they forded a brook and came up on Acorn Hall, with its stone curtain walls and great oaken keep. Its master was away fighting in the retinue of his master, Lord Vance, the castle gates closed and barred in his absence. But his lady wife was an old friend of Tom Sevenstrings, and Anguy said they’d once been lovers. Anguy often rode beside her; he was closer to her in age than any of them but Gendry, and he told her droll tales of the Dornish Marches. He never fooled her, though. He’s not my friend. He’s only staying close to watch me and make sure I don’t ride off again. Well, Arya could watch as well. Syrio Forel had taught her how.  Lady Smallwood welcomed the outlaws kindly enough, though she gave them a tongue lashing for dragging a young girl through the war. She became even more wroth when Lem let slip that Arya was highborn.  Who dressed the poor child in those Bolton rags?  she demanded of them.  That badge… there’s many a man who would hang her in half a heartbeat for wearing a flayed man on her breast.  Arya promptly found herself marched upstairs, forced into a tub, and doused with scalding hot water. Lady Smallwood’s maidservants scrubbed her so hard it felt like they were flaying her themselves. They even dumped in some stinky-sweet stuff that smelled like flowers.  And afterward, they insisted she dress herself in girl’s things, brown woolen stockings and a light linen shift, and over that a light green gown with acorns embroidered all over the bodice in brown thread, and more acorns bordering the hem.  My great-aunt is a septa at a motherhouse in Oldtown,  Lady Smallwood said as the women laced the gown up Arya’s back.  I sent my daughter there when the war began. She’ll have outgrown these things by the time she returns, no doubt. Are you fond of dancing, child? My Carellen’s a lovely dancer. She sings beautifully as well. What do you like to do?   She scuffed a toe amongst the rushes.  Needlework.    Very restful, isn’t it?    Well,  said Arya,  not the way I do it.    No? I have always found it so. The gods give each of us our little gifts and talents, and it is meant for us to use them, my aunt always says. Any act can be a prayer, if done as well as we are able. Isn’t that a lovely thought? Remember that the next time you do your needlework. Do you work at it every day?    I did till I lost Needle. My new one’s not as good.    In times like these, we all must make do as best we can.  Lady Smallwood fussed at the bodice of the gown.  Now you look a proper young lady.   I’m not a lady, Arya wanted to tell her, I’m a wolf.   I do not know who you are, child,  the woman said,  and it may be that’s for the best. Someone important, I fear.  She smoothed down Arya’s collar.  In times like these, it is better to be insignificant. Would that I could keep you here with me. That would not be safe, though. I have walls, but too few men to hold them.  She sighed.  Supper was being served in the hall by the time Arya was all washed and combed and dressed. Gendry took one look and laughed so hard that wine came out his nose, until Harwin gave him a thwack alongside his ear. The meal was plain but filling; mutton and mushrooms, brown bread, pease pudding, and baked apples with yellow cheese. When the food had been cleared and the servants sent away, Greenbeard lowered his voice to ask if her ladyship had word of the lightning lord.   Word?  She smiled.  They were here not a fortnight past. Them and a dozen more, driving sheep. I could scarcely believe my eyes. Thoros gave me three as thanks. You’ve eaten one tonight.    Thoros herding sheep?  Anguy laughed aloud.   I grant you it was an odd sight, but Thoros claimed that as a priest he knew how to tend a flock.    Aye, and shear them too,  chuckled Lem Lemoncloak.   Someone could make a rare fine song of that.  Tom plucked a string on his woodharp.  Lady Smallwood gave him a withering look.  Someone who doesn’t rhyme carry on with Dondarrion, perhaps. Or play ‘Oh, Lay My Sweet Lass Down in the Grass’ to every milkmaid in the shire and leave two of them with big bellies.    It was ‘Let Me Drink Your Beauty,’  said Tom defensively,  and milkmaids are always glad to hear it. As was a certain highborn lady I do recall. I play to please.   Her nostrils flared.  The riverlands are full of maids you’ve pleased, all drinking tansy tea. You’d think a man as old as you would know to spill his seed on their bellies. Men will be calling you Tom Sevensons before much longer.    As it happens,  said Tom,  I passed seven many years ago. And fine boys they are too, with voices sweet as nightingales."
}