{
  "id": "72b1fd8915600b57f5dd27e5ea92d48fa35f9d20",
  "text": "  Your sisters dance very well,  she said to Ser Ryman Frey, trying to be pleasant.   They’re aunts and cousins.  Ser Ryman drank a swallow of wine, the sweat trickling down his cheek into his beard.  A sour man, and in his cups, Catelyn thought. The Late Lord Frey might be niggardly when it came to feeding his guests, but he did not stint on the drink. The ale, wine, and mead were flowing as fast as the river outside. The Greatjon was already roaring drunk. Lord Walder’s son Merrett was matching him cup for cup, but Ser Whalen Frey had passed out trying to keep up with the two of them. Catelyn would sooner Lord Umber had seen fit to stay sober, but telling the Greatjon not to drink was like telling him not to breathe for a few hours.  Smalljon Umber and Robin Flint sat near Robb, to the other side of Fair Walda and Alyx, respectively. Neither of them was drinking; along with Patrek Mallister and Dacey Mormont, they were her son’s guards this evening. A wedding feast was not a battle, but there were always dangers when men were in their cups, and a king should never be unguarded. Catelyn was glad of that, and even more glad of the swordbelts hanging on pegs along the walls. No man needs a longsword to deal with jellied calves’ brains.   Everyone thought my lord would choose Fair Walda,  Lady Walda Bolton told Ser Wendel, shouting to be heard above the music. Fat Walda was a round pink butterball of a girl with watery blue eyes, limp yellow hair, and a huge bosom, yet her voice was a fluttering squeak. It was hard to picture her in the Dreadfort in her pink lace and cape of vair.  My lord grandfather offered Roose his bride’s weight in silver as a dowry, though, so my lord of Bolton picked me.  The girl’s chins jiggled when she laughed.  I weigh six stone more than Fair Walda, but that was the first time I was glad of it. I’m Lady Bolton now and my cousin’s still a maid, and she’ll be nineteen soon, poor thing.   The Lord of the Dreadfort paid the chatter no mind, Catelyn saw. Sometimes he tasted a bite of this, a spoon of that, tearing bread from the loaf with short strong fingers, but the meal could not distract him. Bolton had made a toast to Lord Walder’s grandsons when the wedding feast began, pointedly mentioning that Walder and Walder were in the care of his bastard son. From the way the old man had squinted at him, his mouth sucking at the air, Catelyn knew he had heard the unspoken threat.  Was there ever a wedding less joyful? she wondered, until she remembered her poor Sansa and her marriage to the Imp. Mother take mercy on her. She has a gentle soul. The heat and smoke and noise were making her sick. The musicians in the gallery might be numerous and loud, but they were not especially gifted. Catelyn took another swallow of wine and allowed a page to refill her cup. A few more hours, and the worst will be over. By this hour tomorrow Robb would be off to another battle, this time with the ironmen at Moat Cailin. Strange, how that prospect seemed almost a relief. He will win his battle. He wins all his battles, and the ironborn are without a king. Besides, Ned taught him well. The drums were pounding. Jinglebell hopped past her once again, but the music was so loud she could scarcely hear his bells.  Above the din came a sudden snarling as two dogs fell upon each other over a scrap of meat. They rolled across the floor, snapping and biting, as a howl of mirth went up. Someone doused them with a flagon of ale and they broke apart. One limped toward the dais. Lord Walder’s toothless mouth opened in a bark of laughter as the dripping wet dog shook ale and hair all over three of his grandsons.  The sight of the dogs made Catelyn wish once more for Grey Wind, but Robb’s direwolf was nowhere to be seen. Lord Walder had refused to allow him in the hall.  Your wild beast has a taste for human flesh, I hear, heh,  the old man had said.  Rips out throats, yes. I’ll have no such creature at my Roslin’s feast, amongst women and little ones, all my sweet innocents.    Grey Wind is no danger to them, my lord,  Robb protested.  Not so long as I am there.    You were there at my gates, were you not? When the wolf attacked the grandsons I sent to greet you? I heard all about that, don’t think I didn’t, heh.    No harm was done—    No harm, the king says? No harm? Petyr fell from his horse, fell. I lost a wife the same way, falling.  His mouth worked in and out.  Or was she just some strumpet? Bastard Walder’s mother, yes, now I recall. She fell off her horse and cracked her head. What would Your Grace do if Petyr had broken his neck, heh? Give me another apology in place of a grandson? No, no, no. Might be you’re king, I won’t say you’re not, the King in the North, heh, but under my roof, my rule. Have your wolf or have your wedding, sire. You’ll not have both.   Catelyn could tell that her son was furious, but he yielded with as much courtesy as he could summon. If it pleases Lord Walder to serve me stewed crow smothered in maggots, he’d told her, I’ll eat it and ask for a second bowl."
}