{
  "id": "72dc69a79d39cd159d743a36bef5be78ca46e7ff",
  "text": " Even so, it would be years before they were large enough to take to war. And they must be trained as well, or they will lay my kingdom waste. For all her Targaryen blood, Dany had not the least idea of how to train a dragon.  Ser Jorah Mormont came to her as the sun was going down.  The Pureborn refused you?    As you said they would. Come, sit, give me your counsel.  Dany drew him down to the cushions beside her, and Jhiqui brought them a bowl of purple olives and onions drowned in wine.   You will get no help in this city, Khaleesi.  Ser Jorah took an onion between thumb and forefinger.  Each day I am more convinced of that than the day before. The Pureborn see no farther than the walls of Qarth, and Xaro…    He asked me to marry him again.    Yes, and I know why.  When the knight frowned, his heavy black brows joined together above his deep-set eyes.   He dreams of me, day and night.  She laughed.   Forgive me, my queen, but it is your dragons he dreams of.    Xaro assures me that in Qarth, man and woman each retain their own property after they are wed. The dragons are mine.  She smiled as Drogon came hopping and flapping across the marble floor to crawl up on the cushion beside her.   He tells it true as far as it goes, but there’s one thing he failed to mention. The Qartheen have a curious wedding custom, my queen. On the day of their union, a wife may ask a token of love from her husband. Whatsoever she desires of his worldly goods, he must grant. And he may ask the same of her. One thing only may be asked, but whatever is named may not be denied.    One thing,  she repeated.  And it may not be denied?    With one dragon, Xaro Xhoan Daxos would rule this city, but one ship will further our cause but little.   Dany nibbled at an onion and reflected ruefully on the faithlessness of men.  We passed through the bazaar on our way back from the Hall of a Thousand Thrones,  she told Ser Jorah.  Quaithe was there.  She told him of the firemage and the fiery ladder, and what the woman in the red mask had told her.   I would be glad to leave this city, if truth be told,  the knight said when she was done.  But not for Asshai.    Where, then?    East,  he said.   I am half a world away from my kingdom even here. If I go any farther east I may never find my way home to Westeros.    If you go west, you risk your life.    House Targaryen has friends in the Free Cities,  she reminded him.  Truer friends than Xaro or the Pureborn.    If you mean Illyrio Mopatis, I wonder. For sufficient gold, Illyrio would sell you as quickly as he would a slave.    My brother and I were guests in Illyrio’s manse for half a year. If he meant to sell us, he could have done it then.    He did sell you,  Ser Jorah said.  To Khal Drogo.   Dany flushed. He had the truth of it, but she did not like the sharpness with which he put it.  Illyrio protected us from the Usurper’s knives, and he believed in my brother’s cause.    Illyrio believes in no cause but Illyrio. Gluttons are greedy men as a rule, and magisters are devious. Illyrio Mopatis is both. What do you truly know of him?    I know that he gave me my dragon eggs.   He snorted.  If he’d known they were like to hatch, he’d would have sat on them himself.   That made her smile despite herself.  Oh, I have no doubt of that, ser. I know Illyrio better than you think. I was a child when I left his manse in Pentos to wed my sun-and-stars, but I was neither deaf nor blind. And I am no child now.    Even if Illyrio is the friend you think him,  the knight said stubbornly,  he is not powerful enough to enthrone you by himself, no more than he could your brother.    He is rich,  she said.  Not so rich as Xaro, perhaps, but rich enough to hire ships for me, and men as well.    Sellswords have their uses,  Ser Jorah admitted,  but you will not win your father’s throne with sweepings from the Free Cities. Nothing knits a broken realm together so quick as an invading army on its soil.    I am their rightful queen,  Dany protested.   You are a stranger who means to land on their shores with an army of outlanders who cannot even speak the Common Tongue. The lords of Westeros do not know you, and have every reason to fear and mistrust you. You must win them over before you sail. A few at least.    And how am I to do that, if I go east as you counsel?   He ate an olive and spit out the pit into his palm.  I do not know, Your Grace,  he admitted,  but I do know that the longer you remain in one place, the easier it will be for your enemies to find you. The name Targaryen still frightens them, so much so that they sent a man to murder you when they heard you were with child. What will they do when they learn of your dragons?   Drogon was curled up beneath her arm, as hot as a stone that has soaked all day in the blazing sun. Rhaegal and Viserion were fighting over a scrap of meat, buffeting each other with their wings as smoke hissed from their nostrils. My furious children, she thought. They must not come to harm."
}