{
  "id": "730a13d1b1bbf2a5cc6429bfdd825818c4d1f0e0",
  "text": "  Toad’s shrill laughter boomed through the trees. Jon’s mare snorted.   Keep quiet, all of you,  Haider said.  I thought I heard something.    Where? I didn’t hear anything.  The horses stopped.   You can’t hear yourself fart.    I can too,  Grenn insisted.   Quiet!   They all fell silent, listening. Jon found himself holding his breath. Sam, he thought. He hadn’t gone to the Old Bear, but he hadn’t gone to bed either, he’d woken the other boys. Damn them all. Come dawn, if they were not in their beds, they’d be named deserters too. What did they think they were doing?  The hushed silence seemed to stretch on and on. From where Jon crouched, he could see the legs of their horses through the branches. Finally Pyp spoke up.  What did you hear?    I don’t know,  Haider admitted.  A sound, I thought it might have been a horse but…    There’s nothing here.   Out of the corner of his eye, Jon glimpsed a pale shape moving through the trees. Leaves rustled, and Ghost came bounding out of the shadows, so suddenly that Jon’s mare started and gave a whinny.  There!  Halder shouted.   I heard it too!    Traitor,  Jon told the direwolf as he swung up into the saddle. He turned the mare’s head to slide off through the trees, but they were on him before he had gone ten feet.   Jon!  Pyp shouted after him.   Pull up,  Grenn said.  You can’t outrun us all.   Jon wheeled around to face them, drawing his sword.  Get back. I don’t wish to hurt you, but I will if I have to.    One against seven?  Halder gave a signal. The boys spread out, surrounding him.   What do you want with me?  Jon demanded.   We want to take you back where you belong,  Pyp said.   I belong with my brother.    We’re your brothers now,  Grenn said.   They’ll cut off your head if they catch you, you know,  Toad put in with a nervous laugh.  This is so stupid, it’s like something the Aurochs would do.    I would not,  Grenn said.  I’m no oathbreaker. I said the words and I meant them.    So did I,  Jon told them.  Don’t you understand? They murdered my father. It’s war, my brother Robb is fighting in the riverlands—    We know,  said Pyp solemnly.  Sam told us everything.    We’re sorry about your father,  Grenn said,  but it doesn’t matter. Once you say the words, you can’t leave, no matter what.    I have to,  Jon said fervently.   You said the words,  Pyp reminded him.  Now my watch begins, you said it. It shall not end until my death.    I shall live and die at my post,  Grenn added, nodding.   You don’t have to tell me the words, I know them as well as you do.  He was angry now. Why couldn’t they let him go in peace? They were only making it harder.   I am the sword in the darkness,  Halder intoned.   The watcher on the walls,  piped Toad.  Jon cursed them all to their faces. They took no notice. Pyp spurred his horse closer, reciting,  I am the fire that burns against the cold, the light that brings the dawn, the horn that wakes the sleepers, the shield that guards the realms of men.    Stay back,  Jon warned him, brandishing his sword.  I mean it, Pyp.  They weren’t even wearing armor, he could cut them to pieces if he had to.  Matthar had circled behind him. He joined the chorus.  I pledge my life and honor to the Night’s Watch.   Jon kicked his mare, spinning her in a circle. The boys were all around him now, closing from every side.   For this night…  Halder trotted in from the left.   …and all the nights to come,  finished Pyp. He reached over for Jon’s reins.  So here are your choices. Kill me, or come back with me.   Jon lifted his sword… and lowered it, helpless.  Damn you,  he said.  Damn you all.    Do we have to bind your hands, or will you give us your word you’ll ride back peaceful?  asked Halder.   I won’t run, if that’s what you mean.  Ghost moved out from under the trees and Jon glared at him.  Small help you were,  he said. The deep red eyes looked at him knowingly.   We had best hurry,  Pyp said.  If we’re not back before first light, the Old Bear will have all our heads.   Of the ride back, Jon Snow remembered little. It seemed shorter than the journey south, perhaps because his mind was elsewhere. Pyp set the pace, galloping, walking, trotting, and then breaking into another gallop. Mole’s Town came and went, the red lantern over the brothel long extinguished. They made good time. Dawn was still an hour off when Jon glimpsed the towers of Castle Black ahead of them, dark against the pale immensity of the Wall. It did not seem like home this time.  They could take him back, Jon told himself, but they could not make him stay. The war would not end on the morrow, or the day after, and his friends could not watch him day and night. He would bide his time, make them think he was content to remain here… and then, when they had grown lax, he would be off again. Next time he would avoid the kingsroad. He could follow the Wall east, perhaps all the way to the sea, a longer route but a safer one. Or even west, to the mountains, and then south over the high passes."
}