{
  "id": "732e179653279da816b1b8f4ea2abc04b8a5ed3e",
  "text": "  The good part was, with so little traffic there’d be no one to point the finger and say which way they’d gone. The human flood that had flowed down the kingsroad was only a trickle here.  The bad part was, the road wound back and forth like a snake, tangling with even smaller trails and sometimes seeming to vanish entirely only to reappear half a league farther on when they had all but given up hope. Arya hated it. The land was gentle enough, rolling hills and terraced fields interspersed with meadows and woodlands and little valleys where willows crowded close to slow shallow streams. Even so, the path was so narrow and crooked that their pace had dropped to a crawl.  It was the wagons that slowed them, lumbering along, axles creaking under the weight of their heavy loads. A dozen times a day they had to stop to free a wheel that had stuck in a rut, or double up the teams to climb a muddy slope. Once, in the middle of a dense stand of oak, they came face-to-face with three men pulling a load of firewood in an ox cart, with no way for either to get around. There had been nothing for it but to wait while the foresters unhitched their ox, led him through the trees, spun the cart, hitched the ox up again, and started back the way they’d come. The ox was even slower than the wagons, so that day they hardly got anywhere at all.  Arya could not help looking over her shoulder, wondering when the gold cloaks would catch them. At night, she woke at every noise to grab for Needle’s hilt. They never made camp without putting out sentries now, but Arya did not trust them, especially the orphan boys. They might have done well enough in the alleys of King’s Landing, but out here they were lost. When she was being quiet as a shadow, she could sneak past all of them, flitting out by starlight to make her water in the woods where no one would see. Once, when Lommy Greenhands had the watch, she shimmied up an oak and moved from tree to tree until she was right above his head, and he never saw a thing. She would have jumped down on top of him, but she knew his scream would wake the whole camp, and Yoren might take a stick to her again.  Lommy and the other orphans all treated the Bull like someone special now because the queen wanted his head, though he would have none of it.  I never did nothing to no queen,  he said angrily.  I did my work, is all. Bellows and tongs and fetch and carry. I was s’posed to be an armorer, and one day Master Mott says I got to join the Night’s Watch, that’s all I know.  Then he’d go off to polish his helm. It was a beautiful helm, rounded and curved, with a slit visor and two great metal bull’s horns. Arya would watch him polish the metal with an oilcloth, shining it so bright you could see the flames of the cookfire reflected in the steel. Yet he never actually put it on his head.   I bet he’s that traitor’s bastard,  Lommy said one night, in a hushed voice so Gendry would not hear.  The wolf lord, the one they nicked on Baelor’s steps.    He is not,  Arya declared. My father only had one bastard, and that’s Jon. She stalked off into the trees, wishing she could just saddle her horse and ride home. She was a good horse, a chestnut mare with a white blaze on her forehead. And Arya had always been a good rider. She could gallop off and never see any of them, unless she wanted to. Only then she’d have no one to scout ahead of her, or watch behind, or stand guard while she napped, and when the gold cloaks caught her, she’d be all alone. It was safer to stay with Yoren and the others.   We’re not far from Gods Eye,  the black brother said one morning.  The kingsroad won’t be safe till we’re across the Trident. So we’ll come up around the lake along the western shore, they’re not like to look for us there.  At the next spot where two ruts cut cross each other, he turned the wagons west.  Here farmland gave way to forest, the villages and holdfasts were smaller and farther apart, the hills higher and the valleys deeper. Food grew harder to come by. In the city, Yoren had loaded up the wagons with salt fish, hard bread, lard, turnips, sacks of beans and barley, and wheels of yellow cheese, but every bite of it had been eaten. Forced to live off the land, Yoren turned to Koss and Kurz, who’d been taken as poachers. He would send them ahead of the column, into the woods, and come dusk they would be back with a deer slung between them on a pole or a brace of quail swinging from their belts. The younger boys would be set to picking blackberries along the road, or climbing fences to fill a sack with apples if they happened upon an orchard.  Arya was a skilled climber and a fast picker, and she liked to go off by herself. One day she came across a rabbit, purely by happenstance. It was brown and fat, with long ears and a twitchy nose. Rabbits ran faster than cats, but they couldn’t climb trees half so well. She whacked it with her stick and grabbed it by its ears, and Yoren stewed it with some mushrooms and wild onions."
}