{
  "id": "739fff21e31087b6dd068d01c834c0f2dcf6032b",
  "text": " Tell her…  What? What would possibly make Lysa Anyn relent? The inspiration came to Tyrion Lannister suddenly.  …tell her that I wish to confess my crimes.   Mord raised his arm and Tyrion braced himself for another blow, but the turnkey hesitated. Suspicion and greed warred in his eyes. He wanted that gold, yet he feared a trick; he had the look of a man who had often been tricked.  Is lie,  he muttered darkly.  Dwarf man cheat me.    I will put my promise in writing,  Tyrion vowed.  Some illiterates held writing in disdain; others seemed to have a superstitious reverence for the written word, as if it were some sort of magic. Fortunately, Mord was one of the latter. The turnkey lowered the strap.  Writing down gold. Much gold.    Oh, much gold,  Tyrion assured him.  The purse is just a taste, my friend. My brother wears armor of solid gold plate.  In truth, Jaime’s armor was gilded steel, but this oaf would never know the difference.  Mord fingered his strap thoughtfully, but in the end, he relented and went to fetch paper and ink. When the letter was written, the gaoler frowned at it suspiciously.  Now deliver my message,  Tyrion urged.  He was shivering in his sleep when they came for him, late that night. Mord opened the door but kept his silence. Ser Vardis Egen woke Tyrion with the point of his boot.  On your feet, Imp. My lady wants to see you.   Tyrion rubbed the sleep from his eyes and put on a grimace he scarcely felt.  No doubt she does, but what makes you think I wish to see her?   Ser Vardis frowned. Tyrion remembered him well from the years he had spent at King’s Landing as the captain of the Hand’s household guard. A square, plain face, silver hair, a heavy build, and no humor whatsoever.  Your wishes are not my concern. On your feet, or I’ll have you carried.   Tyrion clambered awkwardly to his feet.  A cold night,  he said casually,  and the High Hall is so drafty. I don’t wish to catch a chill. Mord, if you would be so good, fetch my cloak.   The gaoler squinted at him, face dull with suspicion.   My cloak,  Tyrion repeated.  The shadowskin you took from me for safekeeping. You recall.    Get him the damnable cloak,  Ser Vardis said.  Mord did not dare grumble. He gave Tyrion a glare that promised future retribution, yet he went for the cloak. When he draped it around his prisoner’s neck, Tyrion smiled.  My thanks. I shall think of you whenever I wear it.  He flung the trailing end of the long fur over his right shoulder, and felt warm for the first time in days.  Lead on, Ser Vardis.   The High Hall of the Arryns was aglow with the light of fifty torches, burning in the sconces along the walls. The Lady Lysa wore black silk, with the moon-and-falcon sewn on her breast in pearls. Since she did not look the sort to join the Night’s Watch, Tyrion could only imagine that she had decided mourning clothes were appropriate garb for a confession. Her long auburn hair, woven into an elaborate braid, fell across her left shoulder. The taller throne beside her was empty; no doubt the little Lord of the Eyrie was off shaking in his sleep. Tyrion was thankful for that much, at least.  He bowed deeply and took a moment to glance around the hall. Lady Arryn had summoned her knights and retainers to hear his confession, as he had hoped. He saw Ser Brynden Tully’s craggy face and Lord Nestor Royce’s bluff one. Beside Nestor stood a younger man with fierce black side-whiskers who could only be his heir, Ser Albar. Most of the principal houses of the Vale were represented. Tyrion noted Ser Lyn Corbray, slender as a sword, Lord Hunter with his gouty legs, the widowed Lady Waynwood surrounded by her sons. Others sported sigils he did not know; broken lance, green viper, burning tower, winged chalice.  Among the lords of the Vale were several of his companions from the high road; Ser Rodrik Cassel, pale from half-healed wounds, stood with Ser Willis Wode beside him. Marillion the singer had found a new woodharp. Tyrion smiled; whatever happened here tonight, he did not wish it to happen in secret, and there was no one like a singer for spreading a story near and far.  In the rear of the hall, Bronn lounged beneath a pillar. The freerider’s black eyes were fixed on Tyrion, and his hand lay lightly on the pommel of his sword. Tyrion gave him a long look, wondering…  Catelyn Stark spoke first.  You wish to confess your crimes, we are told.    I do, my lady,  Tyrion answered.  Lysa Arryn smiled at her sister.  The sky cells always break them. The gods can see them there, and there is no darkness to hide in.    He does not look broken to me,  Lady Catelyn said.  Lady Lysa paid her no mind.  Say what you will,  she commanded Tyrion.  And now to roll the dice, he thought with another quick glance back at Bronn.  Where to begin? I am a vile little man, I confess it. My crimes and sins are beyond counting, my lords and ladies. I have lain with whores, not once but hundreds of times. I have wished my own lord father dead, and my sister, our gracious queen, as well."
}