{
  "id": "73bd49193e3193022065e44c4cdeb0e1cb5b4c1b",
  "text": " Aggo shall strike southwest, Rakharo due south. Jhogo, you are to follow shierak qiya on southeast.    What shall we seek, Khaleesi?  asked Jhogo.   Whatever there is,  Dany answered.  Seek for other cities, living and dead. Seek for caravans and people. Seek for rivers and lakes and the great salt sea. Find how far this waste extends before us, and what lies on the other side. When I leave this place, I do not mean to strike out blind again. I will know where I am bound, and how best to get there.   And so they went, the bells in their hair ringing softly, while Dany settled down with her small band of survivors in the place they named Vaes Tolorro, the city of bones. Day followed night followed day. Women harvested fruit from the gardens of the dead. Men groomed their mounts and mended saddles, stirrups, and shoes. Children wandered the twisty alleys and found old bronze coins and bits of purple glass and stone flagons with handles carved like snakes. One woman was stung by a red scorpion, but hers was the only death. The horses began to put on some flesh. Dany tended Ser Jorah’s wound herself, and it began to heal.  Rakharo was the first to return. Due south the red waste stretched on and on, he reported, until it ended on a bleak shore beside the poison water. Between here and there lay only swirling sand, wind-scoured rocks, and plants bristly with sharp thorns. He had passed the bones of a dragon, he swore, so immense that he had ridden his horse through its great black jaws. Other than that, he had seen nothing.  Dany gave him charge of a dozen of her strongest men, and set them to pulling up the plaza to get to the earth beneath. If devilgrass could grow between the paving stones, other grasses would grow when the stones were gone. They had wells enough, no lack of water. Given seed, they could make the plaza bloom.  Aggo was back next. The southwest was barren and burnt, he swore. He had found the ruins of two more cities, smaller than Vaes Tolorro but otherwise the same. One was warded by a ring of skulls mounted on rusted iron spears, so he dared not enter, but he had explored the second for as long as he could. He showed Dany an iron bracelet he had found, set with a uncut fire opal the size of her thumb. There were scrolls as well, but they were dry and crumbling and Aggo had left them where they lay.  Dany thanked him and told him to see to the repair of the gates. If enemies had crossed the waste to destroy these cities in ancient days, they might well come again.  If so, we must be ready,  she declared.  Jhogo was gone so long that Dany feared him lost, but finally when they had all but ceased to look for him, he came riding up from the southeast. One of the guards that Aggo had posted saw him first and gave a shout, and Dany rushed to the walls to see for herself. It was true. Jhogo came, yet not alone. Behind him rode three queerly garbed strangers atop ugly humped creatures that dwarfed any horse.  They drew rein before the city gates, and looked up to see Dany on the wall above them.  Blood of my blood,  Jhogo called,  I have been to the great city Qarth, and returned with three who would look on you with their own eyes.   Dany stared down at the strangers.  Here I stand. Look, if that is your pleasure… but first tell me your names.   The pale man with the blue lips replied in guttural Dothraki,  I am Pyat Pree, the great warlock.   The bald man with the jewels in his nose answered in the Valyrian of the Free Cities,  I am Xaro Xhoan Daxos of the Thirteen, a merchant prince of Qarth.   The woman in the lacquered wooden mask said in the Common Tongue of the Seven Kingdoms,  I am Quaithe of the Shadow. We come seeking dragons.    Seek no more,  Daenerys Targaryen told them.  You have found them.       JON  Whitetree, the village was named on Sam’s old maps. Jon did not think it much of a village. Four tumbledown one-room houses of unmortared stone surrounded an empty sheepfold and a well. The houses were roofed with sod, the windows shuttered with ragged pieces of hide. And above them loomed the pale limbs and dark red leaves of a monstrous great weirwood.  It was the biggest tree Jon Snow had ever seen, the trunk near eight feet wide, the branches spreading so far that the entire village was shaded beneath their canopy. The size did not disturb him so much as the face… the mouth especially, no simple carved slash, but a jagged hollow large enough to swallow a sheep.  Those are not sheep bones, though. Nor is that a sheep’s skull in the ashes.   An old tree.  Mormont sat his horse, frowning.  Old,  his raven agreed from his shoulder.  Old, old, old.    And powerful.  Jon could feel the power.  Thoren Smallwood dismounted beside the trunk, dark in his plate and mail.  Look at that face. Small wonder men feared them, when they first came to Westeros. I’d like to take an axe to the bloody thing myself.   Jon said,  My lord father believed no man could tell a lie in front of a heart tree. The old gods know when men are lying."
}