{
  "id": "74052ec97823d3ef08d072684d402744bfcf29fe",
  "text": "  Your men have gone through my ships and tallied every bead of amber and jar of saffron. How much do I have?    Sufficient to be buying one of thousands,  the Good Master said, with a contemptuous smile.  Yet you are paying double, you are saying. Five centuries, then, is all you buy.    Your pretty crown might buy another century,  said the fat one in Valyrian.  Your crown of the three dragons.   Dany waited for his words to be translated.  My crown is not for sale.  When Viserys sold their mother’s crown, the last joy had gone from him, leaving only rage.  Nor will I enslave my people, nor sell their goods and horses. But my ships you can have. The great cog Balerion and the galleys Vhagar and Meraxes.  She had warned Groleo and the other captains it might come to this, though they had protested the necessity of it furiously.  Three good ships should be worth more than a few paltry eunuchs.   The fat Grazdan turned to the others. They conferred in low voices once again.  Two of the thousands,  the one with the spiked beard said when he turned back.  It is too much, but the Good Masters are being generous and your need is being great.   Two thousand would never serve for what she meant to do. I must have them all. Dany knew what she must do now, though the taste of it was so bitter that even the persimmon wine could not cleanse it from her month. She had considered long and hard and found no other way. It is my only choice.  Give me all,  she said,  and you may have a dragon.   There was the sound of indrawn breath from Jhiqui beside her. Kraznys smiled at his fellows.  Did I not tell you? Anything, she would give us.   Whitebeard stared in shocked disbelief. His hand trembled where it grasped the staff.  No.  He went to one knee before her.  Your Grace, I beg you, win your throne with dragons, not slaves. You must not do this thing—    You must not presume to instruct me. Ser Jorah, remove Whitebeard from my presence.   Mormont seized the old man roughly by an elbow, yanked him back to his feet, and marched him out onto the terrace.   Tell the Good Masters I regret this interruption,  said Dany to the slave girl.  Tell them I await their answer.   She knew the answer, though; she could see it in the glitter of their eyes and the smiles they tried so hard to hide. Astapor had thousands of eunuchs, and even more slave boys waiting to be cut, but there were only three living dragons in all the great wide world. And the Ghiscari lust for dragons. How could they not? Five times had Old Ghis contended with Valyria when the world was young, and five times gone down to bleak defeat. For the Freehold had dragons, and the Empire had none.  The oldest Grazdan stirred in his seat, and his pearls clacked together softly.  A dragon of our choice,  he said in a thin, hard voice.  The black one is largest and healthiest.    His name is Drogon.  She nodded.   All your goods, save your crown and your queenly raiment, which we will allow you to keep. The three ships. And Drogon.    Done,  she said, in the Common Tongue.   Done,  the old Grazdan answered in his thick Valyrian.  The others echoed that old man of the pearl fringe.  Done,  the slave girl translated,  and done, and done, eight times done.    The Unsullied will learn your savage tongue quick enough,  added Kraznys mo Nakloz, when all the arrangements had been made,  but until such time you will need a slave to speak to them. Take this one as our gift to you, a token of a bargain well struck.    I shall,  said Dany.  The slave girl rendered his words to her, and hers to him. If she had feelings about being given for a token, she took care not to let them show.  Arstan Whitebeard held his tongue as well, when Dany swept by him on the terrace. He followed her down the steps in silence, but she could hear his hardwood staff tap tapping on the red bricks as they went. She did not blame him for his fury. It was a wretched thing she did. The Mother of Dragons has sold her strongest child. Even the thought made her ill.  Yet down in the Plaza of Pride, standing on the hot red bricks between the slavers’ pyramid and the barracks of the eunuchs, Dany turned on the old man.  Whitebeard,  she said,  I want your counsel, and you should never fear to speak your mind with me… when we are alone. But never question me in front of strangers. Is that understood?    Yes, Your Grace,  he said unhappily.   I am not a child,  she told him.  I am a queen.    Yet even queens can err. The Astapori have cheated you, Your Grace. A dragon is worth more than any army. Aegon proved that three hundred years ago, upon the Field of Fire.    I know what Aegon proved. I mean to prove a few things of my own.  Dany turned away from him, to the slave girl standing meekly beside her litter.  Do you have a name, or must you draw a new one every day from some barrel?    That is only for Unsullied,  the girl said. Then she realized the question had been asked in High Valyrian. Her eyes went wide.  Oh.    Your name is Oh?    No."
}