{
  "id": "7419f3aea71505452804f37a8b507479a747a086",
  "text": " He  wondered how  he  would break it to them.       The four younger  hobbits were, however, in high spirits, and the party  soon became very cheerful in spite of Gandalf's absence. The dining-room was  bare except for a table  and  chairs,  but the food  was good, and there was  good  wine:  Frodo's  wine  had  not  been  included  in  the  sale  to  the  Sackville-Bagginses.       'Whatever happens to  the rest of my stuff, when the S.-B.s  get  their  claws on  it, at any rate I have found a good home for this!' said Frodo, as  he drained his glass. It was the last drop of Old Winyards.        When they had sung many songs, and talked of  many things they had done  together,  they toasted  Bilbo's birthday, and  they  drank his  health  and  Frodo's together according to Frodo's custom. Then they went out for a sniff  of air, and glimpse of the stars, and then  they went to bed.  Frodo's party  was over, and Gandalf had not come.       The next morning they were busy packing another cart with the remainder  of the luggage. Merry took charge of this, and drove off with Fatty (that is  Fredegar  Bolger).  'Someone must get there and  warm the house  before  you   arrive,' said Merry.  'Well, see you later - the day  after tomorrow,  if you   don't go to sleep on the way!'       Folco went  home  aft er lunch,  but Pippin remained behind.  Frodo  was  restless and anxious,  listening in vain for a  sound of Gandalf. He decided  to  wait until  nightfall. After that,  if  Gandalf wanted him urgently,  he  would go to Crickhollow, and might even get there first. For Frodo was going  on foot. His plan - for pleasure and a last look at the Shire as much as any  other reason  -  was to walk from Hobbiton to  Bucklebury  Ferry, taking  it   ####-fairly easy.       'I shall  get  myself a bit  into  training,  too,' he said, looking at  himself  in  a dusty mirror in the  half-empty  hall.  He  had  not done any  strenuous walking for a long time, and the reflection  looked rather flabby,  he thought.       After lunch, the Sackville-Bagginses, Lobelia and her sandy-haired son,  Lotho, turned  up, much to Frodo's annoyance. 'Ours at last!' said  Lobelia,  as she stepped inside. It was not polite; nor strictly true, for the sale of  Bag  End  did not take effect  until  midnight.  But Lobelia  can perhaps be  forgiven: she had been obliged to wait about seventy-seven years  longer for   Bag End  than she once hoped, and she was now  a  hundred years old.  Anyway,  she had  come to see that nothing she had paid for had been carried off; and  she wanted the keys. It took a long while to satisfy her, as she had brought  a complete inventory  with her and went  right through  it. In  the end  she  departed with Lotho and  the spare  key and  the promise that the  other key  would  be  left at  the  Gamgees' in Bagshot Row.  She  snorted, and  showed  plainly that she  thought the Gamgees  capable of plundering the hole during   the night. Frodo did not offer her any tea.       He took his own tea with Pippin and Sam Gamgee  in the  kitchen. It had  been  officially announced that Sam was coming to Buckland  'to  do for  Mr.  Frodo and look after his bit of garden'; an arrangement that was approved by  the Gaffer, though it did not console him for the prospect of having Lobelia   as a neighbour.       'Our  last meal at  Bag End!'  said Frodo, pushing back his chair. They  left the washing up  for Lobelia.  Pippin  and Sam  strapped  up their three  packs and piled them in the porch. Pippin went out for a last  stroll in the  garden. Sam disappeared.       The sun went down. Bag End seemed sad and gloomy and dishevelled.  Frodo  wandered round the familiar rooms,  and saw the light  of the sunset fade on  the walls,  and  shadows  creep out  of  the  corners.  It  grew slowly dark  indoors. He went out and walked down to  the gate at the bottom of the path,   and then on a short way down the Hill Road. He half expected to  see Gandalf  come striding up through the dusk.       The sky was clear and the stars were growing bright. 'It's going  to be  a fine night,'  he  said  aloud.  'That's good for a beginning.  I feel like   ####-walking. I  can't  bear any  more  hanging about. I am going  to start,  and  Gandalf must follow  me.'  He  turned to go back, and  then  slopped, for he  heard voices, just round the corner by the end of Bagshot Row. One voice was  certainly the old Gaffer's;  the other was strange, and  somehow  unpleasant.  He could not make out what it said, but he heard the Gaffer's answers, which  were rather shrill. The old man seemed put out.       'No, Mr. Baggins has gone away. Went this morning, and my Sam went  with  him: anyway all  his stuff went.  Yes, sold out and  gone,  I tell'ee.  Why?   Why's none of my business, or yours.  Where to?  That ain't no  secret. He's  moved to Bucklebury or some such place, away down yonder. Yes it is  - a tidy  way.  I've never been so far myself; they're  queer folks in Buckland."
}