{
  "id": "74914e8bdc6a3de16380ce1cd37783e036289893",
  "text": " It was a large, square, very worn piece of parchment with nothing written on it. Harry, suspecting one of Fred and George's jokes, stared at it.  \"What's that supposed to be?\"  \"This, Harry, is the secret of our success,\" said George, patting the parchment fondly.  \"It's a wrench, giving it to you,\" said Fred, \"but we decided last night, your need's greater than ours.\"  \"Anyway, we know it by heart,\" said George. \"We bequeath it to you. We don't really need it anymore.\"  \"And what do I need with a bit of old parchment?\" said Harry.  \"A bit of old parchment!\" said Fred, closing his eyes with a grimace as though Harry had mortally offended him. \"Explain, George.\"  \"Well... when we were in our first year, Harry -- young, carefree, and innocent --\"  Harry snorted. He doubted whether Fred and George had ever been innocent.  \"Well, more innocent than we are now -- we got into a spot of bother with Filch.\"  \"We let off a Dungbomb in the corridor and it upset him for some reason --\"  \"So he hauled us off to his office and started threatening us with the usual --\" detention disembowelment and we couldn't help noticing a drawer in one of his filing cabinets marked Confiscated and Highly Dangerous.  \"Don't tell me --\" said Harry, starting to grin.  \"Well, what would you've done?\" said Fred. \"George caused a diversion by dropping another Dungbomb, I whipped the drawer open, and grabbed -- this.\"  \"It's not as bad as it sounds, you know,\" said George. \"We don't reckon Filch ever found out how to work it. He probably suspected what it was, though, or he wouldn't have confiscated it.\"  \"And you know how to work it?\"  \"Oh yes,\" said Fred, smirking. \"This little beauty's taught us more than all the teachers in this school.\"  \"You're winding me up,\" said Harry, looking at the ragged old bit of parchment.  \"Oh, are we?\" said George.  He took out his wand, touched the parchment lightly, and said, \"I solemnly swear that I am up to no good.\"  And at once, thin ink lines began to spread like a spider's web from the point that George's wand had touched. They joined each other, they crisscrossed, they fanned into every corner of the parchment; then words began to blossom across the top, great, curly green words, that proclaimed:  Messrs. Moony, Wormtail, Padfoot, and Prongs  Purveyors of Aids to Magical Mischief-Makers are proud to present THE MARAUDER'S MAP  It was a map showing every detail of the Hogwarts castle and grounds. But the truly remarkable thing were the tiny ink dots moving around it, each labeled with a name in minuscule writing. Astounded, Harry bent over it. A labeled dot in the top left corner showed that Professor Dumbledore was pacing his study; the caretaker's cat, Mrs. Norris, was prowling the second floor; and Peeves the Poltergeist was currently bouncing around the trophy room. And as Harry's eyes traveled up and down the familiar corridors, he noticed something else.  This map showed a set of passages he had never entered. And many of them seemed to lead -  \"Right into Hogsmeade,\" said Fred, tracing one of them with his finger. \"There are seven in all. Now, Filch knows about these four\" -- he pointed them out -- \"but we're sure we're the only ones who know about these. Don't bother with the one behind the mirror on the fourth floor. We used it until last winter, but it's caved in -- completely blocked. And we don't reckon anyone's ever used this one, because the Whomping Willow's planted right over the entrance. But this one here, this one leads right into the cellar of Honeydukes. We've used it loads of times. And as you might've noticed, the entrance is right outside this room, through that one-eyed old crone's hump.\"  \"Moony, Wormtaill Padfoot, and Prongs,\" sighed George, patting the heading of the map. \"We owe them so much.\"  \"Noble men, working tirelessly to help a new generation of lawbreakers,\" said Fred solemnly.  \"Right,\" said George briskly. \"Don't forget to wipe it after you've used it or anyone can read it,\" Fred said warningly.  \"Just tap it again and say, 'Mischief managed!' And it'll go blank.\"  \"So, young Harry,\" said Fred, in an uncanny impersonation of Percy, \"mind you behave yourself.\"  \"See you in Honeydukes,\" said George, winking.  They left the room, both smirking in a satisfied sort of way.  Harry stood there, gazing at the miraculous map. He watched the tiny ink Mrs. Norris turn left and pause to sniff at something on the floor. If Filch really didn't know... he wouldn't have to pass the dementors at all....  But even as he stood there, flooded with excitement, something Harry had once heard Mr. Weasley say came floating out of his memory.  Never trust anything that can think for itself, if you can't see where it keeps its brain.  This map was one of those dangerous magical objects Mr. Weasley had been warning against.... Aids for Magical Mischief Makers... but then, Harry reasoned, he only wanted to use it to get into Hogsmeade, it wasn't as though he wanted to steal anything or attack anyone."
}