{
  "id": "75bd0a83d8c2d72b4ba63ed864977692cdcdaf5a",
  "text": "  I will find some duty for Ser Rolph, some pretext to send him away. Not because of his smell, but to ease your mind. You have suffered enough.   Relieved, Catelyn kissed him lightly on the cheek before the others could come around the turn of the stair, and for a moment he was her boy again, and not her king.  Lord Hoster’s private audience chamber was a small room above the Great Hall, better suited to intimate discussions. Robb took the high seat, removed his crown, and set it on the floor beside him as Catelyn rang for wine. Edmure was filling his uncle’s ear with the whole story of the fight at the Stone Mill. It was only after the servants had come and gone that the Blackfish cleared his throat and said,  I think we’ve all heard sufficient of your boasting, Nephew.   Edmure was taken aback.  Boasting? What do you mean?    I mean,  said the Blackfish,  that you owe His Grace your thanks for his forbearance. He played out that mummer’s farce in the Great Hall so as not to shame you before your own people. Had it been me I would have flayed you for your stupidity rather than praising this folly of the fords.    Good men died to defend those fords, Uncle.  Edmure sounded outraged.  What, is no one to win victories but the Young Wolf? Did I steal some glory meant for you, Robb?    Your Grace,  Robb corrected, icy.  You took me for your king, Uncle. Or have you forgotten that as well?   The Blackfish said,  You were commanded to hold Riverrun, Edmure, no more.    I held Riverrun, and I bloodied Lord Tywin’s nose—    So you did,  said Robb.  But a bloody nose won’t win the war, will it? Did you ever think to ask yourself why we remained in the west so long after Oxcross? You knew I did not have enough men to threaten Lannisport or Casterly Rock.    Why… there were other castles… gold, cattle…    You think we stayed for plunder?  Robb was incredulous.  Uncle, I wanted Lord Tywin to come west.    We were all horsed,  Ser Brynden said.  The Lannister host was mainly foot. We planned to run Lord Tywin a merry chase up and down the coast, then slip behind him to take up a strong defensive position athwart the gold road, at a place my scouts had found where the ground would have been greatly in our favor. If he had come at us there, he would have paid a grievous price. But if he did not attack, he would have been trapped in the west, a thousand leagues from where he needed to be. All the while we would have lived off his land, instead of him living off ours.    Lord Stannis was about to fall upon King’s Landing,  Robb said.  He might have rid us of Joffrey, the queen, and the Imp in one red stroke. Then we might have been able to make a peace.   Edmure looked from uncle to nephew.  You never told me.    I told you to hold Riverrun,  said Robb.  What part of that command did you fail to comprehend?    When you stopped Lord Tywin on the Red Fork,  said the Blackfish,  you delayed him just long enough for riders out of Bitterbridge to reach him with word of what was happening to the east. Lord Tywin turned his host at once, joined up with Matthis Rowan and Randyll Tarly near the headwaters of the Blackwater, and made a forced march to Tumbler’s Falls, where he found Mace Tyrell and two of his sons waiting with a huge host and a fleet of barges. They floated down the river, disembarked half a day’s ride from the city, and took Stannis in the rear.   Catelyn remembered King Renly’s court, as she had seen it at Bitterbridge. A thousand golden roses streaming in the wind, Queen Margaery’s shy smile and soft words, her brother the Knight of Flowers with the bloody linen around his temples. If you had to fall into a woman’s arms, my son, why couldn’t they have been Margaery Tyrell’s? The wealth and power of Highgarden could have made all the difference in the fighting yet to come. And perhaps Grey Wind would have liked the smell of her as well.  Edmure looked ill.  I never meant… never, Robb, you must let me make amends. I will lead the van in the next battle!   For amends, Brother? Or for glory? Catelyn wondered.   The next battle,  Robb said.  Well, that will be soon enough. Once Joffrey is wed, the Lannisters will take the fleld against me once more, I don’t doubt, and this time the Tyrells will march beside them. And I may need to fight the Freys as well, if Black Walder has his way…    So long as Theon Greyjoy sits in your father’s seat with your brothers’ blood on his hands, these other foes must wait,  Catelyn told her son.  Your first duty is to defend your own people, win back Winterfell, and hang Theon in a crow’s cage to die slowly. Or else put off that crown for good, Robb, for men will know that you are no true king at all.   From the way Robb looked at her, she could tell that it had been a long while since anyone had dared speak to him so bluntly.  When they told me Winterfell had fallen, I wanted to go north at once,  he said, with a hint of defensiveness.  I wanted to free Bran and Rickon, but I thought… I never dreamed that Theon could harm them, truly."
}