{
  "id": "75fc7cd65bee6deca2c0e159119c7617821ee638",
  "text": " We’re delivered, sweetling! They came up the roseroad and along the riverbank, through all the fields Stannis had burned, the ashes puffing up around their boots and turning all their armor grey, but oh! the banners must have been bright, the golden rose and golden lion and all the others, the Marbrand tree and the Rowan, Tarly’s huntsman and Redwyne’s grapes and Lady Oakheart’s leaf. All the westermen, all the power of Highgarden and Casterly Rock! Lord Tywin himself had their right wing on the north side of the river, with Randyll Tarly commanding the center and Mace Tyrell the left, but the vanguard won the fight. They plunged through Stannis like a lance through a pumpkin, every man of them howling like some demon in steel. And do you know who led the vanguard? Do you? Do you? Do you?    Robb?  It was too much to be hoped, but…   It was Lord Renly! Lord Renly in his green armor, with the fires shimmering off his golden antlers! Lord Renly with his tall spear in his hand! They say he killed Ser Guyard Morrigen himself in single combat, and a dozen other great knights as well. It was Renly, it was Renly, it was Renly! Oh! the banners, darling Sansa! Oh! to be a knight!       DAENERYS  She was breaking her fast on a bowl of cold shrimp-and-persimmon soup when Irri brought her a Qartheen gown, an airy confection of ivory samite patterned with seed pearls.  Take it away,  Dany said.  The docks are no place for lady’s finery.   If the Milk Men thought her such a savage, she would dress the part for them. When she went to the stables, she wore faded sandsilk pants and woven grass sandals. Her small breasts moved freely beneath a painted Dothraki vest, and a curved dagger hung from her medallion belt. Jhiqui had braided her hair Dothraki fashion, and fastened a silver bell to the end of the braid.  I have won no victories,  she tried telling her handmaid when the bell tinkled softly.  Jhiqui disagreed.  You burned the maegi in their house of dust and sent their souls to hell.   That was Drogon’s victory, not mine, Dany wanted to say, but she held her tongue. The Dothraki would esteem her all the more for a few bells in her hair. She chimed as she mounted her silver mare, and again with every stride, but neither Ser Jorah nor her bloodriders made mention of it. To guard her people and her dragons in her absence, she chose Rakharo. Jhogo and Aggo would ride with her to the waterfront.  They left the marble palaces and fragrant gardens behind and made their way through a poorer part of the city where modest brick houses turned blind walls to the street. There were fewer horses and camels to be seen, and a dearth of palanquins, but the streets teemed with children, beggars, and skinny dogs the color of sand. Pale men in dusty linen skirts stood beneath arched doorways to watch them pass. They know who I am, and they do not love me. Dany could tell from the way they looked at her.  Ser Jorah would sooner have tucked her inside her palanquin, safely hidden behind silken curtains, but she refused him. She had reclined too long on satin cushions, letting oxen bear her hither and yon. At least when she rode she felt as though she was getting somewhere.  It was not by choice that she sought the waterfront. She was fleeing again. Her whole life had been one long flight, it seemed. She had begun running in her mother’s womb, and never once stopped. How often had she and Viserys stolen away in the black of night, a bare step ahead of the Usurper’s hired knives? But it was run or die. Xaro had learned that Pyat Pree was gathering the surviving warlocks together to work ill on her.  Dany had laughed when he told her.  Was it not you who told me warlocks were no more than old soldiers, vainly boasting of forgotten deeds and lost prowess?   Xaro looked troubled.  And so it was, then. But now? I am less certain. It is said that the glass candles are burning in the house of Urrathon Night-Walker, that have not burned in a hundred years. Ghost grass grows in the Garden of Gehane, phantom tortoises have been seen carrying messages between the windowless houses on Warlock’s Way, and all the rats in the city are chewing off their tails. The wife of Mathos Mallarawan, who once mocked a warlock’s drab moth-eaten robe, has gone mad and will wear no clothes at all. Even fresh-washed silks make her feel as though a thousand insects were crawling on her skin. And Blind Sybassion the Eater of Eyes can see again, or so his slaves do swear. A man must wonder.  He sighed.  These are strange times in Qarth. And strange times are bad for trade. It grieves me to say so, yet it might be best if you left Qarth entirely, and sooner rather than later.  Xaro stroked her fingers reassuringly.  You need not go alone, though. You have seen dark visions in the Palace of Dust, but Xaro has dreamed brighter dreams. I see you happily abed, with our child at your breast. Sail with me around the Jade Sea, and we can yet make it so! It is not too late. Give me a son, my sweet song of joy!   Give you a dragon, you mean."
}