{
  "id": "7680100ff97f7f3a90c6c27848b12ad126441aeb",
  "text": " Over the centuries, they had been painted and repainted, gilded, silvered, jeweled.  Their beauty will make them more pleasing to R’hllor,  Melisandre said when she told Stannis to pull them down and drag them out the castle gates.  The Maiden lay athwart the Warrior, her arms widespread as if to embrace him. The Mother seemed almost to shudder as the flames came licking up her face. A longsword had been thrust through her heart, and its leather grip was alive with flame. The Father was on the bottom, the first to fall. Davos watched the hand of the Stranger writhe and curl as the fingers blackened and fell away one by one, reduced to so much glowing charcoal. Nearby, Lord Celtigar coughed fitfully and covered his wrinkled face with a square of linen embroidered in red crabs. The Myrmen swapped jokes as they enjoyed the warmth of the fire, but young Lord Bar Emmon had turned a splotchy grey, and Lord Velaryon was watching the king rather than the conflagration.  Davos would have given much to know what he was thinking, but one such as Velaryon would never confide in him. The Lord of the Tides was of the blood of ancient Valyria, and his House had thrice provided brides for Targaryen princes; Davos Seaworth stank of fish and onions. It was the same with the other lordlings. He could trust none of them, nor would they ever include him in their private councils. They scorned his sons as well. My grandsons will joust with theirs, though, and one day their blood may wed with mine. In time my little black ship will fly as high as Velaryon’s seahorse or Celtigar’s red crabs.  That is, if Stannis won his throne. If he lost…  Everything I am, I owe to him. Stannis had raised him to knighthood. He had given him a place of honor at his table, a war galley to sail in place of a smuggler’s skiff. Dale and Allard captained galleys as well, Maric was oarmaster on the Fury, Matthos served his father on Black Betha, and the king had taken Devan as a royal squire. One day he would be knighted, and the two little lads as well. Marya was mistress of a small keep on Cape Wrath, with servants who called her m’lady, and Davos could hunt red deer in his own woods. All this he had of Stannis Baratheon, for the price of a few finger joints. It was just, what he did to me. I had flouted the king’s laws all my life. He has earned my loyalty. Davos touched the little pouch that hung from the leather thong about his neck. His fingers were his luck, and he needed luck now. As do we all. Lord Stannis most of all.  Pale flames licked at the grey sky. Dark smoke rose, twisting and curling. When the wind pushed it toward them, men blinked and wept and rubbed their eyes. Allard turned his head away, coughing and cursing. A taste of things to come, thought Davos. Many and more would burn before this war was done.  Melisandre was robed all in scarlet satin and blood velvet, her eyes as red as the great ruby that glistened at her throat as if it too were afire.  In ancient books of Asshai it is written that there will come a day after a long summer when the stars bleed and the cold breath of darkness falls heavy on the world. In this dread hour a warrior shall draw from the fire a burning sword. And that sword shall be Lightbringer, the Red Sword of Heroes, and he who clasps it shall be Azor Ahai come again, and the darkness shall flee before him.  She lifted her voice, so it carried out over the gathered host.  Azor Ahai, beloved of R’hllor! The Warrior of Light, the Son of Fire! Come forth, your sword awaits you! Come forth and take it into your hand!   Stannis Baratheon strode forward like a soldier marching into battle. His squires stepped up to attend him. Davos watched as his son Devan pulled a long padded glove over the king’s right hand. The boy wore a cream-colored doublet with a fiery heart sewn on the breast. Bryen Farring was similarly garbed as he tied a stiff leather cape around His Grace’s neck. Behind, Davos heard a faint clank and clatter of bells.  Under the sea, smoke rises in bubbles, and flames burn green and blue and black,  Patchface sang somewhere.  I know, I know, oh, oh, oh.   The king plunged into the fire with his teeth clenched, holding the leather cloak before him to keep off the flames. He went straight to the Mother, grasped the sword with his gloved hand, and wrenched it free of the burning wood with a single hard jerk. Then he was retreating, the sword held high, jade-green flames swirling around cherry-red steel. Guards rushed to beat out the cinders that clung to the king’s clothing.   A sword of fire!  shouted Queen Selyse. Ser Axell Florent and the other queen’s men took up the cry.  A sword of fire! It burns! It burns! A sword of fire!   Melisandre lifted her hands above her head.  Behold! A sign was promised, and now a sign is seen! Behold Lightbringer! Azor Ahai has come again! All hail the Warrior of Light! All hail the Son of Fire!   A ragged wave of shouts gave answer, just as Stannis’s glove began to smolder."
}