{
  "id": "7702b4f253cad23e3e56985110093616691a19ba",
  "text": " He turned the letter over, and saw that the wax that had sealed it had been black.  This is from the Night’s Watch. Maester, has King Stannis seen this letter?    I brought it to Lord Alester when it first arrived. He was the Hand then. I believed he discussed it with the queen. When I asked him if he wished to send a reply, he told me not to be a fool. ‘His Grace lacks the men to fight his own battles, he has none to waste on wildlings,’ he said to me.   That was true enough. And this talk of five kings would certainly have angered Stannis.  Only a starving man begs bread from a beggar,  he muttered.   Pardon, my lord?    Something my wife said once.  Davos drummed his shortened fingers against the tabletop. The first time he had seen the Wall he had been younger than Devan, serving aboard the Cobblecat under Roro Uhoris, a Tyroshi known up and down the narrow sea as the Blind Bastard, though he was neither blind nor baseborn. Roro had sailed past Skagos into the Shivering Sea, visiting a hundred little coves that had never seen a trading ship before. He brought steel; swords, axes, helms, good chainmail hauberks, to trade for furs, ivory, amber, and obsidian. When the Cobblecat turned back south her holds were stuffed, but in the Bay of Seals three black galleys came out to herd her into Eastwatch. They lost their cargo and the Bastard lost his head, for the crime of trading weapons to the wildlings.  Davos had traded at Eastwatch in his smuggling days. The black brothers made hard enemies but good customers, for a ship with the right cargo. But while he might have taken their coin, he had never forgotten how the Blind Bastard’s head had rolled across the Cobblecat’s deck.  I met some wildlings when I was a boy,  he told Maester Pylos.  They were fair thieves but bad hagglers. One made off with our cabin girl. All in all, they seemed men like any other men, some fair, some foul.    Men are men,  Maester Pylos agreed.  Shall we return to our reading, my lord Hand?   I am the Hand of the King, yes. Stannis might be the King of Westeros in name, but in truth he was the King of the Painted Table. He held Dragonstone and Storm’s End, and had an ever-more-uneasy alliance with Salladhor Saan, but that was all. How could the Watch have looked to him for help? They may not know how weak he is, how lost his cause.  King Stannis never saw this letter, you are quite certain? Nor Melisandre?    No. Should I bring it to them? Even now?    No,  Davos said at once.  You did your duty when you brought it to Lord Alester.  If Melisandre knew of this letter… What was it she had said? One whose name may not be spoken is marshaling his power, Davos Seaworth. Soon comes the cold, and the night that never ends… And Stannis had seen a vision in the flames, a ring of torches in the snow with terror all around.   My lord, are you unwell?  asked Pylos.  I am frightened, Maester, he might have said. Davos was remembering a tale Salladhor Saan had told him, of how Azor Ahai tempered Lightbringer by thrusting it through the heart of the wife he loved. He slew his wife to fight the dark. If Stannis is Azor Ahai come again, does that mean Edric Storm must play the part of Nissa Nissa?  I was thinking, Maester. My pardons.  What harm if some wildling king conquers the north? It was not as though Stannis held the north. His Grace could scarcely be expected to defend people who refused to acknowledge him as king.  Give me another letter,  he said abruptly.  This one is too…    …difficult?  suggested Pylos.  Soon comes the cold, whispered Melisandre, and the night that never ends.  Troubling,  said Davos.  Too… troubling. A different letter, please.       Jon   They woke to the smoke of Mole’s Town burning.  Atop the King’s Tower, Jon Snow leaned on the padded crutch that Maester Aemon had given him and watched the grey plume rise. Styr had lost all hope of taking Castle Black unawares when Jon escaped him, yet even so, he need not have warned of his approach so bluntly. You may kill us, he reflected, but no one will be butchered in their beds. That much I did, at least.  His leg still hurt like blazes when he put his weight on it. He’d needed Clydas to help him don his fresh-washed blacks and lace up his boots that morning, and by the time they were done he’d wanted to drown himself in the milk of the poppy. Instead he had settled for half a cup of dreamwine, a chew of willow bark, and the crutch. The beacon was burning on Weatherback Ridge, and the Night’s Watch had need of every man.   I can fight,  he insisted when they tried to stop him.   Your leg’s healed, is it?  Noye snorted.  You won’t mind me giving it a little kick, then?    I’d sooner you didn’t. It’s stiff, but I can hobble around well enough, and stand and fight if you have need of me.    I have need of every man who knows which end of the spear to stab into the wildlings.    The pointy end.  Jon had told his little sister something like that once, he remembered.  Noye rubbed the bristle on his chin."
}