{
  "id": "77178577ad10f9b7bc49747303b4de5172a9c770",
  "text": "  That couldn’t be. My father would never betray the king!    Be that as it may,  said Mormont.  It is not for me to say. Nor for you.    But it’s a lie,  Jon insisted. How could they think his father was a traitor, had they all gone mad? Lord Eddard Stark would never dishonor himself… would he?  He fathered a bastard, a small voice whispered inside him. Where was the honor in that? And your mother, what of her? He will not even speak her name.   My lord, what will happen to him? Will they kill him?    As to that, I cannot say, lad. I mean to send a letter. I knew some of the king’s councillors in my youth. Old Pycelle, Lord Stannis, Ser Barristan… Whatever your father has done, or hasn’t done, he is a great lord. He must be allowed to take the black and join us here. Gods knows, we need men of Lord Eddard’s ability.   Jon knew that other men accused of treason had been allowed to redeem their honor on the Wall in days past. Why not Lord Eddard? His father here. That was a strange thought, and strangely uncomfortable. It would be a monstrous injustice to strip him of Winterfell and force him to take the black, and yet if it meant his life…  And would Joffrey allow it? He remembered the prince at Winterfell, the way he’d mocked Robb and Ser Rodrik in the yard. Jon himself he had scarcely even noticed; bastards were beneath even his contempt.  My lord, will the king listen to you?   The Old Bear shrugged.  A boy king… I imagine he’ll listen to his mother. A pity the dwarf isn’t with them. He’s the lad’s uncle, and he saw our need when he visited us. It was a bad thing, your lady mother taking him captive—    Lady Stark is not my mother,  Jon reminded him sharply. Tyrion Lannister had been a friend to him. If Lord Eddard was killed, she would be as much to blame as the queen.  My lord, what of my sisters? Arya and Sansa, they were with my father, do you know—    Pycelle makes no mention of them, but doubtless they’ll be treated gently. I will ask about them when I write.  Mormont shook his head.  This could not have happened at a worse time. If ever the realm needed a strong king… there are dark days and cold nights ahead, I feel it in my bones…  He gave Jon a long shrewd look.  I hope you are not thinking of doing anything stupid, boy.   He’s my father, Jon wanted to say, but he knew that Mormont would not want to hear it. His throat was dry. He made himself take another sip of wine.   Your duty is here now,  the Lord Commander reminded him.  Your old life ended when you took the black.  His bird made a raucous echo.  Black.  Mormont took no notice.  Whatever they do in King’s Landing is none of our concern.  When Jon did not answer, the old man finished his wine and said,  You’re free to go. I’ll have no further need of you today. On the morrow you can help me write that letter.   Jon did not remember standing or leaving the solar. The next he knew, he was descending the tower steps, thinking, This is my father, my sisters, how can it be none of my concern?  Outside, one of the guards looked at him and said,  Be strong, boy. The gods are cruel.   They know, Jon realized.  My father is no traitor,  he said hoarsely. Even the words stuck in his throat, as if to choke him. The wind was rising, and it seemed colder in the yard than it had when he’d gone in. Spirit summer was drawing to an end.  The rest of the afternoon passed as if in a dream. Jon could not have said where he walked, what he did, who he spoke with. Ghost was with him, he knew that much. The silent presence of the direwolf gave him comfort. The girls do not even have that much, he thought. Their wolves might have kept them safe, but Lady is dead and Nymeria’s lost, they’re all alone.  A north wind had begun to blow by the time the sun went down. Jon could hear it skirling against the Wall and over the icy battlements as he went to the common hall for the evening meal. Hobb had cooked up a venison stew, thick with barley, onions, and carrots. When he spooned an extra portion onto Jon’s plate and gave him the crusty heel of the bread, he knew what it meant. He knows. He looked around the hall, saw heads turn quickly, eyes politely averted. They all know.  His friends rallied to him.  We asked the septon to light a candle for your father,  Matthar told him.  It’s a lie, we all know it’s a lie, even Grenn knows it’s a lie,  Pyp chimed in. Grenn nodded, and Sam clasped Jon’s hand,  You’re my brother now, so he’s my father too,  the fat boy said.  If you want to go out to the weirwoods and pray to the old gods, I’ll go with you.   The weirwoods were beyond the Wall, yet he knew Sam meant what he said. They are my brothers, he thought. As much as Robb and Bran and Rickon…  And then he heard the laughter, sharp and cruel as a whip, and the voice of Ser Alliser Thorne.  Not only a bastard, but a traitor’s bastard,  he was telling the men around him.  In the blink of an eye, Jon had vaulted onto the table, dagger in his hand. Pyp made a grab for him, but he wrenched his leg away, and then he was sprinting down the table and kicking the bowl from Ser Alliser’s hand."
}