{
  "id": "771dd82244f71a98806c7eb6db87c1135ea655b8",
  "text": " Little did Harry know that Ron and Hermione had been secretly practicing the Leg-Locker Curse. They'd gotten the idea from Malfoy using it on Neville, and were ready to use it on Snape if he showed any sign of wanting to hurt Harry.  \"Now, don't forget, it's Locomotor Mortis,\" Hermione muttered as Ron slipped his wand up his sleeve.  \"I know,\" Ron snapped. \"Don't nag.\"  Back in the locker room, Wood had taken Harry aside.  \"Don't want to pressure you, Potter, but if we ever need an early capture of the Snitch it's now. Finish the game before Snape can favor Hufflepuff too much.\"  \"The whole school's out there!\" said Fred Weasley, peering out of the door. \"Even -- blimey -- Dumbledore's come to watch!\"  Harry's heart did a somersault.  \"Dumbledore?\" he said, dashing to the door to make sure. Fred was right. There was no mistaking that silver beard.  Harry could have laughed out loud with relief He was safe. There was simply no way that Snape would dare to try to hurt him if Dumbledore was watching.  Perhaps that was why Snape was looking so angry as the teams marched onto the field, something that Ron noticed, too.  \"I've never seen Snape look so mean,\" he told Hermione. \"Look -they're off Ouch!\"  Someone had poked Ron in the back of the head. It was Malfoy.  \"Oh, sorry, Weasley, didn't see you there.\"  Malfoy grinned broadly at Crabbe and Goyle.  \"Wonder how long Potter's going to stay on his broom this time? Anyone want a bet? What about you, Weasley?\"  Ron didn't answer; Snape had just awarded Hufflepuff a penalty because George Weasley had hit a Bludger at him. Hermione, who had all her fingers crossed in her lap, was squinting fixedly at Harry, who was circling the game like a hawk, looking for the Snitch.  \"You know how I think they choose people for the Gryffindor team?\" said Malfoy loudly a few minutes later, as Snape awarded Hufflepuff another penalty for no reason at all. \"It's people they feel sorry for. See, there's Potter, who's got no parents, then there's the Weasleys, who've got no money -- you should be on the team, Longbottom, you've got no brains.\"  Neville went bright red but turned in his seat to face Malfoy.  \"I'm worth twelve of you, Malfoy,\" he stammered.  Malfoy, Crabbe, and Goyle howled with laughter, but Ron, still not daring to take his eyes from the game, said, \"You tell him, Neville.\"  \"Longbottom, if brains were gold you'd be poorer than Weasley, and that's saying something.\"  Ron's nerves were already stretched to the breaking point with anxiety about Harry.  \"I'm warning you, Malfoy -- one more word  \"Ron!\" said Hermione suddenly, \"Harry --\"  \"What? Where?\"  Harry had suddenly gone into a spectacular dive, which drew gasps and cheers from the crowd. Hermione stood up, her crossed fingers in her mouth, as Harry streaked toward the ground like a bullet.  \"You're in luck, Weasley, Potter's obviously spotted some money on the ground!\" said Malfoy.  Ron snapped. Before Malfoy knew what was happening, Ron was on top of him, wrestling him to the ground. Neville hesitated, then clambered over the back of his seat to help.  \"Come on, Harry!\" Hermione screamed, leaping onto her seat to watch as Harry sped straight at Snape -- she didn't even notice Malfoy and Ron rolling around under her seat, or the scuffles and yelps coming from the whirl of fists that was Neville, Crabbe, and Goyle.  Up in the air, Snape turned on his broomstick just in time to see something scarlet shoot past him, missing him by inches -- the next second, Harry had pulled out of the dive, his arm raised in triumph, the Snitch clasped in his hand.  The stands erupted; it had to be a record, no one could ever remember the Snitch being caught so quickly.  \"Ron! Ron! Where are you? The game's over! Harry's won! We've won! Gryffindor is in the lead!\" shrieked Hermione, dancing up and down on her seat and hugging Parvati Patil in the row in front.  Harry jumped off his broom, a foot from the ground. He couldn't believe it. He'd done it -- the game was over; it had barely lasted five minutes. As Gryffindors came spilling onto the field, he saw Snape land nearby, white-faced and tight-lipped -- then Harry felt a hand on his shoulder and looked up into Dumbledore's smiling face.  \"Well done,\" said Dumbledore quietly, so that only Harry could hear. \"Nice to see you haven't been brooding about that mirror... been keeping busy... excellent...\"  Snape spat bitterly on the ground.  Harry left the locker room alone some time later, to take his Nimbus Two Thousand back to the broomshed. He couldn't ever remember feeling happier. He'd really done something to be proud of now -- no one could say he was just a famous name any more. The evening air had never smelled so sweet. He walked over the damp grass, reliving the last hour in his head, which was a happy blur: Gryffindors running to lift him onto their shoulders; Ron and Hermione in the distance, jumping up and down, Ron cheering through a heavy nosebleed.  Harry had reached the shed."
}