{
  "id": "77c558bde6cc4d7d1090c682283ee9323fd9b286",
  "text": "  Go, go, go, go, go.   Davos did not want to leave like this.  Salla—    GO. Or stay, better, but if you are going, go.   He went.  His walk up from the Bountiful Harvest to the gates of Dragonstone was long and lonely. The dockside streets where soldiers and sailors and smallfolk had thronged were empty and deserted. Where once he had stepped around squealing pigs and naked children, rats scurried. His legs felt like pudding beneath him, and thrice the coughing racked him so badly that he had to stop and rest. No one came to help him, nor even peered through a window to see what was the matter. The windows were shuttered, the doors barred, and more than half the houses displayed some mark of mourning. Thousands sailed up the Blackwater Rush, and hundreds came back, Davos reflected. My sons did not die alone. May the Mother have mercy on them all.  When he reached the castle gates, he found them shut as well. Davos pounded on the iron-studded wood with his fist. When there was no answer, he kicked at it, again and again. Finally a crossbowman appeared atop the barbican, peering down between two towering gargoyles.  Who goes there?   He craned his head back and cupped his hands around his mouth.  Ser Davos Seaworth, to see His Grace.    Are you drunk? Go away and stop that pounding.   Salladhor Saan had warned him. Davos tried a different tack.  Send for my son, then. Devan, the king’s squire.   The guard frowned.  Who did you say you were?    Davos,  he shouted.  The onion knight.   The head vanished, to return a moment later.  Be off with you. The onion knight died on the river. His ship burned.    His ship burned,  Davos agreed,  but he lived, and here he stands. Is Jate still captain of the gate?    Who?    Jate Blackberry. He knows me well enough.    I never heard of him. Most like he’s dead.    Lord Chyttering, then.    That one I know. He burned on the Blackwater.    Hookface Will? Hal the Hog?    Dead and dead,  the crossbowman said, but his face betrayed a sudden doubt.  You wait there.  He vanished again.  Davos waited. Gone, all gone, he thought dully, remembering how fat Hal’s white belly always showed beneath his grease-stained doublet, the long scar the fish hook had left across Will’s face, the way Jate always doffed his cap at the women, be they five or fifty, highborn or low. Drowned or burned, with my sons and a thousand others, gone to make a king in hell.  Suddenly the crossbowman was back.  Go round to the sally port and they’ll admit you.   Davos did as he was bid. The guards who ushered him inside were strangers to him. They carried spears, and on their breasts they wore the fox-and-flowers sigil of House Florent. They escorted him not to the Stone Drum, as he’d expected, but under the arch of the Dragon’s Tail and down to Aegon’s Garden.  Wait here,  their sergeant told him.   Does His Grace know that I’ve returned?  asked Davos.   Bugger all if I know. Wait, I said.  The man left, taking his spearmen with him.  Aegon’s Garden had a pleasant piney smell to it, and tall dark trees rose on every side. There were wild roses as well, and towering thorny hedges, and a boggy spot where cranberries grew.  Why have they brought me here? Davos wondered.  Then he heard a faint ringing of bells, and a child’s giggle, and suddenly the fool Patchface popped from the bushes, shambling along as fast as he could go with the Princess Shireen hot on his heels.  You come back now,  she was shouting after him.  Patches, you come back.   When the fool saw Davos, he jerked to a sudden halt, the bells on his antlered tin helmet going ting-a-ling, ting-a-ling. Hopping from one foot to the other, he sang,  Fool’s blood, king’s blood, blood on the maiden’s thigh, but chains for the guests and chains for the bridegroom, aye aye aye.  Shireen almost caught him then, but at the last instant he hopped over a patch of bracken and vanished among the trees. The princess was right behind him. The sight of them made Davos smile.  He had turned to cough into his gloved hand when another small shape crashed out of the hedge and bowled right into him, knocking him off his feet.  The boy went down as well, but he was up again almost at once.  What are you doing here?  he demanded as he brushed himself off. Jet-black hair fell to his collar, and his eyes were a startling blue.  You shouldn’t get in my way when I’m running.    No,  Davos agreed.  I shouldn’t.  Another fit of coughing seized him as he struggled to his knees.   Are you unwell?  The boy took him by the arm and pulled him to his feet.  Should I summon the maester?   Davos shook his head.  A cough. It will pass.   The boy took him at his word.  We were playing monsters and maidens,  he explained.  I was the monster. It’s a childish game but my cousin likes it. Do you have a name?    Ser Davos Seaworth.   The boy looked him up and down dubiously.  Are you certain? You don’t look very knightly.    I am the knight of the onions, my lord.   The blue eyes blinked.  The one with the black ship?    You know that tale?    You brought my uncle Stannis fish to eat before I was born, when Lord Tyrell had him under siege."
}