{
  "id": "7841c41ea23de86615e2323d6145a267917a3d27",
  "text": "   Viserys. The last son of Mad King Aerys. He’s been going about the Free Cities since before I was born, calling himself a king. Well, Mother says the Dothraki finally crowned him. With molten gold.  He laughed.  That’s funny, don’t you think? The dragon was their sigil. It’s almost as good as if some wolf killed your traitor brother. Maybe I’ll feed him to wolves after I’ve caught him. Did I tell you, I intend to challenge him to single combat?    I should like to see that, Your Grace.  More than you know. Sansa kept her tone cool and polite, yet even so Joffrey’s eyes narrowed as he tried to decide whether she was mocking him.  Will you enter the lists today?  she asked quickly.  The king frowned.  My lady mother said it was not fitting, since the tourney is in my honor. Otherwise I would have been champion. Isn’t that so, dog?   The Hound’s mouth twitched.  Against this lot? Why not?   He had been the champion in her father’s tourney, Sansa remembered.  Will you joust today, my lord?  she asked him.  Clegane’s voice was thick with contempt.  Wouldn’t be worth the bother of arming myself. This is a tournament of gnats.   The king laughed.  My dog has a fierce bark. Perhaps I should command him to fight the day’s champion. To the death.  Joffrey was fond of making men fight to the death.   You’d be one knight the poorer.  The Hound had never taken a knight’s vows. His brother was a knight, and he hated his brother.  A blare of trumpets sounded. The king settled back in his seat and took Sansa’s hand. Once that would have set her heart to pounding, but that was before he had answered her plea for mercy by presenting her with her father’s head. His touch filled her with revulsion now, but she knew better than to show it. She made herself sit very still.   Ser Meryn Trant of the Kingsguard,  a herald called.  Ser Meryn entered from the west side of the yard, clad in gleaming white plate chased with gold and mounted on a milk-white charger with a flowing grey mane. His cloak streamed behind him like a field of snow. He carried a twelve-foot lance.   Ser Hobber of House Redwyne, of the Arbor,  the herald sang. Ser Hobber trotted in from the east, riding a black stallion caparisoned in burgundy and blue. His lance was striped in the same colors, and his shield bore the grape cluster sigil of his House. The Redwyne twins were the queen’s unwilling guests, even as Sansa was. She wondered whose notion it had been for them to ride in Joffrey’s tourney. Not their own, she thought.  At a signal from the master of revels, the combatants couched their lances and put their spurs to their mounts. There were shouts from the watching guardsmen and the lords and ladies in the gallery. The knights came together in the center of the yard with a great shock of wood and steel. The white lance and the striped one exploded in splinters within a second of each other. Hobber Redwyne reeled at the impact, yet somehow managed to keep his seat. Wheeling their horses about at the far end of the lists, the knights tossed down their broken lances and accepted replacements from the squires. Ser Horas Redwyne, Ser Hobber’s twin, shouted encouragement to his brother.  But on their second pass Ser Meryn swung the point of his lance to strike Ser Hobber in the chest, driving him from the saddle to crash resoundingly to the earth. Ser Horas cursed and ran out to help his battered brother from the field.   Poorly ridden,  declared King Joffrey.   Ser Balon Swann, of Stonehelm in the Red Watch,  came the herald’s cry. Wide white wings ornamented Ser Balon’s greathelm, and black and white swans fought on his shield.  Morros of House Slynt, heir to Lord Janos of Harrenhal.    Look at that upjumped oaf,  Joff hooted, loud enough for half the yard to hear. Morros, a mere squire and a new-made squire at that, was having difficulty managing lance and shield. The lance was a knight’s weapon, Sansa knew, the Slynts lowborn. Lord Janos had been no more than commander of the City Watch before Joffrey had raised him to Harrenhal and the council.  I hope he falls and shames himself, she thought bitterly. I hope Ser Balon kills him. When Joffrey proclaimed her father’s death, it had been Janos Slynt who seized Lord Eddard’s severed head by the hair and raised it on high for king and crowd to behold, while Sansa wept and screamed.  Morros wore a checkered black-and-gold cloak over black armor inlaid with golden scrollwork. On his shield was the bloody spear his father had chosen as the sigil of their new-made house. But he did not seem to know what to do with the shield as he urged his horse forward, and Ser Balon’s point struck the blazon square. Morros dropped his lance, fought for balance, and lost. One foot caught in a stirrup as he fell, and the runaway charger dragged the youth to the end of the lists, head bouncing against the ground. Joff hooted derision. Sansa was appalled, wondering if the gods had heard her vengeful prayer. But when they disentangled Morros Slynt from his horse, they found him bloodied but alive."
}