{
  "id": "7880e3e5d14f481372cbe86c6c4cf11dfd6b8494",
  "text": " This Tyrell moved with his tail from keep to keep, chasing rebels and making certain that our knees stayed bent. He would arrive in force, take a castle for his own, stay a moon’s turn, and ride on to the next castle. It was his custom to turn the lords out of their own chambers and take their beds for himself. One night he found himself beneath a heavy velvet canopy. A sash hung down near the pillows, should he wish to summon a wench. He had a taste for Dornish women, this Lord Tyrell, and who can blame him? So he pulled upon the sash, and when he did the canopy above him split open, and a hundred red scorpions fell down upon his head. His death lit a fire that soon swept across Dorne, undoing all the Young Dragon’s victories in a fortnight. The kneeling men stood up, and we were free again.    I know the tale,  said Tyrion.  What of it?    Just this. If I should ever find a sash beside my own bed, and pull on it, I would sooner have the scorpions fall upon me than the queen in all her naked beauty.   Tyrion grinned.  We have that much in common, then.    To be sure, I have much to thank your sister for. If not for her accusation at the feast, it might well be you judging me instead of me judging you.  The prince’s eyes were dark with amusement.  Who knows more of poison than the Red Viper of Dorne, after all? Who has better reason to want to keep the Tyrells far from the crown? And with Joffrey in his grave, by Dornish law the Iron Throne should pass next to his sister Myrcella, who as it happens is betrothed to mine own nephew, thanks to you.    Dornish law does not apply.  Tyrion had been so ensnared in his own troubles that he’d never stopped to consider the succession.  My father will crown Tommen, count on that.    He may indeed crown Tommen, here in King’s Landing. Which is not to say that my brother may not crown Myrcella, down in Sunspear. Will your father make war on your niece on behalf of your nephew? Will your sister?  He gave a shrug.  Perhaps I should marry Queen Cersei after all, on the condition that she support her daughter over her son. Do you think she would?   Never, Tyrion wanted to say, but the word caught in his throat. Cersei always resented being excluded from power on account of her sex. If Dornish law applied in the west, she would be the heir to Casterly Rock in her own right. She and Jaime were twins, but Cersei had come first into the world, and that was all it took. By championing Myrcella’s cause she would be championing her own.  I do not know how my sister would choose, between Tommen and Myrcella,  he admitted.  It makes no matter. My father will never give her that choice.    Your father,  said Prince Oberyn,  may not live forever.   Something about the way he said it made the hairs on the back of Tyrion’s neck bristle. Suddenly he was mindful of Elia again, and all that Oberyn had said as they crossed the field of ashes. He wants the head that spoke the words, not just the hand that swung the sword.  It is not wise to speak such treasons in the Red Keep, my prince. The little birds are listening.    Let them. Is it treason to say a man is mortal? Valar morghulis was how they said it in Valyria of old. All men must die. And the Doom came and proved it true.  The Dornishman went to the window to gaze out into the night.  It is being said that you have no witnesses for us.    I was hoping one look at this sweet face of mine would be enough to persuade you all of my innocence.    You are mistaken, my lord. The Fat Flower of Highgarden is quite convinced of your guilt, and determined to see you die. His precious Margaery was drinking from that chalice too, as he has reminded us half a hundred times.    And you?  said Tyrion.   Men are seldom as they appear. You look so very guilty that I am convinced of your innocence. Still, you will likely be condemned. Justice is in short supply this side of the mountains. There has been none for Elia, Aegon, or Rhaenys. Why should there be any for you? Perhaps Joffrey’s real killer was eaten by a bear. That seems to happen quite often in King’s Landing. Oh, wait, the bear was at Harrenhal, now I remember.    Is that the game we are playing?  Tyrion rubbed at his scarred nose. He had nothing to lose by telling Oberyn the truth.  There was a bear at Harrenhal, and it did kill Ser Amory Lorch.    How sad for him,  said the Red Viper.  And for you. Do all noseless men lie so badly, I wonder?    I am not lying. Ser Amory dragged Princess Rhaenys out from under her father’s bed and stabbed her to death. He had some men-at-arms with him, but I do not know their names.  He leaned forward.  It was Ser Gregor Clegane who smashed Prince Aegon’s head against a wall and raped your sister Elia with his blood and brains still on his hands.    What is this, now? Truth, from a Lannister?  Oberyn smiled coldly.  Your father gave the commands, yes?    No.  He spoke the lie without hesitation, and never stopped to ask himself why he should.  The Dornishman raised one thin black eyebrow."
}