{
  "id": "789f151269c2c0a9d08d1d5a9cb8faf025bface1",
  "text": "  He  used  to  turn  queer  if  he  looked over the edge of quite a little cliff; and he had never liked ladders, let alone  trees  (never  having  had  to  escape  from wolves  before).  So  you  can  imagine  how  his head swam now, when he  looked down between his dangling  toes and saw  the  dark  lands opening wide underneath him,  touched here and there with the light of  the moon on a hill-side rock or a stream in the plains.  The  pale  peaks  of  the mountains were  coming  nearer, moonlit  spikes  of  rock  sticking  out  of  black  shadows.  Summer  or  not,  it  seemed  very  cold.  He  shut  his  eyes  and wondered if he could hold on any longer. Then he imagined what would  happen  if he did not. He  felt  sick. The  flight  ended only  just  in  time  for him,  just  before  his  arms  gave  way.  He  loosed  Dori's  ankles  with  a  gasp  and  fell  onto  the  rough  platform  of  an  eagle's  eyrie.  There  he  lay  without  speaking,  and  his  thoughts were  a mixture  of  surprise  at  being  saved  from  the  fire,  and  fear  lest  he  fell off that narrow place into the deep shadows on either side. He was feeling very  queer indeed in his head by this time after the dreadful adventures of the last three  days with next to nothing to eat, and he found himself saying aloud: \"Now I know  what a piece of bacon feels like when it is suddenly picked out of the pan on a fork  and put back on the shelf!\"  \"No  you  don't!\"  be  heard  Dori  answering,  \"because  the  bacon  knows  that  it  will get back in the pan sooner or later; and it is to be hoped we shan't. Also eagles  aren't forks!\"  \"O  no!  Not  a  bit  like  storks-forks,  I mean,\"  said Bilbo  sitting up  and  looking  anxiously  at  the  eagle  who  was  perched  close  by.  He  wondered  what  other  nonsense he had been  saying, and  if  the eagle would  think  it  rude. You ought not  to  be  rude  to  an  eagle, when  you  are  only  the  size  of  a  hobbit,  and  are  up  in  his  eyrie at night!  The  eagle  only  sharpened  his  beak  on  a  stone  and  trimmed  his  feathers  and  took no notice.  Soon  another  eagle  flew  up.  \"The  Lord  of  the  Eagles  bids  you  to  bring  your  prisoners to the Great Shelf,\" he cried and was off again. The other seized Dori in  his  claws  and  flew  away  with  him  into  the  night  leaving Bilbo  all  alone. He  had  just strength  to wonder what  the messenger had meant by  'prisoners,' and  to begin  to  think  of  being  torn  up  for  supper  like  a  rabbit,  when  his  own  turn  came.  The  eagle came back, seized him in his talons by the back of his coat, and swooped off.  This  time  he  flew  only  a  short  way.  Very  soon  Bilbo  was  laid  down,  trembling   ####-with  fear,  on  a wide  shelf  of  rock  on  the mountain-side. There was no path down  on to it save by flying; and no path down off it except by jumping over a precipice.  There  he  found  all  the  others  sitting  with  their  backs  to  the  mountain  wall.  The  Lord of the Eagles also was there and was speaking to Gandalf.  It  seemed  that  Bilbo  was  not  going  to  be  eaten  after  all.  The  wizard  and  the  eagle-lord  appeared  to  know  one  another  slightly,  and  even  to  be  on  friendly  terms. As a matter of fact Gandalf, who had often been in the mountains, had once  rendered  a  service  to  the  eagles  and  healed  their  lord  from  an  arrow-wound. So  you  see  'prisoners'  had  meant  'prisoners  rescued  from  the  goblins'  only,  and  not  captives  of  the  eagles. As Bilbo  listened  to  the  talk  of Gandalf  he  realized  that  at  last  they  were  going  to  escape  really  and  truly  from  the  dreadful  mountains.  He  was  discussing  plans  with  the  Great  Eagle  for  carrying  the  dwarves  and  himself  and Bilbo far away and setting  them down well on  their  journey across  the plains  below.   The Lord of  the Eagles would not  take  them anywhere near where men  lived.  \"They  would  shoot  at  us  with  their  great  bows  of yew,\" he  said,  \"for  they would  think  we  were  after  their  sheep.  And  at  other  times  they  would  be  right.  No!  we  are  glad  to  cheat  the  goblins  of  their  sport,  and  glad  to  repay  our  thanks  to  you,  but we will not risk ourselves for dwarves in the southward plains.\"  \"Very  well,\"  said  Gandalf.  \"Take  us  where  and  as  far  as  you  will!  We  are  already deeply obliged to you. But in the meantime we are famished with hunger.\"  \"I am nearly dead of it,\" said Bilbo in a weak little voice that nobody heard.  \"That can perhaps be mended,\" said the Lord of the Eagles.  Later on you might have seen a bright fire on  the shelf of rock and  the figures  of the dwarves round it cooking and making a fine roasting smell. The eagles had  brought  up  dry  boughs  for  fuel,  and  they  had  brought  rabbits, hares, and a  small  sheep.  The  dwarves  managed  all  the  preparations.  Bilbo  was  too  weak  to  help,  and  anyway  he was  not much  good  at  skinning  rabbits  or  cutting  up meat,  being  used  to  having  it  delivered  by  the  butcher  all  ready  to  cook."
}