{
  "id": "78a67e268b3999b5a0c0d9d2af4eeb733d58a5ea",
  "text": " He sheathed his sword.   ####-     'All is well,' said Aragorn, turning back. 'Here are some of my own kin  from  the far land where I dwelt. But why they come, and how many  they  be,  Halbarad shall tell us.'       'I  have thirty  with me,' said Halbarad. 'That is  all  of our kindred  that could be gathered in  haste; but the  brethren Elladan and Elrohir have  ridden with us, desiring to go to  the  war. We rode as swiftly as we  might  when your summons came.'       'But  I  did  not summon you,' said Aragorn,  'save  only  in wish.  My  thoughts have often turned to you, and seldom more than tonight; yet I  have  sent  no  word. But come! All such matters must wait. You find us riding  in  haste and danger. Ride with us now, if the king will give his leave. '       Thjoden was indeed glad of the news. 'It  is well!' he said.  'If these  kinsmen be in any way like to yourself, my lord Aragorn, thirty such knights  will be a strength that cannot be counted by heads.'       Then the Riders  set out again, and Aragor n  for a while rode with  the  D®nedain; and when they had spoken of tidings in the North and in the South,  Elrohir said to him:       'I bring word to you from my father: The days are short. If thou art in   haste, remember the Paths of the Dead. '       'Always my days  have seemed  to me  too short to  achieve  my desire,'  answered Aragorn. 'But great indeed will be my haste ere I take that road.'       'That  will soon  be seen,' said Elrohir. 'But let us speak  no more of  these things upon the open road!'       And  Aragorn said to Halbarad: 'What is  that that  you bear, kinsman?'  For  he  saw that instead  of a  spear he bore a  tall  staff, as it were  a   standard, but it was close-furled  in a black cloth  bound about  with  many  thongs.       'It is a gift that  I bring  you  from the Lady of Rivendell,' answered  Halbarad.  'She wrought it in secret,  and long was the making. But she also  sends word  to you: The days now are short.  Either our hope cometh, or  all   hopes end. Therefore I  send  thee what I have  made  for  thee. Fare  well,  Elfstone!'       And Aragorn said:  'Now I  know  what you bear. Bear it still for  me a   while!' And  he turned and  looked away to the North under  the great stars,   and then he fell silent and spoke no more while the night's journey lasted.       The night  was old  and the East grey  when  they rode  up at last from  Deeping-coomb and came back to the Hornburg. There they were to lie and rest    ####-for a brief while and take counsel.       Merry  slept  until  he was  roused by Legolas and  Gimli.  'The Sun is  high,'  said Legolas. 'All others are  up and doing.  Come, Master Sluggard,  and look at this place while you may!'       'There  was a  battle here  three  nights ago,' said Gimli,  'and  here  Legolas and  I  played a game that I won only  by a single orc. Come and see  how it was!  And there  are caves, Merry, caves of  wonder!  Shall we  visit  them, Legolas, do you think?'       'Nay!  There is no  time,' said the Elf. 'Do  not spoil the wonder with  haste! I have given you my wor d to return hither with you, if a day of peace  and  freedom comes  again. But it is now near to noon, and  at that hour  we  eat, and then set out again, I hear.'       Merry  got up  and yawned. His few hours'  sleep  had not  been  nearly  enough; he was  t ired and rather dismal. He missed Pippin,  and felt that he  was only a burden, while everybody was making plans for  speed in a business  that he did not fully understand. 'Where is Aragorn?' he asked.       'In a  high chamber of the Burg,' said  Legolas. 'He has neither rested  nor slept, I think. He went thither some hours ago, saying that he must take  thought, and only his kinsman, Halbarad, went with him;  but some dark doubt  or care sits on him.'       'They are a strange company, these  newcomers,'  said Gimli. 'Stout men  and lordly  they are,  and the  Riders  of Rohan look  almost as boys beside  them; for they are grim men  of face, worn like weathered rocks for the most   part, even as Aragorn himself; and they are silent.'       'But even as Aragorn they  are courteous, if they break  their silence.'  said  Legolas. 'And have  you marked  the brethren Elladan and Elrohir? Less  sombre is their  gear than  the  others', and  they are fair and  gallant as  Elven-lords;  and that  is not  to be wondered  at in the sons of  Elrond of  Rivendell.'       'Why have  they come? Have you heard?' asked Merry. He had now dressed,  and he flung  his grey cloak about his shoulders; and  the  three passed out  together towards the ruined gate of the Burg.       'They answered  a  summons,  as you  heard,'  said Gimli. 'Word  came to  Rivendell, they  say: Aragorn has need of his kindred. Let the D®nedain ride  to him in Rohan! But whence this message came they are now in doubt.  Gandalf  sent it, I would guess.'   ####-     'Nay, Galadriel,' said  Legolas. 'Did she not speak  through Gandalf of  the ride of the Grey Company from the North?'       'Yes,  you have it,' said Gimli."
}