{
  "id": "78c4add9df1df2f18069c1582cdcf741c650d8b1",
  "text": " All of a sudden, he knew what was happening. Have we come too late? His stomach did a lurch, and he slammed his spurs into his horse, galloping across the outer ward, beneath an arched stone bridge, around the Wailing Tower, and through the Flowstone Yard.  They had her in the bear pit.  King Harren the Black had wished to do even his bear-baiting in lavish style. The pit was ten yards across and five yards deep, walled in stone, floored with sand, and encircled by six tiers of marble benches. The Brave Companions filled only a quarter of the seats, Jaime saw as he swung down clumsily from his horse. The sellswords were so fixed on the spectacle beneath that only those across the pit noticed their arrival.  Brienne wore the same ill-fitting gown she’d worn to supper with Roose Bolton. No shield, no breastplate, no chainmail, not even boiled leather, only pink satin and Myrish lace. Maybe the goat thought she was more amusing when dressed as a woman. Half her gown was hanging off in tatters, and her left arm dripped blood where the bear had raked her.  At least they gave her a sword. The wench held it one-handed, moving sideways, trying to put some distance between her and the bear. That’s no good, the ring’s too small. She needed to attack, to make a quick end to it. Good steel was a match for any bear. But the wench seemed afraid to close. The Mummers showered her with insults and obscene suggestions.   This is none of our concern,  Steelshanks warned Jaime.  Lord Bolton said the wench was theirs, to do with as they liked.    Her name’s Brienne.  Jaime descended the steps, past a dozen startled sellswords. Vargo Hoat had taken the lord’s box in the lowest tier.  Lord Vargo,  he called over the shouts.  The Qohorik almost spilt his wine.  Kingthlayer?  The left side of his face was bandaged clumsily, the linen over his ear spotted with blood.   Pull her out of there.    Thay out of thith, Kingthlayer, unleth you’d like another thump.  He waved a wine cup.  Your thee-mooth bit oth my ear. Thmall wonder her father will not ranthom thuch a freak.   A roar turned Jaime back around. The bear was eight feet tall. Gregor Clegane with a pelt, he thought, though likely smarter. The beast did not have the reach the Mountain had with that monster greatsword of his, though.  Bellowing in fury, the bear showed a mouth full of great yellow teeth, then fell back to all fours and went straight at Brienne. There’s your chance, Jaime thought. Strike! Now!  Instead, she poked out ineffectually with the point of her blade. The bear recoiled, then came on, rumbling. Brienne slid to her left and poked again at the bear’s face. This time he lifted a paw to swat the sword aside.  He’s wary, Jaime realized. He’s gone up against other men. He knows swords and spears can hurt him. But that won’t keep him off her long.  Kill him!  he shouted, but his voice was lost amongst all the other shouts. If Brienne heard, she gave no sign. She moved around the pit, keeping the wall at her back. Too close. If the bear pins her by the wall…  The beast turned clumsily, too far and too fast. Quick as a cat, Brienne changed direction. There’s the wench I remember. She leapt in to land a cut across the bear’s back. Roaring, the beast went up on his hind legs again. Brienne scrambled back away. Where’s the blood? Then suddenly he understood. Jaime rounded on Hoat.  You gave her a tourney sword.   The goat brayed laughter, spraying him with wine and spittle.  Of courth.    I’ll pay her bloody ransom. Gold, sapphires, whatever you want. Pull her out of there.    You want her? Go get her.   So he did.  He put his good hand on the marble rail and vaulted over, rolling as he hit the sand. The bear turned at the thump, sniffing, watching this new intruder warily. Jaime scrambled to one knee. Well, what in seven hells do I do now? He filled his fist with sand.  Kingslayer?  he heard Brienne say, astonished.   Jaime.  He uncoiled, flinging the sand at the bear’s face. The bear mauled the air and roared like blazes.   What are you doing here?    Something stupid. Get behind me.  He circled toward her, putting himself between Brienne and the bear.   You get behind. I have the sword.    A swordwith no point and no edge. Get behind me!  He saw something half-buried in the sand, and snatched it up with his good hand. It proved to be a human jawbone, with some greenish flesh still clinging to it, crawling with maggots. Charming, he thought, wondering whose face he held. The bear was edging closer, so Jaime whipped his arm around and flung bone, meat, and maggots at the beast’s head. He missed by a good yard. I ought to lop my left hand off as well, for all the good it does me.  Brienne tried to dart around, but he kicked her legs out from under her. She fell in the sand, clutching the useless sword. Jaime straddled her, and the bear came charging.  There was a deep twang, and a feathered shaft sprouted suddenly beneath the beast’s left eye. Blood and slaver ran from his open mouth, and another bolt took him in the leg."
}