{
  "id": "79157f9d5070297918e06863518c2949cc7b171b",
  "text": "  Despite the hour, Harrenhal stirred with fitful life. Vargo Hoat’s arrival had thrown off all the routines. Ox carts, oxen, and horses had all vanished from the yard, but the bear cage was still there. It had been hung from the arched span of the bridge that divided the outer and middle wards, suspended on heavy chains, a few feet off the ground. A ring of torches bathed the area in light. Some of the boys from the stables were tossing stones to make the bear roar and grumble. Across the ward, light spilled through the door of the Barracks Hall, accompanied by the clatter of tankards and men calling for more wine. A dozen voices took up a song in a guttural tongue strange to Arya’s ears.  They’re drinking and eating before they sleep, she realized. Pinkeye would have sent to wake me, to help with the serving. He’ll know I’m not abed. But likely he was busy pouring for the Brave Companions and those of Ser Amory’s garrison who had joined them. The noise they were making would be a good distraction.   The hungry gods will feast on blood tonight, if a man would do this thing,  Jaqen said.  Sweet girl, kind and gentle. Unsay one name and say another and cast this mad dream aside.    I won’t.    Just so.  He seemed resigned.  The thing will be done, but a girl must obey. A man has no time for talk.    A girl will obey,  Arya said.  What should I do?    A hundred men are hungry, they must be fed, the lord commands hot broth. A girl must run to the kitchens and tell her pie boy.    Broth,  she repeated.  Where will you be?    A girl will help make broth, and wait in the kitchens until a man comes for her. Go. Run.   Hot Pie was pulling his loaves from the ovens when she burst into the kitchen, but he was no longer alone. They’d woken the cooks to feed Vargo Hoat and his Bloody Mummers. Serving men were carrying off baskets of Hot Pie’s bread and tarts, the chief cook was carving cold slices off a ham, spit boys were turning rabbits while the pot girls basted them with honey, women were chopping onions and carrots.  What do you want, Weasel?  the chief cook asked when he saw her.   Broth,  she announced.  My lord wants broth.   He jerked his carving knife at the black iron kettles hung over the flames.  What do you think that is? Though I’d soon as piss in it as serve it to that goat. Can’t even let a man have a night’s sleep.  He spat.  Well, never you mind, run back and tell him a kettle can’t be hurried,    I’m to wait here until it’s done.    Then stay out of the way. Or better yet, make yourself of use. Run to the buttery; his goatship will be wanting butter and cheese. Wake up Pia and tell her she’d best be nimble for once, if she wants to keep both of her feet.   She ran as fast as she could. Pia was awake in the loft, moaning under one of the Mummers, but she slipped back into her clothes quick enough when she heard Arya shout. She filled six baskets with crocks of butter and big wedges of stinky cheese wrapped in cloth.  Here, help me with these,  she told Arya.   I can’t. But you better hurry or Vargo Hoat will chop off your foot.  She darted off before Pia could grab her. On the way back, she wondered why none of the captives had their hands or feet chopped off. Maybe Vargo Hoat was afraid to make Robb angry. Though he didn’t seem the sort to be afraid of anyone.  Hot Pie was stirring the kettles with a long wooden spoon when Arya returned to the kitchens. She grabbed up a second spoon and started to help. For a moment she thought maybe she should tell him, but then she remembered the village and decided not to. He’d only yield again.  Then she heard the ugly sound of Rorge’s voice.  Cook,  he shouted.  We’ll take your bloody broth.  Arya let go of the spoon in dismay. I never told him to bring them. Rorge wore his iron helmet, with the nasal that half hid his missing nose. Jaqen and Biter followed him into the kitchen.   The bloody broth isn’t bloody ready yet,  the cook said.  It needs to simmer. We only now put in the onions and—    Shut your hole, or I’ll shove a spit up your ass and we’ll baste you for a turn or two. I said broth and I said now.   Hissing, Biter grabbed a handful of half-charred rabbit right off the spit, and tore into it with his pointed teeth while honey dripped between his fingers.  The cook was beaten.  Take your bloody broth, then, but if the goat asks why it tastes so thin, you tell him.   Biter licked the grease and honey off his fingers as Jaqen Hghar donned a pair of heavy padded mitts. He gave a second pair to Arya.  A weasel will help.  The broth was boiling hot, and the kettles were heavy. Arya and Jaqen wrestled one between them, Rorge carried one by himself, and Biter grabbed two more, hissing in pain when the handles burned his hands. Even so, he did not drop them. They lugged the kettles out of the kitchens and across the ward. Two guards had been posted at the door of the Widow’s Tower.  What’s this?  one said to Rorge.   A pot of boiling piss, want some?   Jaqen smiled disarmingly."
}