{
  "id": "799eadd86f7a80f26b7482d5fd98826b3b2e9334",
  "text": "  I knew you would. Joffrey will be so proud when I tell him what courage and good sense you’ve shown here today.   In the end, she wrote four letters. To her mother, the Lady Catelyn Stark, and to her brothers at Winterfell, and to her aunt and her grandfather as well, Lady Lysa Arryn of the Eyrie, and Lord Hoster Tully of Riverrun. By the time she had done, her fingers were cramped and stiff and stained with ink. Varys had her father’s seal. She warmed the pale white beeswax over a candle, poured it carefully, and watched as the eunuch stamped each letter with the direwolf of House Stark.  Jeyne Poole and all her things were gone when Ser Mandon Moore returned Sansa to the high tower of Maegor’s Holdfast. No more weeping, she thought gratefully. Yet somehow it seemed colder with Jeyne gone, even after she’d built a fire. She pulled a chair close to the hearth, took down one of her favorite books, and lost herself in the stories of Florian and Jonquil, of Lady Shella and the Rainbow Knight, of valiant Prince Aemon and his doomed love for his brother’s queen.  It was not until later that night, as she was drifting off to sleep, that Sansa realized she had forgotten to ask about her sister.      JON   Othor,  announced Ser Jaremy Rykker,  beyond a doubt. And this one was Jafer Flowers.  He turned the corpse over with his foot, and the dead white face stared up at the overcast sky with blue, blue eyes.  They were Ben Stark’s men, both of them.   My uncle’s men, Jon thought numbly. He remembered how he’d pleaded to ride with them. Gods, I was such a green boy. If he had taken me, it might be me lying here…  Jafer’s right wrist ended in the ruin of torn flesh and splintered bone left by Ghost’s jaws. His right hand was floating in a jar of vinegar back in Maester Aemon’s tower. His left hand, still at the end of his arm, was as black as his cloak.   Gods have mercy,  the Old Bear muttered. He swung down from his garron, handing his reins to Jon. The morning was unnaturally warm; beads of sweat dotted the Lord Commander’s broad forehead like dew on a melon. His horse was nervous, rolling her eyes, backing away from the dead men as far as her lead would allow. Jon led her off a few paces, fighting to keep her from bolting. The horses did not like the feel of this place. For that matter, neither did Jon.  The dogs liked it least of all. Ghost had led the party here; the pack of hounds had been useless. When Bass the kennelmaster had tried to get them to take the scent from the severed hand, they had gone wild, yowling and barking, fighting to get away. Even now they were snarling and whimpering by turns, pulling at their leashes while Chett cursed them for curs.  It is only a wood, Jon told himself, and they’re only dead men. He had seen dead men before…  Last night he had dreamt the Winterfell dream again. He was wandering the empty castle, searching for his father, descending into the crypts. Only this time the dream had gone further than before. In the dark he’d heard the scrape of stone on stone. When he turned he saw that the vaults were opening, one after the other. As the dead kings came stumbling from their cold black graves, Jon had woken in pitch-dark, his heart hammering. Even when Ghost leapt up on the bed to nuzzle at his face, he could not shake his deep sense of terror. He dared not go back to sleep. Instead he had climbed the Wall and walked, restless, until he saw the light of the dawn off to the cast. It was only a dream. I am a brother of the Night’s Watch now, not a frightened boy.  Samwell Tarly huddled beneath the trees, half-hidden behind the horses. His round fat face was the color of curdled milk. So far he had not lurched off to the woods to retch, but he had not so much as glanced at the dead men either.  I can’t look,  he whispered miserably.   You have to look,  Jon told him, keeping his voice low so the others would not hear.  Maester Aemon sent you to be his eyes, didn’t he? What good are eyes if they’re shut?    Yes, but… I’m such a coward, Jon.   Jon put a hand on Sam’s shoulder.  We have a dozen rangers with us, and the dogs, even Ghost. No one will hurt you, Sam. Go ahead and look. The first look is the hardest.   Sam gave a tremulous nod, working up his courage with a visible effort. Slowly he swiveled his head. His eyes widened, but Jon held his arm so he could not turn away.   Ser Jaremy,  the Old Bear asked gruffly,  Ben Stark had six men with him when he rode from the Wall. Where are the others?   Ser Jaremy shook his head.  Would that I knew.   Plainly Mormont was not pleased with that answer.  Two of our brothers butchered almost within sight of the Wall, yet your rangers heard nothing, saw nothing. Is this what the Night’s Watch has fallen to? Do we still sweep these woods?    Yes, my lord, but—    Do we still mount watches?    We do, but—    This man wears a hunting horn.  Mormont pointed at Othor.  Must I suppose that he died without sounding it? Or have your rangers all gone deaf as well as blind?   Ser Jaremy bristled, his face taut with anger."
}