{
  "id": "79f70053f0e8a6194a348a3bff08eaa129e66e9c",
  "text": " . . . \"Do nothing!\"  Voldemort shrieked to the Death Eaters, and Harry saw his red eyes wide with astonishment at what was happening, saw him fighting to break the thread of light still connecting his wand with Harry's; Harry held onto his wand more tightly, with both hands, and the golden thread remained unbroken.  \"Do nothing unless I command you!\"  Voldemort shouted to the Death Eaters. And then an unearthly and beautiful sound filled the air. ... It was coming from every thread of the light-spun web vibrating around Harry and Voldemort.  It was a sound Harry recognized, though he had heard it only once before in his life:  phoenix song. It was the sound of hope to Harry. . . the most beautiful and welcome thing he had ever heard in his life. . . . He felt as though the song were inside him instead of just around him. ... It was the sound he connected with Dumbledore, and it was almost as though a friend were speaking in his ear. . . . Don't break the connection. I know.  Harry told the music, I know I mustn't. . . but no sooner had he thought it, than the thing became much harder to do.  His wand began to vibrate more powerfully than ever . . . and now the beam between him and Voldemort changed too ... it was as though large beads of light were sliding up and down the thread connecting the wands - Harry felt his wand give a shudder under his hand as the light beads began to slide slowly and steadily his way. . . . The direction of the beams movement was now toward him, from Voldemort, and he felt his wand shudder angrily. . . . As the closest bead of light moved nearer to Harrys wand tip, the wood beneath his fingers grew so hot he feared it would burst into flame.  The closer that bead moved, the harder Harry's wand vibrated; he was sure his wand would not survive contact with it; it felt as though it was about to shatter under his fingers - He concentrated every last particle of his mind upon forcing the bead back toward Voldemort, his ears full of phoenix song, his eyes furious, fixed . . . and slowly, very slowly, the beads quivered to a halt, and then, just as slowly, they began to move the other way . . . and it was Voldemort's wand that was vibrating extra-hard now . . . Voldemort who looked astonished, and almost fearful. . . . One of the beads of light was quivering, inches from the tip of Voldemorts wand.  Harry didn't understand why he was doing it, didn't know what it might achieve . . . but he now concentrated as he had never done in his life on forcing that bead of light right back into Voldemort s wand . . . and slowly . . . very slowly ... it moved along the golden thread ... it trembled for a moment. . . and then it connected. . . . At once, Voldemorts wand began to emit echoing screams of pain . . . then - Voldemort's red eyes widened with shock - a dense, smoky hand flew out of the tip of it and vanished . . . the ghost of the hand he had made Wormtail. . . more shouts of pain . . . and then something much larger began to blossom from Voldemorts wand tip, a great, grayish something, that looked as though it were made of the solidest, densest smoke. ... It was a head . . . now a chest and arms . . . the torso of Cedric Diggory. If ever Harry might have released his wand from shock, it would have been then, but instinct kept him clutching his wand tightly, so that the thread of golden light remained unbroken, even though the thick gray ghost of Cedric Diggory (was it a ghost? it looked so solid) emerged in its entirety from the end of Voldemort s wand, as though it were squeezing itself out of a very narrow tunnel. . . and this shade of Cedric stood up, and looked up and down the golden thread of light, and spoke. \"Hold on. Harry,\" it said. Its voice was distant and echoing.  Harry looked at Voldemort ... his wide red eyes were still shocked ... he had no more expected this than Harry had . . . and, very dimly. Harry heard the frightened yells of the Death Eaters, prowling around the edges of the golden dome. . More screams of pain from the wand . . . and then something else emerged from its tip ... the dense shadow of a second head, quickly followed by arms and torso ... an old man Harry had seen only in a dream was now pushing himself out of the end of the wand just as Cedric had done . . . and his ghost, or his shadow, or whatever it was, fell next to Cedric's, and surveyed Harry and Voldemort, and the golden web, and the connected wands, with mild surprise, leaning on his walking stick. . . . \"He was a real wizard, then?\"  the old man said, his eyes on Voldemort.  \"Killed me, that one did. . . . You fight him, boy. . . .\" But already, yet another head was emerging ... and this head, gray as a smoky statue, was a woman's. . . . Harry, both arms shaking now as he fought to keep his wand still, saw her drop to the ground and straighten up like the others, staring. . . . The shadow of Bertha Jorkins surveyed the battle before her with wide eyes. \"Don't let go, now!\"  she cried, and her voice echoed like Cedrics as though from very far away."
}