{
  "id": "7a48c9852a8018b0f4f44cf58dc83ae4bb9509af",
  "text": "  \"Can't have,\" Hagrid said, his voice shaking. \"Can't nothing interfere with a broomstick except powerful Dark magic -- no kid could do that to a Nimbus Two Thousand.\"  At these words, Hermione seized Hagrid's binoculars, but instead of looking up at Harry, she started looking frantically at the crowd.  \"What are you doing?\" moaned Ron, gray-faced.  \"I knew it,\" Hermione gasped, \"Snape -- look.\"  Ron grabbed the binoculars. Snape was in the middle of the stands opposite them. He had his eyes fixed on Harry and was muttering nonstop under his breath.  \"He's doing something -- jinxing the broom,\" said Hermione.  \"What should we do?\"  \"Leave it to me.\"  Before Ron could say another word, Hermione had disappeared. Ron turned the binoculars back on Harry. His broom was vibrating so hard, it was almost impossible for him to hang on much longer. The whole crowd was on its feet, watching, terrified, as the Weasleys flew up to try and pull Harry safely onto one of their brooms, but it was no good -- every time they got near him, the broom would jump higher still. They dropped lower and circled beneath him, obviously hoping to catch him if he fell. Marcus  Flint seized the Quaffle and scored five times without anyone noticing.  \"Come on, Hermione,\" Ron muttered desperately.  Hermione had fought her way across to the stand where Snape stood, and was now racing along the row behind him; she didn't even stop to say sorry as she knocked Professor Quirrell headfirst into the row in front. Reaching Snape, she crouched down, pulled out her wand, and whispered a few, well- chosen words. Bright blue flames shot from her wand onto the hem of Snape's robes.  It took perhaps thirty seconds for Snape to realize that he was on fire. A sudden yelp told her she had done her job. Scooping the fire off him into a little jar in her pocket, she scrambled back along the row -- Snape would never know what had happened.  It was enough. Up in the air, Harry was suddenly able to clamber back on to his broom.  \"Neville, you can look!\" Ron said. Neville had been sobbing into Hagrid's jacket for the last five minutes.  Harry was speeding toward the ground when the crowd saw him clap his hand to his mouth as though he was about to be sick -- he hit the field on all fours -- coughed -- and something gold fell into his hand.  \"I've got the Snitch!\" he shouted, waving it above his head, and the game ended in complete confusion.  \"He didn't catch it, he nearly swallowed it,\" Flint was still howling twenty minutes later, but it made no difference -- Harry hadn't broken any rules and Lee Jordan was still happily shouting the results -- Gryffindor had won by one hundred and seventy points to sixty. Harry heard none of this, though. He was being made a cup of strong tea back in Hagrid's hut, with Ron and Hermione.  \"It was Snape,\" Ron was explaining, \"Hermione and I saw him. He was cursing your broomstick, muttering, he wouldn't take his eyes off you.\"  \"Rubbish,\" said Hagrid, who hadn't heard a word of what had gone on next to him in the stands. \"Why would Snape do somethin' like that?\"  Harry, Ron, and Hermione looked at one another, wondering what to tell him. Harry decided on the truth.  \"I found out something about him,\" he told Hagrid. \"He tried to get past that three-headed dog on Halloween. It bit him. We think he was trying to steal whatever it's guarding.\"  Hagrid dropped the teapot.  \"How do you know about Fluffy?\" he said.  \"Fluffy?\"  \"Yeah -- he's mine -- bought him off a Greek chappie I met in the pub las' year -- I lent him to Dumbledore to guard the  \"Yes?\" said Harry eagerly.  \"Now, don't ask me anymore,\" said Hagrid gruffly. \"That's top secret, that is.\"  \"But Snape's trying to steal it.\"  \"Rubbish,\" said Hagrid again. \"Snape's a Hogwarts teacher, he'd do nothin' of the sort.\"  \"So why did he just try and kill Harry?\" cried Hermione.  The afternoon's events certainly seemed to have changed her mind about Snape.  I know a jinx when I see one, Hagrid, I've read all about them!  You've got to keep eye contact, and Snape wasn't blinking at all, I saw him!\"  \"I'm tellin' yeh, yer wrong!\" said Hagrid hotly. \"I don' know why Harry's broom acted like that, but Snape wouldn' try an' kill a student! Now, listen to me, all three of yeh -- yer meddlin' in things that don' concern yeh. It's dangerous. You forget that dog, an' you forget what it's guardin', that's between Professor Dumbledore an' Nicolas Flamel --\"  \"Aha!\" said Harry, \"so there's someone called Nicolas Flamel involved, is there?\"  Hagrid looked furious with himself.   CHAPTER TWELVE  THE MIRROR OF ERISED  Christmas was coming. One morning in mid-December, Hogwarts woke to find itself covered in several feet of snow. The lake froze solid and the Weasley twins were punished for bewitching several snowballs so that they followed Quirrell around, bouncing off the back of his turban. The few owls that managed to battle their way through the stormy sky to deliver mail had to be nursed back to health by Hagrid before they could fly off again."
}