{
  "id": "7a950869777261f6174938c25a3e708a7faeaeee",
  "text": "       But Gandalf's  face was  grave and sad, and bidding Beregond and Pippin  to take  Faramir into the Houses  of Healing, he  went  up on  to  the walls  nearby; and there like a figure carven in white he stood  in the new sun and  looked out. And he beheld with the sight that was given to him all that  had  befallen; and when Jomer rode out from the forefront of his battle and stood  beside those who lay upon the field, he sighed, and he cast  his cloak about  him again,  and went  from  the  walls.  And Beregond  and  Pippin found him  standing in thought before the door of the Houses when they came out.       They looked at him, and for  a  while he was  silent. At last he spoke.  'My friends,' he  said, 'and all you people of this city and of the  Western  lands! Things of great sorrow and renown have come to pass. Shall we weep or    ####-be glad? Beyond hope the Captain  of  our foes has been  destroyed,  and you  have heard the echo of his last despair. But he has not gone without woe and  bitter loss. And that I might have averted but for the madness of  Denethor.  So long  has the reach of our Enemy become! Alas! but now I perceive how his  will was able to enter into the very heart of the City.       'Though  the  Stewards  deemed  that  it  was  a secret  kept  only   by  themselves, long ago I guessed that here in the White Tower, one at least of  the Seven Seeing  Stones was preserved. In  the days of his  wisdom Denethor   did not presume to  use it,  nor to  challenge Sauron, knowing the limits of  his own strength. But his wisdom failed; and I fear that as the peril of his  realm grew he looked in the Stone and was deceived: far too often, I  guess,   since Boromir departed.  He was too great to  be subdued  to the will of the  Dark Power, he saw nonetheless only those things which  that Power permitted  him to see. The knowledge which he obtained was, doubtless, often of service  to  him; yet the vision of the great might  of Mordor that was  shown to him  fed the despair of his heart until it overthrew his mind.'       'Now I understand what seemed so strange to me!' said Pippin shuddering  at his memories as he spoke. 'The Lord went away from the room where  Faramir  lay; and it was only when  he  returned that I first thought he was changed,  old and broken.'       'It was  in the very hour  that  Faramir was brought to the Tower  that  many of us saw  a strange light in the topmost chamber,' said Beregond. 'But  we have  seen that light before, and it has  long been rumoured in the City,  that the Lord would at times wrestle in thought with his Enemy.'       'Alas!  then I  have guessed rightly,' said Gandalf. 'Thus  the will of  Sauron entered into Minas  Tirith; and thus  I  have  been delayed here. And  here I shall still be forced to remain, for I shall soon have other charges,   not Faramir only.       'Now I must go down to meet those  who come. I have seen  a  sight upon  the field that is very grievous to my heart, and greater sorrow may yet come  to  pass.  Come  with me, Pippin! But you,  Beregond,  should  return to the  Citadel and tell the chief of the Guard there what has befallen. It  will be  his duty, I fear, to withdraw you from the Guard; but  say to him that, if I  may give him counsel, you should be sent to the Houses of Healing, to be the  guard and servant of your captain, and to be at his side when he awakes  - if  that shall ever be again. For by you  he  was saved from the fire. Go now! I   ####-shall return soon.'       With  that  he  turned away and went with Pippin down towards the lower  city. And even as they  hastened on their way the wind brought  a grey rain,   and all the fires sank, and there arose a great smoke before them.     ####-   Chapter 8. The Houses of Healing            A mist was in Merry's eyes of tears  and weariness when they  drew near   the  ruined  Gate of  Minas Tirith. He gave  little  heed to the  wreck  and  slaughter that lay about all. Fire and smoke and  stench was in the air; for   many engines  had been burned  or cast into  the fire-pits, and many  of the  slain also, while here  and there lay  many  carcases of the great  Southron  monsters, half-burned, or broken by stone-cast, or shot through  the eyes by  the  valiant archers of Morthond. The flying rain had ceased for a time, and  the sun  gleamed  up above;  but all the lower city  was still  wrapped in a   smouldering reek.       Already men were labouring to clear a way through the jetsam of battle;  and now out from the Gate came some bearing litters. Gently  they laid Jowyn  upon soft pillows; but the king's body  they covered  with a great  cloth of  gold,  and  they bore  torches about  him, and  their flames,  pale  in  the  sunlight, were fluttered by the wind.       So Thjoden and Jowyn came  to  the City of Gondor, and all who saw them  bared their heads and bowed; and they passed through the ash and fume of the  burned circle, and went on and up  along the  streets of stone."
}