{
  "id": "7aa35c40f8f660ede17a51e6d50342e14b84b09e",
  "text": " So don’t call them men, ser.    Khaleesi,  he said, taken aback by her fury,  the Unsullied are chosen as boys, and trained—    I have heard all I care to of their training.  Dany could feel tears welling in her eyes, sudden and unwanted. Her hand flashed up and cracked Ser Jorah hard across the face. It was either that, or cry.  Mormont touched the cheek she’d slapped.  If I have displeased my queen—    You have. You’ve displeased me greatly, ser. If you were my true knight, you would never have brought me to this vile sty.  If you were my true knight, you would never have kissed me, or looked at my breasts the way you did, or…   As Your Grace commands. I shall tell Captain Groleo to make ready to sail on the evening tide, for some sty less vile.    No,  said Dany. Groleo watched them from the forecastle, and his crew was watching too. Whitebeard, her bloodriders, Jhiqui, every one had stopped what they were doing at the sound of the slap.  I want to sail now, not on the tide, I want to sail far and fast and never look back. But I can’t, can I? There are eight thousand brick eunuchs for sale, and I must find some way to buy them.  And with that she left him, and went below.  Behind the carved wooden door of the captain’s cabin, her dragons were restless. Drogon raised his head and screamed, pale smoke venting from his nostrils, and Viserion flapped at her and tried to perch on her shoulder, as he had when he was smaller.  No,  Dany said, trying to shrug him off gently.  You’re too big for that now, sweetling.  But the dragon coiled his white and gold tail around one arm and dug black claws into the fabric of her sleeve, clinging tightly. Helpless, she sank into Groleo’s great leather chair, giggling.   They have been wild while you were gone, Khaleesi,  Irri told her.  Viserion clawed splinters from the door, do you see? And Drogon made to escape when the slaver men came to see them. When I grabbed his tail to hold him back, he turned and bit me.  She showed Dany the marks of his teeth on her hand.   Did any of them try to burn their way free?  That was the thing that frightened Dany the most.   No, Khaleesi. Drogon breathed his fire, but in the empty air. The slaver men feared to come near him.   She kissed Irri’s hand where Drogon had bitten it.  I’m sorry he hurt you. Dragons are not meant to be locked up in a small ship’s cabin.    Dragons are like horses in this,  Irri said.  And riders, too. The horses scream below, Khaleesi, and kick at the wooden walls. I hear them. And Jhiqui says the old women and the little ones scream too, when you are not here. They do not like this water cart. They do not like the black salt sea.    I know,  Dany said.  I do, I know.    My khaleesi is sad?    Yes,  Dany admitted. Sad and lost.   Should I pleasure the khaleesi?   Dany stepped away from her.  No. Irri, you do not need to do that. What happened that night, when you woke… you’re no bed slave, I freed you, remember? You…    I am handmaid to the Mother of Dragons,  the girl said.  It is great honor to please my khaleesi.    I don’t want that,  she insisted.  I don’t.  She turned away sharply.  Leave me now. I want to be alone. To think.   Dusk had begun to settle over the waters of Slaver’s Bay before Dany returned to the deck. She stood by the rail and looked out over Astapor. From here it looks almost beautiful, she thought. The stars were coming out above, and the silk lanterns below, just as Kraznys’s translator had promised. The brick pyramids were all glimmery with light. But it is dark below, in the streets and plazas and fighting pits. And it is darkest of all in the barracks, where some little boy is feeding scraps to the puppy they gave him when they took away his manhood.  There was a soft step behind her.  Khaleesi.  His voice.  Might I speak frankly?   Dany did not turn. She could not bear to look at him just now. If she did, she might well slap him again. Or cry. Or kiss him. And never know which was right and which was wrong and which was madness.  Say what you will, ser.    When Aegon the Dragon stepped ashore in Westeros, the kings of Vale and Rock and Reach did not rush to hand him their crowns. If you mean to sit his Iron Throne, you must win it as he did, with steel and dragonfire. And that will mean blood on your hands before the thing is done.   Blood and fire, thought Dany. The words of House Targaryen. She had known them all her life.  The blood of my enemies I will shed gladly. The blood of innocents is another matter. Eight thousand Unsullied they would offer me. Eight thousand dead babes. Eight thousand strangled dogs.    Your Grace,  said Jorah Mormont,  I saw King’s Landing after the Sack. Babes were butchered that day as well, and old men, and children at play. More women were raped than you can count. There is a savage beast in every man, and when you hand that man a sword or spear and send him forth to war, the beast stirs. The scent of blood is all it takes to wake him. Yet I have never heard of these Unsullied raping, nor putting a city to the sword, nor even plundering, save at the express command of those who lead them."
}