{
  "id": "7abac44b3ad0e89adfbda574e48f72a1d28f05ec",
  "text": "  Gandalf,  too,  was  lying  down  after  doing  his  part  in  setting  the  fire  going,  since Oin  and Gloin  had  lost their tinder-boxes. (Dwarves have never taken to matches even yet.)  So  ended  the  adventures  of  the  Misty  Mountains.  Soon  Bilbo's  stomach  was  feeling full and  comfortable  again,  and he  felt he  could  sleep  contentedly,  though  really  he  would  have  liked  a  loaf  and  butter  better  than  bits  of  meat  toasted  on  sticks. He slept curled up on the hard rock more soundly than ever he had done on  his feather-bed in his own  little hole at home. But all night he dreamed of his own   ####-house and wandered in his sleep into all his different rooms looking for something  that he could not find nor remember what it looked like.     ####-<h4>Chapter 7 </h4> <br>  Queer Lodgings     The next morning Bilbo woke up with the early sun in his eyes. He jumped up  to  look  at  the  time  and  to  go  and  put  his  kettle  on-and  found he was not home at  all.  So  he  sat  down  and  wished  in  vain  for  a  wash  and  a  brush.  He  did  not  get  either,  nor  tea  nor  toast  nor  bacon  for  his  breakfast, only cold mutton and  rabbit.  And after that he had to get ready for a fresh start.  This time he was allowed to climb on to an eagle's back and cling between his  wings.  The  air  rushed  over  him  and  he  shut  his  eyes.  The  dwarves  were  crying  farewells  and  promising  to  repay  the  lord  of  the  eagles  if  ever  they  could,  as  off  rose  fifteen  great  birds  from  the  mountain's  side.  The  sun  was  still  close  to  the  eastern  edge  of  things.  The morning was  cool,  and mists were  in  the  valleys  and  hollows  and  twined  here  and  there  about  the  peaks  and  pinnacles  of  the  hills.  Bilbo opened  an  eye  to peep  and  saw  that  the birds were  already high up  and  the  world  was  far  away,  and  the  mountains  were  falling  back  behind  them  into  the  distance. He shut his eyes again and held on tighter.   \"Don't pinch!\" said his eagle. \"You need not be frightened like a rabbit, even if  you  look  rather  like  one.  It  is  a  fair morning  with  little  wind. What  is  finer  than  flying?\"  Bilbo  would  have  liked  to  say:  \"A  warm  bath  and  late  breakfast  on  the  lawn  afterwards;\"  but  he  thought  it  better  to  say  nothing  at  all,  and  to  let  go  his  clutch  just a tiny bit.  After  a good while  the  eagles must have  seen  the point  they were making  for,  'even  from  their  great  height,  for  they  began  to  go  down  circling  round  in  great  spirals. They did this for a long while, and at last the hobbit opened his eyes again.  The earth was much nearer, and below  them were  trees  that  looked  like oaks and  elms, and wide grass lands, and a river running through it all. But cropping out of  the ground, right in the path of the stream which looped itself about it, was a great  rock, almost a hill of stone,  like a  last outpost of  the distant mountains, or a huge  piece cast miles into the plain by some giant among giants.  Quickly  now  to  the  top  of  this  rock  the  eagles  swooped  one  by  one  and  set  down their passengers.  \"Farewell!\"  they  cried,  \"wherever  you  fare,  till  your  eyries  receive  you  at  the  journey's end!\" That is the polite thing to say among eagles.   ####-\"May  the  wind  under  your  wings  bear  you  where  the  sun  sails  and  the moon  walks,\" answered Gandalf, who knew the correct reply.   And so they parted. And though the lord of the eagles became in after days the  King  of  All  Birds  and  wore  a  golden  crown,  and  his  fifteen  chieftains  golden  collars  (made  of  the  gold  that  the  dwarves  gave  them),  Bilbo  never  saw  them  again-except high and  far off  in  the battle of Five Armies. But as  that comes  in at  the end of this tale we will say no more about it just now.   There was a flat space on the top of the hill of stone and a well worn path with  many steps leading down it to the river, across which a ford of huge flat stones led  to  the  grass-land  beyond  the  stream.  There  was  a  little  cave  (a  wholesome  one  with a pebbly floor) at the foot of the steps and near the end of the stony ford. Here  the party gathered and discussed what was to be done.  \"I  always meant  to  see you  all  safe  (if possible) over  the mountains,\"  said  the  wizard,  \"and  now  by  good management  and  good  luck  I  have  done  it.  Indeed we  are  now  a  good  deal  further east than I ever meant to come with you, for after all  this  is not my adventure.  I may  look  in on  it again before  it  is all over, but  in  the  meanwhile I have some other pressing business to attend to.\"  The  dwarves  groaned  and  looked  most  distressed,  and  Bilbo wept.  They  had  begun to think Gandalf was going in come all the way and would always be there  to  help  them  out  of  difficulties.  \"I  am  not  going  to  disappear  this  very  instant,\"  said  he."
}