{
  "id": "7ac40b73fcef2d337ff2f2e582303503a7dff371",
  "text": " The Mountain standing ominous and alone had  looked taller than it was. Sam saw  now that it was less lofty than the high  passes of the Ephel D®ath which  he and Frodo had  scaled. The  confused and  tumbled shoulders of its great base rose for maybe three thousand feet above   the plain,  and above them was  reared half as  high again its  tall central  cone, like a vast oast  or chimney capped with a jagged  crater. But already  Sam was  more than half way up  the base, and the pla in of Gorgoroth was dim  below him, wrapped in fume and shadow. As he looked up he would have  given a   shout. if his parched throat had allowed him; for amid the rugged humps  and  shoulders above him he saw plainly a path or road.  It climbed like a rising  girdle from the west and wound snakelike about the Mountain, until before it  went  round out of  view it reached the foot  of the  cone upon its  eastern  side.       Sam could  not see  the course  immediately above  him,  where  it  was  lowest, for a steep slope went up from where he stood; but  he  guessed that  if he could only struggle on just a little way further up, they would strike  this path. A gleam of hope returned to  him. They might conquer the Mountain  yet. 'Why, it might have  been put there a -purpose!' he said to himself. 'If  it wasn't there, I'd have to say I was beaten in the end.'       The path was not put there for the purposes of Sam. He did not know it,  but he was looking at Sauron's Road  from Barad-dyr to the Sammath Naur, the   ####-Chambers of Fire. Out from the Dark Tower's huge western gate it came over a   deep abyss by a vast bridge of iron, and then passing  into the plain it ran  for a league between  two smoking  chasms,  and so  reached  a  long sloping  causeway that led up on to the Mountain's eastern side.  Thence, turning and   encircling all  its wide girth from south to north, it climbed at last, high  in the upper cone, but still far from the reeking summit, to a dark entrance  that  gazed back  east  straight  to  the  Window  of  the  Eye  in Sauron's  shadow-mantled fortress. Often blocked  or destroyed by  the tumults  of the  Mountain's furnaces, always  that road was repaired and cleaned again by the  labours of countless orcs.        Sam drew a deep breath. There was a path, but how he was to get  up the  slope to it he did not know. First he must ease his aching back. He lay flat  beside Frodo for a  while. Neither spoke. Slowly the light  grew. Suddenly a   sense of urgency which  he did not understand  came to Sam. It was almost as  if he had been called: 'Now, now, or it will be too late!' He braced himself  and  got up. Frodo also seemed to have felt  the  call. He struggled to  his  knees.       'I'll crawl, Sam,' he gasped.       So foot by foot, like small grey insects, they crept up the sl ope. They  came to the path and found  that it was broad, paved with broken rubble  and   beaten  ash.  Frodo clambered on  to  it,  and  then  moved  as  if by  some  compulsion he turned slowly to face  the East. Far off the shadows of Sauron  hung; but  torn by some gust of wind out of the world, or else moved by some  great  disquiet within,  the mantling  clouds swirled, and for a moment drew  aside; and  then he saw,  rising  black,  blacker and  darker than  the vast   shades  amid which it  stood,  the  cruel pinnacles  and  iron  crown of the  topmost tower of Barad-dyr. One moment  only it stared out, but as from some  great window immeasurably high there stabbed northward  a  flame of red, the  flicker of  a piercing Eye;  and then the shadows were furled  again and the  terrible vision was removed. The Eye was not  turned to them:  it was gazing  north to where the Captains of  the West  stood at bay, and thither  all its  malice was now bent, as the Power moved to strike its deadly blow; but Frodo  at that dreadful glimpse fell as  one stricken mortally. His hand sought the  chain about his neck.       Sam knelt  by him. Faint, almost  inaudibly, he heard Frodo whispering:  'Help me, Sam! Help me, Sam! Hold  my hand! I can't  stop it.' Sam took  his  master's hands a nd laid  them together, palm to  palm, and kissed them;  and    ####-then he held them gently  between his own. The thought came suddenly to him:  'He's spotted us! It's all  up, or it soon will be. Now, Sam Gamgee, this is  the end of ends.'       Again  he  lifted Frodo  and drew  his  hands down to  his  own breast.  letting his master's legs  dangle. Then he bowed his  head and struggled off  along the climbing road. It was  not as easy a way to take as it had  looked  at first.  By fortune the fires that had poured  forth in the great  turmoils  when Sam stood upon  Cirith Ungol had flowed down mainly on the southern  and  western slopes,  and the road  on  this  side  was not blocked.  Yet in many  places it had crumbled  away or was crossed  by gaping rents. After climbing  eastward for some time it bent back upon itself at a sharp  angle  and  went  westward fox  a space."
}