{
  "id": "7acfb31dd0e10d56212d85c0f919b573475dc343",
  "text": " Why must they misunderstand every bloody thing he did? Aerys. It all grows from Aerys. Jaime turned his back on the wench and strode across the yard.  Another knight in white armor was guarding the doors of the royal sept; a tall man with a black beard, broad shoulders, and a hooked nose. When he saw Jaime he gave a sour smile and said,  And where do you think you’re going?    Into the sept.  Jaime lifted his stump to point.  That one right there. I mean to see the queen.    Her Grace is in mourning. And why would she be wanting to see the likes of you?   Because I’m her lover, and the father of her murdered son, he wanted to say.  Who in seven hells are you?    A knight of the Kingsguard, and you’d best learn some respect, cripple, or I’ll have that other hand and leave you to suck up your porridge of a morning.    I am the queen’s brother, ser.   The white knight thought that funny.  Escaped, have you? And grown a bit as well, m’lord?    Her other brother, dolt. And the Lord Commander of the Kingsguard. Now stand aside, or you’ll wish you had.   The dolt took a long look this time.  Is it… Ser Jaime.  He straightened.  My pardons, milord. I did not know you. I have the honor to be Ser Osmund Kettleblack.   Where’s the honor in that?  I want some time alone with my sister. See that no one else enters the sept, ser. If we’re disturbed, I’ll have your bloody head.    Aye, ser. As you say.  Ser Osmund opened the door.  Cersei was kneeling before the altar of the Mother. Joffrey’s bier had been laid out beneath the Stranger, who led the newly dead to the other world. The smell of incense hung heavy in the air, and a hundred candles burned, sending up a hundred prayers. Joff’s like to need every one of them, too.  His sister looked over her shoulder.  Who?  she said, then,  Jaime?  She rose, her eyes brimming with tears.  Is it truly you?  She did not come to him, however. She has never come to me, he thought. She has always waited, letting me come to her. She gives, but I must ask.  You should have come sooner,  she murmured, when he took her in his arms.  Why couldn’t you have come sooner, to keep him safe? My boy…  Our boy.  I came as fast I could.  He broke from the embrace, and stepped back a pace.  It’s war out there, Sister.    You look so thin. And your hair, your golden hair…   The hair will grow back.  Jaime lifted his stump. She needs to see.  This won’t.   Her eyes went wide.  The Starks…    No. This was Vargo Hoat’s work.   The name meant nothing to her.  Who?    The Goat of Harrenhal. For a little while.   Cersei turned to gaze at Joffrey’s bier. They had dressed the dead king in gilded armor, eerily similar to Jaime’s own. The visor of the helm was closed, but the candles reflected softly off the gold, so the boy shimmered bright and brave in death. The candlelight woke fires in the rubies that decorated the bodice of Cersei’s mourning dress as well. Her hair fell to her shoulders, undressed and unkempt.  He killed him, Jaime. Just as he’d warned me. One day when I thought myself safe and happy he would turn my joy to ashes in my mouth, he said.    Tyrion said that?  Jaime had not wanted to believe it. Kinslaying was worse than kingslaying, in the eyes of gods and men. He knew the boy was mine. I loved Tyrion. I was good to him. Well, but for that one time… but the Imp did not know the truth of that. Or did he?  Why would he kill Joff?    For a whore.  She clutched his good hand and held it tight in hers.  He told me he was going to do it. Joff knew. As he was dying, he pointed at his murderer. At our twisted little monster of a brother.  She kissed Jaime’s fingers.  You’ll kill him for me, won’t you? You’ll avenge our son.   Jaime pulled away.  He is still my brother.  He shoved his stump at her face, in case she failed to see it.  And I am in no fit state to be killing anyone.    You have another hand, don’t you? I am not asking you to best the Hound in battle. Tyrion is a dwarf, locked in a cell. The guards would stand aside for you.   The thought turned his stomach.  I must know more of this. Of how it happened.    You shall,  Cersei promised.  There’s to be a trial. When you hear all he did, you’ll want him dead as much as I do.  She touched his face.  I was lost without you, Jaime. I was afraid the Starks would send me your head. I could not have borne that.  She kissed him. A light kiss, the merest brush of her lips on his, but he could feel her tremble as he slid his arms around her.  I am not whole without you.   There was no tenderness in the kiss he returned to her, only hunger. Her mouth opened for his tongue.  No,  she said weakly when his lips moved down her neck,  not here. The septons…    The Others can take the septons.  He kissed her again, kissed her silent, kissed her until she moaned. Then he knocked the candles aside and lifted her up onto the Mother’s altar, pushing up her skirts and the silken shift beneath. She pounded on his chest with feeble fists, murmuring about the risk, the danger, about their father, about the septons, about the wrath of gods."
}