{
  "id": "7ae40b19ef0dca0511e92993db32ab88dafd658c",
  "text": "  Stannis pointed his shining sword at his brother.  I am not without mercy,  thundered he who was notoriously without mercy.  Nor do I wish to sully Lightbringer with a brother’s blood. For the sake of the mother who bore us both, I will give you this night to rethink your folly, Renly. Strike your banners and come to me before dawn, and I will grant you Storm’s End and your old seat on the council and even name you my heir until a son is born to me. Otherwise, I shall destroy you.   Renly laughed.  Stannis, that’s a very pretty sword, I’ll grant you, but I think the glow off it has ruined your eyes. Look across the fields, brother. Can you see all those banners?    Do you think a few bolts of cloth will make you king?    Tyrell swords will make me king. Rowan and Tarly and Caron will make me king, with axe and mace and warhammer. Tarth arrows and Penrose lances, Fossoway, Cuy, Mullendore, Estermont, Selmy, Hightower, Oakheart, Crane, Caswell, Blackbar, Morrigen, Beesbury, Shermer, Dunn, Footly… even House Florent, your own wife’s brothers and uncles, they will make me king. All the chivalry of the south rides with me, and that is the least part of my power. My foot is coming behind, a hundred thousand swords and spears and pikes. And you will destroy me? With what, pray? That paltry rabble I see there huddled under the castle walls? I’ll call them five thousand and be generous, codfish lords and onion knights and sellswords. Half of them are like to come over to me before the battle starts. You have fewer than four hundred horse, my scouts tell me—freeriders in boiled leather who will not stand an instant against armored lances. I do not care how seasoned a warrior you think you are, Stannis, that host of yours won’t survive the first charge of my vanguard.    We shall see, brother.  Some of the light seemed to go out of the world when Stannis slid his sword back into its scabbard.  Come the dawn, we shall see.    I hope your new god’s a merciful one, brother.   Stannis snorted and galloped away, disdainful. The red priestess lingered a moment behind.  Look to your own sins, Lord Renly,  she said as she wheeled her horse around.  Catelyn and Lord Renly returned together to the camp where his thousands and her few waited their return.  That was amusing, if not terribly profitable,  he commented.  I wonder where I can get a sword like that? Well, doubtless Loras will make me a gift of it after the battle. it grieves me that it must come to this.    You have a cheerful way of grieving,  said Catelyn, whose distress was not feigned.   Do I?  Renly shrugged.  So be it. Stannis was never the most cherished of brothers, I confess. Do you suppose this tale of his is true? If Joffrey is the Kingslayer’s get—    —your brother is the lawful heir.    While he lives,  Renly admitted.  Though it’s a fool’s law, wouldn’t you agree? Why the oldest son, and not the best-fitted? The crown will suit me, as it never suited Robert and would not suit Stannis. I have it in me to be a great king, strong yet generous, clever, just, diligent, loyal to my friends and terrible to my enemies, yet capable of forgiveness, patient—    —humble?  Catelyn supplied.  Renly laughed.  You must allow a king some flaws, my lady.   Catelyn felt very tired. It had all been for nothing. The Baratheon brothers would drown each other in blood while her son faced the Lannisters alone, and nothing she could say or do would stop it. It is past time I went back to Riverrun to close my father’s eyes, she thought. That much at least I can do. I may be a poor envoy, but I am a good mourner, gods save me.  Their camp was well sited atop a low stony ridge that ran from north to south. It was far more orderly than the sprawling encampment on the Mander, though only a quarter as large. When he’d learned of his brother’s assault on Storm’s End, Renly had split his forces, much as Robb had done at the Twins. His great mass of foot he had left behind at Bitterbridge with his young queen, his wagons, carts, draft animals, and all his cumbersome siege machinery, while Renly himself led his knights and freeriders in a swift dash east.  How like his brother Robert he was, even in that… only Robert had always had Eddard Stark to temper his boldness with caution. Ned would surely have prevailed upon Robert to bring up his whole force, to encircle Stannis and besiege the besiegers. That choice Renly had denied himself in his headlong rush to come to grips with his brother. He had outdistanced his supply lines, left food and forage days behind with all his wagons and mules and oxen. He must come to battle soon, or starve.  Catelyn sent Hal Mollen to tend to their horses while she accompanied Renly back to the royal pavilion at the heart of the encampment. Inside the walls of green silk, his captains and lords bannermen were waiting to hear word of the parley.  My brother has not changed,  their young king told them as Brienne unfastened his cloak and lifted the gold-and-jade crown from his brow."
}