{
  "id": "7af399c75462c0a0c224c3db9e677be3124a6034",
  "text": " Tell her they are like Valyrian steel, folded over and over and hammered for years on end, until they are stronger and more resilient than any metal on earth.    I know of Valyrian steel,  said Dany.  Ask the Good Master if the Unsullied have their own officers.    You must set your own officers over them. We train them to obey, not to think. If it is wits she wants, let her buy scribes.    And their gear?    Sword, shield, spear, sandals, and quilted tunic are included,  said Kraznys.  And the spiked caps, to be sure. They will wear such armor as you wish, but you must provide it.   Dany could think of no other questions. She looked at Arstan.  You have lived long in the world, Whitebeard. Now that you have seen them, what do you say?    I say no, Your Grace,  the old man answered at once.   Why?  she asked.  Speak freely.  Dany thought she knew what he would say, but she wanted the slave girl to hear, so Kraznys mo Nakloz might hear later.   My queen,  said Arstan,  there have been no slaves in the Seven Kingdoms for thousands of years. The old gods and the new alike hold slavery to be an abomination. Evil. If you should land in Westeros at the head of a slave army, many good men will oppose you for no other reason than that. You will do great harm to your cause, and to the honor of your House.    Yet I must have some army,  Dany said.  The boy Joffrey will not give me the Iron Throne for asking politely.    When the day comes that you raise your banners, half of Westeros will be with you,  Whitebeard promised.  Your brother Rhaegar is still remembered, with great love.    And my father?  Dany said.  The old man hesitated before saying,  King Aerys is also remembered. He gave the realm many years of peace. Your Grace, you have no need of slaves. Magister Illyrio can keep you safe while your dragons grow, and send secret envoys across the narrow sea on your behalf, to sound out the high lords for your cause.    Those same high lords who abandoned my father to the Kingslayer and bent the knee to Robert the Usurper?    Even those who bent their knees may yearn in their hearts for the return of the dragons.    May,  said Dany. That was such a slippery word, may. In any language. She turned back to Kraznys mo Nakloz and his slave girl.  I must consider carefully.   The slaver shrugged.  Tell her to consider quickly. There are many other buyers. Only three days past I showed these same Unsullied to a corsair king who hopes to buy them all.    The corsair wanted only a hundred, your worship,  Dany heard the slave girl say.  He poked her with the end of the whip.  Corsairs are all liars. He’ll buy them all. Tell her that, girl.   Dany knew she would take more than a hundred, if she took any at all.  Remind your Good Master of who I am. Remind him that I am Daenerys Stormborn, Mother of Dragons, the Unburnt, trueborn queen of the Seven Kingdoms of Westeros. My blood is the blood of Aegon the Conqueror, and of old Valyria before him.   Yet her words did not move the plump perfumed slaver, even when rendered in his own ugly tongue.  Old Ghis ruled an empire when the Valyrians were still fucking sheep,  he growled at the poor little scribe,  and we are the sons of the harpy.  He gave a shrug.  My tongue is wasted wagging at women. East or west, it makes no matter, they cannot decide until they have been pampered and flattered and stuffed with sweetmeats. Well, if this is my fate, so be it. Tell the whore that if she requires a guide to our sweet city, Kraznys mo Nakloz will gladly serve her… and service her as well, if she is more woman than she looks.    Good Master Kraznys would be most pleased to show you Astapor while you ponder, Your Grace,  the translator said.   I will feed her jellied dog brains, and a fine rich stew of red octopus and unborn puppy.  He wiped his lips.   Many delicious dishes can be had here, he says.    Tell her how pretty the pyramids are at night,  the slaver growled.  Tell her I will lick honey off her breasts, or allow her to lick honey off mine if she prefers.    Astapor is most beautiful at dusk, Your Grace,  said the slave girl.  The Good Masters light silk lanterns on every terrace, so all the pyramids glow with colored lights. Pleasure barges ply the Worm, playing soft music and calling at the little islands for food and wine and other delights.    Ask her if she wishes to view our fighting pits,  Kraznys added.  Douquor’s Pit has a fine folly scheduled for the evening. A bear and three small boys. One boy will be rolled in honey, one in blood, and one in rotting fish, and she may wager on which the bear will eat first.   Tap tap tap, Dany heard. Arstan Whitebeard’s face was still, but his staff beat out his rage. Tap tap tap. She made herself smile.  I have my own bear on Balerion,  she told the translator,  and he may well eat me if I do not return to him.    See,  said Kraznys when her words were translated.  It is not the woman who decides, it is this man she runs to. As ever!    Thank the Good Master for his patient kindness,  Dany said,  and tell him that I will think on all I learned here."
}