{
  "id": "7b4df53e5f77000ac47e7f9c1315b0074acd3d9e",
  "text": "  Jojen shook his head.  No. Best stay, and eat. With your own mouth. A warg cannot live on what his beast consumes.   How would you know? Bran thought resentfully. You’ve never been a warg, you don’t know what it’s like.  Hodor jerked suddenly to his feet, almost hitting his head on the barrel-vaulted ceiling.  HODOR!  he shouted, rushing to the door. Meera pushed it open just before he reached it, and stepped through into their refuge.  Hodor, hodor,  the huge stableboy said, grinning.  Meera Reed was sixteen, a woman grown, but she stood no higher than her brother. All the crannogmen were small, she told Bran once when he asked why she wasn’t taller. Brown-haired, green-eyed, and flat as a boy, she walked with a supple grace that Bran could only watch and envy. Meera wore a long sharp dagger, but her favorite way to fight was with a slender three-pronged frog spear in one hand and a woven net in the other.   Who’s hungry?  she asked, holding up her catch: two small silvery trout and six fat green frogs.   I am,  said Bran. But not for frogs. Back at Winterfell before all the bad things had happened, the Walders used to say that eating frogs would turn your teeth green and make moss grow under your arms. He wondered if the Walders were dead. He hadn’t seen their corpses at Winterfell… but there had been a lot of corpses, and they hadn’t looked inside the buildings.   We’ll just have to feed you, then. Will you help me clean the catch, Bran?   He nodded. It was hard to sulk with Meera. She was much more cheerful than her brother, and always seemed to know how to make him smile. Nothing ever scared her or made her angry. Well, except Jojen, sometimes… Jojen Reed could scare most anyone. He dressed all in green, his eyes were murky as moss, and he had green dreams. What Jojen dreamed came true. Except he dreamed me dead, and I’m not. Only he was, in a way.  Jojen sent Hodor out for wood and built them a small fire while Bran and Meera were cleaning the fish and frogs. They used Meera’s helm for a cooking pot, chopping up the catch into little cubes and tossing in some water and some wild onions Hodor had found to make a froggy stew. It wasn’t as good as deer, but it wasn’t bad either, Bran decided as he ate.  Thank you, Meera,  he said.  My lady.    You are most welcome, Your Grace.    Come the morrow,  Jojen announced,  we had best move on.   Bran could see Meera tense.  Have you had a green dream?    No,  he admitted.   Why leave, then?  his sister demanded.  Tumbledown Tower’s a good place for us. No villages near, the woods are full of game, there’s fish and frogs in the streams and lakes… and who is ever going to find us here?    This is not the place we are meant to be.    It is safe, though.    It seems safe, I know,  said Jojen,  but for how long? There was a battle at Winterfell, we saw the dead. Battles mean wars. If some army should take us unawares…    It might be Robb’s army,  said Bran.  Robb will come back from the south soon, I know he will. He’ll come back with all his banners and chase the ironmen away.    Your maester said naught of Robb when he lay dying,  Jojen reminded him.  Ironmen on the Stony Shore, he said, and, east, the Bastard of Bolton. Moat Cailin and Deepwood Motte fallen, the heir to Cerwyn dead, and the castellan of Torrhen’s Square. War everywhere, he said, each man against his neighbor.    We have plowed this field before,  his sister said.  You want to make for the Wall, and your three-eyed crow. That’s well and good, but the Wall is a very long way and Bran has no legs but Hodor. If we were mounted…    If we were eagles we might fly,  said Jojen sharply,  but we have no wings, no more than we have horses.    There are horses to be had,  said Meera.  Even in the deep of the wolfswood there are foresters, crofters, hunters. Some will have horses.    And if they do, should we steal them? Are we thieves? The last thing we need is men hunting us.    We could buy them,  she said.  Trade for them.    Look at us, Meera. A crippled boy with a direwolf, a simpleminded giant, and two crannogmen a thousand leagues from the Neck. We will be known. And word will spread. So long as Bran remains dead, he is safe. Alive, he becomes prey for those who want him dead for good and true.  Jojen went to the fire to prod the embers with a stick.  Somewhere to the north, the three-eyed crow awaits us. Bran has need of a teacher wiser than me.    How, Jojen?  his sister asked.  How?    Afoot,  he answered.  A step at a time.    The road from Greywater to Winterfell went on forever, and we were mounted then. You want us to travel a longer road on foot, without even knowing where it ends. Beyond the Wall, you say. I haven’t been there, no more than you, but I know that Beyond the Wall’s a big place, Jojen. Are there many three-eyed crows, or only one? How do we find him?    Perhaps he will find us.   Before Meera could find a reply to that, they heard the sound; the distant howl of a wolf, drifting through the night."
}