{
  "id": "7bbf66956afd84d909ec840f914ee4b749aec31a",
  "text": " Ser Jorah she had left behind today, to guard her other dragons; the exile knight had been opposed to this folly from the start. He distrusts everyone, she reflected, and perhaps for good reason.  As Dany lifted her goblet to drink, Rhaegal sniffed at the wine and drew his head back, hissing.  Your dragon has a good nose.  Xaro wiped his lips.  The wine is ordinary. It is said that across the Jade Sea they make a golden vintage so fine that one sip makes all other wines taste like vinegar. Let us take my pleasure barge and go in search of it, you and I.    The Arbor makes the best wine in the world,  Dany declared. Lord Redwyne had fought for her father against the Usurper, she remembered, one of the few to remain true to the last. Will he fight for me as well? There was no way to be certain after so many years.  Come with me to the Arbor, Xaro, and you’ll have the finest vintages you ever tasted. But we’ll need to go in a warship, not a pleasure barge.    I have no warships. War is bad for trade. Many times I have told you, Xaro Xhoan Daxos is a man of peace.   Xaro Xhoan Daxos is a man of gold, she thought, and gold will buy me all the ships and swords I need.  I have not asked you to take up a sword, only to lend me your ships.   He smiled modestly.  Of trading ships I have a few, that is so. Who can say how many? One may be sinking even now, in some stormy corner of the Summer Sea. On the morrow, another will fall afoul of corsairs. The next day, one of my captains may look at the wealth in his hold and think, All this should belong to me. Such are the perils of trade. Why, the longer we talk, the fewer ships I am likely to have. I grow poorer by the instant.    Give me ships, and I will make you rich again.    Marry me, bright light, and sail the ship of my heart. I cannot sleep at night for thinking of your beauty.   Dany smiled. Xaro’s flowery protestations of passion amused her, but his manner was at odds with his words. While Ser Jorah had scarcely been able to keep his eyes from her bare breast when he’d helped her into the palanquin, Xaro hardly deigned to notice it, even in these close confines. And she had seen the beautiful boys who surrounded the merchant prince, flitting through his palace halls in wisps of silk.  You speak sweetly, Xaro, but under your words I hear another no.    This Iron Throne you speak of sounds monstrous cold and hard. I cannot bear the thought of jagged barbs cutting your sweet skin.  The jewels in Xaro’s nose gave him the aspect of some strange glittery bird. His long, elegant fingers waved dismissal.  Let this be your kingdom, most exquisite of queens, and let me be your king. I will give you a throne of gold, if you like. When Qarth begins to pall, we can journey round Yi Ti and search for the dreaming city of the poets, to sip the wine of wisdom from a dead man’s skull.    I mean to sail to Westeros, and drink the wine of vengeance from the skull of the Usurper.  She scratched Rhaegal under one eye, and his jade-green wings unfolded for a moment, stirring the still air in the palanquin.  A single perfect tear ran down the cheek of Xaro Xhoan Daxos.  Will nothing turn you from this madness?    Nothing,  she said, wishing she was as certain as she sounded.  If each of the Thirteen would lend me ten ships—    You would have one hundred thirty ships, and no crew to sail them. The justice of your cause means naught to the common men of Qarth. Why should my sailors care who sits upon the throne of some kingdom at the edge of the world?    I will pay them to care.    With what coin, sweet star of my heaven?    With the gold the seekers bring.    That you may do,  Xaro acknowledged,  but so much caring will cost dear. You will need to pay them far more than I do, and all of Qarth laughs at my ruinous generosity.    If the Thirteen will not aid me, perhaps I should ask the Guild of Spicers or the Tourmaline Brotherhood?   Xaro gave a languid shrug.  They will give you nothing but flattery and lies. The Spicers are dissemblers and braggarts and the Brotherhood is full of pirates.    Then I must heed Pyat Pree, and go to the warlocks.   The merchant prince sat up sharply.  Pyat Pree has blue lips, and it is truly said that blue lips speak only lies. Heed the wisdom of one who loves you. Warlocks are bitter creatures who eat dust and drink of shadows. They will give you naught. They have naught to give.    I would not need to seek sorcerous help if my friend Xaro Xhoan Daxos would give me what I ask.    I have given you my home and heart, do they mean nothing to you? I have given you perfume and pomegranates, tumbling monkeys and spitting snakes, scrolls from lost Valyria, an idol’s head and a serpent’s foot. I have given you this palanquin of ebony and gold, and a matched set of bullocks to bear it, one white as ivory and one black as jet, with horns inlaid with jewels.    Yes,  Dany said.  But it was ships and soldiers I wanted.    Did I not give you an army, sweetest of women? A thousand knights, each in shining armor."
}