{
  "id": "7bc9e417e39ac03a74a83409dcbdd6aacc2a5500",
  "text": " They said he had raped the princess with her son’s blood and brains still on his hands.   This secret is your lord father’s sworn man.    My father would be the first to tell you that fifty thousand Dornishmen are worth one rabid dog.   Varys stroked a powdered cheek.  And if Prince Doran demands the blood of the lord who gave the command as well as the knight who did the deed…    Robert Baratheon led the rebellion. All commands came from him, in the end.    Robert was not at King’s Landing.    Neither was Doran Martell.    So. Blood for his pride, a chair for his ambition. Gold and land, that goes without saying. A sweet offer… yet sweets can be poisoned. If I were the prince, something more would I require before I should reach for this honeycomb. Some token of good faith, some sure safeguard against betrayal.  Varys smiled his slimiest smile.  Which one will you give him, I wonder?   Tyrion sighed.  You know, don’t you?    Since you put it that way—yes. Tommen. You could scarcely offer Myrcella to Doran Martell and Lysa Arryn both.    Remind me never to play these guessing games with you again. You cheat.     Prince Tommen is a good boy.    If I pry him away from Cersei and Joffrey while he’s still young, he may even grow to be a good man.    And a good king?    Joffrey is king.    And Tommen is heir, should anything ill befall His Grace. Tommen, whose nature is so sweet, and notably… tractable.    You have a suspicious mind, Varys.    I shall take that as a tribute, my lord. In any case, Prince Doran will hardly be insensible of the great honor you do him. Very deftly done, I would say… but for one small flaw.   The dwarf laughed.  Named Cersei?    What avails statecraft against the love of a mother for the sweet fruit of her womb? Perhaps, for the glory of her House and the safety of the realm, the queen might be persuaded to send away Tommen or Myrcella. But both of them? Surely not.    What Cersei does not know will never hurt me.    And if Her Grace were to discover your intentions before your plans are ripe?    Why,  he said,  then I would know the man who told her to be my certain enemy.  And when Varys giggled, he thought, Three.      SANSA  Come to the godswood tonight, if you want to go home.  The words were the same on the hundredth reading as they’d been on the first, when Sansa had discovered the folded sheet of parchment beneath her pillow. She did not know how it had gotten there or who had sent it. The note was unsigned, unsealed, and the hand unfamiliar. She crushed the parchment to her chest and whispered the words to herself.  Come to the godswood tonight, if you want to go home,  she breathed, ever so faintly.  What could it mean? Should she take it to the queen to prove that she was being good? Nervously, she rubbed her stomach. The angry purple bruise Ser Meryn had given her had faded to an ugly yellow, but still hurt. His fist had been mailed when he hit her. It was her own fault. She must learn to hide her feelings better, so as not to anger Joffrey. When she heard that the Imp had sent Lord Slynt to the Wall, she had forgotten herself and said,  I hope the Others get him.  The king had not been pleased.  Come to the godswood tonight, if you want to go home.  Sansa had prayed so hard. Could this be her answer at last, a true knight sent to save her? Perhaps it was one of the Redwyne twins, or bold Ser Balon Swann… or even Beric Dondarrion, the young lord her friend Jeyne Poole had loved, with his red-gold hair and the spray of stars on his black cloak.  Come to the godswood tonight, if you want to go home.  What if it was some cruel jape of Joffrey’s, like the day he had taken her up to the battlements to show her Father’s head? Or perhaps it was some subtle snare to prove she was not loyal. If she went to the godswood, would she find Ser Ilyn Payne waiting for her, sitting silent under the heart tree with Ice in his hand, his pale eyes watching to see if she’d come?  Come to the godswood tonight, if you want to go home.  When the door opened, she hurriedly stuffed the note under her sheet and sat on it. It was her bedmaid, the mousy one with the limp brown hair.  What do you want?  Sansa demanded.   Will milady be wanting a bath tonight?    A fire, I think… I feel a chill.  She was shivering, though the day had been hot.   As you wish.   Sansa watched the girl suspiciously. Had she seen the note? Had she put it under the pillow? It did not seem likely; she seemed a stupid girl, not one you’d want delivering secret notes, but Sansa did not know her. The queen had her servants changed every fortnight, to make certain none of them befriended her.  When a fire was blazing in the hearth, Sansa thanked the maid curtly and ordered her out. The girl was quick to obey, as ever, but Sansa decided there was something sly about her eyes. Doubtless, she was scurrying off to report to the queen, or maybe Varys. All her maids spied on her, she was certain.  Once alone, she thrust the note in the flames, watching the parchment curl and blacken."
}