{
  "id": "7bdfc583a962b9e2d843f0db40aa46b0f20d0f3f",
  "text": " The gold cloaks know how to deal with thieving little gutter rats, that they do.   Arya glanced warily behind her. Two of the City Watch were standing at the mouth of an alley. Their cloaks hung almost to the ground, the heavy wool dyed a rich gold; their mail and boots and gloves were black. One wore a longsword at his hip, the other an iron cudgel. With a last wistful glance at the tarts, Arya edged back from the cart and hurried off. The gold cloaks had not been paying her any special attention, but the sight of them tied her stomach in knots. Arya had been staying as far from the castle as she could get, yet even from a distance she could see the heads rotting atop the high red walls. Flocks of crows squabbled noisily over each head, thick as flies. The talk in Flea Bottom was that the gold cloaks had thrown in with the Lannisters, their commander raised to a lord, with lands on the Trident and a seat on the king’s council.  She had also heard other things, scary things, things that made no sense to her. Some said her father had murdered King Robert and been slain in turn by Lord Renly. Others insisted that Renly had killed the king in a drunken quarrel between brothers. Why else should he have fled in the night like a common thief? One story said the king had been killed by a boar while hunting, another that he’d died eating a boar, stuffing himself so full that he’d ruptured at the table. No, the king had died at table, others said, but only because Varys the Spider poisoned him. No, it had been the queen who poisoned him. No, he had died of a pox. No, he had choked on a fish bone.  One thing all the stories agreed on: King Robert was dead. The bells in the seven towers of the Great Sept of Baelor had tolled for a day and a night, the thunder of their grief rolling across the city in a bronze tide. They only rang the bells like that for the death of a king, a tanner’s boy told Arya.  All she wanted was to go home, but leaving King’s Landing was not so easy as she had hoped. Talk of war was on every lip, and gold cloaks were as thick on the city walls as fleas on… well, her, for one. She had been sleeping in Flea Bottom, on rooftops and in stables, wherever she could find a place to lie down, and it hadn’t taken her long to learn that the district was well named.  Every day since her escape from the Red Keep, Arya had visited each of the seven city gates in turn. The Dragon Gate, the Lion Gate, and the Old Gate were closed and barred. The Mud Gate and the Gate of the Gods were open, but only to those who wanted to enter the city; the guards let no one out. Those who were allowed to leave left by the King’s Gate or the Iron Gate, but Lannister men-at-arms in crimson cloaks and lion-crested helms manned the guard posts there. Spying down from the roof of an inn by the King’s Gate, Arya saw them searching wagons and carriages, forcing riders to open their saddlebags, and questioning everyone who tried to pass on foot.  Sometimes she thought about swimming the river, but the Blackwater Rush was wide and deep, and everyone agreed that its currents were wicked and treacherous. She had no coin to pay a ferryman or take passage on a ship.  Her lord father had taught her never to steal, but it was growing harder to remember why. If she did not get out soon, she would have to take her chances with the gold cloaks. She hadn’t gone hungry much since she learned to knock down birds with her stick sword, but she feared so much pigeon was making her sick. A couple she’d eaten raw, before she found Flea Bottom.  In the Bottom there were pot-shops along the alleys where huge tubs of stew had been simmering for years, and you could trade half your bird for a heel of yesterday’s bread and a  bowl o’ brown,  and they’d even stick the other half in the fire and crisp it up for you, so long as you plucked the feathers yourself. Arya would have given anything for a cup of milk and a lemon cake, but the brown wasn’t so bad. It usually had barley in it, and chunks of carrot and onion and turnip, and sometimes even apple, with a film of grease swimming on top. Mostly she tried not to think about the meat. Once she had gotten a piece of fish.  The only thing was, the pot-shops were never empty, and even as she bolted down her food, Arya could feel them watching. Some of them stared at her boots or her cloak, and she knew what they were thinking. With others, she could almost feel their eyes crawling under her leathers; she didn’t know what they were thinking, and that scared her even more. A couple times, she was followed out into the alleys and chased, but so far no one had been able to catch her.  The silver bracelet she’d hoped to sell had been stolen her first night out of the castle, along with her bundle of good clothes, snatched while she slept in a burnt-out house off Pig Alley. All they left her was the cloak she had been huddled in, the leathers on her back, her wooden practice sword… and Needle. She’d been lying on top of Needle, or else it would have been gone too; it was worth more than all the rest together."
}