{
  "id": "7bef0d5beedff1d08936770bedbdbcfb6e0fd278",
  "text": " She heard Lord Beric shout. From out of the ditches and trees the rest of his band came pouring, steel in hand. Arya saw Lem’s bright yellow cloak flapping behind him as he rode down the man who’d killed Kyle. Thoros and Lord Beric were everywhere, their swords swirling fire. The red priest hacked at a hide shield until it flew to pieces, while his horse kicked the man in the face. A Dothraki screamed and charged the lightning lord, and the flaming sword leapt out to meet his arakh. The blades kissed and spun and kissed again. Then the Dothraki’s hair was ablaze, and a moment later he was dead. She spied Ned too, fighting at the lightning lord’s side. It’s not fair, he’s only a little older than me, they should have let me fight.  The battle did not last very long. The Brave Companions still on their feet soon died, or threw down their swords. Two of the Dothraki managed to regain their horses and flee, but only because Lord Beric let them go.  Let them carry the word back to Harrenhal,  he said, with flaming sword in hand.  It will give the Leech Lord and his goat a few more sleepless nights.   Jack-Be-Lucky, Harwin, and Merrit o’ Moontown braved the burning septry to search for captives. They emerged from the smoke and flames a few moments later with eight brown brothers, one so weak that Merrit had to carry him across a shoulder. There was a septon with them as well, round-shouldered and balding, but he wore black chainmail over his grey robes.  Found him hiding under the cellar steps,  said Jack, coughing.  Thoros smiled to see him.  You are Utt.    Septon Utt. A man of god.    What god would want the likes o’ you?  growled Lem.   I have sinned,  the septon wailed.  I know, I know. Forgive me, Father. Oh, grievously have I sinned.   Arya remembered Septon Utt from her time at Harrenhal. Shagwell the Fool said he always wept and prayed for forgiveness after he’d killed his latest boy. Sometimes he even made the other Mummers scourge him. They all thought that was very funny.  Lord Beric slammed his sword into its scabbard, quenching the flames.  Give the dying the gift of mercy and bind the others hand and foot for trial,  he commanded, and it was done.  The trials went swiftly. Various of the outlaws came forward to tell of things the Brave Companions had done; towns and villages sacked, crops burned, women raped and murdered, men maimed and tortured. A few spoke of the boys that Septon Utt had carried off. The septon wept and prayed through it all.  I am a weak reed,  he told Lord Beric.  I pray to the Warrior for strength, but the gods made me weak. Have mercy on my weakness. The boys, the sweet boys… I never mean to hurt them…   Septon Utt soon dangled beneath a tall elm, swinging slowly by the neck, as naked as his name day. The other Brave Companions followed one by one. A few fought, kicking and struggling as the noose was tightened round their throats. One of the crossbowmen kept shouting,  I soldier, I soldier,  in a thick Myrish accent. Another offered to lead his captors to gold; a third told them what a good outlaw he would make. Each was stripped and bound and hanged in turn. Tom Sevenstrings played a dirge for them on his woodharp, and Thoros implored the Lord of Light to roast their souls until the end of time.  A mummer tree, Arya thought as she watched them dangle, their pale skins painted a sullen red by the flames of the burning septry. Already the crows were coming, appearing out of nowhere. She heard them croaking and cackling at one another, and wondered what they were saying. Arya had not feared Septon Utt as much as she did Rorge and Biter and some of the others still at Harrenhal, but she was glad that he was dead all the same. They should have hanged the Hound too, or chopped his head off. Instead, to her disgust, the outlaws had treated Sandor Clegane’s burned arm, restored his sword and horse and armor, and set him free a few miles from the hollow hill. All they’d taken was his gold.  The septry soon collapsed in a roar of smoke and flame, its walls no longer able to support the weight of its heavy slate roof. The eight brown brothers watched with resignation. They were all that remained, explained the eldest, who wore a small iron hammer on a thong about his neck to signify his devotion to the Smith.  Before the war we were four-and-forty, and this was a prosperous place. We had a dozen milk cows and a bull, a hundred beehives, a vineyard and an apple arbor. But when the lions came through they took all our wine and milk and honey, slaughtered the cows, and put our vineyard to the torch. After that… I have lost count of our visitors. This false septon was only the latest. There was one monster… we gave him all our silver, but he was certain we were hiding gold, so his men killed us one by one to make Elder Brother talk.    How did the eight of you survive?  asked Anguy the Archer.   I am ashamed,  the old man said.  It was me. When it came my turn to die, I told them where our gold was hidden."
}