{
  "id": "7c0e82417ecdab966e18dcd202bd30e821475a43",
  "text": " Very puffed he was, when he got to Bywater  just  on  the  stroke  of  eleven,  and  found  he  had  come  without  a  pocket- handkerchief!  \"Bravo!\" said Balin who was standing at the inn door looking out for him.  Just  then  all  the  others  came  round  the  corner  of  the  road  from  the  village.  They were on ponies, and each pony was  slung about with all kinds of baggages,  packages, parcels, and paraphernalia. There was a very small pony, apparently for  Bilbo.  \"Up you two get, and off we go!\" said Thorin.  \"I'm  awfully  sorry,\"  said Bilbo,  \"but  I  have  come without my  hat,  and  I  have  left my pocket-handkerchief behind, and I haven't got any money. I didn't get your  note until after 10.45 to be precise.\"  \"Don't  be  precise,\"  said  Dwalin,  \"and  don't  worry!  You will  have  to manage  without pocket-handkerchiefs, and a good many other things, before you get to the  journey's end. As for a hat, I have got a spare hood and cloak in my luggage.\"   ####-That's  how  they  all  came  to  start,  jogging  off  from  the  inn  one  fine  morning  just  before  May,  on  laden  ponies;  and  Bilbo  was  wearing  a  dark-green  hood  (a  little  weather-stained)  and  a  dark-green cloak borrowed  from Dwalin. They were  too large for him, and he looked rather comic. What his father Bungo would have  thought of him, I daren't think. His only comfort was he couldn't be mistaken for a  dwarf, as he had no beard.  They had not been riding very long when up came Gandalf very splendid on a  white  horse.  He  had  brought  a  lot  of  pocket-handkerchiefs,  and Bilbo's  pipe  and  tobacco.  So  after  that  the  party  went  along  very  merrily,  and  they  told  stories  or  sang  songs  as  they  rode  forward  all  day,  except  of  course  when  they  stopped  for  meals. These didn't  come quite  as often  as Bilbo would have  liked  them, but  still  he began to feel that adventures were not so bad after all. At  first they had passed  through  hobbit-lands,  a  wild  respectable  country  inhabited  by  decent  folk,  with  good  roads,  an  inn  or  two,  and  now  and  then  a  dwarf  or  a  farmer  ambling  by  on  business.  Then  they  came  to  lands where people  spoke  strangely,  and  sang  songs  Bilbo  had  never  heard  before.  Now  they  had  gone  on  far  into  the  Lone-lands,  where  there were  no  people  left,  no  inns,  and  the  roads  grew  steadily worse. Not  far  ahead were  dreary  hills,  rising  higher  and  higher, dark with trees. On some of  them  were  old  castles  with  an  evil  look,  as  if  they  had  been  built  by  wicked  people.  Everything  seemed  gloomy,  for  the  weather  that  day  had  taken  a  nasty  turn. Mostly  it  had  been  as  good  as May  can  be,  even  in  merry  tales, but now  it  was  cold  and  wet.  In  the  Lone-lands  they  had  to  camp  when  they  could,  but  at  least  it  had  been  dry.  \"To  think  it  will  soon  be  June,\"  grumbled  Bilbo  as  he  splashed  along  behind  the  others  in  a  very  muddy  track.  It  was  after  tea-time;  it  was  pouring with  rain, and had been all day; his hood was dripping  into his eyes,  his cloak was full of water;  the pony was  tired and stumbled on stones;  the others  were  too  grumpy  to  talk.  \"And  I'm  sure  the  rain  has  got  into  the  dry  clothes  and  into  the  food-bags,\" thought Bilbo. \"Bother burgling and everything to do with it!  I wish  I was at home  in my nice hole by  the  fire, with  the kettle  just beginning  to  sing!\" It was not the last time that he wished that!  Still  the  dwarves  jogged  on,  never  turning  round  or  taking  any  notice  of  the  hobbit.  Somewhere  behind  the  grey  clouds  the  sun  must  have  gone  down,  for  it  began  to  get  dark.  Wind  got  up,  and  the  willows  along  the  river-bank  bent  and  sighed. I don't know what river it was, a rushing red one, swollen with the rains of  the  last  few  days,  that  came  down  from  the  hills  and mountains  in  front  of  them.  Soon it was nearly dark. The winds broke up the grey clouds, and a waning moon  appeared  above  the  hills  between  the  flying  rags.  Then  they  stopped,  and  Thorin   ####-muttered  something  about  supper,  \"and  where  shall  we  get  a  dry  patch  to  sleep  on?\" Not until  then did  they notice  that Gandalf was missing. So far he had come  all  the way with  them, never  saying  if he was  in  the adventure or merely keeping  them  company  for  a  while.  He  had  eaten  most,  talked  most,  and  laughed  most.  But now he simply was not there at all!  \"Just  when  a  wizard  would  have  been  most  useful,  too,\"  groaned  Dori  and  Nori  (who  shared  the hobbit's views about  regular meals, plenty and often). They  decided in  the end that they would have to camp where they were. So far they had  not  camped  before  on  this  journey,  and  though  they  knew  that  they  soon  would  have to camp regularly, when they were among the Misty Mountains and far from  the  lands  of  respectable  people,  it  seemed  a  bad  wet  evening  to  begin,  on."
}