{
  "id": "7c79cd8778107ca5a25e3948fe116884abefcd4b",
  "text": " Brick they may be, as you say, but if you buy them henceforth the only dogs they’ll kill are those you want dead. And you do have some dogs you want dead, as I recall.   The Usurper’s dogs.  Yes.  Dany gazed off at the soft colored lights and let the cool salt breeze caress her.  You speak of sacking cities. Answer me this, ser—why have the Dothraki never sacked this city?  She pointed.  Look at the walls. You can see where they’ve begun to crumble. There, and there. Do you see any guards on those towers? I don’t. Are they hiding, ser? I saw these sons of the harpy today, all their proud highborn warriors. They dressed in linen skirts, and the fiercest thing about them was their hair. Even a modest khalasar could crack this Astapor like a nut and spill out the rotted meat inside. So tell me, why is that ugly harpy not sitting beside the godsway in Vaes Dothrak among the other stolen gods?    You have a dragon’s eye, Khaleesi, that’s plain to see.    I wanted an answer, not a compliment.    There are two reasons. Astapor’s brave defenders are so much chaff, it’s true. Old names and fat purses who dress up as Ghiscari scourges to pretend they still rule a vast empire. Every one is a high officer. On feastdays they fight mock wars in the pits to demonstrate what brilliant commanders they are, but it’s the eunuchs who do the dying. All the same, any enemy wanting to sack Astapor would have to know that they’d be facing Unsullied. The slavers would turn out the whole garrison in the city’s defense. The Dothraki have not ridden against Unsullied since they left their braids at the gates of Qohor.    And the second reason?  Dany asked.   Who would attack Astapor?  Ser Jorah asked.  Meereen and Yunkai are rivals but not enemies, the Doom destroyed Valyria, the folk of the eastern hinterlands are all Ghiscari, and beyond the hills lies Lhazar. The Lamb Men, as your Dothraki call them, a notably unwarlike people.    Yes,  she agreed,  but north of the slave cities is the Dothraki sea, and two dozen mighty khals who like nothing more than sacking cities and carrying off their people into slavery.    Carrying them off where? What good are slaves once you’ve killed the slavers? Valyria is no more, Qarth lies beyond the red waste, and the Nine Free Cities are thousands of leagues to the west. And you may be sure the sons of the harpy give lavishly to every passing khal, just as the magisters do in Pentos and Norvos and Myr. They know that if they feast the horselords and give them gifts, they will soon ride on. It’s cheaper than fighting, and a deal more certain.   Cheaper than fighting, Dany thought. Yes, it might be. If only it could be that easy for her. How pleasant it would be to sail to King’s Landing with her dragons, and pay the boy Joffrey a chest of gold to make him go away.   Khaleesi?  Ser Jorah prompted, when she had been silent for a long time. He touched her elbow lightly.  Dany shrugged him off .  Viserys would have bought as many Unsullied as he had the coin for. But you once said I was like Rhaegar…    I remember, Daenerys.    Your Grace,  she corrected.  Prince Rhaegar led free men into battle, not slaves. Whitebeard said he dubbed his squires himself, and made many other knights as well.    There was no higher honor than to receive your knighthood from the Prince of Dragonstone.    Tell me, then—when he touched a man on the shoulder with his sword, what did he say? ‘Go forth and kill the weak’? Or ‘Go forth and defend them’? At the Trident, those brave men Viserys spoke of who died beneath our dragon banners—did they give their lives because they believed in Rhaegar’s cause, or because they had been bought and paid for?  Dany turned to Mormont, crossed her arms, and waited for an answer.   My queen,  the big man said slowly,  all you say is true. But Rhaegar lost on the Trident. He lost the battle, he lost the war, he lost the kingdom, and he lost his life. His blood swirled downriver with the rubies from his breastplate, and Robert the Usurper rode over his corpse to steal the Iron Throne. Rhaegar fought valiantly, Rhaegar fought nobly, Rhaegar fought honorably. And Rhaegar died.       Bran   No roads ran through the twisted mountain valleys where they walked now. Between the grey stone peaks lay still blue lakes, long and deep and narrow, and the green gloom of endless piney woods. The russet and gold of autumn leaves grew less common when they left the wolfswood to climb amongst the old flint hills, and vanished by the time those hills had turned to mountains. Giant grey-green sentinels loomed above them now, and spruce and fir and soldier pines in endless profusion. The undergrowth was sparse beneath them, the forest floor carpeted in dark green needles.  When they lost their way, as happened once or twice, they need only wait for a clear cold night when the clouds did not intrude, and look up in the sky for the Ice Dragon. The blue star in the dragon’s eye pointed the way north, as Osha told him once."
}