{
  "id": "7cc8ec4c88c56e3145cc343c2c26fa442d210875",
  "text": " He was castle-born and castle-raised, and he learned sword and lance from a knight and letters from a maester of the Citadel. His father was a lord, and his brother a king.   Ser Denys stroked his long white beard.  Mayhaps,  he said, after a long moment.  He is very young, but… mayhaps. He might serve, I grant you, though I would be more suitable. I have no doubt of that. I would be the wiser choice.   Jon said there could be honor in a lie, if it were told for the right reason. Sam said,  If we do not choose a Lord Commander tonight, King Stannis means to name Cotter Pyke. He said as much to Maester Aemon this morning, after all of you had left.    I see.  Ser Denys rose.  I must think on this. Thank you, Samwell. And give my thanks to Maester Aemon as well.   Sam was trembling by the time he left the Lance. What have I done? he thought. What have I said? If they caught him in his lie, they would… what? Send me to the Wall? Rip my entrails out? Turn me into a wight? Suddenly it all seemed absurd. How could he be so frightened of Cotter Pyke and Ser Denys Mallister, when he had seen a raven eating Small Paul’s face?  Pyke was not pleased by his return.  You again? Make it quick, you are starting to annoy me.    I only need a moment more,  Sam promised.  You won’t withdraw for Ser Denys, you said, but you might for someone else.    Who is it this time, Slayer? You?    No. A fighter. Donal Noye gave him the Wall when the wildlings came, and he was the Old Bear’s squire. The only thing is, he’s bastard-born.   Cotter Pyke laughed.  Bloody hell. That would shove a spear up Mallister’s arse, wouldn’t it? Might be worth it just for that. How bad could the boy be?  He snorted.  I’d be better, though. I’m what’s needed, any fool can see that.    Any fool,  Sam agreed,  even me. But… well, I shouldn’t be telling you, but… King Stannis means to force Ser Denys on us, if we do not choose a man tonight. I heard him tell Maester Aemon that, after the rest of you were sent away.       Jon   Iron Emmett was a long, lanky young ranger whose endurance, strength, and swordsmanship were the pride of Eastwatch. Jon always came away from their sessions stiff and sore, and woke the next day covered with bruises, which was just the way he wanted it. He would never get any better going up against the likes of Satin and Horse, or even Grenn.  Most days he gave as good as he got, Jon liked to think, but not today. He had hardly slept last night, and after an hour of restless tossing he had given up even the attempt, dressed, and walked the top of the Wall till the sun came up, wrestling with Stannis Baratheon’s offer. The lack of sleep was catching up with him now, and Emmett was hammering him mercilessly across the yard, driving him back on his heels with one long looping cut after another, and slamming him with his shield from time to time for good measure. Jon’s arm had gone numb from the shock of impact, and the edgeless practice sword seemed to be growing heavier with every passing moment.  He was almost ready to lower his blade and call a halt when Emmett feinted low and came in over his shield with a savage forehand slash that caught Jon on the temple. He staggered, his helm and head both ringing from the force of the blow. For half a heartbeat the world beyond his eyeslit was a blur.  And then the years were gone, and he was back at Winterfell once more, wearing a quilted leather coat in place of mail and plate. His sword was made of wood, and it was Robb who stood facing him, not Iron Emmett.  Every morning they had trained together, since they were big enough to walk; Snow and Stark, spinning and slashing about the wards of Winterfell, shouting and laughing, sometimes crying when there was no one else to see. They were not little boys when they fought, but knights and mighty heroes.  I’m Prince Aemon the Dragonknight,  Jon would call out, and Robb would shout back,  Well, I’m Florian the Fool.  Or Robb would say,  I’m the Young Dragon,  and Jon would reply,  I’m Ser Ryam Redwyne.   That morning he called it first.  I’m Lord of Winterfell!  he cried, as he had a hundred times before. Only this time, this time, Robb had answered,  You can’t be Lord of Winterfell, you’re bastard-born. My lady mother says you can’t ever be the Lord of Winterfell.   I thought I had forgotten that. Jon could taste blood in his mouth, from the blow he’d taken.  In the end Halder and Horse had to pull him away from Iron Emmett, one man on either arm. The ranger sat on the ground dazed, his shield half in splinters, the visor of his helm knocked askew, and his sword six yards away.  Jon, enough,  Halder was shouting,  he’s down, you disarmed him. Enough!   No. Not enough. Never enough. Jon let his sword drop.  I’m sorry,  he muttered.  Emmett, are you hurt?   Iron Emmett pulled his battered helm off.  Was there some part of yield you could not comprehend, Lord Snow?  It was said amiably, though. Emmett was an amiable man, and he loved the song of swords."
}