{
  "id": "7cdfab23f34ae0385e1fd425cb838d1262043c2d",
  "text": "  Tyrion Lannister could not have been more astonished if Aegon the Conqueror himself had burst into the room, riding on a dragon and juggling lemon pies. He had not seen his sister weep since they were children together at Casterly Rock. Awkwardly, he took a step toward her. When your sister cries, you were supposed to comfort her… but this was Cersei! He reached a tentative hand for her shoulder.   Don’t touch me,  she said, wrenching away. It should not have hurt, yet it did, more than any slap. Red-faced, as angry as she was grief-stricken, Cersei struggled for breath.  Don’t look at me, not… not like this… not you.   Politely, Tyrion turned his back.  I did not mean to frighten you. I promise you, nothing will happen to Myrcella.    Liar,  she said behind him.  I’m not a child, to be soothed with empty promises. You told me you would free Jaime too. Well, where is he?     In Riverrun, I should imagine. Safe and under guard, until I find a way to free him.   Cersei sniffed.  I should have been born a man. I would have no need of any of you then. None of this would have been allowed to happen. How could Jaime let himself be captured by that boy? And Father, I trusted in him, fool that I am, but where is he now that he’s wanted? What is he doing?    Making war.    From behind the walls of Harrenhal?  she said scornfully.  A curious way of fighting. It looks suspiciously like hiding.    Look again.    What else would you call it? Father sits in one castle, and Robb Stark sits in another, and no one does anything.    There is sitting and there is sitting,  Tyrion suggested.  Each one waits for the other to move, but the lion is still, poised, his tail twitching, while the fawn is frozen by fear, bowels turned to jelly. No matter which way he bounds, the lion will have him, and he knows it.    And you’re quite certain that Father is the lion?   Tyrion grinned.  It’s on all our banners.   She ignored the jest.  If it was Father who’d been taken captive, Jaime would not be sitting by idly, I promise you.   Jaime would be battering his host to bloody bits against the walls of Riverrun, and the Others take their chances. He never did have any patience, no more than you, sweet sister.  Not all of us can be as bold as Jaime, but there are other ways to win wars. Harrenhal is strong and well situated.    And King’s Landing is not, as we both know perfectly well. While Father plays lion and fawn with the Stark boy, Renly marches up the roseroad. He could be at our gates any day now!    The city will not fall in a day. From Harrenhal it is a straight, swift march down the kingsroad. Renly will scarce have unlimbered his siege engines before Father takes him in the rear. His host will be the hammer, the city walls the anvil. it makes a lovely picture.   Cersei’s green eyes bored into him, wary, yet hungry for the reassurance he was feeding her.  And if Robb Stark marches?    Harrenhal is close enough to the fords of the Trident so that Roose Bolton cannot bring the northern foot across to join with the Young Wolf’s horse. Stark cannot march on King’s Landing without taking Harrenhal first, and even with Bolton he is not strong enough to do that.  Tyrion tried his most winning smile.  Meanwhile Father lives off the fat of the riverlands, while our uncle Stafford gathers fresh levies at the Rock.   Cersei regarded him suspiciously.  How could you know all this? Did Father tell you his intentions when he sent you here?    No. I glanced at a map.   Her look turned to disdain.  You’ve conjured up every word of this in that grotesque head of yours, haven’t you, Imp?   Tyrion tsked.  Sweet sister, I ask you, if we weren’t winning, would the Starks have sued for peace?  He drew out the letter that Ser Cleos Frey had brought.  The Young Wolf has sent us terms, you see. Unacceptable terms, to be sure, but still, a beginning. Would you care to see them?    Yes.  That fast, she was all queen again.  How do you come to have them? They should have come to me.    What else is a Hand for, if not to hand you things?  Tyrion handed her the letter. His cheek still throbbed where Cersei’s hand had left its mark. Let her flay half my face, it will be a small price to pay for her consent to the Dornish marriage. He would have that now, he could sense it.  And certain knowledge of an informer too… well, that was the plum in his pudding.      BRAN  Dancer was draped in bardings of snowy white wool emblazoned with the grey direwolf of House Stark, while Bran wore grey breeches and white doublet, his sleeves and collar trimmed with vair. Over his heart was his wolf’s-head brooch of silver and polished jet. He would sooner have had Summer than a silver wolf on his breast, but Ser Rodrik had been unyielding.  The low stone steps balked Dancer only for a moment. When Bran urged her on, she took them easily. Beyond the wide oak-and-iron doors, eight long rows of trestle tables filled Winterfell’s Great Hall, four on each side of the center aisle. Men crowded shoulder to shoulder on the benches."
}