{
  "id": "7cf3d0b677fe30de30c1745b880d04b7c2580a44",
  "text": " This is what a king should look like, he thought to himself as the man passed.  Then he saw the other one, waddling along half-hidden by his brother’s side. Tyrion Lannister, the youngest of Lord Tywin’s brood and by far the ugliest. All that the gods had given to Cersei and Jaime, they had denied Tyrion. He was a dwarf, half his brother’s height, struggling to keep pace on stunted legs. His head was too large for his body, with a brute’s squashed-in face beneath a swollen shelf of brow. One green eye and one black one peered out from under a lank fall of hair so blond it seemed white. Jon watched him with fascination.  The last of the high lords to enter were his uncle, Benjen Stark of the Night’s Watch, and his father’s ward, young Theon Greyjoy. Benjen gave Jon a warm smile as he went by. Theon ignored him utterly, but there was nothing new in that. After all had been seated, toasts were made, thanks were given and returned, and then the feasting began.  Jon had started drinking then, and he had not stopped.  Something rubbed against his leg beneath the table. Jon saw red eyes staring up at him.  Hungry again?  he asked. There was still half a honeyed chicken in the center of the table. Jon reached out to tear off a leg, then had a better idea. He knifed the bird whole and let the carcass slide to the floor between his legs. Ghost ripped into it in savage silence. His brothers and sisters had not been permitted to bring their wolves to the banquet, but there were more curs than Jon could count at this end of the hall, and no one had said a word about his pup. He told himself he was fortunate in that too.  His eyes stung. Jon rubbed at them savagely, cursing the smoke. He swallowed another gulp of wine and watched his direwolf devour the chicken.  Dogs moved between the tables, trailing after the serving girls. One of them, a black mongrel bitch with long yellow eyes, caught a scent of the chicken. She stopped and edged under the bench to get a share. Jon watched the confrontation. The bitch growled low in her throat and moved closer. Ghost looked up, silent, and fixed the dog with those hot red eyes. The bitch snapped an angry challenge. She was three times the size of the direwolf pup. Ghost did not move. He stood over his prize and opened his mouth, baring his fangs. The bitch tensed, barked again, then thought better of this fight. She turned and slunk away, with one last defiant snap to save her pride. Ghost went back to his meal.  Jon grinned and reached under the table to ruffle the shaggy white fur. The direwolf looked up at him, nipped gently at his hand, then went back to eating.   Is this one of the direwolves I’ve heard so much of?  a familiar voice asked close at hand.  Jon looked up happily as his uncle Ben put a hand on his head and ruffled his hair much as Jon had ruffled the wolf’s.  Yes,  he said.  His name is Ghost.   One of the squires interrupted the bawdy story he’d been telling to make room at the table for their lord’s brother. Benjen Stark straddled the bench with long legs and took the wine cup out of Jon’s hand.  Summerwine,  he said after a taste.  Nothing so sweet. How many cups have you had, Jon?   Jon smiled.  Ben Stark laughed.  As I feared. Ah, well. I believe I was younger than you the first time I got truly and sincerely drunk.  He snagged a roasted onion, dripping brown with gravy, from a nearby trencher and bit into it. It crunched.  His uncle was sharp-featured and gaunt as a mountain crag, but there was always a hint of laughter in his blue-grey eyes. He dressed in black, as befitted a man of the Night’s Watch. Tonight it was rich black velvet, with high leather boots and a wide belt with a silver buckle. A heavy silver chain was looped round his neck. Benjen watched Ghost with amusement as he ate his onion.  A very quiet wolf,  he observed.   He’s not like the others,  Jon said.  He never makes a sound. That’s why I named him Ghost. That, and because he’s white. The others are all dark, grey or black.    There are still direwolves beyond the Wall. We hear them on our rangings.  Benjen Stark gave Jon a long look.  Don’t you usually eat at table with your brothers?    Most times,  Jon answered in a flat voice.  But tonight Lady Stark thought it might give insult to the royal family to seat a bastard among them.    I see.  His uncle glanced over his shoulder at the raised table at the far end of the hall.  My brother does not seem very festive tonight.   Jon had noticed that too. A bastard had to learn to notice things, to read the truth that people hid behind their eyes. His father was observing all the courtesies, but there was tightness in him that Jon had seldom seen before. He said little, looking out over the hall with hooded eyes, seeing nothing. Two seats away, the king had been drinking heavily all night. His broad face was flushed behind his great black beard. He made many a toast, laughed loudly at every jest, and attacked each dish like a starving man, but beside him the queen seemed as cold as an ice sculpture."
}