{
  "id": "7d6243f974ae992d48c0df7d03bad94a109fa613",
  "text": " More like slaughtering sheep, if truth be told. Sheep fleeced in steel, but sheep nonetheless.  Climbing a jumble of stone, Theon looked down on the dead men and dying horses. The horses had deserved better. Tymor and his brothers had gathered up what mounts had come through the fight unhurt, while Urzen and Black Lorren silenced the animals too badly wounded to be saved. The rest of his men were looting the corpses. Gevin Harlaw knelt on a dead man’s chest, sawing off his finger to get at a ring. Paying the iron price. My lord father would approve. Theon thought of seeking out the bodies of the two men he’d slain himself to see if they had any jewelry worth the taking, but the notion left a bitter taste in his mouth. He could imagine what Eddard Stark would have said. Yet that thought made him angry too. Stark is dead and rotting, and naught to me, he reminded himself.  Old Botley, who was called Fishwhiskers, sat scowling by his pile of plunder while his three sons added to it. One of them was in a shoving match with a fat man named Todric, who was reeling among the slain with a horn of ale in one hand and an axe in the other, clad in a cloak of white foxfur only slightly stained by the blood of its previous owner. Drunk, Theon decided, watching him bellow. It was said that the ironmen of old had oft been blood-drunk in battle, so berserk that they felt no pain and feared no foe, but this was a common ale-drunk.   Wex, my bow and quiver.  The boy ran and fetched them. Theon bent the bow and slipped the string into its notches as Todric knocked down the Botley boy and flung ale into his eyes. Fishwhiskers leapt up cursing, but Theon was quicker. He drew on the hand that clutched the drinking horn, figuring to give them a shot to talk about, but Todric spoiled it by lurching to one side just as he loosed. The arrow took him through the belly.  The looters stopped to gape. Theon lowered his bow.  No drunkards, I said, and no squabbles over plunder.  On his knees, Todric was dying noisily.  Botley, silence him.  Fishwhiskers and his sons were quick to obey. They slit Todric’s throat as he kicked feebly, and were stripping him of cloak and rings and weapons before he was even dead.  Now they know I mean what I say. Lord Balon might have given him the command, but Theon knew that some of his men saw only a soft boy from the green lands when they looked at him.  Anyone else have a thirst?  No one replied.  Good.  He kicked at Benfred’s fallen banner, clutched in the dead hand of the squire who’d borne it. A rabbitskin had been tied below the flag. Why rabbitskins? he had meant to ask, but being spat on had made him forget his questions. He tossed his bow back to Wex and strode off, remembering how elated he’d felt after the Whispering Wood, and wondering why this did not taste as sweet. Tallhart, you bloody overproud fool, you never even sent out a scout.  They’d been joking and even singing as they’d come on, the three trees of Tallhart streaming above them while rabbitskins flapped stupidly from the points of their lances. The archers concealed behind the gorse had spoiled the song with a rain of arrows, and Theon himself had led his men-at-arms out to finish the butcher’s work with dagger, axe, and warhammer. He had ordered their leader spared for questioning.  Only he had not expected it to be Benfred Tallhart.  His limp body was being dragged from the surf when Theon returned to his Sea Bitch. The masts of his longships stood outlined against the sky along the pebbled beach. Of the fishing village, nothing remained but cold ashes that stank when it rained. The men had been put to the sword, all but a handful that Theon had allowed to flee to bring the word to Torrhen’s Square. Their wives and daughters had been claimed for salt wives, those who were young enough and fair. The crones and the ugly ones had simply been raped and killed, or taken for thralls if they had useful skills and did not seem likely to cause trouble.  Theon had planned that attack as well, bringing his ships up to the shore in the chill darkness before the dawn and leaping from the prow with a longaxe in his hand to lead his men into the sleeping village. He did not like the taste of any of this, but what choice did he have?  His thrice-damned sister was sailing her Black Wind north even now, sure to win a castle of her own. Lord Balon had let no word of the hosting escape the Iron Islands, and Theon’s bloody work along the Stony Shore would be put down to sea raiders out for plunder. The northmen would not realize their true peril, not until the hammers fell on Deepwood Motte and Moat Cailin. And after all is done and won, they will make songs for that bitch Asha, and forget that I was even here. That is, if he allowed it.  Dagmer Cleftjaw stood by the high carved prow of his longship, Foamdrinker. Theon had assigned him the task of guarding the ships; otherwise men would have called it Dagmer’s victory, not his. A more prickly man might have taken that for a slight, but the Cleftjaw had only laughed."
}