{
  "id": "7de6cab59a9a00ad8346e442e2cb099d7424150b",
  "text": " And when the meat course was brought out, he served her himself, slicing a queen’s portion from the joint, smiling as he laid it on her plate. She could see from the way he moved that his right arm was still troubling him, yet he uttered not a word of complaint.  Later came sweetbreads and pigeon pie and baked apples fragrant with cinnamon and lemon cakes frosted in sugar, but by then Sansa was so stuffed that she could not manage more than two little lemon cakes, as much as she loved them. She was wondering whether she might attempt a third when the king began to shout.  King Robert had grown louder with each course. From time to time Sansa could hear him laughing or roaring a command over the music and the clangor of plates and cutlery, but they were too far away for her to make out his words.  Now everybody heard him.  No,  he thundered in a voice that drowned out all other speech. Sansa was shocked to see the king on his feet, red of face, reeling. He had a goblet of wine in one hand, and he was drunk as a man could be.  You do not tell me what to do, woman,  he screamed at Queen Cersei.  I am king here, do you understand? I rule here, and if I say that I will fight tomorrow, I will fight!   Everyone was staring. Sansa saw Ser Barristan, and the king’s brother Renly, and the short man who had talked to her so oddly and touched her hair, but no one made a move to interfere. The queen’s face was a mask, so bloodless that it might have been sculpted from snow. She rose from the table, gathered her skirts around her, and stormed off in silence, servants trailing behind.  Jaime Lannister put a hand on the king’s shoulder, but the king shoved him away hard. Lannister stumbled and fell. The king guffawed.  The great knight. I can still knock you in the dirt. Remember that, Kingslayer.  He slapped his chest with the jeweled goblet, splashing wine all over his satin tunic.  Give me my hammer and not a man in the realm can stand before me!   Jaime Lannister rose and brushed himself off.  As you say, Your Grace.  His voice was stiff.  Lord Renly came forward, smiling.  You’ve spilled your wine, Robert. Let me bring you a fresh goblet.   Sansa started as Joffrey laid his hand on her arm.  It grows late,  the prince said. He had a queer look on his face, as if he were not seeing her at all.  Do you need an escort back to the castle?    No,  Sansa began. She looked for Septa Mordane, and was startled to find her with her head on the table, snoring soft and ladylike snores.  I mean to say… yes, thank you, that would be most kind. I am tired, and the way is so dark. I should be glad for some protection.   Joffrey called out,  Dog!   Sandor Clegane seemed to take form out of the night, so quickly did he appear. He had exchanged his armor for a red woolen tunic with a leather dog’s head sewn on the front. The light of the torches made his burned face shine a dull red.  Yes, Your Grace?  he said.   Take my betrothed back to the castle, and see that no harm befalls her,  the prince told him brusquely. And without even a word of farewell, Joffrey strode off, leaving her there.  Sansa could feel the Hound watching her.  Did you think Joff was going to take you himself?  He laughed. He had a laugh like the snarling of dogs in a pit.  Small chance of that.  He pulled her unresisting to her feet.  Come, you’re not the only one needs sleep. I’ve drunk too much, and I may need to kill my brother tomorrow.  He laughed again.  Suddenly terrified, Sansa pushed at Septa Mordane’s shoulder, hoping to wake her, but she only snored the louder. King Robert had stumbled off and half the benches were suddenly empty. The feast was over, and the beautiful dream had ended with it.  The Hound snatched up a torch to light their way. Sansa followed close beside him. The ground was rocky and uneven; the flickering light made it seem to shift and move beneath her. She kept her eyes lowered, watching where she placed her feet. They walked among the pavilions, each with its banner and its armor hung outside, the silence weighing heavier with every step. Sansa could not bear the sight of him, he frightened her so, yet she had been raised in all the ways of courtesy. A true lady would not notice his face, she told herself.  You rode gallantly today, Ser Sandor,  she made herself say.  Sandor Clegane snarled at her.  Spare me your empty little compliments, girl… and your ser’s. I am no knight. I spit on them and their vows. My brother is a knight. Did you see him ride today?    Yes,  Sansa whispered, trembling.  He was…   Gallant?  the Hound finished.  He was mocking her, she realized.  No one could withstand him,  she managed at last, proud of herself. It was no lie.  Sandor Clegane stopped suddenly in the middle of a dark and empty field. She had no choice but to stop beside him.  Some septa trained you well. You’re like one of those birds from the Summer Isles, aren’t you? A pretty little talking bird, repeating all the pretty little words they taught you to recite."
}