{
  "id": "7de9f2c54def38a2963b750b4567c2a3d310d2e2",
  "text": "  Untie her and remove that gag.   The rope had been so tight as to cut off the blood to her hands. She cried out in pain as the circulation returned. Tyrion massaged her fingers gently until feeling returned.  Sweetling,  he said,  you must be brave. I am sorry they hurt you.    I know you’ll free me, my lord.    I will,  he promised, and Alayaya bent over and kissed him on the brow. Her broken lips left a smear of blood on his forehead. A bloody kiss is more than I deserve, Tyrion thought. She would never have been hurt but for me.  Her blood still marked him as he looked down at the queen.  I have never liked you, Cersei, but you were my own sister, so I never did you harm. You’ve ended that. I will hurt you for this. I don’t know how yet, but give me time. A day will come when you think yourself safe and happy, and suddenly your joy will turn to ashes in your mouth, and you’ll know the debt is paid.  In war, his father had told him once, the battle is over in the instant one army breaks and flees. No matter that they’re as numerous as they were a moment before, still armed and armored; once they had run before you they would not turn to fight again. So it was with Cersei.  Get out!  was all the answer she could summon.  Get out of my sight!   Tyrion bowed.  Good night, then. And pleasant dreams.   He made his way back to the Tower of the Hand with a thousand armored feet marching through his skull. I ought to have seen this coming the first time I slipped through the back of Chataya’s wardrobe. Perhaps he had not wanted to see. His legs were aching badly by the time he had made the climb. He sent Pod for a flagon of wine and pushed his way into his bedchamber.  Shae sat cross-legged in the canopied bed, nude but for the heavy golden chain that looped across the swell of her breasts: a chain of linked golden hands, each clasping the next.  Tyrion had not expected her.  What are you doing here?   Laughing, she stroked the chain.  I wanted some hands on my titties… but these little gold ones are cold.   For a moment he did know what to say. How could he tell her that another woman had taken the beating meant for her, and might well die in her place should some mischance of battle fell Joffrey? He wiped Alayaya’s blood from his brow with the heel of his hand.  The Lady Lollys—    She’s asleep. Sleep’s all she ever wants to do, the great cow. She sleeps and she eats. Sometimes she falls asleep while she’s eating. The food falls under the blankets and she rolls in it, and I have to clean her.  She made a disgusted face.  All they did was fuck her.    Her mother says she’s sick.    She has a baby in her belly, that’s all.   Tyrion gazed around the room. Everything seemed much as he left it.  How did you enter? Show me the hidden door.   She gave a shrug.  Lord Varys made me wear a hood. I couldn’t see, except… there was one place, I got a peep at the floor out the bottom of the hood. It was all tiles, you know, the kind that make a picture?    A mosaic?   Shae nodded.  They were colored red and black. I think the picture was a dragon. Otherwise, everything was dark. We went down a ladder and walked a long ways, until I was all twisted around. Once we stopped so he could unlock an iron gate. I brushed against it when we went through. The dragon was past the gate. Then we went up another ladder, with a tunnel at the top. I had to stoop, and I think Lord Varys was crawling.   Tyrion made a round of the bedchamber. One of the sconces looked loose. He stood on his toes and tried to turn it. It revolved slowly, scraping against the stone wall. When it was upside down, the stub of the candle fell out. The rushes scattered across the cold stone floor did not show any particular disturbance.  Doesn’t m’lord want to bed me?  asked Shae.   In a moment.  Tyrion threw open his wardrobe, shoved the clothing aside, and pushed against the rear panel. What worked for a whorehouse might work for a castle as well… but no, the wood was solid, unyielding. A stone beside the window seat drew his eye, but all his tugging and prodding went for naught. He returned to the bed frustrated and annoyed.  Shae undid his laces and threw her arms around his neck.  Your shoulders feel as hard as rocks,  she murmured.  Hurry, I want to feel you inside me.  Yet as her legs locked around his waist, his manhood left him. When she felt him go soft, Shae slid down under the sheets and took him in her mouth, but even that could not rouse him.  After a few moments he stopped her.  What’s wrong?  she asked. All the sweet innocence of the world was written there in the lines of her young face.  Innocence? Fool, she’s a whore, Cersei was right, you think with your cock, fool, fool.   Just go to sleep, sweetling,  he urged, stroking her hair. Yet long after Shae had taken his advice, Tyrion himself still lay awake, his fingers cupped over one small breast as he listened to her breathing.      CATELYN  The Great Hall of Riverrun was a lonely place for two to sit to supper."
}