{
  "id": "7df7cc984dd2a48d14a36ea12fa2fab5300dbec7",
  "text": "  Do you know what that means, Jorah?    Your Grace? The sigil of House Targaryen is a three-headed dragon, red on black.    I know that. But there are no three-headed dragons.    The three heads were Aegon and his sisters.    Visenya and Rhaenys,  she recalled.  I am descended from Aegon and Rhaenys through their son Aenys and their grandson Jaehaerys.    Blue lips speak only lies, isn’t that what Xaro told you? Why do you care what the warlocks whispered? All they wanted was to suck the life from you, you know that now.    Perhaps,  she said reluctantly.  Yet the things I saw…    A dead man in the prow of a ship, a blue rose, a banquet of blood… what does any of it mean, Khaleesi? A mummer’s dragon, you said. What is a mummer’s dragon, pray?    A cloth dragon on poles,  Dany explained.  Mummers use them in their follies, to give the heroes something to fight.   Ser Jorah frowned.  Dany could not let it go.  His is the song of ice and fire, my brother said. I’m certain it was my brother. Not Viserys, Rhaegar. He had a harp with silver strings.   Ser Jorah’s frown deepened until his eyebrows came together.  Prince Rhaegar played such a harp,  he conceded.  You saw him?   She nodded.  There was a woman in a bed with a babe at her breast. My brother said the babe was the prince that was promised and told her to name him Aegon.    Prince Aegon was Rhaegar’s heir by Elia of Dorne,  Ser Jorah said.  But if he was this prince that was promised, the promise was broken along with his skull when the Lannisters dashed his head against a wall.    I remember,  Dany said sadly.  They murdered Rhaegar’s daughter as well, the little princess. Rhaenys, she was named, like Aegon’s sister. There was no Visenya, but he said the dragon has three heads. What is the song of ice and fire?    It’s no song I’ve ever heard.    I went to the warlocks hoping for answers, but instead they’ve left me with a hundred new questions.   By then there were people in the streets once more.  Make way,  Aggo shouted, while Jhogo sniffed at the air suspiciously.  I smell it, Khaleesi,  he called.  The poison water.  The Dothraki distrusted the sea and all that moved upon it. Water that a horse could not drink was water they wanted no part of. They will learn, Dany resolved. I braved their sea with Khal Drogo. Now they can brave mine.  Qarth was one of the world’s great ports, its great sheltered harbor a riot of color and clangor and strange smells. Winesinks, warehouses, and gaming dens lined the streets, cheek by jowl with cheap brothels and the temples of peculiar gods. Cutpurses, cutthroats, spellsellers, and moneychangers mingled with every crowd. The waterfront was one great marketplace where the buying and selling went on all day and all night, and goods might be had for a fraction of what they cost at the bazaar, if a man did not ask where they came from. Wizened old women bent like hunchbacks sold flavored waters and goat’s milk from glazed ceramic jugs strapped to their shoulders. Seamen from half a hundred nations wandered amongst the stalls, drinking spiced liquors and trading jokes in queer-sounding tongues. The air smelled of salt and frying fish, of hot tar and honey, of incense and oil and sperm.  Aggo gave an urchin a copper for a skewer of honey-roasted mice and nibbled them as he rode. Jhogo bought a handful of fat white cherries. Elsewhere they saw beautiful bronze daggers for sale, dried squids and carved onyx, a potent magical elixir made of virgin’s milk and shade of the evening, even dragon’s eggs which looked suspiciously like painted rocks.  As they passed the long stone quays reserved for the ships of the Thirteen, she saw chests of saffron, frankincense, and pepper being off-loaded from Xaro’s ornate Vermillion Kiss. Beside her, casks of wine, bales of sourleaf, and pallets of striped hides were being trundled up the gangplank onto the Bride in Azure, to sail on the evening tide. Farther along, a crowd had gathered around the Spicer galley Sunblaze to bid on slaves. It was well known that the cheapest place to buy a slave was right off the ship, and the banners floating from her masts proclaimed that the Sunblaze had just arrived from Astapor on Slaver’s Bay.  Dany would get no help from the Thirteen, the Tourmaline Brotherhood, or the Ancient Guild of Spicers. She rode her silver past several miles of their quays, docks, and storehouses, all the way out to the far end of the horseshoe-shaped harbor where the ships from the Summer Islands, Westeros, and the Nine Free Cities were permitted to dock.  She dismounted beside a gaming pit where a basilisk was tearing a big red dog to pieces amidst a shouting ring of sailors.  Aggo, Jhogo, you will guard the horses while Ser Jorah and I speak to the captains.    As you say, Khaleesi. We will watch you as you go.   It was good to hear men speaking Valyrian once more, and even the Common Tongue, Dany thought as they approached the first ship. Sailors, dockworkers, and merchants alike gave way before her, not knowing what to make of this slim young girl with silver-gold hair who dressed in the Dothraki fashion and walked with a knight at her side."
}