{
  "id": "7e54ef64ecafe8a6d88349a5c23f26eeb47cec86",
  "text": "  Come in and warm yourselves,  a man’s voice called out.  There’s stone enough to keep the rain off all our heads.   He offered them oatcakes and blood sausage and a swallow of ale from a skin he carried, but never his name; nor did he ask theirs. Bran figured him for a Liddle. The clasp that fastened his squirrelskin cloak was gold and bronze and wrought in the shape of a pinecone, and the Liddles bore pinecones on the white half of their green-and-white shields.   Is it far to the Wall?  Bran asked him as they waited for the rain to stop.   Not so far as the raven flies,  said the Liddle, if that was who he was.  Farther, for them as lacks wings.   Bran started,  I’d bet we’d be there if…    …we took the kingsroad,  Meera finished with him.  The Liddle took out a knife and whittled at a stick.  When there was a Stark in Winterfell, a maiden girl could walk the kingsroad in her name-day gown and still go unmolested, and travelers could find fire, bread, and salt at many an inn and holdfast. But the nights are colder now, and doors are closed. There’s squids in the wolfswood, and flayed men ride the kingsroad asking after strangers.   The Reeds exchanged a look.  Flayed men?  said Jojen.   The Bastard’s boys, aye. He was dead, but now he’s not. And paying good silver for wolfskins, a man hears, and maybe gold for word of certain other walking dead.  He looked at Bran when he said that, and at Summer stretched out beside him.  As to that Wall,  the man went on,  it’s not a place that I’d be going. The Old Bear took the Watch into the haunted woods, and all that come back was his ravens, with hardly a message between them. Dark wings, dark words, me mother used to say, but when the birds fly silent, seems to me that’s even darker.  He poked at the fire with his stick.  It was different when there was a Stark in Winterfell. But the old wolf’s dead and young one’s gone south to play the game of thrones, and all that’s left us is the ghosts.    The wolves will come again,  said Jojen solemnly.   And how would you be knowing, boy?    I dreamed it.    Some nights I dream of me mother that I buried nine years past,  the man said,  but when I wake, she’s not come back to us.    There are dreams and dreams, my lord.    Hodor,  said Hodor.  They spent that night together, for the rain did not let up till well past dark, and only Summer seemed to want to leave the cave. When the fire had burned down to embers, Bran let him go. The direwolf did not feel the damp as people did, and the night was calling him. Moonlight painted the wet woods in shades of silver and turned the grey peaks white. Owls hooted through the dark and flew silently between the pines, while pale goats moved along the mountainsides. Bran closed his eyes and gave himself up to the wolf dream, to the smells and sounds of midnight.  When they woke the next morning, the fire had gone out and the Liddle was gone, but he’d left a sausage for them, and a dozen oatcakes folded up neatly in a green and white cloth. Some of the cakes had pinenuts baked in them and some had blackberries. Bran ate one of each, and still did not know which sort he liked the best. One day there would be Starks in Winterfell again, he told himself, and then he’d send for the Liddles and pay them back a hundredfold for every nut and berry.  The trail they followed was a little easier that day, and by noon the sun came breaking through the clouds. Bran sat in his basket up on Hodor’s back and felt almost content. He dozed off once, lulled to sleep by the smooth swing of the big stableboy’s stride and the soft humming sound he made sometimes when he walked. Meera woke him up with a light touch on his arm.  Look,  she said, pointing at the sky with her frog spear,  an eagle.   Bran lifted his head and saw it, its grey wings spread and still as it floated on the wind. He followed it with his eyes as it circled higher, wondering what it would be like to soar about the world so effortless. Better than climbing, even. He tried to reach the eagle, to leave his stupid crippled body and rise into the sky to join it, the way he joined with Summer. The greenseers could do it. I should be able to do it too. He tried and tried, until the eagle vanished in the golden haze of the afternoon.  It’s gone,  he said, disappointed.   We’ll see others,  said Meera.  They live up here.    I suppose.    Hodor,  said Hodor.   Hodor,  Bran agreed.  Jojen kicked a pinecone.  Hodor likes it when you say his name, I think.    Hodor’s not his true name,  Bran explained.  It’s just some word he says. His real name is Walder, Old Nan told me. She was his grandmother’s grandmother or something.  Talking about Old Nan made him sad.  Do you think the ironmen killed her?  They hadn’t seen her body at Winterfell. He didn’t remember seeing any women dead, now that he thought back.  She never hurt no one, not even Theon. She just told stories. Theon wouldn’t hurt someone like that. Would he?    Some people hurt others just because they can,  said Jojen."
}