{
  "id": "7e7a47a210b5b8763947dc74c3fc6466858f122e",
  "text": " He was glad for that. The Halfhand was not the most companionable of men. Qhorin’s long grey braid swung slowly with the motion of his horse. Often they would ride for hours without a word spoken, the only sounds the soft scrape of horseshoes on stone and the keening of the wind, which blew endlessly through the heights. When he slept, he did not dream; not of wolves, nor his brothers, nor anything. Even dreams cannot live up here, he told himself.   Is your sword sharp, Jon Snow?  asked Qhorin Halfhand across the flickering fire.   My sword is Valyrian steel. The Old Bear gave it to me.    Do you remember the words of your vow?    Yes.  They were not words a man was like to forget. Once said, they could never be unsaid. They changed your life forever.   Say them again with me, Jon Snow.    If you like.  Their voices blended as one beneath the rising moon, while Ghost listened and the mountains themselves bore witness.  Night gathers, and now my watch begins. It shall not end until my death. I shall take no wife, hold no lands, father no children. I shall wear no crowns and win no glory. I shall live and die at my post. I am the sword in the darkness. I am the watcher on the walls. I am the fire that burns against the cold, the light that brings the dawn, the horn that wakes the sleepers, the shield that guards the realms of men. I pledge my life and honor to the Night’s Watch, for this night and all the nights to come.   When they were done, there was no sound but the faint crackle of the flames and a distant sigh of wind. Jon opened and closed his burnt fingers, holding tight to the words in his mind, praying that his father’s gods would give him the strength to die bravely when his hour came. It would not be long now. The garrons were near the end of their strength. Qhorin’s mount would not last another day, Jon suspected.  The flames were burning low by then, the warmth fading.  The fire will soon go out,  Qhorin said,  but if the Wall should ever fall, all the fires will go out.   There was nothing Jon could say to that. He nodded.   We may escape them yet,  the ranger said.  Or not.    I’m not afraid to die.  It was only half a lie.   It may not be so easy as that, Jon.   He did not understand.  What do you mean?    If we are taken, you must yield.    Yield?  He blinked in disbelief. The wildlings did not make captives of the men they called the crows. They killed them, except for… They only spare oathbreakers. Those who join them, like Mance Rayder.    And you.    No.  He shook his head.  Never. I won’t.    You will. I command it of you.    Command it? But…    Our honor means no more than our lives, so long as the realm is safe. Are you a man of the Night’s Watch?    Yes, but—    There is no but, Jon Snow. You are, or you are not.   Jon sat up straight.  I am.    Then hear me. If we are taken, you will go over to them, as the wildling girl you captured once urged you. They may demand that you cut your cloak to ribbons, that you swear them an oath on your father’s grave, that you curse your brothers and your Lord Commander. You must not balk, whatever is asked of you. Do as they bid you… but in your heart, remember who and what you are. Ride with them, eat with them, fight with them, for as long as it takes. And watch.    For what?  Jon asked.   Would that I knew,  said Qhorin.  Your wolf saw their diggings in the valley of the Milkwater. What did they seek, in such a bleak and distant place? Did they find it? That is what you must learn, before you return to Lord Mormont and your brothers. That is the duty I lay on you, Jon Snow.    I’ll do as you say,  Jon said reluctantly,  but… you will tell them, won’t you? The Old Bear, at least? You’ll tell him that I never broke my oath.   Qhorin Halfhand gazed at him across the fire, his eyes lost in pools of shadow.  When I see him next. I swear it.  He gestured at the fire.  More wood. I want it bright and hot.   Jon went to cut more branches, snapping each one in two before tossing it into the flames. The tree had been dead a long time, but it seemed to live again in the fire, as fiery dancers woke within each stick of wood to whirl and spin in their glowing gowns of yellow, red, and orange.   Enough,  Qhorin said abruptly.  Now we ride.    Ride?  It was dark beyond the fire, and the night was cold.  Ride where?    Back.  Qhorin mounted his weary garron one more time.  The fire will draw them past, I hope. Come, brother.   Jon pulled on his gloves again and raised his hood. Even the horses seemed reluctant to leave the fire. The sun was long gone, and only the cold silver shine of the half-moon remained to light their way over the treacherous ground that lay behind them. He did not know what Qhorin had in mind, but perhaps it was a chance. He hoped so. I do not want to play the oathbreaker, even for good reason.  They went cautiously, moving as silent as man and horse could move, retracing their steps until they reached the mouth of a narrow defile where an icy little stream emerged from between two mountains."
}