{
  "id": "7ec001da5c2c8c89c2469917950efcc73af5d850",
  "text": " . . .\" \"My brothers Crouch's personal assistant,\" Ron informed Sirius.  \"He says Crouch is suffering from overwork.\" \"Mind you, he did look ill, last time I saw him up close,\" said Harry slowly, still reading the story. \"The night my name came out of the goblet. ...\"   \"Getting his comeuppance for sacking Winky, isn't he?\" said Hermione, an edge to her voice.  She was stroking Buckbeak, who was crunching up Sirius's chicken bones.  \"I bet he wishes he hadn't done it now - bet he feels the difference now she's not there to look after him.\" \"Hermione's obsessed with house-elfs,\" Ron muttered to Sirius, casting Hermione a dark look.  Sirius, however, looked interested. \"Crouch sacked his house-elf?\" \"Yeah, at the Quidditch World Cup,\" said Harry, and he launched into the story of the Dark Mark's appearance, and Winky being found with Harrys wand clutched in her hand, and Mr. Crouch's fury.  When Harry had finished, Sirius was on his feet again and had started pacing up and down the cave. \"Let me get this straight,\" he said after a while, brandishing a fresh chicken leg. \"You first saw the elfin the Top Box. She was saving Crouch a seat, right?\" \"Right,\" said Harry, Ron, and Hermione together. \"But Crouch didn't turn up for the match?\" \"No,\" said Harry. \"I think he said he'd been too busy.\" Sirius paced all around the cave in silence.  Then he said, \"Harry, did you check your pockets for your wand after you'd left the Top Box?\" \"Erm . . .\" Harry thought hard.  \"No,\" he said finally.  \"I didn't need to use it before we got in the forest.  And then I put my hand in my pocket, and all that was in there were my Omnioculars.\"  He stared at Sirius.  \"Are you saying whoever conjured the Mark stole my wand in the Top Box?\" \"It's possible,\" said Sirius. \"Winky didn't steal that wand!\"  Hermione insisted. \"The elf wasn't the only one in that box,\" said Sirius, his brow furrowed as he continued to pace.  \"Who else was sitting behind you?\" \"Loads of people,\" said Harry.  \"Some Bulgarian ministers .. . Cornelius Fudge ... the Malfoys ...\" \"The Malfoys!\"  said Ron suddenly, so loudly that his voice echoed all around the cave, and Buckbeak tossed his head nervously.  \"I bet it was Lucius Malfoy!\" \"Anyone else?\" said Sirius. \"No one,\" said Harry. \"Yes, there was, there was Ludo Bagman,\" Hermione reminded him. \"Oh yeah . . .\" \"I don't know anything about Bagman except that he used to be Beater for the Wimbourne Wasps,\" said Sirius, still pacing.  \"What's he like?\" \"He's okay,\" said Harry. \"He keeps offering to help me with the Triwizard Tournament.\" \"Does he, now?\" said Sirius, frowning more deeply.  \"I wonder why he'd do that?\" \"Says he's taken a liking to me,\" said Harry. \"Hmm,\" said Sirius, looking thoughtful. \"We saw him in the forest just before the Dark Mark appeared,\" Hermione told Sirius. \"Remember?\"  she said to Harry and Ron. \"Yeah, but he didn't stay in the forest, did he?\"  said Ron.  \"The moment we told him about the riot, he went off to the campsite.\" \"How d'you know?\"  Hermione shot back.  \"How d'you know where he Disapparated to?\" \"Come off it,\" said Ron incredulously.  \"Are you saying you reckon Ludo Bagman conjured the Dark Mark?\" \"It's more likely he did it than Winky,\" said Hermione stubbornly. \"Told you,\" said Ron, looking meaningfully at Sirius, \"told you she's obsessed with house -\" But Sirius held up a hand to silence Ron. \"When the Dark Mark had been conjured, and the elf had been discovered holding Harry's wand, what did Crouch do?\" \"Went to look in the bushes,\" said Harry, \"but there wasn't anyone else there.\" \"Of course,\" Sirius muttered, pacing up and down, \"of course, he'd want to pin it on anyone but his own elf... and then he sacked her?\" \"Yes,\" said Hermione in a heated voice, \"he sacked her, just because she hadn't stayed in her tent and let herself get trampled -\" \"Hermione, will you give it a rest with the elf!\" said Ron. Sirius shook his head and said,  \"She's got the measure of Crouch better than you have, Ron.  If you want to know what a mans like, take a good look at how he treats his inferiors, not his equals.\" He ran a hand over his unshaven face, evidently thinking hard. \"All these absences of Barty Crouch's ... he goes to the trouble of making sure his house-elf saves him a seat at the Quidditch World Cup, but doesn't bother to turn up and watch.  He works very hard to reinstate the Triwizard Tournament, and then stops coming to that too. . . . It's not like Crouch.  If he's ever taken a day off work because of illness before this, I'll eat Buckbeak.\" \"D'you know Crouch, then?\" said Harry. Sirius's face darkened.  He suddenly looked as menacing as he had the night when Harry first met him, the night when Harry still believed Sirius to be a murderer. \"Oh I know Crouch all right,\" he said quietly.  \"He was the one who gave the order for me to be sent to Azkaban - without a trial.\" \"What?\"  said Ron and Hermione together. \"You're kidding!\" said Harry. \"No, I'm not,\" said Sirius, taking another great bite of chicken."
}