{
  "id": "7f20209437f505dab6ce9ee078bc95190b7eedab",
  "text": "    But,  Jon objected,  the Wall…    The Wall can stop an army, but not a man alone. I took a lute and a bag of silver, scaled the ice near Long Barrow, walked a few leagues south of the New Gift, and bought a horse. All in all I made much better time than Robert, who was traveling with a ponderous great wheelhouse to keep his queen in comfort. A day south of Winterfell I came up on him and fell in with his company. Freeriders and hedge knights are always attaching themselves to royal processions, in hopes of finding service with the king, and my lute gained me easy acceptance.  He laughed.  I know every bawdy song that’s ever been made, north or south of the Wall. So there you are. The night your father feasted Robert, I sat in the back of his hall on a bench with the other freeriders, listening to Orland of Oldtown play the high harp and sing of dead kings beneath the sea. I betook of your lord father’s meat and mead, had a look at Kingslayer and Imp… and made passing note of Lord Eddard’s children and the wolf pups that ran at their heels.    Bael the Bard,  said Jon, remembering the tale that Ygritte had told him in the Frostfangs, the night he’d almost killed her.   Would that I were. I will not deny that Bael’s exploit inspired mine own… but I did not steal either of your sisters that I recall. Bael wrote his own songs, and lived them. I only sing the songs that better men have made. More mead?    No,  said Jon.  if you had been discovered… taken…    Your father would have had my head off.  The king gave a shrug.  Though once I had eaten at his board I was protected by guest right. The laws of hospitality are as old as the First Men, and sacred as a heart tree.  He gestured at the board between them, the broken bread and chicken bones.  Here you are the guest, and safe from harm at my hands… this night, at least. So tell me truly, Jon Snow. Are you a craven who turned your cloak from fear, or is there another reason that brings you to my tent?   Guest right or no, Jon Snow knew he walked on rotten ice here. One false step and he might plunge through, into water cold enough to stop his heart. Weigh every word before you speak it, he told himself. He took a long draught of mead to buy time for his answer. When he set the horn aside he said,  Tell me why you turned your cloak, and I’ll tell you why I turned mine.   Mance Rayder smiled, as Jon had hoped he would. The king was plainly a man who liked the sound of his own voice.  You will have heard stories of my desertion, I have no doubt.    Some say it was for a crown. Some say for a woman. Others that you had the wildling blood.    The wildling blood is the blood of the First Men, the same blood that flows in the veins of the Starks. As to a crown, do you see one?    I see a woman.  He glanced at Dalla.  Mance took her by the hand and pulled her close.  My lady is blameless. I met her on my return from your father’s castle. The Halfhand was carved of old oak, but I am made of flesh, and I have a great fondness for the charms of women… which makes me no different from three-quarters of the Watch. There are men still wearing black who have had ten times as many women as this poor king. You must guess again, Jon Snow.   Jon considered a moment.  The Halfhand said you had a passion for wildling music.    I did. I do. That’s closer to the mark, yes. But not a hit.  Mance Rayder rose, unfastened the clasp that held his cloak, and swept it over the bench.  It was for this.    A cloak?    The black wool cloak of a Sworn Brother of the Night’s Watch,  said the King-beyond-the-Wall.  One day on a ranging we brought down a fine big elk. We were skinning it when the smell of blood drew a shadowcat out of its lair. I drove it off, but not before it shredded my cloak to ribbons. Do you see? Here, here, and here?  He chuckled.  It shredded my arm and back as well, and I bled worse than the elk. My brothers feared I might die before they got me back to Maester Mullin at the Shadow Tower, so they carried me to a wildling village where we knew an old wisewoman did some healing. She was dead, as it happened, but her daughter saw to me. Cleaned my wounds, sewed me up, and fed me porridge and potions until I was strong enough to ride again. And she sewed up the rents in my cloak as well, with some scarlet silk from Asshai that her grandmother had pulled from the wreck of a cog washed up on the Frozen Shore. It was the greatest treasure she had, and her gift to me.  He swept the cloak back over his shoulders.  But at the Shadow Tower, I was given a new wool cloak from stores, black and black, and trimmed with black, to go with my black breeches and black boots, my black doublet and black mail. The new cloak had no frays nor rips nor tears… and most of all, no red. The men of the Night’s Watch dressed in black, Ser Denys Mallister reminded me sternly, as if I had forgotten. My old cloak was fit for burning now, he said.   I left the next morning… for a place where a kiss was not a crime, and a man could wear any cloak he chose."
}