{
  "id": "7f5921f154f770152b07a523536fd5d4e99cba9e",
  "text": "  They are my children, she told herself, and if the maegi spoke truly, they are the only children I am ever like to have.  Viserion’s scales were the color of fresh cream, his horns, wing bones, and spinal crest a dark gold that flashed bright as metal in the sun. Rhaegal was made of the green of summer and the bronze of fall. They soared above the ships in wide circles, higher and higher, each trying to climb above the other.  Dragons always preferred to attack from above, Dany had learned. Should either get between the other and the sun, he would fold his wings and dive screaming, and they would tumble from the sky locked together in a tangled scaly ball, jaws snapping and tails lashing. The first time they had done it, she feared that they meant to kill each other, but it was only sport. No sooner would they splash into the sea than they would break apart and rise again, shrieking and hissing, the salt water steaming off them as their wings clawed at the air. Drogon was aloft as well, though not in sight; he would be miles ahead, or miles behind, hunting.  He was always hungry, her Drogon. Hungry and growing fast. Another year, or perhaps two, and he may be large enough to ride. Then I shall have no need of ships to cross the great salt sea.  But that time was not yet come. Rhaegal and Viserion were the size of small dogs, Drogon only a little larger, and any dog would have outweighed them; they were all wings and neck and tail, lighter than they looked. And so Daenerys Targaryen must rely on wood and wind and canvas to bear her home.  The wood and the canvas had served her well enough so far, but the fickle wind had turned traitor. For six days and six nights they had been becalmed, and now a seventh day had come, and still no breath of air to fill their sails. Fortunately, two of the ships that Magister Illyrio had sent after her were trading galleys, with two hundred oars apiece and crews of strong-armed oarsmen to row them. But the great cog Balerion was a song of a different key; a ponderous broad-beamed sow of a ship with immense holds and huge sails, but helpless in a calm. Vhagar and Meraxes had let out lines to tow her, but it made for painfully slow going. All three ships were crowded, and heavily laden.   I cannot see Drogon,  said Ser Jorah Mormont as he joined her on the forecastle.  Is he lost again?    We are the ones who are lost, ser. Drogon has no taste for this wet creeping, no more than I do.  Bolder than the other two, her black dragon had been the first to try his wings above the water, the first to flutter from ship to ship, the first to lose himself in a passing cloud… and the first to kill. The flying fish no sooner broke the surface of the water than they were enveloped in a lance of flame, snatched up, and swallowed.  How big will he grow?  Dany asked curiously.  Do you know?    In the Seven Kingdoms, there are tales of dragons who grew so huge that they could pluck giant krakens from the seas.   Dany laughed.  That would be a wondrous sight to see.    It is only a tale, Khaleesi,  said her exile knight.  They talk of wise old dragons living a thousand years as well.    Well, how long does a dragon live?  She looked up as Viserion swooped low over the ship, his wings beating slowly and stirring the limp sails.  Ser Jorah shrugged.  A dragon’s natural span of days is many times as long as a man’s, or so the songs would have us believe… but the dragons the Seven Kingdoms knew best were those of House Targaryen. They were bred for war, and in war they died. It is no easy thing to slay a dragon, but it can be done.   The squire Whitebeard, standing by the figurehead with one lean hand curled about his tall hardwood staff, turned toward them and said,  Balerion the Black Dread was two hundred years old when he died during the reign of Jaehaerys the Conciliator. He was so large he could swallow an aurochs whole. A dragon never stops growing, Your Grace, so long as he has food and freedom.  His name was Arstan, but Strong Belwas had named him Whitebeard for his pale whiskers, and most everyone called him that now. He was taller than Ser Jorah, though not so muscular; his eyes were a pale blue, his long beard as white as snow and as flne as silk.   Freedom?  asked Dany, curious.  What do you mean?    In King’s Landing, your ancestors raised an immense domed castle for their dragons. The Dragonpit, it is called. It still stands atop the Hill of Rhaenys, though all in ruins now. That was where the royal dragons dwelt in days of yore, and a cavernous dwelling it was, with iron doors so wide that thirty knights could ride through them abreast. Yet even so, it was noted that none of the pit dragons ever reached the size of their ancestors. The maesters say it was because of the walls around them, and the great dome above their heads.    If walls could keep us small, peasants would all be tiny and kings as large as giants,  said Ser Jorah.  I’ve seen huge men born in hovels, and dwarfs who dwelt in castles."
}