{
  "id": "7f60b3de3f1cefd389a5846dc6910975aad735b5",
  "text": " With a   shock  he realized that  this was the smoke  from  his  little cooking-fire,  which he had neglected to put out.       `That won't do! Never thought  it  would show like that! ' he muttered,  and  he started to hurry back. Suddenly he halted and listened. Had he heard  a whistle  or not? Or was  it the  call of some strange  bird?  If it was  a   whistle, it did  not  come from Frodo's direction. There it went again  from  another place! Sam began to run as well as he could uphill.       He found that a small brand, burning away to its outer end, had kindled  some  fern  at  the edge  of the fire,  and the fern blazing  up had set the  turves  smouldering.  Hastily he stamped  out  what  was left of  the  fire,   ####-scattered the ashes, and laid the turves on the hole.  Then he crept back to  Frodo.       'Did  you hear a whistle, and  what sounded like an answer? ' he asked.  `A few minutes back. I hope  it was  only a bird,  but it didn't  sound quite  like that: more like  somebody mimicking  a  bird-call, I  thought.  And I'm  afraid my bit of fire's been smoking. Now if I've gone  and brought trouble,  I'll never forgive myself. Nor won't have a chance, maybe! '       `Hush! ' whispered Frodo. `I thought I heard voices.'       The  two  hobbits  trussed their  small packs,  put  them  on ready for   flight,  and  then  crawled  deeper  into  the  fern.  There  they  crouched  listening.       There was no doubt of the voices. They were speaking low and furtively,   but they were near, and coming nearer. Then quite suddenly one spoke clearly  close at hand.       `Here! Here is where the smoke came from! ' it said. `'Twill be nigh at  hand. In the fern, no  doubt. We shall have it like  a coney in a trap. Then  we shall learn what kind of thing it is.'       `Aye, and what it knows! ' said a second voice.       At  once  four  men  came  striding  through  the  fern from  different  directions. Since flight and hiding  were no longer  possible, Frodo and Sam  sprang  to their  feet,  putting  back to back and whipping out  their small  swords.       If they were astonished at what they saw, their captors were even  more  astonished.  Four tall Men  stood there. Two  had spears in their hands with  broad  bright heads. Two  had great bows,  almost of their  own height,  and   great quivers of long green-feathered arrows. All had swords at their sides,   and were clad in green  and  brown of varied hues, as if the better  to walk   unseen in the glades of Ithilien. Green  gauntlets covered  their hands, and  their faces were hooded and  masked with green, except for their eyes, which  were very keen and bright. At once  Frodo thought of  Boromir, for these Men  were like him in stature and bearing, a nd in their manner of speech.       `We have  not found what we sought,' said one. `But what have we found?  '       'Not Orcs,' said another, releasing the hilt of his sword, which he had  seized when he saw the glitter of Sting in Frodo's hand.       `Elves? ' said a third, doubtfully.       `Nay! Not Elves,'  said the fourth, the tallest, and as it appeared the   ####-chief among them. `Elves do not  walk in Ithilien in these  days.  And Elves   are wondrous fair to look upon, or so 'tis said.'       'Meaning  we're not, I take you,' said Sam. `Thank you kindly. And when   you've finished discussing us,  perhaps you'll say who you are, and  why you   can't let two tired travellers rest.'       The tall  green man laughed grimly.  `I am Faramir, Captain of Gondor,'  he said. `But there are no travellers in this land: only the servants of the  Dark Tower, or of the White.'       `But  we are  neither,' said Frodo.  `And  travellers  we are, whatever   Captain Faramir may say.'       'Then make  haste to declare yourselves and your errand,' said Faramir.  'We  have  a  work  to  do,  and this is  no time or place  for riddling  or   parleying. Come! Where is the third of your company? '       `The third? '       'Yes, the skulking fellow that  we saw with his  nose in  the pool down  yonder. He had an ill-favoured look. Some spying breed of Orc, I guess, or a   creature of theirs. But he gave us the slip by some fox-trick.'       'I do not know where he is,' said Frodo. 'He is only a chance companion  met  upon our road; and I  am  not answerable for  him. If you  come on him,  spare  him. Bring him  or send him  to  us.  He is  only  a wretched gangrel  creature, but I have  him under my care for a while. But as for  us,  we are  Hobbits of the Shire,  far to  the North and West, beyond many rivers. Frodo  son of Drogo is my name, and with  me is  Samwise son  of Hamfast, a  worthy  hobbit in my  service.  We  have come  by long ways  --  out of Rivendell, or   Imladris as some call  it.'  Here  Faramir started  and grew  intent. 'Seven  companions we had: one we lost at Moria, the others we left  at  Parth Galen  above Rauros:  two of  my kin; a  Dwarf there was also,  and an Elf, and two   Men.  They were  Aragorn;  and Boromir, who said  that he came out of  Minas  Tirith, a city in the South."
}