{
  "id": "7f9072969f2cb805b6b9b2f3b0da0089eb2d4122",
  "text": "\"  \"What sort of animal --?\" Harry began, but Hermione cut him off.  \"That was still really dangerous! Running around in the dark with a werewolf! What if you'd given the others the slip, and bitten somebody?\"  \"A thought that still haunts me,\" said Lupin heavily. \"And there were near misses, many of them. We laughed about them afterwards. We were young, thoughtless -- carried away with our own cleverness.\"  I sometimes felt guilty about betraying Dumbledore's trust, of course... he had admitted me to Hogwarts when no other headmaster would have done so, and he had no idea I was breaking the rules he had set down for my own and others' safety. He never knew I had led three fellow students into becoming Animagi illegally. But I always managed to forget my guilty feelings every time we sat down to plan our next month's adventure. And I haven't changed...\"  Lupin's face had hardened, and there was self-disgust in his voice. \"All this year, I have been battling with myself, wondering whether I should tell Dumbledore that Sirius was an Animagus. But I didn't do it. Why? Because I was too cowardly. It would have meant admitting that I'd betrayed his trust while I was at school, admitting that I'd led others along with me... and Dumbledore's trust has meant everything to me. He let me into Hogwarts as a boy, and he gave me a job when I have been shunned all my adult life, unable to find paid work because of what I am. And so I convinced myself that Sirius was getting into the school using dark arts he learned from Voldemort, that being an Animagus had nothing to do with it... so, in a way, Snape's been right about me all along.\"  \"Snape?\" said Black harshly, taking his eyes off Scabbers; for the first time in minutes and looking up at Lupin. \"What's Snape got to do with it?\"  \"He's here, Sirius,\" said Lupin heavily. \"He's teaching here as well.\" He looked up at Harry, Ron, and Hermione.  \"Professor Snape was at school with us. He fought very hard against my appointment to the Defense Against the Dark Arts job. He has been telling Dumbledore A year that I am not to be trusted. He has his reasons... you see, Sirius here played a trick on him which nearly killed him, a trick which involved me --\"  Black made a derisive noise.  \"It served him right,\" he sneered. \"Sneaking around, trying to find out what we were up to... hoping he could get us expelled....\"  \"Severus was very interested in where I went every month.\" Lupin told Harry, Ron, and Hermione. \"We were in the same year, you know, and we -- er -- didn't like each other very much. He especially disliked James. Jealous, I think, of James's talent on the Quidditch field... anyway Snape had seen me crossing the grounds with Madam Pomfrey one evening as she led me toward the Whomping Willow to transform. Sirius thought it would be -- er -- amusing, to tell Snape all he had to do was prod the knot on the tree trunk with a long stick, and he'd be able to get in after me. Well, of course, Snape tried it -- if he'd got as far as this house, he'd have met a fully grown werewolf -- but your father, who'd heard what Sirius had done, went after Snape and pulled him back, at great risk to his life... Snape glimpsed me, though, at the end of the tunnel. He was forbidden by Dumbledore to tell anybody, but from that time on he knew what I was....\"  \"So that's why Snape doesn't like you,\" said Harry slowly, \"because he thought you were in on the joke?\"  \"That's right,\" sneered a cold voice from the wall behind Lupin.  Severus Snape was pulling off the Invisibility Cloak, his wand pointing, directly at Lupin.  CHAPTER NINETEEN  THE SERVANT OF LORD VOLDEMORT  Hermione screamed. Black leapt to his feet. Harry felt as though he'd received a huge electric shock.  \"I found this at the base of the Whomping Willow,\" said Snape, throwing the cloak aside, careful to keep this wand pointing directly at Lupin's chest. \"Very useful, Potter, I thank you....\"  Snape was slightly breathless, but his face was full of suppressed triumph. \"You're wondering, perhaps, how I knew you were here?\" he said, his eyes glittering. \"I've just been to your office, Lupin. You forgot to take your potion tonight, so I took a gobletful along. And very lucky I did... lucky for me, I mean. Lying on your desk was a certain map. One glance at it told me all I needed to know. I saw you running along this passageway and out of sight.\"  \"Severus --\" Lupin began, but Snape overrode him.  \"I've told the headmaster again and again that you're helping your old friend Black into the castle, Lupin, and here's the proof. Not even I dreamed you would have the nerve to use this old place as your hideout --\"  \"Severus, you're making a mistake,\" said Lupin urgently. \"You haven't heard everything -- I can explain -- Sirius is not here to kill Harry --\"  \"Two more for Azkaban tonight,\" said Snape, his eyes now gleaming fanatically. \"I shall be interested to see how Dumbledore takes this.... He was quite convinced you were harmless, you know, Lupin."
}