{
  "id": "7f9818945be915023309ab862b39b3ed968affe1",
  "text": " \"Ask McGonagall, go on, Harry --\"  \"Yeah, I think I will,\" said Harry, making up his mind.  Hermione opened her mouth to argue, but at that moment Crookshanks leapt lightly onto her lap. A large, dead spider was dangling from his mouth.  \"Does he have to eat that in front of us?\" said Ron, scowling.  \"Clever Crookshanks, did you catch that all by yourself?\" said Hermione.  Crookshanks; slowly chewed up the spider, his yellow eyes fixed insolently on Ron.  \"Just keep him over there, that's all,\" said Ron irritably, turning back to his star chart. \"1've got Scabbers asleep in my bag.\"  Harry yawned. He really wanted to go to bed, but he still had his own star chart to complete. He pulled his bag toward him, took out parchment, ink, and quill, and started work.  \"You can copy mine, if you like,\" said Ron, labeling his last star with a flourish and shoving the chart toward Harry.  Hermione, who disapproved of copying, pursed her lips but didn't say anything. Crookshanks was still staring unblinkingly at Ron, flicking the end of his bushy tail. Then, without warning, he pounced.  \"OY!\" Ron roared, seizing his bag as Crookshanks sank four sets of claws deep inside it and began tearing ferociously. \"GET OFF, YOU STUPID ANIMAL!\"  Ron tried to pull the bag away from Crookshanks, but Crookshanks clung on, spitting and slashing.  \"Ron, don't hurt him!\" squealed Hermione; the whole common room was watching; Ron whirled the bag around, Crookshanks still clinging to it, and Scabbers came flying out of the top -  \"CATCH THAT CAR' Ron yelled as Crookshanks freed himself from the remnants of the bag, sprang over the table, and chased after the terrified Scabbers.  George Weasley made a lunge for Crookshanks but missed; Scabbers streaked through twenty pairs of legs and shot beneath an old chest of drawers. Crookshanks skidded to a halt, crouched low on his bandy legs, and started making furious swipes beneath it with his front paw.  Ron and Hermione hurried over; Hermione grabbed Crookshanks around the middle and heaved him away; Ron threw himself onto his stomach and, with great difficulty, pulled Scabbers out by the tail.  \"Look at him!\" he said furiously to Hermione, dangling Scabbers in front of her. \"He's skin and bone! You keep that cat away from him!\"  \"Crookshanks doesn't understand it's wrong!\" said Hermione, her voice shaking. \"All cats chase rats, Ron!\"  \"There's something funny about that animal!\" said Ron, who was trying to persuade a frantically wiggling Scabbers back into his pocket. \"It heard me say that Scabbers was in my bag!\"  \"Oh, what rubbish,\" said Hermione impatiently. \"Crookshanks could smell him, Ron, how else d'you think --\"  \"That cat's got it in for Scabbers!\" said Ron, 'ignoring the people around him, who were starting to giggle. \"And Scabbers was here first, and he's ill!\"  Ron marched through the common room and out of sight up the stairs to the boys' dormitories.  Ron was still in a bad mood with Hermione next day. He barely talked to her all through Herbology, even though he, Harry, and Hermione were working together on the same puffapod.  \"How's Scabbers?\" Hermione asked timidly as they stripped fat pink pods from the plants and emptied the shining beans into a wooden pail.  \"He's hiding at the bottom of my bed, shaking, \" said Ron angrily, missing the pail and scattering beans over the greenhouse floor.  \"Careful, Weasley, careful!\" cried Professor Sprout as the beans burst into bloom before their very eyes.  They had Transfiguration next. Harry, who had resolved to ask Professor McGonagall after the lesson whether he could go into Hogsmeade with the rest, joined the line outside the class trying to decide how he was going to argue his case. He was distracted, however, by a disturbance at the front of the line.  Lavender Brown seemed to be crying. Parvati had her arm around her and was explaining something to Seamus Finnigan and Dean Thomas, who were looking very serious.  \"What's the matter, Lavender?\" said Hermione anxiously as she, Harry, and Ron went to join the group.  \"She got a letter from home this morning,\" Parvati whispered. \"It's her rabbit, Binky. He's been killed by a fox.\"  \"Oh,\" said Hermione, \"I'm sorry, Lavender.\"  \"I should have known!\" said Lavender tragically. \"You know what day it is?\"  \"Er --\"  \"The sixteenth of October! 'That thing you're dreading, it will happen on the sixteenth of October!' Remember? She was right, she was right!\"  The whole class was gathered around Lavender now. Seamus shook his head seriously. Hermione hesitated; then she said, \"You -- you were dreading Binky being killed by a fox?\"  \"Well, not necessarily by a fox,\" said Lavender, looking up at Hermione with streaming eyes, \"but I was obviously dreading him dying, wasn't l?\"  \"Oh,\" said Hermione. She paused again. Then  \"Was Binky an old rabbit?\"  \"N -- no!\" sobbed Lavender. \"H -- he was only a baby!\"  Parvati tightened her arm around Lavender's shoulders.  \"But then, why would you dread him dying?\" said Hermione."
}