{
  "id": "7febde938d847b256f8c2d271889b1b93f4f5865",
  "text": " \"The very man. A girl has been snatched by the monster, Lockhart. Taken into the Chamber of Secrets itself. Your moment has come at last.\"  Lockhart blanched.  \"That's right, Gilderoy,\" chipped in Professor Sprout. \"Weren't you saying just last night that you've known all along where the entrance to the Chamber of Secrets is?\"  \"I - well, I -\"sputtered Lockhart.  \"Yes, didn't you tell me you were sure you knew what was inside it?\" piped up Professor Flitwick.  \"D-did I? I don't recall -\"  \"I certainly remember you saying you were sorry you hadn't had a crack at the monster before Hagrid was arrested,\" said Snape. \"Didn't you say that the whole affair had been bungled, and that you should have been given a free rein from the first?\"  Lockhart stared around at his stony-faced colleagues.  \"I - I really never - you may have misunderstood -\"  \"We'll leave it to you, then, Gilderoy,\" said Professor McGonagall. \"Tonight will be an excellent time to do it. We'll make sure everyone's out of your way. You'll be able to tackle the monster all by youself. A free rein at last.\"  Lockhart gazed desperately around him, but nobody came to the rescue. He didn't look remotely handsome anymore. His lip was trembling, and in the absence of his usually toothy grin, he looked weak-chinned and feeble.  \"V very well,\" he said. \"I'll - I'll be in my office, getting getting ready.\"  And he left the room.  \"Right,\" said Professor McGonagall, whose nostrils were flared,  \"that's got him out from under our feet. The Heads of Houses should go and inform their students what has happened. Tell them the Hogwarts Express will take them home first thing tomorrow. Will the rest of you please make sure no students have been left outside their dormitories.\"  The teachers rose and left, one by one.  It was probably the worst day of Harry's entire life. He, Ron, Fred, and George sat together in a corner of the Gryffindor common room, unable to say anything to each other. Percy wasn't there. He had gone to send an owl to Mr. and Mrs. Weasley, then shut himself up in his dormitory.  No afternoon ever lasted as long as that one, nor had Gryffindor Tower ever been so crowded, yet so quiet. Near sunset, Fred and George went up to bed, unable to sit there any longer.  \"She knew something, Harry,\" said Ron, speaking for the first time since they had entered the wardrobe in the staff room. \"That's why she was taken. It wasn't some stupid thing about Percy at all., She'd found out something about the Chamber of Secrets. That must be why she was -\" Ron rubbed his eyes frantically. \"I mean, she was a pure- blood. There can't be any other reason.\"  Harry could see the sun sinking, blood-red, below the skyline. This was the worst he had ever felt. If only there was something they could do. Anything.  \"Harry\" said Ron. \"D'you think there's any chance at all she's not - you know =\"  Harry didn't know what to say. He couldn't see how Ginny could still be alive.  \"D'you know what?\" said Ron. \"I think we should go and see  *295*  Lockhart. Tell him what we know. He's going to try and get into the Chamber. We can tell him where we think it is, and tell him it's a basilisk in there.\"  Because Harry couldn't think of anything else to do, and because he wanted to be doing something, he agreed. The Gryffindors around them were so miserable, and felt so sorry for the Weasleys, that nobody tried to stop them as they got up, crossed the room, and left through the portrait hole.  Darkness was falling as they walked down to Lockhart's office. There seemed to be a lot of activity going on inside it. They could hear scraping, thumps, and hurried footsteps.  Harry knocked and there was a sudden silence from inside. Then the door opened the tiniest crack and they saw one of Lockhart's eyes peering through it.  \"Oh - Mr. Potter - Mr. Weasley -\" he said, opening the door a bit wider. \"I'm rather busy at the moment - if you would be quick -\"  \"Professor, we've got some information for you,\" said Harry. \"We think it'll help you.\"  \"Er - well - it's not terribly -\" The side of Lockhart's face that they could see looked very uncomfortable. \"I mean - well all right -\"  He opened the door and they entered.  His office had been almost completely stripped. Two large trunks stood open on the floor. Robes, jade-green, lilac, midnightblue, had been hastily folded into one of them; books were jumbled untidily into the other. The photographs that had covered the walls were now crammed into boxes on the desk.  *296*  \"Are you going somewhere?\" said Harry.  \"Er, well, yes,\" said Lockhart, ripping a life-size poster of himself from the back of the door as he spoke and starting to roll it up. \"Urgent call - unavoidable - got to go -\"  \"What about my sister?\" said Ron jerkily.  \"Well, as to that - most unfortunate -\" said Lockhart, avoiding their eyes as he wrenched open a drawer and started emptying the contents into a bag. \"No one regrets more than I -\"  \"You're the Defense Against the Dark Arts teacher!\" said Harry."
}