{
  "id": "7ff30a869f8b106ce8324e873a3dc4e7cc513f2c",
  "text": " Quaro reached for an arakh that was not there as the blond man slammed him aside. He raced down the aisle. Dany heard the snap of Jhogo’s whip, saw the leather lick out and coil around the wineseller’s leg. The man sprawled face first in the dirt.  A dozen caravan guards had come running. With them was the master himself, Merchant Captain Byan Votyris, a diminutive Norvoshi with skin like old leather and a bristling blue mustachio that swept up to his ears. He seemed to know what had happened without a word being spoken.  Take this one away to await the pleasure of the khal,  he commanded, gesturing at the man on the ground. Two guards hauled the wineseller to his feet.  His goods I gift to you as well, Princess,  the merchant captain went on.  Small token of regret, that one of mine would do this thing.   Doreah and Jhiqui helped Dany back to her feet. The poisoned wine was leaking from the broken cask into the dirt.  How did you know?  she asked Ser Jorah, trembling.  How?    I did not know, Khaleesi, not until the man refused to drink, but once I read Magister Illyrio’s letter, I feared.  His dark eyes swept over the faces of the strangers in the market.  Come. Best not to talk of it here.   Dany was near tears as they carried her back. The taste in her mouth was one she had known before: fear. For years she had lived in terror of Viserys, afraid of waking the dragon. This was even worse. It was not just for herself that she feared now, but for her baby. He must have sensed her fright, for he moved restlessly inside her. Dany stroked the swell of her belly gently, wishing she could reach him, touch him, soothe him.  You are the blood of the dragon, little one,  she whispered as her litter swayed along, curtains drawn tight.  You are the blood of the dragon, and the dragon does not fear.   Under the hollow hummock of earth that was her home in Vaes Dothrak, Dany ordered them to leave her—all but Ser Jorah.  Tell me,  she commanded as she lowered herself onto her cushions.  Was it the Usurper?    Yes.  The knight drew out a folded parchment.  A letter to Viserys, from Magister Illyrio. Robert Baratheon offers lands and lordships for your death, or your brother’s.    My brother?  Her sob was half a laugh.  He does not know yet, does he? The Usurper owes Drogo a lordship.  This time her laugh was half a sob. She hugged herself protectively.  And me, you said. Only me?    You and the child,  Ser Jorah said, grim.   No. He cannot have my son.  She would not weep, she decided. She would not shiver with fear. The Usurper has woken the dragon now, she told herself… and her eyes went to the dragon’s eggs resting in their nest of dark velvet. The shifting lamplight limned their stony scales, and shimmering motes of jade and scarlet and gold swam in the air around them, like courtiers around a king.  Was it madness that seized her then, born of fear? Or some strange wisdom buried in her blood? Dany could not have said. She heard her own voice saying,  Ser Jorah, light the brazier.    Khaleesi?  The knight looked at her strangely.  It is so hot. Are you certain?   She had never been so certain.  Yes. I… I have a chill. Light the brazier.   He bowed.  As you command.   When the coals were afire, Dany sent Ser Jorah from her. She had to be alone to do what she must do. This is madness, she told herself as she lifted the black-and-scarlet egg from the velvet. It will only crack and burn, and it’s so beautiful, Ser Jorah will call me a fool if I ruin it, and yet, and yet…  Cradling the egg with both hands, she carried it to the fire and pushed it down amongst the burning coals. The black scales seemed to glow as they drank the heat. Flames licked against the stone with small red tongues. Dany placed the other two eggs beside the black one in the fire. As she stepped back from the brazier, the breath trembled in her throat.  She watched until the coals had turned to ashes. Drifting sparks floated up and out of the smokehole. Heat shimmered in waves around the dragon’s eggs. And that was all.  Your brother Rhaegar was the last dragon, Ser Jorah had said. Dany gazed at her eggs sadly. What had she expected? A thousand thousand years ago they had been alive, but now they were only pretty rocks. They could not make a dragon. A dragon was air and fire. Living flesh, not dead stone.  The brazier was cold again by the time Khal Drogo returned. Cohollo was leading a packhorse behind him, with the carcass of a great white lion slung across its back. Above, the stars were coming out. The khal laughed as he swung down off his stallion and showed her the scars on his leg where the hrakkar had raked him through his leggings.  I shall make you a cloak of its skin, moon of my life,  he swore.  When Dany told him what had happened at the market, all laughter stopped, and Khal Drogo grew very quiet.   This poisoner was the first,  Ser Jorah Mormont warned him,  but he will not be the last. Men will risk much for a lordship.   Drogo was silent for a time."
}