{
  "id": "807beab09723aba39c8f165b454818d4dbf56e7c",
  "text": " Any man with a thimble of sense will see it for a clumsy attempt to justify usurping the crown. Does Stannis offer proof? How could he, when it never happened?  Tyrion gave his sister his sweetest smile.   That’s so,  she had to say.  Still…    Your Grace, your brother has the right of this.  Petyr Baelish steepled his fingers.  If we attempt to silence this talk, we only lend it credence. Better to treat it with contempt, like the pathetic lie it is. And meantime, fight fire with fire.   Cersei gave him a measuring look.  What sort of fire?    A tale of somewhat the same nature, perhaps. But more easily believed. Lord Stannis has spent most of his marriage apart from his wife. Not that I fault him, I’d do the same were I married to Lady Selyse. Nonetheless, if we put it about that her daughter is baseborn and Stannis a cuckold, well… the smallfolk are always eager to believe the worst of their lords, particularly those as stern, sour, and prickly proud as Stannis Baratheon.    He has never been much loved, that’s true.  Cersei considered a moment.  So we pay him back in his own coin. Yes, I like this. Who can we name as Lady Selyse’s lover? She has two brothers, I believe. And one of her uncles has been with her on Dragonstone all this time…    Ser Axell Florent is her castellan.  Loath as Tyrion was to admit it, Littlefinger’s scheme had promise. Stannis had never been enamored of his wife, but he was bristly as a hedgehog where his honor was concerned and mistrustful by nature. If they could sow discord between him and his followers, it could only help their cause.  The child has the Florent ears, I’m told.   Littlefinger gestured languidly.  A trade envoy from Lys once observed to me that Lord Stannis must love his daughter very well, since he’d erected hundreds of statues of her all along the walls of Dragonstone. ‘My lord’ I had to tell him, ‘those are gargoyles.’  He chuckled.  Ser Axell might serve for Shireen’s father, but in my experience, the more bizarre and shocking a tale the more apt it is to be repeated. Stannis keeps an especially grotesque fool, a lackwit with a tattooed face.   Grand Maester Pycelle gaped at him, aghast.  Surely you do not mean to suggest that Lady Selyse would bring a fool into her bed?    You’d have to be a fool to want to bed Selyse Florent,  said Littlefinger.  Doubtless Patchface reminded her of Stannis. And the best lies contain within them nuggets of truth, enough to give a listener pause. As it happens, this fool is utterly devoted to the girl and follows her everywhere. They even look somewhat alike. Shireen has a mottled, half-frozen face as well.   Pycelle was lost.  But that is from the greyscale that near killed her as a babe, poor thing.    I like my tale better,  said Littlefinger,  and so will the smallfolk. Most of them believe that if a woman eats rabbit while pregnant, her child will be born with long floppy ears.   Cersei smiled the sort of smile she customarily reserved for Jaime.  Lord Petyr, you are a wicked creature.    Thank you, Your Grace.    And a most accomplished liar,  Tyrion added, less warmly. This one is more dangerous than I knew, he reflected.  Littlefinger’s grey-green eyes met the dwarf’s mismatched stare with no hint of unease.  We all have our gifts, my lord.   The queen was too caught up in her revenge to take note of the exchange.  Cuckolded by a halfwit fool! Stannis will be laughed at in every winesink this side of the narrow sea.    The story should not come from us,  Tyrion said,  or it will be seen for a self-serving lie.  Which it is, to be sure.  Once more Littlefinger supplied the answer.  Whores love to gossip, and as it happens I own a brothel or three. And no doubt Varys can plant seeds in the alehouses and pot-shops.    Varys,  Cersei said, frowning.  Where is Varys?    I have been wondering about that myself, Your Grace.    The Spider spins his secret webs day and night,  Grand Maester Pycelle said ominously.  I mistrust that one, my lords.    And he speaks so kindly of you.  Tyrion pushed himself off his chair. As it happened, he knew what the eunuch was about, but it was nothing the other councillors needed to hear.  Pray excuse me, my lords. Other business calls.   Cersei was instantly suspicious.  King’s business?    Nothing you need trouble yourself about.    I’ll be the judge of that.    Would you spoil my surprise?  Tyrion said.  I’m having a gift made for Joffrey. A little chain.    What does he need with another chain? He has gold chains and silver, more than he can wear. If you think for a moment you can buy Joff’s love with gifts—    Why, surely I have the king’s love, as he has mine. And this chain I believe he may one day treasure above all others.  The little man bowed and waddled to the door.  Bronn was waiting outside the council chambers to escort him back to the Tower of the Hand.  The smiths are in your audience chamber, waiting your pleasure,  he said as they crossed the ward.   Waiting my pleasure."
}