{
  "id": "810a1bfed8477e8539d40d0e4c5d6ad61d4858e8",
  "text": "       Tyrion   A horse whickered impatiently behind him, from amidst the ranks of gold cloaks drawn up across the road. Tyrion could hear Lord Gyles coughing as well. He had not asked for Gyles, no more than he’d asked for Ser Addam. Or Jalabhar Xho or any of the rest, but his lord father felt Doran Martell might take it ill if only a dwarf came out to escort him across the Blackwater.  Joffrey should have met the Dornishmen himself, he reflected as he sat waiting, but he would have mucked it up, no doubt. Of late the king had been repeating little jests about the Dornish that he’d picked up from Mace Tyrell’s men-atarms. How many Dornishmen does it take to shoe a horse? Nine. One to do the shoeing, and eight to lift the horse up. Somehow Tyrion did not think Doran Martell would find that amusing.  He could see their banners flying as the riders emerged from the green of the living wood in a long dusty column. From here to the river, only bare black trees remained, a legacy of his battle. Too many banners, he thought sourly, as he watched the ashes kick up under the hooves of the approaching horses, as they had beneath the hooves of the Tyrell van as it smashed Stannis in the flank. Martell’s brought half the lords of Dorne, by the look of it. He tried to think of some good that might come of that, and failed.  How many banners do you count?  he asked Bronn.  The sellsword knight shaded his eyes.  Eight… no, nine.   Tyrion turned in his saddle.  Pod, come up here. Describe the arms you see, and tell me which houses they represent.   Podrick Payne edged his gelding closer. He was carrying the royal standard, Joffrey’s great stag-and-lion, and struggling with its weight. Bronn bore Tyrion’s own banner, the lion of Lannister gold on crimson.  He’s getting taller, Tyrion realized as Pod stood in his stirrups for a better look. He’ll soon tower over me like all the rest. The lad had been making a diligent study of Dornish heraldry, at Tyrion’s command, but as ever he was nervous.  I can’t see. The wind is flapping them.    Bronn, tell the boy what you see.   Bronn looked very much the knight today, in his new doublet and cloak, the flaming chain across his chest.  A red sun on orange,  he called,  with a spear through its back.    Martell,  Podrick Payne said at once, visibly relieved.  House Martell of Sunspear, my lord. The Prince of Dorne.    My horse would have known that one,  said Tyrion dryly.  Give him another, Bronn.    There’s a purple flag with yellow balls.    Lemons?  Pod said hopefully.  A purple fleld strewn with lemons? For House Dalt? Of, of Lemonwood.    Might be. Next’s a big black bird on yellow. Something pink or white in its claws, hard to say with the banner flapping.    The vulture of Blackmont grasps a baby in its talons,  said Pod.  House Blackmont of Blackmont, ser.   Bronn laughed.  Reading books again? Books will ruin your sword eye, boy. I see a skull too. A black banner.    The crowned skull of House Manwoody, bone and gold on black.  Pod sounded more confident with every correct answer.  The Manwoodys of Kingsgrave.    Three black spiders?    They’re scorpions, ser. House Qorgyle of Sandstone, three scorpions black on red.    Red and yellow, a jagged line between.    The flames of Hellholt. House Uller.   Tyrion was impressed. The boy’s not half stupid, once he gets his tongue untied.  Go on, Pod,  he urged.  If you get them all, I’ll make you a gift.    A pie with red and black slices,  said Bronn.  There’s a gold hand in the middle.    House Allyrion of Godsgrace.    A red chicken eating a snake, looks like.    The Gargalens of Salt Shore. A cockatrice. Ser. Pardon. Not a chicken. Red, with a black snake in its beak.    Very good!  exclaimed Tyrion.  One more, lad.   Bronn scanned the ranks of the approaching Dornishmen.  The last’s a golden feather on green checks.    A golden quill, ser. Jordayne of the Tor.   Tyrion laughed.  Nine, and well done. I could not have named them all myself.  That was a lie, but it would give the boy some pride, and that he badly needed.  Martell brings some formidable companions, it would seem. Not one of the houses Pod had named was small or insignificant. Nine of the greatest lords of Dorne were coming up the kingsroad, them or their heirs, and somehow Tyrion did not think they had come all this way just to see the dancing bear. There was a message here. And not one I like. He wondered if it had been a mistake to ship Myrcella down to Sunspear.   My lord,  Pod said, a little timidly,  there’s no litter.   Tyrion turned his head sharply. The boy was right.   Doran Martell always travels in a litter,  the boy said.  A carved litter with silk hangings, and suns on the drapes.   Tyrion had heard the same talk. Prince Doran was past fifty, and gouty. He may have wanted to make faster time, he told himself. He may have feared his litter would make too tempting a target for brigands, or that it would prove too cumbersome in the high passes of the Boneway."
}