{
  "id": "8116985db8139d99fa2e72da2c177a6fe84b0aef",
  "text": " I am the rightful king, and your son no less a traitor than my brother here. His day will come as well.   The naked threat fanned her fury.  You are very free to name others traitor and usurper, my lord, yet how are you any different? You say you alone are the rightful king, yet it seems to me that Robert had two sons. By all the laws of the Seven Kingdoms, Prince Joffrey is his rightful heir, and Tornmen after him… and we are all traitors, however good our reasons.   Renly laughed.  You must forgive Lady Catelyn, Stannis. She’s come all the way down from Riverrun, a long way ahorse. I fear she never saw your little letter.    Joffrey is not my brother’s seed,  Stannis said bluntly.  Nor is Tommen. They are bastards. The girl as well. All three of them abominations born of incest.   Would even Cersei be so mad? Catelyn was speechless.   Isn’t that a sweet story, my lady?  Renly asked.  I was camped at Horn Hill when Lord Tarly received his letter, and I must say, it took my breath away.  He smiled at his brother.  I had never suspected you were so clever, Stannis. Were it only true, you would indeed be Robert’s heir.    Were it true? Do you name me a liar?    Can you prove any word of this fable?   Stannis ground his teeth.  Robert could never have known, Catelyn thought, or Cersei would have lost her head in an instant.  Lord Stannis,  she asked,  if you knew the queen to be guilty of such monstrous crimes, why did you keep silent?     I did not keep silent,  Stannis declared.  I brought my suspicions to Jon Arryn.    Rather than your own brother?    My brother’s regard for me was never more than dutiful,  said Stannis.  From me, such accusations would have seemed peevish and self-serving, a means of placing myself first in the line of succession. I believed Robert would be more disposed to listen if the charges came from Lord Arryn, whom he loved.    Ah,  said Renly.  So we have the word of a dead man.    Do you think he died by happenstance, you purblind fool? Cersei had him poisoned, for fear he would reveal her. Lord Jon had been gathering certain proofs—    —which doubtless died with him. How inconvenient.   Catelyn was remembering, fitting pieces together.  My sister Lysa accused the queen of killing her husband in a letter she sent me at Winterfell,  she admitted.  Later, in the Eyrie, she laid the murder at the feet of the queen’s brother Tyrion.   Stannis snorted.  If you step in a nest of snakes, does it matter which one bites you first?    All this of snakes and incest is droll, but it changes nothing. You may well have the better claim, Stannis, but I still have the larger army.  Renly’s hand slid inside his cloak. Stannis saw, and reached at once for the hilt of his sword, but before he could draw steel his brother produced… a peach.  Would you like one, brother?  Renly asked, smiling.  From Highgarden. You’ve never tasted anything so sweet, I promise you.  He took a bite. juice ran from the corner of his mouth.   I did not come here to eat fruit.  Stannis was fuming.   My lords!  Catelyn said.  We ought to be hammering out the terms of an alliance, not trading taunts.    A man should never refuse to taste a peach,  Renly said as he tossed the stone away.  He may never get the chance again. Life is short, Stannis. Remember what the Starks say. Winter is coming.  He wiped his mouth with the back of his hand.   I did not come here to be threatened, either.    Nor were you,  Renly snapped back.  When I make threats, you’ll know it. If truth be told, I’ve never liked you, Stannis, but you are my own blood, and I have no wish to slay you. So if it is Storm’s End you want, take it… as a brother’s gift. As Robert once gave it to me, I give it to you.    It is not yours to give. It is mine by rights.   Sighing, Renly half turned in the saddle.  What am I to do with this brother of mine, Brienne? He refuses my peach, he refuses my castle, he even shunned my wedding…    We both know your wedding was a mummer’s farce. A year ago you were scheming to make the girl one of Robert’s whores.    A year ago I was scheming to make the girl Robert’s queen,  Renly said,  but what does it matter? The boar got Robert and I got Margaery. You’ll be pleased to know she came to me a maid.    In your bed she’s like to die that way.    Oh, I expect I’ll get a son on her within the year. Pray, how many sons do you have, Stannis? Oh, yes—none.  Renly smiled innocently.  As to your daughter, I understand. If my wife looked like yours, I’d send my fool to service her as well.    Enough!  Stannis roared.  I will not be mocked to my face, do you hear me? I will not!  He yanked his longsword from its scabbard. The steel gleamed strangely bright in the wan sunlight, now red, now yellow, now blazing white. The air around it seemed to shimmer, as if from heat.  Catelyn’s horse whinnied and backed away a step, but Brienne moved between the brothers, her own blade in hand.  Put up your steel!  she shouted at Stannis.  Cersei Lannister is laughing herself breathless, Catelyn thought wearily."
}