{
  "id": "81f17a564b27cb9021fd320638a1da5f9099de4d",
  "text": "   Ser Jorah snorted.  That wineseller who tried to poison you was a clever man as well. Clever men hatch ambitious schemes.   Dany drew her legs up beneath the blanket.  You will protect me. You, and my bloodriders.    Four men? Khaleesi, you believe you know Illyrio Mopatis, very well. Yet you insist on surrounding yourself with men you do not know, like this puffed-up eunuch and the world’s oldest squire. Take a lesson from Pyat Pree and Xaro Xhoan Daxos.   He means well, Dany reminded herself. He does all he does for love.  It seems to me that a queen who trusts no one is as foolish as a queen who trusts everyone. Every man I take into my service is a risk, I understand that, but how am I to win the Seven Kingdoms without such risks? Am I to conquer Westeros with one exile knight and three Dothraki bloodriders?   His jaw set stubbornly.  Your path is dangerous, I will not deny that. But if you blindly trust in every liar and schemer who crosses it, you will end as your brothers did.   His obstinacy made her angry. He treats me like some child.  Strong Belwas could not scheme his way to breakfast. And what lies has Arstan Whitebeard told me?    He is not what he pretends to be. He speaks to you more boldly than any squire would dare.    He spoke frankly at my command. He knew my brother.    A great many men knew your brother. Your Grace, in Westeros the Lord Commander of the Kingsguard sits on the small council, and serves the king with his wits as well as his steel. If I am the first of your Queensguard, I pray you, hear me out. I have a plan to put to you.    What plan? Tell me.    Illyrio Mopatis wants you back in Pentos, under his roof. Very well, go to him… but in your own time, and not alone. Let us see how loyal and obedient these new subjects of yours truly are. Command Groleo to change course for Slaver’s Bay.   Dany was not certain she liked the sound of that at all. Everything she’d ever heard of the flesh marts in the great slave cities of Yunkai, Meereen, and Astapor was dire and frightening.  What is there for me in Slaver’s Bay?    An army,  said Ser Jorah.  If Strong Belwas is so much to your liking you can buy hundreds more like him out of the fighting pits of Meereen… but it is Astapor I’d set my sails for. In Astapor you can buy Unsullied.    The slaves in the spiked bronze hats?  Dany had seen Unsullied guards in the Free Cities, posted at the gates of magisters, archons, and dynasts.  Why should I want Unsullied? They don’t even ride horses, and most of them are fat.    The Unsullied you may have seen in Pentos and Myr were household guards. That’s soft service, and eunuchs tend to plumpness in any case. Food is the only vice allowed them. To judge all Unsullied by a few old household slaves is like judging all squires by Arstan Whitebeard, Your Grace. Do you know the tale of the Three Thousand of Qohor?    No.  The coverlet slipped off Dany’s shoulder, and she tugged it back into place.   It was four hundred years ago or more, when the Dothraki first rode out of the east, sacking and burning every town and city in their path. The khal who led them was named Temmo. His khalasar was not so big as Drogo’s, but it was big enough. Fifty thousand, at the least. Half of them braided warriors with bells ringing in their hair.   The Qohorik knew he was coming. They strengthened their walls, doubled the size of their own guard, and hired two free companies besides, the Bright Banners and the Second Sons. And almost as an afterthought, they sent a man to Astapor to buy three thousand Unsullied. It was a long march back to Qohor, however, and as they approached they saw the smoke and dust and heard the distant din of battle.   By the time the Unsullied reached the city the sun had set. Crows and wolves were feasting beneath the walls on what remained of the Qohorik heavy horse. The Bright Banners and Second Sons had fled, as sellswords are wont to do in the face of hopeless odds. With dark falling, the Dothraki had retired to their own camps to drink and dance and feast, but none doubted that they would return on the morrow to smash the city gates, storm the walls, and rape, loot, and slave as they pleased.   But when dawn broke and Temmo and his bloodriders led their khalasar out of camp, they found three thousand Unsullied drawn up before the gates with the Black Goat standard flying over their heads. So small a force could easily have been flanked, but you know Dothraki. These were men on foot, and men on foot are fit only to be ridden down.   The Dothraki charged. The Unsullied locked their shields, lowered their spears, and stood firm. Against twenty thousand screamers with bells in their hair, they stood firm.   Eighteen times the Dothraki charged, and broke themselves on those shields and spears like waves on a rocky shore. Thrice Temmo sent his archers wheeling past and arrows fell like rain upon the Three Thousand, but the Unsullied merely lifted their shields above their heads until the squall had passed."
}