{
  "id": "82434f91eb8975369a29a6060d7c01b81465cc21",
  "text": "  Get out of my sight.   It took all the courage Sam had left in him to say,  W-what if there was someone else? Could you s-support someone else?    Who? Bowen Marsh? The man counts spoons. Othell’s a follower, does what he’s told and does it well, but no more’n that. Slynt… well, his men like him, I’ll grant you, and it would almost be worth it to stick him down the royal craw and see if Stannis gagged, but no. There’s too much of King’s Landing in that one. A toad grows wings and thinks he’s a bloody dragon.  Pyke laughed.  Who does that leave, Hobb? We could pick him, I suppose, only then who’s going to boil your mutton, Slayer? You look like a man who likes his bloody mutton.   There was nothing more to say. Defeated, Sam could only stammer out his thanks and take his leave. I will do better with Ser Denys, he tried to tell himself as he walked through the castle. Ser Denys was a knight, highborn and well-spoken, and he had treated Sam most courteously when he’d found him and Gilly on the road. Ser Denys will listen to me, he has to.  The commander of the Shadow Tower had been born beneath the Booming Tower of Seagard, and looked every inch a Mallister. Sable trimmed his collar and accented the sleeves of his black velvet doublet. A silver eagle fastened its claws in the gathered folds of his cloak. His beard was white as snow, his hair was largely gone, and his face was deeply lined, it was true. Yet he still had grace in his movements and teeth in his mouth, and the years had dimmed neither his blue-grey eyes nor his courtesy.   My lord of Tarly,  he said, when his steward brought Sam to him in the Lance, where the Shadow Tower men were staying.  I am pleased to see that you’ve recovered from your ordeal. Might I offer you a cup of wine? Your lady mother is a Florent, I recall. One day I must tell you about the time I unhorsed both of your grandfathers in the same tourney. Not today, though, I know we have more pressing concerns. You come from Maester Aemon, to be sure. Does he have counsel to offer me?   Sam took a sip of wine, and chose his words with care.  A maester chained and sworn… it would not be proper for him to be seen as having influenced the choice of Lord Commander…   The old knight smiled.  Which is why he has not come to me himself. Yes, I quite understand, Samwell. Aemon and I are both old men, and wise in such matters. Say what you came to say.   The wine was sweet, and Ser Denys listened to Sam’s plea with grave courtesy, unlike Cotter Pyke. But when he was done, the old knight shook his head.  I agree that it would be a dark day in our history if a king were to name our Lord Commander. This king especially. He is not like to keep his crown for long. But truly, Samwell, it ought to be Pyke who withdraws. I have more support than he does, and I am better suited to the office.    You are,  Sam agreed,  but Cotter Pyke might serve. It’s said he has oft proved himself in battle.  He did not mean to offend Ser Denys by praising his rival, but how else could he convince him to withdraw?   Many of my brothers have proved themselves in battle. It is not enough. Some matters cannot be settled with a battleaxe. Maester Aemon will understand that, though Cotter Pyke does not. The Lord Commander of the Night’s Watch is a lord, first and foremost. He must be able to treat with other lords… and with kings as well. He must be a man worthy of respect.  Ser Denys leaned forward.  We are the sons of great lords, you and I. We know the importance of birth, blood, and that early training that can ne’er be replaced. I was a squire at twelve, a knight at eighteen, a champion at two-and-twenty. I have been the commander at the Shadow Tower for thirty-three years. Blood, birth, and training have fitted me to deal with kings. Pyke… well, did you hear him this morning, asking if His Grace would wipe his bottom? Samwell, it is not my habit to speak unkindly of my brothers, but let us be frank… the ironborn are a race of pirates and thieves, and Cotter Pyke was raping and murdering when he was still half a boy. Maester Harmune reads and writes his letters, and has for years. No, loath as I am to disappoint Maester Aemon, I could not in honor stand aside for Pyke of Eastwatch.   This time Sam was ready.  Might you for someone else? If it was someone more suitable?   Ser Denys considered a moment.  I have never desired the honor for its own sake. At the last choosing, I stepped aside gratefully when Lord Mormont’s name was offered, just as I had for Lord Qorgyle at the choosing before that. So long as the Night’s Watch remains in good hands, I am content. But Bowen Marsh is not equal to the task, no more than Othell Yarwyck. And this so-called Lord of Harrenhal is a butcher’s whelp upjumped by the Lannisters. Small wonder he is venal and corrupt.    There’s another man,  Sam blurted out.  Lord Commander Mormont trusted him. So did Donal Noye and Qhorin Halfhand. Though he’s not as highly born as you, he comes from old blood."
}