{
  "id": "824633ec0d94e0f3e3df9999a7e545600f751b1b",
  "text": "  \"Maybe he's left,\" said Ha-rry, \"because he missed out on the Defense Against Dark Arts job again!\"  \"Or he might have been sacked!\" said Ron enthusiastically. \"I mean, everyone hates him -\"  \"Or maybe,\" said a very cold voice right behind them, \"he's waiting to hear why you two didn't arrive on the school train.\"  Harry spun around. There, his black robes rippling in a cold breeze, stood Severus Snape. He was a thin man with sallow skin, a hooked nose, and greasy, shoulder-length black hair, and at this moment, he was smiling in a way that told Harry he and Ron were in very deep trouble.  \"Follow me,\" said Snape.  Not daring even to look at each other, Harry and Ron followed Snape up the steps into the vast, echoing entrance hall, which was lit with flaming torches. A delicious smell of food was wafting from the Great Hall, but Snape led them away from the warmth and light, down a narrow stone staircase that led into the dungeons.  \"In!\" he said, opening a door halfway down the cold passageway and pointing.  They entered Snape's office, shivering. The shadowy walls were lined with shelves of large glass) ars, in which floated all manner of revolting things Harry didn't really want to know the name of at the moment. The fireplace was dark and empty. Snape closed the door and turned to look at them.  \"So,\" he said softly, \"the train isn't good enough for the famous Harry Potter and his faithful sidekick Weasley. Wanted to arrive with a bang, did we, boys?\"  \"No, sir, it was the barrier at King's Cross, it -\"  78  \"Silence!\" said Snape coldly. \"What have you done with the car?\" Ron gulped. This wasn't the first time Snape had given Harry the impression of being able to read minds. But a moment later, he un derstood, as Snape unrolled today's issue of the Evening Prophet. \"You were seen,\" he hissed, showing them the headline: FLY ING FORD ANGLIA MYSTIFIES MUGGLES. He began to read aloud: \"Two Muggles in London, convinced they saw an old car flying over the Post Office tower ... at noon in Norfolk, Mrs. Hetty Bayliss, while hanging out her washing ... Mr. Angus Fleet, of Peebles, reported to police ... Six or seven Muggles in all. I be lieve your father works in the Misuse of Muggle Artifacts Office?\" he said, looking up at Ron and smiling still more nastily. \"Dear, dear ... his own son. . . \" Harry felt as though he'd just been walloped in the stomach by one of the mad tree's larger branches. If anyone found out Mr. Weasley had bewitched the car ... he hadn't thought of that .... \"I noticed, in my search of the park, that considerable damage seems to have been done to a very valuable Whomping Willow,\" Snape went on. \"That tree did more damage to us than we -\" Ron blurted out. \"Silence!\" snapped Snape again. \"Most unfortunately, you are not in my House and the decision to expel you does not rest with me. I shall go and fetch the people who do have that happy power. You will wait here.\" Harry and Ron stared at each other, white-faced. Harry didn't feel hungry any more. He now felt extremely sick. He tried not to look at a large, slimy something suspended in green liquid on a  shelf behind Snape's desk. If Snape had gone to fetch Professor McGonagall, head of Gryffindor House, they were hardly any better off. She might be fairer than Snape, but she was still extremely strict.  Ten minutes later, Snape returned, and sure enough it was Professor McGonagall who accompanied him. Harry had seen Professor McGonagall angry on several occasions, but either he had forgotten just how thin her mouth could go, or he had never seen her this angry before. She raised her wand the moment she entered; Harry and Ron both flinched, but she merely pointed it at the empty fireplace, where flames suddenly erupted.  \"Sit,\" she said, and they both backed into chairs by the fire.  \"Explain,\" she said, her glasses glinting ominously.  Ron launched into the story, starting with the barrier at the station refusing to let them through.  \"  -so we had no choice, Professor, we couldn't get on the train.\"  \"Why didn't you send us a letter by owl? I believe you have an owl?\" Professor McGonagall said coldly to Harry.  Harry gaped at her. Now she said it, that seemed the obvious thing to have done.  \"I - I didn't think -\"  \"That,\" said Professor McGonagall, \"is obvious.\"  There was a knock on the office door and Snape, now looking happier than ever, opened it. There stood the headmaster, Professor Dumbledore.  Harry's whole body went numb. Dumbledore was looking unusually grave. He stared down his very crooked nose at them, and  *80*  Harry suddenly found himself wishing he and Ron were still being beaten up by the Whomping Willow.  There was a long silence. Then Dumbledore said, \"Please explain why you did this.\"  It would have been better if he had shouted. Harry hated the disappointment in his voice. For some reason, he was unable to look Dumbledore in the eyes, and spoke instead to his knees. He told Dumbledore everything except that Mr. Weasley owned the bewitched car, making it sound as though he and Ron had happened to find a flying car parked outside the station."
}