{
  "id": "8258e56f8c209ce1f2daaf327cc3241639882570",
  "text": " And you had swom to protect him.    I know what I swore.    And what you did.  She loomed above him, six feet of freckled, frowning, horse-toothed disapproval.   Yes, and what you did as well. We’re both kingslayers here, if what I’ve heard is true.    I never harmed Renly. I’ll kill the man who says I did.    Best start with Cleos, then. And you’ll have a deal of killing to do after that, the way he tells the tale.    Lies. Lady Catelyn was there when His Grace was murdered, she saw. There was a shadow. The candles guttered and the air grew cold, and there was blood—    Oh, very good.  Jaime laughed.  Your wits are quicker than mine, I confess it. When they found me standing over my dead king, I never thought to say, ‘No, no, it wasn’t me, it was a shadow, a terrible cold shadow.’  He laughed again.  Tell me true, one kingslayer to another—did the Starks pay you to slit his throat, or was it Stannis? Had Renly spurned you, was that the way of it? Or perhaps your moon’s blood was on you. Never give a wench a sword when she’s bleeding.   For a moment Jaime thought Brienne might strike him. A step closer, and I’ll snatch that dagger from her sheath and bury it up her womb. He gathered a leg under him, ready to spring, but the wench did not move.  It is a rare and precious gift to be a knight,  she said,  and even more so a knight of the Kingsguard. It is a gift given to few, a gift you scorned and soiled.   A gift you want desperately, wench, and can never have.  I earned my knighthood. Nothing was given to me. I won a tourney mêlée at thirteen, when I was yet a squire. At fifteen, I rode with Ser Arthur Dayne against the Kingswood Brotherhood, and he knighted me on the battlefield. It was that white cloak that soiled me, not the other way around. So spare me your envy. It was the gods who neglected to give you a cock, not me.   The look Brienne gave him then was full of loathing. She would gladly hack me to pieces, but for her precious vow, he reflected. Good. I’ve had enough of feeble pieties and maidens’ judgments. The wench stalked off without saying a word. Jaime curled up beneath his cloak, hoping to dream of Cersei.  But when he closed his eyes, it was Aerys Targaryen he saw, pacing alone in his throne room, picking at his scabbed and bleeding hands. The fool was always cutting himself on the blades and barbs of the Iron Throne. Jaime had slipped in through the king’s door, clad in his golden armor, sword in hand. The golden armor, not the white, but no one ever remembers that. Would that I had taken off that damned cloak as well.  When Aerys saw the blood on his blade, he demanded to know if it was Lord Tywin’s.  I want him dead, the traitor. I want his head, you’ll bring me his head, or you’ll burn with all the rest. All the traitors. Rossart says they are inside the walls! He’s gone to make them a warm welcome. Whose blood? Whose?    Rossart’s,  answered Jaime.  Those purple eyes grew huge then, and the royal mouth drooped open in shock. He lost control of his bowels, turned, and ran for the Iron Throne. Beneath the empty eyes of the skulls on the walls, Jaime hauled the last dragonking bodily off the steps, squealing like a pig and smelling like a privy. A single slash across his throat was all it took to end it. So easy, he remembered thinking. A king should die harder than this. Rossart at least had tried to make a fight of it, though if truth be told he fought like an alchemist. Queer that they never ask who killed Rossart… but of course, he was no one, lowborn, Hand for a fortnight, just another mad fancy of the Mad King.  Ser Elys Westerling and Lord Crakehall and others of his father’s knights burst into the hall in time to see the last of it, so there was no way for Jaime to vanish and let some braggart steal the praise or blame. It would be blame, he knew at once when he saw the way they looked at him… though perhaps that was fear. Lannister or no, he was one of Aerys’s seven.   The castle is ours, ser, and the city,  Roland Crakehall told him, which was half true. Targaryen loyalists were still dying on the serpentine steps and in the armory, Gregor Clegane and Amory Lorch were scaling the walls of Maegor’s Holdfast, and Ned Stark was leading his northmen through the King’s Gate even then, but Crakehall could not have known that. He had not seemed surprised to find Aerys slain; Jaime had been Lord Tywin’s son long before he had been named to the Kingsguard.   Tell them the Mad King is dead,  he commanded.  Spare all those who yield and hold them captive.    Shall I proclaim a new king as well?  Crakehall asked, and Jaime read the question plain: Shall it be your father, or Robert Baratheon, or do you mean to try to make a new dragonking? He thought for a moment of the boy Viserys, fled to Dragonstone, and of Rhaegar’s infant son Aegon, still in Maegor’s with his mother. A new Targaryen king, and my father as Hand. How the wolves will howl, and the storm lord choke with rage. For a moment he was tempted, until he glanced down again at the body on the floor, in its spreading pool of blood."
}