{
  "id": "82c4eb7c6d9ebcc72636ca0fedb19e4b0f747201",
  "text": "  Lord Rickard defied me. Betrayed me. I have no choice but to condemn him. Gods know what the Karstark foot with Roose Bolton will do when they hear I’ve executed their liege for a traitor. Bolton must be warned.    Lord Karstark’s heir was at Harrenhal as well,  Ser Brynden reminded him.  The eldest son, the one the Lannisters took captive on the Green Fork.    Harrion. His name is Harrion.  Robb laughed bitterly.  A king had best know the names of his enemies, don’t you think?   The Blackfish looked at him shrewdly.  You know that for a certainty? That this will make young Karstark your enemy?    What else would he be? I am about to kill his father, he’s not like to thank me.    He might. There are sons who hate their fathers, and in a stroke you will make him Lord of Karhold.   Robb shook his head.  Even if Harrion were that sort, he could never openly forgive his father’s killer. His own men would turn on him. These are northmen, Uncle. The north remembers.    Pardon him, then,  urged Edmure Tully.  Robb stared at him in frank disbelief.  Under that gaze, Edmure’s face reddened.  Spare his life, I mean. I don’t like the taste of it any more than you, sire. He slew my men as well. Poor Delp had only just recovered from the wound Ser Jaime gave him. Karstark must be punished, certainly. Keep him in chains, say.    A hostage?  said Catelyn. It might be best…   Yes, a hostage!  Her brother seized on her musing as agreement.  Tell the son that so long as he remains loyal, his father will not be harmed. Otherwise… we have no hope of the Freys now, not if I offered to marry all Lord Walder’s daughters and carry his litter besides. If we should lose the Karstarks as well, what hope is there?    What hope…  Robb let out a breath, pushed his hair back from his eyes, and said,  We’ve had naught from Ser Rodrik in the north, no response from Walder Frey to our new offer, only silence from the Eyrie.  He appealed to his mother.  Will your sister never answer us? How many times must I write her? I will not believe that none of the birds have reached her.   Her son wanted comfort, Catelyn realized; he wanted to hear that it would be all right. But her king needed truth.  The birds have reached her. Though she may tell you they did not, if it ever comes to that. Expect no help from that quarter, Robb.   Lysa was never brave. When we were girls together, she would run and hide whenever she’d done something wrong. Perhaps she thought our lord father would forget to be wroth with her if he could not find her. It is no different now. She ran from King’s Landing for fear, to the safest place she knows, and she sits on her mountain hoping everyone will forget her.    The knights of the Vale could make all the difference in this war,  said Robb,  but if she will not fight, so be it. I’ve asked only that she open the Bloody Gate for us, and provide ships at Gulltown to take us north. The high road would be hard, but not so hard as fighting our way up the Neck. If I could land at White Harbor I could flank Moat Cailin and drive the ironmen from the north in half a year.    It will not happen, sire,  said the Blackfish.  Cat is right. Lady Lysa is too fearful to admit an army to the Vale. Any army. The Bloody Gate will remain closed.    The Others can take her, then,  Robb cursed, in a fury of despair.  Bloody Rickard Karstark as well. And Theon Greyjoy, Walder Frey, Tywin Lannister, and all the rest of them. Gods be good, why would any man ever want to be king? When everyone was shouting King in the North, King in the North, I told myself… swore to myself… that I would be a good king, as honorable as Father, strong, just, loyal to my friends and brave when I faced my enemies… now I can’t even tell one from the other. How did it all get so confused? Lord Rickard’s fought at my side in half a dozen battles. His sons died for me in the Whispering Wood. Tion Frey and Willem Lannister were my enemies. Yet now I have to kill my dead friends’ father for their sakes.  He looked at them all.  Will the Lannisters thank me for Lord Rickard’s head? Will the Freys?    No,  said Brynden Blackfish, blunt as ever.   All the more reason to spare Lord Rickard’s life and keep him hostage,  Edmure urged.  Robb reached down with both hands, lifted the heavy bronze-and-iron crown, and set it back atop his head, and suddenly he was a king again.  Lord Rickard dies.    But why?  said Edmure.  You said yourself—    I know what I said, Uncle. It does not change what I must do.  The swords in his crown stood stark and black against his brow.  In battle I might have slain Tion and Willem myself, but this was no battle. They were asleep in their beds, naked and unarmed, in a cell where I put them. Rickard Karstark killed more than a Frey and a Lannister. He killed my honor. I shall deal with him at dawn.   When day broke, grey and chilly, the storm had diminished to a steady, soaking rain, yet even so the godswood was crowded. River lords and northmen, highborn and low, knights and sellswords and stableboys, they stood amongst the trees to see the end of the night’s dark dance."
}