{
  "id": "82d08bf188cb4b486f15b7e19e98ed4d2953407d",
  "text": "\"  Then  Bilbo,  not  without  a  shudder,  not  without a glance of longing, handed the marvellous stone to Bard, and he held it in  his hand, as though dazed.  \"But how is it yours to give?\" he asked at last with an effort.  \"O  well!\"  said  the  hobbit  uncomfortably.  \"It  isn't  exactly;  but,  well,  I  am  willing  to  let  it  stand  against  all my claim, don't you know. I may be a burglar-or  so  they  say: personally  I never  really  felt  like one-but I am an honest one, I hope,  more  or  less.  Anyway  I  am  going  back  now,  and  the  dwarves  can  do  what  they  like to me. I hope you will find it useful.\"  The Elvenking looked at Bilbo with a new wonder.   \"Bilbo  Baggins!\"  he  said.  \"You  are  more  worthy  to  wear  the  armour  of  elf- princes  than  many  that  have  looked  more  comely  in  it.  But  I  wonder  if  Thorin  Oakenshield will see it so. I have more knowledge of dwarves  in general than you  have perhaps. I advise you to remain with us, and here you shall be honoured and  thrice welcome.\"  \"Thank you very much I am sure,\" said Bilbo with a bow. \"But I don't think I  ought to leave my friends like this, after all we have gone through together. And I  promised  to  wake  old  Bombur  at  midnight,  too!  Really  I  must  be  going,  and  quickly.\"  Nothing  they  could  say  would  stop  him;  so  an  escort  was  provided  for  him,  and  as  he  went  both  the  king  and  Bard  saluted  him  with  honour.  As  they  passed   ####-through  the  camp  an  old  man  wrapped  in  a  dark  cloak,  rose  from  a  tent  door  where he was sitting and came towards them.  \"Well  done!  Mr.  Baggins!\"  he  said,  clapping  Bilbo  on  the  back.  \"There  is  always more about you than anyone expects!\" It was Gandalf.  For the first time for many a day Bilbo was really delighted. But there was no  time for all the questions that he immediately wished to ask.  \"All  in  good  time!\"  said  Gandalf.  \"Things  are  drawing  towards  the  end  now,  unless  I  am  mistaken.  There  is  an  unpleasant  time  just  in  front  of  you;  but  keep  your heart up! You may  come  through  all  right. There  is news brewing  that  even  the ravens have not heard. Good night!\"  Puzzled  but  cheered.  Bilbo  hurried  on.  He  was  guided  to  a  safe  ford  and  set  across  dry,  and  then  he  said  farewell  to  the  elves  and  climbed  carefully  back  towards the Gate. Great weariness began to come over him; but it was well before  midnight when he  clambered up  the  rope  again  –  it was  still where he had  left  it.  He untied  it and hid  it, and  then he sat down on the wall and wondered anxiously  what would happen next.  At  midnight  he  woke  up  Bombur;  and  then  in  turn  rolled  himself  up  in  his  corner,  without  listening  to  old  dwarfs  thanks  (which  he  felt  he  had  hardly  earned).  He  was  soon  fast  asleep  forgetting  all  his  worries  till  the  morning.  As  matter of fact he was dreaming of eggs and bacon.   ####-<h4>Chapter 17</h4> <br>   The Clouds Burst     Next  day  the  trumpets  rang  early  in  the  camp. Soon  a  single  runner was  seen  hurrying  along  the  narrow  path.  At  a  distance  he  stood  and  hailed  them,  asking  whether Thorin would now listen to another embassy, since new tidings had come  to hand, and matters were changed.  \"That will be Dain!\" said Thorin when he heard. \"They will have got wind of  his  coming.  I  thought  that would  alter  their mood! Bid them come few in number  and weaponless, and I will hear,\" he called to the messenger.   About  midday  the  banners  of  the  Forest  and  the  Lake  were  seen  to  be  borne  forth  again.  A  company  of  twenty  was  approaching.  At  the  beginning  of  the  narrow  way  they  laid  aside  sword  and  spear,  and  came  on  towards  the  Gate.  Wondering, the dwarves saw that among them were both Bard and the Elvenking,  before whom an old man wrapped in cloak and hood bore a strong casket of iron- bound wood.  \"Hail Thorin!\" said Bard. \"Are you still of the same mind?\"  \"My mind does not change with the rising and setting of a few suns,\" answered  Thorin. \"Did you come to ask me idle questions? Still the elf-host has not departed  as  I  bade! Till  then  you  come  in  vain  to  bargain with me.\"  \"Is  there  then nothing  for which you would yield any of your gold?\"  \"Nothing that you or your friends have to offer.\"  \"What of the Arkenstone of Thrain?\" said he, and at the same moment the old  man  opened  the  casket  and  held  aloft  the  jewel.  The  light  leapt  from  his  hand,  bright and white in the morning.  Then Thorin was stricken dumb with amazement and confusion. No one spoke  for  a  long while. Thorin  at  length broke  the  silence,  and his voice was  thick with  wrath. \"That stone was my father's, and is mine,\" he said. \"Why should I purchase  my  own?\"  But  wonder  overcame  him  and  he  added:  \"But  how  came  you  by  the  heirloom of my house-if there is need to ask such a question of thieves?\"  \"We  are  not  thieves,\" Bard  answered."
}