{
  "id": "82ec168c41c546895b56c8dd1cd2cbcade94aef4",
  "text": "  Small Paul was big and powerful, but Sam still outweighed him, and the wights were clumsy, he had seen that on the Fist. The sudden shift sent Paul staggering back a step, and the living man and the dead one went crashing down together. The impact knocked one hand from Sam’s throat, and he was able to suck in a quick breath of air before the icy black fingers returned. The taste of blood filled his mouth. He twisted his neck around, looking for his knife, and saw a dull orange glow. The fire! Only ember and ashes remained, but still… he could not breathe, or think… Sam wrenched himself sideways, pulling Paul with him… his arms flailed against the dirt floor, groping, reaching, scattering the ashes, until at last they found something hot… a chunk of charred wood, smouldering red and orange within the black… his fingers closed around it, and he smashed it into Paul’s mouth, so hard he felt teeth shatter.  Yet even so the wight’s grip did not loosen. Sam’s last thoughts were for the mother who had loved him and the father he had failed. The longhall was spinning around him when he saw the wisp of smoke rising from between Paul’s broken teeth. Then the dead man’s face burst into flame, and the hands were gone.  Sam sucked in air, and rolled feebly away. The wight was burning, hoarfrost dripping from his beard as the flesh beneath blackened. Sam heard the raven shriek, but Paul himself made no sound. When his mouth opened, only flames came out. And his eyes… It’s gone, the blue glow is gone.  He crept to the door. The air was so cold that it hurt to breathe, but such a fine sweet hurt. He ducked from the longhall.  Gilly?  he called.  Gilly, I killed it. Gil—   She stood with her back against the weirwood, the boy in her arms. The wights were all around her. There were a dozen of them, a score, more… some had been wildlings once, and still wore skins and hides… but more had been his brothers. Sam saw Lark the Sisterman, Softfoot, Ryles. The wen on Chett’s neck was black, his boils covered with a thin film of ice. And that one looked like Hake, though it was hard to know for certain with half his head missing. They had torn the poor garron apart, and were pulling out her entrails with dripping red hands. Pale steam rose from her belly.  Sam made a whimpery sound.  It’s not fair…    Fair.  The raven landed on his shoulder.  Fair, far, fear.  It flapped its wings, and screamed along with Gilly. The wights were almost on her. He heard the dark red leaves of the weirwood rustling, whispering to one another in a tongue he did not know. The starlight itself seemed to stir, and all around them the trees groaned and creaked. Sam Tarly turned the color of curdled milk, and his eyes went wide as plates. Ravens! They were in the weirwood, hundreds of them, thousands, perched on the bone-white branches, peering between the leaves. He saw their beaks open as they screamed, saw them spread their black wings. Shrieking, flapping, they descended on the wights in angry clouds. They swarmed round Chett’s face and pecked at his blue eyes, they covered the Sisterman like flies, they plucked gobbets from inside Hake’s shattered head. There were so many that when Sam looked up, he could not see the moon.   Go,  said the bird on his shoulder.  Go, go, go.   Sam ran, puffs of frost exploding from his mouth. All around him the wights flailed at the black wings and sharp beaks that assailed them, falling in an eerie silence with never a grunt nor cry. But the ravens ignored Sam. He took Gilly by the hand and pulled her away from the weirwood.  We have to go.    But where?  Gilly hurried after him, holding her baby.  They killed our horse, how will we…    Brother!  The shout cut through the night, through the shrieks of a thousand ravens. Beneath the trees, a man muffled head to heels in mottled blacks and greys sat astride an elk.  Here,  the rider called. A hood shadowed his face.  He’s wearing blacks. Sam urged Gilly toward him. The elk was huge, a great elk, ten feet tall at the shoulder, with a rack of antlers near as wide. The creature sank to his knees to let them mount.  Here,  the rider said, reaching down with a gloved hand to pull Gilly up behind him. Then it was Sam’s turn.  My thanks,  he puffed. Only when he grasped the offered hand did he realize that the rider wore no glove. His hand was black and cold, with fingers hard as stone.      Arya   When they reached the top of the ridge and saw the river, Sandor Clegane reined up hard and cursed.  The rain was falling from a black iron sky, pricking the green and brown torrent with ten thousand swords. It must be a mile across, Arya thought. The tops of half a hundred trees poked up out the swirling waters, their limbs clutching for the sky like the arms of drowning men. Thick mats of sodden leaves choked the shoreline, and farther out in the channel she glimpsed something pale and swollen, a deer or perhaps a dead horse, moving swiftly downstream. There was a sound too, a low rumble at the edge of hearing, like the sound a dog makes just before he growls."
}