{
  "id": "830d9172955076d30d4653df88bb2915b22c5312",
  "text": " Every few feet he called again for Ghost, but the night wind was swirling amongst the trees and it drank the words. This is madness, he thought as he plunged deeper into the trees. He was about to turn back when he glimpsed a flash of white off ahead and to the right, back toward the hill. He jogged after it, cursing under his breath.  A quarter way around the Fist he chased the wolf before he lost him again. Finally he stopped to catch his breath amidst the scrub, thorns, and tumbled rocks at the base of the hill. Beyond the torchlight, the dark pressed close.  A soft scrabbling noise made him turn. Jon moved toward the sound, stepping carefully among boulders and thornbushes. Behind a fallen tree, he came on Ghost again. The direwolf was digging furiously, kicking up dirt.   What have you found?  Jon lowered the torch, revealing a rounded mound of soft earth. A grave, he thought. But whose?  He knelt, jammed the torch into the ground beside him. The soil was loose, sandy. Jon pulled it out by the fistful. There were no stones, no roots. Whatever was here had been put here recently. Two feet down, his fingers touched cloth. He had been expecting a corpse, fearing a corpse, but this was something else. He pushed against the fabric and felt small, hard shapes beneath, unyielding. There was no smell, no sign of graveworms. Ghost backed off and sat on his haunches, watching.  Jon brushed the loose soil away to reveal a rounded bundle perhaps two feet across. He jammed his fingers down around the edges and worked it loose. When he pulled it free, whatever was inside shifted and clinked. Treasure, he thought, but the shapes were wrong to be coins, and the sound was wrong for metal.  A length of frayed rope bound the bundle together. Jon unsheathed his dagger and cut it, groped for the edges of the cloth, and pulled. The bundle turned, and its contents spilled out onto the ground, glittering dark and bright. He saw a dozen knives, leaf-shaped spearheads, numerous arrowheads. Jon picked up a dagger blade, featherlight and shiny black, hiltless. Torchlight ran along its edge, a thin orange line that spoke of razor sharpness. Dragonglass. What the maesters call obsidian. Had Ghost uncovered some ancient cache of the children of the forest, buried here for thousands of years? The Fist of the First Men was an old place, only…  Beneath the dragonglass was an old warhorn, made from an auroch’s horn and banded in bronze. Jon shook the dirt from inside it, and a stream of arrowheads fell out. He let them fall, and pulled up a corner of the cloth the weapons had been wrapped in, rubbing it between his fingers. Good wool, thick, a double weave, damp but not rotted. It could not have been long in the ground. And it was dark. He seized a handful and pulled it close to the torch. Not dark. Black.  Even before Jon stood and shook it out, he knew what he had: the black cloak of a Sworn Brother of the Night’s Watch.      BRAN  Alebelly found him in the forge, working the bellows for Mikken.  Maester wants you in the turret, m’lord prince. There’s been a bird from the king.    From Robb?  Excited, Bran did not wait for Hodor, but let Alebelly carry him up the steps. He was a big man, though not so big as Hodor and nowhere near as strong. By the time they reached the maester’s turret he was red-faced and puffing. Rickon was there before them, and both Walder Freys as well.  Maester Luwin sent Alebelly away and closed his door.  My lords,  he said gravely,  we have had a message from His Grace, with both good news and ill. He has won a great victory in the west, shattering a Lannister army at a place named Oxcross, and has taken several castles as well. He writes us from Ashemark, formerly the stronghold of House Marbrand.   Rickon tugged at the maester’s robe.  Is Robb coming home?    Not just yet, I fear. There are battles yet to fight.    Was it Lord Tywin he defeated?  asked Bran.   No,  said the maester.  Ser Stafford Lannister commanded the enemy host. He was slain in the battle.   Bran had never even heard of Ser Stafford Lannister. He found himself agreeing with Big Walder when he said,  Lord Tywin is the only one who matters.    Tell Robb I want him to come home,  said Rickon.  He can bring his wolf home too, and Mother and Father.  Though he knew Lord Eddard was dead, sometimes Rickon forgot… willfully, Bran suspected. His little brother was stubborn as only a boy of four can be.  Bran was glad for Robb’s victory, but disquieted as well. He remembered what Osha had said the day that his brother had led his army out Of Winterfell. He’s marching the wrong way, the wildling woman had insisted.   Sadly, no victory is without cost.  Maester Luwin turned to the Walders.  My lords, your uncle Ser Stevron Frey was among those who lost their lives at Oxcross. He took a wound in the battle, Robb writes. It was not thought to be serious, but three days later he died in his tent, asleep.   Big Walder shrugged.  He was very old. Five-and-sixty, I think."
}