{
  "id": "8363ece79b1d7ba9ca23ffce4597c969f3ac417a",
  "text": "  He was wearing a long black cloak, and there was a bald patch at the back of his head.  Then he went out of sight again.  \"Where is Nagini?\" said the cold voice.  \"I -- I don't know, My Lord,\" said the first voice nervously.  \"She set out to explore the house, I think...\"  \"You will milk her before we retire, Wormtail,\" said the second voice.  \"I will need feeding in the night.  The journey has tired me greatly.\"  Brow furrowed, Frank inclined his good ear still closer to the door, listening very hard.  There was a pause, and then the man called Wormtail spoke again.  \"My Lord, may I ask how long we are going to stay here?\"  \"A week,\" said the cold voice.  \"Perhapse longer.  The place is moderately comfortable, and the plan cannot proceed yet.  It would be foolish to act before the Quidditch World Cup is over.\"  Frank inserted a gnarled finger into his ear and rotated it.  Owing, no doubt, to a buildup of earwax, he had heard the word \"Quidditch,\" which was not a word at all.  \"The -- the Quidditch World Cup, My Lord?\" said Wormtail.  (Frank dug his finger still more vigorously into his ear.)  \"Forgive me, but -- I do not understand -- why should we wait until the World Cup is over?\"  \"Because, fool, at this very moment wizards are pouring into the country from all over the world, and every meddler from the Ministry of Magic will be on duty, on the watch for signs of ususual activity, checking and double-checking identities.  They will be obsessed with security, lest the Muggles notice anything.  So we wait.\"  Frank stopped trying to clear out his ear.  He had distinctly heard the words \"Ministry of Magic,\" \"wizards,\" and \"Muggles.\"  Plainly, each of these expressions meant something secret, and Frank could think of only two sorts of people who would speak in code:  spies and criminals.  Frank tightened his hold on his walking stick once more, and listened more closely still.  \"Your Lordship is still determined, then?\"  Wormtail said quietly.  \"Certainly I am determined, Wormtail.\"  There was a note of menace in the cold voice now.  A slight pause followed -- and the Wormtail spoke, the words tumbling from him in a rush, as though he was forcing himself to say this before he lost his nerve.  \"It could be done without Harry Potter, My Lord.\"  Another pause, more protracted, and then --  \"Without Harry Potter?\" breathed the second voice softly.  \"I see...\"  \"My Lord, I do not say this out of concern for the boy!\"  said Wormtail, his voice rising squeakily.  \"The boy is nothing to me, nothing at all!  It is merely that if we were to use another witch or wizard -- any wizard -- the thing could be done so much more quickly!  If you allowed me to leave you for a short while -- you know that I can disguise myself most effectively -- I could be back here in as little as two days with a suitable person --\"  \"I could use another wizard,\" said the cold voice softly, \"that is true...\"  \"My Lord, it makes sense,\" said Wormtail, sounding thoroughly relieved now.  \"Laying hands on Harry Potter would be so difficult, he is so well protected --\"  \"And so you volunteer to go and fetch me a substitute?  I wonder...perhaps the task of nursing me has become wearisome for you, Wormtail?  Could this suggestion of abandoning the plan be nothing more than an attempt to desert me?\"  \"My Lord!  I -- I have no wish to leave you, none at all --\"  \"Do not lie to me!\"  hissed the second voice.  \"I can always tell, Wormtail!  You are regretting that you ever returned to me.  I revolt you.  I see you flinch when you look at me, feel you shudder when you touch me...\"  \"No!  My devotion to Your Lordship --\"  \"Your devotion is nothing more than cowardice.  You would not be here if you had anywhere else to go.  How am I to survive without you, when I need feeding every few hours?  Who is to milk Nagini?\"  \"But you seem so much stronger, My Lord --\"  \"Liar,\" breathed the second voice.  \"I am no stronger, and a few days alone would be enough to rob me of the little health I have regained under your clumsy care.  Silence!\"  Wormtail, who had been sputtering incoherently, fell silent at once.  For a few seconds, Frank could hear nothing but the fire crackling.  The the second man spoke once more, in a whisper that was almost a hiss.  \"I have my reasons for using the boy, as I have already explained to you, and I will use no other.  I have waited thirteen years.  A few more months will make no difference.  As for the protection surrounding the boy, I believe my plan will be effective.  All that is needed is a little courage from you, Wormtail -- courage you will find, unless you wish to feel the full extent of Lord Voldermort's wrath --\"  \"My Lord, I must speak!\"  said Wormtail, panic in his voice now.  \"All through our journey I have gone over the plan in my head -- My Lord, Bertha Jorkin's disappearance will not go unnoticed for long, and if we proceed, if I murder --\"  \"If?\"  whispered the second voice.  \"If?  If you follow the plan, Wormtail, the Ministry need never know that anyone else has died."
}