{
  "id": "844aa549ccffd41fc79de506a21c2e2b9c8e4138",
  "text": " Bilbo, sir,  and  dragons, and a  fiery mountain, and - and  Elves, sir. I listened because  I  couldn't help  myself, if you know what I mean. Lor bless  me, sir, but I do  love tales of  that sort. And  I believe  them  too,  whatever Ted may  say.  Elves,  sir! I  would dearly love  to see  them. Cou ldn't you take  me to see  Elves, sir, when you go?'       Suddenly Gandalf laughed. 'Come  inside!' he shouted,  and  putting out  both his arms he lifted the astonished Sam, shears, grass-clippings and all,  right through the window and stood him on the floor. 'Take you to see Elves,  eh?' he  said, eyeing Sam  closely, but with a smile flickering on his face.  'So you heard that Mr. Frodo is going away?'   ####-     'I  did,  sir.  And that's why I choked:  which  you heard seemingly. I  tried not to, sir, but it burst out of me: I was so upset.'       'It can't be  helped, Sam,' said  Frodo sadly. He had suddenly realized  that  flying  from the Shire  would mean  more painful partings than  merely  saying farewell  to  the familiar comforts of Bag End. 'I shall have to  go.  But' - and  here he looked  hard at Sam  - 'if you really care about me, you   will keep that dead secret. See? If you don't, if you even breathe a word of  what you've heard here, then  I  hope  Gandalf will turn you into a  spotted  toad and fill the garden full of grass-snakes.'       Sam fell on his knees,  trembling. 'Get  up, Sam!' said Gandalf. I have  thought of something better than  that. Something  to shut your  mouth,  and   punish you properly for listening. You shall go away with Mr. Frodo!'       'Me,  sir!' cried Sam, springing up like a dog invited for a walk.  'Me  go and see Elves and all! Hooray!' he shouted, and then burst into tears.      ####-   Chapter 3. Three is Company            'You ought to go quietly, and you ought to  go soon,' said Gandalf. Two  or three weeks had passed, and still Frodo made  no sign of getting ready to  go.       'I know. But it is difficult to do both,' he objected. If I just vanish  like Bilbo, the tale will be all over the Shire in no time.'       'Of course you mustn't vanish!' said Gandalf. 'That wouldn't do at all!  I said soon, not instantly. If  you can think of any way of slipping out  of  the  Shire  without  its  being generally known, it will  be  worth a little  delay. But you must not delay too long.'       'What  about the  autumn, on  or after  Our Birthday?' asked  Frodo. 'I   think I could probably make some arrangements by then.'       To tell the truth, he was very reluctant to start, now that it had come  to  the  point. Bag End seemed a more  desirable residence than  i t  had for  years, and he wanted to savour as much as he could of his last summer in the  Shire. When autumn came, he knew that part at least of his heart would think  more kindly  of journeying, as it always did at that season. He  had  indeed  privately made up his mind to leave on his  fiftieth birthday:  Bilbo's  one  hundred and twenty-eighth. It  seemed somehow the proper day on which to set  out and follow him. Following Bilbo was uppermost in his mind, and  the  one  thing  that made the thought  of leaving  bearable. He  thought as little as  possible about the Ring, and where it might lead him in  the end. But he did  not tell all his  thoughts to Gandalf. What the  wizard  guessed  was always  difficult to tell.       He looked at Frodo and smiled. 'Very well,' he said. 'I think that will  do -  but  it must not  be any  later. I  am getting  very anxious.  In  the  mean-while, do take care, and don't let out any hint of where you are going!   And  see  that Sam Gamgee does not talk. If he does, I really shall turn him  into a toad.'       'As for  where I am going,' said Frodo, 'it would be  difficult to give  that away, for I have no clear idea myself, yet.'       'Don't be absurd!' said Gandalf. 'I  am not warning you against leaving  an  address  at the post -office!  But you are leaving the  Shire   - and that  should not be known,  until you  are far away. And  you must go, or at least   ####-set  out,  either North,  South,  West  or East  -  and  the direction should  certainly not be known.'       'I have been so  taken up with the thoughts of leaving  Bag End, and of  saying  farewell, that I have  never even  considered  the  direction,' said  Frodo. 'For where am I to go? And by  what  shall I  steer? What is to be my   quest? Bilbo went to find a treasure, there and back aga in; but I go to lose  one, and not return, as far as I can see.'       'But you cannot  see very far,' said Gandalf. 'Neither can I. It may be  your task to find the Cracks of Doom; but that quest may be for others: I do  not know. At any rate you are not ready for that long road yet.'       'No  indeed!' said  Frodo.  'But  in the  meantime what course am I  to  lake?'       'Towards  danger; but not  too  rashly, nor too straight,' answered the  wizard. 'If you want my advice, make for Rivendell. That journey  should not  prove too  perilous, though the  Road is less easy than it was, and it  will  grow worse as the year fails."
}