{
  "id": "846824fc1b485f405c61f41b1a1fce9f1245701a",
  "text": " Where did that come from, with Bessa? Whenever he’d thought of her before, it had only been to remember the way she’d looked, dying. What was wrong with him? He could hardly breathe. Had he gone to sleep? He got to his knees, and something wet and cold touched his nose. Chett looked up.  Snow was falling.  He could feel tears freezing to his cheeks. It isn’t fair, he wanted to scream. Snow would ruin everything he’d worked for, all his careful plans. It was a heavy fall, thick white flakes coming down all about him. How would they find their food caches in the snow, or the game trail they meant to follow east? They won’t need Dywen nor Bannen to hunt us down neither, not if we’re tracking through fresh snow. And snow hid the shape of the ground, especially by night. A horse could stumble over a root, break a leg on a stone. We’re done, he realized. Done before we began. We’re lost. There’d be no lord’s life for the leechman’s son, no keep to call his own, no wives nor crowns. Only a wildling’s sword in his belly, and then an unmarked grave. The snow’s taken it all from me… the bloody snow…  Snow had ruined him once before. Snow and his pet pig.  Chett got to his feet. His legs were stiff, and the falling snowflakes turned the distant torches to vague orange glows. He felt as though he were being attacked by a cloud of pale cold bugs. They settled on his shoulders, on his head, they flew at his nose and his eyes. Cursing, he brushed them off. Samwell Tarly, he remembered. I can still deal with Ser Piggy. He wrapped his scarf around his face, pulled up his hood, and went striding through the camp to where the coward slept.  The snow was falling so heavily that he got lost among the tents, but finally he spotted the snug little windbreak the fat boy had made for himself between a rock and the raven cages. Tarly was buried beneath a mound of black wool blankets and shaggy furs. The snow was drifting in to cover him. He looked like some kind of soft round mountain. Steel whispered on leather faint as hope as Chett eased his dagger from its sheath. One of the ravens quorked.  Snow,  another muttered, peering through the bars with black eyes. The first added a  Snow  of its own. He edged past them, placing each foot carefully. He would clap his left hand down over the fat boy’s mouth to muffle his cries, and then…  Uuuuuuuhoooooooooo.  He stopped midstep, swallowing his curse as the sound of the horn shuddered through the camp, faint and far, yet unmistakable. Not now Gods be damned, not NOW! The Old Bear had hidden far-eyes in a ring of trees around the Fist, to give warning of any approach. Jarman Buckwell’s back from the Giant’s Stair, Chett figured, or Qhorin Halfhand from the Skirling Pass. A single blast of the horn meant brothers returning. If it was the Halfhand, Jon Snow might be with him, alive.  Sam Tarly sat up puffy-eyed and stared at the snow in confusion. The ravens were cawing noisily, and Chett could hear his dogs baying. Half the bloody camp’s awake. His gloved fingers clenched around the dagger’s hilt as he waited for the sound to die away. But no sooner had it gone than it came again, louder and longer.  Uuuuuuuuuuuuhooooooooooooooo.   Gods,  he heard Sam Tarly whimper. The fat boy lurched to his knees, his feet tangled in his cloak and blankets. He kicked them away and reached for a chainmail hauberk he’d hung on the rock nearby. As he slipped the huge tent of a garment down over his head and wriggled into it, he spied Chett standing there.  Was it two?  he asked.  I dreamed I heard two blasts…    No dream,  said Chett.  Two blasts to call the Watch to arms. Two blasts for foes approaching. There’s an axe out there with Piggy writ on it, fat boy. Two blasts means wildlings.  The fear on that big moon face made him want to laugh.  Bugger them all to seven hells. Bloody Harma. Bloody Mance Rayder. Bloody Smallwood, he said they wouldn’t be on us for another—   Uuuuuuuuuuuuuuuhooooooooooooooooooooooooo.  The sound went on and on and on, until it seemed it would never die. The ravens were flapping and screaming, flying about their cages and banging off the bars, and all about the camp the brothers of the Night’s Watch were rising, donning their armor, buckling on swordbelts, reaching for battleaxes and bows. Samwell Tarly stood shaking, his face the same color as the snow that swirled down all around them.  Three,  he squeaked to Chett,  that was three, I heard three. They never blow three. Not for hundreds and thousands of years. Three means—    —Others.  Chett made a sound that was half a laugh and half a sob, and suddenly his smallclothes were wet, and he could feel the piss running down his leg, see steam rising off the front of his breeches.      Jaime   An east wind blew through his tangled hair, as soft and fragrant as Cersei’s fingers. He could hear birds singing, and feel the river moving beneath the boat as the sweep of the oars sent them toward the pale pink dawn. After so long in darkness, the world was so sweet that Jaime Lannister felt dizzy."
}