{
  "id": "846c46dc5bba4e5f7c8ed1a6bfa0c55441243ba9",
  "text": " He had time to make a small thick gasp before the blood came gushing out of his throat.   Your Gr—no!  cried Brienne the Blue when she saw that evil flow, sounding as scared as any little girl. The king stumbled into her arms, a sheet of blood creeping down the front of his armor, a dark red tide that drowned his green and gold. More candles guttered out. Renly tried to speak, but he was choking on his own blood. His legs collapsed, and only Brienne’s strength held him up. She threw back her head and screamed, wordless in her anguish.  The shadow. Something dark and evil had happened here, she knew, something that she could not begin to understand. Renly never cast that shadow. Death came in that door and blew the life out of him as swift as the wind snuffed out his candles.  Only a few instants passed before Robar Royce and Emmon Cuy came bursting in, though it felt like half the night. A pair of men-at-arms crowded in behind with torches. When they saw Renly in Brienne’s arms, and her drenched with the king’s blood, Ser Robar gave a cry of horror.  Wicked woman!  screamed Ser Emmon, he of the sunflowered steel.  Away from him, you vile creature!    Gods be good, Brienne, why?  asked Ser Robar.  Brienne looked up from her king’s body. The rainbow cloak that hung from her shoulders had turned red where the king’s blood had soaked into the cloth.  I… I…    You’ll die for this.  Ser Emmon snatched up a long-handled battleaxe from the weapons piled near the door.  You’ll pay for the king’s life with your own!    NO!  Catelyn Stark screamed, finding her voice at last, but it was too late, the blood madness was on them, and they rushed forward with shouts that drowned her softer words.  Brienne moved faster than Catelyn would have believed. Her own sword was not to hand, so she snatched Renly’s from its scabbard and raised it to catch Emmon’s axe on the downswing. A spark flashed blue-white as steel met steel with a rending crash, and Brienne sprang to her feet, the body of the dead king thrust rudely aside. Ser Emmon stumbled over it as he tried to close, and Brienne’s blade sheared through the wooden haft to send his axehead spinning. Another man thrust a flaming torch at her back, but the rainbow cloak was too sodden with blood to burn. Brienne spun and cut, and torch and hand went flying. Flames crept across the carpet. The maimed man began to scream. Ser Emmon dropped the axe and fumbled for his sword. The second man-at-arms lunged, Brienne parried, and their swords danced and clanged against each other. When Emmon Cuy came wading back in, Brienne was forced to retreat, yet somehow she held them both at bay. On the ground, Renly’s head rolled sickeningly to one side, and a second mouth yawned wide, the blood coming from him now in slow pulses.  Ser Robar had hung back, uncertain, but now he was reaching for his hilt.  Robar, no, listen.  Catelyn seized his arm.  You do her wrong, it was not her. Help her! Hear me, it was Stannis.  The name was on her lips before she could think how it got there, but as she said it, she knew that it was true.  I swear it, you know me, it was Stannis killed him.   The young rainbow knight stared at this madwoman with pale and frightened eyes.  Stannis? How?    I do not know. Sorcery, some dark magic, there was a shadow, a shadow.  Her own voice sounded wild and crazed to her, but the words poured out in a rush as the blades continued to clash behind her.  A shadow with a sword, I swear it, I saw. Are you blind, the girl loved him! Help her!  She glanced back, saw the second guardsman fall, his blade dropping from limp fingers. Outside there was shouting. More angry men would be bursting in on them any instant, she knew.  She is innocent, Robar. You have my word, on my husband’s grave and my honor as a Stark!   That resolved him.  I will hold them,  Ser Robar said.  Get her away.  He turned and went out.  The fire had reached the wall and was creeping up the side of the tent. Ser Emmon was pressing Brienne hard, him in his enameled yellow steel and her in wool. He had forgotten Catelyn, until the iron brazier came crashing into the back of his head. Helmed as he was, the blow did no lasting harm, but it sent him to his knees.  Brienne, with me,  Catelyn commanded. The girl was not slow to see the chance. A slash, and the green silk parted. They stepped out into darkness and the chill of dawn. Loud voices came from the other side of the pavilion.  This way,  Catelyn urged,  and slowly. We must not run, or they will ask why. Walk easy, as if nothing were amiss.   Brienne thrust her sword blade through her belt and fell in beside Catelyn. The night air smelled of rain. Behind them, the king’s pavilion was well ablaze, flames rising high against the dark. No one made any move to stop them. Men rushed past them, shouting of fire and murder and sorcery. Others stood in small groups and spoke in low voices. A few were praying, and one young squire was on his knees, sobbing openly.  Renly’s battles were already coming apart as the rumors spread from mouth to mouth."
}