{
  "id": "8472cad85103cc5ab3a745e674ad3c125ab5011d",
  "text": " Black iron is for ravenry, silver for healing, gold for sums and numbers. I don’t remember them all.   Luwin slid a finger up under his collar and began to turn it, inch by inch. He had a thick neck for a small man, and the chain was tight, but a few pulls had it all the way around.  This is Valyrian steel,  he said when the link of dark grey metal lay against the apple of his throat.  Only one maester in a hundred wears such a link. This signifies that I have studied what the Citadel calls the higher mysteries—magic, for want of a better word. A fascinating pursuit, but of small use, which is why so few maesters trouble themselves with it.   All those who study the higher mysteries try their own hand at spells, soon or late. I yielded to the temptation too, I must confess it. Well, I was a boy, and what boy does not secretly wish to find hidden powers in himself? I got no more for my efforts than a thousand boys before me, and a thousand since. Sad to say, magic does not work.    Sometimes it does,  Bran protested.  I had that dream, and Rickon did too. And there are mages and warlocks in the east…    There are men who call themselves mages and warlocks,  Maester Luwin said.  I had a friend at the Citadel who could pull a rose out of your ear, but he was no more magical than I was. Oh, to be sure, there is much we do not understand. The years pass in their hundreds and their thousands, and what does any man see of life but a few summers, a few winters? We look at mountains and call them eternal, and so they seem… but in the course of time, mountains rise and fall, rivers change their courses, stars fall from the sky, and great cities sink beneath the sea. Even gods die, we think. Everything changes.   Perhaps magic was once a mighty force in the world, but no longer. What little remains is no more than the wisp of smoke that lingers in the air after a great fire has burned out, and even that is fading. Valyria was the last ember, and Valyria is gone. The dragons are no more, the giants are dead, the children of the forest forgotten with all their lore.   No, my prince. Jojen Reed may have had a dream or two that he believes came true, but he does not have the greensight. No living man has that power.   Bran said as much to Meera Reed when she came to him at dusk as he sat in his window seat watching the lights flicker to life.  I’m sorry for what happened with the wolves. Summer shouldn’t have tried to hurt Jojen, but Jojen shouldn’t have said all that about my dreams. The crow lied when he said I could fly, and your brother lied too.    Or perhaps your maester is wrong.    He isn’t. Even my father relied on his counsel.    Your father listened, I have no doubt. But in the end, he decided for himself. Bran, will you let me tell you about a dream Jojen dreamed of you and your fosterling brothers?    The Walders aren’t my brothers.   She paid that no heed.  You were sitting at supper, but instead of a servant, Maester Luwin brought you your food. He served you the king’s cut off the roast, the meat rare and bloody, but with a savory smell that made everyone’s mouth water. The meat he served the Freys was old and grey and dead. Yet they liked their supper better than you liked yours.    I don’t understand.    You will, my brother says. When you do, we’ll talk again.   Bran was almost afraid to sit to supper that night, but when he did, it was pigeon pie they set before him. Everyone else was served the same, and he couldn’t see that anything was wrong with the food they served the Walders. Maester Luwin has the truth of it, he told himself. Nothing bad was coming to Winterfell, no matter what Jojen said. Bran was relieved… but disappointed too. So long as there was magic, anything could happen. Ghosts could walk, trees could talk, and broken boys could grow up to be knights.  But there isn’t,  he said aloud in the darkness of his bed.  There’s no magic, and the stories are just stories.   And he would never walk, nor fly, nor be a knight.      TYRION  The rushes were scratchy under the soles of his bare feet.  My cousin chooses a queer hour to come visiting,  Tyrion told a sleep-befuddled Podrick Payne, who’d doubtless expected to be well roasted for waking him.  See him to my solar and tell him I’ll be down shortly.   It was well past midnight, he judged from the black outside the window. Does Lancel think to find me drowsy and slow of wit at this hour? he wondered. No, Lancel scarce thinks at all, this is Cersei’s doing. His sister would be disappointed. Even abed, he worked well into the morning—reading by the flickering light of a candle, scrutinizing the reports of Varys’s whisperers, and poring over Littlefinger’s books of accounts until the columns blurred and his eyes ached.  He splashed some tepid water on his face from the basin beside his bed and took his time squatting in the garderobe, the night air cold on his bare skin. Ser Lancel was sixteen, and not known for his patience. Let him wait, and grow more anxious in the waiting."
}