{
  "id": "84bd6c34d16cf24098de53433b6a359d49d64319",
  "text": " It was clear from a glance why it belonged in the Restricted Section. Some of the potions had effects almost too gruesome to think about, and there were some very unpleasant illustrations, which included a man who seemed to have been turned inside out and a witch sprouting several extra pairs of arms out of her head.  \"Here it is,\" said Hermione excitedly as she found the page headed The Polyjuice Potion. It was decorated with drawings of people halfway through transforming into other people. Harry sin  *164*  cerely hoped the artist had imagined the looks of intense pain on their faces.  \"This is the most complicated potion I've ever seen,\" said Hermione as they scanned the recipe. \"Lacewing flies, leeches, fluxweed, and knotgrass,\" she murmured, running her finger down the list of ingredients. \"Well, they're easy enough, they're in the student store- cupboard, we can help ourselves .... Oooh, look, powdered horn of a bicorn - don't know where we're going to get that - shredded skin of a boomslang -. that'll be tricky, too and of course a bit of whoever we want to change into.\"  \"Excuse me?\" said Ron sharply. \"What d'you mean, a bit of whoever we're changing into? I'm drinking nothing with Crabbe's toenails in it -\"  Hermione continued as though she hadn't heard him.  \"We don't have to worry about that yet, though, because we add those bits last ......  Ron turned, speechless, to Harry, who had another worry.  \"D'you realize how much we're going to have to steal, Hermione? Shredded skin of a boomslang, that's definitely not in the students' cupboard. What're we going to do, break into Snape's private stores? I don't know if this is a good idea ......  Hermione shut the book with a snap.  \"Well, if you two are going to chicken out, fine,\" she said. There were bright pink patches on her cheeks and her eyes were brighter than usual. \"I don't want to break rules, you know. I think threatening Muggle-borns is far worse than brewing up a difficult potion. But if you don't want to find out if it's Malfoy, I'll go straight to Madam Pince now and hand the book back in ='  *165  \"I never thought Id see the day when you'd be persuading us to break rules,\" said Ron. \"All right, we'll do it. But not toenails, okay?\"  \"How long will it take to make, anyway?\" said Harry as Hermione, looking happier, opened the book again.  \"Well, since the fluxweed has got to be picked at the full moon and the lacewings have got to be stewed for twenty-one days ... I'd say it'd be ready in about a month, if we can get all the ingredients.\"  \"A month?\" said Ron. \"Malfoy could have attacked half the Muggle- borns in the school by then!\" But Hermione's eyes narrowed dangerously again, and he added swiftly, \"But it's the best plan we've got, so full steam ahead, I say.\"  However, while Hermione was checking that the coast was clear for them to leave the bathroom, Ron muttered to Harry, \"It'll be a lot less hassle if you can just knock Malfoy off his broom tomorrow.  Harry woke early on Saturday morning and lay for a while thinking about the coming Quidditch match. He was nervous, mainly at the thought of what Wood would say if Gryffindor lost, but also at the idea of facing a team mounted on the fastest racing brooms gold could buy. He had never wanted to beat Slytherin so badly. After half an hour of lying there with his insides churning, he got up, dressed, and went down to breakfast early, where he found the rest of the Gryffindor team huddled at the long, empty table, all looking uptight and not speaking much.  As eleven o'clock approached, the whole school started to make its way down to the Quidditch stadium. It was a muggy sort of day  *166*  with a hint of thunder in the air. Ron and Hermione came hurrying over to wish Harry good luck as he entered the locker rooms. The team pulled on their scarlet Gryffindor robes, then sat down to listen to Wood's usual pre-match pep talk.  \"Slytherin has better brooms than us,\" he began. \"No point denying it. But we've got better people on our brooms. We've trained harder than they have, we've been flying in all weathers -\" (\"Too true,\" muttered George Weasley. \"I haven't been properly dry since August\") \"- and we're going to make them rue the day they let that little bit of slime, Malfoy, buy his way onto their team.\"  Chest heaving with emotion, Wood turned to Harry.  \"It'll be down to you, Harry, to show them that a Seeker has to have something more than a rich father. Get to that Snitch before Malfoy or die trying, Harry, because we've got to win today, we've got to.\"  \"So no pressure, Harry\" said Fred, winking at him.  As they walked out onto the pitch, a roar of noise greeted them; mainly cheers, because Ravenclaw and Hufflepuff were anxious to see Slytherin beaten, but the Slytherins in the crowd made their boos and hisses heard, too. Madam Hooch, the Quidditch teacher, asked Flint and Wood to shake hands, which they did, giving each other threatening stares and gripping rather harder than was necessary."
}