{
  "id": "84cefbb93d3efd1e99432c6ff0d24da1c03cf0ae",
  "text": "    I would look on him,  she repeated.  One of the silent sisters turned down the banner.  Bones, Catelyn thought. This is not Ned, this is not the man I loved, the father of my children. His hands were clasped together over his chest, skeletal fingers curled about the hilt of some longsword, but they were not Ned’s hands, so strong and full of life. They had dressed the bones in Ned’s surcoat, the fine white velvet with the direwolf badge over the heart, but nothing remained of the warm flesh that had pillowed her head so many nights, the arms that had held her. The head had been rejoined to the body with fine silver wire, but one skull looks much like another, and in those empty hollows she found no trace of her lord’s dark grey eyes, eyes that could be soft as a fog or hard as stone. They gave his eyes to crows, she remembered.  Catelyn turned away.  That is not his sword.    Ice was not returned to us, my lady,  Utherydes said.  Only Lord Eddard’s bones.    I suppose I must thank the queen for even that much.    Thank the Imp, my lady. It was his doing.   One day I will thank them all.  I am grateful for your service, sisters,  Catelyn said,  but I must lay another task upon you. Lord Eddard was a Stark, and his bones must be laid to rest beneath Winterfell.  They will make a statue of him, a stone likeness that will sit in the dark with a direwolf at his feet and a sword across his knees.  Make certain the sisters have fresh horses, and aught else they need for the journey,  she told Utherydes Wayn.  Hal Mollen will escort them back to Winterfell, it is his place as captain of guards.  She gazed down at the bones that were all that remained of her lord and love.  Now leave me, all of you. I would be alone with Ned tonight.   The women in grey bowed their heads. The silent sisters do not speak to the living, Catelyn remembered dully, but some say they can talk to the dead. And how she envied that…      DAENERYS  The drapes kept out the dust and heat of the streets, but they could not keep out disappointment. Dany climbed inside wearily, glad for the refuge from the sea of Qartheen eyes.  Make way,  Jhogo shouted at the crowd from horseback, snapping his whip,  make way, make way for the Mother of Dragons.   Reclining on cool satin cushions, Xaro Xhoan Daxos poured ruby-red wine into matched goblets of jade and gold, his hands sure and steady despite the sway of the palanquin.  I see a deep sadness written upon your face, my light of love.  He offered her a goblet.  Could it be the sadness of a lost dream?    A dream delayed, no more.  Dany’s tight silver collar was chafing against her throat. She unfastened it and flung it aside. The collar was set with an enchanted amethyst that Xaro swore would ward her against all poisons. The Pureborn were notorious for offering poisoned wine to those they thought dangerous, but they had not given Dany so much as a cup of water. They never saw me for a queen, she thought bitterly. I was only an afternoon’s amusement, a horse girl with a curious pet.  Rhaegal hissed and dug sharp black claws into her bare shoulder as Dany stretched out a hand for the wine. Wincing, she shifted him to her other shoulder, where he could claw her gown instead of her skin. She was garbed after the Qartheen fashion. Xaro had warned her that the Enthroned would never listen to a Dothraki, so she had taken care to go before them in flowing green samite with one breast bared, silvered sandals on her feet, with a belt of black-and-white pearls about her waist. For all the help they offered, I could have gone naked. Perhaps I should have. She drank deep.  Descendants of the ancient kings and queens of Qarth, the Pureborn commanded the Civic Guard and the fleet of ornate galleys that ruled the straits between the seas. Daenerys Targaryen had wanted that fleet, or part of it, and some of their soldiers as well. She made the traditional sacrifice in the Temple of Memory, offered the traditional bribe to the Keeper of the Long List, sent the traditional persimmon to the Opener of the Door, and finally received the traditional blue silk slippers summoning her to the Hall of a Thousand Thrones.  The Pureborn heard her pleas from the great wooden seats of their ancestors, rising in curved tiers from a marble floor to a high-domed ceiling painted with scenes of Qarth’s vanished glory. The chairs were immense, fantastically carved, bright with goldwork and studded with amber, onyx, lapis, and jade, each one different from all the others, and each striving to be the most fabulous. Yet the men who sat in them seemed so listless and world-weary that they might have been asleep. They listened, but they did not hear, or care, she thought. They are Milk Men indeed. They never meant to help me. They came because they were curious. They came because they were bored, and the dragon on my shoulder interested them more than I did.   Tell me the words of the Pureborn,  prompted Xaro Xhoan Daxos.  Tell me what they said to sadden the queen of my heart."
}