{
  "id": "84e0403328823d352ce31f6ef4fbd44c94045237",
  "text": "  \"And there we go...\" Harry muttered. \"We're in.\"  The moment they disappeared, the tree began to move again. Seconds later, they heard footsteps quite close by. Dumbledore, Macnair, Fudge, and the old Committee member were making their way up to the castle.  \"Right after we'd gone down into the passage!\" said Hermione. \"If only Dumbledore had come with us...\"  \"Macnair and Fudge would've come too,\" said Harry bitterly. \"I bet you anything Fudge would've told Macnair to murder Sirius on the spot....\"  They watched the four men climb the castle steps and disappear from view. For a few minutes the scene was deserted. Then --  \"Here comes Lupin!\" said Harry as they saw another figure sprinting down the stone steps and hating toward the Willow. Harry looked up at the sky. Clouds were obscuring the moon completely.  They watched Lupin seize a broken branch from the ground and prod the knot on the trunk. The tree stopped fighting, and Lupin, too, disappeared into the gap in its roots.  \"If he'd only grabbed the cloak,\" said Harry. \"It's just lying there....\"  He turned to Hermione.  \"If I just dashed out now and grabbed it, Snape'd never be able to get it and --\"  \"Harry, we mustn't be seen!\"  \"How can you stand this?\" he asked Hermione fiercely. \"Just standing here and watching it happen?\" He hesitated. \"I'm going to grab the cloak!\"  \"Harry, no!\"  Hermione seized the back of Harry's robes not a moment too soon. just then, they heard a burst of song. It was Hagrid, making his way up to the castle, singing at the top of his voice, and weaving slightly as he walked. A large bottle was swinging from his hands.  \"See?\" Hermione whispered. \"See what would have happened? We've got to keep out of sight! No, Buckbeak!\"  The hippogriff was making frantic attempts to get to Hagrid again; Harry seized his rope too, straining to hold Buckbeak back. They watched Hagrid meander tipsily up to the castle. He was gone. Buckbeak stopped fighting to get away. His head drooped sadly.  Barely two minutes later, the castle doors flew open yet again, and Snape came charging out of them, running toward the Willow.  Harry's fists clenched as they watched Snape skid to a halt next to the tree, looking around. He grabbed the cloak and held it up.  \"Get your filthy hands off it,\" Harry snarled under his breath. \"Shh!\"  Snape seized the branch Lupin had used to freeze the tree, prodded the knot, and vanished from view as he put on the cloak.  \"So that's it,\" said Hermione quietly. \"We're all down there... and now we've just got to wait until we come back up again....\"  She took the end of Buckbeak's rope and tied it securely around the nearest tree, then sat down on the dry ground, arms around her knees.  \"Harry, there's something I don't understand.... Why didn't the dementors get Sirius? I remember them coming, and then I think I passed out... there were so many of them....\"  Harry sat down too. He explained what he'd seen; how, as the nearest dementor had lowered its mouth to Harry's, a large silver something had come galloping across the lake and forced the dementors to retreat.  Hermione's mouth was slightly open by the time Harry had finished.  \"But what was it?\"  \"There's only one thing it could have been, to make the dementors go,\" said Harry. \"A real Patronus. A powerful one.\"  \"But who conjured it?\"  Harry didn't say anything. He was thinking back to the person he'd seen on the other bank of the lake. He knew who he thought it had been... but how could it have been?  \"Didn't you see what they looked like?\" said Hermione eagerly. \"Was it one of the teachers?\"  \"No,\" said Harry. \"He wasn't a teacher.\"  \"But it must have been a really powerful wizard, to drive all those dementors away... If the Patronus was shining so brightly, didn't it light him up? Couldn't you see --?\"  \"Yeah, I saw him,\" said Harry slowly. \"But... maybe I imagined it.... I wasn't thinking straight.... I passed out right afterward....\"  \"Who did you think it was?\"  I think --\" Harry swallowed, knowing how strange this was going to sound. I think it was my dad.\"  Harry glanced up at Hermione and saw that her mouth was fully open now. She was gazing at him with a mixture of alarm and pity.  \"Harry, your dad's -- well -- dead,\" she said quietly.  \"I know that,\" said Harry quickly.  \"You think you saw his ghost?\"  \"I don't know... no... he looked solid....\"  \"But then --\"  \"Maybe I was seeing things,\" said Harry. \"But... from what I could see... it looked like him.... I've got photos of him....\"  Hermione was still looking at him as though worried about his sanity.  I know it sounds crazy,\" said Harry flatly. He turned to took at Buckbeak, who was digging his beak into the ground, apparently searching for worms. But he wasn't really watching Buckbeak.  He was thinking about his father and about his father's three oldest friends... Moony, Wormtail, Padfoot, and Prongs.... Had all four of them been out on the grounds tonight? Wormtail had reappeared this evening when everyone had thought he was dead."
}