{
  "id": "84e6e6fa6037e0ec030871f9a777f99a409c9939",
  "text": " Upward he bounded, up, two bounds, three, hardly slowing, until he was among the lower limbs. Branches tangled his feet and whipped at his eyes, grey-green needles scattered as he shouldered through them, snapping. He had to slow. Something snagged at his foot and he wrenched it free, snarling. The trunk narrowed under him, the slope steeper, almost straight up, and wet. The bark tore like skin when he tried to claw at it. He was a third of the way up, halfway, more, the roof was almost within reach… and then he put down a foot and felt it slip off the curve of wet wood, and suddenly he was sliding, stumbling. He yowled in fear and fury, falling, falling, and twisted around while the ground rushed up to break him…  And then Bran was back abed in his lonely tower room, tangled in his blankets, his breath coming hard.  Summer,  he cried aloud.  Summer.  His shoulder seemed to ache, as if he had fallen on it, but he knew it was only the ghost of what the wolf was feeling. Jojen told it true. I am a beastling. Outside he could hear the faint barking of dogs. The sea has come. It’s flowing over the walls, just as Jojen saw. Bran grabbed the bar overhead and pulled himself up, shouting for help. No one came, and after a moment he remembered that no one would. They had taken the guard off his door. Ser Rodrik had needed every man of fighting age he could lay his hands on, so Winterfell had been left with only a token garrison.  The rest had left eight days past, six hundred men from Winterfell and the nearest holdfasts. Cley Cerwyn was bringing three hundred more to join them on the march, and Maester Luwin had sent ravens before them, summoning levies from White Harbor and the barrowlands and even the deep places inside the wolfswood. Torrhen’s Square was under attack by some monstrous war chief named Dagmer Cleftjaw. Old Nan said he couldn’t be killed, that once a foe had cut his head in two with an axe, but Dagmer was so fierce he’d just pushed the two halves back together and held them until they healed up. Could Dagmer have won? Torrhen’s Square was many days from Winterfell, yet still…  Bran pulled himself from the bed, moving bar to bar until he reached the windows. His fingers fumbled a little as he swung back the shutters. The yard was empty, and all the windows he could see were black. Winterfell slept.  Hodor!  he shouted down, as loud as he could. Hodor would be asleep above the stables, but maybe if he yelled loud enough he’d hear, or somebody would.  Hodor, come fast! Osha! Meera, Jojen, anyone!  Bran cupped his hands around his mouth.  HOOOOODOOOOOR!   But when the door crashed open behind him, the man who stepped through was no one Bran knew. He wore a leather jerkin sewn with overlapping iron disks, and carried a dirk in one hand and an axe strapped to his back.  What do you want?  Bran demanded, afraid.  This is my room. You get out of here.   Theon Greyjoy followed him into the bedchamber.  We’re not here to harm you, Bran.    Theon?  Bran felt dizzy with relief.  Did Robb send you? Is he here too?    Robb’s far away. He can’t help you now.    Help me?  He was confused.  Don’t scare me, Theon.    I’m Prince Theon now. We’re both princes, Bran. Who would have dreamed it? But I’ve taken your castle, my prince.    Winterfell?  Bran shook his head.  No, you couldn’t.    Leave us, Werlag.  The man with the dirk withdrew. Theon seated himself on the bed.  I sent four men over the walls with grappling claws and ropes, and they opened a postern gate for the rest of us. My men are dealing with yours even now. I promise you, Winterfell is mine.   Bran did not understand.  But you’re Father’s ward.    And now you and your brother are my wards. As soon as the fighting’s done, my men will be bringing the rest of your people together in the Great Hall. You and I are going to speak to them. You’ll tell them how you’ve yielded Winterfell to me, and command them to serve and obey their new lord as they did the old.    I won’t,  said Bran.  We’ll fight you and throw you out. I never yielded, you can’t make me say I did.    This is no game, Bran, so don’t play the boy with me, I won’t stand for it. The castle is mine, but these people are still yours. If the prince would keep them safe, he’d best do as he’s told.  He rose and went to the door.  Someone will come dress you and carry you to the Great Hall. Think carefully on what you want to say.   The waiting made Bran feel even more helpless than before. He sat in the window seat, staring out at dark towers and walls black as shadow. Once he thought he heard shouting beyond the Guards Hall, and something that might have been the clash of swords, but he did not have Summer’s ears to hear, nor his nose to smell. Awake, I am still broken, but when I sleep, when I’m Summer, I can run and fight and hear and smell.  He had expected that Hodor would come for him, or maybe one of the serving girls, but when the door next opened it was Maester Luwin, carrying a candle.  Bran,  he said,  you… know what has happened? You have been told?  The skin was broken above his left eye, and blood ran down that side of his face."
}