{
  "id": "851b40f4cc9bb280354833a6c9b3a23a50d94ccc",
  "text": " When she leaned back the trickles ran down the back of her neck and under her collar. They felt good. She wished she could take off her clothes and swim, gliding through the warm water like an skinny pink otter. Maybe she could swim all the way to Winterfell.  Woth was shouting at her to help search, so she did, peering into boathouses and sheds while her horse grazed along the shore. They found some sails, some nails, buckets of tar gone hard, and a mother cat with a litter of new-born kittens. But no boats.  The town was as dark as any forest when Yoren and the others reappeared.  Tower’s empty,  he said.  Lord’s gone off to fight maybe, or to get his smallfolk to safety, no telling. Not a horse or pig left in town, but we’ll eat. Saw a goose running loose, and some chickens, and there’s good fish in the Gods Eye.    The boats are gone,  Arya reported.   We could patch the bottom of that rowboat,  said Koss.   Might do for four o’ us,  Yoren said.   There’s nails,  Lommy pointed out.  And there’s trees all around. We could build us all boats.   Yoren spat.  You know anything ’bout boat-building, dyer’s boy?  Lommy looked blank.   A raft,  suggested Gendry.  Anyone can build a raft, and long poles for pushing.   Yoren looked thoughtful.  Lake’s too deep to pole across, but if we stayed to the shallows near shore… it’d mean leaving the wagons. Might be that’s best. I’ll sleep on it.    Can we stay at the inn?  Lommy asked.   We’ll stay in the holdfast, with the gates barred,  the old man said.  I like the feel o’ stone walls about me when I sleep.   Arya could not keep quiet.  We shouldn’t stay here,  she blurted.  The people didn’t. They all ran off, even their lord.    Arry’s scared,  Lommy announced, braying laughter.   I’m not,  she snapped back,  but they were.    Smart boy,  said Yoren.  Thing is, the folks who lived here were at war, like it or no. We’re not. Night’s Watch takes no part, so no man’s our enemy.   And no man’s our friend, she thought, but this time she held her tongue. Lommy and the rest were looking at her, and she did not want to seem craven in front of them.  The holdfast gates were studded with iron nails. Within, they found a pair of iron bars the size of saplings, with post holes in the ground and metal brackets on the gate. When they slotted the bars through the brackets, they made a huge X brace. It was no Red Keep, Yoren announced when they’d explored the holdfast top to bottom, but it was better than most, and should do for a night well enough. The walls were rough unmortared stone ten feet high, with a wooden catwalk inside the battlements. There was a postern gate to the north, and Gerren discovered a trap under the straw in the old wooden barn, leading to a narrow, winding tunnel. He followed it a long way under the earth and came out by the lake. Yoren had them roll a wagon on top of the trap, to make certain no one came in that way. He divided them into three watches, and sent Tarber, Kurz, and Cutjack off to the abandoned towerhouse to keep an eye out from on high. Kurz had a hunting horn to sound if danger threatened.  They drove their wagons and animals inside and barred the gates behind them. The barn was a ramshackle thing, large enough to hold half the animals in the town. The haven, where the townfolk would shelter in times of trouble, was even larger, low and long and built of stone, with a thatched roof. Koss went out the postern gate and brought the goose back, and two chickens as well, and Yoren allowed a cookfire. There was a big kitchen inside the holdfast, though all the pots and kettles had been taken. Gendry, Dobber, and Arya drew cook duty. Dobber told Arya to pluck the fowl while Gendry split wood.  Why can’t I split the wood?  she asked, but no one listened. Sullenly, she set to plucking a chicken while Yoren sat on the end of the bench sharpening the edge of his dirk with a whetstone.  When the food was ready, Arya ate a chicken leg and a bit of onion. No one talked much, not even Lommy. Gendry went off by himself afterward, polishing his helm with a look on his face like he wasn’t even there. The crying girl whimpered and wept, but when Hot Pie offered her a bit of goose she gobbled it down and looked for more.  Arya drew second watch, so she found a straw pallet in the haven. Sleep did not come easy, so she borrowed Yoren’s stone and set to honing Needle. Syrio Forel had said that a dull blade was like a lame horse. Hot Pie squatted on the pallet beside her, watching her work.  Where’d you get a good sword like that?  he asked. When he saw the look she gave him, he raised his hands defensively.  I never said you stole it, I just wanted to know where you got it, is all.    My brother gave it to me,  she muttered.   I never knew you had no brother.   Arya paused to scratch under her shirt. There were fleas in the straw, though she couldn’t see why a few more would bother her.  I have lots of brothers.    You do? Are they bigger than you, or littler?   I shouldn’t be talking like this."
}