{
  "id": "85446ab39edc6b3cd84ce7840eb254707a4d8efa",
  "text": "   The day is won,  Dagmer called down.  And yet you do not smile, boy. The living should smile, for the dead cannot.  He smiled himself to show how it was done. It made for a hideous sight. Under a snowy white mane of hair, Dagmer Cleftjaw had the most gut-churning scar Theon had ever seen, the legacy of the longaxe that had near killed him as a boy. The blow had splintered his jaw, shattered his front teeth, and left him four lips where other men had but two. A shaggy beard covered his cheeks and neck, but the hair would not grow over the scar, so a shiny seam of puckered, twisted flesh divided his face like a crevasse through a snowfield.  We could hear them singing,  the old warrior said.  It was a good song, and they sang it bravely.    They sang better than they fought. Harps would have done them as much good as their lances did.    How many men are lost?    Of ours?  Theon shrugged.  Todric. I killed him for getting drunk and fighting over loot.    Some men are born to be killed.  A lesser man might have been afraid to show a smile as frightening as his, yet Dagmer grinned more often and more broadly than Lord Balon ever had.  Ugly as it was, that smile brought back a hundred memories. Theon had seen it often as a boy, when he’d jumped a horse over a mossy wall, or flung an axe and split a target square. He’d seen it when he blocked a blow from Dagmer’s sword, when he put an arrow through a seagull on the wing, when he took the tiller in hand and guided a longship safely through a snarl of foaming rocks. He gave me more smiles than my father and Eddard Stark together. Even Robb… he ought to have won a smile the day he’d saved Bran from that wildling, but instead he’d gotten a scolding, as if he were some cook who’d burned the stew.   You and I must talk, Uncle,  Theon said. Dagmer was no true uncle, only a sworn man with perhaps a pinch of Greyjoy blood four or five lives back, and that from the wrong side of the blanket. Yet Theon had always called him uncle nonetheless.   Come onto my deck, then.  There were no m’lords from Dagmer, not when he stood on his own deck. On the Iron Islands, every captain was a king aboard his own ship.  He climbed the plank to the deck of the Foamdrinker in four long strides, and Dagmer led him back to the cramped aft cabin, where the old man poured a horn of sour ale and offered Theon the same. He declined.  We did not capture enough horses. A few, but… well, I’ll make do with what I have, I suppose. Fewer men means more glory.    What need do we have of horses?  Like most ironmen, Dagmer preferred to fight on foot or from the deck of a ship.  Horses will only shit on our decks and get in our way.    If we sailed, yes,  Theon admitted.  I have another plan.  He watched the other carefully to see how he would take that. Without the Cleftjaw he could not hope to succeed. Command or no, the men would never follow him if both Aeron and Dagmer opposed him, and he had no hope of winning over the sour-faced priest.   Your lord father commanded us to harry the coast, no more.  Eyes pale as sea foam watched Theon from under those shaggy white eyebrows. Was it disapproval he saw there, or a spark of interest? The latter, he thought… hoped…   You are my father’s man.    His best man, and always have been.   Pride, Theon thought. He is proud, I must use that, his pride will be the key.  There is no man in the Iron Islands half so skilled with spear or sword.    You have been too long away, boy. When you left, it was as you say, but I am grown old in Lord Greyjoy’s service. The singers call Andrik best now. Andrik the Unsmiling, they name him. A giant of a man. He serves Lord Drumm of Old Wyk. And Black Lorren and Qarl the Maid are near as dread.    This Andrik may be a great fighter, but men do not fear him as they fear you.    Aye, that’s so,  Dagmer said. The fingers curled around the drinking horn were heavy with rings, gold and silver and bronze, set with chunks of sapphire and garnet and dragonglass. He had paid the iron price for every one, Theon knew.   If I had a man like you in my service, I should not waste him on this child’s business of harrying and burning. This is no work for Lord Balon’s best man…   Dagmer’s grin twisted his lips apart and showed the brown splinters of his teeth.  Nor for his trueborn son?  He hooted.  I know you too well, Theon. I saw you take your first step, helped you bend your first bow. ’Tis not me who feels wasted.    By rights I should have my sister’s command,  he admitted, uncomfortably aware of how peevish that sounded.   You take this business too hard, boy. It is only that your lord father does not know you. With your brothers dead and you taken by the wolves, your sister was his solace. He learned to rely on her, and she has never failed him.    Nor have I. The Starks knew my worth. I was one of Brynden Blackfish’s picked scouts, and I charged with the first wave in the Whispering Wood. I was that close to crossing swords with the Kingslayer himself."
}