{
  "id": "855577e2bd9f2e4635fb513b9678a27cc5387bdc",
  "text": "       'Where  does  that other old  animal, that  Fatty  Lumpkin, come from?'  asked Frodo.       'He's mine,' said  Tom. 'My four-legged  friend;  though I seldom  ride  him,  and he wanders  often far, free upon the  hillsides. When  your ponies  stayed with  me, they  got  to know  my Lumpkin;  and they  smelt him in the  night,  and quickly  ran to meet him. I thought he'd  look for them and with  his words of wisdom take all their fear away. But now, my jolly Lumpkin, old  Tom's going to ride. Hey! he's coming with you, just to set you on the road;  so  he needs a pony. For you  cannot easily talk to hobbits that are riding,   ####-when you're on your own legs trying to trot beside them.'       The hobbits were delighted  to  hear this, and thanked  Tom many times;   but he laughed, and said that they were so good at losing themselves that he   would  not  feel happy till he had seen them  safe over  the borders  of  his  land. 'I've got  things to  do,' he  said:  'my  making and  my  singing, my  talking and my walking, and my watching of the country.  Tom can't be always  near  to  open doors  and willow-cracks.  Tom  has  his house  to mind,  and   Goldberry is wait ing.'       It was still fairly early  by the sun, something between  nine and ten,  and the hobbits turned their minds  to food. Their last meal  had been lunch  beside  the  standing  stone the  day  before. They  breakfasted now off the  remainder of  Tom's provisions,  meant for their supper, with additions that  Tom had brought with him. It was  not a large meal (considering hobbits  and  the circumstances), but they felt much better for it. While they were eating  Tom went up to the mound, and looked through the treasures. Most of these he  made into a pile that glistened and  sparkled on the grass. He bade them lie  there 'free to  all finders,  birds, beasts. Elves  or Men,  and  all kindly  creatures'; for so the spell of the mound should be broken and scattered and  no Wight  ever  come back to it. He chose for himself from the pile a brooch   set  with  blue  stones,  many-shaded like flax-flowers or the wings of blue  butterflies. He looked long at it, as if stirred by some memory, shaking his  head, and saying at last:        'Here is a pretty toy for  Tom and for his  lady! Fair was she who long  ago  wore this on her shoulder. Goldberry shall wear it now, and we will not  forget her!'       For each of the hobbits he chose a dagger, long, leaf-shaped, and keen,  of marvellous workmanship, damasked with serpent-forms in red and gold.  They  gleamed as he drew them  from their black sheaths,  wrought of  some strange  metal,  light and  strong, and set with  many fiery stones.  Whether by some  virtue in these sheaths or  because of the spell  that lay on the mound, the  blades seemed untouched by time, unrusted, sharp, glittering in the sun.       'Old  knives are long  enough  as  swords for  hobbit-people,' he said.  'Sharp  blades are good to have, if Shire-folk go walking , east,  south,  or   far away into dark  and danger.'  Then he told  them that these  blades were  forged many long years ago by Men of Westernesse: they were foes of the  Dark   ####-Lord,  but  they were overcome  by the evil king of Carn Dym in  the Land of  Angmar .       'Few now remember them,' Tom murmured,  'yet  still some  go wandering,  sons of forgotten  kings walking in loneliness,  guarding  from  evil things  folk that are heedless.'       The hobbits  did not understand his  words, but as  he spoke they had a  vision  as it  were of a  great expanse of  years  behind them,  like a vast   shadowy  plain over  which there strode  shapes  of Men, tall and grim  with  bright swords,  and last came  one with a star on his  brow. Then the vision  faded,  and they were back  in the sunlit world. It was time to start again.  They made ready,  packing  their  bags  and lading  their  ponies. Their new  weapons they hung on their  leather belts under  their jackets, feeling them  very awkward, and  wondering  if they would be of  any use. Fighting had not  before occurred to any of  them  as one  of the  adventures  in which  their  flight would land them.       At last  they  set off. They led their ponies down the hill;  and  then  mounting they trotted quickly along the valley. They looked back and saw the  top of the old mound on the hill, and  from it the sunlight on the gold went  up like a yellow flame. Then they turned  a shoulder of the Downs and it was  hidden from view.        Though Frodo looked about him on every side he saw no sign of the great  stones standing like  a gate, and before long they came to the  northern gap  and rode swiftly through, and the land fell away before them. It was a merry  journey with  Tom Bombadil trotting gaily  beside them, or  before  them, on  Fatty Lumpkin, who could move much faster than his girth promised. Tom   sang  most of the time, but  it  was chiefly  nonsense, or else  perhaps a strange  language unknown to the hobbits, an ancient language whose words were  mainly  those of wonder and delight."
}