{
  "id": "85c9d9be7a8bbef3ef0b97c8a3663b768d8d6169",
  "text": " Sansa had been wary of Tyrion’s squire at first; he was a Payne, cousin to Ser Ilyn Payne who had taken her father’s head off. However, she’d soon come to realize that Pod was as frightened of her as she was of his cousin. Whenever she spoke to him, he turned the most alarming shade of red.   Are purple, gold, and white the colors of House Payne, Podrick?  she asked him politely.   No. I mean, yes.  He blushed.  The colors. Our arms are purple and white chequy, my lady. With gold coins. In the checks. Purple and white. Both.  He studied her feet.   There’s a tale behind those coins,  said Tyrion.  No doubt Pod will confide it to your toes one day. Just now we are expected at the Queen’s Ballroom, however. Shall we?   Sansa was tempted to beg off. I could tell him that my tummy was upset, or that my moon’s blood had come. She wanted nothing more than to crawl back in bed and pull the drapes. I must be brave, like Robb, she told herself, as she took her lord husband stiffly by the arm.  In the Queen’s Ballroom they broke their fast on honeycakes baked with blackberries and nuts, gammon steaks, bacon, fingerfish crisped in breadcrumbs, autumn pears, and a Dornish dish of onions, cheese, and chopped eggs cooked up with fiery peppers.  Nothing like a hearty breakfast to whet one’s appetite for the seventy-seven-course feast to follow,  Tyrion commented as their plates were filled. There were flagons of milk and flagons of mead and flagons of a light sweet golden wine to wash it down. Musicians strolled among the tables, piping and fluting and fiddling, while Ser Dontos galloped about on his broomstick horse and Moon Boy made farting sounds with his cheeks and sang rude songs about the guests.  Tyrion scarce touched his food, Sansa noticed, though he drank several cups of the wine. For herself, she tried a little of the Dornish eggs, but the peppers burned her mouth. Otherwise she only nibbled at the fruit and fish and honeycakes. Every time Joffrey looked at her, her tummy got so fluttery that she felt as though she’d swallowed a bat.  When the food had been cleared away, the queen solemnly presented Joff with the wife’s cloak that he would drape over Margaery’s shoulders.  It is the cloak I donned when Robert took me for his queen, the same cloak my mother Lady Joanna wore when wed to my lord father.  Sansa thought it looked threadbare, if truth be told, but perhaps because it was so used.  Then it was time for gifts. It was traditional in the Reach to give presents to bride and groom on the morning of their wedding; on the morrow they would receive more presents as a couple, but today’s tokens were for their separate persons.  From Jalabhar Xho, Joffrey received a great bow of golden wood and quiver of long arrows fletched with green and scarlet feathers; from Lady Tanda a pair of supple riding boots; from Ser Kevan a magnificent red leather jousting saddle; a red gold brooch wrought in the shape of a scorpion from the Dornishman, Prince Oberyn; silver spurs from Ser Addam Marbrand; a red silk tourney pavilion from Lord Mathis Rowan. Lord Paxter Redwyne brought forth a beautiful wooden model of the war galley of two hundred oars being built even now on the Arbor.  If it please Your Grace, she will be called King Joffrey’s Valor,  he said, and Joff allowed that he was very pleased indeed.  I will make it my flagship when I sail to Dragonstone to kill my traitor uncle Stannis,  he said.  He plays the gracious king today. Joffrey could be gallant when it suited him, Sansa knew, but it seemed to suit him less and less. Indeed, all his courtesy vanished at once when Tyrion presented him with their own gift: a huge old book called Lives of Four Kings, bound in leather and gorgeously illuminated. The king leafed through it with no interest.  And what is this, Uncle?   A book. Sansa wondered if Joffrey moved those fat wormy lips of his when he read.   Grand Maester Kaeth’s history of the reigns of Daeron the Young Dragon, Baelor the Blessed, Aegon the Unworthy, and Daeron the Good,  her small husband answered.   A book every king should read, Your Grace,  said Ser Kevan.   My father had no time for books.  Joffrey shoved the tome across the table.  If you read less, Uncle Imp, perhaps Lady Sansa would have a baby in her belly by now.  He laughed… and when the king laughs, the court laughs with him.  Don’t be sad, Sansa, once I’ve gotten Queen Margaery with child I’ll visit your bedchamber and show my little uncle how it’s done.   Sansa reddened. She glanced nervously at Tyrion, afraid of what he might say. This could turn as nasty as the bedding had at their own feast. But for once the dwarf filled his mouth with wine instead of words.  Lord Mace Tyrell came forward to present his gift: a golden chalice three feet tall, with two ornate curved handles and seven faces glittering with gemstones.  Seven faces for Your Grace’s seven kingdoms,  the bride’s father explained. He showed them how each face bore the sigil of one of the great houses: ruby lion, emerald rose, onyx stag, silver trout, blue jade falcon, opal sun, and pearl direwolf."
}