{
  "id": "867ef757dee463b5560d45b5fe8129265f9384a1",
  "text": " Then he took off his glasses and lay down, eyes open, facing his three birthday cards.  Extremely unusual though he was, at that moment Harry Potter felt just like everyone else -- glad, for the first time in his life, that it was his birthday.  CHAPTER TWO  AUNT MARGE'S BIG MISTAKE  Harry went down to breakfast the next morning to find the three Dursleys already sitting around the kitchen table. They were watching a brand-new television, a welcome-home-for-the-summer present for Dudley, who had been complaining loudly about the long walk between the fridge and the television in the living room. Dudley had spent most of the summer in the kitchen, his piggy little eyes fixed on the screen and his five chins wobbling as he ate continually.  Harry sat down between Dudley and Uncle Vernon, a large, beefy man with very little neck and a lot of mustache. Far from wishing Harry a happy birthday, none of the Dursleys made any sign that they had noticed Harry enter the room, but Harry was far too used to this to care. He helped himself to a piece of toast and then looked up at the reporter on the television, who was halfway through a report on an escaped convict:  \"... The public is warned that Black is armed and extremely dangerous. A special hot line has been set up, and any sighting of Black should be reported immediately.\"  \"No need to tell us he's no good,\" snorted Uncle Vernon, staring over the top of his newspaper at the prisoner. \"Look at the state of him, the filthy layabout! Look at his hair!\"  He shot a nasty look sideways at Harry, whose untidy hair had always been a source of great annoyance to Uncle Vernon. Compared to the man on the television, however, whose gaunt face was surrounded by a matted, elbow-length tangle, Harry felt very well groomed indeed.  The reporter had reappeared.  \"The Ministry of Agriculture and Fisheries will announce today --\"  \"Hang on!\" barked Uncle Vernon, staring furiously at the reporter. \"You didn't tell us where that maniac's escaped from! \\What use is that? Lunatic could be coming up the street right now!\"  Aunt Petunia, who was bony and horse-faced, whipped around and peered intently out of the kitchen window. Harry knew Aunt Petunia would simply love to be the one to call the hot line number. She was the nosiest woman in the world and spent most of her life spying on the boring, law-abiding neighbors.  \"When will they learn,\" said Uncle Vernon, pounding the table with his large purple fist, \"that hanging's the only way to deal with these people?\"  \"Very true,\" said Aunt Petunia, who was still squinting into next door's runner beans.  Uncle Vernon drained his teacup, glanced at his watch, and added, \"I'd better be off in a minute, Petunia. Marge's train gets in at ten.\"  Harry, whose thoughts had been upstairs with the Broomstick Servicing Kit, was brought back to earth with an unpleasant bump.  \"Aunt Marge?\" he blurted out. \"Sh -- she's not coming here, is she?\"  Aunt Marge was Uncle Vernon's sister. Even though she was not a blood relative of Harry's (whose mother had been Aunt Petunia's sister), he had been forced to call her \"Aunt\" all his life. Aunt Marge lived in the country, in a house with a large garden, where she bred bulldogs. She didn't often stay at Privet Drive, because she couldn't bear to leave her precious dogs, but each of her visits stood out horribly vividly in Harry's mind.  At Dudley's fifth birthday party, Aunt Margo had whacked Harry around the shins with her walking stick to stop him from beating Dudley at musical statues. A few years later, she had turned up at Christmas with a computerized robot for Dudley and a box of dog biscuits for Harry. On her last visit, the year before Harry started at Hogwarts, Harry had accidentally trodden on the tail of her favorite dog. Ripper had chased Harry out into the garden and up a tree, and Aunt Marge had refused to call him off until past midnight. The memory of this incident still brought tears of laughter to Dudley's eyes.  \"Marge'll be here for a week,\" Uncle Vernon snarled, 11 and while we're on the subject\" -- he pointed a fat finger threateningly at Harry -- \"we need to get a few things straight before I go and collect her.\"  Dudley smirked and withdrew his gaze from the television. Watching Harry being bullied by Uncle Vernon was Dudley's favorite form of entertainment.  \"Firstly,\" growled Uncle Vernon, \"you'll keep a civil tongue in your head when you're talking to Marge.\"  \"All right,\" said Harry bitterly, \"if she does when she's talking to me.  \"Secondly,\" said Uncle Vernon, acting as though he had not heard Harry's reply, \"as Marge doesn't know anything about your abnormality, I don't want any -- any funny stuff while she's here.  You behave yourself, got me?\"  \"I will if she does,\" said Harry through gritted teeth.  \"And thirdly,\" said Uncle Vernon, his mean little eyes now slits in his great purple face, \"we've told Marge you attend St. Brutus's Secure Center for Incurably Criminal Boys.\"  \"What?\" Harry yelled."
}