{
  "id": "868f72a04617d093927461b221bf31beb0246196",
  "text": " A Lannister pays his debts.   The Tyrell marriage had been Tyrion’s notion, in point of fact, but it would seem churlish to try to claim that now.  That title may not be as empty as you think,  he warned.  Littlefinger does nothing without good reason. But be that as it may. You said something about paying debts, I believe?    And you want your own reward, is that it? Very well. What is it you would have of me? Lands, castle, some office?    A little bloody gratitude would make a nice start.   Lord Tywin stared at him, unblinking.  Mummers and monkeys require applause. So did Aerys, for that matter. You did as you were commanded, and I am sure it was to the best of your ability. No one denies the part you played.    The part I played?  What nostrils Tyrion had left must surely have flared.  I saved your bloody city, it seems to me.    Most people seem to feel that it was my attack on Lord Stannis’s flank that turned the tide of battle. Lords Tyrell, Rowan, Redwyne, and Tarly fought nobly as well, and I’m told it was your sister Cersei who set the pyromancers to making the wildfire that destroyed the Baratheon fleet.    While all I did was get my nosehairs trimmed, is that it?  Tyrion could not keep the bitterness out of his voice.   Your chain was a clever stroke, and crucial to our victory. Is that what you wanted to hear? I am told we have you to thank for our Dornish alliance as well. You may be pleased to learn that Myrcella has arrived safely at Sunspear. Ser Arys Oakheart writes that she has taken a great liking to Princess Arianne, and that Prince Trystane is enchanted with her. I mislike giving House Martell a hostage, but I suppose that could not be helped.    We’ll have our own hostage,  Tyrion said.  A council seat was also part of the bargain. Unless Prince Doran brings an army when he comes to claim it, he’ll be putting himself in our power.    Would that a council seat were all Martell came to claim,  Lord Tywin said.  You promised him vengeance as well.    I promised him justice.    Call it what you will. It still comes down to blood.    Not an item in short supply, surely? I splashed through lakes of it during the battle.  Tyrion saw no reason not to cut to the heart of the matter.  Or have you grown so fond of Gregor Clegane that you cannot bear to part with him?    Ser Gregor has his uses, as did his brother. Every lord has need of a beast from time to time… a lesson you seem to have learned, judging from Ser Bronn and those clansmen of yours.   Tyrion thought of Timett’s burned eye, Shagga with his axe, Chella in her necklace of dried ears. And Bronn. Bronn most of all.  The woods are full of beasts,  he reminded his father.  The alleyways as well.    True. Perhaps other dogs would hunt as well. I shall think on it. If there is nothing else…    You have important letters, yes.  Tyrion rose on unsteady legs, closed his eyes for an instant as a wave of dizziness washed over him, and took a shaky step toward the door. Later, he would reflect that he should have taken a second, and then a third. Instead he turned.  What do I want, you ask? I’ll tell you what I want. I want what is mine by rights. I want Casterly Rock.   His father’s mouth grew hard.  Your brother’s birthright?    The knights of the Kingsguard are forbidden to marry, to father children, and to hold land, you know that as well as I. The day Jaime put on that white cloak, he gave up his claim to Casterly Rock, but never once have you acknowledged it. It’s past time. I want you to stand up before the realm and proclaim that I am your son and your lawful heir.   Lord Tywin’s eyes were a pale green flecked with gold, as luminous as they were merciless.  Casterly Rock,  he declared in a flat cold dead tone. And then,  Never.   The word hung between them, huge, sharp, poisoned.  I knew the answer before I asked, Tyrion thought. Eighteen years since Jaime joined the Kingsguard, and I never once raised the issue. I must have known. I must always have known.  Why?  he made himself ask, though he knew he would rue the question.   You ask that? You, who killed your mother to come into the world? You are an ill-made, devious, disobedient, spiteful little creature full of envy, lust, and low cunning. Men’s laws give you the right to bear my name and display my colors, since I cannot prove that you are not mine. To teach me humility, the gods have condemned me to watch you waddle about wearing that proud lion that was my father’s sigil and his father’s before him. But neither gods nor men shall ever compel me to let you turn Casterly Rock into your whorehouse.    My whorehouse?  The dawn broke; Tyrion understood all at once where this bile had come from. He ground his teeth together and said,  Cersei told you about Alayaya.    Is that her name? I confess, I cannot remember the names of all your whores. Who was the one you married as a boy?    Tysha.  He spat out the answer, defiant.   And that camp follower on the Green Fork?    Why do you care?  he asked, unwilling even to speak Shae’s name in his presence."
}