{
  "id": "8710c8d71e699a42dbb9aa7bcbd819042f702276",
  "text": "  Harry found Ron at the back of the library, measuring his History of Magic homework. Professor Binns had asked for a threefoot-long composition on \"The Medieval Assembly of European   Wizards.\"  \"I don't believe it, I'm still eight inches short  said Ron fu  riously, letting go of his parchment, which sprang back into a roll. \"And Hermione's done four feet seven inches and her writing's tiny. \"  \"Where is she?\" asked Harry, grabbing the tape measure and unrolling his own homework.  \"Somewhere over there,\" said Ron, pointing along the shelves. \"Looking for another book. I think she's trying to read the whole library before Christmas.\"  Harry told Ron about Justin Finch-Fletchley running away from him.  \"Dunno why you care. I thought he was a bit of an idiot,\" said Ron, scribbling away, making his writing as large as possible. \"All that junk about Lockhart being so great -\"  Hermione emerged from between the bookshelves. She looked irritable and at last seemed ready to talk to them.  \"All the copies of Hogwarts, A History have been taken out,\" she said, sitting down next to Harry and Ron. \"And there's a two-week waiting list. I wish I hadn't left my copy at home, but I couldn't fit it in my trunk with all the Lockhart books.\"  \"Why do you want it?\" said Harry.  *141*  \"The same reason everyone else wants it,\" said Hermione, \"to read up on the legend of the Chamber of Secrets.\"  \"What's that?\" said Harry quickly.  \"That's just it. I can't remember,\" said Hermione, biting her lip. \"And I can't find the story anywhere else -\"  \"Hermione, let me read your composition,\" said Ron desperately, checking his watch.  \"No, I won't,\" said Hermione, suddenly severe. \"You've had ten days to finish it -\"  \"I only need another two inches, come on -\"  The bell rang. Ron and Hermione led the way to History of Magic, bickering.  History of Magic was the dullest subject on their schedule. Professor Binns, who taught it, was their only ghost teacher, and the most exciting thing that ever happened in his classes was his entering the room through the blackboard. Ancient and shriveled, many people said he hadn't noticed he was dead. He had simply got up to teach one day and left his body behind him in an armchair in front of the staff room fire; his routine had not varied in the slightest since.  Today was as boring as ever. Professor Binns opened his notes and began to read in a flat drone like an old vacuum cleaner until nearly everyone in the class was in a deep stupor, occasionally coming to long enough to copy down a name or date, then falling asleep again. He had been speaking for half an hour when something happened that had never happened before. Hermione put up her hand.  Professor Binns, glancing up in the middle of a deadly dull lec  *148*  ture on the International Warlock Convention of 1289, looked amazed.  \"Miss - er -?\"  \"Granger, Professor. I was wondering if you could tell us anything about the Chamber of Secrets,\" said Hermione in a clear voice.  Dean Thomas, who had been sitting with his mouth hanging open, gazing out of the window, jerked out of his trance; Lavender Brown's head came up off her arms and Neville Longbottom's elbow slipped off his desk.  Professor Binns blinked.  \"My subject is History of Magic,\" he said in his dry, wheezy voice. \"I deal with facts, Miss Granger, not myths and legends.\" He cleared his throat with a small noise like chalk s!-ping and continued, \"In September of that year, a subcommittee of Sardinian sorcerers  \"  He stuttered to a halt. Hermione's hand was waving in the air again.  \"Miss Grant?\"  \"Please, sir, don't legends always have a basis in fact?\"  Professor Binns was looking at her in such amazement, Harry was sure no student had ever interrupted him before, alive or dead.  \"Well,\" said Professor Binns slowly, \"yes, one could argue that, I suppose.\" He peered at Hermione as though he had never seen a student properly before. \"However, the legend of which you speak is such a very sensational, even ludicrous tale -\"  But the whole class was now hanging on Professor Binns's every word. He looked dimly at them all, every face turned to his. Harry  *149*  could tell he was completely thrown by such an unusual show of interest.  \"Oh, very well,\" he said slowly. \"Let me see ... the Chamber of Secrets ...  \"You all know, of course, that Hogwarts was founded over a thousand years ago - the precise date is uncertain - by the four greatest witches and wizards of the age. The four school Houses are named after them: Godric Gryffindor, Helga Hufflepuff, Rowena Ravenclaw, and Salazar Slytherin. They built this castle together, far from prying Muggle eyes, for it was an age when magic was feared by common people, and witches and wizards suffered much persecution.\"  He paused, gazed blearily around the room, and continued.  \"For a few years, the founders worked in harmony together, seeking out youngsters who showed signs of magic and bringing them to the castle to be educated. But then disagreements sprang up between them."
}