{
  "id": "875526b8858c47e698292265b215fa54dbea83b5",
  "text": "  Nearly  seventy of the ruffians lay dead on the  field, and a dozen  were prisoners. Nineteen hobbits  were killed, a nd  some  thirty were wounded. The dead  ruffians were laden on waggons and hauled off  to an  old sand-pit nearby and there buried:  in the Battle  Pit, as it  was  afterwards called. The fallen hobbits were  laid together in a grave on  the  hill-side,  wher e later a great  stone was set up with a garden about it. So  ended the  Battle of Bywater, 1419, the last battle fought in the Shire, and  the  only battle since the  Greenfields, 1147, away up in the Northfarthing.  In consequence, though it happily cost very few lives, it has a  chapter  to  itself in the Red Book, and  the names of all those  who took part were made  into a Roll, and learned by heart by Shire-historians. The very considerable  rise in the fame and fortune of the Cottons dates from this time; but at the  top of the Roll  in all  accounts  stand the names of  Captains Meriadoc and  Peregrin.       Frodo had been in the battle, but he had not drawn sword, and his chief  part had  been to prevent the hobbits  in their wrath at  their losses, from  slaying those  of  their enemies who  threw  down  their  weapons. When  the   ####-fighting  was over,  and  the later labours were ordered, Merry, Pippin, and  Sam joined him, and  they rode back with the Cottons. They ate a late midday  meal, and then Frodo said with a  sigh: 'Well, I suppose it is time now that  we dealt with the \"Chief\".'       'Yes indeed; the  sooner the better,'  said  Merry.  'And don't be  too  gentle! He's  responsible  for bringing  in these ruffians, and  for all the  evil they have done.'       Farmer Cotton  collected an escort  of some two  dozen  sturdy hobbits.  'For it's only a guess that  there is no ruffians left at Bag End,' he said.  'We don't know.' Then  they set out  on foot. Frodo, Sam,  Merry, and Pippin  led the way.       It was one of the saddest hours  in their lives. The great chimney rose  up  before them;  and as  they drew  near the old  village across the Water,  through rows of new  mean houses along each side of the  road, they saw  the  new mill in all its  frowning and  dirty ugliness:  a  great  brick building  straddling  the  stream, which  it  fouled  with  a  steaming  and  stinking  overflow. All along the Bywater Road every tree had been felled.       As  they crossed the bridge  and looked up the Hill  they  gasped. Even  Sam's vision in the Mirror  had not prepared  him for what they saw. The Old  Grange  on the  west side had been knocked down, and its place taken by rows  of tarred sheds. All the chestnuts were gone. The  banks and  hedgerows were  broken. Great  waggons wer e standing in  disorder in  a field beaten bare of  grass. Bagshot  Row was a yawning sand and gravel quarry. Bag End up.  beyond  could not be seen for a clutter of large huts.       'They've cut it down!' cried Sam. 'They've cut down the Party Tree!' He  pointed to where the tree. had stood under which Bilbo had made his Farewell  Speech. It was lying lopped and  dead in the field. As if this was the  last  straw Sam burst into tears.       A laugh put an end to them. There was a surly hobbit lounging over  the  low wall of the  mill-yard. He was grimy -faced and  black -handed.  'Don't  'ee  like it, Sam?'  he sneered. 'But  you always  was soft. I thought you'd gone   off in  one o' them ships  you used to prattle about, sailing, sailing. What  d'you want to come back for? We've work to do in the Shire now.'       'So I see,' said Sam. 'No time for washing, but time for wall-propping.  But  see here,  Master  Sandyman,  I've a score to pay in this village,  and  don't you make it any longer with your  jeering, or you'll  foot a bill  too   ####-big for your purse.'       Ted Sandyman spat over the wall: 'Garn!' he said. 'You can't touch  me.   I'm  a friend o'  the  Boss's. But he'll touch you all right, if I have  any  more of your mouth.'       'Don't  waste any more words  on  the  fool, Sam!' said Frodo. 'I  hope  there are not many more hobbits that have become like  this.  It  would be a   worse trouble than all the damage the Men have done.'       'You are dirty and insolent, Sandyman,' said Merry. 'And also very much  out of your reckoning. We are just going up the Hill to remove your precious  Boss. We have dealt with his Men.'       Ted gaped, for at  that moment he first caught sight of the escort that  at a sign from Merry now marched over the bridge. Dashing back into the mill  he ran out with a horn and blew it loudly.       'Save your breath!' laughed Merry. 'I've a better.' Then lifting up his  silver horn he winded it, and its clear call rang  over the Hill; and out of  the  holes and sheds and shabby houses of Hobbiton the hobbits answered, and  came pouring out, and  with cheers and loud cries they followed  the company  up the road to Bag End.       At the top of the lane the party halted, and Frodo and his friends went  on; and they came at  last to the once beloved place."
}