{
  "id": "875730e90b053d2a59d0872f4afcbe323a050cf8",
  "text": " ...\" \"You stay here with him!\"  Harry said to Krum.  \"I'll get Dumbledore, I'll be quicker, I know where his office is -\" \"He is mad,\" said Krum doubtfully, staring down at Crouch, who was still gabbling to the tree, apparently convinced it was Percy. \"Just stay with him,\" said Harry, starting to get up, but his movement seemed to trigger another abrupt change in Mr. Crouch, who seized him hard around the knees and pulled Harry back to the ground. \"Don't. . . leave .. . me!\"  he whispered, his eyes bulging again.  \"I... escaped .. . must warn . . . must tell... see Dumbledore . . . my fault... all my fault. . . Bertha . . . dead ... all my fault. .. my son ... my fault... tell Dumbledore ... Harry Potter ... the Dark Lord . . . stronger . . . Harry Potter ...\" \"I'll get Dumbledore if you let me go, Mr. Crouch!\" said Harry. He looked furiously around at Krum. \"Help me, will you?\" Looking extremely apprehensive, Krum moved forward and squatted down next to Mr. Crouch. \"Just keep him here,\" said Harry, pulling himself free of Mr. Crouch.  \"I'll be back with Dumbledore.\" \"Hurry, von't you?\"  Krum called after him as Harry sprinted away from the forest and up through the dark grounds.  They were deserted; Bagman, Cedric, and Fleur had disappeared.  Harry tore up the stone steps, through the oak front doors, and off up the marble staircase, toward the second floor. Five minutes later he was hurtling toward a stone gargoyle standing halfway along an empty corridor. \"Sher - sherbet lemon!\" he panted at it. This was the password to the hidden staircase to Dumbledore's office - or at least, it had been two years ago.  The password had evidently changed, however, for the stone gargoyle did not spring to life and jump aside, but stood frozen, glaring at Harry malevolently. \"Move!\" Harry shouted at it. \"C'mon!\" But nothing at Hogwarts had ever moved just because he shouted at it; he knew it was no good.  He looked up and down the dark corridor.  Perhaps Dumbledore was in the staffroom?  He started running as fast as he could toward the staircase - \"POTTER!\" Harry skidded to a halt and looked around. Snape had just emerged from the hidden staircase behind the stone gargoyle.  The wall was sliding shut behind him even as he beckoned Harry back toward him. \"What are you doing here, Potter?\" \"I need to see Professor Dumbledore!\"  said Harry, running back up the corridor and skidding to a standstill in front of Snape instead.  \"It's Mr. Crouch . . . he's just turned up ... he's in the forest... he's asking -\" \"What is this rubbish?\" said Snape, his black eyes glittering. \"What are you talking about?\" \"Mr. Crouch!\"  Harry shouted.  \"From the Ministry!  He's ill or something - he's in the forest, he wants to see Dumbledore!  Just give me the password up to -\" \"The headmaster is busy. Potter,\" said Snape, his thin mouth curling into an unpleasant smile. \"I've got to tell Dumbledore!\" Harry yelled. \"Didn't you hear me. Potter?\" Harry could tell Snape was thoroughly enjoying himself, denying Harry the thing he wanted when he was so panicky. \"Look,\" said Harry angrily, \"Crouch isn't right - he's - he's out of his mind - he says he wants to warn -\" The stone wall behind Snape slid open.  Dumbledore was standing there, wearing long green robes and a mildly curious expression.  \"Is there a problem?\" he said, looking between Harry and Snape. \"Professor!\" Harry said, sidestepping Snape before Snape could speak, \"Mr. Crouch is here - he's down in the forest, he wants to speak to you!\" Harry expected Dumbledore to ask questions, but to his relief, Dumbledore did nothing of the sort. \"Lead the way,\" he said promptly, and he swept off along the corridor behind Harry, leaving Snape standing next to the gargoyle and looking twice as ugly. \"What did Mr. Crouch say. Harry?\" said Dumbledore as they walked swiftly down the marble staircase. \"Said he wants to warn you . . . said he's done something terrible ... he mentioned his son . . . and Bertha Jorkins .. . and - and Voldemort. . . something about Voldemort getting stronger. ...\" \"Indeed,\" said Dumbledore, and he quickened his pace as they hurried out into the pitch-darkness. \"He's not acting normally,\" Harry said, hurrying along beside Dumbledore.  \"He doesn't seem to know where he is.  He keeps talking like he thinks Percy Weasley's there, and then he changes, and says he needs to see you. ... I left him with Viktor Krum.\" \"You did?\"  said Dumbledore sharply, and he began to take longer strides still, so that Harry was running to keep up.  \"Do you know if anybody else saw Mr. Crouch?\" \"No,\" said Harry.  \"Krum and I were talking, Mr. Bagman had just finished telling us about the third task, we stayed behind, and then we saw Mr. Crouch coming out of the forest -\" \"Where are they?\" said Dumbledore as the Beauxbatons carriage emerged from the darkness. \"Over here,\" said Harry, moving in front of Dumbledore, leading the way through the trees.  He couldn't hear Crouch's voice anymore, but he knew where he was going; it hadn't been much past the Beauxbatons carriage ."
}