{
  "id": "877f3f7ba85f23c4792bd751d449dd2cdb3c73f5",
  "text": "  I have heard that in the Sunset Kingdoms men take solemn vows to keep chaste and father no children, but live only for their duty. Is it not so?    It is,  Arstan said, when the question was put.  There are many such orders. The maesters of the Citadel, the septons and septas who serve the Seven, the silent sisters of the dead, the Kingsguard and the Night’s Watch…    Poor things,  growled the slaver, after the translation.  Men were not made to live thus. Their days are a torment of temptation, any fool must see, and no doubt most succumb to their baser selves. Not so our Unsullied. They are wed to their swords in a way that your Sworn Brothers cannot hope to match. No woman can ever tempt them, nor any man.   His girl conveyed the essence of his speech, more politely.  There are other ways to tempt men, besides the flesh,  Arstan Whitebeard objected, when she was done.   Men, yes, but not Unsullied. Plunder interests them no more than rape. They own nothing but their weapons. We do not even permit them names.    No names?  Dany frowned at the little scribe.  Can that be what the Good Master said? They have no names?    It is so, Your Grace.   Kraznys stopped in front of a Ghiscari who might have been his taller fitter brother, and flicked his lash at a small bronze disk on the swordbelt at his feet.  There is his name. Ask the whore of Westeros whether she can read Ghiscari glyphs.  When Dany admitted that she could not, the slaver turned to the Unsullied.  What is your name?  he demanded.   This one’s name is Red Flea, your worship.   The girl repeated their exchange in the Common Tongue.   And yesterday, what was it?    Black Rat, your worship.    The day before?    Brown Flea, your worship.    Before that?    This one does not recall, your worship. Blue Toad, perhaps. Or Blue Worm.    Tell her all their names are such,  Kraznys commanded the girl.  It reminds them that by themselves they are vermin. The name disks are thrown in an empty cask at duty’s end, and each dawn plucked up again at random.    More madness,  said Arstan, when he heard.  How can any man possibly remember a new name every day?    Those who cannot are culled in training, along with those who cannot run all day in full pack, scale a mountain in the black of night, walk across a bed of coals, or slay an infant.   Dany’s mouth surely twisted at that. Did he see, or is he blind as well as cruel? She turned away quickly, trying to keep her face a mask until she heard the translation. Only then did she allow herself to say,  Whose infants do they slay?    To win his spiked cap, an Unsullied must go to the slave marts with a silver mark, find some wailing newborn, and kill it before its mother’s eyes. In this way, we make certain that there is no weakness left in them.   She was feeling faint. The heat, she tried to tell herself.  You take a babe from its mother’s arms, kill it as she watches, and pay for her pain with a silver coin?   When the translation was made for him, Kraznys mo Nakloz laughed aloud.  What a soft mewling fool this one is. Tell the whore of Westeros that the mark is for the child’s owner, not the mother. The Unsullied are not permitted to steal.  He tapped his whip against his leg.  Tell her that few ever fail that test. The dogs are harder for them, it must be said. We give each boy a puppy on the day that he is cut. At the end of the first year, he is required to strangle it. Any who cannot are killed, and fed to the surviving dogs. It makes for a good strong lesson, we find.   Arstan Whitebeard tapped the end of his staff on the bricks as he listened to that. Tap tap tap. Slow and steady. Tap tap tap. Dany saw him turn his eyes away, as if he could not bear to look at Kraznys any longer.   The Good Master has said that these eunuchs cannot be tempted with coin or flesh,  Dany told the girl,  but if some enemy of mine should offer them freedom for betraying me…    They would kill him out of hand and bring her his head, tell her that,  the slaver answered.  Other slaves may steal and hoard up silver in hopes of buying freedom, but an Unsullied would not take it if the little mare offered it as a gift. They have no life outside their duty. They are soldiers, and that is all.    It is soldiers I need,  Dany admitted.   Tell her it is well she came to Astapor, then. Ask her how large an army she wishes to buy.    How many Unsullied do you have to sell?    Eight thousand fully trained and available at present. We sell them only by the unit, she should know. By the thousand or the century. Once we sold by the ten, as household guards, but that proved unsound. Ten is too few. They mingle with other slaves, even freemen, and forget who and what they are.  Kraznys waited for that to be rendered in the Common Tongue, and then continued.  This beggar queen must understand, such wonders do not come cheaply. In Yunkai and Meereen, slave swordsmen can be had for less than the price of their swords, but Unsullied are the finest foot in all the world, and each represents many years of training."
}