{
  "id": "87815726e5b19c88bd937f897f253b267e7577bb",
  "text": " \"Excuse me, I don't like people just because they're handsome!\"  said Hermione indignantly. Ron gave a loud false cough, which sounded oddly like \"Lockhart!\" The appearance of the sign in the entrance hall had a marked effect upon the inhabitants of the castle.  During the following week, there seemed to be only one topic of conversation, no matter where Harry went:  the Triwizard Tournament. Rumors were flying from student to student like highly contagious germs:  who was going to try for Hogwarts champion, what the tournament would involve, how the students from Beauxbatons and Durmstrang differed from themselves. Harry noticed too that the castle seemed to be undergoing an extra-thorough cleaning. Several grimy portraits had been scrubbed, much to the displeasure of their subjects, who sat huddled in their frames muttering darkly and wincing as they felt their raw pink faces. The suits of armor were suddenly gleaming and moving without squeaking, and Argus Filch, the caretaker, was behaving so ferociously to any students who forgot to wipe their shoes that he terrified a pair of first-year girls into hysterics. Other members of the staff seemed oddly tense too. \"Longbottom, kindly do not reveal that you can't even perform a simple Switching Spell in front of anyone from Durmstrang!\"  Professor McGonagall barked at the end of one particularly difficult lesson, during which Neville had accidentally transplanted his own ears onto a cactus. When they went down to breakfast on the morning of the thirtieth of October, they found that the Great Hall had been decorated overnight.  Enormous silk banners hung from the walls, each of them representing a Hogwarts House:  red with a gold lion for Gryffiindor, blue with a bronze eagle for Ravenclaw, yellow with a black badger for Hufflepuff, and green with a silver serpent for Slytherin.  Behind the teachers' table, the largest banner of all bore the Hogwarts coat of arms: lion, eagle, badger, and snake united around a large letter H. Harry, Ron, and Hermione sat down beside Fred and George at the Gryffindor table. Once again, and most unusually, they were sitting apart from everyone else and conversing in low voices. Ron led the way over to them. \"It's a bummer, all right,\" George was saying gloomily to Fred. \"But if he won't talk to us in person, we'll have to send him the letter after all.  Or we'll stuff it into his hand.  He can't avoid us forrever. \"Who's avoiding you?\" said Ron, sitting down next to them. \"Wish you would,\" said Fred, looking irritated at the interruption. \"What's a bummer?\" Ron asked George. \"Having a nosy git like you for a brother,\" said George. \"You two got any ideas on the Triwizard Tournament yet?\"  Harry asked.  \"Thought any more about trying to enter?\" \"I asked McGonagall how the champions are chosen but she wasn't telling,\" said George bitterly.  \"She just told me to shut up and get on with transfiguring my raccoon.\" \"Wonder what the tasks are going to be?\"  said Ron thoughtfully.  \"You know, I bet we could do them, Harry.  We've done dangerous stuff before. . . .\" \"Not in front of a panel of judges, you haven't,\" said Fred.  \"McGonagall says the champions get awarded points according to how well they've done the tasks.\" \"Who are the judges?\" Harry asked. \"Well, the Heads of the participating schools are always on the panel,\" said Hermione, and everyone looked around at her, rather surprised, \"because all three of them were injured during the Tournament of 1792, when a cockatrice the champions were supposed to be catching went on the rampage.\" She noticed them all looking at her and said, with her usual air of impatience that nobody else had read all the books she had, \"It's all in Hogwarts, A History.  Though, of course, that book's not entirely reliable.  A Revised History of Hogwarts would be a more accurate title.  Or A Highly Biased and Selective History of Hogwarts, Which Glosses Over the Nastier Aspects of the School.\" \"What are you on about?\" said Ron, though Harry thought he knew what was coming. \"House-elves!\" said Hermione, her eyes flashing.  \"Not once, in over a thousand pages, does Hogwarts, A History mention that we are all colluding in the oppression of a hundred slaves!\" Harry shook his head and applied himself to his scrambled eggs.  His and Ron's lack of enthusiasm had done nothing whatsoever to curb Hermione's determination to pursue justice for house-elves. True, both of them had paid two Sickles for a S.P.E.W. badge, but they had only done it to keep her quiet.  Their Sickles had been wasted, however; if anything, they seemed to have made Hermione more vociferous.  She had been badgering Harry and Ron ever since, first to wear the badges, then to persuade others to do the same, and she had also taken to rattling around the Gryffindor common room every evening, cornering people and shaking the collecting tin under their noses. \"You do realize that your sheets are changed, your fires lit, your classrooms cleaned, and your food cooked by a group of magical creatures who are unpaid and enslaved?\"  she kept saying fiercely."
}