{
  "id": "885b9e7bc17098433cc1d677432530ce063eb389",
  "text": "    Two honors! Two! Two!  The merchant was panting heavily from the effort of running backward.   Pay him before he kills himself,  Dany told Ser Jorah, wondering what she was going to do with a huge brass platter. She turned back as he reached for his coins, intending to put an end to this mummer’s farce. The blood of the dragon would not be herded through the bazaar by an old man and a fat eunuch.  A Qartheen stepped into her path.  Mother of Dragons, for you.  He knelt and thrust a jewel box into her face.  Dany took it almost by reflex. The box was carved wood, its mother-of-pearl lid inlaid with jasper and chalcedony.  You are too generous.  She opened it. Within was a glittering green scarab carved from onyx and emerald. Beautiful, she thought. This will help pay for our passage. As she reached inside the box, the man said,  I am so sorry,  but she hardly heard.  The scarab unfolded with a hiss.  Dany caught a glimpse of a malign black face, almost human, and an arched tail dripping venom… and then the box flew from her hand in pieces, turning end over end. Sudden pain twisted her fingers. As she cried out and clutched her hand, the brass merchant let out a shriek, a woman screamed, and suddenly the Qartheen were shouting and pushing each other aside. Ser Jorah slammed past her, and Dany stumbled to one knee. She heard the hiss again. The old man drove the butt of his staff into the ground, Aggo came riding through an eggseller’s stall and vaulted from his saddle, Jhogo’s whip cracked overhead, Ser Jorah slammed the eunuch over the head with the brass platter, sailors and whores and merchants were fleeing or shouting or both…   Your Grace, a thousand pardons.  The old man knelt.  It’s dead. Did I break your hand?   She closed her fingers, wincing.  I don’t think so.    I had to knock it away,  he started, but her bloodriders were on him before he could finish. Aggo kicked his staff away and Jhogo seized him round the shoulders, forced him to his knees, and pressed a dagger to his throat.  Khaleesi, we saw him strike you. Would you see the color of his blood?    Release him.  Dany climbed to her feet.  Look at the bottom of his staff, blood of my blood.  Ser Jorah had been shoved off his feet by the eunuch. She ran between them as arakh and longsword both came flashing from their sheaths.  Put down your steel! Stop it!    Your Grace?  Mormont lowered his sword only an inch.  These men attacked you.    They were defending me.  Dany snapped her hand to shake the sting from her fingers.  It was the other one, the Qartheen.  When she looked around he was gone.  He was a Sorrowful Man. There was a manticore in that jewel box he gave me. This man knocked it out of my hand.  The brass merchant was still rolling on the ground. She went to him and helped him to his feet.  Were you stung?    No, good lady,  he said, shaking,  or else I would be dead. But it touched me, aieeee, when it fell from the box it landed on my arm.  He had soiled himself, she saw, and no wonder.  She gave him a silver for his trouble and sent him on his way before she turned back to the old man with the white beard.  Who is it that I owe my life to?    You owe me nothing, Your Grace. I am called Arstan, though Belwas named me Whitebeard on the voyage here.  Though Jhogo had released him the old man remained on one knee. Aggo picked up his staff, turned it over, cursed softly in Dothraki, scraped the remains of the manticore off on a stone, and handed it back.   And who is Belwas?  she asked.  The huge brown eunuch swaggered forward, sheathing his arakh.  I am Belwas. Strong Belwas they name me in the fighting pits of Meereen. Never did I lose.  He slapped his belly, covered with scars.  I let each man cut me once, before I kill him. Count the cuts and you will know how many Strong Belwas has slain.   Dany had no need to count his scars; there were many, she could see at a glance.  And why are you here, Strong Belwas?    From Meereen I am sold to Qohor, and then to Pentos and the fat man with sweet stink in his hair. He it was who send Strong Belwas back across the sea, and old Whitebeard to serve him.   The fat man with sweet stink in his hair… Illyrio?  she said.  You were sent by Magister Illyrio?    We were, Your Grace,  old Whitebeard replied.  The Magister begs your kind indulgence for sending us in his stead, but he cannot sit a horse as he did in his youth, and sea travel upsets his digestion.  Earlier he had spoken in the Valyrian of the Free Cities, but now he changed to the Common Tongue.  I regret if we caused you alarm. If truth be told, we were not certain, we expected someone more… more…    Regal?  Dany laughed. She had no dragon with her, and her raiment was hardly queenly.  You speak the Common Tongue well, Arstan. Are you of Westeros?    I am. I was born on the Dornish Marches, Your Grace. As a boy I squired for a knight of Lord Swann’s household.  He held the tall staff upright beside him like a lance in need of a banner."
}