{
  "id": "88d29fc4ec29ce7d8fd391ab651ebb7f8bd4ab64",
  "text": " Nearby, Marillion the singer sat oiling his woodharp, complaining of what the damp was doing to his strings.   We must have some rest, my lady,  the hedge knight Ser Willis Wode was saying to Catelyn Stark as Tyrion approached. He was Lady Whent’s man, stiff-necked and stolid, and the first to rise to aid Catelyn Stark back at the inn.   Ser Willis speaks truly, my lady,  Ser Rodrik said.  This is the third horse we have lost—    We will lose more than horses if we’re overtaken by the Lannisters,  she reminded them. Her face was windburnt and gaunt, but it had lost none of its determination.   Small chance of that here,  Tyrion put in.   The lady did not ask your views, dwarf,  snapped Kurleket, a great fat oaf with short-cropped hair and a pig’s face. He was one of the Brackens, a man-at-arms in the service of Lord Jonos. Tyrion had made a special effort to learn all their names, so he might thank them later for their tender treatment of him. A Lannister always paid his debts. Kurleket would learn that someday, as would his friends Lharys and Mohor, and the good Ser Willis, and the sellswords Bronn and Chiggen. He planned an especially sharp lesson for Marillion, him of the woodharp and the sweet tenor voice, who was struggling so manfully to rhyme imp with gimp and limp so he could make a song of this outrage.   Let him speak,  Lady Stark commanded.  Tyrion Lannister seated himself on a rock.  By now our pursuit is likely racing across the Neck, chasing your lie up the kingsroad… assuming there is a pursuit, which is by no means certain. Oh, no doubt the word has reached my father… but my father does not love me overmuch, and I am not at all sure that he will bother to bestir himself.  It was only half a lie; Lord Tywin Lannister cared not a fig for his deformed son, but he tolerated no slights on the honor of his House.  This is a cruel land, Lady Stark. You’ll find no succor until you reach the Vale, and each mount you lose burdens the others all the more. Worse, you risk losing me. I am small, and not strong, and if I die, then what’s the point?  That was no lie at all; Tyrion did not know how much longer he could endure this pace.   It might be said that your death is the point, Lannister,  Catelyn Stark replied.   I think not,  Tyrion said.  If you wanted me dead, you had only to say the word, and one of these staunch friends of yours would gladly have given me a red smile.  He looked at Kurleket, but the man was too dim to taste the mockery.   The Starks do not murder men in their beds.    Nor do I,  he said.  I tell you again, I had no part in the attempt to kill your son.    The assassin was armed with your dagger.   Tyrion felt the heat rise in him.  It was not my dagger,  he insisted.  How many times must I swear to that? Lady Stark, whatever you may believe of me, I am not a stupid man. Only a fool would arm a common footpad with his own blade.   Just for a moment, he thought he saw a flicker of doubt in her eyes, but what she said was,  Why would Petyr lie to me?    Why does a bear shit in the woods?  he demanded.  Because it is his nature. Lying comes as easily as breathing to a man like Littlefinger. You ought to know that, you of all people.   She took a step toward him, her face tight.  And what does that mean, Lannister?   Tyrion cocked his head.  Why, every man at court has heard him tell how he took your maidenhead, my lady.    That is a lie!  Catelyn Stark said.   Oh, wicked little imp,  Marillion said, shocked.  Kurleket drew his dirk, a vicious piece of black iron.  At your word, m’lady, I’ll toss his lying tongue at your feet.  His pig eyes were wet with excitement at the prospect.  Catelyn Stark stared at Tyrion with a coldness on her face such as he had never seen.  Petyr Baelish loved me once. He was only a boy. His passion was a tragedy for all of us, but it was real, and pure, and nothing to be made mock of. He wanted my hand. That is the truth of the matter. You are truly an evil man, Lannister.    And you are truly a fool, Lady Stark. Littlefinger has never loved anyone but Littlefinger, and I promise you that it is not your hand that he boasts of, it’s those ripe breasts of yours, and that sweet mouth, and the heat between your legs.   Kurleket grabbed a handful of hair and yanked his head back in a hard jerk, baring his throat. Tyrion felt the cold kiss of steel beneath his chin.  Shall I bleed him, my lady?    Kill me and the truth dies with me,  Tyrion gasped.   Let him talk,  Catelyn Stark commanded.  Kurleket let go of Tyrion’s hair, reluctantly.  Tyrion took a deep breath.  How did Littlefinger tell you I came by this dagger of his? Answer me that.    You won it from him in a wager, during the tourney on Prince Joffrey’s name day.    When my brother Jaime was unhorsed by the Knight of Flowers, that was his story, no?    It was,  she admitted. A line creased her brow.   Riders!   The shriek came from the wind-carved ridge above them. Ser Rodrik had sent Lharys scrambling up the rock face to watch the road while they took their rest."
}