{
  "id": "88f598a4c07c51b07ac8e96ad395a16946e7a489",
  "text": "\"  \"No!\" said Thorin. \"There  is more  in you of good  than you know, child of  the  kindly West. Some  courage  and  some wisdom, blended  in measure.  If more of us  valued food and cheer and song above hoarded gold, it would be a merrier world.  But sad or merry, I must leave it now. Farewell!\"  Then Bilbo  turned  away,  and  he went  by  himself,  and  sat  alone wrapped  in  a  blanket, and, whether you believe it or not, he wept until his eyes were red and his  voice was hoarse. He was a kindly little soul. Indeed it was long before he had the  heart to make a joke again. \"A mercy it is,\" he said at last to himself, \"that I woke  up when I did. I wish Thorin were living, but I am glad that we parted in kindness.  You  are  a  fool,  Bilbo  Baggins,  and  you made  a  great mess  of  that  business with  the stone; and there was a battle, in spite of all your efforts to buy peace and quiet,  but I suppose you can hardly be blamed for that.\"  All  that  had  happened  after  he  was  stunned,  Bilbo  learned  later;  but  it  gave  him more sorrow than joy, and he was now weary of his adventure. He was aching  in  his  bones  for  the  homeward  journey. That,  however, was  a  little  delayed, so  in  the meantime I will tell something of events. The Eagles had long had suspicion of  the  goblins'  mustering;  from  their  watchfulness  the  movements  in  the  mountains  could not be altogether hid. So  they  too had gathered  in great numbers, under  the   ####-great  Eagle  of  the Misty Mountains;  and  at  length  smelling  battle  from  afar  they  had come  speeding down  the gale  in  the nick of  time. They  it was who dislodged  the  goblins  from  the  mountain-slopes,  casting  them  over  precipices,  or  driving  them down shrieking and bewildered among their foes. It was not long before they  had  freed  the  Lonely  Mountain,  and  elves  and  men  on  either  side  of  the  valley  could come at last to the help of the battle below.   But even with the Eagles they were still outnumbered.  In  that  last  hour  Beorn  himself  had  appeared  –  no  one  knew  how  or  from  where. He  came  alone,  and  in  bear's  shape;  and  he  seemed  to  have  grown  almost  to  giant-size  in  his wrath. The  roar  of  his  voice was  like  drums  and  guns;  and  he  tossed  wolves  and  goblins  from  his  path  like  straws  and  feathers.  He  fell  upon  their  rear,  and  broke  like  a  clap  of  thunder  through  the  ring.  The  dwarves  were  making  a  stand  still  about  their  lords  upon  a  low  rounded  hill.  Then  Beorn  stooped and lifted Thorin, who had fallen pierced with spears, and bore him out of  the  fray.  Swiftly  he  returned  and  his  wrath  was  redoubled,  so  that  nothing  could  withstand  him,  and  no  weapon  seemed  to  bite  upon  him.  He  scattered  the  bodyguard,  and  pulled  down Bolg  himself  and  crushed  him. Then  dismay  fell  on  the  Goblins  and  they  fled  in  all  directions.  But  weariness  left  their  enemies  with  the  coming  of  new  hope,  and  they  pursued  them  closely,  and  prevented  most  of  them from escaping where they could. They drove many of them into the Running  River, and such as fled south or west they hunted into the marshes about the Forest  River;  and  there  the  greater  part  of  the  last  fugitives  perished,  while  those  that  came  hardly  to  the Wood-elves'  realm  were  there  slain,  or  drawn  in  to  die  in  the  trackless  dark  of  Mirkwood.  Songs  have  said  that  three  parts  of  the  goblin  warriors of the North perished on that day, and the mountains had peace for many  a year.   Victory  had  been  assured  before  the  fall  of  night,  but  the  pursuit  was  still  on  foot, when  Bilbo  returned  to  the  camp;  and not many were  in  the valley  save  the  more grievously wounded.  \"Where are  the Eagles?\" he asked Gandalf  that evening, as he  lay wrapped  in  many warm blankets.  \"Some  are  in  the  hunt,\"  said  the  wizard,  \"but  most  have  gone  back  to  their  eyries.  They  would  not  stay  here,  and  departed  with  the  first  light  of  morning.  Dain has crowned their chief with gold, and sworn friendship with them for ever.\"  \"I  am  sorry.  I  mean,  I  should  have  liked  to  see  them  again,\"  said  Bilbo  sleepily;  \"perhaps  I  shall  see  them  on  the  way  home.  I  suppose  I  shall  be  going  home soon?\"   ####-\"As soon as you like,\" said the wizard.  Actually it was some days before Bilbo really set out.  They buried Thorin deep beneath the Mountain, and Bard laid the Arkenstone  upon his breast.  \"There let it lie till the Mountain falls!\" he said. \"May it bring good fortune to  all his  folk  that dwell here after!\" Upon his  tomb  the Elvenking  then  laid Orcrist,  the  elvish  sword  that  had  been  taken  from  Thorin  in  captivity.  It  is  said  in  songs  that it gleamed ever in the dark if foes approached, and the fortress of the dwarves  could  not  be  taken  by  surprise."
}