{
  "id": "894ca954dddc6d96c39b8109c72195a121366664",
  "text": "  Winky remained on her knees, trembling, her hands over her face.  Dumbledore forced the mans mouth open and poured three drops inside it.  Then he pointed his wand at the mans chest and said, \"Ennervate.\" Crouch's son opened his eyes.  His face was slack, his gaze unfocused.  Dumbledore knelt before him, so that their faces were level. \"Can you hear me?\"  Dumbledore asked quietly. The man's eyelids flickered. \"Yes,\" he muttered. \"I would like you to tell us,\" said Dumbledore softly, \"how you came to be here.  How did you escape from Azkaban?\" Crouch took a deep, shuddering breath, then began to speak in a flat, expressionless voice. \"My mother saved me.  She knew she was dying.  She persuaded my father to rescue me as a last favor to her.  He loved her as he had never loved me.  He agreed.  They came to visit me.  They gave me a draft of Polyjuice Potion containing one of my mother's hairs.  She took a draft of Polyjuice Potion containing one of my hairs.  We took on each other's appearance.\" Winky was shaking her head, trembling. \"Say no more.  Master Barty, say no more, you is getting your father into trouble!\" But Crouch took another deep breath and continued in the same flat voice. \"The dementors are blind.  They sensed one healthy, one dying person entering Azkaban.  They sensed one healthy, one dying person leaving it.  My father smuggled me out, disguised as my mother, in case any prisoners were watching through their doors. \"My mother died a short while afterward in Azkaban.  She was careful to drink Polyjuice Potion until the end.  She was buried under my name and bearing my appearance. Everyone believed her to be me.\" The man's eyelids flickered. \"And what did your father do with you, when he had got you home?\"  said Dumbledore quietly. \"Staged my mother's death.  A quiet, private funeral.  That grave is empty.  The house-elf nursed me back to health.  Then I had to be concealed.  I had to be controlled.  My father had to use a number of spells to subdue me.  When I had recovered my strength, I thought only of finding my master . . . of returning to his service.\" \"How did your father subdue you?\"  said Dumbledore. \"The Imperius Curse,\" Moody said.  \"I was under my fathers control.  I was forced to wear an Invisibility Cloak day and night.  I was always with the house-elf.  She was my keeper and caretaker.  She pitied me.  She persuaded my father to give me occasional treats.  Rewards for my good behavior.\" \"Master Barty, Master Barty,\" sobbed Winky through her hands.  \"You isn't ought to tell them, we is getting in trouble. ...\" \"Did anybody ever discover that you were still alive?\"  said Dumbledore softly.  \"Did anyone know except your father and the house-elf?\" \"Yes,\" said Crouch, his eyelids flickering again.  \"A witch in my father's office.  Bertha Jorkins.  She came to the house with papers for my father s signature.  He was not at home. Winky showed her inside and returned to the kitchen, to me.  But Bertha Jorkins heard Winky talking to me.  She came to investigate.  She heard enough to guess who was hiding under the Invisibility Cloak.  My father arrived home.  She confronted him.  He put a very powerful Memory Charm on her to make her forget what she'd found out.  Too powerful.  He said it damaged her memory permanently.\" \"Why is she coming to nose into my masters private business?\"  sobbed Winky.  \"Why isn't she leaving us be?\" \"Tell me about the Quidditch World Cup,\" said Dumbledore. \"Winky talked my father into it,\" said Crouch, still in the same monotonous voice.  \"She spent months persuading him.  I had not left the house for years.  I had loved Quidditch.  Let him go, she said.  He will be in his Invisibility Cloak.  He can watch.  Let him smell fresh air for once.  She said my mother would have wanted it.  She told my father that my mother had died to give me freedom.  She had not saved me for a life of imprisonment.  He agreed in the end. \"It was carefully planned.  My father led me and Winky up to the Top Box early in the day.  Winky was to say that she was saving a seat for my father.  I was to sit there, invisible. When everyone had left the box, we would emerge.  Winky would appear to be alone.  Nobody would ever know. \"But Winky didn't know that I was growing stronger.  I was starting to fight my father's Imperius Curse.  There were times when I was almost myself again.  There were brief periods when I seemed outside his control.  It happened, there, in the Top Box.  It was like waking from a deep sleep.  I found myself out in public, in the middle of the match, and I saw, in front of me, a wand sticking out of a boys pocket.  I had not been allowed a wand since before Azkaban.  I stole it.  Winky didn't know.  Winky is frightened of heights.  She had her face hidden.\" \"Master Barty, you bad boy!\"  whispered Winky, tears trickling between her fingers. \"So you took the wand,\" said Dumbledore, \"and what did you do with it?\" \"We went back to the tent,\" said Crouch.  \"Then we heard them."
}