{
  "id": "89844637a89d4c2e868f92adfe9dd7228dc45c45",
  "text": "  I will not wed you, Xaro.   His face had grown cold at that.  Then go.    But where?    Somewhere far from here.   Well, perhaps it was time. The people of her khalasar had welcomed the chance to recover from the ravages of the red waste, but now that they were plump and rested once again, they began to grow unruly. Dothraki were not accustomed to staying long in one place. They were a warrior people, not made for cities. Perhaps she had lingered in Qarth too long, seduced by its comforts and its beauties. It was a city that always promised more than it would give you, it seemed to her, and her welcome here had turned sour since the House of the Undying had collapsed in a great gout of smoke and flame. Overnight the Qartheen had come to remember that dragons were dangerous. No longer did they vie with each other to give her gifts. Instead the Tourmaline Brotherhood had called openly for her expulsion, and the Ancient Guild of Spicers for her death. It was all Xaro could do to keep the Thirteen from joining them.  But where am I to go? Ser Jorah proposed that they journey farther east, away from her enemies in the Seven Kingdoms. Her bloodriders would sooner have returned to their great grass sea, even if it meant braving the red waste again. Dany herself had toyed with the idea of settling in Vaes Tolorro until her dragons grew great and strong. But her heart was full of doubts. Each of these felt wrong, somehow… and even when she decided where to go, the question of how she would get there remained troublesome.  Xaro Xhoan Daxos would be no help to her, she knew that now. For all his professions of devotion, he was playing his own game, not unlike Pyat Pree. The night he asked her to leave, Dany had begged one last favor of him.  An army, is it?  Xaro asked.  A kettle of gold? A galley, perhaps?   Dany blushed. She hated begging.  A ship, yes.   Xaro’s eyes had glittered as brightly as the jewels in his nose.  I am a trader, Khaleesi. So perhaps we should speak no more of giving, but rather of trade. For one of your dragons, you shall have ten of the finest ships in my fleet. You need only say that one sweet word.    No,  she said.   Alas,  Xaro sobbed,  that was not the word I meant.    Would you ask a mother to sell one of her children?    Whyever not? They can always make more. Mothers sell their children every day.    Not the Mother of Dragons.    Not even for twenty ships?    Not for a hundred.   His mouth curled downward.  I do not have a hundred. But you have three dragons. Grant me one, for all my kindnesses. You will still have two and thirty ships as well.   Thirty ships would be enough to land a small army on the shore of Westeros. But I do not have a small army.  How many ships do you own, Xaro?    Eighty-three, if one does not count my pleasure barge.    And your colleagues in the Thirteen?    Among us all, perhaps a thousand.    And the Spicers and the Tourmaline Brotherhood?    Their trifling fleets are of no account.    Even so,  she said,  tell me.    Twelve or thirteen hundred for the Spicers. No more than eight hundred for the Brotherhood.    And the Asshai’i, the Braavosi, the Summer Islanders, the Ibbenese, and all the other peoples who sail the great salt sea, how many ships do they have? All together?    Many and more,  he said irritably.  What does this matter?    I am trying to set a price on one of the three living dragons in the world.  Dany smiled at him sweetly.  it seems to me that one-third of all the ships in the world would be fair.   Xaro’s tears ran down his cheeks on either side of his jewel-encrusted nose.  Did I not warn you not to enter the Palace of Dust? This is the very thing I feared. The whispers of the warlocks have made you as mad as Mallarawan’s wife. A third of all the ships in the world? Pah. Pah, I say. Pah.   Dany had not seen him since. His seneschal brought her messages, each cooler than the last. She must quit his house. He was done feeding her and her people. He demanded the return of his gifts, which she had accepted in bad faith. Her only consolation was that at least she’d had the great good sense not to marry him.  The warlocks whispered of three treasons… once for blood and once for gold and once for love. The first traitor was surely Mirri Maz Duur, who had murdered Khal Drogo and their unborn son to avenge her people. Could Pyat Pree and Xaro Xhoan Daxos be the second and the third? She did not think so. What Pyat did was not for gold, and Xaro had never truly loved her.  The streets grew emptier as they passed through a district given over to gloomy stone warehouses. Aggo went before her and Jhogo behind, leaving Ser Jorah Mormont at her side. Her bell rang softly, and Dany found her thoughts returning to the Palace of Dust once more, as the tongue returns to a space left by a missing tooth. Child of three, they had called her, daughter of death, slayer of lies, bride of fire. So many threes. Three fires, three mounts to ride, three treasons.  The dragon has three heads,  she sighed."
}