{
  "id": "899517e709e78ae5b37969b35216b26f37e43980",
  "text": " On the edge of the haunted forest, where the tents had been, Jon found an oakwood stump and sat.  Ygritte wanted me to be a wildling. Stannis wants me to be the Lord of Winterfell. But what do I want? The sun crept down the sky to dip behind the Wall where it curved through the western hills. Jon watched as that towering expanse of ice took on the reds and pinks of sunset. Would I sooner be hanged for a turncloak by Lord Janos, or forswear my vows, marry Val, and become the Lord of Winterfell? It seemed an easy choice when he thought of it in those terms… though if Ygritte had still been alive, it might have been even easier. Val was a stranger to him. She was not hard on the eyes, certainly, and she had been sister to Mance Rayder’s queen, but still…  I would need to steal her if I wanted her love, but she might give me children. I might someday hold a son of my own blood in my arms. A son was something Jon Snow had never dared dream of, since he decided to live his life on the Wall. I could name him Robb. Val would want to keep her sister’s son, but we could foster him at Winterfell, and Gilly’s boy as well. Sam would never need to tell his lie. We’d find a place for Gilly too, and Sam could come visit her once a year or so. Mance’s son and Craster’s would grow up brothers, as I once did with Robb.  He wanted it, Jon knew then. He wanted it as much as he had ever wanted anything. I have always wanted it, he thought, guiltily. May the gods forgive me. It was a hunger inside him, sharp as a dragonglass blade. A hunger… he could feel it. It was food he needed, prey, a red deer that stank of fear or a great elk proud and defiant. He needed to kill and fill his belly with fresh meat and hot dark blood. His mouth began to water with the thought.  It was a long moment before he understood what was happening. When he did, he bolted to his feet.  Ghost?  He turned toward the wood, and there he came, padding silently out of the green dusk, the breath coming warm and white from his open jaws.  Ghost!  he shouted, and the direwolf broke into a run. He was leaner than he had been, but bigger as well, and the only sound he made was the soft crunch of dead leaves beneath his paws. When he reached Jon he leapt, and they wrestled amidst brown grass and long shadows as the stars came out above them.  Gods, wolf, where have you been?  Jon said when Ghost stopped worrying at his forearm.  I thought you’d died on me, like Robb and Ygritte and all the rest. I’ve had no sense of you, not since I climbed the Wall, not even in dreams.  The direwolf had no answer, but he licked Jon’s face with a tongue like a wet rasp, and his eyes caught the last light and shone like two great red suns.  Red eyes, Jon realized, but not like Melisandre’s. He had a weirwood’s eyes. Red eyes, red mouth, white fur. Blood and bone, like a heart tree. He belongs to the old gods, this one. And he alone of all the direwolves was white. Six pups they’d found in the late summer snows, him and Robb; five that were grey and black and brown, for the five Starks, and one white, as white as Snow.  He had his answer then.  Beneath the Wall, the queen’s men were kindling their nightfire. He saw Melisandre emerge from the tunnel with the king beside her, to lead the prayers she believed would keep the dark away.  Come, Ghost,  Jon told the wolf.  With me. You’re hungry, I know. I could feel it.  They ran together for the gate, circling wide around the nightfire, where reaching flames clawed at the black belly of the night.  The king’s men were much in evidence in the yards of Castle Black. They stopped as Jon went by, and gaped at him. None of them had ever seen a direwolf before, he realized, and Ghost was twice as large as the common wolves that prowled their southron greenwoods. As he walked toward the armory, Jon chanced to look up and saw Val standing in her tower window. I’m sorry, he thought. I’m not the man to steal you out of there.  In the practice yard he came upon a dozen king’s men with torches and long spears in their hands. Their sergeant looked at Ghost and scowled, and a couple of his men lowered their spears until the knight who led them said,  Move aside and let them pass.  To Jon he said,  You’re late for your supper.    Then get out of my way, ser,  Jon replied, and he did.  He could hear the noise even before he reached the bottom of the steps; raised voices, curses, someone pounding on a table. Jon stepped into the vault all but unnoticed. His brothers crowded the benches and the tables, but more were standing and shouting than were sitting, and no one was eating. There was no food. What’s happening here? Lord Janos Slynt was bellowing about turncloaks and treason, Iron Emmett stood on a table with a naked sword in his fist, Three-Finger Hobb was cursing a ranger from the Shadow Tower… some Eastwatch man slammed his fist onto the table again and again, demanding quiet, but all that did was add to the din echoing off the vaulted ceiling.  Pyp was the first to see Jon."
}