{
  "id": "8a832d6f0b59e0384742fbb739603610d2b07342",
  "text": " The sun had fallen below the western wall, and the stones of the Red Keep glowed dark as blood.   I’ll get you with child as soon as you’re able,  Joffrey said as he escorted her across the practice yard.  If the first one is stupid, I’ll chop off your head and find a smarter wife. When do you think you’ll be able to have children?   Sansa could not look at him, he shamed her so.  Septa Mordane says most… most highborn girls have their flowering at twelve or thirteen.   Joffrey nodded.  This way.  He led her into the gatehouse, to the base of the steps that led up to the battlements.  Sansa jerked back away from him, trembling. Suddenly she knew where they were going.  No,  she said, her voice a frightened gasp.  Please, no, don’t make me, I beg you…   Joffrey pressed his lips together.  I want to show you what happens to traitors.   Sansa shook her head wildly.  I won’t. I won’t.    I can have Ser Meryn drag you up,  he said.  You won’t like that. You had better do what I say.  Joffrey reached for her, and Sansa cringed away from him, backing into the Hound.   Do it, girl,  Sandor Clegane told her, pushing her back toward the king. His mouth twitched on the burned side of his face and Sansa could almost hear the rest of it. He’ll have you up there no matter what, so give him what he wants.  She forced herself to take King Joffrey’s hand. The climb was something out of a nightmare; every step was a struggle, as if she were pulling her feet out of ankle-deep mud, and there were more steps than she would have believed, a thousand thousand steps, and horror waiting on the ramparts.  From the high battlements of the gatehouse, the whole world spread out below them. Sansa could see the Great Sept of Baelor on Visenya’s hill, where her father had died. At the other end of the Street of the Sisters stood the fire-blackened ruins of the Dragonpit. To the west, the swollen red sun was half-hidden behind the Gate of the Gods. The salt sea was at her back, and to the south was the fish market and the docks and the swirling torrent of the Blackwater Rush. And to the north…  She turned that way, and saw only the city, streets and alleys and hills and bottoms and more streets and more alleys and the stone of distant walls. Yet she knew that beyond them was open country, farms and fields and forests, and beyond that, north and north and north again, stood Winterfell.   What are you looking at?  Joffrey said.  This is what I wanted you to see, right here.   A thick stone parapet protected the outer edge of the rampart, reaching as high as Sansa’s chin, with crenellations cut into it every five feet for archers. The heads were mounted between the crenels, along the top of the wall, impaled on iron spikes so they faced out over the city. Sansa had noted them the moment she’d stepped out onto the wallwalk, but the river and the bustling streets and the setting sun were ever so much prettier. He can make me look at the heads, she told herself, but he can’t make me see them.   This one is your father,  he said.  This one here. Dog, turn it around so she can see him.   Sandor Clegane took the head by the hair and turned it. The severed head had been dipped in tar to preserve it longer. Sansa looked at it calmly, not seeing it at all. It did not really look like Lord Eddard, she thought; it did not even look real.  How long do I have to look?   Joffrey seemed disappointed.  Do you want to see the rest?  There was a long row of them.   If it please Your Grace.   Joffrey marched her down the wallwalk, past a dozen more heads and two empty spikes.  I’m saving those for my uncle Stannis and my uncle Renly,  he explained. The other heads had been dead and mounted much longer than her father. Despite the tar, most were long past being recognizable. The king pointed to one and said,  That’s your septa there,  but Sansa could not even have told that it was a woman. The jaw had rotted off her face, and birds had eaten one ear and most of a cheek.  Sansa had wondered what had happened to Septa Mordane, although she supposed she had known all along.  Why did you kill her?  she asked.  She was godsworn…    She was a traitor.  Joffrey looked pouty; somehow she was upsetting him.  You haven’t said what you mean to give me for my name day. Maybe I should give you something instead, would you like that?    If it please you, my lord,  Sansa said.  When he smiled, she knew he was mocking her.  Your brother is a traitor too, you know.  He turned Septa Mordane’s head back around.  I remember your brother from Winterfell. My dog called him the lord of the wooden sword. Didn’t you, dog?    Did I?  the Hound replied.  I don’t recall.   Joffrey gave a petulant shrug.  Your brother defeated my uncle Jaime. My mother says it was treachery and deceit. She wept when she heard. Women are all weak, even her, though she pretends she isn’t. She says we need to stay in King’s Landing in case my other uncles attack, but I don’t care. After my name day feast, I’m going to raise a host and kill your brother myself."
}