{
  "id": "8b009e62c24199023722a9003bd0bc4ffd772a48",
  "text": " \"There!\" yelled a sixth year, pointing over the forest. Something large, much larger than a broomstick - or, indeed, a hundred broomsticks - was hurtling across the deep blue sky toward the castle, growing larger all the time. \"It's a dragon!\"  shrieked one of the first years, losing her head completely. \"Don't be stupid. . . it's a flying house!\"  said Dennis Creevey. Dennis's guess was closer. . . . As the gigantic black shape skimmed over the treetops of the Forbidden Forest and the lights shining from the castle windows hit it, they saw a gigantic, powderblue, horse-drawn carriage, the size of a large house, soaring toward them, pulled through the air by a dozen winged horses, all palominos, and each the size of an elephant. The front three rows of students drew backward as the carriage hurtled ever lower, coming in to land at a tremendous speed - then, with an almighty crash that made Neville jump backward onto a Slytherin fifth year's foot, the horses' hooves, larger than dinner plates, hit the ground.  A second later, the carriage landed too, bouncing upon its vast wheels, while the golden horses tossed their enormous heads and rolled large, fiery red eyes. Harry just had time to see that the door of the carriage bore a coat of arms (two crossed, golden wands, each emitting three stars) before it opened. A boy in pale blue robes jumped down from the carriage, bent forward, fumbled for a moment with something on the carriage floor, and unfolded a set of golden steps.  He sprang back respectfully.  Then Harry saw a shining, high-heeled black shoe emerging from the inside of the carriage - a shoe the size of a child's sled - followed, almost immediately, by the largest woman he had ever seen in his life.  The size of the carriage, and of the horses, was immediately explained.  A few people gasped. Harry had only ever seen one person as large as this woman in his life, and that was Hagrid; he doubted whether there was an inch difference in their heights.  Yet somehow - maybe simply because he was used to Hagrid - this woman (now at the foot of the steps, and looking around at the waiting, wide-eyed crowd) seemed even more unnaturally large.  As she stepped into the light flooding from the entrance hall, she was revealed to have a handsome, olive-skinned face; large, black, liquid-looking eyes; and a rather beaky nose.  Her hair was drawn back in a shining knob at the base of her neck.  She was dressed from head to foot in black satin, and many magnificent opals gleamed at her throat and on her thick fingers. Dumbledore started to clap; the students, following his lead, broke into applause too, many of them standing on tiptoe, the better to look at this woman. Her face relaxed into a gracious smile and she walked forward toward Dumbledore, extending a glittering hand.  Dumbledore, though tall himself, had barely to bend to kiss it. \"My dear Madame Maxime,\" he said. \"Welcome to Hogwarts.\" \"Dumbly-dort,\" said Madame Maxime in a deep voice. \"I 'ope I find you well?\" \"In excellent form, I thank you,\" said Dumbledore. \"My pupils,\" said Madame Maxime, waving one of her enormous hands carelessly behind her. Harry, whose attention had been focused completely upon Madame Maxime, now noticed that about a dozen boys and girls, all, by the look of them, in their late teens, had emerged from the carriage and were now standing behind Madame Maxime.  They were shivering, which was unsurprising, given that their robes seemed to be made of fine silk, and none of them were wearing cloaks.  A few had wrapped scarves and shawls around their heads.  From what Harry could see of them (they were standing in Madame Maxime's enormous shadow), they were staring up at Hogwarts with apprehensive looks on their faces. \"As Karkaroff arrived yet?\"  Madame Maxime asked. \"He should be here any moment,\" said Dumbledore.  \"Would you like to wait here and greet him or would you prefer to step inside and warm up a trifle?\"  \"Warm up, I think,\" said Madame Maxime. \"But ze 'orses -\"   \"Our Care of Magical Creatures teacher will be delighted to take care of them,\" said Dumbledore, \"the moment he has returned from dealing with a slight situation that has arisen with some of his other - er - charges.\" \"Skrewts,\" Ron muttered to Harry, grinning. \"My steeds require - er - forceful 'andling,\" said Madame Maxime, looking as though she doubted whether any Care of Magical Creatures teacher at Hogwarts could be up to the job.  \"Zey are very strong. . . .\" \"I assure you that Hagrid will be well up to the job,\" said Dumbledore, smiling. \"Very well,\" said Madame Maxime, bowing slightly. \"Will you please inform zis 'Agrid zat ze 'orses drink only single-malt whiskey?\" \"It will be attended to,\" said Dumbledore, also bowing.  \"Come,\" said Madame Maxime imperiously to her students, and the Hogwarts crowd parted to allow her and her students to pass up the stone steps. \"How big d'you reckon Durmstrang's horses are going to be?\"  Seamus Finnigan said, leaning around Lavender and Parvati to address Harry and Ron."
}