{
  "id": "8b06dd73e9442e8013bc6927b1c849be96f5fd1f",
  "text": " He never heard her. He undid his breeches and climbed up and pushed her bare white legs apart. One hand slid up her thigh and underneath her smallclothes. When he tore them away, he saw that her moon’s blood was on her, but it made no difference.   Hurry,  she was whispering now,  quickly, quickly, now, do it now, do me now. Jaime Jaime Jaime.  Her hands helped guide him.  Yes,  Cersei said as he thrust,  my brother, sweet brother, yes, like that, yes, I have you, you’re home now, you’re home now, you’re home.  She kissed his ear and stroked his short bristly hair. Jaime lost himself in her flesh. He could feel Cersei’s heart beating in time with his own, and the wetness of blood and seed where they were joined.  But no sooner were they done than the queen said,  Let me up. If we are discovered like this…   Reluctantly he rolled away and helped her off the altar. The pale marble was smeared with blood. Jaime wiped it clean with his sleeve, then bent to pick up the candles he had knocked over. Fortunately they had all gone out when they fell. If the sept had caught fire I might never have noticed.   This was folly.  Cersei pulled her gown straight.  With Father in the castle… Jaime, we must be careful.    I am sick of being careful. The Targaryens wed brother to sister, why shouldn’t we do the same? Marry me, Cersei. Stand up before the realm and say it’s me you want. We’ll have our own wedding feast, and make another son in place of Joffrey.   She drew back.  That’s not funny.    Do you hear me chuckling?    Did you leave your wits at Riverrun?  Her voice had an edge to it.  Tommen’s throne derives from Robert, you know that.    He’ll have Casterly Rock, isn’t that enough? Let Father sit the throne. All I want is you.  He made to touch her cheek. Old habits die hard, and it was his right arm he lifted.  Cersei recoiled from his stump.  Don’t… don’t talk like this. You’re scaring me, Jaime. Don’t be stupid. One wrong word and you’ll cost us everything. What did they do to you?    They cut off my hand.    No, it’s more, you’re changed.  She backed off a step.  We’ll talk later. On the morrow. I have Sansa Stark’s maids in a tower cell, I need to question them… you should go to Father.    I crossed a thousand leagues to come to you, and lost the best part of me along the way. Don’t tell me to leave.    Leave me,  she repeated, turning away.  Jaime laced up his breeches and did as she commanded. Weary as he was, he could not seek a bed. By now his lord father knew that he was back in the city.  The Tower of the Hand was guarded by Lannister household guards, who knew him at once.  The gods are good, to give you back to us, ser,  one said, as he held the door.   The gods had no part in it. Catelyn Stark gave me back. Her, and the Lord of the Dreadfort.   He climbed the stairs and pushed into the solar unannounced, to find his father sitting by the fire. Lord Tywin was alone, for which Jaime was thankful. He had no desire to flaunt his maimed hand for Mace Tyrell or the Red Viper just now, much less the two of them together.   Jaime,  Lord Tywin said, as if they’d last seen each other at breakfast.  Lord Bolton led me to expect you earlier. I had hoped you’d be here for the wedding.    I was delayed.  Jaime closed the door softly.  My sister outdid herself, I’m told. Seventy-seven courses and a regicide, never a wedding like it. How long have you known I was free?    The eunuch told me a few days after your escape. I sent men into the riverlands to look for you. Gregor Clegane, Samwell Spicer, the brothers Plumm. Varys put out the word as well, but quietly. We agreed that the fewer people who knew you were free, the fewer would be hunting you.    Did Varys mention this?  He moved closer to the fire, to let his father see.  Lord Tywin pushed himself out of his chair, breath hissing between his teeth.  Who did this? If Lady Catelyn thinks—    Lady Catelyn held a sword to my throat and made me swear to return her daughters. This was your goat’s work. Vargo Hoat, the Lord of Harrenhal!   Lord Tywin looked away, disgusted.  No longer. Ser Gregor’s taken the castle. The sellswords deserted their erstwhile captain almost to a man, and some of Lady Whent’s old people opened a postern gate. Clegane found Hoat sitting alone in the Hall of a Hundred Hearths, half-mad with pain and fever from a wound that festered. His ear, I’m told.   Jaime had to laugh. Too sweet! His ear! He could scarcely wait to tell Brienne, though the wench wouldn’t find it half so funny as he did.  Is he dead yet?    Soon. They have taken off his hands and feet, but Clegane seems amused by the way the Qohorik slobbers.   Jaime’s smile curdled.  What about his Brave Companions?    The few who stayed at Harrenhal are dead. The others scattered. They’ll make for ports, I’ll warrant, or try and lose themselves in the woods.  His eyes went back to Jaime’s stump, and his mouth grew taut with fury.  We’ll have their heads. Every one. Can you use a sword with your left hand?   I can hardly dress myself in the morning."
}