{
  "id": "8b74978ce3432ffb4156756cc7f8e598d0716c2e",
  "text": "\"  The hobbit felt quite crushed, and as there seemed nothing else to do he did go  to  bed;  and  while  the  dwarves  were  still  singing  songs  he  dropped  asleep,  still  puzzling his little head about Beorn, till he dreamed a dream of hundreds of black  bears  dancing  slow  heavy  dances  round  and  round  in  the  moonlight  in  the  courtyard.  Then  he  woke  up  when  everyone  else  was  asleep,  and  he  heard  the  same  scraping,  scuffling,  snuffling,  and  growling  as  before.  Next  morning  they  were all wakened by Beorn himself.  \"So here you all are still!\" he said. He picked up the hobbit and laughed: \"Not  eaten  up  by  Wargs  or  goblins  or  wicked  bears  yet  I  see\";  and  he  poked  Mr.  Baggins' waistcoat most disrespectfully. \"Little bunny is getting nice and fat again  on bread and honey,\" he chuckled. \"Come and have some more!\"    So  they  all  went  to  breakfast  with  him.  Beorn  was  most  jolly  for  a  change;  indeed  he  seemed  to  be  in  a  splendidly  good  humour  and  set  them  all  laughing   ####-with his funny stories; nor did they have to wonder long where he had been or why  he  was  so  nice  to  them,  for he  told  them himself. He had been over  the  river  and  right  back  up  into  the  mountains-from  which  you  can  guess  that  he  could  travel  quickly,  in bear's  shape  at  any  rate. From  the burnt wolf-glade he had soon found  out  that  part  of  their  story  was  true;  but  he  had  found  more  than  that:  he  had  caught a Warg and a goblin wandering in the woods. From these he had got news:  the  goblin  patrols  were  still  hunting  with  Wargs  for  the  dwarves,  and  they  were  fiercely  angry  because  of  the  death  of  the  Great  Goblin,  and  also  because  of  the  burning of the chief wolf's nose and the death from the wizard's fire of many of his  chief  servants. So much  they  told him when he  forced  them, but he guessed  there  was  more  wickedness  than  this  afoot,  and  that  a  great  raid  of  the  whole  goblin  army with  their wolf-allies  into  the  lands  shadowed by  the mountains might  soon  be made  to  find  the  dwarves,  or  to  take  vengeance  on  the men  and  creatures  that  lived there, and who they thought must be sheltering them.  \"It was  a  good  story,  that of yours,\" said Beorn, \"but I like it still better now I  am sure it is true. You must forgive my not taking your word. If you lived near the  edge of Mirkwood, you would  take  the word of no one  that you did not know  as  well  as  your  brother  or  better. As  it is, I can only say that I have hurried home as  fast  as  I  could  to  see  that  you  were  safe,  and  to  offer  you  any  help  that  I  can.  I  shall  think more  kindly  of  dwarves  after  this. Killed  the Great Goblin,  killed  the  Great Goblin!\" he chuckled fiercely to himself.  \"What did you do with the goblin and the Warg?\" asked Bilbo suddenly.   \"Come  and  see!\"  said  Beorn,  and  they  followed  round  the  house.  A  goblin's  head was  stuck  outside  the  gate  and  a warg-skin was nailed to a tree just beyond.  Beorn  was  a  fierce  enemy.  But  now  he  was  their  friend,  and  Gandalf  thought  it  wise  to  tell  him  their  whole  story  and  the  reason  of  their  journey,  so  that  they  could get the most help he could offer.   This is what he promised to do for them. He would provide ponies for each of  them,  and  a  horse  for Gandalf,  for  their  journey  to  the  forest,  and  he would  lade  them with food to last them for weeks with care, and packed so as to be as easy as  possible to carry-nuts, flour, sealed jars of dried fruits, and red earthenware pots of  honey,  and twice-baked cakes that would keep good a long time, and on a little of  which they could march far. The making of these was one of his secrets; but honey  was in them, as in most of his foods, and they were good to eat, though they made  one  thirsty. Water, he said, they would not need to carry this side of the forest, for  there were streams and springs along  the road. \"But your way  through Mirkwood  is  dark,  dangerous  and  difficult,\"  he  said.  \"Water  is  not  easy  to  find  there,  nor   ####-food.  The  time  is  not  yet  come  for  nuts  (though  it may  be  past  and  gone  indeed  before  you  get  to  the  other  side),  and  nuts  are  about  all  that  grows  there  fit  for  food;  in  there  the wild  things are dark, queer, and savage. I will provide you with  skins  for  carrying water,  and  I will give you  some bows  and  arrows. But  I doubt  very much whether anything you find in Mirkwood will be wholesome to eat or to  drink. There is one stream there, I know, black and strong which crosses the path.  That  you  should  neither  drink  of,  nor  bathe  in;  for  I  have  heard  that  it  carries  enchantment and a great drowsiness and forgetfulness. And in the dim shadows of  that  place  I  don't  think  you  will  shoot  anything,  wholesome  or  unwholesome,  without straying from the path."
}