{
  "id": "8b82e2357951cc2585778667b55f38704ade5e80",
  "text": "  One person, however, seemed to be thoroughly enjoying the atmosphere of terror and suspicion. Draco Malfoy was strutting around the school as though he had just been appointed Head Boy. Harry didn't realize what he was so pleased about until the Potions lesson about two weeks after Dumbledore and Hagrid had left, when, sitting right behind Malfoy, Harry overheard him gloating to Crabbe and Goyle.  \"I always thought Father might be the one who got rid of Dumbledore,\" he said, not troubling to keep his voice down. \"I told you he thinks Dumbledore's the worst headmaster the school's ever  *266*  had. Maybe we'll get a decent headmaster now. Someone who won't want the Chamber of Secrets closed. McGonagall won't last long, she's only filling in ......  Snape swept past Harry, making no comment about Hermione's empty seat and cauldron.  \"Sir,\" said Malfoy loudly. \"Sir, why don't you apply for the headmaster's job?\"  \"Now, now, Malfoy,\" said Snape, though he couldn't suppress a thin- lipped smile. \"Professor Dumbledore has only been suspended by the governors. I daresay he'll be back with us soon enough.\"  \"Yeah, right,\" said Malfoy, smirking. \"I expect you'd have Father's vote, sir, if you wanted to apply for the job - I'll tell Father you're the best teacher here, sir -\"  Snape smirked as he swept off around the dungeon, fortunately not spotting Seamus Finnigan, who was pretending to vomit into his cauldron.  \"I'm quite surprised the Mudbloods haven't all packed their bags by now,\" Malfoy went on. \"Bet you five Galleons the next one dies. Pity it wasn't Granger -\"  The bell rang at that moment, which was lucky; at Malfoy's last words, Ron had leapt off his stool, and in the scramble to collect bags and books, his attempts to reach Malfoy went unnoticed.  \"Let me at him,\" Ron growled as Harry and Dean hung onto his arms. \"I don't care, I don't need my wand, I'm going to kill him with my bare hands -\"  \"Hurry up, I've got to take you all to Herbology,\" barked Snape over the class's heads, and off they marched, with Harry, Ron, and Dean bringing up the rear, Ron still trying to get loose. It was only  * 261*  safe to let go of him when Snape had seen them out of the castle and they were making their way across the vegetable patch toward the greenhouses.  The Herbology class was very subdued; there were now two missing from their number, Justin and Hermione.  Professor Sprout set them all to work pruning the Abyssinian Shrivelfigs. Harry went to tip an armful of withered stalks onto the compost heap and found himself face-to-face with Ernie Macmillan. Ernie took a deep breath and said, very formally, \"I just want to say, Harry, that I'm sorry I ever suspected you. I know you'd never attack Hermione Granger, and I apologize for all the stuff I said. We're all in the same boat now, and, well -\"  He held out a pudgy hand, and Harry shook it.  Ernie and his friend Hannah came to work at the same Shrivelfig as Harry and Ron.  \"That Draco Malfoy character,\" said Ernie, breaking off dead twigs, \"he seems very pleased about all this, doesn't he? D'you know, I think he might be Slytherin's heir.\"  \"That's clever of you,\" said Ron, who didn't seem to have forgiven Ernie as readily as Harry.  \"Do you think it's Malfoy, Harry?\" Ernie asked.  \"No,\" said Harry, so firmly that Ernie and Hannah stared.  A second later, Harry spotted something.  Several large spiders were scuttling over the ground on the other side of the glass, moving in an unnaturally straight line as though taking the shortest route to a prearranged meeting. Harry hit Ron over the hand with his pruning shears.  \"Ouch! What're you -\"  268  Harry pointed out the spiders, following their progress with his eyes screwed up against the sun.  \"Oh, yeah,\" said Ron, trying, and failing, to look pleased. \"But we can't follow them now -\"  Ernie and Hannah were listening curiously.  Harry's eyes narrowed as he focused on the spiders. If they pursued their fixed course, there could be no doubt about where they would end up.  \"Looks like they're heading for the Forbidden Forest . . . .\"  And Ron looked even unhappier about that.  At the end of the lesson Professor Sprout escorted the class to their Defense Against the Dark Arts lesson. Harry and Ron lagged behind the others so they could talk out of earshot.  \"We'll have to use the Invisibility Cloak again,\" Harry told Ron. \"We can take Fang with us. He's used to going into the forest with Hagrid, he might be some help.\"  \"Right,\" said Ron, who was twirling his wand nervously in his fingers. \"Er - aren't there - aren't there supposed to be werewolves in the forest?\" he added as they took their usual places at the back of Lockhart's classroom.  Preferring not to answer that question, Harry said, \"There are good things in there, too. The centaurs are all right, and the unicorns ...  Ron had never been into the Forbidden Forest before. Harry had entered it only once and had hoped never to do so again.  Lockhart bounded into the room and the class stared at him."
}