{
  "id": "8bbbfb0b1fa8ed06e695685d74413da074891907",
  "text": "'       In a little while  they came to the point on the East  Road  where they  had taken  leave of  Bombadil; and  they hoped and  half expected to see him  standing there to greet them as they went by. But there was no sign  of him;  and  there was  a grey mist on the Barrow-downs southwards, and  a deep veil  over the Old Forest far away.       They halted and Frodo looked south wistfully. 'I should dearly  like to  see the old fellow again,' he said. 'I wonder how he is getting on?'       'As well as ever, you may be sure,' said Gandalf. 'Quite untroubled and  I  should guess, not much interested in anything  that we have done or seen,  unless perhaps in our visits to the Ents. There may be a time  later for you   to go and see him. But if I were you, I should press on now for home, or you   will not come to the Brandywine Bridge before the gates are locked.'       'But there aren't any  gates,' said  Merry, 'not  on the Road; you know  that quite well.  There's  the  Buckland Gate, of course; but they'll let me  through that at any time.'       'There  weren't any  gates,  you mean,'  said Gandalf. 'I think you will  find some  now. And  you might have  more trouble even  at the Buckland Gate  than you think. But you'll! manage all right. Good -bye dear friends! Not for   the last time, not yet. Good-bye!'       He turned Shadowfax off the  Road, and the great horse leaped the green  dike that here ran beside  it;  and then at a cry from Gandalf he  was gone,  racing towards the Barrow-downs like a wind from the North.       'Well here we are, just the four of us that started out together,' said  Merry. 'We have left all the rest behind, one after another. It seems almost   like a dream that has slowly faded.'       'Not to  me,'  said  Frodo. 'To me it  feels  more  like falling asleep  again.'     ####-   Chapter 8. The Scouring of the Shire            It was after nightfall when, wet and tired, the travellers came at last   to  the Brandywine, and  they found  the way  barred. At  either  end of the  Bridge there was a great  spiked gate;  and on the further side of the river   they could see that some new houses had been built: two-storeyed with narrow  straight-sided   windows,  bare   and   dimly  lit,  all  very   gloomy  and  un-Shirelike.       They  hammered on  the outer gate and called, but there was at first no   answer;  and then to their  surprise someone blew a horn, and  the lights in  the windows went out. A voice shouted in the dark:       'Who's that?  Be off! You  can't come in: Can't you read the notice: No  admittance between sundown and sunrise?'       'Of  course we can't read the notice  in the  dark.' Sam shouted  back.  'And if hobbits of the Shire are to be  kept out in the wet on  a night like  this, I'll tear down your notice when I find it.'       At that a  window slammed, and a crowd  of hobbits with lanterns poured   out of the house on the  left. They opened the  further gate, and some  came  over the bridge. When they saw the travellers they seemed frightened.       'Come along!' said Merry, recognizing one of the hobbits. 'If you don't  know me, Hob Hayward, you ought to. I am Merry Brandybuck, and I should  like  to know what  all this is  about,  and  what a Bucklander  like you is doing  here. You used to be on the Hay Gate.'       'Bless  me!  It's Master Merry, to  be sure,  and all  dressed  up  for   fighting!'  said  old Hob. 'Why,  they  said you was  dead! Lost in  the Old  Forest by all accounts. I'm pleased to see you alive after all!'       'Then  stop gaping  at  me  through the  bars, and open the gate!' said  Merry.       'I'm sorry, Master Merry, but we have orders.'       'Whose orders?'       'The Chief's up at Bag End.'       'Chief? Chief? Do you mean Mr. Lotho?' said Frodo.       'I suppose  so,  Mr.  Baggins;  but  we have  to say  just  \"the Chief\"  nowadays.'   ####-     'Do you indeed!'  said  Frodo. 'Well,  I am  glad he  has  dropped  the  Baggins at any  rate. But  it is evidently high  time that the  family dealt  with him and put him in his place.'       A  hush fell  on the hobbits  beyond the  gate. 'It  won't do  no  good  talking that  way,' said one. 'He'll  get to hear  of it. And if you make so  much noise, you'll wake the Chief's Big Man.'       'We shall wake him up in a way that will surprise him,' said Merry. 'If  you mean that your precious Chief has  been hiring ruffians out of the wild,  then we've not come back too  soon.' He sprang from his pony, and seeing the  notice in  the light of the lanterns, he  tore it down and threw it over the  gate. The  hobbits  backed  away and  made no move  to open  it.  'Come  on,  Pippin!' said Merry. 'Two is enough.'       Merry and Pippin  c limbed the gate, and the hobbits fled.  Another horn  sounded. Out of the bigger house on the right a large heavy figure  appeared  against a light in the doorway.       'What's all this,' he snarled as he  came  forward. 'Gate-breaking? You   clear out, or I'l l break your filthy little necks!' Then he  stopped, for he  had caught the gleam of swords."
}