{
  "id": "8bf632e638fac0def1b7ffe604160821cd449394",
  "text": " \"Snape said Moodys searched his office as well?\"  Ron whispered, his eyes alight with interest as he Banished a cushion with a sweep of his wand (it soared into the air and knocked Parvati's hat off).  \"What. . . d'you reckon Moody's here to keep an eye on Snape as well as Karkaroff?\" \"Well, I dunno if that's what Dumbledore asked him to do, but he's definitely doing it,\" said Harry, waving his wand without paying much attention, so that his cushion did an odd sort of belly flop off the desk.  \"Moody said Dumbledore only lets Snape stay here because he's giving him a second chance or something. ...\" \"What?\" said Ron, his eyes widening, his next cushion spinning high into the air, ricocheting off the chandelier, and dropping heavily onto Flitwick's desk.  \"Harry... maybe Moody thinks Snape put your name in the Goblet of Fire!\" \"Oh Ron,\" said Hermione, shaking her head sceptically, \"we thought Snape was trying to kill Harry before, and it turned out he was saving Harry's life, remember?\" She Banished a cushion and it flew across the room and landed in the box they were all supposed to be aiming at.  Harry looked at Hermione, thinking... it was true that Snape had saved his life once, but the odd thing was, Snape definitely loathed him, just as he'd loathed Harry s father when they had been at school together.  Snape loved taking points from Harry, and had certainly never missed an opportunity to give him punishments, or even to suggest that he should be suspended from the school. \"I don't care what Moody says,\" Hermione went on.  \"Dumbledore's not stupid.  He was right to trust Hagrid and Professor Lupin, even though loads of people wouldn't have given them jobs, so why shouldn't he be right about Snape, even if Snape is a bit -\" \"- evil,\" said Ron promptly.  \"Come on, Hermione, why are all these Dark wizard catchers searching his office, then?\" \"Why has Mr. Crouch been pretending to be ill?\" said Hermione, ignoring Ron.  \"Its a bit funny, isn't it, that he cant manage to come to the Yule Ball, but he can get up here in the middle of the night when he wants to?\" \"You just don't like Crouch because of that elf, Winky,\" said Ron, sending a cushion soaring into the window. \"You just want to think Snapes up to something,\" said Hermione, sending her cushion zooming neatly into the box. \"I just want to know what Snape did with his first chance, if he's on his second one,\" said Harry grimly, and his cushion, to his very great surprise, flew straight across the room and landed neatly on top of Hermione's.  Obedient to Sirius's wish of hearing about anything odd at Hogwarts, Harry sent him a letter by brown owl that night, explaining all about Mr. Crouch breaking into Snape s office, and Moody and Snape's conversation.  Then Harry turned his attention in earnest to the most urgent problem facing him: how to survive underwater for an hour on the twenty-fourth of February. Ron quite liked the idea of using the Summoning Charm again - Harry had explained about Aqua-Lungs, and Ron couldn't see why Harry shouldn't Summon one from the nearest Muggle town.  Hermione squashed this plan by pointing out that, in the unlikely event that Harry managed to learn how to operate an Aqua-Lung within the set limit of an hour, he was sure to be disqualified for breaking the International Code of Wizarding Secrecy - it was too much to hope that no Muggles would spot an Aqua-Lung zooming across the countryside to Hogwarts. \"Of course, the ideal solution would be for you to Transfigure yourself into a submarine or something,\" Hermione said.  \"If only we'd done human Transfiguration already!  But I don't think we start that until sixth year, and it can go badly wrong if you don't know what you're doing....\" \"Yeah, I don't fancy walking around with a periscope sticking out of my head,\" said Harry.  \"I s'pose I could always attack someone in front of Moody; he might do it for me....\" \"I don't think he'd let you choose what you wanted to be turned into, though,\" said Hermione seriously.  \"No, I think your best chance is some sort of charm.\" So Harry, thinking that he would soon have had enough of the library to last him a lifetime, buried himself once more among the dusty volumes, looking for any spell that might enable a human to survive without oxygen.  However, though he, Ron, and Hermione searched through their lunchtimes, evenings, and whole weekends - though Harry asked Professor McGonagall for a note of permission to use the Restricted Section, and even asked the irritable, vulture-like librarian.  Madam Pince, for help - they found nothing whatsoever that would enable Harry to spend an hour underwater and live to tell the tale. Familiar flutterings of panic were starting to disturb Harry now, and he was finding it difficult to concentrate in class again.  The lake, which Harry had always taken for granted as just another feature of the grounds, drew his eyes whenever he was near a classroom window, a great, iron-gray mass of chilly water, whose dark and icy depths were starting to seem as distant as the moon."
}