{
  "id": "8c3fbe2b0a88e8e02fdeb638489636e6c7ce8d98",
  "text": "  When he heard the door open, he closed the White Book and stood to receive his Sworn Brothers. Ser Osmund Kettleblack was the first to arrive. He gave Jaime a grin, as if they were old brothers-in-arms.  Ser Jaime,  he said,  had you looked like this t’other night, I’d have known you at once.    Would you indeed?  Jaime doubted that. The servants had bathed him, shaved him, and washed and brushed his hair. When he looked in a glass, he no longer saw the man who had crossed the riverlands with Brienne… but he did not see himself either. His face was thin and hollow, and he had lines under his eyes. I look like some old man.  Stand by your seat, ser.   Kettleblack complied. The other Sworn Brothers filed in one by one.  Sers,  Jaime said in a formal tone when all five had assembled,  who guards the king?    My brothers Ser Osney and Ser Osfryd,  Ser Osmund replied.   And my brother Ser Garlan,  said the Knight of Flowers.   Will they keep him safe?    They will, my lord.    Be seated, then.  The words were ritual. Before the seven could meet in session, the king’s safety must be assured.  Ser Boros and Ser Meryn sat to his right, leaving an empty chair between them for Ser Arys Oakheart, off in Dorne. Ser Osmund, Ser Balon, and Ser Loras took the seats to his left. The old and the new. Jaime wondered if that meant anything. There had been times during its history where the Kingsguard had been divided against itself, most notably and bitterly during the Dance of the Dragons. Was that something he needed to fear as well?  It seemed queer to him to sit in the Lord Commander’s seat where Barristan the Bold had sat for so many years. And even queerer to sit here crippled. Nonetheless, it was his seat, and this was his Kingsguard now. Tommen’s seven.  Jaime had served with Meryn Trant and Boros Blount for years; adequate fighters, but Trant was sly and cruel, and Blount a bag of growly air. Ser Balon Swann was better suited to his cloak, and of course the Knight of Flowers was supposedly all a knight should be. The fifth man was a stranger to him, this Osmund Kettleblack.  He wondered what Ser Arthur Dayne would have to say of this lot.  How is it that the Kingsguard has fallen so low,  most like.  It was my doing,  I would have to answer.  I opened the door, and did nothing when the vermin began to crawl inside.    The king is dead,  Jaime began.  My sister’s son, a boy of thirteen, murdered at his own wedding feast in his own hall. All five of you were present. All five of you were protecting him. And yet he’s dead.  He waited to see what they would say to that, but none of them so much as cleared a throat. The Tyrell boy is angry, and Balon Swann’s ashamed, he judged. From the other three Jaime sensed only indifference.  Did my brother do this thing? he asked them bluntly.  Did Tyrion poison my nephew?   Ser Balon shifted uncomfortably in his seat. Ser Boros made a fist. Ser Osmund gave a lazy shrug. It was Meryn Trant who finally answered.  He filled Joffrey’s cup with wine. That must have been when he slipped the poison in.    You are certain it was the wine that was poisoned?    What else?  said Ser Boros Blount.  The Imp emptied the dregs on the floor. Why, but to spill the wine that might have proved him guilty?    He knew the wine was poisoned,  said Ser Meryn.  Ser Balon Swann frowned.  The Imp was not alone on the dais. Far from it. That late in the feast, we had people standing and moving about, changing places, slipping off to the privy, servants were coming and going… the king and queen had just opened the wedding pie, every eye was on them or those thrice-damned doves. No one was watching the wine cup.    Who else was on the dais?  asked Jaime.  Ser Meryn answered.  The king’s family, the bride’s family, Grand Maester Pycelle, the High Septon…    There’s your poisoner,  suggested Ser Oswald Kettleblack with a sly grin.  Too holy by half, that old man. Never liked the look o’ him, myself.  He laughed.   No,  the Knight of Flowers said, unamused.  Sansa Stark was the poisoner. You all forget, my sister was drinking from that chalice as well. Sansa Stark was the only person in the hall who had reason to want Margaery dead, as well as the king. By poisoning the wedding cup, she could hope to kill both of them. And why did she run afterward, unless she was guilty?   The boy makes sense. Tyrion might yet be innocent. No one was any closer to finding the girl, however. Perhaps Jaime should look into that himself. For a start, it would be good to know how she had gotten out of the castle. Varys may have a notion or two about that. No one knew the Red Keep better than the eunuch.  That could wait, however. Just now Jaime had more immediate concerns. You say you are the Lord Commander of the Kingsguard, his father had said. Go do your duty. These five were not the brothers he would have chosen, but they were the brothers he had; the time had come to take them in hand.   Whoever did it,  he told them,  Joffrey is dead, and the Iron Throne belongs to Tommen now."
}