{
  "id": "8c5af09b4175916ebbad27314c9292aad2332d0c",
  "text": "  Jon flexed his bandaged fingers to show him. He had burned himself more badly than he knew throwing the flaming drapes, and his right hand was swathed in silk halfway to the elbow. At the time he’d felt nothing; the agony had come after. His cracked red skin oozed fluid, and fearsome blood blisters rose between his fingers, big as roaches.  The maester says I’ll have scars, but otherwise the hand should be as good as it was before.    A scarred hand is nothing. On the Wall, you’ll be wearing gloves often as not.    As you say, my lord.  It was not the thought of scars that troubled Jon; it was the rest of it. Maester Aemon had given him milk of the poppy, yet even so, the pain had been hideous. At first it had felt as if his hand were still aflame, burning day and night. Only plunging it into basins of snow and shaved ice gave any relief at all. Jon thanked the gods that no one but Ghost saw him writhing on his bed, whimpering from the pain. And when at last he did sleep, he dreamt, and that was even worse. In the dream, the corpse he fought had blue eyes, black hands, and his father’s face, but he dared not tell Mormont that.   Dywen and Hake returned last night,  the Old Bear said.  They found no sign of your uncle, no more than the others did.    I know.  Jon had dragged himself to the common hall to sup with his friends, and the failure of the rangers’ search had been all the men had been talking of.   You know,  Mormont grumbled.  How is it that everyone knows everything around here?  He did not seem to expect an answer.  It would seem there were only the two of… of those creatures, whatever they were, I will not call them men. And thank the gods for that. Any more and… well, that doesn’t bear thinking of. There will be more, though. I can feel it in these old bones of mine, and Maester Aemon agrees. The cold winds are rising. Summer is at an end, and a winter is coming such as this world has never seen.   Winter is coming. The Stark words had never sounded so grim or ominous to Jon as they did now.  My lord,  he asked hesitantly,  it’s said there was a bird last night…    There was. What of it?    I had hoped for some word of my father.    Father,  taunted the old raven, bobbing its head as it walked across Mormont’s shoulders.  Father.   The Lord Commander reached up to pinch its beak shut, but the raven hopped up on his head, fluttered its wings, and flew across the chamber to light above a window.  Grief and noise,  Mormont grumbled.  That’s all they’re good for, ravens. Why I put up with that pestilential bird… if there was news of Lord Eddard, don’t you think I would have sent for you? Bastard or no, you’re still his blood. The message concerned Ser Barristan Selmy. It seems he’s been removed from the Kingsguard. They gave his place to that black dog Clegane, and now Selmy’s wanted for treason. The fools sent some watchmen to seize him, but he slew two of them and escaped.  Mormont snorted, leaving no doubt of his view of men who’d send gold cloaks against a knight as renowed as Barristan the Bold.  We have white shadows in the woods and unquiet dead stalking our halls, and a boy sits the Iron Throne,  he said in disgust.  The raven laughed shrilly.  Boy, boy, boy, boy.   Ser Barristan had been the Old Bear’s best hope, Jon remembered; if he had fallen, what chance was there that Mormont’s letter would be heeded? He curled his hand into a fist. Pain shot through his burned fingers.  What of my sisters?    The message made no mention of Lord Eddard or the girls.  He gave an irritated shrug.  Perhaps they never got my letter. Aemon sent two copies, with his best birds, but who can say? More like, Pycelle did not deign to reply. It would not be the first time, nor the last. I fear we count for less than nothing in King’s Landing. They tell us what they want us to know, and that’s little enough.   And you tell me what you want me to know, and that’s less, Jon thought resentfully. His brother Robb had called the banners and ridden south to war, yet no word of that had been breathed to him… save by Samwell Tarly, who’d read the letter to Maester Aemon and whispered its contents to Jon that night in secret, all the time saying how he shouldn’t. Doubtless they thought his brother’s war was none of his concern. It troubled him more than he could say. Robb was marching and he was not. No matter how often Jon told himself that his place was here now, with his new brothers on the Wall, he still felt craven.   Corn,  the raven was crying.  Corn, corn.    Oh, be quiet,  the Old Bear told it.  Snow, how soon does Maester Aemon say you’ll have use of that hand back?    Soon,  Jon replied.   Good.  On the table between them, Lord Mormont laid a large sword in a black metal scabbard banded with silver.  Here. You’ll be ready for this, then.   The raven flapped down and landed on the table, strutting toward the sword, head cocked curiously. Jon hesitated. He had no inkling what this meant.  My lord?    The fire melted the silver off the pommel and burnt the crossguard and grip."
}