{
  "id": "8c892c33d614f41842a811372bab0e9181332314",
  "text": "  Baggins.  I  am  ashamed  of  you  for  thinking  of  it.  You  have  got  to  look after all these dwarves for me,\" he laughed.  \"No! no!\" said Bilbo. \"I didn't mean that. I meant, is there no way round?\"  \"There is, if you care to go two hundred miles or so out of your way north, and  twice  that  south.  But  you  wouldn't  get  a  safe  path  even  then.  There  are  no  safe  paths  in  this part of  the world. Remember you are over the Edge of the Wild now,  and in for all sorts of fun wherever you go. Before you could get round Mirkwood  in  the  North  you  would  be  right  among  the  slopes  of  the  Grey  Mountains,  and  they  are  simply  stiff  with  goblins,  hobgoblins,  and  rest  of  the  worst  description.  Before  you  could  get  round  it  in  the  South,  you  would  get  into  the  land  of  the  Necromancer;  and  even  you.  Bilbo, won't  need me  to  tell  you  tales  of  that  black   ####-sorcerer. I don't advise you to go anywhere near the places overlooked by his dark  tower! Stick  to  the  forest-track, keep your spirits up, hope for the best, and with a  tremendous  slice  of  luck  you  may  come  out  one  day  and  see  the  Long  Marshes  lying  below  you,  and  beyond  them,  high  in  the East,  the Lonely Mountain where  dear old Smaug lives, though I hope he is not expecting you.\"  \"Very  comforting  you  are  to  be  sure,\"  growled  Thorin.  \"Good-bye!  If  you  won't come with us, you had better get off without any more talk!\"  \"Good-bye  then,  and  really  good-bye!\"  said  Gandalf,  and  he  turned  his  horse  and  rode  down  into  the West.  But  he  could  not  resist  the  temptation  to  have  the  last word. Before he had passed quite out of hearing he turned and put his hands to  his mouth  and  called  to  them. They  heard  his  voice  come  faintly:  \"Good-bye! Be  good, take care of yourselves-and DON'T LEAVE THE PATH!\"  Then he galloped away and was soon lost to sight. \"O good-bye and go away!\"  grunted  the  dwarves,  all  the  more  angry  because  they  were  really  filled  with  dismay at losing him. Now began the most dangerous part of all the journey.   They  each  shouldered  the  heavy  pack  and  the  water-skin  which  was  their  share, and turned from the light that lay on the lands outside and plunged into the  forest.      ####-<h4>Chapter 8 </h4> <br>  Flies and Spiders     They  walked  in  single  file.  The  entrance  to  the  path  was  like  a  sort  of  arch  leading  into  a  gloomy  tunnel made  by  two  great  trees  that  leant  together,  too  old  and  strangled  with  ivy  and  hung  with  lichen  to  bear  more  than  a  few  blackened  leaves. The  path  itself was  narrow and wound in and out among the trunks. Soon  the  light  at  the  gate  was  like  a  little  bright  hole  far  behind,  and  the  quiet  was  so  deep that their feet seemed to thump along while all the trees leaned over them and  listened. As  theft  eyes  became  used  to  the  dimness  they  could  see  a  little way  to  either  side  in  a  sort  of  darkened  green  glimmer.  Occasionally  a  slender  beam  of  sun  that had  the  luck  to slip  in  through some opening  in  the  leaves far above, and  still  more  luck  in  not  being  caught  in  the  tangled  boughs  and  matted  twigs  beneath,  stabbed  down  thin  and  bright  before  them.  But  this  was  seldom,  and  it  soon ceased altogether.   There were  black  squirrels  in  the wood. As  Bilbo's  sharp  inquisitive  eyes  got  used  to  seeing  things  he  could  catch  glimpses  of  them whisking  off  the  path  and  scuttling  behind  tree-trunks.  There  were  queer  noises  too,  grunts,  scufflings,  and  hurryings  in  the undergrowth, and among  the  leaves  that  lay piled endlessly  thick  in  places  on  the  forest-floor;  but  what  made  the  noises  he  could  not  see.  The  nastiest  things  they  saw  were  the  cobwebs:  dark  dense  cobwebs  with  threads  extraordinarily  thick,  often  stretched  from  tree  to  tree,  or  tangled  in  the  lower  branches  on  either  side  of  them.  There  were  none  stretched  across  the  path,  but  whether because some magic kept it clear, or for what other reason they could not  guess.  It was not long before they grew to hate the forest as heartily as they had hated  the tunnels of the goblins, and it seemed to offer even less hope of any ending. But  they had to go on and on, long after they were sick for a sight of the sun and of the  sky, and  longed for  the feel of wind on  their faces. There was no movement of air  down under the forest-roof, and it was everlastingly still and dark and stuffy. Even  the dwarves felt it, who were used to tunnelling, and lived at times for long whiles  without the light of the sun; but the hobbit, who liked holes to make a house in but  not to spend summer days in, felt he was being slowly suffocated.  The nights were the worst. It then became pitch-dark – not what you call pitch- dark,  but  really  pitch;  so  black  that  you  really  could  see  nothing."
}