{
  "id": "8cb15a672e5fa2427644fd14d640376a8860305b",
  "text": " Too old for battles. He was always saying he was tired.   Little Walder hooted.  Tired of waiting for our grandfather to die, you mean. Does this mean Ser Emmon’s the heir now?    Don’t be stupid,  his cousin said.  The sons of the first son come before the second son. Ser Ryman is next in line, and then Edwyn and Black Walder and Petyr Pimple. And then Aegon and all his sons.    Ryman is old too,  said Little Walder.  Past forty, I bet. And he has a bad belly. Do you think he’ll be lord?    I’ll be lord. I don’t care if he is.   Maester Luwin cut in sharply.  You ought to be ashamed of such talk, my lords. Where is your grief? Your uncle is dead.    Yes,  said Little Walder.  We’re very sad.   They weren’t, though. Bran got a sick feeling in his belly. They like the taste of this dish better than I do. He asked Maester Luwin to be excused.   Very well.  The maester rang for help. Hodor must have been busy in the stables. It was Osha who came. She was stronger than Alebelly, though, and had no trouble lifting Bran in her arms and carrying him down the steps.   Osha,  Bran asked as they crossed the yard.  Do you know the way north? To the Wall and… and even past?    The way’s easy. Look for the Ice Dragon, and chase the blue star in the rider’s eye.  She backed through a door and started up the winding steps.   And there are still giants there, and… the rest… the Others, and the children of the forest too?    The giants I’ve seen, the children I’ve heard tell of, and the white walkers… why do you want to know?    Did you ever see a three-eyed crow?    No.  She laughed.  And I can’t say I’d want to.  Osha kicked open the door to his bedchamber and set him in his window seat, where he could watch the yard below.  It seemed only a few heartbeats after she took her leave that the door opened again, and Jojen Reed entered unbidden, with his sister Meera behind him.  You heard about the bird?  Bran asked. The other boy nodded.  It wasn’t a supper like you said. It was a letter from Robb, and we didn’t eat it, but—    The green dreams take strange shapes sometimes,  Jojen admitted.  The truth of them is not always easy to understand.    Tell me the bad thing you dreamed,  Bran said.  The bad thing that is coming to Winterfell.    Does my lord prince believe me now? Will he trust my words, no matter how queer they sound in his ears?   Bran nodded.   It is the sea that comes.    The sea?    I dreamed that the sea was lapping all around Winterfell. I saw black waves crashing against the gates and towers, and then the salt water came flowing over the walls and filled the castle. Drowned men were floating in the yard. When I first dreamed the dream, back at Greywater, I didn’t know their faces, but now I do. That Alebelly is one, the guard who called our names at the feast. Your septon’s another. Your smith as well.    Mikken?  Bran was as confused as he was dismayed.  But the sea is hundreds and hundreds of leagues away, and Winterfell’s walls are so high the water couldn’t get in even if it did come.    In the dark of night the salt sea will flow over these walls,  said Jojen.  I saw the dead, bloated and drowned.    We have to tell them,  Bran said.  Alebelly and Mikken, and Septon Chayle. Tell them not to drown.    It will not save them,  replied the boy in green.  Meera came to the window seat and put a hand on his shoulder.  They will not believe, Bran. No more than you did.   Jojen sat on Bran’s bed.  Tell me what you dream.   He was scared, even then, but he had sworn to trust them, and a Stark of Winterfell keeps his sworn word.  There’s different kinds,  he said slowly.  There’s the wolf dreams, those aren’t so bad as the others. I run and hunt and kill squirrels. And there’s dreams where the crow comes and tells me to fly. Sometimes the tree is in those dreams too, calling my name. That frightens me. But the worst dreams are when I fall.  He looked down into the yard, feeling miserable.  I never used to fall before. When I climbed. I went everyplace, up on the roofs and along the walls, I used to feed the crows in the Burned Tower. Mother was afraid that I would fall but I knew I never would. Only I did, and now when I sleep I fall all the time.   Meera gave his shoulder a squeeze.  Is that all?    I guess.    Warg,  said Jojen Reed.  Bran looked at him, his eyes wide.  What?    Warg. Shapechanger. Beastling. That is what they will call you, if they should ever hear of your wolf dreams.   The names made him afraid again.  Who will call me?    Your own folk. In fear. Some will hate you if they know what you are. Some will even try to kill you.   Old Nan told scary stories of beastlings and shapechangers sometimes. In the stories they were always evil.  I’m not like that,  Bran said.  I’m not. It’s only dreams.    The wolf dreams are no true dreams. You have your eye closed tight whenever you’re awake, but as you drift off it flutters open and your soul seeks out its other half. The power is strong in you.    I don’t want it."
}