{
  "id": "8d54b736039c6c507b768b245fa6f8bd84b97699",
  "text": "      HOUSE MARTELL  Dorne was the last of the Seven Kingdoms to swear fealty to the Iron Throne. Blood, custom, and history all set the Dornishmen apart from the other kingdoms. When the war of succession broke out, the Prince of Dorne kept his silence and took no part.    The Martell banner is a red sun pierced by a golden spear. Their words are Unbowed, Unbent, Unbroken.    DORAN NYMEROS MARTELL, Lord of Sunspear, Prince of Dorne,  —his wife, MELLARIO, of the Free City of Norvos,  —their children:    —PRINCESS ARIANNE, their eldest daughter, heir to Sunspear,  —PRINCE QUENTYN, their eldest son,  —PRINCE TRYSTANE, their younger son,    —his siblings:    —his sister, {PRINCESS ELIA}, wed to Prince Rhaegar Targaryen, slain during the Sack of King’s Landing,    —Elia’s daughter, {PRINCESS RHAENYS}, a young girl murdered during the Sack of King’s Landing,  —Elia’s son, {PRINCE AEGON}, a babe, murdered during the Sack of King’s Landing,      —his brother, PRINCE OBERYN, the Red Viper,    —his household:    —AREO HOTAH, a Norvoshi sellsword, captain of guards,  —MAESTER CALEOTTE, counselor, healer, and tutor,    —his lords bannermen:    —EDRIC DAYNE, Lord of Starfall.      The principal houses sworn to Sunspear include Jordayne, Santagar, Allyrion, Toland, Yronwood, Wyl, Fowler, and Dayne.      HOUSE TYRELL  Lord Tyrell of Highgarden declared his support for King Renly after Renly’s marriage to his daughter Margaery, and brought most of his principal bannermen to Renly’s cause. The Tyrell sigil is a golden rose on a grass-green field. Their words are Growing Strong.    MACE TYRELL, Lord of Highgarden, Warden of the South, Defender of the Marches, High Marshal of the Reach, and Hand of the King,  —his wife, LADY ALERIE, of House Hightower of Oldtown,  —their children:    —WILLAS, their eldest son, heir to Highgarden,  —SER GARLAN, called the GALLANT, their second son,  —SER LORAS, the Knight of Flowers, their youngest son, Lord Commander of the Rainbow Guard,  —MARGAERY, their daughter, a maid of fifteen years, recently wed to Renly Baratheon,    —his widowed mother, LADY OLENNA of House Redwyne, called the QUEEN OF THORNS,  —his sisters:    —MINA, wed to Paxter Redwyne, Lord of the Arbor,    —their children:  —SER HORAS REDWYNE, twin to Hobber, mocked as HORROR,  —SER HOBBER REDWYNE, twin to Horas, mocked as SLOBBER,  —DESMERA REDWYNE, a maid of sixteen,      —JANNA, wed to Ser Jon Fossoway,    —his uncles:    —GARTH, called the GROSS, Lord Seneschal of Highgarden,    —Garth’s bastard sons, GARSE and GARRETT FLOWERS,      —SER MORYN, Lord Commander of the City Watch of Oldtown,  —MAESTER GORMON, a scholar of the Citadel,    —his household:    —MAESTER LOMYS, counselor, healer, and tutor,  —IGON VYRWEL, captain of the guard,  —SER VORTIMER CRANE, master-at-arms,  —BUTTERBUMPS, fool and jester, hugely fat.      THE MEN OF THE NIGHT’S WATCH  The Night’s Watch protects the realm, and is sworn to take no part in civil wars and contests for the throne. Traditionally, in times of rebellion, they do honor to all kings and obey none.    At Castle Black    JEOR MORMONT, Lord Commander of the Night’s Watch, called the OLD BEAR,  —his steward and squire, JON SNOW, the bastard of Winterfell, called LORD SNOW,    —Jon’s white direwolf, GHOST,    —MAESTER AEMON (TARGARYEN), counselor and healer,    —SAMWELL TARLY and CLYDAS, his stewards,    —BENJEN STARK, First Ranger, lost beyond the Wall,    —THOREN SMALLWOOD, a senior ranger,  —JARMEN BUCKWELL, a senior ranger,  —SER OTTYN WYTHERS, SER ALADALE WYNCH, GRENN, PYPAR, MATTHAR, ELRON, LARK called the SISTERMAN, rangers,    —OTHELL YARWYCK, First Builder,    —HALDER, ALBETT, builders,    —BOWEN MARSH, Lord Steward    —CHETT, steward and dog handler,  —EDDISON TOLLETT, called DOLOROUS EDD, a dour squire,    —SEPTON CELLADAR, a drunken devout,  —SER ENDREW TARTH, master-at-arms,  —brothers of Castle Black:    —DONAL NOYE, armorer and smith, one-armed,  —THREE-FINGER HOBB, cook,  —JEREN, RAST, CUGEN, recruits still in training,  —CONWY, GUEREN,  wandering crows,  recruiters who collect orphan boys and criminals for the Wall,  —YOREN, the senior of the  wandering crows,     —PRAED, CUTJACK, WOTH, REYSEN, QYLE, recruits bound for the Wall,  —KOSS, GERREN, DOBBER, KURZ, BITER, RORGE, JAQEN HIGHAR, criminals bound for the Wall,  —LOMMY GREENHANDS, GENDRY, TARBER, HOT PIE, ARRY, orphan boys bound for the Wall.      At Eastwatch-by-the-Sea    COTTER PYKE, Commander, Eastwatch,  —SER ALLISER THORNE, master-at-arms,  —brothers of Eastwatch:    —DAREON, steward and singer.        The day was grey and bitter cold, and the dogs would not take the scent.  The big black bitch had taken one sniff at the bear tracks, backed off, and skulked back to the pack with her tail between her legs. The dogs huddled together miserably on the riverbank as the wind snapped at them. Chett felt it too, biting through his layers of black wool and boiled leather. It was too bloody cold for man or beast, but here they were."
}