{
  "id": "8d7305bde8f1cadabf203564adccc588c7a553de",
  "text": "\" Harry stared at him in amazement.  The large chunk missing from Moody's nose was particularly obvious at a few inches' distance.  Moody grinned. \"Can your eye - I mean, can you - ?\" \"Yeah, it can see through Invisibility Cloaks,\" Moody said quietly. \"And it's come in useful at times, I can tell you.\" Hagrid was beaming down at Harry too. Harry knew Hagrid couldn't see him, but Moody had obviously told Hagrid he was there.  Hagrid now bent down on the pretext of reading the S.P.E.W. notebook as well, and said in a whisper so low that only Harry could hear it, \"Harry, meet me tonight at midnight at me cabin.  Wear that cloak.\" Straightening up, Hagrid said loudly, \"Nice ter see yeh, Hermione,\" winked, and departed.  Moody followed him. \"Why does Hagrid want me to meet him at midnight?\" Harry said, very surprised. \"Does he?\" said Hermione, looking startled.  \"I wonder what he's up to?  I don't know whether you should go, Harry. . . .\"  She looked nervously around and hissed, \"It might make you late for Sirius.\" It was true that going down to Hagrid's at midnight would mean cutting his meeting with Sirius very fine indeed; Hermione suggested sending Hedwig down to Hagrid's to tell him he couldn't go - always assuming she would consent to take the note, of course - Harry, however, thought it better just to be quick at whatever Hagrid wanted him for. He was very curious to know what this might be; Hagrid had never asked Harry to visit him so late at night. At half past eleven that evening, Harry, who had pretended to go up to bed early, pulled the Invisibility Cloak back over himself and crept back downstairs through the common room. Quite a few people were still in there.  The Creevey brothers had managed to get hold of a stack of Support Cedric Diggory!  badges and were trying to bewitch them to make them say Support Harry Potter! instead.  So far, however, all they had managed to do was get the badges stuck on POTTER STINKS.  Harry crept past them to the portrait hole and waited for a minute or so, keeping an eye on his watch.  Then Hermione opened the Fat Lady for him from outside as they had planned.  He slipped past her with a whispered \"Thanks!\"  and set off through the castle. The grounds were very dark.  Harry walked down the lawn toward the lights shining in Hagrid's cabin.  The inside of the enormous Beauxbatons carriage was also lit up; Harry could hear Madame Maxime talking inside it as he knocked on Hagrid's front door. \"You there, Harry?\"  Hagrid whispered, opening the door and looking around. \"Yeah,\" said Harry, slipping inside the cabin and pulling the cloak down off his head. \"What's up?\" \"Got summat ter show yeh,\" said Hagrid. There was an air of enormous excitement about Hagrid.  He was wearing a flower that resembled an oversized artichoke in his buttonhole.  It looked as though he had abandoned the use of axle grease, but he had certainly attempted to comb his hair - Harry could see the comb's broken teeth tangled in it. \"What're you showing me?\" Harry said warily, wondering if the skrewts had laid eggs, or Hagrid had managed to buy another giant three-headed dog off a stranger in a pub. \"Come with me, keep quiet, an' keep yerself covered with that cloak,\" said Hagrid. \"We won' take Fang, he won' like it. . . \"Listen, Hagrid, I can't stay long. . . . I've got to be back up at the castle by one o'clock -\" But Hagrid wasn't listening; he was opening the cabin door and striding off into the night.  Harry hurried to follow and found, to his great surprise, that Hagrid was leading him to the Beauxbatons carriage. \"Hagrid, what - ?\" \"Shhh!\" said Hagrid, and he knocked three times on the door bearing the crossed golden wands. Madame Maxime opened it.  She was wearing a silk shawl wrapped around her massive shoulders.  She smiled when she saw Hagrid. \"Ah, 'Agrid . . . it is time?\" \"Bong-sewer,\" said Hagrid, beaming at her, and holding out a hand to help her down the golden steps. Madame Maxime closed the door behind her, Hagrid offered her his arm, and they set off around the edge of the paddock containing Madame Maxime's giant winged horses, with Harry, totally bewildered, running to keep up with them. Had Hagrid wanted to show him Madame Maxime?  He could see her any old time he wanted.. . she wasn't exactly hard to miss.... But it seemed that Madame Maxime was in for the same treat as Harry, because after a while she said playfully,  \"Wair is it you are taking me, 'Agrid?\" \"Yeh'll enjoy this,\" said Hagrid gruffly, \"worth seein', trust me. On'y - don' go tellin' anyone I showed yeh, right?  Yeh're not s'posed ter know.\" \"Of course not,\" said Madame Maxime, fluttering her long black eyelashes. And still they walked, Harry getting more and more irritated as he jogged along in their wake, checking his watch every now and then.  Hagrid had some harebrained scheme in hand, which might make him miss Sirius.  If they didn't get there soon, he was going to turn around, go straight back to the castle, and leave Hagrid to enjoy his moonlit stroll with Madame Maxime."
}