{
  "id": "8d83f3aa8ff020f87ca1ad396dda30db88f65101",
  "text": "  \"Maybe Snape's found out how to get past him without asking Hagrid,\" said Ron, looking up at the thousands of books surrounding them. \"I bet there's a book somewhere in here telling you how to get past a giant three-headed dog. So what do we do, Harry?\"  The light of adventure was kindling again in Ron's eyes, but Hermione answered before Harry could.  \"Go to Dumbledore. That's what we should have done ages ago. If we try anything ourselves we'll be thrown out for sure.\"  \"But we've got no proof!\" said Harry. \"Quirrell's too scared to back us up. Snape's only got to say he doesn't know how the troll got in at Halloween and that he was nowhere near the third floor -- who do you think they'll believe, him or us? It's not exactly a secret we hate him, Dumbledore'll think we made it up to get him sacked. Filch wouldn't help us if his life depended on it, he's too friendly with Snape, and the more students get thrown out, the better, he'll think. And don't forget, we're not supposed to know about the Stone or Fluffy. That'll take a lot of explaining.\"  Hermione looked convinced, but Ron didn't.  \"If we just do a bit of poking around --\"  \"No,\" said Harry flatly, \"we've done enough poking around.\"  He pulled a map of Jupiter toward him and started to learn the names of its moons.  The following morning, notes were delivered to Harry, Hermione, and Neville at the breakfast table. They were all the same:  Your detention will take place at eleven o'clock tonight. Meet Mr. Filch in the entrance hall.  Professor McGonagall Harry had forgotten they still had detentions to do in the furor over the points they'd lost. He half expected Hermione to complain that this was a whole night of studying lost, but she didn't say a word. Like Harry, she felt they deserved what they'd got.  At eleven o'clock that night, they said good-bye to Ron in the common room and went down to the entrance hall with Neville. Filch was already there -- and so was Malfoy. Harry had also forgotten that Malfoy had gotten a detention, too.  \"Follow me,\" said Filch, lighting a lamp and leading them outside.  I bet you'll think twice about breaking a school rule again, won't you, eh?\" he said, leering at them. \"Oh yes... hard work and pain are the best teachers if you ask me.... It's just a pity they let the old punishments die out... hang you by your wrists from the ceiling for a few days, I've got the chains still in my office, keep 'em well oiled in case they're ever needed.... Right, off we go, and don't think of running off, now, it'll be worse for you if you do.\"  They marched off across the dark grounds. Neville kept sniffing. Harry wondered what their punishment was going to be. It must be something really horrible, or Filch wouldn't be sounding so delighted.  The moon was bright, but clouds scudding across it kept throwing them into darkness. Ahead, Harry could see the lighted windows of Hagrid's hut. Then they heard a distant shout.  \"Is that you, Filch? Hurry up, I want ter get started.\"  Harry's heart rose; if they were going to be working with Hagrid it wouldn't be so bad. His relief must have showed in his -face, because Filch said, \"I suppose you think you'll be enjoying yourself with that oaf? Well, think again, boy -- it's into the forest you're going and I'm much mistaken if you'll all come out in one piece.\"  At this, Neville let out a little moan, and Malfoy stopped dead in his tracks.  \"The forest?\" he repeated, and he didn't sound quite as cool as usual. \"We can't go in there at night -- there's all sorts of things in there -- werewolves, I heard.\"  Neville clutched the sleeve of Harry's robe and made a choking noise.  \"That's your problem, isn't it?\" said Filch, his voice cracking with glee. \"Should've thought of them werewolves before you got in trouble, shouldn't you?\"  Hagrid came striding toward them out of the dark, Fang at his heel. He was carrying his large crossbow, and a quiver of arrows hung over his shoulder.  \"Abou' time,\" he said. \"I bin waitin' fer half an hour already. All right, Harry, Hermione?\"  \"I shouldn't be too friendly to them, Hagrid,\" said Filch coldly, they're here to be punished, after all.\"  \"That's why yer late, is it?\" said Hagrid, frowning at Filch. \"Bin lecturin' them, eh? 'Snot your place ter do that. Yeh've done yer bit, I'll take over from here.\"  \"I'll be back at dawn,\" said Filch, \"for what's left of them,\" he added nastily, and he turned and started back toward the castle, his lamp bobbing away in the darkness.  Malfoy now turned to Hagrid.  \"I'm not going in that forest, he said, and Harry was pleased to hear the note of panic in his voice.  \"Yeh are if yeh want ter stay at Hogwarts,\" said Hagrid fiercely. \"Yeh've done wrong an' now yehve got ter pay fer it.\"  \"But this is servant stuff, it's not for students to do. I thought we'd be copying lines or something, if my father knew I was doing this, he'd  tell yer that's how it is at Hogwarts,\" Hagrid growled. \"Copyin' lines! What good's that ter anyone? Yeh'll do summat useful or Yeh'll get out."
}