{
  "id": "8e01ed95fd8eebbbc80a5ad871cb5f4942d134c6",
  "text": " Bran and Meera shared the breast while Jojen ate the thigh. Hodor devoured the wing and leg, muttering  Hodor  and licking the grease off his fingers after every bite. It was Bran’s turn to tell a story, so he told them about another Brandon Stark, the one called Brandon the Shipwright, who had sailed off beyond the Sunset Sea.  Dusk was settling by the time duck and tale were done, and the rain still fell. Bran wondered how far Summer had roamed and whether he had caught one of the deer.  Grey gloom filled the tower, and slowly changed to darkness. Hodor grew restless and walked awhile, striding round and round the walls and stopping to peer into the privy on every circuit, as if he had forgotten what was in there. Jojen stood by the north balcony, hidden by the shadows, looking out at the night and the rain. Somewhere to the north a lightning bolt crackled across the sky, brightening the inside of the tower for an instant. Hodor jumped and made a frightened noise. Bran counted to eight, waiting for the thunder. When it came, Hodor shouted,  Hodor!   I hope Summer isn’t scared too, Bran thought. The dogs in Winterfell’s kennels had always been spooked by thunderstorms, just like Hodor. I should go see, to calm him…  The lightning flashed again, and this time the thunder came at six.  Hodor!  Hodor yelled again.  HODOR! HODOR!  He snatched up his sword, as if to fight the storm.  Jojen said,  Be quiet, Hodor. Bran, tell him not to shout. Can you get the sword away from him, Meera?    I can try.    Hodor, hush,  said Bran.  Be quiet now. No more stupid hodoring. Sit down.    Hodor?  He gave the longsword to Meera meekly enough, but his face was a mask of confusion.  Jojen turned back to the darkness, and they all heard him suck in his breath.  What is it?  Meera asked.   Men in the village.    The man we saw before?    Other men. Armed. I saw an axe, and spears as well.  Joien had never sounded so much like the boy he was.  I saw them when the lightning flashed, moving under the trees.    How many?    Many and more. Too many to count.    Mounted?   No.    Hodor.  Hodor sounded frightened.  Hodor. Hodor.   Bran felt a little scared himself, though he didn’t want to say so in front of Meera.  What if they come out here?    They won’t.  She sat down beside him.  Why should they?    For shelter.  Jojen’s voice was grim.  Unless the storm lets up. Meera, could you go down and bar the door?    I couldn’t even close it. The wood’s too warped. They won’t get past those iron gates, though.    They might. They could break the lock, or the hinges. Or climb up through the murder hole as we did.   Lightning slashed the sky, and Hodor whimpered. Then a clap of thunder rolled across the lake.  HODOR!  he roared, clapping his hands over his ears and stumbling in a circle through the darkness.  HODOR! HODOR! HODOR!    NO!  Bran shouted back.  NO HODORING!   It did no good.  HOOOODOR!  moaned Hodor. Meera tried to catch him and calm him, but he was too strong. He flung her aside with no more than a shrug.  HOOOOOODOOOOOOOR!  the stableboy screamed as lightning filled the sky again, and even Jojen was shouting now, shouting at Bran and Meera to shut him up.   Be quiet!  Bran said in a shrill scared voice, reaching up uselessly for Hodor’s leg as he crashed past, reaching, reaching.  Hodor staggered, and closed his mouth. He shook his head slowly from side to side, sank back to the floor, and sat crosslegged. When the thunder boomed, he scarcely seemed to hear it. The four of them sat in the dark tower, scarce daring to breathe.   Bran, what did you do?  Meera whispered.   Nothing.  Bran shook his head.  I don’t know.  But he did. I reached for him, the way I reach for Summer. He had been Hodor for half a heartbeat. It scared him.   Something is happening across the lake,  said Jojen.  I thought I saw a man pointing at the tower.   I won’t be afraid. He was the Prince of Winterfell, Eddard Stark’s son, almost a man grown and a warg too, not some little baby boy like Rickon. Summer would not be afraid.  Most like they’re just some Umbers,  he said.  Or they could be Knotts or Norreys or Flints come down from the mountains, or even brothers from the Night’s Watch. Were they wearing black cloaks, Jojen?    By night all cloaks are black, Your Grace. And the flash came and went too fast for me to tell what they were wearing.   Meera was wary.  If they were black brothers, they’d be mounted, wouldn’t they?   Bran had thought of something else.  It doesn’t matter,  he said confidently.  They couldn’t get out to us even if they wanted. Not unless they had a boat, or knew about the causeway.    The causeway!  Meera mussed Bran’s hair and kissed him on the forehead.  Our sweet prince! He’s right, Jojen, they won’t know about the causeway. Even if they did they could never find the way across at night in the rain.    The night will end, though. If they stay till morning…  Jojen left the rest unsaid. After a few moments he said,  They are feeding the fire the first man started."
}