{
  "id": "8e141c2c99d7be759fb4616eb7bcc8e145e76634",
  "text": " He didn’t see me drowned, did he? No? Good.   It heartened Bran to hear that. Maybe they won’t drown, then, he thought. If they stay away from the sea.  Meera thought so too, later that night when she and Joien met Bran in his room to play a three-sided game of tiles, but her brother shook his head.  The things I see in green dreams can’t be changed.   That made his sister angry.  Why would the gods send a warning if we can’t heed it and change what’s to come?    I don’t know,  Joien said sadly.   If you were Alebelly, you’d probably jump into the well to have done with it! He should fight, and Bran should too.    Me?  Bran felt suddenly afraid.  What should I fight? Am I going to drown too?   Meera looked at him guiltily.  I shouldn’t have said…   He could tell that she was hiding something.  Did you see me in a green dream?  he asked Jojen nervously.  Was I drowned?    Not drowned.  Jojen spoke as if every word pained him.  I dreamed of the man who came today, the one they call Reek. You and your brother lay dead at his feet, and he was skinning off your faces with a long red blade.   Meera rose to her feet.  If I went to the dungeon, I could drive a spear right through his heart. How could he murder Bran if he was dead?    The gaolers will stop you,  Joien said.  The guards. And if you tell them why you want him dead, they’ll never believe.    I have guards too,  Bran reminded them.  Alebelly and Poxy Tym and Hayhead and the rest.   Jojen’s mossy eyes were full of pity.  They won’t be able to stop him, Bran. I couldn’t see why, but I saw the end of it. I saw you and Rickon in your crypts, down in the dark with all the dead kings and their stone wolves.   No, Bran thought. No.  If I went away… to Greywater, or to the crow, someplace far where they couldn’t find me…    It will not matter. The dream was green, Bran, and the green dreams do not lie.       TYRION  Vrys stood over the brazier, warming his soft hands.  It would appear Renly was murdered most fearfully in the very midst of his army. His throat was opened from ear to ear by a blade that passed through steel and bone as if they were soft cheese.    Murdered by whose hand?  Cersei demanded.   Have you ever considered that too many answers are the same as no answer at all? My informers are not always as highly placed as we might like. When a king dies, fancies sprout like mushrooms in the dark. A groom says that Renly was slain by a knight of his own Rainbow Guard. A washerwoman claims Stannis stole through the heart of his brother’s army with his magic sword. Several men-at-arms believe a woman did the fell deed, but cannot agree on which woman. A maid that Renly had spurned, claims one. A camp follower brought in to serve his pleasure on the eve of battle, says a second. The third ventures that it might have been the Lady Catelyn Stark.   The queen was not pleased.  Must you waste our time with every rumor the fools care to tell?    You pay me well for these rumors, my gracious queen.    We pay you for the truth, Lord Varys. Remember that, or this small council may grow smaller still.   Varys tittered nervously.  You and your noble brother will leave His Grace with no council at all if you continue.    I daresay, the realm could survive a few less councillors,  said Littlefinger with a smile.   Dear dear Petyr,  said Varys,  are you not concerned that yours might be the next name on the Hand’s little list?    Before you, Varys? I should never dream of it.    Mayhaps we will be brothers on the Wall together, you and I.  Varys giggled again.   Sooner than you’d like, if the next words out of your mouth are not something useful, eunuch.  From the look of her eyes, Cersei was prepared to castrate Varys all over again.   Might this be some ruse?  asked Littlefinger.   If so, it is a ruse of surpassing cleverness,  said Varys.  It has certainly hoodwinked me.   Tyrion had heard enough.  Joff will be so disappointed,  he said.  He was saving such a nice spike for Renly’s head. But whoever did the deed, we must assume Stannis was behind it. The gain is clearly his.  He did not like this news; he had counted on the brothers Baratheon decimating each other in bloody battle. He could feel his elbow throbbing where the morningstar had laid it open. It did that sometimes in the damp. He squeezed it uselessly in his hand and asked,  What of Renly’s host?    The greater part of his foot remains at Bitterbridge.  Varys abandoned the brazier to take his seat at the table.  Most of the lords who rode with Lord Renly to Storm’s End have gone over banner-and-blade to Stannis, with all their chivalry.    Led by the Florents, I’d wager,  said Littlefinger.  Varys gave him a simpering smile.  You would win, my lord. Lord Alester was indeed the first to bend the knee. Many others followed.    Many,  Tyrion said pointedly,  but not all?    Not all,  agreed the eunuch.  Not Loras Tyrell, nor Randyll Tarly, nor Mathis Rowan. And Storm’s End itself has not yielded. Ser Cortnay Penrose holds the castle in Renly’s name, and will not believe his liege is dead."
}