{
  "id": "8e78582c06b7717f70f1063d5bd3ec6aab397094",
  "text": " I count myself well rid of him. The trueborn sons my young wife has promised me would never have been safe while he lived.   The sound of hurrying footsteps drove the morbid thoughts from her head. Ser Desmond’s squire dashed panting into the room and knelt.  My lady… Lannisters… across the river.    Take a long breath, lad, and tell it slowly.   He did as she bid him.  A column of armored men,  he reported.  Across the Red Fork. They are flying a purple unicorn below the lion of Lannister.   Some son of Lord Brax. Brax had come to Riverrun once when she was a girl, to propose wedding one of his sons to her or Lysa. She wondered whether it was this same son out there now, leading the attack.  The Lannisters had ridden out of the southeast beneath a blaze of banners, Ser Desmond told her when she ascended to the battlements to join him.  A few outriders, no more,  he assured her.  The main strength of Lord Tywin’s host is well to the south. We are in no danger here.   South of the Red Fork the land stretched away open and flat. From the watchtower Catelyn could see for miles. Even so, only the nearest ford was visible. Edmure had entrusted Lord Jason Mallister with its defense, as well as that of three others farther upriver. The Lannister riders were milling about uncertainly near the water, crimson and silver banners flapping in the wind.  No more than fifty, my lady,  Ser Desmond estimated.  Catelyn watched the riders spread out in a long line. Lord Jason’s men waited to receive them behind rocks and grass and hillocks. A trumpet blast sent the horsemen forward at a ponderous walk, splashing down into the current. For a moment they made a brave show, all bright armor and streaming banners, the sun flashing off the points of their lances.   Now,  she heard Brienne mutter.  It was hard to make out what was happening, but the screams of the horses seemed loud even at this remove, and beneath them Catelyn heard the fainter clash of steel on steel. A banner vanished suddenly as its bearer was swept under, and soon after the first dead man drifted past their walls, borne along by the current. By then the Lannisters had pulled back in confusion. She watched as they re-formed, conferred briefly, and galloped back the way they had come. The men on the walls shouted taunts after them, though they were already too far off to hear.  Ser Desmond slapped his belly.  Would that Lord Hoster could have seen that. It would have made him dance.    My father’s dancing days are past, I fear,  Catelyn said,  and this fight is just begun. The Lannisters will come again. Lord Tywin has twice my brother’s numbers.    He could have ten times and it would not matter,  Ser Desmond said.  The west bank of the Red Fork is higher than the east, my lady, and well wooded. Our bowmen have good cover, and a clear field for their shafts… and should any breach occur, Edmure will have his best knights in reserve, ready to ride wherever they are most sorely needed. The river will hold them.    I pray that you are right,  Catelyn said gravely.  That night they came again. She had commanded them to wake her at once if the enemy returned, and well after midnight a serving girl touched her gently by the shoulder. Catelyn sat up at once.  What is it?    The ford again, my lady.   Wrapped in a bedrobe, Catelyn climbed to the roof of the keep. From there she could see over the walls and the moonlit river to where the battle raged. The defenders had built watchfires along the bank, and perhaps the Lannisters thought to find them night-blind or unwary. If so, it was folly. Darkness was a chancy ally at best. As they waded in to breast their way across, men stepped in hidden pools and went down splashing, while others stumbled over stones or gashed their feet on the hidden caltrops. The Mallister bowmen sent a storm of fire arrows hissing across the river, strangely beautiful from afar. One man, pierced through a dozen times, his clothes afire, danced and whirled in the knee-deep water until at last he fell and was swept downstream. By the time his body came bobbing past Riverrun, the fires and his life had both been extinguished.  A small victory, Catelyn thought when the fighting had ended and the surviving foemen had melted back into the night, yet a victory nonetheless. As they descended the winding turret steps, Catelyn asked Brienne for her thoughts.  That was the brush of Lord Tywin’s fingertip, my lady,  the girl said.  He is probing, feeling for a weak point, an undefended crossing. If he does not find one, he will curl all his fingers into a fist and try and make one.  Brienne hunched her shoulders.  That’s what I’d do. Were I him.  Her hand went to the hilt of her sword and gave it a little pat, as if to make certain it was still there.  And may the gods help us then, Catelyn thought. Yet there was nothing she could do for it. That was Edmure’s battle out there on the river; hers was here inside the castle.  The next morning as she broke her fast, she sent for her father’s aged steward, Utherydes Wayn."
}