{
  "id": "8e843d15fccd2ae29ac8e0b8765d606744285f36",
  "text": " Maester Luwin urged him to do just that, but Robb would not hear of it.  My lord father would never have sent men off to die while he huddled like a craven behind the walls of Winterfell,  he said, all Robb the Lord.  Robb seemed half a stranger to Bran now, transformed, a lord in truth, though he had not yet seen his sixteenth name day. Even their father’s bannermen seemed to sense it. Many tried to test him, each in his own way. Roose Bolton and Robett Glover both demanded the honor of battle command, the first brusquely, the second with a smile and a jest. Stout, grey-haired Maege Mormont, dressed in mail like a man, told Robb bluntly that he was young enough to be her grandson, and had no business giving her commands… but as it happened, she had a granddaughter she would be willing to have him marry. Soft-spoken Lord Cerwyn had actually brought his daughter with him, a plump, homely maid of thirty years who sat at her father’s left hand and never lifted her eyes from her plate. Jovial Lord Hornwood had no daughters, but he did bring gifts, a horse one day, a haunch of venison the next, a silver-chased hunting horn the day after, and he asked nothing in return… nothing but a certain holdfast taken from his grandfather, and hunting rights north of a certain ridge, and leave to dam the White Knife, if it please the lord.  Robb answered each of them with cool courtesy, much as Father might have, and somehow he bent them to his will.  And when Lord Umber, who was called the Greatjon by his men and stood as tall as Hodor and twice as wide, threatened to take his forces home if he was placed behind the Hornwoods or the Cerwyns in the order of march, Robb told him he was welcome to do so.  And when we are done with the Lannisters,  he promised, scratching Grey Wind behind the ear,  we will march back north, root you out of your keep, and hang you for an oathbreaker.  Cursing, the Greatjon flung a flagon of ale into the fire and bellowed that Robb was so green he must piss grass. When Hallis Mollen moved to restrain him, he knocked him to the floor, kicked over a table, and unsheathed the biggest, ugliest greatsword that Bran had ever seen. All along the benches, his sons and brothers and sworn swords leapt to their feet, grabbing for their steel.  Yet Robb only said a quiet word, and in a snarl and the blink of an eye Lord Umber was on his back, his sword spinning on the floor three feet away and his hand dripping blood where Grey Wind had bitten off two fingers.  My lord father taught me that it was death to bare steel against your liege lord,  Robb said,  but doubtless you only meant to cut my meat.  Bran’s bowels went to water as the Greatjon struggled to rise, sucking at the red stumps of fingers… but then, astonishingly, the huge man laughed.  Your meat,  he roared,  is bloody tough.   And somehow after that the Greatjon became Robb’s right hand, his staunchest champion, loudly telling all and sundry that the boy lord was a Stark after all, and they’d damn well better bend their knees if they didn’t fancy having them chewed off.  Yet that very night, his brother came to Bran’s bedchamber pale and shaken, after the fires had burned low in the Great Hall.  I thought he was going to kill me,  Robb confessed.  Did you see the way he threw down Hal, like he was no bigger than Rickon? Gods, I was so scared. And the Greatjon’s not the worst of them, only the loudest. Lord Roose never says a word, he only looks at me, and all I can think of is that room they have in the Dreadfort, where the Boltons hang the skins of their enemies.    That’s just one of Old Nan’s stories,  Bran said. A note of doubt crept into his voice.  Isn’t it?    I don’t know.  He gave a weary shake of his head.  Lord Cerwyn means to take his daughter south with us. To cook for him, he says. Theon is certain I’ll find the girl in my bedroll one night. I wish… I wish Father was here…   That was the one thing they could agree on, Bran and Rickon and Robb the Lord; they all wished Father was here. But Lord Eddard was a thousand leagues away, a captive in some dungeon, a hunted fugitive running for his life, or even dead. No one seemed to know for certain; every traveler told a different tale, each more terrifying than the last. The heads of Father’s guardsmen were rotting on the walls of the Red Keep, impaled on spikes. King Robert was dead at Father’s hands. The Baratheons had laid siege to King’s Landing. Lord Eddard had fled south with the king’s wicked brother Renly. Arya and Sansa had been murdered by the Hound. Mother had killed Tyrion the Imp and hung his body from the walls of Riverrun. Lord Tywin Lannister was marching on the Eyrie, burning and slaughtering as he went. One wine-sodden taleteller even claimed that Rhaegar Targaryen had returned from the dead and was marshaling a vast host of ancient heroes on Dragonstone to reclaim his father’s throne.  When the raven came, bearing a letter marked with Father’s own seal and written in Sansa’s hand, the cruel truth seemed no less incredible."
}