{
  "id": "8ea0ecfc7f5b06768fd9c057b3d578f66b03320e",
  "text": " His men attacked Jaime and his guards, even as his wife attacked Tyrion on the kingsroad.    You know me better than that, Robert,  Ned said.  Ask Lord Baelish if you doubt me. He was there.    I’ve talked to Littlefinger,  Robert said.  He claims he rode off to bring the gold cloaks before the fighting began, but he admits you were returning from some whorehouse.    Some whorehouse? Damn your eyes, Robert, I went there to have a look at your daughter! Her mother has named her Barra. She looks like that first girl you fathered, when we were boys together in the Vale.  He watched the queen as he spoke; her face was a mask, still and pale, betraying nothing.  Robert flushed.  Barra,  he grumbled.  Is that supposed to please me? Damn the girl. I thought she had more sense.    She cannot be more than fifteen, and a whore, and you thought she had sense?  Ned said, incredulous. His leg was beginning to pain him sorely. It was hard to keep his temper.  The fool child is in love with you, Robert.   The king glanced at Cersei.  This is no fit subject for the queen’s ears.    Her Grace will have no liking for anything I have to say,  Ned replied.  I am told the Kingslayer has fled the city. Give me leave to bring him back to justice.   The king swirled the wine in his cup, brooding. He took a swallow.  No,  he said.  I want no more of this. Jaime slew three of your men, and you five of his. Now it ends.    Is that your notion of justice?  Ned flared.  If so, I am pleased that I am no longer your Hand.   The queen looked to her husband.  If any man had dared speak to a Targaryen as he has spoken to you—    Do you take me for Aerys?  Robert interrupted.   I took you for a king. Jaime and Tyrion are your own brothers, by all the laws of marriage and the bonds we share. The Starks have driven off the one and seized the other. This man dishonors you with every breath he takes, and yet you stand there meekly, asking if his leg pains him and would he like some wine.   Robert’s face was dark with anger.  How many times must I tell you to hold your tongue, woman?   Cersei’s face was a study in contempt.  What a jape the gods have made of us two,  she said.  By all rights, you ought to be in skirts and me in mail.   Purple with rage, the king lashed out, a vicious backhand blow to the side of the head. She stumbled against the table and fell hard, yet Cersei Lannister did not cry out. Her slender fingers brushed her cheek, where the pale smooth skin was already reddening. On the morrow the bruise would cover half her face.  I shall wear this as a badge of honor,  she announced.   Wear it in silence, or I’ll honor you again,  Robert vowed. He shouted for a guard. Ser Meryn Trant stepped into the room, tall and somber in his white armor.  The queen is tired. See her to her bedchamber.  The knight helped Cersei to her feet and led her out without a word.  Robert reached for the flagon and refilled his cup.  You see what she does to me, Ned.  The king seated himself, cradling his wine cup.  My loving wife. The mother of my children.  The rage was gone from him now; in his eyes Ned saw something sad and scared.  I should not have hit her. That was not… that was not kingly.  He stared down at his hands, as if he did not quite know what they were.  I was always strong… no one could stand before me, no one. How do you fight someone if you can’t hit them?  Confused, the king shook his head.  Rhaegar… Rhaegar won, damn him. I killed him, Ned, I drove the spike right through that black armor into his black heart, and he died at my feet. They made up songs about it. Yet somehow he still won. He has Lyanna now, and I have her.  The king drained his cup.   Your Grace,  Ned Stark said,  we must talk…   Robert pressed his fingertips against his temples.  I am sick unto death of talk. On the morrow I’m going to the kingswood to hunt. Whatever you have to say can wait until I return.    If the gods are good, I shall not be here on your return. You commanded me to return to Winterfell, remember?   Robert stood up, grasping one of the bedposts to steady himself.  The gods are seldom good, Ned. Here, this is yours.  He pulled the heavy silver hand clasp from a pocket in the lining of his cloak and tossed it on the bed.  Like it or not, you are my Hand, damn you. I forbid you to leave.   Ned picked up the silver clasp. He was being given no choice, it seemed. His leg throbbed, and he felt as helpless as a child.  The Targaryen girl—   The king groaned.  Seven hells, don’t start with her again. That’s done, I’ll hear no more of it.    Why would you want me as your Hand, if you refuse to listen to my counsel?    Why?  Robert laughed.  Why not? Someone has to rule this damnable kingdom. Put on the badge, Ned. It suits you. And if you ever throw it in my face again, I swear to you, I’ll pin the damned thing on Jaime Lannister.       CATELYN  The eastern sky was rose and gold as the sun broke over the Vale of Arryn. Catelyn Stark watched the light spread, her hands resting on the delicate carved stone of the balustrade outside her window."
}