{
  "id": "8ec07a6852eedab413949be8d4a34ec79594a271",
  "text": "  For  him  there was  a  little  mattress  of  straw  and  woollen  blankets.  He  snuggled  into  them  very  gladly,  summertime though it was. The fire burned low and he fell asleep. Yet in the night  he woke: the fire had now sunk to a few embers; the dwarves and Gandalf were all  asleep,  to  judge  by  their  breathing;  a  splash  of  white  on  the  floor  came  from  the  high moon, which was peering down through the smoke-hole in the roof.   ####-There  was  a  growling  sound  outside,  and  a  noise  as  of  some  great  animal  scuffling  at  the  door. Bilbo .wondered what it was, and whether it could be Beorn  in enchanted shape, and if he would come in as a bear and kill them.  He  dived  under  the  blankets  and  hid  his  head,  and  fell  asleep  again  at  last  in  spite of his fears.  It was full morning when he awoke. One of the dwarves had fallen over him in  the shadows where he lay, and had rolled down with a bump from the platform on  to  the  floor.  It was Bofur,  and he was grumbling  about  it, when Bilbo opened his  eyes.  \"Get up lazybones,\" he said, \"or there will be no breakfast left for you.\"  Up jumped Bilbo. \"Breakfast!\" he cried. \"Where is breakfast?\"  \"Mostly  inside us,\"  answered  the other dwarves who were moving  around  the  hall; \"but what is left is out on the veranda. We have been about looking for Beorn  ever  since  the  sun got up; but  there  is no  sign of him anywhere,  though we  found  breakfast laid as soon as we went out.\"  \"Where is Gandalf?\" asked Bilbo, moving off to find something to eat as quick  as he could.  \"O!  out  and  about  somewhere,\"  they  told  him.  But  he  saw  no  sign  of  the  wizard  all  that  day  until  the  evening.  Just  before  sunset  he  walked  into  the  hall,  where  the  hobbit  and  the  dwarves  were  having  supper,  waited  on  by  Beorn's  wonderful  animals,  as  they  had  been  all  day.  Of  Beorn  they  had  seen  and  heard  nothing since the night before, and they were getting puzzled.  \"Where is our host, and where have you been all day yourself?\" they all cried.  \"One  question  at  a  time-and  none  till  after  supper!  I  haven't  had  a  bite  since  breakfast.\"  At  last  Gandalf  pushed  away  his  plate  and  jug  —  he  had  eaten  two  whole  loaves  (with masses  of  butter  and  honey  and  clotted  cream)  and  drunk  at  least  a  quart  of mead  and  he  took  out  his  pipe.  \"I will  answer  the  second  question  first,\"  he said, \"-but bless me! this is a splendid place for smoke rings!\" Indeed for a long  time they could get nothing more out of him, he was so busy sending smoke-rings  dodging  round  the  pillars  of  the  hall,  changing  them  into  all  sorts  of  different  shapes and colours, and setting  them at  last chasing one another out of the hole in  the roof.  They must have  looked very queer  from outside, popping out  into  the  air one  after another, green, blue, red, silver-grey, yellow, white; big ones, little ones; little  ones dodging  through big ones  and  joining  into  figure-eights, and going off like a  flock of birds into the distance.   ####-\"I have been picking out bear-tracks,\" he said at last. \"There must have been a  regular  bears'  meeting  outside  here  last  night.  I  soon  saw  that  Beorn  could  not  have  made  them  all:  there  were  far  too many  of  them,  and  they  were  of  various  sizes  too.  I  should  say  there  were  little  bears,  large  bears,  ordinary  bears,  and  gigantic big bears, all dancing outside from dark to nearly dawn. They came from  almost every direction, except from the west over the river, from the Mountains. In  that  direction  only  one  set  of  footprints  led-none  coming,  only  ones  going  away  from here.  I  followed  these  as  far  as  the  Carrock.  There  they  disappeared  into  the  river,  but  the water was  too  deep  and  strong  beyond  the  rock  for me  to  cross.  It  is  easy  enough, as you remember, to get from this bank to the Carrock by the ford, but on  the  other  side  is  a  cliff  standing  up  from  a  swirling  channel.  I  had  to  walk miles  before  I  found  a  place  where  the  river  was  wide  and  shallow  enough  for  me  to  wade  and  swim,  and  then  miles  back  again  to  pick  up  the  tracks  again.  By  that  time  it  was  too  late  for  me  to  follow  them  far.  They  went  straight  off  in  the  direction of the pine-woods on the east side of the Misty Mountains, where we had  our  pleasant  little  party  with  the  Wargs  the  night  before  last.  And  now  I  think  I  have  answered  your  first  question,  too,\"  ended  Gandalf,  and  he  sat  a  long  while  silent.  Bilbo  thought  he  knew what  the wizard meant.  \"What  shall we  do,\"  he  cried,  \"if  he  leads  all  the Wargs  and  the  goblins  down  here? We  shall  all  be  caught  and  killed! I thought you said he was not 9 friend of theirs.\"  \"So I did. And don't be silly! You had better go to bed, your wits are sleepy."
}