{
  "id": "8eecad7b3a39b0e06776dd22437fa36f8c6ee3a8",
  "text": "  \"You heard James?\" said Lupin in a strange voice.  \"Yeah...\" Face dry, Harry looked up. \"Why -- you didn't know my dad, did you?\"  \"I -- I did, as a matter of fact,\" said Lupin. \"We were friends at Hogwarts. Listen, Harry -- perhaps we should leave it here for tonight. This charm is ridiculously advanced.... I shouln't have suggested putting you through this....\"  \"No!\" said Harry. He got up again. \"I'll have one more go! I'm not thinking of happy enough things, that's what it is.... Hang on....\"  He racked his brains. A really, really happy memory... one that he could turn into a good, strong Patronus...  The moment when he'd first found out he was a wizard, and would be leaving the Dursleys for Hogwarts! If that wasn't a happy memory, he didn't know what was.... Concentrating very hard on how he had felt when he'd realized he'd be leaving Privet Drive, Harry got to his feet and faced the packing case once more.  \"Ready?\" said Lupin, who looked as though he were doing this against his better judgment. \"Concentrating hard? All right -- go!\"  He pulled off the lid of the case for the third time, and the dementor rose out of it; the room fell cold and dark  'EXPECTO PATRONUM!\" Harry bellowed. \"EXPECTO PATRONUM! EXPECTO PATRONUM! \"  The screaming inside Harry's head had started again -- except this time, it sounded as though it were coming from a badly tuned radio -- softer and louder and softer again -- and he could still see the dementor -- it had halted -- and then a huge, silver shadow came bursting out of the end of Harry's wand, to hover between him and the dementor, and though Harry's legs felt like water, he was still on his feet -- though for how much longer, he wasn't sure --  \"Riddikulus!\" roared Lupin, springing forward.  There was a loud crack, and Harry's cloudy Patronus vanished along with the dementor; he sank into a chair, feeling as exhausted as if he'd just run a mile, and felt his legs shaking. Out of the corner of his eye, he saw Professor Lupin forcing the boggart back into the packing case with his wand; it had turned into a silvery orb again.  \"Excellent!\" Lupin said, striding over to where Harry sat. \"Excellent, Harry! That was definitely a start!\"  \"Can we have another go? Just one more go?\"  \"Not now,\" said Lupin firmly. \"You've had enough for one night. Here --\"  He handed Harry a large bar of Honeydukes' best chocolate.  \"Eat the lot, or Madam Pomfrey will be after my blood. Same time next week?\"  \"Okay,\" said Harry. He took a bite of the chocolate and watched Lupin extinguishing the lamps that had rekindled with the disappearance of the dementor. A thought had just occurred to him.  \"Professor Lupin?\" he said. \"If you knew my dad, you must've known Sirius Black as well.\"  Lupin turned very quickly.  \"What gives you that idea?\" he said sharply.  \"Nothing -- I mean, I just knew they were friends at Hogwarts too....\"  Lupin's face relaxed.  \"Yes, I knew him,\" he said shortly. \"Or I thought I did. You'd better be off, Harry, it's getting late.\"  Harry left the classroom, walking along the corridor and around a corner, then took a detour behind a suit of armor and sank down on its plinth to finish his chocolate, wishing he hadn't mentioned Black, as Lupin was obviously not keen on the subject. Then Harry's thoughts wandered back to his mother and father...  He felt drained and strangely empty, even though he was so full of chocolate. Terrible though it was to hear his parents' last moments replayed inside his head, these were the only times Harry had heard their voices since he was a very small child. But he'd never be able to produce a proper Patronus if he half wanted to hear his parents again....  \"They're dead,\" he told himself sternly. \"They're dead and listening to echoes of them won't bring them back. You'd better get a grip on yourself if you want that Quidditch Cup.\"  He stood up, crammed the last bit of chocolate into his mouth, and headed back to Gryffindor Tower.  Ravenclaw played Slytherin a week after the start of term. Slytherin won, though narrowly. According to Wood, this was good news for Gryffindor, who would take second place if they beat Ravenclaw too. He therefore increased the number of team practices to five a leek. This meant that with Lupin's anti-dementor classes, which in themselves were more draining than six Quidditch practices, Harry had just one night a week to do all his homework. Even so, he was showing the strain nearly as much as Hermione, whose immense workload finally seemed to be getting to her. Every night, without fail, Hermione was to be seen in a corner of the common room, several tables spread with books, Arithmancy charts, rune dictionaries, diagrams of Muggles lifting heavy objects, and file upon file of extensive notes; she barely spoke to anybody and snapped when she was interrupted.  \"How's she doing it?\" Ron muttered to Harry one evening as Harry sat finishing a nasty essay on Undetectable Poisons for Snape. Harry looked up. Hermione was barely visible behind a tottering pile of books."
}