{
  "id": "8f0fcd7bdbb5711e33c520eecad1a4e2d2f84e10",
  "text": " From the gallery above drifted down the merry strains of pipes and fiddle. A line of arched windows ran along the south wall, but they had been closed off with heavy draperies. Thick velvet hangings admitted no thread of light, and would muffle the sound of prayer and war alike. It makes no matter, Sansa thought. The war is with us.  Almost every highborn woman in the city sat at the long trestle tables, along with a handful of old men and young boys. The women were wives, daughters, mothers, and sisters. Their men had gone out to fight Lord Stannis. Many would not return. The air was heavy with the knowledge. As Joffrey’s betrothed, Sansa had the seat of honor on the queen’s right hand. She was climbing the dais when she saw the man standing in the shadows by the back wall. He wore a long hauberk of oiled black mail, and held his sword before him: her father’s greatsword, Ice, near as tall as he was. Its point rested on the floor, and his hard bony fingers curled around the crossguard on either side of the grip. Sansa’s breath caught in her throat. Ser Ilyn Payne seemed to sense her stare. He turned his gaunt, pox-ravaged face toward her.   What is he doing here?  she asked Osfryd Kettleblack. He captained the queen’s new red cloak guard.  Osfryd grinned.  Her Grace expects she’ll have need of him before the night’s done.   Ser Ilyn was the King’s Justice. There was only one service he might be needed for. Whose head does she want?   All rise for Her Grace, Cersei of House Lannister, Queen Regent and Protector of the Realm,  the royal steward cried.  Cersei’s gown was snowy linen, white as the cloaks of the Kingsguard. Her long dagged sleeves showed a lining of gold satin. Masses of bright yellow hair tumbled to her bare shoulders in thick curls. Around her slender neck hung a rope of diamonds and emeralds. The white made her look strangely innocent, almost maidenly, but there were points of color on her cheeks.   Be seated,  the queen said when she had taken her place on the dais,  and be welcome.  Osfryd Kettleblack held her chair; a page performed the same service for Sansa.  You look pale, Sansa,  Cersei observed.  Is your red flower still blooming?    Yes.    How apt. The men will bleed out there, and you in here.  The queen signaled for the first course to be served.   Why is Ser Ilyn here?  Sansa blurted out.  The queen glanced at the mute headsman.  To deal with treason, and to defend us if need be. He was a knight before he was a headsman.  She pointed her spoon toward the end of the hall, where the tall wooden doors had been closed and barred.  When the axes smash down those doors, you may be glad of him.   I would be gladder if it were the Hound, Sansa thought. Harsh as he was, she did not believe Sandor Clegane would let any harm come to her.  Won’t your guards protect us?    And who will protect us from my guards?  The queen gave Osfryd a sideways look.  Loyal sellswords are rare as virgin whores. If the battle is lost my guards will trip on those crimson cloaks in their haste to rip them off. They’ll steal what they can and flee, along with the serving men, washer women, and stableboys, all out to save their own worthless hides. Do you have any notion what happens when a city is sacked, Sansa? No, you wouldn’t, would you? All you know of life you learned from singers, and there’s such a dearth of good sacking songs.    True knights would never harm women and children.  The words rang hollow in her ears even as she said them.   True knights.  The queen seemed to find that wonderfully amusing.  No doubt you’re right. So why don’t you just eat your broth like a good girl and wait for Symeon Star-Eyes and Prince Aemon the Dragonknight to come rescue you, sweetling. I’m sure it won’t be very long now.       DAVOS  Blackwater Bay was rough and choppy, whitecaps everywhere. Black Betha rode the flood tide, her sail cracking and snapping at each shift of wind. Wraith and Lady Marya sailed beside her, no more than twenty yards between their hulls. His sons could keep a line. Davos took pride in that.  Across the sea warhorns boomed, deep throaty moans like the calls of monstrous serpents, repeated ship to ship.  Bring down the sail,  Davos commanded.  Lower mast. Oarsmen to your oars.  His son Matthos relayed the commands. The deck of Black Betha churned as crewmen ran to their tasks, pushing through the soldiers who always seemed to be in the way no matter where they stood. Ser Imry had decreed that they would enter the river on oars alone, so as not to expose their sails to the scorpions and spitfires on the walls of King’s Landing.  Davos could make out Fury well to the southeast, her sails shimmering golden as they came down, the crowned stag of Baratheon blazoned on the canvas. From her decks Stannis Baratheon had commanded the assault on Dragonstone sixteen years before, but this time he had chosen to ride with his army, trusting Fury and the command of his fleet to his wife’s brother Ser Imry, who’d come over to his cause at Storm’s End with Lord Alester and all the other Florents."
}