{
  "id": "8f14e557ffaf51a73451b0a154baa374f2138bdf",
  "text": " In this light she could almost be a knight. Brienne’s sword took flame as well, burning silvery blue. The darkness retreated a little more.   The flames will burn so long as you live,  he heard Cersei call.  When they die, so must you.    Sister!  he shouted.  Stay with me. Stay!  There was no reply but the soft sound of retreating footsteps.  Brienne moved her longsword back and forth, watching the silvery flames shift and shimmer. Beneath her feet, a reflection of the burning blade shone on the surface of the flat black water. She was as tall and strong as he remembered, yet it seemed to Jaime that she had more of a woman’s shape now.   Do they keep a bear down here?  Brienne was moving, slow and wary, sword to hand; step, turn, and listen. Each step made a little splash.  A cave lion? Direwolves? Some bear? Tell me, Jaime. What lives here? What lives in the darkness?    Doom.  No bear, he knew. No lion.  Only doom.   In the cool silvery-blue light of the swords, the big wench looked pale and fierce.  I mislike this place.    I’m not fond of it myself.  Their blades made a little island of light, but all around them stretched a sea of darkness, unending.  My feet are wet.    We could go back the way they brought us. If you climbed on my shoulders you’d have no trouble reaching that tunnel mouth.   Then I could follow Cersei. He could feel himself growing hard at the thought, and turned away so Brienne would not see.   Listen.  She put a hand on his shoulder, and he trembled at the sudden touch. She’s warm.  Something comes.  Brienne lifted her sword to point off to his left.  There,   He peered into the gloom until he saw it too. Something was moving through the darkness, he could not quite make it out…   A man on a horse. No, two. Two riders, side by side.    Down here, beneath the Rock?  It made no sense. Yet there came two riders on pale horses, men and mounts both armored. The destriers emerged from the blackness at a slow walk. They make no sound, Jaime realized. No splashing, no clink of mail nor clop of hoof. He remembered Eddard Stark, riding the length of Aerys’s throne room wrapped in silence. Only his eyes had spoken; a lord’s eyes, cold and grey and full of judgment.   Is it you, Stark?  Jaime called.  Come ahead. I never feared you living, I do not fear you dead.   Brienne touched his arm.  There are more.   He saw them too. They were armored all in snow, it seemed to him, and ribbons of mist swirled back from their shoulders. The visors of their helms were closed, but Jaime Lannister did not need to look upon their faces to know them.  Five had been his brothers. Oswell Whent and Jon Darry. Lewyn Martell, a prince of Dorne. The White Bull, Gerold Hightower. Ser Arthur Dayne, Sword of the Morning. And beside them, crowned in mist and grief with his long hair streaming behind him, rode Rhaegar Targaryen, Prince of Dragonstone and rightful heir to the Iron Throne.   You don’t frighten me,  he called, turning as they split to either side of him. He did not know which way to face.  I will fight you one by one or all together. But who is there for the wench to duel? She gets cross when you leave her out.    I swore an oath to keep him safe,  she said to Rhaegar’s shade.  I swore a holy oath.    We all swore oaths,  said Ser Arthur Dayne, so sadly.  The shades dismounted from their ghostly horses. When they drew their longswords, it made not a sound.  He was going to burn the city,  Jaime said.  To leave Robert only ashes.    He was your king,  said Darry.   You swore to keep him safe,  said Whent.   And the children, them as well,  said Prince Lewyn.  Prince Rhaegar burned with a cold light, now white, now red, now dark.  I left my wife and children in your hands.    I never thought he’d hurt them.  Jaime’s sword was burning less brightly now.  I was with the king…    Killing the king,  said Ser Arthur.   Cutting his throat,  said Prince Lewyn.   The king you had sworn to die for,  said the White Bull.  The fires that ran along the blade were guttering out, and Jaime remembered what Cersei had said. No. Terror closed a hand about his throat. Then his sword went dark, and only Brienne’s burned, as the ghosts came rushing in.   No,  he said,  no, no, no. Nooooooooo!   Heart pounding, he jerked awake, and found himself in starry darkness amidst a grove of trees. He could taste bile in his mouth, and he was shivering with sweat, hot and cold at once. When he looked down for his sword hand, his wrist ended in leather and linen, wrapped snug around an ugly stump. He felt sudden tears well up in his eyes. I felt it, I felt the strength in my fingers, and the rough leather of the sword’s grip. My hand…   My lord.  Qyburn knelt beside him, his fatherly face all crinkly with concern.  What is it? I heard you cry out.   Steelshanks Walton stood above them, tall and dour.  What is it? Why did you scream?    A dream… only a dream.  Jaime stared at the camp around him, lost for a moment.  I was in the dark, but I had my hand back."
}