{
  "id": "8f3e053930f8e33413565f87dd81ee9607505c27",
  "text": " It is a hundred years and three and fifty since I came out of the egg, but I do  not  forget what my  father  told me. Now  I  am  the  chief  of  the  great  ravens  of  the  Mountain. We are few, but we remember still the king that was of old. Most of my  people are abroad, for there are great tidings in the South – some are tidings of joy  to you, and some you will not think so good.  \"Behold! the birds are gathering back again to the Mountain and to Dale from  South and East and West, for word has gone out that Smaug is dead!\"  \"Dead!  Dead?\"  shouted  the  dwarves.  \"Dead!  Then  we  have  been  in  needless  fear-and the treasure is ours!\"  They all sprang up and began to caper about for joy.   \"Yes,  dead,\"  said Róac. \"The  thrush, may his feathers never fall, saw him die,  and  we may  trust  his  words.  He  saw  him  fall  in  battle  with  the men  of  Esgaroth  the third night back from now at the rising of the moon.\"  It was some time before Thorin could bring the dwarves to be silent and listen  to  the  raven's  news. At  length when  he  had  told  all  the  tale  of  the  battle  he went  on:  \"So  much  for  joy,  Thorin  Oakenshield.  You  may  go  back  to  your  halls  in  safety;  all  the  treasure  is  yours-for  the  moment.  But  many  are  gathering  hither  beside  the  birds.  The  news  of  the  death  of  the  guardian  has  already  gone  far  and  wide, and the legend of the wealth of Thror has not lost in the telling during many  years; many are eager for a share of the spoil. Already a host of the elves is on the  way,  and  carrion birds  are with  them hoping  for battle  and  slaughter. By  the  lake  men murmur  that  their sorrows are due  to  the dwarves; for  they are homeless and   ####-many  have  died,  and  Smaug  has  destroyed  their  town.  They  too  think  to  find  amends from your treasure, whether you are alive or dead.  \"Your  own wisdom must  decide  your  course,  but  thirteen  is  small  remnant  of  the great folk of Durin that once dwelt here, and now are scattered far. If you will  listen to my counsel, you will not trust the Master of the Lake-men, but rather him  that  shot  the  dragon  with  his  bow.  Bard  is  he,  of  the  race  of  Dale,  of  the  line  of  Girion; he is a grim man but true. We would see peace once more among dwarves  and  men  and  elves  after  the  long  desolation;  but  it  may  cost  you  dear  in  gold.  I  have spoken.\"  Then Thorin burst forth in anger: \"Our thanks, Róac Carc's son. You and your  people shall not be forgotten. But none of our gold shall thieves take or the violent  carry  off  while  we  are  alive.  If  you  would  earn  our  thanks  still  more,  bring  us  news of any that draw near. Also I would beg of you, if any of you are still young  and strong of wing, that you would send messengers to our kin in the mountains of  the  North,  both  west  from  here  and  east,  and  tell  them  of  our  plight.  But  go  specially to my cousin Dain in the Iron Hills, for he has many people well-armed,  and dwells nearest to this place. Bid him hasten!\"  \"I  will  not  say  if  this  counsel  be  good  or  bad,\"  croaked  Róac;  \"but  I will  do  what can be done.\" Then off he slowly flew.   \"Back now to the Mountain!\" cried Thorin. \"We have little time to lose.\"  \"And  little  food  to  use!\"  cried  Bilbo,  always  practical  on  such  points.  In  any  case  he  felt  that  the  adventure was, properly speaking, over  .with  the death of  the  dragon-in  which  he  was  much  mistaken-and  he  would  have  given  most  of  his  share of the profits for the peaceful winding up of these affairs.  \"Back  to  the  Mountain!\"  cried  the  dwarves  as  if  they  had  not  heard  him;  so  back he had  to go with  them. As you have heard  some of  the  events  already, you  will  see  that  the  dwarves  still  had  some  days  before  them.  They  explored  the  caverns  once  more,  and  found,  as  they  expected,  that  only  the  Front  Gate  remained  open;  all  the  other  gates  (except,  of  course,  the  small  secret  door)  had  long  ago  been  broken  and  blocked  by  Smaug,  and  no  sign  of  them  remained.  So  now  they  began  to  labour  hard  in  fortifying  the  main  entrance,  and  in  remaking  the  road  that  led  from  it.  Tools  were  to  be  found  in  plenty  that  the  miners  and  quarriers  and  builders  of  old  had  used;  and  at  such  work  the  dwarves  were  still  very skilled.  As  they  worked  the  ravens  brought  them  constant  tidings.  In  this  way  they  learned  that  the  Elvenking  had  turned  aside  to  the  Lake,  and  they  still  had  a  breathing  space. Better  still,  they heard  that  three of  their ponies had escaped and   ####-were wandering wild far down the banks of the Running River, not far from where  the  rest of  their  stores had been  left. So while  the others went on with  their work,  Fili  and  Kili  were  sent,  guided  by  a  raven,  to  find  the  ponies  and  bring  back  all  they could."
}