{
  "id": "8f593ceed6bf4dd9df6a38bef15269f83924aab5",
  "text": "  And to keep foreign wizards from finding it, they'll have made it Unplottable -\" \"Come again?\"  \"Well, you can enchant a building so it's impossible to plot on a map, can't you?\" \"Er. . . if you say so,\" said Harry. \"But I think Durmstrang must be somewhere in the far north,\" said Hermione thoughtfully.  \"Somewhere very cold, because they've got fur capes as part of their uniforms.\" \"Ah, think of the possibilities,\" said Ron dreamily. \"It would've been so easy to push Malfoy off a glacier and make it look like an accident... . Shame his mother likes him. . . .\" The rain became heavier and heavier as the train moved farther north. The sky was so dark and the windows so steamy that the lanterns were lit by midday. The lunch trolley came rattling along the corridor, and Harry bought a large stack of Cauldron Cakes for them to share. Several of their friends looked in on them as the afternoon progressed, including Seamus Finnigan, Dean Thomas, and Neville Longbottom, a round-faced, extremely forgetful boy who had been brought up by his formidable witch of a grandmother.  Seamus was still wearing his Ireland rosette.  Some of its magic seemed to be wearing off now; it was still squeaking  \"Troy - Mullet - Moran!\"  but in a very feeble and exhausted sort of way.  After half an hour or so, Hermione, growing tired of the endless Quidditch talk, buried herself once more in The Standard Book of Spells, Grade 4, and started trying to learn a Summoning Charm. Neville listened jealously to the others' conversation as they relived the Cup match. \"Gran didn't want to go,\" he said miserably. \"Wouldn't buy tickets. It sounded amazing though.\" \"It was,\" said Ron. \"Look at this, Neville. . . He rummaged in his trunk up in the luggage rack and pulled out the miniature figure of Viktor Krum. \"Oh wow,\" said Neville enviously as Ron tipped Krum onto his pudgy hand. \"We saw him right up close, as well,\" said Ron. \"We were in the Top Box -\" \"For the first and last time in your life, Weasley.\" Draco Malfoy had appeared in the doorway. Behind him stood Crabbe and Goyle, his enormous, thuggish cronies, both of whom appeared to have grown at least a foot during the summer. Evidently they had overheard the conversation through the compartment door, which Dean and Seamus had left ajar. \"Don't remember asking you to join us, Malfoy,\" said Harry coolly. \"Weasley. . . what is that?\" said Malfoy, pointing at Pigwidgeon's cage. A sleeve of Ron's dress robes was dangling from it, swaying with the motion of the train, the moldy lace cuff very obvious. Ron made to stuff the robes out of sight, but Malfoy was too quick for him; he seized the sleeve and pulled. \"Look at this!\" said Malfoy in ecstasy, holding up Ron's robes and showing Crabbe and Goyle, \"Weasley, you weren't thinking of wearing these, were you? I mean - they were very fashionable in about eighteen ninety. . . \"Eat dung, Malfoy!\" said Ron, the same color as the dress robes as he snatched them back out of Malfoy's grip. Malfoy howled with derisive laughter; Crabbe and Goyle guffawed stupidly. \"So. . . going to enter, Weasley?  Going to try and bring a bit of glory to the family name?  There's money involved as well, you know. . . you'd be able to afford some decent robes if you won. . . .\" \"What are you talking about?\" snapped Ron. 'Are you going to enter?'  Malfoy repeated.  \"I suppose you will, Potter?  You never miss a chance to show off, do you?\" \"Either explain what you're on about or go away, Malfoy,\" said Hermione testily, over the top of The Standard Book of Spells, Grade 4. A gleeful smile spread across Malfoy's pale face \"Don't tell me you don't know?\" he said delightedly. \"You've got a father and brother at the Ministry and you don't even know?  My God, my father told me about it ages ago. . . heard it from Cornelius Fudge.  But then, Father's always associated with the top people at the Ministry. . . . Maybe your father's too junior to know about it, Weasley. . . yes. . . they probably don't talk about important stuff in front of him. . . .\" Laughing once more, Malfoy beckoned to Crabbe and Goyle, and the three of them disappeared. Ron got to his feet and slammed the sliding compartment door so hard behind them that the glass shattered. \"Ron!\" said Hermione reproachfully, and she pulled out her wand, muttered \"Reparo!\" and the glass shards flew back into a single pane and back into the door. \"Well.. . making it look like he knows everything and we don't.. . .\" Ron snarled. \"Father's always associated with the top peopie at the Ministry.'. . . Dad could've got a promotion any time... he just likes it where he is. . . .\" \"Of course he does,\" said Hermione quietly. \"Don't let Malfoy get to you, Ron -\"  \"Him! Get to me!?  As if!\"  said Ron, picking up one of the remaining Cauldron Cakes and squashing it into a pulp. Ron's bad mood continued for the rest of the journey. He didn't talk much as they changed into their school robes, and was still glowering when the Hogwarts Express slowed down at last and finally stopped in the pitch-darkness of Hogsmeade station."
}