{
  "id": "8f8c4fed0e86d37c30e9257bf1bc0ebbdadd3f70",
  "text": "  There comes the Harbinger! Cleanse yourselves, the gods cry out, lest ye be cleansed! Bathe in the wine of righteousness, or you shall be bathed in fire! Fire!    Fire!  other voices echoed, but the hoots of derision almost drowned them out. Tyrion took solace from that. He gave the command to continue, and the litter rocked like a ship on a rough sea as the Burned Men cleared a path. Twisted little monkey demon indeed. The wretch did have a point about the High Septon, to be sure. What was it that Moon Boy had said of him the other day? A pious man who worships the Seven so fervently that he eats a meal for each of them whenever he sits to table. The memory of the fool’s jape made Tyrion smile.  He was pleased to reach the Red Keep without further incident. As he climbed the steps to his chambers, Tyrion felt a deal more hopeful than he had at dawn. Time, that’s all I truly need, time to piece it all together. Once the chain is done… He opened the door to his solar.  Cersei turned away from the window, her skirts swirling around her slender hips.  How dare you ignore my summons!    Who admitted you to my tower?    Your tower? This is my son’s royal castle.    So they tell me.  Tyrion was not amused. Crawn would be even less so; his Moon Brothers had the guard today.  I was about to come to you, as it happens.    Were you?   He swung the door shut behind him.  You doubt me?    Always, and with good reason.    I’m hurt.  Tyrion waddled to the sideboard for a cup of wine. He knew no surer way to work up a thirst than talking with Cersei.  If I’ve given you offense, I would know how.    What a disgusting little worm you are. Myrcella is my only daughter. Did you truly imagine that I would allow you to sell her like a bag of oats?    Myrcella, he thought. Well, that egg has hatched. Let’s see what color the chick is.  Hardly a bag of oats. Myrcella is a princess. Some would say this is what she was born for. Or did you plan to marry her to Tommen?   Her hand lashed out, knocking the wine cup from his hand to spill on the floor.  Brother or no, I should have your tongue out for that. I am Joffrey’s regent, not you, and I say that Myrcella will not be shipped off to this Dornishman the way I was shipped to Robert Baratheon.   Tyrion shook wine off his fingers and sighed.  Why not? She’d be a deal safer in Dorne than she is here.    Are you utterly ignorant or simply perverse? You know as well as I that the Martells have no cause to love us.    The Martells have every cause to hate us. Nonetheless, I expect them to agree. Prince Doran’s grievance against House Lannister goes back only a generation, but the Dornishmen have warred against Storm’s End and Highgarden for a thousand years, and Renly has taken Dorne’s allegiance for granted. Myrcella is nine, Trystane Martell eleven. I have proposed they wed when she reaches her fourteenth year. Until such time, she would be an honored guest at Sunspear, under Prince Doran’s protection.    A hostage,  Cersei said, mouth tightening.   An honored guest,  Tyrion insisted,  and I suspect Martell will treat Myrcella more kindly than Joffrey has treated Sansa Stark. I had in mind to send Ser Arys Oakheart with her. With a knight of the Kingsguard as her sworn shield, no one is like to forget who or what she is.    Small good Ser Arys will do her if Doran Martell decides that my daughter’s death would wash out his sister’s.    Martell is too honorable to murder a nine-year-old girl, particularly one as sweet and innocent as Myrcella. So long as he holds her he can be reasonably certain that we’ll keep faith on our side, and the terms are too rich to refuse. Myrcella is the least part of it. I’ve also offered him his sister’s killer, a council seat, some castles on the Marches…    Too much.  Cersei paced away from him, restless as a lioness, skirts swirling.  You’ve offered too much, and without my authority or consent.    This is the Prince of Dorne we are speaking of. If I’d offered less, he’d likely spit in my face.    Too much!  Cersei insisted, whirling back.   What would you have offered him, that hole between your legs?  Tyrion said, his own anger flaring.  This time he saw the slap coming. His head snapped around with a crack.  Sweet sweet sister,  he said,  I promise you, that was the last time you will ever strike me.   His sister laughed.  Don’t threaten me, little man. Do you think Father’s letter keeps you safe? A piece of paper. Eddard Stark had a piece of paper too, for all the good it did him.   Eddard Stark did not have the City Watch, Tyrion thought, nor my clansmen, nor the sellswords that Bronn has hired. I do. Or so he hoped. Trusting in Varys, in Ser Jacelyn Bywater, in Bronn. Lord Stark had probably had his delusions as well.  Yet he said nothing. A wise man did not pour wildfire on a brazier. Instead he poured a fresh cup of wine.  How safe do you think Myrcella will be if King’s Landing falls? Renly and Stannis will mount her head beside yours.   And Cersei began to cry."
}