{
  "id": "904739dda3293d1abf2bc3f4b5ce648bec307c31",
  "text": "  \"You're worth twelve of Malfoy,\" Harry said. \"The Sorting Hat chose you for Gryffindor, didn't it? And where's Malfoy? In stinking Slytherin.\"  Neville's lips twitched in a weak smile as he unwrapped the frog.  \"Thanks, Harry... I think I'll go to bed.... D'you want the card, you collect them, don't you?\"  As Neville walked away, Harry looked at the Famous Wizard card.  \"Dumbledore again,\" he said, \"He was the first one I ever-\"  He gasped. He stared at the back of the card. Then he looked up at Ron and Hermione.  \"I've found him!\" he whispered. \"I've found Flamel! I told you I'd read the name somewhere before, I read it on the train coming here -- listen to this: 'Dumbledore is particularly famous for his defeat of the dark wizard Grindelwald in 1945, for the discovery of the twelve uses of dragon's blood, and his work on alchemy with his partner, Nicolas Flamel'!\"  Hermione jumped to her feet. She hadn't looked so excited since they'd gotten back the marks for their very first piece of homework.  \"Stay there!\" she said, and she sprinted up the stairs to the girls' dormitories. Harry and Ron barely had time to exchange mystified looks before she was dashing back, an enormous old book in her arms.  \"I never thought to look in here!\" she whispered excitedly. \"I got this out of the library weeks ago for a bit of light reading.\"  \"Light?\" said Ron, but Hermione told him to be quiet until she'd looked something up, and started flicking frantically through the pages, muttering to herself.  At last she found what she was looking for.  \"I knew it! I knew it!\"  \"Are we allowed to speak yet?\" said Ron grumpily. Hermione ignored him.  \"Nicolas Flamel,\" she whispered dramatically, \"is the only known maker of the Sorcerer's Stone!\"  This didn't have quite the effect she'd expected.  \"The what?\" said Harry and Ron.  \"Oh, honestly, don't you two read? Look -- read that, there.\"  She pushed the book toward them, and Harry and Ron read: The ancient study of alchemy is concerned with making the Sorcerer's Stone, a legendary substance with astonishing powers. The stone will transform any metal into pure gold. It also produces the Elixir of Life, which will make the drinker immortal.  There have been many reports of the Sorcerer's Stone over the centuries, but the only Stone currently in existence belongs to Mr. Nicolas Flamel, the noted alchemist and opera lover. Mr. Flamel, who celebrated his six hundred and sixty-fifth birthday last year, enjoys a quiet life in Devon with his wife, Perenelle (six hundred and fifty-eight).  \"See?\" said Hermione, when Harry and Ron had finished. \"The dog must be guarding Flamel's Sorcerer's Stone! I bet he asked Dumbledore to keep it safe for him, because they're friends and he knew someone was after it, that's why he wanted the Stone moved out of Gringotts!\"  \"A stone that makes gold and stops you from ever dying!\" said Harry. \"No wonder Snape's after it! Anyone would want it.\"  \"And no wonder we couldn't find Flamel in that Study of Recent Developments in Wizardry,\" said Ron. \"He's not exactly recent if he's six hundred and sixty-five, is he?\"  The next morning in Defense Against the Dark Arts, while copying down different ways of treating werewolf bites, Harry and Ron were still discussing what they'd do with a Sorcerer's Stone if they had one. It wasn't until Ron said he'd buy his own Quidditch team that Harry remembered about Snape and the coming match.  \"I'm going to play,\" he told Ron and Hermione. \"If I don't, all the Slytherins will think I'm just too scared to face Snape. I'll show them... it'll really wipe the smiles off their faces if we win.\"  \"Just as long as we're not wiping you off the field,\" said Hermione.  As the match drew nearer, however, Harry became more and more nervous, whatever he told Ron and Hermione. The rest of the team wasn't too calm, either. The idea of overtaking Slytherin in the house championship was wonderful, no one had done it for seven years, but would they be allowed to, with such a biased referee?  Harry didn't know whether he was imagining it or not, but he seemed to keep running into Snape wherever he went. At times, he even wondered whether Snape was following him, trying to catch him on his own. Potions lessons were turning into a sort of weekly torture, Snape was so horrible to Harry. Could Snape possibly know they'd found out about the Sorcerer's Stone? Harry didn't see how he could -- yet he sometimes had the horrible feeling that Snape could read minds.  Harry knew, when they wished him good luck outside the locker rooms the next afternoon, that Ron and Hermione were wondering whether they'd ever see him alive again. This wasn't what you'd call comforting. Harry hardly heard a word of Wood's pep talk as he pulled on his Quidditch robes and picked up his Nimbus Two Thousand.  Ron and Hermione, meanwhile, had found a place in the stands next to Neville, who couldn't understand why they looked so grim and worried, or why they had both brought their wands to the match."
}