{
  "id": "9069689d92a95629ec14faad1a8ea25f27fa7aed",
  "text": " Where did you come from?    Winterfell,  he said,  by way of Castle Black.    And what brings you up the Milkwater, so far from the fires of home?  He did not wait for Jon’s answer, but looked at once to Rattleshirt.  How many were they?    Five. Three’s dead and the boy’s here. T’other went up a mountainside where no horse could follow.   Rayder’s eyes met Jon’s again.  Was it only the five of you? Or are more of your brothers skulking about?    We were four and the Halfhand. Qhorin was worth twenty common men.   The King-beyond-the-Wall smiled at that.  Some thought so. Still… a boy from Castle Black with rangers from the Shadow Tower? How did that come to be?   Jon had his lie all ready.  The Lord Commander sent me to the Halfhand for seasoning, so he took me on his ranging.   Styr the Magnar frowned at that.  Ranging, you call it… why would crows come ranging up the Skirling Pass?    The villages were deserted,  Jon said, truthfully.  It was as if all the free folk had vanished.    Vanished, aye,  said Mance Rayder.  And not just the free folk. Who told you where we were, Jon Snow?   Tormund snorted.  It were Craster, or I’m a blushing maid. I told you, Mance, that creature needs to be shorter by a head.   The king gave the older man an irritated look.  Tormund, some day try thinking before you speak. I know it was Craster. I asked Jon to see if he would tell it true.    Har.  Tormund spat.  Well, I stepped in that!  He grinned at Jon.  See, lad, that’s why he’s king and I’m not. I can outdrink, outfight, and outsing him, and my member’s thrice the size o’ his, but Mance has cunning. He was raised a crow, you know, and the crow’s a tricksy bird.    I would speak with the lad alone, my Lord of Bones,  Mance Rayder said to Rattleshirt.  Leave us, all of you.    What, me as well?  said Tormund.   No, you especially,  said Mance.   I eat in no hall where I’m not welcome.  Tormund got to his feet.  Me and the hens are leaving.  He snatched another chicken off the brazier, shoved it into a pocket sewn in the lining of his cloak, said  Har,  and left licking his fingers. The others followed him out, all but the woman Dalla.   Sit, if you like,  Rayder said when they were gone.  Are you hungry? Tormund left us two birds at least.    I would be pleased to eat, Your Grace. And thank you.    Your Grace?  The king smiled.  That’s not a style one often hears from the lips of free folk. I’m Mance to most, The Mance to some. Will you take a horn of mead?    Gladly,  said Jon.  The king poured himself as Dalla cut the well-crisped hens apart and brought them each a half. Jon peeled off his gloves and ate with his fingers, sucking every morsel of meat off the bones.   Tormund spoke truly,  said Mance Rayder as he ripped apart a loaf of bread.  The black crow is a tricksy bird, that’s so… but I was a crow when you were no bigger than the babe in Dalla’s belly, Jon Snow. So take care not to play tricksy with me.    As you say, Your—Mance.   The king laughed.  Your Mance! Why not? I promised you a tale before, of how I knew you. Have you puzzled it out yet?   Jon shook his head.  Did Rattleshirt send word ahead?    By wing? We have no trained ravens. No, I knew your face. I’ve seen it before. Twice.   It made no sense at first, but as Jon turned it over in his mind, dawn broke.  When you were a brother of the Watch…    Very good! Yes, that was the first time. You were just a boy, and I was all in black, one of a dozen riding escort to old Lord Commander Qorgyle when he came down to see your father at Winterfell. I was walking the wall around the yard when I came on you and your brother Robb. It had snowed the night before, and the two of you had built a great mountain above the gate and were waiting for someone likely to pass underneath.    I remember,  said Jon with a startled laugh. A young black brother on the wallwalk, yes…  You swore not to tell.    And kept my vow. That one, at least.    We dumped the snow on Fat Tom. He was Father’s slowest guardsman.  Tom had chased them around the yard afterward, until all three were red as autumn apples.  But you said you saw me twice. When was the other time?    When King Robert came to Winterfell to make your father Hand,  the King-beyond-the-Wall said lightly.  Jon’s eyes widened in disbelief.  That can’t be so.    It was. When your father learned the king was coming, he sent word to his brother Benjen on the Wall, so he might come down for the feast. There is more commerce between the black brothers and the free folk than you know, and soon enough word came to my ears as well. It was too choice a chance to resist. Your uncle did not know me by sight, so I had no fear from that quarter, and I did not think your father was like to remember a young crow he’d met briefly years before. I wanted to see this Robert with my own eyes, king to king, and get the measure of your uncle Benjen as well. He was First Ranger by then, and the bane of all my people. So I saddled my fleetest horse, and rode."
}