{
  "id": "90885fdc7cd12c0a0b9abd58f9abd96279eccc3f",
  "text": "  When they went down into the entrance hall, they saw about twenty people milling around it, some of them eating toast, all examining the Goblet of Fire.  It had been placed in the center of the hall on the stool that normally bore the Sorting Hat.  A thin golden line had been traced on the floor, forming a circle ten feet around it in every direction. \"Anyone put their name in yet?\"  Ron asked a third-year girl eagerly. \"All the Durmstrang lot,\" she replied. \"But I haven't seen anyone from Hogwarts yet.\" \"Bet some of them put it in last night after we'd all gone to bed,\" said Harry.  \"I would've if it had been me. . . wouldn't have wanted everyone watching.  What if the goblet just gobbed you right back out again?\" Someone laughed behind Harry.  Turning, he saw Fred, George, and Lee Jordan hurrying down the staircase, all three of them looking extremely excited. \"Done it,\" Fred said in a triumphant whisper to Harry, Ron, and Hermione. \"Just taken it.\" \"What?\" said Ron. \"The Aging Potion, dung brains,\" said Fred. \"One drop each,\" said George, rubbing his hands together with glee.  \"We only need to be a few months older.\" \"We're going to split the thousand Galleons between the three of us if one of us wins,\" said Lee, grinning broadly. \"I'm not sure this is going to work, you know,\" said Hermione warningly. \"I'm sure Dumbledore will have thought of this.\" Fred, George, and Lee ignored her. \"Ready?\"  Fred said to the other two, quivering with excitement. \"C'mon, then - I'll go first -\" Harry watched, fascinated, as Fred pulled a slip of parchment out of his pocket bearing the words Fred Weasley - Hogwarts.  Fred walked right up to the edge of the line and stood there, rocking on his toes like a diver preparing for a fifty-foot drop. Then, with the eyes of every person in the entrance hall upon him, he took a great breath and stepped over the line. For a split second Harry thought it had worked - George certainly thought so, for he let out a yell of triumph and leapt after Fred - but next moment, there was a loud sizzling sound, and both twins were hurled out of the golden circle as though they had been thrown by an invisible shot-putter.  They landed painfully, ten feet away on the cold stone floor, and to add insult to injury, there was a loud popping noise, and both of them sprouted identical long white beards. The entrance hall rang with laughter.  Even Fred and George joined in, once they had gotten to their feet and taken a good look at each other's beards. \"I did warn you,\" said a deep, amused voice, and everyone turned to see Professor Dumbledore coming out of the Great Hall.  He surveyed Fred and George, his eyes twinkling. \"I suggest you both go up to Madam Pomfrey.  She is already tending to Miss Fawcett, of Ravenclaw, and Mr. Summers, of Hufflepuff, both of whom decided to age themselves up a little too.  Though I must say, neither of their beards is anything like as fine as yours.\" Fred and George set off for the hospital wing, accompanied by Lee, who was howling with laughter, and Harry, Ron, and Hermione, also chortling, went in to breakfast. The decorations in the Great Hall had changed this morning. As it was Halloween, a cloud of live bats was fluttering around the enchanted ceiling, while hundreds of carved pumpkins leered from every corner.  Harry led the way over to Dean and Seamus, who were discussing those Hogwarts students of seventeen or over who might be entering. \"There's a rumor going around that Warrington got up early and put his name in,\" Dean told Harry.  \"That big bloke from Slytherin who looks like a sloth.\" Harry, who had played Quidditch against Warrington, shook his head in disgust. \"We can't have a Slytherin champion!\" \"And all the Hufflepuffs are talking about Diggory,\" said Seamus contemptuously.  \"But I wouldn't have thought he'd have wanted to risk his good looks.\" \"Listen!\" said Hermione suddenly. People were cheering out in the entrance hall.  They all swiveled around in their seats and saw Angelina Johnson coming into the Hall, grinning in an embarrassed sort of way.  A tall black girl who played Chaser on the Gryffindor Quidditch team, Angelina came over to them, sat down, and said, \"Well, I've done it!  Just put my name in!\" \"You're kidding!\" said Ron, looking impressed. \"Are you seventeen, then?\" asked Harry. \"Course she is, can't see a beard, can you?\" said Ron. \"I had my birthday last week,\" said Angelina. \"Well, I'm glad someone from Gryffindor's entering,\" said Hermione. \"I really hope you get it, Angelina!\" \"Thanks, Hermione,\" said Angelina, smiling at her. Yeah, better you than Pretty-Boy Diggory, said Seamus, causing several Hufflepuffs passing their table to scowl heavily at him. \"What're we going to do today, then?\"  Ron asked Harry and Hermione when they had finished breakfast and were leaving the Great Hall. \"We haven't been down to visit Hagrid yet,\" said Harry. \"Okay,\" said Ron, \"just as long as he doesn't ask us to donate a few fingers to the skrewts."
}