{
  "id": "91661404ab95c787f78ac572f776f1986fce50cc",
  "text": "  Nevertheless, it was lonely with dislike pouring in on him from all sides. He could understand the Hufflepuffs' attitude, even if he didn't like it; they had their own champion to support.  He expected nothing less than vicious insults from the Slytherins - he was highly unpopular there and always had been, because he had helped Gryffindor beat them so often, both at Quidditch and in the Inter-House Championship.  But he had hoped the Ravenclaws might have found it in their hearts to support him as much as Cedric.  He was wrong, however.  Most Ravenclaws seemed to think that he had been desperate to earn himself a bit more fame by tricking the goblet into accepting his name. Then there was the fact that Cedric looked the part of a champion so much more than he did.  Exceptionally handsome, with his straight nose, dark hair, and gray eyes, it was hard to say who was receiving more admiration these days, Cedric or Viktor Krum.  Harry actually saw the same sixth-year girls who had been so keen to get Krum's autograph begging Cedric to sign their school bags one lunchtime. Meanwhile there was no reply from Sirius, Hedwig was refusing to come anywhere near him, Professor Trelawney was predicting his death with even more certainty than usual, and he did so badly at Summoning Charms in Professor Flitwick's class that he was given extra homework - the only person to get any, apart from Neville. \"It's really not that difficult, Harry,\" Hermione tried to reassure him as they left Flitwick's class - she had been making objects zoom across the room to her all lesson, as though she were some sort of weird magnet for board dusters, wastepaper baskets, and lunascopes.  \"You just weren't concentrating properly -\" \"Wonder why that was,\" said Harry darkly as Cedric Diggory walked past, surrounded by a large group of simpering girls, all of whom looked at Harry as though he were a particularly large Blast-Ended Skrewt.  \"Still - never mind, eh?  Double Potions to look forward to this afternoon. . .\" Double Potions was always a horrible experience, but these days it was nothing short of torture.  Being shut in a dungeon for an hour and a half with Snape and the Slytherins, all of whom seemed determined to punish Harry as much as possible for daring to become school champion, was about the most unpleasant thing Harry could imagine.  He had already struggled through one Friday's worth, with Hermione sitting next to him intoning \"ignore them, ignore them, ignore them\" under her breath, and he couldn't see why today should be any better. When he and Hermione arrived at Snape's dungeon after lunch, they found the Slytherins waiting outside, each and every one of them wearing a large badge on the front of his or her robes.  For one wild moment Harry thought they were S.P.E.W. badges - then he saw that they all bore the same message, in luminous red letters that burnt brightly in the dimly lit underground passage:  SUPPORT CEDRIC DIGGORY-- THE REAL HOGWARTS CHAMPION!  \"Like them, Potter?\" said Malfoy loudly as Harry approached.  \"And this isn't all they do - look!\"  He pressed his badge into his chest, and the message upon it vanished, to be replaced by another one, which glowed green:  POTTER STINKS!  The Slytherins howled with laughter.  Each of them pressed their badges too, until the message POTTER STINKS was shining brightly all around Harry.  He felt the heat rise in his face and neck. \"Oh very funny,\" Hermione said sarcastically to Pansy Parkinson and her gang of Slytherin girls, who were laughing harder than anyone, \"really witty.\" Ron was standing against the wall with Dean and Seamus.  He wasn't laughing, but he wasn't sticking up for Harry either. \"Want one, Granger?\"  said Malfoy, holding out a badge to Hermione.  \"I've got loads. But don't touch my hand, now.  I've just washed it, you see; don't want a Mudblood sliming it up.\" Some of the anger Harry had been feeling for days and days seemed to burst through a dam in his chest.  He had reached for his wand before he'd thought what he was doing.  People all around them scrambled out of the way, backing down the corridor. \"Harry!\" Hermione said warningly. \"Go on, then, Potter,\" Malfoy said quietly, drawing out his own wand. \"Moody's not here to look after you now - do it, if you've got the guts -\" For a split second, they looked into each other's eyes, then, at exactly the same time, both acted. \"Funnunculus!\"  Harry yelled.   \"Densaugeo!\"  screamed Malfoy.    Jets of light shot from both wands, hit each other in midair, and ricocheted off at angles -- Harry's hit Goyle in the face, and Malfoy's hit Hermione.  Goyle bellowed and put his hands to his nose, where great ugly boils were springing up - Hermione, whimpering in panic, was clutching her mouth.   \"Hermione!\"   Ron had hurried forward to see what was wrong with her; Harry turned and saw Ron dragging Hermione's hand away from her face.  It wasn't a pretty sight.  Hermione's front teeth - already larger than average - were now growing at an alarming rate; she was looking more and more like a beaver as her teeth elongated, past her bottom lip, toward her chin - panic-stricken, she felt them and let out a terrified cry."
}