{
  "id": "922b9da9d809330ae3294429d274844f20005c01",
  "text": "  Dizzy and bruised, covered in soot, he got gingerly to his feet, holding his broken glasses up to his eyes. He was -,cite alone, but where he was, he had no idea. All he could tell was that he was standing in the stone fireplace of what looked like a large, dimly lit wizard's shop - but nothing in here was ever likely to be on a Hogwarts school list.  A glass case nearby held a withered hand on a cushion, a bloodstained pack of cards, and a staring glass eye. Evil-looking masks stared down from the walls, an assortment of human bones lay upon the counter, and rusty, spiked instruments hung from the ceiling. Even worse, the dark, narrow street Harry could see through the dusty shop window was definitely not Diagon Alley.  The sooner he got out of here, the better. Nose still stinging where it had hit the hearth, Harry made his way swiftly and silently toward the door, but before he'd got halfway toward it, two people appeared on the other side of the glass - and one of them was the  49  very last person Harry wanted to meet when he was lost, covered in soot, and wearing broken glasses: Draco Malfoy.  Harry looked quickly around and spotted a large black cabinet to his left; he shot inside it and pulled the doors closed, leaving a small crack to peer through. Seconds later, a bell clanged, and Malfoy stepped into the shop.  The man who followed could only be Draco's father. He had the same pale, pointed face and identical cold, gray eyes. Mr. Malfoy crossed the shop, looking lazily at the items on display, and rang a bell on the counter before turning to his son and saying, \"Touch nothing, Draco.\"  Malfoy, who had reached for the glass eye, said, \"I thought you were going to buy me a present.\"  \"I said I would buy you a racing broom,\" said his father, drumming his fingers on the counter.  \"What's the good of that if I'm not on the House team?\" said Malfoy, looking sulky and bad-tempered. \"Harry Potter got a Nimbus Two Thousand last year. Special permission from Dumbledore so he could play for Gryffindor. He's not even that good, it's just because he's famous ... famous for having a stupid scar on his forehead . . . .\"  Malfoy bent down to examine a shelf full of skulls.  \". . . everyone thinks he's so smart, wonderful Potter with his scar and his broomstick -\"  \"You have told me this at least a dozen times already,\" said Mr. Malfoy, with a quelling look at his son. \"And I would remind you that it is not - prudent - to appear less than fond of Harry Potter, not when most of our kind regard him as the hero who made the Dark Lord disappear - ah, Mr. Borgin.\"  50  A stooping man had appeared behind the counter, smoothing his greasy hair back from his face.  \"Mr. Malfoy, what a pleasure to see you again,\" said Mr. Borgin in a voice as oily as his hair. \"Delighted - and young Master Malfoy, too - charmed. How may I be of assistance? I must show you, just in today, and very reasonably priced -\"  \"I'm not buying today, Mr. Borgin, but selling,\" said Mr. Malfoy.  \"Selling?\" The smile faded slightly from Mr. Borgin's face.  \"You have heard, of course, that the Ministry is conducting more raids,\" said Mr. Malfoy, taking a roll of parchment from his inside pocket and unraveling it for Mr. Borgin to read. \"I have a few - ah - items at home that might embarrass me, if the Ministry were to call ......  Mr. Borgin fixed a pair of pince-nez to his nose and looked down the list.  \"The Ministry wouldn't presume to trouble you, sir, surely?\"  Mr. Malfoy's lip curled.  \"I have not been visited yet. The name Malfoy still commands a certain respect, yet the Ministry grows ever more meddlesome. There are rumors about a new Muggle Protection Act - no doubt that flea- bitten, Muggle-loving fool Arthur Weasley is behind it  Harry felt a hot surge of anger.  \"- and as you see, certain of these poisons might make it appear -\"  \"I understand, sir, of course,\" said Mr. Borgin. \"Let me see. . .\"  \"Can I have that?\" interrupted Draco, pointing at the withered hand on its cushion.  51  \"Ah, the Hand of Glory!\" said Mr. Borgin, abandoning Mr. Malfoy's list and scurrying over to Draco. \"Insert a candle and it gives light only to the holder! Best friend of thieves and plunderers! Your son has fine taste, sir.\"  \"I hope my son will amount to more than a thief or a plunderer, Borgin,\" said Mr. Malfoy coldly, and Mr. Borgin said quickly, \"No offense, sir, no offense meant -\"  \"Though if his grades don't pick up,\" said Mr. Malfoy, more coldly still, \"that may indeed be all he is fit for -\"  \"It's not my fault,\" retorted Draco. \"The teachers all have favorites, that Hermione Granger -\"  \"I would have thought you'd be ashamed that a girl of no wizard family beat you in every exam,\" snapped Mr. Malfoy.  \"Ha!\" said Harry under his breath, pleased to see Draco looking both abashed and angry.  \"It's the same all over,\" said Mr. Borgin, in his oily voice. \"Wizard blood is counting for less everywhere -\"  \"Not with me,\" said Mr. Malfoy, his long nostrils flaring."
}