{
  "id": "9234b5e303ec0d18d4303fe96a7c438ea93c28c7",
  "text": " Songs we  have that  tell of these things, but we are forgetting them,  teaching  them  only  to children, as  a careless custom. And now  the  songs have come down  among us out of strange places, and walk visible under the Sun.'       'You should  be  glad, Thjoden  King,' said Gandalf. 'For not only  the  little  life  of Men is  now endangered, but the  life also of  those things  which you have deemed the matter of legend. You are not without allies, even   ####-if you know them not.'       'Yet  also I should  be sad,' said Thjoden. 'For however the fortune of  war shall go, may it not so end  that much that was fair and wonderful shall  pass for ever out of Middle-earth?'       'It may,' said Gandalf. 'The evil of Sauron cannot be wholly cured, nor   made as if it had not been. But to such days we are doomed. Let us now go on  with the journey we have begun!'       The company turned then away from the  Coomb and from the wood and  took   the  road  towards the Fords. Legolas followed reluctantly. The sun had set,  already  it had sunk behind the rim of the world; but  as they rode out from  the shadow of  the  hills  and looked west to the  Gap  of Rohan the sky was  still  red, and a burning light was under the  floating clouds. Dark against   it there wheeled and flew many black -winged birds. Some passed overhead  wi th  mournful cries, returning to their homes among the rocks.       'The carrion-fowl have been busy about the battle-field,' said Jomer.       They rode now at an easy pace and dark came  down upon the plains about  them. The slow moon mounted,  now  waxing towards the full, and  in its cold  silver light the swelling grass-lands  rose and fell  like a wide  grey sea.  They  had ridden for  some four  hours from  the branching of the roads when  they drew near to the Fords. Long slopes ran swiftly down to where the river   spread  in stony shoals  between high grassy terraces. Borne upon  the  wind  they heard the howling of  wolves. Their hearts were heavy,  remembering the  many men that had fallen in battle in this place.       The  road dipped between rising turf-banks, carving its way through the  terraces to the river's edge, and up again upon the further side. There were  three  lines of flat stepping-stones  across  the  stream,  and between them  fords for horses, that went from either brink to a  bare  eyot in the midst.  The riders looked down upon the crossings,  and  it seemed strange to  them;   for the Fords had ever been a place full  of the rush  and  chatter of water   upon stones; but now they  were  silent. The beds of the  stream were almost   dry, a bare wast e of shingles and grey sand.       'This  is  become  a  dreary  place,'  said Jomer. 'What  sickness  has  befallen the river? Many fair things Saruman has  destroyed: has he devoured  the springs of Isen too?' 'So it would seem,' said Gandalf.       'Alas!'  said Thjoden. 'Must we pass this way,  where the carrion-beasts   ####-devour so many good Riders of the Mark?'       'This is our way,' said Gandalf. 'Grievous is the fall of your men; but  you shall see that at least the wolves  of the mountains do not devour them.  It is with their friends, the Orcs, that they hold their feast:  such indeed  is the friendship of their kind. Come!'       They rode down to the river,  and as  they came the wolves ceased their  howling and  slunk away. Fear  fell on them seeing Gandalf in the moon,  and  Shadowfax his horse shining like  silver.  The  riders  passed  over to  the  islet, and glittering eyes watched them wanly from the shadows of the banks.       'Look!' said Gandalf. 'Friends have laboured here.'       And they saw that  in  the midst  of the eyot  a mound was piled, ringed  with stones, and set about with many spears.       'Here  lie  all the  Men of the Mark that fell  near this place,'  said  Gandalf.       'Here let them rest!' said Jomer. 'And when  their  spears  have rotted  and rusted, long still may their mound stand and guard the Fords of Isen!'       'Is  this  your work  also, Gandalf,  my  friend?'  said Thjoden.  'You   accomplished much in an evening and a night!'       'With  the help of Shadowfax  -- and others,' said Gandalf. 'I rode fast   and  far.  But here beside the  mound I will say this for your comfort: many  fell in the battles of the Fords, but fewer than rumour made them. More were  scattered than were slain;  I gathered together all that I  could find. Some  men I sent with Grimbold of Westfold  to join Erkenbrand. Some I set to make  this burial. They  have now followed your marshal,  Elfhelm. I sent him with  many Riders  to Edoras.  Saruman  I  knew had  despatched  his full strength  against you, and his  servants  had turned aside from all  other errands and  gone to Helm's Deep: the  lands seemed empty  of enemies; yet I  feared that  wolf-riders and plunderers might ride nonetheless  to Meduseld, while it was  undefended. But now I  think you need not fear:  you will find your house to  welcome your return."
}