{
  "id": "92994bc9930945a20f3456e067908ff718fa1d6a",
  "text": "    Then I fear Ser Gregor may die.    Undoubtedly. I swore as much in the letter I sent to Prince Doran with his brother’s body. But it must be seen to be the sword of the King’s Justice that slays him, not a poisoned spear. Heal him.   Grand Maester Pycelle blinked in dismay.  My lord—    Heal him,  Lord Tywin said again, vexed.  You are aware that Lord Varys has sent fishermen into the waters around Dragonstone. They report that only a token force remains to defend the island. The Lyseni are gone from the bay, and the great part of Lord Stannis’s strength with them.    Well and good,  announced Pycelle.  Let Stannis rot in Lys, I say. We are well rid of the man and his ambitions.    Did you turn into an utter fool when Tyrion shaved your beard? This is Stannis Baratheon. The man will fight to the bitter end and then some. If he is gone, it can only mean he intends to resume the war. Most likely he will land at Storm’s End and try and rouse the storm lords. If so, he’s finished. But a bolder man might roll the dice for Dorne. If he should win Sunspear to his cause, he might prolong this war for years. So we will not offend the Martells any further, for any reason. The Dornishmen are free to go, and you will heal Ser Gregor.   And so the Mountain screamed, day and night. Lord Tywin Lannister could cow even the Stranger, it would seem.  As Jaime climbed the winding steps of White Sword Tower, he could hear Ser Boros snoring in his cell. Ser Balon’s door was shut as well; he had the king tonight, and would sleep all day. Aside from Blount’s snores, the tower was very quiet. That suited Jaime well enough. I ought to rest myself. Last night, after his dance with Ser Addam, he’d been too sore to sleep.  But when he stepped into his bedchamber, he found his sister waiting for him.  She stood beside the open window, looking over the curtain walls and out to sea. The bay wind swirled around her, flattening her gown against her body in a way that quickened Jaime’s pulse. It was white, that gown, like the hangings on the wall and the draperies on his bed. Swirls of tiny emeralds brightened the ends of her wide sleeves and spiraled down her bodice. Larger emeralds were set in the golden spiderweb that bound her golden hair. The gown was cut low, to bare her shoulders and the tops of her breasts. She is so beautiful. He wanted nothing more than to take her in his arms.   Cersei.  He closed the door softly.  Why are you here?    Where else could I go?  When she turned to him there were tears in her eyes.  Father’s made it clear that I am no longer wanted on the council. Jaime, won’t you talk to him?   Jaime took off his cloak and hung it from a peg on the wall.  I talk to Lord Tywin every day.    Must you be so stubborn? All he wants…    …is to force me from the Kingsguard and send me back to Casterly Rock.    That need not be so terrible. He is sending me back to Casterly Rock as well. He wants me far away, so he’ll have a free hand with Tommen. Tommen is my son, not his!    Tommen is the king.    He is a boy! A frightened little boy who saw his brother murdered at his own wedding. And now they are telling him that he must marry. The girl is twice his age and twice a widow!   He eased himself into a chair, trying to ignore the ache of bruised muscles.  The Tyrells are insisting. I see no harm in it. Tommen’s been lonely since Myrcella went to Dorne. He likes having Margaery and her ladies about. Let them wed.    He is your son…    He is my seed. He’s never called me Father. No more than Joffrey ever did. You warned me a thousand times never to show any undue interest in them.    To keep them safe! You as well. How would it have looked if my brother had played the father to the king’s children? Even Robert might have grown suspicious.    Well, he’s beyond suspicion now.  Robert’s death still left a bitter taste in Jaime’s mouth. It should have been me who killed him, not Cersei.  I only wished he’d died at my hands.  When I still had two of them.  If I’d let kingslaying become a habit, as he liked to say, I could have taken you as my wife for all the world to see. I’m not ashamed of loving you, only of the things I’ve done to hide it. That boy at Winterfell…    Did I tell you to throw him out the window? If you’d gone hunting as I begged you, nothing would have happened. But no, you had to have me, you could not wait until we returned to the city.    I’d waited long enough. I hated watching Robert stumble to your bed every night, always wondering if maybe this night he’d decide to claim his rights as husband.  Jaime suddenly remembered something else that troubled him about Winterfell.  At Riverrun, Catelyn Stark seemed convinced I’d sent some footpad to slit her son’s throat. That I’d given him a dagger.    That,  she said scornfully.  Tyrion asked me about that.    There was a dagger. The scars on Lady Catelyn’s hands were real enough, she showed them to me. Did you…?    Oh, don’t be absurd.  Cersei closed the window."
}