{
  "id": "92f6cffc2277f21340bd5875fb6bccc7acd3061b",
  "text": " She was naked, covered with soot, her clothes turned to ash, her beautiful hair all crisped away… yet she was unhurt.  The cream-and-gold dragon was suckling at her left breast, the green-and-bronze at the right. Her arms cradled them close. The black-and-scarlet beast was draped across her shoulders, its long sinuous neck coiled under her chin. When it saw Jorah, it raised its head and looked at him with eyes as red as coals.  Wordless, the knight fell to his knees. The men of her khas came up behind him. Jhogo was the first to lay his arakh at her feet.  Blood of my blood,  he murmured, pushing his face to the smoking earth.  Blood of my blood,  she heard Aggo echo.  Blood of my blood,  Rakharo shouted.  And after them came her handmaids, and then the others, all the Dothraki, men and women and children, and Dany had only to look at their eyes to know that they were hers now, today and tomorrow and forever, hers as they had never been Drogo’s.  As Daenerys Targaryen rose to her feet, her black hissed, pale smoke venting from its mouth and nostrils. The other two pulled away from her breasts and added their voices to the call, translucent wings unfolding and stirring the air, and for the first time in hundreds of years, the night came alive with the music of dragons.      APPENDIX      HOUSE BARATHEON  The youngest of the Great Houses, born during the Wars of Conquest. Its founder, Orys Baratheon, was rumored to be Aegon the Dragon’s bastard brother. Orys rose through the ranks to become one of Aegon’s fiercest commanders. When he defeated and slew Argilac the Arrogant, the last Storm King, Aegon rewarded him with Argilac’s castle, lands, and daughter. Orys took the girl to bride, and adopted the banner, honors, and words of her line. The Baratheon sigil is a crowned stag, black, on a golden field. Their words are Ours is the Fury.    KING ROBERT BARATHEON, the First of His Name,  —his wife, QUEEN CERSEI, of House Lannister,  —their children:    —PRINCE JOFFREY, heir to the Iron Throne, twelve,  —PRINCESS MYRCELLA, a girl of eight,  —PRINCE TOMMEN, a boy of seven,    —his brothers:    —STANNIS BARATHEON, Lord of Dragonstone,    —his wife, LADY SELYSE of House Florent,  —their daughter, SHIREEN, a girl of nine,      —RENLY BARATHEON, Lord of Storm’s End,    —his small council:    —GRAND MAESTER PYCELLE,  —LORD PETYR BAELISH, called LITTLEFINGER, master of coin,  —LORD STANNIS BARATHEON, master of ships,  —LORD RENLY BARATHEON, master of laws,  —SER BARRISTAN SELMY, Lord Commander of the Kingsguard,  —VARYS, a eunuch, called the Spider, master of whisperers,    —his court and retainers:    —SER ILYN PAYNE, the King’s Justice, a headsman,  —SANDOR CLEGANE, called the Hound, sworn shield to Prince Joffrey,  —JANOS SLYNT, a commoner, commander of the City Watch of King’s Landing,  —JALABAR XHO, an exile prince from the Summer Isles,  —MOON BOY, a jester and fool,  —LANCEL and TYREK LANNISTER, squires to the king, the queen’s cousins,  —SER ARON SANTAGAR, master-at-arms,    —his Kingsguard:    —SER BARRISTAN SELMY, Lord Commander,  —SER JAIME LANNISTER, called the Kingslayer,  —SER BOROS BLOUNT,  —SER MERYN TRANT,  —SER ARYS OAKHEART,  —SER PRESTON GREENFIELD,  —SER MANDON MOORE,      The principal houses sworn to Storm’s End are Selmy, Wylde, Trant, Penrose, Errol, Estermont, Tarth, Swann, Dondarrion, Caron.  The principal houses sworn to Dragonstone are Celtigar, Velaryon, Seaworth, Bar Emmon, and Sunglass.      HOUSE STARK  The Starks trace their descent from Brandon the Builder and the ancient Kings of Winter. For thousands of years they ruled from Winterfell as Kings in the North, until Torrhen Stark, the King Who Knelt, chose to swear fealty to Aegon the Dragon rather than give battle. Their blazon is a grey direwolf on an ice-white field. The Stark words are Winter Is Coming.    EDDARD STARK, Lord of Winterfell, Warden of the North,  —his wife, LADY CATELYN, of House Tully,  —their children:    —ROBB, the heir to Winterfell, fourteen years of age,  —SANSA, the eldest daughter, eleven,  —ARYA, the younger daughter, a girl of nine,  —BRANDON, called Bran, seven,  —RICKON, a boy of three,    —his bastard son, JON SNOW, a boy of fourteen,  —his ward, THEON GREYJOY, heir to the Iron Islands,  —his siblings:    —{BRANDON}, his elder brother, murdered by the command of Aerys II Targaryen,  —{LYANNA}, his younger sister, died in the mountains of Dorne,  —BENJEN, his younger brother, a man of the Night’s Watch,    —his household:    —MAESTER LUWIN, counsellor, healer, and tutor,  —VAYON POOLE, steward of Winterfell,    —JEYNE, his daughter, Sansa’s closest friend,      —JORY CASSEL, captain of the guard,    —HALLIS MOLLEN, DESMOND, JACKS, PORTHER, QUENT, ALYN, TOMARD, VARLY, HEWARD, CAYN, WYL, guardsmen,      —SER RODRIK CASSEL, master-at-arms, Jory’s uncle,    —BETH, his young daughter,      —SEPTA MORDANE, tutor to Lord Eddard’s daughters,  —SEPTON CHAYLE, keeper of the castle sept and library,  —HULLEN, master of horse,    —his son, HARWIN, a guardsman,  —JOSETH, a stableman and horse trainer,      —FARLEN, kennelmaster,  —OLD NAN, storyteller, once a wet nurse,    —HODOR, her great-grandson, a simpleminded stableboy,      —GAGE, the cook,  —MIKKEN, smith and armorer,    —his principal lords and bannermen,    —SER HELMAN TALLHART,  —RICKARD KARSTARK, Lord of Karhold,  —ROOSE BOLTON, Lord of the Dreadfort,  —JON UMBER, called the Greatjon,  —GALBART AND ROBETT GLOVER,  —WYMAN MANDERLY, Lord of White Harbor,  —MAEGE MORMONT, the Lady of Bear Island,      The principal houses sworn to Winterfell are Karstark, Umber, Flint, Mormont, Hornwood, Cerwyn, Reed, Manderly, Glover, Tallhart, Bolton."
}