{
  "id": "9330edb6f28dad5111de357b3d4c98bdb80abe93",
  "text": "   No Orc or other living creature could be seen.       Legolas  and  Gimli were now riding  together  upon one horse; and they   kept close beside Gandalf, for Gimli was afraid of the wood.       'It is hot in  here,'  said Legolas  to Gandalf. 'I feel  a great wrath   ####-about me. Do you not feel the air throb in your ears?'       'Yes,' said Gandalf.        'What has become of the miserable Orcs?' said Legolas.        'That, I think, no one will ever know,' said Gandalf.       They  rode  in silence for a while; but  Legolas was ever glancing from  side to side, and would often have halted  to  listen to  the  sounds of the  wood, if Gimli had allowed it.       'These are the strangest trees that ever I saw,'  he said; 'and  I have  seen many  an  oak grow from acorn  to ruinous age.  I wish that  there were  leisure now to walk among  them: they have voices, and  in time I might come  to understand their thought.'       'No, no!'  said  Gimli.  'Let  us leave  them!  I guess  their  thought  already: hatred of all that go on two legs; and their  speech is of crushing  and strangling.'       'Not of all that go on two legs,' said  Legolas. 'There I think you are  wrong.  It is Orcs that they hate.  For they  do not  belong  here and  know  little of Elves and  Men. Far away  are the valleys where they sprang.  From  the deep dales of Fangorn, Gimli, that is whence they come, I guess.'       'Then that is the most  perilous wood in Middle-earth,'  said Gimli. 'I   should  be grateful for  the part they have played, but I  do not love them.  You may think them wonderful, but I have seen a greater wonder in this land,  more beautiful than any grove or glade that  ever   grew: my  heart  is still  full of ft. 'Strange are the ways of Men, Legolas! Here they have one of the  marvels of the Northern  World, and what do they say of it? Caves, they say!  Caves! Holes to fly to in time of  war, to store fodder in! My good Legolas,  do you  know that the caverns of Helm's Deep  are vast and beautiful?  There  would  be an  endless pilgrimage of Dwarves, merely to gaze at them, if such  things  were known  to be. Aye indeed, they would pay pure gold  for a brief  glance!'       'And I would give  gold to be excused,' said Legolas; 'and double to be  let out, if I strayed in!'       'You have not seen, so I forgive your jest,' said Gimli. 'But you speak  like a fool. Do you think those halls are fair, where your King dwells under   the hill in Mirkwood, and Dwarves helped in their making long  ago? They are  but hovels compared with  the caverns I have  seen here: immeasurable halls,  filled with an everlasting music  of  water that tinkles into pools, as fair  as Kheled-zvram in the starlight.   ####-     'And, Legolas,  when the torches are kindled and men walk  on the sandy   floors  under  the echoing domes, ah! then, Legolas,  gems  and crystals and   veins of  precious ore  glint  in the polished  walls; and  the  light glows  through folded marbles, shell-like, translucent as the living hands of Queen  Galadriel.  There are  columns of white and saffron and dawn-rose,  Legolas,  fluted  and twisted into dreamlike forms;  they spring up from many-coloured  floors to meet the glistening pendants  of  the roof:  wings, ropes, curtains  fine as  frozen  clouds; spears,  banners, pinnacles  of suspended  palaces!   Still lakes mirror them: a glimmering world looks up from dark pools covered  with clear glass;  cities.  such as  the  mind  of Durin  could  scarce have  imagined in his sleep,  stretch  on through avenues and pillared  courts, on  into  the dark recesses  where no light can come.  And  plink! a silver drop  falls,  and the round wrinkles in  the glass make all  the  towers  bend and  waver like weeds and corals in a grotto of the sea. Then evening comes: they  fade  and twinkle out; the torches pass on into another  chamber and another   dream. There is chamber after chamber, Legolas;  hall opening  out of  hall,  dome after  dome,  stair beyond  stair; and still  the winding paths lead on  into the mountains' heart.  Caves! The Caverns of Helm's Deep! Happy was the  chance that drove me there! It makes me weep to leave them.'       'Then I  will wish you this fortune for your  comfort, Gimli,' said the  Elf, 'that you may come safe from war and return to  see  them again. But do  not tell all your kindred! There seems little left for them to do, from your  account. Maybe the men of  this land  are wise  to say little: one family of  busy dwarves with hammer and chisel might mar more than they made.'       'No, you do not understand,' said Gimli. 'No dwarf could be  unmoved by  such loveliness. None  of Durin's race would mine those  caves for stones or   ore, not if diamonds and gold could be got there.  Do you cut down groves  of  blossoming trees in the spring-time for firewood? We would tend these glades  of flowering  stone, not  quarry them. With cautious skill, tap  by tap  -- a  small  chip of rock and no  more, perhaps, in a whole  anxious  day  -- so we  could work,  and  as the  years went  by, we  should open  up new  ways, and  display far chambers that  are still dark, glimpsed  only as a  void  beyond  fissures in the rock."
}