{
  "id": "945d7d2bcb7c9fb70f6b47f656643c06f7d4cfb2",
  "text": "  Atop the Red Keep’s battlements streamed the boy king’s banners: the crowned stag of Baratheon on its gold field, the lion of Lannister on crimson. More pots of pitch came flying. Davos heard men shriek as fire spread across Courageous. Her oarsmen were safe below, protected from missiles by the half deck that sheltered them, but the men-at-arms crowded topside were not so fortunate. The starboard wing was taking all the damage, as he had feared. It will be our turn soon, he reminded himself, uneasy. Black Betha was well in range of the firepots, being the sixth ship out from the north bank. To starboard, she had only Allard’s Lady Marya, the ungainly Swordfish—so far behind now that she was nearer the third line than the second—and Piety, Prayer, and Devotion, who would need all the godly intervention they could get, placed as vulnerably as they were.  As the second line swept past the twin towers, Davos took a closer look. He could see three links of a huge chain snaking out from a hole no bigger than a man’s head and disappearing under the water. The towers had a single door, set a good twenty feet off the ground. Bowmen on the roof of the northern tower were firing down at Prayer and Devotion. The archers on Devotion fired back, and Davos heard a man scream as the arrows found him.   Captain ser.  His son Matthos was at his elbow.  Your helm.  Davos took it with both hands and slid it over his head. The pothelm was visorless; he hated having his vision impeded.  By then the pitch pots were raining down around them. He saw one shatter on the deck of Lady Marya, but Allard’s crew quickly beat it out. To port, warhorns sounded from the Pride of Driftmark. The oars flung up sprays of water with every stroke. The yard-long shaft of a scorpion came down not two feet from Matthos and sank into the wood of the deck, thrumming. Ahead, the first line was within bowshot of the enemy; flights of arrows flew between the ships, hissing like striking snakes.  South of the Blackwater, Davos saw men dragging crude rafts toward the water while ranks and columns formed up beneath a thousand streaming banners. The fiery heart was everywhere, though the tiny black stag imprisoned in the flames was too small to make out. We should be flying the crowned stag, he thought. The stag was King Robert’s sigil, the city would rejoice to see it. This stranger’s standard serves only to set men against us.  He could not behold the fiery heart without thinking of the shadow Melisandre had birthed in the gloom beneath Storm’s End. At least we fight this battle in the light, with the weapons of honest men, he told himself. The red woman and her dark children would have no part of it. Stannis had shipped her back to Dragonstone with his bastard nephew Edric Storm. His captains and bannermen had insisted that a battlefield was no place for a woman. Only the queen’s men had dissented, and then not loudly. All the same, the king had been on the point of refusing them until Lord Bryce Caron said,  Your Grace, if the sorceress is with us, afterward men will say it was her victory, not yours. They will say you owe your crown to her spells.  That had turned the tide. Davos himself had held his tongue during the arguments, but if truth be told, he had not been sad to see the back of her. He wanted no part of Melisandre or her god.  To starboard, Devotion drove toward shore, sliding out a plank. Archers scrambled into the shallows, holding their bows high over their heads to keep the strings dry. They splashed ashore on the narrow strand beneath the bluffs. Rocks came bouncing down from the castle to crash among them, and arrows and spears as well, but the angle was steep and the missiles seemed to do little damage.  Prayer landed two dozen yards upstream and Piety was slanting toward the bank when the defenders came pounding down the riverside, the hooves of their warhorses sending up gouts of water from the shallows. The knights fell among the archers like wolves among chickens, driving them back toward the ships and into the river before most could notch an arrow. Men-at-arms rushed to defend them with spear and axe, and in three heartbeats the scene had turned to blood-soaked chaos. Davos recognized the dog’s-head helm of the Hound. A white cloak streamed from his shoulders as he rode his horse up the plank onto the deck of Prayer, hacking down anyone who blundered within reach.  Beyond the castle, King’s Landing rose on its hills behind the encircling walls. The riverfront was a blackened desolation; the Lannisters had burned everything and pulled back within the Mud Gate. The charred spars of sunken hulks sat in the shallows, forbidding access to the long stone quays. We shall have no landing there. He could see the tops of three huge trebuchets behind the Mud Gate. High on Visenya’s Hill, sunlight blazed off the seven crystal towers of the Great Sept of Baelor.  Davos never saw the battle joined, but he heard it; a great rending crash as two galleys came together."
}