{
  "id": "94a252c24e8cf87583f716571cf8521f7cc30b15",
  "text": " Years past they had been forced to sell their last few treasures, and now even the coin they had gotten from Mother’s crown had gone. In the alleys and wine sinks of Pentos, they called her brother  the beggar king.  Dany did not want to know what they called her.   We will have it all back someday, sweet sister,  he would promise her. Sometimes his hands shook when he talked about it.  The jewels and the silks, Dragonstone and King’s Landing, the Iron Throne and the Seven Kingdoms, all they have taken from us, we will have it back.  Viserys lived for that day. All that Daenerys wanted back was the big house with the red door, the lemon tree outside her window, the childhood she had never known.  There came a soft knock on her door.  Come,  Dany said, turning away from the window. Illyrio’s servants entered, bowed, and set about their business. They were slaves, a gift from one of the magister’s many Dothraki friends. There was no slavery in the free city of Pentos. Nonetheless, they were slaves. The old woman, small and grey as a mouse, never said a word, but the girl made up for it. She was Illyrio’s favorite, a fair-haired, blue-eyed wench of sixteen who chattered constantly as she worked.  They filled her bath with hot water brought up from the kitchen and scented it with fragrant oils. The girl pulled the rough cotton tunic over Dany’s head and helped her into the tub. The water was scalding hot, but Daenerys did not flinch or cry out. She liked the heat. It made her feel clean. Besides, her brother had often told her that it was never too hot for a Targaryen.  Ours is the house of the dragon,  he would say.  The fire is in our blood.   The old woman washed her long, silver-pale hair and gently combed out the snags, all in silence. The girl scrubbed her back and her feet and told her how lucky she was.  Drogo is so rich that even his slaves wear golden collars. A hundred thousand men ride in his khalasar, and his palace in Vaes Dothrak has two hundred rooms and doors of solid silver.  There was more like that, so much more, what a handsome man the khal was, so tall and fierce, fearless in battle, the best rider ever to mount a horse, a demon archer. Daenerys said nothing. She had always assumed that she would wed Viserys when she came of age. For centuries the Targaryens had married brother to sister, since Aegon the Conqueror had taken his sisters to bride. The line must be kept pure, Viserys had told her a thousand times; theirs was the kingsblood, the golden blood of old Valyria, the blood of the dragon. Dragons did not mate with the beasts of the field, and Targaryens did not mingle their blood with that of lesser men. Yet now Viserys schemed to sell her to a stranger, a barbarian.  When she was clean, the slaves helped her from the water and toweled her dry. The girl brushed her hair until it shone like molten silver, while the old woman anointed her with the spiceflower perfume of the Dothraki plains, a dab on each wrist, behind her ears, on the tips of her breasts, and one last one, cool on her lips, down there between her legs. They dressed her in the wisps that Magister Illyrio had sent up, and then the gown, a deep plum silk to bring out the violet in her eyes. The girl slid the gilded sandals onto her feet, while the old woman fixed the tiara in her hair, and slid golden bracelets crusted with amethysts around her wrists. Last of all came the collar, a heavy golden torc emblazoned with ancient Valyrian glyphs.   Now you look all a princess,  the girl said breathlessly when they were done. Dany glanced at her image in the silvered looking glass that Illyrio had so thoughtfully provided. A princess, she thought, but she remembered what the girl had said, how Khal Drogo was so rich even his slaves wore golden collars. She felt a sudden chill, and gooseflesh pimpled her bare arms.  Her brother was waiting in the cool of the entry hall, seated on the edge of the pool, his hand trailing in the water. He rose when she appeared and looked her over critically.  Stand there,  he told her.  Turn around. Yes. Good. You look…    Regal,  Magister Illyrio said, stepping through an archway. He moved with surprising delicacy for such a massive man. Beneath loose garments of flame-colored silk, rolls of fat jiggled as he walked. Gemstones glittered on every finger, and his man had oiled his forked yellow beard until it shone like real gold.  May the Lord of Light shower you with blessings on this most fortunate day, Princess Daenerys,  the magister said as he took her hand. He bowed his head, showing a thin glimpse of crooked yellow teeth through the gold of his beard.  She is a vision, Your Grace, a vision,  he told her brother.  Drogo will be enraptured.    She’s too skinny,  Viserys said. His hair, the same silver-blond as hers, had been pulled back tightly behind his head and fastened with a dragonbone brooch. It was a severe look that emphasized the hard, gaunt lines of his face. He rested his hand on the hilt of the sword that Illyrio had lent him, and said,  Are you sure that Khal Drogo likes his women this young?    She has had her blood."
}