{
  "id": "952102d0d6c3bb67f264894cef876cfd8f440fc5",
  "text": "     ####-   Chapter 7. Journey to the Cross-roads            Frodo and Sam returned  to their  beds and lay there in silence resting  for a little,  while men bestirred themselves  and  the business of the  day  began. After a while water was brought to them,  and then they were led to a   table where food was set for three. Faramir broke his fast with them. He had  not slept since the battle on the day before, yet he did not look weary.       When they had finished they stood up. `May no hunger trouble you on the  road,'  said  Faramir. `You  have little provision, but some small  store of  food fit for travellers I have ordered to be stowed  in your packs. You will  have  no lack  of  water as you walk in Ithilien,  but  do not  drink of any  stream that flows from Imlad Morgul, the Valley of Living Death. This also I  must tell you. My scouts and watchers  have all returned, even some that have  crept within sight of the Morannon. They all find  a strange thing. The land  is empty.  Nothing  is  on the  road,  and  no sound  of foot, or  horn,  or   bowstring is anywhere  to be  heard.  A  waiting  silence broods  above  the  Nameless Land.  I do not know what this portends. But the time draws swiftly  to some great conclusion. Storm is coming. Hasten while you may! If  you are  ready, let us go. The Sun will soon rise above the shadow.'       The hobbits' packs were brought to them (a little heavier than they had  been), and  also two stout staves of polished wood, shod with iron, and with   carven heads through which ran plaited leathern thongs.        'I  have no fitting  gifts  to  give you at our parting,' said Faramir ;  `but take these staves. They may be of service to those who walk or climb in  the wild.  The  men of  the White Mountains use them; though these have been  cut  down to your  height and  newly  shod. They  are made of the fair  tree  lebethron, beloved of   the woodwrights of Gondor, and a  virtue has been set  upon them of finding  and returning.  May that virtue not wholly  fail under   the Shadow into which you go!'       The hobbits  bowed low. `Most  gracious host,' said Frodo, 'it was said  to me by Elrond Halfelven that I should find friendship upon the way, secret  and unlooked  for. Certainly I looked  for no such  friendship  as you  have  shown. To have found it turns evil to great good.'       Now they made ready to depart. Gollum was brought out of some corner or   hiding-hole,  and he seemed  better pleased with himself  than he had  been,    ####-though he kept close to Frodo and avoided the glance of Faramir.        'Your  guide  must  be  blindfolded,' said Faramir, 'but  you and  your  servant Samwise I release from this, if you wish.'       Gollum squealed, and squirmed, and clutched at Frodo, when they came to  bind his eyes; and Frodo said: 'Blindfold us all three, and cover up my eyes  first, and then perhaps he will see that no harm  is meant.' This  was done,  and they were led from the cave of Henneth Annyn. After they  had passed the  passages  and stairs they felt the cool morning air, fresh and sweet,  about  them. Still blind they went on for  some  little time,  up  and  then gently  down. At last the voice of Faramir ordered them to be uncovered.       They stood under the boughs  of the woods again. No noise  of the falls  could be heard,  for  a  long  southward slope lay now  between them and the  ravine in which the stream flowed. To the west they could  see light through  the trees, as if the  world came there  to a sudden end, at a  brink looking  out only on to sky.       'Here  is the last parting of our ways,' said Faramir. 'If you take  my  counsel, you will not turn eastward yet. Go  straight on, for  thus you will  have the cover of the woodland for many miles. On your west is an edge where  the land falls into the great vales, sometimes suddenly and sheer, sometimes  in  long  hillsides. Keep near to this edge and the skirts of the forest. In  the beginning of your journey you may walk under daylight, I think. The land  dreams in  a false peace, and  for a while  all evil is  withdrawn. Fare you   well, while you may!'       He embraced the hobbits then, after the manner of his people, stooping,  and placing his hands upon their shoulders, and kissing their foreheads. 'Go  with the good will of all good men!' he said.       They bowed to the ground. Then he  turned and without  looking back  he  left them  and went to his  two guards that stood at a little distance away.  They marvelled  to  see  with  what speed  these green-clad men  now  moved,  vanishing almost in the twinkling of an  eye.  The forest  where Faramir had  stood seemed empty and drear, as if a dream had passed.       Frodo sighed and turned back southward. As if to  mark his disregard of  all such courtesy, Gollum was scrabbling in the mould at the foot of a tree.  `Hungry again already?' thought Sam. `Well, now for it again!'       'Have they  gone at last? ' said Gollum."
}