{
  "id": "95e3c2afc42d9f40ae93d16877d873baa200160e",
  "text": " Now  they  had  bread  and  cheese,  and  plenty  of  ale,  and  bacon  to  toast  in  the  embers  of  the  fire.  After  that  they  slept,  for  their  night had been disturbed; (and they did nothing more till the afternoon. Then they  I brought up their ponies, and carried away the pots of gold, and buried them very  secretly not far from the track by the river, putting a great many spells over them,  just  in  case  they  ever  had  the-chance  to  come  back  and  recover  them. When  that  was  done,  they  all  mounted  once  more,  and  jogged  along  again  on  the  path  towards the East.  \"Where  did  you  go  to,  if  I  may  ask?\"  said  Thorin  to  Gandalf  as  they  rode  along.  \"To look ahead,\" said he.  \"And what brought you back in the nick of time?\"  \"Looking behind,\" said he.  \"Exactly!\" said Thorin; \"but could you be more plain?\"  \"I  went  on  to  spy  out  our  road.  It  will  soon  become  dangerous  and  difficult.  Also  I  was  anxious  about  replenishing  our  small  stock  of  provisions.  I  had  not  gone very far, however, when I met a couple of friends of mine from Rivendell.\"  \"Where's that?\" asked Bilbo,  \"Don't interrupt!\" said Gandalf. \"You will get there in a few days now, if we're  lucky, and find out all about it As I was saying I met two of Elrond's people. They   ####-were  hurrying  along  for  fear  of  the  trolls.  It  was  they  who  told  me  that  three  of  them had come down from the mountains and settled in the woods not far from the  road;  they  had  frightened  everyone  away  from  the  district,  and  they  waylaid  strangers.  \"I  immediately had  a  feeling  that  I was wanted back. Looking behind  I  saw  a  fire  in  the  distance  and  made  for  it.  So  now  you  know.  Please  be  more  careful,  next time, or we shall never get anywhere!\"  \"Thank you!\" said Thorin.   ####-<h4>Chapter 3 </h4> <br> <br> A Short Rest  <br>   They  did  not  sing  or  tell  stories  that  day,  even  though  the weather  improved;  nor the next day, nor the day after. They had begun to feel that danger was not far  away on either side. They camped under the stars, and their horses had more to eat  than  they had; for there was plenty of grass, but there was not much in their bags,  even with what  they had got  from  the  trolls. One morning  they  forded a  river at a  wide  shallow  place  full  of  the  noise  of  stones  and  foam.  The  far  bank  was  steep  and slippery. When they got to the top of it, leading their ponies, they saw that the  great mountains had marched down very near to them. Already they I seemed only  a day's easy journey from the feet of the nearest. Dark and drear it looked, though  there were patches of sunlight on its brown sides, and behind its shoulders the tips  of snow-peaks gleamed.  \"Is  that  The  Mountain?\"  asked  Bilbo  in  a  solemn  voice,  looking  at  it  with  round eyes. He had never seen a thing that looked so big before.  \"Of  course  not!\"  said  Balin.  \"That  is  only  the  beginning  of  the  Misty  Mountains,  and we  have  to  get  through,  or  over,  or  under  those  somehow,  before  we  can  come  into  Wilderland  beyond.  And  it  is  a  deal  of  a  way  even  from  the  other  side  of  them  to  the  Lonely Mountain  in  the  East Where  Smaug  lies on our  treasure.\"  \"O!\"  said  Bilbo,  and  just  at  that  moment  he  felt  more  fared  than  he  ever  remembered  feeling  before. He was  thinking  once  again  of  his  comfortable  chair  before  the  fire  in  his  favourite  sitting-room  in  his  hobbit-hole,  and  of  the  kettle  singing. Not for the last time!  Now  Gandalf  led  the  way.  \"We  must  not  miss  the  road,  or  we  shall  be  done  for,\"  he  said.  \"We  need  food,  for  one  thing,  and  rest  in  reasonable  safety-also it is  very necessary  to  tackle  the Misty Mountains by  the proper path, or else you will  get  lost  in  them,  and  have  to  come  back  and  start  at  the  beginning  again  (if  you  ever get back at all).\"  They asked him where he was making for, and he answered: \"You are come to  the very edge of the Wild, as some of you may know. Hidden somewhere ahead of  us  is  the  fair valley of Rivendell where Elrond  lives  in  the Last Homely House.  I  sent a message by my friends, and we are expected.\"  That  sounded  nice  and  comforting,  but  they  had  not  got  there  yet,  and  it was  not  so  easy  as  it  sounds  to  find  the  Last  Homely  House  west  of  the  Mountains.   ####-There  seemed  to  be  no  trees  and  no  valleys  and  no  hills  to  break  the  ground  in  front  of  them,  only  one  vast  slope  going  slowly  up  and  up  to meet  the  feet  of  the  nearest  mountain,  a  wide  land  the  colour  of  heather  and  crumbling  rock,  with  patches and slashes of grass-green and moss-green showing where water might be.  Morning  passed,  afternoon  came;  but  in  all  the  silent waste  there was  no  sign  of  any  dwelling."
}