{
  "id": "967050eda05b799a57e331bb31a3a4182f580e28",
  "text": ". Books can take you only so far in this field....\"  At these words, both Harry and Ron glanced, grinning, at Hermione, who looked startled at the news that books wouldn't be much help in this subject.  \"Many witches and wizards, talented though they are in the area of loud bangs and smells and sudden disappearings, are yet unable to penetrate the veiled mysteries of the future,\" Professor Trelawney went on, her enormous, gleaming eyes moving from face to nervous face. \"It is a Gift granted to few. You, boy,\" she said suddenly to Neville, who almost toppled off his pouf. \"Is your grandmother well?\"  \"I think so,\" said Neville tremulously.  \"I wouldn't be so sure if I were you, dear,\" said Professor Trelawney, the firelight glinting on her long emerald earrings. Neville gulped. Professor Trelawney continued placidly. \"We will be covering the basic methods of Divination this year. The first term will be devoted to reading the tea leaves. Next term we shall progress to palmistry. By the way, my dear,\" she shot suddenly at Parvati Patil, \"beware a red-haired man.\"  Parvati gave a startled look at Ron, who was right behind her and edged her chair away from him.  \"In the second term,\" Professor Trelawney went on, \"we shall progress to the crystal ball -- if we have finished with fire omens, that is. Unfortunately, classes will be disrupted in February by a nasty bout of flu. I myself will lose my voice. And around Easter, one of our number will leave us forever.\"  A very tense silence followed this pronouncement, but Professor Trelawney seemed unaware of it.  \"I wonder, dear,\" she said to Lavender Brown, who was nearest and shrank back in her chair, \"if you could pass me the largest silver teapot?\"  Lavender, looking relieved, stood up, took an enormous teapot from the shelf, and put it down on the table in front of Professor Trelawney.  \"Thank you, my dear. Incidentally, that thing you are dreading -- it will happen on Friday the sixteenth of October.\"  Lavender trembled.  \"Now, I want you all to divide into pairs. Collect a teacup from the shelf, come to me, and I will fill it. Then sit down and drink, drink until only the dregs remain. Swill these around the cup three times with the left hand, then turn the cup upside down on its saucer, wait for the last of the tea to drain away, then give your cup to your partner to read. You will interpret the patterns using pages five and six of Unfogging the Future. I shall move among you, helping and instructing. Oh, and dear\" -- she caught Neville by the arm as he made to stand up -- \"after you've broken your first cup, would you be so kind as to select one of the blue patterned ones? I'm rather attached to the pink.\"  Sure enough, Neville had no sooner reached the shelf of teacups when there was a tinkle of breaking china. Professor Trelawney swept over to him holding a dustpan and brush and said, \"One of the blue ones, then, dear, if you wouldn't mind... thank you. ... \"  When Harry and Ron had had their teacups filled, they went back to their table and tried to drink the scalding tea quickly. They swilled the dregs around as Professor Trelawney had instructed, then drained the cups and swapped over.  \"Right,\" said Ron as they both opened their books at pages five and six. \"What can you see in mine?\"  \"A load of soggy brown stuff,\" said Harry. The heavily perfumed smoke in the room was making him feel sleepy and stupid.  \"Broaden your minds, my dears, and allow your eyes to see past the mundane!\" Professor Trelawney cried through the gloom.  Harry tried to pull himself together.  \"Right, you've got a crooked sort of cross... \" He consulted Unfogging the Future. \"That means you're going to have 'trials and suffering' -- sorry about that -- but there's a thing that could be the sun... hang on... that means 'great happiness'... so you're going to suffer but be very happy....\"  \"You need your Inner Eye tested, if you ask me,\" said Ron, and they both had to stifle their laughs as Professor Trelawney gazed in their direction.  \"My turn...\" Ron peered into Harry's teacup, his forehead wrinkled with effort. \"There's a blob a bit like a bowler hat,\" he said. \"Maybe you're going to work for the Ministry of Magic...  He turned the teacup the other way up.  \"But this way it looks more like an acorn.... What's that?\" He scanned his copy of Unfogging the Future. \"'A windfall, unexpected gold.' Excellent, you can lend me some... and there's a thin, here,\" he turned the cup again, \"that looks like an animal... yeah, if that was its head... it looks like a hippo... no, a sheep...\"  Professor Trelawney whirled around as Harry let out a snort of laughter.  \"Let me see that, my dear,\" she said reprovingly to Ron, sweeping over and snatching Harry's cup from him. Everyone went quiet to watch.  Professor Trelawney was staring into the teacup, rotating it counterclockwise.  \"The falcon... my dear, you have a deadly enemy.\"  \"But everyone knows that, \" said Hermione in a loud whisper. Professor Trelawney stared at her."
}