{
  "id": "96c6da5b85e322ac5421f99771cc4619366d381b",
  "text": " Weasley, still writing very fast, his brow furrowed. \"Mad-Eye didn't use his wand?  He didn't actually attack anyone?\" \"I'll bet he leapt out of bed and started jinxing everything he could reach through the window,\" said Mr. Diggory, \"but they'll have a job proving it, there aren't any casualties.\" \"All right, I'm off,\" Mr. Weasley said, and he stuffed the parchment with his notes on it into his pocket and dashed out of the kitchen again. Mr. Diggory's head looked around at Mrs. Weasley. \"Sorry about this, Molly,\" it said, more calmly, \"bothering you so early and everything...but Arthur's the only one who can get Mad-Eye off, and Mad-Eye's supposed to be starting his new job today. Why he had to choose last night. .\" \"Never mind, Amos,\" said Mrs. Weasley. \"Sure you won't have a bit of toast or anything before you go?\" \"Oh go on, then,\" said Mr. Diggory. Mrs. Weasley took a piece of buttered toast from a stack on the kitchen table, put it into the fire tongs, and transferred it into Mr. Diggory's mouth. \"Fanks,\" he said in a muffled voice, and then, with a small pop, vanished. Harry could hear Mr. Weasley calling hurried good-byes to Bill, Charlie, Percy,  and the girls.  Within five minutes, he was back in the kitchen, his robes on the right way now, dragging a comb through his hair. \"I'd better hurry - you have a good term, boys, said Mr. Weasley to Harry, Ron, and the twins, fastening a cloak over his shoulders and preparing to Disapparate.  \"Molly, are you going to be all right taking the kids to King's Cross?\" \"Of course I will,\" she said. \"You just look after Mad-Eye, we'll be fine.\" As Mr. Weasley vanished, Bill and Charlie entered the kitchen. \"Did someone say Mad-Eye?\" Bill asked. \"What's he been up to now.\" \"He says someone tried to break into his house last night,\" said Mrs. Weasley. \"Mad-Eye Moody?\" said George thoughtfully, spreading marmalade on his toast. \"Isn't he that nutter -\" \"Your father thinks very highly of Mad-Eye Moody,\" said Mrs. Weasley sternly. \"Yeah, well, Dad collects plugs, doesn't he?\"  said Fred quietly as Mrs. Weasley left the room.  \"Birds of a feather. . .\" \"Moody was a great wizard in his time,\" said Bill. \"He's an old friend of Dumbledore's, isn't he?\" said Charlie. \"Dumbledore's not what you'd call normal, though, is he?\"  said Fred.  \"I mean, I know he's a genius and everything.. .\" \"Who is Mad-Eye?\" asked Harry. \"He's retired, used to work at the Ministry,\" said Charlie. \"I met him once when Dad took me into work with him. He was an Auror - one of the best. . . a Dark wizard catcher,\" he added, seeing Harry's blank look \"Half the cells in Azkaban are full because of him. He made himself loads of enemies, though. . . the families of people he caught, mainly. . . and I heard he's been getting really paranoid in his old age.  Doesn't trust anyone anymore.  Sees Dark wizards everywhere.\" Bill and Charlie decided to come and see everyone off at King's Cross station, but Percy, apologizing most profusely, said that he really needed to get to work. \"I just can't justify taking more time off at the moment,\" he told them. \"Mr. Crouch is really starting to rely on me.\" \"Yeah, you know what, Percy?\"  said George seriously.  \"I reckon he'll know your name soon.\" Mrs. Weasley had braved the telephone in the village post office to order three ordinary Muggle taxis to take them into London. \"Arthur tried to borrow Ministry cars for us,\" Mrs. Weasley whispered to Harry as they stood in the rain-washed yard, watching the taxi drivers heaving six heavy Hogwarts trunks into their cars.  \"But there weren't any to spare. . . . Oh dear, they don't look happy, do they?\" Harry didn't like to tell Mrs. Weasley that Muggle taxi drivers rarely transported overexcited owls, and Pigwidgeon was making an earsplitting racket.  Nor did it help that a number of Filibuster's Fabulous No-Heat, Wet-Start Fireworks went off unexpectedly when Fred's trunk sprang open, causing the driver carrying it to yell with fright and pain as Crookshanks clawed his way up the man's leg. The journey was uncomfortable, owing to the fact that they were jammed in the back of the taxis with their trunks. Crookshanks took quite a while to recover from the fireworks, and by the time they entered London, Harry, Ron, and Hermione were all severely scratched. They were very relieved to get out at King's Cross, even though the rain was coming down harder than ever, and they got soaked carrying their trunks across the busy road and into the station. Harry was used to getting onto platform nine and three-quarters by now.  It was a simple matter of walking straight through the apparently solid barrier dividing platforms nine and ten. The only tricky part was doing this in an unobtrusive way, so as to avoid attracting Muggle attention. They did it in groups today; Harry, Ron, and Hermione (the most conspicuous, since they were accompanied by Pigwidgeon and Crookshanks) went first; they leaned casually against the barrier, chatting unconcernedly, and slid sideways through it."
}