{
  "id": "96cb7feeff599327c3d8ff742bd2e23ac734bc98",
  "text": " The door to the King’s Tower was oak studded with iron. It might delay the Thenns, but it would not stop them if they wanted to come in. Jon slammed the bar down in its notches, paid a visit to the privy—it might well be his last chance—and hobbled back up to the roof, grimacing at the pain.  The west had gone the color of a blood bruise, but the sky above was cobalt blue, deepening to purple, and the stars were coming out. Jon sat between two merlons with only a scarecrow for company and watched the Stallion gallop up the sky. Or was it the Horned Lord? He wondered where Ghost was now. He wondered about Ygritte as well, and told himself that way lay madness.  They came in the night, of course. Like thieves, Jon thought. Like murderers.  Satin pissed himself when the horns blew, but Jon pretended not to notice.  Go shake Dick by the shoulder,  he told the Oldtown boy,  else he’s liable to sleep through the fight.    I’m frightened.  Satin’s face was a ghastly white.   So are they.  Jon leaned his crutch up against a merlon and took up his longbow, bending the smooth thick Dornish yew to slip a bowstring through the notches.  Don’t waste a quarrel unless you know you have a good clean shot,  he said when Satin returned from waking Dick.  We have an ample supply up here, but ample doesn’t mean inexhaustible. And step behind a merlon to reload, don’t try and hide in back of a scarecrow. They’re made of straw, an arrow will punch through them.  He did not bother telling Dick Follard anything. Dick could read your lips if there was enough light and he gave a damn what you were saying, but he knew it all already.  The three of them took up positions on three sides of the round tower.  Jon hung a quiver from his belt and pulled an arrow. The shaft was black, the fletching grey. As he notched it to his string, he remembered something that Theon Greyjoy had once said after a hunt.  The boar can keep his tusks and the bear his claws,  he had declared, smiling that way he did.  There’s nothing half so mortal as a grey goose feather.   Jon had never been half the hunter that Theon was, but he was no stranger to the longbow either. There were dark shapes slipping around the armory, backs against the stone, but he could not see them well enough to waste an arrow. He heard distant shouts, and saw the archers on the Tower of Guards loosing shafts at the ground. That was too far off to concern Jon. But when he glimpsed three shadows detach themselves from the old stables fifty yards away, he stepped up to the crenel, raised his bow, and drew. They were running, so he led them, waiting, waiting…  The arrow made a soft hiss as it left his string. A moment later there was a grunt, and suddenly only two shadows were loping across the yard. They ran all the faster, but Jon had already pulled a second arrow from his quiver. This time he hurried the shot too much, and missed. The wildlings were gone by the time he nocked again. He searched for another target, and found four, rushing around the empty shell of the Lord Commander’s Keep. The moonlight glimmered off their spears and axes, and the gruesome devices on their round leathern shields; skulls and bones, serpents, bear claws, twisted demonic faces. Free folk, he knew. The Thenns carried shields of black boiled leather with bronze rims and bosses, but theirs were plain and unadorned. These were the lighter wicker shields of raiders.  Jon pulled the goose feather back to his ear, aimed, and loosed the arrow, then nocked and drew and loosed again. The first shaft pierced the bearclaw shield, the second one a throat. The wildling screamed as he went down. He heard the deep thrum of Deaf Dick’s crossbow to his left, and Satin’s a moment later.  I got one!  the boy cried hoarsely.  I got one in the chest.    Get another,  Jon called.  He did not have to search for targets now; only choose them. He dropped a wildling archer as he was fitting an arrow to his string, then sent a shaft toward the axeman hacking at the door of Hardin’s Tower. That time he missed, but the arrow quivering in the oak made the wildling reconsider. It was only as he was running off that Jon recognized Big Boil. Half a heartbeat later, old Mully put an arrow through his leg from the roof of the Flint Barracks, and he crawled off bleeding. That will stop him bitching about his boil, Jon thought.  When his quiver was empty, he went to get another, and moved to a different crenel, side by side with Deaf Dick Follard. Jon got off three arrows for every bolt Deaf Dick discharged, but that was the advantage of the longbow. The crossbow penetrated better, some insisted, but it was slow and cumbersome to reload. He could hear the wildlings shouting to each other, and somewhere to the west a warhorn blew. The world was moonlight and shadow, and time became an endless round of notch and draw and loose. A wildling arrow ripped through the throat of the straw sentinel beside him, but Jon Snow scarcely noticed. Give me one clean shot at the Magnar of Thenn, he prayed to his father’s gods."
}