{
  "id": "9713dbb78dc255cfef74dbd35f46e245fbc3a6ae",
  "text": " He has the dogs to care for, Sam remembered. Probably the Lord Commander had given him some orders as well.  His fingers had been so stiff and clumsy in the gloves, and he was shaking from fear and cold, but he found the parchment pouch and dug out the messages he’d written. The ravens were shrieking furiously, and when he opened the Castle Black cage one of them flew right in his face. Two more escaped before Sam could catch one, and when he did it pecked him through his glove, drawing blood. Yet somehow he held on long enough to attach the little roll of parchment. The warhorn had fallen silent by then, but the Fist rang with shouted commands and the clatter of steel.  Fly!  Sam called as he tossed the raven into the air.  The birds in the Shadow Tower cage were screaming and fluttering about so madly that he was afraid to open the door, but he made himself do it anyway. This time he caught the first raven that tried to escape. A moment later, it was clawing its way up through the falling snow, bearing word of the attack.  His duty done, he finished dressing with clumsy, frightened fingers, donning his cap and surcoat and hooded cloak and buckling on his swordbelt, buckling it real tight so it wouldn’t fall down. Then he found his pack and stuffed all his things inside, spare smallclothes and dry socks, the dragonglass arrowheads and spearhead Jon had given him and the old horn too, his parchments, inks, and quills, the maps he’d been drawing, and a rock-hard garlic sausage he’d been saving since the Wall. He tied it all up and shouldered the pack onto his back. The Lord Commander said I wasn’t to rush to the ringwall, he recalled, but he said I shouldn’t come running to him either. Sam took a deep breath and realized that he did not know what to do next.  He remembered turning in a circle, lost, the fear growing inside him as it always did. There were dogs barking and horses trumpeting, but the snow muffled the sounds and made them seem far away. Sam could see nothing beyond three yards, not even the torches burning along the low stone wall that ringed the crown of the hill. Could the torches have gone out? That was too scary to think about. The horn blew thrice long, three long blasts means Others. The white walkers of the wood, the cold shadows, the monsters of the tales that made him squeak and tremble as a boy, riding their giant ice-spiders, hungry for blood…  Awkwardly he drew his sword, and plodded heavily through the snow holding it. A dog ran past barking, and he saw some of the men from the Shadow Tower, big bearded men with longaxes and eight-foot spears. He felt safer for their company, so he followed them to the wall. When he saw the torches still burning atop the ring of stones a shudder of relief went through him.  The black brothers stood with swords and spears in hand, watching the snow fall, waiting. Ser Mallador Locke went by on his horse, wearing a snow-speckled helm. Sam stood well back behind the others, looking for Grenn or Dolorous Edd. If I have to die, let me die beside my friends, he remembered thinking. But all the men around him were strangers, Shadow Tower men under the command of the ranger named Blane.   Here they come,  he heard a brother say.   Notch,  said Blane, and twenty black arrows were pulled from as many quivers, and notched to as many bowstrings.   Gods be good, there’s hundreds,  a voice said softly.   Draw,  Blane said, and then,  hold.  Sam could not see and did not want to see. The men of the Night’s Watch stood behind their torches, waiting with arrows pulled back to their ears, as something came up that dark, slippery slope through the snow.  Hold,  Blane said again,  hold, hold.  And then,  Loose.   The arrows whispered as they flew.  A ragged cheer went up from the men along the ringwall, but it died quickly.  They’re not stopping, m’lord,  a man said to Blane, and another shouted,  More! Look there, coming from the trees,  and yet another said,  Gods ha’ mercy, they’s crawling. They’s almost here, they’s on us!  Sam had been backing away by then, shaking like the last leaf on the tree when the wind kicks up, as much from cold as from fear. It had been very cold that night. Even colder than now. The snow feels almost warm. I feel better now. A little rest was all I needed. Maybe in a little while I’ll be strong enough to walk again. In a little while.  A horse stepped past his head, a shaggy grey beast with snow in its mane and hooves crusted with ice. Sam watched it come and watched it go. Another appeared from out of the falling snow, with a man in black leading it. When he saw Sam in his path he cursed him and led the horse around. I wish I had a horse, he thought. If I had a horse I could keep going. I could sit, and even sleep some in the saddle. Most of their mounts had been lost at the Fist, though, and those that remained carried their food, their torches, and their wounded. Sam wasn’t wounded. Only fat and weak, and the greatest craven in the Seven Kingdoms."
}