{
  "id": "972dc9f02d70f0319e4c96b1c54137e22dabaa7a",
  "text": " Another dismal night was in prospect.  The Lord Commander had entrusted his mount to Dolorous Edd. He was cleaning mud out of the horse’s hooves as Jon dismounted.  Lord Mormont’s in the hall,  he announced.  He said for you to join him. Best leave the wolf outside, he looks hungry enough to eat one of Craster’s children. Well, truth be told, I’m hungry enough to eat one of Craster’s children, so long as he was served hot. Go on, I’ll see to your horse. If it’s warm and dry inside, don’t tell me, I wasn’t asked in.  He flicked a glob of wet mud out from under a horseshoe.  Does this mud look like shit to you? Could it be that this whole hill is made of Craster’s shit?   Jon smiled.  Well, I hear he’s been here a long time.    You cheer me not. Go see the Old Bear.    Ghost, stay,  he commanded. The door to Craster’s Keep was made of two flaps of deerhide. Jon shoved between them, stooping to pass under the low lintel. Two dozen of the chief rangers had preceded him, and were standing around the firepit in the center of the dirt floor while puddles collected about their boots. The hall stank of soot, dung, and wet dog. The air was heavy with smoke, yet somehow still damp. Rain leaked through the smoke hole in the roof. It was all a single room, with a sleeping loft above reached by a pair of splintery ladders.  Jon remembered how he’d felt the day they had left the Wall: nervous as a maiden, but eager to glimpse the mysteries and wonders beyond each new horizon. Well, here’s one of the wonders, he told himself, gazing about the squalid, foul-smelling hall. The acrid smoke was making his eyes water. A pity that Pyp and Toad can’t see all they’re missing.  Craster sat above the fire, the only man to enjoy his own chair. Even Lord Commander Mormont must seat himself on the common bench, with his raven muttering on his shoulder. Jarman Buckwell stood behind, dripping from patched mail and shiny wet leather, beside Thoren Smallwood in the late Ser Jaremy’s heavy breastplate and sable-trimmed cloak.  Craster’s sheepskin jerkin and cloak of sewn skins made a shabby contrast, but around one thick wrist was a heavy ring that had the glint of gold. He looked to be a powerful man, though well into the winter of his days now, his mane of hair grey going to white. A flat nose and a drooping mouth gave him a cruel look, and one of his ears was missing. So this is a wildling. Jon remembered Old Nan’s tales of the savage folk who drank blood from human skulls. Craster seemed to be drinking a thin yellow beer from a chipped stone cup. Perhaps he had not heard the stories.   I’ve not seen Benjen Stark for three years,  he was telling Mormont.  And if truth be told, I never once missed him.  A half-dozen black puppies and the odd pig or two skulked among the benches, while women in ragged deerskins passed horns of beer, stirred the fire, and chopped carrots and onions into a kettle.   He ought to have passed here last year,  said Thoren Smallwood. A dog came sniffing round his leg. He kicked it and sent it off yipping.  Lord Mormont said,  Ben was searching for Ser Waymar Royce, who’d vanished with Gared and young Will.    Aye, those three I recall. The lordling no older than one of these pups. Too proud to sleep under my roof, him in his sable cloak and black steel. My wives give him big cow eyes all the same.  He turned his squint on the nearest of the women.  Gared says they were chasing raiders. I told him, with a commander that green, best not catch ’em. Gared wasn’t half-bad, for a crow. Had less ears than me, that one. The ’bite took ’em, same as mine.  Craster laughed.  Now I hear he got no head neither. The ’bite do that too?   Jon remembered a spray of red blood on white snow, and the way Theon Greyjoy had kicked the dead man’s head. The man was a deserter. On the way back to Winterfell, Jon and Robb had raced, and found six direwolf pups in the snow. A thousand years ago.   When Ser Waymar left you, where was he bound?   Craster gave a shrug.  Happens I have better things to do than tend to the comings and goings of crows.  He drank a pull of beer and set the cup aside.  Had no good southron wine up here for a bear’s night. I could use me some wine, and a new axe. Mine’s lost its bite, can’t have that, I got me women to protect.  He gazed around at his scurrying wives.   You are few here, and isolated,  Mormont said.  If you like, I’ll detail some men to escort you south to the Wall.   The raven seemed to like the notion.  Wall,  it screamed, spreading black wings like a high collar behind Mormont’s head.  Their host gave a nasty smile, showing a mouthful of broken brown teeth.  And what would we do there, serve you at supper? We’re free folk here. Craster serves no man.    These are bad times to dwell alone in the wild. The cold winds are rising.    Let them rise. My roots are sunk deep.  Craster grabbed a passing woman by the wrist.  Tell him, wife. Tell the Lord Crow how well content we are.   The woman licked at thin lips."
}