{
  "id": "981ed245bbdb0eeaf9cec2caeef7f72c6f9a2a14",
  "text": "  \"I  see  they  have  begun  to  arrive  already,\"  he  said  when  he  caught  sight  of  Dwalin's  green  hood  hanging  up.  He  hung  his  red  one  next  to  it,  and  \"Balin  at  your service!\" he said with his hand on his breast.  \"Thank  you!\"  said  Bilbo with  a  gasp.  It was  not  the  correct  thing  to  say,  but  they have begun  to  arrive had  flustered him badly. He  liked visitors, but he  liked  to know  them before  they arrived, and he preferred  to ask  them himself. He had a  horrible  thought  that  the  cakes might  run  short,  and  then  he-as  the host: he knew  his duty and stuck to it however painful-he might have to go without.  \"Come  along  in,  and  have  some  tea!\"  he  managed  to  say  after  taking  a  deep  breath.   ####-\"A  little  beer  would  suit  me  better,  if  it  is  all  the  same  to  you, my  good  sir,\"  said  Balin  with  the  white  beard.  \"But  I  don't  mind  some  cake-seed-cake,  if  you  have any.\"  \"Lots!\"  Bilbo  found  himself  answering,  to  his  own  surprise;  and  he  found  himself  scuttling  off,  too,  to  the  cellar  to  fill  a  pint  beer-mug, and to the pantry to  fetch  two  beautiful  round  seed-cakes  which  he  had  baked  that  afternoon  for  his  after-supper morsel.  When he got back Balin and Dwalin were  talking at  the  table  like old  friends  (as  a  matter  of  fact  they  were  brothers).  Bilbo  plumped  down  the  beer  and  the  cake  in  front  of  them, when  loud  came  a  ring  at  the  bell  again,  and  then  another  ring.  \"Gandalf for certain this time,\" he thought as he puffed along the passage. But  it was not. It was two more dwarves, both with blue hoods, silver belts, and yellow  beards;  and  each  of  them  carried  a  bag  of  tools  and  a  spade.  In  they  hopped,  as  soon as the door began to open-Bilbo was hardly surprised at all.  \"What can I do for you, my dwarves?\" he said. \"Kili at your service!\" said the  one.  \"And  Fili!\"  added  the  other;  and  they  both  swept  off  their  blue  hoods  and  bowed.  \"At  yours  and  your  family's!\"  replied  Bilbo,  remembering  his  manners  this  time.  \"Dwalin and Balin here already, I see,\" said Kili. \"Let us join the throng!\"  \"Throng!\" thought Mr. Baggins. \"I don't like the sound of that. I really must sit  down for a minute and collect my wits, and have a drink.\" He had only just had a  sip-in  the  corner,  while  the  four  dwarves  sat  around  the  table,  and  talked  about  mines  and  gold  and  troubles  with  the  goblins,  and  the  depredations  of  dragons,  and lots of other things which he did not understand, and did not want to, for they  sounded much too adventurous-when, ding-dong-a-ling-' dang, his bell rang again,  as if some naughty little hobbit-boy was trying to pull the handle off. \"Someone at  the  door!\"  he  said,  blinking.  \"Some  four,  I  should  say  by  the  sound,\"  said  Fili.  \"Be-sides, we saw them coming along behind us in the distance.\"  The  poor  little  hobbit  sat  down  in  the  hall  and  put  his  head  in  his  hands,  and  wondered  what  had  happened,  and  what  was  going  to  happen,  and  whether  they  would all stay  to supper. Then  the bell rang again  louder  than ever, and he had  to  run  to  the  door.  It  was  not  four  after  all,  t  was  FIVE.  Another  dwarf  had  come  along while he was wondering in the hall. He had hardly turned the knob, be-x)re  they were all  inside, bowing and  saying  \"at your  service\" one after another. Dori,  Nori,  Ori,  Oin,  and  Gloin  were  their  names;  and  very  soon  two  purple  hoods,  a   ####-grey hood, a brown hood, and a white hood were hanging on the pegs, and off they  marched  with  their  broad  hands  stuck  in  their  gold  and  silver  belts  to  join  the  others. Already  it had almost become a  throng. Some called  for ale, and some  for  porter,  and  one  for  coffee,  and  all  of  them  for  cakes;  so  the hobbit was kept very  busy for a while.  A  big  jug  of  coffee  bad  just  been  set  in  the  hearth,  the  seed-cakes were gone,  and  the  dwarves  were  starting  on  a  round  of  buttered  scones,  when  there  came-a  loud  knock.  Not  a  ring,  but  a  hard  rat-tat  on  the  hobbit's  beautiful  green  door.  Somebody was banging with a stick!  Bilbo  rushed  along  the  passage,  very  angry,  and  altogether  bewildered  and  bewuthered-this  was  the  most  awkward  Wednesday  he  ever  remembered.  He  pulled open the door with a jerk, and they all fell in, one on top of the other. More  dwarves,  four  more!  And  there  was  Gandalf  behind,  leaning  on  his  staff  and  laughing. He had made quite a dent on the beautiful door; he had also, by the way,  knocked out the secret mark that he had put there the morning before.  \"Carefully!  Carefully!\"  he  said.  \"It  is  not  like  you,  Bilbo,  to  keep  friends  waiting  on  the  mat,  and  then  open  the  door  like  a  pop-gun!  Let  me  introduce  Bifur, Bofur, Bombur, and especially Thorin!\"  \"At your service!\" said Bifur, Bofur, and Bombur standing in a row."
}