{
  "id": "9836158254a84233e2f835038ba9dc1d7cc0a2e2",
  "text": " But wed Sansa Stark, and it is just possible that you might win Winterfell.   Tyrion Lannister, Lord Protector of Winterfell. The prospect gave him a queer chill.  Very good, Father,  he said slowly,  but there’s a big ugly roach in your rushes. Robb Stark is as capable as I am, presumably, and sworn to marry one of those fertile Freys. And once the Young Wolf sires a litter, any pups that Sansa births are heirs to nothing.   Lord Tywin was unconcerned.  Robb Stark will father no children on his fertile Frey, you have my word. There is a bit of news I have not yet seen fit to share with the council, though no doubt the good lords will hear it soon enough. The Young Wolf has taken Gawen Westerling’s eldest daughter to wife.   For a moment Tyrion could not believe he’d heard his father right.  He broke his sworn word?  he said, incredulous.  He threw away the Freys for…  Words failed him.   A maid of sixteen years, named Jeyne,  said Ser Kevan.  Lord Gawen once suggested her to me for Willem or Martyn, but I had to refuse him. Gawen is a good man, but his wife is Sybell Spicer. He should never have wed her. The Westerlings always did have more honor than sense. Lady Sybell’s grandfather was a trader in saffron and pepper, almost as lowborn as that smuggler Stannis keeps. And the grandmother was some woman he’d brought back from the east. A frightening old crone, supposed to be a priestess. Maegi, they called her. No one could pronounce her real name. Half of Lannisport used to go to her for cures and love potions and the like.  He shrugged.  She’s long dead, to be sure. And Jeyne seemed a sweet child, I’ll grant you, though I only saw her once. But with such doubtful blood…   Having once married a whore, Tyrion could not entirely share his uncle’s horror at the thought of wedding a girl whose great grandfather sold cloves. Even so… A sweet child, Ser Kevan had said, but many a poison was sweet as well. The Westerlings were old blood, but they had more pride than power. It would not surprise him to learn that Lady Sybell had brought more wealth to the marriage than her highborn husband. The Westerling mines had failed years ago, their best lands had been sold off or lost, and the Crag was more ruin than stronghold. A romantic ruin, though, jutting up so brave above the sea.  I am surprised,  Tyrion had to confess.  I thought Robb Stark had better sense.    He is a boy of sixteen,  said Lord Tywin.  At that age, sense weighs for little, against lust and love and honor.    He forswore himself, shamed an ally, betrayed a solemn promise. Where is the honor in that?   Ser Kevan answered.  He chose the girl’s honor over his own. Once he had deflowered her, he had no other course.    It would have been kinder to leave her with a bastard in her belly,  said Tyrion bluntly. The Westerlings stood to lose everything here; their lands, their castle, their very lives. A Lannister always pays his debts.   Jeyne Westerling is her mother’s daughter,  said Lord Tywin,  and Robb Stark is his father’s son.   This Westerling betrayal did not seem to have enraged his father as much as Tyrion would have expected. Lord Tywin did not suffer disloyalty in his vassals. He had extinguished the proud Reynes of Castamere and the ancient Tarbecks of Tarbeck Hall root and branch when he was still half a boy. The singers had even made a rather gloomy song of it. Some years later, when Lord Farman of Faircastle grew truculent, Lord Tywin sent an envoy bearing a lute instead of a letter. But once he’d heard  The Rains of Castamere  echoing through his hall, Lord Farman gave no further trouble. And if the song were not enough, the shattered castles of the Reynes and Tarbecks still stood as mute testimony to the fate that awaited those who chose to scorn the power of Casterly Rock.  The Crag is not so far from Tarbeck Hall and Castamere,  Tyrion pointed out.  You’d think the Westerlings might have ridden past and seen the lesson there.    Mayhaps they have,  Lord Tywin said.  They are well aware of Castamere, I promise you.    Could the Westerlings and Spicers be such great fools as to believe the wolf can defeat the lion?   Every once in a very long while, Lord Tywin Lannister would actually threaten to smile; he never did, but the threat alone was terrible to behold.  The greatest fools are ofttimes more clever than the men who laugh at them,  he said, and then,  You will marry Sansa Stark, Tyrion. And soon.       Catelyn   They carried the corpses in upon their shoulders and laid them beneath the dais. A silence fell across the torchlit hall, and in the quiet Catelyn could hear Grey Wind howling half a castle away. He smells the blood, she thought, through stone walls and wooden doors, through night and rain, he still knows the scent of death and ruin.  She stood at Robb’s left hand beside the high seat, and for a moment felt almost as if she were looking down at her own dead, at Bran and Rickon. These boys had been much older, but death had shrunken them."
}