{
  "id": "98751c18f6e09815d0f691f3f824933c2668f896",
  "text": " Harry broke away from the table where Fred and George had started juggling butterbeer bottles and went over to her.  \"Did you even come to the match?\" he asked her.  \"Of course I did,\" said Hermione in a strangely high-pitched voice, not looking up. \"And I'm very glad we won, and I think you did really well, but I need to read this by Monday.\"  \"Come on, Hermione, come and have some food,\" Harry said, looking over at Ron and wondering whether he was in a good enough mood to bury the hatchet.  \"I can't, Harry. I've still got four hundred and twenty-two pages to read!\" said Hermione, now sounding slightly hysterical. \"Anyway...\" She glanced over at Ron too. \"He doesn't want me to join in.\"  There was no arguing with this, as Ron chose that moment to say loudly, \"If Scabbers hadn't just been eaten, he could have had some of those Fudge Flies. He used to really like them --\"  Hermione burst into tears. Before Harry could say or do anything, she tucked the enormous book under her arm, and, still sobbing, ran toward the staircase to the girls' dormitories and out of sight.  \"Can't you give her a break?\" Harry asked Ron quietly.  \"No,\" said Ron flatly. \"If she just acted like she was sorry -- but she'll never admit she's wrong, Hermione. She's still acting like Scabbers has gone on vacation or something.\"  The Gryffindor party ended only when Professor McGonagall turned up in her tartan dressing gown and hair net at one in the morning, to insist that they all go to bed. Harry and Ron climbed the stairs to their dormitory, still discussing the match. At last, exhausted, Harry climbed into bed, twitched the hangings of his four-poster shut to block out a ray of moonlight, lay back, and felt himself almost instantly drifting off to sleep....  He had a very strange dream. He was walking through a forest, his Firebolt over his shoulder, following something silvery-white. It was winding its way through the trees ahead, and he could only catch glimpses of it between the leaves. Anxious to catch up with it, he sped up, but as he moved faster, so did his quarry. Harry broke into a run, and ahead he heard hooves gathering speed. Now he was running flat out, and ahead he could hear galloping. Then he turned a corner into a clearing and -  \"AAARRGGHH! NOOO!\"  Harry woke as suddenly as though he'd been hit in the face. Disoriented in the total darkness, he fumbled with his hangings, he could hear movements around him, and Seamus Finnigan's voice from the other side of the room: \"What's going on?\"  Harry thought he heard the dormitory door slam. At last finding the divide in his curtains, he ripped them back, and at the same moment, Dean Thomas lit his lamp.  Ron was sitting up in bed, the hangings torn from one side, a look of utmost terror on his face.  \"Black! Sirius Black! With a knife!\"  \"What?\"  \"Here! Just now! Slashed the curtains! Woke me up!\"  \"You sure you weren't dreaming, Ron?\" said Dean.  \"Look at the curtains! I tell you, he was here!\"  They all scrambled out of bed; Harry reached the dormitory door first, and they sprinted back down the staircase. Doors opened behind them, and sleepy voices called after them.  \"Who shouted?\"  \"What're you doing?\"  The common room was lit with the glow of the dying fire, still littered with the debris from the party. It was deserted.  \"Are you sure you weren't dreaming, Ron?\"  \"I'm telling you, I saw him!\"  \"What's all the noise?\"  \"Professor McGonagall told us to go to bed!\"  A few of the girls had come down their staircase, pulling or, dressing gowns and yawning. Boys, too, were reappearing.  \"Excellent, are we carrying on?\" said Fred Weasley brightly.  \"Everyone back upstairs!\" said Percy, hurrying into the common room and pinning his Head Boy badge to his pajamas as he spoke.  \"Perce -- Sirius Black!\" said Ron faintly. \"In our dormitory! With a knife! Woke me up!\"  The common room went very still.  \"Nonsense!\" said Percy, looking startled. \"You had too much to eat, Ron -- had a nightmare --\"  \"I'm telling you --\"  \"Now, really, enough's enough!\"  Professor McGonagall was back. She slammed the portrait behind her as she entered the common room and stared furiously around.  \"I am delighted that Gryffindor won the match, but this is getting ridiculous! Percy, I expected better of you!\"  \"I certainly didn't authorize this, Professor!\" said Percy, puffing himself up indignantly. \"I was just telling them all to get back to bed! My brother Ron here had a nightmare --\"  \"IT WASN'T A NIGHTMARE!\" Ron yelled. \"PROFESSOR, I WOKE UP, AND SIRIUS BLACK WAS STANDING OVER ME, HOLDING A KNIFE!\"  Professor McGonagall stared at him.  \"Don't be ridiculous, Weasley, how could he possibly have gotten through the portrait hole?\"  \"Ask him!\" said Ron, pointing a shaking finger at the back of Sir Cadogan's picture. \"Ask him if he saw --\"  Glaring suspiciously at Ron, Professor McGonagall pushed the Portrait back open and went outside. The whole common room listened with bated breath. \"Sir Cadogan, did you just let a man enter Gryffindor Tower?\" \"Certainly, good lady!\" cried Sir Cadogan."
}