{
  "id": "98bb019b2afe8daa497c5a829b3f70d02ae5f489",
  "text": " None of them would even look at the Hound’s face, at least not for long. Some of the women tried to put her in a dress and make her do needlework, but they weren’t Lady Smallwood and she was having none of it. And there was one girl who took to following her, the village elder’s daughter. She was of an age with Arya, but just a child; she cried if she skinned a knee, and carried a stupid cloth doll with her everywhere she went. The doll was made up to look like a man-at-arms, sort of, so the girl called him Ser Soldier and bragged how he kept her safe.  Go away,  Arya told her half a hundred times.  Just leave me be.  She wouldn’t, though, so finally Arya took the doll away from her, ripped it open, and pulled the rag stuffing out of its belly with a finger.  Now he really looks like a soldier!  she said, before she threw the doll in a brook. After that the girl stopped pestering her, and Arya spent her days grooming Craven and Stranger or walking in the woods. Sometimes she would find a stick and practice her needlework, but then she would remember what had happened at the Twins and smash it against a tree until it broke.   Might be we should stay here awhile,  the Hound told her, after a fortnight. He was drunk on ale, but more brooding than sleepy.  We’d never reach the Eyrie, and the Freys will still be hunting survivors in the riverlands. Sounds like they need swords here, with these clansmen raiding. We can rest up, maybe find a way to get a letter to your aunt.  Arya’s face darkened when she heard that. She didn’t want to stay, but there was nowhere to go, either. The next morning, when the Hound went off to chop down trees and haul logs, she crawled back into bed.  But when the work was done and the tall wooden palisade was finished, the village elder made it plain that there was no place for them.  Come winter, we will be hard pressed to feed our own,  he explained.  And you… a man like you brings blood with him.   Sandor’s mouth tightened.  So you do know who I am.    Aye. We don’t get travelers here, that’s so, but we go to market, and to fairs. We know about King Joffrey’s dog.    When these Stone Crows come calling, you might be glad to have a dog.    Might be.  The man hesitated, then gathered up his courage.  But they say you lost your belly for fighting at the Blackwater. They say—    I know what they say.  Sandor’s voice sounded like two woodsaws grinding together.  Pay me, and we’ll be gone.   When they left, the Hound had a pouch full of coppers, a skin of sour ale, and a new sword. It was a very old sword, if truth be told, though new to him. He swapped its owner the longaxe he’d taken at the Twins, the one he’d used to raise the lump on Arya’s head. The ale was gone in less than a day, but Clegane sharpened the sword every night, cursing the man he’d swapped with for every nick and spot of rust. If he lost his belly for fighting, why does he care if his sword is sharp? It was not a question Arya dared ask him, but she thought on it a lot. Was that why he’d run from the Twins and carried her off?  Back in the riverlands, they found that the rains had ebbed away, and the flood waters had begun to recede. The Hound turned south, back toward the Trident.  We’ll make for Riverrun,  he told Arya as they roasted a hare he’d killed.  Maybe the Blackfish wants to buy himself a she-wolf.    He doesn’t know me. He won’t even know I’m really me.  Arya was tired of making for Riverrun. She had been making for Riverrun for years, it seemed, without ever getting there. Every time she made for Riverrun, she ended up someplace worse.  He won’t give you any ransom. He’ll probably just hang you.    He’s free to try.  He turned the spit.  He doesn’t talk like he’s lost his belly for fighting.  I know where we could go,  Arya said. She still had one brother left. Jon will want me, even if no one else does. He’ll call me  little sister  and muss my hair. It was a long way, though, and she didn’t think she could get there by herself. She hadn’t even been able to reach Riverrun.  We could go to the Wall.   Sandor’s laugh was half a growl.  The little wolf bitch wants to join the Night’s Watch, does she?    My brother’s on the Wall,  she said stubbornly.  His mouth gave a twitch.  The Wall’s a thousand leagues from here. We’d need to fight through the bloody Freys just to reach the Neck. There’s lizard lions in those swamps that eat wolves every day for breakfast. And if we did reach the north with our skins intact, there’s ironborn in half the castles, and thousands of bloody buggering northmen as well.    Are you scared of them?  she asked.  Have you lost your belly for fighting?   For a moment she thought he was going to hit her. By then the hare was brown, though, skin crackling and grease popping as it dripped down into the cookfire. Sandor took it off the stick, ripped it apart with his big hands, and tossed half of it into Arya’s lap.  There’s nothing wrong with my belly,  he said as he pulled off a leg,  but I don’t give a rat’s arse for you or your brother."
}