{
  "id": "98d29058ac49389c98efd732be7b642bdc0a4ea1",
  "text": "  At their head was a man stick-thin and very tall, with a drawn emaciated face made even longer by the ropy black beard that grew from his pointed chin nearly to his waist. The helm that hung from his saddle horn was black steel, fashioned in the shape of a goat’s head. About his neck he wore a chain made of linked coins of many different sizes, shapes, and metals, and his horse was one of the strange black-and-white ones.   You don’t want to know that lot, Weasel,  Weese said when he saw her looking at the goat-helmed man. Two of his drinking friends were with him, men-at-arms in service to Lord Lefford.   Who are they?  she asked.  One of the soldiers laughed.  The Footmen, girl. Toes of the Goat. Lord Tywin’s Bloody Mummers.    Pease for wits. You get her flayed, you can scrub the bloody steps,  said Weese.  They’re sellswords, Weasel girl. Call themselves the Brave Companions. Don’t use them other names where they can hear, or they’ll hurt you bad. The goat-helm’s their captain, Lord Vargo Hoat.    He’s no fucking lord,  said the second soldier.  I heard Ser Amory say so. He’s just some sellsword with a mouth full of slobber and a high opinion of hisself.    Aye,  said Weese,  but she better call him lord if she wants to keep all her parts.   Arya looked at Vargo Hoat again. How many monsters does Lord Tywin have?  The Brave Companions were housed in the Widow’s Tower, so Arya need not serve them. She was glad of that; on the very night they arrived, fighting broke out between the sellswords and some Lannister men. Ser Harys Swyft’s squire was stabbed to death and two of the Bloody Mummers were wounded. The next morning Lord Tywin hanged them both from the gatehouse walls, along with one of Lord Lydden’s archers. Weese said the archer had started all the trouble by taunting the sellswords over Beric Dondarrion. After the hanged men had stopped kicking, Vargo Hoat and Ser Harys embraced and kissed and swore to love each other always as Lord Tywin looked on. Arya thought it was funny the way Vargo Hoat lisped and slobbered, but she knew better than to laugh.  The Bloody Mummers did not linger long at Harrenhal, but before they rode out again, Arya heard one of them saying how a northern army under Roose Bolton had occupied the ruby ford of the Trident.  If he crosses, Lord Tywin will smash him again like he did on the Green Fork,  a Lannister bowmen said, but his fellows jeered him down.  Bolton’ll never cross, not till the Young Wolf marches from Riverrun with his wild northmen and all them wolves.   Arya had not known her brother was so near. Riverrun was much closer than Winterfell, though she was not certain where it lay in relation to Harrenhal. I could find out somehow, I know I could, if only I could get away. When she thought of seeing Robb’s face again Arya had to bite her lip. And I want to see Jon too, and Bran and Rickon, and Mother. Even Sansa… I’ll kiss her and beg her pardons like a proper lady, she’ll like that.  From the courtyard talk she’d learned that the upper chambers of the Tower of Dread housed three dozen captives taken during some battle on the Green Fork of the Trident. Most had been given freedom of the castle in return for their pledge not to attempt escape. They vowed not to escape, Arya told herself, but they never swore not to help me escape.  The captives ate at their own table in the Hall of a Hundred Hearths, and could often be seen about the grounds. Four brothers took their exercise together every day, fighting with staves and wooden shields in the Flowstone Yard. Three of them were Freys of the Crossing, the fourth their bastard brother. They were only there a short time, though; one morning two other brothers arrived under a peace banner with a chest of gold, and ransomed them from the knights who’d captured them. The six Freys all left together.  No one ransomed the northmen, though. One fat lordling haunted the kitchens, Hot Pie told her, always looking for a morsel. His mustache was so bushy that it covered his mouth, and the clasp that held his cloak was a silver-and-sapphire trident. He belonged to Lord Tywin, but the fierce, bearded young man who liked to walk the battlements alone in a black cloak patterned with white suns had been taken by some hedge knight who meant to get rich off him. Sansa would have known who he was, and the fat one too, but Arya had never taken much interest in titles and sigils. Whenever Septa Mordane had gone on about the history of this house and that house, she was inclined to drift and dream and wonder when the lesson would be done.  She did remember Lord Cerwyn, though. His lands had been close to Winterfell, so he and his son Cley had often visited. Yet as fate would have it, he was the only captive who was never seen; he was abed in a tower cell, recovering from a wound. For days and days Arya tried to work out how she might steal past the door guards to see him. If he knew her, he would be honor bound to help her. A lord would have gold for a certainty, they all did; perhaps he would pay some of Lord Tywin’s own sellswords to take her to Riverrun."
}