{
  "id": "994b845fa651b2fc6f4ba1dd46256a7019c07b8c",
  "text": "       'Come now, ride with me!'       Then Elrond and  Galadriel rode on; for the Third Age was over, and the   Days of the Rings were passed, and an end was come of the story and  song of  those  times. With them  went many  Elves of the High Kindred  who  would  no  longer stay in  Middle-earth; and among them, filled with a sadness that was  yet  blessed and without bitterness, rode Sam, and Frodo, and Bilbo, and the  Elves delighted to honour them.       Though they rode through the midst of the Shire all the evening and all  the night, none saw them  pass,  save the wild creatures; or here  and there  some wanderer in the dark who saw a swift  shimmer  under  the trees,  or  a   light and shadow flowing  through the grass as the Moon  went westward.  And  when  they had passed from the  Shire,  going about the  south skirts of the  White Downs, they came to the Far Downs,  and to the Towers,  and  looked on  the  distant Sea; and  so they  rode down at  last to Mithlond,  to the Grey  Havens in the long firth of Lune.       As  they  came  to the gates Cnrdan the Shipwright came  forth to greet  them. Very tall he was,  and his beard  was long, and he  was grey  and old,  save that  his eyes were keen as stars; and he looked at them and bowed, and   said: 'All is now ready.'       Then Cnrdan led  them to the Havens, and there  was a white ship lying,  and upon the  quay  beside a  great  grey horse stood a  figure robed all in  white awaiting them.  As  he turned and came  towards  them  Frodo saw  that  Gandalf now wore openly  upon his  hand the Third Ring, Narya the Great, and  the stone upon it was red as fire.  Then those who were to go were glad, for   they knew that Gandalf also would take ship with them.       But Sam  was now sorrowful at  heart,  and it seemed to him that if the  parting would be bitter,  more grievous  still would  be  the long road home  alone. But  even as they stood there, and the Elves were  going aboard,  and   ####-all was being made ready to depart, up rode Merry and Pippin in great haste.   And amid his tears Pippin laughed.       'You tried to give us the slip once before and failed, Frodo.' he said.  'This time you have nearly  succeeded, but you have failed again. It was not   Sam, though, that gave you away this time, but Gandalf himself!'       'Yes,' said Gandalf; 'for it will be better to ride back three together   'than one alone. Well, here at  last, dear friends, on the shores of the Sea   comes the end of our fellowship in Middle-earth.  Go in peace!  I  will  not  say: do not weep; for not all tears are an evil.'       Then Frodo  kissed Merry  and Pippin,  and last  of all  Sam,  and went  aboard; and the sails were drawn up, and  the wind blew, and slowly the ship  slipped away  down  the  long  grey firth;  and the  light of  the  glass of  Galadriel that Frodo bore glimmered and was lost. And the ship went out into  the  High Sea and passed on into the West, until at  last on a night of rain  Frodo smelled  a sweet  fragrance on the air  and heard the sound of singing   that came over the water. And  then it seemed to him that as in his dream in  the house of Bombadil, the grey rain-curtain turned all to silver  glass and   was  rolled back, and he beheld white  shores and beyond  them  a far  green  country under a swift sunrise.       But to Sam  the evening deepened to darkness as he  stood at the Haven;  and as he looked at the grey sea he saw only a shadow on the waters that was  soon lost in the West. There still he stood  far into the night, hearing only  the  sigh and murmur of  the  waves on  the shores  of Middle-earth, and the  sound of them sank deep into his  heart.  Beside him stood Merry and Pippin,  and they were silent.       At last the three companions  turned away, and never again looking back   they rode slowly homewards; and they spoke no word to one another until they  came  back to the  Shire. but each had great comfort  in his friends  on the  long grey road.       At last they rode over the downs and took the East Road, and then Merry  and Pippin rode on to Buckland; and already they  were singing again as they  went. But Sam turned to Bywater,  and so came back up  the Hill,  as day was  ending  once  more. And  he  went on, and there  was  yellow light, and fire  within; and the evening meal was ready, and he  was expected.  And Rose drew  him in, and set him in his chair, and put little Elanor upon his lap.       He drew a deep breath. 'Well, I'm back,' he said.     ####- ."
}