{
  "id": "9a0b36fdf1bd4a9b342bce08978383b2ff62854b",
  "text": " The island was densely wooded, a tangle of willows, oaks, and tall pines that cast deep shadows across the rushing water, hiding snags and the rotted trunks of drowned trees. To their left the bluff rose sheer and rocky, and at its foot the river foamed whitely around broken boulders and tumbles of rock fallen from the cliff face.  They passed from sunlight into shadow, hidden from the galley’s view between the green wall of the trees and the stony grey-brown bluff. A few moments’ respite from the arrows, Jaime thought, pushing them off a half-submerged boulder.  The skiff rocked. He heard a soft splash, and when he glanced around, Brienne was gone. A moment later he spied her again, pulling herself from the water at the base of the bluff. She waded through a shallow pool, scrambled over some rocks, and began to climb. Ser Cleos goggled, mouth open. Fool, thought Jaime.  Ignore the wench,  he snapped at his cousin.  Steer.   They could see the sail moving behind the trees. The river galley came into full view at the top of the cutoff, twenty-five yards behind. Her bow swung hard as she came around, and a half-dozen arrows took flight, but all went well wide. The motion of the two boats was giving the archers difficulty, but Jaime knew they’d soon enough learn to compensate. Brienne was halfway up the cliff face, pulling herself from handhold to handhold. Ryger’s sure to see her, and once he does he’ll have those bowmen bring her down. Jaime decided to see if the old man’s pride would make him stupid.  Ser Robin,  he shouted,  hear me for a moment.   Ser Robin raised a hand, and his archers lowered their bows.  Say what you will, Kingslayer, but say it quickly.   The skiff swung through a litter of broken stones as Jaime called out,  I know a better way to settle this—single combat. You and I.    I was not born this morning, Lannister.    No, but you’re like to die this afternoon.  Jaime raised his hands so the other could see the manacles.  I’ll fight you in chains. What could you fear?    Not you, ser. If the choice were mine, I’d like nothing better, but I am commanded to bring you back alive if possible. Bowmen.  He signaled them on.  Notch. Draw Loo—   The range was less than twenty yards. The archers could scarcely have missed, but as they pulled on their longbows a rain of pebbles cascaded down around them. Small stones rattled on their deck, bounced off their helms, and made splashes on both sides of the bow. Those who had wits enough to understand raised their eyes just as a boulder the size of a cow detached itself from the top of the bluff. Ser Robin shouted in dismay. The stone tumbled through the air, struck the face of the cliff, cracked in two, and smashed down on them. The larger piece snapped the mast, tore through the sail, sent two of the archers flying into the river, and crushed the leg of a rower as he bent over his oar. The rapidity with which the galley began to fill with water suggested that the smaller fragment had punched right through her hull. The oarsman’s screams echoed off the bluff while the archers flailed wildly in the current. From the way they were splashing, neither man could swim. Jaime laughed.  By the time they emerged from the cutoff, the galley was foundering amongst pools, eddies, and snags, and Jaime Lannister had decided that the gods were good. Ser Robin and his thrice-damned archers would have a long wet walk back to Riverrun, and he was rid of the big homely wench as well. I could not have planned it better myself. Once I’m free of these irons…  Ser Cleos raised a shout. When Jaime looked up, Brienne was lumbering along the clifftop, well ahead of them, having cut across a finger of land while they were following the bend in the river. She threw herself off the rock, and looked almost graceful as she folded into a dive. It would have been ungracious to hope that she would smash her head on a stone. Ser Cleos turned the skiff toward her. Thankfully, Jaime still had his oar. One good swing when she comes paddling up and I’ll be free of her.  Instead he found himself stretching the oar out over the water. Brienne grabbed hold, and Jaime pulled her in. As he helped her into the skiff, water ran from her hair and dripped from her sodden clothing to pool on the deck. She’s even uglier wet. Who would have thought it possible?  You’re a bloody stupid wench,  he told her.  We could have sailed on without you. I suppose you expect me to thank you?    I want none of your thanks, Kingslayer. I swore an oath to bring you safe to King’s Landing.    And you actually mean to keep it?  Jaime gave her his brightest smile.  Now there’s a wonder.       Catelyn   Ser Desmond Grell had served House Tully all his life. He had been a squire when Catelyn was born, a knight when she learned to walk and ride and swim, master-at-arms by the day that she was wed. He had seen Lord Hoster’s little Cat become a young woman, a great lord’s lady, mother to a king. And now he has seen me become a traitor as well."
}