{
  "id": "9a50794b94cc29ca2365d2b5eca42ce7fd7b38d6",
  "text": " I shall leave His Grace to you.    As you wish.  Ser Kevan rose as well.  Jaime, you should go to your father. This breach between you—    —is his doing. Nor will he mend it by sending me mocking gifts. Tell him that, if you can pry him away from the Tyrells long enough.   His uncle looked distressed.  The gift was heartfelt. We thought that it might encourage you—    —to grow a new hand?  Jaime turned to Tommen. Though he had Joffrey’s golden curls and green eyes, the new king shared little else with his late brother. He inclined to plumpness, his face was pink and round, and he even liked to read. He is still shy of nine, this son of mine. The boy is not the man. It would be seven years before Tommen was ruling in his own right. Until then the realm would remain firmly in the hands of his lord grandfather.  Sire,  he asked,  do I have your leave to go?    As you like, Ser Uncle.  Tommen looked back to Ser Kevan.  Can I seal them now, Great-Uncle?  Pressing his royal seal into the hot wax was his favorite part of being king, so far.  Jaime strode from the council chamber. Outside the door he found Ser Meryn Trant standing stiff at guard in white scale armor and snowy cloak. If this one should learn how feeble I am, or Kettleblack or Blount should hear of it…  Remain here until His Grace is done,  he said,  then escort him back to Maegor’s.   Trant inclined his head.  As you say, my lord.   The outer ward was crowded and noisy that morning. Jaime made for the stables, where a large group of men were saddling their horses.  Steelshanks!  he called.  Are you off, then?    As soon as m’lady is mounted,  said Steelshanks Walton.  My lord of Bolton expects us. Here she is now.   A groom led a fine grey mare out the stable door. On her back was mounted a skinny hollow-eyed girl wrapped in a heavy cloak. Grey, it was, like the dress beneath it, and trimmed with white satin. The clasp that pinned it to her breast was wrought in the shape of a wolf’s head with slitted opal eyes. The girl’s long brown hair blew wild in the wind. She had a pretty face, he thought, but her eyes were sad and wary.  When she saw him, she inclined her head.  Ser Jaime,  she said in a thin anxious voice.  You are kind to see me off.   Jaime studied her closely.  You know me, then?   She bit her lip.  You may not recall, my lord, as I was littler then… but I had the honor to meet you at Winterfell when King Robert came to visit my father Lord Eddard.  She lowered her big brown eyes and mumbled,  I’m Arya Stark.   Jaime had never paid much attention to Arya Stark, but it seemed to him that this girl was older.  I understand you’re to be married.    I am to wed Lord Bolton’s son, Ramsay. He used to be a Snow, but His Grace has made him a Bolton. They say he’s very brave. I am so happy.   Then why do you sound so frightened?  I wish you joy, my lady.  Jaime turned back to Steelshanks.  You have the coin you were promised?    Aye, and we’ve shared it out. You have my thanks.  The northman grinned.  A Lannister always pays his debts.    Always,  said Jaime, with a last glance at the girl. He wondered if there was much resemblance. Not that it mattered. The real Arya Stark was buried in some unmarked grave in Flea Bottom in all likelihood. With her brothers dead, and both parents, who would dare name this one a fraud?  Good speed,  he told Steelshanks. Nage raised his peace banner, and the northmen formed a column as ragged as their fur cloaks and trotted out the castle gate. The thin girl on the grey mare looked small and forlorn in their midst.  A few of the horses still shied away from the dark splotch on the hard-packed ground where the earth had drunk the life’s blood of the stableboy Gregor Clegane had killed so clumsily. The sight of it made Jaime angry all over again. He had told his Kingsguard to keep the crowd out of the way, but that oaf Ser Boros had let himself be distracted by the duel. The fool boy himself shared some of the blame, to be sure; the dead Dornishman as well. And Clegane most of all. The blow that took the boy’s arm off had been mischance, but that second cut…  Well, Gregor is paying for it now. Grand Maester Pycelle was tending to the man’s wounds, but the howls heard ringing from the maester’s chambers suggested that the healing was not going as well as it might.  The flesh mortifies and the wounds ooze pus,  Pycelle told the council.  Even maggots will not touch such foulness. His convulsions are so violent that I have had to gag him to prevent him from biting off his tongue. I have cut away as much tissue as I dare, and treated the rot with boiling wine and bread mold, to no avail. The veins in his arm are turning black. When I leeched him, all the leeches died. My lords, I must know what malignant substance Prince Oberyn used on his spear. Let us detain these other Dornishmen until they are more forthcoming.   Lord Tywin had refused him.  There will be trouble enough with Sunspear over Prince Oberyn’s death. I do not mean to make matters worse by holding his companions captive."
}