{
  "id": "9af74d6de8dbb55e4c34d8974954cc6bf8d3de9e",
  "text": " Every so often one of them would come down and smash him in the head. A few nervous laughs echoed through the hall. Sansa went to Ser Lancel and knelt beside him. His wound was bleeding afresh where the queen had struck him.  Madness,  he gasped.  Gods, the Imp was right, was right…    Help him,  Sansa commanded two of the serving men. One just looked at her and ran, flagon and all. Other servants were leaving the hall as well, but she could not help that. Together, Sansa and the serving man got the wounded knight back on his feet.  Take him to Maester Frenken.  Lancel was one of them, yet somehow she still could not bring herself to wish him dead. I am soft and weak and stupid, just as Joffrey says. I should be killing him, not helping him.  The torches had begun to burn low, and one or two had flickered out. No one troubled to replace them. Cersei did not return. Ser Dontos climbed the dais while all eyes were on the other fool.  Go back to your bedchamber, sweet Jonquil,  he whispered.  Lock yourself in, you’ll be safer there. I’ll come for you when the battle’s done.   Someone will come for me, Sansa thought, but will it be you, or will it be Ser Ilyn? For a mad moment she thought of begging Dontos to defend her. He had been a knight too, trained with the sword and sworn to defend the weak. No. He has not the courage, or the skill. I would only be killing him as well.  It took all the strength she had in her to walk slowly from the Queen’s Ballroom when she wanted so badly to run. When she reached the steps, she did run, up and around until she was breathless and dizzy. One of the guards knocked into her on the stair. A jeweled wine cup and a pair of silver candlesticks spilled out of the crimson cloak he’d wrapped them in and went clattering down the steps. He hurried after them, paying Sansa no mind once he decided she was not going to try and take his loot.  Her bedchamber was black as pitch. Sansa barred the door and fumbled through the dark to the window. When she ripped back the drapes, her breath caught in her throat.  The southern sky was aswirl with glowing, shifting colors, the reflections of the great fires that burned below. Baleful green tides moved against the bellies of the clouds, and pools of orange light spread out across the heavens. The reds and yellows of common flame warred against the emeralds and jades of wildfire, each color flaring and then fading, birthing armies of short-lived shadows to die again an instant later. Green dawns gave way to orange dusks in half a heartbeat. The air itself smelled burnt, the way a soup kettle sometimes smelled if it was left on the fire too long and all the soup boiled away. Embers drifted through the night air like swarms of fireflies.  Sansa backed away from the window, retreating toward the safety of her bed. I’ll go to sleep, she told herself, and when I wake it will be a new day, and the sky will be blue again. The fighting will be done and someone will tell me whether I’m to live or die.  Lady,  she whimpered softly, wondering if she would meet her wolf again when she was dead.  Then something stirred behind her, and a hand reached out of the dark and grabbed her wrist.  Sansa opened her mouth to scream, but another hand clamped down over her face, smothering her. His fingers were rough and callused, and sticky with blood.  Little bird. I knew you’d come.  The voice was a drunken rasp.  Outside, a swirling lance of jade light spit at the stars, filling the room with green glare. She saw him for a moment, all black and green, the blood on his face dark as tar, his eyes glowing like a dog’s in the sudden glare. Then the light faded and he was only a hulking darkness in a stained white cloak.   If you scream I’ll kill you. Believe that.  He took his hand from her mouth. Her breath was coming ragged. The Hound had a flagon of wine on her bedside table. He took a long pull.  Don’t you want to ask who’s winning the battle, little bird?    Who?  she said, too frightened to defy him.  The Hound laughed.  I only know who’s lost. Me.   He is drunker than I’ve ever seen him. He was sleeping in my bed. What does he want here?  What have you lost?    All.  The burnt half of his face was a mask of dried blood.  Bloody dwarf. Should have killed him. Years ago.    He’s dead, they say.    Dead? No. Bugger that. I don’t want him dead.  He cast the empty flagon aside.  I want him burned. If the gods are good, they’ll burn him, but I won’t be here to see. I’m going.    Going?  She tried to wriggle free, but his grasp was iron.   The little bird repeats whatever she hears. Going, yes.    Where will you go?    Away from here. Away from the fires. Go out the Iron Gate, I suppose. North somewhere, anywhere.    You won’t get out,  Sansa said.  The queen’s closed up Maegor’s, and the city gates are shut as well.    Not to me. I have the white cloak. And I have this.  He patted the pommel of his sword.  The man who tries to stop me is a dead man. Unless he’s on fire."
}