{
  "id": "9b2aabf7816389aec5a51f98a47aab416d373552",
  "text": " And to  him there  is no purpose higher  in the world as it now stands than the good of Gondor;   and the rule  of Gondor, my lord, is mine and no other man's, unless the king   should come again.'       'Unless  the  king  should  come  again?' said Gandalf. 'Well,  my lord  Steward,  it is  your task  to keep some  kingdom still against  that event,  which few now look to see. In that task you shall have all  the aid that you   are pleased to ask for.  But  I will say this: the rule of no realm is mine,  neither of Gondor nor any other, great or small.  But all worthy things that  are in peril as the world now stands,  those are my care. And for my part, I  shall  not wholly  fail of my task, though Gondor should perish, if anything  passes through this night that  can still grow fair or bear fruit and flower   again in days to come. For I also am a steward.  Did you not know?' And with  that he turned and strode from the hall with Pippin running at his side.       Gandalf  did not  look  at Pippin or  speak a word to him as they went.   ####-Their  guide brought them from  the doors  of  the hall, and  then  led them  across  the  Court  of the  Fountain into a lane  between  tall buildings of  stone. After  several turns  they came to a house close to the wall  of  the  citadel upon the north side, not far from the shoulder that linked the  hill  with  the mountain. Within, upon the first floor above the street, up a wide  carven  stair,  he showed  them to a fair room, light  and airy, with goodly   hangings of dull gold sheen unfigured. It  was sparely furnished, having but  a  small table,  two chairs and a  bench;  but  at  either side  ther e  were  curtained alcoves  and  well -clad beds  within with  vessels  and basins for   washing. There were three high narrow windows that looked northward over  the  great  curve of  Anduin, still shrouded in  mists, towards the Emyn Muil and  Rauros  far away.  Pippin had to climb on the bench to look out over the deep  stone sill.       'Are you angry with me, Gandalf?' he  said, as their guide went out and  closed the door. 'I did the best I could.'       'You did  indeed!' said Gandalf,  laughing suddenly; and  he  came  and  stood beside Pippin, putting his arm about the hobbit's shoulders and gazing  out  of the window.  Pippin glanced in  some  wonder  at the face now  close  beside his own, for the  sound of that laugh had been gay and merry.  Yet in   the wizard's  face he saw  at first only lines of care and sorrow; though as  he looked more intently he perceived that under all there was a great joy: a   fountain of mirth enough to set a kingdom laughing, were it to gush forth.       'Indeed you did your best,' said the wizard; 'and I hope that it may be  long  before you find yourself in such a tight corner again between two such  terrible old  men.  Still the Lord of Gondor  learned more from you than you   may have  guessed, Pippin. You  could not hide the fact that Bor omir did not  lead the Company from Moria, and that there was one among you of high  honour  who was coming  to Minas Tirith;  and that  he had a famous sword. Men think   much about the stories of  old  days in Gondor;  and Denethor has given long  thought  to the rhyme and to  the words  Isildur's  Bane, since Boromir went  away.       'He  is not as other  men  of  this  time,  Pippin, and whatever be his  descent  from  father  to son, by some chance the blood  of Westernesse runs  nearly true in him; as it does in his other son, Faramir, and yet did not in  Boromir whom he  loved best. He has long sight. He can perceive, if he bends   ####-his will thither, much of what is passing in the minds of men, even of those  that dwell far off. It is difficult to deceive him, and dangerous to try.       'Remember that! For you  are  now  sworn to his  service. I do not know  what put it into your head, or your heart, to do that. But it was well done.  I  did not hinder  it,  for  generous deed should  not  be  checked  by cold  counsel.  It  touched  his  heart,  as  well (may I  say it) as pleasing his  humour. And at least you are free  now  to move  about as  you will in Minas  Tirith - when you are not on  duty. For there is another side to it. You are  at his command; and he will not  forget. Be wary still!'       He fell silent and sighed. 'Well, no need to brood on what tomorrow may  bring. For  one thing, tomorrow will  be certain to bring  worse than today,  for many days  to  come. And there is nothing more that I can do to help it.  The board is set, and the pieces are moving. One piece that I greatly desire  to find is Faramir, now the heir of Denethor.  I do not think  that he is in  the City; but I have had no  time to gather news. I must go.  Pippin. I must   go to this lords' council and learn what I  can. But the Enemy has the move,  and he is about to open his full game.  And pawns are likely to see  as much   of it  as  any,  Peregrin son of Paladin,  soldier  of  Gondor."
}