{
  "id": "9bf89aac19f0c8e5b5e5eac7d545f7c4df85fb5a",
  "text": " Somebody had been in to tidy; the windows were open and sun was pouring inside. Harry could hear the buses rolling by in the unseen Muggle street behind him and the sound of the invisible crowd below in Diagon Alley. He caught sight of himself in the mirror over the basin.  \"It can't have been a death omen,\" he told his reflection defiantly. \"I was panicking when I saw that thing in Magnolia Crescent.... It was probably just a stray dog....\"  He raised his hand automatically and tried to make his hair lie flat  \"You're fighting a losing battle there, dear,\" said his mirror in a vvheezy voice.  As the days slipped by, Harry started looking wherever he went for a sign of Ron or Hermione. Plenty of Hogwarts students were arriving in Diagon Alley now, with the start of term so near. Harry met Seamus Finnigan and Dean Thomas, his fellow Gryffindors, in Quality Quidditch Supplies, where they too were ogling the Firebolt; he also ran into the real Neville Longbottom, a round-faced, forgetful boy, outside Flourish and Blotts. Harry didn't stop to chat; Neville appeared to have mislaid his booklist and was being told off by his very formidable-looking grandmother. Harry hoped she never found out that he'd pretended to be Neville while on the run from the Ministry of Magic.  Harry woke on the last day of the holidays, thinking that he would at least meet Ron and Hermione tomorrow, on the Hogwarts Express. He got up, dressed, went for a last look at the Firebolt, and was just wondering where he'd have lunch, when someone yelled his name and he turned.  \"Harry! HARRY!\"  They were there, both of them, sitting outside Florean Fortescue's Ice Cream Parlor -- Ron looking incredibly freckly, Her,,one very brown, both waving frantically at him.  \"Finally!\" said Ron, grinning at Harry as he sat down. \"We went to the Leaky Cauldron, but they said you'd left, and we went to Flourish and Blotts, and Madam Malkin's, and --\"  \"I got all my school stuff last week,\" Harry explained. \"And how come You knew I'm staying at the Leaky Cauldron?\" \"Dad,\" said Ron simply.  Mr. Weasley, who worked at the Ministry of Magic, would of course have heard the whole story of what had happened to Aunt Marge.  \"Did you really blow up your aunt, Harry?\" said Hermione in a very serious voice.  \"I didn't mean to,\" said Harry, while Ron roared with laughter. \"I just -- lost control.\"  \"It's not funny, Ron,\" said Hermione sharply. \"Honestly, I'm amazed Harry wasn't expelled.\"  \"So am I,\" admitted Harry. \"Forget expelled, I thought I was going to be arrested.\" He looked at Ron. \"Your dad doesn't know why Fudge let me off, does he?\"  \"Probably 'cause it's you, isn't it?\" shrugged Ron, still chuckling. \"Famous Harry Potter and all that. I'd hate to see what the Ministry'd do to me if I blew up an aunt. Mind you, they'd have to dig me up first, because Mum would've killed me. Anyway, you can ask Dad yourself this evening. We're staying at the Leaky Cauldron tonight too! So you can come to King's Cross with us tomorrow! Hermione's there as well!\"  Hermione nodded, beaming. \"Mum and Dad dropped me off this morning with all my Hogwarts things.\"  \"Excellent!\" said Harry happily. \"So, have you got all your new books and stuff?\"  \"Look at this,\" said Ron, pulling a long thin box out of a bag and opening it. \"Brand-new wand. Fourteen inches, willow, containing one unicorn tail-hair. And we've got all our books --\" He pointed at a large bag under his chair. \"What about those Monster Books, eh? The assistant nearly cried when we said we wanted two.\"   \"What's all that, Hermione?\" Harry asked, pointing at not one but three bulging bags in the chair next to her.  ,,Well, I'm taking more new subjects than you, aren't IF' said Hermione. \"Those are my books for Arithmancy, Care of Magical Creatures, Divination, the Study of Ancient Runes, Muggle Studies --\"  \"What are you doing Muggle Studies for?\" said Ron, rolling his eyes at Harry. \"You're Muggle- born! Your mum and dad are Muggles! You already know all about Muggles!\"  \"But it'll be fascinating to study them from the wizarding point of view,\" said Hermione earnestly.  \"Are you planning to eat or sleep at all this year, Hermione?\" asked Harry, while Ron sniggered. Hermione ignored them.  \"I've still got ten Galleons,\" she said, checking her purse. \"It's my birthday in September, and Mum and Dad gave me some money to get myself an early birthday present.\"  \"How about a nice book? said Ron innocently.  \"No, I don't think so,\" said Hermione composedly. \"I really want an owl. I mean, Harry's got Hedwig and you've got Errol --\"  \"I haven't,\" said Ron. \"Errol's a family owl. All I've got is Scabbers.\" He pulled his pet rat out of his pocket. \"And I want to get him checked over,\" he added, placing Scabbers on the table in front of them. \"I don't think Egypt agreed with him.\"  Scabbers was looking thinner than usual, and there was a definite droop to his whiskers.  \"There's a magical creature shop just over there,\" said Harry, who knew Diagon Alley very well by now."
}