{
  "id": "9cfb0faba1e3ffa9280f9ed37cd18050a90f736f",
  "text": " Perhaps, if we are lucky, some of you will see before the end of the class.\"  And so they began. Harry, at least, felt extremely foolish, staring blankly at the crystal ball, trying to keep his mind empty when thoughts such as \"this is stupid\" kept drifting across it. It didn't help that Ron kept breaking into silent giggles and Hermione kept tutting.  \"Seen anything yet?\" Harry asked them after a quarter of an hour's quiet crystal gazing.  \"Yeah, there's a burn on this table,\" said Ron, pointing. \"Someone's spilled their candle.\"  \"This is such a waste of time,\" Hermione hissed. \"I could be practicing something useful. I could be catching up on Cheering Charms --\"  Professor Trelawney rustled past.  \"Would anyone like me to help them interpret the shadowy portents within their Orb?\" she murmured over the clinking of her bangles.  I don't need help,\" Ron whispered. \"It's obvious what this means. There's going to be loads of fog tonight.\"  Both Harry and Hermione burst out laughing.  \"Now, really!\" said Professor Trelawney as everyone's heads turned in their direction. Parvati and Lavender were looking scandalized. \"You are disturbing the clairvoyant vibrations!\" She approached their table and peered into their crystal ball. Harry felt his heart sinking. He was sure he knew what was coming --  \"There is something here!\" Professor Trelawney whispered, lowerng her face to the ball, so that it was reflected twice in her huge glasses. \"Something moving... but what is it?\"  Harry was prepared to bet everything he owned, Including his Firebolt, that it wasn't good news, whatever it was. And sure enough --  \"My dear Professor Trelawney breathed, gazing up at Harry. \"It is here, plainer than ever before... my dear, stalking toward you, growing ever closer... the Gr --\"  \"Oh, for goodness' sake!\" said Hermione loudly. \"Not that ridiculous Grim again!\"  Professor Trelawney raised her enormous eyes to Hermione's face. Parvati whispered something to Lavender, and they both glared at Hermione too. Professor Trelawney stood up, surveying Hermione with unmistakable anger.  \"I am sorry to say that from the moment you have arrived in this class my dear, it has been apparent that you do not have what the noble art of Divination requires. Indeed, I don't remember ever meeting a student whose mind was so hopelessly mundane.\"  There was a moment's silence. Then --  \"Fine!\" said Hermione suddenly, getting up and cramming Unfogging the Future back into her bag. \"Fine!\" she repeated, swinging the bag over her shoulder and almost knocking Ron off his chair. \"I give up! I'm leaving!\"  And to the whole class's amazement, Hermione strode over to the trapdoor, kicked it open, and climbed down the ladder out of sight.  It took a few minutes for the class to settle down again. Professor Trelawney seemed to have forgotten all about the Grim. She turned abruptly from Harry and Ron's table, breathing rather heavily as she tugged her gauzy shawl more closely to her.  \"Ooooo!\" said Lavender suddenly, making everyone start. \"Ooooo, Professor Trelawney, I've just remembered! You saw her leaving, didn't you? Didn't you, Professor? 'Around Easter, one of our number will leave us forever!' You said it ages ago, Professor!\"  Professor Trelawney gave her a dewy smile.  \"Yes, my dear, I did indeed know that Miss Granger would be leaving us. One hopes, however, that one might have mistaken the Signs.... The Inner Eye can be a burden, you know...\"  Lavender and Parvati looked deeply impressed, and moved over so that Professor Trelawney could join their table instead.  \"Some day Hermione's having, eh?\" Ron muttered to Harry, looking awed.  \"Yeah...\"  Harry glanced into the crystal ball but saw nothing but swirling white mist. Had Professor Trelawney really seen the Grim again? Would he? The last thing he needed was another near-fatal accident, with the Quidditch final drawing ever nearer.  The Easter holidays were not exactly relaxing. The third years had never had so much homework. Neville Longbottom seemed close to a nervous collapse, and he wasn't the only one.  \"Call this a holiday!\" Seamus Finnigan roared at the common room one afternoon. \"The exams are ages away, what're they playing at?\"  But nobody had as much to do as Hermione. Even without Divination, she was taking more subjects than anybody else. She was usually last to leave the common room at night, first to arrive at the library the next morning; she had shadows like Lupin's under her eyes, and seemed constantly close to tears.  Ron had taken over responsibility for Buckbeak's appeal. When he wasn't doing his own work, he was poring over enormously thick volumes with names like The Handbook of Hippogriff Psychology and Fowl or Foul? A Study of Hippogriff Brutality. He was so absorbed, he even forgot to be horrible to Crookshanks.  Harry, meanwhile, had to fit in his homework around Quidditch practice every day, not to mention endless discussions of tactics with Wood. The Gryffindor-Slytherin match would take place on the first Saturday after the Easter holidays."
}