{
  "id": "9d6cde05ccfccff02b24d78e635c15e1cdcc7bdb",
  "text": " There at the bend it  was  cut deep through a crag of  old weathered  stone once long  ago vomited  from the  Mountain's  furnaces.  Panting under his load Sam turned the bend;  and even  as he did  so, out of  the corner of his  eye, he had a glimpse of something falling from the crag,  like a small piece of black stone that had toppled off as he passed.       A sudden weight smote him and he crashed forward, tearing the backs  of  his hands that still clasped his master's. Then  he knew what had  happened,   for above him as he lay he heard a hated voice.       'Wicked masster!' it hissed. 'Wicked masster cheats us; cheats Smjagol,  gollum. He musstn't go that  wa y. He  musstn't hurt  Preciouss. Give  it  to  Smjagol, yess, give it to us! Give it to uss!'       With a  violent heave Sam rose up.  At once  he drew his  sword; but he  could do nothing.  Gollum and Frodo were locked together. Gollum was tearing  at  his master,  trying to  get at the chain and the Ring. This was probably  the only thing  that could have roused the dying embers of Frodo's heart and   will:  an  attack,  an attempt to wrest his  treasure from him by force.  He  fought back with a sudden  fury  that  amazed Sam, and Gollum  also. Even so  things  might have  gone far  otherwise,  if  Gollum  himself  had  remained  unchanged;  but whatever dreadful paths, lonely and hungry and waterless, he  had trodden, driven by a devouring desire and a terrible fear, they had left   grievous marks on him. He was a lean, starved, haggard thing, all  bones and  tight-drawn sallow skin. A wild light flamed in his eyes, but his malice was  no longer matched by his old griping strength. Frodo flung him off and  rose  up quivering.       'Down,  down!' he gasped,  clutching his hand  to his  breast,  so that   ####-beneath  the cover  of his  leather shirt  he clasped  the Ring.  'Down  you   creeping  thing,  and out of  my path!  Your time is at an  end.  You cannot  betray me or slay me now.'       Then  suddenly, as  before under the eaves of the  Emyn Muil,  Sam  saw  these  two rivals  with other vision. A crouching shape, scarcely  more than  the shadow of a living thing, a creature now wholly ruined and defeated, yet   filled with a hideous lust and rage; and before it stood stern,  untouchable  now by pity, a figure robed  in white, but at its breast it held a  wheel of  fire. Out of the fire there spoke a commanding voice.       'Begone, and trouble me no more! If you touch me ever again,  you shall   be cast yourself into the Fire of Doom.'       The crouching  shape  backed away, terror in its blinking eyes, and yet  at the same time insatiable desire.       Then the vision  passed and Sam saw Frodo standing, hand on breast, his  breath coming in great gasps,  and Gollum at his feet, resting  on his knees  with his wide-splayed hands upon the ground.       'Look  out!' cried Sam. 'He'll spring!' He stepped forward, brandishing  his  sword. 'Quick, Master!' he gasped. 'Go on! Go on! No time to lose. I'll  deal with him. Go on!'       Frodo looked at him as if at one now far away. 'Yes, I must  go on,' he  said. 'Farewell, Sam!  This is the  end at last.  On  Mount  Doom doom shall  fall. Farewell!'  He  turned and went on,  walking slowly  but  erect u p the  climbing path.       'Now!' said Sam. 'At last  I can deal with you!' He leaped forward with  drawn blade ready for battle. But  Gollum did not spring. He fell  flat upon  the ground and whimpered.       'Don't kill us,'  he wept. 'Don't hurt us with  na ssty cruel steel! Let  us live,  yes,  live just a little longer. Lost lost!  We're lost. And  when  Precious goes we'll die, yes, die into the  dust.' He clawed up the ashes of  the path with his long fleshless fingers.  'Dusst!' he hissed.       Sam's hand wa vered. His mind was hot with wrath and the memory of evil.  It would be just to slay this treacherous, murderous creature, just and many  times deserved;  and also it  seemed the  only safe thing to do. But deep in  his heart there was something that restrained him: he could not strike  this  thing  lying  in the  dust, forlorn, ruinous,  utterly wretched. He himself,  though only for a little while, had borne the Ring, and now dimly he guessed  the  agony of  Gollum's  shrivelled  mind and body,  enslaved to tha t  Ring,   ####-unable  to find peace or relief ever in  life again. But Sam had no words to  express what he felt.       'Oh, curse you, you stinking thing!' he said. 'Go away! Be off! I don't   trust you, not as far as I could kick you; but be off. Or I  shall hurt you,  yes, with nasty cruel steel.'       Gollum got up on all fours, and backed away for several paces, and then  he turned, and as  Sam aimed a kick at him  he fled away down the  path. Sam  gave no  more heed  to him. He suddenly remembered his master. He looked   up  the  path and could not see him. As fast as he could he trudged up the road.  If he had looked back, he might have seen  not  far below Gollum turn again,  and then with a wild light of madness glaring in his eyes come,  swiftly but  warily, creeping on behind, a slinking shadow among the stones."
}