{
  "id": "9dca50054e997a0007cbea8691985b17cf797ed5",
  "text": "    A fool I may be, Stark… yet I’m still here, while your brother has been moldering in his frozen grave for some fourteen years now. If you are so eager to molder beside him, far be it from me to dissuade you, but I would rather not be included in the party, thank you very much.    You would be the last man I would willingly include in any party, Lord Baelish.    You wound me deeply.  Littlefinger placed a hand over his heart.  For my part, I always found you Starks a tiresome lot, but Cat seems to have become attached to you, for reasons I cannot comprehend. I shall try to keep you alive for her sake. A fool’s task, admittedly, but I could never refuse your wife anything.    I told Petyr our suspicions about Jon Arryn’s death,  Catelyn said.  He has promised to help you find the truth.   That was not news that Eddard Stark welcomed, but it was true enough that they needed help, and Littlefinger had been almost a brother to Cat once. It would not be the first time that Ned had been forced to make common cause with a man he despised.  Very well,  he said, thrusting the dagger into his belt.  You spoke of Varys. Does the eunuch know all of it?    Not from my lips,  Catelyn said.  You did not wed a fool, Eddard Stark. But Varys has ways of learning things that no man could know. He has some dark art, Ned, I swear it.    He has spies, that is well known,  Ned said, dismissive.   It is more than that,  Catelyn insisted.  Ser Rodrik spoke to Ser Aron Santagar in all secrecy, yet somehow the Spider knew of their conversation. I fear that man.   Littlefinger smiled.  Leave Lord Varys to me, sweet lady. If you will permit me a small obscenity—and where better for it—I hold the man’s balls in the palm of my hand.  He cupped his fingers, smiling.  Or would, if he were a man, or had any balls. You see, if the pie is opened, the birds begin to sing, and Varys would not like that. Were I you, I would worry more about the Lannisters and less about the eunuch.   Ned did not need Littlefinger to tell him that. He was thinking back to the day Arya had been found, to the look on the queen’s face when she said, We have a wolf, so soft and quiet. He was thinking of the boy Mycah, of Jon Arryn’s sudden death, of Bran’s fall, of old mad Aerys Targaryen dying on the floor of his throne room while his life’s blood dried on a golden blade.  My lady,  he said, turning to Catelyn,  there is nothing more you can do here. I want you to return to Winterfell at once. If there was one assassin, there could be others. Whoever ordered Bran’s death will learn soon enough that the boy still lives.    I had hoped to see the girls…  Catelyn said.   That would be most unwise,  Littlefinger put in.  The Red Keep is full of curious eyes, and children talk.    He speaks truly, my love,  Ned told her. He embraced her.  Take Ser Rodrik and ride for Winterfell. I will watch over the girls. Go home to our sons and keep them safe.    As you say, my lord.  Catelyn lifted her face, and Ned kissed her. Her maimed fingers clutched against his back with a desperate strength, as if to hold him safe forever in the shelter of her arms.   Would the lord and lady like the use of a bedchamber?  asked Littlefinger.  I should warn you, Stark, we usually charge for that sort of thing around here.    A moment alone, that’s all I ask,  Catelyn said.   Very well.  Littlefinger strolled to the door.  Don’t be too long. It is past time the Hand and I returned to the castle, before our absence is noted.   Catelyn went to him and took his hands in her own.  I will not forget the help you gave me, Petyr. When your men came for me, I did not know whether they were taking me to a friend or an enemy. I have found you more than a friend. I have found a brother I’d thought lost.   Petyr Baelish smiled.  I am desperately sentimental, sweet lady. Best not tell anyone. I have spent years convincing the court that I am wicked and cruel, and I should hate to see all that hard work go for naught.   Ned believed not a word of that, but he kept his voice polite as he said,  You have my thanks as well, Lord Baelish.    Oh, now there’s a treasure,  Littlefinger said, exiting.  When the door had closed behind him, Ned turned back to his wife.  Once you are home, send word to Helman Tallhart and Galbart Glover under my seal. They are to raise a hundred bowmen each and fortify Moat Cailin. Two hundred determined archers can hold the Neck against an army. Instruct Lord Manderly that he is to strengthen and repair all his defenses at White Harbor, and see that they are well manned. And from this day on, I want a careful watch kept over Theon Greyjoy. If there is war, we shall have sore need of his father’s fleet.    War?  The fear was plain on Catelyn’s face.   It will not come to that,  Ned promised her, praying it was true. He took her in his arms again.  The Lannisters are merciless in the face of weakness, as Aerys Targaryen learned to his sorrow, but they would not dare attack the north without all the power of the realm behind them, and that they shall not have."
}