{
  "id": "9e1370dc2fecc57859b667635f42b2680962ecac",
  "text": " He could see it still: a crown of winter roses, blue as frost.  Ned Stark reached out his hand to grasp the flowery crown, but beneath the pale blue petals the thorns lay hidden. He felt them clawing at his skin, sharp and cruel, saw the slow trickle of blood run down his fingers, and woke, trembling, in the dark.  Promise me, Ned, his sister had whispered from her bed of blood. She had loved the scent of winter roses.   Gods save me,  Ned wept.  I am going mad.   The gods did not deign to answer.  Each time the turnkey brought him water, he told himself another day had passed. At first he would beg the man for some word of his daughters and the world beyond his cell. Grunts and kicks were his only replies. Later, when the stomach cramps began, he begged for food instead. It made no matter; he was not fed. Perhaps the Lannisters meant for him to starve to death.  No,  he told himself. If Cersei had wanted him dead, he would have been cut down in the throne room with his men. She wanted him alive. Weak, desperate, yet alive. Catelyn held her brother; she dare not kill him or the Imp’s life would be forfeit as well.  From outside his cell came the rattle of iron chains. As the door creaked open, Ned put a hand to the damp wall and pushed himself toward the light. The glare of a torch made him squint.  Food,  he croaked.   Wine,  a voice answered. It was not the rat-faced man; this gaoler was stouter, shorter, though he wore the same leather half cape and spiked steel cap.  Drink, Lord Eddard.  He thrust a wineskin into Ned’s hands.  The voice was strangely familiar, yet it took Ned Stark a moment to place it.  Varys?  he said groggily when it came. He touched the man’s face.  I’m not… not dreaming this. You’re here.  The eunuch’s plump cheeks were covered with a dark stubble of beard. Ned felt the coarse hair with his fingers. Varys had transformed himself into a grizzled turnkey, reeking of sweat and sour wine.  How did you… what sort of magician are you?    A thirsty one,  Varys said.  Drink, my lord.   Ned’s hands fumbled at the skin.  Is this the same poison they gave Robert?    You wrong me,  Varys said sadly.  Truly, no one loves a eunuch. Give me the skin.  He drank, a trickle of red leaking from the corner of his plump mouth.  Not the equal of the vintage you offered me the night of the tourney, but no more poisonous than most,  he concluded, wiping his lips.  Here.   Ned tried a swallow.  Dregs.  He felt as though he were about to bring the wine back up.   All men must swallow the sour with the sweet. High lords and eunuchs alike. Your hour has come, my lord.    My daughters…    The younger girl escaped Ser Meryn and fled,  Varys told him.  I have not been able to find her. Nor have the Lannisters. A kindness, there. Our new king loves her not. Your older girl is still betrothed to Joffrey. Cersei keeps her close. She came to court a few days ago to plead that you be spared. A pity you couldn’t have been there, you would have been touched.  He leaned forward intently.  I trust you realize that you are a dead man, Lord Eddard?    The queen will not kill me,  Ned said. His head swam; the wine was strong, and it had been too long since he’d eaten.  Cat… Cat holds her brother…    The wrong brother,  Varys sighed.  And lost to her, in any case. She let the Imp slip through her fingers. I expect he is dead by now, somewhere in the Mountains of the Moon.    If that is true, slit my throat and have done with it.  He was dizzy from the wine, tired and heartsick.   Your blood is the last thing I desire.   Ned frowned.  When they slaughtered my guard, you stood beside the queen and watched, and said not a word.    And would again. I seem to recall that I was unarmed, unarmored, and surrounded by Lannister swords.  The eunuch looked at him curiously, tilting his head.  When I was a young boy, before I was cut, I traveled with a troupe of mummers through the Free Cities. They taught me that each man has a role to play, in life as well as mummery. So it is at court. The King’s Justice must be fearsome, the master of coin must be frugal, the Lord Commander of the Kingsguard must be valiant… and the master of whisperers must be sly and obsequious and without scruple. A courageous informer would be as useless as a cowardly knight.  He took the wineskin back and drank.  Ned studied the eunuch’s face, searching for truth beneath the mummer’s scars and false stubble. He tried some more wine. This time it went down easier.  Can you free me from this pit?    I could… but will I? No. Questions would be asked, and the answers would lead back to me.   Ned had expected no more.  You are blunt.    A eunuch has no honor, and a spider does not enjoy the luxury of scruples, my lord.    Would you at least consent to carry a message out for me?    That would depend on the message. I will gladly provide you with paper and ink, if you like. And when you have written what you will, I will take the letter and read it, and deliver it or not, as best serves my own ends."
}