{
  "id": "9e2e5cbed9e5930e04059c01234af004c50e443e",
  "text": "  My lord Hand,  the old man said, bowing as deeply as he could without falling,  there has been another bird from Castle Black. Mayhaps we could consult privily?    There’s no need for that.  Lord Tywin waved Grand Maester Pycelle to a seat.  Tyrion may stay.   Oooooh, may I? He rubbed his nose, and waited.  Pycelle cleared his throat, which involved a deal of coughing and hawking.  The letter is from the same Bowen Marsh who sent the last. The castellan. He writes that Lord Mormont has sent word of wildlings moving south in vast numbers.    The lands beyond the Wall cannot support vast numbers,  said Lord Tywin firmly.  This warning is not new.    This last is, my lord. Mormont sent a bird from the haunted forest, to report that he was under attack. More ravens have returned since, but none with letters. This Bowen Marsh fears Lord Mormont slain, with all his strength.   Tyrion had rather liked old Jeor Mormont, with his gruff manner and talking bird.  Is this certain?  he asked.   It is not,  Pycelle admitted,  but none of Mormont’s men have returned as yet. Marsh fears the wildlings have killed them, and that the Wall itself may be attacked next.  He fumbled in his robe and found the paper.  Here is his letter, my lord, a plea to all five kings. He wants men, as many men as we can send him.    Five kings?  His father was annoyed.  There is one king in Westeros. Those fools in black might try and remember that if they wish His Grace to heed them. When you reply, tell him that Renly is dead and the others are traitors and pretenders.    No doubt they will be glad to learn it. The Wall is a world apart, and news oft reaches them late.  Pycelle bobbed his head up and down.  What shall I tell Marsh concerning the men he begs for? Shall we convene the council…    There is no need. The Night’s Watch is a pack of thieves, killers, and baseborn churls, but it occurs to me that they could prove otherwise, given proper discipline. If Mormont is indeed dead, the black brothers must choose a new Lord Commander.   Pycelle gave Tyrion a sly glance.  An excellent thought, my lord. I know the very man. Janos Slynt.   Tyrion liked that notion not at all.  The black brothers choose their own commander,  he reminded them.  Lord Slynt is new to the Wall. I know, I sent him there. Why should they pick him over a dozen more senior men?    Because,  his father said, in a tone that suggested Tyrion was quite the simpleton,  if they do not vote as they are told, their Wall will melt before it sees another man.   Yes, that would work. Tyrion hitched forward.  Janos Slynt is the wrong man, Father. We’d do better with the commander of the Shadow Tower. Or Eastwatch-by-the-Sea.    The commander of the Shadow Tower is a Mallister of Seagard. Eastwatch is held by an ironman.  Neither would serve his purposes, Lord Tywin’s tone said clear enough.   Janos Slynt is a butcher’s son,  Tyrion reminded his father forcefully.  You yourself told me—    I recall what I told you. Castle Black is not Harrenhal, however. The Night’s Watch is not the king’s council. There is a tool for every task, and a task for every tool.   Tyrion’s anger flashed.  Lord Janos is a hollow suit of armor who will sell himself to the highest bidder.    I count that a point in his favor. Who is like to bid higher than us?  He turned to Pycelle.  Send a raven. Write that King Joffrey was deeply saddened to hear of Lord Commander Mormont’s death, but regrets that he can spare no men just now, whilst so many rebels and usurpers remain in the field. Suggest that matters might be quite different once the throne is secure… provided the king has full confidence in the leadership of the Watch. In closing, ask Marsh to pass along His Grace’s fondest regards to his faithful friend and servant, Lord Janos Slynt.    Yes, my lord.  Pycelle bobbed his withered head once more.  I shall write as the Hand commands. With great pleasure.   I should have trimmed his head, not his beard, Tyrion reflected. And Slynt should have gone for a swim with his dear friend Allar Deem. At least he had not made the same foolish mistake with Symon Silver Tongue. See there, Father? he wanted to shout. See how fast I learn my lessons?      Samwell   Up in the loft a woman was giving birth noisily, while below a man lay dying by the fire. Samwell Tarly could not say which frightened him more.  They’d covered poor Bannen with a pile of furs and stoked the fire high, yet all he could say was,  I’m cold. Please. I’m so cold.  Sam was trying to feed him onion broth, but he could not swallow. The broth dribbled over his lips and down his chin as fast as Sam could spoon it in.   That one’s dead.  Craster eyed the man with indifference as he worried at a sausage.  Be kinder to stick a knife in his chest than that spoon down his throat, you ask me.    I don’t recall as we did.  Giant was no more than five feet tall—his true name was Bedwyck—but a fierce little man for all that.  Slayer, did you ask Craster for his counsel?   Sam cringed at the name, but shook his head."
}