{
  "id": "9f0635bf99eff738aebbc55664837b3444ad03e9",
  "text": "  Truth be told, none of my blood was actually shed, although it was a close thing once or twice. Morrec and Jyck were killed.    I suppose you will be wanting some new men.    Don’t trouble yourself, Father, I’ve acquired a few of my own.  He tried a swallow of the ale. It was brown and yeasty, so thick you could almost chew it. Very fine, in truth. A pity his father had hanged the innkeep.  How is your war going?   His uncle answered.  Well enough, for the nonce. Ser Edmure had scattered small troops of men along his borders to stop our raiding, and your lord father and I were able to destroy most of them piecemeal before they could regroup.    Your brother has been covering himself with glory,  his father said.  He smashed the Lords Vance and Piper at the Golden Tooth, and met the massed power of the Tullys under the walls of Riverrun. The lords of the Trident have been put to rout. Ser Edmure Tully was taken captive, with many of his knights and bannermen. Lord Blackwood led a few survivors back to Riverrun, where Jaime has them under siege. The rest fled to their own strongholds.    Your father and I have been marching on each in turn,  Ser Kevan said.  With Lord Blackwood gone, Raventree fell at once, and Lady Whent yielded Harrenhal for want of men to defend it. Ser Gregor burnt out the Pipers and the Brackens…    Leaving you unopposed?  Tyrion said.   Not wholly,  Ser Kevan said.  The Mallisters still hold Seagard and Walder Frey is marshaling his levies at the Twins.    No matter,  Lord Tywin said.  Frey only takes the field when the scent of victory is in the air, and all he smells now is ruin. And Jason Mallister lacks the strength to fight alone. Once Jaime takes Riverrun, they will both be quick enough to bend the knee. Unless the Starks and the Arryns come forth to oppose us, this war is good as won.    I would not fret overmuch about the Arryns if I were you,  Tyrion said.  The Starks are another matter. Lord Eddard—    —is our hostage,  his father said.  He will lead no armies while he rots in a dungeon under the Red Keep.    No,  Ser Kevan agreed,  but his son has called the banners and sits at Moat Cailin with a strong host around him.    No sword is strong until it’s been tempered,  Lord Tywin declared.  The Stark boy is a child. No doubt he likes the sound of warhorns well enough, and the sight of his banners fluttering in the wind, but in the end it comes down to butcher’s work. I doubt he has the stomach for it.   Things had gotten interesting while he’d been away, Tyrion reflected.  And what is our fearless monarch doing whilst all this ‘butcher’s work’ is being done?  he wondered.  How has my lovely and persuasive sister gotten Robert to agree to the imprisonment of his dear friend Ned?    Robert Baratheon is dead,  his father told him.  Your nephew reigns in King’s Landing.   That did take Tyrion aback.  My sister, you mean.  He took another gulp of ale. The realm would be a much different place with Cersei ruling in place of her husband.   If you have a mind to make yourself of use, I will give you a command,  his father said.  Marq Piper and Karyl Vance are loose in our rear, raiding our lands across the Red Fork.   Tyrion made a tsking sound.  The gall of them, fighting back. Ordinarily I’d be glad to punish such rudeness, Father, but the truth is, I have pressing business elsewhere.    Do you?  Lord Tywin did not seem awed.  We also have a pair of Ned Stark’s afterthoughts making a nuisance of themselves by harassing my foraging parties. Beric Dondarrion, some young lordling with delusions of valor. He has that fat jape of a priest with him, the one who likes to set his sword on fire. Do you think you might be able to deal with them as you scamper off? Without making too much a botch of it?   Tyrion wiped his mouth with the back of his hand and smiled.  Father, it warms my heart to think that you might entrust me with… what, twenty men? Fifty? Are you sure you can spare so many? Well, no matter. If I should come across Thoros and Lord Beric, I shall spank them both.  He climbed down from his chair and waddled to the sideboard, where a wheel of veined white cheese sat surrounded by fruit.  First, though, I have some promises of my own to keep,  he said as he sliced off a wedge.  I shall require three thousand helms and as many hauberks, plus swords, pikes, steel spearheads, maces, battleaxes, gauntlets, gorgets, greaves, breastplates, wagons to carry all this—   The door behind him opened with a crash, so violently that Tyrion almost dropped his cheese. Ser Kevan leapt up swearing as the captain of the guard went flying across the room to smash against the hearth. As he tumbled down into the cold ashes, his lion helm askew, Shagga snapped the man’s sword in two over a knee thick as a tree trunk, threw down the pieces, and lumbered into the common room. He was preceded by his stench, riper than the cheese and overpowering in the closed space.  Little redcape,  he snarled,  when next you bare steel on Shagga son of Dolf, I will chop off your manhood and roast it in the fire."
}