{
  "id": "9f090f9e092c0d7b4fcb851d12c61de5010eb02b",
  "text": "  \"There's a light on in Hagrid's window,\" Harry said suddenly.  Ron looked at his watch.  \"If we hurried, we could go down and see him. It's still quite early...\"  I don't know,\" Hermione said slowly, and Harry saw her glance at him.  \"I'm allowed to walk across the grounds, \" he said Pointedly. \"Sirius Black hasn't got past the dementors yet, has he?\"  So they put their things away and headed out of the portrait hole, glad to meet nobody on their way to the front doors, as they weren't entirely sure they were supposed to be out.  The grass was still wet and looked almost black in the twilight. When they reached Hagrid's hut, they knocked, and a voice growled, \"C'min.\"  Hagrid was sitting in his shirtsleeves at his scrubbed wooden table; his boarhound, Fang, had his head in Hagrid's lap. One look told them that Hagrid had been drinking a lot; there was a pewter tankard almost as big as a bucket in front of him, and he seemed to be having difficulty getting them into focus.  \"'Spect it's a record,\" he said thickly, when he recognized them. \"Don' reckon they've ever had a teacher who lasted on'y a day before.\"  \"You haven't been fired, Hagrid!\" gasped Hermione.  \"Not yet,\" said Hagrid miserably, taking a huge gulp of whatever was in the tankard. \"But's only a matter o' time, i' n't it, after Malfoy...\"  \"How is he?\" said Ron as they all sat down. \"It wasn't serious, was it?\"  \"Madam Pomfrey fixed him best she could,\" said Hagrid dully, \"but he's sayin' it's still agony... covered in bandages... moanin'..  \"He's faking it, \" said Harry at once. \"Madam Pomfrey can mend anything. She regrew half my bones last year. Trust Malfoy to milk it for all it's worth.\"  \"School gov'nors have bin told, o' course,\" said Hagrid miseribly. \"They reckon I started too big. Shoulda left hippogriffs fer later... done flobberworms or summat.... Jus' thought itdmake a good firs' lessons all my fault....\"  \"It's all Malfoy's fault, Hagrid!\" said Hermione earnestly.  \"We're witnesses,\" said Harry. \"You said hippogriffs attack if you insult them. It's Malfoy's problem that he wasn't listening. We'll tell Dumbledore what really happened.\"  \"Yeah, don't worry, Hagrid, we'll back you up,\" said Ron.  Tears leaked out of the crinkled corners of Hagrid's beetle-black eyes. He grabbed both Harry and Ron and pulled them into a bone-breaking hug.  \"I think you've had enough to drink, Hagrid,\" said Hermione firmly. She took the tankard from the table and went outside to empty it.  \"At, maybe she's right,\" said Hagrid, letting go of Harry and Ron, who both staggered away, rubbing their ribs. Hagrid heaved himself out of his chair and followed Hermione unsteadily outside. They heard a loud splash.  \"What's he done?\" said Harry nervously as Hermione came back in with the empty tankard.  \"Stuck his head in the water barrel,\" said Hermione, putting the tankard away.  Hagrid came back, his long hair and beard sopping wet, wiping the water out of his eyes.  \"That's better,\" he said, shaking his head like a dog and drenching them all. \"Listen, it was good of yeh ter come an' see me, I really --  Hagrid stopped dead, staring at Harry as though he'd only just realized he was there.  \"WHAT D'YEH THINK YOU'RE DOIN', EH?\" he roared, so suddenly that they jumped a foot in the air. \"YEH'RE NOT TO GO WANDERIN' AROUND AFTER DARK, HARRY! AN, YOU TWO! LETTIN' HIM!\"  Hagrid strode over to Harry, grabbed his arm, and pulled him to the door.  \"C'mon!\" Hagrid said angrily. \"I'm takin' yer all back up ter school, an' don' let me catch yeh walkin' down ter see me after dark again. I'm not worth that!\"  CHAPTER SEVEN  THE BOGGART IN THE WARDROBE  Malfoy didn't reappear in classes until late on Thursday morning, when the Slytherins and Gryffindors were halfway through double Potions. He swaggered into the dungeon, his right arm covered in bandages and bound up in a sling, acting, in Harry's opinion, as though he were the heroic survivor of some dreadful battle.  \"How is it, Draco?\" simpered Pansy Parkinson. \"Does it hurt much?\"  \"Yeah,\" said Malfoy, putting on a brave sort of grimace. But Harry saw him wink at Crabbe and Goyle when Pansy had looked away.  \"Settle down, settle down,\" said Professor Snape idly.  Harry and Ron scowled at each other; Snape wouldn't have said \"settle down\" if they'd walked in late, he'd have given them detention. But Malfoy had always been able to get away with anything in Snape's classes; Snape was head of Slytherin House, and generality favored his own students above all others.  They were making a new potion today, a Shrinking Solution. Malfoy set up his cauldron right next to Harry and Ron, so that they were preparing their ingredients on the same table.  \"Sir,\" Malfoy called, \"sir, I'll need help cutting up these daisy roots, because of my arm --\"  \"Weasley, cut up Malfoy's roots for him,\" said Snape without looking up.  Ron went brick red.  \"There's nothing wrong with your arm,\" he hissed at Malfoy.  Malfoy smirked across the table.  \"Weasley, you heard Professor Snape; cut up these roots."
}