{
  "id": "9f51da5c663e025fb0a75b0554fe0036ffa77b00",
  "text": "  Have you perchance taken Lord Tywin, Theon?    No,  Greyjoy answered, brought up short.   Until you do, this war is far from done.   Robb raised his head and pushed his hair back out of his eyes.  My mother is right. We still have Riverrun.       DAENERYS  The flies circled Khal Drogo slowly, their wings buzzing, a low thrum at the edge of hearing that filled Dany with dread.  The sun was high and pitiless. Heat shimmered in waves off the stony outcrops of low hills. A thin finger of sweat trickled slowly between Dany’s swollen breasts. The only sounds were the steady clop of their horses’ hooves, the rhythmic tingle of the bells in Drogo’s hair, and the distant voices behind them.  Dany watched the flies.  They were as large as bees, gross, purplish, glistening. The Dothraki called them bloodflies. They lived in marshes and stagnant pools, sucked blood from man and horse alike, and laid their eggs in the dead and dying. Drogo hated them. Whenever one came near him, his hand would shoot out quick as a striking snake to close around it. She had never seen him miss. He would hold the fly inside his huge fist long enough to hear its frantic buzzing. Then his fingers would tighten, and when he opened his hand again, the fly would be only a red smear on his palm.  Now one crept across the rump of his stallion, and the horse gave an angry flick of its tail to brush it away. The others flitted about Drogo, closer and closer. The khal did not react. His eyes were fixed on distant brown hills, the reins loose in his hands. Beneath his painted vest, a plaster of fig leaves and caked blue mud covered the wound on his breast. The herbwomen had made it for him. Mirri Maz Duur’s poultice had itched and burned, and he had torn it off six days ago, cursing her for a maegi. The mud plaster was more soothing, and the herbwomen made him poppy wine as well. He’d been drinking it heavily these past three days; when it was not poppy wine, it was fermented mare’s milk or pepper beer.  Yet he scarcely touched his food, and he thrashed and groaned in the night. Dany could see how drawn his face had become. Rhaego was restless in her belly, kicking like a stallion, yet even that did not stir Drogo’s interest as it had. Every morning her eyes found fresh lines of pain on his face when he woke from his troubled sleep. And now this silence. It was making her afraid. Since they had mounted up at dawn, he had said not a word. When she spoke, she got no answer but a grunt, and not even that much since midday.  One of the bloodflies landed on the bare skin of the khal’s shoulder. Another, circling, touched down on his neck and crept up toward his mouth. Khal Drogo swayed in the saddle, bells ringing, as his stallion kept onward at a steady walking pace.  Dany pressed her heels into her silver and rode closer.  My lord,  she said softly.  Drogo. My sun-and-stars.   He did not seem to hear. The bloodfly crawled up under his drooping mustache and settled on his cheek, in the crease beside his nose. Dany gasped,  Drogo.  Clumsily she reached over and touched his arm.  Khal Drogo reeled in the saddle, tilted slowly, and fell heavily from his horse. The flies scattered for a heartbeat, and then circled back to settle on him where he lay.   No,  Dany said, reining up. Heedless of her belly for once, she scrambled off her silver and ran to him.  The grass beneath him was brown and dry. Drogo cried out in pain as Dany knelt beside him. His breath rattled harshly in his throat, and he looked at her without recognition.  My horse,  he gasped. Dany brushed the flies off his chest, smashing one as he would have. His skin burned beneath her fingers.  The khal’s bloodriders had been following just behind them. She heard Haggo shout as they galloped up. Cohollo vaulted from his horse.  Blood of my blood,  he said as he dropped to his knees. The other two kept to their mounts.   No,  Khal Drogo groaned, struggling in Dany’s arms.  Must ride. Ride. No.    He fell from his horse,  Haggo said, staring down. His broad face was impassive, but his voice was leaden.   You must not say that,  Dany told him.  We have ridden far enough today. We will camp here.    Here?  Haggo looked around them. The land was brown and sere, inhospitable.  This is no camping ground.    It is not for a woman to bid us halt,  said Qotho,  not even a khaleesi.    We camp here,  Dany repeated.  Haggo, tell them Khal Drogo commanded the halt. If any ask why, say to them that my time is near and I could not continue. Cohollo, bring up the slaves, they must put up the khal’s tent at once. Qotho—    You do not command me, Khaleesi,  Qotho said.   Find Mirri Maz Duur,  she told him. The godswife would be walking among the other Lamb Men, in the long column of slaves.  Bring her to me, with her chest.   Qotho glared down at her, his eyes hard as flint.  The maegi.  He spat.  This I will not do.    You will,  Dany said,  or when Drogo wakes, he will hear why you defied me.   Furious, Qotho wheeled his stallion around and galloped off in anger… but Dany knew he would return with Mirri Maz Duur, however little he might like it."
}