{
  "id": "9fde509d16b0918a3b8cb5b0ccbf461c93733d49",
  "text": "  Insisting that he needed to sleep, and almost flattening the little Creevey brothers as they attempted to waylay him at the foot of the stairs, Harry managed to shake everyone off and climb up to the dormitory as fast as he could. To his great relief, he found Ron was lying on his bed in the otherwise empty dormitory, still fully dressed.  He looked up when Harry slammed the door behind him. \"Where've you been?\" Harry said. \"Oh hello,\" said Ron. He was grinning, but it was a very odd, strained sort of grin.  Harry suddenly became aware that he was still wearing the scarlet Gryffindor banner that Lee had tied around him.  He hastened to take it off, but it was knotted very tightly.  Ron lay on the bed without moving, watching Harry struggle to remove it. \"So,\" he said, when Harry had finally removed the banner and thrown it into a corner. \"Congratulations.\" \"What d'you mean, congratulations?\" said Harry, staring at Ron.  There was definitely something wrong with the way Ron was smiling:  It was more like a grimace. \"Well. . . no one else got across the Age Line,\" said Ron.  \"Not even Fred and George. What did you use - the Invisibility Cloak?\" \"The Invisibility Cloak wouldn't have got me over that line,\" said Harry slowly. \"Oh right,\" said Ron. \"I thought you might've told me if it was the cloak. . . because it would've covered both of us, wouldn't it? But you found another way, did you?\" \"Listen,\" said Harry, \"I didn't put my name in that goblet.  Someone else must've done it.\" Ron raised his eyebrows. \"What would they do that for?\" \"I dunno,\" said Harry. He felt it would sound very melodramatic to say, \"To kill me.\" Ron's eyebrows rose so high that they were in danger of disappearing into his hair. \"It's okay, you know, you can tell me the truth,\" he said.  \"If you don't want everyone else to know, fine, but I don't know why you're bothering to lie, you didn't get into trouble for it, did you?  That friend of the Fat Lady's, that Violet, she's already told us all Dumbledore's letting you enter.  A thousand Galleons prize money, eh?  And you don't have to do end-of-year tests either. . .\" \"I didn't put my name in that goblet!\" said Harry, starting to feel angry. \"Yeah, okay,\" said Ron, in exactly the same sceptical tone as Cedric.  \"Only you said this morning you'd have done it last night, and no one would've seen you.. . . I'm not stupid, you know.\" \"You're doing a really good impression of it,\" Harry snapped. \"Yeah?\" said Ron, and there was no trace of a grin, forced or otherwise, on his face now.  \"You want to get to bed, Harry.  I expect you'll need to be up early tomorrow for a photo-call or something.\" He wrenched the hangings shut around his four-poster, leaving Harry standing there by the door, staring at the dark red velvet curtains, now hiding one of the few people he had been sure would believe him.  CHAPTER EIGHTEEN - THE WEIGHING OF THE WANDS    When Harry woke up on Sunday morning, it took him a moment to remember why he felt so miserable and worried.  Then the memory of the previous night rolled over him.  He sat up and ripped back the curtains of his own four-poster, intending to talk to Ron, to force Ron to believe him - only to find that Ron's bed was empty; he had obviously gone down to breakfast.   Harry dressed and went down the spiral staircase into the common room. The moment he appeared, the people who had already finished breakfast broke into applause again.  The prospect of going down into the Great Hall and facing the rest of the Gryffindors, all treating him like some sort of hero, was not inviting; it was that, however, or stay here and allow himself to be cornered by the Creevey brothers, who were both beckoning frantically to him to join them. He walked resolutely over to the portrait hole, pushed it open, climbed out of it, and found himself face-to-face with Hermione.   \"Hello,\" she said, holding up a stack of toast, which she was carrying in a napkin.  \"I brought you this. . . . Want to go for a walk?\" \"Good idea,\" said Harry gratefully. They went downstairs, crossed the entrance hall quickly without looking in at the Great Hall, and were soon striding across the lawn toward the lake, where the Durmstrang ship was moored, reflected blackly in the water.  It was a chilly morning, and they kept moving, munching their toast, as Harry told Hermione exactly what had happened after he had left the Gryffindor table the night before.  To his immense relief, Hermione accepted his story without question. \"Well, of course I knew you hadn't entered yourself,\" she said when he'd finished telling her about the scene in the chamber off the Hall.  \"The look on your face when Dumbledore read out your name!  But the question is, who did put it in?  Because Moody's right, Harry... I don't think any student could have done it. . . they'd never be able to fool the Goblet, or get over Dumbledore's -\" \"Have you seen Ron?\" Harry interrupted. Hermione hesitated. \"Erm. . . yes. . . he was at breakfast,\" she said."
}