{
  "id": "9fe8509e2e0c8c1a3242cae362113991e1930109",
  "text": "  I’m a wolf. I’ll howl.   Alone, she slid through the shadow of the Tower of Ghosts. She walked fast, to keep ahead of her fear, and it felt as though Syrio Forel walked beside her, and Yoren, and Jaqen H’ghar, and Jon Snow. She had not taken the sword Gendry had brought her, not yet. For this the dagger would be better. It was good and sharp. This postern was the least of Harrenhal’s gates, a narrow door of stout oak studded with iron nails, set in an angle of the wall beneath a defensive tower. Only one man was set to guard it, but she knew there would be sentries up in that tower as well, and others nearby walking the walls. Whatever happened, she must be quiet as a shadow. He must not call out. A few scattered raindrops had begun to fall. She felt one land on her brow and run slowly down her nose.  She made no effort to hide, but approached the guard openly, as if Lord Bolton himself had sent her. He watched her come, curious as to what might bring a page here at this black hour. When she got closer, she saw that he was a northman, very tall and thin, huddled in a ragged fur cloak. That was bad. She might have been able to trick a Frey or one of the Brave Companions, but the Dreadfort men had served Roose Bolton their whole life, and they knew him better than she did. If I tell him I am Arya Stark and command him to stand aside… No, she dare not. He was a northman, but not a Winterfell man. He belonged to Roose Bolton.  When she reached him she pushed back her cloak so he would see the flayed man on her breast.  Lord Bolton sent me.    At this hour? Why for?   She could see the gleam of steel under the fur, and she did not know if she was strong enough to drive the point of the dagger through chainmail. His throat, it must be his throat, but he’s too tall, I’ll never reach it. For a moment she did not know what to say. For a moment she was a little girl again, and scared, and the rain on her face felt like tears.   He told me to give all his guards a silver piece, for their good service.  The words seemed to come out of nowhere.   Silver, you say?  He did not believe her, but he wanted to; silver was silver, after all.  Give it over, then.   Her fingers dug down beneath her tunic and came out clutching the coin Jaqen had given her. In the dark the iron could pass for tarnished silver. She held it out… and let it slip through her fingers.  Cursing her softly, the man went to a knee to grope for the coin in the dirt and there was his neck right in front of her. Arya slid her dagger out and drew it across his throat, as smooth as summer silk. His blood covered her hands in a hot gush and he tried to shout but there was blood in his mouth as well.   Valar morghulis,  she whispered as he died.  When he stopped moving, she picked up the coin. Outside the walls of Harrenhal, a wolf howled long and loud. She lifted the bar, set it aside, and pulled open the heavy oak door. By the time Hot Pie and Gendry came up with the horses, the rain was falling hard.  You killed him!  Hot Pie gasped.   What did you think I would do?  Her fingers were sticky with blood, and the smell was making her mare skittish. It’s no matter, she thought, swinging up into the saddle. The rain will wash them clean again.      SANSA  The throne room was a sea of jewels, furs, and bright fabrics. Lords and ladies filled the back of the hall and stood beneath the high windows, jostling like fishwives on a dock.  The denizens of Joffrey’s court had striven to outdo each other today. Jalabhar Xho was all in feathers, a plumage so fantastic and extravagant that he seemed like to take flight. The High Septon’s crystal crown fired rainbows through the air every time he moved his head. At the council table, Queen Cersei shimmered in a cloth-of-gold gown slashed in burgundy velvet, while beside her Varys fussed and simpered in a lilac brocade. Moon Boy and Ser Dontos wore new suits of motley, clean as a spring morning. Even Lady Tanda and her daughters looked pretty in matching gowns of turquoise silk and vair, and Lord Gyles was coughing into a square of scarlet silk trimmed with golden lace. King Joffrey sat above them all, amongst the blades and barbs of the Iron Throne. He was in crimson samite, his black mantle studded with rubies, on his head his heavy golden crown.  Squirming through a press of knights, squires, and rich townfolk, Sansa reached the front of the gallery just as a blast of trumpets announced the entry of Lord Tywin Lannister.  He rode his warhorse down the length of the hall and dismounted before the Iron Throne. Sansa had never seen such armor; all burnished red steel, inlaid with golden scrollwork and ornamentation. His rondels were sunbursts, the roaring lion that crowned his helm had ruby eyes, and a lioness on each shoulder fastened a cloth-of-gold cloak so long and heavy that it draped the hindquarters of his charger. Even the horse’s armor was gilded, and his bardings were shimmering crimson silk emblazoned with the lion of Lannister."
}