{
  "id": "a00eda19b89808a9f7d37329687c8e3c2f461805",
  "text": "  I promised my sister I would treat Tommen as she treated Alayaya,  he remembered aloud. He felt as though he might retch.  How can I scourge an eight-year-old boy?  But if I don’t, Cersei wins.   You don’t have Tommen,  Bronn said bluntly.  Once she learned that Ironhand was dead, the queen sent the Kettleblacks after him, and no one at Rosby had the balls to say them nay.   Another blow; yet a relief as well, he must admit it. He was fond of Tommen.  The Kettleblacks were supposed to be ours,  he reminded Bronn with more than a touch of irritation.   They were, so long as I could give them two of your pennies for every one they had from the queen, but now she’s raised the stakes. Osney and Osfryd were made knights after the battle, same as me. Gods know what for, no one saw them do any fighting.   My hirelings betray me, my friends are scourged and shamed, and I lie here rotting, Tyrion thought. I thought I won the bloody battle. Is this what triumph tastes like?  Is it true that Stannis was put to rout by Renly’s ghost?   Bronn smiled thinly.  From the winch towers, all we saw was banners in the mud and men throwing down their spears to run, but there’s hundreds in the pot shops and brothels who’ll tell you how they saw Lord Renly kill this one or that one. Most of Stannis’s host had been Renly’s to start, and they went right back over at the sight of him in that shiny green armor.   After all his planning, after the sortie and the bridge of ships, after getting his face slashed in two, Tyrion had been eclipsed by a dead man. If indeed Renly is dead. Something else he would need to look into.  How did Stannis escape?    His Lyseni kept their galleys out in the bay, beyond your chain. When the battle turned bad, they put in along the bay shore and took off as many as they could. Men were killing each other to get aboard, toward the end.    What of Robb Stark, what has he been doing?    There’s some of his wolves burning their way down toward Duskendale. Your father’s sending this Lord Tarly to sort them out. I’d half a mind to join him. It’s said he’s a good soldier, and openhanded with the plunder.   The thought of losing Bronn was the final straw.  No. Your place is here. You’re the captain of the Hand’s guard.    You’re not the Hand,  Bronn reminded him sharply.  Your father is, and he’s got his own bloody guard.    What happened to all the men you hired for me?    Some died at the winch towers. That uncle of yours, Ser Kevan, he paid the rest of us and tossed us out.    How good of him,  Tyrion said acidly.  Does that mean you’ve lost your taste for gold?    Not bloody likely.    Good,  said Tyrion,  because as it happens, I still have need of you. What do you know of Ser Mandon Moore?   Bronn laughed.  I know he’s bloody well drowned.    I owe him a great debt, but how to pay it?  He touched his face, feeling the scar.  I know precious little of the man, if truth be told.    He had eyes like a fish and he wore a white cloak. What else do you need to know?    Everything,  said Tyrion,  for a start.  What he wanted was proof that Ser Mandon had been Cersei’s, but he dare not say so aloud. In the Red Keep a man did best to hold his tongue. There were rats in the walls, and little birds who talked too much, and spiders.  Help me up,  he said, struggling with the bedclothes.  It’s time I paid a call on my father, and past time I let myself be seen again.    Such a pretty sight,  mocked Bronn.   What’s half a nose, on a face like mine? But speaking of pretty, is Margaery Tyrell in King’s Landing yet?    No. She’s coming, though, and the city’s mad with love for her. The Tyrells have been carting food up from Highgarden and giving it away in her name. Hundreds of wayns each day. There’s thousands of Tyrell men swaggering about with little golden roses sewn on their doublets, and not a one is buying his own wine. Wife, widow, or whore, the women are all giving up their virtue to every peach-fuzz boy with a gold rose on his teat.   They spit on me, and buy drinks for the Tyrells. Tyrion slid from the bed to the floor. His legs turned wobbly beneath him, the room spun, and he had to grasp Bronn’s arm to keep from pitching headlong into the rushes.  Pod!  he shouted.  Podrick Payne! Where in the seven hells are you?  Pain gnawed at him like a toothless dog. Tyrion hated weakness, especially his own. It shamed him, and shame made him angry.  Pod, get in here!   The boy came running. When he saw Tyrion standing and clutching Bronn’s arm, he gaped at them.  My lord. You stood. Is that… do you… do you need wine? Dreamwine? Should I get the maester? He said you must stay. Abed, I mean.    I have stayed abed too long. Bring me some clean garb.    Garb?   How the boy could be so clearheaded and resourceful in battle and so confused at all other times Tyrion could never comprehend.  Clothing,  he repeated.  Tunic, doublet, breeches, hose. For me. To dress in. So I can leave this bloody cell.   It took all three of them to clothe him."
}