{
  "id": "a06bc3a4951fad3d3973a40a36a3ad2a3c6f446b",
  "text": "  Well, come in!  Make  yourselves at home!'       Mr. Butterbur had at  any rate not  changed his manner  of talking, and  still  seemed to live in his old breathless bustle. And yet there was hardly  anybody about, and all  was  quiet; from the  Common  Room  there came a  low  murmur of no more than two or three voices. And seen  closer in the light of  two  candles that he lit and carried before them the landlord's face  looked  rather wrinkled and careworn.       He led them down the passage to the parlour that they  had used on that  strange  night more  than  a  year  ago;  and  they  followed him,  a little  disquieted,  for it seemed  plain  to them  that old Barliman was putting  a   brave  face on some trouble.  Things were not what they  had been.  But they  said nothing, and waited.       As  they expected Mr. Butterbur came to the parlour after supper to see  if  all had been to their liking. As indeed  it had: no change for the worse  had  yet come upon the beer  or the victuals at The Pony at any rate. 'Now I  won't  make  so  bold as  to  suggest you should  come  to the  Common  Room  tonight,' said Butterbur. 'You'll be tired; and there isn't many folk  there  this evening, anyway. But if you could spare me half an  hour before you  go  to  your beds, I would dearly like to have some talk with you, quiet-like by  ourselves.'       'That  is  just what we should like,  too,'  said Gandalf. 'We  are not  tired.  We have been taking things easy.  We were wet, cold and hungry,  but  all  that you  have  cured.  Come, sit down!  And if you have any pipe-weed,  we'll bless you.'   ####-     'Well, if you'd called  for anything else, I'd have been happier,' said  Butterbur. 'That's just a thing that we're  short of, seeing how  we've only  got  what we  grow ourselves,  and  that's not enough. There's none to be had  from the Shire these days. But I'll do what I can.'       When he came back he brought them enough to last them for a day or two,  a wad of uncut leaf.  'Southlinch,' he said, 'and the best  we have; but not  the match of Southfarthing,  as I've always said though I'm all  for Bree in  most matters, begging your pardon.'       They put him  in a large chair by the wood-fire, and Gandalf sat on the  other side of the hearth, and the  hobbits  in low chairs between them;  and  then they talked for many times half an hour, and exchanged all such news as  Mr.  Butterbur wished to hear or give. Most of the  things which they had to   tell were a mere  wonder and bewilderment to  their host, and far beyond his  vision; and  they  brought forth few  comments other than: 'You  don't  say;  often repeated in defiance of the evidence of Mr. Butterbur's own ears. 'You   don't say, Mr. Baggins, or is it Mr. Underhill? I'm getting so mixed up. You   don't  say,  Master  Gandalf! Well I never!  Who'd  have  thought it in  our  times!'       But he did say much on  his  own account. Things were far from well, he  would say. Business was  not even fair, it was downright bad.  'No one comes  nigh Bree  now from Outside,'  he said. 'And the inside  folks, they stay at  home mostly and keep their doors barred. It all comes of those newcomers and  gangrels that began coming up the Greenway  last year,  as you may remember;  but  more came later. Some were just poor bodies running away from  trouble;  but most were bad men, full o' thievery and  mischief. And there was trouble  right here  in Bree, bad trouble. Why, we had a real set-to, and there  were  some folk killed, killed dead! If you'll believe me.'       'I will indeed,' said Gandalf. 'How many?'       'Three  and two,' said  Butterbur,  referring to the big  folk  and the  little. 'There was poor  Mat Heathertoes, and  Rowlie Appledore,  and little  Tom Pickthorn from over the Hill; and  Willie Banks from up-away, and one of  the Underhills from Staddle: all good fellows, and they're missed. And Harry  Goatleaf that used to be on the West -gate, and that Bill Ferny, they came in  on the strangers' side, and they've gone off  with them; and it's my  belief  they let them in. On the night of the  fight, I  mean. And that was after we  showed them the gates and  pushed them out: before the year's end, that was;  and the fight was early in the New Year, after the heavy snow we had.   ####-     'And now they're gone for robbers and live outside, hiding in the woods  beyond Archet, and out  in the wilds north-away. It's like a  bit of the bad  old  times tales tell of, I say. It  isn't safe  on the road and nobody goes  far, and folk lock up  early. We have to keep watchers all round  the  fence  and put a lot of men on the gates at nights.'       'Well, no one troubled us,' said Pippin, 'and we came along slowly, and  kept no watch. We thought we'd left all trouble behind us.'       'Ah, that you haven't, Master,  more's the pity,'  said Butterbur. 'But  it's  no wonder they left  you a lone. They wouldn't go for  armed folk, with  swords and helmets and  shields  and all."
}