{
  "id": "a08fee1df7cba88b1badee414195f14534cd0bdd",
  "text": " Yoren said I should keep my mouth shut.  Bigger,  she lied.  They have swords too, big longswords, and they showed me how to kill people who bother me.    I was talking, not bothering.  Hot Pie went off and let her alone and Arya curled up on her pallet. She could hear the crying girl from the far side of the haven. I wish she’d just be quiet. Why does she have to cry all the time?  She must have slept, though she never remembered closing her eyes. She dreamed a wolf was howling, and the sound was so terrible that it woke her at once. Arya sat up on her pallet with her heart thumping.  Hot Pie, wake up.  She scrambled to her feet.  Woth, Gendry, didn’t you hear?  She pulled on a boot.  All around her, men and boys stirred and crawled from their pallets.  What’s wrong?  Hot Pie asked.  Hear what?  Gendry wanted to know.  Arry had a bad dream,  someone else said.   No, I heard it,  she insisted.  A wolf.    Arry has wolves in his head,  sneered Lommy.  Let them howl,  Gerren said,  they’re out there, we’re in here.  Woth agreed.  Never saw no wolf could storm a holdfast.  Hot Pie was saying,  I never heard nothing.    It was a wolf,  she shouted at them as she yanked on her second boot.  Something’s wrong, someone’s coming, get up!   Before they could hoot her down again, the sound came shuddering through the night—only it was no wolf this time, it was Kurz blowing his hunting horn, sounding danger. In a heartbeat, all of them were pulling on clothes and snatching for whatever weapons they owned. Arya ran for the gate as the horn sounded again. As she dashed past the barn, Biter threw himself furiously against his chains, and Jaqen H’ghar called out from the back of their wagon.  Boy! Sweet boy! Is it war, red war? Boy, free us. A man can fight. Boy!  She ignored him and plunged on. By then she could hear horses and shouts beyond the wall.  She scrambled up onto the catwalk. The parapets were a bit too high and Arya a bit too short; she had to wedge her toes into the holes between the stones to see over. For a moment she thought the town was full of lantern bugs. Then she realized they were men with torches, galloping between the houses. She saw a roof go up, flames licking at the belly of the night with hot orange tongues as the thatch caught. Another followed, and then another, and soon there were fires blazing everywhere.  Gendry climbed up beside her, wearing his helm.  How many?   Arya tried to count, but they were riding too fast, torches spinning through the air as they flung them.  A hundred,  she said.  Two hundred, I don’t know.  Over the roar of the flames, she could hear shouts.  They’ll come for us soon.    There,  Gendry said, pointing.  A column of riders moved between the burning buildings toward the holdfast. Firelight glittered off metal helms and spattered their mail and plate with orange and yellow highlights. One carried a banner on a tall lance. She thought it was red, but it was hard to tell in the night, with the fires roaring all around. Everything seemed red or black or orange.  The fire leapt from one house to another. Arya saw a tree consumed, the flames creeping across its branches until it stood against the night in robes of living orange. Everyone was awake now, manning the catwalks or struggling with the frightened animals below. She could hear Yoren shouting commands. Something bumped against her leg, and she glanced down to discover the crying girl clutching her.  Get away!  She wrenched her leg free.  What are you doing up here? Run and hide someplace, you stupid.  She shoved the girl away.  The riders reined up before the gates.  You in the holdfast!  shouted a knight in a tall helm with a spiked crest.  Open, in the name of the king!    Aye, and which king is that?  old Reysen yelled back down, before Woth cuffed him into silence.  Yoren climbed the battlement beside the gate, his faded black cloak tied to a wooden staff.  You men hold down here!  he shouted.  The townfolk’s gone.    And who are you, old man? One of Lord Beric’s cravens?  called the knight in the spiked helm.  If that fat fool Thoros is in there, ask him how he likes these fires.    Got no such man here,  Yoren shouted back.  Only some lads for the Watch. Got no part o’ your war.  He hoisted up the staff, so they could all see the color of his cloak.  Have a look. That’s black, for the Night’s Watch.    Or black for House Dondarrion,  called the man who bore the enemy banner. Arya could see its colors more clearly now in the light of the burning town: a golden lion on red.  Lord Beric’s sigil is a purple lightning bolt on a black field.   Suddenly Arya remembered the morning she had thrown the orange in Sansa’s face and gotten juice all over her stupid ivory silk gown. There had been some southron lordling at the tourney, her sister’s stupid friend Jeyne was in love with him. He had a lightning bolt on his shield and her father had sent him out to behead the Hound’s brother. It seemed a thousand years ago now, something that had happened to a different person in a different life… to Arya Stark the Hand’s daughter, not Arry the orphan boy."
}