{
  "id": "a0b399704f237d0d5bdfb9a311928b3d2748c5a9",
  "text": ".. \". . . and now Hagrid's just shown me what's coming in the first task, and it's dragons, Sirius, and I'm a goner,\" he finished desperately. Sirius looked at him, eyes full of concern, eyes that had not yet lost the look that Azkaban had given them - that deadened, haunted look  He had let Harry talk himself into silence without interruption, but now he said, \"Dragons we can deal with, Harry, but we'll get to that in a minute - I haven't got long here. . . I've broken into a wizarding house to use the fire, but they could be back at any time.  There are things I need to warn you about.\" \"What?\"  said Harry, feeling his spirits slip a further few notches.. . . Surely there could be nothing worse than dragons coming? \"Karkaroff,\" said Sirius.  \"Harry, he was a Death Eater.  You know what Death Eaters are, don't you?\" \"Yes - he - what?\" \"He was caught, he was in Azkaban with me, but he got released.  I'd bet everything that's why Dumbledore wanted an Auror at Hogwarts this year - to keep an eye on him. Moody caught Karkaroff.  Put him into Azkaban in the first place.\" \"Karkaroff got released?\"  Harry said slowly - his brain seemed to be struggling to absorb yet another piece of shocking information.  \"Why did they release him?\" \"He did a deal with the Ministry of Magic,\" said Sirius bitterly.  \"He said he'd seen the error of his ways, and then he named names. . . he put a load of other people into Azkaban in his place. . . . He's not very popular in there, I can tell you.  And since he got out, from what I can tell, he's been teaching the Dark Arts to every student who passes through that school of his.  So watch out for the Durmstrang champion as well.\" \"Okay,\" said Harry slowly.  \"But. . . are you saying Karkaroff put my name in the goblet?  Because if he did, he's a really good actor.  He seemed furious about it.  He wanted to stop me from competing.\" \"We know he's a good actor,\" said Sirius, \"because he convinced the Ministry of Magic to set him free, didn't he?  Now, I've been keeping an eye on the Daily Prophet, Harry..\" \"- you and the rest of the world,\" said Harry bitterly.  \"- and reading between the lines of that Skeeter woman's article last month, Moody was attacked the night before he started at Hogwarts.  Yes, I know she says it was another false alarm,\" Sirius said hastily, seeing Harry about to speak, \"but I don't think so, somehow.  I think someone tried to stop him from getting to Hogwarts.  I think someone knew their job would be a lot more difficult with him around.  And no one's going to look into it too closely; Mad-Eye's heard intruders a bit too often.  But that doesn't mean he can't still spot the real thing.  Moody was the best Auror the Ministry ever had.\" \"So. . . what are you saying?\"  said Harry slowly.  \"Karkaroff's trying to kill me?  But - why?\" Sirius hesitated. \"I've been nearing some very strange things,\" he said slowly.  \"The Death Eaters seem to be a bit more active than usual lately.  They showed themselves at the Quidditch World Cup, didn't they?  Someone set off the Dark Mark.. . and then - did you hear about that Ministry of Magic witch who's gone missing?\" \"Bertha Jorkins?\" said Harry. \"Exactly. . . she disappeared in Albania, and that's definitely where Voldemort was rumored to be last. . . and she would have known the Triwizard Tournament was coming up, wouldn't she?\" \"Yeah, but. . . it's not very likely she'd have walked straight into Voldemort, is it?\" said Harry. \"Listen, I knew Bertha Jorkins,\" said Sirius grimly.  \"She was at Hogwarts when I was, a few years above your dad and me.  And she was an idiot.  Very nosy, but no brains, none at all.  It's not a good combination, Harry.  I'd say she'd be very easy to lure into a trap.\" \"So. . . so Voldemort could have found out about the tournament?\"  said Harry.  \"Is that what you mean?  You think Karkaroff might be here on his orders?\" \"I don't know,\" said Sirius slowly, \"I just don't know...Karkaroff doesn't strike me as the type who'd go back to Voldemort unless he knew Voldemort was powerful enough to protect him.  But whoever put your name in that goblet did it for a reason, and I can't help thinking the tournament would be a very good way to attack you and make it hook like an accident.\" \"Looks hike a really good plan from where I'm standing,\" said Harry grinning bleaky. \"They'll just have to stand back and let the dragons do their stuff.\" \"Right - these dragons,\" said Sirius, speaking very quickly now.  \"There's a way, Harry. Don't be tempted to try a Stunning Spell - dragons are strong and too powerfully magical to be knocked out by a single Stunner, you need about half a dozen wizards at a time to overcome a dragon -\" \"Yeah, I know, I just saw,\" said Harry. \"But you can do it alone,\" said Sirius.  \"There is away, and a simple spell's all you need. Just -\" But Harry held up a hand to silence him, his heart suddenly pounding as though it would burst.  He could hear footsteps coming down the spiral staircase behind him."
}