{
  "id": "a0f046bb0b99950b5bee0f97045912d18056c48e",
  "text": " Davos loved the water. He slept best when he had a deck rocking beneath him, and the sighing of the wind in his rigging was a sweeter sound to him than any a singer could make with his harp strings. Even the sea brought him no comfort tonight, though.  I can smell the fear on you, ser knight,  the red woman said softly.   Someone once told me the night is dark and full of terrors. And tonight I am no knight. Tonight I am Davos the smuggler again. Would that you were an onion.   She laughed.  Is it me you fear? Or what we do?    What you do. I’ll have no part of it.    Your hand raised the sail. Your hand holds the tiller.   Silent, Davos tended to his course. The shore was a snarl of rocks, so he was taking them well out across the bay. He would wait for the tide to turn before coming about. Storm’s End dwindled behind them, but the red woman seemed unconcerned.  Are you a good man, Davos Seaworth?  she asked.  Would a good man be doing this?  I am a man,  he said.  I am kind to my wife, but I have known other women. I have tried to be a father to my sons, to help make them a place in this world. Aye, I’ve broken laws, but I never felt evil until tonight. I would say my parts are mixed, m’lady. Good and bad.    A grey man,  she said.  Neither white nor black, but partaking of both. Is that what you are, Ser Davos?    What if I am? It seems to me that most men are grey.    If half of an onion is black with rot, it is a rotten onion. A man is good, or he is evil.   The fires behind them had melted into one vague glow against the black sky, and the land was almost out of sight. It was time to come about.  Watch your head, my lady.  He pushed on the tiller, and the small boat threw up a curl of black water as she turned. Melisandre leaned under the swinging yard, one hand on the gunwale, calm as ever. Wood creaked, canvas cracked, and water splashed, so loudly a man might swear the castle was sure to hear. Davos knew better. The endless crash of wave on rock was the only sound that ever penetrated the massive seaward walls of Storm’s End, and that but faintly.  A rippling wake spread out behind as they swung back toward the shore.  You speak of men and onions,  Davos said to Melisandre.  What of women? Is it not the same for them? Are you good or evil, my lady?   That made her chuckle.  Oh, good. I am a knight of sorts myself, sweet ser. A champion of light and life.    Yet you mean to kill a man tonight,  he said.  As you killed Maester Cressen.    Your maester poisoned himself. He meant to poison me, but I was protected by a greater power and he was not.    And Renly Baratheon? Who was it who killed him?   Her head turned. Beneath the shadow of the cowl, her eyes burned like pale red candle flames.  Not I.    Liar.  Davos was certain now.  Melisandre laughed again.  You are lost in darkness and confusion, Ser Davos.    And a good thing.  Davos gestured at the distant lights flickering along the walls of Storm’s End.  Feel how cold the wind is? The guards will huddle close to those torches. A little warmth, a little light, they’re a comfort on a night like this. Yet that will blind them, so they will not see us pass.  I hope.  The god of darkness protects us now, my lady. Even you.   The flames of her eyes seemed to burn a little brighter at that.  Speak not that name, ser. Lest you draw his black eye upon us. He protects no man, I promise you. He is the enemy of all that lives. It is the torches that hide us, you have said so yourself. Fire. The bright gift of the Lord of Light.    Have it your way.    His way, rather.   The wind was shifting, Davos could feel it, see it in the way the black canvas rippled. He reached for the halyards.  Help me bring in the sail. I’ll row us the rest of the way.   Together they tied off the sail as the boat rocked beneath them. As Davos unshipped the oars and slid them into the choppy black water, he said,  Who rowed you to Renly?    There was no need,  she said.  He was unprotected. But here… this Storm’s End is an old place. There are spells woven into the stones. Dark walls that no shadow can pass—ancient, forgotten, yet still in place.    Shadow?  Davos felt his flesh prickling.  A shadow is a thing of darkness.    You are more ignorant than a child, ser knight. There are no shadows in the dark. Shadows are the servants of light, the children of fire. The brightest flame casts the darkest shadows.   Frowning, Davos hushed her then. They were coming close to shore once more, and voices carried across the water. He rowed, the faint sound of his oars lost in the rhythm of the waves. The seaward side of Storm’s End perched upon a pale white cliff, the chalky stone sloping up steeply to half again the height of the massive curtain wall. A mouth yawned in the cliff, and it was that Davos steered for, as he had sixteen years before. The tunnel opened on a cavern under the castle, where the storm lords of old had built their landing.  The passage was navigable only during high tide, and was never less than treacherous, but his smuggler’s skills had not deserted him."
}