{
  "id": "a114fa13a7786bf3d4ae68f7f06a4985dfaa3c05",
  "text": "  \"You're going to take Malfoy's advice instead of ours?\" said Ron furiously. \"Listen... you know what Pettigrew's mother got back after Black had finished with him? Dad told me -- the Order of Merlin, First Class, and Pettigrew's finger in a box. That was the biggest bit of him they could find. Black's a madman, Harry, and he's dangerous --\"  \"Malfoy's dad must have told him,\" said Harry, ignoring Ron. \"He was right in Voldemort's inner circle --\"  \"Say You-Know-Who, will you?\" interjected Ron angrily.  \"-- so obviously, the Malfoys knew Black was working for Voldemort --\"  \"-- and Malfoy'd love to see you blown into about a million pieces, like Pettigrew! Get a grip. Malfoy's just hoping you'll get Yourself killed before he has to play you at Quidditch.\"  \"Harry, please,\" said Hermione, her eyes now shining with tears, \"Please be sensible. Black did a terrible, terrible thing, but d-don't Put Yourself in danger, it's what Black wants.... Oh, Harry, you'd be Playing right into Black's hands if you went looking for him. Your mum and dad wouldn't want you to get hurt, would they? They'd never want you to go looking for Black!\"  \"I'll never know what they'd have wanted, because thanks to Black, I've never spoken to them,\" said Harry shortly.  There was a silence in which Crookshanks stretched luxuriously flexing his claws. Ron's pocket quivered.  \"Look,\" said Ron, obviously casting around for a change of subject, \"it's the holidays! It's nearly Christmas! Let's -- let's go down and see Hagrid. We haven't visited him for ages!\"  \"No!\" said Hermione quickly. \"Harry isn't supposed to leave the castle, Ron --\"  \"Yeah, let's go,\" said Harry, sitting up, \"and I can ask him how come he never mentioned Black when he told me all about my parents!\"  Further discussion of Sirius Black plainly wasn't what Ron had had in mind.  \"Or we could have a game of chess, he said hastily, \"or Gobstones. Percy left a set --\"  \"No, let's visit Hagrid,\" said Harry firmly.  So they got their cloaks from their dormitories and set off through the portrait hole (\"Stand and fight, you yellow-bellied mongrels!\"), down through the empty castle and out through the oak front doors.  They made their way slowly down the lawn, making a shallow trench in the glittering, powdery snow, their socks and the hems of their cloaks soaked and freezing. The Forbidden Forest looked as though it had been enchanted, each tree smattered with silver, and Hagrid's cabin looked like an iced cake.  Ron knocked, but there was no answer.  \"He's not out, is he?\" said Hermione, who was shivering under her cloak.  Ron had his ear to the door.  \"There's a weird noise,\" he said. \"Listen -- is that Fang?\"  Harry and Hermione put their ears to the door too. From inside the cabin came a series of low, throbbing moans.  \"Think we'd better go and get someone?\" said Ron nervously.  \"Hagrid!\" called Harry, thumping the door. \"Hagrid, are you in there.  There was a sound of heavy footsteps, then the door creaked open. Hagrid stood there with his eyes red and swollen, tears splashing down the front of his leather vest.  \"YWve heard?\" he bellowed, and he flung himself onto Harry's neck.  Hagrid being at least twice the size of a normal man, this was no laughing matter. Harry, about to collapse under Hagrid's weight, was rescued by Ron and Hermione, who each seized Hagrid under an arm and heaved him back into the cabin. Hagrid allowed himself to be steered into a chair and slumped over the table, sobbing uncontrollably, his face glazed with tears that dripped down into his tangled beard.  \"Hagrid, what is it?\" said Hermione, aghast.  Harry spotted an official-looking letter lying open on the table.  \"What's this, Hagrid?\"  Hagrid's sobs redoubled, but he shoved the letter toward Harry, who Picked it up and read aloud:  Dear Mr. Hagrid,  Further to our inquiry into the attack by a hippogriff on a student in your class, we have accepted the assurances of Professor Dumbledore that you bear no responsibility for the regrettable incident.  \"Well, that's okay then, Hagrid!\" said Ron, clapping Hagrid oil the shoulder. But Hagrid continued to sob, and waved one of his gigantic hands, inviting Harry to read on.  However, we must register our concern about the hippogriff in question. We have decided to uphold the official complaint of Mr. Lucius Malfoy, and this matter will therefore be taken to the Committee for the Disposal of Dangerous Creatures. The hearing will take place on April 20th, and we ask you to present yourself and your hippogriff at the Committee's offices in London on that date. In the meantime, the hippogriff should be kept tethered and isolated. Yours in fellowship...  There followed a list of the school governors.  \"Oh,\" said Ron. \"But you said Buckbeak isn't a bad hippogriff, Hagrid. I bet he'll get off  \"Yeh don' know them gargoyles at the Committee fer the Disposal o' Dangerous Creatures!\" choked Hagrid, wiping his eyes on his sleeve. \"They've got it in fer interestin' creatures!\"  A sudden sound from the corner of Hagrid's cabin made Harry, Ron, and Hermione whip around."
}