{
  "id": "a15c0b1e15cbe684929c323ed2eced4f3fa6cff5",
  "text": " He smelled roasting meats, and heard the sound of laughter and the blare of heralds’ trumpets. A great tourney was about to commence, and champions from all over the land had come to contest it. The king himself was there, with his son the dragon prince. The White Swords had come, to welcome a new brother to their ranks. The storm lord was on hand, and the rose lord as well. The great lion of the rock had quarreled with the king and stayed away, but many of his bannermen and knights attended all the same. The crannogman had never seen such pageantry, and knew he might never see the like again. Part of him wanted nothing so much as to be part of it.   Bran knew that feeling well enough. When he’d been little, all he had ever dreamed of was being a knight. But that had been before he fell and lost his legs.   The daughter of the great castle reigned as queen of love and beauty when the tourney opened. Five champions had sworn to defend her crown; her four brothers of Harrenhal, and her famous uncle, a white knight of the Kingsguard.    Was she a fair maid?    She was,  said Meera, hopping over a stone,  but there were others fairer still. One was the wife of the dragon prince, who’d brought a dozen lady companions to attend her. The knights all begged them for favors to tie about their lances.    This isn’t going to be one of those love stories, is it?  Bran asked suspiciously.  Hodor doesn’t like those so much.    Hodor,  said Hodor agreeably.   He likes the stories where the knights fight monsters.    Sometimes the knights are the monsters, Bran. The little crannogman was walking across the field, enjoying the warm spring day and harming none, when he was set upon by three squires. They were none older than fifteen, yet even so they were bigger than him, all three. This was their world, as they saw it, and he had no right to be there. They snatched away his spear and knocked him to the ground, cursing him for a frogeater.    Were they Walders?  It sounded like something Little Walder Frey might have done.   None offered a name, but he marked their faces well so he could revenge himself upon them later. They shoved him down every time he tried to rise, and kicked him when he curled up on the ground. But then they heard a roar. ‘That’s my father’s man you’re kicking,’ howled the she-wolf.    A wolf on four legs, or two?    Two,  said Meera.  The she-wolf laid into the squires with a tourney sword, scattering them all. The crannogman was bruised and bloodied, so she took him back to her lair to clean his cuts and bind them up with linen. There he met her pack brothers: the wild wolf who led them, the quiet wolf beside him, and the pup who was youngest of the four.   That evening there was to be a feast in Harrenhal, to mark the opening of the tourney, and the she-wolf insisted that the lad attend. He was of high birth, with as much a right to a place on the bench as any other man. She was not easy to refuse, this wolf maid, so he let the young pup find him garb suitable to a king’s feast, and went up to the great castle.   Under Harren’s roof he ate and drank with the wolves, and many of their sworn swords besides, barrowdown men and moose and bears and mermen. The dragon prince sang a song so sad it made the wolf maid sniffle, but when her pup brother teased her for crying she poured wine over his head. A black brother spoke, asking the knights to join the Night’s Watch. The storm lord drank down the knight of skulls and kisses in a wine-cup war. The crannogman saw a maid with laughing purple eyes dance with a white sword, a red snake, and the lord of griffins, and lastly with the quiet wolf… but only after the wild wolf spoke to her on behalf of a brother too shy to leave his bench.   Amidst all this merriment, the little crannogman spied the three squires who’d attacked him. One served a pitchfork knight, one a porcupine, while the last attended a knight with two towers on his surcoat, a sigil all crannogmen know well.    The Freys,  said Bran.  The Freys of the Crossing.    Then, as now,  she agreed.  The wolf maid saw them too, and pointed them out to her brothers. ‘I could find you a horse, and some armor that might fit,’ the pup offered. The little crannogman thanked him, but gave no answer. His heart was torn. Crannogmen are smaller than most, but just as proud. The lad was no knight, no more than any of his people. We sit a boat more often than a horse, and our hands are made for oars, not lances. Much as he wished to have his vengeance, he feared he would only make a fool of himself and shame his people. The quiet wolf had offered the little crannogman a place in his tent that night, but before he slept he knelt on the lakeshore, looking across the water to where the Isle of Faces would be, and said a prayer to the old gods of north and Neck…    You never heard this tale from your father?  asked Jojen.   It was Old Nan who told the stories. Meera, go on, you can’t stop there.    Hodor must have felt the same."
}