{
  "id": "a183600d7dbeb50b261e4234ad5c03b2af75e96c",
  "text": " \"And I  name  you  elf-friend  and  blessed. May  your  shadow  never  grow  less  (or  stealing  would be too easy)! Farewell!\"  Then  the  elves  turned  towards  the  Forest,  and  Bilbo  started  on  his  long  road  home.  He had many hardships and adventures before he got back. The Wild was still  the Wild, and there were many other things in it in those days besides goblins; but  he  was  well  guided  and  well  guarded-the  wizard  was  with  him,  and  Beorn  for  much  of  the way-and  he was  never  in  great danger again. Anyway by mid-winter  Gandalf  and Bilbo had  come  all  the way back,  along both  edges of  the Forest,  to  the  doors  of Beorn's  house;  and  there  for  a while  they  both  stayed. Yule-tide was  warm  and  merry  there;  and  men  came  from  far  and  wide  to  feast  at  Beorn's  bidding.  The  goblins  of  the  Misty  Mountains  were  now  few  and  terrified,  and  hidden  in  the deepest holes  they could  find; and  the Wargs had vanished  from  the  woods,  so  that men went  abroad without  fear. Beorn  indeed became  a great  chief  afterwards  in  those  regions  and  ruled  a wide  land between  the mountains  and  the  wood; and it is said that for many generations the men of his line had the power of  taking bear's shape, and some were grim men and bad, but most were in heart like  Beorn,  if  less  in  size  and  strength.  In  their  day  the  last  goblins were  hunted  from  the  Misty  Mountains  and  a  new  peace  came  over  the  edge  of  the  Wild.  It  was  spring,  and  a  fair  one  with  mild  weathers  and  a  bright  sun,  before  Bilbo  and  Gandalf  took  their  leave  at  last  of Beorn,  and  though  he  longed  for  home. Bilbo  left with regret, for the flowers of the gardens of Beorn were m springtime no less  marvellous  than  in high summer. At  last  they came up  the  long road, and reached  the  very  pass  where  the  goblins  had  captured  them before. But  they came  to  that  high  point  at morning,  and  looking  backward  they  saw  a  white  sun  shining  over  the  out-stretched  lands.  There  behind  lay  Mirkwood,  blue  in  the  distance,  and  darkly green at the nearer edge even in the spring. There far away was the Lonely  Mountain  on  the  edge  of  eyesight.  On  its  highest  peak  snow  yet  unmelted  was  gleaming pale.  \"So  comes  snow  after  fire,  and  even  dragons  have  their  ending!\"  said  Bilbo,  and he  turned his back on his adventure. The Tookish part was getting very tired,  and  the  Baggins  was  daily  getting  stronger.  \"I  wish  now  only  to  be  in  my  own  arm-chair!\" he said.   ####-<h4>Chapter 19</h4> <br>   The Last Stage     It was on May the First that the two came back at last to the brink of the valley  of  Rivendell,  where  stood  the  Last  (or  the  First)  Homely  House.  Again  it  was  evening,  their  ponies were  tired,  especially  the  one  that  carried  the  baggage;  and  they all felt in need of rest. As they rode down the steep path, Bilbo heard the elves  still  singing  in  the  trees,  as  if  they  had  not  stopped  since  he  left;  and  as  soon  as  their riders came down into the lower glades of the wood they burst into a song of  much the same kind as before. This is something like it:     The dragon is withered,  His bones are now crumbled;  His armour is shivered,  His splendour is humbled!  Though sword shall be rusted,  And throne and crown perish   With strength that men trusted  And wealth that they cherish,  Here grass is still growing,  And leaves are yet swinging,  The white water flowing,  And elves are yet singing  Come! Tra-la-la-lally!  Come back to the valley!    The stars are far brighter  Than gems without measure,  The moon is far whiter  Than silver in treasure:  The fire is more shining  On hearth in the gloaming  Than gold won by mining,  So why go a -roaming?  O! Tra-la-la-lally  Come back to the Valley.     O! Where are you going,   ####-So late in returning?  The river is flowing,  The stars are all burning!  O! Whither so laden,  So sad and so dreary?  Here elf and elf-maiden  Now welcome the weary  With Tra-la-la-lally  Come back to the Va lley,   Tra-la-la-lally  Fa-la-la-lally  Fa-la!     Then  the  elves  of  the  valley  came  out  and  greeted  them  and  led  them  across  the  water  to  the  house  of  Elrond.  There  a  warm  welcome  was  made  them,  and  there  were  many  eager  ears  that  evening  to  hear  the  tale  of  their  adventures.  Gandalf it was who spoke, for Bilbo was fallen quiet and drowsy. Most of the tale  he  knew,  for  he  had  been  in  it,  and  had  himself  told much  of  it  to  the  wizard  on  their homeward way or  in  the house of Beorn; but every now and again he would  open one eye, and listen, when a part of the story which he did not yet know came  in. It was in this way that he learned where Gandalf had been to; for he overheard  the  words  of  the  wizard  to  Elrond.  It  appeared  that  Gandalf  had  been  to  a  great  council of the white wizards, masters of lore and good magic; and that they had at  last driven the Necromancer from his dark hold in the south of Mirkwood."
}