{
  "id": "a18458f141a1880f21502517d72462de9fa4b682",
  "text": "  \"What was she judging against - a chipmunk?\" \"Ignore it,\" Hermione said in a dignified voice, holding her head in the air and stalking past the sniggering Slytherin girls as though she couldn't hear them. \"Just ignore it, Harry.\" But Harry couldn't ignore it.  Ron hadn't spoken to him at all since he had told him about Snape's detentions.  Harry had half hoped they would make things up during the two hours they were forced to pickle rats' brains in Snape's dungeon, but that had been the day Rita's article had appeared, which seemed to have confirmed Ron's belief that Harry was really enjoying all the attention. Hermione was furious with the pair of them; she went from one to the other, trying to force them to talk to each other, but Harry was adamant:  He would talk to Ron again only if Ron admitted that Harry hadn't put his name in the Goblet of Fire and apologized for calling him a liar. \"I didn't start this,\" Harry said stubbornly. \"It's his problem.\" \"You miss him!\"  Hermione said impatiently.  \"And I know he misses you -\" \"Miss him?\"  said Harry.  \"I don't miss him. . . But this was a downright lie.  Harry liked Hermione very much, but she just wasn't the same as Ron.  There was much hess laughter and a lot more hanging around in the library when Hermione was your best friend.  Harry still hadn't mastered Summoning Charms, he seemed to have developed something of a block about them, and Hermione insisted that learning the theory would help.  They consequently spent a lot of time poring over books during their lunchtimes. Viktor Krum was in the library an awful lot too, and Harry wondered what he was up to.  Was he studying, or was he looking for things to help him through the first task?  Hermione often complained about Krum being there - not that he ever bothered them - but because groups of giggling girls often turned up to spy on him from behind bookshelves, and Hermione found the noise distracting. \"He's not even good-looking!\"  she muttered angrily, glaring at Krum's sharp profile. \"They only like him because he's famous!  They wouldn't look twice at him if he couldn't do that WonkyFaint thing -\" \"Wronski Feint,\" said Harry, through gritted teeth.  Quite apart from liking to get Quidditch terms correct, it caused him another pang to imagine Ron's expression if he could have heard Hermione talking about Wonky-Faints.  It is a strange thing, but when you are dreading something, and would give anything to slow down time, it has a disobliging habit of speeding up.  The days until the first task seemed to slip by as though someone had fixed the clocks to work at double speed.  Harry's feeling of barely controlled panic was with him wherever he went, as everpresent as the snide comments about the Daily Prophet article. On the Saturday before the first task, all students in the third year and above were permitted to visit the village of Hogsmeade.  Hermione told Harry that it would do him good to get away from the castle for a bit, and Harry didn't need much persuasion. \"What about Ron, though?\"  he said.  \"Don't you want to go with him?\" \"Oh. . . well.. .\"  Hermione went slightly pink.  \"I thought we might meet up with him in the Three Broomsticks. . . .\" \"No,\" said Harry flatly. \"Oh Harry, this is so stupid -\" \"I'll come, but I'm not meeting Ron, and I'm wearing my Invisibility Cloak.\" \"Oh all right then. . .\"  Hermione snapped, \"but I hate talking to you in that cloak, I never know if I'm looking at you or not.\" So Harry put on his Invisibility Cloak in the dormitory, went back downstairs, and together he and Hermione set off for Hogsmeade. Harry felt wonderfully free under the cloak; he watched other students walking past them as they entered the village, most of them sporting Support Cedric Diggory!  badges, but no horrible remarks came his way for a change, and nobody was quoting that stupid article. \"People keep looking at me now,\" said Hermione grumpily as they came out of Honeydukes Sweetshop later, eating large cream-filled chocolates.  \"They think I'm talking to myself.\" \"Don't move your lips so much then.\" \"Come on, please just take off your cloak for a bit, no one's going to bother you here.\" \"Oh yeah?\" said Harry. \"Look behind you.\" Rita Skeeter and her photographer friend had just emerged from the Three Broomsticks pub.  Talking in low voices, they passed right by Hermione without hooking at her.  Harry backed into the wall of Honeydukes to stop Rita Skeeter from hitting him with her crocodile-skin handbag.  When they were gone, Harry said, \"She's staying in the village.  I bet she's coming to watch the first task.\" As he said it, his stomach flooded with a wave of molten panic.  He didn't mention this; he and Hermione hadn't discussed what was coming in the first task much; he had the feeling she didn't want to think about it. \"She's gone,\" said Hermione, looking right through Harry toward the end of the street. \"Why don't we go and have a butterbeer in the Three Broomsticks, it's a bit cold, isn't it?  You don't have to talk to Ron!\"  she added irritably, correctly interpreting his silence."
}