{
  "id": "a18fef6a0fe48eb21e04d962cadad203b865292d",
  "text": "  But  that  was  not  the  last  of  the  lights  in  the  forest.  Later  when  the  night  must  have  been  getting  old,  Kili  who  was  watching  then,  came  and  roused  them  all again, saying:  \"There's a regular blaze of light begun not far away – hundreds of torches and  many fires must have been lit suddenly and by magic. And hark to the singing and  the harps!\"  After lying and listening for a while, they found they could not resist the desire  to  go  nearer  and  try  once  more  to  get  help.  Up  they  got  again;  and  this  time  the  result  was  disastrous.  The  feast  that  they  now  saw  was  greater  and  more  magnificent  than before;  and  at  the head of  a  long  line of  feasters  sat  a woodland  king  with  a  crown  of  leaves  upon  his  golden  hair,  very  much  as  Bombur  had  described the figure in his dream. The elvish folk were passing bowls from hand to   ####-hand  and  across  the  fires,  and  some  were  harping  and many  were  singing.  Their  gloaming  hair  was  twined  with  flowers;  green  and  white  gems  glinted  on  their  collars and their belts; and their faces and their songs were filled with mirth. Loud  and clear and fair were those songs, and out stepped Thorin into their midst.  Dead  silence  fell  in  the middle of  a word. Out went  all  light. The  fires  leaped  up  in  black  smokes.  Ashes  and  cinders  were  in  the  eyes  of  the  dwarves,  and  the  wood  was  filled  again  with  their  clamour  and  their  cries.  Bilbo  found  himself  running round and round (as he thought) and calling and calling: \"Dori, Nori, Ori,  Oin, Gloin, Fili, Kili, Bombur, Bifur, Bofur, Dwalin, Balin, Thorin Oakenshield,\"  while people he could not see or  feel were doing  the same all  round him  (with an  occasional \"Bilbo!\" thrown in). But the cries of the others got steadily further and  fainter,  and  though  after  a while  it  seemed  to  him  they  changed  to  yells and cries  for help  in  the  far distance, all noise at  last died  right away, and he was  left alone  in complete silence and darkness.    That was  one  of  his most miserable moments. But  he  soon made  up  his mind  that  it was no good  trying  to do  anything  till  day came with some  little  light, and  quite  useless  to  go  blundering  about  tiring  himself  out  with  no  hope  of  any  breakfast to revive him. So he sat himself down with his back to a tree, and not for  the  last  time  fell  to  thinking  of  his  far-distant  hobbit-hole  with  its  beautiful  pantries. He was deep in thoughts of bacon and eggs and toast and butter when he  felt something touch him. Something like a strong sticky string was against his left  hand,  and when  he  tried  to move  he  found  that  his  legs were  already wrapped  in  the same stuff, so that when he got up he fell over.   Then  the great  spider, who had been busy  tying him up while he dozed, came  from  behind  him  and  came  at  him.  He  could  only  see  the  things's  eyes,  but  he  could  feel  its  hairy  legs  as  it  struggled  to wind  its  abominable  threads  round  and  round him. It was lucky that he had come to his senses in time. Soon he would not  have  been  able  to  move  at  all.  As  it  was,  he  had  a  desperate  fight  before  he  got  free.  He  beat  the  creature  off  with  his  hands-it  was  trying  to  poison  him  to  keep  him  quiet,  as  small  spiders  do  to  flies-until he  remembered his  sword  and drew  it  out. Then the spider jumped back, and he had time to cut his legs loose. After that  it was  his  turn  to  attack.  The  spider  evidently was  not  used  to  things  that carried  such stings at  their sides, or  it would have hurried away quicker. Bilbo came at  it  before  it  could  disappear  and  struck  it  with  his  sword  right  in  the  eyes.  Then  it  went mad  and  leaped  and  danced  and  flung  out  its  legs  in  horrible  jerks, until he   ####-killed it with another stroke; and then he fell down and remembered nothing more  for a long while.  There was  the usual dim grey  light of  the  forest-day about him when he came  to  his  senses.  The  spider  lay  dead  beside  him,  and  his  sword-blade  was  stained  black.  Somehow  the  killing  of  the  giant  spider,  all  alone  by  himself  in  the  dark  without  the  help  of  the  wizard  or  the  dwarves  or  of  anyone  else,  made  a  great  difference  to Mr. Baggins. He  felt a different person, and much  fiercer and bolder  in  spite  of  an  empty  stomach,  as  he wiped  his  sword  on  the  grass  and  put  it  back  into its sheath.  \"I will give you a name,\" he said to it, \"and I shall call you Sting.\"  After  that he  set out  to  explore. The  forest was grim  and  silent, but obviously  he  had  first  of  all  to  look  for  his  friends,  who  were  not  likely  to  be  very  far  off,  unless they had been made prisoners by the elves (or worse things).  Bilbo  felt  that  it was unsafe  to  shout,  and he  stood  a  long while wondering  in  what direction the path lay,  and in what direction he should go first to look for the  dwarves."
}