{
  "id": "a2b1f18444a87d5c1946e27d6640016960ac0688",
  "text": ".. \"Oh no, he's back again, why can't he read on his stupid ship?\"  said Hermione irritably as Viktor Krum slouched in, cast a surly look over at the pair of them, and settled himself in a distant corner with a pile of books.  \"Come on, Harry, we'll go back to the common room. . . his fan club'll be here in a moment, twittering away... .\" And sure enough, as they left the library, a gang of girls tiptoed past them, one of them wearing a Bulgaria scarf tied around her waist.  Harry barely slept that night.  When he awoke on Monday morning, he seriously considered for the first time ever just running away from Hogwarts.  But as he looked around the Great Hall at breakfast time, and thought about what leaving the castle would mean, he knew he couldn't do it.  It was the only place he had ever been happy. . . well, he supposed he must have been happy with his parents too, but he couldn't remember that. Somehow, the knowledge that he would rather be here and facing a dragon than back on Privet Drive with Dudley was good to know; it made him feel slightly calmer.  He finished his bacon with difficulty (his throat wasn't working too well), and as he and Hermione got up, he saw Cedric Diggory leaving the Hufflepuff table. Cedric still didn't know about the dragons. . . the only champion who didn't, if Harry was right in thinking that Maxime and Karkaroff would have told Fleur and Krum.... \"Hermione, I'll see you in the greenhouses,\" Harry said, coming to his decision as he watched Cedric leaving the Hall.  \"Go on, I'll catch you up.\" \"Harry, you'll be late, the bell's about to ring -\" \"I'll catch you up, okay?\" By the time Harry reached the bottom of the marble staircase, Cedric was at the top. He was with a load of sixth-year friends.  Harry didn't want to talk to Cedric in front of them; they were among those who had been quoting Rita Skeeter's article at him every time he went near them.  He followed Cedric at a distance and saw that he was heading toward the Charms corridor.  This gave Harry an idea.  Pausing at a distance from them, he pulled out his wand, and took careful aim. \"Diffindo!\" Cedric's bag split.  Parchment, quills, and books spilled out of it onto the floor.  Several bottles of ink smashed. \"Don't bother,\" said Cedric in an exasperated voice as his friends bent down to help him.  \"Tell Flitwick I'm coming, go on. . . This was exactly what Harry had been hoping for.  He slipped his wand back into his robes, waited until Cedric's friends had disappeared into their classroom, and hurried up the corridor, which was now empty of everyone but himself and Cedric. \"Hi,\" said Cedric, picking up a copy of A Guide to Advanced Transfiguration that was now splattered with ink.  \"My bag just split. . . brand-new and all. . .\" \"Cedric,\" said Harry, \"the first task is dragons.\" \"What?\" said Cedric, looking up. \"Dragons,\" said Harry, speaking quickly, in case Professor Flitwick came out to see where Cedric had got to.  \"They've got four, one for each of us, and we've got to get past them.\" Cedric stared at him.  Harry saw some of the panic he'd been feeling since Saturday night flickering in Cedric's gray eyes. \"Are you sure?\" Cedric said in a hushed voice. \"Dead sure,\" said Harry. \"I've seen them.\" \"But how did you find out?  We're not supposed to know. . . .\"  \"Never mind,\" said Harry quickly - he knew Hagrid would be in trouble if he told the truth.  \"But I'm not the only one who knows.  Fleur and Krum will know by now - Maxime and Karkaroff both saw the dragons too.\" Cedric straightened up, his arms full of inky quills, parchment, and books, his ripped bag dangling off one shoulder.  He stared at Harry, and there was a puzzled, almost suspicious look in his eyes. \"Why are you telling me?\" he asked. Harry looked at him in disbelief.  He was sure Cedric wouldn't have asked that if he had seen the dragons himself.  Harry wouldn't have let his worst enemy face those monsters unprepared - well, perhaps Malfoy or Snape... \"It's just . . . fair, isn't it?\"  he said to Cedric.  \"We all know now. . . we're on an even footing, aren't we?\" Cedric was still hooking at him in a slightly suspicious way when Harry heard a familiar clunking noise behind him.  He turned around and saw Mad-Eye Moody emerging from a nearby classroom. \"Come with me, Potter,\" he growled.  \"Diggory, off you go.\" Harry stared apprehensively at Moody.  Had he overheard them? \"Er - Professor, I'm supposed to be in Herbology -\" \"Never mind that, Potter.  In my office, please... Harry followed him, wondering what was going to happen to him now.  What if Moody wanted to know how he'd found out about the dragons?  Would Moody go to Dumbledore and tell on Hagrid, or just turn Harry into a ferret?  Well, it might be easier to get past a dragon if he were a ferret, Harry thought dully, he'd be smaller, much less easy to see from a height of fifty feet.. He followed Moody into his office.  Moody closed the door behind them and turned to look at Harry, his magical eye fixed upon him as well as the normal one."
}