{
  "id": "a2caa59276c961fae64f609738aa237e86563514",
  "text": " Then  Gollum would die in a corner. But that was not what he had set out to do. It  would  not be  worth while to leave his master for  that. It would not bring  him back. Nothing would. They had better both be dead together. And that too  would be a lonely journey.       He  looked on  the bright point of the sword. He thought  of the places  behind where there  was a black brink  and an  empty  fall into nothingness.   There  was no  escape  that way. That was to do nothing, not even to grieve.   That was not what he had set  out to do. 'What am  I to  do then? ' he cried  again,  and now he seemed  plainly to know the hard  answer: see it through.  Another lonely journey, and the worst.       `What? Me, alone, go  to the Crack of Doom and all? ' He quailed still,  but the resolve grew. `What? Me take  the Ring from him? The Council gave it  to him.'       But the answer came at  once: `And the  Council gave him companions, so  that  the errand  should not fail.  And you are the last of all the Company.  The errand must not fail.'       `I wish I wasn't the last,' he groaned. `I wish old Gandalf was hare or   somebody. Why am I left all alone to make up my mind?  I'm sure to go wrong.  And it's not for me to go taking the Ring, putting myself forward.'       'But you haven't put yourself forward; you've been  put forward. And as  for  not  being the right and proper person,  why,  Mr. Frodo wasn't as  you    ####-might say, nor Mr. Bilbo. They didn't choose themselves.'       `Ah well, I must make up my  own mind. I  will  make it up. But I'll be  sure to go wrong: that'd be Sam Gamgee all over.       'Let  me see  now:  if we're found here, or Mr. Frodo's found, and that  Thing's on him,  well, the Enemy  will  get it. And that's the end of all of  us, of Lorien, and  Rivendell, and the Shire and all. And there s no time to  lose,  or it'll  be the end anyway.  The war's begun, and  more than  likely  things are all going the Enemy's way  already. No  chance to go back with It   and  get advice or permission.  No, it's sit here till they come and kill me  over master's body, and gets It: or take It and go.'  He drew a deep breath.  'Then take It, it is! '       He stooped. Very gently he undid  the clasp at the neck and slipped his  hand inside Frodo's tunic;  then with his other  hand raising the  head,  he  kissed the cold forehead, and softly drew the chain over  it.  And  then the  head lay quietly back again in rest. No change came over the still face, and  by that  more than by all  other tokens Sam was convinced at last that Frodo   had died and laid aside the Quest.       `Good-bye, master,  my dear! ' he  murmured. 'Forgive  your Sam.  He'll  come back to  this spot when  the job's done  -- if  he manages it. And then  he'll  not leave  you again. Rest  you quiet  till  I  come; and may no foul  creature come anigh you! And if the Lady could hear me and give me one wish,  I would wish to come back and find you again. Good-bye!  '       And then he bent his own  neck and put the chain upon  it, and  at once  his head was bowed to the ground with the weight of  the Ring, as if a great  stone  had been strung on him. But slowly, as if the weight became  less, or   new strength grew in him, he raised his  head, and then with a  great effort  got to his feet and found that  he could walk and bear his burden. And for a   moment he lifted up the Phial  and looked down at his master,  and the light   burned gently  now with the soft radiance of the evening-star in summer, and  in that light Frodo's face was fair of hue again, pale but beautiful with an  elvish beauty,  as of one who has  long  passed the  shadows. And  with  the   bitter comfort of that last sight Sam  turned and hid the light and stumbled  on into the growing dark.       He  had not far to go.  The  tunnel was some way  behind;  the  Cleft a   couple of hundred yards ahead, or less. The path was visible in  the dusk` a   deep rut worn in  ages of  passage,  running  now gently up in a long trough  with cliffs on either side. The trough narrowed rapidly. Soon Sam came  to a    ####-long flight of broad shallow steps. Now the orc-tower  was right  above him,  frowning black, and in it the red eye  glowed. Now he was hidden in the dark  shadow under it. He was coming to the top of  the steps and was in the Cleft   at last.       'I've made up  my  mind,' he kept saying to himself.  But  he  had not.  Though  he  had done his best  to  think it  out,  what  he  was  doing  was  altogether against the grain  of his nature.  `Have  I  got it  wrong? '  he  muttered. `What ought I to have done? '       As the sheer sides of the Cleft closed about him, before he reached the  actual summit,  before  he looked  at last on the  path descending into  the  Nameless Land. he turned. For a moment, motionless  in intolerable doubt, he  looked back. He could still see, like a small blot in  the gathering  gloom,  the mouth  of the tunnel; and he thought he could see or  guess where  Frodo   lay."
}