{
  "id": "a3925781210084dba02b0531f8a8529403e61147",
  "text": "     They shared a wish, a hope, a dream,     They hatched a daring plan     To educate young sorcerers     Thus Hogwarts School began.     Now each of these four founders     Formed their own house, for each     Did value different virtues     In the ones they had to teach.     By Gryffindor, the bravest were     Prized far beyond the rest;     For Ravenclaw, the cleverest     Would always be the best;     For Hufflepuff,  hard workers were     Most worthy of admission;     And power-hungry Slytherin     Loved those of great ambition.     While still alive they did divide     Their favorites from the throng,     Yet how to pick the worthy ones     When they were dead and gone?     'Twas Gryffindor who found the way,     He whipped me off his head     The founders put some brains in me     So I could choose instead!     Now slip me snug about your ears,     I've never yet been wrong,     I'll have a look inside your mind   And tell where you belong!   The Great Hall rang with applause as the Sorting Hat finished. \"That's not the song it sang when it Sorted us,\" said Harry, clapping along with everyone else. \"Sings a different one every year,\" said Ron.  \"It's got to be a pretty boring life, hasn't it, being a hat?  I suppose it spends all year making up the next one.\" Professor McGonagall was now unrolling a large scroll of parchment. \"When I call out your name, you will put on the hat and sit on the stool,\" she told the first years.  \"When the hat announces your House, you will go and sit at the appropriate table. \"Ackerley, Stewart!\" A boy walked forward, visibly trembling from head to foot, picked up the Sorting Hat, put it on, and sat down on the stool. \"RAVENCLAW!\" shouted the hat. Stewart Ackerley took off the hat and hurried into a seat at the Ravenclaw table, where everyone was applauding him.  Harry caught a glimpse of Cho, the Ravenclaw Seeker, cheering Stewart Ackerley as he sat down.  For a fleeting second, Harry had a strange desire to join the Ravenclaw table too. \"Baddock, Malcolm!\" \"SLYTHERIN!\" The table on the other side of the hall erupted with cheers; Harry could see Malfoy clapping as Baddock joined the Slytherins.  Harry wondered whether Baddock knew that Slytherin House had turned out more Dark witches and wizards than any other.  Fred and George hissed Malcolm Baddock as he sat down. \"Branstone, Eleanor!\" \"HUFFLEPUFF!\"  \"Cauldwell, Owen!\" \"HUFFLEPUFF!\" \"Creevey, Dennis!\" Tiny Dennis Creevey staggered forward, tripping over Hagrid's moleskin, just as Hagrid himself sidled into the Hall through a door behind the teachers' table.  About twice as tall as a normal man, and at least three times as broad, Hagrid, with his long, wild, tangled black hair and beard, looked slightly alarming - a misleading impression, for Harry, Ron, and Hermione knew Hagrid to possess a very kind nature.  He winked at them as he sat down at the end of the staff table and watched Dennis Creevey putting on the Sorting Hat.  The rip at the brim opened wide-- -  \"GRYFFINDOR!\" the hat shouted. Hagrid clapped along with the Gryffindors as Dennis Creevey, beaming widely, took off the hat, placed it back on the stool, and hurried over to join his brother. \"Colin, I fell in!\"  he said shrilly, throwing himself into an empty seat.  \"It was brilliant! And something in the water grabbed me and pushed me back in the boat!\" \"Cool!\" said Colin, just as excitedly.  \"It was probably the giant squid, Dennis!\" \"Wow!\" said Dennis, as though nobody in their wildest dreams could hope for more than being thrown into a storm-tossed, fathoms-deep lake, and pushed out of it again by a giant sea monster. \"Dennis!  Dennis!  See that boy down there?  The one with the black hair and glasses? See him?  Know who he is, Dennis?\" Harry looked away, staring very hard at the Sorting Hat, now Sorting Emma Dobbs. The Sorting continued; boys and girls with varying degrees of fright on their faces moving one by one to the three-legged stool, the line dwindling slowly as Professor McGonagall passed the L's. \"Oh hurry up,\" Ron moaned, massaging his stomach.  \"Now, Ron, the Sorting's much more important than food,\" said Nearly Headless Nick as \"Madley, Laura!\"  became a Hufflepuff. \"Course it is, if you're dead,\" snapped Ron. \"I do hope this year's batch of Gryffindors are up to scratch,\" said Nearly Headless Nick, applauding as \"McDonald, Natalie!\"  joined the Gryffindor table.  \"We don't want to break our winning streak, do we?\" Gryffindor had won the Inter-House Championship for the last three years in a row. \"Pritchard, Graham!\" \"SLYTHERIN!\" \"Quirke, Orla!\"   \"RAVENCLAW!\"   And finally, with \"Whitby, Kevin!\" (\"HUFFLEPUFF!\"), the Sorting ended.  Professor McGonagall picked up the hat and the stool and carried them away.   \"About time,\" said Ron, seizing his knife and fork and looking expectantly at his golden plate.   Professor Dumbledore had gotten to his feet.  He was smiling around at the students, his arms opened wide in welcome.   \"I have only two words to say to you,\" he told them, his deep voice echoing around the Hall."
}