{
  "id": "a46e7e30bbac3273a7988a1f38b4c17d87d28b84",
  "text": "  They were still a half day’s ride from Renly’s camp when they were taken. Robin Flint had ranged ahead to scout, and he came galloping back with word of a far-eyes watching from the roof of a distant windmill. By the time Catelyn’s party reached the mill, the man was long gone. They pressed on, covering not quite a mile before Renly’s outriders came swooping down on them, twenty men mailed and mounted, led by a grizzled greybeard of a knight with bluejays on his surcoat.  When he saw her banners, he trotted up to her alone.  My lady,  he called,  I am Ser Colen of Greenpools, as it please you. These are dangerous lands you cross.    Our business is urgent,  she answered him.  I come as envoy from my son, Robb Stark, the King in the North, to treat with Renly Baratheon, the King in the South.    King Renly is the crowned and anointed lord of all the Seven Kingdoms, my lady,  Ser Colen answered, though courteously enough.  His Grace is encamped with his host near Bitterbridge, where the roseroad crosses the Mander. It shall be my great honor to escort you to him.  The knight raised a mailed hand, and his men formed a double column flanking Catelyn and her guard. Escort or captor? she wondered. There was nothing to be done but trust in Ser Colen’s honor, and Lord Renly’s.  They saw the smoke of the camp’s fires when they were still an hour from the river. Then the sound came drifting across farm and field and rolling plain, indistinct as the murmur of some distant sea, but swelling as they rode closer. By the time they caught sight of the Mander’s muddy waters glinting in the sun, they could make out the voices of men, the clatter of steel, the whinny of horses. Yet neither sound nor smoke prepared them for the host itself.  Thousands of cookfires filled the air with a pale smoky haze. The horse lines alone stretched out over leagues. A forest had surely been felled to make the tall staffs that held the banners. Great siege engines lined the grassy verge of the roseroad, mangonels and trebuchets and rolling rams mounted on wheels taller than a man on horseback. The steel points of pikes flamed red with sunlight, as if already blooded, while the pavilions of the knights and high lords sprouted from the grass like silken mushrooms. She saw men with spears and men with swords, men in steel caps and mail shirts, camp followers strutting their charms, archers fletching arrows, teamsters driving wagons, swineherds driving pigs, pages running messages, squires honing swords, knights riding palfreys, grooms leading ill-tempered destriers.  This is a fearsome lot of men,  Ser Wendel Manderly observed as they crossed the ancient stone span from which Bitterbridge took its name.   That it is,  Catelyn agreed.  Near all the chivalry of the south had come to Renly’s call, it seemed. The golden rose of Highgarden was seen everywhere: sewn on the right breast of armsmen and servants, flapping and fluttering from the green silk banners that adorned lance and pike, painted upon the shields hung outside the pavilions of the sons and brothers and cousins and uncles of House Tyrell. As well Catelyn spied the fox-and-flowers of House Florent, Fossoway apples red and green, Lord Tarly’s striding huntsman, oak leaves for Oakheart, cranes for Crane, a cloud of black-and-orange butterflies for the Mullendores.  Across the Mander, the storm lords had raised their standards—Renly’s own bannermen, sworn to House Baratheon and Storm’s End. Catelyn recognized Bryce Caron’s nightingales, the Penrose quills, and Lord Estermont’s sea turtle, green on green. Yet for every shield she knew, there were a dozen strange to her, borne by the small lords sworn to the bannermen, and by hedge knights and freeriders, who had come swarming to make Renly Baratheon a king in fact as well as name.  Renly’s own standard flew high over all. From the top of his tallest siege tower, a wheeled oaken immensity covered with rawhides, streamed the largest war banner that Catelyn had ever seen—a cloth big enough to carpet many a hall, shimmering gold, with the crowned stag of Baratheon black upon it, prancing proud and tall.   My lady, do you hear that noise?  asked Hallis Mollen, trotting close.  What is that?   She listened. Shouts, and horses screaming, and the clash of steel, and… Cheering,  she said. They had been riding up a gentle slope toward a line of brightly colored pavilions on the height. As they passed between them, the press of men grew thicker, the sounds louder. And then she saw.  Below, beneath the stone-and-timber battlements of a small castle, a melee was in progress.  A field had been cleared off, fences and galleries and tilting barriers thrown up. Hundreds were gathered to watch, perhaps thousands. From the looks of the grounds, torn and muddy and littered with bits of dinted armor and broken lances, they had been at it for a day or more, but now the end was near. Fewer than a score of knights remained ahorse, charging and slashing at each other as watchers and fallen combatants cheered them on."
}