{
  "id": "a4a84807f8dcc4358ec740f252eb83350c6f6448",
  "text": "  Knives and forks, please, you two,\" she said to Ron and Harry, pointing her wand a little more vigorously than she had intended at a pile of potatoes in the sink, which shot out of their skins so fast that they ricocheted off the walls and ceiling. \"Oh for heaven's sake,\" she snapped, now directing her wand at a dustpan, which hopped off the sideboard and started skating across the floor, scooping up the potatoes.  \"Those two!\" she burst out savagely, now pulling pots and pans out of a cupboard, and Harry knew she meant Fred and George.  I don't know what's going to happen to them, I really don't. No ambition, unless you count making as much trouble as they possibly can....\" Mrs. Weasley slammed a large copper saucepan down on the kitchen table and began to wave her wand around inside it.  A creamy sauce poured from the wand tip as she stirred. \"It's not as though they haven't got brains, she continued irritably, taking the saucepan over to the stove and lighting it with a further poke of her wand, \"but they're wasting them, and unless they pull themselves together soon, they'll be in real trouble.  I've had more owls from Hogwarts about them than the rest put together.  If they carry on the way they're going, they'll end up in front of the Improper Use of Magic Office.\" Mrs. Weasley jabbed her wand at the cutlery drawer, which shot open.  Harry and Ron both jumped out of the way as several knives soared out of it, flew across the kitchen, and began chopping the potatoes, which had just been tipped back into the sink by the dustpan. \"I don't know where we went wrong with them,\" said Mrs. Weasley, putting down her wand and starting to pull out still more saucepans.  \"It's been the same for years, one thing after another, and they won't listen to - OH NOT AGAIN!\" She had picked up her wand from the table, and it had emitted a loud squeak and turned into a giant rubber mouse. \"One of their fake wands again!\" she shouted.  \"How many times have I told them not to leave them lying around?\" She grabbed her real wand and turned around to find that the sauce on the stove was smoking. \"C'mon,\" Ron said hurriedly to Harry, seizing a handful of cutlery from the open drawer, \"let's go and help Bill and Charlie.\" They left Mrs. Weasley and headed out the back door into the yard. They had only gone a few paces when Hermione's bandy-legged ginger cat, Crookshanks, came pelting out of the garden, bottle-brush tail held high in the air, chasing what looked like a muddy potato on legs.  Harry recognized it instantly as a gnome.  Barely ten inches high, its horny little feet pattered very fast as it sprinted across the yard and dived headlong into one of the Wellington boots that lay scattered around the door.  Harry could hear the gnome giggling madly as Crookshanks inserted a paw into the boot, trying to reach it. Meanwhile, a very loud crashing noise was coming from the other side of the house.  The source of the commotion was revealed as they entered the garden, and saw that Bill and Charlie both had their wands out, and were making two battered old tables fly high above the lawn, smashing into each other, each attempting to knock the other's out of the air.  Fred and George were cheering, Ginny was laughing, and Hermione was hovering near the hedge, apparently torn between amusement and anxiety. Bill's table caught Charlie's with a huge bang and knocked one of its legs off.  There was a clatter from overhead, and they all looked up to see Percy's head poking out of a window on the second floor. \"Will you keep it down?!\" he bellowed. \"Sorry, Perce,\" said Bill, grinning. \"How're the cauldron bottoms coming on?\" \"Very badly,\" said Percy peevishly, and he slammed the window shut.  Chuckling, Bill and Charlie directed the tables safely onto the grass, end to end, and then, with a flick of his wand, Bill reattached the table leg and conjured tablecloths from nowhere. By seven o'clock, the two tables were groaning under dishes and dishes of Mrs. Weasley's excellent cooking, and the nine Weasleys, Harry, and Hermione were settling themselves down to eat beneath a clear, deep-blue sky.  To somebody who had been living on meals of increasingly stale cake all summer, this was paradise, and at first, Harry listened rather than talked as he helped himself to chicken and ham pie, boiled potatoes, and salad. At the far end of the table, Percy was telling his father all about his report on cauldron bottoms. \"I've told Mr. Crouch that I'll have it ready by Tuesday,\" Percy was saying pompously. \"That's a bit sooner than he expected it, but I like to keep on top of things.  I think he'll be grateful I've done it in good time, I mean, its extremely busy in our department just now, what with all the arrangements for the World Cup.  We're just not getting the support we need from the Department of Magical Games and Sports.  Ludo Bagman -\" \"I like Ludo,\" said Mr. Weasley mildly. \"He was the one who got us such good tickets for the Cup.  I did him a bit of a favor:  His brother, Otto, got into a spot of trouble - a lawnmower with unnatural powers - I smoothed the whole thing over."
}