{
  "id": "a51b431cc110c3278dd55e0d6fd44e5fdaf5aea6",
  "text": "  Harry could hear its rattling breath; he felt clammy coldness stealing over him, but knew what he had to do.... He summoned the happiest thought he could, concentrated with all his might on the thought of getting out of the maze and celebrating with Ron and Hermione, raised his wand, and cried, \"Expecto Patronum!\" A silver stag erupted from the end of Harry's wand and galloped toward the dementor, which fell back and tripped over the hem of its robes. . . . Harry had never seen a dementor stumble. \"Hang on!\"  he shouted, advancing in the wake of his silver Patronus, \"You're a boggart! Riddikulus!\" There was a loud crack, and the shape-shifter exploded in a wisp of smoke.  The silver stag faded from sight.  Harry wished it could have stayed, he could have used some company...but he moved on, quickly and quietly as possible, listening hard, his wand held high once more. Left ... right... left again . . . Twice he found himself facing dead ends.  He did the Four-Point Spell again and found that he was going too far east.  He turned back, took a right turn, and saw an odd golden mist floating ahead of him. Harry approached it cautiously, pointing the wand's beam at it.  This looked like some kind of enchantment.  He wondered whether he might be able to blast it out of the way. \"Reducio!\" he said. The spell shot straight through the mist, leaving it intact.  He supposed he should have known better; the Reductor Curse was for solid objects.  What would happen if he walked through the mist?  Was it worth chancing it, or should he double back? He was still hesitating when a scream shattered the silence. \"Fleur?\" Harry yelled. There was silence.  He stared all around him.  What had happened to her?  Her scream seemed to have come from somewhere ahead.  He took a deep breath and ran through the enchanted mist. The world turned upside down.  Harry was hanging from the ground, with his hair on end, his glasses dangling off his nose, threatening to fall into the bottomless sky.  He clutched them to the end of his nose and hung there, terrified.  It felt as though his feet were glued to the grass, which had now become the ceiling.  Below him the dark, star-spangled heavens stretched endlessly.  He felt as though if he tried to move one of his feet, he would fall away from the earth completely. Think, he told himself, as all the blood rushed to his head, think. . . But not one of the spells he had practiced had been designed to combat a sudden reversal of ground and sky.  Did he dare move his foot?  He could hear the blood pounding in his ears.  He had two choices - try and move, or send up red sparks, and get rescued and disqualified from the task. He shut his eyes, so he wouldn't be able to see the view of endless space below him, and pulled his right foot as hard as he could away from the grassy ceiling. Immediately, the world righted itself. Harry fell forward onto his knees onto the wonderfully solid ground. He felt temporarily limp with shock. He took a deep, steadying breath, then got up again and hurried forward, looking back over his shoulder as he ran away from the golden mist, which twinkled innocently at him in the moonlight. He paused at a junction of two paths and looked around for some sign of Fleur.  He was sure it had been she who had screamed.  What had she met?  Was she all right?  There was no sign of red sparks - did that mean she had got herself out of trouble, or was she in such trouble that she couldn't reach her wand?  Harry took the right fork with a feeling of increasing unease . . . but at the same time, he couldn't help thinking.  One champion down. . . The cup was somewhere close by, and it sounded as though Fleur was no longer in the running.  He'd got this far, hadn't he?  What if he actually managed to win?  Fleetingly, and for the first time since he'd found himself champion, he saw again that image of himself, raising the Triwizard Cup in front of the rest of the school. . . . He met nothing for ten minutes, but kept running into dead ends.  Twice he took the same wrong turning.  Finally, he found a new route and started to jog along it, his wandlight waving, making his shadow flicker and distort on the hedge walls.  Then he rounded another corner and found himself facing a Blast-Ended Skrewt. Cedric was right - it was enormous.  Ten feet long, it looked more like a giant scorpion than anything.  Its long sting was curled over its back.  Its thick armor glinted in the light from Harry's wand, which he pointed at it. \"Stupefy!\" The spell hit the skrewt's armor and rebounded; Harry ducked just in time, but could smell burning hair; it had singed the top of his head.  The skrewt issued a blast of fire from its end and flew forward toward him. \"Impedimenta!\"  Harry yelled.  The spell hit the skrewt's armor again and ricocheted off; Harry staggered back a few paces and fell over. \"IMPEDIMENTA!\" The skrewt was inches from him when it froze - he had managed to hit it on its fleshy, shell-less underside."
}