{
  "id": "a5f8c99667589e5f780f83d747fb4ba02a65bc58",
  "text": " Suddenly Jory was back among them, a red rain flying from his sword.  No!  Ned shouted.  Jory, away!  Ned’s horse slipped under him and came crashing down in the mud. There was a moment of blinding pain and the taste of blood in his mouth.  He saw them cut the legs from Jory’s mount and drag him to the earth, swords rising and failing as they closed in around him. When Ned’s horse lurched back to its feet, he tried to rise, only to fall again, choking on his scream. He could see the splintered bone poking through his calf. It was the last thing he saw for a time. The rain came down and down and down.  When he opened his eyes again, Lord Eddard Stark was alone with his dead. His horse moved closer, caught the rank scent of blood, and galloped away. Ned began to drag himself through the mud, gritting his teeth at the agony in his leg. It seemed to take years. Faces watched from candlelit windows, and people began to emerge from alleys and doors, but no one moved to help.  Littlefinger and the City Watch found him there in the street, cradling Jory Cassel’s body in his arms.  Somewhere the gold cloaks found a litter, but the trip back to the castle was a blur of agony, and Ned lost consciousness more than once. He remembered seeing the Red Keep looming ahead of him in the first grey light of dawn. The rain had darkened the pale pink stone of the massive walls to the color of blood.  Then Grand Maester Pycelle was looming over him, holding a cup, whispering,  Drink, my lord. Here. The milk of the poppy, for your pain.  He remembered swallowing, and Pycelle was telling someone to heat the wine to boiling and fetch him clean silk, and that was the last he knew.      DAENERYS  The Horse Gate of Vaes Dothrak was made of two gigantic bronze stallions, rearing, their hooves meeting a hundred feet above the roadway to form a pointed arch.  Dany could not have said why the city needed a gate when it had no walls… and no buildings that she could see. Yet there it stood, immense and beautiful, the great horses framing the distant purple mountain beyond. The bronze stallions threw long shadows across the waving grasses as Khal Drogo led the khalasar under their hooves and down the godsway, his bloodriders beside him.  Dany followed on her silver, escorted by Ser Jorah Mormont and her brother Viserys, mounted once more. After the day in the grass when she had left him to walk back to the khalasar, the Dothraki had laughingly called him Khal Rhae Mhar, the Sorefoot King. Khal Drogo had offered him a place in a cart the next day, and Viserys had accepted. In his stubborn ignorance, he had not even known he was being mocked; the carts were for eunuchs, cripples, women giving birth, the very young and the very old. That won him yet another name: Khal Rhaggat, the Cart King. Her brother had thought it was the khal’s way of apologizing for the wrong Dany had done him. She had begged Ser Jorah not to tell him the truth, lest he be shamed. The knight had replied that the king could well do with a bit of shame… yet he had done as she bid. It had taken much pleading, and all the pillow tricks Doreah had taught her, before Dany had been able to make Drogo relent and allow Viserys to rejoin them at the head of the column.   Where is the city?  she asked as they passed beneath the bronze arch. There were no buildings to be seen, no people, only the grass and the road, lined with ancient monuments from all the lands the Dothraki had sacked over the centuries.   Ahead,  Ser Jorah answered.  Under the mountain.   Beyond the horse gate, plundered gods and stolen heroes loomed to either side of them. The forgotten deities of dead cities brandished their broken thunderbolts at the sky as Dany rode her silver past their feet. Stone kings looked down on her from their thrones, their faces chipped and stained, even their names lost in the mists of time. Lithe young maidens danced on marble plinths, draped only in flowers, or poured air from shattered jars. Monsters stood in the grass beside the road; black iron dragons with jewels for eyes, roaring griffins, manticores with their barbed tails poised to strike, and other beasts she could not name. Some of the statues were so lovely they took her breath away, others so misshapen and terrible that Dany could scarcely bear to look at them. Those, Ser Jorah said, had likely come from the Shadow Lands beyond Asshai.   So many,  she said as her silver stepped slowly onward,  and from so many lands.   Viserys was less impressed.  The trash of dead cities,  he sneered. He was careful to speak in the Common Tongue, which few Dothraki could understand, yet even so Dany found herself glancing back at the men of her khas, to make certain he had not been overheard. He went on blithely.  All these savages know how to do is steal the things better men have built… and kill.  He laughed.  They do know how to kill. Otherwise I’d have no use for them at all.    They are my people now,  Dany said.  You should not call them savages, brother."
}