{
  "id": "a6270fe45f0f04e4e0872a922ed02e08a9153947",
  "text": "  \"Ere  long  now,\"  Gandalf  was  saying,  \"The  Forest  will  grow  somewhat  more  wholesome. The North will be freed from that horror for many long years, I hope.  Yet I wish he were banished from the world!\"  \"It would be well  indeed,\" said Elrond; \"but I fear  that will not come about  in  this age of the world, or for many after.\"  When  the  tale  of  their  joumeyings  was  told,  there  were  other  tales,  and  yet  more  tales,  tales of  long ago, and  tales  . of new  things, and  tales of no  time at all,  till Bilbo's head fell forward on his chest, and he snored comfortably in a corner.   He woke to find himself in a white bed, and the moon shining through an open  window.  Below  it  many  elves  were  singing  loud  and  clear  on  the  banks  of  the  stream.     Sing all ye joyful, now sing all together?   The wind's in the free-top, the wind's in the heather;   The stars are in blossom, the moon is in flower,    ####-And bright are the windows of Night in her tower.     Dance all ye joyful, now dance all together!  Soft is the grass, and let foot be like feather!  The river is silver, the shadows are fleeting;  Merry is May-time, and merry our meeting.    Sing we now softly, and dreams let us weave him!  Wind him in slumber and there let us leave him!  The wanderer sleepeth. Now soft be his pillow!  Lullaby! Lullaby! Alder and Willow!    Sigh no more Pine, till the wind of the morn!  Fall Moon! Dark be the land!  Hush! Hush! Oak, Ash, and Thorn!  Hushed be all water, till dawn is at hand!     \"Well, Merry People!\" said Bilbo looking out. \"What time by the moon is this?  Your lullaby would waken a drunken goblin! Yet I thank you.\"  \"And  your  snores  would  waken  a  stone  dragon  –  yet  we  thank  you,\"  they  answered  with  laughter.  \"It  is  drawing    towards  dawn,  and  you  have  slept  now  since the night's beginning. Tomorrow, perhaps, you will be cured of weariness.\"  \"A  little  sleep  does  a  great  cure  in  the  house  of  Elrond,\"  said  he;  \"but  I  will  take  all  the  cure  I  can  get.  A  second  good  night,  fair  friends!\"  And  with  that  he  went back to bed and slept till late morning.  Weariness fell from him soon in that house, and he had many a merry jest and  dance,  early  and  late,  with  the  elves  of  the  valley.  Yet  even  that  place  could  not  long  delay  him  now,  and  he  thought  always  of  his  own  home.  After  a  week,  therefore, he said farewell  to Elrond, and giving him such small gifts as he would  accept, he  rode  away with Gandalf. Even  as  they  left  the valley  the  sky darkened  in the West before them, and wind and rain came up to meet them.  \"Merry  is May-time!\" said Bilbo, as  the  rain beat  into his  face. \"But our back  is to legends and we are coming home. I suppose this is a first taste of it.\"  \"There is a long road yet,\" said Gandalf.  \"But  it  is  the  last  road,\"  said  Bilbo.  They  came  to  the  river  that  marked  the  very  edge  of  the  borderland  of  the Wild,  and  to  the  ford  beneath  the  steep  bank,  which  you  may  remember.  The  water  was  swollen  both  with  the  melting  of  the  snows  at  the  approach  of  summer,  and  with  the  daylong  rain;  but  they  crossed  with some difficulty, and pressed forward, as evening fell, on the last stage of their   ####-journey.  This  was  much  as  it  had  been  before,  except  that  the  company  was  smaller,  and  more  silent;  also  this  time  there were  no  trolls. At  each  point  on  the  road Bilbo  recalled  the  happenings  and  the words  of  a  year  ago-it seemed  to him  more  like  ten-so  that,  of  course,  he  quickly  noted  the  place  where  the  pony  had  fallen  in  the  river,  and  they  had  turned  aside  for  their  nasty  adventure with  Tom  and  Bert  and  Bill. Not  far  from  the  road  they  found  the  gold  of  the  trolls, which  they had buried,  still hidden  and untouched.  \"I have  enough  to  last me my  time,\"  said Bilbo, when they had dug it up. \"You had better take this, Gandalf. I daresay  you can find a use for it.\"  \"Indeed I can!\" said the wizard. \"But share and share alike! You may find you  have more needs than you expect.\"  So they put the gold in bags and slung them on the ponies, who were not at all  pleased  about  it.  After  that  their  going  was  slower,  for  most  of  the  time  they  walked.  But  the  land  was  green  and  there  was  much  grass  through  which  the  hobbit  strolled  along  contentedly.  He  mopped  his  face  with  a  red  silk  handkerchief-no!  not  a  single  one  of  his own had  survived, he had borrowed  this  one from Elrond  –for now June had brought summer, and  the weather was bright  and hot again.  As  all  things  come  to  an  end,  even  this  story,  a  day  came  at  last  when  they  were in sight of the country where Bilbo had been born and bred, where the shapes  of  the  land  and  of  the  trees  were  as  well  known  to  him  as  his  hands  and  toes."
}