{
  "id": "a651489c2d58724e02c392043a947763a9edf238",
  "text": "\"  But  somehow  he was  comforted.  It was  rather  splendid  to be wearing  a blade  made  in Gondolin for  the goblin-wars of which so many songs had sung; and also   ####-he  had  noticed  that  such  weapons made  a  great  impression  on  goblins  that  came  upon them suddenly.   \"Go  back?\"  he  thought.  \"No  good  at  all!  Go  sideways?  Impossible!  Go  forward? Only  thing  to  do! On we  go!\"  So  up  he  got,  and  trotted  along with  his  little sword held in front of him and one hand feeling the wall, and his heart all of  a patter and a pitter.     Now  certainly  Bilbo  was  in  what  is  called  a  tight  place.  But  you  must  remember  it  was  not  quite  so  tight  for  him  as  it  would  have  been  for  me  or  for  you. Hobbits are not quite like ordinary people; and after all if their holes are nice  cheery  places  and  properly  aired,  quite  different  from  the  tunnels  of  the  goblins,  still they are more used to tunnelling than we are, and they do not easily lose their  sense  of  direction  underground-not  when  their  heads  have  recovered  from  being  bumped.  Also  they  can  move  very  quietly,  and  hide  easily,  and  recover  wonderfully  from  falls  and  bruises,  and  they  have  a  fund  of  wisdom  and  wise  sayings that men have mostly never heard or have forgotten long ago.  I  should  not  have  liked  to  have  been  in Mr. Baggins'  place,  all  the  same. The  tunnel seemed to have no end. All he knew was that it was still going down pretty  steadily  and  keeping  in  the  same  direction  in  spite  of  a  twist  and  a  turn  or  two.  There were passages leading off to the side every now and then, as he knew by the  glimmer of his sword, or  could feel with his hand on the wall. Of these he took no  notice,  except  to  hurry  past  for  fear  of  goblins  or  half-imagined  dark  things  coming out of them. On and on he went, and down and down; and still he heard no  sound of anything except  the occasional  whirr of a bat by his ears, which  startled  him at first, till it became too frequent to bother about. I do not know how long he  kept  on  like  this,  hating  to  go  on,  not  daring  to  stop,  on,  on,  until  he was  tireder  than tired. It seemed like all the way to tomorrow and over it to the days beyond.  Suddenly  without  any  warning  he  trotted  splash  into  water!  Ugh!  it  was  icy  cold. That  pulled  him  up  sharp  and  short. He  did  not  know whether  it was  just  a  pool in the path, or the edge of an underground stream that crossed the passage, or  the  brink  of  a  deep  dark  subterranean  lake.  The  sword was  hardly  shining  at  all.  He  stopped,  and  he  could  hear,  when  he  listened  hard,  drops  drip-drip-dripping  from an unseen roof into the water below; but there seemed no other sort of sound.  \"So  it  is  a  pool  or  a  lake,  and  not  an  underground  river,\"  he  thought.  Still  he  did  not  dare  to  wade  out  into  the  darkness.  He  could  not  swim;  and  he  thought,  too,  of  nasty  slimy  things,  with  big  bulging  blind  eyes,  wriggling  in  the  water.  There  are  strange  things  living  in  the  pools  and  lakes  in  the  hearts  of mountains:   ####-fish whose fathers swam in, goodness only knows how many years ago, and never  swam out again, while their eyes grew bigger and bigger and bigger from trying to  see  in  the  blackness;  also  there  are other  things more  slimy  than  fish. Even  in  the  tunnels  and  caves  the  goblins  have  made  for  themselves  there  are  other  things  living unbeknown to them that have sneaked in from outside to lie up in the dark.  Some  of  these  caves,  too,  go  back  in  their  beginnings  to  ages  before  the  goblins,  who  only  widened  them  and  joined  them  up  with  passages,  and  the  original  owners are still there in odd comers, slinking and nosing about.  Deep down here by  the dark water  lived old Gollum, a small slimy creature. I  don't  know where  he  came  from,  nor who  or what  he was. He was Gollum  — as  dark  as  darkness,  except  for  two  big  round  pale  eyes  in  his  thin  face.  He  had  a  little boat, and he rowed about quite quietly on the lake; for lake it was, wide and  deep  and  deadly  cold.  He  paddled  it  with  large  feet  dangling  over  the  side,  but  never a ripple did he make. Not he. He was looking out of his pale lamp-like eyes  for  blind  fish,  which  he  grabbed  with  his  long  fingers  as  quick  as  thinking.  He  liked  meat  too.  Goblin  he  thought  good,  when  he  could  get  it;  but  he  took  care  they  never  found  him  out.  He  just  throttled  them  from  behind,  if  they  ever  came  down  alone  anywhere  near  the  edge  of  the  water,  while  he  was  prowling  about.  They  very  seldom  did,  for  they  had  a  feeling  that  something  unpleasant  was  lurking down there, down at the very roots of the mountain. They had come on the  lake, when  they were  tunnelling down  long ago, and  they  found  they could go no  further;  so  there  their  road  ended  in  that  direction,  and  there was no  reason  to go  that  way-unless  the  Great  Goblin  sent  them."
}