{
  "id": "a71efcc83ecaf4c148d76d1ec51ee5fd89ff4d33",
  "text": "  Every moment they expected to feel the bite  of black -feathered arrows. Many  whined overhead or struck the  water nearby; but there were no more hits. It   was dark,  but  not  too  dark  for  the  night-eyes of  Orcs,  and  in  the  star-glimmer they must have offered  their cunning foes some mark, unless it  was that  the grey cloaks Of Lurien and  the grey timber of the  elf-wrought  boats defeated the malice of the archers of Mordor.       Stroke by  stroke they  laboured on. In the darkness it  was hard to be  sure that they were indeed moving at  all; but slowly the swirl of the water   grew less, and the  shadow of the eastern bank faded back into the night . At  last, as far as they  could judge, they had reached the middle of the stream  again and had driven their boats back some distance above the jutting rocks.   Then  half turning they  thrust them  with all  their  strength towards  the  western shore. Under  the  shadow Of bushes leaning  out  over the water they  halted and drew breath.       Legolas laid down his paddle and took  up the  bow that he had  brought  from  Lurien. Then he  sprang ashore  and climbed  a few paces up  the bank.  Stringing the bow  and  fitting an arrow  he turned, peering back  over  the  River into  the darkness.  Across  the water  there were  shrill  cries, but  nothing could be seen.       Frodo looked up at the Elf  standing tall above him, as he  gazed  into  the night, seeking a mark to shoot at. His head was dark, crowned with sharp  white  stars that glittered in  the  black pools  of the sky behind. But now  rising and sailing up from the South the great clouds advanced, sending  out  dark outriders into the starry fields. A sudden dread fell on the Company.       `Elbereth Gilthoniel!' sighed Legolas as he  looked up.  Even as he did  so,  a dark shape, like a cloud and yet  not a cloud, for it moved far  more   ####-swiftly,  came out  of the blackness in  the  South,  and  sped towards  the  Company, blotting out  all  light as it approached. Soon  it  appeared as  a   great  winged creature, blacker  than the pits in  the night. Fierce  voices  rose up to greet it from across the water. Frodo felt a sudden chill running  through him and clutching  at his heart;  there was  a deadly cold, like the  memory of an old wound, in his shoulder. He crouched down, as if to hide.       Suddenly  the great bow of  Lurien sang. Shrill went the arrow from the  elven-string.  Frodo looked up. Almost above  him the  winged shape swerved.  There was a harsh croaking scream, as it fell out of the air, vanishing down  into the gloom of  the eastern  shore. The sky was clean again.  There was a   tumult  of many voices far away, cursing and  wailing in  the darkness,  and   then silence. Neither shaft nor cry came again from the east that night.       After a while Aragorn led the boats back upstream. They felt  their way  along  the water's edge for some distance, until they  found a small shallow  bay. A  few low  trees grew there close to the water, and behind them rose a   steep  rocky  bank. Here the Company decided to stay and await the  dawn: it  was useless  to attempt to move further by night.  They made no camp and lit  no fire, but lay huddled in the boats, moored close together.       'Praised be  the bow  of Galadriel, and the  hand and eye of Legolas! '  said Gimli, as he munched a wafer of lembas. 'That was a mighty shot in  the  dark, my friend!'       'But who can say what it hit?' said Legolas.       'I cannot,' said Gimli. `But  I am glad that the shadow came no nearer.  I liked it not at all. Too much it reminded me of the shadow in Moria -- the  shadow of the Balrog,' he ended in a whisper.       'It  was not a Balrog,' said Frodo, still shivering with the chill that  had come upon him.  'It was  something  colder.  I think it was   --' Then he  paused and fell silent.       'What do you think? ' asked Boromir eagerly, leaning  from his boat, as  if he was trying to catch a glimpse of Frodo's face.       `I think -- No, I will not say,' answered Frodo. `Whatever it was,  its  fall has dismayed our enemies.'       `So  it seems,' said Aragorn. `Yet where they  are,  and how many,  and  what they will do next, we do not know. This night we must all be sleepless!   Dark hides  us now. Bu t what the  day  will  show  who can tell?  Have  your  weapons close to hand! '       Sam  sat tapping the hilt of his sword as if he  were  counting on  his   ####-fingers, and looking up at  the sky. `It's very strange,' he  murmured. `The   Moon's the same in the Shire  and  in  Wilderland, or  it  ought  to be. But  either it's out of its running, or  I'm all  wrong  in my  reckoning. You'll  remember,  Mr. Frodo, the  Moon was waning as we lay on the  flet up in that  tree: a  week from the full,  I reckon. And we'd been a week on the way last   night, when up pops  a New Moon as thin as a nail -paring, as if we had never  stayed no time in the Elvish country."
}