{
  "id": "a7490da4090bc55975463d15489b21254a840a5d",
  "text": "  \"Crouch used to be Head of the Department of Magical Law Enforcement, didn't you know?\" Harry, Ron, and Hermione shook their heads. \"He was tipped for the next Minister of Magic,\" said Sirius. \"He's a great wizard, Barty Crouch, powerfully magical - and power-hungry.  Oh never a Voldemort supporter,\" he said, reading the look on Harrys face.  \"No, Barty Crouch was always very outspoken against the Dark Side.  But then a lot of people who were against the Dark Side . . . well, you wouldn't understand . . . you're too young. ...\" \"That's what my dad said at the World Cup,\" said Ron, with a trace of irritation in his voice. \"Try us, why don't you?\" A grin flashed across Sirius's thin face. \"All right, I'll try you. . . .\" He walked once up the cave, back again, and then said, \"Imagine that Voldemort's powerful now.  You don't know who his supporters are, you don't know who's working for him and who isn't; you know he can control people so that they do terrible things without being able to stop themselves.  You're scared for yourself, and your family, and your friends.  Every week, news comes of more deaths, more disappearances, more torturing . . . the Ministry of Magic's in disarray, they don't know what to do, they're trying to keep everything hidden from the Muggles, but meanwhile, Muggles are dying too.  Terror everywhere . . . panic . . . confusion . . . that's how it used to be. \"Well, times like that bring out the best in some people and the worst in others. Crouch's principles might've been good in the beginning - I wouldn't know.  He rose quickly through the Ministry, and he started ordering very harsh measures against Voldemorts supporters.  The Aurors were given new powers - powers to kill rather than capture, for instance.  And I wasn't the only one who was handed straight to the dementors without trial. Crouch fought violence with violence, and authorized the use of the Unforgivable Curses against suspects.  I would say he became as ruthless and cruel as many on the Dark Side.  He had his supporters, mind you - plenty of people thought he was going about things the right way, and there were a lot of witches and wizards clamoring for him to take over as Minister of Magic. When Voldemort disappeared, it looked like only a matter of time until Crouch got the top job. But then something rather unfortunate happened. ...\"  Sirius smiled grimly.  \"Crouch's own son was caught with a group of Death Eaters who'd managed to talk their way out of Azkaban. Apparently they were trying to find Voldemort and return him to power.\" \"Crouch's son was caught?\"  gasped Hermione. \"Yep,\" said Sirius, throwing his chicken bone to Buckbeak, flinging himself back down on the ground beside the loaf of bread, and tearing it in half.  \"Nasty little shock for old Barty, I'd imagine.  Should have spent a bit more time at home with his family, shouldn't he?  Ought to have left the office early once in a while . . . gotten to know his own son.\" He began to wolf down large pieces of bread.  \"Was his son a Death Eater?\" said Harry. \"No idea,\" said Sirius, still stuffing down bread.  \"I was in Azkaban myself when he was brought in.  This is mostly stuff I've found out since I got out.  The boy was definitely caught in the company of people I'd bet my life were Death Eaters - but he might have been in the wrong place at the wrong time, just like the house-elf.\"  \"Did Crouch try and get his son off?\" Hermione whispered.  Sirius let out a laugh that was much more like a bark.  \"Crouch let his son off?  I thought you had the measure of him, Hermione!  Anything that threatened to tarnish his reputation had to go; he had dedicated his whole life to becoming Minister of Magic.  You saw him dismiss a devoted house-elf because she associated him with the Dark Mark again - doesn't that tell you what he's like?  Crouch's fatherly affection stretched just far enough to give his son a trial, and by all accounts, it wasn't much more than an excuse for Crouch to show how much he hated the boy . . . then he sent him straight to Azkaban.\" \"He gave his own son to the dementors?\" asked Harry quietly.  \"That's right,\" said Sirius, and he didn't look remotely amused now.  \"I saw the dementors bringing him in, watched them through the bars in my cell door.  He can't have been more than nineteen.  They took him into a cell near mine.  He was screaming for his mother by nightfall.  He went quiet after a few days, though . . .they all went quiet in the end. . . except when they shrieked in their sleep. ...\" For a moment, the deadened look in Sirius's eyes became more pronounced than ever, as though shutters had closed behind them. \"So he's still in Azkaban?\" Harry said. \"No,\" said Sirius dully.  \"No, he's not in there anymore.  He died about a year after they brought him in.\" \"He died?\" \"He wasn't the only one,\" said Sirius bitterly.  \"Most go mad in there, and plenty stop eating in the end.  They lose the will to live.  You could always tell when a death was coming, because the dementors could sense it, they got excited."
}