{
  "id": "a7a195df3fcc7bfc0484c7a2d3d93b69bff6c3ff",
  "text": "  \"Budge up there, move along.\"  \"Hagrid!\"  Ron and Hermione squeezed together to give Hagrid enough space to join them.  \"Bin watchin' from me hut,\" said Hagrid, patting a large pair of binoculars around his neck, \"But it isn't the same as bein' in the crowd. No sign of the Snitch yet, eh?\"  \"Nope,\" said Ron. \"Harry hasn't had much to do yet.\"  \"Kept outta trouble, though, that's somethin',\" said Hagrid, raising his binoculars and peering skyward at the speck that was Harry.  Way up above them, Harry was gliding over the game, squinting about for some sign of the Snitch. This was part of his and Wood's game plan.  \"Keep out of the way until you catch sight of the Snitch,\" Wood had said. \"We don't want you attacked before you have to be.\"  When Angelina had scored, Harry had done a couple of loop-the-loops to let off his feelings. Now he was back to staring around for the Snitch. Once he caught sight of a flash of gold, but it was just a reflection from one of the Weasleys' wristwatches, and once a Bludger decided to come pelting his way, more like a cannonball than anything, but Harry dodged it and Fred Weasley came chasing after it.  \"All right there, Harry?\" he had time to yell, as he beat the Bludger furiously toward Marcus Flint.  \"Slytherin in possession,\" Lee Jordan was saying, \"Chaser Pucey ducks two Bludgers, two Weasleys, and Chaser Bell, and speeds toward the -- wait a moment -- was that the Snitch?\"  A murmur ran through the crowd as Adrian Pucey dropped the Quaffle, too busy looking over his shoulder at the flash of gold that had passed his left ear.  Harry saw it. In a great rush of excitement he dived downward after the streak of gold. Slytherin Seeker Terence Higgs had seen it, too. Neck and neck they hurtled toward the Snitch -all the Chasers seemed to have forgotten what they were supposed to be doing as they hung in midair to watch.  Harry was faster than Higgs -- he could see the little round ball, wings fluttering, darting up ahead - - he put on an extra spurt of speed --  WHAM! A roar of rage echoed from the Gryffindors below -- Marcus Flint had blocked Harry on purpose, and Harry's broom spun off course, Harry holding on for dear life.  \"Foul!\" screamed the Gryffindors.  Madam Hooch spoke angrily to Flint and then ordered a free shot at the goal posts for Gryffindor. But in all the confusion, of course, the Golden Snitch had disappeared from sight again.  Down in the stands, Dean Thomas was yelling, \"Send him off, ref! Red card!\"  \"What are you talking about, Dean?\" said Ron.  \"Red card!\" said Dean furiously. \"In soccer you get shown the red card and you're out of the game!\"  \"But this isn't soccer, Dean,\" Ron reminded him.  Hagrid, however, was on Dean's side.  \"They oughta change the rules. Flint coulda knocked Harry outta the air.\"  Lee Jordan was finding it difficult not to take sides.  \"So -- after that obvious and disgusting bit of cheating  \"Jordan!\" growled Professor McGonagall.  \"I mean, after that open and revolting foul  'Jordan, I'm warning you --\"  \"All right, all right. Flint nearly kills the Gryffindor Seeker, which could happen to anyone, I'm sure, so a penalty to Gryffindor, taken by Spinner, who puts it away, no trouble, and we continue play, Gryffindor still in possession.\"  It was as Harry dodged another Bludger, which went spinning dangerously past his head, that it happened. His broom gave a sudden, frightening lurch. For a split second, he thought he was going to fall. He gripped the broom tightly with both his hands and knees. He'd never felt anything like that.  It happened again. It was as though the broom was trying to buck him off. But Nimbus Two Thousands did not suddenly decide to buck their riders off. Harry tried to turn back toward the Gryffindor goal- posts -- he had half a mind to ask Wood to call time-out -- and then he realized that his broom was completely out of his control. He couldn't turn it. He couldn't direct it at all. It was zigzagging through the air, and every now and then making violent swishing movements that almost unseated him.  Lee was still commentating.  \"Slytherin in possession -- Flint with the Quaffle -- passes Spinnet -- passes Bell -- hit hard in the face by a Bludger, hope it broke his nose -- only joking, Professor -- Slytherins score -- A no...  The Slytherins were cheering. No one seemed to have noticed that Harry's broom was behaving strangely. It was carrying- him slowly higher, away from the game, jerking and twitching as it went.  \"Dunno what Harry thinks he's doing,\" Hagrid mumbled. He stared through his binoculars. \"If I didn' know better, I'd say he'd lost control of his broom... but he can't have....\"  Suddenly, people were pointing up at Harry all over the stands. His broom had started to roll over and over, with him only just managing to hold on. Then the whole crowd gasped. Harry's broom had given a wild jerk and Harry swung off it. He was now dangling from it, holding on with only one hand.  \"Did something happen to it when Flint blocked him?\" Seamus whispered."
}