{
  "id": "a7d624cf53b11a8384c50cdff46079def6ebab0c",
  "text": "  Esteemed lords, the king demands the immediate presence of his small council in the throne room.   Ned had expected Cersei to strike quickly; the summons came as no surprise.  The king is dead,  he said,  but we shall go with you nonetheless. Tom, assemble an escort, if you would.   Littlefinger gave Ned his arm to help him down the steps. Varys, Pycelle, and Ser Barristan followed close behind. A double column of men-at-arms in chainmail and steel helms was waiting outside the tower, eight strong. Grey cloaks snapped in the wind as the guardsmen marched them across the yard. There was no Lannister crimson to be seen, but Ned was reassured by the number of gold cloaks visible on the ramparts and at the gates.  Janos Slynt met them at the door to the throne room, armored in ornate black-and-gold plate, with a high-crested helm under one arm. The Commander bowed stiffly. His men pushed open the great oaken doors, twenty feet tall and banded with bronze.  The royal steward led them in.  All hail His Grace, Joffrey of the Houses Baratheon and Lannister, the First of his Name, King of the Andals and the Rhoynar and the First Men, Lord of the Seven Kingdoms and Protector of the Realm,  he sang out.  It was a long walk to the far end of the hall, where Joffrey waited atop the Iron Throne. Supported by Littlefinger, Ned Stark slowly limped and hopped toward the boy who called himself king. The others followed. The first time he had come this way, he had been on horseback, sword in hand, and the Targaryen dragons had watched from the walls as he forced Jaime Lannister down from the throne. He wondered if Joffrey would step down quite so easily.  Five knights of the Kingsguard—all but Ser Jaime and Ser Barristan—were arrayed in a crescent around the base of the throne. They were in full armor, enameled steel from helm to heel, long pale cloaks over their shoulders, shining white shields strapped to their left arms. Cersei Lannister and her two younger children stood behind Ser Boros and Ser Meryn. The queen wore a gown of sea-green silk, trimmed with Myrish lace as pale as foam. On her finger was a golden ring with an emerald the size of a pigeon’s egg, on her head a matching tiara.  Above them, Prince Joffrey sat amidst the barbs and spikes in a cloth-of-gold doublet and a red satin cape. Sandor Clegane was stationed at the foot of the throne’s steep narrow stair. He wore mail and soot-grey plate and his snarling dog’s-head helm.  Behind the throne, twenty Lannister guardsmen waited with longswords hanging from their belts. Crimson cloaks draped their shoulders and steel lions crested their helms. But Littlefinger had kept his promise; all along the walls, in front of Robert’s tapestries with their scenes of hunt and battle, the gold-cloaked ranks of the City Watch stood stiffly to attention, each man’s hand clasped around the haft of an eight-foot-long spear tipped in black iron. They outnumbered the Lannisters five to one.  Ned’s leg was a blaze of pain by the time he stopped. He kept a hand on Littlefinger’s shoulder to help support his weight.  Joffrey stood. His red satin cape was patterned in gold thread; fifty roaring lions to one side, fifty prancing stags to the other.  I command the council to make all the necessary arrangements for my coronation,  the boy proclaimed.  I wish to be crowned within the fortnight. Today I shall accept oaths of fealty from my loyal councillors.   Ned produced Robert’s letter.  Lord Varys, be so kind as to show this to my lady of Lannister.   The eunuch carried the letter to Cersei. The queen glanced at the words.  Protector of the Realm,  she read.  Is this meant to be your shield, my lord? A piece of paper?  She ripped the letter in half, ripped the halves in quarters, and let the pieces flutter to the floor.   Those were the king’s words,  Ser Barristan said, shocked.   We have a new king now,  Cersei Lannister replied.  Lord Eddard, when last we spoke, you gave me some counsel. Allow me to return the courtesy. Bend the knee, my lord. Bend the knee and swear fealty to my son, and we shall allow you to step down as Hand and live out your days in the grey waste you call home.    Would that I could,  Ned said grimly. If she was so determined to force the issue here and now, she left him no choice.  Your son has no claim to the throne he sits. Lord Stannis is Robert’s true heir.    Liar!  Joffrey screamed, his face reddening.   Mother, what does he mean?  Princess Myrcella asked the queen plaintively.  Isn’t Joff the king now?    You condemn yourself with your own mouth, Lord Stark,  said Cersei Lannister.  Ser Barristan, seize this traitor.   The Lord Commander of the Kingsguard hesitated. In the blink of an eye he was surrounded by Stark guardsmen, bare steel in their mailed fists.   And now the treason moves from words to deeds,  Cersei said.  Do you think Ser Barristan stands alone, my lord?  With an ominous rasp of metal on metal, the Hound drew his longsword. The knights of the Kingsguard and twenty Lannister guardsmen in crimson cloaks moved to support him."
}