{
  "id": "a7e4a3905f2e1c0a49c9f29e33be7467244c7630",
  "text": " The Night’s Watch is a shadow of what it once was. Benjen says—    No doubt I will hear what your brother says soon enough,  Robert said.  The Wall has stood for what, eight thousand years? It can keep a few days more. I have more pressing concerns. These are difficult times. I need good men about me. Men like Jon Arryn. He served as Lord of the Eyrie, as Warden of the East, as the Hand of the King. He will not be easy to replace.    His son…  Ned began.   His son will succeed to the Eyrie and all its incomes,  Robert said brusquely.  No more.   That took Ned by surprise. He stopped, startled, and turned to look at his king. The words came unbidden.  The Arryns have always been Wardens of the East. The title goes with the domain.    Perhaps when he comes of age, the honor can be restored to him,  Robert said.  I have this year to think of, and next. A six-year-old boy is no war leader, Ned.    In peace, the title is only an honor. Let the boy keep it. For his father’s sake if not his own. Surely you owe Jon that much for his service.   The king was not pleased. He took his arm from around Ned’s shoulders.  Jon’s service was the duty he owed his liege lord. I am not ungrateful, Ned. You of all men ought to know that. But the son is not the father. A mere boy cannot hold the east.  Then his tone softened.  Enough of this. There is a more important office to discuss, and I would not argue with you.  Robert grasped Ned by the elbow.  I have need of you, Ned.    I am yours to command, Your Grace. Always.  They were words he had to say, and so he said them, apprehensive about what might come next.  Robert scarcely seemed to hear him.  Those years we spent in the Eyrie… gods, those were good years. I want you at my side again, Ned. I want you down in King’s Landing, not up here at the end of the world where you are no damned use to anybody.  Robert looked off into the darkness, for a moment as melancholy as a Stark.  I swear to you, sitting a throne is a thousand times harder than winning one. Laws are a tedious business and counting coppers is worse. And the people… there is no end of them. I sit on that damnable iron chair and listen to them complain until my mind is numb and my ass is raw. They all want something, money or land or justice. The lies they tell… and my lords and ladies are no better. I am surrounded by flatterers and fools. It can drive a man to madness, Ned. Half of them don’t dare tell me the truth, and the other half can’t find it. There are nights I wish we had lost at the Trident. Ah, no, not truly, but…   I understand,  Ned said softly.  Robert looked at him.  I think you do. If so, you are the only one, my old friend.  He smiled.  Lord Eddard Stark, I would name you the Hand of the King.   Ned dropped to one knee. The offer did not surprise him; what other reason could Robert have had for coming so far? The Hand of the King was the second-most powerful man in the Seven Kingdoms. He spoke with the king’s voice, commanded the king’s armies, drafted the king’s laws. At times he even sat upon the Iron Throne to dispense king’s justice, when the king was absent, or sick, or otherwise indisposed. Robert was offering him a responsibility as large as the realm itself.  It was the last thing in the world he wanted.   Your Grace,  he said.  I am not worthy of the honor.   Robert groaned with good-humored impatience.  If I wanted to honor you, I’d let you retire. I am planning to make you run the kingdom and fight the wars while I eat and drink and wench myself into an early grave.  He slapped his gut and grinned.  You know the saying, about the king and his Hand?   Ned knew the saying.  What the king dreams,  he said,  the Hand builds.    I bedded a fishmaid once who told me the lowborn have a choicer way to put it. The king eats, they say, and the Hand takes the shit.  He threw back his head and roared his laughter. The echoes rang through the darkness, and all around them the dead of Winterfell seemed to watch with cold and disapproving eyes.  Finally the laughter dwindled and stopped. Ned was still on one knee, his eyes upraised.  Damn it, Ned,  the king complained.  You might at least humor me with a smile.    They say it grows so cold up here in winter that a man’s laughter freezes in his throat and chokes him to death,  Ned said evenly.  Perhaps that is why the Starks have so little humor.    Come south with me, and I’ll teach you how to laugh again,  the king promised.  You helped me win this damnable throne, now help me hold it. We were meant to rule together. If Lyanna had lived, we should have been brothers, bound by blood as well as affection. Well, it is not too late. I have a son. You have a daughter. My Joff and your Sansa shall join our houses, as Lyanna and I might once have done.   This offer did surprise him.  Sansa is only eleven.   Robert waved an impatient hand.  Old enough for betrothal. The marriage can wait a few years.  The king smiled.  Now stand up and say yes, curse you.    Nothing would give me greater pleasure, Your Grace,  Ned answered."
}