{
  "id": "a832259c522b690c698e8570c206cb06bb3355a6",
  "text": "  Three hundred jars, you say? That still does not account for these totals. You are several thousand jars ahead of the best estimate you gave me when last we met.    Yes, yes, that’s so.  Hallyne mopped at his pale brow with the sleeve of his black-and-scarlet robe.  We have been working very hard, my lord Hand, hmmm.    That would doubtless explain why you are making so much more of the substance than before.  Smiling, Tyrion fixed the pyromancer with his mismatched stare.  Though it does raise the question of why you did not begin working hard until now.   Hallyne had the complexion of a mushroom, so it was hard to see how he could turn any paler, yet somehow he managed.  We were, my lord Hand, my brothers and I have been laboring day and night from the first, I assure you. It is only, hmmm, we have made so much of the substance that we have become, hmmm, more practiced as it were, and also —the alchemist shifted uncomfortably— certain spells, hmmm, ancient secrets of our order, very delicate, very troublesome, but necessary if the substance is to be, hmmm, all it should be…   Tyrion was growing impatient. Ser Jacelyn Bywater was likely here by now, and Ironhand misliked waiting.  Yes, you have secret spells; how splendid. What of them?    They, hmmm, seem to be working better than they were.  Hallyne smiled weakly.  You don’t suppose there are any dragons about, do you?    Not unless you found one under the Dragonpit. Why?    Oh, pardon, I was just remembering something old Wisdom Pollitor told me once, when I was an acolyte. I’d asked him why so many of our spells seemed, well, not as effectual as the scrolls would have us believe, and he said it was because magic had begun to go out of the world the day the last dragon died.    Sorry to disappoint you, but I’ve seen no dragons. I have noticed the King’s Justice lurking about, however. Should any of these fruits you’re selling me turn out to be filled with anything but wildfire, you’ll be seeing him as well.   Hallyne fled so quickly that he almost bowled over Ser Jacelyn—no, Lord Jacelyn, he must remember that. Ironhand was mercifully direct, as ever. He’d returned from Rosby to deliver a fresh levy of spearmen recruited from Lord Gyles’s estates and resume his command of the City Watch.  How does my nephew fare?  Tyrion asked when they were done discussing the city’s defenses.   Prince Tommen is hale and happy, my lord. He has adopted a fawn some of my men brought home from a hunt. He had one once before, he says, but Joffrey skinned her for a jerkin. He asks about his mother sometimes, and often begins letters to the Princess Myrcella, though he never seems to finish any. His brother, however, he does not seem to miss at all.    You have made suitable arrangements for him, should the battle be lost?    My men have their instructions.    Which are?    You commanded me to tell no one, my lord.   That made him smile.  I’m pleased you remember.  Should King’s Landing fall, he might well be taken alive. Better if he did not know where Joffrey’s heir might be found.  Varys appeared not long after Lord Jacelyn had left.  Men are such faithless creatures,  he said by way of greeting.  Tyrion sighed.  Who’s the traitor today?   The eunuch handed him a scroll.  So much villainy, it sings a sad song for our age. Did honor die with our fathers?    My father is not dead yet.  Tyrion scanned the list.  I know some of these names. These are rich men. Traders, merchants, craftsmen. Why should they conspire against us?    It seems they believe that Lord Stannis must win, and wish to share his victory. They call themselves the Antler Men, after the crowned stag.    Someone should tell them that Stannis changed his sigil. Then they can be the Hot Hearts.  It was no matter for jests, though; it appeared that these Antler Men had armed several hundred followers, to seize the Old Gate once battle was joined, and admit the enemy to the city. Among the names on the list was the master armorer Salloreon.  I suppose this means I won’t be getting that terrifying helm with the demon horns,  Tyrion complained as he scrawled the order for the man’s arrest.      THEON  One moment he was asleep; the next, awake.  Kyra nestled against him, one arm draped lightly over his, her breasts brushing his back. He could hear her breathing, soft and steady. The sheet was tangled about them. It was the black of night. The bedchamber was dark and still.  What is it? Did I hear something? Someone?  Wind sighed faintly against the shutters. Somewhere, far off, he heard the yowl of a cat in heat. Nothing else. Sleep, Greyjoy, he told himself. The castle is quiet, and you have guards posted. At your door, at the gates, on the armory.  He might have put it down to a bad dream, but he did not remember dreaming. Kyra had worn him out. Until Theon had sent for her, she had lived all of her eighteen years in the winter town without ever setting foot inside the walls of the castle. She came to him wet and eager and lithe as a weasel, and there had been a certain undeniable spice to fucking a common tavern wench in Lord Eddard Stark’s own bed."
}