{
  "id": "a8814b2bac37b768b97c23c82fe08563ad1d22ec",
  "text": "  Joffrey and Margaery joined hands to lift the greatsword and swung it down together in a silvery arc. When the piecrust broke, the doves burst forth in a swirl of white feathers, scattering in every direction, flapping for the windows and the rafters. A roar of delight went up from the benches, and the fiddlers and pipers in the gallery began to play a sprightly tune. Joff took his bride in his arms, and whirled her around merrily.  A serving man placed a slice of hot pigeon pie in front of Tyrion and covered it with a spoon of lemon cream. The pigeons were well and truly cooked in this pie, but he found them no more appetizing than the white ones fluttering about the hall. Sansa was not eating either.  You’re deathly pale, my lady,  Tyrion said.  You need a breath of cool air, and I need a fresh doublet.  He stood and offered her his hand.  Come.   But before they could make their retreat, Joffrey was back.  Uncle, where are you going? You’re my cupbearer, remember?    I need to change into fresh garb, Your Grace. May I have your leave?    No. I like the look of you this way. Serve me my wine.   The king’s chalice was on the table where he’d left it. Tyrion had to climb back onto his chair to reach it. Joff yanked it from his hands and drank long and deep, his throat working as the wine ran purple down his chin.  My lord,  Margaery said,  we should return to our places. Lord Buckler wants to toast us.    My uncle hasn’t eaten his pigeon pie.  Holding the chalice one-handed, Joff jammed his other into Tyrion’s pie.  It’s ill luck not to eat the pie,  he scolded as he filled his mouth with hot spiced pigeon.  See, it’s good.  Spitting out flakes of crust, he coughed and helped himself to another fistful.  Dry, though. Needs washing down.  Joff took a swallow of wine and coughed again, more violently.  I want to see, kof, see you ride that, kof kof, pig, Uncle. I want…  His words broke up in a fit of coughing.  Margaery looked at him with concern.  Your Grace?    It’s, kof, the pie, noth—kof, pie.  Joff took another drink, or tried to, but all the wine came spewing back out when another spate of coughing doubled him over. His face was turning red.  I, kof, I can’t, kof kof kof kof…  The chalice slipped from his hand and dark red wine went running across the dais.   He’s choking,  Queen Margaery gasped.  Her grandmother moved to her side.  Help the poor boy!  the Queen of Thorns screeched, in a voice ten times her size.  Dolts! Will you all stand about gaping? Help your king!   Ser Garlan shoved Tyrion aside and began to pound Joffrey on the back. Ser Osmund Kettleblack ripped open the king’s collar. A fearful high thin sound emerged from the boy’s throat, the sound of a man trying to suck a river through a reed; then it stopped, and that was more terrible still.  Turn him over!  Mace Tyrell bellowed at everyone and no one.  Turn him over, shake him by his heels!  A different voice was calling,  Water, give him some water!  The High Septon began to pray loudly. Grand Maester Pycelle shouted for someone to help him back to his chambers, to fetch his potions. Joffrey began to claw at his throat, his nails tearing bloody gouges in the flesh. Beneath the skin, the muscles stood out hard as stone. Prince Tommen was screaming and crying.  He is going to die, Tyrion realized. He felt curiously calm, though pandemonium raged all about him. They were pounding Joff on the back again, but his face was only growing darker. Dogs were barking, children were wailing, men were shouting useless advice at each other. Half the wedding guests were on their feet, some shoving at each other for a better view, others rushing for the doors in their haste to get away.  Ser Meryn pried the king’s mouth open to jam a spoon down his throat. As he did, the boy’s eyes met Tyrion’s. He has Jaime’s eyes. Only he had never seen Jaime look so scared. The boy’s only thirteen. Joffrey was making a dry clacking noise, trying to speak. His eyes bulged white with terror, and he lifted a hand… reaching for his uncle, or pointing… Is he begging my forgiveness, or does he think I can save him?  Noooo,  Cersei wailed,  Father help him, someone help him, my son, my son…   Tyrion found himself thinking of Robb Stark. My own wedding is looking much better in hindsight. He looked to see how Sansa was taking this, but there was so much confusion in the hall that he could not find her. But his eyes fell on the wedding chalice, forgotten on the floor. He went and scooped it up. There was still a half-inch of deep purple wine in the bottom of it. Tyrion considered it a moment, then poured it on the floor.  Margaery Tyrell was weeping in her grandmother’s arms as the old lady said,  Be brave, be brave.  Most of the musicians had fled, but one last flutist in the gallery was blowing a dirge. In the rear of the throne room scuffling had broken out around the doors, and the guests were trampling on each other. Ser Addam’s gold cloaks moved in to restore order. Guests were rushing headlong out into the night, some weeping, some stumbling and retching, others white with fear."
}