{
  "id": "a898c5399e18450050a5d0674b59e4915ed4370d",
  "text": "    Can we hope for no help from the south, Lady Stark?  asked Utherydes Wayn, her father’s steward.  This charge of incest… Lord Tywin does not suffer such slights lightly. He will seek to wash the stain from his daughter’s name with the blood of her accuser, Lord Stannis must see that. He has no choice but to make common cause with us.   Stannis has made common cause with a power greater and darker.  Let us speak of these matters later.  Catelyn trotted over the drawbridge, putting the grisly row of dead Lannisters behind her. Her brother kept pace. As they rode out into the bustle of Riverrun’s upper bailey, a naked toddler ran in front of the horses. Catelyn jerked her reins hard to avoid him, glancing about in dismay. Hundreds of smallfolk had been admitted to the castle, and allowed to erect crude shelters against the walls. Their children were everywhere underfoot, and the yard teemed with their cows, sheep, and chickens.  Who are all these folk?    My people,  Edmure answered.  They were afraid.   Only my sweet brother would crowd all these useless mouths into a castle that might soon be under siege. Catelyn knew that Edmure had a soft heart; sometimes she thought his head was even softer. She loved him for it, yet still…   Can Robb be reached by raven?    He’s in the field, my lady,  Ser Desmond replied.  The bird would have no way to find him.   Utherydes Wayn coughed.  Before he left us, the young king instructed us to send you on to the Twins upon your return, Lady Stark. He asks that you learn more of Lord Walder’s daughters, to help him select his bride when the time comes.    We’ll provide you with fresh mounts and provisions,  her brother promised.  You’ll want to refresh yourself before—    I’ll want to stay,  Catelyn said, dismounting. She had no intention of leaving Riverrun and her dying father to pick Robb’s wife for him. Robb wants me safe, I cannot fault him for that, but his pretext is growing threadbare.  Boy,  she called, and an urchin from the stables ran out to take the reins of her horse.  Edmure swung down from his saddle. He was a head taller than she was, but he would always be her little brother.  Cat,  he said unhappily,  Lord Tywin is coming—    He is making for the west, to defend his own lands. If we close our gates and shelter behind the walls, we can watch him pass with safety.    This is Tully land,  Edmure declared.  If Tywin Lannister thinks to cross it unbloodied, I mean to teach him a hard lesson.   The same lesson you taught his son? Her brother could be stubborn as river rock when his pride was touched, but neither of them was likely to forget how Ser Jaime had cut Edmure’s host to bloody pieces the last time he had offered battle.  We have nothing to gain and everything to lose by meeting Lord Tywin in the field,  Catelyn said tactfully.   The yard is not the place to discuss my battle plans.    As you will. Where shall we go?   Her brother’s face darkened. For a moment she thought he was about to lose his temper with her, but finally he snapped,  The godswood. If you will insist.   She followed him along a gallery to the godswood gate. Edmure’s anger had always been a sulky, sullen thing. Catelyn was sorry she had wounded him, but the matter was too important for her to concern herself with his pride. When they were alone beneath the trees, Edmure turned to face her.   You do not have the strength to meet the Lannisters in the field,  she said bluntly.   When all my strength is marshaled, I should have eight thousand foot and three thousand horse,  Edmure said.   Which means Lord Tywin will have near twice your numbers.    Robb’s won his battles against worse odds,  Edmure replied,  and I have a plan. You’ve forgotten Roose Bolton. Lord Tywin defeated him on the Green Fork, but failed to pursue. When Lord Tywin went to Harrenhal, Bolton took the ruby ford and the crossroads. He has ten thousand men. I’ve sent word to Helman Tallhart to join him with the garrison Robb left at the Twins—    Edmure, Robb left those men to hold the Twins and make certain Lord Walder keeps faith with us.    He has,  Edmure said stubbornly.  The Freys fought bravely in the Whispering Wood, and old Ser Stevron died at Oxcross, we hear. Ser Ryman and Black Walder and the rest are with Robb in the west, Martyn has been of great service scouting, and Ser Perwyn helped see you safe to Renly. Gods be good, how much more can we ask of them? Robb’s betrothed to one of Lord Walder’s daughters, and Roose Bolton wed another, I hear. And haven’t you taken two of his grandsons to be fostered at Winterfell?    A ward can easily become a hostage, if need be.  She had not known that Ser Stevron was dead, nor of Bolton’s marriage.   If we’re two hostages to the good, all the more reason Lord Walder dare not play us false. Bolton needs Frey’s men, and Ser Helman’s as well. I’ve commanded him to retake Harrenhal.    That’s like to be a bloody business.    Yes, but once the castle falls, Lord Tywin will have no safe retreat."
}