{
  "id": "a8a006eb04a27baf73105c4ab46351f9987e38c0",
  "text": " \"Evil, he is,\" Ron said bitterly that night in the Gryffindor common room. \"Springing a test on us on the last day. Ruining the last bit of term with a whole load of studying.\" \"Mmm . . . you're not exactly straining yourself, though, are you?\"  said Hermione, looking at him over the top of her Potions notes.  Ron was busy building a card castle out of his Exploding Snap pack - a much more interesting pastime than with Muggle cards, because of the chance that the whole thing would blow up at any second. \"It's Christmas, Hermione,\" said Harry lazily; he was rereading Flying with the Cannons for the tenth time in an armchair near the fire. Hermione looked severely over at him too.  \"I'd have thought you'd be doing something constructive, Harry, even if you don't want to learn your antidotes!\" \"Like what?\" Harry said as he watched Joey Jenkins of the Cannons belt a Bludger toward a Ballycastle Bats Chaser. \"That egg!\" Hermione hissed. \"Come on, Hermione, I've got till February the twenty-fourth,\" Harry said. He had put the golden egg upstairs in his trunk and hadn't opened it since the celebration party after the first task. There were still two and a half months to go until he needed to know what all the screechy wailing meant, after all. \"But it might take weeks to work it out!\" said Hermione.  \"You're going to look a real idiot if everyone else knows what the next task is and you don't!\" \"Leave him alone, Hermione, he's earned a bit of a break,\" said Ron, and he placed the last two cards on top of the castle and the whole lot blew up, singeing his eyebrows. \"Nice look, Ron ... go well with your dress robes, that will.\" It was Fred and George.  They sat down at the table with Harry, Ron, and Hermione as Ron felt how much damage had been done. \"Ron, can we borrow Pigwidgeon?\"  George asked. \"No, he's off delivering a letter,\" said Ron.  \"Why?\" \"Because George wants to invite him to the ball,\" said Fred sarcastically. \"Because we want to send a letter, you stupid great prat,\" said George. \"Who d'you two keep writing to, eh?\"  said Ron. \"Nose out, Ron, or I'll burn that for you too,\" said Fred, waving his wand threateningly. \"So . . . you lot got dates for the ball yet?\" \"Nope,\" said Ron. \"Well, you'd better hurry up, mate, or all the good ones will be gone,\" said Fred. \"Who're you going with, then?\" said Ron. \"Angelina,\" said Fred promptly, without a trace of embarrassment. \"What?\" said Ron, taken aback.  \"You've already asked her?\" \"Good point,\" said Fred. He turned his head and called across the common room, \"Oi! Angelina!\" Angelina, who had been chatting with Alicia Spinnet near the fire, looked over at him. \"What?\" she called back. \"Want to come to the ball with me?\" Angelina gave Fred an appraising sort of look. \"All right, then,\" she said, and she turned back to Alicia and carried on chatting with a bit of a grin on her face. \"There you go,\" said Fred to Harry and Ron, \"piece of cake.\" He got to his feet, yawning, and said, \"We'd better use a school owl then, George, come on. .. .\" They left.  Ron stopped feeling his eyebrows and looked across the smoldering wreck of his card castle at Harry. \"We should get a move on, you know . . . ask someone.  He's right.  We don't want to end up with a pair of trolls.\" Hermione let out a sputter of indignation. \"A pair of... what, excuse me?\" \"Well - you know,\" said Ron, shrugging.  \"I'd rather go alone than with - with Eloise Midgen, say.\" \"Her acne's loads better lately - and she's really nice!\" \"Her nose is off-center,\" said Ron. \"Oh I see,\" Hermione said, bristling.  \"So basically, you're going to take the best-looking girl who'll have you, even if she's completely horrible?\" \"Er - yeah, that sounds about right,\" said Ron.   \"I'm going to bed,\"   Hermione snapped, and she swept off toward the girls' staircase without another word.  The Hogwarts staff, demonstrating a continued desire to impress the visitors from Beauxbatons and Durmstrang, seemed determined to show the castle at its best this Christmas. When the decorations went up.  Harry noticed that they were the most stunning he had yet seen inside the school.  Everlasting icicles had been attached to the banisters of the marble staircase; the usual twelve Christmas trees in the Great Hall were bedecked with everything from luminous holly berries to real, hooting, golden owls, and the suits of armor had all been bewitched to sing carols whenever anyone passed them.  It was quite something to hear \"0 Come, All Ye Faithful\" sung by an empty helmet that only knew half the words.  Several times, Filch the caretaker had to extract Peeves from inside the armor, where he had taken to hiding, filling in the gaps in the songs with lyrics of his own invention, all of which were very rude. And still.  Harry hadn't asked Cho to the ball.  He and Ron were getting very nervous now, though as Harry pointed out, Ron would look much less stupid than he would without a partner; Harry was supposed to be starting the dancing with the other champions."
}