{
  "id": "a8dbd362019571c0c91a974ed8f9b24f03ac4be5",
  "text": "  \"Are you all right?\" said the centaur, pulling Harry to his feet.  \"Yes -- thank you -- what was that?\"  The centaur didn't answer. He had astonishingly blue eyes, like pale sapphires. He looked carefully at Harry, his eyes lingering on the scar that stood out, livid, on Harry's forehead.  \"You are the Potter boy,\" he said. \"You had better get back to Hagrid. The forest is not safe at this time -- especially for you. Can you ride? It will be quicker this way.  \"My name is Firenze,\" he added, as he lowered himself on to his front legs so that Harry could clamber onto his back.  There was suddenly a sound of more galloping from the other side of the clearing. Ronan and Bane came bursting through the trees, their flanks heaving and sweaty.  \"Firenze!\" Bane thundered. \"What are you doing? You have a human on your back! Have you no shame? Are you a common mule?\"  \"Do you realize who this is?\" said Firenze. \"This is the Potter boy. The quicker he leaves this forest, the better.\"  \"What have you been telling him?\" growled Bane. \"Remember, Firenze, we are sworn not to set ourselves against the heavens. Have we not read what is to come in the movements of the planets?\"  Ronan pawed the ground nervously. \"I'm sure Firenze thought he was acting for the best, \" he said in his gloomy voice.  Bane kicked his back legs in anger.  \"For the best! What is that to do with us? Centaurs are concerned with what has been foretold! It is not our business to run around like donkeys after stray humans in our forest!\"  Firenze suddenly reared on to his hind legs in anger, so that Harry had to grab his shoulders to stay on.  \"Do you not see that unicorn?\" Firenze bellowed at Bane. \"Do you not understand why it was killed? Or have the planets not let you in on that secret? I set myself against what is lurking in this forest, Bane, yes, with humans alongside me if I must.\"  And Firenze whisked around; with Harry clutching on as best he could, they plunged off into the trees, leaving Ronan and Bane behind them.  Harry didn't have a clue what was going on.  \"Why's Bane so angry?\" he asked. \"What was that thing you saved me from, anyway?\"  Firenze slowed to a walk, warned Harry to keep his head bowed in case of low-hanging branches, but did not answer Harry's question. They made their way through the trees in silence for so long that Harry thought Firenze didn't want to talk to him anymore. They were passing through a particularly dense patch of trees, however, when Firenze suddenly stopped.  \"Harry Potter, do you know what unicorn blood is used -for?\"  \"No,\" said Harry, startled by the odd question. \"We've only used the horn and tail hair in Potions.\"  \"That is because it is a monstrous thing, to slay a unicorn,\" said Firenze. \"Only one who has nothing to lose, and everything to gain, would commit such a crime. The blood of a unicorn will keep you alive, even if you are an inch from death, but at a terrible price. You have slain something pure and defenseless to save yourself, and you will have but a half-life, a cursed life, from the moment the blood touches your lips.\"  Harry stared at the back of Firenze's head, which was dappled silver in the moonlight.  \"But who'd be that desperate?\" he wondered aloud. \"If you're going to be cursed forever, deaths better, isn't it?\"  \"It is,\" Firenze agreed, \"unless all you need is to stay alive long enough to drink something else -- something that will bring you back to full strength and power -- something that will mean you can never die. Mr. Potter, do you know what is hidden in the school at this very moment?\"  \"The Sorcerer's Stone! Of course -- the Elixir of Life! But I don't understand who --\"  \"Can you think of nobody who has waited many years to return to power, who has clung to life, awaiting their chance?\"  It was as though an iron fist had clenched suddenly around Harry's heart. Over the rustling of the trees, he seemed to hear once more what Hagrid had told him on the night they had met: \"Some say he died. Codswallop, in my opinion. Dunno if he had enough human left in him to die.\"  \"Do you mean,\" Harry croaked, \"that was Vol-\"  \"Harry! Harry, are you all right?\"  Hermione was running toward them down the path, Hagrid puffing along behind her.  \"I'm fine,\" said Harry, hardly knowing what he was saying. \"The unicorn's dead, Hagrid, it's in that clearing back there.\"  \"This is where I leave you,\" Firenze murmured as Hagrid hurried off to examine the unicorn. \"You are safe now.\"  Harry slid off his back.  \"Good luck, Harry Potter,\" said Firenze. \"The planets have been read wrongly before now, even by centaurs. I hope this is one of those times.\"  He turned and cantered back into the depths of the forest, leaving Harry shivering behind him.  Ron had fallen asleep in the dark common room, waiting for them to return. He shouted something about Quidditch fouls when Harry roughly shook him awake. In a matter of seconds, though, he was wide-eyed as Harry began to tell him and Hermione what had happened in the forest."
}