{
  "id": "a940f215bf641cf787edbc7a0ba53a981efa7083",
  "text": " No one moving. I watched a long time. No living man ever lay so still.    Did you see any blood?    Well, no,  Will admitted.   Did you see any weapons?    Some swords, a few bows. One man had an axe. Heavy-looking, double-bladed, a cruel piece of iron. It was on the ground beside him, right by his hand.    Did you make note of the position of the bodies?   Will shrugged.  A couple are sitting up against the rock. Most of them on the ground. Fallen, like.    Or sleeping,  Royce suggested.   Fallen,  Will insisted.  There’s one woman up an ironwood, half-hid in the branches. A far-eyes.  He smiled thinly.  I took care she never saw me. When I got closer, I saw that she wasn’t moving neither.  Despite himself, he shivered.   You have a chill?  Royce asked.   Some,  Will muttered.  The wind, m’lord.   The young knight turned back to his grizzled man-at-arms. Frostfallen leaves whispered past them, and Royce’s destrier moved restlessly.  What do you think might have killed these men, Gared?  Ser Waymar asked casually. He adjusted the drape of his long sable cloak.   It was the cold,  Gared said with iron certainty.  I saw men freeze last winter, and the one before, when I was half a boy. Everyone talks about snows forty foot deep, and how the ice wind comes howling out of the north, but the real enemy is the cold. It steals up on you quieter than Will, and at first you shiver and your teeth chatter and you stamp your feet and dream of mulled wine and nice hot fires. It burns, it does. Nothing burns like the cold. But only for a while. Then it gets inside you and starts to fill you up, and after a while you don’t have the strength to fight it. It’s easier just to sit down or go to sleep. They say you don’t feel any pain toward the end. First you go weak and drowsy, and everything starts to fade, and then it’s like sinking into a sea of warm milk. Peaceful, like.    Such eloquence, Gared,  Ser Waymar observed.  I never suspected you had it in you.    I’ve had the cold in me too, lordling.  Gared pulled back his hood, giving Ser Waymar a good long look at the stumps where his ears had been.  Two ears, three toes, and the little finger off my left hand. I got off light. We found my brother frozen at his watch, with a smile on his face.   Ser Waymar shrugged.  You ought dress more warmly, Gared.   Gared glared at the lordling, the scars around his ear holes flushed red with anger where Maester Aemon had cut the ears away.  We’ll see how warm you can dress when the winter comes.  He pulled up his hood and hunched over his garron, silent and sullen.   If Gared said it was the cold…  Will began.   Have you drawn any watches this past week, Will?    Yes, m’lord.  There never was a week when he did not draw a dozen bloody watches. What was the man driving at?   And how did you find the Wall?    Weeping,  Will said, frowning. He saw it clear enough, now that the lordling had pointed it out.  They couldn’t have froze. Not if the Wall was weeping. It wasn’t cold enough.   Royce nodded.  Bright lad. We’ve had a few light frosts this past week, and a quick flurry of snow now and then, but surely no cold fierce enough to kill eight grown men. Men clad in fur and leather, let me remind you, with shelter near at hand, and the means of making fire.  The knight’s smile was cocksure.  Will, lead us there. I would see these dead men for myself.   And then there was nothing to be done for it. The order had been given, and honor bound them to obey.  Will went in front, his shaggy little garron picking the way carefully through the undergrowth. A light snow had fallen the night before, and there were stones and roots and hidden sinks lying just under its crust, waiting for the careless and the unwary. Ser Waymar Royce came next, his great black destrier snorting impatiently. The warhorse was the wrong mount for ranging, but try and tell that to the lordling. Gared brought up the rear. The old man-at-arms muttered to himself as he rode.  Twilight deepened. The cloudless sky turned a deep purple, the color of an old bruise, then faded to black. The stars began to come out. A half-moon rose. Will was grateful for the light.   We can make a better pace than this, surely,  Royce said when the moon was full risen.   Not with this horse,  Will said. Fear had made him insolent.  Perhaps my lord would care to take the lead?   Ser Waymar Royce did not deign to reply.  Somewhere off in the wood a wolf howled.  Will pulled his garron over beneath an ancient gnarled ironwood and dismounted.   Why are you stopping?  Ser Waymar asked.   Best go the rest of the way on foot, m’lord. It’s just over that ridge.   Royce paused a moment, staring off into the distance, his face reflective. A cold wind whispered through the trees. His great sable cloak stirred behind like something half-alive.   There’s something wrong here,  Gared muttered.  The young knight gave him a disdainful smile.  Is there?    Can’t you feel it?  Gared asked.  Listen to the darkness."
}