{
  "id": "a964274a436f9ea474b59942524a800bb354cd45",
  "text": "  Ser Rodrik might let me go. Maester Luwin never would.   Sitting cross-legged under the weirwood, Jojen Reed regarded him solemnly.  It would be good if you left Winterfell, Bran.    It would?    Yes. And sooner rather than later.    My brother has the greensight,  said Meera.  He dreams things that haven’t happened, but sometimes they do.    There is no sometimes, Meera.  A look passed between them; him sad, her defiant.   Tell me what’s going to happen,  Bran said.   I will,  said Jojen,  if you’ll tell me about your dreams.   The godswood grew quiet. Bran could hear leaves rustling, and Hodor’s distant splashing from the hot pools. He thought of the golden man and the three-eyed crow, remembered the crunch of bones between his jaws and the coppery taste of blood.  I don’t have dreams. Maester Luwin gives me sleeping draughts.    Do they help?    Sometimes.   Meera said,  All of Winterfell knows you wake at night shouting and sweating, Bran. The women talk of it at the well, and the guards in their hall.    Tell us what frightens you so much,  said Jojen.   I don’t want to. Anyway, it’s only dreams. Maester Luwin says dreams might mean anything or nothing.    My brother dreams as other boys do, and those dreams might mean anything,  Meera said,  but the green dreams are different.   Jojen’s eyes were the color of moss, and sometimes when he looked at you he seemed to be seeing something else. Like now.  I dreamed of a winged wolf bound to earth with grey stone chains,  he said.  It was a green dream, so I knew it was true. A crow was trying to peck through the chains, but the stone was too hard and his beak could only chip at them.    Did the crow have three eyes?   Jojen nodded.  Summer raised his head from Bran’s lap, and gazed at the mudman with his dark golden eyes.   When I was little I almost died of greywater fever. That was when the crow came to me.    He came to me after I fell,  Bran blurted.  I was asleep for a long time. He said I had to fly or die, and I woke up, only I was broken and I couldn’t fly after all.    You can if you want to.  Picking up her net, Meera shook out the last tangles and began arranging it in loose folds.   You are the winged wolf, Bran,  said Jojen.  I wasn’t sure when we first came, but now I am. The crow sent us here to break your chains.    Is the crow at Greywater?    No. The crow is in the north.    At the Wall?  Bran had always wanted to see the Wall. His bastard brother Jon was there now, a man of the Night’s Watch.   Beyond the Wall.  Meera Reed hung the net from her belt.  When Jojen told our lord father what he’d dreamed, he sent us to Winterfell.    How would I break the chains, Jojen?  Bran asked.   Open your eye.    They are open Can’t you see?    Two are open.  Jojen pointed.  One, two.    I only have two.    You have three. The crow gave you the third, but you will not open it.  He had a slow soft way of speaking.  With two eyes you see my face. With three you could see my heart. With two you can see that oak tree there. With three you could see the acorn the oak grew from and the stump that it will one day become. With two you see no farther than your walls. With three you would gaze south to the Summer Sea and north beyond the Wall.   Summer got to his feet.  I don’t need to see so far.  Bran made a nervous smile.  I’m tired of talking about crows. Let’s talk about wolves. Or lizard-lions. Have you ever hunted one, Meera? We don’t have them here.   Meera plucked her frog spear out of the bushes.  They live in the water. In slow streams and deep swamps—   Her brother interrupted.  Did you dream of a lizard-lion?    No,  said Bran.  I told you, I don’t want—    Did you dream of a wolf?   He was making Bran angry.  I don’t have to tell you my dreams. I’m the prince. I’m the Stark in Winterfell.    Was it Summer?    You be quiet.    The night of the harvest feast, you dreamed you were Summer in the godswood, didn’t you?    Stop it!  Bran shouted. Summer slid toward the weirwood, his white teeth bared.  Jojen Reed took no mind.  When I touched Summer, I felt you in him. just as you are in him now.    You couldn’t have. I was in bed. I was sleeping.    You were in the godswood, all in grey.    It was only a bad dream…   Jojen stood.  I felt you. I felt you fall. Is that what scares you, the falling?   The falling, Bran thought, and the golden man, the queen’s brother, he scares me too, but mostly the falling. He did not say it, though. How could he? He had not been able to tell Ser Rodrik or Maester Luwin, and he could not tell the Reeds either. If he didn’t talk about it, maybe he would forget. He had never wanted to remember. It might not even be a true remembering.   Do you fall every night, Bran?  Joien asked quietly.  A low rumbling growl rose from Summer’s throat, and there was no play in it. He stalked forward, all teeth and hot eyes. Meera stepped between the wolf and her brother, spear in hand.  Keep him back, Bran.    Jojen is making him angry.   Meera shook out her net."
}