{
  "id": "a9dd7b2efcfd6a20c4866e9c81bb4576230da0e9",
  "text": "    The Others take your mild snows,  Robert swore.  What will this place be like in winter? I shudder to think.    The winters are hard,  Ned admitted.  But the Starks will endure. We always have.    You need to come south,  Robert told him.  You need a taste of summer before it flees. In Highgarden there are fields of golden roses that stretch away as far as the eye can see. The fruits are so ripe they explode in your mouth—melons, peaches, fireplums, you’ve never tasted such sweetness. You’ll see, I brought you some. Even at Storm’s End, with that good wind off the bay, the days are so hot you can barely move. And you ought to see the towns, Ned! Flowers everywhere, the markets bursting with food, the summerwines so cheap and so good that you can get drunk just breathing the air. Everyone is fat and drunk and rich.  He laughed and slapped his own ample stomach a thump.  And the girls, Ned!  he exclaimed, his eyes sparkling.  I swear, women lose all modesty in the heat. They swim naked in the river, right beneath the castle. Even in the streets, it’s too damn hot for wool or fur, so they go around in these short gowns, silk if they have the silver and cotton if not, but it’s all the same when they start sweating and the cloth sticks to their skin, they might as well be naked.  The king laughed happily.  Robert Baratheon had always been a man of huge appetites, a man who knew how to take his pleasures. That was not a charge anyone could lay at the door of Eddard Stark. Yet Ned could not help but notice that those pleasures were taking a toll on the king. Robert was breathing heavily by the time they reached the bottom of the stairs, his face red in the lantern light as they stepped out into the darkness of the crypt.   Your Grace,  Ned said respectfully. He swept the lantern in a wide semicircle. Shadows moved and lurched. Flickering light touched the stones underfoot and brushed against a long procession of granite pillars that marched ahead, two by two, into the dark. Between the pillars, the dead sat on their stone thrones against the walls, backs against the sepulchres that contained their mortal remains.  She is down at the end, with Father and Brandon.   He led the way between the pillars and Robert followed wordlessly, shivering in the subterranean chill. It was always cold down here. Their footsteps rang off the stones and echoed in the vault overhead as they walked among the dead of House Stark. The Lords of Winterfell watched them pass. Their likenesses were carved into the stones that sealed the tombs. In long rows they sat, blind eyes staring out into eternal darkness, while great stone direwolves curled round their feet. The shifting shadows made the stone figures seem to stir as the living passed by.  By ancient custom an iron longsword had been laid across the lap of each who had been Lord of Winterfell, to keep the vengeful spirits in their crypts. The oldest had long ago rusted away to nothing, leaving only a few red stains where the metal had rested on stone. Ned wondered if that meant those ghosts were free to roam the castle now. He hoped not. The first Lords of Winterfell had been men hard as the land they ruled. In the centuries before the Dragonlords came over the sea, they had sworn allegiance to no man, styling themselves the Kings in the North.  Ned stopped at last and lifted the oil lantern. The crypt continued on into darkness ahead of them, but beyond this point the tombs were empty and unsealed; black holes waiting for their dead, waiting for him and his children. Ned did not like to think on that.  Here,  he told his king.  Robert nodded silently, knelt, and bowed his head.  There were three tombs, side by side. Lord Rickard Stark, Ned’s father, had a long, stern face. The stonemason had known him well. He sat with quiet dignity, stone fingers holding tight to the sword across his lap, but in life all swords had failed him. In two smaller sepulchres on either side were his children.  Brandon had been twenty when he died, strangled by order of the Mad King Aerys Targaryen only a few short days before he was to wed Catelyn Tully of Riverrun. His father had been forced to watch him die. He was the true heir, the eldest, born to rule.  Lyanna had only been sixteen, a child-woman of surpassing loveliness. Ned had loved her with all his heart. Robert had loved her even more. She was to have been his bride.   She was more beautiful than that,  the king said after a silence. His eyes lingered on Lyanna’s face, as if he could will her back to life. Finally he rose, made awkward by his weight.  Ah, damn it, Ned, did you have to bury her in a place like this?  His voice was hoarse with remembered grief.  She deserved more than darkness…    She was a Stark of Winterfell,  Ned said quietly.  This is her place.    She should be on a hill somewhere, under a fruit tree, with the sun and clouds above her and the rain to wash her clean.    I was with her when she died,  Ned reminded the king.  She wanted to come home, to rest beside Brandon and Father."
}