{
  "id": "aa2c5ced5652f9b5648553d9ca073248786c88f4",
  "text": " A second encampment lay close beyond her own; five times the size, sprawling and chaotic, this second camp had no ditches, no tents, no sentries, no horselines. Those who had horses or mules slept beside them, for fear they might be stolen. Goats, sheep, and half-starved dogs wandered freely amongst hordes of women, children, and old men. Dany had left Astapor in the hands of a council of former slaves led by a healer, a scholar, and a priest. Wise men all, she thought, and just. Yet even so, tens of thousands preferred to follow her to Yunkai, rather than remain behind in Astapor. I gave them the city, and most of them were too frightened to take it.  The raggle-taggle host of freedmen dwarfed her own, but they were more burden than benefit. Perhaps one in a hundred had a donkey, a camel, or an ox; most carried weapons looted from some slaver’s armory, but only one in ten was strong enough to fight, and none was trained. They ate the land bare as they passed, like locusts in sandals. Yet Dany could not bring herself to abandon them as Ser Jorah and her bloodriders urged. I told them they were free. I cannot tell them now they are not free to join me. She gazed at the smoke rising from their cookfires and swallowed a sigh. She might have the best footsoldiers in the world, but she also had the worst.  Arstan Whitebeard stood outside the entrance of her tent, while Strong Belwas sat crosslegged on the grass nearby, eating a bowl of figs. On the march, the duty of guarding her fell upon their shoulders. She had made Jhogo, Aggo, and Rakharo her kos as well as her bloodriders, and just now she needed them more to command her Dothraki than to protect her person. Her khalasar was tiny, some thirty-odd mounted warriors, and most of them braidless boys and bentback old men. Yet they were all the horse she had, and she dared not go without them. The Unsullied might be the finest infantry in all the world, as Ser Jorah claimed, but she needed scouts and outriders as well.   Yunkai will have war,  Dany told Whitebeard inside the pavilion. Irri and Jhiqui had covered the floor with carpets while Missandei lit a stick of incense to sweeten the dusty air. Drogon and Rhaegal were asleep atop some cushions, curled about each other, but Viserion perched on the edge of her empty bath.  Missandei, what language will these Yunkai’i speak, Valyrian?    Yes, Your Grace,  the child said.  A different dialect than Astapor’s, yet close enough to understand. The slavers name themselves the Wise Masters.    Wise?  Dany sat crosslegged on a cushion, and Viserion spread his white-and-gold wings and flapped to her side.  We shall see how wise they are,  she said as she scratched the dragon’s scaly head behind the horns.  Ser Jorah Mormont returned an hour later, accompanied by three captains of the Stormcrows. They wore black feathers on their polished helms, and claimed to be all equal in honor and authority. Dany studied them as Irri and Jhiqui poured the wine. Prendahl na Ghezn was a thickset Ghiscari with a broad face and dark hair going grey; Sallor the Bald had a twisting scar across his pale Qartheen cheek; and Daario Naharis was flamboyant even for a Tyroshi. His beard was cut into three prongs and dyed blue, the same color as his eyes and the curly hair that fell to his collar. His pointed mustachios were painted gold. His clothes were all shades of yellow; a foam of Myrish lace the color of butter spilled from his collar and cuffs, his doublet was sewn with brass medallions in the shape of dandelions, and ornamental goldwork crawled up his high leather boots to his thighs. Gloves of soft yellow suede were tucked into a belt of gilded rings, and his fingernails were enameled blue.  But it was Prendahl na Ghezn who spoke for the sellswords.  You would do well to take your rabble elsewhere,  he said.  You took Astapor by treachery, but Yunkai shall not fall so easily.    Five hundred of your Stormcrows against ten thousand of my Unsullied,  said Dany.  I am only a young girl and do not understand the ways of war, yet these odds seem poor to me.    The Stormcrows do not stand alone,  said Prendahl.   Stormcrows do not stand at all. They fly, at the first sign of thunder. Perhaps you should be flying now. I have heard that sellswords are notoriously unfaithful. What will it avail you to be staunch, when the Second Sons change sides?    That will not happen,  Prendahl insisted, unmoved.  And if it did, it would not matter. The Second Sons are nothing. We fight beside the stalwart men of Yunkai.    You fight beside bed-boys armed with spears.  When she turned her head, the twin bells in her braid rang softly.  Once battle is joined, do not think to ask for quarter. Join me now, however, and you shall keep the gold the Yunkaii paid you and claim a share of the plunder besides, with greater rewards later when I come into my kingdom. Fight for the Wise Masters, and your wages will be death. Do you imagine that Yunkai will open its gates when my Unsullied are butchering you beneath the walls?     Woman, you bray like an ass, and make no more sense."
}