{
  "id": "aa922328194bd5659a109b9eb0a916b4d4b9de36",
  "text": "\"  No one moved or made a sound except Pettigrew, whose breath was coming in wheezes as he clutched his chest. Black and Lupin were looking at each other. Then, with one movement, they lowered their wands.  \"You're the only person who has the right to decide, Harry,\" said Black. \"But think... think what he did....\"  \"He can go to Azkaban,\" Harry repeated. \"If anyone deserves that place, he does....\"  Pettigrew was still wheezing behind him.  \"Very well,\" said Lupin. \"Stand aside, Harry.\"  Harry hesitated.  \"I'm going to tie him up,\" said Lupin. \"That's all, I swear.\"  Harry stepped out of the way. Thin cords shot from Lupin's wand this time, and next moment, Pettigrew was wriggling on the floor, bound and gagged.  \"But if you transform, Peter,\" growled Black, his own wand pointing at Pettigrew too, \"we will kill you. You agree, Harry?\"  Harry looked down at the pitiful figure on the floor and nodded so that Pettigrew could see him.  \"Right,\" said Lupin, suddenly businesslike. \"Ron, I can't mend bones nearly as well as Madam Pomfrey, so I think it's best if we just strap your leg up until we can get you to the hospital wing.\"  He hurried over to Ron, bent down, tapped Ron's leg with his wand, and muttered, \"Ferula.\" Bandages spun up Ron's leg, strapping it tightly to a splint. Lupin helped him to his feet; Ron put his weight gingerly on the leg and didn't wince.  \"That's better,\" he said. \"Thanks.\"  \"What about Professor Snape?\" said Hermione in a small voice, looking down at Snape's prone figure.  \"There's nothing seriously wrong with him,\" said Lupin, bending over Snape and checking his pulse. \"You were just a little -- overenthusiastic. Still out cold. Er -- perhaps it will be best if we don't revive him until we're safety back in the castle. We can take him like this....\"  He muttered, \"Mobilicorpus.\" As though invisible strings were tied to Snape's wrists, neck, and knees, he was pulled into a standing position, head still lolling unpleasantly, like a grotesque puppet. He hung a few inches above the ground, his limp feet dangling. Lupin picked up the Invisibility Cloak and tucked it safely into his pocket.  \"And two of us should be chained to this,\" said Black, nudging Pettigrew with his toe. \"Just to make sure.\"  \"I'll do it,\" said Lupin.  \"And me,\" said Ron savagely, limping forward.  Black conjured heavy manacles from thin air; soon Pettigrew was upright again, left arm chained to Lupin's right, right arm to Ron's left. Ron's face was set. He seemed to have taken Scabbers's true identity as a personal insult. Crookshanks leapt lightly off the bed and led the way out of the room, his bottlebrush tail held jauntily high.  CHAPTER TWENTY  THE DEMENTOR'S KISS  Harry had never been part of a stranger group. Crookshanks led the way down the stairs; Lupin, Pettigrew, and Ron went next, looking like entrants in a six-legged race. Next came Professor Snape, drifting creepily along, his toes hitting each stair as they descended, held up by his own wand, which was being pointed at him by Sirius. Harry and Hermione brought up the rear.  Getting back into the tunnel was difficult. Lupin, Pettigrew, and Ron had to turn sideways to manage it; Lupin still had Pettigrew covered with his wand. Harry could see them edging awkwardly along the tunnel in single file. Crookshanks was still in the lead. Harry went right after Black, who was still making Snape drift along ahead of them; he kept bumping his lolling head on the low ceiling. Harry had the impression Black was making no effort to prevent this.  \"You know what this means?\" Black said abruptly to Harry as they made their slow progress along the tunnel. \"Turning Pettigrew in?\"  \"You' re free,\" said Harry.  \"Yes...,\" said Black. \"But I'm also -- I don't know if anyone ever told you -- I'm your godfather.\"  \"Yeah, I knew that,\" said Harry.  \"Well... your parents appointed me your guardian,\" said Black stiffly. \"If anything happened to them...\"  Harry waited. Did Black mean what he thought he meant?  \"I'll understand, of course, if you want to stay with your aunt and uncle,\" said Black. \"But... well... think about it. Once my name's cleared... if you wanted a... a different home...\"  Some sort of explosion took place in the pit of Harry's stomach.  \"What -- live with you?\" he said, accidentally cracking his head on a bit of rock protruding from the ceiling. \"Leave the Dursleys?\"  \"Of course, I thought you wouldn't want to,\" said Black quickly. \"I understand, I just thought I'd --\"  \"Are you insane?\" said Harry, his voice easily as croaky as Black's.  \"Of course I want to leave the Dursleys! Have you got a house? When can I move in?\"  Black turned right around to look at him; Snape's head was scraping the ceiling but Black didn't seem to care.  \"You want to?\" he said. \"You mean it?\"  \"Yeah, I mean it!\" said Harry.  Black's gaunt face broke into the first true smile Harry had seen upon it. The difference it made was startling, as though a person ten years younger were shining through the starved mask; for a moment, he was recognizable as the man who had laughed at Harry's parents' wedding."
}