{
  "id": "ab3d1f60318abb2e664a5e940a10d8ab797b87fc",
  "text": " It was they who dared ride beyond the Wall, sweeping through the haunted forest and the icy mountain heights west of the Shadow Tower, fighting wildlings and giants and monstrous snow bears.   Not everyone,  said Halder.  It’s the builders for me. What use would rangers be if the Wall fell down?   The order of builders provided the masons and carpenters to repair keeps and towers, the miners to dig tunnels and crush stone for roads and footpaths, the woodsmen to clear away new growth wherever the forest pressed too close to the Wall. Once, it was said, they had quarried immense blocks of ice from frozen lakes deep in the haunted forest, dragging them south on sledges so the Wall might be raised ever higher. Those days were centuries gone, however; now, it was all they could do to ride the Wall from Eastwatch to the Shadow Tower, watching for cracks or signs of melt and making what repairs they could.   The Old Bear’s no fool,  Dareon observed.  You’re certain to be a builder, and Jon’s certain to be a ranger. He’s the best sword and the best rider among us, and his uncle was the First before he…  His voice trailed off awkwardly as he realized what he had almost said.   Benjen Stark is still First Ranger,  Jon Snow told him, toying with his bowl of blueberries. The rest might have given up all hope of his uncle’s safe return, but not him. He pushed away the berries, scarcely touched, and rose from the bench.   Aren’t you going to eat those?  Toad asked.   They’re yours.  Jon had hardly tasted Hobb’s great feast.  I could not eat another bite.  He took his cloak from its hook near the door and shouldered his way out.  Pyp followed him.  Jon, what is it?    Sam,  he admitted.  He was not at table tonight.    It’s not like him to miss a meal,  Pyp said thoughtfully.  Do you suppose he’s taken ill?    He’s frightened. We’re leaving him.  He remembered the day he had left Winterfell, all the bittersweet farewells; Bran lying broken, Robb with snow in his hair, Arya raining kisses on him after he’d given her Needle.  Once we say our words, we’ll all have duties to attend to. Some of us may be sent away, to Eastwatch or the Shadow Tower. Sam will remain in training, with the likes of Rast and Cuger and these new boys who are coming up the kingsroad. Gods only know what they’ll be like, but you can bet Ser Alliser will send them against him, first chance he gets.   Pyp made a grimace.  You did all you could.    All we could wasn’t enough,  Jon said.  A deep restlessness was on him as he went back to Hardin’s Tower for Ghost. The direwolf walked beside him to the stables. Some of the more skittish horses kicked at their stalls and laid back their ears as they entered. Jon saddled his mare, mounted, and rode out from Castle Black, south across the moonlit night. Ghost raced ahead of him, flying over the ground, gone in the blink of an eye. Jon let him go. A wolf needed to hunt.  He had no destination in mind. He wanted only to ride. He followed the creek for a time, listening to the icy trickle of water over rock, then cut across the fields to the kingsroad. It stretched out before him, narrow and stony and pocked with weeds, a road of no particular promise, yet the sight of it filled Jon Snow with a vast longing. Winterfell was down that road, and beyond it Riverrun and King’s Landing and the Eyrie and so many other places; Casterly Rock, the Isle of Faces, the red mountains of Dorne, the hundred islands of Braavos in the sea, the smoking ruins of old Valyria. All the places that Jon would never see. The world was down that road… and he was here.  Once he swore his vow, the Wall would be his home until he was old as Maester Aemon.  I have not sworn yet,  he muttered. He was no outlaw, bound to take the black or pay the penalty for his crimes. He had come here freely, and he might leave freely… until he said the words. He need only ride on, and he could leave it all behind. By the time the moon was full again, he would be back in Winterfell with his brothers.  Your half brothers, a voice inside reminded him. And Lady Stark, who will not welcome you. There was no place for him in Winterfell, no place in King’s Landing either. Even his own mother had not had a place for him. The thought of her made him sad. He wondered who she had been, what she had looked like, why his father had left her. Because she was a whore or an adulteress, fool. Something dark and dishonorable, or else why was Lord Eddard too ashamed to speak of her?  Jon Snow turned away from the kingsroad to look behind him. The fires of Castle Black were hidden behind a hill, but the Wall was there, pale beneath the moon, vast and cold, running from horizon to horizon.  He wheeled his horse around and started for home.  Ghost returned as he crested a rise and saw the distant glow of lamplight from the Lord Commander’s Tower. The direwolf s muzzle was red with blood as he trotted beside the horse. Jon found himself thinking of Samwell Tarly again on the ride back."
}