{
  "id": "abb1c759bd3082c7d0105006f8bdac9ecffd113b",
  "text": "\" \"Yeah, I know,\" said Ron, who was skipping on every alternate step.  He had had much more difficulty with the curse than Harry, though Moody assured him the effects would wear off by lunchtime.  \"Talk about paranoid. . .\" Ron glanced nervously over his shoulder to check that Moody was definitely out of earshot and went on.  \"No wonder they were glad to get shot of him at the Ministry.  Did you hear him telling Seamus what he did to that witch who shouted 'Boo' behind him on April Fools' Day?  And when are we supposed to read up on resisting the Imperius Curse with everything else we've got to do?\" All the fourth years had noticed a definite increase in the amount of work they were required to do this term.  Professor McGonagall explained why, when the class gave a particularly loud groan at the amount of Transfiguration homework she had assigned. \"You are now entering a most important phase of your magical education!\"  she told them, her eyes glinting dangerously behind her square spectacles.  \"Your Ordinary Wizarding Levels are drawing closer --\" \"We don't take O.W.L.s till fifth year!\" s aid Dean Thomas indignantly. \"Maybe not, Thomas, but believe me, you need all the preparation you can get!  Miss Granger remains the only person in this class who has managed to turn a hedgehog into a satisfactory pincushion.  I might remind you that your pincushion, Thomas, still curls up in fright if anyone approaches it with a pin!\" Hermione, who had turned rather pink again, seemed to be trying not to look too pleased with herself. Harry and Ron were deeply amused when Professor Trelawney told them that they had received top marks for their homework in their next Divination class.  She read out large portions of their predictions, commending them for their unflinching acceptance of the horrors in store for them - but they were less amused when she asked them to do the same thing for the month after next; both of them were running out of ideas for catastrophes. Meanwhile Professor Binns, the ghost who taught History of Magic, had them writing weekly essays on the goblin rebellions of the eighteenth century.  Professor Snape was forcing them to research antidotes.  They took this one seriously, as he had hinted that he might be poisoning one of them before Christmas to see if their antidote worked.  Professor Flitwick had asked them to read three extra books in preparation for their lesson on Summoning Charms. Even Hagrid was adding to their workload.  The Blast-Ended Skrewts were growing at a remarkable pace given that nobody had yet discovered what they ate.  Hagrid was delighted, and as part of their \"project,\" suggested that they come down to his hut on alternate evenings to observe the skrewts and make notes on their extraordinary behavior. \"I will not,\" said Draco Malfoy flatly when Hagrid had proposed this with the air of Father Christmas pulling an extra-large toy out of his sack.  \"I see enough of these foul things during lessons, thanks.\" Hagrid's smile faded off his face. \"Yeh'll do wha' yer told,\" he growled, \"or I'll be takin' a leaf outta Professor Moody's book. . . . I hear yeh made a good ferret, Malfoy.\" The Gryffindors roared with laughter. Malfoy flushed with anger, but apparently the memory of Moody's punishment was still sufficiently painful to stop him from retorting. Harry, Ron, and Hermione returned to the castle at the end of the lesson in high spirits; seeing Hagrid put down Malfoy was particularly satisfying, especially because Malfoy had done his very best to get Hagrid sacked the previous year. When they arrived in the entrance hall, they found themselves unable to proceed owing to the large crowd of students congregated there, all milling around a large sign that had been erected at the foot of the marble staircase.  Ron, the tallest of the three, stood on tiptoe to see over the heads in front of them and read the sign aloud to the other two:   TRIWIZARD TOURNAMENT THE DELEGATIONS FROM BEAUXBATONS AND DURMSTRANG WILL BE ARRIVING AT 6 O'CLOCK ON FRIDAY THE 30TH OF OCTOBER.  LESSONS WILL END HALF AN HOUR EARLY --    \"Brilliant!\" said Harry.  \"It's Potions last thing on Friday!  Snape won't have time to poison us all!\"  STUDENTS WILL RETURN THEIR BAGS AND BOOKS   TO THEIR DORMITORIES AND ASSEMBLE IN FRONT OF THE CASTLE TO GREET OUR GUESTS BEFORE   THE WELCOMING FEAST.  \"Only a week away!\"  said Ernie Macmillan of Hufflepuff, emerging from the crowd, his eyes gleaming.  \"I wonder if Cedric knows?  Think I'll go and tell him. . . .\"  \"Cedric?\" said Ron blankly as Ernie hurried off. \"Diggory,\" said Harry. \"He must be entering the tournament.\" \"That idiot, Hogwarts champion?\"  said Ron as they pushed their way through the chattering crowd toward the staircase. \"He's not an idiot.  You just don't like him because he beat Gryffindor at Quidditch,\" said Hermione.  \"I've heard he's a really good student - and he's a prefect.\" She spoke as though this settled the matter. \"You only like him because he's handsome,\" said Ron scathingly."
}