{
  "id": "ac1a64cbf07c5a9442a30d4a84d78ce1b40e8d50",
  "text": "  Come here, Sansa,  he said, not unkindly, when the septa had gone for her sister.  Sit beside me.  He closed the book.  Septa Mordane returned with Arya squirming in her grasp. Sansa had put on a lovely pale green damask gown and a look of remorse, but her sister was still wearing the ratty leathers and roughspun she’d worn at breakfast.  Here is the other one,  the septa announced.   My thanks, Septa Mordane. I would talk to my daughters alone, if you would be so kind.  The septa bowed and left.   Arya started it,  Sansa said quickly, anxious to have the first word.  She called me a liar and threw an orange at me and spoiled my dress, the ivory silk, the one Queen Cersei gave me when I was betrothed to Prince Joffrey. She hates that I’m going to marry the prince. She tries to spoil everything, Father, she can’t stand for anything to be beautiful or nice or splendid.    Enough, Sansa.  Lord Eddard’s voice was sharp with impatience.  Arya raised her eyes.  I’m sorry, Father. I was wrong and I beg my sweet sister’s forgiveness.   Sansa was so startled that for a moment she was speechless. Finally she found her voice.  What about my dress?    Maybe… I could wash it,  Arya said doubtfully.   Washing won’t do any good,  Sansa said.  Not if you scrubbed all day and all night. The silk is ruined.    Then I’ll… make you a new one,  Arya said.  Sansa threw back her head in disdain.  You? You couldn’t sew a dress fit to clean the pigsties.   Their father sighed.  I did not call you here to talk of dresses. I’m sending you both back to Winterfell.   For the second time Sansa found herself too stunned for words. She felt her eyes grow moist again.   You can’t,  Arya said.   Please, Father,  Sansa managed at last.  Please don’t.   Eddard Stark favored his daughters with a tired smile.  At last we’ve found something you agree on.    I didn’t do anything wrong,  Sansa pleaded with him.  I don’t want to go back.  She loved Mng’s Landing; the pagaentry of the court, the high lords and ladies in their velvets and silks and gemstones, the great city with all its people. The tournament had been the most magical time of her whole life, and there was so much she had not seen yet, harvest feasts and masked balls and mummer shows. She could not bear the thought of losing it all.  Send Arya away, she started it, Father, I swear it. I’ll be good, you’ll see, just let me stay and I promise to be as fine and noble and courteous as the queen.   Father’s mouth twitched strangely.  Sansa, I’m not sending you away for fighting, though the gods know I’m sick of you two squabbling. I want you back in Winterfell for your own safety. Three of my men were cut down like dogs not a league from where we sit, and what does Robert do? He goes hunting.   Arya was chewing at her lip in that disgusting way she had.  Can we take Syrio back with us?    Who cares about your stupid dancing master?  Sansa flared.  Father, I only just now remembered, I can’t go away, I’m to marry Prince Joffrey.  She tried to smile bravely for him.  I love him, Father, I truly truly do, I love him as much as Queen Naerys loved Prince Aemon the Dragonknight, as much as Jonquil loved Ser Florian. I want to be his queen and have his babies.    Sweet one,  her father said gently,  listen to me. When you’re old enough, I will make you a match with a high lord who’s worthy of you, someone brave and gentle and strong. This match with Joffrey was a terrible mistake. That boy is no Prince Aemon, you must believe me.    He is!  Sansa insisted.  I don’t want someone brave and gentle, I want him. We’ll be ever so happy, just like in the songs, you’ll see. I’ll give him a son with golden hair, and one day he’ll be the king of all the realm, the greatest king that ever was, as brave as the wolf and as proud as the lion.   Arya made a face.  Not if Joffrey’s his father,  she said.  He’s a liar and a craven and anyhow he’s a stag, not a lion.   Sansa felt tears in her eyes.  He is not! He’s not the least bit like that old drunken king,  she screamed at her sister, forgetting herself in her grief.  Father looked at her strangely.  Gods,  he swore softly,  out of the mouth of babes…  He shouted for Septa Mordane. To the girls he said,  I am looking for a fast trading galley to take you home. These days, the sea is safer than the kingsroad. You will sail as soon as I can find a proper ship, with Septa Mordane and a complement of guards… and yes, with Syrio Forel, if he agrees to enter my service. But say nothing of this. It’s better if no one knows of our plans. We’ll talk again tomorrow.   Sansa cried as Septa Mordane marched them down the steps. They were going to take it all away; the tournaments and the court and her prince, everything, they were going to send her back to the bleak grey walls of Winterfell and lock her up forever. Her life was over before it had begun.   Stop that weeping, child,  Septa Mordane said sternly.  I am certain your lord father knows what is best for you.    It won’t be so bad, Sansa,  Arya said."
}