{
  "id": "ac315aac3ffaea14fb5b3081a77fcadb0bb6e112",
  "text": " \"We should get some stuff to send up to Snuffles,\" Harry muttered. \"Good idea,\" said Ron. \"Give Pig something to do. You couldn't give us a bit of extra food, could you?\"  he said to the surrounding elves, and they bowed delightedly and hurried off to get some more. \"Dobby, where's Winky?\" said Hermione, who was looking around. \"Winky is over there by the fire, miss,\" said Dobby quietly, his ears drooping slightly. \"Oh dear,\" said Hermione as she spotted Winky. Harry looked over at the fireplace too.  Winky was sitting on the same stool as last time, but she had allowed herself to become so filthy that she was not immediately distinguishable from the smoke-blackened brick behind her.  Her clothes were ragged and unwashed.  She was clutching a bottle of butterbeer and swaying slightly on her stool, staring into the fire.  As they watched her, she gave an enormous hiccup. \"Winky is getting through six bottles a day now,\" Dobby whispered to Harry. \"Well, it's not strong, that stuff,\" Harry said. But Dobby shook his head. \"'Tis strong for a house-elf, sir,\" he said. Winky hiccuped again. The elves who had brought the eclairs gave her disapproving looks as they returned to work. \"Winky is pining, Harry Potter,\" Dobby whispered sadly.  \"Winky wants to go home. Winky still thinks Mr. Crouch is her master, sir, and nothing Dobby says will persuade her that Professor Dumbledore is her master now.\" \"Hey, Winky,\" said Harry, struck by a sudden inspiration, walking over to her, and bending down, \"you don't know what Mr. Crouch might be up to, do you?  Because he's stopped turning up to judge the Triwizard Tournament.\" Winky's eyes flickered. Her enormous pupils focused on Harry.  She swayed slightly again and then said,  \"M - Master is stopped - hic - coming?\" \"Yeah,\" said Harry, \"we haven't seen him since the first task.  The Daily Prophet's saying he's ill.\" Winky swayed some more, staring blurrily at Harry. \"Master- hic- ill?\" Her bottom lip began to tremble. \"But we're not sure if that's true,\" said Hermione quickly. \"Master is needing his - hie - Winky!\"  whimpered the elf.  \"Master cannot - hic - manage - hic - all by himself. . . .\" \"Other people manage to do their own housework, you know, Winky,\" Hermione said severely. \"Winky - hic - is not only - hic - doing housework for Mr. Crouch!\"  Winky squeaked indignantly, swaying worse than ever and slopping butterbeer down her already heavily stained blouse.  \"Master is - hic - trusting Winky with - hic - the most important - hic - the most secret...\" \"What?\" said Harry. But Winky shook her head very hard, spilling more butterbeer down herself. \"Winky keeps - hic - her master's secrets,\" she said mutinously, swaying very heavily now, frowning up at Harry with her eyes crossed.  \"You is - hic - nosing, you is.\" \"Winky must not talk like that to Harry Potter!\"  said Dobby angrily.  \"Harry Potter is brave and noble and Harry Potter is not nosy!\" \"He is nosing - hic - into my master's - hic - private and secret - hic - Winky is a good house-elf- hic - Winky keeps her silence - hic - people trying to - hic - pry and poke - hic -\" Winky's eyelids drooped and suddenly, without warning, she slid off her stool into the hearth, snoring loudly.  The empty bottle of butterbeer rolled away across the stone-flagged floor.  Half a dozen house-elves came hurrying forward, looking disgusted.  One of them picked up the bottle; the others covered Winky with a large checked tablecloth and tucked the ends in neatly, hiding her from view. \"We is sorry you had to see that, sirs and miss!\"  squeaked a nearby elf, shaking his head and looking very ashamed.  \"We is hoping you will not judge us all by Winky, sirs and miss!\" \"She's unhappy!\" said Hermione, exasperated.  \"Why don't you try and cheer her up instead of covering her up?\" \"Begging your pardon, miss,\" said the house-elf, bowing deeply again, \"but house-elves has no right to be unhappy when there is work to be done and masters to be served.\" \"Oh for heavens sake!\"  Hermione cried.  \"Listen to me, all of you!  You've got just as much right as wizards to be unhappy!  You've got the right to wages and holidays and proper clothes, you don't have to do everything you're told - look at Dobby!\" \"Miss will please keep Dobby out of this,\" Dobby mumbled, looking scared.  The cheery smiles had vanished from the faces of the house-elves around the kitchen.  They were suddenly looking at Hermione as though she were mad and dangerous. \"We has your extra food!\"  squeaked an elf at Harry's elbow, and he shoved a large ham, a dozen cakes, and some fruit into Harry's arms.  \"Good-bye!\" The house-elves crowded around Harry, Ron, and Hermione and began shunting them out of the kitchen, many little hands pushing in the smalls of their backs. \"Thank you for the socks, Harry Potter!\"  Dobby called miserably from the hearth, where he was standing next to the lumpy tablecloth that was Winky. \"You couldn't keep your mouth shut, could you, Hermione?\"  said Ron angrily as the kitchen door slammed shut behind them."
}