{
  "id": "ac5289928467454138aea91cc545c57ed3e1f849",
  "text": "\"  And they fled  before  the  wrath of  Isildur, and did not dare to go  forth to war on  Sauron's  part; and they hid themselves in secret places in  the mountains and had no dealings with other men, but slowly dwindled in the  barren hills. And the  terror of the Sleepless Dead lies  about  the Hill of  Erech and all places  where that people  lingered. But that  way I  must go,  since there are none living to help me.'       He stood up.  'Come!' he  cried, and drew his sword, and it  flashed in  the twilit hall of the Burg. 'To the Stone of Erech! I seek the Paths of the  Dead. Come with me who will!'       Legolas  and Gimli  made no answer,  but they rose and followed Aragorn  from the  hall.  On  the green  there waited,  still and silent, the  hooded  Rangers.  Legolas  and Gimli  mounted.  Aragorn  sprang upon  Roheryn.   Then  Halbarad lifted a great horn, and the blast of it echoed in Helm's Deep; and  with that they leapt away, riding down the Coomb like thunder, while all the  men that were left on Dike or Burg stared in amaze.       And  while Thjoden  went  by slow paths in the hills, the Grey  Company  passed  swiftly  over the plain, and on the next day  in the  afternoon they  came to Edoras;  and there they halted only briefly, ere they passed up  the  valley, and so came to Dunharrow as darkness fell.       The  Lady  Jowyn greeted  them  and  was  glad of  their coming; for no  mightier men had she seen than the D®nedain and the fair sons of Elrond; but  on Aragorn most of  all her eyes rested.  And when  they sat at supper  with  her, they talked  together, and  she heard  of  all that  had  passed  since  Thjoden rode away, concerning which only hasty tidings  had yet reached her;  and when  she  heard of the battle in Helm's Deep and the great slaughter of  their foes,  and of  the charge of  Thjoden and  his knights, then  her eyes  shone.       But at last she said:  'Lords, you are weary and  shall now  go to  your  beds  with  such ease  as can  be contrived in  haste.  But  tomorrow fairer    ####-housing shall be found for you.'       But Aragorn said:  'Nay, lady, be  not troubled  for  us! If we may lie  here tonight and break our fast tomorrow, it  will be enough. For  I ride on  an errand most urgent, and with the first light of morning we must go.'       She smiled  on him and said: 'Then it was kindly done, lord, to ride so  many miles out of your  way to bring tidings to Jowyn, and to speak with her  in her exile.'       'Indeed no man would count such a  journey  wasted,' said Aragorn; 'and  yet, lady, I could not have come hither, if  it were not that the road which  I must take leads me to Dunharrow.'       And she answered  as one  that likes not what is said: \"Then, lord, you   are astray; for out of  Harrowdale no road  runs east or south; and  you had  best return as you came.'       'Nay, lady,' said  he, 'I am  not astray; for I walked in this land ere  you were born to grace it. There is a road out of this valley, and that road  I shall take. Tomorrow I shall ride by the Paths of the Dead.'       Then she stared at him as one that is stricken,  and her face blanched,  and  for long she  spoke no more, while all sat silent. 'But, Aragorn,'  she  said at last,  'is it  then your errand to  seek death? For that  is all that  you will find on that road. They do not suffer the living to pass.'       'They may suffer me  to pass,' said Aragorn; 'but at the  least I  will  adventure it. No other road will serve.'       'But  this  is  madness,' she  said.  'For  here are  men of renown and  prowess, whom you should not take into the shadows, but  should lead to war,  where men are needed. I beg you to remain and ride with my brother; for then  all our hearts will be gladdened, and our hope be the brighter.'       'It is  not madness, lady,' he answered; 'for I go on a path appointed.  But those who follow  me do so of  their free will; and if they wish now  to  remain and ride  with the  Rohirrim,  they  may do so. But  I shall take the  Paths of the Dead, alone, if needs be.'       Then they said no more, and they ate in silence; but her eyes were ever   upon Aragorn, and the others  saw that she  was in great torment of mind. At   length they arose, and took their leave of the Lady, and thanked her for her   care, and went to their rest.       But as Aragorn came to the booth where he was to lodge with Legolas and  Gimli, and  his companions had  gone in. there came the Lady Jowyn after him  and called to him. He turned and saw her  as a glimmer in  the night, for she   ####-was clad in white; but her eyes were on fire.       'Aragorn,' she said, 'why will you go on this deadly road?'       'Because I must,' he said. 'Only so can I see any hope of doing my part  in the war against Sauron. I do not choose paths of peril, Jowyn. Were I  to  go where my  heart dwells, far  in the North I would now be wandering in the  fair valley of Rivendell.'       For a while she was silent, as if pondering what this  might mean."
}