{
  "id": "aca4ede50d087a6c01478f19bfbd65576ebbb196",
  "text": " The heart lies and the head plays tricks with us, but the eyes see true. Look with your eyes. Hear with your ears. Taste with your mouth. Smell with your nose. Feel with your skin. Then comes the thinking, afterward, and in that way knowing the truth.    Just so,  said Arya, grinning.  Syrio Forel allowed himself a smile.  I am thinking that when we are reaching this Winterfell of yours, it will be time to put this needle in your hand.    Yes!  Arya said eagerly.  Wait till I show Jon—   Behind her the great wooden doors of the Small Hall flew open with a resounding crash. Arya whirled.  A knight of the Kingsguard stood beneath the arch of the door with five Lannister guardsmen arrayed behind him. He was in full armor, but his visor was up. Arya remembered his droopy eyes and rustcolored whiskers from when he had come to Winterfell with the king: Ser Meryn Trant. The red cloaks wore mail shirts over boiled leather and steel caps with lion crests.  Arya Stark,  the knight said,  come with us, child.   Arya chewed her lip uncertainly.  What do you want?    Your father wants to see you.   Arya took a step forward, but Syrio Forel held her by the arm.  And why is it that Lord Eddard is sending Lannister men in the place of his own? I am wondering.    Mind your place, dancing master,  Ser Meryn said.  This is no concern of yours.    My father wouldn’t send you,  Arya said. She snatched up her stick sword. The Lannisters laughed.   Put down the stick, girl,  Ser Meryn told her.  I am a Sworn Brother of the Kingsguard, the White Swords.    So was the Kingslayer when he killed the old king,  Arya said.  I don’t have to go with you if I don’t want.   Ser Meryn Trant ran out of patience.  Take her,  he said to his men. He lowered the visor of his helm.  Three of them started forward, chainmail clinking softly with each step. Arya was suddenly afraid. Fear cuts deeper than swords, she told herself, to slow the racing of her heart.  Syrio Forel stepped between them, tapping his wooden sword lightly against his boot.  You will be stopping there. Are you men or dogs that you would threaten a child?    Out of the way, old man,  one of the red cloaks said.  Syrio’s stick came whistling up and rang against his helm.  I am Syrio Forel, and you will now be speaking to me with more respect.    Bald bastard.  The man yanked free his longsword. The stick moved again, blindingly fast. Arya heard a loud crack as the sword went clattering to the stone floor.  My hand,  the guardsman yelped, cradling his broken fingers.   You are quick, for a dancing master,  said Ser Meryn.   You are slow, for a knight,  Syrio replied.   Kill the Braavosi and bring me the girl,  the knight in the white armor commanded.  Four Lannister guardsmen unsheathed their swords. The fifth, with the broken fingers, spat and pulled free a dagger with his left hand.  Syrio Forel clicked his teeth together, sliding into his water dancer’s stance, presenting only his side to the foe.  Arya child,  he called out, never looking, never taking his eyes off the Lannisters,  we are done with dancing for the day. Best you are going now. Run to your father.   Arya did not want to leave him, but he had taught her to do as he said.  Swift as a deer,  she whispered.   Just so,  said Syrio Forel as the Lannisters closed.  Arya retreated, her own sword stick clutched tightly in her hand. Watching him now, she realized that Syrio had only been toying with her when they dueled. The red cloaks came at him from three sides with steel in their hands. They had chainmail over their chest and arms, and steel codpieces sewn into their pants, but only leather on their legs. Their hands were bare, and the caps they wore had noseguards, but no visor over the eyes.  Syrio did not wait for them to reach him, but spun to his left. Arya had never seen a man move as fast. He checked one sword with his stick and whirled away from a second. Off balance, the second man lurched into the first. Syrio put a boot to his back and the red cloaks went down together. The third guard came leaping over them, slashing at the water dancer’s head. Syrio ducked under his blade and thrust upward. The guardsman fell screaming as blood welled from the wet red hole where his left eye had been.  The fallen men were getting up. Syrio kicked one in the face and snatched the steel cap off the other’s head. The dagger man stabbed at him. Syrio caught the thrust in the helmet and shattered the man’s kneecap with his stick. The last red cloak shouted a curse and charged, hacking down with both hands on his sword. Syrio rolled right, and the butcher’s cut caught the helmetless man between neck and shoulder as he struggled to his knees. The longsword crunched through mail and leather and flesh. The man on his knees shrieked. Before his killer could wrench free his blade, Syrio jabbed him in the apple of his throat. The guardsman gave a choked cry and staggered back, clutching at his neck, his face blackening.  Five men were down, dead, or dying by the time Arya reached the back door that opened on the kitchen."
}