{
  "id": "acc75f0de2c76873358b90e2dc2deb580364ce84",
  "text": " Robb, walk out of here.   Lord Walder snorted.  And why would I let him do that?   She pressed the blade deeper into Jinglebell’s throat. The lackwit rolled his eyes at her in mute appeal. A foul stench assailed her nose, but she paid it no more mind than she did the sullen ceaseless pounding of that drum, boom doom boom doom boom doom. Ser Ryman and Black Walder were circling round her back, but Catelyn did not care. They could do as they wished with her; imprison her, rape her, kill her, it made no matter. She had lived too long, and Ned was waiting. It was Robb she feared for.  On my honor as a Tully,  she told Lord Walder,  on my honor as a Stark, I will trade your boy’s life for Robb’s. A son for a son.  Her hand shook so badly she was ringing Jinglebell’s head.  Boom, the drum sounded, boom doom boom doom. The old man’s lips went in and out. The knife trembled in Catelyn’s hand, slippery with sweat.  A son for a son, heh,  he repeated.  But that’s a grandson… and he never was much use.   A man in dark armor and a pale pink cloak spotted with blood stepped up to Robb.  Jaime Lannister sends his regards.  He thrust his longsword through her son’s heart, and twisted.  Robb had broken his word, but Catelyn kept hers. She tugged hard on Aegon’s hair and sawed at his neck until the blade grated on bone. Blood ran hot over her fingers. His little bells were ringing, ringing, ringing, and the drum went boom doom boom.  Finally someone took the knife away from her. The tears burned like vinegar as they ran down her cheeks. Ten flerce ravens were raking her face with sharp talons and tearing off strips of flesh, leaving deep furrows that ran red with blood. She could taste it on her lips.  It hurts so much, she thought. Our children, Ned, all our sweet babes. Rickon, Bran, Arya, Sansa, Robb… Robb… please, Ned, please, make it stop, make it stop hurting… the white tears and the red ones ran together until her face was torn and tattered, the face that Ned had loved. Catelyn Stark raised her hands and watched the blood run down her long fingers, over her wrists, beneath the sleeves of her gown. Slow red worms crawled along her arms and under her clothes. It tickles. That made her laugh until she screamed.  Mad,  someone said,  she’s lost her wits,  and someone else said,  Make an end,  and a hand grabbed her scalp just as she’d done with Jinglebell, and she thought, No, don’t, don’t cut my hair, Ned loves my hair. Then the steel was at her throat, and its bite was red and cold.      Arya   The feast tents were behind them now. They squished over wet clay and torn grass, out of the light and back into the gloom. Ahead loomed the castle gatehouse. She could see torches moving on the walls, their flames dancing and blowing in the wind. The light shone dully against the wet mail and helms. More torches were moving on the dark stone bridge that joined the Twins, a column of them streaming from the west bank to the east.   The castle’s not closed,  Arya said suddenly. The sergeant had said it would be, but he was wrong. The portcullis was being drawn upward even as she watched, and the drawbridge had already been lowered to span the swollen moat. She had been afraid that Lord Frey’s guardsmen would refuse to let them in. For half a heartbeat she chewed her lip, too anxious to smile.  The Hound reined up so suddenly that she almost fell off the wayn.  Seven bloody buggering hells,  Arya heard him curse, as their left wheel began to sink in soft mud. The wayn tilted slowly.  Get down,  Clegane roared at her, slamming the heel of his hand into her shoulder to knock her sideways. She landed light, the way Syrio had taught her, and bounced up at once with a face full of mud.  Why did you do that?  she screamed. The Hound had leapt down as well. He tore the seat off the front of the wayn and reached in for the swordbelt he’d hidden beneath it.  It was only then that she heard the riders pouring out the castle gate in a river of steel and fire, the thunder of their destriers crossing the drawbridge almost lost beneath the drumming from the castles. Men and mounts wore plate armor, and one in every ten carried a torch. The rest had axes, longaxes with spiked heads and heavy bone-crushing armor-smashing blades.  Somewhere far off she heard a wolf howling. It wasn’t very loud compared to the camp noise and the music and the low ominous growl of the river running wild, but she heard it all the same. Only maybe it wasn’t her ears that heard it. The sound shivered through Arya like a knife, sharp with rage and grief. More and more riders were emerging from the castle, a column four wide with no end to it, knights and squires and freeriders, torches and longaxes. And there was noise coming from behind as well.  When Arya looked around, she saw that there were only two of the huge feast tents where once there had been three. The one in the middle had collapsed. For a moment she did not understand what she was seeing. Then the flames went licking up from the fallen tent, and now the other two were collapsing, heavy oiled cloth settling down on the men beneath."
}