{
  "id": "ad4e1596434b8b0976f6fb5bc545780dd3b815cc",
  "text": "'       'Yes, and one  who  journeyed  with him,' said Pippin. 'And  Boromir of  your City was with us, and he saved me in the snows of the North, and at the   last he was slain defending me from many foes.'       'Peace!'  said Gandalf.  'The news of that grief should have  been told  first to the father.'       'It  has  been  guessed  already,' said  Ingold;  'for there have  been  strange portents here  of late. But pass  on now  quickly! For  the  Lord of  Minas Tirith  will be eager to see any that bear the  latest tidings of  his  son, be he man or --'       'Hobbit,' said Pippin.  'Little  service  can I offer to your lord, but  what I can do, I would do, remembering Boromir the brave.'       'Fare you well!' said  Ingold; and the men made way for Shadow fax, and  he  passed through a narrow gate in the wall. 'May you bring good counsel to   ####-Denethor  in his need, and  to us all, Mithrandir!' Ingold  cried.  'But you   come with tidings of grief and danger, as is your wont, they say.'       'Because I come seldom but  when my help  is needed,' answered Gandalf.   'And as for counsel, to you I would  say that you are over -late in repairing  the wall of the Pelennor. Courage will  now be your best defence against the  storm that is at  hand - that and such  hope as  I  bring. For not  all  the  tidings that I  bring are  evil.  But leave your  trowels  and  sharpen your  swords!'       'The work will be finished ere evening, ' said Ingold. 'This is the last   portion of  the wall  to be put in defence: the least open to attack, for it  looks  towards our  friends of Rohan.  Do  you know aught of them? Will they  answer the summons, think you?'       'Yes,  they will come. But  they have fought many battles at your back.  This road and no road looks towards safety  any longer. Be vigilant! But for   Gandalf Stormcrow you would have seen a host  of foes coming  out of  Anurien  and no Riders of Rohan. And you may yet. Fare you well, and sl eep not!'       Gandalf passed now into  the wide land  beyond the Rammas Echor. So the  men of Gondor  called the out  wall that they had  built with great  labour,  after Ithilien fell under the shadow of their Enemy. For ten leagues or more  it ran from the  mountains' feet  and so back again, enclosing in its  fence  the fields of the Pelennor:  fair and fertile townlands  on  the long slopes  and terraces falling to the deep levels of the Anduin. At its furthest point  from the  Great Gate of the City, north-eastward, the wall  was four leagues  distant, and there from a frowning bank  it overlooked the long flats beside  the river,  and men had  made it high and strong; for at  that point, upon a   walled causeway, the  road came in from  the fords and bridges  of Osgiliath  and passed  through a guarded gate between embattled towers. At its  nearest  point the  wall was little more than one league from the  City, and that was  south-eastward. There Anduin, going in a  wide knee about the  hills of Emyn  Arnen in South Ithilien, bent sharply west, and  the out-wall rose  upon its  very  brink; and beneath  it lay  the quays and  landings of the Harlond for   craft that came upstream from the southern fiefs.        The  townlands  were rich,  with  wide  tilth  and many  orchards,  and  homesteads there  were with oast  and garner, fold and byre, and  many rills  rippling through  the  green from the  highlands  down  to Anduin.  Yet  the   ####-herdsmen and husbandmen that dwelt there were not many, and the most part  of  the people of Gondor lived in the seven circles of the  City, or in the high  vales of  the  mountain-borders,  in Lossarnach,  or  further south  in fair  Lebennin with its five swift streams. There dwelt  a  hardy folk between the  mountains and the sea. They were reckoned men of Gondor, yet their blood  was  mingled, and there were short  and swarthy  folk among them whose sires came  more from the forgotten men who  housed in  the  shadow  of the hills in the  Dark  Years  ere the coming of the kings. But  beyond,  in the great fief of  Belfalas, dwelt Prince Imrahil  in  his castle of Dol Amroth by the sea, and  he was of high blood,  and  his folk also, tall  men and proud with sea -grey  eyes.       Now after Gandalf had ridden for some time the light of day grew in the  sky, and Pippin roused himself and looked up. To his left lay a sea of mist,  rising  to a  bleak  shadow  in the  East;  but to his right great mountains  reared their heads, ranging  from the West  to a steep and sudden end, as if  in  the  making of the land the  River  had burst  through a great  barrier,  carving  out a mighty valley to be a  land  of battle and debate in times to  come. And there where the White Mountains of Ered Nimrais  came to their  end  he saw, as Gandalf had promised, the dark mass of Mount  Mindolluin, the deep  purple  shadows of its high glens, and its tall face whitening in the rising  day. And upon its out-thrust knee was the Guarded City, with its seven walls  of stone  so  strong and  old that  it seemed to have been  not builded  but  carven by giants out of the bones of the earth."
}