{
  "id": "ad689f17738e84edfe23c374162260158cce5a7a",
  "text": "\"  \"—and slipped inside the crack before it closed. I followed down into the main  hall, which was  crowded with  goblins. The Great Goblin was  there with  thirty or  forty armed guards. I thought to myself 'even if they were not all chained together,  what can a dozen do against so many?' \"  \"A  dozen!  That's  the  first  time  I've  heard  eight  called  a  dozen.  Or  have  you  still got some more jacks that haven't yet come out of their boxes?\"  \"Well, yes, there seem to be a couple more here now – Fili and Kili, I believe,\"  said Gandalf, as these two now appeared and stood smiling and bowing.  \"That's enough!\" said Beorn. \"Sit down and be quiet! Now go on, Gandalf!\"  So  Gandalf  went  on  with  the  tale,  until  he  came  to  the  fight  in  the  dark,  the  discovery  of  the  lower  gate,  and  their  horror  when  they  found  that  Mr.  Baggins  had been mislaid.  \"We  counted  ourselves  and  found  that  there  was  no  hobbit.  There  were  only  fourteen of us left!\"  \"Fourteen!  That's  the  first  time  I've  heard  one  from  ten  leave  fourteen.  You  mean nine, or else you haven't told me yet all the names of your party.\"  \"Well, of course you haven't seen Oin and Gloin yet. And, bless me! here they  are. I hope you will forgive them for bothering you.\"  \"O  let  'em all come! Hurry up! Come along, you  two, and sit down! But  look  here, Gandalf, even now we have only got yourself and ten dwarves and the hobbit  that was  lost. That  only makes  eleven  (plus  one mislaid) and not fourteen, unless  wizards  count  differently  to  other  people.  But  now  please  get  on  with  the  tale.\"  Beorn did not show it more than he could help, but really he had begun to get very  interested. You  see,  in  the  old  days  he  had  known  the  very  part of  the mountains  that  Gandalf  was  describing.  He  nodded  and  he  growled,  when  he  heard  of  the  hobbit's  reappearance  and  of  their  scramble  down  the  stone-slide  and  of  the wolf- ring m the woods. When Gandalf came to their climbing into trees with the wolves  all underneath, he got up and strode about and muttered:  \"I wish I had been there! I would have given them more than fireworks!\"  \"Well,\"  said  Gandalf  very  glad  to  see  that  his  tale  was  making  a  good  impression,  \"I  did  the  best  I  could.  There  we  were  with  the  wolves  going  mad   ####-underneath us  and  the  forest beginning  to blaze  in places, when  the goblins  came  down  from  the  hills  and  discovered  us.  They  yelled  with  delight  and  sang  songs  making fun of us. Fifteen birds in five fir-trees…\"  \"Good heavens!\" growled Beorn. \"Don't pretend that goblins can't count. They  can. Twelve isn't fifteen and they know it.\"  \"And  so  do  1.  There  were  Bifur  and  Bofur  as  well.  I  haven't  ventured  to  introduce them before, but here they are.\"  In  came  Bifur  and  Bofur.  \"And  me!\"  gasped  Bombur  pulling  up  behind.  He  was  fat, and also angry at being  left  till  last. He  refused  to wait  five minutes, and  followed immediately after the other two.  \"Well, now there are fifteen of you; and since goblins can count, I suppose that  is  all  that  there  were  up  the  trees.  Now  perhaps  we  can  finish  this  story  without  any more interruptions.\" Mr. Baggins saw then how clever Gandalf had been. The  interruptions had really made Beorn more interested in the story, and the story had  kept  him  from  sending  the  dwarves off  at once  like  suspicious beggars. He never  invited people into his house, if he could help it. He had very few friends and they  lived  a  good  way  away;  and  he  never  invited  more  than  a  couple  of  these  to  his  house at a time. Now he had got fifteen strangers sitting in his porch!  By  the  time  the wizard had  finished his  tale  and had  told of  the  eagles'  rescue  and of how they had all been brought to the Carrock, the sun had fallen behind the  peaks of the Misty Mountains and the shadows were long in Beorn's garden.  \"A  very  good  tale!\"  said  he.  \"The  best  I  have  heard  for  a  long  while.  If  all  beggars  could  tell  such  a  good  one,  they  might  find  me  kinder.  You  may  be  making  it  all  up,  of  course,  but  you  deserve  a  supper  for  the  story  all  the  same.  Let's have something to eat!\"  \"Yes, please!\" they all said together. \"Thank you very much!\"  Inside  the  hall  it was  now  quite  dark. Beorn  clapped  his  hands,  and  in  trotted  four  beautiful  white  ponies  and  several  large  long-bodied  grey  dogs.  Beorn  said  something  to  them  in  a  queer  language  like  animal  noises  turned  into  talk.  They  went  out  again  and  soon  came  back  carrying  torches  in  their mouths, which  they  lit  at  the  fire  and  stuck  in  low brackets on  the pillars of  the hall  about  the  central  hearth.  The  dogs  could  stand  on  their  hind-legs  when  they  wished,  and  carry  things  with  their  fore-feet."
}