{
  "id": "ad70ccc4d4a7f539f6439aa7cbc81d5809c21e20",
  "text": "  Ron, at the next table, wasn't having much more luck.  \"Wingardium Leviosa!\" he shouted, waving his long arms like a windmill.  \"You're saying it wrong,\" Harry heard Hermione snap. \"It's Wing-gar-dium Levi-o-sa, make the 'gar' nice and long.\"   \"You do it, then, if you're so clever,\" Ron snarled.  Hermione rolled up the sleeves of her gown, flicked her wand, and said, \"Wingardium Leviosa!\"  Their feather rose off the desk and hovered about four feet above their heads.  \"Oh, well done!\" cried Professor Flitwick, clapping. \"Everyone see here, Miss Granger's done it!\"  Ron was in a very bad mood by the end of the class. \"It's no wonder no one can stand her,\" he said to Harry as they pushed their way into the crowded corridor, \"she's a nightmare, honestly. \"  Someone knocked into Harry as they hurried past him. It was Hermione. Harry caught a glimpse of her face -- and was startled to see that she was in tears.  \"I think she heard you.\"  \"So?\" said Ron, but he looked a bit uncomfortable. \"She must've noticed she's got no friends.\"  Hermione didn't turn up for the next class and wasn't seen all afternoon. On their way down to the Great Hall for the Halloween feast, Harry and Ron overheard Parvati Patil telling her friend Lavender that Hermione was crying in the girls' bathroom and wanted to be left alone. Ron looked still more awkward at this, but a moment later they had entered the Great Hall, where the Halloween decorations put Hermione out of their minds.  A thousand live bats fluttered from the walls and ceiling while a thousand more swooped over the tables in low black clouds, making the candles in the pumpkins stutter. The feast appeared suddenly on the golden plates, as it had at the start-of-term banquet.  Harry was just helping himself to a baked potato when Professor Quirrell came sprinting into the hall, his turban askew and terror on his face. Everyone stared as he reached Professor Dumbledore's chair, slumped against the table, and gasped, \"Troll -- in the dungeons -- thought you ought to know.\"  He then sank to the floor in a dead faint.  There was an uproar. It took several purple firecrackers exploding from the end of Professor Dumbledore's wand to bring silence.  \"Prefects,\" he rumbled, \"lead your Houses back to the dormitories immediately!\"  Percy was in his element.  \"Follow me! Stick together, first years! No need to fear the troll if you follow my orders! Stay close behind me, now. Make way, first years coming through! Excuse me, I'm a prefect!\"  \"How could a troll get in?\" Harry asked as they climbed the stairs.  \"Don't ask me, they're supposed to be really stupid,\" said Ron. \"Maybe Peeves let it in for a Halloween joke.\"  They passed different groups of people hurrying in different directions. As they jostled their way through a crowd of confused Hufflepuffs, Harry suddenly grabbed Ron's arm.  \"I've just thought -- Hermione.\"  \"What about her?\"  \"She doesn't know about the troll.\"  Ron bit his lip.  \"Oh, all right,\" he snapped. \"But Percy'd better not see us.\"  Ducking down, they joined the Hufflepuffs going the other way, slipped down a deserted side corridor, and hurried off toward the girls' bathroom. They had just turned the corner when they heard quick footsteps behind them.  \"Percy!\" hissed Ron, pulling Harry behind a large stone griffin.  Peering around it, however, they saw not Percy but Snape. He crossed the corridor and disappeared from view.  \"What's he doing?\" Harry whispered. \"Why isn't he down in the dungeons with the rest of the teachers?\"  \"Search me.\"  Quietly as possible, they crept along the next corridor after Snape's fading footsteps.  \"He's heading for the third floor,\" Harry said, but Ron held up his hand.  \"Can you smell something?\"  Harry sniffed and a foul stench reached his nostrils, a mixture of old socks and the kind of public toilet no one seems to clean.  And then they heard it -- a low grunting, and the shuffling footfalls of gigantic feet. Ron pointed -- at the end of a passage to the left, something huge was moving toward them. They shrank into the shadows and watched as it emerged into a patch of moonlight.  It was a horrible sight. Twelve feet tall, its skin was a dull, granite gray, its great lumpy body like a boulder with its small bald head perched on top like a coconut. It had short legs thick as tree trunks with flat, horny feet. The smell coming from it was incredible. It was holding a huge wooden club, which dragged along the floor because its arms were so long.  The troll stopped next to a doorway and peered inside. It waggled its long ears, making up its tiny mind, then slouched slowly into the room.  \"The keys in the lock,\" Harry muttered. \"We could lock it in.\"  \"Good idea,\" said Ron nervously.  They edged toward the open door, mouths dry, praying the troll wasn't about to come out of it. With one great leap, Harry managed to grab the key, slam the door, and lock it.  'Yes!\"  Flushed with their victory, they started to run back up the passage, but as they reached the corner they heard something that made their hearts stop -- a high, petrified scream -- and it was coming from the chamber they'd just chained up."
}