{
  "id": "ad7a7577f68d87bc5f228cfe447500b1ebb9d251",
  "text": "  The maesters say it comes from the fires of the earth. They call it obsidian.   Mormont snorted.  They can call it lemon pie for all I care. If it kills as you claim, I want more of it.   Sam stumbled.  Jon found more, on the Fist. Hundreds of arrowheads, spearheads as well…    So you said. Small good it does us there. To reach the Fist again we’d need to be armed with the weapons we won’t have until we reach the bloody Fist. And there are still the wildlings to deal with. We need to find dragonglass someplace else.   Sam had almost forgotten about the wildlings, so much had happened since.  The children of the forest used dragonglass blades,  he said.  They’d know where to find obsidian.    The children of the forest are all dead,  said Mormont.  The First Men killed half of them with bronze blades, and the Andals finished the job with iron. Why a glass dagger should—   The Old Bear broke off as Craster emerged from between the deerhide flaps of his door. The wildling smiled, revealing a mouth of brown rotten teeth.  I have a son.    Son,  cawed Mormont’s raven.  Son, son, son.   The Lord Commander’s face was stiff.  I’m glad for you.    Are you, now? Me, I’ll be glad when you and yours are gone. Past time, I’m thinking.    As soon as our wounded are strong enough…    They’re strong as they’re like to get, old crow, and both of us know it. Them that’s dying, you know them too, cut their bloody throats and be done with it. Or leave them, if you don’t have the stomach, and I’ll sort them out myself.   Lord Commander Mormont bristled.  Thoren Smallwood claimed you were a friend to the Watch—    Aye,  said Craster.  I gave you all I could spare, but winter’s coming on, and now the girl’s stuck me with another squalling mouth to feed.    We could take him,  someone squeaked.  Craster’s head turned. His eyes narrowed. He spat on Sam’s foot.  What did you say, Slayer?   Sam opened and closed his mouth.  I… I… I only meant… if you didn’t want him… his mouth to feed… with winter coming on, we… we could take him, and…    My son. My blood. You think I’d give him to you crows?    I only thought…  You have no sons, you expose them, Gilly said as much, you leave them in the woods, that’s why you have only wives here, and daughters who grow up to be wives.   Be quiet, Sam,  said Lord Commander Mormont.  You’ve said enough. Too much. Inside.    M-my lord—    Inside!   Red-faced, Sam pushed through the deerhides, back into the gloom of the hall. Mormont followed.  How great a fool are you?  the old man said within, his voice choked and angry.  Even if Craster gave us the child, he’d be dead before we reached the Wall. We need a newborn babe to care for near as much as we need more snow. Do you have milk to feed him in those big teats of yours? Or did you mean to take the mother too?    She wants to come,  Sam said.  She begged me…   Mormont raised a hand.  I will hear no more of this, Tarly. You’ve been told and told to stay well away from Craster’s wives.    She’s his daughter,  Sam said feebly.   Go see to Bannen. Now. Before you make me wroth.    Yes, my lord.  Sam hurried off quivering.  But when he reached the fire, it was only to find Giant pulling a fur cloak up over Bannen’s head.  He said he was cold,  the small man said.  I hope he’s gone someplace warm, I do.    His wound…  said Sam.   Bugger his wound.  Dirk prodded the corpse with his foot.  His foot was hurt. I knew a man back in my village lost a foot. He lived to nine-and-forty.    The cold,  said Sam.  He was never warm.    He was never fed,  said Dirk.  Not proper. That bastard Craster starved him dead.   Sam looked around anxiously, but Craster had not returned to the hall. If he had, things might have grown ugly. The wildling hated bastards, though the rangers said he was baseborn himself, fathered on a wildling woman by some long-dead crow.   Craster’s got his own to feed,  said Giant.  All these women. He’s given us what he can.    Don’t you bloody believe it. The day we leave, he’ll tap a keg o’ mead and sit down to feast on ham and honey. And laugh at us, out starving in the snow. He’s a bloody wildling, is all he is. There’s none o’ them friends of the Watch.  He kicked at Bannen’s corpse.  Ask him if you don’t believe me.   They burned the ranger’s corpse at sunset, in the fire that Grenn had been feeding earlier that day. Tim Stone and Garth of Oldtown carried out the naked corpse and swung him twice between them before heaving him into the flames. The surviving brothers divided up his clothes, his weapons, his armor, and everything else he owned. At Castle Black, the Night’s Watch buried its dead with all due ceremony. They were not at Castle Black, though. And bones do not come back as wights.   His name was Bannen,  Lord Commander Mormont said, as the flames took him.  He was a brave man, a good ranger. He came to us from… where did he come from?    Down White Harbor way,  someone called out.  Mormont nodded.  He came to us from White Harbor, and never failed in his duty."
}