{
  "id": "ad8e07bea7f5547d4430ca51261b0cd26162aa95",
  "text": "  Even Aegon did no conquering until after he was weaned.    Gods! You are stubborn as an aurochs, Stark.  The king looked around the council table.  Have the rest of you mislaid your tongues? Will no one talk sense to this frozen-faced fool?   Varys gave the king an unctuous smile and laid a soft hand on Ned’s sleeve.  I understand your qualms, Lord Eddard, truly I do. It gave me no joy to bring this grievous news to council. It is a terrible thing we contemplate, a vile thing. Yet we who presume to rule must do vile things for the good of the realm, howevermuch it pains us.   Lord Renly shrugged.  The matter seems simple enough to me. We ought to have had Viserys and his sister killed years ago, but His Grace my brother made the mistake of listening to Jon Arryn.    Mercy is never a mistake, Lord Renly,  Ned replied.  On the Trident, Ser Barristan here cut down a dozen good men, Robert’s friends and mine. When they brought him to us, grievously wounded and near death, Roose Bolton urged us to cut his throat, but your brother said, ‘I will not kill a man for loyalty, nor for fighting well,’ and sent his own maester to tend Ser Barristan’s wounds.  He gave the king a long cool look.  Would that man were here today.   Robert had shame enough to blush.  It was not the same,  he complained.  Ser Barristan was a knight of the Kingsguard.    Whereas Daenerys is a fourteen-year-old girl.  Ned knew he was pushing this well past the point of wisdom, yet he could not keep silent.  Robert, I ask you, what did we rise against Aerys Targaryen for, if not to put an end to the murder of children?    To put an end to Targaryens!  the king growled.   Your Grace, I never knew you to fear Rhaegar.  Ned fought to keep the scorn out of his voice, and failed.  Have the years so unmanned you that you tremble at the shadow of an unborn child?   Robert purpled.  No more, Ned,  he warned, pointing.  Not another word. Have you forgotten who is king here?    No, Your Grace,  Ned replied.  Have you?    Enough!  the king bellowed.  I am sick of talk. I’ll be done with this, or be damned. What say you all?    She must be killed,  Lord Renly declared.   We have no choice,  murmured Varys.  Sadly, sadly…   Ser Barristan Selmy raised his pale blue eyes from the table and said,  Your Grace, there is honor in facing an enemy on the battlefield, but none in killing him in his mother’s womb. Forgive me, but I must stand with Lord Eddard.   Grand Maester Pycelle cleared his throat, a process that seemed to take some minutes.  My order serves the realm, not the ruler. Once I counseled King Aerys as loyally as I counsel King Robert now, so I bear this girl child of his no ill will. Yet I ask you this—should war come again, how many soldiers will die? How many towns will burn? How many children will be ripped from their mothers to perish on the end of a spear?  He stroked his luxuriant white beard, infinitely sad, infinitely weary.  Is it not wiser, even kinder, that Daenerys Targaryen should die now so that tens of thousands might live?    Kinder,  Varys said.  Oh, well and truly spoken, Grand Maester. It is so true. Should the gods in their caprice grant Daenerys Targaryen a son, the realm must bleed.   Littlefinger was the last. As Ned looked to him, Lord Petyr stifled a yawn.  When you find yourself in bed with an ugly woman, the best thing to do is close your eyes and get on with it,  he declared.  Waiting won’t make the maid any prettier. Kiss her and be done with it.    Kiss her?  Ser Barristan repeated, aghast.   A steel kiss,  said Littlefinger.  Robert turned to face his Hand.  Well, there it is, Ned. You and Selmy stand alone on this matter. The only question that remains is, who can we find to kill her?    Mormont craves a royal pardon,  Lord Renly reminded them.   Desperately,  Varys said,  yet he craves life even more. By now, the princess nears Vaes Dothrak, where it is death to draw a blade. If I told you what the Dothraki would do to the poor man who used one on a khaleesi, none of you would sleep tonight.  He stroked a powdered cheek.  Now, poison… the tears of Lys, let us say. Khal Drogo need never know it was not a natural death.   Grand Maester Pycelle’s sleepy eyes flicked open. He squinted suspiciously at the eunuch.   Poison is a coward’s weapon,  the king complained.  Ned had heard enough.  You send hired knives to kill a fourteen-year-old girl and still quibble about honor?  He pushed back his chair and stood.  Do it yourself, Robert. The man who passes the sentence should swing the sword. Look her in the eyes before you kill her. See her tears, hear her last words. You owe her that much at least.    Gods,  the king swore, the word exploding out of him as if he could barely contain his fury.  You mean it, damn you.  He reached for the flagon of wine at his elbow, found it empty, and flung it away to shatter against the wall.  I am out of wine and out of patience. Enough of this. Just have it done.    I will not be part of murder, Robert."
}