{
  "id": "add8435bb978c5a12af4196c84df11a1705cc484",
  "text": " (If you want  to  know  what  cram  is,  I  can  only  say  that  I  don't  know  the  recipe;  but  it  is  biscuitish,  keeps  good  indefinitely,  is  supposed  to  be  sustaining,  and  is  certainly  not  entertaining,  being  in  fact  very  uninteresting  except  as  a  chewing  exercise.  It  was made by the Lake-men for long journeys).  After  that  they went on again; and now  the road struck westwards and  left  the  river, and the great shoulder of the south-pointing mountain-spur drew ever nearer.  At  length  they  reached  the  hill  path.  It  scrambled  steeply  up,  and  they  plodded  slowly one behind the other, till at last in the late afternoon they came to the top of  the ridge and saw the wintry sun going downwards to the West.  Here  they  found  a  flat  place  without  a  wall  on  three  sides,  but  backed  to  the  North by a  rocky  face  in which  there was an opening  like a door. From  that door  there was a wide view East and South and West.  \"Here,\"  said  Balin,  \"in  the  old  days  we  used  always  to  keep  watchmen,  and  that  door  behind  leads  into  a  rock-hewn  chamber  that  was  made  here  as  a  guardroom.  There  were  several  places  like  it  round  the  Mountain.  But  there  seemed small need for watching in the days of our prosperity, and the guards were  made  over  comfortable,  perhaps  – otherwise we might have had  longer warnings  of  the coming of  the dragon, and  things might have been different. Still,  \"here we  can now lie hid and sheltered for a while, and can see much without being seen.\"  \"Not much use, if we have been seen coming here,\" said Dori, who was always  looking  up  towards  the Mountain's  peak,  as  if  he  expected  to  see Smaug  perched  there like a bird on a steeple.  \"We must take our chance of that,\" said Thorin. \"We can go no further to-day.\"  \"Hear, hear!\" cried Bilbo, and flung himself on the ground.  In the rock-chamber there would have been room for a hundred, and there was  a  small  chamber  further  in,  more  removed  from  the  cold  outside.  It  was  quite  deserted; not even wild animals seemed  to have used  it  in all  the days of Smaug's  dominion. There they laid their burdens; and some threw themselves down at once  and slept, but the others sat near the outer door and discussed their plans.  In  all  their  talk  they  came  perpetually  back  to  one  thing: where was  Smaug?  They  looked West  and  there was  nothing,  and  East  there was  nothing,  and  in  the   ####-South  there  was  no  sign  of  the  dragon,  but  there  was  a  gathering  of  very  many  birds. At  that  they gazed and wondered; but they were no nearer understanding it,  when the first cold stars came out.   ####-<h4>Chapter 14</h4> <br>   Fire and Water     Now  if you wish,  like  the dwarves,  to hear news of Smaug, you must go back  again  to  the  evening  when  he  smashed  the  door  and  flew  off  in  rage,  two  days  before.  The  men  of  the  lake-town  Esgaroth  were  mostly  indoors,  for  the  breeze  was  from the black East and chill, but a few were walking on the quays, and watching,  as they were fond of doing, the stars shine out from the smooth patches of the lake  as  they  opened  in  the  sky.  From  their  town  the  Lonely  Mountain  was  mostly  screened  by  the  low  hills  at  the  far  end  of  the  lake,  through  a  gap  in  which  the  Running  River  came  down  from  the North. Only  its  high  peak  could  they  see  in  clear weather, and they looked seldom at it, for it was ominous and dreary even in  the light of morning. Now it was lost and gone, blotted in the dark.  Suddenly it flickered back to view; a brief glow touched it and faded.  \"Look!\"  said  one.  \"The  lights  again!  Last  night  the watchmen  saw  them start  and fade from midnight until dawn. Something is happening up there.\"  \"Perhaps  the  King  under  the  Mountain  is  forging  gold,\"  said  another.  \"It  is  long since he went north. It is time the songs began to prove themselves again.\"  \"Which  king?\"  said  another  with  a  grim  voice.  \"As  like  as  not  it  is  the  marauding  fire  of  the  Dragon,  the  only  king  under  the  Mountain  we  have  ever  known.\"  \"You  are  always  foreboding  gloomy  things!\"  said  the  others.  \"Anything  from  floods to poisoned fish. Think of something cheerful!\"  Then  suddenly  a  great  light  appeared  in  the  low  place  in  the  hills  and  the  northern end of the lake turned golden.  \"The King  beneath  the Mountain!\"  they  shouted.  \"His wealth  is  like  the  Sun,  his silver like a fountain, his rivers golden run! The  river is running gold from the  Mountain!\"  they  cried,  and  everywhere  windows  were  opening  and  feet  were  hurrying.  There was once more a  tremendous excitement and enthusiasm. But  the grim- voiced fellow ran hotfoot to the Master. \"The dragon is coming or I am a fool!\" he  cried. \"Cut the bridges! To arms! To arms!\"  Then  warning  trumpets  were  suddenly  sounded,  and  echoed  along  the  rocky  shores."
}