{
  "id": "aded188ab3b9dd0bf6c34ee9d20143dccbbd8208",
  "text": " I'll say  you're dead, or have left the Shire, or anything you like. And that might be  true enough; for as like as not it is old Mr. Bilbo they want news of.'       'Maybe you're right,' said Frodo, avoiding the farmer's eye and staring  at the fire.       Maggot looked at him thoughtfully. 'Well, I see  you have ideas of your  own,' he said. 'It is as plain as my  nose that no  accident brought you and  that rider here on the same afternoon; and maybe my  news was no  great news  to you, after all.  I am not asking you to tell me anything you  have a mind  to keep to yourself; but I see you are in some kind  of trouble. Perhaps you   are thinking it won't be too easy to get to the Ferry without being caught?'       'I was thinking so,' said Frodo. 'But we have got to try and get there;  and  it won't  be  done by sitting  and thinking. So I am afraid we must  be  going.  Thank you very much indeed for your kindness! I've been in terror of  you and your dogs for over thirty years, Farmer Maggot, though you may laugh  to hear it. It's a pity: for I've missed a good friend. And now I'm sorry to  leave so soon. But I'll come back, perhaps, one day  - if I get a chance.'       'You'll be welcome when you come,' said Maggot. 'But now I've a notion.  It's near  sundown  already,  and we are going to  have our  supper; for  we  mostly go to bed  soon after the Sun. If you and Mr. Peregrin and  all could  stay and have a bite with us, we would be pleased!'       'And so should we!' said  Frodo. 'But  we  must  be going at once,  I'm  afraid. Even now it will be dark before we can reach the Ferry.'       'Ah! but wait a minute! I was going to say: after a bit of supper, I'll  gel out a small waggon,  and I'll drive you all to the Ferry. That will save  you a good step, and it might also save you trouble of another sort.'       Frodo  now accepted the invitation gratefully, to the relief  of Pippin  and  Sam. The sun  was  already behind the  western hills, and the light was  failing.  Two  of  Maggot's  sons  and his  three  daughters came in, and  a   generous  supper was  laid  on the large table.  The kitchen  was  lit  with   ####-candles and the fire was mended. Mrs. Maggot  hustled in and out. One or two  other  hobbits  belonging to the farm-household came in.  In  a short  while  fourteen  sat  down to eat. There  was beer in plenty,  and a mighty dish of  mushrooms  and bacon, besides much other solid farmhouse fare. The  dogs lay  by the fire and gnawed rinds and cracked bones.       When they had finished, the farmer and his sons went out with a lantern  and got the waggon ready. It was dark in the yard, when the guests came out.  They  threw their  packs  on board  and  climbed in. The farmer sat  in  the  driving-seat,  and whipped up his two stout  ponies. His  wife stood  in the  light of the open door.       'You  be  careful  of yourself. Maggot!' she called. 'Don't  go arguing  with any foreigners, and come straight back!'       'I will!' said he, and drove out  of the gate. There was  now no breath  of wind stirring; the night was still and quiet, and a chill was in the air.  They went without  lights and took it  slowly. After  a mile or two the lane  came to an end, crossing a deep dike,  and climbing a short slope up  on  to  the high-banked causeway.       Maggot got down and took a good look  either way, north and  south, but  nothing could  be  seen  in the darkness, and  there was not a sound in  the  still  air.  Thin  strands  of river -mist  were hanging above the dikes, and  crawling over the fields.        'It's going  to be thick,' said Maggot; 'but  I'll not light my lantern  till I turn for home. We'll hear anything on the road long before we meet it  tonight.'       It was five miles or more from Maggot's lane to the Ferry. The  hobbits  wrapped themselves  up, but their ears were strained for any sound above the  creak  of  the wheels and the  slow clop of  the ponies' hoofs.  The  waggon  seemed slower than a snail to Frodo. Beside him  Pippin was  nodding towards  sleep; but Sam was staring forwards into the rising fog.       They reached the  entrance to the Ferry lane at last. It was marked  by  two tall white posts  that suddenly loomed up  on their right. Farmer Maggot  drew  in his  ponies  and the  waggon creaked  to a  halt.  They  were  just  beginning  lo scramble out, when suddenly they heard what  they had all been  dreading: hoofs on the road ahead. The sound was coming towards them.       Maggot  jumped  down  and stood holding the  ponies' heads, and peering  forward into the gloom. Clip-clop, clip-clop came the approaching rider. The  fall of the hoofs sounded loud in the still, foggy air.   ####-     'You'd better be hidden, Mr. Frodo,' said  Sam anxiously. 'You get down  in the waggon and cover up with  blankets, and we'll send this  rider to the  rightabouts!'  He climbed out  and went to the  farmer's side.  Black Riders  would have to ride over him to get near the waggon."
}