{
  "id": "aea834c0455f69eaddf80451bbc983e94c0de77e",
  "text": " Sansa Stark looked especially lovely this morning, though her face was as pale as milk. Lord Gyles stood coughing, while poor cousin Tyrek wore his bridegroom’s mantle of miniver and velvet. Since his marriage to little Lady Ermesande three days past, the other squires had taken to calling him  Wet Nurse  and asking him what sort of swaddling clothes his bride wore on their wedding night.  Tyrion looked down on them all, and found he liked it.  Call forth Ser Cleos Frey.  His voice rang off the stone walls and down the length of the hall. He liked that too. A pity Shae could not be here to see this, he reflected. She’d asked to come, but it was impossible.  Ser Cleos made the long walk between the gold cloaks and the crimson, looking neither right nor left. As he knelt, Tyrion observed that his cousin was losing his hair.   Ser Cleos,  Littlefinger said from the council table,  you have our thanks for bringing us this peace offer from Lord Stark.   Grand Maester Pycelle cleared his throat.  The Queen Regent, the King’s Hand, and the small council have considered the terms offered by this self-styled King in the North. Sad to say, they will not do, and you must tell these northmen so, ser.    Here are our terms,  said Tyrion.  Robb Stark must lay down his sword, swear fealty, and return to Winterfell. He must free my brother unharmed, and place his host under Jaime’s command, to march against the rebels Renly and Stannis Baratheon. Each of Stark’s bannermen must send us a son as hostage. A daughter will suffice where there is no son. They shall be treated gently and given high places here at court, so long as their fathers commit no new treasons.   Cleos Frey looked ill.  My lord Hand,  he said,  Lord Stark will never consent to these terms.   We never expected he would, Cleos.  Tell him that we have raised another great host at Casterly Rock, that soon it will march on him from the west while my lord father advances from the east. Tell him that he stands alone, without hope of allies. Stannis and Renly Baratheon war against each other, and the Prince of Dorne has consented to wed his son Trystane to the Princess Myrcella.  Murmurs of delight and consternation alike arose from the gallery and the back of the hall.   As to this of my cousins,  Tyrion went on,  we offer Harrion Karstark and Ser Wylis Manderly for Willem Lannister, and Lord Cerwyn and Ser Donnel Locke for your brother Tion. Tell Stark that two Lannisters are worth four northmen in any season.  He waited for the laughter to die.  His father’s bones he shall have, as a gesture of Joffrey’s good faith.    Lord Stark asked for his sisters and his father’s sword as well,  Ser Cleos reminded him.  Ser Ilyn Payne stood mute, the hilt of Eddard Stark’s greatsword rising over one shoulder.  Ice,  said Tyrion.  He’ll have that when he makes his peace with us, not before.    As you say. And his sisters?   Tyrion glanced toward Sansa, and felt a stab of pity as he said,  Until such time as he frees my brother Jaime, unharmed, they shall remain here as hostages. How well they are treated depends on him.  And if the gods are good, Bywater will find Arya alive, before Robb learns she’s gone missing.   I shall bring him your message, my lord.   Tyrion plucked at one of the twisted blades that sprang from the arm of the throne. And now the thrust.  Vylarr,  he called.   My lord.    The men Stark sent are sufficient to protect Lord Eddard’s bones, but a Lannister should have a Lannister escort,  Tyrion declared.  Ser Cleos is the queen’s cousin, and mine. We shall sleep more easily if you would see him safely back to Riverrun.    As you command. How many men should I take?    Why, all of them.   Vylarr stood like a man made of stone. It was Grand Maester Pycelle who rose, gasping,  My lord Hand, that cannot… your father, Lord Tywin himself, he sent these good men to our city to protect Queen Cersei and her children…    The Kingsguard and the City Watch protect them well enough. The gods speed you on your way, Vylarr.   At the council table Varys smiled knowingly, Littlefinger sat feigning boredom, and Pycelle gaped like a fish, pale and confused. A herald stepped forward.  If any man has other matters to set before the King’s Hand, let him speak now or go forth and hold his silence.    I will be heard.  A slender man all in black pushed his way between the Redwyne twins.   Ser Alliser!  Tyrion exclaimed.  Why, I had no notion that you’d come to court. You should have sent me word.    I have, as well you know.  Thorne was as prickly as his name, a spare, sharp-featured man of fifty, hard-eyed and hard-handed, his black hair streaked with grey.  I have been shunned, ignored, and left to wait like some baseborn servant.    Truly? Bronn, this was not well done. Ser Alliser and I are old friends. We walked the Wall together.    Sweet Ser Alliser,  murmured Varys,  you must not think too harshly of us. So many seek our Joffrey’s grace, in these troubled and tumultuous times."
}