{
  "id": "aee2a6fd1abb3a816c58a86ba8d9be65259686f6",
  "text": " Every other teacher in the place was looking grimmer than usual, but Lockhart appeared nothing short of buoyant.  2 69  \"Come now,\" he cried, beaming around him. \"Why all these long faces?\"  People swapped exasperated looks, but nobody answered.  \"Don't you people realize,\" said Lockhart, speaking slowly, as though they were all a bit dim, \"the danger has passed! The culprit has been taken away -\"  \"Says who?\" said Dean Thomas loudly.  \"My dear young man, the Minister of Magic wouldn't have taken Hagrid if he hadn't been one hundred percent sure that he was guilty,\" said Lockhart, in the tone of someone explaining that one and one made two.  \"Oh, yes he would,\" said Ron, even more loudly than Dean.  \"I flatter myself I know a touch more about Hagrid's arrest than you do, Mr. Weasley,\" said Lockhart in a self-satisfied tone.  Ron started to say that he didn't think so, somehow, but stopped in midsentence when Harry kicked him hard under the desk.  \"We weren't there, remember?\" Harry muttered.  But Lockhart's disgusting cheeriness, his hints that he had always thought Hagrid was no good, his confidence that the whole business was now at an end, irritated Harry so much that he yearned to throw Gadding with Ghouls right in Lockhart's stupid face. Instead he contented himself with scrawling a note to Ron: Let's do it tonight.  Ron read the message, swallowed hard, and looked sideways at the empty seat usually filled by Hermione. The sight seemed to stiffen his resolve, and he nodded.  The Gryffindor common room was always very crowded these days, because from six o'clock onward the Gryffindors had no -  *270*  where else to go. They also had plenty to talk about, with the result that the common room often didn't empty until past midnight.  Harry went to get the Invisibility Cloak out of his trunk right after dinner, and spent the evening sitting on it, waiting for the room to clear. Fred and George challenged Harry and Ron to a few games of Exploding Snap, and Ginny sat watching them, very subdued in Hermione's usual chair. Harry and Ron kept losing on purpose, trying to finish the games quickly, but even so, it was well past midnight when Fred, George, and Ginny finally went to bed.  Harry and Ron waited for the distant sounds of two dormitory doors closing before seizing the cloak, throwing it over themselves, and climbing through the portrait hole.  It was another difficult journey through the castle, dodging all the teachers. At last they reached the entrance hall, slid back the lock on the oak front doors, squeezed between them, trying to stop any creaking, and stepped out into the moonlit grounds.  \"'Course,\" said Ron abruptly as they strode across the black grass, \"we might get to the forest and find there's nothing to follow. Those spiders might not've been going there at all. I know it looked like they were moving in that sort of general direction, but. . .\"  His voice trailed away hopefully.  They reached Hagrid's house, sad and sorry-looking with its blank windows. When Harry pushed the door open, Fang went mad with joy at the sight of them. Worried he might wake everyone at the castle with his deep, booming barks, they hastily fed him treacle fudge from a tin on the mantelpiece, which glued his teeth together.  Harry left the Invisibility Cloak on Hagrid's table. There would be no need for it in the pitch-dark forest.  * 21:L *  \"C'mon, Fang, we're going for a walk,\" said Harry, patting his leg, and Fang bounded happily out of the house behind them, dashed to the edge of the forest, and lifted his leg against a large sycamore tree.  Harry took out his wand, murmured, \"Lumos!\" and a tiny light appeared at the end of it, just enough to let them watch the path for signs of spiders.  \"Good thinking,\" said Ron. \"Id light mine, too, but you know - it'd probably blow up or something ......  Harry tapped Ron on the shoulder, pointing at the grass. Two solitary spiders were hurrying away from the wandlight into the shade of the trees.  \"Okay,\" Ron sighed as though resigned to the worst, \"I'm ready. Let's go.\"  So, with Fang scampering around them, sniffing tree roots and leaves, they entered the forest. By the glow of Harry's wand, they followed the steady trickle of spiders moving along the path. They walked behind them for about twenty minutes, not speaking, listening hard for noises other than breaking twigs and rustling leaves. Then, when the trees had become thicker than ever, so that the stars overhead were no longer visible, and Harry's wand shone alone in the sea of dark, they saw their spider guides leaving the path.  Harry paused, trying to see where the spiders were going, but everything outside his little sphere of *light was pitch-black. He had never been this deep into the forest before. He could vividly remember Hagrid advising him not to leave the forest path last time he'd been in here. But Hagrid was miles away now, probably sitting in a cell in Azkaban, and he had also said to follow the spiders."
}