{
  "id": "af64bfeb690dc997718faa0d1fb9afa93bb7eea7",
  "text": " Maester Mullin was tending him, but it would be some time before he was fit to return to Castle Black.  When he had read that, Jon had dispatched Zei to Mole’s Town on their best horse to plead with the villagers to help man the Wall. She never returned. When he sent Mully after her, he came back to report the whole village deserted, even the brothel. Most likely Zei had followed them, straight down the kingsroad. Maybe we should all do the same, Jon reflected glumly.  He made himself eat, hungry or no. Bad enough he could not sleep, he could not go on without food as well. Besides, this might be my last meal. It might be the last meal for all of us. So it was that Jon had a belly full of bread, bacon, onions, and cheese when he heard Horse shout,  IT’S COMING!   No one needed to ask what  it  was. Nor did Jon need the maester’s Myrish eye to see it creeping out from amongst the tents and trees.  It doesn’t really look much like a turtle,  Satin commented.  Turtles don’t have fur.    Most of them don’t have wheels either,  said Pyp.   Sound the warhorn,  Jon commanded, and Kegs blew two long blasts, to wake Grenn and the other sleepers who’d had the watch during the night. If the wildlings were coming, the Wall would need every man. Gods know, we have few enough. Jon looked at Pyp and Kegs and Satin, Horse and Owen the Oaf, Tim Tangletongue, Mully, Spare Boot, and the rest, and tried to imagine them going belly to belly and blade to blade against a hundred screaming wildlings, in the freezing darkness of that tunnel, with only a few iron bars between them. That was what it would come down to, unless they could stop the turtle before the gate was breached.   It’s big,  Horse said.  Pyp smacked his lips.  Think of all the soup it will make.  The jape was stillborn. Even Pyp sounded tired. He looks half dead, thought Jon, but so do we all. The King-beyond-the-Wall had so many men that he could throw fresh attackers at them every time, but the same handful of black brothers had to meet every assault, and it had worn them ragged.  The men beneath the wood and hides would be pulling hard, Jon knew, putting their shoulders into it, straining to keep the wheels turning, but once the turtle was flush against the gate they would exchange their ropes for axes. At least Mance was not sending his mammoths today. Jon was glad of that. Their awesome strength was wasted on the Wall, and their size only made them easy targets. The last had been a day and a half in the dying, its mournful trumpetings terrible to hear.  The turtle crept slowly through stones and stumps and brush. The earlier attacks had cost the free folk a hundred lives or more. Most still lay where they had fallen. In the lulls the crows would come and pay them court, but now the birds fled screeching. They liked the look of that turtle no more than he did.  Satin, Horse, and the others were looking to him, Jon knew, waiting for his orders. He was so tired, he hardly knew any more. The Wall is mine, he reminded himself.  Owen, Horse, to the catapults. Kegs, you and Spare Boot on the scorpions. The rest of you string your bows. Fire arrows. Let’s see if we can burn it.  It was likely to be a futile gesture, Jon knew, but it had to be better than standing helpless.  Cumbersome and slow-moving, the turtle made for an easy shot, and his archers and crossbowmen soon turned it into a lumbering wooden hedgehog… but the wet hides protected it, just as they had the mantlets, and the flaming arrows guttered out almost as soon as they struck. Jon cursed under his breath.  Scorpions,  he commanded.  Catapults.   The scorpions bolts punched deep into the pelts, but did no more damage than the fire arrows. The rocks went bouncing off the turtle’s roof, leaving dimples in the thick layers of hides. A stone from one of the trebuchets might have crushed it, but the one machine was still broken, and the wildlings had gone wide around the area where the other dropped its loads.   Jon, it’s still coming,  said Owen the Oaf.  He could see that for himself. Inch by inch, yard by yard, the turtle crept closer, rolling, rumbling and rocking as it crossed the killing ground. Once the wildlings got it flush against the Wall, it would give them all the shelter they needed while their axes crashed through the hastily-repaired outer gates. Inside, under the ice, they would clear the loose rubble from the tunnel in a matter of hours, and then there would be nothing to stop them but two iron gates, a few half-frozen corpses, and whatever brothers Jon cared to throw in their path, to fight and die down in the dark.  To his left, the catapult made a thunk and filled the air with spinning stones. They plonked down on the turtle like hail, and caromed harmlessly aside. The wildling archers were still loosing arrows from behind their mantlets. One thudded into the face of a straw man, and Pyp said,  Four for Watt of Long Lake! We have a tie!  The next shaft whistled past his own ear, however."
}