{
  "id": "afaec3c4cfeb4b7f8e71c1465d7a8613732a5d40",
  "text": " It was only later, with a heavy oaken door between them, that he heard her sobbing. Tyrion had considered going to her then, to offer what comfort he could. No, he had to remind himself, she will not look for solace from a Lannister. The most he could do was to shield her from the uglier details of the Red Wedding as they came down from the Twins. Sansa did not need to hear how her brother’s body had been hacked and mutilated, he decided; nor how her mother’s corpse had been dumped naked into the Green Fork in a savage mockery of House Tully’s funeral customs. The last thing the girl needed was more fodder for her nightmares.  It was not enough, though. He had wrapped his cloak around her shoulders and sworn to protect her, but that was as cruel a jape as the crown the Freys had placed atop the head of Robb Stark’s direwolf after they’d sewn it onto his headless corpse. Sansa knew that as well. The way she looked at him, her stiffness when she climbed into their bed… when he was with her, never for an instant could he forget who he was, or what he was. No more than she did. She still went nightly to the godswood to pray, and Tyrion wondered if she were praying for his death. She had lost her home, her place in the world, and everyone she had ever loved or trusted. Winter is coming, warned the Stark words, and truly it had come for them with a vengeance. But it is high summer for House Lannister. So why am I so bloody cold?  He pulled on his boots, fastened his cloak with a lion’s head brooch, and slipped out into the torchlit hall. There was this much to be said for his marriage; it had allowed him to escape Maegor’s Holdfast. Now that he had a wife and household, his lord father had agreed that more suitable accommodations were required, and Lord Gyles had found himself abruptly dispossessed of his spacious apartments atop the Kitchen Keep. And splendid apartments they were too, with a large bedchamber and adequate solar, a bath and dressing room for his wife, and small adjoining chambers for Pod and Sansa’s maids. Even Bronn’s cell by the stair had a window of sorts. Well, more an arrow slit, but it lets in light. The castle’s main kitchen was just across the courtyard, true, but Tyrion found those sounds and smells infinitely preferable to sharing Maegor’s with his sister. The less he had to see of Cersei the happier he was like to be.  Tyrion could hear Brella’s snoring as he passed her cell. Shae complained of that, but it seemed a small enough price to pay. Varys had suggested the woman to him; in former days, she had run Lord Renly’s household in the city, which had given her a deal of practice at being blind, deaf, and mute.  Lighting a taper, he made his way back to the servants’ steps and descended. The floors below his own were still, and he heard no footsteps but his own. Down he went, to the ground floor and beyond, to emerge in a gloomy cellar with a vaulted stone ceiling. Much of the castle was connected underground, and the Kitchen Keep was no exception. Tyrion waddled along a long dark passageway until he found the door he wanted, and pushed through.  Within, the dragon skulls were waiting, and so was Shae.  I thought m’lord had forgotten me.  Her dress was draped over a black tooth near as tall as she was, and she stood within the dragon’s jaws, nude. Balerion, he thought. Or was it Vhagar? One dragon skull looked much like another.  Just the sight of her made him hard.  Come out of there.    I won’t.  She smiled her wickedest smile.  M’lord will pluck me from the dragon’s jaws, I know.  But when he waddled closer she leaned forward and blew out the taper.   Shae…  He reached, but she spun and slipped free.   You have to catch me.  Her voice came from his left.  M’lord must have played monsters and maidens when he was little.    Are you calling me a monster?    No more than I’m a maiden.  She was behind him, her steps soft against the floor.  You need to catch me all the same.   He did, finally, but only because she let herself be caught. By the time she slipped into his arms, he was flushed and out of breath from stumbling into dragon skulls. All that was forgotten in an instant when he felt her small breasts pressed against his face in the dark, her stiff little nipples brushing lightly over his lips and the scar where his nose had been. Tyrion pulled her down onto the floor.  My giant,  she breathed as he entered her.  My giant’s come to save me.   After, as they lay entwined amongst the dragon skulls, he rested his head against her, inhaling the smooth clean smell of her hair.  We should go back,  he said reluctantly.  It must be near dawn. Sansa will be waking.    You should give her dreamwine,  Shae said,  like Lady Tanda does with Lollys. A cup before she goes to sleep, and we could fuck in bed beside her without her waking.  She giggled.  Maybe we should, some night. Would m’lord like that?  Her hand found his shoulder, and began to knead the muscles there.  Your neck is hard as stone."
}