{
  "id": "afaed9bf08fb64890a40bd965afc924b2dd23537",
  "text": " Nor did Robb.  Your father is most gracious,  he said.  I shall look forward to our talk.   Lothar bowed, kissed the queen’s hand, and withdrew. By then a dozen others had gathered for a word. Robb spoke with them each, giving a thanks here, a smile there, as needed. Only when the last of them was done did he turn back to Catelyn.  There is something we must speak of. Will you walk with me?    As you command, Your Grace.    That wasn’t a command, Mother.    It will be my pleasure, then.  Her son had treated her kindly enough since returning to Riverrun, yet he seldom sought her out. If he was more comfortable with his young queen, she could scarcely blame him. Jeyne makes him smile, and I have nothing to share with him but grief. He seemed to enjoy the company of his bride’s brothers, as well; young Rollam his squire and Ser Raynald his standard-bearer. They are standing in the boots of those he’s lost, Catelyn realized when she watched them together. Rollam has taken Bran’s place, and Raynald is part Theon and part Jon Snow. Only with the Westerlings did she see Robb smile, or hear him laugh like the boy he was. To the others he was always the King in the North, head bowed beneath the weight of the crown even when his brows were bare.  Robb kissed his wife gently, promised to see her in their chambers, and went off with his lady mother. His steps led them toward the godswood.  Lothar seemed amiable, that’s a hopeful sign. We need the Freys.    That does not mean we shall have them.   He nodded, and there was glumness to his face and a slope to his shoulders that made her heart go out to him. The crown is crushing him, she thought. He wants so much to be a good king, to be brave and honorable and clever, but the weight is too much for a boy to bear. Robb was doing all he could, yet still the blows kept falling, one after the other, relentless. When they brought him word of the battle at Duskendale, where Lord Randyll Tarly had shattered Robett Glover and Ser Helman Tallhart, he might have been expected to rage. Instead he’d stared in dumb disbelief and said,  Duskendale, on the narrow sea? Why would they go to Duskendale?  He’d shook his head, bewildered.  A third of my foot, lost for Duskendale?    The ironmen have my castle and now the Lannisters hold my brother,  Galbart Glover said, in a voice thick with despair. Robett Glover had survived the battle, but had been captured near the kingsroad not long after.   Not for long,  her son promised.  I will offer them Martyn Lannister in exchange. Lord Tywin will have to accept, for his brother’s sake.  Martyn was Ser Kevan’s son, a twin to the Willem that Lord Karstark had butchered. Those murders still haunted her son, Catelyn knew. He had tripled the guard around Martyn, but still feared for his safety.   I should have traded the Kingslayer for Sansa when you first urged it,  Robb said as they walked the gallery.  If I’d offered to wed her to the Knight of Flowers, the Tyrells might be ours instead of Joffrey’s. I should have thought of that.    Your mind was on your battles, and rightly so. Even a king cannot think of everything.    Battles,  muttered Robb as he led her out beneath the trees.  I have won every battle, yet somehow I’m losing the war.  He looked up, as if the answer might be written on the sky.  The ironmen hold Winterfell, and Moat Cailin too. Father’s dead, and Bran and Rickon, maybe Arya. And now your father too.   She could not let him despair. She knew the taste of that draught too well herself.  My father has been dying for a long time. You could not have changed that. You have made mistakes, Robb, but what king has not? Ned would have been proud of you.    Mother, there is something you must know.   Catelyn’s heart skipped a beat. This is something he hates. Something he dreads to tell me. All she could think of was Brienne and her mission.  Is it the Kingslayer?    No. It’s Sansa.   She’s dead, Catelyn thought at once. Brienne failed, Jaime is dead, and Cersei has killed my sweet girl in retribution. For a moment she could barely speak.  Is… is she gone, Robb?    Gone?  He looked startled.  Dead? Oh, Mother, no, not that, they haven’t harmed her, not that way, only… a bird came last night, but I couldn’t bring myself to tell you, not until your father was sent to his rest.  Robb took her hand.  They married her to Tyrion Lannister.   Catelyn’s fingers clutched at his.  The Imp.    Yes.    He swore to trade her for his brother,  she said numbly.  Sansa and Arya both. We would have them back if we returned his precious Jaime, he swore it before the whole court. How could he marry her, after saying that in sight of gods and men?    He’s the Kingslayer’s brother. Oathbreaking runs in their blood.  Robb’s fingers brushed the pommel of his sword.  If I could I’d take his ugly head off. Sansa would be a widow then, and free. There’s no other way that I can see. They made her speak the vows before a septon and don a crimson cloak.   Catelyn remembered the twisted little man she had seized at the crossroads inn and carried all the way to the Eyrie."
}