{
  "id": "b012494c41a455723f15e82b50653b5699e4c934",
  "text": " Do you know the tale of the forging of Lightbringer? I shall tell it to you. It was a time when darkness lay heavy on the world. To oppose it, the hero must have a hero’s blade, oh, like none that had ever been. And so for thirty days and thirty nights Azor Ahai labored sleepless in the temple, forging a blade in the sacred fires. Heat and hammer and fold, heat and hammer and fold, oh, yes, until the sword was done. Yet when he plunged it into water to temper the steel it burst asunder.   Being a hero, it was not for him to shrug and go in search of excellent grapes such as these, so again he began. The second time it took him fifty days and fifty nights, and this sword seemed even finer than the first. Azor Ahai captured a lion, to temper the blade by plunging it through the beast’s red heart, but once more the steel shattered and split. Great was his woe and great was his sorrow then, for he knew what he must do.   A hundred days and a hundred nights he labored on the third blade, and as it glowed white-hot in the sacred fires, he summoned his wife. ‘Nissa Nissa’ he said to her, for that was her name, ‘bare your breast, and know that I love you best of all that is in this world.’ She did this thing, why I cannot say, and Azor Ahai thrust the smoking sword through her living heart. It is said that her cry of anguish and ecstasy left a crack across the face of the moon, but her blood and her soul and her strength and her courage all went into the steel. Such is the tale of the forging of Lightbringer, the Red Sword of Heroes.   Now do you see my meaning? Be glad that it is just a burnt sword that His Grace pulled from that fire. Too much light can hurt the eyes, my friend, and fire burns.  Salladhor Saan finished the last grape and smacked his lips.  When do you think the king will bid us sail, good ser?     Soon, I think,  said Davos,  if his god wills it.    His god, ser friend? Not yours? Where is the god of Ser Davos Seaworth, knight of the onion ship?   Davos sipped his ale to give himself a moment. The inn is crowded, and you are not Salladhor Saan, he reminded himself. Be careful how you answer.  King Stannis is my god. He made me and blessed me with his trust.    I will remember.  Salladhor Saan got to his feet.  My pardons. These grapes have given me a hunger, and dinner awaits on my Valyrian. Minced lamb with pepper and roasted gull stuffed with mushrooms and fennel and onion. Soon we shall eat together in King’s Landing, yes? In the Red Keep we shall feast, while the dwarf sings us a jolly tune. When you speak to King Stannis, mention if you would that he will owe me another thirty thousand dragons come the black of the moon. He ought to have given those gods to me. They were too beautiful to burn, and might have brought a noble price in Pentos or Myr. Well, if he grants me Queen Cersei for a night I shall forgive him.  The Lyseni clapped Davos on the back, and swaggered from the inn as if he owned it.  Ser Davos Seaworth lingered over his tankard for a good while, thinking. A year ago, he had been with Stannis in King’s Landing when King Robert staged a tourney for Prince Joffrey’s name day. He remembered the red priest Thoros of Myr, and the flaming sword he had wielded in the melee. The man had made for a colorful spectacle, his red robes flapping while his blade writhed with pale green flames, but everyone knew there was no true magic to it, and in the end his fire had guttered out and Bronze Yohn Royce had brained him with a common mace.  A true sword of fire, now, that would be a wonder to behold. Yet at such a cost… When he thought of Nissa Nissa, it was his own Marya he pictured, a good-natured plump woman with sagging breasts and a kindly smile, the best woman in the world. He tried to picture himself driving a sword through her, and shuddered. I am not made of the stuff of heroes, he decided. If that was the price of a magic sword, it was more than he cared to pay.  Davos finished his ale, pushed away the tankard, and left the inn. On the way out he patted the gargoyle on the head and muttered,  Luck.  They would all need it.  It was well after dark when Devan came down to Black Betha, leading a snow-white palfrey.  My lord father,  he announced,  His Grace commands you to attend him in the Chamber of the Painted Table. You are to ride the horse and come at once.   It was good to see Devan looking so splendid in his squire’s raiment, but the summons made Davos uneasy. Will he bid us sail? he wondered. Salladhor Saan was not the only captain who felt that King’s Landing was ripe for an attack, but a smuggler must learn patience. We have no hope of victory. I said as much to Maester Cressen, the day I returned to Dragonstone, and nothing has changed. We are too few, the foes too many. ff we dip our oars, we die. Nonetheless, he climbed onto the horse.  When Davos arrived at the Stone Drum, a dozen highborn knights and great bannermen were just leaving. Lords Celtigar and Velaryon each gave him a curt nod and walked on while the others ignored him utterly, but Ser Axell Florent stopped for a word."
}