{
  "id": "b040dd24e46588eaa1f1365e9270fc79eaec5c1c",
  "text": " I'd forgotten it,  trying to find  you.  But let  me  think!  Last time I looked  I'd got about enough of  that  waybread, and of  what Captain Faramir gave us, to keep  me on my legs for a   couple of weeks at a pinch. But if there's a drop left in my bottle, there's   ####-no more. That's  not going to be enough for two, nohow. Don't ores eat,  and  don't they drink? Or do they just live on foul air and poison?'       `No, they eat and drink, Sam. The Shadow that  bred them can only mock,  it cannot make:  not real new things of its own. I  don't think it gave life  to the ores, it only  ruined them and twisted them; and if they are  to live  at all, they have to live like  other living creatures. Foul waters and foul  meats  they'll  take, if they can get no better, but not poison. They've fed  me, and so I'm better off than you. There must be food and  water  somewhere  in this place.' `But there's no time to look for them,' said Sam.       `Well, things are a bit better than you think,' said Frodo. 'I have had  a bit of luck while you were away. Indeed they did not take everything. I've  found my food-bag among some  rags  on  the  floor.  They've rummaged it, of  course. But I  guess  they disliked  the very look and smell of  the lembas,  worse than Gollum did. It's scattered about  and some  of it is trampled and  broken,  but I've gathered  it  together. It's not far short of  what you've  got.   But  they've   taken  Faramir's  food,  and  they've  slashed  up  my  water -bottle.'       `Well,  there's no more  to  be said,' said  Sam. `We've got enough  to  start  on.  But the water's going to be a  bad business. But come Mr. Frodo!   Off we go, or a whole lake of it won't do us any good!'       'Not  till you've  had  a mouthful,  Sam,' said Frodo. `I won't  budge.  Here, take this elven-cake, and  drink that last drop in  your  bottle!  The  whole thing is quite hopeless, so it's no good worrying  about  tomorrow. It  probably won't come.'         At last they started. Down the ladder  they climbed, and then Sam  took   it and laid it in the passage beside the huddled body of the fallen orc. The  stair was dark, but on the roof-top the glare of the Mountain could still be  seen, though it  was dying down  now to  a  sullen red.  They  picked up two  shields to complete their disguise and then went on.       Down  the great stairway they plodded. The  high chamber of the  turret  behind, where they had met again, seemed almost homely: they were out in the  open again  now,  and terror ran along  the walls. All might be  dead in the  Tower of Cirith Ungol, but it was steeped in fear and evil still.       At length they came to the door upon the outer court, and they  halted.  Even  from where they stood they felt the malice  of the Watchers beating on  them, black silent shapes on either side of the gate through which the glare   ####-of Mordor dimly showed. As they threaded their way among the hideous   bodies  of the  ores each step became more  difficult. Before they  even reached the  archway they were brought to a stand. To move an inch further was a pain and  weariness to will and limb.       Frodo  had no  strength  for such a  battle. He sank  to the ground. `I   can't go  on, Sam,' he  murmured. `I'm  going  to faint. I don't know what's  come over me.'       `I  do, Mr.  Frodo. Hold up  now! It's  the gate.  There's some devilry  there. But  I got  through,  and  I'm going to  get  out.  It can't be  more  dangerous than before. Now for it!'       Sam drew  out the elven-glass of Galadriel again. As if to do honour to  his hardihood, and to grace with  splendour  his faithful  brown hobbit-hand   that had done such  deeds, the  phial blazed forth suddenly, so that all the  shadowy  court  was  lit with  a  dazzling  radiance  like lightning; but it  remained steady and did not pass.        'Gilthoniel, A  Elbereth!' Sam  cried. For, why he  did  not know,  his  thought sprang back suddenly to  the Elves in the Shire,  and the song  that  drove away the Black Rider in the trees.        'Aiya elenion ancalima!' cried Frodo once again behind him.       The will of the Watchers was broken with a suddenness like the snapping   of a cord, and Frodo and Sam stumbled  forward. Then they  ran.  Through the  gate and past the great seated figures with their glittering eyes. There was  a crack.  The keystone of the  arch  crashed almost on  their heels, and the  wall  above crumbled, and fell in ruin. Only  by a  hair did  they escape. A  bell clanged; and from the Watchers there went up  a high and dreadful wail.   Far  up above in  the darkness it was answered . Out of the  black  sky there  came dropping like a bolt a winged shape, rending the clouds with  a ghastly   shriek.     ####-   Chapter 2. The Land of Shadow            Sam had just wits enough left to thrust the phial back into his breast.  'Run, Mr. Frodo!' he cried.  'No, not that way! There's a sheer drop over the  wall. Follow me!'       Down the  road from the  gate they  fled."
}