{
  "id": "b0916a530ddac111f635ea4114496a2fdf7cbdf6",
  "text": "  With Robb, my son. He’ll want to see you too.    Your boy,  he whispered.  He had my eyes, I remember…    He did, and does. And we’ve brought you Jaime Lannister, in irons. Riverrun is free again, Father.   Lord Hoster smiled.  I saw. Last night, when it began, I told them… had to see. They carried me to the gatehouse… watched from the battlements. Ah, that was beautiful… the torches came in a wave, I could hear the cries floating across the river… sweet cries… when that siege tower went up, gods… would have died then, and glad, if only I could have seen you children first. Was it your boy who did it? Was it your Robb?    Yes,  Catelyn said, fiercely proud.  It was Robb… and Brynden. Your brother is here as well, my lord.    Him.  Her father’s voice was a faint whisper.  The Blackfish… came back? From the Vale?    Yes.    And Lysa?  A cool wind moved through his thin white hair.  Gods be good, your sister… did she come as well?   He sounded so full of hope and yearning that it was hard to tell the truth.  No. I’m sorry…    Oh.  His face fell, and some light went out of his eyes.  I’d hoped I would have liked to see her, before…    She’s with her son, in the Eyrie.   Lord Hoster gave a weary nod.  Lord Robert now, poor Arryn’s gone… I remember… why did she not come with you?    She is frightened, my lord. In the Eyrie she feels safe.  She kissed his wrinkled brow.  Robb will be waiting. Will you see him? And Brynden?    Your son,  he whispered.  Yes. Cat’s child… he had my eyes, I remember. When he was born. Bring him… yes.    And your brother?   Her father glanced out over the rivers.  Blackfish,  he said.  Has he wed yet? Taken some… girl to wife?   Even on his deathbed, Catelyn thought sadly.  He has not wed. You know that, Father. Nor will he ever.    I told him… commanded him. Marry! I was his lord. He knows. My right, to make his match. A good match. A Redwyne. Old House. Sweet girl, pretty… freckles… Bethany, yes. Poor child. Still waiting. Yes. Still…    Bethany Redwyne wed Lord Rowan years ago,  Catelyn reminded him.  She has three children by him.    Even so,  Lord Hoster muttered.  Even so. Spit on the girl. The Redwynes. Spit on me. His lord, his brother… that Blackfish. I had other offers. Lord Bracken’s girl. Walder Frey… any of three, he said… Has he wed? Anyone? Anyone?    No one,  Catelyn said,  yet he has come many leagues to see you, fighting his way back to Riverrun. I would not be here now, if Ser Brynden had not helped us.    He was ever a warrior,  her father husked.  That he could do. Knight of the Gate, yes.  He leaned back and closed his eyes, inutterably weary.  Send him. Later. I’ll sleep now. Too sick to fight. Send him up later, the Blackfish…   Catelyn kissed him gently, smoothed his hair, and left him there in the shade of his keep, with his rivers flowing beneath. He was asleep before she left the solar.  When she returned to the lower bailey, Ser Brynden Tully stood on the water stairs with wet boots, talking with the captain of Riverrun’s guards. He came to her at once.  Is he—    Dying,  she said.  As we feared.   Her uncle’s craggy face showed his pain plain. He ran his fingers through his thick grey hair.  Will he see me?   She nodded.  He says he is too sick to fight.   Brynden Blackfish chuckled.  I am too old a soldier to believe that. Hoster will be chiding me about the Redwyne girl even as we light his funeral pyre, damn his bones.   Catelyn smiled, knowing it was true.  I do not see Robb.    He went with Greyjoy to the hall, I believe.   Theon Greyjoy was seated on a bench in Riverrun’s Great Hall, enjoying a horn of ale and regaling her father’s garrison with an account of the slaughter in the Whispering Wood.  Some tried to flee, but we’d pinched the valley shut at both ends, and we rode out of the darkness with sword and lance. The Lannisters must have thought the Others themselves were on them when that wolf of Robb’s got in among them. I saw him tear one man’s arm from his shoulder, and their horses went mad at the scent of him. I couldn’t tell you how many men were thrown—    Theon,  she interrupted,  where might I find my son?    Lord Robb went to visit the godswood, my lady.   It was what Ned would have done. He is his father’s son as much as mine, I must remember. Oh, gods, Ned…  She found Robb beneath the green canopy of leaves, surrounded by tall redwoods and great old elms, kneeling before the heart tree, a slender weirwood with a face more sad than fierce. His longsword was before him, the point thrust in the earth, his gloved hands clasped around the hilt. Around him others knelt: Greatjon Umber, Rickard Karstark, Maege Mormont, Galbart Glover, and more. Even Tytos Blackwood was among them, the great raven cloak fanned out behind him. These are the ones who keep the old gods, she realized. She asked herself what gods she kept these days, and could not find an answer.  It would not do to disturb them at their prayers. The gods must have their due… even cruel gods who would take Ned from her, and her lord father as well."
}