{
  "id": "b0a5591555a8b97e428ab3f7a7d805772ee97632",
  "text": " \"Let's just keep moving, shall we?\" said Ron, and Harry saw him glance edgily at Hermione.  Perhaps there was truth in what Malfoy had said; perhaps Hermione was in more danger than they were.  They set off again, Harry still searching his pockets, even though he knew his wand wasn't there. They followed the dark path deeper into the wood, still keeping an eye out for Fred, George, and Ginny.  They passed a group of goblins who were cackling over a sack of gold that they had undoubtedly won betting on the match, and who seemed quite unperturbed by the trouble at the campsite.  Farther still along the path, they walked into a patch of silvery light, and when they looked through the trees, they saw three tall and beautiful veela standing in a clearing, surrounded by a gaggle of young wizards, all of whom were talking very loudly. \"I pull down about a hundred sacks of Galleons a year!\"  one of them shouted.  \"I'm a dragon killer for the Committee for the Disposal of Dangerous Creatures.\"  \"No, you're not!\"  yelled his friend.  \"You're a dishwasher at the Leaky Cauldron. . . . but I'm a vampire hunter, I've killed about ninety so far -\" A third young wizard, whose pimples were visible even by the dim, silvery light of the veela, now cut in, \"I'm about to become the youngest ever Minister of Magic, I am.\" Harry snorted with laughter. He recognized the pimply wizard:  His name was Stan Shunpike, and he was in fact a conductor on the triple-decker Knight Bus.  He turned to tell Ron this, but Ron's face had gone oddly slack, and next second Ron was yelling,  \"Did I tell you I've invented a broomstick that'll reach Jupiter?\" \"Honestly!\" said Hermione, and she and Harry grabbed Ron firmly by the arms, wheeled him around, and marched him away. By the time the sounds of the veela and their admirers had faded completely, they were in the very heart of the wood.  They seemed to be alone now; everything was much quieter. Harry looked around. \"I reckon we can just wait here, you know.  We'll hear anyone coming a mile off.\" The words were hardly out of his mouth, when Ludo Bagman emerged from behind a tree right ahead of them. Even by the feeble light of the two wands, Harry could see that a great change had come over Bagman.  He no longer looked buoyant and rosy-faced; there was no more spring in his step.  He looked very white and strained. \"Who's that?\" he said, blinking down at them, trying to make out their faces.  \"What are you doing in here, all alone?\" They looked at one another, surprised. \"Well - there's a sort of riot going on,\" said Ron. Bagman stared at him. \"What?\" \"At the campsite. . . some people have got hold of a family of Muggles. . . Bagman swore loudly. \"Damn them!\" he said, looking quite distracted, and without another word, he Disapparated with a small pop! \"Not exactly on top of things, Mr. Bagman, is he?\" said Hermione, frowning. \"He was a great Beater, though,\" said Ron, leading the way off the path into a small clearing, and sitting down on a patch of dry grass at the foot of a tree.  \"The Wimbourne Wasps won the league three times in a row while he was with them.\" He took his small figure of Krum out of his pocket, set it down on the ground, and watched it walk around. Like the real Krum, the model was slightly duck-footed and round-shouldered, much less impressive on his splayed feet than on his broomstick.  Harry was listening for noise from the campsite.  Everything seemed much quieter; perhaps the riot was over. \"I hope the others are okay,\" said Hermione after a while. \"They'll be fine,\" said Ron. \"Imagine if your dad catches Lucius Malfoy,\" said Harry, sitting down next to Ron and watching the small figure of Krum slouching over the fallen leaves.  \"He's always said he'd like to get something on him.\" \"That'd wipe the smirk off old Draco's face, all right,\" said Ron. \"Those poor Muggles, though,\" said Hermione nervously. \"What if they can't get them down?\" \"They will,\" said Ron reassuringly. \"They'll find a way.\"  \"Mad, though, to do something like that when the whole Ministry of Magic's out here tonight!\"  said Hermione.  \"I mean, how do they expect to get away with it?  Do you think they've been drinking, or are they just -\" But she broke off abruptly and looked over her shoulder. Harry and Ron looked quickly around too.  It sounded as though someone was staggering toward their clearing.  They waited, listening to the sounds of the uneven steps behind the dark trees.  But the footsteps came to a sudden halt. \"Hello?\" called Harry. There was silence. Harry got to his feet and peered around the tree. It was too dark to see very far, but he could sense somebody standing just beyond the range of his vision. \"Who's there?\" he said. And then, without warning, the silence was rent by a voice unlike any they had heard in the wood; and it uttered, not a panicked shout, but what sounded like a spell. \"MORSMORDRE!\" And something vast, green, and glittering erupted from the patch of darkness Harry's eyes had been struggling to penetrate; it flew up over the treetops and into the sky."
}