{
  "id": "b0fd5e0ecc5f7666842f9ef0e005804e78cb1ee7",
  "text": "   A demon’s head, Tyrion thought ruefully, now what does that say of me?  Master Salloreon, I plan to fight the rest of my battles from this chair. It’s links I need, not demon horns. So let me put it to you this way. You will make chains, or you will wear them. The choice is yours.  He rose, and took his leave with nary a backward glance.  Bronn was waiting by the gate with his litter and an escort of mounted Black Ears.  You know where we’re bound,  Tyrion told him. He accepted a hand up into the litter. He had done all he could to feed the hungry city—he’d set several hundred carpenters to building fishing boats in place of catapults, opened the kingswood to any hunter who dared to cross the river, even sent gold cloaks foraging to the west and south—yet he still saw accusing eyes everywhere he rode. The litter’s curtains shielded him from that, and besides gave him leisure to think.  As they wound their slow way down twisty Shadowblack Lane to the foot of Aegon’s High Hill, Tyrion reflected on the events of the morning. His sister’s ire had led her to overlook the true significance of Stannis Baratheon’s letter. Without proof, his accusations were nothing; what mattered was that he had named himself a king. And what will Renly make of that? They could not both sit the Iron Throne.  Idly, he pushed the curtain back a few inches to peer out at the streets. Black Ears rode on both sides of him, their grisly necklaces looped about their throats, while Bronn went in front to clear the way. He watched the passersby watching him, and played a little game with himself, trying to sort the informers from the rest. The ones who look the most suspicious are likely innocent, he decided. It’s the ones who look innocent I need to beware.  His destination was behind the hill of Rhaenys, and the streets were crowded. Almost an hour had passed before the litter swayed to a stop. Tyrion was dozing, but he woke abruptly when the motion ceased, rubbed the sand from his eyes, and accepted Bronn’s hand to climb down.  The house was two stories tall, stone below and timber above. A round turret rose from one corner of the structure. Many of the windows were leaded. Over the door swung an ornate lamp, a globe of gilded metal and scarlet glass.   A brothel,  Bronn said.  What do you mean to do here?    What does one usually do in a brothel?   The sellsword laughed.  Shae’s not enough?    She was pretty enough for a camp follower, but I’m no longer in camp. Little men have big appetites, and I’m told the girls here are fit for a king.    Is the boy old enough?    Not Joffrey. Robert. This house was a great favorite of his.  Although Joffrey may indeed be old enough. An interesting notion, that.  If you and the Black Ears care to amuse yourselves, feel free, but Chataya’s girls are costly. You’ll find cheaper houses all along the street. Leave one man here who’ll know where to find the others when I wish to return.   Bronn nodded.  As you say.  The Black Ears were all grins.  Inside the door, a tall woman in flowing silks was waiting for him. She had ebon skin and sandalwood eyes.  I am Chataya,  she announced, bowing deeply.  And you are—    Let us not get into the habit of names. Names are dangerous.  The air smelled of some exotic spice, and the floor beneath his feet displayed a mosaic of two women entwined in love.  You have a pleasant establishment.    I have labored long to make it so. I am glad the Hand is pleased.  Her voice was flowing amber, liquid with the accents of the distant Summer Isles.   Titles can be as dangerous as names,  Tyrion warned.  Show me a few of your girls.    It will be my great delight. You will find that they are all as sweet as they are beautiful, and skilled in every art of love.  She swept off gracefully, leaving Tyrion to waddle after as best he could on legs half the length of hers.  From behind an ornate Myrish screen carved with flowers and fancies and dreaming maidens, they peered unseen into a common room where an old man was playing a cheerful air on the pipes. In a cushioned alcove, a drunken Tyroshi with a purple beard dandled a buxom young wench on his knee. He’d unlaced her bodice and was tilting his cup to pour a thin trickle of wine over her breasts so he might lap it off. Two other girls sat playing at tiles before a leaded glass window. The freckled one wore a chain of blue flowers in her honeyed hair. The other had skin as smooth and black as polished jet, wide dark eyes, small pointed breasts. They dressed in flowing silks cinched at the waist with beaded belts. The sunlight pouring through the colored glass outlined their sweet young bodies through the thin cloth, and Tyrion felt a stirring in his groin.  I would respectfully suggest the dark-skinned girl,  said Chataya.   She’s young.    She has sixteen years, my lord.   A good age for Joffrey, he thought, remembering what Bronn had said. His first had been even younger. Tyrion remembered how shy she’d seemed as he drew her dress up over her head the first time."
}