{
  "id": "b12e8d4458002c26f81683862e0746706b766b74",
  "text": " Here and there was a   cup or basin of polished bronze; and a goblet of plain  silver was set by the  Captain's seat in the middle of the inmost table.       Faramir went about  among the men, questioning each as he came in, in a   soft  voice. Some came back from the pursuit of  the Southrons; others, left   behind as scouts near the roa d, came in latest. All  the Southrons  had been  accounted for, save  only the  great mymak:  what happened to him none could  say. Of the enemy no movement could be seen; not even an orc-spy was  abroad.       'You saw and heard nothing, Anborn?' Faramir asked of the latest comer.       `Well, no, lord,' said the man. `No Orc at least. But I saw, or thought  I saw,  something a little strange. It was getting deep dusk, when the  eyes  make things greater than they should be. So perhaps it may have been no more  than a squirrel.' Sam pricked up  his ears at this.  'Yet if  so,  it  was a   black squirrel, and I saw no tail. 'Twas like a shadow on the ground, and it  whisked behind a tree-trunk when  I drew  nigh and went up aloft as swift as  any squirrel could.  You wi ll not have us  slay wild  beasts for no purpose,  and it  seemed  no  more, so I  tried  no arrow.  It was too  dark for  sure  shooting anyway, and the creature was gone into the gloom of the leaves in a  twinkling.  But  I stayed  for a  while, for  it seemed strange, and then  I  hastened back. I  thought I heard the thing hiss at me from high above as  I  turned away.  A large squirrel,  maybe.  Perhaps  under  the  shadow of  the  Unnamed  some of the beasts of Mirkwood are  wandering hither to our   woods.  They have black squirrels there, 'tis said.'       `Perhaps,' said Faramir. `But that would be an ill omen, if it were so.  We do  not want the  escapes of Mirkwood in Ithilien.'  Sam  fancied that he   gave a swift glance towards the hobbits as he  spoke; but Sam  said nothing.   For a  while he and Frodo lay back and watched the torchlight, and  the  men  moving  to and  fro  speaking in  hushed  voices. Then  suddenly  Frodo fell   asleep.   ####-     Sam  struggled with himself, arguing this  way and that. `He may be a ll  right,' he  thought, 'and then  he  may  not.  Fair  speech may hide  a foul  heart.' He yawned. `I could sleep for a week, and I'd be better  for it. And  what  can  I do, if I do  keep  awake, me all alone, and all these great Men  about? Nothing, Sam Gamgee; but you've got to keep awake  all the same.' And  somehow he managed it. The light faded from the cave door, and the grey veil  of falling water grew dim and was lost in gathering shadow. Always the sound  of the water went on, never changing its note, morning or evening  or night.   It murmured and whispered of sleep. Sam stuck his knuckles in his eyes.       Now more torches  were being  lit. A cask of wine was broached. Storage  barrels were being opened. Men were  fetching water from the fall. Some were  laving  their hands  in  basins. A  wide copper bowl and  a white cloth were  brought to Faramir and he washed.       `Wake our guests,' he said, `and take them water. It is time to eat.'       Frodo sat  up and yawned and  stretched.  Sam, not used to being waited  on, looked with some surprise at the tall man who bowed, holding a basin  of  water before him.       'Put it on the ground, master, if you please! ' he said. 'Easier for me  and you.' Then to  the astonishment and amusement of  the Men he plunged his  head into the cold water and splashed his neck and ears.        'Is it the custom  in  your land to wash the head before supper? ' said  the man who waited on the hobbits.        `No, before  breakfast,' said Sam. `But  if  you're short of sleep cold  water on the neck's like  rain  on a wilted lettuce.  There! Now  I can keep  awake long enough to eat a bit.'       They were led then to seats beside Faramir: barrels  covered with pelts  and high enough above the  benches of the Men  for their convenience. Before  they ate,  Faramir  and all  his  men turned  and faced west in  a moment of  silence. Faramir signed to Frodo and Sam that they should do likewise.       'So we always do.' he  said, as they sat down: `we look towards N®menor  that  was,  and beyond to  Elvenhome that is, and  to  that which  is beyond  Elvenhome and will ever be. Have you no such custom at meat? '       `No,' said  Frodo,  feeling  strangely rustic and untutored. `But if we  are guests, we bow to  our host, and  after we have eaten we rise  and thank  him.'       'That we do also,' said Faramir.       After so long  journeying  and  camping, and  days spent ¤n  the lonely   ####-wild, the evening meal seemed a feast  to the hobbits:  to drink pale yellow  wine, cool and  fragrant,  and eat bread  and butter, and salted  meats, and  dried fruits,  and good red cheese, with clean  hands and clean  knives  and  plates. Neither Frodo  nor  Sam  refused  anything that was  offered,  nor a   second, nor indeed a  third helping.  The  wine coursed in their  veins  and  tired limbs, and they felt glad and easy of heart as they had not done since  they left the land of Lurien."
}