{
  "id": "b1aa28a0f3e3e17eaa1ac04c1ce6c440a469e893",
  "text": "  Yes,  he wimpered,  yes, Colemon was purging, so I sent him away. The queen needed Lord Arryn dead, she did not say so, could not, Varys was listening, always listening, but when I looked at her I knew. It was not me who gave him the poison, though, I swear it.  The old man wept.  Varys will tell you, it was the boy, his squire, Hugh he was called, he must surely have done it, ask your sister, ask her.   Tyrion was disgusted.  Bind him and take him away,  he commanded.  Throw him down in one of the black cells.   They dragged him out the splintered door.  Lannister,  he moaned,  all I’ve done has been for Lannister…   When he was gone, Tyrion made a leisurely search of the quarters and collected a few more small jars from his shelves. The ravens muttered above his head as he worked, a strangely peaceful noise. He would need to find someone to tend the birds until the Citadel sent a man to replace Pycelle.  He was the one I’d hoped to trust. Varys and Littlefinger were no more loyal, he suspected… only more subtle, and thus more dangerous. Perhaps his father’s way would have been best: summon Ilyn Payne, mount three heads above the gates, and have done. And wouldn’t that be a pretty sight, he thought.      ARYA  Fear cuts deeper than swords, Arya would tell herself, but that did not make the fear go away. It was as much a part of her days as stale bread and the blisters on her toes after a long day of walking the hard, rutted road.  She had thought she had known what it meant to be afraid, but she learned better in that storehouse beside the Gods Eye. Eight days she had lingered there before the Mountain gave the command to march, and every day she had seen someone die.  The Mountain would come into the storehouse after he had broken his fast and pick one of the prisoners for questioning. The village folk would never look at him. Maybe they thought that if they did not notice him, he would not notice them… but he saw them anyway and picked whom he liked. There was no place to hide, no tricks to play, no way to be safe.  One girl shared a soldier’s bed three nights running; the Mountain picked her on the fourth day, and the soldier said nothing.  A smiley old man mended their clothing and babbled about his son, off serving in the gold cloaks at King’s Landing.  A king’s man, he is,  he would say,  a good king’s man like me, all for Joffrey.  He said it so often the other captives began to call him All-for-Joffrey whenever the guards weren’t listening. All-for-Joffrey was picked on the fifth day.  A young mother with a pox-scarred face offered to freely tell them all she knew if they’d promise not to hurt her daughter. The Mountain heard her out; the next morning he picked her daughter, to be certain she’d held nothing back.  The ones chosen were questioned in full view of the other captives, so they could see the fate of rebels and traitors. A man the others called the Tickler asked the questions. His face was so ordinary and his garb so plain that Arya might have thought him one of the villagers before she had seen him at his work.  Tickler makes them howl so hard they piss themselves,  old stoop-shoulder Chiswyck told them. He was the man she’d tried to bite, who’d called her a fierce little thing and smashed her head with a mailed fist. Sometimes he helped the Tickler. Sometimes others did that. Ser Gregor Clegane himself would stand motionless, watching and listening, until the victim died.  The questions were always the same. Was there gold hidden in the village? Silver, gems? Was there more food? Where was Lord Beric Dondarrion? Which of the village folk had aided him? When he rode off, where did he go? How many men were with them? How many knights, how many bowmen, how many men-at-arms? How were they armed? How many were horsed? How many were wounded? What other enemy had they seen? How many? When? What banners did they fly? Where did they go? Was there gold hidden in the village? Silver, gems? Where was Lord Beric Dondarrion? How many men were with him? By the third day, Arya could have asked the questions herself.  They found a little gold, a little silver, a great sack of copper pennies, and a dented goblet set with garnets that two soldiers almost came to blows over. They learned that Lord Beric had ten starvelings with him, or else a hundred mounted knights; that he had ridden west, or north, or south; that he had crossed the lake in a boat; that he was strong as an aurochs or weak from the bloody flux. No one ever survived the Tickler’s questioning; no man, no woman, no child. The strongest lasted past evenfall. Their bodies were hung beyond the fires for the wolves.  By the time they marched, Arya knew she was no water dancer. Syrio Forel would never have let them knock him down and take his sword away, nor stood by when they killed Lommy Greenhands. Syrio would never have sat silent in that storehouse nor shuffled along meekly among the other captives. The direwolf was the sigil of the Starks, but Arya felt more a lamb, surrounded by a herd of other sheep."
}