{
  "id": "b1b6f2746052493b1feed246542191834a7244c7",
  "text": "    I don’t care,  Arya said.  The wheelhouse doesn’t even have windows, you can’t see a thing.    What could you want to see?  Sansa said, annoyed. She had been thrilled by the invitation, and her stupid sister was going to ruin everything, just as she’d feared.  It’s all just fields and farms and holdfasts.    It is not,  Arya said stubbornly.  If you came with us sometimes, you’d see.    I hate riding,  Sansa said fervently.  All it does is get you soiled and dusty and sore.   Arya shrugged.  Hold still,  she snapped at Nymeria,  I’m not hurting you.  Then to Sansa she said,  When we were crossing the Neck, I counted thirty-six flowers I never saw before, and Mycah showed me a lizard-lion.   Sansa shuddered. They had been twelve days crossing the Neck, rumbling down a crooked causeway through an endless black bog, and she had hated every moment of it. The air had been damp and clammy, the causeway so narrow they could not even make proper camp at night, they had to stop right on the kingsroad. Dense thickets of half-drowned trees pressed close around them, branches dripping with curtains of pale fungus. Huge flowers bloomed in the mud and floated on pools of stagnant water, but if you were stupid enough to leave the causeway to pluck them, there were quicksands waiting to suck you down, and snakes watching from the trees, and lizard-lions floating half-submerged in the water, like black logs with eyes and teeth.  None of which stopped Arya, of course. One day she came back grinning her horsey grin, her hair all tangled and her clothes covered in mud, clutching a raggedy bunch of purple and green flowers for Father. Sansa kept hoping he would tell Arya to behave herself and act like the highborn lady she was supposed to be, but he never did, he only hugged her and thanked her for the flowers. That just made her worse.  Then it turned out the purple flowers were called poison kisses, and Arya got a rash on her arms. Sansa would have thought that might have taught her a lesson, but Arya laughed about it, and the next day she rubbed mud all over her arms like some ignorant bog woman just because her friend Mycah told her it would stop the itching. She had bruises on her arms and shoulders too, dark purple welts and faded green-and-yellow splotches, Sansa had seen them when her sister undressed for sleep. How she had gotten those only the seven gods knew.  Arya was still going on, brushing out Nymeria’s tangles and chattering about things she’d seen on the trek south.  Last week we found this haunted watchtower, and the day before we chased a herd of wild horses. You should have seen them run when they caught a scent of Nymeria.  The wolf wriggled in her grasp and Arya scolded her.  Stop that, I have to do the other side, you’re all muddy.    You’re not supposed to leave the column,  Sansa reminded her.  Father said so.   Arya shrugged.  I didn’t go far. Anyway, Nymeria was with me the whole time. I don’t always go off, either. Sometimes it’s fun just to ride along with the wagons and talk to people.   Sansa knew all about the sorts of people Arya liked to talk to: squires and grooms and serving girls, old men and naked children, rough-spoken freeriders of uncertain birth. Arya would make friends with anybody. This Mycah was the worst; a butcher’s boy, thirteen and wild, he slept in the meat wagon and smelled of the slaughtering block. Just the sight of him was enough to make Sansa feel sick, but Arya seemed to prefer his company to hers.  Sansa was running out of patience now.  You have to come with me,  she told her sister firmly.  You can’t refuse the queen. Septa Mordane will expect you.   Arya ignored her. She gave a hard yank with the brush. Nymeria growled and spun away, affronted.  Come back here!    There’s going to be lemon cakes and tea,  Sansa went on, all adult and reasonable. Lady brushed against her leg. Sansa scratched her ears the way she liked, and Lady sat beside her on her haunches, watching Arya chase Nymeria.  Why would you want to ride a smelly old horse and get all sore and sweaty when you could recline on feather pillows and eat cakes with the queen?    I don’t like the queen,  Arya said casually. Sansa sucked in her breath, shocked that even Arya would say such a thing, but her sister prattled on, heedless.  She won’t even let me bring Nymeria.  She thrust the brush under her belt and stalked her wolf. Nymeria watched her approach warily.   A royal wheelhouse is no place for a wolf,  Sansa said.  And Princess Myrcella is afraid of them, you know that.    Myrcella is a little baby.  Arya grabbed Nymeria around her neck, but the moment she pulled out the brush again the direwolf wriggled free and bounded off. Frustrated, Arya threw down the brush.  Bad wolf!  she shouted.  Sansa couldn’t help but smile a little. The kennelmaster once told her that an animal takes after its master. She gave Lady a quick little hug. Lady licked her cheek. Sansa giggled. Arya heard and whirled around, glaring."
}