{
  "id": "b2023e959b100c7d03070f439e69115c197a3e2b",
  "text": " We’ll carry water, and make certain we are well supplied,  Jon knew better than to argue. So the command was given, and the brothers of the Night’s Watch raised their camp behind the stone ring the First Men had made. Black tents sprouted like mushrooms after a rain, and blankets and bedrolls covered the bare ground. Stewards tethered the garrons in long lines, and saw them fed and watered. Foresters took their axes to the trees in the waning afternoon light to harvest enough wood to see them through the night. A score of builders set to clearing brush, digging latrines, and untying their bundles of fire-hardened stakes.  I will have every opening in the ringwall ditched and staked before dark,  the Old Bear had commanded.  Once he’d put up the Lord Commander’s tent and seen to their horses, Jon Snow descended the hill in search of Ghost. The direwolf came at once, all in silence. One moment Jon was striding beneath the trees, whistling and shouting, alone in the green, pinecones and fallen leaves under his feet; the next, the great white direwolf was walking beside him, pale as morning mist.  But when they reached the ringfort, Ghost balked again. He padded forward warily to sniff at the gap in the stones, and then retreated, as if he did not like what he’d smelled. Jon tried to grab him by the scruff of his neck and haul him bodily inside the ring, no easy task; the wolf weighed as much as he did, and was stronger by far.  Ghost, what’s wrong with you?  It was not like him to be so unsettled. In the end Jon had to give it up.  As you will,  he told the wolf.  Go, hunt.  The red eyes watched him as he made his way back through the mossy stones.  They ought to be safe here. The hill offered commanding views, and the slopes were precipitous to the north and west and only slightly more gentle to the east. Yet as the dusk deepened and darkness seeped into the hollows between the trees, Jon’s sense of foreboding grew. This is the haunted forest, he told himself. Maybe there are ghosts here, the spirits of the First Men. This was their place, once.   Stop acting the boy,  he told himself. Clambering atop the piled rocks, Jon gazed off toward the setting sun. He could see the light shimmering like hammered gold off the surface of the Milkwater as it curved away to the south. Upriver the land was more rugged, the dense forest giving way to a series of bare stony hills that rose high and wild to the north and west. On the horizon stood the mountains like a great shadow, range on range of them receding into the blue-grey distance, their jagged peaks sheathed eternally in snow. Even from afar they looked vast and cold and inhospitable.  Closer at hand, it was the trees that ruled. To south and east the wood went on as far as Jon could see, a vast tangle of root and limb painted in a thousand shades of green, with here and there a patch of red where a weirwood shouldered through the pines and sentinels, or a blush of yellow where some broadleafs had begun to turn. When the wind blew, he could hear the creak and groan of branches older than he was. A thousand leaves fluttered, and for a moment the forest seemed a deep green sea, storm-tossed and heaving, eternal and unknowable.  Ghost was not like to be alone down there, he thought. Anything could be moving under that sea, creeping toward the ringfort through the dark of the wood, concealed beneath those trees. Anything. How would they ever know? He stood there for a long time, until the sun vanished behind the saw-toothed mountains and darkness began to creep through the forest.   Jon?  Samwell Tarly called up.  I thought it looked like you. Are you well?    Well enough.  Jon hopped down.  How did you fare today?    Well. I fared well. Truly.   Jon was not about to share his disquiet with his friend, not when Samwell Tarly was at last beginning to find his courage.  The Old Bear means to wait here for Qhorin Halfhand and the men from the Shadow Tower.    It seems a strong place,  said Sam.  A ringfort of the First Men. Do you think there were battles fought here?    No doubt. You’d best get a bird ready. Mormont will want to send back word.    I wish I could send them all. They hate being caged.    You would too, if you could fly.    If I could fly, I’d be back at Castle Black eating a pork pie,  said Sam.  Jon clapped him on the shoulder with his burned hand. They walked back through the camp together. Cookfires were being lit all around them. Overhead, the stars were coming out. The long red tail of Mormont’s Torch burned as bright as the moon. Jon heard the ravens before he saw them. Some were calling his name. The birds were not shy when it came to making noise.  They feel it too.  I’d best see to the Old Bear,  he said.  He gets noisy when he isn’t fed as well.   He found Mormont talking with Thoren Smallwood and half a dozen other officers.  There you are,  the old man said gruffly.  Bring us some hot wine, if you would. The night is chilly.    Yes, my lord.  Jon built a cookfire, claimed a small cask of Mormont’s favorite robust red from stores, and poured it into a kettle."
}