{
  "id": "b2188489557b750ce9deb4d942c1a5932210c525",
  "text": " Her father’s guards waited on the water stair with her brother. Ser Edmure Tully was a stocky young man with a shaggy head of auburn hair and a fiery beard. His breastplate was scratched and dented from battle, his blue-and-red cloak stained by blood and smoke. At his side stood the Lord Tytos Blackwood, a hard pike of a man with close-cropped salt-and-pepper whiskers and a hook nose. His bright yellow armor was inlaid with jet in elaborate vine-and-leaf patterns, and a cloak sewn from raven feathers draped his thin shoulders. It had been Lord Tytos who led the sortie that plucked her brother from the Lannister camp.   Bring them in,  Ser Edmure commanded. Three men scrambled down the stairs knee-deep in the water and pulled the boat close with long hooks. When Grey Wind bounded out, one of them dropped his pole and lurched back, stumbling and sitting down abruptly in the river. The others laughed, and the man got a sheepish look on his face. Theon Greyjoy vaulted over the side of the boat and lifted Catelyn by the waist, setting her on a dry step above him as water lapped around his boots.  Edmure came down the steps to embrace her.  Sweet sister,  he murmured hoarsely. He had deep blue eyes and a mouth made for smiles, but he was not smiling now. He looked worn and tired, battered by battle and haggard from strain. His neck was bandaged where he had taken a wound. Catelyn hugged him fiercely.   Your grief is mine, Cat,  he said when they broke apart.  When we heard about Lord Eddard… the Lannisters will pay, I swear it, you will have your vengeance.    Will that bring Ned back to me?  she said sharply. The wound was still too fresh for softer words. She could not think about Ned now. She would not. It would not do. She had to be strong.  All that will keep. I must see Father.    He awaits you in his solar,  Edmure said.   Lord Hoster is bedridden, my lady,  her father’s steward explained. When had that good man grown so old and grey?  He instructed me to bring you to him at once.    I’ll take her.  Edmure escorted her up the water stair and across the lower bailey, where Petyr Baelish and Brandon Stark had once crossed swords for her favor. The massive sandstone walls of the keep loomed above them. As they pushed through a door between two guardsmen in fish-crest helms, she asked,  How bad is he?  dreading the answer even as she said the words.  Edmure’s look was somber.  He will not be with us long, the maesters say. The pain is… constant, and grievous.   A blind rage filled her, a rage at all the world; at her brother Edmure and her sister Lysa, at the Lannisters, at the maesters, at Ned and her father and the monstrous gods who would take them both away from her.  You should have told me,  she said.  You should have sent word as soon as you knew.    He forbade it. He did not want his enemies to know that he was dying. With the realm so troubled, he feared that if the Lannisters suspected how frail he was…    …they might attack?  Catelyn finished, hard. It was your doing, yours, a voice whispered inside her. If you had not taken it upon yourself to seize the dwarf…  They climbed the spiral stair in silence.  The keep was three-sided, like Riverrun itself, and Lord Hoster’s solar was triangular as well, with a stone balcony that jutted out to the east like the prow of some great sandstone ship. From there the lord of the castle could look down on his walls and battlements, and beyond, to where the waters met. They had moved her father’s bed out onto the balcony.  He likes to sit in the sun and watch the rivers,  Edmure explained.  Father, see who I’ve brought. Cat has come to see you…   Hoster Tully had always been a big man; tall and broad in his youth, portly as he grew older. Now he seemed shrunken, the muscle and meat melted off his bones. Even his face sagged. The last time Catelyn had seen him, his hair and beard had been brown, well streaked with grey. Now they had gone white as snow.  His eyes opened to the sound of Edmure’s voice.  Little cat,  he murmured in a voice thin and wispy and wracked by pain.  My little cat.  A tremulous smile touched his face as his hand groped for hers.  I watched for you…    I shall leave you to talk,  her brother said, kissing their lord father gently on the brow before he withdrew.  Catelyn knelt and took her father’s hand in hers. It was a big hand, but fleshless now, the bones moving loosely under the skin, all the strength gone from it.  You should have told me,  she said.  A rider, a raven…    Riders are taken, questioned,  he answered.  Ravens are brought down…  A spasm of pain took him, and his fingers clutched hers hard.  The crabs are in my belly… pinching, always pinching. Day and night. They have fierce claws, the crabs. Maester Vyman makes me dreamwine, milk of the poppy… I sleep a lot… but I wanted to be awake to see you, when you came. I was afraid… when the Lannisters took your brother, the camps all around us… was afraid I would go, before I could see you again… I was afraid…    I’m here, Father,  she said."
}