{
  "id": "b23677245fb3b5a7e049063e3bbb72f398918a6f",
  "text": "  If Voldemort is really getting stronger again, he wrote, my priority is to ensure your safety. He cannot hope to lay hands on you while you are under Dumbledore's protection, but all the same, take no risks: Concentrate on getting through that maze safely, and then we can turn our attention to other matters.  Harry's nerves mounted as June the twenty-fourth drew closer, but they were not as bad as those he had felt before the first and second tasks.  For one thing, he was confident that, this time, he had done everything in his power to prepare for the task.  For another, this was the final hurdle, and however well or badly he did, the tournament would at last be over, which would be an enormous relief.  Breakfast was a very noisy affair at the Gryffindor table on the morning of the third task. The post owls appeared, bringing Harry a good-luck card from Sirius.  It was only a piece of parchment, folded over and bearing a muddy paw print on its front, but Harry appreciated it all the same.  A screech owl arrived for Hermione, carrying her morning copy of the Daily Prophet as usual.  She unfolded the paper, glanced at the front page, and spat out a mouthful of pumpkin juice all over it. \"What?\" said Harry and Ron together, staring at her.  \"Nothing,\" said Hermione quickly, trying to shove the paper out of sight, but Ron grabbed it.  He stared at the headline and said, \"No way.  Not today.  That old cow.\" \"What?\"  said Harry.  \"Rita Skeeter again?\"  \"No,\" said Ron, and just like Hermione, he attempted to push the paper out of sight. \"It's about me, isn't it?\" said Harry.  \"No,\" said Ron, in an entirely unconvincing tone.  But before Harry could demand to see the paper.  Draco Malfoy shouted across the Great Hall from the Slytherin table. \"Hey, Potter!  Potter!  How's your head?  You feeling all right?  Sure you're not going to go berserk on us?\" Malfoy was holding a copy of the Daily Prophet too. Slytherins up and down the table were sniggering, twisting in their seats to see Harry's reaction. \"Let me see it,\" Harry said to Ron.  \"Give it here.\"  Very reluctantly, Ron handed over the newspaper. Harry turned it over and found himself staring at his own picture, beneath the banner headline:  \"HARRY POTTER \"DISTURBED AND DANGEROUS\"  The boy who defeated He-Who-Must-Not-Be-Named is unstable and possibly dangerous, writes Rita Skeeter, Special Correspondent.  Alarming evidence has recently come to light about Harry Potter's strange behavior, which casts doubts upon his suitability to compete in a demanding competition like the Triwizard Tournament, or even to attend Hogwarts School. Potter, the Daily Prophet can exclusively reveal, regularly collapses at school, and is often heard to complain of pain in the scar on his forehead (relic of the curse with which You-Know-Who attempted to kill him).  On Monday last, midway through a Divination lesson, your Daily Prophet reporter witnessed Potter storming from the class, claiming that his scar was hurting too badly to continue studying. It is possible, say top experts at St. Mungo's Hospital for Magical Maladies and Injuries, that Potters brain was affected by the attack inflicted upon him by You-Know-Who, and that his insistence that the scar is still hurting is an expression of his deep-seated confusion. \"He might even be pretending,\" said one specialist. \"This could be a plea for attention.\" The Daily Prophet, however, has unearthed worrying facts about Harry Potter that Albus Dumbledore, Headmaster of Hogwarts, has carefully concealed from the wizarding public. \"Potter can speak Parseltongue,\" reveals Draco Malfoy, a Hogwarts fourth year.  \"There were a lot of attacks on students a couple of years ago, and most people thought Potter was behind them after they saw him lose his temper at a dueling club and set a snake on another boy.  It was all hushed up, though. But he's made friends with werewolves and giants too.  We think he'd do anything for a bit of power.\" Parseltongue, the ability to converse with snakes, has long been considered a Dark Art.  Indeed, the most famous Parselmouth of our times is none other than You-Know-Who himself.  A member of the Dark Force Defense League, who wished to remain unnamed, stated that he would regard any wizard who could speak Parseltongue \"as worthy of investigation. Personally, I would be highly suspicious of anybody who could converse with snakes, as serpents are often used in the worst kinds of Dark Magic, and are historically associated with evildoers.\"  Similarly, \"anyone who seeks out the company of such vicious creatures as werewolves and giants would appear to have a fondness for violence.\" Albus Dumbledore should surely consider whether a boy such as this should be allowed to compete in the Triwizard Tournament.  Some fear that Potter might resort to the Dark Arts in his desperation to win the tournament, the third task of which takes place this evening.  \"Gone off me a bit, hasn't she?\"  said Harry lightly, folding up the paper."
}