{
  "id": "b25016430d1e3e48cc95636ae70e41705497f245",
  "text": "  Littlefinger rose.  I trust that on my return, the king will see that I am suitably rewarded for my valiant efforts in his cause?   Varys giggled.  Joffrey is such a grateful sovereign, I’m certain you will have no cause to complain, my good brave lord.   The queen was more direct.  What do you want, Petyr?   Littlefinger glanced at Tyrion with a sly smile.  I shall need to give that some consideration. No doubt I’ll think of something.  He sketched an airy bow and took his leave, as casual as if he were off to one of his brothels.  Tyrion glanced out the window. The fog was so thick that he could not even see the curtain wall across the yard. A few dim lights shone indistinct through that greyness. A foul day for travel, he thought. He did not envy Petyr Baelish.  We had best see to drawing up those documents. Lord Varys, send for parchment and quill. And someone will need to wake Joffrey.   It was still grey and dark when the meeting finally ended. Varys scurried off alone, his soft slippers whisking along the floor. The Lannisters lingered a moment by the door.  How comes your chain, brother?  the queen asked as Ser Preston fastened a vair-lined cloth-of-silver cloak about her shoulders.   Link by link, it grows longer. We should thank the gods that Ser Cortnay Penrose is as stubborn as he is. Stannis will never march north with Storm’s End untaken in his rear.    Tyrion, I know we do not always agree on policy, but it seems to me that I was wrong about you. You are not so big a fool as I imagined. In truth, I realize now that you have been a great help. For that I thank you. You must forgive me if I have spoken to you harshly in the past.    Must I?  He gave her a shrug, a smile.  Sweet sister, you have said nothing that requires forgiveness.    Today, you mean?  They both laughed… and Cersei leaned over and planted a quick, soft kiss on his brow.  Too astonished for words, Tyrion could only watch her stride off down the hall, Ser Preston at her side.  Have I lost my wits, or did my sister just kiss me?  he asked Bronn when she was gone.   Was it so sweet?    It was… unanticipated.  Cersei had been behaving queerly of late. Tyrion found it very unsettling.  I am trying to recall the last time she kissed me. I could not have been more than six or seven. Jaime had dared her to do it.    The woman’s finally taken note of your charms.    No,  Tyrion said.  No, the woman is hatching something. Best find out what, Bronn. You know I hate surprises.       THEON  Theon wiped the spittle off his cheek with the back of his hand.  Robb will gut you, Greyjoy,  Benfred Tallheart screamed.  He’ll feed your turncloak’s heart to his wolf, you piece of sheep dung.   Aeron Damphair’s voice cut through the insults like a sword through cheese.  Now you must kill him.    I have questions for him first,  said Theon.   Fuck your questions.  Benfred hung bleeding and helpless between Stygg and Werlag.  You’ll choke on them before you get any answers from me, craven. Turncloak.   Uncle Aeron was relentless.  When he spits on you, he spits on all of us. He spits on the Drowned God. He must die.    My father gave me the command here, Uncle.    And sent me to counsel you.   And to watch me. Theon dare not push matters too far with his uncle. The command was his, yes, but his men had a faith in the Drowned God that they did not have in him, and they were terrified of Aeron Damphair. I cannot fault them for that.   You’ll lose your head for this, Greyjoy. The crows will eat the jelly of your eyes.  Benfred tried to spit again, but only managed a little blood.  The Others bugger your wet god.   Tallhart, you’ve spit away your life, Theon thought.  Stygg, silence him,  he said.  They forced Benfred to his knees. Werlag tore the rabbitskin off his belt and jammed it between his teeth to stop his shouting. Stygg unlimbered his axe.   No,  Aeron Damphair declared.  He must be given to the god. The old way.   What does it matter? Dead is dead.  Take him, then.    You will come as well. You command here. The offering should come from you.   That was more than Theon could stomach.  You are the priest, Uncle, I leave the god to you. Do me the same kindness and leave the battles to me.  He waved his hand, and Werlag and Stygg began to drag their captive off toward the shore. Aeron Damphair gave his nephew a reproachful look, then followed. Down to the pebbled beach they would go, to drown Benfred Tallhart in salt water. The old way.  Perhaps it’s a kindness, Theon told himself as he stalked off in the other direction. Stygg was hardly the most expert of headsmen, and Benfred had a neck thick as a boar’s, heavy with muscle and fat. I used to mock him for it, just to see how angry I could make him, he remembered. That had been, what, three years past? When Ned Stark had ridden to Torrhen’s Square to see Ser Helman, Theon had accompanied him and spent a fortnight in Benfred’s company.  He could hear the rough noises of victory from the crook in the road where the battle had been fought… if you’d go so far as to call it a battle."
}