{
  "id": "b2812b8cfbfc4291613f21d85545e4c9c6f55334",
  "text": " He refused to let it trouble him.  Men will look at you,  Maester Luwin had warned him the first time they had strapped the wicker basket around Hodor’s chest.  They will look, and they will talk, and some will mock you.  Let them mock, Bran thought. No one mocked him in his bedchamber, but he would not live his life in bed.  As they passed beneath the gatehouse portcullis, Bran put two fingers into his mouth and whistled. Summer came loping across the yard. Suddenly the Karstark lancers were fighting for control, as their horses rolled their eyes and whickered in dismay. One stallion reared, screaming, his rider cursing and hanging on desperately. The scent of the direwolves sent horses into a frenzy of fear if they were not accustomed to it, but they’d quiet soon enough once Summer was gone.  The godswood,  Bran reminded Hodor.  Even Winterfell itself was crowded. The yard rang to the sound of sword and axe, the rumble of wagons, and the barking of dogs. The armory doors were open, and Bran glimpsed Mikken at his forge, his hammer ringing as sweat dripped off his bare chest. Bran had never seen as many strangers in all his years, not even when King Robert had come to visit Father.  He tried not to flinch as Hodor ducked through a low door. They walked down a long dim hallway, Summer padding easily beside them. The wolf glanced up from time to time, eyes smoldering like liquid gold. Bran would have liked to touch him, but he was riding too high for his hand to reach.  The godswood was an island of peace in the sea of chaos that Winterfell had become. Hodor made his way through the dense stands of oak and ironwood and sentinels, to the still pool beside the heart tree. He stopped under the gnarled limbs of the weirwood, humming. Bran reached up over his head and pulled himself out of his seat, drawing the dead weight of his legs up through the holes in the wicker basket. He hung for a moment, dangling, the dark red leaves brushing against his face, until Hodor lifted him and lowered him to the smooth stone beside the water.  I want to be by myself for a while,  he said.  You go soak. Go to the pools.    Hodor.  Hodor stomped through the trees and vanished. Across the godswood, beneath the windows of the Guest House, an underground hot spring fed three small ponds. Steam rose from the water day and night, and the wall that loomed above was thick with moss. Hodor hated cold water, and would fight like a treed wildcat when threatened with soap, but he would happily immerse himself in the hottest pool and sit for hours, giving a loud burp to echo the spring whenever a bubble rose from the murky green depths to break upon the surface.  Summer lapped at the water and settled down at Bran’s side. He rubbed the wolf under the jaw, and for a moment boy and beast both felt at peace. Bran had always liked the godswood, even before, but of late he found himself drawn to it more and more. Even the heart tree no longer scared him the way it used to. The deep red eyes carved into the pale trunk still watched him, yet somehow he took comfort from that now. The gods were looking over him, he told himself; the old gods, gods of the Starks and the First Men and the children of the forest, his father’s gods. He felt safe in their sight, and the deep silence of the trees helped him think. Bran had been thinking a lot since his fall; thinking, and dreaming, and talking with the gods.   Please make it so Robb won’t go away,  he prayed softly. He moved his hand through the cold water, sending ripples across the pool.  Please make him stay. Or if he has to go, bring him home safe, with Mother and Father and the girls. And make it… make it so Rickon understands.   His baby brother had been wild as a winter storm since he learned Robb was riding off to war, weeping and angry by turns. He’d refused to eat, cried and screamed for most of a night, even punched Old Nan when she tried to sing him to sleep, and the next day he’d vanished. Robb had set half the castle searching for him, and when at last they’d found him down in the crypts, Rickon had slashed at them with a rusted iron sword he’d snatched from a dead king’s hand, and Shaggydog had come slavering out of the darkness like a green-eyed demon. The wolf was near as wild as Rickon; he’d bitten Gage on the arm and torn a chunk of flesh from Mikken’s thigh. It had taken Robb himself and Grey Wind to bring him to bay. Farlen had the black wolf chained up in the kennels now, and Rickon cried all the more for being without him.  Maester Luwin counseled Robb to remain at Winterfell, and Bran pleaded with him too, for his own sake as much as Rickon’s, but his brother only shook his head stubbornly and said,  I don’t want to go. I have to.   It was only half a lie. Someone had to go, to hold the Neck and help the Tullys against the Lannisters, Bran could understand that, but it did not have to be Robb. His brother might have given the command to Hal Mollen or Theon Greyjoy, or to one of his lords bannermen."
}