{
  "id": "b2d4f350ad2a4232df1cfc1491a67d06bfec467a",
  "text": " Let me wake the stone dragons. Three is three. Give me the boy.    Edric Storm,  Davos said.  Stannis rounded on him in a cold fury.  I know his name. Spare me your reproaches. I like this no more than you do, but my duty is to the realm. My duty…  He turned back to Melisandre.  You swear there is no other way? Swear it on your life, for I promise, you shall die by inches if you lie.    You are he who must stand against the Other. The one whose coming was prophesied five thousand years ago. The red comet was your herald. You are the prince that was promised, and if you fail the world fails with you.  Melisandre went to him, her red lips parted, her ruby throbbing.  Give me this boy,  she whispered,  and I will give you your kingdom.    He can’t,  said Davos.  Edric Storm is gone.    Gone?  Stannis turned.  What do you mean, gone?    He is aboard a Lyseni galley, safely out to sea.  Davos watched Melisandre’s pale, heart-shaped face. He saw the flicker of dismay there, the sudden uncertainty. She did not see it!  The king’s eyes were dark blue bruises in the hollows of his face.  The bastard was taken from Dragonstone without my leave? A galley, you say? If that Lysene pirate thinks to use the boy to squeeze gold from me—    This is your Hand’s work, sire.  Melisandre gave Davos a knowing look.  You will bring him back, my lord. You will.    The boy is out of my reach,  said Davos.  And out of your reach as well, my lady.   Her red eyes made him squirm.  I should have left you to the dark, ser. Do you know what you have done?    My duty.    Some might call it treason.  Stannis went to the window to stare out into the night. Is he looking for the ship?  I raised you up from dirt, Davos.  He sounded more tired than angry.  Was loyalty too much to hope for?    Four of my sons died for you on the Blackwater. I might have died myself. You have my loyalty, always.  Davos Seaworth had thought long and hard about the words he said next; he knew his life depended on them.  Your Grace, you made me swear to give you honest counsel and swift obedience, to defend your realm against your foes, to protect your people. Is not Edric Storm one of your people? One of those I swore to protect? I kept my oath. How could that be treason?   Stannis ground his teeth again.  I never asked for this crown. Gold is cold and heavy on the head, but so long as I am the king, I have a duty… If I must sacrifice one child to the flames to save a million from the dark… Sacrifice… is never easy, Davos. Or it is no true sacrifice. Tell him, my lady.   Melisandre said,  Azor Ahai tempered Lightbringer with the heart’s blood of his own beloved wife. If a man with a thousand cows gives one to god, that is nothing. But a man who offers the only cow he owns…    She talks of cows,  Davos told the king.  I am speaking of a boy, your daughter’s friend, your brother’s son.    A king’s son, with the power of kingsblood in his veins.  Melisandre’s ruby glowed like a red star at her throat.  Do you think you’ve saved this boy, Onion Knight? When the long night falls, Edric Storm shall die with the rest, wherever he is hidden. Your own sons as well. Darkness and cold will cover the earth. You meddle in matters you do not understand.    There’s much I don’t understand,  Davos admitted.  I have never pretended elsewise. I know the seas and rivers, the shapes of the coasts, where the rocks and shoals lie. I know hidden coves where a boat can land unseen. And I know that a king protects his people, or he is no king at all.   Stannis’s face darkened.  Do you mock me to my face? Must I learn a king’s duty from an onion smuggler?   Davos knelt.  If I have offended, take my head. I’ll die as I lived, your loyal man. But hear me first. Hear me for the sake of the onions I brought you, and the fingers you took.   Stannis slid Lightbringer from its scabbard. Its glow filled the chamber.  Say what you will, but say it quickly.  The muscles in the king’s neck stood out like cords.  Davos fumbled inside his cloak and drew out the crinkled sheet of parchment. It seemed a thin and flimsy thing, yet it was all the shield he had.  A King’s Hand should be able to read and write. Maester Pylos has been teaching me.  He smoothed the letter flat upon his knee and began to read by the light of the magic sword.      Jon   He dreamt he was back in Winterfell, limping past the stone kings on their thrones. Their grey granite eyes turned to follow him as he passed, and their grey granite fingers tightened on the hilts of the rusted swords upon their laps. You are no Stark, he could hear them mutter, in heavy granite voices. There is no place for you here. Go away. He walked deeper into the darkness.  Father?  he called.  Bran? Rickon?  No one answered. A chill wind was blowing on his neck.  Uncle?  he called.  Uncle Benjen? Father? Please, Father, help me.  Up above he heard drums. They are feasting in the Great Hall, but I am not welcome there. I am no Stark, and this is not my place."
}