{
  "id": "b2da1ff00b723885174a89015713f4c5ad19ebb5",
  "text": " She hugged her bare knees tight against her chest and shivered. She would wait quietly and count to ten thousand. By then it would be safe for her to come creeping back out and find her way home.  By the time she had reached eighty-seven, the room had begun to lighten as her eyes adjusted to the blackness. Slowly the shapes around her took on form. Huge empty eyes stared at her hungrily through the gloom, and dimly she saw the jagged shadows of long teeth. She had lost the count. She closed her eyes and bit her lip and sent the fear away. When she looked again, the monsters would be gone. Would never have been. She pretended that Syrio was beside her in the dark, whispering in her ear. Calm as still water, she told herself. Strong as a bear. Fierce as a wolverine. She opened her eyes again.  The monsters were still there, but the fear was gone.  Arya got to her feet, moving warily. The heads were all around her. She touched one, curious, wondering if it was real. Her fingertips brushed a massive jaw. It felt real enough. The bone was smooth beneath her hand, cold and hard to the touch. She ran her fingers down a tooth, black and sharp, a dagger made of darkness. It made her shiver.   It’s dead,  she said aloud.  It’s just a skull, it can’t hurt me.  Yet somehow the monster seemed to know she was there. She could feel its empty eyes watching her through the gloom, and there was something in that dim, cavernous room that did not love her. She edged away from the skull and backed into a second, larger than the first. For an instant she could feel its teeth digging into her shoulder, as if it wanted a bite of her flesh. Arya whirled, felt leather catch and tear as a huge fang nipped at her jerkin, and then she was running. Another skull loomed ahead, the biggest monster of all, but Arya did not even slow. She leapt over a ridge of black teeth as tall as swords, dashed through hungry jaws, and threw herself against the door.  Her hands found a heavy iron ring set in the wood, and she yanked at it. The door resisted a moment, before it slowly began to swing inward, with a creak so loud Arya was certain it could be heard all through the city. She opened the door just far enough to slip through, into the hallway beyond.  If the room with the monsters had been dark, the hall was the blackest pit in the seven hells. Calm as still water, Arya told herself, but even when she gave her eyes a moment to adjust, there was nothing to see but the vague grey outline of the door she had come through. She wiggled her fingers in front of her face, felt the air move, saw nothing. She was blind. A water dancer sees with all her senses, she reminded herself. She closed her eyes and steadied her breathing one two three, drank in the quiet, reached out with her hands.  Her fingers brushed against rough unfinished stone to her left. She followed the wall, her hand skimming along the surface, taking small gliding steps through the darkness. All halls lead somewhere. Where there is a way in, there is a way out. Fear cuts deeper than swords. Arya would not be afraid. It seemed as if she had been walking a long ways when the wall ended abruptly and a draft of cold air blew past her cheek. Loose hairs stirred faintly against her skin.  From somewhere far below her, she heard noises. The scrape of boots, the distant sound of voices. A flickering light brushed the wall ever so faintly, and she saw that she stood at the top of a great black well, a shaft twenty feet across plunging deep into the earth. Huge stones had been set into the curving walls as steps, circling down and down, dark as the steps to hell that Old Nan used to tell them of. And something was coming up out of the darkness, out of the bowels of the earth…  Arya peered over the edge and felt the cold black breath on her face. Far below, she saw the light of a single torch, small as the flame of a candle. Two men, she made out. Their shadows writhed against the sides of the well, tall as giants. She could hear their voices, echoing up the shaft.   …found one bastard,  one said.  The rest will come soon. A day, two days, a fortnight…    And when he learns the truth, what will he do?  a second voice asked in the liquid accents of the Free Cities.   The gods alone know,  the first voice said. Arya could see a wisp of grey smoke drifting up off the torch, writhing like a snake as it rose.  The fools tried to kill his son, and what’s worse, they made a mummer’s farce of it. He’s not a man to put that aside. I warn you, the wolf and lion will soon be at each other’s throats, whether we will it or no.    Too soon, too soon,  the voice with the accent complained.  What good is war now? We are not ready. Delay.    As well bid me stop time. Do you take me for a wizard?   The other chuckled.  No less.  Flames licked at the cold air. The tall shadows were almost on top of her. An instant later the man holding the torch climbed into her sight, his companion beside him. Arya crept back away from the well, dropped to her stomach, and flattened herself against the wall."
}