{
  "id": "b31c45136c06171cf647c83bf51dd39dfcf0f29b",
  "text": "  If Cersei kept her wits about her, she would insist the king sit in judgment of Tyrion himself. Even Ned Stark could scarcely object to that, not without impugning the honor of the king. And Tyrion would be only too glad to take his chances in a trial. Whatever murders they might lay at his door, the Starks had no proof of anything so far as he could see. Let them make their case before the Iron Throne and the lords of the land. It would be the end of them. If only Cersei were clever enough to see that…  Tyrion Lannister sighed. His sister was not without a certain low cunning, but her pride blinded her. She would see the insult in this, not the opportunity. And Jaime was even worse, rash and headstrong and quick to anger. His brother never untied a knot when he could slash it in two with his sword.  He wondered which of them had sent the footpad to silence the Stark boy, and whether they had truly conspired at the death of Lord Arryn. If the old Hand had been murdered, it was deftly and subtly done. Men of his age died of sudden illness all the time. In contrast, sending some oaf with a stolen knife after Brandon Stark struck him as unbelievably clumsy. And wasn’t that peculiar, come to think on it…  Tyrion shivered. Now there was a nasty suspicion. Perhaps the direwolf and the lion were not the only beasts in the woods, and if that was true, someone was using him as a catspaw. Tyrion Lannister hated being used.  He would have to get out of here, and soon. His chances of overpowering Mord were small to none, and no one was about to smuggle him a six-hundred-foot-long rope, so he would have to talk himself free. His mouth had gotten him into this cell; it could damn well get him out.  Tyrion pushed himself to his feet, doing his best to ignore the slope of the floor beneath him, with its ever-so-subtle tug toward the edge. He hammered on the door with a fist.  Mord!  he shouted.  Turnkey! Mord, I want you!  He had to keep it up a good ten minutes before he heard footsteps. Tyrion stepped back an instant before the door opened with a crash.   Making noise,  Mord growled, with blood in his eyes. Dangling from one meaty hand was a leather strap, wide and thick, doubled over in his fist.  Never show them you’re afraid, Tyrion reminded himself.  How would you like to be rich?  he asked.  Mord hit him. He swung the strap backhand, lazily, but the leather caught Tyrion high on the arm. The force of it staggered him, and the pain made him grit his teeth.  No mouth, dwarf man,  Mord warned him.   Gold,  Tyrion said, miming a smile.  Casterly Rock is full of gold… ahhhh…  This time the blow was a forehand, and Mord put more of his arm into the swing, making the leather crack and jump. It caught Tyrion in the ribs and dropped him to his knees, wimpering. He forced himself to look up at the gaoler.  As rich as the Lannisters,  he wheezed.  That’s what they say, Mord—   Mord grunted. The strap whistled through the air and smashed Tyrion full in the face. The pain was so bad he did not remember falling, but when he opened his eyes again he was on the floor of his cell. His ear was ringing, and his mouth was full of blood. He groped for purchase, to push himself up, and his fingers brushed against… nothing. Tyrion snatched his hand back as fast as if it had been scalded, and tried his best to stop breathing. He had fallen right on the edge, inches from the blue.   More to say?  Mord held the strap between his fists and gave it a sharp pull. The snap made Tyrion jump. The turnkey laughed.  He won’t push me over, Tyrion told himself desperately as he crawled away from the edge. Catelyn Stark wants me alive, he doesn’t dare kill me. He wiped the blood off his lips with the back of his hand, grinned, and said,  That was a stiff one, Mord.  The gaoler squinted at him, trying to decide if he was being mocked.  I could make good use of a strong man like you.  The strap flew at him, but this time Tyrion was able to cringe away from it. He took a glancing blow to the shoulder, nothing more.  Gold,  he repeated, scrambling backward like a crab,  more gold than you’ll see here in a lifetime. Enough to buy land, women, horses… you could be a lord. Lord Mord.  Tyrion hawked up a glob of blood and phlegm and spat it out into the sky.   Is no gold,  Mord said.  He’s listening! Tyrion thought.  They relieved me of my purse when they captured me, but the gold is still mine. Catelyn Stark might take a man prisoner, but she’d never stoop to rob him. That wouldn’t be honorable. Help me, and all the gold is yours.  Mord’s strap licked out, but it was a halfhearted, desultory swing, slow and contemptuous. Tyrion caught the leather in his hand and held it prisoned.  There will be no risk to you. All you need do is deliver a message.   The gaoler yanked his leather strap free of Tyrion’s grasp.  Message,  he said, as if he had never heard the word before. His frown made deep creases in his brow.   You heard me, my lord. Only carry my word to your lady."
}