{
  "id": "b3a4cafbd4d60e7aba596747297253429d2f6adc",
  "text": "  He took not the slightest notice of Wormtail, who lay twitching and bleeding on the ground, nor of the great snake, which had slithered back into sight and was circling Harry again, hissing. Voldemort slipped one of those unnaturally long-fingered hands into a deep pocket and drew out a wand.  He caressed it gently too; and then he raised it, and pointed it at Wormtail, who was lifted off the ground and thrown against the headstone where Harry was tied; he fell to the foot of it and lay there, crumpled up and crying.  Voldemort turned his scarlet eyes upon Harry, laughing a high, cold, mirthless laugh. Wormtail's robes were shining with blood now; he had wrapped the stump of his arm in them. \"My Lord . . .\" he choked, \"my Lord . . . you promised . . . you did promise ...\" \"Hold out your arm,\" said Voldemort lazily. \"Oh Master . . . thank you, Master ...\" He extended the bleeding stump, but Voldemort laughed again. \"The other arm, Wormtail.\" \"Master, please . . .please ...\" Voldemort bent down and pulled out Wormtail's left arm; he forced the sleeve of Wormtail's robes up past his elbow, and Harry saw something upon the skin there, something like a vivid red tattoo - a skull with a snake protruding from its mouth - the image that had appeared in the sky at the Quidditch World Cup: the Dark Mark. Voldemort examined it carefully, ignoring Wormtail's uncontrollable weeping. \"It is back,\" he said softly, \"they will all have noticed it... and now, we shall see ... now we shall know ...\" He pressed his long white forefinger to the brand on Wormtail's arm. The scar on Harry s forehead seared with a sharp pain again, and Wormtail let out a fresh howl; Voldemort removed his fingers from Wormtail's mark, and Harry saw that it had turned jet black. A look of cruel satisfaction on his face, Voldemort straightened up, threw back his head, and stared around at the dark graveyard. \"How many will be brave enough to return when they feel it?\"  he whispered, his gleaming red eyes fixed upon the stars.  \"And how many will be foolish enough to stay away?\" He began to pace up and down before Harry and Wormtail, eyes sweeping the graveyard all the while.  After a minute or so, he looked down at Harry again, a cruel smile twisting his snakelike face. \"You stand, Harry Potter, upon the remains of my late father,\" he hissed softly.  \"A Muggle and a fool. . . very like your dear mother.  But they both had their uses, did they not? Your mother died to defend you as a child . . . and I killed my father, and see how useful he has proved himself, in death. ...\" Voldemort laughed again.  Up and down he paced, looking all around him as he walked, and the snake continued to circle in the grass. \"You see that house upon the hillside, Potter?  My father lived there.  My mother, a witch who lived here in this village, fell in love with him.  But he abandoned her when she told him what she was. ... He didn't like magic, my father . . . \"He left her and returned to his Muggle parents before I was even born.  Potter, and she died giving birth to me, leaving me to be raised in a Muggle orphanage . . . but I vowed to find him ... I revenged myself upon him, that fool who gave me his name . . . Tom Riddle. . . .\" Still he paced, his red eyes darting from grave to grave. \"Listen to me, reliving family history . . .\" he said quietly, \"why, I am growing quite sentimental. . . . But look, Harry!  My true family returns. . . .\" The air was suddenly full of the swishing of cloaks.  Between graves, behind the yew tree, in every shadowy space, wizards were Apparating.  All of them were hooded and masked.  And one by one they moved forward . . . slowly, cautiously, as though they could hardly believe their eyes Voldemort stood in silence, waiting for them.  Then one of the Death Eaters fell to his knees, crawled toward Voldemort and kissed the hem of his black robes. Master . . . Master   \" he murmured. The Death Eaters behind him did the same; each of them approaching Voldemort on his knees and kissing his robes, before backing away and standing up, forming a silent circle, which enclosed Tom Riddle s grave, Harry, Voldemort, and the sobbing and twitching heap that was Wormtail.  Yet they left gaps in the circle, as though waiting for more people.  Voldemort, however, did not seem to expect more.  He looked around at the hooded faces, and though there was no wind rustling seemed to run around the circle, as though it had shivered. \"Welcome, Death Eaters,\" said Voldemort quietly. \"Thirteen years. . . thirteen years since last we met.  Yet you answer my call as though it were yesterday, we are still united under the Dark Mark, then!  Or are we?\" He put back his terrible face and sniffed, his slit-like nostrils widening. \"I smell guilt,\" he said.  \"There is a stench or guilt upon the air. A second shiver ran around the circle, as though each member of it longed, but did not dare to step back from him. \"I see you all, whole and healthy, with your powers intact - such prompt appearances! and I ask myself ."
}