{
  "id": "b3d77c8610240f436b6e852c9cae3d86fd4f0466",
  "text": " \"Well, if they're any bigger than this lot, even Hagrid won't be able to handle them,\" said Harry.  \"That's if he hasn't been attacked by his skrewts.  Wonder what's up with them?\" \"Maybe they've escaped,\" said Ron hopefully. \"Oh don't say that,\" said Hermione with a shudder. \"Imagine that lot loose on the grounds. . . .\" They stood, shivering slightly now, waiting for the Durmstrang party to arrive. Most people were gazing hopefully up at the sky.  For a few minutes, the silence was broken only by Madame Maxime's huge horses snorting and stamping. But then - \"Can you hear something?\"  said Ron suddenly. Harry listened; a loud and oddly eerie noise was drifting toward them from out of the darkness:  a muffled rumbling and sucking sound, as though an immense vacuum cleaner were moving along a riverbed. \"The lake!\"  yelled Lee Jordan, pointing down at it.  \"Look at the lake!\" From their position at the top of the lawns overlooking the grounds, they had a clear view of the smooth black surface of the water - except that the surface was suddenly not smooth at all. Some disturbance was taking place deep in the center; great bubbles were forming on the surface, waves were now washing over the muddy banks - and then, out in the very middle of the lake, a whirlpool appeared, as if a giant plug had just been pulled out of the lake's floor. . What seemed to be a long, black pole began to rise slowly out of the heart of the whirlpool. . . and then Harry saw the rigging.... \"It's a mast!\"  he said to Ron and Hermione. Slowly, magnificently, the ship rose out of the water, gleaming in the moonlight.  It had a strangely skeletal look about it, as though it were a resurrected wreck, and the dim, misty lights shimmering at its portholes looked like ghostly eyes.  Finally, with a great sloshing noise, the ship emerged entirely, bobbing on the turbulent water, and began to glide toward the bank.  A few moments later, they heard the splash of an anchor being thrown down in the shallows, and the thud of a plank being lowered onto the bank. People were disembarking; they could see their silhouettes passing the lights in the ship's portholes.  All of them, Harry noticed, seemed to be built along the lines of Crabbe and Goyle... but then, as they drew nearer, walking up the lawns into the light streaming from the entrance hall, he saw that their bulk was really due to the fact that they were wearing cloaks of some kind of shaggy, matted fur.  But the man who was leading them up to the castle was wearing furs of a different sort: sleek and silver, like his hair. \"Dumbledore!\" he called heartily as he walked up the slope.  \"How are you, my dear fellow, how are you?\" \"Blooming, thank you, Professor Karkaroff,\" Dumbledore replied.  Karkaroff had a fruity, unctuous voice; when he stepped into the light pouring from the front doors of the castle they saw that he was tall and thin like Dumbledore, but his white hair was short, and his goatee (finishing in a small curl) did not entirely hide his rather weak chin.  When he reached Dumbledore, he shook hands with both of his own. \"Dear old Hogwarts,\" he said, looking up at the castle and smiling; his teeth were rather yellow, and Harry noticed that his smile did not extend to his eyes, which remained cold and shrewd.  \"How good it is to be here, how good.. . . Viktor, come along, into the warmth. . . you don't mind, Dumbledore?  Viktor has a slight head cold...\" Karkaroff beckoned forward one of his students.  As the boy passed, Harry caught a glimpse of a prominent curved nose and thick black eyebrows.  He didn't need the punch on the arm Ron gave him, or the hiss in his ear, to recognize that profile. \"Harry - it's Krum!\"  CHAPTER SIXTEEN - THE GOBLET OF FIRE    I don't believe it!\" Ron said, in a stunned voice, as the Hogwarts students filed back up the steps behind the party from Durmstrang. \"Krum, Harry!  Viktor Krum!\"   \"For heaven's sake, Ron, he's only a Quidditch player,\" said Hermione.   \"Only a Quidditch player?\"  Ron said, looking at her as though he couldn't believe his ears.  \"Hermione - he's one of the best Seekers in the world!  I had no idea he was still at school!\"   As they recrossed the entrance hall with the rest of the Hogwarts students heading for the Great Hall, Harry saw Lee Jordan jumping up and down on the soles of his feet to get a better look at the back of Krum's head.  Several sixth-year girls were frantically searching their pockets as they walked - \"Oh I don't believe it, I haven't got a single quill on me -\" \"D'you think he'd sign my hat in lipstick?\" \"Really,\" Hermione said loftily as they passed the girls, now squabbling over the lipstick. \"I'm getting his autograph if I can,\" said Ron. \"You haven't got a quill, have you, Harry?\" \"Nope, they're upstairs in my bag,\" said Harry. They walked over to the Gryffindor table and sat down. Ron took care to sit on the side facing the doorway, because Krum and his fellow Durmstrang students were still gathered around it, apparently unsure about where they should sit."
}