{
  "id": "b3e9e2ab4effcb5f9441e5901cc32f55f05eb2a9",
  "text": " Harry began to fumble with the knot of rope tying Buckbeak to the fence.  \"... sentenced to execution by beheading, to be carried out by the Committee's appointed executioner, Walden Macnai...\"  \"Come on, Buckbeak,\" Harry murmured, \"come on, we're going to help you. Quietly... quietly...\"  \"... as witnessed below. Hagrid, you sign here...\"  Harry threw all his weight onto the rope, but Buckbeak had dug in his front feet.  \"Well, let's get this over with,\" said the reedy voice of the Committee member from inside Hagrid's cabin. \"Hagrid, perhaps it will be better if you stay inside --\"  \"No, I -- I wan' ter be with him.... I don' wan' him ter be alone --\"  Footsteps echoed from within the cabin.  \"Buckbeak, move!\" Harry hissed.  Harry tugged harder on the rope around Buckbeak's neck. The hippogriff began to walk, rustling its wings irritably. They were still ten feet away from the forest, in plain view of Hagrid's back door. \"One moment, please, Macnair,\" came Dumbledore's voice. \"You need to sign too.\" The footsteps stopped. Harry heaved on the rope. Buckbeak snapped his beak and walked a little faster.  Hermione's white face was sticking out from behind a tree.  \"Harry, hurry!\" she mouthed.  Harry could still hear Dumbledore's voice talking from within the cabin. He gave the rope another wrench. Buckbeak broke into a grudging trot. They had reached the trees....  \"Quick! Quick!\" Hermione moaned, darting out from behind her tree, seizing the rope too and adding her weight to make Buckbeak move faster. Harry looked over his shoulder; they were now blocked from sight; they couldn't see Hagrid's garden at all.  \"Stop!\" he whispered to Hermione. \"They might hear us  Hagrid's back door had opened with a bang. Harry, Hermione, and Buckbeak stood quite still; even the hippogriff seemed to be listening intently.  Silence... then --  \"Where is it?\" said the reedy voice of the Committee member. \"Where is the beast?\"  \"It was tied here!\" said the executioner furiously. I saw it! just here!\"  \"How extraordinary,\" said Dumbledore. There was a note of amusement in his voice.  \"Beaky!\" said Hagrid huskily.  There was a swishing noise, and the thud of an axe. The executioner seemed to have swung it into the fence in anger. And then came the howling, and this time they could hear Hagrid's words through his sobs.  \"Gone! Gone! Bless his little beak, he's gone! Musta pulled himself free! Beaky, yeh clever boy!\"  Buckbeak started to strain against the rope, trying to get back to Hagrid. Harry and Hermione tightened their grip and dug their heels into the forest floor to stop him.  \"Someone untied him!\" the executioner was snarling. \"We should search the grounds, the forest.\"  \"Macnair, if Buckbeak has indeed been stolen, do you really think the thief will have led him away on foot?\" said Dumbledore, still sounding amused. \"Search the skies, if you will.... Hagrid, I could do with a cup of tea. Or a large brandy.\"  \"O' -- o' course, Professor,\" said Hagrid, who sounded weak with happiness. \"Come in, come in....\"  Harry and Hermione listened closely. They heard footsteps, the soft cursing of the executioner, the snap of the door, and then silence once more.  \"Now what?\" whispered Harry, looking around.  \"We'll have to hide in here,\" said Hermione, who looked very shaken. \"We need to wait until they've gone back to the castle. Then we wait until it's safe to fly Buckbeak up to Sirius's window. He won't be there for another couple of hours.... Oh, this is going to be difficult....\"  She looked nervously over her shoulder into the depths of the forest. The sun was setting now.  \"We're going to have to move,\" said Harry, thinking hard. \"We've got to be able to see the Whomping Willow, or we won't know what's going on.\"  \"Okay,\" said Hermione, getting a firmer grip on Buckbeak's rope. \"But we've got to keep out of sight, Harry, remember....\"  They moved around the edge of the forest, darkness falling thickly around them, until they were hidden behind a clump of trees through which they could make out the Willow.  \"There's Ron!\" said Harry suddenly.  A dark figure was sprinting across the lawn and its shout echoed through the still night air.  \"Get away from him -- get away -- Scabbers, come here --\"  And then they saw two more figures materialize out of nowhere. Harry watched himself and Hermione chasing after Ron. Then he saw Ron dive.  \"Gotcha! Get off, you stinking cat --\"  \"There's Sirius!\" said Harry. The great shape of the dog had bounded out from the roots of the Willow. They saw him bowl Harry over, then seize Ron....  \"Looks even worse from here, doesn't it?\" said Harry, watching the dog pulling Ron into the roots. \"Ouch -- look, I just got walloped by the tree -- and so did you -- this is weird--\"  The Whomping Willow was creaking and lashing out with its lower branches; they could see themselves darting here and there, trying to reach the trunk. And then the tree froze.  \"That was Crookshanks pressing the knot,\" said Hermione."
}