{
  "id": "b434402e46a2cf1ce8dac54d9ed0f33e0f66b6b7",
  "text": " You must have these great lords to win your throne—    Fingers and all, it seems.  Stannis smiled grimly.  Unthinking, Davos raised his maimed hand to the pouch at his throat, and felt the fingerbones within. Luck.  The king saw the motion.  Are they still there, Onion Knight? You have not lost them?    No.    Why do you keep them? I have often wondered.    They remind me of what I was. Where I came from. They remind me of your justice, my liege.    It was justice,  Stannis said.  A good act does not wash out the bad, nor a bad act the good. Each should have its own reward. You were a hero and a smuggler.  He glanced behind at Lord Florent and the others, rainbow knights and turncloaks, who were following at a distance.  These pardoned lords would do well to reflect on that. Good men and true will fight for Joffrey, wrongly believing him the true king. A northman might even say the same of Robb Stark. But these lords who flocked to my brother’s banners knew him for a usurper. They turned their backs on their rightful king for no better reason than dreams of power and glory, and I have marked them for what they are. Pardoned them, yes. Forgiven. But not forgotten.  He fell silent for a moment, brooding on his plans for justice. And then, abruptly, he said,  What do the smallfolk say of Renly’s death?    They grieve. Your brother was well loved.    Fools love a fool,  grumbled Stannis,  but I grieve for him as well. For the boy he was, not the man he grew to be.  He was silent for a time, and then he said,  How did the commons take the news of Cersei’s incest?    While we were among them they shouted for King Stannis. I cannot speak for what they said once we had sailed.    So you do not think they believed?    When I was smuggling, I learned that some men believe everything and some nothing. We met both sorts. And there is another tale being spread as well—    Yes.  Stannis bit off the word.  Selyse has given me horns, and tied a fool’s bells to the end of each. My daughter fathered by a halfwit jester! A tale as vile as it is absurd. Renly threw it in my teeth when we met to parley. You would need to be as mad as Patchface to believe such a thing.    That may be so, my liege… but whether they believe the story or no, they delight to tell it.  In many places it had come before them, poisoning the well for their own true tale.   Robert could piss in a cup and men would call it wine, but I offer them pure cold water and they squint in suspicion and mutter to each other about how queer it tastes.  Stannis ground his teeth.  If someone said I had magicked myself into a boar to kill Robert, likely they would believe that as well.    You cannot stop them talking, my liege,  Davos said,  but when you take your vengeance on your brothers’ true killers, the realm will know such tales for lies.   Stannis only seemed to half hear him.  I have no doubt that Cersei had a hand in Robert’s death. I will have justice for him. Aye, and for Ned Stark and Jon Arryn as well.    And for Renly?  The words were out before Davos could stop to consider them.  For a long time the king did not speak. Then, very softly, he said,  I dream of it sometimes. Of Renly’s dying. A green tent, candles, a woman screaming. And blood.  Stannis looked down at his hands.  I was still abed when he died. Your Devan will tell you. He tried to wake me. Dawn was nigh and my lords were waiting, fretting. I should have been ahorse, armored. I knew Renly would attack at break of day. Devan says I thrashed and cried out, but what does it matter? It was a dream. I was in my tent when Renly died, and when I woke my hands were clean.   Ser Davos Seaworth could feel his phantom fingertips start to itch. Something is wrong here, the onetime smuggler thought. Yet he nodded and said,  I see.    Renly offered me a peach. At our parley. Mocked me, defied me, threatened me, and offered me a peach. I thought he was drawing a blade and went for mine own. Was that his purpose, to make me show fear? Or was it one of his pointless jests? When he spoke of how sweet the peach was, did his words have some hidden meaning?  The king gave a shake of his head, like a dog shaking a rabbit to snap its neck.  Only Renly could vex me so with a piece of fruit. He brought his doom on himself with his treason, but I did love him, Davos. I know that now. I swear, I will go to my grave thinking of my brother’s peach.   By then they were in amongst the camp, riding past the ordered rows of tents, the blowing banners, and the stacks of shields and spears. The stink of horse dung was heavy in the air, mingled with the woodsmoke and the smell of cooking meat. Stannis reined up long enough to bark a brusque dismissal to Lord Florent and the others, commanding them to attend him in his pavilion one hour hence for a council of war. They bowed their heads and dispersed, while Davos and Melisandre rode to the king’s pavilion.  The tent had to be large, since it was there his lords bannermen came to council."
}