{
  "id": "b44c11af0df33d206ac427b36339136e62252d2f",
  "text": "  There were cookfires all along the river, amongst wayns and carts and sleds. Many of the wildlings had thrown up tents, of hide and skin and felted wool. Others sheltered behind rocks in crude lean-tos, or slept beneath their wagons. At one fire Jon saw a man hardening the points of long wooden spears and tossing them in a pile. Elsewhere two bearded youths in boiled leather were sparring with staffs, leaping at each other over the flames, grunting each time one landed a blow. A dozen women sat nearby in a circle, fletching arrows.  Arrows for my brothers, Jon thought. Arrows for my father’s folk, for the people of Winterfell and Deepwood Motte and the Last Hearth. Arrows for the north.  But not all he saw was warlike. He saw women dancing as well, and heard a baby crying, and a little boy ran in front of his garron, all bundled up in fur and breathless from play. Sheep and goats wandered freely, while oxen plodded along the riverbank in search of grass. The smell of roast mutton drifted from one cookflre, and at another he saw a boar turning on a wooden spit.  In an open space surrounded by tall green soldier pines, Rattleshirt dismounted.  We’ll make camp here,  he told Lenyl and Ragwyle and the others.  Feed the horses, then the dogs, then yourself. Ygritte, Longspear, bring the crow so Mance can have his look. We’ll gut him after.   They walked the rest of the way, past more cookflres and more tents, with Ghost following at their heels. Jon had never seen so many wildlings. He wondered if anyone ever had. The camp goes on forever, he reflected, but it’s more a hundred camps than one, and each more vulnerable than the last. Stretched out over long leagues, the wildlings had no defenses to speak of, no pits nor sharpened stakes, only small groups of outriders patrolling their perimeters. Each group or clan or village had simply stopped where they wanted, as soon as they saw others stopping or found a likely spot. The free folk. If his brothers were to catch them in such disarray, many of them would pay for that freedom with their life’s blood. They had numbers, but the Night’s Watch had discipline, and in battle discipline beats numbers nine times of every ten, his father had once told him.  There was no doubting which tent was the king’s. It was thrice the size of the next largest he’d seen, and he could hear music drifting from within. Like many of the lesser tents it was made of sewn hides with the fur still on, but Mance Rayder’s hides were the shaggy white pelts of snow bears. The peaked roof was crowned with a huge set of antlers from one of the giant elks that had once roamed freely throughout the Seven Kingdoms, in the times of the First Men.  Here at least they found defenders; two guards at the flap of the tent, leaning on tall spears with round leather shields strapped to their arms. When they caught sight of Ghost, one of them lowered his spearpoint and said,  That beast stays here.    Ghost, stay,  Jon commanded. The direwolf sat.   Longspear, watch the beast.  Rattleshirt yanked open the tent and gestured Jon and Ygritte inside.  The tent was hot and smoky. Baskets of burning peat stood in all four corners, filling the air with a dim reddish light. More skins carpeted the ground. Jon felt utterly alone as he stood there in his blacks, awaiting the pleasure of the turncloak who called himself King-beyond-the-Wall. When his eyes had adjusted to the smoky red gloom, he saw six people, none of whom paid him any mind. A dark young man and a pretty blonde woman were sharing a horn of mead. A pregnant woman stood over a brazier cooking a brace of hens, while a grey-haired man in a tattered cloak of black and red sat crosslegged on a pillow, playing a lute and singing:      The Dornishman’s wife was as fair as the sun,  and her kisses were warmer than spring.  But the Dornishman’s blade was made of black steel,  and its kiss was a terrible thing.      Jon knew the song, though it was strange to hear it here, in a shaggy hide tent beyond the Wall, ten thousand leagues from the red mountains and warm winds of Dorne.  Rattleshirt took off his yellowed helm as he waited for the song to end. Beneath his bone-and-leather armor he was a small man, and the face under the giant’s skull was ordinary, with a knobby chin, thin mustache, and sallow, pinched cheeks. His eyes were close-set, one eyebrow creeping all the way across his forehead, dark hair thinning back from a sharp widow’s peak.      The Dornishman’s wife would sing as she bathed,  in a voice that was sweet as a peach,  But the Dornishman’s blade had a song of its own,  and a bite sharp and cold as a leech.      Beside the brazier, a short but immensely broad man sat on a stool, eating a hen off a skewer. Hot grease was running down his chin and into his snow-white beard, but he smiled happily all the same. Thick gold bands graven with runes bound his massive arms, and he wore a heavy shirt of black ringmail that could only have come from a dead ranger."
}