{
  "id": "b46ff3e98bfd344a01a8a2dff38ce5990dcca150",
  "text": "    Your own ends. What ends are those, Lord Varys?    Peace,  Varys replied without hesitation.  If there was one soul in King’s Landing who was truly desperate to keep Robert Baratheon alive, it was me.  He sighed.  For fifteen years I protected him from his enemies, but I could not protect him from his friends. What strange fit of madness led you to tell the queen that you had learned the truth of Joffrey’s birth?    The madness of mercy,  Ned admitted.   Ah,  said Varys.  To be sure. You are an honest and honorable man, Lord Eddard. Ofttimes I forget that. I have met so few of them in my life.  He glanced around the cell.  When I see what honesty and honor have won you, I understand why.   Ned Stark laid his head back against the damp stone wall and closed his eyes. His leg was throbbing.  The king’s wine… did you question Lancel?    Oh, indeed. Cersei gave him the wineskins, and told him it was Robert’s favorite vintage.  The eunuch shrugged.  A hunter lives a perilous life. If the boar had not done for Robert, it would have been a fall from a horse, the bite of a wood adder, an arrow gone astray… the forest is the abbatoir of the gods. It was not wine that killed the king. It was your mercy.   Ned had feared as much.  Gods forgive me.    If there are gods,  Varys said,  I expect they will. The queen would not have waited long in any case. Robert was becoming unruly, and she needed to be rid of him to free her hands to deal with his brothers. They are quite a pair, Stannis and Renly. The iron gauntlet and the silk glove.  He wiped his mouth with the back of his hand.  You have been foolish, my lord. You ought to have heeded Littlefinger when he urged you to support Joffrey’s succession.    How… how could you know of that?   Varys smiled.  I know, that’s all that need concern you. I also know that on the morrow the queen will pay you a visit.   Slowly Ned raised his eyes.  Why?    Cersei is frightened of you, my lord… but she has other enemies she fears even more. Her beloved Jaime is fighting the river lords even now. Lysa Arryn sits in the Eyrie, ringed in stone and steel, and there is no love lost between her and the queen. In Dorne, the Martells still brood on the murder of Princess Elia and her babes. And now your son marches down the Neck with a northern host at his back.    Robb is only a boy,  Ned said, aghast.   A boy with an army,  Varys said.  Yet only a boy, as you say. The king’s brothers are the ones giving Cersei sleepless nights… Lord Stannis in particular. His claim is the true one, he is known for his prowess as a battle commander, and he is utterly without mercy. There is no creature on earth half so terrifying as a truly just man. No one knows what Stannis has been doing on Dragonstone, but I will wager you that he’s gathered more swords than seashells. So here is Cersei’s nightmare: while her father and brother spend their power battling Starks and Tullys, Lord Stannis will land, proclaim himself king, and lop off her son’s curly blond head… and her own in the bargain, though I truly believe she cares more about the boy.    Stannis Baratheon is Robert’s true heir,  Ned said.  The throne is his by rights. I would welcome his ascent.   Varys tsked.  Cersei will not want to hear that, I promise you. Stannis may win the throne, but only your rotting head will remain to cheer unless you guard that tongue of yours. Sansa begged so sweetly, it would be a shame if you threw it all away. You are being given your life back, if you’ll take it. Cersei is no fool. She knows a tame wolf is of more use than a dead one.    You want me to serve the woman who murdered my king, butchered my men, and crippled my son?  Ned’s voice was thick with disbelief.   I want you to serve the realm,  Varys said.  Tell the queen that you will confess your vile treason, command your son to lay down his sword, and proclaim Joffrey as the true heir. Offer to denounce Stannis and Renly as faithless usurpers. Our green-eyed lioness knows you are a man of honor. If you will give her the peace she needs and the time to deal with Stannis, and pledge to carry her secret to your grave, I believe she will allow you to take the black and live out the rest of your days on the Wall, with your brother and that baseborn son of yours.   The thought of Jon filled Ned with a sense of shame, and a sorrow too deep for words. If only he could see the boy again, sit and talk with him… pain shot through his broken leg, beneath the filthy grey plaster of his cast. He winced, his fingers opening and closing helplessly.  Is this your own scheme,  he gasped out at Varys,  or are you in league with Littlefinger?   That seemed to amuse the eunuch.  I would sooner wed the Black Goat of Qohor. Littlefinger is the second most devious man in the Seven Kingdoms. Oh, I feed him choice whispers, sufficient so that he thinks I am his… just as I allow Cersei to believe I am hers.    And just as you let me believe that you were mine. Tell me, Lord Varys, who do you truly serve?   Varys smiled thinly."
}