{
  "id": "b5008c3b9c4bb06127dcf9a28c346916948dd8cd",
  "text": " From time to time a wildling arrow came flying back in answer. He sent men to the smaller catapults and filled the air with jagged rocks the size of a giant’s fist, but the darkness swallowed them as a man might swallow a handful of nuts. Mammoths trumpeted in the gloom, strange voices called out in stranger tongues, and Septon Cellador prayed so loudly and drunkenly for the dawn to come that Jon was tempted to chuck him over the edge himself. They heard a mammoth dying at their feet and saw another lurch burning through the woods, trampling down men and trees alike. The wind blew cold and colder. Hobb rode up the chain with cups of onion broth, and Owen and Clydas served them to the archers where they stood, so they could gulp them down between arrows. Zei took a place among them with her crossbow. Hours of repeated jars and shocks knocked something loose on the right-hand trebuchet, and its counterweight came crashing free, suddenly and catastrophically, wrenching the throwing arm sideways with a splintering crash. The left-hand trebuchet kept throwing, but the wildlings had quickly learned to shun the place where its loads were landing.  We should have twenty trebuchets, not two, and they should be mounted on sledges and turntables so we could move them. It was a futile thought. He might as well wish for another thousand men, and maybe a dragon or three.  Donal Noye did not return, nor any of them who’d gone down with him to hold that black cold tunnel. The Wall is mine, Jon reminded himself whenever he felt his strength flagging. He had taken up a longbow himself, and his fingers felt crabbed and stiff, half-frozen. His fever was back as well, and his leg would tremble uncontrollably, sending a white-hot knife of pain right through him. One more arrow, and I’ll rest, he told himself, half a hundred times. Just one more. Whenever his quiver was empty, one of the orphaned moles would bring him another. One more quiver, and I’m done. It couldn’t be long until the dawn.  When morning came, none of them quite realized it at first. The world was still dark, but the black had turned to grey and shapes were beginning to emerge half-seen from the gloom. Jon lowered his bow to stare at the mass of heavy clouds that covered the eastern sky. He could see a glow behind them, but perhaps he was only dreaming. He notched another arrow.  Then the rising sun broke through to send pale lances of light across the battleground. Jon found himself holding his breath as he looked out over the half-mile swath of cleared land that lay between the Wall and the edge of the forest. In half a night they had turned it into a wasteland of blackened grass, bubbling pitch, shattered stone, and corpses. The carcass of the burned mammoth was already drawing crows. There were giants dead on the ground as well, but behind them…  Someone moaned to his left, and he heard Septon Cellador say,  Mother have mercy, oh. Oh, oh, oh, Mother have mercy.   Beneath the trees were all the wildlings in the world; raiders and giants, wargs and skinchangers, mountain men, salt sea sailors, ice river cannibals, cave dwellers with dyed faces, dog chariots from the Frozen Shore, Hornfoot men with their soles like boiled leather, all the queer wild folk Mance had gathered to break the Wall. This is not your land, Jon wanted to shout at them. There is no place for you here. Go away. He could hear Tormund Giantsbane laughing at that.  You know nothing, Jon Snow,  Ygritte would have said. He flexed his sword hand, opening and closing the fingers, though he knew full well that swords would not come into it up here.  He was chilled and feverish, and suddenly the weight of the longbow was too much. The battle with the Magnar had been nothing, he realized, and the night fight less than nothing, only a probe, a dagger in the dark to try and catch them unprepared. The real battle was only now beginning.   I never knew there would be so many,  Satin said.  Jon had. He had seen them before, but not like this, not drawn up in battle array. On the march the wildling column had sprawled over long leagues like some enormous worm, but you never saw all of it at once. But now…   Here they come,  someone said in a hoarse voice.  Mammoths centered the wildling line, he saw, a hundred or more with giants on their backs clutching mauls and huge stone axes. More giants loped beside them, pushing along a tree trunk on great wooden wheels, its end sharpened to a point. A ram, he thought bleakly. If the gate still stood below, a few kisses from that thing would soon turn it into splinters. On either side of the giants came a wave of horsemen in boiled leather harness with fire-hardened lances, a mass of running archers, hundreds of foot with spears, slings, clubs, and leathern shields. The bone chariots from the Frozen Shore clattered forward on the flanks, bouncing over rocks and roots behind teams of huge white dogs. The fury of the wild, Jon thought as he listened to the skirl of skins, to the dogs barking and baying, the mammoths trumpeting, the free folk whistling and screaming, the giants roaring in the Old Tongue."
}