{
  "id": "b502d904e59539663de3941de163ad9229136fc7",
  "text": " He liked that.  Shall I take my gown off, m’lord?  she asked.   In good time. Are you a maiden, Shae?    If it please you, m’lord,  she said demurely.   What would please me would be the truth of you, girl.    Aye, but that will cost you double.   Tyrion decided they would get along splendidly.  I am a Lannister. Gold I have in plenty, and you’ll find me generous… but I’ll want more from you than what you’ve got between your legs, though I’ll want that too. You’ll share my tent, pour my wine, laugh at my jests, rub the ache from my legs after each day’s ride… and whether I keep you a day or a year, for so long as we are together you will take no other men into your bed.    Fair enough.  She reached down to the hem of her thin roughspun gown and pulled it up over her head in one smooth motion, tossing it aside. There was nothing underneath but Shae.  If he don’t put down that candle, m’lord will burn his fingers.   Tyrion put down the candle, took her hand in his, and pulled her gently to him. She bent to kiss him. Her mouth tasted of honey and cloves, and her fingers were deft and practiced as they found the fastenings of his clothes.  When he entered her, she welcomed him with whispered endearments and small, shuddering gasps of pleasure. Tyrion suspected her delight was feigned, but she did it so well that it did not matter. That much truth he did not crave.  He had needed her, Tyrion realized afterward, as she lay quietly in his arms. Her or someone like her. It had been nigh on a year since he’d lain with a woman, since before he had set out for Winterfell in company with his brother and King Robert. He could well die on the morrow or the day after, and if he did, he would sooner go to his grave thinking of Shae than of his lord father, Lysa Arryn, or the Lady Catelyn Stark.  He could feel the softness of her breasts pressed against his arm as she lay beside him. That was a good feeling. A song filled his head. Softly, quietly, he began to whistle.   What’s that, m’lord?  Shae murmured against him.   Nothing,  he told her.  A song I learned as a boy, that’s all. Go to sleep, sweetling.   When her eyes were closed and her breathing deep and steady, Tyrion slid out from beneath her, gently, so as not to disturb her sleep. Naked, he crawled outside, stepped over his squire, and walked around behind his tent to make water.  Bronn was seated cross-legged under a chestnut tree, near where they’d tied the horses. He was honing the edge of his sword, wide awake; the sellsword did not seem to sleep like other men.  Where did you find her?  Tyrion asked him as he pissed.   I took her from a knight. The man was loath to give her up, but your name changed his thinking somewhat… that, and my dirk at his throat.    Splendid,  Tyrion said dryly, shaking off the last drops.  I seem to recall saying find me a whore, not make me an enemy.    The pretty ones were all claimed,  Bronn said.  I’ll be pleased to take her back if you’d prefer a toothless drab.   Tyrion limped closer to where he sat.  My lord father would call that insolence, and send you to the mines for impertinence.    Good for me you’re not your father,  Bronn replied.  I saw one with boils all over her nose. Would you like her?    What, and break your heart?  Tyrion shot back.  I shall keep Shae. Did you perchance note the name of this knight you took her from? I’d rather not have him beside me in the battle.   Bronn rose, cat-quick and cat-graceful, turning his sword in his hand.  You’ll have me beside you in the battle, dwarf.   Tyrion nodded. The night air was warm on his bare skin.  See that I survive this battle, and you can name your reward.   Bronn tossed the longsword from his right hand to his left, and tried a cut.  Who’d want to kill the likes of you?    My lord father, for one. He’s put me in the van.    I’d do the same. A small man with a big shield. You’ll give the archers fits.    I find you oddly cheering,  Tyrion said.  I must be mad.   Bronn sheathed his sword.  Beyond a doubt.   When Tyrion returned to his tent, Shae rolled onto her elbow and murmured sleepily,  I woke and m’lord was gone.    M’lord is back now.  He slid in beside her.  Her hand went between his stunted legs, and found him hard.  Yes he is,  she whispered, stroking him.  He asked her about the man Bronn had taken her from, and she named the minor retainer of an insignificant lordling.  You need not fear his like, m’lord,  the girl said, her fingers busy at his cock.  He is a small man.    And what am I, pray?  Tyrion asked her.  A giant?    Oh, yes,  she purred,  my giant of Lannister.  She mounted him then, and for a time, she almost made him believe it. Tyrion went to sleep smiling…  … and woke in darkness to the blare of trumpets. Shae was shaking him by the shoulder.  M’lord,  she whispered.  Wake up, m’lord. I’m frightened.   Groggy, he sat up and threw back the blanket. The horns called through the night, wild and urgent, a cry that said hurry hurry hurry. He heard shouts, the clatter of spears, the whicker of horses, though nothing yet that spoke to him of fighting."
}