{
  "id": "b502fbf2051bd7a40b0b3437825f155670514612",
  "text": "  Panting, Harry pushed himself away from it and ran, hard, in the opposite direction - the Impediment Curse was not permanent; the skrewt would be regaining the use of its legs at any moment. He took a left path and hit a dead end, a right, and hit another; forcing himself to stop, heart hammering, he performed the Four-Point Spell again, backtracked, and chose a path that would take him northwest. He had been hurrying along the new path for a few minutes, when he heard something in the path running parallel to his own that made him stop dead. \"What are you doing?\" yelled Cedric's voice.  \"What the hell d'you think you're doing?\" And then Harry heard Krum's voice. \"Crucio!\" The air was suddenly full of Cedric's yells.  Horrified, Harry began sprinting up his path, trying to find a way into Cedric's.  When none appeared, he tried the Reductor Curse again.  It wasn't very effective, but it burned a small hole in the hedge through which Harry forced his leg, kicking at the thick brambles and branches until they broke and made an opening; he struggled through it, tearing his robes, and looking to his right, saw Cedric jerking and twitching on the ground, Krum standing over him. Harry pulled himself up and pointed his wand at Krum just as Krum looked up.  Krum turned and began to run. \"Stupefy!\"  Harry yelled. The spell hit Krum in the back; he stopped dead in his tracks, fell forward, and lay motionless, facedown in the grass.  Harry-dashed over to Cedric, who had stopped twitching and was lying there panting, his hands over his face. \"Are you all right?\"  Harry said roughly, grabbing Cedric's arm. \"Yeah,\" panted Cedric. \"Yeah ... I don't believe it... he crept up behind me. ... I heard him, I turned around, and he had his wand on me. . . .\" Cedric got up. He was still shaking.  He and Harry looked down at Krum. \"I can't believe this ... I thought he was all right,\" Harry said, staring at Krum. \"So did I,\" said Cedric. \"Did you hear Fleur scream earlier?\"  said Harry. \"Yeah,\" said Cedric. \"You don't think Krum got her too?\" \"I don't know,\" said Harry slowly. \"Should we leave him here?\" Cedric muttered. \"No,\" said Harry.  \"I reckon we should send up red sparks.  Someone'll come and collect him . . . otherwise he'll probably be eaten by a skrewt.\" \"He'd deserve it,\" Cedric muttered, but all the same, he raised his wand and shot a shower of red sparks into the air, which hovered high above Krum, marking the spot where he lay. Harry and Cedric stood there in the darkness for a moment, looking around them.  Then Cedric said, \"Well... I s'pose we'd better go on. . . .\" \"What?\" said Harry. \"Oh . . . yeah . . . right. . .\" It was an odd moment. He and Cedric had been briefly united against Krum - now the fact that they were opponents came back to Harry.  The two of them proceeded up the dark path without speaking, then Harry turned left, and Cedric right.  Cedric's footsteps soon died away. Harry moved on, continuing to use the Four-Point Spell, making sure he was moving in the right direction.  It was between him and Cedric now.  His desire to reach the cup first was now burning stronger than ever, but he could hardly believe what he'd just seen Krum do.  The use of an Unforgivable Curse on a fellow human being meant a life term in Azkaban, that was what Moody had told them. Krum surely couldn't have wanted the Triwizard Cup that badly....Harry sped up. Every so often he hit more dead ends, but the increasing darkness made him feel sure he was getting near the heart of the maze.  Then, as he strode down a long, straight path, he saw movement once again, and his beam of wandlight hit an extraordinary creature, one which he had only seen in picture form, in his Monster Book of Monsters. It was a sphinx.  It had the body of an over-large lion: great clawed paws and a long yellowish tail ending in a brown tuft.  Its head, however, was that of a woman.  She turned her long, almond-shaped eyes upon Harry as he approached.  He raised his wand, hesitating.  She was not crouching as if to spring, but pacing from side to side of the path, blocking his progress. Then she spoke, in a deep, hoarse voice. \"You are very near your goal.  The quickest way is past me.\" \"So ... so will you move, please?\"  said Harry, knowing what the answer was going to be. \"No,\" she said, continuing to pace.  \"Not unless you can answer my riddle.  Answer on your first guess - I let you pass.  Answer wrongly - I attack.  Remain silent - I will let you walk away from me unscathed.\" Harry's stomach slipped several notches.  It was Hermione who was good at this sort of thing, not him.  He weighed his chances.  If the riddle was too hard, he could keep silent, get away from the sphinx unharmed, and try and find an alternative route to the center. \"Okay,\" he said. \"Can I hear the riddle?\" The sphinx sat down upon her hind legs, in the very middle of the path, and recited:  \"First think of the person who lives in disguise, Who deals in secrets and tells naught but lies."
}