{
  "id": "b57e18b64c56acfd488f33efbe15ff21b5d76778",
  "text": "\" \"And how do we do all this?\" Harry asked. \"We start by recruiting members,\" said Hermione happily. \"I thought two Sickles to join - that buys a badge - and the proceeds can fund our leaflet campaign.  You're treasurer, Ron - I've got you a collecting tin upstairs - and Harry, you're secretary, so you might want to write down everything I'm saying now, as a record of our first meeting.\" There was a pause in which Hermione beamed at the pair of them, and Harry sat, torn between exasperation at Hermione and amusement at the look on Ron's face.  The silence was broken, not by Ron, who in any case looked as though he was temporarily dumbstruck, but by a soft tap, tap on the window.  Harry looked across the now empty common room and saw, illuminated by the moonlight, a snowy owl perched on the windowsill. \"Hedwig!\"  he shouted, and he launched himself out of his chair and across the room to pull open the window. Hedwig flew inside, soared across the room, and landed on the table on top of Harry's predictions. \"About time!\" said Harry, hurrying after her. \"She's got an answer!\" said Ron excitedly, pointing at the grubby piece of parchment tied to Hedwig's leg. Harry hastily untied it and sat down to read, whereupon Hedwig fluttered onto his knee, hooting softly. \"What does it say?\" Hermione asked breathlessly. The letter was very short, and looked as though it had been scrawled in a great hurry. Harry read it aloud:  Harry -  I'm flying north immediately. This news about your scar is the latest in a series of strange rumors that have reached me here. If it hurts again, go straight to Dumbledore - they're saying he's got Mad-Eye out of retirement, which means he's reading the signs, even if no one else is. I'll be in touch soon. My best to Ron and Hermione. Keep your eyes open, Harry. Sirius  Harry looked up at Ron and Hermione, who stared back at him.  \"He's flying north?\"  Hermione whispered. \"He's coming back?\"  \"Dumbledore's reading what signs?\" said Ron, looking perplexed.  \"Harry - what's up?\" For Harry had just hit himself in the forehead with his fist, jolting Hedwig out of his lap. \"I shouldn't've told him!\" Harry said furiously. \"What are you on about?\" said Ron in surprise. \"It's made him think he's got to come back!\" said Harry, now slamming his fist on the table so that Hedwig landed on the back of Ron's chair, hooting indignantly.  \"Coming back, because he thinks I'm in trouble!  And there's nothing wrong with me!  And I haven't got anything for you,\" Harry snapped at Hedwig, who was clicking her beak expectantly, \"you'll have to go up to the Owlery if you want food.\"  Hedwig gave him an extremely offended look and took off for the open window, cuffing him around the head with her outstretched wing as she went. \"Harry,\" Hermione began, in a pacifying sort of voice. \"I'm going to bed,\" said Harry shortly.  \"See you in the morning.\" Upstairs in the dormitory he pulled on his pajamas and got into his four-poster, but he didn't feel remotely tired. If Sirius came back and got caught, it would be his, Harry's, fault.  Why hadn't he kept his mouth shut?  A few seconds' pain and he'd had to blab. . . . If he'd just had the sense to keep it to himself. He heard Ron come up into the dormitory a short while later, but did not speak to him. For a long time, Harry lay staring up at the dark canopy of his bed.  The dormitory was completely silent, and, had he been less preoccupied, Harry would have realized that the absence of Neville's usual snores meant that he was not the only one lying awake.  CHAPTER FIFTEEN - BEAUXBATONS AND DURMSTRANG    Early next morning, Harry woke with a plan fully formed in his mind, as though his sleeping brain had been working on it all night.  He got up, dressed in the pale dawn light, left the dormitory without waking Ron, and went back down to the deserted common room.  Here he took a piece of parchment from the table upon which his Divination homework still lay and wrote the following letter:  Dear Sirius, I reckon I just imagined my scar hurting, I was half asleep when I wrote to you last time.  There's no point coming back, everything's fine here.  Don't worry about me, my head feels completely normal.  Harry  He then climbed out of the portrait hole, up through the silent castle (held up only briefly by Peeves, who tried to overturn a large vase on him halfway along the fourth-floor corridor), finally arriving at the Owlery, which was situated at the top of West Tower. The Owlery was a circular stone room, rather cold and drafty, because none of the windows had glass in them.  The floor was entirely covered in straw, owl droppings, and the regurgitated skeletons of mice and voles.  Hundreds upon hundreds of owls of every breed imaginable were nestled here on perches that rose right up to the top of the tower, nearly all of them asleep, though here and there a round amber eye glared at Harry.  He spotted Hedwig nestled between a barn owl and a tawny, and hurried over to her, sliding a little on the dropping-strewn floor."
}