{
  "id": "b59a983e76f80eca99874b911694b8a74f196a44",
  "text": "  She looked very nervous, speaking up in front of all these Ministry wizards, yet determined all the same.  \"Winky's got a squeaky little voice, and the voice we heard doing the incantation was much deeper!\"  She looked around at Harry and Ron, appealing for their support.  \"It didn't sound anything like Winky, did it?\" \"No,\" said Harry, shaking his head. \"It definitely didn't sound like an elf.\" \"Yeah, it was a human voice,\" said Ron. \"Well, we'll soon see,\" growled Mr. Diggory, looking unimpressed. \"There's a simple way of discovering the last spell a wand performed, elf, did you know that?\" Winky trembled and shook her head frantically, her ears flapping, as Mr. Diggory raised his own wand again and placed it tip to tip with Harry's. \"Prior Incantato!\" roared Mr. Diggory. Harry heard Hermione gasp, horrified, as a gigantic serpent-tongued skull erupted from the point where the two wands met, but it was a mere shadow of the green skull high above them; it looked as though it were made of thick gray smoke: the ghost of a spell. \"Deletrius!\" Mr. Diggory shouted, and the smoky skull vanished in a wisp of smoke. \"So,\" said Mr. Diggory with a kind of savage triumph, looking down upon Winky, who was still shaking convulsively. \"I is not doing it!\"  she squealed, her eyes rolling in terror.  \"I is not, I is not, I is not knowing how!  I is a good elf, I isn't using wands, I isn't knowing how!\" \"You've been caught red-handed, elf!\" Mr. Diggory roared. \"Caught with the guilty wand in your hand!\" \"Amos,\" said Mr. Weasley loudly, \"think about it. . . precious few wizards know how to do that spell. . . . Where would she have learned it?\" \"Perhaps Amos is suggesting,\" said Mr. Crouch, cold anger in every syllable, \"that I routinely teach my servants to conjure the Dark Mark?\" There was a deeply unpleasant silence.  Amos Diggory looked horrified.  \"Mr. Crouch.. . not. . . not at all. \"You have now come very close to accusing the two people in this clearing who are least likely to conjure that Mark!\"  barked Mr. Crouch.  \"Harry Potter - and myself.  I suppose you are familiar with the boy's story, Amos?\" \"Of course - everyone knows -\" muttered Mr. Diggory, looking highly discomforted. \"And I trust you remember the many proofs I have given, over a long career, that I despise and detest the Dark Arts and those who practice them?\"  Mr. Crouch shouted, his eyes bulging again. \"Mr. Crouch, I - I never suggested you had anything to do with it!\"  Amos Diggory muttered again, now reddening behind his scrubby brown beard.  \"If you accuse my elf, you accuse me, Diggory!\" shouted Mr. Crouch.  \"Where else would she have learned to conjure it?\" \"She - she might've picked it up anywhere -\" \"Precisely, Amos,\" said Mr. Weasley. \"She might have picked it up anywhere.. . . Winky?\"  he said kindly, turning to the elf, but she flinched as though he too was shouting at her. \"Where exactly did you find Harry's wand?\" Winky was twisting the hem of her tea towel so violently that it was fraying beneath her fingers. \"I - I is finding it. . . finding it there, sir. . . .\" she whispered, \"there . . . in the trees, sir. \"You see, Amos?\" said Mr. Weasley. \"Whoever conjured the Mark could have Disapparated right after they'd done it, leaving Harry's wand behind.  A clever thing to do, not using their own wand, which could have betrayed them.  And Winky here had the misfortune to come across the wand moments later and pick it up.\" \"But then, she'd have been only a few feet away from the real culprit!\" said Mr. Diggory impatiently.  \"Elf? Did you see anyone?\" Winky began to tremble worse than ever. Her giant eyes flickered from Mr. Diggory, to Ludo Bagman, and onto Mr. Crouch.  Then she gulped and said, \"I is seeing no one, sir. . . no one. . \"Amos,\" said Mr. Crouch curtly, \"I am fully aware that, in the ordinary course of events, you would want to take Winky into your department for questioning. I ask you, however, to allow me to deal with her.\" Mr. Diggory looked as though he didn't think much of this suggestion at all, but it was clear to Harry that Mr. Crouch was such an important member of the Ministry that he did not dare refuse him. \"You may rest assured that she will be punished,\" Mr. Crouch added coldly. \"M-m-master. . .\" Winky stammered, looking up at Mr. Crouch, her eyes brimming with tears.  \"M-m-master, p-p-please. . .\" Mr. Crouch stared back, his face somehow sharpened, each line upon it more deeply etched. There was no pity in his gaze. \"Winky has behaved tonight in a manner I would not have believed possible,\" he said slowly.  \"I told her to remain in the tent.  I told her to stay there while I went to sort out the trouble.  And I find that she disobeyed me.  This means clothes.\" \"No!\" shrieked Winky, prostrating herself at Mr. Crouch's feet.  \"No, master!  Not clothes, not clothes!\" Harry knew that the only way to turn a house-elf free was to present it with proper garments.  It was pitiful to see the way Winky clutched at her tea towel as she sobbed over Mr."
}