{
  "id": "b6033de5254a3b4df5c9287fb88e2967770c0ed3",
  "text": "  He unfolded a square of parchment.  The paint has faded, but you can see where the mapmaker marked the sites of wildling villages, and there’s another book… where is it now? I was reading it a moment ago.  He shoved some scrolls aside to reveal a dusty volume bound in rotted leather.  This,  he said reverently,  is the account of a journey from the Shadow Tower all the way to Lorn Point on the Frozen Shore, written by a ranger named Redwyn. It’s not dated, but he mentions a Dorren Stark as King in the North, so it must be from before the Conquest. Jon, they fought giants! Redwyn even traded with the children of the forest, it’s all here.  Ever so delicately, he turned pages with a finger.  He drew maps as well, see…    Maybe you could write an account of our ranging, Sam.   He’d meant to sound encouraging, but it was the wrong thing to say. The last thing Sam needed was to be reminded of what faced them on the morrow. He shuffled the scrolls about aimlessly.  There’s more maps. If I had time to search… everything’s a jumble. I could set it all to order, though; I know I could, but it would take time… well, years, in truth.    Mormont wanted those maps a little sooner than that.  Jon plucked a scroll from a bin, blew off the worst of the dust. A corner flaked off between his fingers as he unrolled it.  Look, this one is crumbling,  he said, frowning over the faded script.   Be gentle.  Sam came around the table and took the scroll from his hand, holding it as if it were a wounded animal.  The important books used to be copied over when they needed them. Some of the oldest have been copied half a hundred times, probably.    Well, don’t bother copying that one. Twenty-three barrels of pickled cod, eighteen jars of fish oil, a cask of salt…    An inventory,  Sam said,  or perhaps a bill of sale.    Who cares how much pickled cod they ate six hundred years ago?  Jon wondered.   I would.  Sam carefully replaced the scroll in the bin from which Jon had plucked it.  You can learn so much from ledgers like that, truly you can. it can tell you how many men were in the Night’s Watch then, how they lived, what they ate…    They ate food,  said Jon,  and they lived as we live.    You’d be surprised. This vault is a treasure, Jon.    If you say so.  Jon was doubtful. Treasure meant gold, silver, and jewels, not dust, spiders, and rotting leather.   I do,  the fat boy blurted. He was older than Jon, a man grown by law, but it was hard to think of him as anything but a boy.  I found drawings of the faces in the trees, and a book about the tongue of the children of the forest… works that even the Citadel doesn’t have, scrolls from old Valyria, counts of the seasons written by maesters dead a thousand years…    The books will still be here when we return.    If we return…    The Old Bear is taking two hundred seasoned men, three-quarters of them rangers. Qhorin Halfhand will be bringing another hundred brothers from the Shadow Tower. You’ll be as safe as if you were back in your lord father’s castle at Horn Hill.   Samwell Tarly managed a sad little smile.  I was never very safe in my father’s castle either.   The gods play cruel jests, Jon thought. Pyp and Toad, all a lather to be a part of the great ranging, were to remain at Castle Black. It was Samwell Tarly, the self-proclaimed coward, grossly fat, timid, and near as bad a rider as he was with a sword, who must face the haunted forest. The Old Bear was taking two cages of ravens, so they might send back word as they went. Maester Aemon was blind and far too frail to ride with them, so his steward must go in his place.  We need you for the ravens, Sam. And someone has to help me keep Grenn humble.   Sam’s chins quivered.  You could care for the ravens, or Grenn could, or anyone,  he said with a thin edge of desperation in his voice.  I could show you how. You know your letters too, you could write down Lord Mormont’s messages as well as I.    I’m the Old Bear’s steward. I’ll need to squire for him, tend his horse, set up his tent; I won’t have time to watch over birds as well. Sam, you said the words. You’re a brother of the Night’s Watch now.    A brother of the Night’s Watch shouldn’t be so scared.    We’re all scared. We’d be fools if we weren’t.  Too many rangers had been lost the past two years, even Benjen Stark, Jon’s uncle. They had found two of his uncle’s men in the wood, slain, but the corpses had risen in the chill of night. Jon’s burnt fingers twitched as he remembered. He still saw the wight in his dreams, dead Othor with the burning blue eyes and the cold black hands, but that was the last thing Sam needed to be reminded of.  There’s no shame in fear, my father told me, what matters is how we face it. Come, I’ll help you gather up the maps.   Sam nodded unhappily. The shelves were so closely spaced that they had to walk single file as they left. The vault opened onto one of the tunnels the brothers called the wormwalks, winding subterranean passages that linked the keeps and towers of Castle Black under the earth."
}