{
  "id": "b6bec0508163813525ab944fa3c8f9531353e481",
  "text": " If only he could somehow approach Melisandre unseen… he needed but an instant’s access to her cup.  You are the rightful heir to your brother Robert, the true Lord of the Seven Kingdoms, and King of the Andals, the Rhoynar, and the First Men,  he said desperately,  but even so, you cannot hope to triumph without allies.    He has an ally,  Lady Selyse said.  R’hllor, the Lord of Light, the Heart of Fire, the God of Flame and Shadow.    Gods make uncertain allies at best,  the old man insisted,  and that one has no power here.    You think not?  The ruby at Melisandre’s throat caught the light as she turned her head, and for an instant it seemed to glow bright as the comet.  If you will speak such folly, Maester, you ought to wear your crown again.    Yes,  Lady Selyse agreed.  Patches’s helm. It suits you well, old man. Put it on again, I command you.    Under the sea, no one wears hats,  Patchface said.  I know, I know, oh, oh, oh.   Lord Stannis’s eyes were shadowed beneath his heavy brow, his mouth tight as his jaw worked silently. He always ground his teeth when he was angry.  Fool,  he growled at last,  my lady wife commands. Give Cressen your helm.   No, the old maester thought, this is not you, not your way, you were always just, always hard yet never cruel, never, you did not understand mockery, no more than you understood laughter.  Patchface danced closer, his cowbells ringing, clang-a-lang, ding-ding, clink-clank-clink-clank. The maester sat silent while the fool set the antlered bucket on his brow. Cressen bowed his head beneath the weight. His bells clanged.  Perhaps he ought sing his counsel henceforth,  Lady Selyse said.   You go too far, woman,  Lord Stannis said.  He is an old man, and he’s served me well.   And I will serve you to the last, my sweet lord, my poor lonely son, Cressen thought, for suddenly he saw the way. Ser Davos’s cup was before him, still half-full of sour red. He found a hard flake of crystal in his sleeve, held it tight between thumb and forefinger as he reached for the cup. Smooth motions, deft, I must not fumble now, he prayed, and the gods were kind. In the blink of an eye, his fingers were empty. His hands had not been so steady for years, nor half so fluid. Davos saw, but no one else, he was certain. Cup in hand, he rose to his feet.  Mayhaps I have been a fool. Lady Melisandre, will you share a cup of wine with me? A cup in honor of your god, your Lord of Light? A cup to toast his power?    The red woman studied him.  If you wish.   He could feel them all watching him. Davos clutched at him as he left the bench, catching his sleeve with the fingers that Lord Stannis had shortened.  What are you doing?  he whispered.   A thing that must be done,  Maester Cressen answered,  for the sake of the realm, and the soul of my lord.  He shook off Davos’s hand, spilling a drop of wine on the rushes.  She met him beneath the high table with every man’s eyes upon them. But Cressen saw only her. Red silk, red eyes, the ruby red at her throat, red lips curled in a faint smile as she put her hand atop his own, around the cup. Her skin felt hot, feverish.  It is not too late to spill the wine, Maester.    No,  he whispered hoarsely.  No.    As you will.  Melisandre of Asshai took the cup from his hands and drank long and deep. There was only half a swallow of wine remaining when she offered it back to him.  And now you.   His hands were shaking, but he made himself be strong. A maester of the Citadel must not be afraid. The wine was sour on his tongue. He let the empty cup drop from his fingers to shatter on the floor.  He does have power here, my lord,  the woman said.  And fire cleanses.  At her throat, the ruby shimmered redly.  Cressen tried to reply, but his words caught in his throat. His cough became a terrible thin whistle as he strained to suck in air. Iron fingers tightened round his neck. As he sank to his knees, still he shook his head, denying her, denying her power, denying her magic, denying her god. And the cowbells peeled in his antlers, singing fool, fool, fool while the red woman looked down on him in pity, the candle flames dancing in her red red eyes.      ARYA  At Winterfell they had called her  Arya Horseface  and she’d thought nothing could be worse, but that was before the orphan boy Lommy Greenhands had named her  Lumpyhead.   Her head felt lumpy when she touched it. When Yoren had dragged her into that alley she’d thought he meant to kill her, but the sour old man had only held her tight, sawing through her mats and tangles with his dagger. She remembered how the breeze sent the fistfuls of dirty brown hair skittering across the paving stones, toward the sept where her father had died.  I’m taking men and boys from the city,  Yoren growled as the sharp steel scraped at her head.  Now you hold still, boy.  By the time he had finished, her scalp was nothing but tufts and stubble.  Afterward he told her that from there to Winterfell she’d be Arry the orphan boy."
}