{
  "id": "b725345366d558c7830a87bb9705d46f952774b5",
  "text": "  When morning came, he made himself eat. They fed him a mush of oats, horse food, but he forced down every spoon. He ate again at evenfall, and the next day. Live, he told himself harshly, when the mush was like to gag him, live for Cersei, live for Tyrion. Live for vengeance. A Lannister always pays his debts. His missing hand throbbed and burned and stank. When I reach King’s Landing I’ll have a new hand forged, a golden hand, and one day I’ll use it to rip out Vargo Hoat’s throat.  The days and the nights blurred together in a haze of pain. He would sleep in the saddle, pressed against Brienne, his nose full of the stink of his rotting hand, and then at night he would lie awake on the hard ground, caught in a waking nightmare. Weak as he was, they always bound him to a tree. It gave him some cold consolation to know that they feared him that much, even now.  Brienne was always bound beside him. She lay there in her bonds like a big dead cow, saying not a word. The wench has built a fortress inside herself. They will rape her soon enough, but behind her walls they cannot touch her. But Jaime’s walls were gone. They had taken his hand, they had taken his sword hand, and without it he was nothing. The other was no good to him. Since the time he could walk, his left arm had been his shield arm, no more. It was his right hand that made him a knight; his right arm that made him a man.  One day, he heard Urswyck say something about Harrenhal, and remembered that was to be their destination. That made him laugh aloud, and that made Timeon slash his face with a long thin whip. The cut bled, but beside his hand he scarcely felt it.  Why did you laugh?  the wench asked him that night, in a whisper.   Harrenhal was where they gave me the white cloak,  he whispered back.  Whent’s great tourney. He wanted to show us all his big castle and his fine sons. I wanted to show them too. I was only fifteen, but no one could have beaten me that day. Aerys never let me joust.  He laughed again.  He sent me away. But now I’m coming back.   They heard the laugh. That night it was Jaime who got the kicks and punches. He hardly felt them either, until Rorge slammed a boot into his stump, and then he fainted.  It was the next night when they finally came, three of the worst; Shagwell, noseless Rorge, and the fat Dothraki Zollo, the one who’d cut his hand off. Zollo and Rorge were arguing about who would go first as they approached; there seemed to be no question but that the fool would be going last. Shagwell suggested that they should both go first, and take her front and rear. Zollo and Rorge liked that notion, only then they began to fight about who would get the front and who the rear.  They will leave her a cripple too, but inside, where it does not show.  Wench,  he whispered as Zollo and Rorge were cursing one another,  let them have the meat, and you go far away. It will be over quicker, and they’ll get less pleasure from it.    They’ll get no pleasure from what I’ll give them,  she whispered back, defiant.  Stupid stubborn brave bitch. She was going to get herself good and killed, he knew it. And what do I care if she does? If she hadn’t been so pigheaded, I’d still have a hand. Yet he heard himself whisper,  Let them do it, and go away inside.  That was what he’d done, when the Starks had died before him, Lord Rickard cooking in his armor while his son Brandon strangled himself trying to save him.  Think of Renly, if you loved him. Think of Tarth, mountains and seas, pools, waterfalls, whatever you have on your Sapphire Isle, think…   But Rorge had won the argument by then.  You’re the ugliest woman I ever seen,  he told Brienne,  but don’t think I can’t make you uglier. You want a nose like mine? Fight me, and you’ll get one. And two eyes, that’s too many. One scream out o’ you, and I’ll pop one out and make you eat it, and then I’ll pull your fucking teeth out one by one.    Oh, do it, Rorge,  pleaded Shagwell.  Without her teeth, she’ll look just like my dear old mother.  He cackled.  And I always wanted to fuck my dear old mother up the arse.   Jaime chuckled.  There’s a funny fool. I have a riddle for you, Shagwell. Why do you care if she screams? Oh, wait, I know.  He shouted,  SAPPHIRES,  as loudly as he could.  Cursing, Rorge kicked at his stump again. Jaime howled. I never knew there was such agony in the world, was the last thing he remembered thinking. It was hard to say how long he was gone, but when the pain spit him out, Urswyck was there, and Vargo Hoat himself.  Thee’th not to be touched,  the goat screamed, spraying spittle all over Zollo.  Thee hath to be a maid, you foolth! Thee’th worth a bag of thapphireth!  And from then on, every night Hoat put guards on them, to protect them from his own.  Two nights passed in silence before the wench finally found the courage to whisper,  Jaime? Why did you shout out?    Why did I shout ‘sapphires’, you mean? Use your wits, wench. Would this lot have cared if I shouted ‘rape’?   You did not need to shout at all."
}