{
  "id": "b767cb8a300b9979bf3449a6504e75dd4e3c4417",
  "text": " I am the shield that guards the realms of men.  A hunting horn echoed through the mountains, and a moment later Jon heard the baying of hounds.  They will be with us soon,  announced Qhorin.  Keep your wolf in hand.    Ghost, to me,  Jon called. The direwolf returned reluctantly to his side, tail held stiffly behind him.  The wildlings came boiling over a ridge not half a mile away. Their hounds ran before them, snarling grey-brown beasts with more than a little wolf in their blood. Ghost bared his teeth, his fur bristling.  Easy,  Jon murmured.  Stay.  Overhead he heard a rustle of wings. The eagle landed on an outcrop of rock and screamed in triumph.  The hunters approached warily, perhaps fearing arrows. Jon counted fourteen, with eight dogs. Their large round shields were made of skins stretched over woven wicker and painted with skulls. About half of them hid their faces behind crude helms of wood and boiled leather. On either wing, archers notched shafts to the strings of small wood-and-horn bows, but did not loose. The rest seemed to be armed with spears and mauls. One had a chipped stone axe. They wore only what bits of armor they had looted from dead rangers or stolen during raids. Wildlings did not mine or smelt, and there were few smiths and fewer forges north of the Wall.  Qhorin drew his longsword. The tale of how he had taught himself to fight with his left hand after losing half of his right was part of his legend; it was said that he handled a blade better now than he ever had before. Jon stood shoulder to shoulder with the big ranger and pulled Longclaw from its sheath. Despite the chill in the air, sweat stung his eyes.  Ten yards below the cave mouth the hunters halted. Their leader came on alone, riding a beast that seemed more goat than horse, from the surefooted way it climbed the uneven slope. As man and mount grew nearer Jon could hear them clattering; both were armored in bones. Cow bones, sheep bones, the bones of goats and aurochs and elk, the great bones of the hairy mammoths… and human bones as well.   Rattleshirt,  Qhorin called down, icy-polite.   To crows I be the Lord o’ Bones.  The rider’s helm was made from the broken skull of a giant, and all up and down his arms bearclaws had been sewn to his boiled leather.  Qhorin snorted.  I see no lord. Only a dog dressed in chickenbones, who rattles when he rides.   The wildling hissed in anger, and his mount reared. He did rattle, Jon could hear it; the bones were strung together loosely, so they clacked and clattered when he moved.  It’s your bones I’ll be rattling soon, Halfhand. I’ll boil the flesh off you and make a byrnie from your ribs. I’ll carve your teeth to cast me runes, and eat me oaten porridge from your skull.    If you want my bones, come get them.   That, Rattleshirt seemed reluctant to do. His numbers meant little in the close confines of the rocks where the black brothers had taken their stand; to winkle them out of the cave the wildlings would need to come up two at a time. But another of his company edged a horse up beside him, one of the fighting women called spearwives.  We are four-and-ten to two, crows, and eight dogs to your wolf,  she called.  Fight or run, you are ours.    Show them,  commanded Rattleshirt.  The woman reached into a bloodstained sack and drew out a trophy. Ebben had been bald as an egg, so she dangled the head by an ear.  He died brave,  she said.   But he died,  said Rattleshirt,  same like you.  He freed his battleaxe, brandishing it above his head. Good steel it was, with a wicked gleam to both blades; Ebben was never a man to neglect his weapons. The other wildlings crowded forward beside him, yelling taunts. A few chose Jon for their mockery.  Is that your wolf, boy?  a skinny youth called, unlimbering a stone flail.  He’ll be my cloak before the sun is down.  On the other side of the line, another spearwife opened her ragged furs to show Jon a heavy white breast.  Does the baby want his momma? Come, have a suck o’ this, boy.  The dogs were barking too.   They would shame us into folly.  Qhorin gave Jon a long look.  Remember your orders.    Belike we need to flush the crows,  Rattleshirt bellowed over the clamor.  Feather them!    No!  The word burst from Jon’s lips before the bowmen could loose. He took two quick steps forward.  We yield!    They warned me bastard blood was craven,  he heard Qhorin Halfhand say coldly behind him.  I see it is so. Run to your new masters, coward.   Face reddening, Jon descended the slope to where Rattleshirt sat his horse. The wildling stared at him through the eyeholes of his helm, and said,  The free folk have no need of cravens.    He is no craven.  One of the archers pulled off her sewn sheepskin helm and shook out a head of shaggy red hair.  This is the Bastard o’ Winterfell, who spared me. Let him live.   Jon met Ygritte’s eyes, and had no words.   Let him die,  insisted the Lord of Bones.  The black crow is a tricksy bird. I trust him not.   On a rock above them, the eagle flapped its wings and split the air with a scream of fury."
}