{
  "id": "b7bef8648eaf834200c9b838e4010da9b09f3117",
  "text": " Knights are supposed to defend women and children. Only a few of the black brothers were knights, but even so… We all say the words, Sam thought. I am the shield that guards the realms of men. A woman was a woman, even a wildling woman. We should help her. We should. It was her child Gilly feared for; she was frightened that it might be a boy. Craster raised up his daughters to be his wives, but there were neither men nor boys to be seen about his compound. Gilly had told Jon that Craster gave his sons to the gods. If the gods are good, they will send her a daughter, Sam prayed.  Up in the loft, Gilly choked back a scream.  That’s it,  a woman said.  Another push, now. Oh, I see his head.   Hers, Sam thought miserably. Her head, hers.   Cold,  said Bannen, weakly.  Please. I’m so cold.  Sam put the bowl and spoon aside, tossed another fur across the dying man, put another stick on the fire. Gilly gave a shriek, and began to pant. Craster gnawed on his hard black sausage. He had sausages for himself and his wives, he said, but none for the Watch.  Women,  he complained.  The way they wail… I had me a fat sow once birthed a litter of eight with no more’n a grunt.  Chewing, he turned his head to squint contemptuously at Sam.  She was near as fat as you, boy. Slayer.  He laughed.  It was more than Sam could stand. He stumbled away from the firepit, stepping awkwardly over and around the men sleeping and squatting and dying upon the hard-packed earthen floor. The smoke and screams and moans were making him feel faint. Bending his head, he pushed through the hanging deerhide flaps that served Craster for a door and stepped out into the afternoon.  The day was cloudy, but still bright enough to blind him after the gloom of the hall. Some patches of snow weighed down the limbs of surrounding trees and blanketed the gold and russet hills, but fewer than there had been. The storm had passed on, and the days at Craster’s Keep had been… well, not warm perhaps, but not so bitter cold. Sam could hear the soft drip-drip-drip of water melting off the icicles that bearded the edge of the thick sod roof. He took a deep shuddering breath and looked around.  To the west Ollo Lophand and Tim Stone were moving through the horselines, feeding and watering the remaining garrons.  Downwind, other brothers were skinning and butchering the animals deemed too weak to go on. Spearmen and archers walked sentry behind the earthen dikes that were Craster’s only defense against whatever hid in the wood beyond, while a dozen firepits sent up thick fingers of blue-grey smoke. Sam could hear the distant echoes of axes at work in the forest, where a work detail was harvesting enough wood to keep the blazes burning all through the night. Nights were the bad time. When it got dark. And cold.  There had been no attacks while they had been at Craster’s, neither wights nor Others. Nor would there be, Craster said.  A godly man got no cause to fear such. I said as much to that Mance Rayder once, when he come sniffing round. He never listened, no more’n you crows with your swords and your bloody fires. That won’t help you none when the white cold comes. Only the gods will help you then. You best get right with the gods.   Gilly had spoken of the white cold as well, and she’d told them what sort of offerings Craster made to his gods. Sam had wanted to kill him when he heard. There are no laws beyond the Wall, he reminded himself, and Craster’s a friend to the Watch.  A ragged shout went up from behind the daub-and-wattle hall. Sam went to take a look. The ground beneath his feet was a slush of melting snow and soft mud that Dolorous Edd insisted was made of Craster’s shit. It was thicker than shit, though; it sucked at Sam’s boots so hard he felt one pull loose.  Back of a vegetable garden and empty sheepfold, a dozen black brothers were loosing arrows at a butt they’d built of hay and straw. The slender blond steward they called Sweet Donnel had laid a shaft just off the bull’s eye at fifty yards.  Best that, old man,  he said.   Aye. I will.  Ulmer, stooped and grey-bearded and loose of skin and limb, stepped to the mark and pulled an arrow from the quiver at his waist. In his youth he had been an outlaw, a member of the infamous Kingswood Brotherhood. He claimed he’d once put an arrow through the hand of the White Bull of the Kingsguard to steal a kiss from the lips of a Dornish princess. He had stolen her jewels too, and a chest of golden dragons, but it was the kiss he liked to boast of in his cups.  He notched and drew, all smooth as summer silk, then let fly. His shaft struck the butt an inch inside of Donnel Hill’s.  Will that do, lad?  he asked, stepping back.   Well enough,  said the younger man, grudgingly.  The crosswind helped you. It blew more strongly when I loosed.    You ought to have allowed for it, then. You have a good eye and a steady hand, but you’ll need a deal more to best a man of the kingswood. Fletcher Dick it was who showed me how to bend the bow, and no finer archer ever lived."
}