{
  "id": "b8397ff011c40cf671ca258177ad12408cddc087",
  "text": " I could tell the mob a few choice things, if they let me speak. But would they be that foolish?  As the keys rattled and the door to his cell pushed inward, creaking, Tyrion pressed back against the dampness of the wall, wishing for a weapon. I can still bite and kick. I’ll die with the taste of blood in my mouth, that’s something. He wished he’d been able to think of some rousing last words.  Bugger you all  was not like to earn him much of a place in the histories.  Torchlight fell across his face. He shielded his eyes with a hand.  Come on, are you frightened of a dwarf? Do it, you son of a poxy whore.  His voice had grown hoarse from disuse.   Is that any way to speak about our lady mother?  The man moved forward, a torch in his left hand.  This is even more ghastly than my cell at Riverrun, though not quite so dank.   For a moment Tyrion could not breathe.  You?    Well, most of me.  Jaime was gaunt, his hair hacked short.  I left a hand at Harrenhal. Bringing the Brave Companions across the narrow sea was not one of Father’s better notions.  He lifted his arm, and Tyrion saw the stump.  A bark of hysterical laughter burst from his lips.  Oh, gods,  he said.  Jaime, I am so sorry, but… gods be good, look at the two of us. Handless and Noseless, the Lannister boys.    There were days when my hand smelled so bad I wished I was noseless.  Jaime lowered the torch, so the light bathed his brother’s face.  An impressive scar.   Tyrion turned away from the glare.  They made me fight a battle without my big brother to protect me.    I heard tell you almost burned the city down.    A filthy lie. I only burned the river.  Abruptly, Tyrion remembered where he was, and why.  Are you here to kill me?    Now that’s ungrateful. Perhaps I should leave you here to rot if you’re going to be so discourteous.    Rotting is not the fate Cersei has in mind for me.    Well no, if truth be told. You’re to be beheaded on the morrow, out on the old tourney grounds.   Tyrion laughed again.  Will there be food? You’ll have to help me with my last words, my wits have been running about like a rat in a root cellar.    You won’t need last words. I’m rescuing you.  Jaime’s voice was strangely solemn.   Who said I required rescue?    You know, I’d almost forgotten what an annoying little man you are. Now that you’ve reminded me, I do believe I’ll let Cersei cut your head off after all.    Oh no you won’t.  He waddled out of the cell.  Is it day or night up above? I’ve lost all sense of time.    Three hours past midnight. The city sleeps.  Jaime slid the torch back into its sconce, on the wall between the cells.  The corridor was so poorly lit that Tyrion almost stumbled on the turnkey, sprawled across the cold stone floor. He prodded him with a toe.  Is he dead?    Asleep. The other three as well. The eunuch dosed their wine with sweetsleep, but not enough to kill them. Or so he swears. He is waiting back at the stair, dressed up in a septon’s robe. You’re going down into the sewers, and from there to the river. A galley is waiting in the bay. Varys has agents in the Free Cities who will see that you do not lack for funds… but try not to be conspicuous. Cersei will send men after you, I have no doubt. You might do well to take another name.    Another name? Oh, certainly. And when the Faceless Men come to kill me, I’ll say, ‘No, you have the wrong man, I’m a different dwarf with a hideous facial scar.’  Both Lannisters laughed at the absurdity of it all. Then Jaime went to one knee and kissed him quickly once on each cheek, his lips brushing against the puckered ribbon of scar tissue.   Thank you, Brother,  Tyrion said.  For my life.    It was… a debt I owed you.  Jaime’s voice was strange.   A debt?  He cocked his head.  I do not understand.    Good. Some doors are best left closed.    Oh, dear,  said Tyrion.  Is there something grim and ugly behind it? Could it be that someone said something cruel about me once? I’ll try not to weep. Tell me.    Tyrion…   Jaime is afraid.  Tell me,  Tyrion said again.  His brother looked away.  Tysha,  he said softly.   Tysha?  His stomach tightened.  What of her?    She was no whore. I never bought her for you. That was a lie that Father commanded me to tell. Tysha was… she was what she seemed to be. A crofter’s daughter, chance met on the road.   Tyrion could hear the faint sound of his own breath whistling hollowly through the scar of his nose. Jaime could not meet his eyes. Tysha. He tried to remember what she had looked like. A girl, she was only a girl, no older than Sansa.  My wife,  he croaked.  She wed me.    For your gold, Father said. She was lowborn, you were a Lannister of Casterly Rock. All she wanted was the gold, which made her no different from a whore, so… so it would not be a lie, not truly, and… he said that you required a sharp lesson. That you would learn from it, and thank me later…    Thank you?  Tyrion’s voice was choked.  He gave her to his guards. A barracks full of guards."
}