{
  "id": "b91328d63b4ea1a2c1287795a6c7c3f03ea4c938",
  "text": " One day one of them may not return, she thought.   Your Grace?   She turned to find Ser Barristan behind her.  What more would you have of me, ser? I spared you, I took you into my service, now give me some peace.    Forgive me, Your Grace. It was only… now that you know who I am…  The old man hesitated.  A knight of the Kingsguard is in the king’s presence day and night. For that reason, our vows require us to protect his secrets as we would his life. But your father’s secrets by rights belong to you now, along with his throne, and… I thought perhaps you might have questions for me.   Questions? She had a hundred questions, a thousand, ten thousand. Why couldn’t she think of one?  Was my father truly mad?  she blurted out. Why do I ask that?  Viserys said this talk of madness was a ploy of the Usurper’s…    Viserys was a child, and the queen sheltered him as much as she could. Your father always had a little madness in him, I now believe. Yet he was charming and generous as well, so his lapses were forgiven. His reign began with such promise… but as the years passed, the lapses grew more frequent, until…   Dany stopped him.  Do I want to hear this now?   Ser Barristan considered a moment.  Perhaps not. Not now.    Not now,  she agreed.  One day. One day you must tell me all. The good and the bad. There is some good to be said of my father, surely?    There is, Your Grace. Of him, and those who came before him. Your grandfather Jaehaerys and his brother, their father Aegon, your mother… and Rhaegar. Him most of all.    I wish I could have known him.  Her voice was wistful.   I wish he could have known you,  the old knight said.  When you are ready, I will tell you all.   Dany kissed him on the cheek and sent him on his way.  That night her handmaids brought her lamb, with a salad of raisins and carrots soaked in wine, and a hot flaky bread dripping with honey. She could eat none of it. Did Rhaegar ever grow so weary? she wondered. Did Aegon, after his conquest?  Later, when the time came for sleep, Dany took Irri into bed with her, for the first time since the ship. But even as she shuddered in release and wound her fingers through her handmaid’s thick black hair, she pretended it was Drogo holding her… only somehow his face kept turning into Daario’s. If I want Daario I need only say so. She lay with Irri’s legs entangled in her own. His eyes looked almost purple today…  Dany’s dreams were dark that night, and she woke three times from half-remembered nightmares. After the third time she was too restless to return to sleep. Moonlight streamed through the slanting windows, silvering the marble floors. A cool breeze was blowing through the open terrace doors. Irri slept soundly beside her, her lips slightly parted, one dark brown nipple peeping out above the sleeping silks. For a moment Dany was tempted, but it was Drogo she wanted, or perhaps Daario. Not Irri. The maid was sweet and skillful, but all her kisses tasted of duty.  She rose, leaving Irri asleep in the moonlight. Jhiqui and Missandei slept in their own beds. Dany slipped on a robe and padded barefoot across the marble floor, out onto the terrace. The air was chilly, but she liked the feel of grass between her toes and the sound of the leaves whispering to one another. Wind ripples chased each other across the surface of the little bathing pool and made the moon’s reflection dance and shimmer.  She leaned against a low brick parapet to look down upon the city. Meereen was sleeping too. Lost in dreams of kinder days, perhaps. Night covered the streets like a black blanket, hiding the corpses and the grey rats that came up from the sewers to feast on them, the swarms of stinging flies. Distant torches glimmered red and yellow where her sentries walked their rounds, and here and there she saw the faint glow of lanterns bobbing down an alley. Perhaps one was Ser Jorah, leading his horse slowly toward the gate. Farewell, old bear. Farewell, betrayer.  She was Daenerys Stormborn, the Unburnt, khaleesi and queen, Mother of Dragons, slayer of warlocks, breaker of chains, and there was no one in the world that she could trust.   Your Grace?  Missandei stood at her elbow wrapped in a bedrobe, wooden sandals on her feet.  I woke, and saw that you were gone. Did you sleep well? What are you looking at?    My city,  said Dany.  I was looking for a house with a red door, but by night all the doors are black.    A red door?  Missandei was puzzled.  What house is this?    No house. It does not matter.  Dany took the younger girl by the hand.  Never lie to me, Missandei. Never betray me.    I never would,  Missandei promised.  Look, dawn comes.   The sky had turned a cobalt blue from the horizon to the zenith, and behind the line of low hills to the east a glow could be seen, pale gold and oyster pink. Dany held Missandei’s hand as they watched the sun come up. All the grey bricks became red and yellow and blue and green and orange. The scarlet sands of the fighting pits transformed them into bleeding sores before her eyes."
}