{
  "id": "b93d3aed521a7663ffe0721a7c20e2e9827cc747",
  "text": " A pretty lad, and my sister was half in love with him until he had the misfortune to fart once in our presence. I promptly named him Baelor Breakwind, and after that Elia couldn’t look at him without laughing. I was a monstrous young fellow, someone should have sliced out my vile tongue.   Yes, Tyrion agreed silently. Baelor Hightower was no longer young, but he remained Lord Leyton’s heir; wealthy, handsome, and a knight of splendid repute. Baelor Brightsmile, they called him now. Had Elia wed him in place of Rhaegar Targaryen, she might be in Oldtown with her children growing tall around her. He wondered how many lives had been snuffed out by that fart.   Lannisport was the end of our voyage,  Prince Oberyn went on, as Ser Arron Qorgyle helped him into a padded leather tunic and began lacing it up the back.  Were you aware that our mothers knew each other of old?    They had been at court together as girls, I seem to recall. Companions to Princess Rhaella?    Just so. It was my belief that the mothers had cooked up this plot between them. Squire Squishlips and his ilk and the various pimply young maidens who’d been paraded before me were the almonds before the feast, meant only to whet our appetites. The main course was to be served at Casterly Rock.    Cersei and Jaime.    Such a clever dwarf. Elia and I were older, to be sure. Your brother and sister could not have been more than eight or nine. Still, a difference of five or six years is little enough. And there was an empty cabin on our ship, a very nice cabin, such as might be kept for a person of high birth. As if it were intended that we take someone back to Sunspear. A young page, perhaps. Or a companion for Elia. Your lady mother meant to betroth Jaime to my sister, or Cersei to me. Perhaps both.    Perhaps,  said Tyrion,  but my father—    —ruled the Seven Kingdoms, but was ruled at home by his lady wife, or so my mother always said.  Prince Oberyn raised his arms, so Lord Dagos Manwoody and the Bastard of Godsgrace could slip a chainmail byrnie down over his head.  At Oldtown we learned of your mother’s death, and the monstrous child she had borne. We might have turned back there, but my mother chose to sail on. I told you of the welcome we found at Casterly Rock.   What I did not tell you was that my mother waited as long as was decent, and then broached your father about our purpose. Years later, on her deathbed, she told me that Lord Tywin had refused us brusquely. His daughter was meant for Prince Rhaegar, he informed her. And when she asked for Jaime, to espouse Elia, he offered her you instead.    Which offer she took for an outrage.    It was. Even you can see that, surely?    Oh, surely.  It all goes back and back, Tyrion thought, to our mothers and fathers and theirs before them. We are puppets dancing on the strings of those who came before us, and one day our own children will take up our strings and dance on in our steads.  Well, Prince Rhaegar married Elia of Dorne, not Cersei Lannister of Casterly Rock. So it would seem your mother won that tilt.    She thought so,  Prince Oberyn agreed,  but your father is not a man to forget such slights. He taught that lesson to Lord and Lady Tarbeck once, and to the Reynes of Castamere. And at King’s Landing, he taught it to my sister. My helm, Dagos.  Manwoody handed it to him; a high golden helm with a copper disk mounted on the brow, the sun of Dorne. The visor had been removed, Tyrion saw.  Elia and her children have waited long for justice.  Prince Oberyn pulled on soft red leather gloves, and took up his spear again.  But this day they shall have it.   The outer ward had been chosen for the combat. Tyrion had to skip and run to keep up with Prince Oberyn’s long strides. The snake is eager, he thought. Let us hope he is venomous as well. The day was grey and windy. The sun was struggling to break through the clouds, but Tyrion could no more have said who was going to win that fight than the one on which his life depended.  It looked as though a thousand people had come to see if he would live or die. They lined the castle wallwalks and elbowed one another on the steps of keeps and towers. They watched from the stable doors, from windows and bridges, from balconies and roofs. And the yard was packed with them, so many that the gold cloaks and the knights of the Kingsguard had to shove them back to make enough room for the fight. Some had dragged out chairs to watch more comfortably, while others perched on barrels. We should have done this in the Dragonpit, Tyrion thought sourly. We could have charged a penny a head and paid for Joffrey’s wedding and funeral both. Some of the onlookers even had small children sitting on their shoulders, to get a better view. They shouted and pointed at the sight of Tyrion.  Cersei seemed half a child herself beside Ser Gregor. In his armor, the Mountain looked bigger than any man had any right to be. Beneath a long yellow surcoat bearing the three black dogs of Clegane, he wore heavy plate over chainmail, dull grey steel dinted and scarred in battle."
}