{
  "id": "b970b7fb732f9b1b4e86adbc6811437b065624b9",
  "text": "  The old man touched the maester’s chain that hung loosely around his thin, fleshless neck.  My father was Maekar, the First of his Name, and my brother Aegon reigned after him in my stead. My grandfather named me for Prince Aemon the Dragonknight, who was his uncle, or his father, depending on which tale you believe. Aemon, he called me…    Aemon… Targaryen?  Jon could scarcely believe it.   Once,  the old man said.  Once. So you see, Jon, I do know… and knowing, I will not tell you stay or go. You must make that choice yourself, and live with it all the rest of your days. As I have.  His voice fell to a whisper.  As I have…       DAENERYS  When the battle was done, Dany rode her silver through the fields of the dead. Her handmaids and the men of her khas came after, smiling and jesting among themselves.  Dothraki hooves had torn the earth and trampled the rye and lentils into the ground, while arakhs and arrows had sown a terrible new crop and watered it with blood. Dying horses lifted their heads and screamed at her as she rode past. Wounded men moaned and prayed. Jaqqa rhan moved among them, the mercy men with their heavy axes, taking a harvest of heads from the dead and dying alike. After them would scurry a flock of small girls, pulling arrows from the corpses to fill their baskets. Last of all the dogs would come sniffing, lean and hungry, the feral pack that was never far behind the khalasar.  The sheep had been dead longest. There seemed to be thousands of them, black with flies, arrow shafts bristling from each carcass. Khal Ogo’s riders had done that, Dany knew; no man of Drogo’s khalasar would be such a fool as to waste his arrows on sheep when there were shepherds yet to kill.  The town was afire, black plumes of smoke roiling and tumbling as they rose into a hard blue sky. Beneath broken walls of dried mud, riders galloped back and forth, swinging their long whips as they herded the survivors from the smoking rubble. The women and children of Ogo’s khalasar walked with a sullen pride, even in defeat and bondage; they were slaves now, but they seemed not to fear it. It was different with the townsfolk. Dany pitied them; she remembered what terror felt like. Mothers stumbled along with blank, dead faces, pulling sobbing children by the hand. There were only a few men among them, cripples and cowards and grandfathers.  Ser Jorah said the people of this country named themselves the Lhazareen, but the Dothraki called them haesh rakhi, the Lamb Men. Once Dany might have taken them for Dothraki, for they had the same copper skin and almond-shaped eyes. Now they looked alien to her, squat and flat-faced, their black hair cropped unnaturally short. They were herders of sheep and eaters of vegetables, and Khal Drogo said they belonged south of the river bend. The grass of the Dothraki sea was not meant for sheep.  Dany saw one boy bolt and run for the river. A rider cut him off and turned him, and the others boxed him in, cracking their whips in his face, running him this way and that. One galloped behind him, lashing him across the buttocks until his thighs ran red with blood. Another snared his ankle with a lash and sent him sprawling. Finally, when the boy could only crawl, they grew bored of the sport and put an arrow through his back.  Ser Jorah met her outside the shattered gate. He wore a dark green surcoat over his mail. His gauntlets, greaves, and greathelm were dark grey steel. The Dothraki had mocked him for a coward when he donned his armor, but the knight had spit insults right back in their teeth, tempers had flared, longsword had clashed with arakh, and the rider whose taunts had been loudest had been left behind to bleed to death.  Ser Jorah lifted the visor of his flat-topped greathelm as he rode up.  Your lord husband awaits you within the town.    Drogo took no harm?    A few cuts,  Ser Jorah answered,  nothing of consequence. He slew two khals this day. Khal Ogo first, and then the son, Fogo, who became khal when Ogo fell. His bloodriders cut the bells from their hair, and now Khal Drogo’s every step rings louder than before.   Ogo and his son had shared the high bench with her lord husband at the naming feast where Viserys had been crowned, but that was in Vaes Dothrak, beneath the Mother of Mountains, where every rider was a brother and all quarrels were put aside. It was different out in the grass. Ogo’s khalasar had been attacking the town when Khal Drogo caught him. She wondered what the Lamb Men had thought, when they first saw the dust of their horses from atop those cracked-mud walls. Perhaps a few, the younger and more foolish who still believed that the gods heard the prayers of desperate men, took it for deliverance.  Across the road, a girl no older than Dany was sobbing in a high thin voice as a rider shoved her over a pile of corpses, facedown, and thrust himself inside her. Other riders dismounted to take their turns. That was the sort of deliverance the Dothraki brought the Lamb Men."
}