{
  "id": "b9be434fa1b345f374f94d17c3e2b69c9063ca4d",
  "text": " It was surrounded by trees that blocked it from view of the village below, meaning that they could practice Quidditch there, as long as they didn't fly too high.  * 4$  They couldn't use real Quidditch balls, which would have been hard to explain if they had escaped and flown away over the village; instead they threw apples for one another to catch. They took turns riding Harry's Nimbus Two Thousand, which was easily the best broom; Ron's old Shooting Star was often outstripped by passing butterflies.  Five minutes later they were marching up the hill, broomsticks over their shoulders. They had asked Percy if he wanted to join them, but he had said he was busy. Harry had only seen Percy at mealtimes so far; he stayed shut in his room the rest of the time.  \"Wish I knew what he was up to,\" said Fred, frowning. \"He's not himself. His exam results came the day before you did; twelve O.WL.s and he hardly gloated at all.\"  \"Ordinary Wizarding Levels,\" George explained, seeing Harry's puzzled look. \"Bill got twelve, too. If we're not careful, we'll have another Head Boy in the family. I don't think I could stand the shame.\"  Bill was the oldest Weasley brother. He and the next brother, Charlie, had already left Hogwarts. Harry had never met either of them, but knew that Charlie was in Romania studying dragons and Bill in Egypt working for the wizard's bank, Gringotts.  \"Dunno how Mum and Dad are going to afford all our school stuff this year,\" said George after a while. \"Five sets of Lockhart books! And Ginny needs robes and a wand and everything ......  Harry said nothing. He felt a bit awkward. Stored in an underground vault at Gringotts in London was a small fortune that his parents had left him. Of course, it was only in the wizarding world that he had money; you couldn't use Galleons, Sickles, and Knuts  46  in Muggle shops. He had never mentioned his Gringotts bank account to the Dursleys; he didn't think their horror of anything connected with magic would stretch to a large pile of gold.  Mrs. Weasley woke them all early the following Wednesday. After a quick half a dozen bacon sandwiches each, they pulled on their coats and Mrs. Weasley took a flowerpot off the kitchen mantelpiece and peered inside.  \"We're running low, Arthur,\" she sighed. \"We'll have to buy some more today... Ah well, guests first! After you, Harry dear!\"  And she offered him the flowerpot.  Harry stared at them all watching him.  \"W-what am I supposed to do?\" he stammered.  \"He's never traveled by Floo powder,\" said Ron suddenly. \"Sorry, Harry, I forgot.\"  \"Never?\" said Mr. Weasley. \"But how did you get to Diagon Alley to buy your school things last year?\"  \"I went on the Underground -\"  \"Really?\" said Mr. Weasley eagerly. \"Were there escapators? How exactly -\"  \"Not now, Arthur,\" said Mrs. Weasley. \"Floo powder's a lot quicker, dear, but goodness me, if you've never used it before -\"  \"He'll be all right, Mum,\" said Fred. \"Harry, watch us first.\"  He took a pinch of glittering powder out of the flowerpot, stepped up to the fire, and threw the powder into the flames.  With a roar, the fire turned emerald green and rose higher than Fred, who stepped right into it, shouted, \"Diagon Alley!\" and vanished.  * 41  \"You must speak clearly, dear,\" Mrs. Weasley told Harry as George dipped his hand into the flowerpot. \"And be sure to get out at the right grate ......  \"The right what?\" said Harry nervously as the fire roared and whipped George out of sight, too.  \"Well, there are an awful lot of wizard fires to choose from, you know, but as long as you've spoken clearly -\"  \"He'll be fine, Molly, don't fuss,\" said Mr. Weasley, helping himself to Floo powder, too.  \"But, dear, if he got lost, how would we ever explain to his aunt and uncle?\"  \"They wouldn't mind,\" Harry reassured her. \"Dudley would think it was a brilliant joke if I got lost up a chimney, don't worry about that -\"  \"Well ... all right ... you go after Arthur,\" said Mrs. Weasley. \"Now, when you get into the fire, say where you're going  \"And keep your elbows tucked in,\" Ron advised.  \"And your eyes shut,\" said Mrs. Weasley. \"The soot -\"  \"Don't fidget,\" said Ron. \"Or you might well fall out of the wrong fireplace -\"  \"But don't panic and get out too early; wait until you see Fred and George.\"  Trying hard to bear all this in mind, Harry took a pinch of Floo powder and walked to the edge of the fire. He took a deep breath, scattered the powder into the flames, and stepped forward; the fire felt like a warm breeze; he opened his mouth and immediately swallowed a lot of hot ash.  \"D-Dia-gon Alley,\" he coughed.  48  It felt as though he was being sucked down a giant drain. He seemed to be spinning very fast - the roaring in his ears was deafening -he tried to keep his eyes open but the whirl of green flames made him feel sick - something hard knocked his elbow and he tucked it in tightly, still spinning and spinning - now it felt as though cold hands were slapping his face - squinting through his glasses he saw a blurred stream of fireplaces and snatched glimpses of the rooms beyond - his bacon sandwiches were churning inside him - he closed his eyes again wishing it would stop, and then  He fell, face forward, onto cold stone and felt the bridge of his glasses snap."
}