{
  "id": "b9fb72c2a8d6642eb6d294655640e73a206cc7c0",
  "text": "  Following  him  they  found  themselves  in  a  wide  hall  with  a  fire-place  in  the  middle. Though  it was summer there was a wood-fire burning and the smoke was  rising  to  the blackened  rafters  in  search of  the way out  through  an opening  in  the  roof. They passed  through  this dim hall,  lit only by  the  fire and  the hole above  it,  and came  through another smaller door into a sort of veranda propped on wooden  posts made  of  single  tree-trunks. It faced south and was still warm and filled with  the  light  of  the westering  sun which  slanted  into  it,  and  fell  golden  on  the  garden  full of flowers that came right up to the steps.  Here  they  sat  on  wooden  benches  while  Gandalf  began  his  tale,  and  Bilbo  swung his dangling  legs and  looked at  the  flowers  in  the garden, wondering what  their names could be, as he had never seen half of them before.  \"I was coming over the mountains with a friend or two…\" said the wizard.  \"Or two? I can only see one, and a little one at that,\" said Beorn.  \"Well  to  tell you  the  truth,  I did not  like  to bother you with a  lot of us, until  I  found out if you were busy. I will give a call, if I may.\"  \"Go on, call away!\"  So  Gandalf  gave  a  long  shrill  whistle,  and  presently  Thorin  and  Dori  came  round the house by the garden path and stood bowing low before them.  \"One or three you meant, I see!\" said Beorn. \"But these aren't hobbits, they are  dwarves!\"  \"Thorin  Oakenshield,  at  your  service!  Dori  at  your  service!\"  said  the  two  dwarves bowing again.  \"I  don't  need  your  service,  thank  you,\"  said  Beorn,  \"but  I  expect  you  need  mine.  I  am  not  over  fond  of  dwarves;  but  if  it  is  true  you  are  Thorin  (son  of  Thrain, son of  Thror,  I believe), and  that your companion  is  respectable, and  that  you  are  enemies  of  goblins  and  are  not  up  to  any  mischief  in  my  lands-what are  you up to, by the way?\"  \"They  are  on  their  way  to  visit  the  land  of  their  fathers,  away  east  beyond  Mirkwood,\"  put  in  Gandalf,  \"and  it  is  entirely  an  accident  that  we  are  in  your   ####-lands at all. We were crossing by the High Pass that should have brought us to the  road  that  lies  to  the  south  of  your  country,  when  we  were  attacked  by  the  evil  goblins-as I was about to tell you.\"  \"Go on telling, then!\" said Beorn, who was never very polite.  \"There was a terrible storm; the stone-giants were out hurling rocks, and at the  head  of  the  pass  we  took  refuge  in  a  cave,  the  hob  bit  and  I  and  several  of  our  companions…\"  \"Do you call two several?\"  \"Well, no. As a matter of fact there were more than two.\"  \"Where are they? Killed, eaten, gone home?\"  \"Well,  no.  They  don't  seem  all  to  have  come  when  I  whistled.  Shy,  I  expect.  You see, we are very much afraid that we are rather a lot for you to entertain.\"  \"Go on, whistle again! I am in for a party, it seems, and one or two more won't  make much difference,\" growled Beorn.  Gandalf  whistled  again;  but  Nori  and  Ori  were  there  almost  before  he  had  stopped,  for,  if  you  remember, Gandalf  had  told  them  to  come  in pairs  every  five  minutes.  \"Hullo!\"  said  Beorn.  \"You  came  pretty  quick-where were  you  hiding? Come  on my jack-in-the-boxes!\"  \"Nori at your service, Ori at . . .\" they began; but Beorn interrupted them.  \"Thank you! When I want your help I will ask for it. Sit down, and let's get on  with this tale, or it will be supper-time before it is ended.\"  \"As soon as we were asleep,\" went on Gandalf, \"a crack at the back of the cave  opened;  goblins  came  out  and  grabbed  the  hobbit  and  the  dwarves  and our  troop  of ponies—\"  \"Troop  of  ponies?  What  were  you-a  travelling  circus? Or were  you  carrying  lots of goods? Or do you always call six a troop?\"  \"O  no!  As  a  matter  of  fact  there  were  more  than  six  ponies,  for  there  were  more  than  six  of  us-and well,  here  are  two more!\"  Just  at  that moment Balin  and  Dwalin appeared and bowed so low that their beards swept the stone floor. The big  man was frowning at first, but  they did  their very best  to be frightfully polite, and  kept  on  nodding  and  bending  and  bowing  and  waving  their  hoods  before  their  knees  (in  proper  dwarf-fashion),  till  he  stopped  frowning  and  burst  into  a  chuckling laugh; they looked so comical.  \"Troop, was  right,\"  he  said.  \"A  fine  comic  one.  Come  in my merry men,  and  what  are  your  names?  I  don't  want  your  service  just  now,  only  your  names;  and  then sit down and stop wagging!\"   ####-\"Balin  and  Dwalin,\"  they  said  not  daring  to  be  offended,  and  sat  flop  on  the  floor looking rather surprised.  \"Now go on again!\" said Beorn to the wizard.  \"Where  was  1?  O  yes—  I  was  not  grabbed.  I  killed  a  goblin  or  two  with  a  flash—\"  \"Good!\" growled Beorn. \"It is some good being a wizard, then."
}