{
  "id": "bb5e245ac055ca30b5c36a7e6515496a406e1831",
  "text": "    More troubled than you know, eunuch.    To his face we call him Lord Eunuch,  quipped Littlefinger.   How may we be of help to you, good brother?  Grand Maester Pycelle asked in soothing tones.   The Lord Commander sent me to His Grace the king,  Thorne answered.  The matter is too grave to be left to servants.    The king is playing with his new crossbow,  Tyrion said. Ridding himself of Joffrey had required only an ungainly Myrish crossbow that threw three quarrels at a time, and nothing would do but that he try it at once.  You can speak to servants or hold your silence.    As you will,  Ser Alliser said, displeasure in every word.  I am sent to tell you that we found two rangers, long missing. They were dead, yet when we brought the corpses back to the Wall they rose again in the night. One slew Ser Jaremy Rykker, while the second tried to murder the Lord Commander.   Distantly, Tyrion heard someone snigger. Does he mean to mock me with this folly? He shifted uneasily and glanced down at Varys, Littlefinger, and Pycelle, wondering if one of them had a role in this. A dwarf enjoyed at best a tenuous hold on dignity. Once the court and kingdom started to laugh at him, he was doomed. And yet… and yet…  Tyrion remembered a cold night under the stars when he’d stood beside the boy Jon Snow and a great white wolf atop the Wall at the end of the world, gazing out at the trackless dark beyond. He had felt—what?—something, to be sure, a dread that had cut like that frigid northern wind. A wolf had howled off in the night, and the sound had sent a shiver through him.  Don’t be a fool, he told himself. A wolf, a wind, a dark forest, it meant nothing. And yet… He had come to have a liking for old Jeor Mormont during his time at Castle Black.  I trust that the Old Bear survived this attack?    He did.    And that your brothers killed these, ah, dead men?    We did.    You’re certain that they are dead this time?  Tyrion asked mildly. When Bronn choked on a snort of laughter, he knew how he must proceed.  Truly truly dead?    They were dead the first time,  Ser Alliser snapped.  Pale and cold, with black hands and feet. I brought Jared’s hand, torn from his corpse by the bastard’s wolf.   Littlefinger stirred.  And where is this charming token?   Ser Alliser frowned uncomfortably.  It… rotted to pieces while I waited, unheard. There’s naught left to show but bones.   Titters echoed through the hall.  Lord Baelish,  Tyrion called down to Littlefinger,  buy our brave Ser Alliser a hundred spades to take back to the Wall with him.    Spades?  Ser Alliser narrowed his eyes suspiciously.   If you bury your dead, they won’t come walking,  Tyrion told him, and the court laughed openly.  Spades will end your troubles, with some strong backs to wield them. Ser Jacelyn, see that the good brother has his pick of the city dungeons.   Ser Jacelyn Bywater said,  As you will, my lord, but the cells are near empty. Yoren took all the likely men.    Arrest some more, then,  Tyrion told him.  Or spread the word that there’s bread and turnips on the Wall, and they’ll go of their own accord.  The city had too many mouths to feed, and the Night’s Watch a perpetual need of men. At Tyrion’s signal, the herald cried an end, and the hall began to empty.  Ser Alliser Thorne was not so easily dismissed. He was waiting at the foot of the iron Throne when Tyrion descended.  Do you think I sailed all the way from Eastwatch-by-the-Sea to be mocked by the likes of you?  he fumed, blocking the way.  This is no jape. I saw it with my own eyes. I tell you, the dead walk.    You should try to kill them more thoroughly.  Tyrion pushed past. Ser Alliser made to grab his sleeve, but Preston Greenfield thrust him back.  No closer, ser.   Thorne knew better than to challenge a knight of the Kingsguard.  You are a fool, Imp,  he shouted at Tyrion’s back.  The dwarf turned to face him.  Me? Truly? Then why were they laughing at you, I wonder?  He smiled wanly.  You came for men, did you not?    The cold winds are rising. The Wall must be held.    And to hold it you need men, which I’ve given you… as you might have noted, if your ears heard anything but insults. Take them, thank me, and begone before I’m forced to take a crab fork to you again. Give my warm regards to Lord Mormont… and to Jon Snow as well.  Bronn seized Ser Alliser by the elbow and marched him forcefully from the hall.  Grand Maester Pycelle had already scuttled off, but Varys and Littlefinger had watched it all, start to finish.  I grow ever more admiring of you, my lord,  confessed the eunuch.  You appease the Stark boy with his father’s bones and strip your sister of her protectors in one swift stroke. You give that black brother the men he seeks, rid the city of some hungry mouths, yet make it all seem mockery so none may say that the dwarf fears snarks and grumkins. Oh, deftly done.   Littlefinger stroked his beard.  Do you truly mean to send away all your guards, Lannister?    No, I mean to send away all my sister’s guards."
}