{
  "id": "bba290f6a398a3a703e7df4f7b614e089eb49852",
  "text": " Huge cracks had appeared in it. He had never tried to break apart anything as large as these rocks by magic, and now didn't seem a good moment to try - what if the whole tunnel caved in?  There was another thud and another \"ow!\" from behind the rocks. They were wasting time. Ginny had already been in the Chamber of Secrets for hours .... Harry knew there was only one thing to do.  \"Wait there,\" he called to Ron. \"Wait with Lockhart. I'll go on.... If I'm not back in an hour. . .  There was a very pregnant pause,  \"I'll try and shift some of this rock,\" said Ron, who seemed to be trying to keep his voice steady. \"So you can - can get back through. And, Harry -\"  \"See you in a bit,\" said Harry, trying to inject some confidence into his shaking voice.  And he set off alone past the giant snake skin.  Soon the distant noise of Ron straining to shift the rocks was gone. The tunnel turned and turned again. Every nerve in Harry's body was tingling unpleasantly. He wanted the tunnel to end, yet dreaded what he'd find when it did. And then, at last, as he crept around yet another bend, he saw a solid wall ahead on which two entwined serpents were carved, their eyes set with great, glinting emeralds.  *304*  Harry approached, his throat very dry. There was no need to pretend these stone snakes were real; their eyes looked strangely alive.  He could guess what he had to do. He cleared his throat, and the emerald eyes seemed to flicker.  \"Open, \"said Harry, in a low, faint hiss.  The serpents parted as the wall cracked open, the halves slid smoothly out of sight, and Harry, shaking from head to foot, walked inside.  e was standing at the end of a very long, dimly lit chamber. Towering stone pillars entwined with more carved serpents rose to support a ceiling lost in darkness, casting long, black shadows through the odd, greenish gloom that filled the place.  His heart beating very fast, Harry stood listening to the chill silence. Could the basilisk be lurking in a shadowy corner, behind a pillar? And where was Ginny?  He pulled out his wand and moved forward between the serpentine columns. Every careful footstep echoed loudly off the shadowy walls. He kept his eyes narrowed, ready to clamp them shut at the smallest sign of movement. The hollow eye sockets of the stone snakes seemed to be following him. More than once, with a jolt of the stomach, he thought he saw one stir.  Then, as he drew level with the last pair of pillars, a statue high as the Chamber itself loomed into view, standing against the back wall.  *306*    Harry had to crane his neck to look up into the giant face above: It was ancient and monkeyish, with a long, thin beard that fell almost to the bottom of the wizard's sweeping stone robes, where two enormous gray feet stood on the smooth Chamber floor. And between the feet, facedown, lay a small, black-robed figure with flaming-red hair.  \"tinny!\" Harry muttered, sprinting to her and dropping to his knees. \"tinny - don't be dead - please don't be dead -\" He flung his wand aside, grabbed Ginny's shoulders, and turned her over. Her face was white as marble, and as cold, yet her eyes were closed, so she wasn't Petrified. But then she must be  \"Ginny, please wake up,\" Harry muttered desperately, shaking her. Ginny's head lolled hopelessly from side to side.  \"She won't wake,\" said a soft voice.  Harry jumped and spun around on his knees.  A tall, black-haired boy was leaning against the nearest pillar, watching. He was strangely blurred around the edges, as though Harry were looking at him through a misted window. But there was no mistaking him  \"Tom - Tom Riddle?\"  Riddle nodded, not taking his eyes off Harry's face.  \"What d'you mean, she won't wake?\" Harry said desperately. \"She's not - she's not -?\"  \"She's still alive,\" said Riddle. \"But only just.\"  Harry stared at him. Tom Riddle had been at Hogwarts fifty years ago, yet here he stood, a weird, misty light shining about him, not a day older than sixteen.  \"Are you a ghost?\" Harry said uncertainly.  * 30 7*  \"A memory,\" said Riddle quietly. \"Preserved in a diary for fifty years.  He pointed toward the floor near the statue's giant toes. Lying open there was the little black diary Harry had found in Moaning Myrtle's bathroom. For a second, Harry wondered how it had got there - but there were more pressing matters to deal with.  \"You've got to help me, Tom,\" Harry said, raising Ginny's head again. \"We've got to get her out of here. There's a basilisk ... I don't know where it is, but it could be along any moment .... Please, help me -1)  Riddle didn't move. Harry, sweating, managed to hoist Ginny half off the floor, and bent to pick up his wand again.  But his wand had gone.  \"Did you see -?\"  He looked up. Riddle was still watching him - twirling Harry's wand between his long fingers.  \"Thanks,\" said Harry, stretching out his hand for it.  A smile curled the corners of Riddle's mouth. He continued to stare at Harry, twirling the wand idly.  \"Listen,\" said Harry urgently, his knees sagging with Ginny's dead weight."
}