{
  "id": "bba99a404f4ff5af079260e3cb92a6c4fe954778",
  "text": "  \"What does she understand?\" said Harry distractedly, still looking around, trying to tell where the voice had come from.  \"Loads more than I do,\" said Ron, shaking his head.  \"But why's she got to go to the library?\"  \"Because that's what Hermione does,\" said Ron, shrugging. \"When in doubt, go to the library.\"  Harry stood, irresolute, trying to catch the voice again, but people were now emerging from the Great Hall behind him, talking loudly, exiting through the front doors on their way to the Quidditch pitch.  \"You'd better get moving,\" said Ron. \"It's nearly eleven - the match - \"  Harry raced up to Gryffindor Tower, collected his Nimbus Two Thousand, and joined the large crowd swarming across the grounds, but his mind was still in the castle along with the bodiless voice, and as he pulled on his scarlet robes in the locker. room, his only comfort was that everyone was now outside to watch the game.  The teams walked onto the field to tumultuous applause. Oliver Wood took off for a warm-up flight around the goal posts; Madam Hooch released the balls. The Hufflepuffs, who played in canary yellow, were standing in a huddle, having a last-minute discussion of tactics.  Harry was just mounting his broom when Professor McGonagall came half marching, half running across the pitch, carrying an enormous purple megaphone.  Harry's heart dropped like a stone.  \"This match has been cancelled,\" Professor McGonagall called through the megaphone, addressing the packed stadium. There were boos and shouts. Oliver Wood, looking devastated, landed and ran toward Professor McGonagall without getting off his broomstick.  \"But, Professor!\" he shouted. \"We've got to play - the cup  Gryffindor -\"  Professor McGonagall ignored him and continued to shout through her megaphone:  \"All students are to make their way back to the House common rooms, where their Heads of Houses will give them further information. As quickly as you can, please!\"  Then she lowered the megaphone and beckoned Harry over to her.  \"Potter, I think you'd better come with me ......  Wondering how she could possibly suspect him this time, Harry saw Ron detach himself from the complaining crowd; he came running up to them as they set off toward the castle. To Harry's surprise, Professor McGonagall didn't object.  \"Yes, perhaps you'd better come, too, Weasley .....  Some of the students swarming around them were grumbling about the match being canceled; others looked worried. Harry and Ron followed Professor McGonagall back into the school and up the marble staircase. But they weren't taken to anybody's office this time.  \"This will be a bit of a shock,\" said Professor McGonagall in a surprisingly gentle voice as they approached the infirmary. \"There has been another attack ... another double attack.\"  Harry's insides did a horrible somersault. Professor McGonagall pushed the door open and he and Ron entered. .  Madam Pomfrey was bending over a fifth-year girl with long, curly hair. Harry recognized her as the Ravenclaw they'd accidentally asked for directions to the Slytherin common room. And on the bed next to her was  \"Hermione!\" Ron groaned.  Hermione lay utterly still, her eyes open and glassy.  \"They were found near the library,\" said Professor McGonagall. \"I don't suppose either of you can explain this? It was on the floor next to them ......  She was holding up a small, circular mirror.  Harry and Ron shook their heads, both staring at Hermione.  \"I will escort you back to Gryffindor Tower,\" said Professor McGonagall heavily. \"I need to address the students in any case.  \"All students will return to their House common rooms by six o'clock in the evening. No student is to leave the dormitories after that time. You will be escorted to each lesson by a teacher. No student is to use the bathroom unaccompanied by a teacher. All further Quidditch training and matches are to be postponed. There will be no more evening activities.\"  The Gryffindors packed inside the common room listened to Professor McGonagall in silence. She rolled up the parchment  from which she had been reading and said in a somewhat choked voice, \"I need hardly add that I have rarely been so distressed. It is likely that the school will be closed unless the culprit behind these attacks is caught. I would urge anyone who thinks they might know anything about them to come forward.\"  She climbed somewhat awkwardly out of the portrait hole, and the Gryffindors began talking immediately.  \"That's two Gryffindors down, not counting a Gryffindor ghost, one Ravenclaw, and one Hufflepuff, \" said the Weasley twins' friend Lee Jordan, counting on his fingers. \"Haven't any of the teachers noticed that the Slytherins are all safe? Isn't it obvious all this stuff's coming from Slytherin? The Heir of Slytherin, the monster of Slytherin - why don't they just chuck all the Slytherins out?\" he roared, to nods and scattered applause.  Percy Weasley was sitting in a chair behind Lee, but for once he didn't seem keen to make his views heard."
}