{
  "id": "bbe9516b770694c69346a588b23ced6028b96d2c",
  "text": " Do you think I have forgotten how it felt to be afraid?   Whitebeard bowed his head.  Your Grace, I did not mean to give offense.    Only lies offend me, never honest counsel.  Dany patted Arstan’s spotted hand to reassure him.  I have a dragon’s temper, that’s all. You must not let it frighten you.    I shall try and remember.  Whitebeard smiled.  He has a good face, and great strength to him, Dany thought. She could not understand why Ser Jorah mistrusted the old man so. Could he be jealous that I have found another man to talk to? Unbidden, her thoughts went back to the night on Balerion when the exile knight had kissed her. He should never have done that. He is thrice my age, and of too low a birth for me, and I never gave him leave. No true knight would ever kiss a queen without her leave. She had taken care never to be alone with Ser Jorah after that, keeping her handmaids with her aboard ship, and sometimes her bloodriders. He wants to kiss me again, I see it in his eyes.  What Dany wanted she could not begin to say, but Jorah’s kiss had woken something in her, something that been sleeping since Khal Drogo died. Lying abed in her narrow bunk, she found herself wondering how it would be to have a man squeezed in beside her in place of her handmaid, and the thought was more exciting than it should have been. Sometimes she would close her eyes and dream of him, but it was never Jorah Mormont she dreamed of; her lover was always younger and more comely, though his face remained a shifting shadow.  Once, so tormented she could not sleep, Dany slid a hand down between her legs, and gasped when she felt how wet she was. Scarce daring to breathe, she moved her fingers back and forth between her lower lips, slowly so as not to wake Irri beside her, until she found one sweet spot and lingered there, touching herself lightly, timidly at first and then faster. Still, the relief she wanted seemed to recede before her, until her dragons stirred, and one screamed out across the cabin, and Irri woke and saw what she was doing.  Dany knew her face was flushed, but in the darkness Irri surely could not tell. Wordless, the handmaid put a hand on her breast, then bent to take a nipple in her mouth. Her other hand drifted down across the soft curve of belly, through the mound of fine silvery-gold hair, and went to work between Dany’s thighs. It was no more than a few moments until her legs twisted and her breasts heaved and her whole body shuddered. She screamed then. Or perhaps that was Drogon. Irri never said a thing, only curled back up and went back to sleep the instant the thing was done.  The next day, it all seemed a dream. And what did Ser Jorah have to do with it, if anything? It is Drogo I want, my sun-and-stars, Dany reminded herself. Not Irri, and not Ser Jorah, only Drogo. Drogo was dead, though. She’d thought these feelings had died with him there in the red waste, but one treacherous kiss had somehow brought them back to life. He should never have kissed me. He presumed too much, and I permitted it. It must never happen again. She set her mouth grimly and gave her head a shake, and the bell in her braid chimed softly.  Closer to the bay, the city presented a fairer face. The great brick pyramids lined the shore, the largest four hundred feet high. All manner of trees and vines and flowers grew on their broad terraces, and the winds that swirled around them smelled green and fragrant. Another gigantic harpy stood atop the gate, this one made of baked red clay and crumbling visibly, with no more than a stub of her scorpion’s tail remaining. The chain she grasped in her clay claws was old iron, rotten with rust. It was cooler down by the water, though. The lapping of the waves against the rotting pilings made a curiously soothing sound.  Aggo helped Dany down from her litter. Strong Belwas was seated on a massive piling, eating a great haunch of brown roasted meat.  Dog,  he said happily when he saw Dany.  Good dog in Astapor, little queen. Eat?  He offered it with a greasy grin.   That is kind of you, Belwas, but no.  Dany had eaten dog in other places, at other times, but just now all she could think of was the Unsullied and their stupid puppies. She swept past the huge eunuch and up the plank onto the deck of Balerion.  Ser Jorah Mormont stood waiting for her.  Your Grace,  he said, bowing his head.  The slavers have come and gone. Three of them, with a dozen scribes and as many slaves to lift and fetch. They crawled over every foot of our holds and made note of all we had.  He walked her aft.  How many men do they have for sale?    None.  Was it Mormont she was angry with, or this city with its sullen heat, its stinks and sweats and crumbling bricks?  They sell eunuchs, not men. Eunuchs made of brick, like the rest of Astapor. Shall I buy eight thousand brick eunuchs with dead eyes that never move, who kill suckling babes for the sake of a spiked hat and strangle their own dogs? They don’t even have names."
}