{
  "id": "bca1eda18b31f3c7410657a35b4dbf6908a8f0f9",
  "text": " See you do the same for Alayaya.  No sooner was Joff off than a runner came panting up the steps.  My lord, hurry!  He threw himself to one knee.  They’ve landed men on the tourney grounds, hundreds! They’re bringing a ram up to the King’s Gate.   Tyrion cursed and made for the steps with a rolling waddle. Podrick Payne waited below with their horses. They galloped off down River Row, Pod and Ser Mandon Moore coming hard behind him. The shuttered houses were steeped in green shadow, but there was no traffic to get in their way; Tyrion had commanded that the street be kept clear, so the defenders could move quickly from one gate to the next. Even so, by the time they reached the King’s Gate, he could hear a booming crash of wood on wood that told him the battering ram had been brought into play. The groaning of the great hinges sounded like the moans of a dying giant. The gatehouse square was littered with the wounded, but he saw lines of horses as well, not all of them hurt, and sellswords and gold cloaks enough to form a strong column.  Form up,  he shouted as he leapt to the ground. The gate moved under the impact of another blow.  Who commands here? You’re going out.    No.  A shadow detached itself from the shadow of the wall, to become a tall man in dark grey armor. Sandor Clegane wrenched off his helm with both hands and let it fall to the ground. The steel was scorched and dented, the left ear of the snarling hound sheared off. A gash above one eye had sent a wash of blood down across the Hound’s old burn scars, masking half his face.   Yes.  Tyrion faced him.  Clegane’s breath came ragged.  Bugger that. And you.   A sellsword stepped up beside him.  We been out. Three times. Half our men are killed or hurt. Wildfire bursting all around us, horses screaming like men and men like horses—    Did you think we hired you to fight in a tourney? Shall I bring you a nice iced milk and a bowl of raspberries? No? Then get on your fucking horse. You too, dog.   The blood on Clegane’s face glistened red, but his eyes showed white. He drew his longsword.  He is afraid, Tyrion realized, shocked. The Hound is frightened. He tried to explain their need.  They’ve taken a ram to the gate, you can hear them, we need to disperse them—    Open the gates. When they rush inside, surround them and kill them.  The Hound thrust the point of his longsword into the ground and leaned upon the pommel, swaying.  I’ve lost half my men. Horse as well. I’m not taking more into that fire.   Ser Mandon Moore moved to Tyrion’s side, immaculate in his enameled white plate.  The King’s Hand commands you.    Bugger the King’s Hand.  Where the Hound’s face was not sticky with blood, it was pale as milk.  Someone bring me a drink.  A gold cloak officer handed him a cup. Clegane took a swallow, spit it out, flung the cup away.  Water? Fuck your water. Bring me wine.   He is dead on his feet. Tyrion could see it now. The wound, the fire… he’s done, I need to find someone else, but who? Ser Mandon? He looked at the men and knew it would not do. Clegane’s fear had shaken them. Without a leader, they would refuse as well, and Ser Mandon… a dangerous man, Jaime said, yes, but not a man other men would follow.  In the distance Tyrion heard another great crash. Above the walls, the darkening sky was awash with sheets of green and orange light. How long could the gate hold?  This is madness, he thought, but sooner madness than defeat. Defeat is death and shame.  Very well, I’ll lead the sortie.   If he thought that would shame the Hound back to valor, he was wrong. Clegane only laughed.  You?   Tyrion could see the disbelief on their faces.  Me. Ser Mandon, you’ll bear the king’s banner. Pod, my helm.  The boy ran to obey. The Hound leaned on that notched and blood-streaked sword and looked at him with those wide white eyes. Ser Mandon helped Tyrion mount up again.  Form up!  he shouted.  His big red stallion wore crinet and chamfron. Crimson silk draped his hindquarters, over a coat of mail. The high saddle was gilded. Podrik Payne handed up helm and shield, heavy oak emblazoned with a golden hand on red, surrounded by small golden lions. He walked his horse in a circle, looking at the little force of men. Only a handful had responded to his command, no more than twenty. They sat their horses with eyes as white as the Hound’s. He looked contemptuously at the others, the knights and sellswords who had ridden with Clegane.  They say I’m half a man,  he said.  What does that make the lot of you?   That shamed them well enough. A knight mounted, helmetless, and rode to join the others. A pair of sellswords followed. Then more. The King’s Gate shuddered again. In a few moments the size of Tyrion’s command had doubled. He had them trapped. If I fight, they must do the same, or they are less than dwarfs.   You won’t hear me shout out Joffrey’s name,  he told them.  You won’t hear me yell for Casterly Rock either. This is your city Stannis means to sack, and that’s your gate he’s bringing down."
}