{
  "id": "bcff1364c0f2938a13328ba7a63da07b12f6332c",
  "text": "\" A look of great excitement suddenly dawned on Hermione's face. \"I've just realized - I haven't asked Hagrid to join S.P.E.W. yet!\"  she said brightly. \"Wait for me, will you, while I nip upstairs and get the badges?\" \"What is it with her?\"  said Ron, exasperated, as Hermione ran away up the marble staircase. \"Hey, Ron,\" said Harry suddenly. \"It's your friend. . .\" The students from Beauxbatons were coming through the front doors from the grounds, among them, the veela-girl.  Those gathered around the Goblet of Fire stood back to let them pass, watching eagerly. Madame Maxime entered the hall behind her students and organized them into a line. One by one, the Beauxbatons students stepped across the Age Line and dropped their slips of parchment into the blue-white flames.  As each name entered the fire, it turned briefly red and emitted sparks. \"What d'you reckon'll happen to the ones who aren't chosen?\"  Ron muttered to Harry as the veela-girl dropped her parchment into the Goblet of Fire.  \"Reckon they'll go back to school, or hang around to watch the tournament?\" \"Dunno,\" said Harry.  \"Hang around, I suppose... . Madame Maxime's staying to judge, isn't she?\"  When all the Beauxbatons students had submitted their names, Madame Maxime led them back out of the hall and out onto the grounds again. \"Where are they sleeping, then?\"  said Ron, moving toward the front doors and staring after them. A loud rattling noise behind them announced Hermione's reappearance with the box of S. P. E.W. badges. \"Oh good, hurry up,\" said Ron, and he jumped down the stone steps, keeping his eyes on the back of the veela-girl, who was now halfway across the lawn with Madame Maxime. As they neared Hagrid's cabin on the edge of the Forbidden Forest, the mystery of the Beauxbatons' sleeping quarters was solved.  The gigantic powder-blue carriage in which they had arrived had been parked two hundred yards from Hagrid's front door, and the students were climbing back inside it.  The elephantine flying horses that had pulled the carriage were now grazing in a makeshift paddock alongside it. Harry knocked on Hagrid's door, and Fang's booming barks answered instantly. \"Bout time!\"  said Hagrid, when he'd flung open the door.  \"Thought you lot'd forgotten where I live!\" \"We've been really busy, Hag -\" Hermione started to say, but then she stopped dead, looking up at Hagrid, apparently lost for words. Hagrid was wearing his best (and very horrible) hairy brown suit, plus a checked yellow-and-orange tie.  This wasn't the worst of it, though; he had evidently tried to tame his hair, using large quantities of what appeared to be axle grease.  It was now slicked down into two bunches - perhaps he had tried a ponytail like Bill's, but found he had too much hair. The look didn't really suit Hagrid at all. For a moment, Hermione goggled at him, then, obviously deciding not to comment, she said, \"Erm - where are the skrewts.\" \"Out by the pumpkin patch,\" said Hagrid happily.  \"They're get-tin' massive, mus' be nearly three foot long now.  On'y trouble is, they've started killin' each other.\" \"Oh no, really?\"  said Hermione, shooting a repressive look at Ron, who, staring at Hagrid's odd hairstyle, had just opened his mouth to say something about it. \"Yeah,\" said Hagrid sadly. \"S' okay, though, I've got 'em in separate boxes now.  Still got abou' twenty.\" \"Well, that's lucky,\" said Ron. Hagrid missed the sarcasm.  Hagrid's cabin comprised a single room, in one corner of which was a gigantic bed covered in a patchwork quilt.  A similarly enormous wooden table and chairs stood in front of the fire beneath the quantity of cured hams and dead birds hanging from the ceiling.  They sat down at the table while Hagrid started to make tea, and were soon immersed in yet more discussion of the Triwizard Tournament.  Hagrid seemed quite as excited about it as they were. \"You wait,\" he said, grinning.  \"You jus' wait.  Yer going ter see some stuff yeh've never seen before.  Firs' task. . . ah, but I'm not supposed ter say.\" \"Go on, Hagrid!\" Harry, Ron, and Hermione urged him, but he just shook his head, grinning. \"I don' want ter spoil it fer yeh,\" said Hagrid.  \"But it's gonna be spectacular, I'll tell yeh that.  Them champions're going ter have their work cut out. Never thought I'd live ter see the Triwizard Tournament played again!\" They ended up having lunch with Hagrid, though they didn't eat much - Hagrid had made what he said was a beef casserole, but after Hermione unearthed a large talon in hers, she, Harry, and Ron rather lost their appetites.  However, they enjoyed themselves trying to make Hagrid tell them what the tasks in the tournament were going to be, speculating which of the entrants were likely to be selected as champions, and wondering whether Fred and George were beardless yet. A light rain had started to fall by midafternoon; it was very cozy sitting by the fire, listening to the gentle patter of the drops on the window, watching Hagrid darning his socks and arguing with Hermione about house-elves - for he flatly refused to join S."
}