{
  "id": "bd23068e58ed67a1a1e5c9fd06fab8769e96a3f2",
  "text": " Surely it couldn't hurt if he took the hat down and tried it on again? Just to see ... just to make sure it had put him in the right House  He walked quietly around the desk, lifted the hat from its shelf, and lowered it slowly onto his head. It was much too large and slipped down over his eyes, just as it had done the last time he'd put it on. Harry stared at the black inside of the hat, waiting. Then a small voice said in his ear, \"Bee in your bonnet, Harry Potter?\"  \"Er, yes,\" Harry muttered. \"Er - sorry to bother you - I wanted to ask - \"  \"You've been wondering whether I put you in the right House,\" said the hat smartly. \"Yes ... you were particularly difficult to place. But I stand by what I said before\" - Harry's heart leapt - \"you would have done well in Slytherin -\"  Harry's stomach plummeted. He grabbed the point of the hat and pulled it off. It hung limply in his hand, grubby and faded. Harry pushed it back onto its shelf, feeling sick.  \"You're wrong,\" he said aloud to the still and silent hat. It didn't move. Harry backed away, watching it. Then a strange, gagging noise behind him made him wheel around.  He wasn't alone after all. Standing on a golden perch behind the door was a decrepit-looking bird that resembled a half-plucked turkey. Harry stared at it and the bird looked balefully back, making its gagging noise again. Harry thought it looked very ill. Its eyes were dull and, even as Harry watched, a couple more feathers fell out of its tail.  Harry was just thinking that all he needed was for Dumbledore's  pet bird to die while he was alone in the office with it, when the bird burst into flames.  Harry yelled in shock and backed away into the desk. He looked feverishly around in case there was a glass of water somewhere but couldn't see one; the bird, meanwhile, had become a fireball; it gave one loud shriek and next second there was nothing but a smouldering pile of ash on the floor.  The office door opened. Dumbledore came in, looking very somber.  \"Professor,\" Harry gasped. \"Your bird - I couldn't do anything - he just caught fire -\"  To Harry's astonishment, Dumbledore smiled.  \"About time, too,\" he said. \"He's been looking dreadful for days; I've been telling him to get a move on.\"  He chuckled at the stunned look on Harry's face.  \"Fawkes is a phoenix, Harry. Phoenixes burst into flame when it is time for them to die and are reborn from the ashes. Watch him . . .\"  Harry looked down in time to see a tiny, wrinkled, newborn bird poke its head out of the ashes. It was quite as ugly as the old one.  \"It's a shame you had to see him on a Burning Day,\" said Dumbledore, seating himself behind his desk. \"He's really very handsome most of the time, wonderful red and gold plumage. Fascinating creatures, phoenixes. They can carry immensely heavy loads, their tears have healing powers, and they make highly faithful pets.\"  In the shock of Fawkes catching fire, Harry had forgotten what he was there for, but it all came back to him as Dumbledore settled  himself in the high chair behind the desk and fixed Harry with his penetrating, light-blue stare.  Before Dumbledore could speak another word, however, the door of the office flew open with an almighty bang and Hagrid burst in, a wild look in his eyes, his balaclava perched on top of his shaggy black head and the dead rooster still swinging from his hand.  \"It wasn' Harry, Professor Dumbledore!\" said Hagrid urgently. \"I was talkin' ter him seconds before that kid was found, he never had time, sir - \"  Dumbledore tried to say something, but Hagrid went ranting on, waving the rooster around in his agitation, sending feathers everywhere.  \"- it can't've bin him, I'll swear it in front o' the Ministry o' Magic if I have to -\"  \"Hagrid, I -\"  \"- yeh've got the wrong boy, sir, I know Harry never ='  \"Hagrid!\" said Dumbledore loudly. \"I do not think that Harry attacked those people.\"  \"Oh,\" said Hagrid, the rooster falling limply at his side. \"Right. I'll wait outside then, Headmaster.\"  And he stomped out looking embarrassed.  \"You don't think it was me, Professor?\" Harry repeated hopefully as Dumbledore brushed rooster feathers off his desk.  \"No, Harry, I don't,\" said Dumbledore, though his face was somber again. \"But I still want to talk to you.\"  Harry waited nervously while Dumbledore considered him, the tips of his long fingers together.  *208*  \"I must ask you, Harry, whether there is anything you'd like to tell me,\" he said gently. \"Anything at all.\"  Harry didn't know what to say. He thought of Malfoy shouting, \"You'll be next, Mudbloods!\" and of the Polyjuice Potion simmering away in Moaning Myrtle's bathroom. Then he thought of the disembodied voice he had heard twice and remembered what Ron had said: \"Hearing voices no one else can hear isn't a good sign, even in the wizarding world.\" He thought, too, about what everyone was saying about him, and his growing dread that he was somehow connected with Salazar Slytherin ....  \"No,\" said Harry. \"There isn't anything, Professor ."
}