{
  "id": "be2610064f8ea74cbb125d396893c93cef70c154",
  "text": "P.E.W. when she showed him her badges. \"It'd be doin' 'em an unkindness, Hermione,\" he said gravely, threading a massive bone needle with thick yellow yarn.  \"It's in their nature ter look after humans, that's what they like, see? Yeh'd be makin' 'em unhappy ter take away their work, an' insutin' 'em if yeh tried ter pay 'em.\" \"But Harry set Dobby free, and he was over the moon about it!\"  said Hermione.  \"And we heard he's asking for wages now!\" \"Yeah, well, yeh get weirdos in every breed.  I'm not sayin' there isn't the odd elf who'd take freedom, but yeh'll never persuade most of 'em ter do it - no, nothin' doin', Hermione.\" Hermione looked very cross indeed and stuffed her box of badges back into her cloak pocket. By half past five it was growing dark, and Ron, Harry, and Hermione decided it was time to get back up to the castle for the Halloween feast - and, more important, the announcement of the school champions.  \"I'll come with yeh,\" said Hagrid, putting away his darning.  \"Jus' give us a sec.\" Hagrid got up, went across to the chest of drawers beside his bed, and began searching for something inside it.  They didn't pay too much attention until a truly horrible smell reached their nostrils.  Coughing, Ron said, \"Hagrid, what's that?\" \"Eh?\" said Hagrid, turning around with a large bottle in his hand.  \"Don' yeh like it?\" \"Is that aftershave?\" said Hermione in a slightly choked voice. \"Er - eau de cologne,\" Hagrid muttered.  He was blushing. \"Maybe it's a bit much,\" he said gruffly.  \"I'll go take it off, hang on...\" He stumped out of the cabin, and they saw him washing himself vigorously in the water barrel outside the window. \"Eau de cologne?\" said Hermione in amazement. \"Hagrid?\" \"And what's with the hair and the suit?\" said Harry in an undertone. \"Look!\" said Ron suddenly, pointing out of the window. Hagrid had just straightened up and turned 'round.  If he had been blushing before, it was nothing to what he was doing now. Getting to their feet very cautiously, so that Hagrid wouldn't spot them, Harry, Ron, and Hermione peered through the window and saw that Madame Maxime and the Beauxbatons students had just emerged from their carriage, clearly about to set off for the feast too. They couldn't hear what Hagrid was saying, but he was talking to Madame Maxime with a rapt, misty-eyed expression Harry had only ever seen him wear once before - when he had been looking at the baby dragon, Norbert.  \"He's going up to the castle with her!\"  said Hermione indignantly.  \"I thought he was waiting for us!\" Without so much as a backward glance at his cabin, Hagrid was trudging off up the grounds with Madame Maxime, the Beaux-batons students following in their wake, jogging to keep up with their enormous strides. \"He fancies her!\"  said Ron incredulously.  \"Well, if they end up having children, they'll be setting a world record - bet any baby of theirs would weigh about a ton.\" They let themselves out of the cabin and shut the door behind them.  It was surprisingly dark outside.  Drawing their cloaks more closely around themselves, they set off up the sloping lawns. \"Ooh it's them, look!\" Hermione whispered. The Durmstrang party was walking up toward the castle from the lake. Viktor Krum was walking side by side with Karkaroff, and the other Durmstrang students were straggling along behind them.  Ron watched Krum excitedly, but Krum did not look around as he reached the front doors a little ahead of Hermione, Ron, and Harry and proceeded through them. When they entered the candlelit Great Hall it was almost full.  The Goblet of Fire had been moved; it was now standing in front of Dumbledore's empty chair at the teachers' table. Fred and George - clean-shaven again - seemed to have taken their disappointment fairly well. \"Hope it's Angelina,\" said Fred as Harry, Ron, and Hermione sat down. \"So do I!\"  said Hermione breathlessly.  \"Well, we'll soon know!\" The Halloween feast seemed to take much longer than usual.  Perhaps because it was their second feast in two days, Harry didn't seem to fancy the extravagantly prepared food as much as he would have normally.  Like everyone else in the Hall, judging by the constantly craning necks, the impatient expressions on every face, the fidgeting, and the standing up to see whether Dumbledore had finished eating yet, Harry simply wanted the plates to clear, and to hear who had been selected as champions. At long last, the golden plates returned to their original spotless state; there was a sharp upswing in the level of noise within the Hall, which died away almost instantly as Dumbledore got to his feet.  On either side of him, Professor Karkaroff and Madame Maxime looked as tense and expectant as anyone.  Ludo Bagman was beaming and winking at various students. Mr. Crouch, however, looked quite uninterested, almost bored. \"Well, the goblet is almost ready to make its decision,\" said Dumbledore. \"I estimate that it requires one more minute. Now, when the champions' names are called, I would ask them please to come up to the top of the Hall, walk along the staff table, and go through into the next chamber\" - he indicated the door behind the staff table - \"where they will be receiving their first instructions."
}