{
  "id": "bf714aac0ea4687428ea86f8053195f344b3e9a2",
  "text": " Granddaughters as well. I should be offered the same choice you were. I’m his liege lord, he should be overjoyed that I’m willing to wed any of them.    He is a proud man, and we’ve wounded him,  said Catelyn.   The Others take his pride! I will not be shamed in my own hall. My answer is no.   Robb gave him a weary look.  I will not command you. Not in this. But if you refuse, Lord Frey will take it for another slight, and any hope of putting this arights will be gone.    You cannot know that,  Edmure insisted.  Frey has wanted me for one of his daughters since the day I was born. He will not let a chance like this slip between those grasping fingers of his. When Lothar brings him our answer, he’ll come wheedling back and accept a betrothal… and to a daughter of my choosing.    Perhaps, in time,  said Brynden Blackfish.  But can we wait, while Lothar rides back and forth with offers and counters?   Robb’s hands curled into fists.  I must get back to the north. My brothers dead, Winterfell burned, my smallfolk put to the sword… the gods only know what this bastard of Bolton’s is about, or whether Theon is still alive and on the loose. I can’t sit here waiting for a wedding that might or might not happen.    It must happen,  said Catelyn, though not gladly.  I have no more wish to suffer Walder Frey’s insults and complaints than you do, Brother, but I see little choice here. Without this wedding, Robb’s cause is lost. Edmure, we must accept.    We must accept?  he echoed peevishly.  I don’t see you offering to become the ninth Lady Frey, Cat.    The eighth Lady Frey is still alive and well, so far as I know,  she replied. Thankfully. Otherwise it might well have come to that, knowing Lord Walder.  The Blackfish said,  I am the last man in the Seven Kingdoms to tell anyone who they must wed, Nephew. Nonetheless, you did say something of making amends for your Battle of the Fords.    I had in mind a different sort of amends. Single combat with the Kingslayer. Seven years of penace as a begging brother. Swimming the sunset sea with my legs tied.  When he saw that no one was smiling, Edmure threw up his hands.  The Others take you all! Very well, I’ll wed the wench. As amends.       Davos   Lord Alester looked up sharply.  Voices,  he said.  Do you hear, Davos? Someone is coming for us.    Lamprey,  said Davos.  It’s time for our supper, or near enough.  Last night Lamprey had brought them half a beef-and-bacon pie, and a flagon of mead as well. Just the thought of it made his belly start to rumble.   No, there’s more than one.   He’s right. Davos heard two voices at least, and footsteps, growing louder. He got to his feet and moved to the bars.  Lord Alester brushed the straw from his clothes.  The king has sent for me. Or the queen, yes, Selyse would never let me rot here, her own blood.   Outside the cell, Lamprey appeared with a ring of keys in hand. Ser Axell Florent and four guardsmen followed close behind him. They waited beneath the torch while Lamprey searched for the correct key.   Axell,  Lord Alester said.  Gods be good. Is it the king who sends for me, or the queen?    No one has sent for you, traitor,  Ser Axell said.  Lord Alester recoiled as if he’d been slapped.  No, I swear to you, I committed no treason. Why won’t you listen? If His Grace would only let me explain—   Lamprey thrust a great iron key into the lock, turned it, and pulled open the cell. The rusted hinges screamed in protest.  You,  he said to Davos.  Come.    Where?  Davos looked to Ser Axell.  Tell me true, ser, do you mean to burn me?    You are sent for. Can you walk?    I can walk.  Davos stepped from the cell. Lord Alester gave a cry of dismay as Lamprey slammed the door shut once more.   Take the torch,  Ser Axell commanded the gaoler.  Leave the traitor to the darkness.    No,  his brother said.  Axell, please, don’t take the light… gods have mercy…    Gods? There is only R’hllor, and the Other.  Ser Axell gestured sharply, and one of his guardsmen pulled the torch from its sconce and led the way to the stair.   Are you taking me to Melisandre?  Davos asked.   She will be there,  Ser Axell said.  She is never far from the king. But it is His Grace himself who asked for you.   Davos lifted his hand to his chest, where once his luck had hung in a leather bag on a thong. Gone now, he remembered, and the ends of four fingers as well. But his hands were still long enough to wrap about a woman’s throat, he thought, especially a slender throat like hers.  Up they went, climbing the turnpike stair in single file. The walls were rough dark stone, cool to the touch. The light of the torches went before them, and their shadows marched beside them on the walls. At the third turn they passed an iron gate that opened on blackness, and another at the fifth turn. Davos guessed that they were near the surface by then, perhaps even above it. The next door they came to was made of wood, but still they climbed. Now the walls were broken by arrow slits, but no shafts of sunlight pried their way through the thickness of the stone."
}