{
  "id": "bf9fc1dd8d8b47fc15384ba3d677534dbd72adce",
  "text": " Sansa hoped he’d recovered. Marillion was not like to tell her, though.  Sansa walked down the blue silk carpet between rows of fluted pillars slim as lances. The floors and walls of the High Hall were made of milk-white marble veined with blue. Shafts of pale daylight slanted down through narrow arched windows along the eastern wall. Between the windows were torches, mounted in high iron sconces, but none of them was lit. Her footsteps fell softly on the carpet. Outside the wind blew cold and lonely.  Amidst so much white marble even the sunlight looked chilly, somehow… though not half so chilly as her aunt. Lady Lysa had dressed in a gown of cream-colored velvet and a necklace of sapphires and moonstones. Her auburn hair had been done up in a thick braid, and fell across one shoulder. She sat in the high seat watching her niece approach, her face red and puffy beneath the paint and powder. On the wall behind her hung a huge banner, the moon-and-falcon of House Arryn in cream and blue.  Sansa stopped before the dais, and curtsied.  My lady. You sent for me.  She could still hear the sound of the wind, and the soft chords Marillion was playing at the foot of the hall.   I saw what you did,  the Lady Lysa said.  Sansa smoothed down the folds of her skirt.  I trust Lord Robert is better? I never meant to rip his doll. He was smashing my snow castle, I only…    Will you play the coy deceiver with me?  her aunt said.  I was not speaking of Robert’s doll. I saw you kissing him.   The High Hall seemed to grow a little colder. The walls and floor and columns might have turned to ice.  He kissed me.   Lysa’s nostrils flared.  And why would he do that? He has a wife who loves him. A woman grown, not a little girl. He has no need for the likes of you. Confess, child. You threw yourself at him. That was the way of it.   Sansa took a step backward.  That’s not true.    Where are you going? Are you afraid? Such wanton behavior must be punished, but I will not be hard on you. We keep a whipping boy for Robert, as is the custom in the Free Cities. His health is too delicate for him to bear the rod himself. I shall find some common girl to take your whipping, but first you must own up to what you’ve done. I cannot abide a liar, Alayne.    I was building a snow castle,  Sansa said.  Lord Petyr was helping me, and then he kissed me. That’s what you saw.    Have you no honor?  her aunt said sharply.  Or do you take me for a fool? You do, don’t you? You take me for a fool. Yes, I see that now. I am not a fool. You think you can have any man you want because you’re young and beautiful. Don’t think I haven’t seen the looks you give Marillion. I know everything that happens in the Eyrie, little lady. And I have known your like before, too. But you are mistaken if you think big eyes and strumpet’s smiles will win you Petyr. He is mine.  She rose to her feet.  They all tried to take him from me. My lord father, my husband, your mother… Catelyn most of all. She liked to kiss my Petyr too, oh yes she did.   Sansa retreated another step.  My mother?    Yes, your mother, your precious mother, my own sweet sister Catelyn. Don’t you think to play the innocent with me, you vile little liar. All those years in Riverrun, she played with Petyr as if he were her little toy. She teased him with smiles and soft words and wanton looks, and made his nights a torment.    No.  My mother is dead, she wanted to shriek. She was your own sister, and she’s dead.  She didn’t. She wouldn’t.    How would you know? Were you there?  Lysa descended from the high seat, her skirts swirling.  Did you come with Lord Bracken and Lord Blackwood, the time they visited to lay their feud before my father? Lord Bracken’s singer played for us, and Catelyn danced six dances with Petyr that night, six, I counted. When the lords began to argue my father took them up to his audience chamber, so there was no one to stop us drinking. Edmure got drunk, young as he was… and Petyr tried to kiss your mother, only she pushed him away. She laughed at him. He looked so wounded I thought my heart would burst, and afterward he drank until he passed out at the table. Uncle Brynden carried him up to bed before my father could find him like that. But you remember none of it, do you?  She looked down angrily.  Do you?   Is she drunk, or mad?  I was not born, my lady.    You were not born. But I was, so do not presume to tell what is true. I know what is true. You kissed him!    He kissed me,  Sansa insisted again.  I never wanted—    Be quiet, I haven’t given you leave to speak. You enticed him, just as your mother did that night in Riverrun, with her smiles and her dancing. You think I could forget? That was the night I stole up to his bed to give him comfort. I bled, but it was the sweetest hurt. He told me he loved me then, but he called me Cat, just before he fell back to sleep. Even so, I stayed with him until the sky began to lighten. Your mother did not deserve him. She would not even give him her favor to wear when he fought Brandon Stark."
}