{
  "id": "bfb2567ae953cbc52eedbbd0b58406e34237be63",
  "text": "  He  looked  at  the  'black  emperors'  for  a  long  time,  and  enjoyed  the  feel  of  the  breeze in his hair and on his face; but at length the cries of the dwarves, who were  now  simply  stamping  with  impatience  down  below,  reminded  him  of  his  real  business.  It  was  no  good.  Gaze  as much  as  he might,  he  could  see  no  end  to  the  trees  and  the  leaves  in  any  direction.  His  heart,  that  had  been  lightened  by  the  sight of the sun and the feel of the wind, sank back into his toes: there was no food  to go back to down below.   Actually, as I have told you, they were not far off the edge of the forest; and if  Bilbo had had the sense to see it, the tree that he had climbed, though it was tall in  itself, was standing near  the bottom of a wide valley, so  that  from  its  top  the  trees  seemed  to  swell  up  all  round  like  the  edges  of  a  great  bowl,  and  he  could  not  expect  to  see  how  far  the  forest  lasted.  Still  he  did  not  see  this,  and  he  climbed  down  full  of  despair.  He  got  to  the  bottom  again  at  last  scratched,  hot,  and  miserable,  and  he  could  not  see  anything  in  the  gloom  below  when  he  got  there.  His report soon made the others as miserable as he was.  \"The forest goes on for ever and ever and ever in all directions! Whatever shall  we do? And what  is  the use of sending a hobbit!\"  they cried, as if it was his fault.  They did not care tuppence about the butterflies, and were only made more angry  when he told them of the beautiful breeze, which they were too heavy to climb up  and feel.    That  night  they  ate  their  very  last  scraps  and  crumbs  of  food;  and  next  morning  when  they  woke  the  first  thing  they  noticed  was  that  they  were  still  gnawingly  hungry,  and  the  next  thing  was  that  it  was  raining  and  that  here  and  there  the  drip  of  it  was  dropping  heavily  on  the  forest  floor.  That  only  reminded  them  that  they  were  also  parchingly  thirsty,  without  doing  anything  to  relieve  them: you cannot quench a terrible thirst by standing under giant oaks and waiting  for  a  chance  drip  to  fall  on  your  tongue.  The  only  scrap  of  comfort  there  was,  came unexpectedly from Bombur.    ####-He woke  up  suddenly  and  sat  up  scratching  his  head. He  could  not make  out  where  he  was  at  all,  nor  why  he  felt  so  hungry;  for  he  had  forgotten  everything  that  had  happened  since  they  started  their  journey  that  May  morning  long  ago.  The  last  thing  that  he  remembered  was  the  party  at  the  hobbit's  house,  and  they  had  great  difficulty  in  making  him  believe  their  tale  of  all  the  many  adventures  they had had since.  When he heard that there was nothing to eat, he sat down and wept, for he felt  very  weak  and  wobbly  in  the  legs.  \"Why  ever  did  I  wake  up!\"  he  cried.  \"I  was  having such beautiful dreams. I dreamed I was walking in a forest rather like this  one,  only  lit with  torches  on  the  trees  and  lamps  swinging  from  the  branches  and  fires  burning  on  the  ground;  and  there  was  a  great  feast  going  on,  going  on  for  ever.  A  woodland  king  was  there  with  a  crown  of  leaves,  and  there  was  a merry  singing, and I could not count or describe the things there were to eat and drink.\"  \"You need not try,\" said Thorin. \"In fact if you can't talk about something else,  you  had  better  be  silent.  We  are  quite  annoyed  enough  with  you  as  it  is.  If  you  hadn't waked up, we should have left you to your idiotic dreams in the forest; you  are no joke to carry even after weeks of short commons.\"  There  was  nothing  now  to  be  done  but  to  tighten  the  belts  round  their  empty  stomachs,  and  hoist  their  empty  sacks  and  packs,  and  trudge  along  the  track  without any great hope of ever getting to the end before they lay down and died of  starvation.  This  they  did  all  that  day,  going  very  slowly  and  wearily,  while  Bombur  kept  on wailing  that  his  legs would  not  carry  him  and  that  he wanted  to  lie down and sleep.  \"No you don't!\" they said. \"Let your legs take their share, we have carried you  far enough.\"  All  the same he suddenly refused  to go a step further and flung himself on  the  ground.  \"Go  on,  if  you  must,\"  he  said.  \"I'm  just  going  to  lie  here  and  sleep  and  dream of food, if I can't get it any other way. I hope I never wake up again.\"  At that very moment Balin, who was a little way ahead, called out: \"What was  that? I thought I saw a twinkle of light in the forest.\"  They  all  looked,  and  a  longish  way  off,  it  seemed,  they  saw  a  red  twinkle  in  the dark; then another and another sprang out beside it. Even Bombur got up, and  they hurried along then, not caring if it was trolls or goblins. The light was in front  of them and to the left of the path, and when at last they had drawn level with it, it  seemed  plain  that  torches  and  fires were  burning  under  the  trees, but a good way  off their track."
}