{
  "id": "bff76a12fea91e81590156f0f05f992c04339885",
  "text": "  For a   second the  hobbits had a vision, both comical and  alarming, of his  bright  blue  eye gleaming through a circle of gold. Then Tom put the Ring round the  end of his little finger and held it up to the candlelight. For a moment the  hobbits noticed nothing strange about this.  Then they gasped. There was  no    ####-sign of Tom disappearing!        Tom  laughed again,  and then he  spun  the Ring in  the  air  - and it  vanished with a flash. Frodo  gave a cry - and Tom leaned forward and handed  it back to him with a smile.       Frodo looked at it closely, and rather  suspiciously (like one  who has  lent a trinket to a juggler). It was the same Ring, or looked  the same  and  weighed  the same:  for that  Ring had  always  seemed  to  Frodo  to  weigh  strangely heavy in the hand. But something prompted him to make sure. He  was  perhaps a trifle annoyed with Tom for seeming to make so  light of what even  Gandalf thought so perilously important. He waited  for an opportunity, when  the talk was going again, and Tom  was telling an absurd story about badgers  and their queer ways  - then he slipped the Ring on.       Merry turned towards him to say something and gave a start, and checked  an exclamation.  Frodo was delighted (in a  way):  it was  his own ring  all  right, for Merry was staring blankly  at his  chair, and obviously could not  see him. He  got up and  crept  quietly away from  the  fireside towards the  outer door.       'Hey there!' cried Tom, glancing towards him with a most seeing look in  his shining eyes. 'Hey!  Come  Frodo, there!  Where be you  a -going? Old Tom  Bombadil's not as blind  as that yet. Take off your golden ring! Your hand's  more fair without it. Come back! Leave your game and  sit down beside me!  We  must  talk a while more, and  think about the  morning.  Tom  must teach the   right road, and keep your feet from wandering.'       Frodo laughed (trying to feel pleased), and taking off the Ring he came  and  sat down  again. Tom now told them that he reckoned the Sun would shine  tomorrow, and it would be a glad morning, and setting  out would be hopeful.  But they  would do well to start early; for weather in  that  country was  a   thing  that  even Tom could  not be sure  of  for long, and it would  change  sometimes quicker than he could change his jacket.  'I am no weather -master,'  he said; 'nor is aught that goes on two legs.'       By his  advice  they  decided to make nearly  due North from his house,  over the western and lower slopes of the Downs: they might hope  in that way  to strike  the East Road in a day's journey, and avoid the  Barrows. He told  them not to be afraid  - but to mind their own business.        'Keep to  the green grass. Don't you go  a -meddling  with old stone  or    ####-cold Wights or prying in their houses, unless you be strong folk with hearts  that never falter!' He said this more than once; and he advised them to pass  barrows  by on the west-side, if  they  chanced to stray near  one.  Then he  taught them a rhyme to sing, if they should by ill -luck fall into any danger   or difficulty the next day.       Ho! Tom Bombadil, Tom Bombadillo!       By water, wood and hill, by the reed and willow,        By fire, sun and moon, harken now and hear us!       Come, Tom Bombadil, for our need is near us!       When they had sung this  altogether after him, he  clapped them each on  the shoulder with  a  laugh,  and taking  candles  led them  back  to  their  bedroom.   ####-     Chapter 8. Fog on the Barrow-Downs            That night  they heard no noises.  But either in his  dreams or  out of  them,  he could not tell which,  Frodo heard a sweet singing running  in his  mind;  a  song  that  seemed  to  come  like  a  pale  light behind  a  grey  rain-curtain, and growing stronger to turn the veil all to glass and silver,  until at last it was rolled back, and a  far green country opened before him  under a swift sunrise.       The vision  melted  into  waking; and  there  was  Tom whistling like a   tree-full of birds;  and the  sun was already  slanting  down the  hill  and  through the open window. Outside everything was green and pale gold.       After breakfast, which they  again  ate  alone,  they made ready to say  farewell, as nearly heavy of heart as was possible on such  a morning: cool,  bright, and clean under a washed autumn sky of thin blue. The air came fresh  from the  North-west. Their quiet  ponies were almost  frisky,  sniffing and  moving  restlessly. Tom came out  of the house and  waved his hat and danced  upon the doorstep, bidding the hobbits to get up and be off and go with good   speed.       They rode off along a path  that  wound away from behind the house, and   went slanting  up towards the north  end  of  the hill-brow  under which  it  sheltered. They had just dismounted to lead their  ponies up the last  steep  slope, when suddenly Frodo stopped.       'Goldberry!' he cried. 'My fair lady, clad all in silver green! We have  never said  farewell  to her, nor seen  her  since the evening!' He  was  so  distressed tha t he turned  back;  but at  that  moment  a  clear  call  came  rippling down."
}