{
  "id": "bffbd03a755a5c35e94075a4763ab2cc53d5ff4b",
  "text": " He patted the beak several times and the hippogriff closed its eyes lazily, as though enjoying it.  The class broke into applause, all except for Malfoy, Crabbe, and Goyle, who were looking deeply disappointed.  \"Righ' then, Harry,\" said Hagrid. \"I reckon he might' let yeh ride him!\"  This was more than Harry had bargained for. He was used to a broomstick; but he wasn't sure a hippogriff would be quite the same.  \"Yeh climb up there, jus' behind the wing joint,\" said Hagrid, \"an' mind yeh don' pull any of his feathers out, he won' like that....\"  Harry put his foot on the top of Buckbeaks wing and hoisted himself onto its back. Buckbeak stood up. Harry wasn't sure where to hold on; everything in front of him was covered with feathers.  \"Go on, then'\" roared Hagrid, slapping the hippogriffs hindquarters.  Without warning, twelve-foot wings flapped open on either side of Harry, he just had time to seize the hippogriff around the neck before he was soaring upward. It was nothing like a broomstick, and Harry knew which one he preferred; the hippogriff's wings beat uncomfortably on either side of him, catching him under his legs and making him feel he was about to be thrown off; the glossy feathers slipped under his fingers and he didn't dare get a stronger grip; instead of the smooth action of his Nimbus Two Thousand, he now felt himself rocking backward and forward as the hindquarters of the hippogriff rose and fell with its wings.  Buckbeak flew him once around the paddock and then headed back to the ground; this was the bit Harry had been dreading; he leaned back as the smooth neck lowered, feeling he was going to slip off over the beak, then felt a heavy thud as the four ill-assorted feet hit the ground. He just managed to hold on and push himself straight again.  \"Good work, Harry!\" roared Hagrid as everyone except Malfoy, Crabbe, and Goyle cheered. \"Okay, who else wants a go?\"  Emboldened by Harry's success, the rest of the class climbed cautiously into the paddock. Hagrid untied the hippogriffs one by one, and soon people were bowing nervously, all over the paddock. Neville ran repeatedly backward from his, which didn't seem to want to bend its knees. Ron and Hermione practiced on the chestnut, while Harry watched.  Malfoy, Crabbe, and Goyle had taken over Buckbeak. He had bowed to Malfoy, who was now patting his beak, looking disdainful.  \"This is very easy,\" Malfoy drawled, loud enough for Harry to, hear him. \"I knew it must have been, if Potter could do it.... I bet you're not dangerous at all, are you?\" he said to the hippogriff. \"Are you, you great ugly brute?\"  It happened in a flash of steely talons; Malfoy let out a highpitched scream and next moment, Hagrid was wrestling Buckbeak back into his collar as he strained to get at Malfoy, who lay curled in the grass, blood blossoming over his robes.  \"I'm dying!\" Malfoy yelled as the class panicked. \"I'm dying, look at me! It's killed me!\"  \"Yer not dyin'!\" said Hagrid, who had gone very white. \"Someone help me -- gotta get him outta here --\"  Hermione ran to hold open the gate as Hagrid lifted Malfoy easily. As they passed, Harry saw that there was a long, deep gash on Malfoy's arm; blood splattered the grass and Hagrid ran with him, up the slope toward the castle.  Very shaken, the Care of Magical Creatures class followed at a walk. The Slytherins were all shouting about Hagrid.  \"They should fire him straight away!\" said Pansy Parkinson, who was in tears.  \"It was Malfoy's fault!\" snapped Dean Thomas. Crabbe and Goyle flexed their muscles threateningly.  They all climbed the stone steps into the deserted entrance hall.  \"I'm going to see if he's okay!\" said Pansy, and they all watched her run up the marble staircase. The Slytherins, still muttering about Hagrid, headed away in the direction of their dungeon common room; Harry, Ron, and Hermione proceeded upstairs to Gryffindor Tower.  \"You think he'll be all right?\" said Hermione nervously.  \"Course he will. Madam Pomfrey can mend cuts in about a second,\" said Harry, who had had far worse injuries mended magically by the nurse.  \"That was a really bad thing to happen in Hagrid's first class, though, wasn't it?\" said Ron, looking worried. \"Trust Malfoy to mess things up for him....\"  They were among the first to reach the Great Hall at dinnertime, hoping to see Hagrid, but he wasn't there.  \"They wouldn't fire him, would they?\" said Hermione anxiously, not touching her steak-and- kidney pudding.  \"They'd better not,\" said Ron, who wasn't eating either.  Harry was watching the Slytherin table. A large group including Crabbe and Goyle was huddled together, deep in conversation. Harry was sure they were cooking up their own version of how Malfoy had been injured.  \"Well, you can't say it wasn't an interesting first day back,\" said Ron gloomily.  They went up to the crowded Gryffindor common room after dinner and tried to do the homework Professor McGonagall had given them, but all three of them kept breaking off and glancing Out of the tower window."
}