{
  "id": "c00e185d8acf42d35134f0f1cc159c5f9ec39433",
  "text": "  Words utterly failed Uncle Vernon.  His best suit was covered in white dust, which had settled in his hair and mustache and made him look as though he had just aged thirty years. \"Er - yes - sorry about that,\" said Mr. Weasley, lowering his hand and looking over his shoulder at the blasted fireplace.  \"It's all my fault.  It just didn't occur to me that we wouldn't be able to get out at the other end.  I had your fireplace connected to the Floo Network, you see - just for an afternoon, you know, so we could get Harry.  Muggle fireplaces aren't supposed to be connected, strictly speaking - but I've got a useful contact at the Floo Regulation Panel and he fixed it for me.  I can put it right in a jiffy, though, don't worry.  I'll light a fire to send the boys back, and then I can repair your fireplace before I Disapparate.\" Harry was ready to bet that the Dursleys hadn't understood a single word of this.  They were still gaping at Mr. Weasley, thunderstruck.  Aunt Petunia staggered upright again and hid behind Uncle Vernon. \"Hello, Harry!\" said Mr. Weasley brightly.  \"Got your trunk ready?\" \"It's upstairs,\" said Harry, grinning back. \"We'll get it,\" said Fred at once.  Winking at Harry, he and George left the room.  They knew where Harry's bedroom was, having once rescued him from it in the dead of night.  Harry suspected that Fred and George were hoping for a glimpse of Dudley; they had heard a lot about him from Harry. \"Well,\" said Mr. Weasley, swinging his arms slightly, while he tried to find words to break the very nasty silence.  \"Very - erm - very nice place you've got here.\" As the usually spotless living room was now covered in dust and bits of brick, this remark didn't go down too well with the Dursleys.  Uncle Vernon's face purpled once more, and Aunt Petunia started chewing her tongue again.  However, they seemed too scared to actually say anything. Mr. Weasley was looking around.  He loved everything to do with Muggles.  Harry could see him itching to go and examine the television and the video recorder. \"They run off eckeltricity, do they?\" he said knowledgeably. \"Ah yes, I can see the plugs. I collect plugs,\" he added to Uncle Vernon. \"And batteries. Got a very large collection of batteries. My wife thinks I'm mad, but there you are.\" Uncle Vernon clearly thought Mr. Weasley was mad too.  He moved ever so slightly to the right, screening Aunt Petunia from view, as though he thought Mr. Weasley might suddenly run at them and attack. Dudley suddenly reappeared in the room.  Harry could hear the clunk of his trunk on the stairs, and knew that the sounds had scared Dudley out of the kitchen.  Dudley edged along the wall, gazing at Mr. Weasley with terrified eyes, and attempted to conceal himself behind his mother and father.  Unfortunately, Uncle Vernon's bulk, while sufficient to hide bony Aunt Petunia, was nowhere near enough to conceal Dudley. \"Ah, this is your cousin, is it, Harry?\" said Mr. Weasley, taking another brave stab at making conversation. \"Yep,\" said Harry, \"that's Dudley.\" He and Ron exchanged glances and then quickly looked away from each other; the temptation to burst out laughing was almost overwhelming.  Dudley was still clutching his bottom as though afraid it might fall off.  Mr. Weasley, however, seemed genuinely concerned at Dudley's peculiar behavior.  Indeed, from the tone of his voice when he next spoke, Harry was quite sure that Mr. Weasley thought Dudley was quite as mad as the Dursleys thought he was, except that Mr. Weasley felt sympathy rather than fear. \"Having a good holiday, Dudley?\" he said kindly. Dudley whimpered.  Harry saw his hands tighten still harder over his massive backside. Fred and George came back into the room carrying Harry's school trunk.  They glanced around as they entered and spotted Dudley.  Their faces cracked into identical evil grins. \"Ah, right,\" said Mr. Weasley.  \"Better get cracking then.\" He pushed up the sleeves of his robes and took out his wand.  Harry saw the Dursleys draw back against the wall as one. \"Incendio!\" said Mr. Weasley, pointing his wand at the hole in the wall behind him. Flames rose at once in the fireplace, crackling merrily as though they had been burning for hours.  Mr. Weasley took a small drawstring bag from his pocket, untied it, took a pinch of the powder inside, and threw it onto the flames, which turned emerald green and roared higher than ever. \"Off you go then, Fred,\" said Mr. Weasley. \"Coming,\" said Fred.  \"Oh no - hang on -\" A bag of sweets had spilled out of Fred's pocket and the contents were now rolling in every direction - big, fat toffees in brightly colored wrappers. Fred scrambled around, cramming them back into his pocket, then gave the Dursleys a cheery wave, stepped forward, and walked right into the fire, saying \"the Burrow!\"  Aunt Petunia gave a little shuddering gasp.  There was a whooshing sound, and Fred vanished. \"Right then, George,\" said Mr. Weasley, \"you and the trunk.\" Harry helped George carry the trunk forward into the flames and turn it onto its end so that he could hold it better."
}