{
  "id": "c09c9d9f5d449baf092cb811c3b60a51a80f30b8",
  "text": "   It was true, you could see a long ways from up here. To the south the foothills rose, with the mountains grey and green beyond them. The rolling plains of the New Gift stretched away to all the other directions, as far as the eye could see.  I was hoping we could see the Wall from here,  said Bran, disappointed.  That was stupid, we must still be fifty leagues away.  just speaking of it made him feel tired, and cold as well.  Jojen, what will we do when we reach the Wall? My uncle always said how big it was. Seven hundred feet high, and so thick at the base that the gates are more like tunnels through the ice. How are we going to get past to find the three-eyed crow?    There are abandoned castles along the Wall, I’ve heard,  Jojen answered.  Fortresses built by the Night’s Watch but now left empty. One of them may give us our way through.   The ghost castles, Old Nan had called them. Maester Luwin had once made Bran learn the names of every one of the forts along the Wall. That had been hard; there were nineteen of them all told, though no more than seventeen had ever been manned at any one time. At the feast in honor of King Robert’s visit to Winterfell, Bran had recited the names for his uncle Benjen, east to west and then west to east. Benjen Stark had laughed and said,  You know them better than I do, Bran. Perhaps you should be First Ranger. I’ll stay here in your place.  That was before Bran fell, though. Before he was broken. By the time he’d woken crippled from his sleep, his uncle had gone back to Castle Black.   My uncle said the gates were sealed with ice and stone whenever a castle had to be abandoned,  said Bran.   Then we’ll have to open them again,  said Meera.  That made him uneasy.  We shouldn’t do that. Bad things might come through from the other side. We should just go to Castle Black and tell the Lord Commander to let us pass.    Your Grace,  said Jojen,  we must avoid Castle Black, just as we avoided the kingsroad. There are hundreds of men there.    Men of the Night’s Watch,  said Bran.  They say vows, to take no part in wars and stuff.    Aye,  said Jojen,  but one man willing to forswear himself would be enough to sell your secret to the ironmen or the Bastard of Bolton. And we cannot be certain that the Watch would agree to let us pass. They might decide to hold us or send us back.    But my father was a friend of the Night’s Watch, and my uncle is First Ranger. He might know where the three-eyed crow lives. And Jon’s at Castle Black too.  Bran had been hoping to see Jon again, and their uncle too. The last black brothers to visit Winterfell said that Benjen Stark had vanished on a ranging, but surely he would have made his way back by now.  I bet the Watch would even give us horses,  he went on.   Quiet.  Jojen shaded his eyes with a hand and gazed off toward the setting sun.  Look. There’s something… a rider, I think. Do you see him?   Bran shaded his eyes as well, and even so he had to squint. He saw nothing at first, till some movement made him turn. At first he thought it might be Summer, but no. A man on a horse. He was too far away to see much else.   Hodor?  Hodor had put a hand over his eyes as well, only he was looking the wrong way.  Hodor?    He is in no haste,  said Meera,  but he’s making for this village, it seems to me.    We had best go inside, before we’re seen,  said Jojen.   Summer’s near the village,  Bran objected.   Summer will be fine,  Meera promised.  It’s only one man on a tired horse.   A few fat wet drops began to patter against the stone as they retreated to the floor below. That was well timed; the rain began to fall in earnest a short time later. Even through the thick walls they could hear it lashing against the surface of the lake. They sat on the floor in the round empty room, amidst gathering gloom. The north-facing balcony looked out toward the abandoned village. Meera crept out on her belly to peer across the lake and see what had become of the horseman.  He’s taken shelter in the ruins of the inn,  she told them when she came back.  it looks as though he’s making a fire in the hearth.    I wish we could have a fire,  Bran said.  I’m cold. There’s broken furniture down the stairs, I saw it. We could have Hodor chop it up and get warm.   Hodor liked that idea.  Hodor,  he said hopefully.  Jojen shook his head.  Fire means smoke. Smoke from this tower could be seen a long way off.    If there were anyone to see,  his sister argued.   There’s a man in the village.    One man.    One man would be enough to betray Bran to his enemies, if he’s the wrong man. We still have half a duck from yesterday. We should eat and rest. Come morning the man will go on his way, and we will do the same.   Jojen had his way; he always did. Meera divided the duck between the four of them. She’d caught it in her net the day before, as it tried to rise from the marsh where she’d surprised it. It wasn’t as tasty cold as it had been hot and crisp from the spit, but at least they did not go hungry."
}