{
  "id": "c0aff003c033ee5f21e375b4ae2a0e186029cfd9",
  "text": " Come closer, now.   Cold fingers walked down Arya’s neck. Fear cuts deeper than swords, she reminded herself. She stood and approached the fire warily, light on the balls of her feet, poised to flee.  The dwarf woman studied her with dim red eyes.  I see you,  she whispered.  I see you, wolf child. Blood child. I thought it was the lord who smelled of death…  She began to sob, her little body shaking.  You are cruel to come to my hill, cruel. I gorged on grief at Summerhall, I need none of yours. Begone from here, dark heart. Begone!   There was such fear in her voice that Arya took a step backward, wondering if the woman was mad.  Don’t frighten the child,  Thoros protested.  There’s no harm in her.   Lem Lemoncloak’s finger went to his broken nose.  Don’t be so bloody sure of that.    She will leave on the morrow, with us,  Lord Beric assured the little woman.  We’re taking her to Riverrun, to her mother.    Nay,  said the dwarf.  You’re not. The black fish holds the rivers now. If it’s the mother you want, seek her at the Twins. For there’s to be a wedding.  She cackled again.  Look in your fires, pink priest, and you will see. Not now, though, not here, you’ll see nothing here. This place belongs to the old gods still… they linger here as I do, shrunken and feeble but not yet dead. Nor do they love the flames. For the oak recalls the acorn, the acorn dreams the oak, the stump lives in them both. And they remember when the First Men came with fire in their fists.  She drank the last of the wine in four long swallows, flung the skin aside, and pointed her stick at Lord Beric.  I’ll have my payment now. I’ll have the song you promised me.   And so Lem woke Tom Sevenstrings beneath his furs, and brought him yawning to the fireside with his woodharp in hand.  The same song as before?  he asked.   Oh, aye. My Jenny’s song. Is there another?   And so he sang, and the dwarf woman closed her eyes and rocked slowly back and forth, murmuring the words and crying. Thoros took Arya firmly by the hand and drew her aside.  Let her savor her song in peace,  he said.  It is all she has left.   I wasn’t going to hurt her, Arya thought.  What did she mean about the Twins? My mother’s at Riverrun, isn’t she?    She was.  The red priest rubbed beneath his chin.  A wedding, she said. We shall see. Whenever she is, Lord Beric will find her, though.   Not long after, the sky opened. Lightning cracked and thunder rolled across the hills, and the rain fell in blinding sheets. The dwarf woman vanished as suddenly as she had appeared, while the outlaws gathered branches and threw up crude shelters.  It rained all through that night, and come morning Ned, Lem, and Watty the Miller awoke with chills. Watty could not keep his breakfast down, and young Ned was feverish and shivering by turns, with skin clammy to the touch. There was an abandoned village half a day’s ride to the north, Notch told Lord Beric; they’d find better shelter there, a place to wait out the worst of the rains. So they dragged themselves back into the saddles and urged their horses down the great hill.  The rains did not let up. They rode through woods and fields, fording swollen streams where the rushing water came up to the bellies of their horses. Arya pulled up the hood of her cloak and hunched down, sodden and shivering but determined not to falter. Merrit and Mudge were soon coughing as bad as Watty, and poor Ned seemed to grow more miserable with every mile.  When I wear my helm, the rain beats against the steel and gives me headaches,  he complained.  But when I take it off, my hair gets soaked and sticks to my face and in my mouth.    You have a knife,  Gendry suggested.  If your hair annoys you so much, shave your bloody head.   He doesn’t like Ned. The squire seemed nice enough to Arya; maybe a little shy, but good-natured. She had always heard that Dornishmen were small and swarthy, with black hair and small black eyes, but Ned had big blue eyes, so dark that they looked almost purple. And his hair was a pale blond, more ash than honey.   How long have you been Lord Beric’s squire?  she asked, to take his mind from his misery.   He took me for his page when he espoused my aunt.  He coughed.  I was seven, but when I turned ten he raised me to squire. I won a prize once, riding at rings.    I never learned the lance, but I could beat you with a sword,  said Arya.  Have you killed anyone?   That seemed to startle him.  I’m only twelve.   I killed a boy when I was eight, Arya almost said, but she thought she’d better not.  You’ve been in battles, though.    Yes.  He did not sound very proud of it.  I was at the Mummer’s Ford. When Lord Beric fell into the river, I dragged him up onto the bank so he wouldn’t drown and stood over him with my sword. I never had to fight, though. He had a broken lance sticking out of him, so no one bothered us. When we regrouped, Green Gergen helped pull his lordship back onto a horse.   Arya was remembering the stableboy at King’s Landing."
}