{
  "id": "c0ecc3cc3e3b38f0c75d073924ea6fbf4e08abc3",
  "text": "  As Arya was cinching her saddle girth, Gendry came up to say that he was sorry. She put a foot in the stirrup and swung up into her saddle, so she could look down on him instead of up. You could have made swords at Riverrun for my brother, she thought, but what she said was,  If you want to be some stupid outlaw knight and get hanged, why should I care? I’ll be at Riverrun, ransomed, with my brother.   There was no rain that day, thankfully, and for once they made good time.      Bran   The tower stood upon an island, its twin reflected on the still blue waters. When the wind blew, ripples moved across the surface of the lake, chasing one another like boys at play. Oak trees grew thick along the lakeshore, a dense stand of them with a litter of fallen acorns on the ground beneath. Beyond them was the village, or what remained of it.  It was the first village they had seen since leaving the foothills. Meera had scouted ahead to make certain there was no one lurking amongst the ruins. Sliding in and amongst oaks and apple trees with her net and spear in hand, she startled three red deer and sent them bounding away through the brush. Summer saw the flash of motion and was after them at once. Bran watched the direwolf lope off, and for a moment wanted nothing so much as to slip his skin and run with him, but Meera was waving for them to come ahead. Reluctantly, he turned away from Summer and urged Hodor on, into the village. Jojen walked with them.  The ground from here to the Wall was grasslands, Bran knew; fallow fields and low rolling hills, high meadows and lowland bogs. It would be much easier going than the mountains behind, but so much open space made Meera uneasy.  I feel naked,  she confessed.  There’s no place to hide.    Who holds this land?  Jojen asked Bran.   The Night’s Watch,  he answered.  This is the Gift. The New Gift, and north of that Brandon’s Gift.  Maester Luwin had taught him the history.  Brandon the Builder gave all the land south of the Wall to the black brothers, to a distance of twenty-five leagues. For their… for their sustenance and support.  He was proud that he still remembered that part.  Some maesters say it was some other Brandon, not the Builder, but it’s still Brandon’s Gift. Thousands of years later, Good Queen Alysanne visited the Wall on her dragon Silverwing, and she thought the Night’s Watch was so brave that she had the Old King double the size of their lands, to fifty leagues. So that was the New Gift.  He waved a hand.  Here. All this.   No one had lived in the village for long years, Bran could see. All the houses were falling down. Even the inn. It had never been much of an inn, to look at it, but now all that remained was a stone chimney and two cracked walls, set amongst a dozen apple trees. One was growing up through the common room, where a layer of wet brown leaves and rotting apples carpeted the floor. The air was thick with the smell of them, a cloying cidery scent that was almost overwhelming. Meera stabbed a few apples with her frog spear, trying to find some still good enough to eat, but they were all too brown and wormy.  It was a peaceful spot, still and tranquil and lovely to behold, but Bran thought there was something sad about an empty inn, and Hodor seemed to feel it too.  Hodor?  he said in a confused sort of way.  Hodor? Hodor?    This is good land.  Jojen picked up a handful of dirt, rubbing it between his fingers.  A village, an inn, a stout holdfast in the lake, all these apple trees… but where are the people, Bran? Why would they leave such a place?    They were afraid of the wildlings,  said Bran.  Wildlings come over the Wall or through the mountains, to raid and steal and carry off women. If they catch you, they make your skull into a cup to drink blood, Old Nan used to say. The Night’s Watch isn’t so strong as it was in Brandon’s day or Queen Alysanne’s, so more get through. The places nearest the Wall got raided so much the smallfolk moved south, into the mountains or onto the Umber lands east of the kingsroad. The Greatjon’s people get raided too, but not so much as the people who used to live in the Gift.   Jojen Reed turned his head slowly, listening to music only he could hear.  We need to shelter here. There’s a storm coming. A bad one.   Bran looked up at the sky. It had been a beautiful crisp clear autumn day, sunny and almost warm, but there were dark clouds off to the west now, that was true, and the wind seemed to be picking up.  There’s no roof on the inn and only the two walls,  he pointed out.  We should go out to the holdfast.    Hodor,  said Hodor. Maybe he agreed.   We have no boat, Bran.  Meera poked through the leaves idly with her frog spear.   There’s a causeway. A stone causeway, hidden under the water. We could walk out.  They could, anyway; he would have to ride on Hodor’s back, but at least he’d stay dry that way.  The Reeds exchanged a look.  How do you know that?  asked Jojen.  Have you been here before, my prince?    No."
}