{
  "id": "c15ffd07563c2df9a55f418dde9a1e4b2b6e74de",
  "text": "    Not if you run off with me.    Run, and they’ll catch you and kill you.    They’ll do you worse. Lord Bolton is giving Harrenhal to the Bloody Mummers, he told me so.   Gendry pushed black hair out of his eyes.  So?   She looked right at him, fearless.  So when Vargo Hoat’s the lord, he’s going to cut off the feet of all the servants to keep them from running away. The smiths too.    That’s only a story,  he said scornfully.   No, it’s true, I heard Lord Vargo say so,  she lied.  He’s going to cut one foot off everyone. The left one. Go to the kitchens and wake Hot Pie, he’ll do what you say. We’ll need bread or oatcakes or something. You get the swords and I’ll do the horses. We’ll meet near the postern in the east wall, behind the Tower of Ghosts. No one ever comes there.    I know that gate. It’s guarded, same as the rest.    So? You won’t forget the swords?    I never said I’d come.    No. But if you do, you won’t forget the swords?   He frowned.  No,  he said at last.  I guess I won’t.   Arya reentered Kingspyre the same way she had left it, and stole up the winding steps listening for footfalls. In her cell, she stripped to the skin and dressed herself carefully, in two layers of smallclothes, warm stockings, and her cleanest tunic. It was Lord Bolton’s livery. On the breast was sewn his sigil, the flayed man of the Dreadfort. She tied her shoes, threw a wool cloak over her skinny shoulders, and knotted it under her throat. Quiet as a shadow, she moved back down the stairs. Outside the lord’s solar she paused to listen at the door, easing it open slowly when she heard only silence.  The sheepskin map was on the table, beside the remains of Lord Bolton’s supper. She rolled it up tight and thrust it through her belt. He’d left his dagger on the table as well, so she took that too, just in case Gendry lost his courage.  A horse neighed softly as she slipped into the darkened stables. The grooms were all asleep. She prodded one with her toe until he sat up groggily and said,  Eh? Whas?    Lord Bolton requires three horses saddled and bridled.   The boy got to his feet, pushing straw from his hair.  Wha, at this hour? Horses, you say?  He blinked at the sigil on her tunic.  Whas he want horses for, in the dark?    Lord Bolton is not in the habit of being questioned by servants.  She crossed her arms.  The stableboy was still looking at the flayed man. He knew what it meant.  Three, you say?    One two three. Hunting horses. Fast and surefoot.  Arya helped him with the bridles and saddles, so he would not need to wake any of the others. She hoped they would not hurt him afterward, but she knew they probably would.  Leading the horses across the castle was the worst part. She stayed in the shadow of the curtain wall whenever she could, so the sentries walking their rounds on the ramparts above would have needed to look almost straight down to see her. And if they do, what of it? I’m my lord’s own cupbearer. It was a chill dank autumn night. Clouds were blowing in from the west, hiding the stars, and the Wailing Tower screamed mournfully at every gust of wind. It smells like rain. Arya did not know whether that would be good or bad for their escape.  No one saw her, and she saw no one, only a grey and white cat creeping along atop the godswood wall. It stopped and spit at her, waking memories of the Red Keep and her father and Syrio Forel.  I could catch you if I wanted,  she called to it softly,  but I have to go, cat.  The cat hissed again and ran off.  The Tower of Ghosts was the most ruinous of Harrenhal’s five immense towers. It stood dark and desolate behind the remains of a collapsed sept where only rats had come to pray for near three hundred years. It was there she waited to see if Gendry and Hot Pie would come. It seemed as though she waited a long time. The horses nibbled at the weeds that grew up between the broken stones while the clouds swallowed the last of the stars. Arya took out the dagger and sharpened it to keep her hands busy. Long smooth strokes, the way Syrio had taught her. The sound calmed her.  She heard them coming long before she saw them. Hot Pie was breathing heavily, and once he stumbled in the dark, barked his shin, and cursed loud enough to wake half of Harrenhal. Gendry was quieter, but the swords he was carrying rang together as he moved.  Here I am.  She stood.  Be quiet or they’ll hear you.   The boys picked their way toward her over tumbled stones. Gendry was wearing oiled chainmail under his cloak, she saw, and he had his blacksmith’s hammer slung across his back. Hot Pie’s red round face peered out from under a hood. He had a sack of bread dangling from his right hand and a big wheel of cheese under his left arm.  There’s a guard on that postern,  said Gendry quietly.  I told you there would be.    You stay here with the horses,  said Arya.  I’ll get rid of him. Come quick when I call.   Gendry nodded. Hot Pie said,  Hoot like an owl when you want us to come.    I’m not an owl,  said Arya."
}