{
  "id": "c17f5ba670845e59fcae9bcd6ee885a461a9d225",
  "text": "  \"It seems he has been responsible for several deaths'.\" \"But he cannot now give testimony, Cornelius,\" said Dumbledore.  He was staring hard at Fudge, as though seeing him plainly for the first time.  \"He cannot give evidence about why he killed those people.\" \"Why he killed them?  Well, that's no mystery, is it?\"  blustered Fudge.  \"He was a raving lunatic!  From what Minerva and Severus have told me, he seems to have thought he was doing it all on You-Know-Who's instructions!\" \"Lord Voldemort was giving him instructions, Cornelius,\" Dumbledore said.  \"Those peoples deaths were mere by-products of a plan to restore Voldemort to full strength again. The plan succeeded. Voldemort has been restored to his body.\" Fudge looked as though someone had just swung a heavy weight into his face.  Dazed and blinking, he stared back at Dumbledore as if he couldn't quite believe what he had just heard.  He began to sputter, still goggling at Dumbledore. \"You-Know-Who . . . returned?  Preposterous.  Come now, Dumbledore ...\" \"As Minerva and Severus have doubtless told you,\" said Dumbledore, \"we heard Barty Crouch confess.  Under the influence of Veritaserum, he told us how he was smuggled out of Azkaban, and how Voldemort - learning of his continued existence from Bertha Jorkins - went to free him from his father and used him to capture Harry.  The plan worked, I tell you.  Crouch has helped Voldemort to return.\" \"See here, Dumbledore,\" said Fudge, and Harry was astonished to see a slight smile dawning on his face, \"you - you can't seriously believe that You-Know-Who - back?  Come now, come now . . . certainly, Crouch may have believed himself to be acting upon You-Know-Who's orders - but to take the word of a lunatic like that, Dumbledore ...\" \"When Harry touched the Triwizard Cup tonight, he was transported straight to Voldemort,\" said Dumbledore steadily.  \"He witnessed Lord Voldemort's rebirth.  I will explain it all to you if you will step up to my office.\" Dumbledore glanced around at Harry and saw that he was awake, but shook his head and said, \"I am afraid I cannot permit you to question Harry tonight.\" Fudge's curious smile lingered.  He too glanced at Harry, then looked back at Dumbledore, and said, \"You are - er - prepared  to take Harry's word on this, are you, Dumbledore?\"            There was a moment's silence, which was broken by Sirius growling.  His hackles were raised, and he was baring his teeth at Fudge. \"Certainly, I believe Harry,\" said Dumbledore.  His eyes were blazing now.  \"I heard Crouch's confession, and I heard Harry's account of what happened after he touched the Triwizard Cup; the two stories make sense, they explain everything that has happened since Bertha Jorkins disappeared last summer.\" Fudge still had that strange smile on his face.  Once again, he glanced at Harry before answering. \"You are prepared to believe that Lord Voldemort has returned, on the word of a lunatic murderer, and a boy who . . . well...\" Fudge shot Harry another look, and Harry suddenly understood. \"You've been reading Rita Skeeter, Mr. Fudge,\" he said quietly. Ron, Hermione, Mrs. Weasley, and Bill all jumped.  None of them had realized that Harry was awake. Fudge reddened slightly, but a defiant and obstinate look came over his face. \"And if I have?\"  he said, looking at Dumbledore.  \"If I have discovered that you've been keeping certain facts about the boy very quiet?  A Parselmouth, eh?  And having funny turns all over the place -\" \"I assume that you are referring to the pains Harry has been experiencing in his scar?\" said Dumbledore coolly. \"You admit that he has been having these pains, then?\"  said Fudge quickly. \"Headaches?  Nightmares?  Possibly - hallucinations?\" \"Listen to me, Cornelius,\" said Dumbledore, taking a step toward Fudge, and once again, he seemed to radiate that indefinable sense of power that Harry had felt after Dumbledore had Stunned young Crouch.  \"Harry is as sane as you or I.  That scar upon his forehead has not addled his brains.  I believe it hurts him when Lord Voldemort is close by, or feeling particularly murderous.\" Fudge had taken half a step back from Dumbledore, but he looked no less stubborn. \"You'll forgive me, Dumbledore, but I've never heard of a curse scar acting as an alarm bell before. ...\" \"Look, I saw Voldemort come back!\"  Harry shouted.  He tried to get out of bed again, but Mrs. Weasley forced him back.  \"I saw the Death Eaters!  I can give you their names! Lucius Malfoy -\" Snape made a sudden movement, but as Harry looked at him, Snape's eyes flew back to Fudge. \"Malfoy was cleared!\" said Fudge, visibly affronted.  \"A very old family - donations to excellent causes -\" \"Macnair!\"  Harry continued. \"Also cleared!  Now working for the Ministry!\" \"Avery - Nott - Crabbe - Goyle -\" \"You are merely repeating the names of those who were acquitted of being Death Eaters thirteen years ago!\"  said Fudge angrily.  \"You could have found those names in old reports of the trials!  For heavens sake, Dumbledore - the boy was full of some crackpot story at the end of last year too - his tales are getting taller, and you're still swallowing them - the boy can talk to snakes."
}