{
  "id": "c2342365e51fc8f19801a460f8ede86e3652f647",
  "text": "   A Lannister always pays his debts.   Even Mord had scarcely believed it when Tyrion tossed him the leather purse. The gaoler’s eyes had gone big as boiled eggs as he yanked open the drawstring and beheld the glint of gold.  I kept the silver,  Tyrion had told him with a crooked smile,  but you were promised the gold, and there it is.  It was more than a man like Mord could hope to earn in a lifetime of abusing prisoners.  And remember what I said, this is only a taste. If you ever grow tired of Lady Arryn’s service, present yourself at Casterly Rock, and I’ll pay you the rest of what I owe you.  With golden dragons spilling out of both hands, Mord had fallen to his knees and promised that he would do just that.  Bronn yanked out his dirk and pulled the meat from the fire. He began to carve thick chunks of charred meat off the bone as Tyrion hollowed out two heels of stale bread to serve as trenchers.  If we do reach the river, what will you do then?  the sellsword asked as he cut.   Oh, a whore and a featherbed and a flagon of wine, for a start.  Tyrion held out his trencher, and Bronn filled it with meat.  And then to Casterly Rock or King’s Landing, I think. I have some questions that want answering, concerning a certain dagger.   The sellsword chewed and swallowed.  So you were telling it true? It was not your knife?   Tyrion smiled thinly.  Do I look a liar to you?   By the time their bellies were full, the stars had come out and a halfmoon was rising over the mountains. Tyrion spread his shadowskin cloak on the ground and stretched out with his saddle for a pillow.  Our friends are taking their sweet time.    If I were them, I’d fear a trap,  Bronn said.  Why else would we be so open, if not to lure them in?   Tyrion chuckled.  Then we ought to sing and send them fleeing in terror.  He began to whistle a tune.   You’re mad, dwarf,  Bronn said as he cleaned the grease out from under his nails with his dirk.   Where’s your love of music, Bronn?    If it was music you wanted, you should have gotten the singer to champion you.   Tyrion grinned.  That would have been amusing. I can just see him fending off Ser Vardis with his woodharp.  He resumed his whistling.  Do you know this song?  he asked.   You hear it here and there, in inns and whorehouses.    Myrish. ‘The Seasons of My Love.’ Sweet and sad, if you understand the words. The first girl I ever bedded used to sing it, and I’ve never been able to put it out of my head.  Tyrion gazed up at the sky. It was a clear cold night and the stars shone down upon the mountains as bright and merciless as truth.  I met her on a night like this,  he heard himself saying.  Jaime and I were riding back from Lannisport when we heard a scream, and she came running out into the road with two men dogging her heels, shouting threats. My brother unsheathed his sword and went after them, while I dismounted to protect the girl. She was scarcely a year older than I was, dark-haired, slender, with a face that would break your heart. It certainly broke mine. Lowborn, half-starved, unwashed… yet lovely. They’d torn the rags she was wearing half off her back, so I wrapped her in my cloak while Jaime chased the men into the woods. By the time he came trotting back, I’d gotten a name out of her, and a story. She was a crofter’s child, orphaned when her father died of fever, on her way to… well, nowhere, really.   Jaime was all in a lather to hunt down the men. It was not often outlaws dared prey on travelers so near to Casterly Rock, and he took it as an insult. The girl was too frightened to send off by herself, though, so I offered to take her to the closest inn and feed her while my brother rode back to the Rock for help.   She was hungrier than I would have believed. We finished two whole chickens and part of a third, and drank a flagon of wine, talking. I was only thirteen, and the wine went to my head, I fear. The next thing I knew, I was sharing her bed. If she was shy, I was shyer. I’ll never know where I found the courage. When I broke her maidenhead, she wept, but afterward she kissed me and sang her little song, and by morning I was in love.    You?  Bronn’s voice was amused.   Absurd, isn’t it?  Tyrion began to whistle the song again.  I married her,  he finally admitted.   A Lannister of Casterly Rock wed to a crofter’s daughter,  Bronn said.  How did you manage that?    Oh, you’d be astonished at what a boy can make of a few lies, fifty pieces of silver, and a drunken septon. I dared not bring my bride home to Casterly Rock, so I set her up in a cottage of her own, and for a fortnight we played at being man and wife. And then the septon sobered and confessed all to my lord father.  Tyrion was surprised at how desolate it made him feel to say it, even after all these years. Perhaps he was just tired.  That was the end of my marriage.  He sat up and stared at the dying fire, blinking at the light.   He sent the girl away?    He did better than that,  Tyrion said.  First he made my brother tell me the truth."
}