{
  "id": "c240883ba780124f9a853d12555cdaa84b7a0d34",
  "text": " The blood gushed out in a scarlet fountain, drenching his arms and chest. He found his feet again and lurched to the rail, and then he was fighting, staggering and splashing across crooked decks awash with water. Men came at him. Some he killed, some he wounded, and some went away, but always there were more. He lost his knife and gained a broken spear, he could not have said how. He clutched it and stabbed, shrieking curses. Men ran from him and he ran after them, clambering up over the rail to the next ship and then the next. His two white shadows were always with him; Balon Swann and Mandon Moore, beautiful in their pale plate. Surrounded by a circle of Velaryon spearmen, they fought back to back; they made battle as graceful as a dance.  His own killing was a clumsy thing. He stabbed one man in the kidney when his back was turned, and grabbed another by the leg and upended him into the river. Arrows hissed past his head and clattered off his armor; one lodged between shoulder and breastplate, but he never felt it. A naked man fell from the sky and landed on the deck, body bursting like a melon dropped from a tower. His blood spattered through the slit of Tyrion’s helm. Stones began to plummet down, crashing through the decks and turning men to pulp, until the whole bridge gave a shudder and twisted violently underfoot, knocking him sideways.  Suddenly the river was pouring into his helm. He ripped it off and crawled along the listing deck until the water was only neck deep. A groaning filled the air, like the death cries of some enormous beast, The ship, he had time to think, the ship’s about to tear loose. The broken galleys were ripping apart, the bridge breaking apart. No sooner had he come to that realization than he heard a sudden crack, loud as thunder, the deck lurched beneath him, and he slid back down into the water.  The list was so steep he had to climb back up, hauling himself along a snapped line inch by bloody inch. Out of the corner of his eye, he saw the hulk they’d been tangled with drifting downstream with the current, spinning slowly as men leapt over her side. Some wore Stannis’s flaming heart, some Joffrey’s stag-and-lion, some other badges, but it seemed to make no matter. Fires were burning upstream and down. On one side of him was a raging battle, a great confusion of bright banners waving above a sea of struggling men, shield walls forming and breaking, mounted knights cutting through the press, dust and mud and blood and smoke. On the other side, the Red Keep loomed high on its hill, spitting fire. They were on the wrong sides, though. For a moment Tyrion thought he was going mad, that Stannis and the castle had traded places. How could Stannis cross to the north bank? Belatedly he realized that the deck was turning, and somehow he had gotten spun about, so castle and battle had changed sides. Battle, what battle, if Stannis hasn’t crossed who is he fighting? Tyrion was too tired to make sense of it. His shoulder ached horribly, and when he reached up to rub it he saw the arrow, and remembered. I have to get off this ship. Downstream was nothing but a wall of fire, and if the wreck broke loose the current would take him right into it.  Someone was calling his name faintly through the din of battle. Tyrion tried to shout back.  Here! Here, I’m here, help me!  His voice sounded so thin he could scarcely hear himself. He pulled himself up the slanting deck, and grabbed for the rail. The hull slammed into the next galley over and rebounded so violently he was almost knocked into the water. Where had all his strength gone? It was all he could do to hang on.   MY LORD! TAKE MY HAND! MY LORD TYRION!   There on the deck of the next ship, across a widening gulf of black water, stood Ser Mandon Moore, a hand extended. Yellow and green fire shone against the white of his armor, and his lobstered gauntlet was sticky with blood, but Tyrion reached for it all the same, wishing his arms were longer. It was only at the very last, as their fingers brushed across the gap, that something niggled at him… Ser Mandon was holding out his left hand, why…  Was that why he reeled backward, or did he see the sword after all? He would never know. The point slashed just beneath his eyes, and he felt its cold hard touch and then a blaze of pain. His head spun around as if he’d been slapped. The shock of the cold water was a second slap more jolting than the first. He flailed for something to grab on to, knowing that once he went down he was not like to come back up. Somehow his hand found the splintered end of a broken oar. Clutching it tight as a desperate lover, he shinnied up foot by foot. His eyes were full of water, his mouth was full of blood, and his head throbbed horribly. Gods give me strength to reach the deck… There was nothing else, only the oar, the water, the deck.  Finally he rolled over the side and lay breathless and exhausted, flat on his back. Balls of green and orange flame crackled overhead, leaving streaks between the stars."
}