{
  "id": "c24736bb0606a4692de4a64d93b0c370ea6accbd",
  "text": " \"Look --\"  He took Hermione's copy and ripped off the Spellotape that bound it. The book tried to bite, but Hagrid ran a giant forefinger down its spine, and the book shivered, and then fell open and lay quiet in his hand.  \"Oh, how silly we've all been!\" Malfoy sneered. \"We should have stroked them! why didn't we guess!\"  \"I -- I thought they were funny,\" Hagrid said uncertainly to Hermione.  \"Oh, tremendously funny!\" said Malfoy. \"Really witty, giving us books that try and rip our hands off!\"  \"Shut up, Malfoy,\" said Harry quietly. Hagrid was looking downcast and Harry wanted Hagrid's first lesson to be a success.  \"Righ' then,\" said Hagrid, who seemed to have lost his thread, \"so -- so yeh've got yer books an' -- an' - - now yeh need the Magical Creatures. Yeah. So I'll go an' get 'em. Hang on... \"  He strode away from them into the forest and out of sight.  \"God, this place is going to the dogs,\" said Malfoy loudly. \"That oaf teaching classes, my father'll have a fit when I tell him  \"Shut up, Malfoy,\" Harry repeated.  \"Careful, Potter, there's a dementor behind you  \"Oooooooh!\" squealed Lavender Brown, pointing toward the opposite side of the paddock.  Trotting toward them were a dozen of the most bizarre creatures Harry had ever seen. They had the bodies, hind legs, and tails of horses, but the front legs, wings, and heads of what seemed to be giant eagles, with cruel, steel-colored beaks and large, brilliantly, orange eyes. The talons on their front legs were half a foot long and deadly looking. Each of the beasts had a thick leather collar around its neck, which was attached to a long chain, and the ends of all of these were held in the vast hands of Hagrid, who came jogging into the paddock behind the creatures.  \"Gee up, there!\" he roared, shaking the chains and urging the creatures toward the fence where the class stood. Everyone drew back slightly as Hagrid reached them and tethered the creatures to the fence.  \"Hippogriffs!\" Hagrid roared happily, waving a hand at them. \"Beau'iful, aren' they?\"  Harry could sort of see what Hagrid meant. Once you got over the first shock of seeing something that was, half horse, half bird, you started to appreciate the hippogriffs' gleaming coats, changing smoothly from feather to hair, each of them a different color: stormy gray, bronze, pinkish roan, gleaming chestnut, and inky black.  \"So,\" said Hagrid, rubbing his hands together and beaming around, \"if yeh wan' ter come a bit nearer --\"  No one seemed to want to. Harry, Ron, and Hermione, however, approached the fence cautiously.  \"Now, firs' thing yeh gotta know abou' hippogriffs is, they're proud,\" said Hagrid. \"Easily offended, hippogriffs are. Don't never insult one, 'cause it might be the last thing yeh do.\"  Malfoy, Crabbe, and Goyle weren't listening; they were talking in an undertone and Harry had a nasty feeling they were plotting how best to disrupt the lesson.  \"Yeh always wait fer the hippogriff ter make the firs' move,\" Hagrid continued. \"It's polite, see? Yeh walk toward him, and yeh bow, an' yeh wait. If he bows back, yeh're allowed ter touch him. If he doesn' bow, then get away from him sharpish, 'cause those talons hurt.  \"Right -- who wants ter go first?\"  Most of the class backed farther away in answer. Even Harry, Ron, and Hermione had misgivings. The hippogriffs were tossing their fierce heads and flexing their powerful wings; they didn't seem to like being tethered like this.  \"No one?\" said Hagrid, with a pleading look.  \"I'll do it,\" said Harry.  There was an intake of breath from behind him, and both Lavender and Parvati whispered, \"Oooh, no, Harry, remember your tea leaves!\"  Harry ignored them. He climbed over the paddock fence.  \"Good man, Harry!\" roared Hagrid. \"Right then -- let's see how yeh get on with Buckbeak.\"  He untied one of the chains, pulled the gray hippogriff away from its fellows, and slipped off its leather collar. The class on the other side of the paddock seemed to be holding its breath. Malfoy's eyes were narrowed maliciously.  \"Easy) now, Harry,\" said Hagrid quietly. \"Yeh've got eye contact, now try not ter blink.... Hippogriffs don' trust yeh if yeh blink too much....\"  Harry's eyes immediately began to water, but he didn't shut thern. Buckbeak had turned his great, sharp head and was staring at Harry with one fierce orange eye. \"Tha's it,\" said Hagrid. \"Tha's it, Harry... now, bow.\"  Harry didn't feel much like exposing the back of his neck to Buckbeak, but he did as he was told. He gave a short bow and then looked up.  The hippogriff was still staring haughtily at him. It didn't move.  \"Ah,\" said Hagrid, sounding worried. \"Right -- back away, now, Harry, easy does it  But then, to Harry's enormous surprise, the hippogriff suddenly bent its scaly front knees and sank into what was an unmistakable bow.  \"Well done, Harry!\" said Hagrid, ecstatic. \"Right -- yeh can touch him! Pat his beak, go on!\"  Feeling that a better reward would have been to back away, Harry moved slowly toward the hippogriff and reached out toward it."
}