{
  "id": "c267fb13b0876ffd2735d76d54ac03c42c2c52ef",
  "text": " Not for you. It’s the Black Gate.  Sam plucked at the faded black wool of his sleeve.  Only a man of the Night’s Watch can open it, he said. A Sworn Brother who has said his words.    He said.  Jojen frowned.  This… Coldhands?    That wasn’t his true name,  said Gilly, rocking.  We only called him that, Sam and me. His hands were cold as ice, but he saved us from the dead men, him and his ravens, and he brought us here on his elk.    His elk?  said Bran, wonderstruck.   His elk?  said Meera, startled.   His ravens?  said Jojen.   Hodor?  said Hodor.   Was he green?  Bran wanted to know.  Did he have antlers?   The fat man was confused.  The elk?    Coldhands,  said Bran impatiently.  The green men ride on elks, Old Nan used to say. Sometimes they have antlers too.    He wasn’t a green man. He wore blacks, like a brother of the Watch, but he was pale as a wight, with hands so cold that at first I was afraid. The wights have blue eyes, though, and they don’t have tongues, or they’ve forgotten how to use them.  The fat man turned to Jojen.  He’ll be waiting. We should go. Do you have anything warmer to wear? The Black Gate is cold, and the other side of the Wall is even colder. You—    Why didn’t he come with you?  Meera gestured toward Gilly and her babe.  They came with you, why not him? Why didn’t you bring him through this Black Gate too?    He… he can’t.    Why not?    The Wall. The Wall is more than just ice and stone, he said. There are spells woven into it… old ones, and strong. He cannot pass beyond the Wall.   It grew very quiet in the castle kitchen then. Bran could hear the soft crackle of the flames, the wind stirring the leaves in the night, the creak of the skinny weirwood reaching for the moon. Beyond the gates the monsters live, and the giants and the ghouls, he remembered Old Nan saying, but they cannot pass so long as the Wall stands strong. So go to sleep, my little Brandon, my baby boy. You needn’t fear. There are no monsters here.   I am not the one you were told to bring,  Jojen Reed told fat Sam in his stained and baggy blacks.  He is.    Oh.  Sam looked down at him uncertainly. It might have been just then that he realized Bran was crippled.  I don’t… I’m not strong enough to carry you, I…    Hodor can carry me.  Bran pointed at his basket.  I ride in that, up on his back.   Sam was staring at him.  You’re Jon Snow’s brother. The one who fell…    No,  said Jojen.  That boy is dead.    Don’t tell,  Bran warned.  Please.   Sam looked confused for a moment, but finally he said,  I… I can keep a secret. Gilly too.  When he looked at her, the girl nodded.  Jon… Jon was my brother too. He was the best friend I ever had, but he went off with Qhorin Halfhand to scout the Frostfangs and never came back. We were waiting for him on the Fist when… when…    Jon’s here,  Bran said.  Summer saw him. He was with some wildlings, but they killed a man and Jon took his horse and escaped. I bet he went to Castle Black.   Sam turned big eyes on Meera.  You’re certain it was Jon? You saw him?    I’m Meera,  Meera said with a smile.  Summer is…   A shadow detached itself from the broken dome above and leapt down through the moonlight. Even with his injured leg, the wolf landed as light and quiet as a snowfall. The girl Gilly made a frightened sound and clutched her babe so hard against her that it began to cry again.   He won’t hurt you,  Bran said.  That’s Summer.    Jon said you all had wolves.  Sam pulled off a glove.  I know Ghost.  He held out a shaky hand, the fingers white and soft and fat as little sausages. Summer padded closer, sniffed them, and gave the hand a lick.  That was when Bran made up his mind.  We’ll go with you.    All of you?  Sam seemed surprised by that.  Meera ruffled Bran’s hair.  He’s our prince.   Summer circled the well, sniffing. He paused by the top step and looked back at Bran. He wants to go.   Will Gilly be safe if I leave her here till I come back?  Sam asked them.   She should be,  said Meera.  She’s welcome to our fire.   Jojen said,  The castle is empty.   Gilly looked around.  Craster used to tell us tales of castles, but I never knew they’d be so big.   It’s only the kitchens. Bran wondered what she’d think when she saw Winterfell, if she ever did.  It took them a few minutes to gather their things and hoist Bran into his wicker seat on Hodor’s back. By the time they were ready to go, Gilly sat nursing her babe by the fire.  You’ll come back for me,  she said to Sam.   As soon as I can,  he promised,  then we’ll go somewhere warm.  When he heard that, part of Bran wondered what he was doing. Will I ever go someplace warm again?   I’ll go first, I know the way.  Sam hesitated at the top.  There’s just so many steps,  he sighed, before he started down. Jojen followed, then Summer, then Hodor with Bran riding on his back. Meera took the rear, with her spear and net in hand.  It was a long way down. The top of the well was bathed in moonlight, but it grew smaller and dimmer every time they went around."
}