{
  "id": "c2b42416d7096b2799403eb31fc8b59af5f30c94",
  "text": "       He it was that now rode out, and with him came only a small company  of  black-harnessed soldiery, a nd a  single  banner, black but  bearing on it in  red the Evil Eye. Now halting a few paces before the Captains of the West he  looked them up and down and laughed.       'Is  there  anyone in this rout  with authority to treat  with me?'  he  asked. 'Or indeed with wit to  understand me? Not thou at least!' he mocked,  turning to Aragorn with scorn. 'It needs more to make a king than a piece of  elvish glass, or a rabble  such as this. Why, any brigand  of the  hills can  show as good a following!'       Aragorn said naught in answer, but he took the other's eye and held it,  and for a moment they strove thus; but soon, though Aragorn did not stir nor   move hand to weapon, the other  quailed and  gave back as if menaced with  a   blow. 'I am a herald and ambassador, a nd may not be assailed!' he cried.       'Where such  laws hold,'  said  Gandalf, 'it is  also  the  custom  for   ambassadors to use less insolence. But  no one  has threatened you. You have  naught to fear  from us,  until your errand is done. But unless  your master   has  come  to new  wisdom, then with all  his servants  you will be in great  peril.'       'So!' said the  Messenger. 'Then thou art the spokesman, old greybeard?   Have we not  heard of  thee at whiles, and  of thy wanderings, ever hatching  plots a nd mischief at a safe distance? But this time thou hast stuck out thy  nose too far, Master Gandalf; and thou shalt see what comes to him  who sets  his foolish webs before  the feet of Sauron the Great. I have  tokens that I  was bidden  to show to thee -  to thee in especial, if thou shouldst dare to  come.' He signed to  one of his guards, and he came forward bearing a bundle  swathed in black cloths.        The Messenger put  these  aside, and there to the wonder and  dismay of   ####-all the Captains he held up first the short sword that Sam had carried,  and  next a grey  cloak with  an elven-brooch,  and last the coat of mithril-mail  that  Frodo  had  worn  wrapped  in  his tattered garments. A blackness came   before their eyes,  and it seemed  to  them in a moment of  silence that the  world  stood  still,  but their  hearts were dead and their last  hope gone.  Pippin who stood behind Prince Imrahil sprang forward with a cry of grief.        'Silence!' said Gandalf sternly, thrusting him back;  but the Messenger   laughed aloud.       'So you  have yet another of these imps  with you!' he cried. 'What use  you  find in them I cannot guess; but to send them as  spies into Mordor  is  beyond even your  accustomed folly. Still, I thank him, for it is plain that  this brat  at  least has seen these tokens  before, and it would be vain for  you to deny them now.'       'I do not wish to  deny  them,' said Gandalf. 'Indeed, I know them  all  and all  their history,  and despite your scorn,  foul Mouth of  Sauron, you   cannot say as much. But why do you bring them here?'       'Dwarf-coat,  elf-cloak, blade of the downfallen West, and spy from the  little rat-land  of the Shire-nay; do not  start! We know it well - here are  the marks  of a  conspiracy. Now,  maybe  he that bore  these  things was  a   creature that you would not grieve to lose, and maybe otherwise: one dear to   you, perhaps? If so, take swift counsel with what little wit is left to you.  For  Sauron does not love  spies, and what his fate  shall be depends now on  your choice.'       No one answered him;  but he  saw their faces  grey with  fear and  the  horror  in their eyes, and he laughed again, for it  seemed to him  that his  sport went well. 'Good, good!' he  said. 'He was dear to you, I see. Or else  his  errand was one that you did not wish to fail? It  has. And now he shall  endure the slow torment of years, as long and  slow as our arts in the Great  Tower can contrive, and never  be released,  unless maybe when he is changed  and  broken,  so  that  he may come  to you, and you  shall see what you have   done. This shall surely be-unless you accept my Lord's terms.'       'Name  the  terms,'  said Gandalf steadily,  but  those nearby  saw the  anguish in  his  face,  and now he  seemed an  old and wizened man, crushed,  defeated at la st. They did not doubt that he would accept.       'These are the terms,' said the  Messenger, and smiled as he eyed  them  one by one. 'The rabble of  Gondor and  its deluded allies shall withdraw at  once beyond the Anduin, first taking oaths never  again to assail Sauron the   ####-Great  in arms, open or  secret. All lands east of Anduin  shall be Sauron's  for  ever, solely. West of the Anduin as  far as the Misty Mountains and the  Gap of Rohan  shall  be tributary to  Mordor,  and men  there  shall bear no  weapons, but shall  have leave to govern  their own affairs. But  they shall  help  to rebuild Isengard which they have wantonly destroyed, and that shall  be Sauron's, and there his lieutenant shall dwell: not Saruman, but one more  worthy of trust."
}