{
  "id": "c2ca3d9ba4da03ff93da4ca1867077d8e62dc342",
  "text": " Jory brought out his horse. Young Wyl came right behind him, leading Littlefinger’s mare with one hand while the other fumbled with his belt and the lacings of his trousers. A barefoot whore leaned out of the stable door, giggling at him.   Will we be going back to the castle now, my lord?  Jory asked. Ned nodded and swung into the saddle. Littlefinger mounted up beside him. Jory and the others followed.   Chataya runs a choice establishment,  Littlefinger said as they rode.  I’ve half a mind to buy it. Brothels are a much sounder investment than ships, I’ve found. Whores seldom sink, and when they are boarded by pirates, why, the pirates pay good coin like everyone else.  Lord Petyr chuckled at his own wit.  Ned let him prattle on. After a time, he quieted and they rode in silence. The streets of King’s Landing were dark and deserted. The rain had driven everyone under their roofs. It beat down on Ned’s head, warm as blood and relentless as old guilts. Fat drops of water ran down his face.   Robert will never keep to one bed,  Lyanna had told him at Winterfell, on the night long ago when their father had promised her hand to the young Lord of Storm’s End.  I hear he has gotten a child on some girl in the Vale.  Ned had held the babe in his arms; he could scarcely deny her, nor would he lie to his sister, but he had assured her that what Robert did before their betrothal was of no matter, that he was a good man and true who would love her with all his heart. Lyanna had only smiled.  Love is sweet, dearest Ned, but it cannot change a man’s nature.   The girl had been so young Ned had not dared to ask her age. No doubt she’d been a virgin; the better brothels could always find a virgin, if the purse was fat enough. She had light red hair and a powdering of freckles across the bridge of her nose, and when she slipped free a breast to give her nipple to the babe, he saw that her bosom was freckled as well.  I named her Barra,  she said as the child nursed.  She looks so like him, does she not, milord? She has his nose, and his hair…    She does.  Eddard Stark had touched the baby’s fine, dark hair. It flowed through his fingers like black silk. Robert’s firstborn had had the same fine hair, he seemed to recall.   Tell him that when you see him, milord, as it… as it please you. Tell him how beautiful she is.    I will,  Ned had promised her. That was his curse. Robert would swear undying love and forget them before evenfall, but Ned Stark kept his vows. He thought of the promises he’d made Lyanna as she lay dying, and the price he’d paid to keep them.   And tell him I’ve not been with no one else. I swear it, milord, by the old gods and new. Chataya said I could have half a year, for the baby, and for hoping he’d come back. So you’ll tell him I’m waiting, won’t you? I don’t want no jewels or nothing, just him. He was always good to me, truly.   Good to you, Ned thought hollowly.  I will tell him, child, and I promise you, Barra shall not go wanting.   She had smiled then, a smile so tremulous and sweet that it cut the heart out of him. Riding through the rainy night, Ned saw Jon Snow’s face in front of him, so like a younger version of his own. If the gods frowned so on bastards, he thought dully, why did they fill men with such lusts?  Lord Baelish, what do you know of Robert’s bastards?    Well, he has more than you, for a start.    How many?   Littlefinger shrugged. Rivulets of moisture twisted down the back of his cloak.  Does it matter? If you bed enough women, some will give you presents, and His Grace has never been shy on that count. I know he’s acknowledged that boy at Storm’s End, the one he fathered the night Lord Stannis wed. He could hardly do otherwise. The mother was a Florent, niece to the Lady Selyse, one of her bedmaids. Renly says that Robert carried the girl upstairs during the feast, and broke in the wedding bed while Stannis and his bride were still dancing. Lord Stannis seemed to think that was a blot on the honor of his wife’s House, so when the boy was born, he shipped him off to Renly.  He gave Ned a sideways glance.  I’ve also heard whispers that Robert got a pair of twins on a serving wench at Casterly Rock, three years ago when he went west for Lord Tywin’s tourney. Cersei had the babes killed, and sold the mother to a passing slaver. Too much an affront to Lannister pride, that close to home.   Ned Stark grimaced. Ugly tales like that were told of every great lord in the realm. He could believe it of Cersei Lannister readily enough… but would the king stand by and let it happen? The Robert he had known would not have, but the Robert he had known had never been so practiced at shutting his eyes to things he did not wish to see.  Why would Jon Arryn take a sudden interest in the king’s baseborn children?   The short man gave a sodden shrug.  He was the King’s Hand. Doubtless Robert asked him to see that they were provided for.   Ned was soaked through to the bone, and his soul had grown cold."
}