{
  "id": "c347595f946c4d1327d7481e63a8a035d4c36951",
  "text": "   Stubborn child. You will be lost, and never found.   She walked away from him, to the door on the right.   No,  Pyat screeched.  No, to me, come to me, to meeeeeee.  His face crumbled inward, changing to something pale and wormlike.  Dany left him behind, entering a stairwell. She began to climb. Before long her legs were aching. She recalled that the House of the Undying Ones had seemed to have no towers.  Finally the stair opened. To her right, a set of wide wooden doors had been thrown open. They were fashioned of ebony and weirwood, the black and white grains swirling and twisting in strange interwoven patterns. They were very beautiful, yet somehow frightening. The blood of the dragon must not be afraid. Dany said a quick prayer, begging the Warrior for courage and the Dothraki horse god for strength. She made herself walk forward.  Beyond the doors was a great hall and a splendor of wizards. Some wore sumptuous robes of ermine, ruby velvet, and cloth of gold. Others fancied elaborate armor studded with gemstones, or tall pointed hats speckled with stars. There were women among them, dressed in gowns of surpassing loveliness. Shafts of sunlight slanted through windows of stained glass, and the air was alive with the most beautiful music she had ever heard.  A kingly man in rich robes rose when he saw her, and smiled.  Daenerys of House Targaryen, be welcome. Come and share the food of forever. We are the Undying of Qarth.    Long have we awaited you,  said a woman beside him, clad in rose and silver. The breast she had left bare in the Qartheen fashion was as perfect as a breast could be.   We knew you were to come to us,  the wizard king said.  A thousand years ago we knew, and have been waiting all this time. We sent the comet to show you the way.    We have knowledge to share with you,  said a warrior in shining emerald armor,  and magic weapons to arm you with. You have passed every trial. Now come and sit with us, and all your questions shall be answered.   She took a step forward. But then Drogon leapt from her shoulder. He flew to the top of the ebony-and-weirwood door, perched there, and began to bite at the carved wood.   A willful beast,  laughed a handsome young man.  Shall we teach you the secret speech of dragonkind? Come, come.   Doubt seized her. The great door was so heavy it took all of Dany’s strength to budge it, but finally it began to move. Behind was another door, hidden. It was old grey wood, splintery and plain… but it stood to the right of the door through which she’d entered. The wizards were beckoning her with voices sweeter than song. She ran from them, Drogon flying back down to her. Through the narrow door she passed, into a chamber awash in gloom.  A long stone table filled this room. Above it floated a human heart, swollen and blue with corruption, yet still alive. It beat, a deep ponderous throb of sound, and each pulse sent out a wash of indigo light. The figures around the table were no more than blue shadows. As Dany walked to the empty chair at the foot of the table, they did not stir, nor speak, nor turn to face her. There was no sound but the slow, deep beat of the rotting heart.  …mother of dragons… came a voice, part whisper and part moan… dragons… dragons… dragons… other voices echoed in the gloom. Some were male and some female. One spoke with the timbre of a child. The floating heart pulsed from dimness to darkness. It was hard to summon the will to speak, to recall the words she had practiced so assiduously.  I am Daenerys Stormborn of House Targaryen, Queen of the Seven Kingdoms of Westeros.  Do they hear me? Why don’t they move? She sat, folding her hands in her lap.  Grant me your counsel, and speak to me with the wisdom of those who have conquered death.   Through the indigo murk, she could make out the wizened features of the Undying One to her right, an old old man, wrinkled and hairless. His flesh was a ripe violet-blue, his lips and nails bluer still, so dark they were almost black. Even the whites of his eyes were blue. They stared unseeing at the ancient woman on the opposite side of the table, whose gown of pale silk had rotted on her body. One withered breast was left bare in the Qartheen manner, to show a pointed blue nipple hard as leather.  She is not breathing. Dany listened to the silence. None of them are breathing, and they do not move, and those eyes see nothing. Could it be that the Undying Ones were dead?  Her answer was a whisper as thin as a mouse’s whisker… we live… live… live… it sounded. Myriad other voices whispered echoes… And know… know… know… know…   I have come for the gift of truth,  Dany said.  In the long hall, the things I saw… were they true visions, or lies? Past things, or things to come? What did they mean?   …the shape of shadows… morrows not yet made… drink from the cup of ice… drink from the cup of fire…  …mother of dragons… child of three…   Three?  She did not understand.  …three heads has the dragon… the ghost chorus yarnmered inside her skull with never a lip moving, never a breath stirring the still blue air… mother of dragons… child of storm… The whispers became a swirling song… three fires must you light… one for life and one for death and one to love… Her own heart was beating in unison to the one that floated before her, blue and corrupt… three mounts must you ride… one to bed and one to dread and one to love… The voices were growing louder, she realized, and it seemed her heart was slowing, and even her breath… three treasons will you know… once for blood and once for gold and once for love…   I don’t…  Her voice was no more than a whisper, almost as faint as theirs."
}