{
  "id": "c36164175cf982c85767ed8200a505a05e455315",
  "text": " He did not like his sister’s smile.  Yes, and just now my worm is thinking that perhaps it is time I took my leave.    Are you unwell, brother?  She leaned forward, giving him a good look at the top of her breasts.  Suddenly you appear somewhat flustered.    Flustered?  Tyrion glanced at the door. He thought he’d heard something outside. He was beginning to regret coming here alone.  You’ve never shown much interest in my cock before.    It’s not your cock that interests me, so much as what you stick it in. I don’t depend on the eunuch for everything, as you do. I have my own ways of finding out things… especially things that people don’t want me to know.    What are you trying to say?    Only this—I have your little whore.   Tyrion reached for his wine cup, buying a moment to gather his thoughts.  I thought men were more to your taste.    You’re such a droll little fellow. Tell me, have you married this one yet?  When he gave her no answer she laughed and said,  Father will be ever so relieved.   His belly felt as if it were full of eels. How had she found Shae? Had Varys betrayed him? Or had all his precautions been undone by his impatience the night he rode directly to the manse?  Why should you care who I choose to warm my bed?    A Lannister always pays his debts,  she said.  You’ve been scheming against me since the day you came to King’s Landing. You sold Myrcella, stole Tommen, and now you plot to have Joff killed. You want him dead so you can rule through Tommen.   Well, I can’t say the notion isn’t tempting.  This is madness, Cersei. Stannis will be here in days. You need me.    For what? Your great prowess in battle?    Bronn’s sellswords will never fight without me,  he lied.   Oh, I think they will. It’s your gold they love, not your impish wit. Have no fear, though, they won’t be without you. I won’t say I haven’t thought of slitting your throat from time to time, but Jaime would never forgive me if I did.    And the whore?  He would not call her by name. If I can convince her Shae means nothing to me, perhaps…   She’ll be treated gently enough, so long as no harm comes to my sons. If Joff should be killed, however, or if Tommen should fall into the hands of our enemies, your little cunt will die more painfully than you can possibly imagine.   She truly believes I mean to kill my own nephew.  The boys are safe,  he promised her wearily.  Gods be good, Cersei, they’re my own blood! What sort of man do you take me for?    A small and twisted one.   Tyrion stared at the dregs on the bottom of his wine cup. What would Jaime do in my place? Kill the bitch, most likely, and worry about the consequences afterward. But Tyrion did not have a golden sword, nor the skill to wield one. He loved his brother’s reckless wrath, but it was their lord father he must try and emulate. Stone, I must be stone, I must be Casterly Rock, hard and unmovable. If I fail this test, I had as lief seek out the nearest grotesquerie.  For all I know, you’ve killed her already,  he said.   Would you like to see her? I thought you might.  Cersei crossed the room and threw open the heavy oaken door.  Bring in my brother’s whore.   Ser Osmund’s brothers Osney and Osfryd were peas from the same pod, tall men with hooked noses, dark hair, and cruel smiles. She hung between them, eyes wide and white in her dark face. Blood trickled from her broken lip, and he could see bruises through her torn clothing. Her hands were bound with rope, and they’d gagged her so she could not speak.   You said she wouldn’t be hurt.    She fought.  Unlike his brothers, Osney Kettleblack was clean-shaven, so the scratches showed plainly on his bare cheeks.  Got claws like a shadowcat, this one.    Bruises heal,  said Cersei in a bored tone.  The whore will live. So long as Joff does.   Tyrion wanted to laugh at her. It would have been so sweet, so very very sweet, but it would have given the game away. You’ve lost, Cersei, and the Kettleblacks are even bigger fools than Bronn claimed. All he needed to do was say the words.  Instead he looked at the girl’s face and said,  You swear you’ll release her after the battle?    If you release Tommen, yes.   He pushed himself to his feet.  Keep her then, but keep her safe. If these animals think they can use her… well, sweet sister, let me point out that a scale tips two ways.  His tone was calm, flat, uncaring; he’d reached for his father’s voice, and found it.  Whatever happens to her happens to Tommen as well, and that includes the beatings and rapes.  If she thinks me such a monster, I’ll play the part for her.  Cersei had not expected that.  You would not dare.   Tyrion made himself smile, slow and cold. Green and black, his eyes laughed at her.  Dare? I’ll do it myself.   His sister’s hand flashed at his face, but he caught her wrist and bent it back until she cried out. Osfryd moved to her rescue.  One more step and I’ll break her arm,  the dwarf warned him. The man stopped.  You remember when I said you’d never hit me again, Cersei?  He shoved her to the floor and turned back to the Kettleblacks."
}