{
  "id": "c38289597992504e910ce140f7c2dac35888b714",
  "text": " Harry got a shock the first time he looked in the mirror over the kitchen mantelpiece and it shouted, \"Tuck your shirt in, scruffy!\" The ghoul in the attic howled and dropped pipes whenever he felt things were getting too quiet, and small explosions from Fred and George's bedroom were considered perfectly normal. What Harry found most unusual about life at Ron's, however, wasn't the talking mirror or the clanking ghoul: It was the fact that everybody there seemed to like him.  Mrs. Weasley fussed over the state of his socks and tried to force him to eat fourth helpings at every meal. Mr. Weasley liked Harry to sit next to him at the dinner table so that he could bombard him with questions about life with Muggles, asking him to explain how things like plugs and the postal service worked.  42    \"Fascinating.\" he would say as Harry talked him through using a telephone. \"Ingenious, really, how many ways Muggles have found of getting along without magic.\"  Harry heard from Hogwarts one sunny morning about a week after he had arrived at the Burrow. He and Ron went down to breakfast to find Mr. and Mrs. Weasley and Ginny already sitting at the kitchen table. The moment she saw Harry, Ginny accidentally knocked her porridge bowl to the floor with a loud clatter. Ginny seemed very prone to knocking things over whenever Harry entered a room. She dived under the table to retrieve the bowl and emerged with her face glowing like the setting sun. Pretending he hadn't noticed this, Harry sat down and took the toast Mrs. Weasley offered him.  \"Letters from school,\" said Mr. Weasley, passing Harry and Ron identical envelopes of yellowish parchment, addressed in green ink. \"Dumbledore already knows you're here, Harry - doesn't miss a trick, that man. You two've got them, too,\" he added, as Fred and George ambled in, still in their pajamas.  For a few minutes there was silence as they all read their letters. Harry's told him to catch the Hogwarts Express as usual from King's Cross station on September first. There was also a list of the new books he'd need for the coming year.  SECOND-YEAR STUDENTS WILL REQUIRE:  The Standard Book of Spells, Grade 2  by Miranda Goshawk  Break with a Banshee by Gilderoy Lockhart Gadding with Ghouls by Gilderoy Lockhart Holidays with Hags by Gilderoy Lockhart  4 \",3  Travels with Trolls by Gilderoy Lockhart Voyages with Vampires by Gilderoy Lockhart Wanderings with Werewolves by Gilderoy Lockhart Year with the Yeti by Gilderoy Lockhart  Fred, who had finished his own list, peered over at Harry's.  \"You've been told to get all Lockhart's books, too!\" he said. \"The new Defense Against the Dark Arts teacher must be a fan - bet it's a witch.\"  At this point, Fred caught his mother's eye and quickly busied himself with the marmalade.  \"That lot won't come cheap,\" said George, with a quick look at his parents. \"Lockhart's books are really expensive ......  \"Well, we'll manage,\" said Mrs. Weasley, but she looked worried. \"I expect we'll be able to pick up a lot of Ginny's things secondhand.\"  \"Oh, are you starting at Hogwarts this year?\" Harry asked Ginny.  She nodded, blushing to the roots of her flaming hair, and put her elbow in the butter dish. Fortunately no one saw this except Harry, because just then Ron's elder brother Percy walked in. He was already dressed, his Hogwarts prefect badge pinned to his sweater vest.  \"Morning, all,\" said Percy briskly. \"Lovely day.\"  He sat down in the only remaining chair but leapt up again almost immediately, pulling from underneath him a moulting, gray feather duster - at least, that was what Harry thought it was, until he saw that it was breathing.  * 44  \"Errol!\" said Ron, taking the limp owl from Percy and extracting a letter from under its wing. \"Finally - he's got Hermione's answer. I wrote to her saying we were going to try and rescue you from the Dursleys.\"  He carried Errol to a perch just inside the back door and tried to stand him on it, but Errol flopped straight off again so Ron lay him on the draining board instead, muttering, \"Pathetic.\" Then he ripped open Hermione's letter and read it out loud:  \"`Dear Ron, and Harry if you're there,   \"`I hope everything went all right and that Harry is okay and that you didn't do anything illegal to get him out, Ron, because that would get Harry into trouble, too. I've been really worried and if Harry is all right, will you please let me know at once, but perhaps it would be bet ter if you used a different owl because I think another delivery might finish your one off.  \"'I'm very busy with schoolwork, of course'- How can she be?\" said Ron in horror. \"We're on vacation! - 'and we're going to London next Wednesday to buy my new books. Why don't we meet in Diago n Alley?  \"`Let me know what's happening as soon as you can. Love from Hermione. \"'  \"Well, that fits in nicely, we can go and get all your things then, too,\" said Mrs. Weasley, starting to clear the table. \"What're you all up to today?\"  Harry, Ron, Fred, and George were planning to go up the hill to a small paddock the Weasleys owned."
}