{
  "id": "c392ca8ce20be581b40a00aee3348b90d53db178",
  "text": ".. and Fred and George had been using it for years without anything horrible happening....  Harry traced the secret passage to Honeydukes with his finger.  Then, quite suddenly, as though following orders, he rolled up the map, stuffed it inside his robes, and hurried to the door of the classroom. He opened it a couple of inches. There was no one outside. Very carefully, he edged out of the room and behind the statue of the one-eyed witch.  What did he have to do? He pulled out the map again and saw to his astonishment, that a new ink figure had appeared upon it, labeled Harry Potter. This figure was standing exactly where the real Harry was standing, about halfway down the third-floor corridor.  Harry watched carefully. His little Ink self appeared to be tapping the witch with his minute wand. Harry quickly took out his real wand and tapped the statue. Nothing happened. He looked back at the map. The tiniest speech bubble had appeared next to his figure. The word inside said, \"Dissendium.\"  \"Dissendium!\" Harry whispered, tapping the stone witch again.  At once, the statue's hump opened wide enough to admit a fairly thin person. Harry glanced quickly up and down the corridor, then tucked the map away again, hoisted himself into the hole headfirst, and pushed himself forward.  He slid a considerable way down what felt like a stone slide, then landed on cold, damp earth. He stood up, looking around. It was  pitch dark. He held up his wand, muttered, \"Lumos! \" and saw that he was in a very narrow, low, earthy passageway. He raised the map, tapped it with the tip of his wand, and muttered, \"Mischief managed!\" The map went blank at once. He folded it carefully, tucked it inside his robes, then, heart beating fast, both excited and apprehensive, he set off.  The passage twisted and turned, more like the burrow of a giant rabbit than anything else. Harry hurried along it, stumbling now and then on the uneven floor, holding his wand out in front of him.  It took ages, but Harry had the thought of Honeydukes to sustain him. After what felt like an hour, the passage began to rise. Panting, Harry sped up, his face hot, his feet very cold.  Ten minutes later, he came to the foot of some worn stone steps, which rose out of sight above him. Careful not to make any noise, Harry began to climb. A hundred steps, two hundred steps, he lost count as he climbed, watching his feet.... Then, without warning, his head hit something hard.  It seemed to be a trapdoor. Harry stood there, massaging the top of his head, listening. He couldn't hear any sounds above him. Very slowly, he pushed the trapdoor open and peered over the edge.  He was in a cellar, which was full of wooden crates and boxes. Harry climbed out of the trapdoor and replaced it -- it blended so perfectly with the dusty floor that it was impossible to tell it was there. Harry crept slowly toward the wooden staircase that led upstairs. Now he could definitely hear voices, not to mention the tinkle of a bell and the opening and shutting of a door.  Wondering what he ought to do, he suddenly heard a door open much closer at hand; somebody was about to come downstairs.  \"And get another box of Jelly Slugs, dear, they've nearly cleaned us out --\" said a woman's voice.  A pair of feet was coming down the staircase. Harry leapt behind an enormous crate and waited for the footsteps to pass. He heard the man shifting boxes against the opposite wall. He might not get another chance --  Quickly and silently, Harry dodged out from his hiding place and climbed the stairs; looking back, he saw an enormous backside and shiny bald head, buried in a box. Harry reached the door at the top of the stairs, slipped through it, and found himself behind the counter of Honeydukes -- he ducked, crept sideways, and then straightened up.  Honeydukes was so crowded with Hogwarts students that no one looked twice at Harry. He edged among them, looking around, and suppressed a laugh as he imagined the look that would spread over Dudley's piggy face if he could see where Harry was now.  There were shelves upon shelves of the most succulent-looking sweets imaginable. Creamy chunks of nougat, shimmering pink squares of coconut ice, fat, honey-colored toffees; hundreds of different kinds of chocolate in neat rows; there was a large barrel of Every Flavor Beans, and another of Fizzing Whizbees, the levitating sherbert balls that Ron had mentioned; along yet another wall were \"Special Effects\" -- sweets: Droobles Best Blowing Gum (which filled a room with bluebell-colored bubbles that refused to pop for days), the strange, splintery Toothflossing Stringmints, tiny black Pepper Imps (\"breathe fire for your friends!\"), Ice Mice (\"hear your teeth chatter and squeak!\"), peppermint creams shaped like toads (\"hop realistically in the stomach!\"), fragile sugar-spun quills, and exploding bonbons.  Harry squeezed himself through a crowd of sixth years and saw a sign hanging in the farthest corner of the shop (UNUSUAL TASTES)."
}