{
  "id": "c3d3fd8687f87c1461d68c94f86e16cffc8fd716",
  "text": " Yet first, if I may be so bold, there is the matter of the second half of the payment we agreed upon. And of course the extra silver you were so kind as to promise. Sixty stags, I believe it was.    For the oarmen,  Catelyn reminded him.   Oh, of a certainty,  said Moreo.  Though perhaps I should hold it for them until we return to Tyrosh. For the sake of their wives and children. If you give them the silver here, my lady, they will dice it away or spend it all for a night’s pleasure.    There are worse things to spend money on,  Ser Rodrik put in.  Winter is coming.    A man must make his own choices,  Catelyn said.  They earned the silver. How they spend it is no concern of mine.    As you say, my lady,  Moreo replied, bowing and smiling.  Just to be sure, Catelyn paid the oarmen herself, a stag to each man, and a copper to the two men who carried their chests halfway up Visenya’s hill to the inn that Moreo had suggested. It was a rambling old place on Eel Alley. The woman who owned it was a sour crone with a wandering eye who looked them over suspiciously and bit the coin that Catelyn offered her to make sure it was real. Her rooms were large and airy, though, and Moreo swore that her fish stew was the most savory in all the Seven Kingdoms. Best of all, she had no interest in their names.   I think it best if you stay away from the common room,  Ser Rodrik said, after they had settled in.  Even in a place like this, one never knows who may be watching.  He wore ringmail, dagger, and longsword under a dark cloak with a hood he could pull up over his head.  I will be back before nightfall, with Ser Aron,  he promised.  Rest now, my lady.   Catelyn was tired. The voyage had been long and fatiguing, and she was no longer as young as she had been. Her windows opened on the alley and rooftops, with a view of the Blackwater beyond. She watched Ser Rodrik set off, striding briskly through the busy streets until he was lost in the crowds, then decided to take his advice. The bedding was stuffed with straw instead of feathers, but she had no trouble falling asleep.  She woke to a pounding on her door.  Catelyn sat up sharply. Outside the window, the rooftops of King’s Landing were red in the light of the setting sun. She had slept longer than she intended. A fist hammered at her door again, and a voice called out,  Open, in the name of the king.    A moment,  she called out. She wrapped herself in her cloak. The dagger was on the bedside table. She snatched it up before she unlatched the heavy wooden door.  The men who pushed into the room wore the black ringmail and golden cloaks of the City Watch. Their leader smiled at the dagger in her hand and said,  No need for that, m’lady. We’re to escort you to the castle.    By whose authority?  she said.  He showed her a ribbon. Catelyn felt her breath catch in her throat. The seal was a mockingbird, in grey wax.  Petyr,  she said. So soon. Something must have happened to Ser Rodrik. She looked at the head guardsman.  Do you know who I am?    No, m’lady,  he said.  M’lord Littlefinger said only to bring you to him, and see that you were not mistreated.   Catelyn nodded.  You may wait outside while I dress.   She bathed her hands in the basin and wrapped them in clean linen. Her fingers were thick and awkward as she struggled to lace up her bodice and knot a drab brown cloak about her neck. How could Littlefinger have known she was here? Ser Rodrik would never have told him. Old he might be, but he was stubborn, and loyal to a fault. Were they too late, had the Lannisters reached King’s Landing before her? No, if that were true, Ned would be here too, and surely he would have come to her. How…?  Then she thought, Moreo. The Tyroshi knew who they were and where they were, damn him. She hoped he’d gotten a good price for the information.  They had brought a horse for her. The lamps were being lit along the streets as they set out, and Catelyn felt the eyes of the city on her as she rode, surrounded by the guard in their golden cloaks. When they reached the Red Keep, the portcullis was down and the great gates sealed for the night, but the castle windows were alive with flickering lights. The guardsmen left their mounts outside the walls and escorted her through a narrow postern door, then up endless steps to a tower.  He was alone in the room, seated at a heavy wooden table, an oil lamp beside him as he wrote. When they ushered her inside, he set down his pen and looked at her.  Cat,  he said quietly.   Why have I been brought here in this fashion?   He rose and gestured brusquely to the guards.  Leave us.  The men departed.  You were not mistreated, I trust,  he said after they had gone.  I gave firm instructions.  He noticed her bandages.  Your hands…   Catelyn ignored the implied question.  I am not accustomed to being summoned like a serving wench,  she said icily.  As a boy, you still knew the meaning of courtesy.    I’ve angered you, my lady. That was never my intent."
}