{
  "id": "c3d5b82040ee4e7c6622d22151a3fafafa9f56b7",
  "text": " A fat man always sits comfortably, I am thinking, for he takes his pillow with him wherever he goes.    How is it you come by a Pentoshi ship?  asked Davos.  Have you gone pirate again, my lord?  He set his empty cup aside.   Vile calumny. Who has suffered more from pirates than Salladhor Saan? I ask only what is due me. Much gold is owed, oh yes, but I am not without reason, so in place of coin I have taken a handsome parchment, very crisp. It bears the name and seal of Lord Alester Florent, the Hand of the King. I am made Lord of Blackwater Bay, and no vessel may be crossing my lordly waters without my lordly leave, no. And when these outlaws are trying to steal past me in the night to avoid my lawful duties and customs, why, they are no better than smugglers, so I am well within my rights to seize them.  The old pirate laughed.  I cut off no man’s fingers, though. What good are bits of fingers? The ships I am taking, the cargoes, a few ransoms, nothing unreasonable.  He gave Davos a sharp look.  You are unwell, my friend. That cough… and so thin, I am seeing your bones through your skin. And yet I am not seeing your little bag of fingerbones…   Old habit made Davos reach for the leather pouch that was no longer there.  I lost it in the river.  My luck.   The river was terrible,  Salladhor Saan said solemnly.  Even from the bay, I was seeing, and shuddering.   Davos coughed, spat, and coughed again.  I saw Black Betha burning, and Fury as well,  he finally managed, hoarsely.  Did none of our ships escape the fire?  Part of him still hoped.   Lord Steffon, Ragged Jenna, Swift Sword, Laughing Lord, and some others were upstream of the pyromancers’pissing, yes. They did not burn, but with the chain raised, neither could they be flying. Some few were surrendering. Most rowed far up the Blackwater, away from the battling, and then were sunk by their crews so they would not be falling into Lannister hands. Ragged Jenna and Laughing Lord are still playing pirate on the river, I have heard, but who can say if it is so?    Lady Marya?  Davos asked.  Wraith?   Salladhor Saan put a hand on Davos’s forearm and gave a squeeze.  No. Of them, no. I am sorry, my friend. They were good men, your Dale and Allard. But this comfort I can give you—your young Devan was among those we took off at the end. The brave boy never once left the king’s side, or so they say.   For a moment he felt almost dizzy, his relief was so palpable. He had been afraid to ask about Devan.  The Mother is merciful. I must go to him, Salla. I must see him.    Yes,  said Salladhor Saan.  And you will be wanting to sail to Cape Wrath, I know, to see your wife and your two little ones. You must be having a new ship, I am thinking.    His Grace will give me a ship,  said Davos.  The Lyseni shook his head.  Of ships, His Grace has none, and Salladhor Saan has many. The king’s ships burned up on the river, but not mine. You shall have one, old friend. You will sail for me, yes? You will dance into Braavos and Myr and Volantis in the black of night, all unseen, and dance out again with silks and spices. We will be having fat purses, yes.    You are kind, Salla, but my duty’s to my king, not your purse. The war will go on. Stannis is still the rightful heir by all the laws of the Seven Kingdoms.    All the laws are not helping when all the ships burn up, I am thinking. And your king, well, you will be finding him changed, I am fearing. Since the battle, he sees no one, but broods in his Stone Drum. Queen Selyse keeps court for him with her uncle the Lord Alester, who is naming himself the Hand. The king’s seal she has given to this uncle, to fix to the letters he writes, even to my pretty parchment. But it is a little kingdom they are ruling, poor and rocky, yes. There is no gold, not even a little bit to pay faithful Salladhor Saan what is owed him, and only those knights that we took off at the end, and no ships but my little brave few.   A sudden racking cough bent Davos over. Salladhor Saan moved to help him, but he waved him off, and after a moment he recovered.  No one?  he wheezed.  What do you mean, he sees no one?  His voice sounded wet and thick, even in his own ears, and for a moment the cabin swam dizzily around him.   No one but her,  said Salladhor Saan, and Davos did not have to ask who he meant.  My friend, you tire yourself. It is a bed you are needing, not Salladhor Saan. A bed and many blankets, with a hot compress for your chest and more wine and cloves.   Davos shook his head.  I will be fine. Tell me, Salla, I must know. No one but Melisandre?   The Lyseni gave him a long doubtful look, and continued reluctantly.  The guards keep all others away, even his queen and his little daughter. Servants bring meals that no one eats.  He leaned forward and lowered his voice.  Queer talking I have heard, of hungry fires within the mountain, and how Stannis and the red woman go down together to watch the flames. There are shafts, they say, and secret stairs down into the mountain’s heart, into hot places where only she may walk unburned."
}