{
  "id": "c3dff8051e0bfeab08396ccb471ca44ca2677333",
  "text": "  The Lord of Casterly Rock made such an impressive figure that it was a shock when his destrier dropped a load of dung right at the base of the throne. Joffrey had to step gingerly around it as he descended to embrace his grandfather and proclaim him Savior of the City. Sansa covered her mouth to hide a nervous smile.  Joff made a show of asking his grandfather to assume governance of the realm, and Lord Tywin solemnly accepted the responsibility,  until Your Grace does come of age.  Then squires removed his armor and Joff fastened the Hand’s chain of office around his neck. Lord Tywin took a seat at the council table beside the queen. After the destrier was led off and his homage removed, Cersei nodded for the ceremonies to continue.  A fanfare of brazen trumpets greeted each of the heroes as he stepped between the great oaken doors. Heralds cried his name and deeds for all to hear, and the noble knights and highborn ladies cheered as lustily as cutthroats at a cockfight. Pride of place was given to Mace Tyrell, the Lord of Highgarden, a once-powerful man gone to fat, yet still handsome. His sons followed him in; Ser Loras and his older brother Ser Garlan the Gallant. The three dressed alike, in green velvet trimmed with sable.  The king descended the throne once more to greet them, a great honor. He fastened about the throat of each a chain of roses wrought in soft yellow gold, from which hung a golden disc with the lion of Lannister picked out in rubies.  The roses support the lion, as the might of Highgarden supports the realm,  proclaimed Joffrey.  If there is any boon you would ask of me, ask and it shall be yours.   And now it comes, thought Sansa.   Your Grace,  said Ser Loras,  I beg the honor of serving in your Kingsguard, to defend you against your enemies.   Joffrey drew the Knight of Flowers to his feet and kissed him on his cheek.  Done, brother.   Lord Tyrell bowed his head.  There is no greater pleasure than to serve the King’s Grace. If I was deemed worthy to join your royal council, you would find none more loyal or true.   Joff put a hand on Lord Tyrell’s shoulder and kissed him when he stood.  Your wish is granted.   Ser Garlan Tyrell, five years senior to Ser Loras, was a taller bearded version of his more famous younger brother. He was thicker about the chest and broader at the shoulders, and though his face was comely enough, he lacked Ser Loras’s startling beauty.  Your Grace,  Garlan said when the king approached him,  I have a maiden sister, Margaery, the delight of our House. She was wed to Renly Baratheon, as you know, but Lord Renly went to war before the marriage could be consummated, so she remains innocent. Margaery has heard tales of your wisdom, courage, and chivalry, and has come to love you from afar. I beseech you to send for her, to take her hand in marriage, and to wed your House to mine for all time.   King Joffrey made a show of looking surprised.  Ser Garlan, your sister’s beauty is famed throughout the Seven Kingdoms, but I am promised to another. A king must keep his word.   Queen Cersei got to her feet in a rustle of skirts.  Your Grace, in the judgment of your small council, it would be neither proper nor wise for you to wed the daughter of a man beheaded for treason, a girl whose brother is in open rebellion against the throne even now. Sire, your councillors beg you, for the good of your realm, set Sansa Stark aside. The Lady Margaery will make you a far more suitable queen.   Like a pack of trained dogs, the lords and ladies in the hall began to shout their pleasure.  Margaery,  they called.  Give us Margaery!  and  No traitor queens! Tyrell! Tyrell!   Joffrey raised a hand.  I would like to heed the wishes of my people, Mother, but I took a holy vow.   The High Septon stepped forward.  Your Grace, the gods hold bethrothal solemn, but your father, King Robert of blessed memory, made this pact before the Starks of Winterfell had revealed their falseness. Their crimes against the realm have freed you from any promise you might have made. So far as the Faith is concerned, there is no valid marriage contract ’twixt you and Sansa Stark.   A tumult of cheering filled the throne room, and cries of  Margaery, Margaery  erupted all around her. Sansa leaned forward, her hands tight around the gallery’s wooden rail. She knew what came next, but she was still frightened of what Joffrey might say, afraid that he would refuse to release her even now, when his whole kingdom depended upon it. She felt as if she were back again on the marble steps outside the Great Sept of Baelor, waiting for her prince to grant her father mercy, and instead hearing him command Ilyn Payne to strike off his head. Please, she prayed fervently, make him say it, make him say it.  Lord Tywin was looking at his grandson. Joff gave him a sullen glance, shifted his feet, and helped Ser Garlan Tyrell to rise.  The gods are good. I am free to heed my heart. I will wed your sweet sister, and gladly, ser."
}