{
  "id": "c3e04b66ba71640b126f87c03855add6f1a8844f",
  "text": " Or at least, they didn't until they spotted a notice pinned up in the Gryffindor common room that made them all groan. Flying lessons would be starting on Thursday -- and Gryffindor and Slytherin would be learning together.  \"Typical,\" said Harry darkly. \"Just what I always wanted. To make a fool of myself on a broomstick in front of Malfoy.\"  He had been looking forward to learning to fly more than anything else.  \"You don't know that you'll make a fool of yourself,\" said Ron reasonably. \"Anyway, I know Malfoy's always going on about how good he is at Quidditch, but I bet that's all talk.\"  Malfay certainly did talk about flying a lot. He complained loudly about first years never getting on the house Quidditch teams and told long, boastful stories that always seemed to end with him narrowly escaping Muggles in helicopters. He wasn't the only one, though: the way Seamus Finnigan told it, he'd spent most of his childhood zooming around the countryside on his broomstick. Even Ron would tell anyone who'd listen about the time he'd almost hit a hang glider on Charlie's old broom. Everyone from wizarding families talked about Quidditch constantly. Ron had already had a big argument with Dean Thomas, who shared their dormitory, about soccer. Ron couldn't see what was exciting about a game with only one ball where no one was allowed to fly. Harry had caught Ron prodding Dean's poster of West Ham soccer team, trying to make the players move.  Neville had never been on a broomstick in his life, because his grandmother had never let him near one. Privately, Harry felt she'd had good reason, because Neville managed to have an extraordinary number of accidents even with both feet on the ground.  Hermione Granger was almost as nervous about flying as Neville was. This was something you couldn't learn by heart out of a book -- not that she hadn't tried. At breakfast on Thursday she bored them all stupid with flying tips she'd gotten out of a library book called Quidditch Through the Ages. Neville was hanging on to her every word, desperate for anything that might help him hang on to his broomstick later, but everybody else was very pleased when Hermione's lecture was interrupted by the arrival of the mail.  Harry hadn't had a single letter since Hagrid's note, something that Malfoy had been quick to notice, of course. Malfoy's eagle owl was always bringing him packages of sweets from home, which he opened gloatingly at the Slytherin table.  A barn owl brought Neville a small package from his grandmother. He opened it excitedly and showed them a glass ball the size of a large marble, which seemed to be full of white smoke.  \"It's a Remembrall!\" he explained. \"Gran knows I forget things -- this tells you if there's something you've forgotten to do. Look, you hold it tight like this and if it turns red -- oh...\" His face fell, because the Remembrall had suddenly glowed scarlet,  \"You've forgotten something...\"  Neville was trying to remember what he'd forgotten when Draco Malfoy, who was passing the Gryffindor table, snatched the Remembrall out of his hand.  Harry and Ron jumped to their feet. They were half hoping for a reason to fight Malfay, but Professor McGonagall, who could spot trouble quicker than any teacher in the school, was there in a flash.  \"What's going on?\"  \"Malfoy's got my Remembrall, Professor.\"  Scowling, Malfoy quickly dropped the Remembrall back on the table.  \"Just looking,\" he said, and he sloped away with Crabbe and Goyle behind him.  At three-thirty that afternoon, Harry, Ron, and the other Gryffindors hurried down the front steps onto the grounds for their first flying lesson. It was a clear, breezy day, and the grass rippled under their feet as they marched down the sloping lawns toward a smooth, flat lawn on the opposite side of the grounds to the forbidden forest, whose trees were swaying darkly in the distance.  The Slytherins were already there, and so were twenty broomsticks lying in neat lines on the ground. Harry had heard Fred and George Weasley complain about the school brooms, saying that some of them started to vibrate if you flew too high, or always flew slightly to the left.  Their teacher, Madam Hooch, arrived. She had short, gray hair, and yellow eyes like a hawk.  \"Well, what are you all waiting for?\" she barked. \"Everyone stand by a broomstick. Come on, hurry up.\"  Harry glanced down at his broom. It was old and some of the twigs stuck out at odd angles.  \"Stick out your right hand over your broom,\" called Madam Hooch at the front, \"and say 'Up!\"'  \"UPF everyone shouted.  Harry's broom jumped into his hand at once, but it was one of the few that did. Hermione Granger's had simply rolled over on the ground, and Neville's hadn't moved at all. Perhaps brooms, like horses, could tell when you were afraid, thought Harry; there was a quaver in Neville's voice that said only too clearly that he wanted to keep his feet on the ground.  Madam Hooch then showed them how to mount their brooms without sliding off the end, and walked up and down the rows correcting their grips."
}