{
  "id": "c499519b8b479022856ae643aee23d73891cb452",
  "text": " However, I am delighted to say that his place will be filled by none other than Rubeus Hagrid, who has agreed to take on this teaching job in addition to his gamekeeping duties.\"  Harry, Ron, and Hermione stared at one another, stunned. Then they joined in with the applause, which was tumultuous at the Gryffindor table in particular. Harry leaned forward to see Hagrid, who was ruby-red in the face and staring down at his enormous hands, his wide grin hidden in the tangle of his black beard.  \"We should've known!\" Ron roared, pounding the table. \"Who else would have assigned us a biting book?\"  Harry, Ron, and Hermione were the last to stop clapping, and as Professor Dumbledore started speaking again, they saw that Hagrid was wiping his eyes on the tablecloth.  \"Well, I think that's everything of importance,\" said Dumbledore. \"Let the feast begin!\"  The golden plates and goblets before them filled suddenly with food and drink. Harry, suddenly ravenous, helped himself to everything he could reach and began to eat.  It was a delicious feast; the hall echoed with talk, laughter, and the clatter of knives and forks. Harry, Ron, and Hermione, however, were eager for it to finish so that they could talk to Hagrid. They knew how much being made a teacher would mean to him. Hagrid wasn't a fully qualified wizard; he had been expelled from Hogwarts in his third year for a crime he had not committed. It had been Harry, Ron, and Hermione who had cleared Hagrid's name last year.  At long last, when the last morsels of pumpkin tart had melted from the golden platters, Dumbledore gave the word that it was time for them all to go to bed, and they got their chance.  \"Congratulations, Hagrid!\" Hermione squealed as they reached the teachers' table.  \"All down ter you three,\" said Hagrid, wiping his shining face on his napkin as he looked up at them., \"Can' believe it... great man, Dumbledore... came straight down to me hut after Professor Kettleburn said he'd had enough.... It's what I always wanted. --\"  Overcome with emotion, he buried his face in his napkin, and Professor McGonagall shooed them away.  Harry, Ron, and Hermione joined the Gryffindors streaming up the marble staircase and, very tired now, along more corridors, UP more and more stairs, to the hidden entrance to Gryffindor Tower's large portrait of a fat lady in a pink dress asked them, \"Password?\"  \"Coming through, coming through!\" Percy called from behind the crowd. \"The new password's 'Fortuna Major'!\"  \"Oh no,\" said Neville Longbottom sadly. He always had trouble remembering the passwords.  Through the portrait hole and across the common room, the girls and boys divided toward their separate staircases. Harry climbed the spiral stair with no thought in his head except how glad he was to be back. They reached their familiar, circular dormitory with its five four-poster beds, and Harry, looking around, felt he was home at last.  CHAPTER SIX  TALONS AND TEA LEAVES  When Harry, Ron, and Hermione entered the Great Hall for breakfast the next day, the first thing they saw was Draco Malfoy, who seemed to be entertaining a large group of Slytherins with a very funny story. As they passed, Malfoy did a ridiculous impression of a swooning fit and there was a roar of laughter.  \"Ignore him,\" said Hermione, who was right behind Harry. \"Just ignore him, it's not worth it....\"  \"Hey, Potter!\" shrieked Pansy Parkinson, a Slytherin girl with a face like a pug. \"Potter! The dementors are coming, Potter! Woooooooooo!\"  Harry dropped into a seat at the Gryffindor table, next to George Weasley.  \"New third-year course schedules,\" said George, passing then, over. \"What's up with you, Harry?\"  \"Malfoy,\" said Ron, sitting down on George's other side and glaring over at the Slytherin table.  George looked up in time to see Malfoy pretending to faint with terror again.  \"That little git,\" he said calmly. \"He wasn't so cocky last night when the dementors were down at our end of the train. Came runing into our compartment, didn't he, Fred?\"  \"Nearly wet himself,\" said Fred, with a contemptuous glance at Malfoy.  \"I wasn't too happy myself,\" said George. \"They're horrible things, those dementors....\"  \"Sort of freeze your insides, don't they?\" said Fred.  \"You didn't pass out, though, did you?\" said Harry in a low voice.  \"Forget it, Harry,\" said George bracingly. \"Dad had to go out to Azkaban one time, remember, Fred? And he said it was the worst place he'd ever been, he came back all weak and shaking.... They suck the happiness out of a place, dementors. Most of the prisoners go mad in there.\"  \"Anyway, we'll see how happy Malfoy looks after our first Quidditch match,\" said Fred. \"Gryffindor versus Slytherin, first game of the season, remember?\"  The only time Harry and Malfoy had faced each other in a Quidditch match, Malfoy had definitely come off worse. Feeling slightly more cheerful, Harry helped himself to sausages and fried tomatoes.  Hermione was examining her new schedule.  \" Ooh, good, we're starting some new subjects today,\" she said happily."
}