{
  "id": "c52b9b28ffc1f4faeee844c36bc2bafb15f690a9",
  "text": " I must be strong for him as well, she thought grimly. A knight he may be, but I am the blood of the dragon.  The next pool they found was scalding hot and stinking of brimstone, but their skins were almost empty. The Dothraki cooled the water in jars and pots and drank it tepid. The taste was no less foul, but water was water, and all of them thirsted. Dany looked at the horizon with despair. They had lost a third of their number, and still the waste stretched before them, bleak and red and endless. The comet mocks my hopes, she thought, lifting her eyes to where it scored the sky. Have I crossed half the world and seen the birth of dragons only to die with them in this hard hot desert? She would not believe it.  The next day, dawn broke as they were crossing a cracked and fissured plain of hard red earth. Dany was about to command them to make camp when her outriders came racing back at a gallop.  A city, Khaleesi,  they cried.  A city pale as the moon and lovely as a maid. An hour’s ride, no more.    Show me,  she said.  When the city appeared before her, its walls and towers shimmering white behind a veil of heat, it looked so beautiful that Dany was certain it must be a mirage.  Do you know what place this might be? Ser Jorah.   The exile knight gave a weary shake of the head.  No, my queen. I have never traveled this far east.   The distant white walls promised rest and safety, a chance to heal and grow strong, and Dany wanted nothing so much as to rush toward them. Instead she turned to her bloodriders.  Blood of my blood, go ahead of us and learn the name of this city, and what manner of welcome we should expect.    Ai, Khaleesi,  said Aggo.  Her riders were not long in returning. Rakharo swung down from his saddle. From his medallion belt hung the great curving arakh that Dany had bestowed on him when she named him bloodrider.  This city is dead, Khaleesi. Nameless and godless we found it, the gates broken, only wind and flies moving through the streets.   Jhiqui shuddered.  When the gods are gone, the evil ghosts feast by night. Such places are best shunned. It is known.    It is known,  Irri agreed.   Not to me.  Dany put her heels into her horse and showed them the way, trotting beneath the shattered arch of an ancient gate and down a silent street. Ser Jorah and her bloodriders followed, and then, more slowly, the rest of the Dothraki.  How long the city had been deserted she could not know, but the white walls, so beautiful from afar, were cracked and crumbling when seen up close. Inside was a maze of narrow crooked alleys. The buildings pressed close, their facades blank, chalky, windowless. Everything was white, as if the people who lived here had known nothing of color. They rode past heaps of sun-washed rubble where houses had fallen in, and elsewhere saw the faded scars of fire. At a place where six alleys came together, Dany passed an empty marble plinth. Dothraki had visited this place before, it would seem. Perhaps even now the missing statue stood among the other stolen gods in Vaes Dothrak. She might have ridden past it a hundred times, never knowing. On her shoulder, Viserion hissed.  They made camp before the remnants of a gutted palace, on a windswept plaza where devilgrass grew between the paving stones. Dany sent out men to search the ruins. Some went reluctantly, yet they went… and one scarred old man returned a brief time later, hopping and grinning, his hands overflowing with figs. They were small, withered things, yet her people grabbed for them greedily, jostling and pushing at each other, stuffing the fruit into their cheeks and chewing blissfully.  Other searchers returned with tales of other fruit trees, hidden behind closed doors in secret gardens. Aggo showed her a courtyard overgrown with twisting vines and tiny green grapes, and Jhogo discovered a well where the water was pure and cold. Yet they found bones too, the skulls of the unburied dead, bleached and broken.  Ghosts,  Irri muttered.  Terrible ghosts. We must not stay here, Khaleesi, this is their place.    I fear no ghosts. Dragons are more powerful than ghosts.  And figs are more important.  Go with Jhiqui and find me some clean sand for a bath, and trouble me no more with silly talk.   In the coolness of her tent, Dany blackened horsemeat over a brazier and reflected on her choices. There was food and water here to sustain them, and enough grass for the horses to regain their strength. How pleasant it would be to wake every day in the same place, to linger among shady gardens, eat figs, and drink cool water, as much as she might desire.  When Irri and Jhiqui returned with pots of white sand, Dany stripped and let them scrub her clean.  Your hair is coming back, Khaleesi,  Jhiqui said as she scraped sand off her back. Dany ran a hand over the top of her head, feeling the new growth. Dothraki men wore their hair in long oiled braids, and cut them only when defeated. Perhaps I should do the same, she thought, to remind them that Drogo’s strength lives within me now."
}