{
  "id": "c571fd9a56d1bbcf0dd309f99a232140dd18a65d",
  "text": " Jaime had served with his sort all his life. Men like Walton would kill at their lord’s command, rape when their blood was up after battle, and plunder wherever they could, but once the war was done they would go back to their homes, trade their spears for hoes, wed their neighbors’ daughters, and raise a pack of squalling children. Such men obeyed without question, but the deep malignant cruelty of the Brave Companions was not a part of their nature.  Both parties left Harrenhal the same morning, beneath a cold grey sky that promised rain. Ser Aenys Frey had marched three days before, striking northeast for the kingsroad. Bolton meant to follow him.  The Trident is in flood,  he told Jaime.  Even at the ruby ford, the crossing will be difficult. You will give my warm regards to your father?    So long as you give mine to Robb Stark.    That I shall.   Some Brave Companions had gathered in the yard to watch them leave. Jaime trotted over to where they stood.  Zollo. How kind of you to see me off. Pyg. Timeon. Will you miss me? No last jest to share, Shagwell? To lighten my way down the road? And Rorge, did you come to kiss me goodbye?    Bugger off, cripple,  said Rorge.   If you insist. Rest assured, though, I will be back. A Lannister always pays his debts.  Jaime wheeled his horse around and rejoined Steelshanks Walton and his two hundred.  Lord Bolton had accoutred him as a knight, preferring to ignore the missing hand that made such warlike garb a travesty. Jaime rode with sword and dagger on his belt, shield and helm hung from his saddle, chainmail under a dark brown surcoat. He was not such a fool as to show the lion of Lannister on his arms, though, nor the plain white blazon that was his right as a Sworn Brother of the Kingsguard. He found an old shield in the armory, battered and splintered, the chipped paint still showing most of the great black bat of House Lothston upon a field of silver and gold. The Lothstons held Harrenhal before the Whents and had been a powerful family in their day, but they had died out ages ago, so no one was likely to object to him bearing their arms. He would be no one’s cousin, no one’s enemy, no one’s sworn sword… in sum, no one.  They left through Harrenhal’s smaller eastern gate, and took their leave of Roose Bolton and his host six miles farther on, turning south to follow along the lake road for a time. Walton meant to avoid the kingsroad as long as he could, preferring the farmer’s tracks and game trails near the Gods Eye.   The kingsroad would be faster.  Jaime was anxious to return to Cersei as quickly as he could. If they made haste, he might even arrive in time for Joffrey’s wedding.   I want no trouble,  said Steelshanks.  Gods know who we’d meet along that kingsroad.    No one you need fear, surely? You have two hundred men.    Aye. But others might have more. M’lord said to bring you safe to your lord father, and that’s what I mean to do.   I have come this way before, Jaime reflected a few miles further on, when they passed a deserted mill beside the lake. Weeds now grew where once the miller’s daughter had smiled shyly at him, and the miller himself had shouted out,  The tourney’s back the other way, ser.  As if I had not known.  King Aerys made a great show of Jaime’s investiture. He said his vows before the king’s pavilion, kneeling on the green grass in white armor while half the realm looked on. When Ser Gerold Hightower raised him up and put the white cloak about his shoulders, a roar went up that Jaime still remembered, all these years later. But that very night Aerys had turned sour, declaring that he had no need of seven Kingsguard here at Harrenhal. Jaime was commanded to return to King’s Landing to guard the queen and little Prince Viserys, who’d remained behind. Even when the White Bull offered to take that duty himself, so Jaime might compete in Lord Whent’s tourney, Aerys had refused.  He’ll win no glory here,  the king had said.  He’s mine now, not Tywin’s. He’ll serve as I see fit. I am the king. I rule, and he’ll obey.   That was the first time that Jaime understood. It was not his skill with sword and lance that had won him his white cloak, nor any feats of valor he’d performed against the Kingswood Brotherhood. Aerys had chosen him to spite his father, to rob Lord Tywin of his heir.  Even now, all these years later, the thought was bitter. And that day, as he’d ridden south in his new white cloak to guard an empty castle, it had been almost too much to stomach. He would have ripped the cloak off then and there if he could have, but it was too late. He had said the words whilst half the realm looked on, and a Kingsguard served for life.  Qyburn fell in beside him.  Is your hand troubling you?    The lack of my hand is troubling me.  The mornings were the hardest. In his dreams Jaime was a whole man, and each dawn he would lie half-awake and feel his fingers move. It was a nightmare, some part of him would whisper, refusing to believe even now, only a nightmare."
}