{
  "id": "c57b1a55eb50f378b753b8ebf1880e383088db4a",
  "text": "   Ned Stark was racing south with Robert’s van, but my father’s forces reached the city first. Pycelle convinced the king that his Warden of the West had come to defend him, so he opened the gates. The one time he should have heeded Varys, and he ignored him. My father had held back from the war, brooding on all the wrongs Aerys had done him and determined that House Lannister should be on the winning side. The Trident decided him.   It fell to me to hold the Red Keep, but I knew we were lost. I sent to Aerys asking his leave to make terms. My man came back with a royal command. ‘Bring me your father’s head, if you are no traitor.’ Aerys would have no yielding. Lord Rossart was with him, my messenger said. I knew what that meant.   When I came on Rossart, he was dressed as a common man-at-arms, hurrying to a postern gate. I slew him first. Then I slew Aerys, before he could find someone else to carry his message to the pyromancers. Days later, I hunted down the others and slew them as well. Belis offered me gold, and Garigus wept for mercy. Well, a sword’s more merciful than fire, but I don’t think Garigus much appreciated the kindness I showed him.   The water had grown cool. When Jaime opened his eyes, he found himself staring at the stump of his sword hand. The hand that made me Kingslayer. The goat had robbed him of his glory and his shame, both at once. Leaving what? Who am I now?  The wench looked ridiculous, clutching her towel to her meager teats with her thick white legs sticking out beneath.  Has my tale turned you speechless? Come, curse me or kiss me or call me a liar. Something.    If this is true, how is it no one knows?    The knights of the Kingsguard are sworn to keep the king’s secrets. Would you have me break my oath?  Jaime laughed.  Do you think the noble Lord of Winterfell wanted to hear my feeble explanations? Such an honorable man. He only had to look at me to judge me guilty.  Jaime lurched to his feet, the water running cold down his chest.  By what right does the wolf judge the lion? By what right?  A violent shiver took him, and he smashed his stump against the rim of the tub as he tried to climb out.  Pain shuddered through him… and suddenly the bathhouse was spinning. Brienne caught him before he could fall. Her arm was all gooseflesh, clammy and chilled, but she was strong, and gentler than he would have thought. Gentler than Cersei, he thought as she helped him from the tub, his legs wobbly as a limp cock.  Guards!  he heard the wench shout.  The Kingslayer!   Jaime, he thought, my name is Jaime.  The next he knew, he was lying on the damp floor with the guards and the wench and Qyburn all standing over him looking concerned. Brienne was naked, but she seemed to have forgotten that for the moment.  The heat of the tubs will do it,  Maester Qyburn was telling them. No, he’s not a maester, they took his chain.  There’s still poison in his blood as well, and he’s malnourished. What have you been feeding him?    Worms and piss and grey vomit,  offered Jaime.   Hardbread and water and oat porridge,  insisted the guard.  He don’t hardly eat it, though. What should we do with him?    Scrub him and dress him and carry him to Kingspyre, if need be,  Qyburn said.  Lord Bolton insists he will sup with him tonight. The time is growing short.    Bring me clean garb for him,  Brienne said,  I’ll see that he’s washed and dressed.   The others were all too glad to give her the task. They lifted him to his feet and sat him on a stone bench by the wall. Brienne went away to retrieve her towel, and returned with a stiff brush to finish scrubbing him. One of the guards gave her a razor to trim his beard. Qyburn returned with roughspun smallclothes, clean black woolen breeches, a loose green tunic, and a leather jerkin that laced up the front. Jaime was feeling less dizzy by then, though no less clumsy. With the wench’s help he managed to dress himself.  Now all I need is a silver looking glass.   The Bloody Maester had brought fresh clothing for Brienne as well; a stained pink satin gown and a linen undertunic.  I am sorry, my lady. These were the only women’s garments in Harrenhal large enough to fit you.   It was obvious at once that the gown had been cut for someone with slimmer arms, shorter legs, and much fuller breasts. The fine Myrish lace did little to conceal the bruising that mottled Brienne’s skin. All in all, the garb made the wench look ludicrous. She has thicker shoulders than I do, and a bigger neck, Jaime thought. Small wonder she prefers to dress in mail. Pink was not a kind color for her either. A dozen cruel japes leaped into his head, but for once he kept them there. Best not to make her angry; he was no match for her one-handed.  Qyburn had brought a flask as well.  What is it?  Jaime demanded when the chainless maester pressed him to drink.   Licorice steeped in vinegar, with honey and cloves. It will give you some strength and clear your head.    Bring me the potion that grows new hands,  said Jaime."
}