{
  "id": "c5989b861b6cd861fbf6ca411beed43bb6faeb98",
  "text": " No, we have none of it, I am sure. Why, I have  never heard that it had  any great virtue;  and indeed I  have often said to  my sisters when we came  upon it growing in the woods: \"kingsfoil\" I said, \" 'tis a strange name, and  I  wonder why 'tis called so; for if I were a king, I would have plants more  bright in  my garden\". Still it smells sweet  when bruised,  does it not? If  sweet is the right word: wholesome, maybe, is nearer.'       'Wholesome verily,' said Aragorn. 'And now,  dame, if you love the Lord  Faramir, run  as quick as your  tongue and get me kingsfoil, if  there  is a   leaf in the City.'       'And if  not,' said Gandalf,  'I  will  ride  to Lossarnach with  Ioreth  behind me, and she  shall take me to the woods, but not  to her sisters. And  Shadowfax shall show her the meaning of haste.'       When Ioreth was  gone, Aragorn bade the other  women to make water hot.  Then he took  Faramir's hand in  his, and laid the other hand  upon the sick   man's brow. It was drenched with sweat; but Faramir did not move or make any   ####-sign, and seemed hardly to breathe.       'He is nearly spent,' said Aragorn turning to Gandalf. 'But  this comes  not from  the wound. See! that  is healing. Had he been smitten by some dart   of the Nazgyl,  as you thought, he would have died that night. This hurt was  given  by  some  Southron arrow,  I  would guess.  Who drew it forth? Was it  kept?'       'I drew it forth,'  said  Imrahil, 'and staunched the wound. But I  did  not keep the arrow, for we had much to  do. It was, as I remember, just such  a  dart as the Southrons use. Yet I  believed  that it came from the Shadows  above, for else his fever and sickness were not  to be understood; since the  wound was not deep or vital. How then do you read the matter?'       'Weariness,  grief for his father's  mood,  a  wound,  and over all the  Black Breath,' said  Aragorn.  'He is a man of  staunch will, for already he  had  come close  under  the Shadow  before  ever  he  rode to battle on  the  out-walls.  Slowly the dark must have crept  on  him,  even as he fought and  strove to hold his outpost. Would that I could have been here sooner!'       Thereupon the herb-master enter ed.  'Your lordship asked for kingsfoil,  as the rustics name it, he said; or athelas in the noble tongue, or to those  who know somewhat of the Valinorean. . .'       'I  do  so,'  said Aragorn, 'and I care  not  whether you say  now asla   aranion or kingsfoil, so long as you have some.'       'Your  pardon lord!' said the  man. 'I see  you  are a lore-master, not  merely  a captain of  war. But alas! sir, we do not keep  this  thing in the  Houses of Healing, where  only the  gravely hurt or sick  are tended. For it  has no virtue that we know of, save perhaps  to sweeten a fouled air, or  to  drive away  some passing  heaviness.  Unless,  of  course, you  give heed to  rhymes of old days which women such as our good Ioreth still repeat  without  understanding.       When the black breath blows        and death's shadow grows        and all lights pass,       come athelas! come athelas!       Life to the dying       In the king's hand lying!       It is but  a doggrel, I fear, garbled  in the  memory of old wives. Its  meaning I leave to your judgement, if indeed it has any. But  old folk still  use an infusion of the herb for headaches.'   ####-     'Then in the name of the  king, go  and find some old man  of less lore  and more wisdom who keeps some in his house!' cried Gandalf.        Now  Aragorn knelt beside Faramir,  and held a hand  upon his brow. And  those that watched felt that some great struggle was going on. For Aragorn's  face  grew grey  with weariness; and ever and anon  he  called the  name  of  Faramir, but each time more fa intly to their hearing, as  if Aragorn himself  was removed from them, and walked afar  in some dark vale,  calling  for one  that was lost.       And at last Bergil came running in, and he bore six  leaves in a cloth.  'It is kingsfoil,  Sir,' he  said; 'but not fresh, I fear. It must have been  culled two weeks ago at the least. I hope it will  serve, Sir?' Then looking  at Faramir he burst into tears.       But Aragorn smiled. 'It  will serve,' he said. 'The worst is  now over.  Stay and be comforted!'  Then taking two leaves,  he  laid them on his hands  and breathed on them,  and then  he crushed them, and straightway  a  living  freshness filled the room, as if the air itself awoke and tingled, sparkling  with joy. And then he cast the leaves into the bowls  of steaming water that  were brought  to  him,  and  at  once all hearts  were  lightened.  For  the  fragrance that came to each was like a memory of dewy mornings of  unshadowed  sun in some land of which the fair world in Spring is itself but  a fleeting  memory.  But  Aragorn  stood  up as one refreshed, and his eyes smiled as he  held a bowl before Faramir's dreaming face.       'Well now!  Who would have believed  it?'  said Ioreth to  a woman that  stood beside her."
}