{
  "id": "c5a05b069782b66c13032339d18a5ea8e2a87899",
  "text": "  Bilbo was  dreadfully  frightened,  but  he  had  the  sense  to  understand what  had  happened and to sneak behind a big barrel which held drink for the goblin-guards,  and  so  get  out  of  the  way  and  avoid  being  bumped  into,  trampled  to  death,  or  caught by feel.  \"I must  get  to  the  door,  I must  get  to  the  door!\"  he  kept  on  saying  to  himself,  but  it was  a  long  time  before  he ventured  to  try. Then  it was  like a horrible game  of  blind-man's  buff.  The  place  was  full  of  goblins  running  about,  and  the  poor  little  hobbit  dodged  this  way  and  that,  was  knocked  over  by  a  goblin  who  could  not  make  out  what  he  had  bumped  into,  scrambled  away  on  all  fours,  slipped  between the legs of the captain just in time, got up, and ran for the door.   It  was  still  ajar,  but  a  goblin  had  pushed  it  nearly  to.  Bilbo  struggled  but  he  could  not  move  it.  He  tried  to  squeeze  through  the  crack.  He  squeezed  and   ####-squeezed, and he  stuck!  It was awful. His buttons had got wedged on  the edge of  the  door  and  the  door-post.  He  could  see  outside  into  the  open  air:  there  were  a  few  steps  running  down  into  a  narrow  valley  between  tall  mountains;  the  sun  came  out  from  behind  a  cloud  and  shone  bright  on  the  outside  of  the  door-but he  could not get through.  Suddenly  one  of  the  goblins  inside  shouted:  \"There  is  a  shadow  by  the  door.  Something is outside!\"  Bilbo's  heart  jumped  into  his mouth. He  gave  a  terrific  squirm. Buttons burst  off in all directions. He was through, with a torn coat and waistcoat, leaping down  the steps  like a goat, while bewildered goblins were still picking up his nice brass  buttons on the doorstep.  Of course they soon came down after him, hooting and hallooing, and hunting  among  the  trees. But  they  don't  like  the  sun:  it makes  their  legs wobble  and  their  heads giddy. They could not find Bilbo with the ring on, slipping in and out of the  shadow of  the  trees,  running quick and quiet, and keeping out of  the sun; so soon  they went back grumbling and cursing to guard the door. Bilbo had escaped.     ####-<h4>Chapter 6 </h4> <br>  Out of the Frying-Pan into the Fire     Bilbo had escaped the goblins, but he did not know where he was. He had lost  hood,  cloak,  food,  pony,  his  buttons  and  his  friends. He wandered  on  and  on,  till  the  sun  began  to  sink westwards-behind  the mountains. Their shadows fell across  Bilbo's  path,  and  he  looked  back.  Then  he  looked  forward  and  could  see  before  him  only  ridges  and  slopes  falling  towards  lowlands  and  plains  glimpsed  occasionally between the trees.  \"Good  heavens!\"  he  exclaimed.  \"I  seem  to  have  got  right  to  the  other  side  of  the Misty Mountains,  right  to  the  edge  of  the Land Beyond! Where  and O where  can  Gandalf  and  the  dwarves  have  got  to?  I  only  hope  to  goodness  they  are  not  still back there in the power of the goblins!\"  He  still wandered on, out of  the  little high valley, over  its edge, and down  the  slopes beyond; but all the while a very uncomfortable thought was growing inside  him.  He  wondered  whether  he  ought  not,  now  he  had  the magic  ring,  to  go  back  into  the  horrible,  horrible,  tunnels  and  look  for  his  friends.  He  had  just made  up  his  mind  that  it  was  his  duty,  that  he  must  turn  back-and  very miserable  he  felt  about it-when he heard voices.  He  stopped  and  listened.  It  did  not  sound  like  goblins;  so  he  crept  forward  carefully. He was  on  a  stony  path winding  downwards with  a  rocky wall.  on  the  left hand; on the other side the ground sloped away and there were dells below the  level  of  the  path  overhung with  bushes  and  low  trees.  In  one  of  these  dells  under  the bushes people were talking.  He crept still nearer, and suddenly he saw peering between  two big boulders a  head with a red hood on:  it was Balin doing  look-out. He could have clapped and  shouted  for  joy,  but  he  did  not.  He  had  still  got  the  ring  on,  for  fear  of  meeting  something unexpected and unpleasant, and he saw that Balin was looking straight  at him without noticing him.  \"I will  give  them  all  a  surprise,\"  he  thought,  as  he  crawled  into  the  bushes at  the edge of the dell. Gandalf was arguing with the dwarves. They were discussing  all  that  had  happened  to  them  in  the  tunnels,  and  wondering  and  debating  what  they were  to  do  now. The  dwarves were  grumbling,  and Gandalf was  saying  that  they could not possibly go on with their journey leaving Mr. Baggins in the hands  of  the  goblins,  without  trying  to  find  out  if  he  was  alive  or  dead,  and  without  trying to rescue him.   ####-\"After  all  he  is  my  friend,\"  said  the  wizard,  \"and  not  a  bad  little  chap.  I  feel  responsible for him."
}