{
  "id": "c5b568d28efc97988bc26d9659599606677c548e",
  "text": "  What does that mean?   The old knight did not blink.  Your father is called ‘the Mad King’ in Westeros. Has no one ever told you?    Viserys did.  The Mad King.  The Usurper called him that, the Usurper and his dogs.  The Mad King.  It was a lie.    Why ask for truth,  Ser Barristan said softly,  if you close your ears to it?  He hesitated, then continued.  I told you before that I used a false name so the Lannisters would not know that I’d joined you. That was less than half of it, Your Grace. The truth is, I wanted to watch you for a time before pledging you my sword. To make certain that you were not…    …my father’s daughter?  If she was not her father’s daughter, who was she?   …mad,  he finished.  But I see no taint in you.    Taint?  Dany bristled.   I am no maester to quote history at you, Your Grace. Swords have been my life, not books. But every child knows that the Targaryens have always danced too close to madness. Your father was not the first. King Jaehaerys once told me that madness and greatness are two sides of the same coin. Every time a new Targaryen is born, he said, the gods toss the coin in the air and the world holds its breath to see how it will land.   Jaehaerys. This old man knew my grandfather. The thought gave her pause. Most of what she knew of Westeros had come from her brother, and the rest from Ser Jorah. Ser Barristan would have forgotten more than the two of them had ever known. This man can tell me what I came from.  So I am a coin in the hands of some god, is that what you are saying, ser?    No,  Ser Barristan replied.  You are the trueborn heir of Westeros. To the end of my days I shall remain your faithful knight, should you find me worthy to bear a sword again. If not, I am content to serve Strong Belwas as his squire.    What if I decide you’re only worthy to be my fool?  Dany asked scornfully.  Or perhaps my cook?    I would be honored, Your Grace,  Selmy said with quiet dignity.  I can bake apples and boil beef as well as any man, and I’ve roasted many a duck over a campfire. I hope you like them greasy, with charred skin and bloody bones.   That made her smile.  I’d have to be mad to eat such fare. Ben Plumm, come give Ser Barristan your longsword.   But Whitebeard would not take it.  I flung my sword at Joffrey’s feet and have not touched one since. Only from the hand of my queen will I accept a sword again.    As you wish.  Dany took the sword from Brown Ben and offered it hilt first. The old man took it reverently.  Now kneel,  she told him,  and swear it to my service.   He went to one knee and lay the blade before her as he said the words. Dany scarcely heard them. He was the easy one, she thought. The other will be harder. When Ser Barristan was done, she turned to Jorah Mormont.  And now you, ser. Tell me true.   The big man’s neck was red; whether from anger or shame she did not know.  I have tried to tell you true, half a hundred times. I told you Arstan was more than he seemed. I warned you that Xaro and Pyat Pree were not to be trusted. I warned you—    You warned me against everyone except yourself.  His insolence angered her. He should be humbler. He should beg for my forgiveness.  Trust no one but Jorah Mormont, you said… and all the time you were the Spider’s creature!    I am no man’s creature. I took the eunuch’s gold, yes. I learned some ciphers and wrote some letters, but that was all—    All? You spied on me and sold me to my enemies!    For a time.  He said it grudgingly.  I stopped.    When? When did you stop?    I made one report from Qarth, but—    From Qarth?  Dany had been hoping it had ended much earlier.  What did you write from Qarth? That you were my man now, that you wanted no more of their schemes?  Ser Jorah could not meet her eyes.  When Khal Drogo died, you asked me to go with you to Yi Ti and the Jade Sea. Was that your wish or Robert’s?    That was to protect you,  he insisted.  To keep you away from them. I knew what snakes they were…    Snakes? And what are you, ser?  Something unspeakable occurred to her.  You told them I was carrying Drogo’s child…    Khaleesi…    Do not think to deny it, ser,  Ser Barristan said sharply.  I was there when the eunuch told the council, and Robert decreed that Her Grace and her child must die. You were the source, ser. There was even talk that you might do the deed, for a pardon.    A lie.  Ser Jorah’s face darkened.  I would never… Daenerys, it was me who stopped you from drinking the wine.    Yes. And how was it you knew the wine was poisoned?    I… I but suspected… the caravan brought a letter from Varys, he warned me there would be attempts. He wanted you watched, yes, but not harmed.  He went to his knees.  If I had not told them someone else would have. You know that.    I know you betrayed me.  She touched her belly, where her son Rhaego had perished.  I know a poisoner tried to kill my son, because of you. That’s what I know.    No… no.  He shook his head.  I never meant… forgive me."
}