{
  "id": "c5eb5644e8282d0cbd27f5125d2a26f2b6599618",
  "text": " Sharpen your  blade!'       Gandalf went to the door, and there he turned. 'I  am in haste Pippin,'  he said. 'Do  me a favour when you go out. Even before you rest, if you  are  not too weary. Go and find Shadowfax and see how  he is housed. These  people  are kindly to beasts, for they are a good  and wise folk, but they have less  skill with horses than some.'       With that Gandalf went out;  and as he did so, there came the note of a   clear sweet bell ringing in  a tower of  the citadel. Three strokes it rang,  like silver in  the  air, and ceased: the third hour from the rising of  the  sun.       After a minute Pippin went to  the door and  down the stair  and looked  about the street. The sun was now  shining warm and bright,  and the  towers  and tall houses cast long  clear-cut shadows westward.  High in the blue air  Mount Mindolluin lifted its  white helm and snowy cloak.  Armed men  went to  and fro in the ways of  the City, as if going at the striking of the hour to  changes of post and duty.       'Nine o'clock we'd call it in the Shire,' said Pippin aloud to himself.   'Just  the time for a nice breakfast by the open window in spring  sunshine.   ####-And  how I  should like  breakfast! Do these  people ever  have it, or is it  over? And when do they have dinner, and where?'       Presently he noticed a man, clad  in  black and white, coming along the  narrow street from the centre of the citadel towards him. Pippin felt lonely  and made up his mind to speak as the man passed; but he had no need. The man  came straight up to him.       'You are Peregrin the Halfling?' he said. 'I am told that you have been  sworn to the  service of the  Lord and of the City. Welcome! He held out his  hand and Pippin took it.       'I am named Beregond son of Baranor. I have no duty this morning, and I   have been sent  to you to teach you the pass-words, and to  tell you some of  the many things that  no doubt you  will  wish to know. And  for my part,  I  would learn of you also.  For  never before have  we seen a halfling in this  land and though we have heard rumour of them, little is said of them in  any  tale that we know. Moreover you are a friend of Mithrandir.  Do you know him  well?'       'Well,' said Pippin.  'I  have known of  him all my short  life, as you   might say; and lately  I have travelled far with him. But there  is  much to  read in that book, and I cannot claim to have seen more  than a page or two.   Yet perhaps I know him as well as any but a few. Aragorn was the only one of  our Company, I think, who really knew him.'       'Aragorn?' said Beregond. 'Who is he?'       'Oh,' stammered  Pippin, 'he was a  man who went  about with us. I think   he is in Rohan now.'       'You have  been in Rohan, I hear. There is much that I would ask you of  that land also;  for we put much of what little hope we have  in its people.  But I am forgetting my errand, which was first to answer what you would ask.  What would you know, Master Peregrin?'       'Er well,' said Pippin, 'if I may venture to  say so, rather  a burning  question  in my mind at present is, well, what about breakfast and all that?   I mean, what  are  the  meal-times, if you  understand me, and where is  the  dining-room, if there is one?  And the inns? I looked, but never a one could  I see as we rode up, though I had been borne up by the hope of a draught  of  ale as soon as we came to the homes of wise and courtly men.'       Beregond looked at him  gravely. 'An old campaigner,  I see,'  he said.  'They say that men who go warring afield look ever to the next  hope of food  and of drink; though I am not a travelled man myself. Then you have not  yet   ####-eaten today?'       'Well, yes,  to speak in courtesy, yes,' said Pippin. 'But no more than  a cup of wine  and a white cake or two by the kindness of your lord; but  he  racked me for it with an hour of questions, and that is hungry work.'       Beregond laughed. 'At the table small men may  do the greater deeds, we  say. But you  have broken  your fast  as well as any man in the Citadel, and  with  greater honour. This is a fortress and a tower  of guard and is now in  posture  of war. We rise ere the Sun, and take  a morsel in the grey  light,  and go  to our duties  at  the opening hour. But do not despair!' He laughed  again,  seeing the  dismay in Pippin's  face. 'Those who have had heavy duty  take somewhat  to refresh  their strength  in the mid-morning. Then there is  the  nuncheon,  at noon or  after as  duties allow; and men  gather for  the  daymeal, and such mirth as there still may be, about the hour of sunset.       'Come! We will walk a little and then go find us  some refreshment, and  eat and drink on the battlement, and survey the fair morning.'       'One moment!' said Pippin blushing. 'Greed, or hunger by your courtesy,   put it out of my mind. But Gandalf, Mithrandir as you call  him, asked me to  see to his horse  - Shadowfax,  a  great steed of Rohan, and the apple of the  king's  eye, I  am told, though he  has  given  him  to  Mithrandir  for his  services."
}