{
  "id": "c603c3a4182b1ad40a7eee6150257ccf39e4cc93",
  "text": " The full tale  is  stated  to have been written  by  Barahir, grandson of the Steward Faramir, some time after the passing of the   King. But the chief importance of  Findegil's copy is that it alone contains  the whole  of Bilbo's 'Translations from the  Elvish'. These  three  volumes  were  found to be a work of great skill and learning in  which, between 1403  and 1418, he had used all the sources  available to  him  in Rivendell, both  living and written. But  since they were little used by Frodo, being  almost   entirely concerned with the Elder Days, no more is said of them here.       Since Meriadoc and Peregrin became the  heads  of their great families,   and  at the  same time kept up their  connexions with Rohan and  Gondor, the  libraries at Bucklebury and Tuckborough contained much that did  not  appear  in the Red Book.  In Brandy Hall there were many works dealing  with Eriador   and the  history of Rohan. Some of these were composed or  begun by  Meriadoc  himself, though in the  Shire he was chiefly remembered for  his Herblore of  the Shire, and for his Reckoning of  Years m which he discussed the relation  of the calendars of the Shire and Bree  to those of  Rivendell,  Gondor, and  Rohan. He also wrote a short treatise on Old Words and Names  in the  Shire,  having special interest  in discovering the kinship with the language of the  Rohirrim of such 'shire-words' as mathom and old elements in place names.       At Great Smials the books were  of less interest to Shire-folk,  though  more important for larger history. None of them was written by Peregrin, but  he and  his successors  collected  many manuscripts written  by  scribes  of  Gondor:  mainly  copies  or  summaries of  histories or legends  relating to  Elendil  and his heirs. Only  here in the Shire were to  be  found extensive  materials for  the history  of  N®menor and the  arising of  Sauron.  It was  probably at Great Smials that The Tale of Years1 was put  together, with the  assistance of material  collected by Meriadoc. Though  the dates  given  are  often conjectural, especially for the Second Age, they deserve attention. It  is   probable  that  Mer iadoc  obtained   assistance  and  information  from  Rivendell,  which he  visited  more  than  once.  There, though  Elrond  had   ####-departed, his sons long remained, together with some of the High-elven folk.  It  is  said  that  Celeborn  went  to  dwell  there after the departure  of  Galadriel; but there is no record of the day when at last he sought the Grey  Havens,  and  with  him went the last  living  memory  of the  Elder Days in   Middle-earth.   ####-* BOOK I *         Chapter 1. A Long-expected Party            When  Mr. Bilbo Baggins of Bag  End announced that  he would shortly be  celebrating   his   eleventy-first  birthday   with  a   party  of   special  magnificence, there was much talk and excitement in Hobbiton.       Bilbo  was very rich  and very peculiar, and had been the wonder of the  Shire  for  sixty   years,  ever  since  his  remarkable  disappearance  and  unexpected return. The riches  he  had brought back from his travels had now  become  a local legend, and it was popularly believed, whatever the old folk   might  say,  that  the Hill  at Bag  End was  full  of tunnels  stuffed with  treasure. And if that was not enough for  fame, there was also his prolonged   vigour  to marvel at. Time wore on,  but it seemed to  have little effect on  Mr. Baggins. At ninety he was much the same as at fifty. At ninety-nine they  began to  call him well-preserved,  but unchanged would have been nearer the  mark. There were  some that shook their heads and thought  this was too much  of  a good thing; it seemed unfair that anyone should  possess  (apparently)   perpetual youth as well as (reputedly) inexhaustible wealth.       'It  will  have  to be  paid for,'  they said. 'It  isn't natural,  and  trouble will come of it!'       But so far trouble had not come;  and as Mr. Baggins was  generous with  his money, most people were willing to forgive him his oddities and his good  fortune.  He  remained  on visiting  terms with  his  relatives (except,  of  course, the Sackville-Bagginses), and he had many devoted admirers among  the  hobbits of poor and unimportant families. But he had no close friends, until  some of his younger cousins began to grow up.       The eldest of  these,  and Bilbo's favourite,  was young Frodo Baggins.  When Bilbo was ninety-nine, he adopted Frodo as his heir, and brought him to  live  at Bag End;  and the  hopes  of the  Sackville-Bagginses were  finally  dashed. Bilbo and Frodo happened to have the same  birthday, September  22nd.  'You had better come and live here, Frodo my lad,' said  Bilbo one day; 'and  then we  can  celebrate our birthday-parties  comfortably together.' At that   ####-time Frodo  was still in his tweens, as the hobbits called the irresponsible  twenties between childhood and coming of age at thirty-three."
}