{
  "id": "c628db671b21c081df7fb0ffcff5d76cd5da8a10",
  "text": "  The wildling shook snow from his arm and turned his horse about.  It may be he never saw a man without a beard before. Come, we start back. Mance grows sore wroth when I’m not found in my accustomed place.   Jon wheeled and followed Tormund back toward the head of the column, his new cloak hanging heavy from his shoulders. It was made of unwashed sheepskins, worn fleece side in, as the wildlings suggested. It kept the snow off well enough, and at night it was good and warm, but he kept his black cloak as well, folded up beneath his saddle.  Is it true you killed a giant once?  he asked Tormund as they rode. Ghost loped silently beside them, leaving paw prints in the new-fallen snow.   Now why would you doubt a mighty man like me? It was winter and I was half a boy, and stupid the way boys are. I went too far and my horse died and then a storm caught me. A true storm, not no little dusting such as this. Har! I knew I’d freeze to death before it broke. So I found me a sleeping giant, cut open her belly, and crawled up right inside her. Kept me warm enough, she did, but the stink near did for me. The worst thing was, she woke up when the spring come and took me for her babe. Suckled me for three whole moons before I could get away. Har! There’s times I miss the taste o’ giant’s milk, though.    If she nursed you, you couldn’t have killed her.    I never did, but see you don’t go spreading that about. Tormund Giantsbane has a better ring to it than Tormund Giantsbabe, and that’s the honest truth o’ it.    So how did you come by your other names?  Jon asked.  Mance called you the Horn-Blower, didn’t he? Mead-king of Ruddy Hall, Husband to Bears, Father to Hosts?  It was the horn blowing he particularly wanted to hear about, but he dared not ask too plainly. And Joramun blew the Horn of Winter, and woke giants from the earth. Is that where they had come from, them and their mammoths? Had Mance Rayder found the Horn of Joramun, and given it to Tormund Thunderfist to blow?   Are all crows so curious?  asked Tormund.  Well, here’s a tale for you. It were another winter, colder even than the one I spent inside that giant, and snowing day and night, snowflakes as big as your head, not these little things. It snowed so hard the whole village was half buried. I was in me Ruddy Hall, with only a cask o’ mead to keep me company and nothing to do but drink it. The more I drank the more I got to thinking about this woman lived close by, a fine strong woman with the biggest pair of teats you ever saw. She had a temper on her, that one, but oh, she could be warm too, and in the deep of winter a man needs his warmth.   The more I drank the more I thought about her, and the more I thought the harder me member got, till I couldn’t suffer it no more. Fool that I was, I bundled meself up in furs from head to heels, wrapped a winding wool around me face, and set off to find her. The snow was coming down so hard I got turned around once or twice, and the wind blew right through me and froze me bones, but finally I come on her, all bundled up like I was.   The woman had a terrible temper, and she put up quite the fight when I laid hands on her. It was all I could do to carry her home and get her out o’ them furs, but when I did, oh, she was hotter even than I remembered, and we had a fine old time, and then I went to sleep. Next morning when I woke the snow had stopped and the sun was shining, but I was in no fit state to enjoy it. All ripped and torn I was, and half me member bit right off, and there on me floor was a she-bear’s pelt. And soon enough the free folk were telling tales o’ this bald bear seen in the woods, with the queerest pair o’ cubs behind her. Har!  He slapped a meaty thigh.  Would that I could find her again. She was fine to lay with, that bear. Never was a woman gave me such a fight, nor such strong sons neither.    ’What could you do if you did find her?  Jon asked, smiling.  You said she bit your member off.    Only half. And half me member is twice as long as any other man’s.  Tormund snorted.  Now as to you… is it true they cut your members off when they take you for the Wall?    No,  Jon said, affronted.   I think it must be true. Else why refuse Ygritte? She’d hardly give you any fight at all, seems to me. The girl wants you in her, that’s plain enough to see.   Too bloody plain, thought Jon, and it seems that half the column has seen it. He studied the falling snow so Tormund might not see him redden. I am a man of the Night’s Watch, he reminded himself. So why did he feel like some blushing maid?  He spent most of his days in Ygritte’s company, and most nights as well. Mance Rayder had not been blind to Rattleshirt’s mistrust of the  crow-come-over,  so after he had given Jon his new sheepskin cloak he had suggested that he might want to ride with Tormund Giantsbane instead. Jon had happily agreed, and the very next day Ygritte and Longspear Ryk left Rattleshirt’s band for Tormund’s as well.  Free folk ride with who they want,  the girl told him,  and we had a bellyful of Bag o’ Bones."
}