{
  "id": "c66b8188388c695b8e0bd625aa336d597b147734",
  "text": " You can’t hammer tin into iron, no matter how hard you beat it, but that doesn’t mean tin is useless. Why shouldn’t Sam be a steward?   Chett gave an angry scowl.  I’m a steward. You think it’s easy work, fit for cowards? The order of stewards keeps the Watch alive. We hunt and farm, tend the horses, milk the cows, gather firewood, cook the meals. Who do you think makes your clothing? Who brings up supplies from the south? The stewards.   Maester Aemon was gentler.  Is your friend a hunter?    He hates hunting,  Jon had to admit.   Can he plow a field?  the maester asked.  Can he drive a wagon or sail a ship? Could he butcher a cow?    No.   Chett gave a nasty laugh.  I’ve seen what happens to soft lordlings when they’re put to work. Set them to churning butter and their hands blister and bleed. Give them an axe to split logs, and they cut off their own foot.    I know one thing Sam could do better than anyone.    Yes?  Maester Aemon prompted.  Jon glanced warily at Chett, standing beside the door, his boils red and angry.  He could help you,  he said quickly.  He can do sums, and he knows how to read and write. I know Chett can’t read, and Clydas has weak eyes. Sam read every book in his father’s library. He’d be good with the ravens too. Animals seem to like him. Ghost took to him straight off. There’s a lot he could do, besides fighting. The Night’s Watch needs every man. Why kill one, to no end? Make use of him instead.   Maester Aemon closed his eyes, and for a brief moment Jon was afraid that he had gone to sleep. Finally he said,  Maester Luwin taught you well, Jon Snow. Your mind is as deft as your blade, it would seem.    Does that mean…    It means I shall think on what you have said,  the maester told him firmly.  And now, I believe I am ready to sleep. Chett, show our young brother to the door.       TYRION  They had taken shelter beneath a copse of aspens just off the high road. Tyrion was gathering deadwood while their horses took water from a mountain stream. He stooped to pick up a splintered branch and examined it critically.  Will this do? I am not practiced at starting fires. Morrec did that for me.    A fire?  Bronn said, spitting.  Are you so hungry to die, dwarf? Or have you taken leave of your senses? A fire will bring the clansmen down on us from miles around. I mean to survive this journey, Lannister.    And how do you hope to do that?  Tyrion asked. He tucked the branch under his arm and poked around through the sparse undergrowth, looking for more. His back ached from the effort of bending; they had been riding since daybreak, when a stone-faced Ser Lyn Corbray had ushered them through the Bloody Gate and commanded them never to return.   We have no chance of fighting our way back,  Bronn said,  but two can cover more ground than ten, and attract less notice. The fewer days we spend in these mountains, the more like we are to reach the riverlands. Ride hard and fast, I say. Travel by night and hole up by day, avoid the road where we can, make no noise and light no fires.   Tyrion Lannister sighed.  A splendid plan, Bronn. Try it, as you like… and forgive me if I do not linger to bury you.    You think to outlive me, dwarf?  The sellsword grinned. He had a dark gap in his smile where the edge of Ser Vardis Egen’s shield had cracked a tooth in half.  Tyrion shrugged.  Riding hard and fast by night is a sure way to tumble down a mountain and crack your skull. I prefer to make my crossing slow and easy. I know you love the taste of horse, Bronn, but if our mounts die under us this time, we’ll be trying to saddle shadowcats… and if truth be told, I think the clans will find us no matter what we do. Their eyes are all around us.  He swept a gloved hand over the high, wind-carved crags that surrounded them.  Bronn grimaced.  Then we’re dead men, Lannister.    If so, I prefer to die comfortable,  Tyrion replied.  We need a fire. The nights are cold up here, and hot food will warm our bellies and lift our spirits. Do you suppose there’s any game to be had? Lady Lysa has kindly provided us with a veritable feast of salt beef, hard cheese, and stale bread, but I would hate to break a tooth so far from the nearest maester.    I can find meat.  Beneath a fall of black hair, Bronn’s dark eyes regarded Tyrion suspiciously.  I should leave you here with your fool’s fire. If I took your horse, I’d have twice the chance to make it through. What would you do then, dwarf?    Die, most like.  Tyrion stooped to get another stick.   You don’t think I’d do it?    You’d do it in an instant, if it meant your life. You were quick enough to silence your friend Chiggen when he caught that arrow in his belly.  Bronn had yanked back the man’s head by the hair and driven the point of his dirk in under the ear, and afterward told Catelyn Stark that the other sellsword had died of his wound.   He was good as dead,  Bronn said,  and his moaning was bringing them down on us. Chiggen would have done the same for me… and he was no friend, only a man I rode with."
}