{
  "id": "c68e940e60a871d382b97c767afe9fbb8bc0e0f2",
  "text": " She was always so calm, Catelyn thought, remembering her mother’s soft hands, her warm smile. If she had lived, how different our lives might have been. She wondered what Lady Minisa would make of her eldest daughter, kneeling here before her. I have come so many thousands of leagues, and for what? Who have I served? I have lost my daughters, Robb does not want me, and Bran and Rickon must surely think me a cold and unnatural mother. I was not even with Ned when he died…  Her head swam, and the sept seemed to move around her. The shadows swayed and shifted, furtive animals racing across the cracked white walls. Catelyn had not eaten today. Perhaps that had been unwise. She told herself that there had been no time, but the truth was that food had lost its savor in a world without Ned. When they took his head off, they killed me too.  Behind her the torch spit, and suddenly it seemed to her that it was her sister’s face on the wall, though the eyes were harder than she recalled, not Lysa’s eyes but Cersei’s. Cersei is a mother too. No matter who fathered those children, she felt them kick inside her, brought them forth with her pain and blood, nursed them at her breast. If they are truly Jaime’s…   Does Cersei pray to you too, my lady?  Catelyn asked the Mother. She could see the proud, cold, lovely features of the Lannister queen etched upon the wall. The crack was still there; even Cersei could weep for her children.  Each of the Seven embodies all of the Seven,  Septon Osmynd had told her once. There was as much beauty in the Crone as in the Maiden, and the Mother could be fiercer than the Warrior when her children were in danger. Yes…  She had seen enough of Robert Baratheon at Winterfell to know that the king did not regard Joffrey with any great warmth. If the boy was truly Jaime’s seed, Robert would have put him to death along with his mother, and few would have condemned him. Bastards were common enough, but incest was a monstrous sin to both old gods and new, and the children of such wickedness were named abominations in sept and godswood alike. The dragon kings had wed brother to sister, but they were the blood of old Valyria where such practices had been common, and like their dragons the Targaryens answered to neither gods nor men.  Ned must have known, and Lord Arryn before him. Small wonder that the queen had killed them both. Would I do any less for my own? Catelyn clenched her hands, feeling the tightness in her scarred fingers where the assassin’s steel had cut to the bone as she fought to save her son.  Bran knows too,  she whispered, lowering her head. Gods be good, he must have seen something, heard something, that was why they tried to kill him in his bed.  Lost and weary, Catelyn Stark gave herself over to her gods. She knelt before the Smith, who fixed things that were broken, and asked that he give her sweet Bran his protection. She went to the Maid and beseeched her to lend her courage to Arya and Sansa, to guard them in their innocence. To the Father, she prayed for justice, the strength to seek it and the wisdom to know it, and she asked the Warrior to keep Robb strong and shield him in his battles. Lastly she turned to the Crone, whose statues often showed her with a lamp in one hand.  Guide me, wise lady,  she prayed.  Show me the path I must walk, and do not let me stumble in the dark places that lie ahead.   Finally there were footsteps behind her, and a noise at the door.  My lady,  Ser Robar said gently,  pardon, but our time is at an end. We must be back before the dawn breaks.   Catelyn rose stiffly. Her knees ached, and she would have given much for a featherbed and a pillow just then.  Thank you, ser. I am ready.   They rode in silence through sparse woodland where the trees leaned drunkenly away from the sea. The nervous whinny of horses and the clank of steel guided them back to Renly’s camp. The long ranks of man and horse were armored in darkness, as black as if the Smith had hammered night itself into steel. There were banners to her right, banners to her left, and rank on rank of banners before her, but in the predawn gloom, neither colors nor sigils could be discerned. A grey army, Catelyn thought. Grey men on grey horses beneath grey banners. As they sat their horses waiting, Renly’s shadow knights pointed their lances upward, so she rode through a forest of tall naked trees, bereft of leaves and life. Where Storm’s End stood was only a deeper darkness, a wall of black through which no stars could shine, but she could see torches moving across the fields where Lord Stannis had made his camp.  The candles within Renly’s pavilion made the shimmering silken walls seem to glow, transforming the great tent into a magical castle alive with emerald light. Two of the Rainbow Guard stood sentry at the door to the royal pavilion. The green light shone strangely against the purple plums of Ser Parmen’s surcoat, and gave a sickly hue to the sunflowers that covered every inch of Ser Emmon’s enameled yellow plate."
}