{
  "id": "c69735c587c3a5a3f4f51180a1252654da373c54",
  "text": "  This is no toy for children, least of all for a girl. What would Septa Mordane say if she knew you were playing with swords?    I wasn’t playing,  Arya insisted.  I hate Septa Mordane.    That’s enough.  Her father’s voice was curt and hard.  The septa is doing no more than is her duty, though gods know you have made it a struggle for the poor woman. Your mother and I have charged her with the impossible task of making you a lady.    I don’t want to be a lady!  Arya flared.   I ought to snap this toy across my knee here and now, and put an end to this nonsense.    Needle wouldn’t break,  Arya said defiantly, but her voice betrayed her words.   It has a name, does it?  Her father sighed.  Ah, Arya. You have a wildness in you, child. ‘The wolf blood,’ my father used to call it. Lyanna had a touch of it, and my brother Brandon more than a touch. It brought them both to an early grave.  Arya heard sadness in his voice; he did not often speak of his father, or of the brother and sister who had died before she was born.  Lyanna might have carried a sword, if my lord father had allowed it. You remind me of her sometimes. You even look like her.    Lyanna was beautiful,  Arya said, startled. Everybody said so. It was not a thing that was ever said of Arya.   She was,  Eddard Stark agreed,  beautiful, and willful, and dead before her time.  He lifted the sword, held it out between them.  Arya, what did you think to do with this… Needle? Who did you hope to skewer? Your sister? Septa Mordane? Do you know the first thing about sword fighting?   All she could think of was the lesson Jon had given her.  Stick them with the pointy end,  she blurted out.  Her father snorted back laughter.  That is the essence of it, I suppose.   Arya desperately wanted to explain, to make him see.  I was trying to learn, but…  Her eyes filled with tears.  I asked Mycah to practice with me.  The grief came on her all at once. She turned away, shaking.  I asked him,  she cried.  It was my fault, it was me…   Suddenly her father’s arms were around her. He held her gently as she turned to him and sobbed against his chest.  No, sweet one,  he murmured.  Grieve for your friend, but never blame yourself. You did not kill the butcher’s boy. That murder lies at the Hound’s door, him and the cruel woman he serves.    I hate them,  Arya confided, red-faced, sniffling.  The Hound and the queen and the king and Prince Joffrey. I hate all of them. Joffrey lied, it wasn’t the way he said. I hate Sansa too. She did remember, she just lied so Joffrey would like her.    We all lie,  her father said.  Or did you truly think I’d believe that Nymeria ran off?   Arya blushed guiltily.  Jory promised not to tell.    Jory kept his word,  her father said with a smile.  There are some things I do not need to be told. Even a blind man could see that wolf would never have left you willingly.    We had to throw rocks,  she said miserably.  I told her to run, to go be free, that I didn’t want her anymore. There were other wolves for her to play with, we heard them howling, and Jory said the woods were full of game, so she’d have deer to hunt. Only she kept following, and finally we had to throw rocks. I hit her twice. She whined and looked at me and I felt so ’shamed, but it was right, wasn’t it? The queen would have killed her.    It was right,  her father said.  And even the lie was… not without honor.  He’d put Needle aside when he went to Arya to embrace her. Now he took the blade up again and walked to the window, where he stood for a moment, looking out across the courtyard. When he turned back, his eyes were thoughtful. He seated himself on the window seat, Needle across his lap.  Arya, sit down. I need to try and explain some things to you.   She perched anxiously on the edge of her bed.  You are too young to be burdened with all my cares,  he told her,  but you are also a Stark of Winterfell. You know our words.    Winter is coming,  Arya whispered.   The hard cruel times,  her father said.  We tasted them on the Trident, child, and when Bran fell. You were born in the long summer, sweet one, you’ve never known anything else, but now the winter is truly coming. Remember the sigil of our House, Arya.    The direwolf,  she said, thinking of Nymeria. She hugged her knees against her chest, suddenly afraid.   Let me tell you something about wolves, child. When the snows fall and the white winds blow, the lone wolf dies, but the pack survives. Summer is the time for squabbles. In winter, we must protect one another, keep each other warm, share our strengths. So if you must hate, Arya, hate those who would truly do us harm. Septa Mordane is a good woman, and Sansa… Sansa is your sister. You may be as different as the sun and the moon, but the same blood flows through both your hearts. You need her, as she needs you… and I need both of you, gods help me.   He sounded so tired that it made Arya sad.  I don’t hate Sansa,  she told him.  Not truly.  It was only half a lie."
}