{
  "id": "c6c765e72cf0e23be261039f90b3d074cf090c19",
  "text": " Varys blew out the candle and set it on a beam and Tyrion gazed about. A mule and three horses occupied the stalls. He waddled over to the piebald gelding and took a look at his teeth.  Old,  he said,  and I have my doubts about his wind.    He is not a mount to carry you into battle, true,  Varys replied,  but he will serve, and attract no notice. As will the others. And the stableboys see and hear only the animals.  The eunuch took a cloak from a peg. It was roughspun, sun-faded, and threadbare, but very ample in its cut.  If you will permit me.  When he swept it over Tyrion’s shoulders it enveloped him head to heel, with a cowl that could be pulled forward to drown his face in shadows.  Men see what they expect to see,  Varys said as he fussed and pulled.  Dwarfs are not so common a sight as children, so a child is what they will see. A boy in an old cloak on his father’s horse, going about his father’s business. Though it would be best if you came most often by night.    I plan to… after today. At the moment, though, Shae awaits me.  He had put her up in a walled manse at the far northeast corner of King’s Landing, not far from the sea, but he had not dared visit her there for fear of being followed.   Which horse will you have?   Tyrion shrugged.  This one will do well enough.    I shall saddle him for you.  Varys took tack and saddle down from a peg.  Tyrion adjusted the heavy cloak and paced restlessly.  You missed a lively council. Stannis has crowned himself, it seems.    I know.    He accuses my brother and sister of incest. I wonder how he came by that suspicion.    Perhaps he read a book and looked at the color of a bastard’s hair, as Ned Stark did, and Jon Arryn before him. Or perhaps someone whispered it in his ear.  The eunuch’s laugh was not his usual giggle, but deeper and more throaty.   Someone like you, perchance?    Am I suspected? It was not me.    If it had been, would you admit it?    No. But why should I betray a secret I have kept so long? It is one thing to deceive a king, and quite another to hide from the cricket in the rushes and the little bird in the chimney. Besides, the bastards were there for all to see.    Robert’s bastards? What of them?    He fathered eight, to the best of my knowing,  Varys said as he wrestled with the saddle.  Their mothers were copper and honey, chestnut and butter, yet the babes were all black as ravens… and as ill-omened, it would seem. So when Joffrey, Myrcella, and Tommen slid out between your sister’s thighs, each as golden as the sun, the truth was not hard to glimpse.   Tyrion shook his head. If she had borne only one child for her husband, it would have been enough to disarm suspicion… but then she would not have been Cersei.  If you were not this whisperer, who was?    Some traitor, doubtless.  Varys tightened the cinch.   Littlefinger?    I named no name.   Tyrion let the eunuch help him mount.  Lord Varys,  he said from the saddle,  sometimes I feel as though you are the best friend I have in King’s Landing, and sometimes I feel you are my worst enemy.    How odd. I think quite the same of you.       BRAN  Long before the first pale fingers of light pried apart Bran’s shutters, his eyes were open.  There were guests in Winterfell, visitors come for the harvest feast. This morning they would be tilting at quintains in the yard. Once that prospect would have filled him with excitement, but that was before.  Not now. The Walders would break lances with the squires of Lord Manderly’s escort, but Bran would have no part of it. He must play the prince in his father’s solar.  Listen, and it may be that you will learn something of what lordship is all about,  Maester Luwin had said.  Bran had never asked to be a prince. It was knighthood he had always dreamed of; bright armor and streaming banners, lance and sword, a warhorse between his legs. Why must he waste his days listening to old men speak of things he only half understood? Because you’re broken, a voice inside reminded him. A lord on his cushioned chair might be crippled—the Walders said their grandfather was so feeble he had to be carried everywhere in a litter—but not a knight on his destrier. Besides, it was his duty.  You are your brother’s heir and the Stark in Winterfell,  Ser Rodrik said, reminding him of how Robb used to sit with their lord father when his bannermen came to see him.  Lord Wyman Manderly had arrived from White Harbor two days past, traveling by barge and litter, as he was too fat to sit a horse. With him had come a long tail of retainers: knights, squires, lesser lords and ladies, heralds, musicians, even a juggler, all aglitter with banners and surcoats in what seemed half a hundred colors. Bran had welcomed them to Winterfell from his father’s high stone seat with the direwolves carved into the arms, and afterward Ser Rodrik had said he’d done well. If that had been the end of it, he would not have minded. But it was only the beginning.   The feast makes a pleasant pretext,  Ser Rodrik explained,  but a man does not cross a hundred leagues for a sliver of duck and a sip of wine."
}