{
  "id": "c6e4b4d78183532d92e8a994ad8bc7e025261bd8",
  "text": " Finally he said,  This seller of poisons ran from the moon of my life. Better he should run after her. So he will. Jhogo, Jorah the Andal, to each of you I say, choose any horse you wish from my herds, and it is yours. Any horse save my red and the silver that was my bride gift to the moon of my life. I make this gift to you for what you did.   And to Rhaego son of Drogo, the stallion who will mount the world, to him I also pledge a gift. To him I will give this iron chair his mother’s father sat in. I will give him Seven Kingdoms. I, Drogo, khal, will do this thing.  His voice rose, and he lifted his fist to the sky.  I will take my khalasar west to where the world ends, and ride the wooden horses across the black salt water as no khal has done before. I will kill the men in the iron suits and tear down their stone houses. I will rape their women, take their children as slaves, and bring their broken gods back to Vaes Dothrak to bow down beneath the Mother of Mountains. This I vow, I, Drogo son of Bharbo. This I swear before the Mother of Mountains, as the stars look down in witness.   His khalasar left Vaes Dothrak two days later, striking south and west across the plains. Khal Drogo led them on his great red stallion, with Daenerys beside him on her silver. The wineseller hurried behind them, naked, on foot, chained at throat and wrists. His chains were fastened to the halter of Dany’s silver. As she rode, he ran after her, barefoot and stumbling. No harm would come to him… so long as he kept up.      CATELYN  It was too far to make out the banners clearly, but even through the drifting fog she could see that they were white, with a dark smudge in their center that could only be the direwolf of Stark, grey upon its icy field. When she saw it with her own eyes, Catelyn reined up her horse and bowed her head in thanks. The gods were good. She was not too late.   They await our coming, my lady,  Ser Wylis Manderly said,  as my lord father swore they would.    Let us not keep them waiting any longer, ser.  Ser Brynden Tully put the spurs to his horse and trotted briskly toward the banners. Catelyn rode beside him.  Ser Wylis and his brother Ser Wendel followed, leading their levies, near fifteen hundred men: some twenty-odd knights and as many squires, two hundred mounted lances, swordsmen, and freeriders, and the rest foot, armed with spears, pikes and tridents. Lord Wyman had remained behind to see to the defenses of White Harbor. A man of near sixty years, he had grown too stout to sit a horse.  If I had thought to see war again in my lifetime, I should have eaten a few less eels,  he’d told Catelyn when he met her ship, slapping his massive belly with both hands. His fingers were fat as sausages.  My boys will see you safe to your son, though, have no fear.   His  boys  were both older than Catelyn, and she might have wished that they did not take after their father quite so closely. Ser Wylis was only a few eels short of not being able to mount his own horse; she pitied the poor animal. Ser Wendel, the younger boy, would have been the fattest man she’d ever known, had she only neglected to meet his father and brother. Wylis was quiet and formal, Wendel loud and boisterous; both had ostentatious walrus mustaches and heads as bare as a baby’s bottom; neither seemed to own a single garment that was not spotted with food stains. Yet she liked them well enough; they had gotten her to Robb, as their father had vowed, and nothing else mattered.  She was pleased to see that her son had sent eyes out, even to the east. The Lannisters would come from the south when they came, but it was good that Robb was being careful. My son is leading a host to war, she thought, still only half believing it. She was desperately afraid for him, and for Winterfell, yet she could not deny feeling a certain pride as well. A year ago he had been a boy. What was he now? she wondered.  Outriders spied the Manderly banners—the white merman with trident in hand, rising from a blue-green sea—and hailed them warmly. They were led to a spot of high ground dry enough for a camp. Ser Wylis called a halt there, and remained behind with his men to see the fires laid and the horses tended, while his brother Wendel rode on with Catelyn and her uncle to present their father’s respects to their liege lord.  The ground under their horses’ hooves was soft and wet. It fell away slowly beneath them as they rode past smoky peat fires, lines of horses, and wagons heavy-laden with hardbread and salt beef. On a stony outcrop of land higher than the surrounding country, they passed a lord’s pavilion with walls of heavy sailcloth. Catelyn recognized the banner, the bull moose of the Hornwoods, brown on its dark orange field.  Just beyond, through the mists, she glimpsed the walls and towers of Moat Cailin… or what remained of them. Immense blocks of black basalt, each as large as a crofter’s cottage, lay scattered and tumbled like a child’s wooden blocks, half-sunk in the soft boggy soil."
}