{
  "id": "c727beae349ba42a02ae499495ecaeb363187241",
  "text": " She touched one, the largest of the three, running her hand lightly over the shelf. Black-and-scarlet, she thought, like the dragon in my dream. The stone felt strangely warm beneath her fingers… or was she still dreaming? She pulled her hand back nervously.  From that hour onward, each day was easier than the one before it. Her legs grew stronger; her blisters burst and her hands grew callused; her soft thighs toughened, supple as leather.  The khal had commanded the handmaid Irri to teach Dany to ride in the Dothraki fashion, but it was the filly who was her real teacher. The horse seemed to know her moods, as if they shared a single mind. With every passing day, Dany felt surer in her seat. The Dothraki were a hard and unsentimental people, and it was not their custom to name their animals, so Dany thought of her only as the silver. She had never loved anything so much.  As the riding became less an ordeal, Dany began to notice the beauties of the land around her. She rode at the head of the khalasar with Drogo and his bloodriders, so she came to each country fresh and unspoiled. Behind them the great horde might tear the earth and muddy the rivers and send up clouds of choking dust, but the fields ahead of them were always green and verdant.  They crossed the rolling hills of Norvos, past terraced farms and small villages where the townsfolk watched anxiously from atop white stucco walls. They forded three wide placid rivers and a fourth that was swift and narrow and treacherous, camped beside a high blue waterfall, skirted the tumbled ruins of a vast dead city where ghosts were said to moan among blackened marble columns. They raced down Valyrian roads a thousand years old and straight as a Dothraki arrow. For half a moon, they rode through the Forest of Qohor, where the leaves made a golden canopy high above them, and the trunks of the trees were as wide as city gates. There were great elk in that wood, and spotted tigers, and lemurs with silver fur and huge purple eyes, but all fled before the approach of the khalasar and Dany got no glimpse of them.  By then her agony was a fading memory. She still ached after a long day’s riding, yet somehow the pain had a sweetness to it now, and each morning she came willingly to her saddle, eager to know what wonders waited for her in the lands ahead. She began to find pleasure even in her nights, and if she still cried out when Drogo took her, it was not always in pain.  At the bottom of the ridge, the grasses rose around her, tall and supple. Dany slowed to a trot and rode out onto the plain, losing herself in the green, blessedly alone. In the khalasar she was never alone. Khal Drogo came to her only after the sun went down, but her handmaids fed her and bathed her and slept by the door of her tent, Drogo’s bloodriders and the men of her khas were never far, and her brother was an unwelcome shadow, day and night. Dany could hear him on the top of the ridge, his voice shrill with anger as he shouted at Ser Jorah. She rode on, submerging herself deeper in the Dothraki sea.  The green swallowed her up. The air was rich with the scents of earth and grass, mixed with the smell of horseflesh and Dany’s sweat and the oil in her hair. Dothraki smells. They seemed to belong here. Dany breathed it all in, laughing. She had a sudden urge to feel the ground beneath her, to curl her toes in that thick black soil. Swinging down from her saddle, she let the silver graze while she pulled off her high boots.  Viserys came upon her as sudden as a summer storm, his horse rearing beneath him as he reined up too hard.  You dare!  he screamed at her.  You give commands to me? To me?  He vaulted off the horse, stumbling as he landed. His face was flushed as he struggled back to his feet. He grabbed her, shook her.  Have you forgotten who you are? Look at you. Look at you!   Dany did not need to look. She was barefoot, with oiled hair, wearing Dothraki riding leathers and a painted vest given her as a bride gift. She looked as though she belonged here. Viserys was soiled and stained in city silks and ringmail.  He was still screaming.  You do not command the dragon. Do you understand? I am the Lord of the Seven Kingdoms, I will not hear orders from some horselord’s slut, do you hear me?  His hand went under her vest, his fingers digging painfully into her breast.  Do you hear me?   Dany shoved him away, hard.  Viserys stared at her, his lilac eyes incredulous. She had never defied him. Never fought back. Rage twisted his features. He would hurt her now, and badly, she knew that.  Crack.  The whip made a sound like thunder. The coil took Viserys around the throat and yanked him backward. He went sprawling in the grass, stunned and choking. The Dothraki riders hooted at him as he struggled to free himself. The one with the whip, young Jhogo, rasped a question. Dany did not understand his words, but by then Irri was there, and Ser Jorah, and the rest of her khas.  Jhogo asks if you would have him dead, Khaleesi,  Irri said."
}