{
  "id": "c7c35a4f581c72bd7f131e63e92fdf4d4ae44b4f",
  "text": " She couldn’t let them see, or they’d marry her to Joffrey and make her lay with him.  Snatching up her knife, Sana hacked at the sheet, cutting out the stain. If they ask me about the hole, what will I say? Tears ran down her face. She pulled the torn sheet from the bed, and the stained blanket as well. I’ll have to burn them. She balled up the evidence, stuffed it in the fireplace, drenched it in oil from her bedside lamp, and lit it afire. Then she realized that the blood had soaked through the sheet into the featherbed, so she bundled that up as well, but it was big and cumbersome, hard to move. Sansa could get only half of it into the fire. She was on her knees, struggling to shove the mattress into the flames as thick grey smoke eddied around her and filled the room, when the door burst open and she heard her maid gasp.  In the end it took three of them to pull her away. And it was all for nothing. The bedclothes were burnt, but by the time they carried her off her thighs were bloody again. It was as if her own body had betrayed her to Joffrey, unfurling a banner of Lannister crimson for all the world to see.  When the fire was out, they carried off the singed featherbed, fanned away the worst of the smoke, and brought up a tub. Women came and went, muttering and looking at her strangely. They filled the tub with scalding hot water, bathed her and washed her hair and gave her a cloth to wear between her legs. By then Sansa was calm again, and ashamed for her folly. The smoke had ruined most of her clothing. One of the women went away and came back with a green wool shift that was almost her size.  It’s not as pretty as your own things, but it will serve,  she announced when she’d pulled it down over Sansa’s head.  Your shoes weren’t burned, so at least you won’t need to go barefoot to the queen.   Cersei Lannister was breaking her fast when Sansa was ushered into her solar.  You may sit,  the queen said graciously.  Are you hungry?  She gestured at the table. There was porridge, honey, milk, boiled eggs, and crisp fried fish.  The sight of the food made Sansa feel ill. Her tummy was tied in a knot.  No, thank you, Your Grace.    I don’t blame you. Between Tyrion and Lord Stannis, everything I eat tastes of ash. And now you’re setting fires as well. What did you hope to accomplish?   Sansa lowered her head.  The blood frightened me.    The blood is the seal of your womanhood. Lady Catelyn might have prepared you. You’ve had your first flowering, no more.   Sansa had never felt less flowery.  My lady mother told me, but I… I thought it would be different.    Different how?    I don’t know. Less… less messy, and more magical.   Queen Cersei laughed.  Wait until you birth a child, Sansa. A woman’s life is nine parts mess to one part magic, you’ll learn that soon enough… and the parts that look like magic often turn out to be messiest of all.  She took a sip of milk.  So now you are a woman. Do you have the least idea of what that means?    It means that I am now fit to be wedded and bedded,  said Sansa,  and to bear children for the king.   The queen gave a wry smile.  A prospect that no longer entices you as it once did, I can see. I will not fault you for that. Joffrey has always been difficult. Even his birth… I labored a day and a half to bring him forth. You cannot imagine the pain, Sansa. I screamed so loudly that I fancied Robert might hear me in the kingswood.    His Grace was not with you?    Robert? Robert was hunting. That was his custom. Whenever my time was near, my royal husband would flee to the trees with his huntsmen and hounds. When he returned he would present me with some pelts or a stag’s head, and I would present him with a baby.   Not that I wanted him to stay, mind you. I had Grand Maester Pycelle and an army of midwives, and I had my brother. When they told Jaime he was not allowed in the birthing room, he smiled and asked which of them proposed to keep him out.   Joffrey will show you no such devotion, I fear. You could thank your sister for that, if she weren’t dead. He’s never been able to forget that day on the Trident when you saw her shame him, so he shames you in turn. You’re stronger than you seem, though. I expect you’ll survive a bit of humiliation. I did. You may never love the king, but you’ll love his children.    I love His Grace with all my heart,  Sansa said.  The queen sighed.  You had best learn some new lies, and quickly. Lord Stannis will not like that one, I promise you.    The new High Septon said that the gods will never permit Lord Stannis to win, since Joffrey is the rightful king.   A half smile flickered across the queen’s face.  Robert’s trueborn son and heir. Though Joff would cry whenever Robert picked him up. His Grace did not like that. His bastards had always gurgled at him happily, and sucked his finger when he put it in their little baseborn mouths. Robert wanted smiles and cheers, always, so he went where he found them, to his friends and his whores."
}