{
  "id": "c9593c811cd318be028ab5c2c83719f32e5e00a0",
  "text": " After ten years, few traces of the war remained. The smallfolk had built new hovels with the stones of the old, and cut fresh sod for their roofs. A new inn had risen beside the landing, twice the size of the old one, with a lower story of cut stone and two upper stories of timber. The sept beyond had never been rebuilt, though; only a seven-sided foundation remained where it had stood. Robert Baratheon’s fury had soured the ironmen’s taste for the new gods, it would seem.  Theon was more interested in ships than gods. Among the masts of countless fishing boats, he spied a Tyroshi trading galley off-loading beside a lumbering Ibbenese cog with her black-tarred hull. A great number of longships, fifty or sixty at the least, stood out to sea or lay beached on the pebbled shore to the north. Some of the sails bore devices from the other islands; the blood moon of Wynch, Lord Goodbrother’s banded black warhorn, Harlaw’s silver scythe. Theon searched for his uncle Euron’s Silence. Of that lean and terrible red ship he saw no sign, but his father’s Great Kraken was there, her bow ornamented with a grey iron ram in the shape of its namesake.  Had Lord Balon anticipated him and called the Greyjoy banners? His hand went inside his cloak again, to the oilskin pouch. No one knew of his letter but Robb Stark; they were no fools, to entrust their secrets to a bird. Still, Lord Balon was no fool either. He might well have guessed why his son was coming home at long last, and acted accordingly.  The thought did not please him. His father’s war was long done, and lost. This was Theon’s hour—his plan, his glory, and in time his crown. Yet if the longships are hosting…  It might be only a caution, now that he thought on it. A defensive move, lest the war spill out across the sea. Old men were cautious by nature. His father was old now, and so too his uncle Victarion, who commanded the Iron Fleet. His uncle Euron was a different song, to be sure, but the Silence did not seem to be in port. It’s all for the good, Theon told himself. This way, I shall be able to strike all the more quickly.  As the Myraham made her way landward, Theon paced the deck restlessly, scanning the shore. He had not thought to find Lord Balon himself at quayside, but surely his father would have sent someone to meet him. Sylas Sourmouth the steward, Lord Botley, perhaps even Dagmer Cleftjaw. It would be good to look on Dagmer’s hideous old face again. It was not as though they had no word of his arrival. Robb had sent ravens from Riverrun, and when they’d found no longship at Seagard, Jason Mallister had sent his own birds to Pyke, supposing that Robb’s were lost.  Yet he saw no familiar faces, no honor guard waiting to escort him from Lordsport to Pyke, only smallfolk going about their small business. Shorehands rolled casks of wine off the Tyroshi trader, fisherfolk cried the day’s catch, children ran and played. A priest in the seawater robes of the Drowned God was leading a pair of horses along the pebbled shore, while above him a slattern leaned out a window in the inn, calling out to some passing Ibbenese sailors.  A handful of Lordsport merchants had gathered to meet the ship. They shouted questions as the Myraham was tying up.  We’re out of Oldtown,  the captain called down,  bearing apples and oranges, wines from the Arbor, feathers from the Summer Isles. I have pepper, woven leathers, a bolt of Myrish lace, mirrors for milady, a pair of Oldtown woodharps sweet as any you ever heard.  The gangplank descended with a creak and a thud.  And I’ve brought your heir back to you.   The Lordsport men gazed on Theon with blank, bovine eyes, and he realized that they did not know who he was. It made him angry. He pressed a golden dragon into the captain’s palm.  Have your men bring my things.  Without waiting for a reply, he strode down the gangplank.  Innkeeper,  he barked,  I require a horse.    As you say, m’lord,  the man responded, without so much as a bow. He had forgotten how bold the ironborn could be.  Happens as I have one might do. Where would you be riding, m’lord?    Pyke.  The fool still did not know him. He should have worn his good doublet, with the kraken embroidered on the breast.   You’ll want to be off soon, to reach Pyke afore dark,  the innkeeper said.  My boy will go with you and show you the way.    Your boy will not be needed,  a deep voice called,  nor your horse. I shall see my nephew back to his father’s house.   The speaker was the priest he had seen leading the horses along the shoreline. As the man approached, the smallfolk bent the knee, and Theon heard the innkeeper murmur,  Damphair.   Tall and thin, with fierce black eyes and a beak of a nose, the priest was garbed in mottled robes of green and grey and blue, the swirling colors of the Drowned God. A waterskin hung under his arm on a leather strap, and ropes of dried seaweed were braided through his waist-long black hair and untrimmed beard.  A memory prodded at Theon."
}