{
  "id": "c9b018528fcdc536d903bb7c0efb1cf1e92f7cc5",
  "text": " And my name is—    —Brienne, I know. I’ll swear an oath not to harm you, if that will ease your girlish fears.    Your oaths are worthless. You swore an oath to Aerys.    You haven’t cooked anyone in their armor so far as I know. And we both want me safe and whole in King’s Landing, don’t we?  He squatted beside Cleos and began to undo his swordbelt.   Step away from him. Now. Stop that.   Jaime was tired. Tired of her suspicions, tired of her insults, tired of her crooked teeth and her broad spotty face and that limp thin hair of hers. Ignoring her protests, he grasped the hilt of his cousin’s longsword with both hands, held the corpse down with his foot, and pulled. As the blade slid from the scabbard, he was already pivoting, bringing the sword around and up in a swift deadly arc. Steel met steel with a ringing, bone-jarring clang. Somehow Brienne had gotten her own blade out in time. Jaime laughed.  Very good, wench.    Give me the sword, Kingslayer.    Oh, I will.  He sprang to his feet and drove at her, the longsword alive in his hands. Brienne jumped back, parrying, but he followed, pressing the attack. No sooner did she turn one cut than the next was upon her. The swords kissed and sprang apart and kissed again. Jaime’s blood was singing. This was what he was meant for; he never felt so alive as when he was fighting, with death balanced on every stroke. And with my wrists chained together, the wench may even give me a contest for a time. His chains forced him to use a two-handed grip, though of course the weight and reach were less than if the blade had been a true two-handed greatsword, but what did it matter? His cousin’s sword was long enough to write an end to this Brienne of Tarth.  High, low, overhand, he rained down steel upon her. Left, right, backslash, swinging so hard that sparks flew when the swords came together, upswing, sideslash, overhand, always attacking, moving into her, step and slide, strike and step, step and strike, hacking, slashing, faster, faster, faster…  …until, breathless, he stepped back and let the point of the sword fall to the ground, giving her a moment of respite.  Not half bad,  he acknowledged.  For a wench.   She took a slow deep breath, her eyes watching him warily.  I would not hurt you, Kingslayer.    As if you could.  He whirled the blade back up above his head and flew at her again, chains rattling.  Jaime could not have said how long he pressed the attack. It might have been minutes or it might have been hours; time slept when swords woke. He drove her away from his cousin’s corpse, drove her across the road, drove her into the trees. She stumbled once on a root she never saw, and for a moment he thought she was done, but she went to one knee instead of falling, and never lost a beat. Her sword leapt up to block a downcut that would have opened her from shoulder to groin, and then she cut at him, again and again, fighting her way back to her feet stroke by stroke.  The dance went on. He pinned her against an oak, cursed as she slipped away, followed her through a shallow brook half-choked with fallen leaves. Steel rang, steel sang, steel screamed and sparked and scraped, and the woman started grunting like a sow at every crash, yet somehow he could not reach her. It was as if she had an iron cage around her that stopped every blow.   Not bad at all,  he said when he paused for a second to catch his breath, circling to her right.   For a wench?    For a squire, say. A green one.  He laughed a ragged, breathless laugh.  Come on, come on, my sweetling, the music’s still playing. Might I have this dance, my lady?   Grunting, she came at him, blade whirling, and suddenly it was Jaime struggling to keep steel from skin. One of her slashes raked across his brow, and blood ran down into his right eye. The Others take her, and Riverrun as well! His skills had gone to rust and rot in that bloody dungeon, and the chains were no great help either. His eye closed, his shoulders were going numb from the jarring they’d taken, and his wrists ached from the weight of chains, manacles, and sword. His longsword grew heavier with every blow, and Jaime knew he was not swinging it as quickly as he’d done earlier, nor raising it as high.  She is stronger than I am.  The realization chilled him. Robert had been stronger than him, to be sure. The White Bull Gerold Hightower as well, in his heyday, and Ser Arthur Dayne. Amongst the living, Greatjon Umber was stronger, Strongboar of Crakehall most likely, both Cleganes for a certainty. The Mountain’s strength was like nothing human. It did not matter. With speed and skill, Jaime could beat them all. But this was a woman. A huge cow of a woman, to be sure, but even so… by rights, she should be the one wearing down.  Instead she forced him back into the brook again, shouting,  Yield! Throw down the sword!   A slick stone turned under Jaime’s foot. As he felt himself falling, he twisted the mischance into a diving lunge. His point scraped past her parry and bit into her upper thigh."
}