{
  "id": "ca257eefdd36fc7d3208eecace3c139f08c6ebdd",
  "text": "  We cannot stay here much longer, with autumn on us,  she told them.  A dozen wolves went down the Hayford road nine days past, hunting. If they’d chanced to look up they might have seen us.    You’ve not seen Lord Beric?  asked Tom Sevenstrings.   He’s dead.  The woman sounded sick.  The Mountain caught him, and drove a dagger through his eye. A begging brother told us. He had it from the lips of a man who saw it happen.    That’s an old stale tale, and false,  said Lem.  The lightning lord’s not so easy to kill. Ser Gregor might have put his eye out, but a man don’t die o’ that. Jack could tell you.    Well, I never did,  said one-eyed Jack-Be-Lucky.  My father got himself good and hanged by Lord Piper’s bailiff, my brother Wat got sent to the Wall, and the Lannisters killed my other brothers. An eye, that’s nothing.    You swear he’s not dead?  The woman clutched Lem’s arm.  Bless you, Lem, that’s the best tidings we’ve had in half a year. May the Warrior defend him, and the red priest too.   The next night they found shelter beneath the scorched shell of a sept, in a burned village called Sallydance. Only shards remained of its windows of leaded glass, and the aged septon who greeted them said the looters had even made off with the Mother’s costly robes, the Crone’s gilded lantern, and the silver crown the Father had worn.  They hacked the Maiden’s breasts off too, though those were only wood,  he told them.  And the eyes, the eyes were jet and lapis and mother-of-pearl, they pried them out with their knives. May the Mother have mercy on them all.    Whose work was this?  said Lem Lemoncloak.  Mummers?    No,  the old man said.  Northmen, they were. Savages who worship trees. They wanted the Kingslayer, they said.   Arya heard him, and chewed her lip. She could feel Gendry looking at her. It made her angry and ashamed.  There were a dozen men living in the vault beneath the sept, amongst cobwebs and roots and broken wine casks, but they had no word of Beric Dondarrion either. Not even their leader, who wore soot-blackened armor and a crude lightning bolt on his cloak. When Greenbeard saw Arya staring at him, he laughed and said,  The lightning lord is everywhere and nowhere, skinny squirrel.    I’m not a squirrel,  she said.  I’ll almost be a woman soon. I’ll be one-and-ten.    Best watch out I don’t marry you, then!  He tried to tickle her under the chin, but Arya slapped his stupid hand away.  Lem and Gendry played tiles with their hosts that night, while Tom Sevenstrings sang a silly song about Big Belly Ben and the High Septon’s goose. Anguy let Arya try his longbow, but no matter how hard she bit her lip she could not draw it.  You need a lighter bow, milady,  the freckled bowman said.  If there’s seasoned wood at Riverrun, might be I’ll make you one.   Tom overheard him, and broke off his song.  You’re a young fool, Archer. If we go to Riverrun it will only be to collect her ransom, won’t be no time for you to sit about making bows. Be thankful if you get out with your hide. Lord Hoster was hanging outlaws before you were shaving. And that son of his… a man who hates music can’t be trusted, I always say.    It’s not music he hates,  said Lem.  It’s you, fool.    Well, he has no cause. The wench was willing to make a man of him, is it my fault he drank too much to do the deed?   Lem snorted through his broken nose.  Was it you who made a song of it, or some other bloody arse in love with his own voice?    I only sang it the once,  Tom complained.  And who’s to say the song was about him? ’Twas a song about a fish.    A floppy fish,  said Anguy, laughing.  Arya didn’t care what Tom’s stupid songs were about. She turned to Harwin.  What did he mean about ransom?    We have sore need of horses, milady. Armor as well. Swords, shields, spears. All the things coin can buy. Aye, and seed for planting. Winter is coming, remember?  He touched her under the chin.  You will not be the first highborn captive we’ve ransomed. Nor the last, I’d hope.   That much was true, Arya knew. Knights were captured and ransomed all the time, and sometimes women were too. But what if Robb won’t pay their price? She wasn’t a famous knight, and kings were supposed to put the realm before their sisters. And her lady mother, what would she say? Would she still want her back, after all the things she’d done? Arya chewed her lip and wondered.  The next day they rode to a place called High Heart, a hill so lofty that from atop it Arya felt as though she could see half the world. Around its brow stood a ring of huge pale stumps, all that remained of a circle of once-mighty weirwoods. Arya and Gendry walked around the hill to count them. There were thirty-one, some so wide that she could have used them for a bed.  High Heart had been sacred to the children of the forest, Tom Sevenstrings told her, and some of their magic lingered here still.  No harm can ever come to those as sleep here,  the singer said. Arya thought that must be true; the hill was so high and the surrounding lands so flat that no enemy could approach unseen."
}