{
  "id": "ca44e5555d885e7b9f5a087fbff5edf1299e666d",
  "text": "  The crowd was jeering, some of them on their feet, as the woman swept out of the dungeon, and the boy continued to struggle. \"I'm your son!\" he screamed up at Crouch. \"I'm your son!\" \"You are no son of mine!\" bellowed Mr. Crouch, his eyes bulging suddenly.  \"I have no son!\" The wispy witch beside him gave a great gasp and slumped in her seat.  She had fainted.  Crouch appeared not to have noticed. \"Take them away!\" Crouch roared at the dementors, spit flying from his mouth.  \"Take them away, and may they rot there!\" \"Father!  Father, I wasn't involved!  No!  No!  Father, please!\" \"I think. Harry, it is time to return to my office,\" said a quiet voice in Harrys ear. Harry started.  He looked around.  Then he looked on his other side. There was an Albus Dumbledore sitting on his right, watching Crouch's son being dragged away by the dementors - and there was an Albus Dumbledore on his left, looking right at him. \"Come,\" said the Dumbledore on his left, and he put his hand under Harrys elbow. Harry felt himself rising into the air; the dungeon dissolved around him; for a moment, all was blackness, and then he felt as though he had done a slow-motion somersault, suddenly landing flat on his feet, in what seemed like the dazzling light of Dumbledore's sunlit office.  The stone basin was shimmering in the cabinet in front of him, and Albus Dumbledore was standing beside him. \"Professor,\" Harry gasped, \"I know I shouldn't've - I didn't mean - the cabinet door was sort of open and -\" \"I quite understand,\" said Dumbledore.  He lifted the basin, carried it over to his desk, placed it upon the polished top, and sat down in the chair behind it.  He motioned for Harry to sit down opposite him. Harry did so, staring at the stone basin.  The contents had returned to their original, silvery-white state, swirling and rippling beneath his gaze. \"What is it?\" Harry asked shakily. \"This?  It is called a Pensieve,\" said Dumbledore.  \"I sometimes find, and I am sure you know the feeling, that I simply have too many thoughts and memories crammed into my mind.\" \"Er,\" said Harry, who couldn't truthfully say that he had ever felt anything of the sort. \"At these times,\" said Dumbledore, indicating the stone basin, \"I use the Pensieve.  One simply siphons the excess thoughts from one's mind, pours them into the basin, and examines them at one's leisure.  It becomes easier to spot patterns and links, you understand, when they are in this form.\" \"You mean . . . that stuff's your thoughts?\"  Harry said, staring at the swirling white substance in the basin. \"Certainly,\" said Dumbledore. \"Let me show you.\" Dumbledore drew his wand out of the inside of his robes and placed the tip into his own silvery hair, near his temple.  When he took the wand away, hair seemed to be clinging to it - but then Harry saw that it was in fact a glistening strand of the same strange silvery-white substance that filled the Pensieve.  Dumbledore added this fresh thought to the basin, and Harry, astonished, saw his own face swimming around the surface of the bowl.  Dumbledore placed his long hands on either side of the Pensieve and swirled it, rather as a gold prospector would pan for fragments of gold.... and Harry saw his own face change smoothly into Snape's, who opened his mouth and spoke to the ceiling, his voice echoing slightly. \"It's coming back . . . Karkaroff's too . . . stronger and clearer than ever...\" \"A connection I could have made without assistance,\" Dumbledore sighed, \"but never mind.\"  He peered over the top of his half-moon spectacles at Harry, who was gaping at Snape's face, which was continuing to swirl around the bowl.  \"I was using the Pensieve when Mr. Fudge arrived for our meeting and put it away rather hastily.  Undoubtedly I did not fasten the cabinet door properly.  Naturally, it would have attracted your attention.\" \"I'm sorry,\" Harry mumbled. Dumbledore shook his head.  \"Curiosity is not a sin,\" he said. \"But we should exercise caution with our curiosity. . . yes, indeed ...\" Frowning slightly, he prodded the thoughts within the basin with the tip of his wand. Instantly, a figure rose out of it, a plump, scowling girl of about sixteen, who began to revolve slowly, with her feet still in the basin.  She took no notice whatsoever of Harry or Professor Dumbledore.  When she spoke, her voice echoed as Snape's had done, as though it were coming from the depths of the stone basin.  \"He put a hex on me, Professor Dumbledore, and I was only teasing him, sir, I only said I'd seen him kissing Florence behind the greenhouses last Thursday. . . .\" \"But why. Bertha,\" said Dumbledore sadly, looking up at the now silently revolving girl, \"why did you have to follow him in the first place?\" \"Bertha?\" Harry whispered, looking up at her.  \"Is that - was that Bertha Jorkins?\" \"Yes,\" said Dumbledore, prodding the thoughts in the basin again; Bertha sank back into them, and they became silvery and opaque once more.  \"That was Bertha as I remember her at school."
}