{
  "id": "caa13d346a1027f973f0235c2cd60fcc5dec2451",
  "text": "'       'Seven days,' said Faramir. 'But think not il l of me, if I say  to you:  they have brought me both a joy and a pain that I never thought to know. Joy  to see you; but pain, because now the fear  and doubt  of this evil time are  grown dark  indeed. Jowyn, I would  not have this world end now, or lose  so  soon what I have found.'       'Lose what you have found,  lord?' she answered; but she looked at  him  gravely and her eyes  were  kind. 'I know  not what in  these days you  have  found that you could lose. But come, my friend,  let us not speak of it! Let  us not speak at all! I  stand  upon some dreadful  brink,  and it is utterly  dark in the abyss before my feet, but whether there is any light behind me I  cannot tell. For I cannot turn yet. I wait for some stroke of doom.'       'Yes, we wait for the stroke of doom,' said Faramir.  And  they said no  more; and it seemed to them as  they stood upon the wall that the wind died,   and the light failed, and the Sun was bleared, and all sounds in the City or   in the  lands about were hushed: neither wind, nor voice , nor bird-call, nor   rustle  of leaf,  nor  their own breath could  be heard; the very beating of  their hearts was stilled. Time halted.       And as they stood so, their hands met and  clasped, though they did not  know  it.  And still  they waited for they   knew not what. Then presently it  seemed to them that above the ridges  of the distant  mountains another vast    ####-mountain of darkness  rose, towering up like a wave  that  should engulf the  world, and about it  lightnings flickered; and then a tremor ran through the  earth, and they felt the  walls of the City quiver. A sound like a sigh went  up from all the lands about them; and their hearts beat suddenly again.       'It  reminds me of N®menor,' said Faramir, and wondered to hear himself  speak.       'Of N®menor?' said Jowyn.       'Yes,' said Faramir, 'of the land of Westernesse that  foundered and of  the great dark wave climbing  over the green lands and above the hills,  and  coming on, darkness unescapable. I often dream of it.'       'Then  you  think that the  Darkness is coming?' said Jowyn.  'Darkness  Unescapable?' And suddenly she drew close to him.       'No,' said Faramir, looking into her face. 'It was but a picture in the  mind. I do not know what is happening. The reason of my waking mind tells  me  that great evil  has befallen and we  stand at the end of days. But my heart  says nay; and all my limbs are light, and a hope and joy are come to me that  no reason can deny. Jowyn, Jowyn, White Lady of Rohan, in this hour I do not  believe that any darkness will endure!' And he stooped and kissed her brow.        And so they stood on the walls of the City of Gondor,  and a great wind  rose and blew, and  their hair, raven  and golden, streamed out  mingling in  the air. And the Shadow departed, and the Sun was unveiled, and light leaped  forth; and the waters of Anduin shone like silver, and in all  the houses of  the  City  men  sang for  the joy that welled  up in their hearts  from what  source they could not tell.       And before the Sun had fallen far  from the noon out of  the East there  came a great Eagle flying, and he bore tidings beyond hope from the Lords of  the West, crying:       Sing now, ye people of the Tower of Anor,       for the Realm of Sauron is ended for ever,       and the Dark Tower is thrown down.         Sing and rejoice, ye people of the Tower of Guard,       for your watch hath not been in vain,       and the Black Gate is broken,       and your King hath passed through,       and he is victorious.   ####-       Sing and be glad, all ye children of the West,       for your King shall come again,       and he shall dwell among you       all the days of your life.         And the Tree that was withered shall be renewed,       and he shall plant it in the high places,       and the City shall be blessed.         Sing all ye people!       And the people sang in all the ways of the City.       The  days  that followed were golden,  and Spring and Summer joined and  made revel  together in  the fields of Gondor. And tidings now came by swift  riders from Cair  Andros of all  that  was done, and the City made ready for   the coming of the King. Merry was summoned and rode away with the wains  that  took store  of  goods to Osgiliath and thence by  ship  to Cair  Andros; but  Faramir did not go,  for now being healed he took upon him his authority and  the  Stewardship, although it was only for a little while, and his duty  was  to prepare for one who should replace him.       And Jowyn did not go, though her brother sent  word begging her to come  to  the  field of  Cormallen.  And Faramir  wondered at this, but he saw her   seldom, being  busy  with many matters; and she dwelt still in the Houses of  Healing and walked alone in the garden, and her face grew pale again, and it   seemed that  in  all the City she  only  was ailing  and sorrowful."
}