{
  "id": "cab514265c7caf64da275590abb2d25f2f887502",
  "text": "  I love your red hair. I love your mouth, and the way you kiss me. I love your smile. I love your teats.  He kissed them, one and then the other.  I love your skinny legs, and what’s between them.  He knelt to kiss her there, lightly on her mound at first, but Ygritte moved her legs apart a little, and he saw the pink inside and kissed that as well, and tasted her. She gave a little gasp.  If you love me all so much, why are you still dressed?  she whispered.  You know nothing, Jon Snow. Noth—oh. Oh. OHHH.   Afterward, she was almost shy, or as shy as Ygritte ever got.  That thing you did,  she said, when they lay together on their piled clothes.  With your… mouth.  She hesitated.  Is that… is it what lords do to their ladies, down in the south?    I don’t think so.  No one had ever told Jon just what lords did with their ladies.  I only… wanted to kiss you there, that’s all. You seemed to like it.    Aye. I… I liked it some. No one taught you such?    There’s been no one,  he confessed.  Only you.    A maid,  she teased.  You were a maid.   He gave her closest nipple a playful pinch.  I was a man of the Night’s Watch.  Was, he heard himself say. What was he now? He did not want to look at that.  Were you a maid?   Ygritte pushed herself onto an elbow.  I am nineteen, and a spearwife, and kissed by fire. How could I be maiden?    Who was he?    A boy at a feast, five years past. He’d come trading with his brothers, and he had hair like mine, kissed by fire, so I thought he would be lucky. But he was weak. When he came back t’ try and steal me, Longspear broke his arm and ran him off, and he never tried again, not once.    It wasn’t Longspear, then?  Jon was relieved. He liked Longspear, with his homely face and friendly ways.  She punched him.  That’s vile. Would you bed your sister?    Longspear’s not your brother.    He’s of my village. You know nothing, Jon Snow. A true man steals a woman from afar, t’ strengthen the clan. Women who bed brothers or fathers or clan kin offend the gods, and are cursed with weak and sickly children. Even monsters.    Craster weds his daughters,  Jon pointed out.  She punched him again.  Craster’s more your kind than ours. His father was a crow who stole a woman out of Whitetree village, but after he had her he flew back t’ his Wall. She went t’ Castle Black once t’ show the crow his son, but the brothers blew their horns and run her off. Craster’s blood is black, and he bears a heavy curse.  She ran her fingers lightly across his stomach.  I feared you’d do the same once. Fly back to the Wall. You never knew what t’ do after you stole me.   Jon sat up.  Ygritte, I never stole you.    Aye, you did. You jumped down the mountain and killed Orell, and afore I could get my axe you had a knife at my throat. I thought you’d have me then, or kill me, or maybe both, but you never did. And when I told you the tale o’ Bael the Bard and how he plucked the rose o’ Winterfell, I thought you’d know to pluck me then for certain, but you didn’t. You know nothing, Jon Snow.  She gave him a shy smile.  You might be learning some, though.   The light was shifting all about her, Jon noticed suddenly. He looked around.  We had best go up. The torch is almost done.    Is the crow afeared o’ Gendel’s children?  she said, with a grin.  It’s only a little way up, and I’m not done with you, Jon Snow.  She pushed him back down on the clothes and straddled him.  Would you…  She hesitated.   What?  he prompted, as the torch began to gutter.   Do it again?  Ygritte blurted.  With your mouth? The lord’s kiss? And I… I could see if you liked it any.   By the time the torch burned out, Jon Snow no longer cared.  His guilt came back afterward, but weaker than before. If this is so wrong, he wondered, why did the gods make it feel so good?  The grotto was pitch-dark by the time they finished. The only light was the dim glow of the passage back up to the larger cavern, where a score of fires burned. They were soon fumbling and bumping into each other as they tried to dress in the dark. Ygritte stumbled into the pool and screeched at the cold of the water. When Jon laughed, she pulled him in too. They wrestled and splashed in the dark, and then she was in his arms again, and it turned out they were not finished after all.   Jon Snow,  she told him, when he’d spent his seed inside her,  don’t move now, sweet. I like the feel of you in there, I do. Let’s not go back t’ Styr and Jarl. Let’s go down inside, and join up with Gendel’s children. I don’t ever want t’ leave this cave, Jon Snow. Not ever.       Daenerys    All?  The slave girl sounded wary.  Your Grace, did this one’s worthless ears mishear you?   Cool green light filtered down through the diamond-shaped panes of colored glass set in the sloping triangular walls, and a breeze was blowing gently through the terrace doors, carrying the scents of fruit and flowers from the garden beyond.  Your ears heard true,  said Dany.  I want to buy them all. Tell the Good Masters, if you will."
}