{
  "id": "cad2b460269d9a243df88efcabb54404e2887540",
  "text": " \"I believe I told you to sit down?\"  But Harry stayed where he was.  \"What's wrong with him?\"  Snape's black eyes glittered.  \"Nothing life-threatening,\" he said, looking as though he wished it were. \"Five more points from Gryffindor, and if I have to ask you to sit down again, it will be fifty.\"  Harry walked slowly to his seat and sat down. Snape looked around at the class.  \"As I was saying before Potter interrupted, Professor Lupin has not left any record of the topics you have covered so far --\"  \"Please, sir, we've done boggarts, Red Caps, kappas, and grindylows,\" said Hermione quickly, \"and we're just about to start --\"  \"Be quiet,\" said Snape coldly. \"I did not ask for information. I was merely commenting on Professor Lupin's lack of organization.\"  \"He's the best Defense Against the Dark Arts teacher we've ever had,\" said Dean Thomas boldly, and there was a murmur of agreement from the rest of the class. Snape looked more menacing than ever.  \"You are easily satisfied. Lupin is hardly overtaxing you -- I ,Would expect first years to be able to deal with Red Caps and grindylows. Today we shall discuss --\"  Harry watched him flick through the textbook, to the very back chapter, which he must know they hadn't covered.  \"Werewolves,\" said Snape.  \"But, sir,\" said Hermione, seemingly unable to restrain herself, \"we're not supposed to do werewolves yet, we're due to start hinkypunks --\"  \"Miss Granger,\" said Snape in a voice of deadly calm, \"I was under the impression that I am teaching this lesson, not you. And I am telling you all to turn to page 394.\" He glanced around again. 'All of you! Now!\"  With many bitter sidelong looks and some sullen muttering, the class opened their books.  \"Which of you can tell me how we distinguish between the werewolf and the true wolf?\" said Snape.  Everyone sat in motionless silence; everyone except Hermione, whose hand, as it so often did, had shot straight into the air.  \"Anyone?\" Snape said, ignoring Hermione. His twisted smile was back. \"Are you telling me that Professor Lupin hasn't even taught you the basic distinction between --\"  \"We told you,\" said Parvati suddenly, \"we haven't got as far as werewolves yet, we're still on --\"  \"Silence!\" snarled Snape. \"Well, well, well, I never thought I'd meet a third-year class who wouldn't even recognize a werewolf when they saw one. I shall make a point of informing Professor Dumbledore how very behind you all are....\"  \"Please, sir,\" said Hermione, whose hand was still in the air, \"the werewolf differs from the true wolf in several small ways. The snout of the werewolf --\"  \"That is the second time you have spoken out of turn, Miss Granger,\" said Snape coolly. \"Five more points from Gryffindor for being an insufferable know-it-all.\"  Hermione went very red, put down her hand, and stared at the floor with her eyes full of tears. It was a mark of how much the class loathed Snape that they were all glaring at him, because every one of them had called Hermione a know-it-all at least once, and Ron, who told Hermione she was a know-it-all at least twice a week, said loudly, \"You asked us a question and she knows the answer! Why ask if you don't want to be told?\"  The class knew instantly he'd gone too far. Snape advanced on Ron slowly, and the room held its breath.  \"Detention, Weasley,\" Snape said silkily, his face very close to Ron's. \"And if I ever hear you criticize the way I teach a class again, you will be very sorry indeed.\"  No one made a sound throughout the rest of the lesson. They sat and made notes on werewolves from the textbook, while Snape prowled up and down the rows of desks, examining the work they had been doing with Professor Lupin.  \"Very poorly explained... That is incorrect, the kappa is more commonly found in Mongolia.... Professor Lupin gave this eight out of ten? I wouldn't have given it three....\"  When the bell rang at last, Snape held them back.  \"You will each write an essay, to be handed in to me, on the ways you recognize and kill werewolves. I want two rolls of parchment or, the subject, and I want them by Monday morning. It is time somebody took this class in hand. Weasley, stay behind, we need to arrange your detention.\"  Harry and Hermione left the room with the rest of the class, who waited until they were well out of earshot, then burst into a furious tirade about Snape.  \"Snape's never been like this with any of our other Defense Against the Dark Arts teachers, even if he did want the job,\" Harry said to Hermione. \"Why's he got it in for Lupin? D'you think this is all because of the boggart?\"  \"I don't know,\" said Hermione pensively. \"But I really hope Professor Lupin gets better soon....\"  Ron caught up with them five minutes later, in a towering rage.  \"D'you know what that --\" (he called Snape something that made Hermione say \"Ron!\") \"-- is making me do? I've got to scrub out the bedpans in the hospital wing. Without magic!\" He was breathing deeply, his fists clenched. \"Why couldn't Black have hidden in Snape's office, eh? He could have finished him off for us!\"  Harry woke extremely early the next morning; so early that it was till dark."
}