{
  "id": "cb920e89941683e69299ecdd226fe534b2037b26",
  "text": " Ghost wrenched free of the other hand and crept away, red tongue lolling from his mouth.  The hooded man lifted his pale moon face, and Jon slashed at it without hesitation. The sword laid the intruder open to the bone, taking off half his nose and opening a gash cheek to cheek under those eyes, eyes, eyes like blue stars burning. Jon knew that face. Othor, he thought, reeling back. Gods, he’s dead, he’s dead, I saw him dead.  He felt something scrabble at his ankle. Black fingers clawed at his calf. The arm was crawling up his leg, ripping at wool and flesh. Shouting with revulsion, Jon pried the fingers off his leg with the point of his sword and flipped the thing away. It lay writhing, fingers opening and closing.  The corpse lurched forward. There was no blood. One-armed, face cut near in half, it seemed to feel nothing. Jon held the longsword before him.  Stay away!  he commanded, his voice gone shrill.  Corn,  screamed the raven,  corn, corn.  The severed arm was wriggling out of its torn sleeve, a pale snake with a black five-fingered head. Ghost pounced and got it between his teeth. Finger bones crunched. Jon hacked at the corpse’s neck, felt the steel bite deep and hard.  Dead Othor slammed into him, knocking him off his feet.  Jon’s breath went out of him as the fallen table caught him between his shoulder blades. The sword, where was the sword? He’d lost the damned sword! When he opened his mouth to scream, the wight jammed its black corpse fingers into Jon’s mouth. Gagging, he tried to shove it off, but the dead man was too heavy. Its hand forced itself farther down his throat, icy cold, choking him. Its face was against his own, filling the world. Frost covered its eyes, sparkling blue. Jon raked cold flesh with his nails and kicked at the thing’s legs. He tried to bite, tried to punch, tried to breathe…  And suddenly the corpse’s weight was gone, its fingers ripped from his throat. It was all Jon could do to roll over, retching and shaking.  Ghost had it again. He watched as the direwolf buried his teeth in the wight’s gut and began to rip and tear. He watched, only half conscious, for a long moment before he finally remembered to look for his sword…  … and saw Lord Mormont, naked and groggy from sleep, standing in the doorway with an oil lamp in hand. Gnawed and fingerless, the arm thrashed on the floor, wriggling toward him.  Jon tried to shout, but his voice was gone. Staggering to his feet, he kicked the arm away and snatched the lamp from the Old Bear’s fingers. The flame flickered and almost died.  Burn!  the raven cawed.  Burn, burn, burn!   Spinning, Jon saw the drapes he’d ripped from the window. He flung the lamp into the puddled cloth with both hands. Metal crunched, glass shattered, oil spewed, and the hangings went up in a great whoosh of flame. The heat of it on his face was sweeter than any kiss Jon had ever known.  Ghost!  he shouted.  The direwolf wrenched free and came to him as the wight struggled to rise, dark snakes spilling from the great wound in its belly. Jon plunged his hand into the flames, grabbed a fistful of the burning drapes, and whipped them at the dead man. Let it burn, he prayed as the cloth smothered the corpse, gods, please, please, let it burn.      BRAN  The Karstarks came in on a cold windy morning, bringing three hundred horsemen and near two thousand foot from their castle at Karhold. The steel points of their pikes winked in the pale sunlight as the column approached. A man went before them, pounding out a slow, deep-throated marching rhythm on a drum that was bigger than he was, boom, boom, boom.  Bran watched them come from a guard turret atop the outer wall, peering through Maester Luwin’s bronze far-eye while perched on Hodor’s shoulders. Lord Rickard himself led them, his sons Harrion and Eddard and Torrhen riding beside him beneath night-black banners emblazoned with the white sunburst of their House. Old Nan said they had Stark blood in them, going back hundreds of years, but they did not look like Starks to Bran. They were big men, and fierce, faces covered with thick beards, hair worn loose past the shoulders. Their cloaks were made of skins, the pelts of bear and seal and wolf.  They were the last, he knew. The other lords were already here, with their hosts. Bran yearned to ride out among them, to see the winter houses full to bursting, the jostling crowds in the market square every morning, the streets rutted and torn by wheel and hoof. But Robb had forbidden him to leave the castle.  We have no men to spare to guard you,  his brother had explained.   I’ll take Summer,  Bran argued.   Don’t act the boy with me, Bran,  Robb said.  You know better than that. Only two days ago one of Lord Bolton’s men knifed one of Lord Cerwyn’s at the Smoking Log. Our lady mother would skin me for a pelt if I let you put yourself at risk.  He was using the voice of Robb the Lord when he said it; Bran knew that meant there was no appeal.  It was because of what had happened in the wolfswood, he knew."
}