{
  "id": "cbbf5d8835d33ffe1f23313c7fe0502956ca0a17",
  "text": "  And I believed all of it, fool that I was.  To drive the lesson home, Lord Tywin gave my wife to a barracks of his guardsmen to use as they pleased, and commanded me to watch.  And to take her one last time, after the rest were done. One last time, with no trace of love or tenderness remaining.  So you will remember her as she truly is,  he said, and I should have defied him, but my cock betrayed me, and I did as I was bid.  After he was done with her, my father had the marriage undone. It was as if we had never been wed, the septons said.  He squeezed her hand.  Please, let’s have no more talk of the Tower of the Hand. You will be in the kitchens only a little while. Once we’re done with Stannis, you’ll have another manse, and silks as soft as your hands.   Shae’s eyes had grown large but he could not read what lay behind them.  My hands won’t be soft if I clean ovens and scrape plates all day. Will you still want them touching you when they’re all red and raw and cracked from hot water and lye soap?    More than ever,  he said.  When I look at them, they’ll remind me how brave you were.   He could not say if she believed him. She lowered her eyes.  I am yours to command, m’lord.   It was as much acceptance as she could give tonight, he saw that plain enough. He kissed her cheek where he’d struck her, to take some sting from the blow.  I will send for you.   Varys was waiting in the stables, as promised. His horse looked spavined and half-dead. Tyrion mounted up; one of the sellswords opened the gates. They rode out in silence. Why did I tell her about Tysha, gods help me? he asked himself, suddenly afraid. There were some secrets that should never be spoken, some shames a man should take to his grave. What did he want from her, forgiveness? The way she had looked at him, what did that mean? Did she hate the thought of scouring pots that much, or was it his confession? How could I tell her that and still think she would love me? part of him said, and another part mocked, saying, Fool of a dwarf, it is only the gold and jewels the whore loves.  His scarred elbow was throbbing, jarred every time the horse set down a hoof. Sometimes he could almost fancy he heard the bones grinding together inside. Perhaps he should see a maester, get some potion for the pain… but since Pycelle had revealed himself for what he was, Tyrion Lannister mistrusted the maesters. The gods only knew who they were conspiring with, or what they had mixed in those potions they gave you.  Varys,  he said.  I need to bring Shae into the castle without Cersei becoming aware.  Briefly, he sketched out his kitchen scheme.  When he was done, the eunuch made a little clucking sound.  I will do as my lord commands, of course… but I must warn you, the kitchens are full of eyes and ears. Even if the girl falls under no particular suspicion, she will be subject to a thousand questions. Where was she born? Who were her parents? How did she come to King’s Landing? The truth will never do, so she must lie… and lie, and lie.  He glanced down at Tyrion.  And such a pretty young kitchen wench will incite lust as well as curiosity. She will be touched, pinched, patted, and fondled. Pot boys will crawl under her blankets of a night. Some lonely cook may seek to wed her. Bakers will knead her breasts with floured hands.    I’d sooner have her fondled than stabbed,  said Tyrion.  Varys rode on a few paces and said,  It might be that there is another way. As it happens, the maidservant who attends Lady Tanda’s daughter has been filching her jewels. Were I to inform Lady Tanda, she would be forced to dismiss the girl at once. And the daughter would require a new maidservant.    I see.  This had possibilities, Tyrion saw at once. A lady’s bedmaid wore finer garb than a scullion, and often even a jewel or two. Shae should be pleased by that. And Cersei thought Lady Tanda tedious and hysterical, and Lollys a bovine lackwit. She was not like to pay them any friendly calls.   Lollys is timid and trusting,  Varys said.  She will accept any tale she is told. Since the mob took her maidenhood she is afraid to leave her chambers, so Shae will be out of sight… but conveniently close, should you have need of comfort.    The Tower of the Hand is watched, you know as well as I. Cersei would be certain to grow curious if Lollys’s bedmaid starting paying me calls.    I might be able to slip the child into your bedchamber unseen. Chataya’s is not the only house to boast a hidden door.    A secret access? To my chambers?  Tyrion was more annoyed than surprised. Why else would Maegor the Cruel have ordered death for all the builders who had worked on his castle, except to preserve such secrets?  Yes, I suppose there would be. Where will I find the door? In my solar? My bedchamber?    My friend, you would not force me to reveal all my little secrets, would you?    Henceforth think of them as our little secrets, Varys.  Tyrion glanced up at the eunuch in his smelly mummer’s garb."
}