{
  "id": "cbff9b3762a68473a7f33f72a3bbeb7e57104e50",
  "text": "       `Master said so. Master says:  Bring  us to the  Gate. So  good Smjagol  does so. Master said so, wise master.'       'I did,' said  Frodo. His face  was grim  and set. but resolute. He was  filthy, haggard, and pinched with weariness,  but he cowered  no longer, and  his eyes were clear. `I  said so, because  I purpose  to enter Mordor, and I  know no other way. Therefore I shall go this  way. I do not ask anyone to go  with me.'       `No, no,  master! ' wailed  Gollum; pawing at him, and seeming in great   ####-distress.  `No use  that way! No use! Don't take  the Precious to Him! He'll  eat us all,  if He gets it,  eat all the world. Keep it, nice master, and be  kind to Smjagol. Don't let  Him have  it. Or go away.  go to nice places, and  give it back to little Smjagol. Yes, yes, master: give  it back, eh? Smjagol  will  keep it  safe;  he will do  lots of good, especially to nice  hobbits.   Hobbits go home. Don't go to the Gate! '       'I am commanded  to go to the land of Mordor, and therefore I shall go,'  said Frodo. 'If there is only one way, then I must take it. What comes after   must come.'       Sam said nothing.  The look on Frodo's face was enough for him  he knew  that words of his were useless. And after all he never had any real hope  in  the affair from the beginning; but being a cheerful hobbit he had not needed  hope, as  long as  despair could  be  postponed. Now they  were come to  the  bitter end. But he had stuck to his master all the way; that was what he had  chiefly come  for, and he would  still stick to him. His master would not go  to Mordor alone. Sam would go with him-and at any rate they would get rid of  Gollum.       Gollum, however, did not  intend to  be  got rid  of, yet. He knelt  a t  Frodo's feet, wringing his hands and  squeaking. 'Not this way, master! ' he  pleaded, 'There is another way. O  yes indeed there is. Another way. darker,  more difficult to find, more secret. But  Smjagol knows it. Let Smjagol show  you!  '       'Another wa y!  ' said Frodo  doubtfully, looking down  at  Gollum  with  searching eyes.       'Yess! Yess indeed! There was another  way. Smjagol found it. Let's  go  and see if it's still there! '       `You have not spoken of this before.'       `No.  Master did not ask.  Master did not say what he  meant  to do. He  does not  tell poor  Smjagol. He says: Smjagol, take me to  the Gate  -- and  then good bye! Smjagol can run away and  be good. But now he says: I purpose  to enter Mordor this way.  So  Smjagol is very  afraid. He does not  want to  lose  nice  master.  And he promised, master made  him promise,  to save the  Precious. But master is going to take it to Him, straight to the Black Hand,  if master will go this way. So Smjagol must save them both, and he thinks of  another  way  that there was, once upon a  time.  Nice  master. Smjagol very  good, always helps.'       Sam frowned. If he could have  bored holes in Gollum  with his eyes, he   ####-would have done. His  mind was full of doubt.  To all appearances Gollum was  genuinely  distressed  and anxious to  help Frodo. But  Sam, remembering the  overheard debate, found it hard  to believe that the long submerged  Smjagol   had come out on top: that voice at any rate had not had the last word in the  debate. Sam's  guess was that  the Smjagol and Gollum halves (or what in his  own mind he called Slinker  and Stinker) had made  a  truce and a  temporary  alliance: neither  wanted  the Enemy to get the Ring;  both  wished to  keep  Frodo from capture, and under their  eye, as long as possible -- at any rate  as long as Stinker still had  a  chance  of laying hands  on his 'Precious'.  Whether there really was another way into Mordor Sam doubted.       `And it's a good thing neither half  of the old villain don't know what  master means to do ,' he thought. `If he knew that Mr. Frodo is trying to put  an end  to his Precious for good and all, there'd be trouble pretty quick, I  bet.  Anyhow old Stinker  is so frightened  of the Enemy  --  and  he's under  orders  of some kind from him, or was  -- that he'd give us away rather than  be caught helping us; and rather than let his  Precious be melted, maybe. At  least  that's my idea. And I hope  the master will  think it  out carefully.  He's  as wise as any,  but he's soft -hearted, that's what he is. It's beyond  any Gamgee to guess what he'll do next.'       Frodo did not answer  Gollum at once.  While these  doubts were passing  through Sam's slow  but  shrewd  mind, he  stood gazing out towards the dark  cliff of Cirith Gorgor. The hollow in which they had taken refuge was delved  in the side of a  low  hill, at some  little height above  a long trenchlike  valley that lay between it and the outer buttresses of the mountains. In the   midst of the valley stood the black foundations of the western  watch-tower.   By morning-light the roads that converged upon the  Gate of Mordor could  now  be clearly  seen,  pale  and  dusty; one  winding  back  northwards; another   dwindling eastwards into the mists that clung about the feet of Ered Lithui;  and  a  third that ran towards him."
}