{
  "id": "cca62a035b3763a1ad3a91a144fe1daea78b7a63",
  "text": "  Yet Edric Storm was three inches taller and broader in the chest and shoulders. He was his father’s son in that; nor did he ever miss a morning’s work with sword and shield. Those old enough to have known Robert and Renly as children said that the bastard boy had more of their look than Stannis had ever shared; the coal-black hair, the deep blue eyes, the mouth, the jaw, the cheekbones. Only his ears reminded you that his mother had been a Florent.   Yes, good morrow, my lord,  Edric echoed. The boy could be fierce and proud, but the maesters and castellans and masters-at-arms who’d raised him had schooled him well in courtesy.  Do you come from my uncle? How fares His Grace?    Well,  Davos lied. If truth be told, the king had a haggard, haunted look about him, but he saw no need to burden the boy with his fears.  I hope I have not disturbed your lesson.    We had just finished, my lord,  Maester Pylos said.   We were reading about King Daeron the First.  Princess Shireen was a sad, sweet, gentle child, far from pretty. Stannis had given her his square jaw and Selyse her Florent ears, and the gods in their cruel wisdom had seen fit to compound her homeliness by afflicting her with greyscale in the cradle. The disease had left one cheek and half her neck grey and cracked and hard, though it had spared both her life and her sight.  He went to war and conquered Dorne. The Young Dragon, they called him.    He worshiped false gods,  said Devan,  but he was a great king otherwise, and very brave in battle.    He was,  agreed Edric Storm,  but my father was braver. The Young Dragon never won three battles in a day.   The princess looked at him wide-eyed.  Did Uncle Robert win three battles in a day?   The bastard nodded.  It was when he’d first come home to call his banners. Lords Grandison, Cafferen, and Fell planned to join their strength at Summerhall and march on Storm’s End, but he learned their plans from an informer and rode at once with all his knights and squires. As the plotters came up on Summerhall one by one, he defeated each of them in turn before they could join up with the others. He slew Lord Fell in single combat and captured his son Silveraxe.   Devan looked to Pylos.  Is that how it happened?    I said so, didn’t I?  Edric Storm said before the maester could reply.  He smashed all three of them, and fought so bravely that Lord Grandison and Lord Cafferen became his men afterward, and Silveraxe too. No one ever beat my father.    Edric, you ought not boast,  Maester Pylos said.  King Robert suffered defeats like any other man. Lord Tyrell bested him at Ashford, and he lost many a tourney tilt as well.    He won more than he lost, though. And he killed Prince Rhaegar on the Trident.    That he did,  the maester agreed.  But now I must give my attention to Lord Davos, who has waited so patiently. We will read more of King Daeron’s Conquest of Dorne on the morrow.   Princess Shireen and the boys said their farewells courteously. When they had taken their leaves, Maester Pylos moved closer to Davos.  My lord, perhaps you would like to try a bit of Conquest of Dorne as well?  He slid the slender leather-bound book across the table.  King Daeron wrote with an elegant simplicity, and his history is rich with blood, battle, and bravery. Your son is quite engrossed.    My son is not quite twelve. I am the King’s Hand. Give me another letter, if you would.    As you wish, my lord.  Maester Pylos rummaged about his table, unrolling and then discarding various scraps of parchment.  There are no new letters. Perhaps an old one…   Davos enjoyed a good story as well as any man, but Stannis had not named him Hand for his enjoyment, he felt. His first duty was to help his king rule, and for that he must needs understand the words the ravens brought. The best way to learn a thing was to do it, he had found; sails or scrolls, it made no matter.   This might serve our purpose.  Pylos passed him a letter.  Davos flattened down the little square of crinkled parchment and squinted at the tiny crabbed letters. Reading was hard on the eyes, that much he had learned early. Sometimes he wondered if the Citadel offered a champion’s purse to the maester who wrote the smallest hand. Pylos had laughed at the notion, but…   To the… five kings,  read Davos, hesitating briefly over five, which he did not often see written out.  The king… be… the king… beware?   Beyond,  the maester corrected.  Davos grimaced.  The King beyond the Wall comes… comes south. He leads a… a… fast…    Vast.    …a vast host of wil… wild… wildlings. Lord M… Mmmor… Mormont sent a… raven from the… ha… ha…    Haunted. The haunted forest.  Pylos underlined the words with the point of his finger.   …the haunted forest. He is… under a… attack?   Yes.   Pleased, he plowed onward.  Oth… other birds have come since, with no words. We… fear… Mormont slain with all… with all his… stench… no, strength. We fear Mormont slain with all his strength…  Davos suddenly realized just what he was reading."
}