{
  "id": "cd098e74e40e181403ef480febcd97aa1b96adf8",
  "text": " He shouted a command. Cook slaves pulled a heavy iron stew pot from the firepit, dumped the stew onto the ground, and returned the pot to the flames. Drogo tossed in the belt and watched without expression as the medallions turned red and began to lose their shape. She could see fires dancing in the onyx of his eyes. A slave handed him a pair of thick horsehair mittens, and he pulled them on, never so much as looking at the man.  Viserys began to scream the high, wordless scream of the coward facing death. He kicked and twisted, whimpered like a dog and wept like a child, but the Dothraki held him tight between them. Ser Jorah had made his way to Dany’s side. He put a hand on her shoulder.  Turn away, my princess, I beg you.    No.  She folded her arms across the swell of her belly, protectively.  At the last, Viserys looked at her.  Sister, please… Dany, tell them… make them… sweet sister…   When the gold was half-melted and starting to run, Drogo reached into the flames, snatched out the pot.  Crown!  he roared.  Here. A crown for Cart King!  And upended the pot over the head of the man who had been her brother.  The sound Viserys Targaryen made when that hideous iron helmet covered his face was like nothing human. His feet hammered a frantic beat against the dirt floor, slowed, stopped. Thick globs of molten gold dripped down onto his chest, setting the scarlet silk to smoldering… yet no drop of blood was spilled.  He was no dragon, Dany thought, curiously calm. Fire cannot kill a dragon.      EDDARD  He was walking through the crypts beneath Winterfell, as he he had walked a thousand times before. The Kings of Winter watched him pass with eyes of ice, and the direwolves at their feet turned their great stone heads and snarled. Last of all, he came to the tomb where his father slept, with Brandon and Lyanna beside him.  Promise me, Ned,  Lyanna’s statue whispered. She wore a garland of pale blue roses, and her eyes wept blood.  Eddard Stark jerked upright, his heart racing, the blankets tangled around him. The room was black as pitch, and someone was hammering on the door.  Lord Eddard,  a voice called loudly.   A moment.  Groggy and naked, he stumbled his way across the darkened chamber. When he opened the door, he found Tomard with an upraised fist, and Cayn with a taper in hand. Between them stood the king’s own steward.  The man’s face might have been carved of stone, so little did it show.  My lord Hand,  he intoned.  His Grace the King commands your presence. At once.   So Robert had returned from his hunt. It was long past time.  I shall need a few moments to dress.  Ned left the man waiting without. Cayn helped him with his clothes; white linen tunic and grey cloak, trousers cut open down his plaster-sheathed leg, his badge of office, and last of all a belt of heavy silver links. He sheathed the Valyrian dagger at his waist.  The Red Keep was dark and still as Cayn and Tomard escorted him across the inner bailey. The moon hung low over the walls, ripening toward full. On the ramparts, a guardsman in a gold cloak walked his rounds.  The royal apartments were in Maegor’s Holdfast, a massive square fortress that nestled in the heart of the Red Keep behind walls twelve feet thick and a dry moat lined with iron spikes, a castle-within-a-castle. Ser Boros Blount guarded the far end of the bridge, white steel armor ghostly in the moonlight. Within, Ned passed two other knights of the Kingsguard; Ser Preston Greenfield stood at the bottom of the steps, and Ser Barristan Selmy waited at the door of the king’s bedchamber. Three men in white cloaks, he thought, remembering, and a strange chill went through him. Ser Barristan’s face was as pale as his armor. Ned had only to look at him to know that something was dreadfully wrong. The royal steward opened the door.  Lord Eddard Stark, the Hand of the King,  he announced.   Bring him here,  Robert’s voice called, strangely thick.  Fires blazed in the twin hearths at either end of the bedchamber, filling the room with a sullen red glare. The heat within was suffocating. Robert lay across the canopied bed. At the bedside hovered Grand Maester Pycelle, while Lord Renly paced restlessly before the shuttered windows. Servants moved back and forth, feeding logs to the fire and boiling wine. Cersei Lannister sat on the edge of the bed beside her husband. Her hair was tousled, as if from sleep, but there was nothing sleepy in her eyes. They followed Ned as Tomard and Cayn helped him cross the room. He seemed to move very slowly, as if he were still dreaming.  The king still wore his boots. Ned could see dried mud and blades of grass clinging to the leather where Robert’s feet stuck out beneath the blanket that covered him, A green doublet lay on the floor, slashed open and discarded, the cloth crusted with red-brown stains. The room smelled of smoke and blood and death.   Ned,  the king whispered when he saw him. His face was pale as milk.  Come… closer.   His men brought him close."
}