{
  "id": "cd093c9954f0fc15a4d834987e91e2509d0fe005",
  "text": " And so it  is that he is old, worn  before his  time. But however that may be, my lord Faramir is abroad, beyond  the River on some perilous errand, and he may have sent tidings.        'But if you would know what I think set  the beacons ablaze, it was the  news  that came yestereve  out of Lebennin. There is a great  fleet  drawing  near to the mouths of Anduin, manned by  the corsairs of Umbar in the South.  They have long ceased to fear the might of Gondor, and they have allied them  with the Enemy, and now  make  a heavy stroke in  his cause. For this attack   will draw off much of the help  that  we looked  to  have  from Lebennin and   Belfalas, where folk are hardy a nd numerous. All the more do our thoughts go  north to Rohan; and the more glad are we for these tidings  of  victory that  you bring.       'And yet'  - he paused and stood up, and looked round, north,  east, and  south - 'the doings at Isengard  should warn us that we are  caught now in a   great net and strategy. This is no longer a  bickering at the fords, raiding  from Ithilien and from Anurien, ambushing and pillaging. This is a great war  long-planned, and we are but one piece in it, whatever pride may say. Things  move  in the  far  East beyond the  Inland Sea, it is reported; and north in  Mirkwood and beyond; and south in Harad. And now all  realms shall be put to  the test, to stand, or fall  - under the Shadow.       'Yet, Master Peregrin, we have this honour:  ever we bear  the brunt of  the  chief  hatred  of the Dark Lord, for that hatred comes down out of  the  depths of  time and over the deeps  of the Sea. Here will the  hammer -stroke  fall hardest. And for that reason Mithrandir came  hither in such haste. For  if we fall, who shall stand? And, Master  Peregrin, do you see any hope that   ####-we shall stand?'       Pippin did not answer. He looked at the great walls, and the towers and  brave banners, and  the sun in the high sky, and then at the gathering gloom  in the East; and he thought of the long fingers of that Shadow: of  the orcs  in  the woods and the mountains, the treason of Isengard,  the birds of evil  eye, and the Black Riders even in the lanes of the Shire - and of the winged  terror,  the Nazgyl. He  shuddered, and hope seemed  to wither. And even  at  that moment the sun for a second faltered and was obscured, as though a dark  wing had  passed across it. Almost beyond hearing he thought he caught, high  and far up in the heavens, a cry: faint, but heart-quelling, cruel and cold.  He blanched and cowered against the wall.       'What was that?' asked Beregond. 'You also felt something?'       'Yes,' muttered Pippin. 'It is the  sign of our fall, and the shadow of  doom, a Fell Rider of the air.'       'Yes, the  shadow of doom,' said Beregond. 'I fear  that  Minas  Tirith  shall fall. Night comes. The very warmth of my blood seems stolen away.'       For a time they  sat together with bowed heads and did  not speak. Then  suddenly Pippin looked up and  saw  that  the  sun was still shining and the  banners still streaming in the breeze. He shook  himself. 'It is passed,' he  said. 'No, my  heart will not yet despair. Gandalf fell and has returned and  is with us. We may stand, if only on one leg, or at least be left still  upon  our knees.'       'Rightly said!' cried Beregond, rising and striding to and  fro.  'Nay,  though all things  must come  utterly to an  end  in  time, Gondor shall not  perish yet. Not though  the walls be taken by a reckless foe that will build  a hill of carrion before them. There  are still other fastnesses, and secret  ways of escape  into the mountains. Hope and memory shall live still in some  hidden valley where the grass is green.'       'All the same, I  wish it was over for good or ill.' said Pippin. 'I am  no warrior at all and dislike any thought of battle; but waiting on the edge  of one  that  I  can't escape  is  worst  of all.  What a long  day it seems  already! I should  be happier, if we  were not obliged  to stand and  watch,  making  no move, striking nowhere first. No stroke would have been struck in  Rohan, I think, but for Gandalf.'       'Ah, there  you  lay  your finger on  the  sore  that  many feel!' said  Beregond. 'But things may change when Faramir returns. He is bold, more bold  than many deem; for in these days men are slow to believe that a captain can   ####-be wise and learned in the scrolls of lore and song, as he is, and yet a man  of hardihood  and swift  judgement in the field. But such is  Faramir.  Less  reckless and eager than Boromir, but  not less resolute. Yet what indeed can  he do? We cannot assault  the mountains of  -  of yonder  realm. Our reach is  shortened, and we cannot strike till some foe comes within it. Then our hand   must be heavy!' He smote the hilt of his sword.       Pippin looked at  him: tall and proud and noble, as all the men that he  had yet seen in that land; and  with  a glitter in  his eye as he thought of  the battle."
}