{
  "id": "cd42863f297c866385d4e821485569e38d840d80",
  "text": "   Did I say that?  Lord Petyr cut the blood orange in two with his dagger and offered half to Sansa.  The lads are far too treacherous to be part of any such scheme… and Osmund has become especially unreliable since he joined the Kingsguard. That white cloak does things to a man, I find. Even a man like him.  He tilted his chin back and squeezed the blood orange, so the juice ran down into his mouth.  I love the juice but I loathe the sticky fingers,  he complained, wiping his hands.  Clean hands, Sansa. Whatever you do, make certain your hands are clean.   Sansa spooned up some juice from her own orange.  But if it wasn’t the Kettleblacks and it wasn’t Ser Dontos… you weren’t even in the city, and it couldn’t have been Tyrion…    No more guesses, sweetling?   She shook her head.  I don’t…   Petyr smiled.  I will wager you that at some point during the evening someone told you that your hair net was crooked and straightened it for you.   Sansa raised a hand to her mouth.  You cannot mean… she wanted to take me to Highgarden, to marry me to her grandson…    Gentle, pious, good-hearted Willas Tyrell. Be grateful you were spared, he would have bored you spitless. The old woman is not boring, though, I’ll grant her that. A fearsome old harridan, and not near as frail as she pretends. When I came to Highgarden to dicker for Margaery’s hand, she let her lord son bluster while she asked pointed questions about Joffrey’s nature. I praised him to the skies, to be sure… whilst my men spread disturbing tales amongst Lord Tyrell’s servants. That is how the game is played.   I also planted the notion of Ser Loras taking the white. Not that I suggested it, that would have been too crude. But men in my party supplied grisly tales about how the mob had killed Ser Preston Greenfield and raped the Lady Lollys, and slipped a few silvers to Lord Tyrell’s army of singers to sing of Ryam Redwyne, Serwyn of the Mirror Shield, and Prince Aemon the Dragonknight. A harp can be as dangerous as a sword, in the right hands.   Mace Tyrell actually thought it was his own idea to make Ser Loras’s inclusion in the Kingsguard part of the marriage contract. Who better to protect his daughter than her splendid knightly brother? And it relieved him of the difficult task of trying to find lands and a bride for a third son, never easy, and doubly difficult in Ser Loras’s case.   Be that as it may. Lady Olenna was not about to let Joff harm her precious darling granddaughter, but unlike her son she also realized that under all his flowers and finery, Ser Loras is as hot-tempered as Jaime Lannister. Toss Joffrey, Margaery, and Loras in a pot, and you’ve got the makings for kingslayer stew. The old woman understood something else as well. Her son was determined to make Margaery a queen, and for that he needed a king… but he did not need Joffrey. We shall have another wedding soon, wait and see. Margaery will marry Tommen. She’ll keep her queenly crown and her maidenhead, neither of which she especially wants, but what does that matter? The great western alliance will be preserved… for a time, at least.   Margaery and Tommen. Sansa did not know what to say. She had liked Margaery Tyrell, and her small sharp grandmother as well. She thought wistfully of Highgarden with its courtyards and musicians, and the pleasure barges on the Mander; a far cry from this bleak shore. At least I am safe here. Joffrey is dead, he cannot hurt me anymore, and I am only a bastard girl now. Alayne Stone has no husband and no claim. And her aunt would soon be here as well. The long nightmare of King’s Landing was behind her, and her mockery of a marriage as well. She could make herself a new home here, just as Petyr said.  It was eight long days until Lysa Arryn arrived. On five of them it rained, while Sansa sat bored and restless by the fire, beside the old blind dog. He was too sick and toothless to walk guard with Bryen anymore, and mostly all he did was sleep, but when she patted him he whined and licked her hand, and after that they were fast friends. When the rains let up, Petyr walked with her around his holdings, which took less than half a day. He owned a lot of rocks, just as he had said. There was one place where the tide came jetting up out of a blowhole to shoot thirty feet into the air, and another where someone had chiseled the seven-pointed star of the new gods upon a boulder. Petyr said that marked one of the places the Andals had landed, when they came across the sea to wrest the Vale from the First Men.  Farther inland a dozen families lived in huts of piled stone beside a peat bog.  Mine own smallfolk,  Petyr said, though only the oldest seemed to know him. There was a hermit’s cave on his land as well, but no hermit.  He’s dead now, but when I was a boy my father took me to see him. The man had not washed in forty years, so you can imagine how he smelled, but supposedly he had the gift of prophecy. He groped me a bit and said I would be a great man, and for that my father gave him a skin of wine."
}