{
  "id": "cd6a565d5d2f495c4c9cce8fa04f0b787f41d0c3",
  "text": " He named her after his mother. I would be hard-pressed to say which he loves best.    Every word you spoke to me was a lie.    Not every word. Remember when I told you I like to be on top?  Asha grinned.  That only made him angrier.  All that about being a woman wed, and new with child…    Oh, that part was true enough.  Asha leapt to her feet.  Rolfe, here,  she shouted down at one of the finger dancers, holding up a hand. He saw her, spun, and suddenly an axe came flying from his hand, the blade gleaming as it tumbled end over end through the torchlight. Theon had time for a choked gasp before Asha snatched the axe from the air and slammed it down into the table, splitting his trencher in two and splattering his mantle with drippings.  There’s my lord husband.  His sister reached down inside her gown and drew a dirk from between her breasts.  And here’s my sweet suckling babe.   He could not imagine how he looked at that moment, but suddenly Theon Greyjoy realized that the Great Hall was ringing with laughter, all of it at him. Even his father was smiling, gods be damned, and his uncle Victarion chuckled aloud. The best response he could summon was a queasy grin. We shall see who is laughing when all this is done, bitch.  Asha wrenched the axe out of the table and flung it back down at the dancers, to whistles and loud cheers.  You’d do well to heed what I told you about choosing a crew.  A thrall offered them a platter, and she stabbed a salted fish and ate it off the end of her dirk.  If you had troubled to learn the first thing of Sigrin, I could never have fooled you. Ten years a wolf, and you land here and think to prince about the islands, but you know nothing and no one. Why should men fight and die for you?     I am their lawful prince,  Theon said stiffly.   By the laws of the green lands, you might be. But we make our own laws here, or have you forgotten?   Scowling, Theon turned to contemplate the leaking trencher before him. He would have stew in his lap before long. He shouted for a thrall to clean it up. Half my life I have waited to come home, and for what? Mockery and disregard? This was not the Pyke he remembered. Or did he remember? He had been so young when they took him away to hold hostage.  The feast was a meager enough thing, a succession of fish stews, black bread, and spiceless goat. The tastiest thing Theon found to eat was an onion pie. Ale and wine continued to flow well after the last of the courses had been cleared away.  Lord Balon Greyjoy rose from the Seastone Chair.  Have done with your drink and come to my solar,  he commanded his companions on the dais.  We have plans to lay.  He left them with no other word, flanked by two of his guards. His brothers followed in short order. Theon rose to go after them.   My little brother is in a rush to be off.  Asha raised her drinking horn and beckoned for more ale.   Our lord father is waiting.    And has, for many a year. It will do him no harm to wait a little longer… but if you fear his wrath, scurry after him by all means. You ought to have no trouble catching our uncles.  She smiled.  One is drunk on seawater, after all, and the other is a great grey bullock so dim he’ll probably get lost.   Theon sat back down, annoyed.  I run after no man.    No man, but every woman?    It was not me who grabbed your cock.    I don’t have one, remember? You grabbed every other bit of me quick enough.   He could feel the flush creeping up his cheeks.  I’m a man with a man’s hungers. What sort of unnatural creature are you?    Only a shy maid.  Asha’s hand darted out under the table to give his cock a squeeze. Theon nearly jumped from his chair.  What, don’t you want me to steer you into port, brother?    Marriage is not for you,  Theon decided.  When I rule, I believe I will pack you off to the silent sisters.  He lurched to his feet and strode off unsteadily to find his father.  Rain was falling by the time he reached the swaying bridge out to the Sea Tower. His stomach was crashing and churning like the waves below, and wine had unsteadied his feet. Theon gritted his teeth and gripped the rope tightly as he made his way across, pretending that it was Asha’s neck he was clutching.  The solar was as damp and drafty as ever. Buried under his sealskin robes, his father sat before the brazier with his brothers on either side of him. Victarion was talking of tides and winds when Theon entered, but Lord Balon waved him silent.  I have made my plans. It is time you heard them.    I have some suggestions—    When I require your counsel I shall ask for it,  his father said.  We have had a bird from Old Wyk. Dagmer is bringing the Drumms and Stonehouses. If the god grants us good winds, we will sail when they arrive… or you will. I mean for you to strike the first blow, Theon. You shall take eight longships north—    Eight?  His face reddened.  What can I hope to accomplish with only eight longships?    You are to harry the Stony Shore, raiding the fishing villages and sinking any ships you chance to meet."
}