{
  "id": "cdb0ce4c909ea1375f141bc15dfb30876c533e71",
  "text": " But the Master was not sorry at all to let them  go.  They  were  expensive  to  keep,  and  their  arrival  had  turned  things  into  a  long  holiday in which business was at a standstill.  \"Let them go and bother Smaug, and see how he welcomes them!\" he thought.  \"Certainly,  O  Thorin  Thrain's  son  Thror's  son!\"  was  what  he  said.  \"You  must  claim your own. The hour  is at hand, spoken of old. What help we can offer shall  be yours, and we trust to your gratitude when your kingdom is regained.\"  So  one  day,  although  autumn  was  now  getting  far  on,  and  winds  were  cold,  and  leaves  were  falling  fast,  three  large  boats  left  Lake-town,  laden with  rowers,   ####-dwarves,  Mr.  Baggins,  and  many  provisions.  Horses  and  ponies  had  been  sent  round  by  circuitous  paths  to  meet  them  at  their  appointed  landing-place.  The  Master  and  his  councillors  bade  them  farewell  from  the  great  steps  of  the  town- hall  that  went  down  to  the  lake.  People  sang  on  the  quays  and  out  of  windows.  The  white  oars  dipped  and  splashed,  and  off  they  went  north  up  the  lake  on  the  last stage of their long journey. The only person thoroughly unhappy was Bilbo.     ####-<h4>Chapter 11</h4> <br>   On the Doorstep     In  two  days  going  they  rowed  right up  the Long Lake and passed out  into  the  River  Running,  and  now  they  could  all  see  the  Lonely  Mountain  towering  grim  and  tall  before  them.  The  stream was  strong  and  their  going  slow. At  the;  end  of  the third day, some miles up the river, they drew in to the left or western bank and  disembarked.  Here  they  were  joined  by  the  horses  with  other  provisions  and  necessaries and the ponies for their own use that had been sent to meet them. They  packed what  they  could  on  the  ponies  and  the  rest was made  into  a  store under  a  tent,  but  none  of  the men  of  the  town would  stay with  them  even  for  the  night  so  near the shadow of the Mountain.  \"Not  at  any  rate  until  the  songs  have  come  true!\"  said  they.  It  was  easier  to  believe in the Dragon and less easy to believe in Thorin in these wild parts. Indeed  their stores had no need of any guard, for all  the  land was desolate and empty. So  their escort  left  them, making off  swiftly down  the  river and  the  shoreward paths,  although the night was already drawing on.  They spent a cold and  lonely night and  their spirits  fell. The next day  they set  out  again. Balin  and Bilbo  rode  behind,  each  leading  another  pony  heavily  laden  beside  him;  the  others  were  some  way  ahead  picking  out  a  slow  road,  for  there  were no paths. They made north-west, slanting away from the River Running, and  drawing ever nearer and nearer to a great spur of the Mountain that was flung out  southwards towards them.  It was a weary journey, and a quiet and stealthy one. There was no laughter or  song or sound of harps, and the pride and hopes which had stirred in their hearts at  the  singing  of  old  songs  by  the  lake  died  away  to  a  plodding  gloom.  They  knew  that they were drawing near to the end of their journey, and that it might be a very  horrible end. The land about them grew bleak and barren, though once, as Thorin  told  them,  it had been green and fair. There was  little grass, and before  long  there  was neither bush nor tree, and only broken and blackened stumps to speak of ones  long  vanished.  They  were  come  to  the  Desolation  of  the  Dragon,  and  they  were  come at the waning of the year.     They  reached  the  skirts  of  the  Mountain  all  the  same  without  meeting  any  danger or any sign of the Dragon other than the wilderness he had made about his  lair.  The Mountain  lay  dark  and  silent  before  them  and  ever  higher  above  them.   ####-They made  their  first  camp  on  the western  side  of  the  great  southern  spur, which  ended  in  a  height  called Ravenhill. On  this  there  had  been  an  old watch-post; but  they dared not climb it yet, it was too exposed.  Before  setting  out  to  search  the western  spurs  of  the Mountain  for  the  hidden  door, on which all their hopes rested, Thorin sent out a scouting expedition to spy  out  the  land  to  the  South  where  the  Front  Gate  stood.  For  this  purpose  he  chose  Balin  and Fili  and Kili,  and with  them went Bilbo. They marched under  the grey  and silent cliffs to the feet of Ravenhill. There the river, after winding a wide loop  over the valley of Dale, turned from the Mountain on its road to the Lake, flowing  swift and noisily. Its bank was bare and rocky, tall and steep above the stream; and  gazing  out  from  it  over  the  narrow  water,  foaming  and  splashing  among  many  boulders,  they  could  see  in  the wide valley  shadowed by  the Mountain's  arms  the  grey ruins of ancient houses, towers, and walls.  \"There  lies  all  that  is  left  of  Dale,\"  said  Balin."
}