{
  "id": "ce386fbae0d38c69a1ca678c37b2efd4038e8f37",
  "text": " And on the third  night after another and a stranger thing befell me.       'I sat at night by  the waters of Anduin,  in the grey dark  under  the  young pale moon, watching the ever -moving  stream;  and the  sad  reeds were  rustling. So do we  ever watch the shores  nigh Osgiliath, which our enemies  now partly hold,  and issue from it to harry our lands. Bu t  that night  all  the world slept at the midnight hour. Then I saw, or it seemed that I saw, a   boat floating  on  the water, glimmering  grey,  a small  boat  of a strange  fashion with a high prow. and there was none to row or steer it.       `An awe fell on me, for  a pale light was round it. But I rose and went  to the bank, and began to walk out into the stream,  for I was drawn towards  it. Then the boat turned towards me, and stayed its pace, and floated slowly  by  within my hand's reach, yet I durst not handle it. It waded  deep, as if  it were heavily burdened,  and it  seemed to me  as it passed under  my gaze  that it was  almost filled with clear water, from which came the light;  and  lapped in the water a warrior lay asleep.       `A broken  sword  was on his knee. I saw  many wounds on  him.  It  was   ####-Boromir, my brother, dead. I knew his gear, his sword, his beloved face. One  thing only I missed: his horn. One thing only I knew not: a fair belt, as it  were  of linked golden leaves, about his waist. Boromir!  I cried.  Where is  thy  horn? Whither  goest  thou? O Boromir! But he was gone. The boat turned  into the stream and passed  glimmering on into the night. Dreamlike  it was.   and yet no dream, for there  was  no waking. And I do  not  doubt that he is  dead and has passed down the River to the Sea.'       'Alas!' said  Frodo. 'That was indeed Boromir as I  knew  him. For  the  golden belt was given to him in Lothlurien by the Lady Galadriel. She it was  that clothed us as  you see  us, in elven-grey. This   brooch is of  the same  workmanship.' He touched the green and silver leaf that  fastened  his cloak  beneath his throat.       Faramir looked  closely at it.  `It is beautiful,' he  said. 'Yes, 'tis  work of  the same  craft. So  then  you passed through the Land  of  Lurien?   Laurelindurenan  it  was named of  old, but long now it  has lain beyond the   knowledge of Men,' he added softly, regarding Frodo with a new wonder in his  eyes. `Much  that was strange about you  I begin now to understand. Will you  not tell me more? For it is a bitter thought that Boromir died, within sight  of the land of his home.'       'No more can I say than I have said,' answered Frodo. `Though your tale  fills me with foreboding. A  vision it was that  you saw, I  think,  and  no  more, some shadow of evil fortune that has been or will be. Unless indeed it   is some lying trick of the Enemy. I have  seen the faces of fair warriors of  old laid in  sleep beneath the  pools of the Dead Marshes, or seeming so  by  his foul arts.'       'Nay, it was not so,' said Faramir.  'For his works  fill the heart with  loathing; but my heart was filled with grief and pity.'       `Yet how could such a thing have happened in truth? ' asked Frodo. 'For   no boat could have been carried  over the stony hills from  Tol Brandir; and  Boromir purposed to  go home across the Entwash and the fields of Rohan.  And  yet how could any vessel ride the foam of the great falls and not founder in  the boiling pools, though laden with water? '       'I know not,' said Faramir. 'But whence came the boat? '       `From Lurien,' said Frodo. 'In three such boats we rowed down Anduin to  the Falls. They also were of elven-work.'       'You passed through the Hidden Land,' said  Faramir, `but it seems that   ####-you little  understood its power. If  Men have dealings with the Mistress of  Magic who dwells in the Golden  Wood, then they may look for  strange things  to follow. For it  is perilous  for mortal man  to walk  out of the world of  this Sun, and few of old came thence unchanged, 'tis said.       `Boromir, O Boromir!' he cried. `What did she say to you, the Lady that  dies not? What did she see? What woke in your heart then? Why went you  ever  to Laurelindurenan, and came not by your own road,  upon the horses of  Rohan  riding home in the morning? '       Then turning again to  Frodo, he spoke in a quiet voice  once more. 'To  those questions I guess that you could make some answer, Frodo son of Drogo.  But  not  here  or now.  maybe. But lest you  still should  think my  tale a   vision, I  will tell  you this.  The horn of Boromir at  least  returned  in  truth, and not in seeming. The horn came,  but it was  cloven  in two, as it  were  by axe or  sword. The shards  came severally to  shore: one was  found  among the reeds where watchers of  Gondor lay,  northwards below the infalls  of the Entwash;  the other was found spinning on the flood by one who had an  errand in the water. Strange chances, but murder will out, 'tis said.       'And now the horn of the elder  son lies in two pieces upon the lap  of  Denethor,  sitting in his high chair, waiting for news."
}