{
  "id": "ce73c9147bc35401f2b7774f45fd10b1cf6eb185",
  "text": "   Curious,  said Tyrion Lannister.   My brother is not here to answer questions, Lannister,  Robb said curtly.  Do your business and be on your way.    I have a gift for you,  the dwarf said to Bran.  Do you like to ride, boy?   Maester Luwin came forward.  My lord, the child has lost the use of his legs. He cannot sit a horse.    Nonsense,  said Lannister.  With the right horse and the right saddle, even a cripple can ride.   The word was a knife through Bran’s heart. He felt tears come unbidden to his eyes.  I’m not a cripple!    Then I am not a dwarf,  the dwarf said with a twist of his mouth.  My father will rejoice to hear it.  Greyjoy laughed.   What sort of horse and saddle are you suggesting?  Maester Luwin asked.   A smart horse,  Lannister replied.  The boy cannot use his legs to command the animal, so you must shape the horse to the rider, teach it to respond to the reins, to the voice. I would begin with an unbroken yearling, with no old training to be unlearned.  He drew a rolled paper from his belt.  Give this to your saddler. He will provide the rest.   Maester Luwin took the paper from the dwarfs hand, curious as a small grey squirrel. He unrolled it, studied it.  I see. You draw nicely, my lord. Yes, this ought to work. I should have thought of this myself.    It came easier to me, Maester. It is not terribly unlike my own saddles.    Will I truly be able to ride?  Bran asked. He wanted to believe them, but he was afraid. Perhaps it was just another lie. The crow had promised him that he could fly.   You will,  the dwarf told him.  And I swear to you, boy, on horseback you will be as tall as any of them.   Robb Stark seemed puzzled.  Is this some trap, Lannister? What’s Bran to you? Why should you want to help him?    Your brother Jon asked it of me. And I have a tender spot in my heart for cripples and bastards and broken things.  Tyrion Lannister placed a hand over his heart and grinned.  The door to the yard flew open. Sunlight came streaming across the hall as Rickon burst in, breathless. The direwolves were with him. The boy stopped by the door, wide-eyed, but the wolves came on. Their eyes found Lannister, or perhaps they caught his scent. Summer began to growl first. Grey Wind picked it up. They padded toward the little man, one from the right and one from the left.   The wolves do not like your smell, Lannister,  Theon Greyioy commented.   Perhaps it’s time I took my leave,  Tyrion said. He took a step backward… and Shaggydog came out of the shadows behind him, snarling. Lannister recoiled, and Summer lunged at him from the other side. He reeled away, unsteady on his feet, and Grey Wind snapped at his arm, teeth ripping at his sleeve and tearing loose a scrap of cloth.   No!  Bran shouted from the high seat as Lannister’s men reached for their steel.  Summer, here. Summer, to me!   The direwolf heard the voice, glanced at Bran, and again at Lannister. He crept backward, away from the little man, and settled down below Bran’s dangling feet.  Robb had been holding his breath. He let it out with a sigh and called,  Grey Wind.  His direwolf moved to him, swift and silent. Now there was only Shaggydog, rumbling at the small man, his eyes burning like green fire.   Rickon, call him,  Bran shouted to his baby brother, and Rickon remembered himself and screamed,  Home, Shaggy, home now.  The black wolf gave Lannister one final snarl and bounded off to Rickon, who hugged him tightly around the neck.  Tyrion Lannister undid his scarf, mopped at his brow, and said in a flat voice,  How interesting.    Are you well, my lord?  asked one of his men, his sword in hand. He glanced nervously at the direwolves as he spoke.   My sleeve is torn and my breeches are unaccountably damp, but nothing was harmed save my dignity.   Even Robb looked shaken.  The wolves… I don’t know why they did that…    No doubt they mistook me for dinner.  Lannister bowed stiffly to Bran.  I thank you for calling them off, young ser. I promise you, they would have found me quite indigestible. And now I will be leaving, truly.    A moment, my lord,  Maester Luwin said. He moved to Robb and they huddled close together, whispering. Bran tried to hear what they were saying, but their voices were too low.  Robb Stark finally sheathed his sword.  I… I may have been hasty with you,  he said.  You’ve done Bran a kindness, and, well…  Robb composed himself with an effort.  The hospitality of Winterfell is yours if you wish it, Lannister.    Spare me your false courtesies, boy. You do not love me and you do not want me here. I saw an inn outside your walls, in the winter town. I’ll find a bed there, and both of us will sleep easier. For a few coppers I may even find a comely wench to warm the sheets for me.  He spoke to one of the black brothers, an old man with a twisted back and a tangled beard.  Yoren, we go south at daybreak. You will find me on the road, no doubt.  With that he made his exit, struggling across the hall on his short legs, past Rickon and out the door."
}