{
  "id": "ceba105a7513c885fd2cefd02b6aa4937a9c7012",
  "text": "  What good will my comfort do them?    None,  Tyrion said.  Yet it is expected of you. Your absence has been noted.    The Stark boy is nothing to me,  Joffrey said.  I cannot abide the wailing of women.   Tyrion Lannister reached up and slapped his nephew hard across the face. The boy’s cheek began to redden.   One word,  Tyrion said,  and I will hit you again.    I’m going to tell Mother!  Joffrey exclaimed.  Tyrion hit him again. Now both cheeks flamed.   You tell your mother,  Tyrion told him.  But first you get yourself to Lord and Lady Stark, and you fall to your knees in front of them, and you tell them how very sorry you are, and that you are at their service if there is the slightest thing you can do for them or theirs in this desperate hour, and that all your prayers go with them. Do you understand? Do you?   The boy looked as though he was going to cry. Instead, he managed a weak nod. Then he turned and fled headlong from the yard, holding his cheek. Tyrion watched him run.  A shadow fell across his face. He turned to find Clegane looming overhead like a cliff. His soot-dark armor seemed to blot out the sun. He had lowered the visor on his helm. It was fashioned in the likeness of a snarling black hound, fearsome to behold, but Tyrion had always thought it a great improvement over Clegane’s hideously burned face.   The prince will remember that, little lord,  the Hound warned him. The helm turned his laugh into a hollow rumble.   I pray he does,  Tyrion Lannister replied.  If he forgets, be a good dog and remind him.  He glanced around the courtyard.  Do you know where I might find my brother?    Breaking fast with the queen.    Ah,  Tyrion said. He gave Sandor Clegane a perfunctory nod and walked away as briskly as his stunted legs would carry him, whistling. He pitied the first knight to try the Hound today. The man did have a temper.  A cold, cheerless meal had been laid out in the morning room of the Guest House. Jaime sat at table with Cersei and the children, talking in low, hushed voices.   Is Robert still abed?  Tyrion asked as he seated himself, uninvited, at the table.  His sister peered at him with the same expression of faint distaste she had worn since the day he was born.  The king has not slept at all,  she told him.  He is with Lord Eddard. He has taken their sorrow deeply to heart.    He has a large heart, our Robert,  Jaime said with a lazy smile. There was very little that Jaime took seriously. Tyrion knew that about his brother, and forgave it. During all the terrible long years of his childhood, only Jaime had ever shown him the smallest measure of affection or respect, and for that Tyrion was willing to forgive him most anything.  A servant approached.  Bread,  Tyrion told him,  and two of those little fish, and a mug of that good dark beer to wash them down. Oh, and some bacon. Burn it until it turns black.  The man bowed and moved off. Tyrion turned back to his siblings. Twins, male and female. They looked very much the part this morning. Both had chosen a deep green that matched their eyes. Their blond curls were all a fashionable tumble, and gold ornaments shone at wrists and fingers and throats.  Tyrion wondered what it would be like to have a twin, and decided that he would rather not know. Bad enough to face himself in a looking glass every day. Another him was a thought too dreadful to contemplate.  Prince Tommen spoke up.  Do you have news of Bran, Uncle?    I stopped by the sickroom last night,  Tyrion announced.  There was no change. The maester thought that a hopeful sign.    I don’t want Brandon to die,  Tommen said timorously. He was a sweet boy. Not like his brother, but then Jaime and Tyrion were somewhat less than peas in a pod themselves.   Lord Eddard had a brother named Brandon as well,  Jaime mused.  One of the hostages murdered by Targaryen. It seems to be an unlucky name.    Oh, not so unlucky as all that, surely,  Tyrion said. The servant brought his plate. He ripped off a chunk of black bread.  Cersei was studying him warily.  What do you mean?   Tyrion gave her a crooked smile.  Why, only that Tommen may get his wish. The maester thinks the boy may yet live.  He took a sip of beer.  Myrcella gave a happy gasp, and Tommen smiled nervously, but it was not the children Tyrion was watching. The glance that passed between Jaime and Cersei lasted no more than a second, but he did not miss it. Then his sister dropped her gaze to the table.  That is no mercy. These northern gods are cruel to let the child linger in such pain.    What were the maester’s words?  Jaime asked.  The bacon crunched when he bit into it. Tyrion chewed thoughtfully for a moment and said,  He thinks that if the boy were going to die, he would have done so already. It has been four days with no change.    Will Bran get better, Uncle?  little Myrcella asked. She had all of her mother’s beauty, and none of her nature.   His back is broken, little one,  Tyrion told her.  The fall shattered his legs as well."
}