{
  "id": "ced8de0899691de4370a14241bc4826409b3045d",
  "text": " He once rode a mare in heat against a foe mounted on a bad-tempered stallion. What sort of trickery did Brienne use?   Ser Loras flushed.  She leapt… it makes no matter. She won, I grant her that. His Grace put a rainbow cloak around her shoulders. And she killed him, Or let him die.    A large difference there.  The difference between my crime and the shame of Boros Blount.   She had sworn to protect him. Ser Emmon Cuy, Ser Robar Royce, Ser Parmen Crane, they’d sworn as well. How could anyone have hurt him, with her inside his tent and the others just outside? Unless they were part of it.    There were five of you at the wedding feast,  Jaime pointed out.  How could Joffrey die? Unless you were part of it?   Ser Loras drew himself up stiffly.  There was nothing we could have done.    The wench says the same. She grieves for Renly as you do. I promise you, I never grieve for Aerys. Brienne’s ugly, and pighead stubborn. But she lacks the wits to be a liar, and she is loyal past the point of sense. She swore an oath to bring me to King’s Landing, and here I sit. This hand I lost… well, that was my doing as much as hers. Considering all she did to protect me, I have no doubt that she would have fought for Renly, had there been a foe to fight. But a shadow?  Jaime shook his head.  Draw your sword, Ser Loras. Show me how you’d fight a shadow. I should like to see that.   Ser Loras made no move to rise.  She fled,  he said.  She and Catelyn Stark, they left him in his blood and ran. Why would they, if it was not their work?  He stared at the table.  Renly gave me the van. Otherwise it would have been me helping him don his armor. He often entrusted that task to me. We had… we had prayed together that night. I left him with her. Ser Parmen and Ser Emmon were guarding the tent, and Ser Robar Royce was there as well. Ser Emmon swore Brienne had… although…    Yes?  Jaime prompted, sensing a doubt.   The gorget was cut through. One clean stroke, through a steel gorget. Renly’s armor was the best, the finest steel. How could she do that? I tried myself, and it was not possible. She’s freakish strong for a woman, but even the Mountain would have needed a heavy axe. And why armor him and then cut his throat?  He gave Jaime a confused look.  If not her, though… how could it be a shadow?    Ask her.  Jaime came to a decision.  Go to her cell. Ask your questions and hear her answers. If you are still convinced that she murdered Lord Renly, I will see that she answers for it. The choice will be yours. Accuse her, or release her. All I ask is that you judge her fairly, on your honor as a knight.   Ser Loras stood.  I shall. On my honor.    We are done, then.   The younger man started for the door. But there he turned back.  Renly thought she was absurd. A woman dressed in man’s mail, pretending to be a knight.    If he’d ever seen her in pink satin and Myrish lace, he would not have complained.    I asked him why he kept her close, if he thought her so grotesque. He said that all his other knights wanted things of him, castles or honors or riches, but all that Brienne wanted was to die for him. When I saw him all bloody, with her fled and the three of them unharmed… if she’s innocent, then Robar and Emmon…  He could not seem to say the words.  Jaime had not stopped to consider that aspect of it.  I would have done the same, ser,  The lie came easy, but Ser Loras seemed grateful for it.  When he was gone, the Lord Commander sat alone in the white room, wondering. The Knight of Flowers had been so mad with grief for Renly that he had cut down two of his own Sworn Brothers, but it had never occurred to Jaime to do the same with the five who had failed Joffrey. He was my son, my secret son… what am I, if I do not lift the hand I have left to avenge mine own blood and seed? He ought to kill Ser Boros at least, just to be rid of him.  He looked at his stump and grimaced. I must do something about that. If the late Ser Jacelyn Bywater could wear an iron hand, he should have a gold one. Cersei might like that. A golden hand to stroke her golden hair, and hold her hard against me.  His hand could wait, though. There were other things to tend to first. There were other debts to pay.      Sansa   The ladder to the forecastle was steep and splintery, so Sansa accepted a hand up from Lothor Brune. Ser Lothor, she had to remind herself; the man had been knighted for his valor in the Battle of the Blackwater. Though no proper knight would wear those patched brown breeches and scuffed boots, nor that cracked and waterstained leather jerkin. A square-faced stocky man with a squashed nose and a mat of nappy grey hair, Brune spoke seldom. He is stronger than he looks, though. She could tell by the ease with which he lifted her, as if she weighed nothing at all.  Off the bow of the Merling King stretched a bare and stony strand, windswept, treeless, and uninviting. Even so, it made a welcome sight. They had been a long while clawing their way back on course."
}