{
  "id": "cf279298fcf4d5758c6c739a2164a422900c7747",
  "text": " And it was a woman’s gown, not a little girl’s, there was no doubt of that. The bodice was slashed in front almost to her belly, the deep vee covered over with a panel of ornate Myrish lace in dove-grey. The skirts were long and full, the waist so tight that Sansa had to hold her breath as they laced her into it. They brought her new shoes as well, slippers of soft grey doeskin that hugged her feet like lovers.  You are very beautiful, my lady,  the seamstress said when she was dressed.   I am, aren’t I?  Sansa giggled, and spun, her skirts swirling around her.  Oh, I am.  She could not wait for Willas to see her like this. He will love me, he will, he must… he will forget Winterfell when he sees me, I’ll see that he does.  Queen Cersei studied her critically.  A few gems, I think. The moonstones Joffrey gave her.    At once, Your Grace,  her maid replied.  When the moonstones hung from Sansa’s ears and about her neck, the queen nodded.  Yes. The gods have been kind to you, Sansa. You are a lovely girl. It seems almost obscene to squander such sweet innocence on that gargoyle.    What gargoyle?  Sansa did not understand. Did she mean Willas? How could she know? No one knew, but her and Margaery and the Queen of Thorns… oh, and Dontos, but he didn’t count.  Cersei Lannister ignored the question.  The cloak,  she commanded, and the women brought it out: a long cloak of white velvet heavy with pearls. A flerce direwolf was embroidered upon it in silver thread. Sansa looked at it with sudden dread.  Your father’s colors,  said Cersei, as they fastened it about her neck with a slender silver chain.  A maiden’s cloak. Sansa’s hand went to her throat. She would have torn the thing away if she had dared.   You’re prettier with your mouth closed, Sansa,  Cersei told her.  Come along now, the septon is waiting. And the wedding guests as well.    No,  Sansa blurted.  No.    Yes. You are a ward of the crown. The king stands in your father’s place, since your brother is an attainted traitor. That means he has every right to dispose of your hand. You are to marry my brother Tyrion.   My claim, she thought, sickened. Dontos the Fool was not so foolish after all; he had seen the truth of it. Sansa backed away from the queen.  I won’t.  I’m to marry Willas, I’m to be the lady of Highgarden, please…   I understand your reluctance. Cry if you must. In your place, I would likely rip my hair out. He’s a loathsome little imp, no doubt of it, but marry him you shall.    You can’t make me.    Of course we can. You may come along quietly and say your vows as befits a lady, or you may struggle and scream and make a spectacle for the stableboys to titter over, but you will end up wedded and bedded all the same.  The queen opened the door. Ser Meryn Trant and Ser Osmund Kettleblack were waiting without, in the white scale armor of the Kingsguard.  Escort Lady Sansa to the sept,  she told them.  Carry her if you must, but try not to tear the gown, it was very costly.   Sansa tried to run, but Cersei’s handmaid caught her before she’d gone a yard. Ser Meryn Trant gave her a look that made her cringe, but Kettleblack touched her almost gently and said,  Do as you’re told, sweetling, it won’t be so bad. Wolves are supposed to be brave, aren’t they?   Brave. Sansa took a deep breath. I am a Stark, yes, I can be brave. They were all looking at her, the way they had looked at her that day in the yard when Ser Boros Blount had torn her clothes off. It had been the Imp who saved her from a beating that day, the same man who was waiting for her now. He is not so bad as the rest of them, she told herself.  I’ll go.   Cersei smiled.  I knew you would.   Afterward, she could not remember leaving the room or descending the steps or crossing the yard. It seemed to take all her attention just to put one foot down in front of the other. Ser Meryn and Ser Osmund walked beside her, in cloaks as pale as her own, lacking only the pearls and the direwolf that had been her father’s. Joffrey himself was waiting for her on the steps of the castle sept. The king was resplendent in crimson and gold, his crown on his head.  I’m your father today,  he announced.   You’re not,  she flared.  You’ll never be.   His face darkened.  I am. I’m your father, and I can marry you to whoever I like. To anyone. You’ll marry the pig boy if I say so, and bed down with him in the sty.  His green eyes glittered with amusement.  Or maybe I should give you to Ilyn Payne, would you like him better?   Her heart lurched.  Please, Your Grace,  she begged.  If you ever loved me even a little bit, don’t make me marry your—    —uncle?  Tyrion Lannister stepped through the doors of the sept.  Your Grace,  he said to Joffrey.  Grant me a moment alone with Lady Sansa, if you would be so kind?   The king was about to refuse, but his mother gave him a sharp look. They drew off a few feet.  Tyrion wore a doublet of black velvet covered with golden scrollwork, thigh-high boots that added three inches to his height, a chain of rubies and lions’ heads."
}