{
  "id": "cf291b26e8f8cacc5d6dc9ba825c1876169766ba",
  "text": " Arya glanced inside as the Hound drove past the first of the three, and saw hundreds of men crowding the benches and jostling around the casks of mead and ale and wine. There was hardly room to move inside, but none of them seemed to mind. At least they were warm and dry. Cold wet Arya envied them. Some were even singing. The fine misty rain was steaming all around the door from the heat escaping from inside.  Here’s to Lord Edmure and Lady Roslin,  she heard a voice shout. They all drank, and someone yelled,  Here’s to the Young Wolf and Queen Jeyne.   Who is Queen Jeyne? Arya wondered briefly. The only queen she knew was Cersei.  Firepits had been dug outside the feast tents, sheltered beneath rude canopies of woven wood and hides that kept the rain out, so long as it fell straight down. The wind was blowing off the river, though, so the drizzle came in anyway, enough to make the fires hiss and swirl. Serving men were turning joints of meat on spits above the flames. The smells made Arya’s mouth water.  Shouldn’t we stop?  she asked Sandor Clegane.  There’s northmen in the tents.  She knew them by their beards, by their faces, by their cloaks of bearskin and sealskin, by their half-heard toasts and the songs they sang; Karstarks and Umbers and men of the mountain clans.  I bet there are Winterfell men too.  Her father’s men, the Young Wolf’s men, the direwolves of Stark.   Your brother will be in the castle,  he said.  Your mother too. You want them or not?    Yes,  she said.  What about Sedgekins?  The sergeant had told them to ask for Sedgekins.   Sedgekins can bugger himself with a hot poker.  Clegane shook out his whip, and sent it hissing through the soft rain to bite at a horse’s flank.  It’s your bloody brother I want.       Catelyn   The drums were pounding, pounding, pounding, and her head with them. Pipes wailed and flutes trilled from the musicians’ gallery at the foot of the hall; fiddles screeched, horns blew, the skins skirled a lively tune, but the drumming drove them all. The sounds echoed off the rafters, whilst the guests ate, drank, and shouted at one another below. Walder Frey must be deaf as a stone to call this music. Catelyn sipped a cup of wine and watched Jinglebell prance to the sounds of  Alysanne.  At least she thought it was meant to be  Alysanne.  With these players, it might as easily have been  The Bear and the Maiden Fair.   Outside the rain still fell, but within the Twins the air was thick and hot. A fire roared in the hearth and rows of torches burned smokily from iron sconces on the walls. Yet most of the heat came off the bodies of the wedding guests, jammed in so thick along the benches that every man who tried to lift his cup poked his neighbor in the ribs.  Even on the dais they were closer than Catelyn would have liked. She had been placed between Ser Ryman Frey and Roose Bolton, and had gotten a good noseful of both. Ser Ryman drank as if Westeros was about to run short of wine, and sweated it all out under his arms. He had bathed in lemonwater, she judged, but no lemon could mask so much sour sweat. Roose Bolton had a sweeter smell to him, yet no more pleasant. He sipped hippocras in preference to wine or mead, and ate but little.  Catelyn could not fault him for his lack of appetite. The wedding feast began with a thin leek soup, followed by a salad of green beans, onions, and beets, river pike poached in almond milk, mounds of mashed turnips that were cold before they reached the table, jellied calves’ brains, and a leche of stringy beef. It was poor fare to set before a king, and the calves’ brains turned Catelyn’s stomach. Yet Robb ate it uncomplaining, and her brother was too caught up with his bride to pay much attention.  You would never guess Edmure complained of Roslin all the way from Riverrun to the Twins. Husband and wife ate from a single plate, drank from a single cup, and exchanged chaste kisses between sips. Most of the dishes Edmure waved away. She could not blame him for that. She remembered little of the food served at her own wedding feast. Did I even taste it? Or spend the whole time gazing at Ned’s face, wondering who he was?  Poor Roslin’s smile had a fixed quality to it, as if someone had sewn it onto her face. Well, she is a maid wedded, but the bedding’s yet to come. No doubt she’s as terrified as I was. Robb was seated between Alyx Frey and Fair Walda, two of the more nubile Frey maidens.  At the wedding feast I hope you will not refuse to dance with my daughters,  Walder Frey had said.  It would please an old man’s heart.  His heart should be well pleased, then; Robb had done his duty like a king. He had danced with each of the girls, with Edmure’s bride and the eighth Lady Frey, with the widow Ami and Roose Bolton’s wife Fat Walda, with the pimply twins Serra and Sarra, even with Shirei, Lord Walder’s youngest, who must have been all of six. Catelyn wondered whether the Lord of the Crossing would be satisfied, or if he would find cause for complaint in all the other daughters and granddaughters who had not had a turn with the king."
}