{
  "id": "cfaa0df2d3a41481e822897c582e456459203bc1",
  "text": " Harry spent most of the afternoon in his bedroom; he couldn't stand watching Aunt Petunia peer out through the net curtains every few seconds, as though there had been a warning about an escaped rhinoceros.  Finally, at a quarter to five, Harry went back downstairs and into the living room. Aunt Petunia was compulsively straightening cushions.  Uncle Vernon was pretending to read the paper, but his tiny eyes were not moving, and Harry was sure he was really listening with all his might for the sound of an approaching car.  Dudley was crammed into an armchair, his porky hands beneath him, clamped firmly around his bottom.  Harry couldn't take the tension; he left the room and went and sat on the stairs in the hall, his eyes on his watch and his heart pumping fast from excitement and nerves. But five o'clock came and then went. Uncle Vernon, perspiring slightly in his suit, opened the front door, peered up and down the street, then withdrew his head quickly. \"They're late!\" he snarled at Harry. I know,\" said Harry.  \"Maybe - er - the traffic's bad, or something.\" Ten past five ... then a quarter past five ... Harry was starting to feel anxious himself now.  At half past, he heard Uncle Vernon and Aunt Petunia conversing in terse mutters in the living room. \"No consideration at all.\" \"We might've had an engagement.\" \"Maybe they think they'll get invited to dinner if they're late.\" \"Well, they most certainly won't be,\" said Uncle Vernon, and Harry heard him stand up and start pacing the living room.  \"They'll take the boy and go, there'll be no hanging around. That's if they're coming at all.  Probably mistaken the day.  I daresay their kind don't set much store by punctuality.  Either that or they drive some tin-pot car that's broken d- AAAAAAAARRRRRGH!\" Harry jumped up.  From the other side of the living room door came the sounds of the three Dursleys scrambling, panic-stricken, across the room.  Next moment Dudley came flying into the hall, looking terrified. \"What happened?\" said Harry.  \"What's the matter?\" But Dudley didn't seem able to speak.  Hands still clamped over his buttocks, he waddled as fast as he could into the kitchen.  Harry hurried into the living room. Loud bangings and scrapings were coming from behind the Dursleys' boarded-up fireplace, which had a fake coal fire plugged in front of it. \"What is it?\" gasped Aunt Petunia, who had backed into the wall and was staring, terrified, toward the fire.  \"What is it, Vernon?\" But they were left in doubt barely a second longer.  Voices could be heard from inside the blocked fireplace. \"Ouch! Fred, no - go back, go back, there's been some kind of mistake - tell George not to - OUCH! George, no, there's no room, go back quickly and tell Ron-\" \"Maybe Harry can hear us, Dad - maybe he'll be able to let us out-\" There was a loud hammering of fists on the boards behind the electric fire. \"Harry? Harry, can you hear us?\" The Dursleys rounded on Harry like a pair of angry wolverines. \"What is this?\" growled Uncle Vernon. \"What's going on?\" \"They - they've tried to get here by Floo powder,\" said Harry, fighting a mad desire to laugh.  \"They can travel by fire - only you've blocked the fireplace - hang on -\" He approached the fireplace and called through the boards. \"Mr. Weasley?  Can you hear me?\" The hammering stopped.  Somebody inside the chimney piece said, \"Shh!\" \"Mr. Weasley, it's Harry ... the fireplace has been blocked up.  You won't be able to get through there.\" \"Damn!\" said Mr. Weasley's voice.  \"What on earth did they want to block up the fireplace for?\" \"They've got an electric fire,\" Harry explained. \"Really?\" said Mr. Weasley's voice excitedly.  \"Eclectic, you say?  With a plug? Gracious, I must see that.... Let's think ... ouch, Ron!\" Ron's voice now joined the others'. \"What are we doing here?  Has something gone wrong?\" \"Oh no, Ron,\" came Fred's voice, very sarcastically.  \"No, this is exactly where we wanted to end up.\" \"Yeah, we're having the time of our lives here,\" said George, whose voice sounded muffled, as though he was squashed against the wall. \"Boys, boys. . .\" said Mr. Weasley vaguely.  \"I'm trying to think what to do.... Yes ... only way. . . Stand back, Harry.\" Harry retreated to the sofa.  Uncle Vernon, however, moved forward. \"Wait a moment!\" he bellowed at the fire.  \"What exactly are you going to -\" BANG. The electric fire shot across the room as the boarded-up fireplace burst outward, expelling Mr. Weasley, Fred, George, and Ron in a cloud of rubble and loose chippings.  Aunt Petunia shrieked and fell backward over the coffee table; Uncle Vernon caught her before she hit the floor, and gaped, speechless, at the Weasleys, all of whom had bright red hair, including Fred and George, who were identical to the last freckle. \"That's better,\" panted Mr. Weasley, brushing dust from his long green robes and straightening his glasses.  \"Ah - you must be Harry's aunt and uncle!\" Tall, thin, and balding, he moved toward Uncle Vernon, his hand outstretched, but Uncle Vernon backed away several paces, dragging Aunt Petunia."
}