{
  "id": "d036e0f939d05de094791f8d17db733086c5dcec",
  "text": " They still had a long way to walk before them. Up slope and down dale  they  plodded.  It  grew  very  hot.  Sometimes  they  rested  under  the  trees,  and  then  Bilbo felt so hungry that he would have eaten acorns, if any had been ripe enough  yet to have fallen to the ground.  It  was  the  middle  of  the  afternoon  before  they  noticed  that  great  patches  of  flowers had begun to spring up, all the same kinds growing together as if they had  been  planted.  Especially  there  was  clover,  waving  patches  of  cockscomb  clover,  and  purple  clover,  and wide  stretches  of  short white  sweet  honey-smelling clover.  There  was  a  buzzing  and  a  whirring  and  a  droning  in  the  air.  Bees  were  busy  everywhere. And such bees! Bilbo had never seen anything like them.  \"If one was to sting me,\" he thought, \"I should swell up as big again as I am!\"  They  were  bigger  than  hornets.  The  drones  were  bigger  than  your  thumb,  a  good  deal,  and  the  bands  of  yellow  on  their  deep  black  bodies  shone  like  fiery  gold.  \"We are getting near,\" said Gandalf. \"We are on the edge of his bee-pastures.\"  After  a  while  they  came  to  a  belt  of  tall  and  very  ancient  oaks,  and  beyond  these to a high thorn-hedge through which you could neither see nor scramble.  \"You had better wait here,\" said the wizard to the dwarves; \"and when I call or  whistle  begin  to  come  after  me —  you  will  see  the  way  I  go-but  only  in  pairs,  mind, about  five minutes between each pair of you. Bombur  is  fattest  and will do  for two, he had better come alone and last. Come on Mr. Baggins! There is a gate  somewhere round this way.\" And with that he went off along the hedge taking the  frightened hobbit with him.   ####-They  soon  came  to  a wooden  gate,  high  and  broad,  beyond which  they could  see  gardens  and  a  cluster  of  low  wooden  buildings,  some  thatched  and  made  of  unshaped logs; barns, stables, sheds, and a long low wooden house.  Inside  on  the  southward  side  of  the  great  hedge were  rows  and  rows  of  hives  with  bell-shaped  tops made of  straw. The noise of  the giant bees  flying  to and  fro  and crawling in and out filled all the air.   The  wizard  and  the  hobbit  pushed  open  the  heavy  creaking  gate  and  went  down a wide track towards the house. Some horses, very sleek and well-groomed,  trotted up across  the grass and  looked at  them  intently with very  intelligent  faces;  then off they galloped to the buildings.  \"They have gone to tell him of the arrival of strangers,\" said Gandalf.  Soon  they  reached  a  courtyard,  three  walls  of  which  were  formed  by  the  wooden  house  and  its  two  long wings.  In  the middle  there was  lying  a  great  oak- trunk with many  lopped branches beside  it. Standing near was a huge man with a  thick black beard and' hair, and great bare arms and legs with knotted muscles. He  was clothed in a tunic of wool down to his knees, and was leaning on a large axe.  The horses were standing by him with their noses at his shoulder.   \"Ugh!  here  they  are!\"  he  said  to  the  horses.  \"They  don't  look  dangerous. You  can be off!\" He laughed a great rolling laugh, put down his axe and came forward.  \"Who  are  you  and what  do  you want?\"  he  asked  gruffly,  standing  in  front  of  them and towering tall above Gandalf.  As for Bilbo he could easily have  trotted  through his  legs without ducking his  head to miss the fringe of the man's brown tunic.  \"I am Gandalf,\" said the wizard.  \"Never  heard  of  him,\"  growled  the  man,  \"And  what's  this  little  fellow?\"  he  said, stooping down to frown at the hobbit with his bushy eyebrows.  \"That is Mr. Baggins, a hobbit of good family and unimpeachable reputation,\"  said Gandalf. Bilbo bowed. He had no hat to take off, and was painfully conscious  of his many missing buttons. \"I am a wizard,\" continued Gandalf. \"I have heard of  you,  if you have not heard of me; but perhaps you have heard of my good cousin  Radagast who lives near the Southern borders of Mirkwood?\"  \"Yes;  not  a  bad  fellow  as  wizards  go,  I  believe.  I  used  to  see  him  now  and  again,\"  said  Beorn.  \"Well,  now  I  know  who  you  are,  or  who  you  say  you  are.  What do you want?\"  \"To  tell  you  the  truth, we  have  lost  our  luggage  and  nearly  lost  our way,  and  are  rather  in need of help, or  at  least  advice.  I may  say we have had  rather  a bad  time with goblins in the mountains.\"   ####-\"Goblins?\" said the big man less gruffly. \"O ho, so you've been  having trouble  with them have you? What did you go near them for?\"  \"We  did  not  mean  to.  They  surprised  us  at  night  in  a  pass  which  we  had  to  cross, we were coming out of the Lands over West into these countries-it is a long  tale.\"  \"Then  you  had  better  come  inside  and  tell  me  some  of  it,  if  it  won't  take  all  day,\"  said  the  man  leading  the  way  through  a  dark  door  that  opened  out  of  the  courtyard into the house."
}