{
  "id": "d0d4778163f7d186cf5bbf440c6aa11b35c4e5f7",
  "text": " For a moment he thought the roaring of the wind had woken him. Then he felt a cold breeze on the back of his neck and sat bolt upright -- Peeves the Poltergeist had been floating next to him, blowing hard in his ear.  \"What did you do that for?\" said Harry furiously. Peeves puffed out his cheeks, blew hard, and zoomed backward out of the room, cackling.  Harry fumbled for his alarm clock and looked at it. It was half past four. Cursing Peeves, he rolled over and tried to get back to sleep, but it was very difficult, now that he was awake, to ignore the sounds of the thunder rumbling overhead, the pounding of the wind against the castle walls, and the distant creaking of the trees in the Forbidden Forest. In a few hours he would be out on the Quidditch field, battling through that gale. Finally, he gave up any thought of more sleep, got up, dressed, picked up his Nimbus Two Thousand, and walked quietly out of the dormitory.  As Harry opened the door, something brushed against his leg. He bent down just in time to grab Crookshanks by the end of his bushy tail and drag him outside.  \"You know, I reckon Ron was right about you,\" Harry told Crookshanks suspiciously. \"There are plenty of mice around this place -- go and chase them. Go on,\" he added, nudging Crookshanks down the spiral staircase with his foot. \"Leave Scabbers alone.\"  The noise of the storm was even louder in the common roorn. Harry knew better than to think the match would be canceled; Quidditch matches weren't called off for trifles like thunderstorms. Nevertheless, he was starting to feel very apprehensive. Wood had pointed out Cedric Diggory to him in the corridor; Diggory was a fifth year and a lot bigger than Harry. Seekers were usually light  and speedy, but Diggory's weight would be an advantage in this weather because he was less likely to be blown off course.  Harry whiled away the hours until dawn in front of the fire, getting up every now and then to stop Crookshanks from sneaking up  the boys, staircase again. At long last Harry thought it must be time for breakfast, so he headed through the portrait hole alone.  \"Stand and fight, you mangy cur!\" yelled Sir Cadogan.  \"Oh, shut up,\" Harry yawned.  He revived a bit over a large bowl of porridge, and by the time he'd started on toast, the rest of the team had turned up.  \"It's going to be a tough one,\" said Wood, who wasn't eating anything.  \"Stop worrying, Oliver,\" said Alicia soothingly, \"we don't mind a bit of rain.\"  But it was considerably more than a bit of rain. Such was the popularity of Quidditch that the whole school turned out to watch the match as usual, but they ran down the lawns toward the Quidditch field, heads bowed against the ferocious wind, umbrellas being whipped out of their hands as they went. just before he entered the locker room, Harry saw Malfoy, Crabbe, and Goyle, laughing and pointing at him from under an enormous umbrella on their way to the stadium.  The team changed into their scarlet robes and waited for Wood's usual pre-match pep talk, but it didn't come. He tried to speak several times, made an odd gulping noise, then shook his head hopelessly and beckoned them to follow him.  The wind was so strong that they staggered sideways as they walked out onto the field. If the crowd was cheering, they couldn't hear it over the fresh rolls of thunder. Rain was splattering over Harry's glasses. How on earth was he going to see the Snitch in this?  The Hufflepuffs were approaching from the opposite side of the field, wearing canary-yellow robes. The Captains walked up to eacb other and shook hands; Diggory smiled at Wood but Wood no, looked as though he had lockjaw and merely nodded. Harry saw Madam Hooch's mouth form the words, \"Mount Your brooms.,, He pulled his right foot out of the mud with a squelch and swung it over his Nimbus Two Thousand. Madam Hooch put her whistle to her lips and gave it a blast that sounded shrill and distant they were off  Harry rose fast, but his Nimbus was swerving slightly with the wind. He held it as steady as he could and turned, squinting into the rain.  Within five minutes Harry was soaked to his skin and frozen, hardly able to see his teammates, let alone the tiny Snitch. He flew backward and forward across the field past blurred red and yellow shapes, with no idea of what was happening in the rest of the game. He couldn't hear the commentary over the wind. The crowd was hidden beneath a sea of cloaks and battered umbrellas. Twice Harry came very close to being unseated by a Bludger; his vision was so clouded by the rain on his glasses he hadn't seen them coming.  He lost track of time. It was getting harder and harder to hold his broom straight. The sky was getting darker, as though night had decided to come early. Twice Harry nearly hit another player, without knowing whether it was a teammate or opponent; everyone was now so wet, and the rain so thick, he could hardly tell them apart....  With the first flash of lightning came the sound of Madam Hooch's whistle; Harry could just see the outline of Wood through the thick rain, gesturing him to the ground."
}