{
  "id": "d113ccdb0c7532f78b590c5734a28229f0d819de",
  "text": " \"Great Scott, he can fly!\"  yelled Bagman as the crowd shrieked and gasped.  \"Are you watching this, Mr. Krum?\"   Harry soared higher in a circle; the Horntail was still following his progress; its head revolving on its long neck - if he kept this up, it would be nicely dizzy - but better not push it too long, or it would be breathing fire again -    Harry plummeted just as the Horntail opened its mouth, but this time he was less lucky - he missed the flames, but the tail came whipping up to meet him instead, and as he swerved to the left, one of the long spikes grazed his shoulder, ripping his robes --   He could feel it stinging, he could hear screaming and groans from the crowd, but the cut didn't seem to be deep. . . . Now he zoomed around the back of the Horntail, and a possibility occurred to him....   The Horntail didn't seem to want to take off, she was too protective of her eggs. Though she writhed and twisted, furling and unfurling her wings and keeping those fearsome yellow eyes on Harry, she was afraid to move too far from them. . . but he had to persuade her to do it, or he'd never get near them. . . . The trick was to do it carefully, gradually....   He began to fly, first this way, then the other, not near enough to make her breathe fire to stave him off, but still posing a sufficient threat to ensure she kept her eyes on him.  Her head swayed this way and that, watching him out of those vertical pupils, her fangs bared...   He flew higher.  The Horntail's head rose with him, her neck now stretched to its fullest extent, still swaying, hike a snake before its charmer. . .   Harry rose a few more feet, and she let out a roar of exasperation.  He was like a fly to her, a fly she was longing to swat; her tail thrashed again, but he was too high to reach now. . . . She shot fire into the air, which he dodged.. . . Her jaws opened wide.... \"Come on,\" Harry hissed, swerving tantalizingly above her, \"come on, come and get me. . . up you get now. .\" And then she reared, spreading her great, black, leathery wings at last, as wide as those of a small airplane - and Harry dived.  Before the dragon knew what he had done, or where he had disappeared to, he was speeding toward the ground as fast as he could go, toward the eggs now unprotected by her clawed front legs - he had taken his hands off his Firebolt - he had seized the golden egg -  And with a huge spurt of speed, he was off, he was soaring out over the stands, the heavy egg safely under his uninjured arm, and it was as though somebody had just turned the volume back up - for the first time, he became properly aware of the noise of the crowd, which was screaming and applauding as loudly as the Irish supporters at the World Cup -  \"Look at that!\" Bagman was yelling. \"Will you look at that! Our youngest champion is quickest to get his egg!  Well, this is going to shorten the odds on Mr. Potter!\" Harry saw the dragon keepers rushing forward to subdue the Horntail, and, over at the entrance to the enclosure, Professor McGonagalh, Professor Moody, and Hagrid hurrying to meet him, all of them waving him toward them, their smiles evident even from this distance.  He flew back over the stands, the noise of the crowd pounding his eardrums, and came in smoothly to land, his heart lighter than it had been in weeks. . . . He had got through the first task, he had survived. \"That was excellent, Potter!\"  cried Professor McGonagall as he got off the Firebolt - which from her was extravagant praise.  He noticed that her hand shook as she pointed at his shoulder.  \"You'll need to see Madam Pomfrey before the judges give out your score. . . . Over there, she's had to mop up Diggory already. . . .\" \"Yeh did it, Harry!\" said Hagrid hoarsely.  \"Yeh did it!  An' agains' the Horntail an' all, an' yeh know Charlie said that was the wors' - \" \"Thanks, Hagrid,\" said Harry loudly, so that Hagrid wouldn't blunder on and reveal that he had shown Harry the dragons beforehand. Professor Moody looked very pleased too; his magical eye was dancing in its socket. \"Nice and easy does the trick, Potter,\" he growled. \"Right then, Potter, the first aid tent, please. . .\" said Professor McGonagall. Harry walked out of the enclosure, still panting, and saw Madam Pomfrey standing at the mouth of a second tent, looking worried. \"Dragons!\"  she said, in a disgusted tone, pulling Harry inside.  The tent was divided into cubicles; he could make out Cedric's shadow through the canvas, but Cedric didn't seem to be badly injured; he was sitting up, at least. Madam Pomfrey examined Harry's shoulder, talking furiously all the while.  \"Last year dementors, this year dragons, what are they going to bring into this school next?  You're very lucky. . . this is quite shallow. . . it'll need cleaning before I heal it up, though... .\" She cleaned the cut with a dab of some purple liquid that smoked and stung, but then poked his shoulder with her wand, and he felt it heal instantly. \"Now, just sit quietly for a minute - sit!  And then you can go and get your score."
}