{
  "id": "d121d3f1769fe15ee08b8a3f4f9914f4ba105819",
  "text": "\"  \"I beg your pardon?\" said the girl stiffly. \"Our common room? I'm a Ravenclaw.\"  She walked away, looking suspiciously back at them.  Harry and Ron hurried down the stone steps into the darkness, their footsteps echoing particularly loudly as Crabbe's and Goyle's huge feet hit the floor, feeling that this wasn't going to be as easy as they had hoped.  The labyrinthine passages were deserted. They walked deeper and deeper under the school, constantly checking their watches to see how much time they had left. After a quarter of an hour, just when they were getting desperate, they heard a sudden movement ahead.  \"Ha!\" said Ron excitedly. \"There's one of them now!\"  The figure was emerging from a side room. As they hurried nearer, however, their hearts sank. It wasn't a Slytherin, it was Percy.  \"What're you doing down here?\" said Ron in surprise.  Percy looked affronted.  \"That,\" he said stiffly, \"is none of your business. It's Crabbe, isn't it?\"  2 19  \"Wh - oh, yeah,\" said Ron.  \"Well, get off to your dormitories,\" said Percy sternly. \"It's not safe to go wandering around dark corridors these days.\"  \"You are,\" Ron pointed out.  \"I,\" said Percy, drawing himself up, \"am a prefect. Nothing's about to attack me.\"  A voice suddenly echoed behind Harry and Ron. Draco Malfoy was strolling toward them, and for the first time in his life, Harry was pleased to see him.  \"There you are,\" he drawled, looking at them. \"Have you two been pigging out in the Great Hall all this time? I've been looking for you; I want to show you something really funny.\"  Malfoy glanced witheringly at Percy.  \"And what're you doing down here, Weasley?\" he sneered.  Percy looked outraged.  \"You want to show a bit more respect to a school prefect!\" he said. \"I don't like your attitude!\"  Malfoy sneered and motioned for Harry and Ron to follow him. Harry almost said something apologetic to Percy but caught himself just in time. He and Ron hurried after Malfoy, who said as they turned into the next passage, \"That Peter Weasley -\"  \"Percy,\" Ron corrected him automatically.  \"Whatever,\" said Malfoy. \"I've noticed him sneaking around a lot lately. And I bet I know what he's up to. He thinks he's going to catch Slytherin's heir single-handed.\"  He gave a short, derisive laugh. Harry and Ron exchanged excited looks.  Malfoy paused by a stretch of bare, damp stone wall.  * 220 *  \"What's the new password again?\" he said to Harry.  \"Er -\" said Harry.  \"Oh, yeah -pure-blood!\" said Malfoy, not listening, and a stone door concealed in the wall slid open. Malfoy marched through it, and Harry and Ron followed him.  The Slytherin common room was a long, low underground room with rough stone walls and ceiling from which round, greenish lamps were hanging on chains. A fire was crackling under an elaborately carved mantelpiece ahead of them, and several Slytherins were silhouetted around it in high-backed chairs.  \"Wait here,\" said Malfoy to Harry and Ron, motioning them to a pair of empty chairs set back from the fire. \"I'll go and get it my father's just sent it to me -\"  Wondering what Malfoy was going to show them, Harry and Ron sat down, doing their best to look at home.  Malfoy came back a minute later, holding what looked like a newspaper clipping. He thrust it under Ron's nose.  \"That'll give you a laugh,\" he said.  Harry saw Ron's eyes widen in shock. He read the clipping quickly, gave a very forced laugh, and handed it to Harry.  It had been clipped out of the Daily Prophet, and it said:  INQUIRY AT THE MINISTRY OF MAGIC  Arthur Weasley, Head of the Misuse of Muggle Artifacts Office, was today fined fifty Galleons for bewitching a Muggle car.  Mr. Lucius Malfoy, a governor of Hogwarts School of Witchcraft and Wizardry, where the  221  enchanted car crashed earlier this year, called today for Mr. Weasley's resignation.  \"Weasley has brought the Ministry into disrepute,\" Mr. Malfoy told our reporter. \"He is clearly unfit to draw up our laws and his ridiculous Muggle Protection Act should be scrapped immediately.\"  Mr. Weasley was unavailable for comment, although his wife told reporters to clear off or she'd set the family ghoul on them.  \"Well?\" said Malfoy impatiently as Harry handed the clipping back to him. \"Don't you think it's funny?\"  \"Ha, ha,\" said Harry bleakly.  \"Arthur Weasley loves Muggles so much he should snap his wand in half and go and join them,\" said Malfoy scornfully. \"You'd never know the Weasleys were pure-bloods, the way they behave.\"  Ron's - or rather, Crabbe's - face was contorted with fury.  \"What's up with you, Crabbe?\" snapped Malfoy.  \"Stomachache,\" Ron grunted.  \"Well, go up to the hospital wing and give all those Mudbloods a kick from me,\" said Malfoy, snickering. \"You know, I'm surprised the Daily Prophet hasn't reported all these attacks yet,\" he went on thoughtfully. \"I suppose Dumbledore's trying to hush it all up. He'll be sacked if it doesn't stop soon. Father's always said old Dumbledore's the worst thing that's ever happened to this place."
}