{
  "id": "d1836d5235334cebca9f1670891584931bfea580",
  "text": "  \"All in order,\" she said as he clumsily fed himself porridge lefthanded. \"When you've finished eating, you may leave.\"  Harry dressed as quickly as he could and hurried off to Gryffindor Tower, desperate to tell Ron and Hermione about Colin and Dobby, but they weren't there. Harry left to look for them, wondering where they could have got to and feeling slightly hurt that they weren't interested in whether he had his bones back or not.  *182*    As Harry passed the library, Percy Weasley strolled out of it, looking in far better spirits than last time they'd met.  \"Oh, hello, Harry,\" he said. \"Excellent flying yesterday, really excellent. Gryffindor has just taken the lead for the House Cup you earned fifty points!\"  \"You haven't seen Ron or Hermione, have you?\" said Harry.  \"No, I haven't,\" said Percy, his smile fading. \"I hope Ron's not in another girls' toilet .....  Harry forced a laugh, watched Percy walk out of sight, and then headed straight for Moaning Myrtle's bathroom. He couldn't see why Ron and Hermione would be in there again, but after making sure that neither Filch nor any prefects were around, he opened the door and heard their voices coming from a locked stall.  \"It's me,\" he said, closing the door behind him. There was a clunk, a splash, and a gasp from within the stall and he saw Hermione's eye peering through the keyhole.  `Harry!\" she said. \"You gave us such a fright - come in how's your arm?\"  \"Fine,\" said Harry, squeezing into the stall. An old cauldron was perched on the toilet, and a crackling from under the rim told Harry they had lit a fire beneath it. Conjuring up portable, waterproof fires was a speciality of Hermione's.  \"We'd've come to meet you, but we decided to get started on the Polyjuice Potion,\" Ron explained as Harry, with difficulty, locked the stall again. \"We've decided this is the safest place to hide it.\"  Harry started to tell them about Colin, but Hermione interrupted.  \"We already know - we heard Professor McGonagall telling  Professor Flitwick this morning. That's why we decided we'd better get going -\"  \"The sooner we get a confession out of Malfoy, the better,\" snarled Ron. \"D'you know what I think? He was in such a foul temper after the Quidditch match, he took it out on Colin.\"  \"There's something else,\" said Harry, watching Hermione tearing bundles of knotgrass and throwing them into the potion. \"Dobby came to visit me in the middle of the night.\"  Ron and Hermione looked up, amazed. Harry told them everything Dobby had told him - or hadn't told him. Hermione and Ron listened with their mouths open.  \"The Chamber of Secrets has been opened before?\" Hermione said.  \"This settles it,\" said Ron in a triumphant voice. \"Lucius Malfoy must've opened the Chamber when he was at school here and now he's told dear old Draco how to do it. It's obvious. Wish Dobby'd told you what kind of monster's in there, though. I want to know how come nobody's noticed it sneaking around the school.\"  \"Maybe it can make itself invisible,\" said Hermione, prodding leeches to the bottom of the cauldron. \"Or maybe it can disguise itself - pretend to be a suit of armor or something - I've read about Chameleon Ghouls -\"  \"You read too much, Hermione,\" said Ron, pouring dead lacewings on top of the leeches. He crumpled up the empty lacewing bag and looked at Harry.  \"So Dobby stopped us from getting on the train and broke your   arm  He shook his head. \"You know what, Harry? If he doesn't  stop trying to save your life he's going to kill you.\"  *184*  The news that Colin Creevey had been attacked and was now lying as though dead in the hospital wing had spread through the entire school by Monday morning. The air was suddenly thick with rumor and suspicion. The first years were now moving around the castle in tight-knit groups, as though scared they would be attacked if they ventured forth alone.  Ginny Weasley, who sat next to Colin Creevey in Charms, was distraught, but Harry felt that Fred and George were going the wrong way about cheering her up. They were taking turns covering themselves with fur or boils and jumping out at her from behind statues. They only stopped when Percy, apoplectic with rage, told them he was going to write to Mrs. Weasley and tell her Ginny was having nightmares.  Meanwhile, hidden from the teachers, a roaring trade in talismans, amulets, and other protective devices was sweeping the school. Neville Longbottom bought a large, evil-smelling green onion, a pointed purple crystal, and a rotting newt tail before the other Gryffindor boys pointed out that he was in no danger; he was a pure- blood, and therefore unlikely to be attacked.  \"They went for Filch first,\" Neville said, his round face fearful. \"And everyone knows I'm almost a Squib.\"  In the second week of December Professor McGonagall came around as usual, collecting names of those who would be staying at school for Christmas. Harry, Ron, and Hermione signed her list; they had heard that Malfoy was staying, which struck them as very suspicious."
}