{
  "id": "d1933d02eea334377a81a3bd040bb838a5f07c71",
  "text": "  From the south. We climbed the Wall…   Maester Aemon gave Jon’s crude bandage a sniff when Clydas cut it away.  We?    I was with them. Qhorin Halfhand commanded me to join them.  Jon winced as the maester’s finger explored his wound, poking and prodding.  The Magnar of Thenn—aaaaah, that hurts.  He clenched his teeth.  Where is the Old Bear?    Jon… it grieves me to say, but Lord Commander Mormont was murdered at Craster’s Keep, at the hands of his Sworn Brothers.    Bro… our own men?  Aemon’s words hurt a hundred times worse than his fingers. Jon remembered the Old Bear as last he’d seen him, standing before his tent with his raven on his arm croaking for corn. Mormont gone? He had feared it ever since he’d seen the aftermath of battle on the Fist, yet it was no less a blow.  Who was it? Who turned on him?    Garth of Oldtown, Ollo Lophand, Dirk… thieves, cowards and killers, the lot of them. We should have seen it coming. The Watch is not what it was. Too few honest men to keep the rogues in line.  Donal Noye turned the maester’s blades in the fire.  A dozen true men made it back. Dolorous Edd, Giant, your friend the Aurochs. We had the tale from them.   Only a dozen? Two hundred men had left Castle Black with Lord Commander Mormont, two hundred of the Watch’s best.  Does this mean Marsh is Lord Commander, then?  The Old Pomegranate was amiable, and a diligent First Steward, but he was woefully ill-suited to face a wildling host.   For the nonce, until we can hold a choosing,  said Maester Aemon.  Clydas, bring me the flask.   A choosing. With Qhorin Halfhand and Ser Jaremy Rykker both dead and Ben Stark still missing, who was there? Not Bowen Marsh or Ser Wynton Stout, that was certain. Had Thoren Smallwood survived the Fist, or Ser Ottyn Wythers? No, it will be Cotter Pyke or Ser Denys Mallister. Which, though? The commanders at the Shadow Tower and Eastwatch were good men, but very different; Ser Denys courtly and cautious, as chivalrous as he was elderly, Pyke younger, bastard-born, rough-tongued, and bold to a fault. Worse, the two men despised each other. The Old Bear had always kept them far apart, at opposite ends of the Wall. The Mallisters had a bone-deep mistrust of the ironborn, Jon knew.  A stab of pain reminded him of his own woes. The maester squeezed his hand.  Clydas is bringing milk of the poppy.   Jon tried to rise.  I don’t need—    You do,  Aemon said firmly.  This will hurt.   Donal Noye crossed the room and shoved Jon back onto his back.  Be still, or I’ll tie you down.  Even with only one arm, the smith handled him as if he were a child. Clydas returned with a green flask and a rounded stone cup. Maester Aemon poured it full.  Drink this.   Jon had bitten his lip in his struggles. He could taste blood mingled with the thick, chalky potion. It was all he could do not to retch it back up.  Clydas brought a basin of warm water, and Maester Aemon washed the pus and blood from his wound. Gentle as he was, even the lightest touch made Jon want to scream.  The Magnar’s men are disciplined, and they have bronze armor,  he told them. Talking helped keep his mind off his leg.   The Magnar’s a lord on Skagos,  Noye said.  There were Skagossons at Eastwatch when I first came to the Wall, I remember hearing them talk of him.    Jon was using the word in its older sense, I think,  Maester Aemon said,  not as a family name but as a title. It derives from the Old Tongue.    It means lord,  Jon agreed.  Styr is the Magnar of some place called Thenn, in the far north of the Frostfangs. He has a hundred of his own men, and a score of raiders who know the Gift almost as well as we do. Mance never found the horn, though, that’s something. The Horn of Winter, that’s what he was digging for up along the Milkwater.   Maester Aemon paused, washcloth in hand.  The Horn of Winter is an ancient legend. Does the King-beyond-the-Wall truly believe that such a thing exists?    They all do,  said Jon.  Ygritte said they opened a hundred graves… graves of kings and heroes, all over the valley of the Milkwater, but they never…    Who is Ygritte?  Donal Noye asked pointedly.   A woman of the free folk.  How could he explain Ygritte to them? She’s warm and smart and funny and she can kiss a man or slit his throat.  She’s with Styr, but she’s not… she’s young, only a girl, in truth, wild, but she…  She killed an old man for building a fire. His tongue felt thick and clumsy. The milk of the poppy was clouding his wits.  I broke my vows with her. I never meant to, but…  It was wrong. Wrong to love her, wrong to leave her…  I wasn’t strong enough. The Halfhand commanded me, ride with them, watch, I must not balk, I…  His head felt as if it were packed with wet wool.  Maester Aemon sniffed Jon’s wound again. Then he put the bloody cloth back in the basin and said,  Donal, the hot knife, if you please. I shall need you to hold him still.   I will not scream, Jon told himself when he saw the blade glowing red hot. But he broke that vow as well."
}