{
  "id": "d19def97987a68a192653e4c079882da9906654e",
  "text": "  But something happened in their first lesson, Transfiguration, that drove the Chamber of Secrets out of their minds for the first time in weeks. Ten minutes into the class, Professor McGonagall told them that their exams would start on the first of June, one week from today.  `Exams?\" howled Seamus Finnigan. \"We're still getting exams?\"  There was a loud bang behind Harry as Neville Longbottom's wand slipped, vanishing one of the legs on his desk. Professorr  *28%*    McGonagall restored it with a wave of her own wand, and turned, frowning, to Seamus.  \"The whole point of keeping the school open at this time is for you to receive your education,\" she said sternly. \"The exams will therefore take place as usual, and I trust you are all studying hard.\"  Studying hard! It had never occurred to Harry that there would be exams with the castle in this state. There was a great deal of mutinous muttering around the room, which made Professor McGonagall scowl even more darkly.  \"Professor Dumbledore's instructions were to keep the school running as normally as possible, she said. \"And that, I need hardly point out, means finding out how much you have learned this year.  Harry looked down at the pair of white rabbits he was supposed to be turning into slippers. What had he learned so far this year? He couldn't seem to think of anything that would be useful in an exam.  Ron looked as though he'd just been told he had to go and live in the Forbidden Forest.  \"Can you imagine me taking exams with this?\" he asked Harry, holding up his wand, which had just started whistling loudly.  Three days before their first exam, Professor McGonagall made another announcement at breakfast.  \"I have good news,\" she said, and the Great Hall, instead of falling silent, erupted.  \"Dumbledore's coming back!\" several people yelled joyfully.  \"You've caught the Heir of Slytherin!\" squealed a girl at the Ravenclaw table.  284*  \"Quidditch matches are back on!\" roared Wood excitedly.  When the hubbub had subsided, Professor McGonagall said, \"Professor Sprout has informed me that the Mandrakes are ready for cutting at last. Tonight, we will be able to revive those people who have been Petrified. I need hardly remind you all that one of them may well be able to tell us who, or what, attacked them. I am hopeful that this dreadful year will end with our catching the culprit.\"  There was an explosion of cheering. Harry looked over at the Slytherin table and wasn't at all surprised to see that Draco Malfoy hadn't joined in. Ron, however, was looking happier than he'd looked in days.  \"It won't matter that we never asked Myrtle, then!\" he said to Harry. \"Hermione'll probably have all the answers when they wake her up! Mind you, she'll go crazy when she finds out we've got exams in three days' time. She hasn't studied. It might be kinder to leave her where she is till they're over.\"  Just then, Ginny Weasley came over and sat down next to Ron. She looked tense and nervous, and Harry noticed that her hands were twisting in her lap.  \"What's up?\" said Ron, helping himself to more porridge.  Ginny didn't say anything, but glanced up and down the Gryffindor table with a scared look on her face that reminded Harry of someone, though he couldn't think who.  \"Spit it out,\" said Ron, watching her.  Harry suddenly realized who Ginny looked like. She was rocking backward and forward slightly in her chair, exactly like Dobby did when he was teetering on the edge of revealing forbidden information.  \"I've got to tell you something,\" Ginny mumbled, carefully not looking at Harry.  \"What is it?\" said Harry.  Ginny looked as though she couldn't find the right words.  \"What?\"said Ron.  Ginny opened her mouth, but no sound came out. Harry leaned forward and spoke quietly, so that only Ginny and Ron could hear him.  \"Is it something about the Chamber of Secrets? Have you seen something? Someone acting oddly?\"  Ginny drew a deep breath and, at that precise moment, Percy Weasley appeared, looking tired and wan.  \"If you've finished eating, I'll take that seat, Ginny. I'm starving, I've only just come off patrol duty.\"  Ginny jumped up as though her chair had just been electrified, gave Percy a fleeting, frightened look, and scampered away. Percy sat down and grabbed a mug from the center of the table.  \"Percy!\" said Ron angrily. \"She was just about to tell us some-' thing important!\"  Halfway through a gulp of tea, Percy choked.  \"What sort of thing?\" he said, coughing.  \"I just asked her if she'd seen anything odd, and she started to say  \"Oh - that - that's nothing to do with the Chamber of Secrets,\" said Percy at once.  \"How do you know?\" said Ron, his eyebrows raised.  \"Well, er, if you must know, Ginny, er, walked in on me the other day when I was - well, never mind - the point is, she spot  ted me doing something and I, um, I asked her not to mention it to anybody. I must say, I did think she'd keep her word. It's nothing, really, Id just rather -\"  Harry had never seen Percy look so uncomfortable."
}