{
  "id": "d1adef3a10d51f000d050a7d75be231edaca510f",
  "text": " A woven net hung from one slim hip, a long bronze knife from the other; under her arm she carried an old iron greathelm spotted with rust; a frog spear and round leathern shield were strapped to her back.  Her brother was several years younger and bore no weapons. All his garb was green, even to the leather of his boots, and when he came closer Bran saw that his eyes were the color of moss, though his teeth looked as white as anyone else’s. Both Reeds were slight of build, slender as swords and scarcely taller than Bran himself. They went to one knee before the dais.   My lords of Stark,  the girl said.  The years have passed in their hundreds and their thousands since my folk first swore their fealty to the King in the North. My lord father has sent us here to say the words again, for all our people.   She is looking at me, Bran realized. He had to make some answer.  My brother Robb is fighting in the south,  he said,  but you can say your words to me, if you like.    To Winterfell we pledge the faith of Greywater,  they said together.  Hearth and heart and harvest we yield up to you, my lord. Our swords and spears and arrows are yours to command. Grant mercy to our weak, help to our helpless, and justice to all, and we shall never fail you.    I swear it by earth and water,  said the boy in green.   I swear it by bronze and iron,  his sister said.   We swear it by ice and fire,  they finished together.  Bran groped for words. Was he supposed to swear something back to them? Their oath was not one he had been taught.  May your winters be short and your summers bountiful,  he said. That was usually a good thing to say.  Rise. I’m Brandon Stark.   The girl, Meera, got to her feet and helped her brother up. The boy stared at Bran all the while.  We bring you gifts of fish and frog and fowl,  he said.   I thank you.  Bran wondered if he would have to eat a frog to be polite.  I offer you the meat and mead of Winterfell.  He tried to recall all he had been taught of the crannogmen, who dwelt amongst the bogs of the Neck and seldom left their wetlands. They were a poor folk, fishers and frog-hunters who lived in houses of thatch and woven reeds on floating islands hidden in the deeps of the swamp. It was said that they were a cowardly people who fought with poisoned weapons and preferred to hide from foes rather than face them in open battle. And yet Howland Reed had been one of Father’s staunchest companions during the war for King Robert’s crown, before Bran was born.  The boy, Jojen, looked about the hall curiously as he took his seat.  Where are the direwolves?    In the godswood,  Rickon answered.  Shaggy was bad.    My brother would like to see them,  the girl said.  Little Walder spoke up loudly.  He’d best watch they don’t see him, or they’ll take a bite out of him.    They won’t bite if I’m there.  Bran was pleased that they wanted to see the wolves.  Summer won’t anyway, and he’ll keep Shaggydog away.  He was curious about these mudmen. He could not recall ever seeing one before. His father had sent letters to the Lord of Greywater over the years, but none of the crannogmen had ever called at Winterfell. He would have liked to talk to them more, but the Great Hall was so noisy that it was hard to hear anyone who wasn’t right beside you.  Ser Rodrik was right beside Bran.  Do they truly eat frogs?  he asked the old knight.   Aye,  Ser Rodrik said.  Frogs and fish and lizard-lions, and all manner of birds.   Maybe they don’t have sheep and cattle, Bran thought. He commanded the serving men to bring them mutton chops and a slice off the aurochs and fill their trenchers with beef-and-barley stew. They seemed to like that well enough. The girl caught him staring at her and smiled. Bran blushed and looked away.  Much later, after all the sweets had been served and washed down with gallons of surnmerwine, the food was cleared and the tables shoved back against the walls to make room for the dancing. The music grew wilder, the drummers joined in, and Hother Umber brought forth a huge curved warhorn banded in silver. When the singer reached the part in  The Night That Ended  where the Night’s Watch rode forth to meet the Others in the Battle for the Dawn, he blew a blast that set all the dogs to barking.  Two Glover men began a spinning skirl on bladder and woodharp. Mors Umber was the first on his feet. He seized a passing serving girl by the arm, knocking the flagon of wine out of her hands to shatter on the floor. Amidst the rushes and bones and bits of bread that littered the stone, he whirled her and spun her and tossed her in the air. The girl squealed with laughter and turned red as her skirts swirled and lifted.  Others soon joined in. Hodor began to dance all by himself, while Lord Wyman asked little Beth Cassel to partner him. For all his size, he moved gracefully. When he tired, Cley Cerwyn danced with the child in his stead. Ser Rodrik approached Lady Hornwood, but she made her excuses and took her leave."
}