{
  "id": "d206508f7a0ecda037a3a04f36ee8bde72c9f024",
  "text": " He turned and ran off before Hodor and the other stableboys could see the tears in his eyes. That was the end of his farewells. Instead Bran spent the morning alone in the godswood, trying to teach his wolf to fetch a stick, and failing. The wolfling was smarter than any of the hounds in his father’s kennel and Bran would have sworn he understood every word that was said to him, but he showed very little interest in chasing sticks.  He was still trying to decide on a name. Robb was calling his Grey Wind, because he ran so fast. Sansa had named hers Lady, and Arya named hers after some old witch queen in the songs, and little Rickon called his Shaggydog, which Bran thought was a pretty stupid name for a direwolf. Jon’s wolf, the white one, was Ghost. Bran wished he had thought of that first, even though his wolf wasn’t white. He had tried a hundred names in the last fortnight, but none of them sounded right.  Finally he got tired of the stick game and decided to go climbing. He hadn’t been up to the broken tower for weeks with everything that had happened, and this might be his last chance.  He raced across the godswood, taking the long way around to avoid the pool where the heart tree grew. The heart tree had always frightened him; trees ought not have eyes, Bran thought, or leaves that looked like hands. His wolf came sprinting at his heels.  You stay here,  he told him at the base of the sentinel tree near the armory wall.  Lie down. That’s right. Now stay—   The wolf did as he was told. Bran scratched him behind the ears, then turned away, jumped, grabbed a low branch, and pulled himself up. He was halfway up the tree, moving easily from limb to limb, when the wolf got to his feet and began to howl.  Bran looked back down. His wolf fell silent, staring up at him through slitted yellow eyes. A strange chill went through him. He began to climb again. Once more the wolf howled.  Quiet,  he yelled.  Sit down. Stay. You’re worse than Mother.  The howling chased him all the way up the tree, until finally he jumped off onto the armory roof and out of sight.  The rooftops of Winterfell were Bran’s second home. His mother often said that Bran could climb before he could walk. Bran could not remember when he first learned to walk, but he could not remember when he started to climb either, so he supposed it must be true.  To a boy, Winterfell was a grey stone labyrinth of walls and towers and courtyards and tunnels spreading out in all directions. In the older parts of the castle, the halls slanted up and down so that you couldn’t even be sure what floor you were on. The place had grown over the centuries like some monstrous stone tree, Maester Luwin told him once, and its branches were gnarled and thick and twisted, its roots sunk deep into the earth.  When he got out from under it and scrambled up near the sky, Bran could see all of Winterfell in a glance. He liked the way it looked, spread out beneath him, only birds wheeling over his head while all the life of the castle went on below. Bran could perch for hours among the shapeless, rain-worn gargoyles that brooded over the First Keep, watching it all: the men drilling with wood and steel in the yard, the cooks tending their vegetables in the glass garden, restless dogs running back and forth in the kennels, the silence of the godswood, the girls gossiping beside the washing well. It made him feel like he was lord of the castle, in a way even Robb would never know.  It taught him Winterfell’s secrets too. The builders had not even leveled the earth; there were hills and valleys behind the walls of Winterfell. There was a covered bridge that went from the fourth floor of the bell tower across to the second floor of the rookery. Bran knew about that. And he knew you could get inside the inner wall by the south gate, climb three floors and run all the way around Winterfell through a narrow tunnel in the stone, and then come out on ground level at the north gate, with a hundred feet of wall looming over you. Even Maester Luwin didn’t know that, Bran was convinced.  His mother was terrified that one day Bran would slip off a wall and kill himself. He told her that he wouldn’t, but she never believed him. Once she made him promise that he would stay on the ground. He had managed to keep that promise for almost a fortnight, miserable every day, until one night he had gone out the window of his bedroom when his brothers were fast asleep.  He confessed his crime the next day in a fit of guilt. Lord Eddard ordered him to the godswood to cleanse himself. Guards were posted to see that Bran remained there alone all night to reflect on his disobedience. The next morning Bran was nowhere to be seen. They finally found him fast asleep in the upper branches of the tallest sentinel in the grove.  As angry as he was, his father could not help but laugh.  You’re not my son,  he told Bran when they fetched him down,  you’re a squirrel. So be it. If you must climb, then climb, but try not to let your mother see you."
}