{
  "id": "d2072814aff4533a81cc4d901d551d29a6fe108b",
  "text": "  My lord father’s trumpets,  he said.  Battle assembly. I thought Stark was yet a day’s march away.   Shae shook her head, lost. Her eyes were wide and white.  Groaning, Tyrion lurched to his feet and pushed his way outside, shouting for his squire. Wisps of pale fog drifted through the night, long white fingers off the river. Men and horses blundered through the predawn chill; saddles were being cinched, wagons loaded, fires extinguished. The trumpets blew again: hurry hurry hurry. Knights vaulted onto snorting coursers while men-at-arms buckled their sword belts as they ran. When he found Pod, the boy was snoring softly. Tyrion gave him a sharp poke in the ribs with his toe.  My armor,  he said,  and be quick about it.  Bronn came trotting out of the mists, already armored and ahorse, wearing his battered halfhelm.  Do you know what’s happened?  Tyrion asked him.   The Stark boy stole a march on us,  Bronn said.  He crept down the kingsroad in the night, and now his host is less than a mile north of here, forming up in battle array.   Hurry, the trumpets called, hurry hurry hurry.   See that the clansmen are ready to ride.  Tyrion ducked back inside his tent.  Where are my clothes?  he barked at Shae.  There. No, the leather, damn it. Yes. Bring me my boots.   By the time he was dressed, his squire had laid out his armor, such that it was. Tyrion owned a fine suit of heavy plate, expertly crafted to fit his misshapen body. Alas, it was safe at Casterly Rock, and he was not. He had to make do with oddments assembled from Lord Lefford’s wagons: mail hauberk and coif, a dead knight’s gorget, lobstered greaves and gauntlets and pointed steel boots. Some of it was ornate, some plain; not a bit of it matched, or fit as it should. His breastplate was meant for a bigger man; for his oversize head, they found a huge bucket-shaped greathelm topped with a foot-long triangular spike.  Shae helped Pod with the buckles and clasps.  If I die, weep for me,  Tyrion told the whore.   How will you know? You’ll be dead.    I’ll know.    I believe you would.  Shae lowered the greathelm down over his head, and Pod fastened it to his gorget. Tyrion buckled on his belt, heavy with the weight of shortsword and dirk. By then his groom had brought up his mount, a formidable brown courser armored as heavily as he was. He needed help to mount; he felt as though he weighed a thousand stone. Pod handed him up his shield, a massive slab of heavy ironwood banded with steel. Lastly they gave him his battle-axe. Shae stepped back and looked him over.  M’lord looks fearsome.    M’lord looks a dwarf in mismatched armor,  Tyrion answered sourly,  but I thank you for the kindness. Podrick, should the battle go against us, see the lady safely home.  He saluted her with his axe, wheeled his horse about, and trotted off. His stomach was a hard knot, so tight it pained him. Behind, his servants hurriedly began to strike his tent. Pale crimson fingers fanned out to the east as the first rays of the sun broke over the horizon. The western sky was a deep purple, speckled with stars. Tyrion wondered whether this was the last sunrise he would ever see… and whether wondering was a mark of cowardice. Did his brother Jaime ever contemplate death before a battle?  A warhorn sounded in the far distance, a deep mournful note that chilled the soul. The clansmen climbed onto their scrawny mountain horses, shouting curses and rude jokes. Several appeared to be drunk. The rising sun was burning off the drifting tendrils of fog as Tyrion led them off. What grass the horses had left was heavy with dew, as if some passing god had scattered a bag of diamonds over the earth. The mountain men fell in behind him, each clan arrayed behind its own leaders.  In the dawn light, the army of Lord Tywin Lannister unfolded like an iron rose, thorns gleaming.  His uncle would lead the center. Ser Kevan had raised his standards above the kingsroad. Quivers hanging from their belts, the foot archers arrayed themselves into three long lines, to east and west of the road, and stood calmly stringing their bows. Between them, pikemen formed squares; behind were rank on rank of men-at-arms with spear and sword and axe. Three hundred heavy horse surrounded Ser Kevan and the lords bannermen Lefford, Lydden, and Serrett with all their sworn retainers.  The right wing was all cavalry, some four thousand men, heavy with the weight of their armor. More than three quarters of the knights were there, massed together like a great steel fist. Ser Addam Marbrand had the command. Tyrion saw his banner unfurl as his standardbearer shook it out; a burning tree, orange and smoke. Behind him flew Ser Flement’s purple unicorn, the brindled boar of Crakehall, the bantam rooster of Swyft, and more.  His lord father took his place on the hill where he had slept. Around him, the reserve assembled; a huge force, half mounted and half foot, five thousand strong. Lord Tywin almost always chose to command the reserve; he would take the high ground and watch the battle unfold below him, committing his forces when and where they were needed most."
}