{
  "id": "d25f0abfb069621fb07ed44760f9676b55a5fedd",
  "text": "  Khal Drogo,  she forced herself to say, watching their faces with dread.  Is he—?    The khal lives,  Irri answered quietly… yet Dany saw a darkness in her eyes when she said the words, and no sooner had she spoken than she rushed away to fetch water.  She turned to Doreah.  Tell me.    I… I shall bring Ser Jorah,  the Lysene girl said, bowing her head and fleeing the tent.  Jhiqui would have run as well, but Dany caught her by the wrist and held her captive.  What is it? I must know. Drogo… and my child.  Why had she not remembered the child until now?  My son… Rhaego… where is he? I want him.   Her handmaid lowered her eyes.  The boy… he did not live, Khaleesi.  Her voice was a frightened whisper.  Dany released her wrist. My son is dead, she thought as Jhiqui left the tent. She had known somehow. She had known since she woke the first time to Jhiqui’s tears. No, she had known before she woke. Her dream came back to her, sudden and vivid, and she remembered the tall man with the copper skin and long silver-gold braid, bursting into flame.  She should weep, she knew, yet her eyes were dry as ash. She had wept in her dream, and the tears had turned to steam on her cheeks. All the grief has been burned out of me, she told herself. She felt sad, and yet… she could feel Rhaego receding from her, as if he had never been.  Ser Jorah and Mirri Maz Duur entered a few moments later, and found Dany standing over the other dragon’s eggs, the two still in their chest. It seemed to her that they felt as hot as the one she had slept with, which was passing strange.  Ser Jorah, come here,  she said. She took his hand and placed it on the black egg with the scarlet swirls.  What do you feel?    Shell, hard as rock.  The knight was wary.  Scales.    Heat?    No. Cold stone.  He took his hand away.  Princess, are you well? Should you be up, weak as you are?    Weak? I am strong, Jorah.  To please him, she reclined on a pile of cushions.  Tell me how my child died.    He never lived, my princess. The women say…  He faltered, and Dany saw how the flesh hung loose on him, and the way he limped when he moved.   Tell me. Tell me what the women say.   He turned his face away. His eyes were haunted.  They say the child was…   She waited, but Ser Jorah could not say it. His face grew dark with shame. He looked half a corpse himself.   Monstrous,  Mirri Maz Duur finished for him. The knight was a powerful man, yet Dany understood in that moment that the maegi was stronger, and crueler, and infinitely more dangerous.  Twisted. I drew him forth myself. He was scaled like a lizard, blind, with the stub of a tail and small leather wings like the wings of a bat. When I touched him, the flesh sloughed off the bone, and inside he was full of graveworms and the stink of corruption. He had been dead for years.   Darkness, Dany thought. The terrible darkness sweeping up behind to devour her. If she looked back she was lost.  My son was alive and strong when Ser Jorah carried me into this tent,  she said.  I could feel him kicking, fighting to be born.    That may be as it may be,  answered Mirri Maz Duur,  yet the creature that came forth from your womb was as I said. Death was in that tent, Khaleesi.    Only shadows,  Ser Jorah husked, but Dany could hear the doubt in his voice.  I saw, maegi. I saw you, alone, dancing with the shadows.     The grave casts long shadows, Iron Lord,  Mirri said.  Long and dark, and in the end no light can hold them back.   Ser Jorah had killed her son, Dany knew. He had done what he did for love and loyalty, yet he had carried her into a place no living man should go and fed her baby to the darkness. He knew it too; the grey face, the hollow eyes, the limp.  The shadows have touched you too, Ser Jorah,  she told him. The knight made no reply. Dany turned to the godswife.  You warned me that only death could pay for life. I thought you meant the horse.    No,  Mirri Maz Duur said.  That was a lie you told yourself. You knew the price.   Had she? Had she? If I look back I am lost.  The price was paid,  Dany said.  The horse, my child, Quaro and Qotho, Haggo and Cohollo. The price was paid and paid and paid.  She rose from her cushions.  Where is Khal Drogo? Show him to me, godswife, maegi, bloodmage, whatever you are. Show me Khal Drogo. Show me what I bought with my son’s life.    As you command, Khaleesi,  the old woman said.  Come, I will take you to him.   Dany was weaker than she knew. Ser Jorah slipped an arm around her and helped her stand.  Time enough for this later, my princess,  he said quietly.   I would see him now, Ser Jorah.   After the dimness of the tent, the world outside was blinding bright. The sun burned like molten gold, and the land was seared and empty. Her handmaids waited with fruit and wine and water, and Jhogo moved close to help Ser Jorah support her. Aggo and Rakharo stood behind. The glare of sun on sand made it hard to see more, until Dany raised her hand to shade her eyes. She saw the ashes of a fire, a few score horses milling listlessly and searching for a bite of grass, a scattering of tents and bedrolls."
}