{
  "id": "d2abb4960b987cb5bb1cdd2c300e514f0bf40629",
  "text": "  The  dwarves  indeed  no  longer  needed  any  urging.  All  were  now  eager  to  explore  the  hall  while  they  had  the  chance,  and  willing  to  believe  that,  for  the  present,  Smaug  was  away  from  home.  Each  now  gripped  a  lighted  torch;  and  as  they  gazed,  first  on  one  side  and  then  on  another,  they  forgot  fear  and  even  caution.  They  spoke  aloud,  and  cried  out  to  one  another,  as  they  lifted  old  treasures from the mound or from the wall and held them in the light caressing and  fingering them. Fili and Kili were almost in merry mood, and finding still hanging  there many  golden  harps  strung with  silver  they  took  them  and  struck  them;  and  being  magical  (and  also  untouched  by  the  dragon,  who  had  small  interests  in  music)  they  were  still  in  tune.  The  dark  hall  was  filled  with  a  melody  that  had  long been silent. But most of the dwarves were more practical; they gathered gems  and stuffed  their pockets, and  let what  they could  not carry far back through their  fingers  with  a  sigh.  Thorin  was  not  least  among  these;  but  always  he  searched   ####-from side to side for something which he could not find. It was the Arkenstone but  he spoke of it yet to no one.  Now  the  dwarves  took  down  mail  and  weapons  from  the  walls,  and  armed  themselves. Royal indeed did Thorin look, clad in a coat of gold-plated rings, with  a silver hafted axe in a belt crusted with scarlet stones.  \"Mr.  Baggins!\"  he  cried.  \"Here  is  the  first  payment  of  your  reward!  Cast  off  your old coat and put on this!\"  With  that  he  put  on  Bilbo  a  small  coat  of mail,  wrought  for  some  young  elf- prince long ago. It was of silver-steel which the elves call mithril, and with it went  a belt of pearls and crystals. A  light helm of  figured  leather, strengthened beneath  with hoops of steel, and studded about the bring with white gems, was set upon the  hobbit's head.  \"I  feel magnificent,\" he  thought;  \"but  I expect  I  look  rather absurd. How  they  would laugh on the Hill at home Still I wish there was a looking-glass handy!\"  All  the  same Mr. Baggins  kept  his  head more  clear  of  the  bewitchment  of  the  hoard  than  the dwarves did. Long before  the dwarves were  tired of examining  the  treasures he became wary of it and sat down on the floor; and he began to wonder  nervously what the end of it all would be  \"I would give a good many of  these precious goblets,    thought, \"for a drink of  something cheering out of one Beorn's wooden bowls!\"  \"Thorin!\"  he  cried  aloud.  \"What  next? We  are  armed,  but what  good  has  any  armour ever been before against Smaug the Dreadful? This treasure is not yet won  back.  We  are  not  looking  for  gold  yet,  but  for  a  way  of  escape;  and  we  have  tempted luck too long!\"  '\"You speak the truth!\" answered Thorin, recovering his wits. \"Let us go! I will  guide you. Not  in a  thousand years should  I  forget  the ways of  this palace.\" Then  he  hailed  the  others,  and  they  gathered  together,  and  holding  their  torches  above  their  heads  they  passed  through  the  gaping  doors,  not  without many  a  backward  glance of longing.  Their  glittering  mail  they  had  covered  again  with  their  old  cloaks  and  their  bright helms with their tattered hoods, and one by one they walked behind Thorin,  a  line  of  little  lights  in  the  darkness  that  halted  often,  listening  in  fear  once more  for any  rumour of  the dragon's coming. Though all  the old adornments were  long  mouldered  or  destroyed,  and  though  all  was  befouled  and  blasted  with  the  comings  and  goings  of  the  monster,  Thorin  knew  every  passage  and  every  turn.  They  climbed  long  stairs,  and  turned  and  went  down  wide  echoing  ways,  and  turned again and climbed yet more stairs, and yet more' stairs again.   ####-These were  smooth,  cut  out  of  the  living  rock  broad  and  lair;  and  up,  up,  the  dwarves went, and  they met no sign of any  living  thing, only furtive shadows that  fled  from  the  approach  of  their  torches  fluttering  in  the  draughts.  The  steps were  not made, all the same, for hobbit-legs, and Bilbo was just feeling that he could go  on no longer, when suddenly the roof sprang high and far beyond the reach of their  torch-light.  A  white  glimmer  could  be  seen  coming  through  some  opening  far  above,  and  the  air  smelt  sweeter.  Before  them  light  came  dimly  through  great  doors, that hung twisted on their hinges and half burnt.  \"This  is  the  great  chamber  of Thror,\"  said Thorin; \"the hall of  feasting and of  council. Not far off now is the Front Gate.\"  They passed through the ruined chamber. Tables were rotting there; chairs and  benches were lying there overturned, charred and decaying. Skulls and bones were  upon  the  floor  among  flagons  and  bowls  and  broken  drinking-horns and dust."
}