{
  "id": "d2cc11826c1ab35623e6918c77825cea2475ccac",
  "text": " I have great pleasure in announcing that this year at Hogwarts -\" But at that moment, there was a deafening rumble of thunder and the doors of the Great Hall banged open. A man stood in the doorway, leaning upon a long staff, shrouded in a black traveling cloak.  Every head in the Great Hall swiveled toward the stranger, suddenly brightly illuminated by a fork of lightning that flashed across the ceiling.  He lowered his hood, shook out a long mane of grizzled, dark gray hair, then began to walk up toward the teachers' table. A dull clunk echoed through the Hall on his every other step.  He reached the end of the top table, turned right, and limped heavily toward Dumbledore.  Another flash of lightning crossed the ceiling.  Hermione gasped. The lightning had thrown the man's face into sharp relief, and it was a face unlike any Harry had ever seen. It looked as though it had been carved out of weathered wood by someone who had only the vaguest idea of what human faces are supposed to look like, and was none too skilled with a chisel.  Every inch of skin seemed to be scarred.  The mouth looked like a diagonal gash, and a large chunk of the nose was missing. But it was the man's eyes that made him frightening. One of them was small, dark, and beady. The other was large, round as a coin, and a vivid, electric blue.  The blue eye was moving ceaselessly, without blinking, and was rolling up, down, and from side to side, quite independently of the normal eye - and then it rolled right over, pointing into the back of the man's head, so that all they could see was whiteness. The stranger reached Dumbledore.  He stretched out a hand that was as badly scarred as his face, and Dumbhedore shook it, muttering words Harry couldn't hear.  He seemed to be making some inquiry of the stranger, who shook his head unsmilingly and replied in an undertone.  Dumbledore nodded and gestured the man to the empty seat on his right-hand side. The stranger sat down, shook his mane of dark gray hair out of his face, pulled a plate of sausages toward him, raised it to what was left of his nose, and sniffed it. He then took a small knife out of his pocket, speared a sausage on the end of it, and began to eat.  His normal eye was fixed upon the sausages, but the blue eye was still darting restlessly around in its socket, taking in the Hall and the students. \"May I introduce our new Defense Against the Dark Arts teacher?\" said Dumbledore brightly into the silence.  \"Professor Moody.\" It was usual for new staff members to be greeted with applause, but none of the staff or students chapped except Dumbledore and Hagrid, who both put their hands together and applauded, but the sound echoed dismally into the silence, and they stopped fairly quickly. Everyone else seemed too transfixed by Moody's bizarre appearance to do more than stare at him. \"Moody?\"  Harry muttered to Ron.  \"Mad-Eye Moody?  The one your dad went to help this morning?\"  \"Must be,\" said Ron in a low, awed voice. \"What happened to him?\"  Hermione whispered.  \"What happened to his face?\" \"Dunno,\" Ron whispered back, watching Moody with fascination. Moody seemed totally indifferent to his less-than-warm welcome.  Ignoring the jug of pumpkin juice in front of him, he reached again into his traveling cloak, pulled out a hip flask, and took a long draught from it.  As he lifted his arm to drink, his cloak was pulled a few inches from the ground, and Harry saw, below the table, several inches of carved wooden leg, ending in a clawed foot. Dumbledore cleared his throat. \"As I was saying,\" he said, smiling at the sea of students before him, all of whom were still gazing transfixed at Mad-Eye Moody, \"we are to have the honor of hosting a very exciting event over the coming months, an event that has not been held for over a century.  It is my very great pleasure to inform you that the Triwizard Tournament will be taking place at Hogwarts this year.\" \"You're JOKING!\" said Fred Weasley loudly. The tension that had filled the Hall ever since Moody's arrival suddenly broke.  Nearly everyone laughed, and Dumbledore chuckled appreciatively. \"I am not joking, Mr. Weasley,\" he said, \"though now that you mention it, I did hear an excellent one over the summer about a troll, a hag, and a leprechaun who all go into a bar.  Professor McGonagall cleared her throat loudly. \"Er - but maybe this is not the time.. . no. . .\" said Dumbledore, \"where was I?  Ah yes, the Triwizard Tournament. . . well, some of you will not know what this tournament involves, so I hope those who do know will forgive me for giving a short explanation, and allow their attention to wander freely. \"The Triwizard Tournament was first established some seven hundred years ago as a friendly competition between the three largest European schools of wizardry:  Hogwarts, Beauxbatons, and Durmstrang.  A champion was selected to represent each school, and the three champions competed in three magical tasks.  The schools took it in turns to host the tournament once every five years, and it was generally agreed to be a most excellent way of establishing ties between young witches and wizards of different nationalities - until, that is, the death toll mounted so high that the tournament was discontinued."
}