{
  "id": "d372f79f5535b8d0e95c178fd53f21dcd57c876d",
  "text": " The last storm had swept them out of sight of land, and sent such waves crashing over the sides of the galley that Sansa had been certain they were all going to drown. Two men had been swept overboard, she had heard old Oswell saying, and another had fallen from the mast and broken his neck.  She had seldom ventured out on deck herself. Her little cabin was dank and cold, but Sansa had been sick for most of the voyage… sick with terror, sick with fever, or seasick… she could keep nothing down, and even sleep came hard. Whenever she closed her eyes she saw Joffrey tearing at his collar, clawing at the soft skin of his throat, dying with flakes of pie crust on his lips and wine stains on his doublet. And the wind keening in the lines reminded her of the terrible thin sucking sound he’d made as he fought to draw in air. Sometimes she dreamed of Tyrion as well.  He did nothing,  she told Littlefinger once, when he paid a visit to her cabin to see if she were feeling any better.   He did not kill Joffrey, true, but the dwarf’s hands are far from clean. He had a wife before you, did you know that?    He told me.    And did he tell you that when he grew bored with her, he made a gift of her to his father’s guardsmen? He might have done the same to you, in time. Shed no tears for the Imp, my lady.   The wind ran salty fingers through her hair, and Sansa shivered. Even this close to shore, the rolling of the ship made her tummy queasy. She desperately needed a bath and a change of clothes. I must look as haggard as a corpse, and smell of vomit.  Lord Petyr came up beside her, cheerful as ever.  Good morrow. The salt air is bracing, don’t you think? It always sharpens my appetite.  He put a sympathetic arm about her shoulders.  Are you quite well? You look so pale.    It’s only my tummy. The seasickness.    A little wine will be good for that. We’ll get you a cup, as soon as we’re ashore.  Petyr pointed to where an old flint tower stood outlined against a bleak grey sky, the breakers crashing on the rocks beneath it.  Cheerful, is it not? I fear there’s no safe anchorage here. We’ll put ashore in a boat.    Here?  She did not want to go ashore here. The Fingers were a dismal place, she’d heard, and there was something forlorn and desolate about the little tower.  Couldn’t I stay on the ship until we make sail for White Harbor?    From here the King turns east for Braavos. Without us.    But… my lord, you said… you said we were sailing home.    And there it stands, miserable as it is. My ancestral home. It has no name, I fear. A great lord’s seat ought to have a name, wouldn’t you agree? Winterfell, the Eyrie, Riverrun, those are castles. Lord of Harrenhal now, that has a sweet ring to it, but what was I before? Lord of Sheepshit and Master of the Drearfort? It lacks a certain something.  His grey-green eyes regarded her innocently.  You look distraught. Did you think we were making for Winterfell, sweetling? Winterfell has been taken, burned, and sacked. All those you knew and loved are dead. What northmen who have not fallen to the ironmen are warring amongst themselves. Even the Wall is under attack. Winterfell was the home of your childhood, Sansa, but you are no longer a child. You’re a woman grown, and you need to make your own home.    But not here,  she said, dismayed.  It looks so…    …small and bleak and mean? It’s all that, and less. The Fingers are a lovely place, if you happen to be a stone. But have no fear, we shan’t stay more than a fortnight. I expect your aunt is already riding to meet us.  He smiled.  The Lady Lysa and I are to be wed.    Wed?  Sansa was stunned.  You and my aunt?    The Lord of Harrenhal and the Lady of the Eyrie.   You said it was my mother you loved. But of course Lady Catelyn was dead, so even if she had loved Petyr secretly and given him her maidenhood, it made no matter now.   So silent, my lady?  said Petyr.  I was certain you would wish to give me your blessing. It is a rare thing for a boy born heir to stones and sheep pellets to wed the daughter of Hoster Tully and the widow of Jon Arryn.    I… I pray you will have long years together, and many children, and be very happy in one another.  It had been years since Sansa last saw her mother’s sister. She will be kind to me for my mother’s sake, surely. She’s my own blood. And the Vale of Arryn was beautiful, all the songs said so. Perhaps it would not be so terrible to stay here for a time.  Lothor and old Oswell rowed them ashore. Sansa huddled in the bow under her cloak with the hood drawn up against the wind, wondering what awaited her. Servants emerged from the tower to meet them; a thin old woman and a fat middle-aged one, two ancient white-haired men, and a girl of two or three with a sty on one eye. When they recognized Lord Petyr they knelt on the rocks.  My household,  he said.  I don’t know the child. Another of Kella’s bastards, I suppose. She pops one out every few years.   The two old men waded out up to their thighs to lift Sansa from the boat so she would not get her skirts wet."
}