{
  "id": "d3a139d6d9b6e21516af57302caac78e801afc6a",
  "text": "  The banks of  the stream sank,  as it reached  the  levels and  became broader  and shallower,  wandering off towards the Marish  and the River.       'Why,  this  is  the Stock-brook!' said Pippin. 'If we are going to try  and get back on to our course, we must  cross at once and bear right.'       They waded  the  stream, and hurried over a wide open space, rush-grown  and treeless, on the  further side. Beyond that they came again to a belt of  trees: tall oaks, for the most part, with here  and there an elm tree or  an  ash. The ground was fairly level, and  there was little undergrowth; but the  trees were loo close for them to see far  ahead.  The leaves blew upwards in  sudden gusts of wind, and spots of rain began to fall from the overcast sky.  Then the wind died  away and the rain came streaming down. They trudged  along  as fast as they could, over patches of grass, and through  thick  drifts  of  old leaves; and all about them the rain pattered  and trickled. They did not  talk, but kept glancing back, and from side to side.       After  half an hour Pippin said: 'I hope  we  have not turned  too much  towards the south, and are not walking longwise through this wood! It is not   a very broad belt --I should  have said  no more than a mile at the widest  -  and we ought to have been through it by now.'       'It is no good our starting to go in zig-zags,' said Frodo. 'That won't   mend  matters. Let us keep on as we  are going! I am not sure that I want to  come out into the open yet.'       They  went on for perhaps another couple of miles. Then the sun gleamed  out of ragged clouds  again and the rain  lessened. It was now past mid-day,   and they felt it was high time for lunch. They halted under an elm tree: its  leaves  though fast turning yellow were still thick, and the  ground at  its  feel  was fairly dry and sheltered. When  they came to make their meal, they  found that  the  Elves had  filled their bottles  with  a  clear drink, pale  golden in colour: it had the scent of a honey made  of many flowers, and was  wonderfully  refreshing. Very soon they  were  laughing, and snapping  their   fingers at rain, and at Black Riders.  The last few  miles, they felt, would  soon be behind them.   ####-     Frodo propped his back against the tree-trunk, and closed his eyes. Sam  and Pippin sat near, and they began to hum, and then to sing softly:       Ho! Ho! Ho! to the bottle I go       To heal my heart and drown my woe.       Rain may fall and wind may blow,        And many miles be still to go,       But under a tall tree I will lie,       And let the clouds go sailing by.       Ho! Ho! Ho! they began again louder. They stopped short suddenly. Frodo  sprang to his feet. A long-drawn wail came  down the wind, like  the  cry of  some evil  and  lonely  creature.  It  rose and fell, and  ended  on  a high  piercing  note. Even as  they sat and stood, as  if suddenly frozen,  it was  answered by another  cry, fainter and further off, but no less  chilling  to  the blood. There was then a silence, broken only by the sound of the wind in  the leaves.       'And what do you think that was?' Pippin asked at last, trying to speak  lightly, but quavering a little. 'If it was a bird, it was  one that I never   heard in the Shire before.'       'It was not bird or beast,' said Frodo. 'It was a call, or  a signal --  there were words in that cry, though  I  could not catch them. But no hobbit  has such a voice.'       No more was said about it. They were all thinking of the Riders, but no  one  spoke of them. They  were now reluctant either to  stay  or go  on; but  sooner or  later they had got to  get across the  open country to the Ferry,  and  it was best to go  sooner  and  in daylight.  In a few moments they had  shouldered their packs again and were off.       Before long the wood came  to a  sudden end. Wide grass-lands stretched  before them. They now saw that  they had, in  fact, turned too much  to  the  south.  Away over  the  flats  they could glimpse the low hill of Bucklebury  across the River, but it was now to their left. Creeping cautiously out from  the edge of the trees,  they set off  across  the  open  as  quickly as they  could.       At first they felt afraid, away from the shelter of  the wood. Far back   behind them stood the  high place  where  they had  breakfasted.  Frodo half  expected to see the small distant  figure of  a horseman on  the ridge  dark  against  the sky; but there was  no sign of  one. The  sun escaping from the  breaking clouds, as it sank towards the hills they had left, was now shining   ####-brightly again. Their fear left them, though they still felt uneasy. But the  land  became  steadily  more  tame and  well-ordered.  Soon they  came  into   well-tended fields and meadows: there were  hedges  and gates  and dikes for  drainage. Everything seemed quiet and peaceful, just an  ordinary corner  of  the Shire. Their spirits rose with every step. The  line  of  the River grew  nearer; and the Black Riders began  to seem  like phantoms of  the woods now  left far behind."
}