{
  "id": "d3adfab1173e2d11e5831d6bdb342f782bb01d65",
  "text": " \"The Yule Ball is approaching - a traditional part of the Triwizard Tournament and an opportunity for us to socialize with our foreign guests.  Now, the ball will be open only to fourth years and above - although you may invite a younger student if you wish -\" Lavender Brown let out a shrill giggle.  Parvati Patil nudged her hard in the ribs, her face working furiously as she too fought not to giggle.  They both looked around at Harry, Professor McGonagall ignored them, which Harry thought was distinctly unfair, as she had just told off him and Ron. \"Dress robes will be worn,\" Professor McGonagall continued, \"and the ball will start at eight o'clock on Christmas Day, finishing at midnight in the Great Hall.  Now then -\" Professor McGonagall stared deliberately around the class. \"The Yule Ball is of course a chance for us all to - er - let our hair down,\" she said, in a disapproving voice. Lavender giggled harder than ever, with her hand pressed hard against her mouth to stifle the sound.  Harry could see what was funny this time:  Professor McGonagall, with her hair in a tight bun, looked as though she had never let her hair down in any sense. \"But that does NOT mean,\" Professor McGonagall went on, \"that we will be relaxing the standards of behavior we expect from Hogwarts students.  I will be most seriously displeased if a Gryffindor student embarrasses the school in any way.\" The bell rang, and there was the usual scuffle of activity as everyone packed their bags and swung them onto their shoulders. Professor McGonagall called above the noise, \"Potter - a word, if you please.\" Assuming this had something to do with his headless rubber haddock, Harry proceeded gloomily to the teacher's desk.  Professor McGonagall waited until the rest of the class had gone, and then said, \"Potter, the champions and their partners -\" \"What partners?\" said Harry. Profesor McGonagall looked suspiciously at him, as though she thought he was trying to be funny. \"Your partners for the Yule Ball, Potter,\" she said coldly. \"Your dance partners.\" Harry's insides seemed to curl up and shrivel. \"Dance partners?\"  He felt himself going red.  \"I don't dance,\" he said quickly. \"Oh yes, you do,\" said Professor McGonagall irritably.  \"That's what I'm telling you. Traditionally, the champions and their partners open the ball.\" Harry had a sudden mental image of himself in a top hat and tails, accompanied by a girl in the sort of frilly dress Aunt Petunia always wore to Uncle Vernon's work parties. \"I'm not dancing,\" he said. \"It is traditional,\" said Professor McGonagall firmly. \"You are a Hogwarts champion, and you will do what is expected of you as a representative of the school.  So make sure you get yourself a partner, Potter.\" \"But-I don't-\" \"You heard me, Potter,\" said Professor McGonagall in a very final sort of way.  A week ago.  Harry would have said finding a partner for a dance would be a cinch compared to taking on a Hungarian Horntail.  But now that he had done the latter, and was facing the prospect of asking a girl to the ball, he thought he'd rather have another round with the dragon. Harry had never known so many people to put their names down to stay at Hogwarts for Christmas; he always did, of course, because the alternative was usually going back to Privet Drive, but he had always been very much in the minority before now.  This year, however, everyone in the fourth year and above seemed to be staying, and they all seemed to Harry to be obsessed with the coming ball - or at least all the girls were, and it was amazing how many girls Hogwarts suddenly seemed to hold; he had never quite noticed that before.  Girls giggling and whispering in the corridors, girls shrieking with laughter as boys passed them, girls excitedly comparing notes on what they were going to wear on Christmas night... . \"Why do they have to move in packs?\"  Harry asked Ron as a dozen or so girls walked past them, sniggering and staring at Harry.  \"How're you supposed to get one on their own to ask them?\" \"Lasso one?\"  Ron suggested.  \"Got any idea who you're going to try?\" Harry didn't answer. He knew perfectly well whom he'd like to ask, but working up the nerve was something else. . . . Cho was a year older than he was; she was very pretty; she was a very good Quidditch player, and she was also very popular. Ron seemed to know what was going on inside Harry's head. \"Listen, you're not going to have any trouble.  You're a champion.  You've just beaten a Hungarian Horntail.  I bet they'll be queuing up to go with you.\" In tribute to their recently repaired friendship, Ron had kept the bitterness in his voice to a bare minimum.  Moreover, to Harry's amazement, he turned out to be quite right. A curly-haired third-year Hufflepuff girl to whom Harry had never spoken in his life asked him to go to the ball with her the very next day.  Harry was so taken aback he said no before he'd even stopped to consider the matter.  The girl walked off looking rather hurt, and Harry had to endure Dean's, Seamus's, and Ron's taunts about her all through History of Magic."
}