{
  "id": "d46b08d8755196ad8709b2144819570f26b350f9",
  "text": " Four men went with them. One carried a torch, one a longsword; two had spears.  They found Lommy where they’d left him, under the oak.  I yield,  he called out at once when he saw them. He’d flung away his own spear and raised his hands, splotchy green with old dye.  I yield. Please.   The man with the torch searched around under the trees.  Are you the last? Baker boy said there was a girl.    She ran off when she heard you coming,  Lommy said.  You made a lot of noise.  And Arya thought, Run, Weasel, run as far as you can, run and hide and never come back.   Tell us where we can find that whoreson Dondarrion, and there’ll be a hot meal in it for you.    Who?  said Lommy blankly.   I told you, this lot don’t know no more than those cunts in the village. Waste o’bloody time.   One of the spearmen drifted over to Lommy.  Something wrong with your leg, boy?    It got hurt.    Can you walk?  He sounded concerned.   No,  said Lommy.  You got to carry me.    Think so?  The man lifted his spear casually and drove the point through the boy’s soft throat. Lommy never even had time to yield again. He jerked once, and that was all. When the man pulled his spear loose, blood sprayed out in a dark fountain.  Carry him, he says,  he muttered, chuckling.      TYRION  They had warned him to dress warmly. Tyrion Lannister took them at their word. He was garbed in heavy quilted breeches and a woolen doublet, and over it all he had thrown the shadowskin cloak he had acquired in the Mountains of the Moon. The cloak was absurdly long, made for a man twice his height. When he was not ahorse, the only way to wear the thing was to wrap it around him several times, which made him look like a ball of striped fur.  Even so, he was glad he had listened. The chill in the long dank vault went bone deep. Timett had chosen to retreat back up to the cellar after a brief taste of the cold below. They were somewhere under the hill of Rhaenys, behind the Guildhall of the Alchemists. The damp stone walls were splotchy with nitre, and the only light came from the sealed iron-and-glass oil lamp that Hallyne the Pyromancer carried so gingerly.  Gingerly indeed… and these would be the ginger jars. Tyrion lifted one for inspection. It was round and ruddy, a fat clay grapefruit. A little big for his hand, but it would fit comfortably in the grip of a normal man, he knew. The pottery was thin, so fragile that even he had been warned not to squeeze too tightly, lest he crush it in his fist. The clay felt roughened, pebbled. Hallyne told him that was intentional.  A smooth pot is more apt to slip from a man’s grasp.   The wildfire oozed slowly toward the lip of the jar when Tyrion tilted it to peer inside. The color would be a murky green, he knew, but the poor light made that impossible to confirm.  Thick,  he observed.   That is from the cold, my lord,  said Hallyne, a pallid man with soft damp hands and an obsequious manner. He was dressed in striped black-and-scarlet robes trimmed with sable, but the fur looked more than a little patchy and moth-eaten.  As it warms, the substance will flow more easily, like lamp oil.   The substance was the pyromancers’ own term for wildfire. They called each other wisdom as well, which Tyrion found almost as annoying as their custom of hinting at the vast secret stores of knowledge that they wanted him to think they possessed. Once theirs had been a powerful guild, but in recent centuries the maesters of the Citadel had supplanted the alchemists almost everywhere. Now only a few of the older order remained, and they no longer even pretended to transmute metals…  …but they could make wildfire.  Water will not quench it, I am told.    That is so. Once it takes fire, the substance will burn fiercely until it is no more. More, it will seep into cloth, wood, leather, even steel, so they take fire as well.   Tyrion remembered the red priest Thoros of Myr and his flaming sword. Even a thin coating of wildfire could burn for an hour. Thoros always needed a new sword after a melee, but Robert had been fond of the man and ever glad to provide one.  Why doesn’t it seep into the clay as well?    Oh, but it does,  said Hallyne.  There is a vault below this one where we store the older pots. Those from King Aerys’s day. It was his fancy to have the jars made in the shapes of fruits. Very perilous fruits indeed, my lord Hand, and, hmmm, riper now than ever, if you take my meaning. We have sealed them with wax and pumped the lower vault full of water, but even so… by rights they ought to have been destroyed, but so many of our masters were murdered during the Sack of King’s Landing, the few acolytes who remained were unequal to the task. And much of the stock we made for Aerys was lost. Only last year, two hundred jars were discovered in a storeroom beneath the Great Sept of Baelor. No one could recall how they came there, but I’m sure I do not need to tell you that the High Septon was beside himself with terror. I myself saw that they were safely moved."
}