{
  "id": "d4d18b87caa40d6965b36e1ea04ac0ad0c2f6cb5",
  "text": "  If my father makes plans for war, I must know of them. I am not ‘any man,’ I am heir to Pyke and the Iron Islands.    As to that,  his uncle said,  we shall see.   The words were a slap in the face.  We shall see? My brothers are both dead. I am my lord father’s only living son.    Your sister lives.   Asha, he thought, confounded. She was three years older than Theon, yet still… A woman may inherit only if there is no male heir in the direct line,  he insisted loudly.  I will not be cheated of my rights, I warn you.   His uncle grunted.  You warn a servant of the Drowned God, boy? You have forgotten more than you know. And you are a great fool if you believe your lord father will ever hand these holy islands over to a Stark. Now be silent. The ride is long enough without your magpie chatterings.   Theon held his tongue, though not without struggle. So that is the way of it, he thought. As if ten years in Winterfell could make a Stark. Lord Eddard had raised him among his own children, but Theon had never been one of them. The whole castle, from Lady Stark to the lowliest kitchen scullion, knew he was hostage to his father’s good behavior, and treated him accordingly. Even the bastard Jon Snow had been accorded more honor than he had.  Lord Eddard had tried to play the father from time to time, but to Theon he had always remained the man who’d brought blood and fire to Pyke and taken him from his home. As a boy, he had lived in fear of Stark’s stern face and great dark sword. His wife was, if anything, even more distant and suspicious.  As for their children, the younger ones had been mewling babes for most of his years at Winterfell. Only Robb and his baseborn half brother Jon Snow had been old enough to be worth his notice. The bastard was a sullen boy, quick to sense a slight, jealous of Theon’s high birth and Robb’s regard for him. For Robb himself, Theon did have a certain affection, as for a younger brother… but it would be best not to mention that. In Pyke, it would seem, the old wars were still being fought. That ought not surprise him. The Iron Islands lived in the past; the present was too hard and bitter to be borne. Besides, his father and uncles were old, and the old lords were like that; they took their dusty feuds to the grave, forgetting nothing and forgiving less.  It had been the same with the Mallisters, his companions on the ride from Riverrun to Seagard. Patrek Mallister was not too ill a fellow; they shared a taste for wenches, wine, and hawking. But when old Lord Jason saw his heir growing overly fond of Theon’s company, he had taken Patrek aside to remind him that Seagard had been built to defend the coast against reavers from the Iron islands, the Greyjoys of Pyke chief among them. Their Booming Tower was named for its immense bronze bell, rung of old to call the townsfolk and farmhands into the castle when longships were sighted on the western horizon.   Never mind that the bell has been rung just once in three hundred years,  Patrek had told Theon the day after, as he shared his father’s cautions and a jug of green-apple wine.   When my brother stormed Seagard,  Theon said. Lord Jason had slain Rodrik Greyjoy under the walls of the castle, and thrown the ironmen back into the bay.  If your father supposes I bear him some enmity for that, it’s only because he never knew Rodrik.   They had a laugh over that as they raced ahead to an amorous young miller’s wife that Patrek knew. Would that Patrek were with me now. Mallister or no, he was a more amiable riding companion than this sour old priest that his uncle Aeron had turned into.  The path they rode wound up and up, into bare and stony hills. Soon they were out of sight of the sea, though the smell of salt still hung sharp in the damp air. They kept a steady plodding pace, past a shepherd’s croft and the abandoned workings of a mine. This new, holy Aeron Greyjoy was not much for talk. They rode in a gloom of silence. Finally Theon could suffer it no longer.  Robb Stark is Lord of Winterfell now,  he said.  Aeron rode on.  One wolf is much like the other.    Robb has broken fealty with the Iron Throne and crowned himself King in the North. There’s war.    The maester’s ravens fly over salt as soon as rock. This news is old and cold.    It means a new day, Uncle.    Every morning brings a new day, much like the old.    In Riverrun, they would tell you different. They say the red comet is a herald of a new age. A messenger from the gods.    A sign it is,  the priest agreed,  but from our god, not theirs. A burning brand it is, such as our people carried of old. It is the flame the Drowned God brought from the sea, and it proclaims a rising tide. It is time to hoist our sails and go forth into the world with fire and sword, as he did.   Theon smiled.  I could not agree more.    A man agrees with god as a raindrop with the storm.   This raindrop will one day be a king, old man. Theon had suffered quite enough of his uncle’s gloom. He put his spurs into his horse and trotted on ahead, smiling."
}