{
  "id": "d581ad777fe94d584ab641e1a4c6acbbcec987af",
  "text": "  Ned’s voice was ice.  Lord Baelish, what you suggest is treason.    Only if we lose.    You forget,  Ned told him.  You forget Jon Arryn. You forget Jory Cassel. And you forget this.  He drew the dagger and laid it on the table between them; a length of dragonbone and Valyrian steel, as sharp as the difference between right and wrong, between true and false, between life and death.  They sent a man to cut my son’s throat, Lord Baelish.   Littlefinger sighed.  I fear I did forget, my lord. Pray forgive me. For a moment I did not remember that I was talking to a Stark.  His mouth quirked.  So it will be Stannis, and war?    It is not a choice. Stannis is the heir.    Far be it from me to dispute the Lord Protector. What would you have of me, then? Not my wisdom, for a certainty.    I shall do my best to forget your… wisdom,  Ned said with distaste.  I called you here to ask for the help you promised Catelyn. This is a perilous hour for all of us. Robert has named me Protector, true enough, but in the eyes of the world, Joffrey is still his son and heir. The queen has a dozen knights and a hundred men-at-arms who will do whatever she commands… enough to overwhelm what remains of my own household guard. And for all I know, her brother Jaime may be riding for King’s Landing even as we speak, with a Lannister host at his back.    And you without an army.  Littlefinger toyed with the dagger on the table, turning it slowly with a finger.  There is small love lost between Lord Renly and the Lannisters. Bronze Yohn Royce, Ser Balon Swann, Ser Loras, Lady Tanda, the Redwyne twins… each of them has a retinue of knights and sworn swords here at court.    Renly has thirty men in his personal guard, the rest even fewer. It is not enough, even if I could be certain that all of them will choose to give me their allegiance. I must have the gold cloaks. The City Watch is two thousand strong, sworn to defend the castle, the city, and the king’s peace.    Ah, but when the queen proclaims one king and the Hand another, whose peace do they protect?  Lord Petyr flicked at the dagger with his finger, setting it spinning in place. Round and round it went, wobbling as it turned. When at last it slowed to a stop, the blade pointed at Littlefinger.  Why, there’s your answer,  he said, smiling.  They follow the man who pays them.  He leaned back and looked Ned full in the face, his grey-green eyes bright with mockery.  You wear your honor like a suit of armor, Stark. You think it keeps you safe, but all it does is weigh you down and make it hard for you to move. Look at you now. You know why you summoned me here. You know what you want to ask me to do. You know it has to be done… but it’s not honorable, so the words stick in your throat.   Ned’s neck was rigid with tension. For a moment he was so angry that he did not trust himself to speak.  Littlefinger laughed.  I ought to make you say it, but that would be cruel… so have no fear, my good lord. For the sake of the love I bear for Catelyn, I will go to Janos Slynt this very hour and make certain that the City Watch is yours. Six thousand gold pieces should do it. A third for the Commander, a third for the officers, a third for the men. We might be able to buy them for half that much, but I prefer not to take chances.  Smiling, he plucked up the dagger and offered it to Ned, hilt first.      JON  Jon was breaking his fast on applecakes and blood sausage when Samwell Tarly plopped himself down on the bench.  I’ve been summoned to the sept,  Sam said in an excited whisper.  They’re passing me out of training. I’m to be made a brother with the rest of you. Can you believe it?    No, truly?    Truly. I’m to assist Maester Aemon with the library and the birds. He needs someone who can read and write letters.    You’ll do well at that,  Jon said, smiling.  Sam glanced about anxiously.  Is it time to go? I shouldn’t be late, they might change their minds.  He was fairly bouncing as they crossed the weed-strewn courtyard. The day was warm and sunny. Rivulets of water trickled down the sides of the Wall, so the ice seemed to sparkle and shine.  Inside the sept, the great crystal caught the morning light as it streamed through the south-facing window and spread it in a rainbow on the altar. Pyp’s mouth dropped open when he caught sight of Sam, and Toad poked Grenn in the ribs, but no one dared say a word. Septon Celladar was swinging a censer, filling the air with fragrant incense that reminded Jon of Lady Stark’s little sept in Winterfell. For once the septon seemed sober.  The high officers arrived in a body; Maester Aemon leaning on Clydas, Ser Alliser cold-eyed and grim, Lord Commander Mormont resplendent in a black wool doublet with silvered bearclaw fastenings. Behind them came the senior members of the three orders: red-faced Bowen Marsh the Lord Steward, First Builder Othell Yarwyck, and Ser Jaremy Rykker, who commanded the rangers in the absence of Benjen Stark.  Mormont stood before the altar, the rainbow shining on his broad bald head."
}