{
  "id": "d59157c3de6693e81d5ff8675d4d116ba3a1c400",
  "text": " In the sept they sing for the Mother’s mercy but on the walls it’s the Warrior they pray to, and all in silence. She remembered how Septa Mordane used to tell them that the Warrior and the Mother were only two faces of the same great god. But if there is only one, whose prayers will be heard?  Ser Meryn Trant held the blood bay for Joffrey to mount. Boy and horse alike wore gilded mail and enameled crimson plate, with matching golden lions on their heads. The pale sunlight flashed off the golds and reds every time Joff moved. Bright, shining, and empty, Sansa thought.  The Imp was mounted on a red stallion, armored more plainly than the king in battle gear that made him look like a little boy dressed up in his father’s clothes. But there was nothing childish about the battle-axe slung below his shield. Ser Mandon Moore rode at his side, white steel icy bright. When Tyrion saw her he turned his horse her way.  Lady Sansa,  he called from the saddle,  surely my sister has asked you to join the other highborn ladies in Maegor’s?    She has, my lord, but King Joffrey sent for me to see him off. I mean to visit the sept as well, to pray.    I won’t ask for whom.  His mouth twisted oddly; if that was a smile, it was the queerest she had ever seen.  This day may change all. For you as well as for House Lannister. I ought to have sent you off with Tommen, now that I think on it. Still, you should be safe enough in Maegor’s, so long as—    Sansa!  The boyish shout rang across the yard; Joffrey had seen her.  Sansa, here!   He calls me as if he were calling a dog, she thought.   His Grace has need of you,  Tyrion Lannister observed.  We’ll talk again after the battle, if the gods permit.   Sansa threaded her way through the file of gold-cloaked spearmen as Joffrey beckoned her closer.  It will be battle soon, everyone says so.    May the gods have mercy on us all.    My uncle’s the one who will need mercy, but I won’t give him any.  Joffrey drew his sword. The pommel was a ruby cut in the shape of a heart, set between a lion’s jaws. Three fullers were deeply incised in the blade.  My new blade, Hearteater.   He’d owned a sword named Lion’s Tooth once, Sansa remembered. Arya had taken it from him and thrown it in a river. I hope Stannis does the same with this one.  It is beautifully wrought, Your Grace.    Bless my steel with a kiss.  He extended the blade down to her.  Go on, kiss it.   He had never sounded more like a stupid little boy. Sansa touched her lips to the metal, thinking that she would kiss any number of swords sooner than Joffrey. The gesture seemed to please him, though. He sheathed the blade with a flourish.  You’ll kiss it again when I return, and taste my uncle’s blood.   Only if one of your Kingsguard kills him for you. Three of the White Swords would go with Joffrey and his uncle: Ser Meryn, Ser Mandon, and Ser Osmund Kettleblack.  Will you lead your knights into battle?  Sansa asked, hoping.   I would, but my uncle the Imp says my uncle Stannis will never cross the river. I’ll command the Three Whores, though. I’m going to see to the traitors myself.  The prospect made Joff smile. His plump pink lips always made him look pouty. Sansa had liked that once, but now it made her sick.   They say my brother Robb always goes where the fighting is thickest,  she said recklessly.  Though he’s older than Your Grace, to be sure. A man grown.   That made him frown.  I’ll deal with your brother after I’m done with my traitor uncle. I’ll gut him with Hearteater, you’ll see.  He wheeled his horse about and spurred toward the gate. Ser Meryn and Ser Osmund fell in to his right and left, the gold cloaks following four abreast. The Imp and Ser Mandon Moore brought up the rear. The guards saw them off with off with shouts and cheers. When the last was gone, a sudden stillness settled over the yard, like the hush before a storm.  Through the quiet, the singing pulled at her. Sansa turned toward the sept. Two stableboys followed, and one of the guards whose watch was ended. Others fell in behind them.  Sansa had never seen the sept so crowded, nor so brightly lit; great shafts of rainbow-colored sunlight slanted down through the crystals in the high windows, and candles burned on every side, their little flames twinkling like stars. The Mother’s altar and the Warrior’s swam in light, but Smith and Crone and Maid and Father had their worshipers as well, and there were even a few flames dancing below the Stranger’s half-human face… for what was Stannis Baratheon, if not the Stranger come to judge them? Sansa visited each of the Seven in turn, lighting a candle at each altar, and then found herself a place on the benches between a wizened old washer woman and a boy no older than Rickon, dressed in the fine linen tunic of a knight’s son. The old woman’s hand was bony and hard with callus, the boy’s small and soft, but it was good to have someone to hold on to. The air was hot and heavy, smelling of incense and sweat, crystal-kissed and candle-bright; it made her dizzy to breathe it."
}