{
  "id": "d5fcc28fc2b56005f7c2c954ea733da410230f5e",
  "text": " Khal Drogo had died with his hair uncut, a boast few men could make.  Across the tent, Rhaegal unfolded green wings to flap and flutter a half foot before thumping to the carpet. When he landed, his tail lashed back and forth in fury, and he raised his head and screamed. If I had wings, I would want to fly too, Dany thought. The Targaryens of old had ridden upon dragonback when they went to war. She tried to imagine what it would feel like, to straddle a dragon’s neck and soar high into the air. It would be like standing on a mountaintop, only better. The whole world would be spread out below If I flew high enough, I could even see the Seven Kingdoms, and reach up and touch the comet.  Irri broke her reverie to tell her that Ser Jorah Mormont was outside, awaiting her pleasure.  Send him in,  Dany commanded, sand-scrubbed skin tingling. She wrapped herself in the lionskin. The hrakkar had been much bigger than Dany, so the pelt covered everything that wanted covering.   I’ve brought you a peach,  Ser Jorah said, kneeling. It was so small she could almost hide it in her palm, and overripe too, but when she took the first bite, the flesh was so sweet she almost cried. She ate it slowly, savoring every mouthful, while Ser Jorah told her of the tree it had been plucked from, in a garden near the western wall.   Fruit and water and shade,  Dany said, her cheeks sticky with peach juice.  The gods were good to bring us to this place.    We should rest here until we are stronger,  the knight urged.  The red lands are not kind to the weak.    My handmaids say there are ghosts here.    There are ghosts everywhere,  Ser Jorah said softly.  We carry them with us wherever we go.   Yes, she thought. Viserys, Khal Drogo, my son Rhaego, they are with me always.  Tell me the name of your ghost, Jorah. You know all of mine.   His face grew very still.  Her name was Lynesse.    Your wife?    My second wife.   It pains him to speak of her, Dany saw, but she wanted to know the truth.  Is that all you would say of her?  The lion pelt slid off one shoulder and she tugged it back into place.  Was she beautiful?    Very beautiful.  Ser Jorah lifted his eyes from her shoulder to her face.  The first time I beheld her, I thought she was a goddess come to earth, the Maid herself made flesh. Her birth was far above my own. She was the youngest daughter of Lord Leyton Hightower of Oldtown. The White Bull who commanded your father’s Kingsguard was her great-uncle. The Hightowers are an ancient family, very rich and very proud.    And loyal,  Dany said.  I remember, Viserys said the Hightowers were among those who stayed true to my father.    That’s so,  he admitted.   Did your fathers make the match?    No,  he said.  Our marriage… that makes a long tale and a dull one, Your Grace. I would not trouble you with it.    I have nowhere to go,  she said.  Please.    As my queen commands.  Ser Jorah frowned.  My home… you must understand that to understand the rest. Bear Island is beautiful, but remote. Imagine old gnarled oaks and tall pines, flowering thornbushes, grey stones bearded with moss, little creeks running icy down steep hillsides. The hall of the Mormonts is built of huge logs and surrounded by an earthen palisade. Aside from a few crofters, my people live along the coasts and fish the seas. The island lies far to the north, and our winters are more terrible than you can imagine, Khaleesi.   Still, the island suited me well enough, and I never lacked for women. I had my share of fishwives and crofter’s daughters, before and after I was wed. I married young, to a bride of my father’s choosing, a Glover of Deepwood Motte. Ten years we were wed, or near enough as makes no matter. She was a plain-faced woman, but not unkind. I suppose I came to love her after a fashion, though our relations were dutiful rather than passionate. Three times she miscarried while trying to give me an heir. The last time she never recovered. She died not long after.   Dany put her hand on his and gave his fingers a squeeze.  I am sorry for you, truly.   Ser Jorah nodded.  By then my father had taken the black, so I was Lord of Bear Island in my own right. I had no lack of marriage offers, but before I could reach a decision Lord Balon Greyjoy rose in rebellion against the Usurper, and Ned Stark called his banners to help his friend Robert. The final battle was on Pyke. When Robert’s stonethrowers opened a breach in King Balon’s wall, a priest from Myr was the first man through, but I was not far behind. For that I won my knighthood.   To celebrate his victory, Robert ordained that a tourney should be held outside Lannisport. It was there I saw Lynesse, a maid half my age. She had come up from Oldtown with her father to see her brothers joust. I could not take my eyes off her. In a fit of madness, I begged her favor to wear in the tourney, never dreaming she would grant my request, yet she did.   I fight as well as any man, Khaleesi, but I have never been a tourney knight."
}