{
  "id": "d686c334196e4198e44bdf34e4b067af7b49fe63",
  "text": "    So these same men who saw the prodigious feats saw the ghost as well, yes?  The Dornishman laughed lightly.  Tyrion gave him a long look.  Chataya’s on the Street of Silk has several girls who might suit your needs. Dancy has hair the color of honey. Marei’s is pale white-gold. I would advise you to keep one or the other by your side at all times, my lord.    At all times?  Prince Oberyn lifted a thin black eyebrow.  And why is that, my good Imp?    You want to die with a breast in hand, you said.  Tyrion cantered on ahead to where the ferry barges waited on the south bank of the Blackwater. He had suffered all he meant to suffer of what passed for Dornish wit. Father should have sent Joffrey after all. He could have asked Prince Oberyn if he knew how a Dornishman differed from a cowflop. That made him grin despite himself. He would have to make a point of being on hand when the Red Viper was presented to the king.      Arya   The man on the roof was the first to die. He was crouched down by the chimney two hundred yards away, no more than a vague shadow in the predawn gloom, but as the sky began to lighten he stirred, stretched, and stood. Anguy’s arrow took him in the chest. He tumbled bonelessly down the steep slate pitch, and fell in front of the septry door.  The Mummers had posted two guards there, but their torch left them night blind, and the outlaws had crept in close. Kyle and Notch let fly together. One man went down with an arrow through his throat, the other through his belly. The second man dropped the torch, and the flames licked up at him. He screamed as his clothes took fire, and that was the end of stealth. Thoros gave a shout, and the outlaws attacked in earnest.  Arya watched from atop her horse, on the crest of the wooded ridge that overlooked the septry, mill, brewhouse, and stables and the desolation of weeds, burnt trees, and mud that surrounded them. The trees were mostly bare now, and the few withered brown leaves that still clung to the branches did little to obstruct her view. Lord Beric had left Beardless Dick and Mudge to guard them. Arya hated being left behind like she was some stupid child, but at least Gendry had been kept back as well. She knew better than to try and argue. This was battle, and in battle you had to obey.  The eastern horizon glowed gold and pink, and overhead a half moon peeked out through low scuttling clouds. The wind blew cold, and Arya could hear the rush of water and the creak of the mill’s great wooden waterwheel. There was a smell of rain in the dawn air, but no drops were falling yet. Flaming arrows flew through the morning mists, trailing pale ribbons of fire, and thudded into the wooden walls of the septry. A few smashed through shuttered windows, and soon enough thin tendrils of smoke were rising between the broken shutters.  Two Mummers came bursting from the septry side by side, axes in their hands. Anguy and the other archers were waiting. One axeman died at once. The other managed to duck, so the shaft ripped through his shoulder. He staggered on, till two more arrows found him, so quickly it was hard to say which had struck first. The long shafts punched through his breastplate as if it had been made of silk instead of steel. He fell heavily. Anguy had arrows tipped with bodkins as well as broadheads. A bodkin could pierce even heavy plate. I’m going to learn to shoot a bow, Arya thought. She loved sword fighting, but she could see how arrows were good too.  Flames were creeping up the west wall of the septry, and thick smoke poured through a broken window. A Myrish crossbowman poked his head out a different window, got off a bolt, and ducked down to rewind. She could hear fighting from the stables as well, shouts well mingled with the screams of horses and the clang of steel. Kill them all, she thought fiercely. She bit her lip so hard she tasted blood. Kill every single one.  The crossbowman appeared again, but no sooner had he loosed than three arrows hissed past his head. One rattled off his helm. He vanished, bow and all. Arya could see flames in several of the second-story windows. Between the smoke and the morning mists, the air was a haze of blowing black and white. Anguy and the other bowmen were creeping closer, the better to find targets.  Then the septry erupted, the Mummers boiling out like angry ants. Two Ibbenese rushed through the door with shaggy brown shields held high before them, and behind them came a Dothraki with a great curved arakh and bells in his braid, and behind him three Volantene sellswords covered with fierce tattoos. Others were climbing out windows and leaping to the ground. Arya saw a man take an arrow through the chest with one leg across a windowsill, and heard his scream as he fell. The smoke was thickening. Quarrels and arrows sped back and forth. Watty fell with a grunt, his bow slipping from his hand. Kyle was trying to nock another shaft to his string when a man in black mail flung a spear through his belly."
}