{
  "id": "d6ca8b28bbd5e2c1026366eefed0d7e2f4d15f86",
  "text": " She climbed out of bed.  I must go myself.    My lady,  said Maester Luwin,  is that wise? Surely the Lannisters would greet your arrival with suspicion.    What about Bran?  Robb asked. The poor boy looked utterly confused now.  You can’t mean to leave him.    I have done everything I can for Bran,  she said, laying a wounded hand on his arm.  His life is in the hands of the gods and Maester Luwin. As you reminded me yourself, Robb, I have other children to think of now.    You will need a strong escort, my lady,  Theon said.   I’ll send Hal with a squad of guardsmen,  Robb said.   No,  Catelyn said.  A large party attracts unwelcome attention. I would not have the Lannisters know I am coming.   Ser Rodrik protested.  My lady, let me accompany you at least. The kingsroad can be perilous for a woman alone.    I will not be taking the kingsroad,  Catelyn replied. She thought for a moment, then nodded her consent.  Two riders can move as fast as one, and a good deal faster than a long column burdened by wagons and wheelhouses. I will welcome your company, Ser Rodrik. We will follow the White Knife down to the sea, and hire a ship at White Harbor. Strong horses and brisk winds should bring us to King’s Landing well ahead of Ned and the Lannisters.  And then, she thought, we shall see what we shall see.      SANSA  Eddard Stark had left before dawn, Septa Mordane informed Sansa as they broke their fast.  The king sent for him. Another hunt, I do believe. There are still wild aurochs in these lands, I am told.    I’ve never seen an aurochs,  Sansa said, feeding a piece of bacon to Lady under the table. The direwolf took it from her hand, as delicate as a queen.  Septa Mordane sniffed in disapproval.  A noble lady does not feed dogs at her table,  she said, breaking off another piece of comb and letting the honey drip down onto her bread.   She’s not a dog, she’s a direwolf,  Sansa pointed out as Lady licked her fingers with a rough tongue.  Anyway, Father said we could keep them with us if we want.   The septa was not appeased.  You’re a good girl, Sansa, but I do vow, when it comes to that creature you’re as willful as your sister Arya.  She scowled.  And where is Arya this morning?    She wasn’t hungry,  Sansa said, knowing full well that her sister had probably stolen down to the kitchen hours ago and wheedled a breakfast out of some cook’s boy.   Do remind her to dress nicely today. The grey velvet, perhaps. We are all invited to ride with the queen and Princess Myrcella in the royal wheelhouse, and we must look our best.   Sansa already looked her best. She had brushed out her long auburn hair until it shone, and picked her nicest blue silks. She had been looking forward to today for more than a week. It was a great honor to ride with the queen, and besides, Prince Joffrey might be there. Her betrothed. Just thinking it made her feel a strange fluttering inside, even though they were not to marry for years and years. Sansa did not really know Joffrey yet, but she was already in love with him. He was all she ever dreamt her prince should be, tall and handsome and strong, with hair like gold. She treasured every chance to spend time with him, few as they were. The only thing that scared her about today was Arya. Arya had a way of ruining everything. You never knew what she would do.  I’ll tell her,  Sansa said uncertainly,  but she’ll dress the way she always does.  She hoped it wouldn’t be too embarrassing.  May I be excused?    You may.  Septa Mordane helped herself to more bread and honey, and Sansa slid from the bench. Lady followed at her heels as she ran from the inn’s common room.  Outside, she stood for a moment amidst the shouts and curses and the creak of wooden wheels as the men broke down the tents and pavilions and loaded the wagons for another day’s march. The inn was a sprawling three-story structure of pale stone, the biggest that Sansa had ever seen, but even so, it had accommodations for less than a third of the king’s party, which had swollen to more than four hundred with the addition of her father’s household and the freeriders who had joined them on the road.  She found Arya on the banks of the Trident, trying to hold Nymeria still while she brushed dried mud from her fur. The direwolf was not enjoying the process. Arya was wearing the same riding leathers she had worn yesterday and the day before.   You better put on something pretty,  Sansa told her.  Septa Mordane said so. We’re traveling in the queen’s wheelhouse with Princess Myrcella today.    I’m not,  Arya said, trying to brush a tangle out of Nymeria’s matted grey fur.  Mycah and I are going to ride upstream and look for rubies at the ford.    Rubies,  Sansa said, lost.  What rubies?   Arya gave her a look like she was so stupid.  Rhaegar’s rubies. This is where King Robert killed him and won the crown.   Sansa regarded her scrawny little sister in disbelief.  You can’t look for rubies, the princess is expecting us. The queen invited us both."
}