{
  "id": "d73088189f9330a8ad7726d36b1524f602aeb511",
  "text": " I must play out this fool’s masquerade as if nothing is amiss. Remember why I came here, my love. If I find proof that the Lannisters murdered Jon Arryn…   He felt Catelyn tremble in his arms. Her scarred hands clung to him.  If,  she said,  what then, my love?   That was the most dangerous part, Ned knew.  All justice flows from the king,  he told her.  When I know the truth, I must go to Robert.  And pray that he is the man I think he is, he finished silently, and not the man I fear he has become.      TYRION   Are you certain that you must leave us so soon?  the Lord Commander asked him.   Past certain, Lord Mormont,  Tyrion replied.  My brother Jaime will be wondering what has become of me. He may decide that you have convinced me to take the black.    Would that I could.  Mormont picked up a crab claw and cracked it in his fist. Old as he was, the Lord Commander still had the strength of a bear.  You’re a cunning man, Tyrion. We have need of men of your sort on the Wall.   Tyrion grinned.  Then I shall scour the Seven Kingdoms for dwarfs and ship them all to you, Lord Mormont.  As they laughed, he sucked the meat from a crab leg and reached for another. The crabs had arrived from Eastwatch only this morning, packed in a barrel of snow, and they were succulent.  Ser Alliser Thorne was the only man at table who did not so much as crack a smile.  Lannister mocks us.    Only you, Ser Alliser,  Tyrion said. This time the laughter round the table had a nervous, uncertain quality to it.  Thorne’s black eyes fixed on Tyrion with loathing.  You have a bold tongue for someone who is less than half a man. Perhaps you and I should visit the yard together.    Why?  asked Tyrion.  The crabs are here.   The remark brought more guffaws from the others. Ser Alliser stood up, his mouth a tight line.  Come and make your japes with steel in your hand.   Tyrion looked pointedly at his right hand.  Why, I have steel in my hand, Ser Alliser, although it appears to be a crab fork. Shall we duel?  He hopped up on his chair and began poking at Thorne’s chest with the tiny fork. Roars of laughter filled the tower room. Bits of crab flew from the Lord Commander’s mouth as he began to gasp and choke. Even his raven joined in, cawing loudly from above the window.  Duel! Duel! Duel!   Ser Alliser Thorne walked from the room so stiffly it looked as though he had a dagger up his butt.  Mormont was still gasping for breath. Tyrion pounded him on the back.  To the victor goes the spoils,  he called out.  I claim Thorne’s share of the crabs.   Finally the Lord Commander recovered himself.  You are a wicked man, to provoke our Ser Alliser so,  he scolded.  Tyrion seated himself and took a sip of wine.  If a man paints a target on his chest, he should expect that sooner or later someone will loose an arrow at him. I have seen dead men with more humor than your Ser Alliser.    Not so,  objected the Lord Steward, Bowen Marsh, a man as round and red as a pomegranate.  You ought to hear the droll names he gives the lads he trains.   Tyrion had heard a few of those droll names.  I’ll wager the lads have a few names for him as well,  he said.  Chip the ice off your eyes, my good lords. Ser Alliser Thorne should be mucking out your stables, not drilling your young warriors.    The Watch has no shortage of stableboys,  Lord Mormont grumbled.  That seems to be all they send us these days. Stableboys and sneak thieves and rapers. Ser Alliser is an anointed knight, one of the few to take the black since I have been Lord Commander. He fought bravely at King’s Landing.    On the wrong side,  Ser Jaremy Rykker commented dryly.  I ought to know, I was there on the battlements beside him. Tywin Lannister gave us a splendid choice. Take the black, or see our heads on spikes before evenfall. No offense intended, Tyrion.    None taken, Ser Jaremy. My father is very fond of spiked heads, especially those of people who have annoyed him in some fashion. And a face as noble as yours, well, no doubt he saw you decorating the city wall above the King’s Gate. I think you would have looked very striking up there.    Thank you,  Ser Jaremy replied with a sardonic smile.  Lord Commander Mormont cleared his throat.  Sometimes I fear Ser Alliser saw you true, Tyrion. You do mock us and our noble purpose here.   Tyrion shrugged.  We all need to be mocked from time to time, Lord Mormont, lest we start to take ourselves too seriously. More wine, please.  He held out his cup.  As Rykker filled it for him, Bowen Marsh said,  You have a great thirst for a small man.    Oh, I think that Lord Tyrion is quite a large man,  Maester Aemon said from the far end of the table. He spoke softly, yet the high officers of the Night’s Watch all fell quiet, the better to hear what the ancient had to say.  I think he is a giant come among us, here at the end of the world.   Tyrion answered gently,  I’ve been called many things, my lord, but giant is seldom one of them.    Nonetheless,  Maester Aemon said as his clouded, milk-white eyes moved to Tyrion’s face,  I think it is true."
}