{
  "id": "d7c0033c7d36798c724ddbcd51db30d22d9448c7",
  "text": " Along the east coast the raiders most often built boats to slip across the Bay of Seals. In the west they would descend into the black depths of the Gorge to make their way around the Shadow Tower. But in between the only way to defeat the Wall was to go over it, and many a raider had. Fewer come back, though, he thought with a certain grim pride. Climbers must of necessity leave their mounts behind, and many younger, greener raiders began by taking the first horses they found. Then a hue and cry would go up, ravens would fly, and as often as not the Night’s Watch would hunt them down and hang them before they could get back with their plunder and stolen women. Jarl would not make that mistake, Jon knew, but he wondered about Styr. The Magnar is a ruler, not a raider. He may not know how the game is played.   There they are,  Ygritte said, and Jon glanced up to see the first climber emerge above the treetops. It was Jarl. He had found a sentinel tree that leaned against the Wall, and led his men up the trunk to get a quicker start. The wood should never have been allowed to creep so close. They’re three hundred feet up, and they haven’t touched the ice itself yet.  He watched the wildling move carefully from wood to Wall, hacking out a handhold with short sharp blows of his ice axe, then swinging over. The rope around his waist tied him to the second man in line, still edging up the tree. Step by slow step, Jarl moved higher, kicking out toeholds with his spiked boots when there were no natural ones to be found. When he was ten feet above the sentinel, he stopped upon a narrow icy ledge, slung his axe from his belt, took out his hammer, and drove an iron stake into a cleft. The second man moved onto the Wall behind him while the third was scrambling to the top of the tree.  The other two teams had no happily placed trees to give them a leg up, and before long the Thenns were wondering whether they had gotten lost climbing the ridge. Jarl’s party were all on the Wall and eighty feet up before the leading climbers from the other groups came into view. The teams were spaced a good twenty yards apart. Jarl’s four were in the center. To the right of them was a team headed up by Grigg the Goat, whose long blond braid made him easy to spot from below. To the left a very thin man named Errok led the climbers.   So slow,  the Magnar complained loudly, as he watched them edge their way upward.  Has he forgotten the crows? He should climb faster, afore we are discovered.   Jon had to hold his tongue. He remembered the Skirling Pass all too well, and the moonlight climb he’d made with Stonesnake. He had swallowed his heart a half-dozen times that night, and by the end his arms and legs had been aching and his fingers were half frozen. And that was stone, not ice. Stone was solid. Ice was treacherous stuff at the best of times, and on a day like this, when the Wall was weeping, the warmth of a climber’s hand might be enough to melt it. The huge blocks could be frozen rock-hard inside, but their outer surface would be slick, with runnels of water trickling down, and patches of rotten ice where the air had gotten in. Whatever else the wildlings are, they’re brave.  All the same, Jon found himself hoping that Styr’s fears proved well founded. If the gods are good, a patrol will chance by and put an end to this.  No wall can keep you safe,  his father had told him once, as they walked the walls of Winterfell.  A wall is only as strong as the men who defend it.  The wildlings might have a hundred and twenty men, but four defenders would be enough to see them off, with a few well-placed arrows and perhaps a pail of stones.  No defenders appeared, however; not four, not even one. The sun climbed the sky and the wildlings climbed the Wall. Jarl’s four remained well ahead till noon, when they hit a pitch of bad ice. Jarl had looped his rope around a wind-carved pinnace and was using it to support his weight when the whole jagged thing suddenly crumbled and came crashing down, and him with it. Chunks of ice as big as a man’s head bombarded the three below, but they clung to the handholds and the stakes held, and Jarl jerked to a sudden halt at the end of the rope.  By the time his team had recovered from that mischance, Grigg the Goat had almost drawn even with them. Errok’s four remained well behind. The face where they were climbing looked smooth and unpitted, covered with a sheet of icemelt that glistened wetly where the sun brushed it. Grigg’s section was darker to the eye, with more obvious features; long horizontal ledges where a block had been imperfectly positioned atop the block below, cracks and crevices, even chimneys along the vertical joins, where wind and water had eaten holes large enough for a man to hide in.  Jarl soon had his men edging upward again. His four and Grigg’s moved almost side by side, with Errok’s fifty feet below. Deerhorn axes chopped and hacked, sending showers of glittery shards cascading down onto the trees."
}