{
  "id": "d853faced21b475474d58e7d5f59a9014b6bc850",
  "text": "       Sam was looking  at Orodruin,  the Mountain of  Fire. Ever and anon the   furnaces far  below  its ashen  cone would grow hot and with a great surging  and  throbbing pour  forth rivers of  molten rock from chasms  in its sides.   Some would  flow blazing towards  Barad-dyr down  great channels; some  would  wind their way into the  stony plain, until they cooled and lay like twisted  dragon-shapes vomited from  the tormented earth .  In such an hour of  labour  Sam beheld  Mount Doom, and the light  of it, cut off by the high  screen of  the Ephel D®ath from those who climbed up the path from the West, now  glared  against the stark rock faces, so that they seemed to be drenched with blood.       In that dreadful light Sam stood aghast, for now, looking to his  left,  he could see the Tower of Cirith Ungol in all its strength. The horn that he  had  seen from the other side was only its topmost turret. Its  eastern face  stood up  in three great tiers from a shelf in the mountain-wall far  below;  its back was to a  great  cliff behind, from which it  jutted out in pointed  bastions, one above the other, diminishing as they rose, with sheer sides of  cunning  masonry  that looked north-east  and   south-east. About the  lowest   tier, two hundred feet below where Sam now  stood, there was a  battlemented  wall  enclosing a narrow court.  Its gate, upon the near south-eastern side,  opened  on a broad road,  the outer parapet of which ran upon the brink of a   precipice, until it turned southward and went winding down into the darkness  to  join the road that came  over the Morgul Pass. Then on it went through a   jagged  rift in the  Morgai  out  into the  valley of Gorgoroth  and away to  Barad-dyr.  The  narrow upper way on which  Sam stood leapt  swiftly down  by  stair and steep path to meet the main road under the frowning walls close to   the Tower -gate.       As he gazed at it  suddenly Sam understood, almost  with a shock,  that  this stronghold had been  built  not to  keep enemies out of  Mordor, but to  keep them in. It was indeed one  of the works of Gondor long ago, an eastern  outpost of the defences of Ithilien, made when, after the Last Alliance, Men   of  Westernesse kept  watch on  the evil land of  Sauron where his creatures   ####-still lurked. But as with Narchost and Carchost, the Towers of the Teeth, so  here too the vigilance had failed, and treachery had yielded up the Tower to   the Lord of the Ringwraiths, and now for long years it had been held by evil   things. Since his return to Mordor, Sauron had found  it useful; for he  had  few servants but many slaves of fear, and still its chief  purpose as of old  was to prevent escape from Mordor. Though if an enemy were so rash as to try  to  enter that  land  secretly, then it  was also  a  last  unsleeping guard  against any that might pass the vigilance of Morgul and of Shelob.       Only too clearly Sam saw how hopeless it would be for him to creep down  under those many-eyed  walls and pass the watchful gate. And  even  if he did  so, he  could not go  far  on  the guarded road beyond:  not even  the black   shadows,  lying  deep where  the red glow could not reach, would shield  him  long from the night-eyed orcs. But desperate as that road might be, his task   was now  far worse: not to avoid the gate and escape, but to enter it, alone.         His  thought turned to the Ring, but there was  no  comfort there, only  dread and danger. No  sooner had he come in sight of Mount Doom, burning  far  away, than he was aware of a cha nge in his burden. As it drew near the great  furnaces  where,  in the deeps of time, it had been shaped  and forged,  the  Ring's power grew, and  it became more fell, untameable  save by some mighty  will. As Sam stood there, even though the Ring was not on  him but hanging by  its chain about his neck, he felt himself enlarged, as if he were robed in a   huge distorted shadow of  himself, a vast and ominous threat halted upon the  walls of  Mordor. He  felt  that he had  from now on  only two  choices:  to  forbear the Ring, though it would torment him; or to claim it, and challenge  the Power that sat in  its dark hold beyond the valley  of  shadows. Already  the Ring tempted him, gnawing at his will and  reason.  Wild fantasies arose  in his mind; and he saw Samwise the Strong, Hero of the Age, striding with a  flaming sword across the darkened land, and armies flocking  to  his call as  he  marched to the  overthrow of  Barad-dyr. And then all the  clouds rolled  away,  and the white sun  shone, and  at his command the  vale of  Gorgoroth  became a garden of flowers and trees and brought forth fruit. He had only to  put on the Ring and claim it for his own, and all this could be.       In that hour of trial it was the love of his master that helped most to  hold  him firm; but also deep  down in him lived still unconquered his plain  hobbit-sense: he  knew in the core of his heart that he was not large enough   ####-to bear such a burden, even  if such visions were not a mere cheat to betray  him."
}