{
  "id": "d856eef116d7b843fea78745d0e60800d738ad1c",
  "text": "  `We might  find some  nook  there, or  even  a cave  or   something.'       'I  suppose so,'  said  Frodo.  'I'm tired.  and  I don't  think I  can  scramble among stones much  longer tonight --  though  I grudge the delay. I  wish there was a clear path in front of us: then I'd go on till my legs gave  way.'       They did not find the going  any easier at the  broken feet of the Emyn  Muil. Nor did Sam find any nook  or hollow  to shelter in: only  bare  stony  slopes frowned  over  by the  cliff, which  now rose again, higher  and more  sheer as they went back. In the end, worn out, they  just cast themselves on  the ground  under the lee  of a boulder lying not far  from the foot of  the  precipice. There  for some time  they sat huddled mournfully together in the  cold stony night, while sleep crept  upon them in spite of all they could do  to hold it off.  The moon now rode high and  clear. Its thin white light lit  up the faces of the rocks and drenched the cold frowning walls of the cliff,  turning  all the wide  looming darkness into a   chill  pale grey scored with  black shadows.       'Well! '  said  Frodo, standing up and drawing  his cloak more  closely  round him.  `You  sleep for a bit Sam and take my blanket.  I'll walk up and  down on sentry for a while.' Suddenly he stiffened,  and stooping he gripped   Sam by the  arm. `What's  that?  '  he whispered. `Look  over  there on  the  cliff!'       Sam looked and breathed in  sharply through his teeth. `Ssss!' he said.  'That's what it is. It's that Gollum! Snakes and adders! And to think tha t I  thought that  we'd puzzle him with our bit of a climb! Look at  him!  Like a    ####-nasty crawling spider on a wall.'       Down the face of a precipice, sheer  and almost smooth it seemed in the  pale moonlight, a small black shape was moving with its thin  limbs  splayed  out. Maybe its soft clinging  hands and toes were finding crevices and holds  that no hobbit could ever have seen or used, but it looked as if it was just   creeping down on sticky pads, like some large prowling thing of insect-kind.   And it was coming down  head  first, as  if it was smelling its way. Now and  again it lifted its head slowly, turning  it  right back on  its long skinny  neck, and the hobbits  caught  a glimpse of two small pale gleaming  lights,   its eyes that blinked at the moon  for a moment and then were quickly lidded   again.       `Do you think he can see us? ' said Sam.       `I don't know,' said Frodo  quietly, `but I think not. It  is hard even  for friendly eyes to see these elven-cloaks: I cannot  see you in the shadow  even at a  few paces. And I've heard that he doesn't like Sun or Moon.'       `Then why is he coming down just here? ' asked Sam.       'Quietly, Sam! ' said Frodo. `He can smell us, perhaps. And he can hear  as keen as  Elves, I believe. I think he has heard something  now: our voices  probably. We did a lot of shouting  away back there; and we were talking far  too loudly until a minute ago.'       `Well, I'm sick of him,' said Sam. `He's come once too often for me and  I'm going to have a word with him, if I can. I don't suppose  we  could give  him the slip  now anyway.' Drawing his grey  hood well  over  his  face, Sam  crept stealthily towards the cliff.        `Careful!' whispered Frodo coming behind.  `Don't  alarm him! He's much  more dangerous than he looks.'       The black crawling shape was now three-quarters  of  the way down,  and  perhaps fifty feet or less above the cliff's  foot. Crouching stone-still in  the shadow of a large  boulder the hobbits watched him.  He seemed  to  have  come  to a  difficult passage or  to be troubled about something. They could   hear him snuffling, and now and again there was a harsh  hiss of breath that  sounded like  a curse. He lifted his head, and they  thought  they heard him  spit. Then  he  moved on again. Now they could hear  his voice creaking  and  whistling.       `Ach,  sss! Cautious, my precious! More haste  less speed.  We musstn't  rissk our neck, musst we, precious? No, precious  -- gollum!'  He lifted his  head again, blinked at the moon, and quickly shut his eyes. `We hate it,' he   ####-hissed.  `Nassty,  nassty shivery light it is  -- sss  --  it  spies on  us,   precious -- it hurts our eyes.'       He was getting  lower now and the  hisses became  sharper  and clearer.  'Where iss it, where iss it: my Precious, my Precious? It's ours, it is, and  we wants it. The thieves, the thieves, the filthy  little thieves. Where are  they with my Precious? Curse them! We hates them.'       `It doesn't sound as if he knew we were here, does it? ' whispered Sam.  `And what's his Precious? Does he mean the'       `Hsh!  ' breathed  Frodo. 'He's getting near now, near enough to hear a   whisper.'       Indeed Gollum  had suddenly paused again,  and his  large  head on  its  scrawny neck was  lolling from side to side as if he was listening. His pale  eyes were  half  unlidded. Sam restrained  himself, though his fingers  were  twitching."
}