{
  "id": "d961004339b4087173eea37cec06aa874a0f63b5",
  "text": " Remember that, Sansa, when you come to play the game.    What… what game?    The only game. The game of thrones.  He brushed back a strand of her hair.  You are old enough to know that your mother and I were more than friends. There was a time when Cat was all I wanted in this world. I dared to dream of the life we might make and the children she would give me… but she was a daughter of Riverrun, and Hoster Tully. Family, Duty, Honor, Sansa. Family, Duty, Honor meant I could never have her hand. But she gave me something finer, a gift a woman can give but once. How could I turn my back upon her daughter? In a better world, you might have been mine, not Eddard Stark’s. My loyal loving daughter… Put Joffrey from your mind, sweetling. Dontos, Tyrion, all of them. They will never trouble you again. You are safe now, that’s all that matters. You are safe with me, and sailing home.       Jaime   The king is dead, they told him, never knowing that Joffrey was his son as well as his sovereign.   The Imp opened his throat with a dagger,  a costermonger declared at the roadside inn where they spent the night.  He drank his blood from a big gold chalice.  The man did not recognize the bearded one-handed knight with the big bat on his shield, no more than any of them, so he said things he might otherwise have swallowed, had he known who was listening.   It was poison did the deed,  the innkeep insisted.  The boy’s face turned black as a plum.    May the Father judge him justly,  murmured a septon.   The dwarf’s wife did the murder with him,  swore an archer in Lord Rowan’s livery.  Afterward, she vanished from the hall in a puff of brimstone, and a ghostly direwolf was seen prowling the Red Keep, blood dripping from his jaws.   Jaime sat silent through it all, letting the words wash over him, a horn of ale forgotten in his one good hand. Joffrey. My blood. My firstborn. My son. He tried to bring the boy’s face to mind, but his features kept turning into Cersei’s. She will be in mourning, her hair in disarray and her eyes red from crying, her mouth trembling as she tries to speak. She will cry again when she sees me, though she’ll fight the tears. His sister seldom wept but when she was with him. She could not stand for others to think her weak. Only to her twin did she show her wounds. She will look to me for comfort and revenge.  They rode hard the next day, at Jaime’s insistence. His son was dead, and his sister needed him.  When he saw the city before him, its watchtowers dark against the gathering dusk, Jaime Lannister cantered up to Steelshanks Walton, behind Nage with the peace banner.   What’s that awful stink?  the northman complained.  Death, thought Jaime, but he said,  Smoke, sweat, and shit. King’s Landing, in short. If you have a good nose you can smell the treachery too. You’ve never smelled a city before?    I smelled White Harbor. It never stank like this.    White Harbor is to King’s Landing as my brother Tyrion is to Ser Gregor Clegane.   Nage led them up a low hill, the seven-tailed peace banner lifting and turning in the wind, the polished seven-pointed star shining bright upon its staff. He would see Cersei soon, and Tyrion, and their father. Could my brother truly have killed the boy? Jaime found that hard to believe.  He was curiously calm. Men were supposed to go mad with grief when their children died, he knew. They were supposed to tear their hair out by the roots, to curse the gods and swear red vengeance. So why was it that he felt so little? The boy lived and died believing Robert Baratheon his sire.  Jaime had seen him born, that was true, though more for Cersei than the child. But he had never held him.  How would it look?  his sister warned him when the women finally left them.  Bad enough Joff looks like you without you mooning over him.  Jaime yielded with hardly a fight. The boy had been a squalling pink thing who demanded too much of Cersei’s time, Cersei’s love, and Cersei’s breasts. Robert was welcome to him.  And now he’s dead. He pictured Joff lying still and cold with a face black from poison, and still felt nothing. Perhaps he was the monster they claimed. If the Father Above came down to offer him back his son or his hand, Jaime knew which he would choose. He had a second son, after all, and seed enough for many more. If Cersei wants another child I’ll give her one… and this time I’ll hold him, and the Others take those who do not like it. Robert was rotting in his grave, and Jaime was sick of lies.  He turned abruptly and galloped back to find Brienne. Gods know why I bother. She is the least companionable creature I’ve ever had the misfortune to meet. The wench rode well behind and a few feet off to the side, as if to proclaim that she was no part of them. They had found men’s garb for her along the way; a tunic here, a mantle there, a pair of breeches and a cowled cloak, even an old iron breastplate. She looked more comfortable dressed as a man, but nothing would ever make her look handsome."
}