{
  "id": "da5ec81d63e50cd18d330cd8c1b259bc0b76479f",
  "text": "  It was nigh on sunset when they reached the walls of Pyke, a crescent of dark stone that ran from cliff to cliff, with the gatehouse in the center and three square towers to either side. Theon could still make out the scars left by the stones of Robert Baratheon’s catapults. A new south tower had risen from the ruins of the old, its stone a paler shade of grey, and as yet unmarred by patches of lichen. That was where Robert had made his breach, swarming in over the rubble and corpses with his warharnmer in hand and Ned Stark at his side. Theon had watched from the safety of the Sea Tower, and sometimes he still saw the torches in his dreams, and heard the dull thunder of the collapse.  The gates stood open to him, the rusted iron portcullis drawn up. The guards atop the battlements watched with strangers’ eyes as Theon Greyjoy came home at last.  Beyond the curtain wall were half a hundred acres of headland hard against the sky and the sea. The stables were here, and the kennels, and a scatter of other outbuildings. Sheep and swine huddled in their pens while the castle dogs ran free. To the south were the cliffs, and the wide stone bridge to the Great Keep. Theon could hear the crashing of waves as he swung down from his saddle. A stableman came to take his horse. A pair of gaunt children and some thralls stared at him with dull eyes, but there was no sign of his lord father, nor anyone else he recalled from boyhood. A bleak and bitter homecoming, he thought.  The priest had not dismounted.  Will you not stay the night and share our meat and mead, Uncle?    Bring you, I was told. You are brought. Now I return to our god’s business.  Aeron Greyjoy turned his horse and rode slowly out beneath the muddy spikes of the portcullis.  A bentback old crone in a shapeless grey dress approached him warily.  M’lord, I am sent to show you to chambers.    By whose bidding?    Your lord father, m’lord.   Theon pulled off his gloves.  So you do know who I am. Why is my father not here to greet me?    He awaits you in the Sea Tower, m’lord. When you are rested from your trip.   And I thought Ned Stark cold.  And who are you?    Helya, who keeps this castle for your lord father.    Sylas was steward here. They called him Sourmouth.  Even now, Theon could recall the winey stench of the old man’s breath.   Dead these five years, m’lord.    And what of Maester Qalen, where is he?    He sleeps in the sea. Wendamyr keeps the ravens now.   It is as if I were a stranger here, Theon thought. Nothing has changed, and yet everything has changed.  Show me to my chambers, woman,  he commanded. Bowing stiffly, she led him across the headland to the bridge. That at least was as he remembered; the ancient stones slick with spray and spotted by lichen, the sea foaming under their feet like some great wild beast, the salt wind clutching at their clothes.  Whenever he’d imagined his homecoming, he had always pictured himself returning to the snug bedchamber in the Sea Tower, where he’d slept as a child. Instead the old woman led him to the Bloody Keep. The halls here were larger and better furnished, if no less cold nor damp. Theon was given a suite of chilly rooms with ceilings so high that they were lost in gloom. He might have been more impressed if he had not known that these were the very chambers that had given the Bloody Keep its name. A thousand years before, the sons of the River King had been slaughtered here, hacked to bits in their beds so that pieces of their bodies might be sent back to their father on the mainland.  But Greyjoys were not murdered in Pyke except once in a great while by their brothers, and his brothers were both dead. It was not fear of ghosts that made him glance about with distaste. The wall hangings were green with mildew, the mattress musty-smelling and sagging, the rushes old and brittle. Years had come and gone since these chambers had last been opened. The damp went bone deep.  I’ll have a basin of hot water and a fire in this hearth,  he told the crone.  See that they light braziers in the other rooms to drive out some of the chill. And gods be good, get someone in here at once to change these rushes.    Yes, m’lord. As you command.  She fled.  After some time, they brought the hot water he had asked for. It was only tepid, and soon cold, and seawater in the bargain, but it served to wash the dust of the long ride from his face and hair and hands. While two thralls lit his braziers, Theon stripped off his travel-stained clothing and dressed to meet his father. He chose boots of supple black leather, soft lambswool breeches of silvery-grey, a black velvet doublet with the golden kraken of the Greyjoys embroidered on the breast. Around his throat he fastened a slender gold chain, around his waist a belt of bleached white leather. He hung a dirk at one hip and a longsword at the other, in scabbards striped black-and-gold. Drawing the dirk, he tested its edge with his thumb, pulled a whetstone from his belt pouch, and gave it a few licks."
}