{
  "id": "da931092f0769c22db07800b512815710c09de27",
  "text": "  They walked back through Ottery St. Catchpole and up the damp lane toward the Burrow in the dawn light, talking very little because they were so exhausted, and thinking longingly of their breakfast.  As they rounded the corner and the Burrow came into view, a cry echoed along the lane. \"Oh thank goodness, thank goodness!\" Mrs. Weasley, who had evidently been waiting for them in the front yard, came running toward them, still wearing her bedroom slippers, her face pale and strained, a rolled-up copy of the Daily Prophet clutched in her hand. \"Arthur - I've been so worried - so worried-\" She flung her arms around Mr. Weasley's neck, and the Daily Prophet fell out of her limp hand onto the ground.  Looking down, Harry saw the headline:  SCENES OF TERROR AT THE QUIDDITCH WORLD CUP, complete with a twinkling black-and-white photograph of the Dark Mark over the treetops.  \"You're all right,\" Mrs. Weasley muttered distractedly, releasing Mr. Weasley and staring around at them all with red eyes, \"you're alive. . . . Oh boys. . And to everybody's surprise, she seized Fred and George and pulled them both into such a tight hug that their heads banged together. \"Ouch!  Mum - you're strangling us -\" \"I shouted at you before you left!\"  Mrs. Weasley said, starting to sob.  \"It's all I've been thinking about!  What if You-Know-Who had got you, and the last thing I ever said to you was that you didn't get enough OW.L.s?  Oh Fred. . . George. .\" \"Come on, now, Molly, we're all perfectly okay,\" said Mr. Weasley soothingly, prising her off the twins and leading her back toward the house.  \"Bill,\" he added in an undertone, \"pick up that paper, I want to see what it says. . .\" When they were all crammed into the tiny kitchen, and Hermione had made Mrs. Weasley a cup of very strong tea, into which Mr. Weasley insisted on pouring a shot of Ogdens Old Firewhiskey, Bill handed his father the newspaper.  Mr. Weasley scanned the front page while Percy looked over his shoulder. \"I knew it,\" said Mr. Weasley heavily.  \"Ministry blunders. . . culprits not apprehended. . . lax security. . . Dark wizards running unchecked... national disgrace. . . Who wrote this?  Ah. . . of course. . . Rita Skeeter.\" \"That woman's got it in for the Ministry of Magic!\"  said Percy furiously.  \"Last week she was saying we're wasting our time quibbling about cauldron thickness, when we should be stamping out vampires!  As if it wasn't specifically stated in paragraph twelve of the Guidelines for the Treatment of Non-Wizard Part-Humans --\" \"Do us a favor, Perce,\" said Bill, yawning, \"and shut up.\" \"I'm mentioned,\" said Mr. Weasley, his eyes widening behind his glasses as he reached the bottom of the Daily Prophet article. \"Where?\" spluttered Mrs. Weasley, choking on her tea and whiskey.  \"If I'd seen that, I'd have known you were alive!\" \"Not by name,\" said Mr. Weasley. \"Listen to this:  'If the terrified wizards and witches who waited breathlessly for news at the edge of the wood expected reassurance from the Ministry ofMagic, they were sadly disappointed. A Ministry official emerged some time after the appearance of the Dark Mark alleging that nobody had been hurt, but reflising to give any more information. Whether this statement will be enough to quash the rumors that several bodies were removed from the woods an hour later, remains to be seen.'  Oh really,\" said Mr. Weasley in exasperation, handing the paper to Percy.  \"Nobody was hurt.  What was I supposed to say?  Rumors that several bodies were removed from the woods. . . well, there certainly will be rumors now she's printed that.\" He heaved a deep sigh. \"Molly, I'm going to have to go into the office; this is going to take some smoothing over.\" \"I'll come with you, Father,\" said Percy importantly.  \"Mr. Crouch will need all hands on deck. And I can give him my cauldron report in person.\" He bustled out of the kitchen.  Mrs. Weasley looked most upset. \"Arthur, you're supposed to be on holiday! This hasn't got anything to do with your office; surely they can handle this without you?\" \"I've got to go, Molly,\" said Mr. Weasley.  \"I've made things worse.  I'll just change into my robes and I'll be off. . . .\" \"Mrs. Weasley,\" said Harry suddenly, unable to contain himself, \"Hedwig hasn't arrived with a letter for me, has she?\" \"Hedwig, dear?\" said Mrs. Weasley distractedly.  \"No. . . no, there hasn't been any post at all.\" Ron and Hermione looked curiously at Harry.  With a meaningful look at both of them he said, \"All right if I go and dump my stuff in your room, Ron?\" \"Yeah. . . think I will too,\" said Ron at once. \"Hermione?\" \"Yes,\" she said quickly, and the three of them marched out of the kitchen and up the stairs. \"What's up, Harry?\" said Ron, the moment they had closed the door of the attic room behind them. \"There's something I haven't told you,\" Harry said. \"On Saturday morning, I woke up with my scar hurting again.\"  Ron's and Hermione's reactions were almost exactly as Harry had imagined them back in his bedroom on Privet Drive."
}