{
  "id": "da98baf19ea819f9edd6a0477e7497d8293ebad6",
  "text": "\" \"Why's he sent you up here, if he knows you don't like heights?\"  said Harry, frowning. \"Master - master wants me to save him a seat, Harry Potter.  He is very busy,\" said Winky, tilting her head toward the empty space beside her.  \"Winky is wishing she is back in master's tent, Harry Potter, but Winky does what she is told.  Winky is a good house-elf.\" She gave the edge of the box another frightened look and hid her eyes completely again. Harry turned back to the others. \"So that's a house-elf?\"  Ron muttered.  \"Weird things, aren't they?\" \"Dobby was weirder,\" said Harry fervently. Ron pulled out his Omnioculars and started testing them, staring down into the crowd on the other side of the stadium. \"Wild!\"  he said, twiddling the replay knob on the side.  I can make that old bloke down there pick his nose again ... and again ... and again. . .\" Hermione, meanwhile, was skimming eagerly through her velvetcovered, tasseled program. \"'A display from the team mascots will precede the match,\"' she read aloud.  \"Oh that's always worth watching,\" said Mr. Weasley.  \"National teams bring creatures from their native land, you know, to put on a bit of a show.\" The box filled gradually around them over the next half hour.  Mr. Weasley kept shaking hands with people who were obviously very important wizards.  Percy jumped to his feet so often that he looked as though he were trying to sit on a hedgehog.  When Cornelius Fudge, the Minister of Magic himself, arrived, Percy bowed so low that his glasses fell off and shattered. Highly embarrassed, he repaired them with his wand and thereafter remained in his seat, throwing jealous looks at Harry, whom Cornelius Fudge had greeted like an old friend.  They had met before, and Fudge shook Harry's hand in a fatherly fashion, asked how he was, and introduced him to the wizards on either side of him. \"Harry Potter, you know,\" he told the Bulgarian minister loudly, who was wearing splendid robes of black velvet trimmed with gold and didn't seem to understand a word of English.  \"Harry Potter ... oh come on now, you know who he is ... the boy who survived You-Know-Who ... you do know who he is -\" The Bulgarian wizard suddenly spotted Harry's scar and started gabbling loudly and excitedly, pointing at it. \"Knew we'd get there in the end,\" said Fudge wearily to Harry.  \"I'm no great shakes at languages; I need Barty Crouch for this sort of thing.  Ah, I see his house-elf's saving him a seat.... Good job too, these Bulgarian blighters have been trying to cadge all the best places ... ah, and here's Lucius!\" Harry, Ron, and Hermione turned quickly.  Edging along the second row to three still-empty seats right behind Mr. Weasley were none other than Dobby the house-elf's former owners: Lucius Malfoy; his son, Draco; and a woman Harry supposed must be Draco's mother. Harry and Draco Malfoy had been enemies ever since their very first journey to Hogwarts.  A pale boy with a pointed face and  white-blond hair, Draco greatly resembled his father.  His mother was blonde too; tall and slim, she would have been nice-looking if she hadn't been wearing a look that suggested there was a nasty smell under her nose. \"Ah, Fudge,\" said Mr. Malfoy, holding out his hand as he reached the Minister of Magic.  \"How are you?  I don't think you've met my wife, Narcissa?  Or our son, Draco?\" \"How do you do, how do you do?\"  said Fudge, smiling and bowing to Mrs. Malfoy. \"And allow me to introduce you to Mr. Oblansk - Obalonsk - Mr. - well, he's the Bulgarian Minister of Magic, and he can't understand a word I'm saying anyway, so never mind.  And let's see who else - you know Arthur Weasley, I daresay?\" It was a tense moment. Mr. Weasley and Mr. Malfoy looked at each other and Harry vividly recalled the last time they had come face-to-face:  It had been in Flourish and Blotts' bookshop, and they had had a fight.  Mr. Malfoy's cold gray eyes swept over Mr. Weasley, and then up and down the row. \"Good lord, Arthur,\" he said softly.  \"What did you have to sell to get seats in the Top Box?  Surely your house wouldn't have fetched this much?\" Fudge, who wasn't listening, said, \"Lucius has just given a very generous contribution to St. Mungo's Hospital for Magical Maladies and Injuries, Arthur.  He's here as my guest.\" \"How - how nice,\" said Mr. Weasley, with a very strained smile. Mr. Malfoy's eyes had returned to Hermione, who went slightly pink, but stared determinedly back at him.  Harry knew exactly what was making Mr. Malfoy's lip curl like that. The Malfoys prided themselves on being purebloods; in other words, they considered anyone of Muggle descent, like Hermione, second-class.  However, under the gaze of the Minister of Magic, Mr. Malfoy didn't dare say anything.  He nodded sneeringly to Mr. Weasley and continued down the line to his seats.  Draco shot Harry, Ron, and Hermione one contemptuous look, then settled himself between his mother and father. \"Slimy gits,\" Ron muttered as he, Harry, and Hermione turned to face the field again."
}