{
  "id": "dab55b86319c9c34f0c4daed17096285ba0564e3",
  "text": "  Go with them, Silver Lady,  Mirri Maz Duur told her.   I will stay,  Dany said.  The man took me under the stars and gave life to the child inside me. I will not leave him.    You must. Once I begin to sing, no one must enter this tent. My song will wake powers old and dark. The dead will dance here this night. No living man must look on them.   Dany bowed her head, helpless.  No one will enter.  She bent over the tub, over Drogo in his bath of blood, and kissed him lightly on the brow.  Bring him back to me,  she whispered to Mirri Maz Duur before she fled.  Outside, the sun was low on the horizon, the sky a bruised red. The khalasar had made camp. Tents and sleeping mats were scattered as far as the eye could see. A hot wind blew. Jhogo and Aggo were digging a firepit to burn the dead stallion. A crowd had gathered to stare at Dany with hard black eyes, their faces like masks of beaten copper. She saw Ser Jorah Mormont, wearing mail and leather now, sweat beading on his broad, balding forehead. He pushed his way through the Dothraki to Dany’s side. When he saw the scarlet footprints her boots had left on the ground, the color seemed to drain from his face.  What have you done, you little fool?  he asked hoarsely.   I had to save him.    We could have fled,  he said.  I would have seen you safe to Asshai, Princess. There was no need…    Am I truly your princess?  she asked him.   You know you are, gods save us both.    Then help me now.   Ser Jorah grimaced.  Would that I knew how.   Mirri Maz Duur’s voice rose to a high, ululating wail that sent a shiver down Dany’s back. Some of the Dothraki began to mutter and back away. The tent was aglow with the light of braziers within. Through the blood-spattered sandsilk, she glimpsed shadows moving.  Mirri Maz Duur was dancing, and not alone.  Dany saw naked fear on the faces of the Dothraki.  This must not be,  Qotho thundered.  She had not seen the bloodrider return. Haggo and Cohollo were with him. They had brought the hairless men, the eunuchs who healed with knife and needle and fire.   This will be,  Dany replied.   Maegi,  Haggo growled. And old Cohollo—Cohollo who had bound his life to Drogo’s on the day of his birth, Cohollo who had always been kind to her—Cohollo spat full in her face.   You will die, maegi,  Qotho promised,  but the other must die first.  He drew his arakh and made for the tent.   No,  she shouted,  you mustn’t.  She caught him by the shoulder, but Qotho shoved her aside. Dany fell to her knees, crossing her arms over her belly to protect the child within.  Stop him,  she commanded her khas,  kill him.   Rakharo and Quaro stood beside the tent flap. Quaro took a step forward, reaching for the handle of his whip, but Qotho spun graceful as a dancer, the curved arakh rising. It caught Quaro low under the arm, the bright sharp steel biting up through leather and skin, through muscle and rib bone. Blood fountained as the young rider reeled backward, gasping.  Qotho wrenched the blade free.  Horselord,  Ser Jorah Mormont called.  Try me.  His longsword slid from its scabbard.  Qotho whirled, cursing. The arakh moved so fast that Quaro’s blood flew from it in a fine spray, like rain in a hot wind. The longsword caught it a foot from Ser Jorah’s face, and held it quivering for an instant as Qotho howled in fury. The knight was clad in chainmail, with gauntlets and greaves of lobstered steel and a heavy gorget around his throat, but he had not thought to don his helm.  Qotho danced backward, arakh whirling around his head in a shining blur, flickering out like lightning as the knight came on in a rush. Ser Jorah parried as best he could, but the slashes came so fast that it seemed to Dany that Qotho had four arakhs and as many arms. She heard the crunch of sword on mail, saw sparks fly as the long curved blade glanced off a gauntlet. Suddenly it was Mormont stumbling backward, and Qotho leaping to the attack. The left side of the knight’s face ran red with blood, and a cut to the hip opened a gash in his mail and left him limping. Qotho screamed taunts at him, calling him a craven, a milk man, a eunuch in an iron suit.  You die now!  he promised, arakh shivering through the red twilight. Inside Dany’s womb, her son kicked wildly. The curved blade slipped past the straight one and bit deep into the knight’s hip where the mail gaped open.  Mormont grunted, stumbled. Dany felt a sharp pain in her belly, a wetness on her thighs. Qotho shrieked triumph, but his arakh had found bone, and for half a heartbeat it caught.  It was enough. Ser Jorah brought his longsword down with all the strength left him, through flesh and muscle and bone, and Qotho’s forearm dangled loose, flopping on a thin cord of skin and sinew. The knight’s next cut was at the Dothraki’s ear, so savage that Qotho’s face seemed almost to explode.  The Dothraki were shouting, Mirri Maz Duur wailing inside the tent like nothing human, Quaro pleading for water as he died. Dany cried out for help, but no one heard."
}