{
  "id": "dae9ed0cf4661b3b2c3799c0f9cfcde163d5e426",
  "text": "  \"But if you die during a task-\" \"They didn't care about attacking Krum, did they?\"  said Harry.  \"Why didn't they just polish me off at the same time?  They could've made it look like Krum and I had a duel or something.\" \"Harry, I don't understand it either,\" said Hermione desperately.  \"I just know there are a lot of odd things going on, and I don't like it. ... Moody's right - Sirius is right - you've got to get in training for the third task, straight away.  And you make sure you write back to Sirius and promise him you're not going to go sneaking off alone again.\"  The Hogwarts grounds never looked more inviting than when Harry had to stay indoors. For the next few days he spent all of his free time either in the library with Hermione and Ron, looking up hexes, or else in empty classrooms, which they sneaked into to practice.  Harry was concentrating on the Stunning Spell, which he had never used before.  The trouble was that practicing it involved certain sacrifices on Ron's and Hermione's part. \"Can't we kidnap Mrs. Norris?\" Ron suggested on Monday lunchtime as he lay flat on his back in the middle of their Charms classroom, having just been Stunned and reawoken by Harry for the fifth time in a row.  \"Let's Stun her for a bit.  Or you could use Dobby, Harry, I bet he'd do anything to help you.  I'm not complaining or anything\" - he got gingerly to his feet, rubbing his backside - \"but I'm aching all over. ...\" \"Well, you keep missing the cushions, don't you!\"  said Hermione impatiently, rearranging the pile of cushions they had used for the Banishing Spell, which Flitwick had left in a cabinet.  \"Just try and fall backward!\" \"Once you're Stunned, you can't aim too well, Hermione! \"said Ron angrily.  \"Why don't you take a turn?\" \"Well, I think Harry's got it now, anyway,\" said Hermione hastily.  \"And we don't have to worry about Disarming, because he's been able to do that for ages. ... I think we ought to start on some of these hexes this evening.\" She looked down the list they had made in the library. \"I like the look of this one,\" she said, \"this Impediment Curse.  Should slow down anything that's trying to attack you.  Harry.  We'll start with that one.\" The bell rang. They hastily shoved the cushions back into Flitwicks cupboard and slipped out of the classroom. \"See you at dinner!\"  said Hermione, and she set off for Arithmancy, while Harry and Ron headed toward North Tower, and Divination.  Broad strips of dazzling gold sunlight tell across the corridor from the high windows.  The sky outside was so brightly blue it looked as though it had been enameled. \"It's going to be boiling in Trelawney's room, she never puts out that fire,\" said Ron as they started up the staircase toward the silver ladder and the trapdoor. He was quite right.  The dimly lit room was swelteringly hot.  The fumes from the perfumed fire were heavier than ever.  Harrys head swam as he made his way over to one of the curtained windows.  While Professor Trelawney was looking the other way, disentangling her shawl from a lamp, he opened it an inch or so and settled back in his chintz armchair, so that a soft breeze played across his face. It was extremely comfortable. \"My dears,\" said Professor Trelawney, sitting down in her winged armchair in front of the class and peering around at them all with her strangely enlarged eyes, \"we have almost finished our work on planetary divination.  Today, however, will be an excellent opportunity to examine the effects of Mars, for he is placed most interestingly at the present time.  If you will all look this way, I will dim the lights. . . .\" She waved her wand and the lamps went out.  The fire was the only source of light now.  Professor Trelawney bent down and lifted, from under her chair, a miniature model of the solar system, contained within a glass dome.  It was a beautiful thing; each of the moons glimmered in place around the nine planets and the fiery sun, all of them hanging in thin air beneath the glass.  Harry watched lazily as Professor Trelawney began to point out the fascinating angle Mars was making to Neptune.  The heavily perfumed fumes washed over him, and the breeze from the window played across his face.  He could hear an insect humming gently somewhere behind the curtain.  His eyelids began to droop. . . . He was riding on the back of an eagle owl, soaring through the clear blue sky toward an old, ivy-covered house set high on a hillside.  Lower and lower they flew, the wind blowing pleasantly in Harry's face, until they reached a dark and broken window in the upper story of the house and entered.  Now they were flying along a gloomy passageway, to a room at the very end . . . through the door they went, into a dark room whose windows were boarded up.... Harry had left the owl's back... he was watching, now, as it fluttered across the room, into a chair with its back to him. . . . There were two dark shapes on the floor beside the chair . . . both of them were stirring."
}