{
  "id": "daf2135de27498ab3f0959d6d578ab3452c49311",
  "text": " Ser Jaremy had finished the job of hacking its head off, yet had died all the same when the headless corpse pulled his own dagger from its sheath and buried it in his bowels. Strength and courage did not avail much against foemen who would not fall because they were already dead; even arms and armor offered small protection.  That grim thought soured Jon’s fragile mood.  I need to see Hobb about the Old Bear’s supper,  he announced brusquely, sliding Longclaw back into its scabbard. His friends meant well, but they did not understand. It was not their fault, truly; they had not had to face Othor, they had not seen the pale glow of those dead blue eyes, had not felt the cold of those dead black fingers. Nor did they know of the fighting in the riverlands. How could they hope to comprehend? He turned away from them abruptly and strode off, sullen. Pyp called after him, but Jon paid him no mind.  They had moved him back to his old cell in tumbledown Hardin’s Tower after the fire, and it was there he returned. Ghost was curled up asleep beside the door, but he lifted his head at the sound of Jon’s boots. The direwolf’s red eyes were darker than garnets and wiser than men. Jon knelt, scratched his ear, and showed him the pommel of the sword.  Look. It’s you.   Ghost sniffed at his carved stone likeness and tried a lick. Jon smiled.  You’re the one deserves an honor,  he told the wolf… and suddenly he found himself remembering how he’d found him, that day in the late summer snow. They had been riding off with the other pups, but Jon had heard a noise and turned back, and there he was, white fur almost invisible against the drifts. He was all alone, he thought, apart from the others in the litter. He was different, so they drove him out.   Jon?  He looked up. Samwell Tarly stood rocking nervously on his heels. His cheeks were red, and he was wrapped in a heavy fur cloak that made him look ready for hibernation.   Sam.  Jon stood.  What is it? Do you want to see the sword?  If the others had known, no doubt Sam did too.  The fat boy shook his head.  I was heir to my father’s blade once,  he said mournfully.  Heartsbane. Lord Randyll let me hold it a few times, but it always scared me. It was Valyrian steel, beautiful but so sharp I was afraid I’d hurt one of my sisters. Dickon will have it now.  He wiped sweaty hands on his cloak.  I ah… Maester Aemon wants to see you.   It was not time for his bandages to be changed. Jon frowned suspiciously.  Why?  he demanded. Sam looked miserable. That was answer enough.  You told him, didn’t you?  Jon said angrily.  You told him that you told me.    I… he… Jon, I didn’t want to… he asked… I mean I think he knew, he sees things no one else sees…    He’s blind,  Jon pointed out forcefully, disgusted.  I can find the way myself.  He left Sam standing there, openmouthed and quivering.  He found Maester Aemon up in the rookery, feeding the ravens. Clydas was with him, carrying a bucket of chopped meat as they shuffled from cage to cage.  Sam said you wanted me?   The maester nodded.  I did indeed. Clydas, give Jon the bucket. Perhaps he will be kind enough to assist me.  The hunched, pink-eyed brother handed Jon the bucket and scurried down the ladder.  Toss the meat into the cages,  Aemon instructed him.  The birds will do the rest.    Jon shifted the bucket to his right hand and thrust his left down into the bloody bits. The ravens began to scream noisily and fly at the bars, beating at the metal with night-black wings. The meat had been chopped into pieces no larger than a finger joint. He filled his fist and tossed the raw red morsels into the cage, and the squawking and squabbling grew hotter. Feathers flew as two of the larger birds fought over a choice piece. Quickly Jon grabbed a second handful and threw it in after the first.  Lord Mormont’s raven likes fruit and corn.    He is a rare bird,  the maester said.  Most ravens will eat grain, but they prefer flesh. It makes them strong, and I fear they relish the taste of blood. In that they are like men… and like men, not all ravens are alike.   Jon had nothing to say to that. He threw meat, wondering why he’d been summoned. No doubt the old man would tell him, in his own good time. Maester Aemon was not a man to be hurried.   Doves and pigeons can also be trained to carry messages,  the maester went on,  though the raven is a stronger flyer, larger, bolder, far more clever, better able to defend itself against hawks… yet ravens are black, and they eat the dead, so some godly men abhor them. Baelor the Blessed tried to replace all the ravens with doves, did you know?  The maester turned his white eyes on Jon, smiling.  The Night’s Watch prefers ravens.   Jon’s fingers were in the bucket, blood up to the wrist.  Dywen says the wildlings call us crows,  he said uncertainty.   The crow is the raven’s poor cousin. They are both beggars in black, hated and misunderstood.   Jon wished he understood what they were talking about, and why."
}