{
  "id": "db2998e55dabea40ee16d28d4333de19fbbe3cd4",
  "text": " \"My mistake,\" Moody said calmly.  \"It's mine - must've dropped it earlier -\" But Snape's black eyes were darting from the egg in Filch's arms to the map in Moodys hand, and Harry could tell he was putting two and two together, as only Snape could. . . . \"Potter,\" he said quietly. \"What's that?\" said Moody calmly, folding up the map and pocketing it. \"Potter!\" Snape snarled, and he actually turned his head and stared right at the place where Harry was, as though he could suddenly see him.  \"That egg is Potters egg.  That piece of parchment belongs to Potter.  I have seen it before, I recognize it!  Potter is here!  Potter, in his Invisibility Cloak!\" Snape stretched out his hands like a blind man and began to move up the stairs; Harry could have sworn his over-large nostrils were dilating, trying to sniff Harry out - trapped. Harry leaned backward, trying to avoid Snapes fingertips, but any moment now- \"There's nothing there, Snape!\" barked Moody, \"but I'll be happy to tell the headmaster how quickly your mind jumped to Harry Potter!\" \"Meaning what?\"  Snape turned again to look at Moody, his hands still outstretched, inches from Harry's chest. \"Meaning that Dumbledore's very interested to know who's got it in for that boy!\" said Moody, limping nearer still to the foot of the stairs.  \"And so am I, Snape . . . very interested....\" The torchlight flickered across his mangled face, so that the scars, and the chunk missing from his nose, looked deeper and darker than ever. Snape was looking down at Moody, and Harry couldn't see the expression on his face. For a moment, nobody moved or said anything.  Then Snape slowly lowered his hands. \"I merely thought,\" said Snape, in a voice of forced calm, \"that if Potter was wandering around after hours again ... it's an unfortunate habit of his ... he should be stopped.  For - for his own safety.\" \"Ah, I see,\" said Moody softly. \"Got Potter's best interests at heart, have you?\" There was a pause.  Snape and Moody were still staring at each other, Mrs. Norris gave a loud meow, still peering around Filch's legs, looking for the source of Harry's bubble-bath smell. \"I think I will go back to bed,\" Snape said curtly. \"Best idea you've had all night,\" said Moody.  \"Now, Filch, if you'll just give me that egg-\" \"No!\"  said Filch, clutching the egg as though it were his firstborn son.  \"Professor Moody, this is evidence of Peeves' treachery!\" \"It's the property of the champion he stole it from,\" said Moody.   Hand it over, now.\" Snape swept downstairs and passed Moody without another word.  Filch made a chirruping noise to Mrs. Norris, who stared blankly at Harry for a few more seconds before turning and following her master.  Still breathing very fast.  Harry heard Snape walking away down the corridor; Filch handed Moody the egg and disappeared from view too, muttering to Mrs. Norris. \"Never mind. my sweet.. . we'll see Dumbledore in the morning ... tell him what Peeves was up to....\" A door slammed.  Harry was left staring down at Moody, who placed his staff on the bottommost stair and started to climb laboriously toward him, a dull clunk on every other step. \"Close shave. Potter,\" he muttered.  \"Yeah ... I - er ... thanks,\" said Harry weakly. \"What is this thing?\"  said Moody, drawing the Marauder's Map out of his pocket and unfolding it. \"Map of Hogwarts,\" said Harry, hoping Moody was going to pull him out of the staircase soon; his leg was really hurting him. \"Merlins beard,\" Moody whispered, staring at the map, his magical eye going haywire. \"This . .. this is some map.  Potter!\" \"Yeah, its . . . quite useful,\" Harry said. His eyes were starting to water from the pain. \"Er - Professor Moody, d'you think you could help me - ?\" \"What? Oh! Yes . . . yes, of course . ..\" Moody took hold of Harrys arms and pulled; Harrys leg came free of the trick step, and he climbed onto the one above it.  Moody was still gazing at the map. \"Potter ...\" he said slowly, \"you didn't happen, by any chance, to see who broke into Snapes office, did you?  On this map, I mean?\" \"Er . . . yeah, I did . . .\" Harry admitted. \"It was Mr. Crouch.\" Moodys magical eye whizzed over the entire surface of the map.  He looked suddenly alarmed. \"Crouch?\" he said.  \"You're - you're sure. Potter?\" \"Positive,\" said Harry. \"Well, he's not here anymore,\" said Moody, his eye still whizzing over the map.  \"Crouch . .. that's very - very interesting... .\" He said nothing for almost a minute, still staring at the map.  Harry could tell that this news meant something to Moody and very much wanted to know what it was.  He wondered whether he dared ask.  Moody scared him slightly. . . yet Moody had just helped him avoid an awful lot of trouble. . . . \"Er ... Professor Moody . . . why d'you reckon Mr. Crouch wanted to look around Snapes office?\" Moodys magical eye left the map and fixed, quivering, upon Harry.  It was a penetrating glare, and Harry had the impression that Moody was sizing him up, wondering whether to answer or not, or how much to tell him."
}