{
  "id": "db30f554fec1f290bd21b7dbc25b8b35e0e62485",
  "text": "  I loved a maid as red as autumn,  Rymund sang,  with sunset in her hair.   Catelyn never noticed when the singing ended. Hours had passed, yet it seemed only a heartbeat before Brienne was at the door.  My lady,  she announced softly.  Midnight has come.   Midnight has come, Father, she thought, and I must do my duty. She let go of his hand.  The gaoler was a furtive little man with broken veins in his nose. They found him bent over a tankard of ale and the remains of a pigeon pie, more than a little drunk. He squinted at them suspiciously.  Begging your forgiveness, m’lady, but Lord Edmure says no one is to see the Kingslayer without a writing from him, with his seal upon it.    Lord Edmure? Has my father died, and no one told me?   The gaoler licked his lips.  No, m’lady, not as I knows.    You will open the cell, or you will come with me to Lord Hoster’s solar and tell him why you saw fit to defy me.   His eyes fell.  As m’lady says.  The keys were chained to the studded leather belt that girdled his waist. He muttered under his breath as he sorted through them, until he found the one that fit the door to the Kingslayer’s cell.   Go back to your ale and leave us,  she commanded. An oil lamp hung from a hook on the low ceiling. Catelyn took it down and turned up the flame.  Brienne, see that I am not disturbed.   Nodding, Brienne took up a position just outside the cell, her hand resting on the pommel of her sword.  My lady will call if she has need of me.   Catelyn shouldered aside the heavy wood-and-iron door and stepped into foul darkness. This was the bowels of Riverrun, and smelled the part. Old straw crackled underfoot. The walls were discolored with patches of nitre. Through the stone, she could hear the faint rush of the Tumblestone. The lamplight revealed a pail overflowing with feces in one corner and a huddled shape in another. The flagon of wine stood beside the door, untouched. So much for that ploy. I ought to be thankful that the gaoler did not drink it himself, I suppose.  Jaime raised his hands to cover his face, the chains around his wrists clanking.  Lady Stark,  he said, in a voice hoarse with disuse.  I fear I am in no condition to receive you.    Look at me, ser.    The light hurts my eyes. A moment, if you would.  Jaime Lannister had been allowed no razor since the night he was taken in the Whispering Wood, and a shaggy beard covered his face, once so like the queen’s. Glinting gold in the lamplight, the whiskers made him look like some great yellow beast, magnificent even in chains. His unwashed hair fell to his shoulders in ropes and tangles, the clothes were rotting on his body, his face was pale and wasted… and even so, the power and the beauty of the man were still apparent.   I see you had no taste for the wine I sent you.    Such sudden generosity seemed somewhat suspect.    I can have your head off anytime I want. Why would I need to poison you?    Death by poison can seem natural. Harder to claim that my head simply fell off.  He squinted up from the floor, his cat-green eyes slowly becoming accustomed to the light.  I’d invite you to sit, but your brother has neglected to provide me a chair.    I can stand well enough.    Can you? You look terrible, I must say. Though perhaps it’s just the light in here.  He was fettered at wrist and ankle, each cuff chained to the others, so he could neither stand nor lie comfortably. The ankle chains were bolted to the wall.  Are my bracelets heavy enough for you, or did you come to add a few more? I’ll rattle them prettily if you like.    You brought this on yourself,  she reminded him.  We granted you the comfort of a tower cell befitting your birth and station. You repaid us by trying to escape.    A cell is a cell. Some under Casterly Rock make this one seem a sunlit garden. One day perhaps I’ll show them to you.   If he is cowed, he hides it well, Catelyn thought.  A man chained hand and foot should keep a more courteous tongue in his mouth, ser. I did not come here to be threatened.    No? Then surely it was to have your pleasure of me? It’s said that widows grow weary of their empty beds. We of the Kingsguard vow never to wed, but I suppose I could still service you if that’s what you need. Pour us some of that wine and slip out of that gown and we’ll see if I’m up to it.   Catelyn stared down at him in revulsion. Was there ever a man as beautiful or as vile as this one?  If you said that in my son’s hearing, he would kill you for it.    Only so long as I was wearing these.  Jaime Lannister rattled his chains at her.  We both know the boy is afraid to face me in single combat.    My son may be young, but if you take him for a fool, you are sadly mistaken… and it seems to me that you were not so quick to make challenges when you had an army at your back.    Did the old Kings of Winter hide behind their mothers’ skirts as well?    I grow weary of this, ser. There are things I must know.    Why should I tell you anything?    To save your life."
}