{
  "id": "db620a486e6b11805eb8e6e8182b49c235947008",
  "text": " Two enormous green eyes had appeared among the leaves.  Harry jumped to his feet just as a jeering voice floated across the lawn.  \"I know what day it is,\" sang Dudley, waddling toward him.  The huge eyes blinked and vanished.  \"What?\" said Harry, not taking his eyes off the spot where they had been.  \"I know what day it is,\" Dudley repeated, coming right up to him.  \"Well done,\" said Harry. \"So you've finally learned the days of the week.\"  \"Today's your birthday,\" sneered Dudley. \"How come you haven't got any cards? Haven't you even got friends at that freak place?\"  \"Better not let your mum hear you talking about my school,\" said Harry coolly.  Dudley hitched up his trousers, which were slipping down his fat bottom.  \"Why're you staring at the hedge?\" he said suspiciously.   \" I , m trying to decide what would be the best spell to set it on fire,\" said Harry.  Dudley stumbled backward at once, a look of panic on his fat face.  \"You c-can't - Dad told you you're not to do m-magic - he said he'll chuck you out of the house - and you haven't got anywhere else to go - you haven't got any friends to take you -\"  \"Jiggery pokery!\" said Harry in a fierce voice. \"Hocus pocus squiggly wiggly -\"  \"MUUUUUUM!\" howled Dudley, tripping over his feet as he dashed back toward the house. \"MUUUUM! He's doing you know what!\"  Harry paid dearly for his moment of fun. As neither Dudley nor  the hedge was in any way hurt, Aunt Petunia knew he hadn't really done magic, but he still had to duck as she aimed a heavy blow at his head with the soapy frying pan. Then she gave him work to do, with the promise he wouldn't eat again until he'd finished.  While Dudley lolled around watching and eating ice cream, Harry cleaned the windows, washed the car, mowed the lawn, trimmed the flowerbeds, pruned and watered the roses, and repainted the garden bench. The sun blazed overhead, burning the back of his neck. Harry knew he shouldn't have risen to Dudley's bait, but Dudley had said the very thing Harry had been thinking himself... maybe he didn't have any friends at Hogwarts ....  Wish they could see famous Harry Potter now, he thought savagely as he spread manure on the flower beds, his back aching, sweat running down his face.  It was half past seven ,in the evening when at last, exhausted, he heard Aunt Petunia calling him.  \"Get in here! And walk on the newspaper!\"  Harry moved gladly into the shade of the gleaming kitchen. On top of the fridge stood tonight's pudding: a huge mound of whipped cream and sugared violets. A loin of roast pork was sizzling in the oven.  \"Eat quickly! The Masons will be here soon!\" snapped Aunt Petunia, pointing to two slices of bread and a lump of cheese on the kitchen table. She was already wearing a salmon-pink cocktail dress.  Harry washed his hands and bolted down his pitiful supper. The moment he had finished, Aunt Petunia whisked away his plate. \"Upstairs! Hurry!\"  As he passed the door to the living room, Harry caught a glimpse of Uncle Vernon and Dudley in bow ties and dinner jack ets. He had only just reached the upstairs landing when the door bell rang and Uncle Vernon's furious face appeared at the foot of the stairs. \"Remember, boy - one sound -\" Harry crossed to his bedroom on tiptoe slipped inside, closed the door, and turned to collapse on his bed. The trouble was, there was already someone sitting on it.  C H-H A P T E RR  T W o  I  DOBBY'S WARNING  arry managed not to shout out, but it was a close thing. The little creature on the bed had large, bat-like ears and bulging green eyes the size of tennis balls. Harry knew instantly that this was what had been watching him out of the garden hedge that morning.  As they stared at each other, Harry heard Dudley's voice from the hall.  \"May I take your coats, Mr. and Mrs. Mason?\"  The creature slipped off the bed and bowed so low that the end of its long, thin nose touched the carpet. Harry noticed that it was wearing what looked like an old pillowcase, with rips for arm- and leg-holes.  \"Er - hello,\" said Harry nervously.  \"Harry Potter!\" said the creature in a high-pitched voice Harry was sure would carry down the stairs. \"So long has Dobby wanted to meet you, sir ... Such an honor it is . . . .\"    \"Th-thank you,\" said Harry, edging along the wall and sinking into his desk chair, next to Hedwig, who was asleep in her large cage. He wanted to ask, \"What are you?\" but thought it would sound too rude, so instead he said, \"Who are you?\"  \"Dobby, sir. Just Dobby. Dobby the house-elf,\" said the creature.  \"Oh - really?\" said Harry. \"Er - I don't want to be rude or anything, but - this isn't a great time for me to have a house-elf in my bedroom.\"  Aunt Petunias high, false laugh sounded from the living room. The elf hung his head.  \"Not that I'm not pleased to meet you,\" said Harry quickly, \"but, er, is there any particular reason you're here?\"  \"Oh, yes, sir,\" said Dobby earnestly. \"Dobby has come to tell you, sir ... it is difficult, sir ... Dobby wonders where to begin ."
}