{
  "id": "db9fa8f517f5e66acdc182e94082b65a27dee3ef",
  "text": " He got it to his lips, but before he could sound it Stonesnake knocked the horn aside with a swipe of his shortsword. Jon’s man leapt to his feet, thrusting at his face with a burning brand. He could feel the heat of the flames as he flinched back. Out of the corner of his eye, he saw the sleeper stirring, and knew he must finish his man quick. When the brand swung again, he bulled into it, swinging the bastard sword with both hands. The Valyrian steel sheared through leather, fur, wool, and flesh, but when the wildling fell he twisted, ripping the sword from Jon’s grasp. On the ground the sleeper sat up beneath his furs. Jon slid his dirk free, grabbing the man by the hair and jamming the point of the knife up under his chin as he reached for his—no, her—  His hand froze.  A girl.    A watcher,  said Stonesnake.  A wildling. Finish her.   Jon could see fear and fire in her eyes. Blood ran down her white throat from where the point of his dirk had pricked her. One thrust and it’s done, he told himself. He was so close he could smell onion on her breath. She is no older than I am. Something about her made him think of Arya, though they looked nothing at all alike.  Will you yield?  he asked, giving the dirk a half turn. And if she doesn’t?   I yield.  Her words steamed in the cold air.   You’re our captive, then.  He pulled the dirk away from the soft skin of her throat.   Qhorin said nothing of taking captives,  said Stonesnake.   He never said not to.  Jon let go his grip on the girl’s hair, and she scuttled backward, away from them.   She’s a spearwife.  Stonesnake gestured at the long-hafted axe that lay beside her sleeping furs.  She was reaching for that when you grabbed her. Give her half a chance and she’ll bury it between your eyes.    I won’t give her half a chance.  Jon kicked the axe well out of the girl’s reach.  Do you have a name?    Ygritte.  Her hand rubbed at her throat and came away bloody. She stared at the wetness.  Sheathing his dirk, he wrenched Longclaw free from the body of the man he’d killed.  You are my captive, Ygritte.    I gave you my name.    I’m Jon Snow.   She flinched.  An evil name.    A bastard name,  he said.  My father was Lord Eddard Stark of Winterfell.   The girl watched him warily, but Stonesnake gave a mordant chuckle.  It’s the captive supposed to tell things, remember?  The ranger thrust a long branch into the fire.  Not that she will. I’ve known wildlings to bite off their own tongues before they’d answer a question.  When the end of the branch was blazing merrily, he took two steps and flung it out over the pass. It fell through the night spinning until it was lost to sight.   You ought to burn them you killed,  said Ygritte.   Need a bigger fire for that, and big fires burn bright.  Stonesnake turned, his eyes scanning the black distance for any spark of light.  Are there more wildlings close by, is that it?    Burn them,  the girl repeated stubbornly,  or it might be you’ll need them swords again.   Jon remembered dead Othor and his cold black hands.  Maybe we should do as she says.    There are other ways.  Stonesnake knelt beside the man he’d slain, stripped him of cloak and boots and belt and vest, then hoisted the body over one thin shoulder and carried it to the edge. He grunted as he tossed it over. A moment later they heard a wet, heavy smack well below them. By then the ranger had the second body down to the skin and was dragging it by the arms. Jon took the feet and together they flung the dead man out in the blackness of the night.  Ygritte watched and said nothing. She was older than he’d thought at first, Jon realized; maybe as old as twenty, but short for her age, bandy-legged, with a round face, small hands, and a pug nose. Her shaggy mop of red hair stuck out in all directions. She looked plump as she crouched there, but most of that was layers of fur and wool and leather. Underneath all that she could be as skinny as Arya.   Were you sent to watch for us?  Jon asked her.   You, and others.   Stonesnake warmed his hands over the fire.  What waits beyond the pass?    The free folk.    How many?    Hundreds and thousands. More than you ever saw, crow.  She smiled. Her teeth were crooked, but very white.  She doesn’t know how many.  Why come here?   Ygritte fell silent.   What’s in the Frostfangs that your king could want? You can’t stay here, there’s no food.   She turned her face away from him.   Do you mean to march on the Wall? When?   She stared at the flames as if she could not hear him.   Do you know anything of my uncle, Benjen Stark?   Ygritte ignored him. Stonesnake laughed.  if she spits out her tongue, don’t say I didn’t warn you.   A low rumbling growl echoed off the rock. Shadowcat, Jon knew at once. As he rose he heard another, closer at hand. He pulled his sword and turned, listening.   They won’t trouble us,  Ygritte said.  It’s the dead they’ve come for. Cats can smell blood six miles off. They’ll stay near the bodies till they’ve eaten every last stringy shred o’ meat, and cracked the bones for the marrow."
}