{
  "id": "dbd04dce55593dba33622fe5c0914679bd3e0794",
  "text": " A dozen times Jeyne and Sansa cried out in unison as riders crashed together, lances exploding into splinters while the commons screamed for their favorites. Jeyne covered her eyes whenever a man fell, like a frightened little girl, but Sansa was made of sterner stuff. A great lady knew how to behave at tournaments. Even Septa Mordane noted her composure and nodded in approval.  The Kingslayer rode brilliantly. He overthrew Ser Andar Royce and the Marcher Lord Bryce Caron as easily as if he were riding at rings, and then took a hard-fought match from white-haired Barristan Selmy, who had won his first two tilts against men thirty and forty years his junior.  Sandor Clegane and his immense brother, Ser Gregor the Mountain, seemed unstoppable as well, riding down one foe after the next in ferocious style. The most terrifying moment of the day came during Ser Gregor’s second joust, when his lance rode up and struck a young knight from the Vale under the gorget with such force that it drove through his throat, killing him instantly. The youth fell not ten feet from where Sansa was seated. The point of Ser Gregor’s lance had snapped off in his neck, and his life’s blood flowed out in slow pulses, each weaker than the one before. His armor was shiny new; a bright streak of fire ran down his outstretched arm, as the steel caught the light. Then the sun went behind a cloud, and it was gone. His cloak was blue, the color of the sky on a clear summer’s day, trimmed with a border of crescent moons, but as his blood seeped into it, the cloth darkened and the moons turned red, one by one.  Jeyne Poole wept so hysterically that Septa Mordane finally took her off to regain her composure, but Sansa sat with her hands folded in her lap, watching with a strange fascination. She had never seen a man die before. She ought to be crying too, she thought, but the tears would not come. Perhaps she had used up all her tears for Lady and Bran. It would be different if it had been Jory or Ser Rodrik or Father, she told herself. The young knight in the blue cloak was nothing to her, some stranger from the Vale of Arryn whose name she had forgotten as soon as she heard it. And now the world would forget his name too, Sansa realized; there would be no songs sung for him. That was sad.  After they carried off the body, a boy with a spade ran onto the field and shoveled dirt over the spot where he had fallen, to cover up the blood. Then the jousts resumed.  Ser Balon Swann also fell to Gregor, and Lord Renly to the Hound. Renly was unhorsed so violently that he seemed to fly backward off his charger, legs in the air. His head hit the ground with an audible crack that made the crowd gasp, but it was just the golden antler on his helm. One of the tines had snapped off beneath him. When Lord Renly climbed to his feet, the commons cheered wildly, for King Robert’s handsome young brother was a great favorite. He handed the broken tine to his conqueror with a gracious bow. The Hound snorted and tossed the broken antler into the crowd, where the commons began to punch and claw over the little bit of gold, until Lord Renly walked out among them and restored the peace. By then Septa Mordane had returned, alone. Jeyne had been feeling ill, she explained; she had helped her back to the castle. Sansa had almost forgotten about Jeyne.  Later a hedge knight in a checkered cloak disgraced himself by killing Beric Dondarrion’s horse, and was declared forfeit. Lord Beric shifted his saddle to a new mount, only to be knocked right off it by Thoros of Myr. Ser Aron Santagar and Lothor Brune tilted thrice without result; Ser Aron fell afterward to Lord Jason Mallister, and Brune to Yohn Royce’s younger son, Robar.  In the end it came down to four; the Hound and his monstrous brother Gregor, Jaime Lannister the Kingslayer, and Ser Loras Tyrell, the youth they called the Knight of Flowers.  Ser Loras was the youngest son of Mace Tyrell, the Lord of Highgarden and Warden of the South. At sixteen, he was the youngest rider on the field, yet he had unhorsed three knights of the Kingsguard that morning in his first three jousts. Sansa had never seen anyone so beautiful. His plate was intricately fashioned and enameled as a bouquet of a thousand different flowers, and his snow-white stallion was draped in a blanket of red and white roses. After each victory, Ser Loras would remove his helm and ride slowly round the fence, and finally pluck a single white rose from the blanket and toss it to some fair maiden in the crowd.  His last match of the day was against the younger Royce. Ser Robar’s ancestral runes proved small protection as Ser Loras split his shield and drove him from his saddle to crash with an awful clangor in the dirt. Robar lay moaning as the victor made his circuit of the field. Finally they called for a litter and carried him off to his tent, dazed and unmoving. Sansa never saw it. Her eyes were only for Ser Loras. When the white horse stopped in front of her, she thought her heart would burst."
}