{
  "id": "dbedb9e00c3f9835b1d33e83e0f5f2c8e8c42716",
  "text": " Bronn led the way. Once or twice Tyrion glanced back over his shoulder to see if they were being followed, but there was nothing to be seen except the usual rabble: a carter beating his horse, an old woman throwing nightsoil from her window, two little boys fighting with sticks, three gold cloaks escorting a captive… they all looked innocent, but any one of them could be his undoing. Varys had informers everywhere.  They turned at a corner, and again at the next, and rode slowly through a crowd of women at a well. Bronn led him along a curving wynd, through an alley, under a broken archway. They cut through the rubble where a house had burned and walked their horses up a shallow flight of stone steps. The buildings were close and poor. Bronn halted at the mouth of a crooked alley, too narrow for two to ride abreast.  There’s two jags and then a dead end. The sink is in the cellar of the last building.   Tyrion swung down off his horse.  See that no one enters or leaves till I return. This won’t take long.  His hand went into his cloak, to make certain the gold was still there in the hidden pocket. Thirty dragons. A bloody fortune, for a man like him. He waddled up the alley quickly, anxious to be done with this.  The wine sink was a dismal place, dark and damp, walls pale with niter, the ceiling so low that Bronn would have had to duck to keep from hitting his head on the beams. Tyrion Lannister had no such problem. At this hour, the front room was empty but for a dead-eyed woman who sat on a stool behind a rough plank bar. She handed him a cup of sour wine and said,  In the back.   The back room was even darker. A flickering candle burned on a low table, beside a flagon of wine. The man behind it scarce looked a danger; a short man—though all men were tall to Tyrion—with thinning brown hair, pink cheeks, and a little pot pushing at the bone buttons of his doeskin jerkin. In his soft hands he held a twelve-stringed woodharp more deadly than a longsword.  Tyrion sat across from him.  Symon Silver Tongue.   The man inclined his head. He was bald on top.  My lord Hand,  he said.   You mistake me. My father is the King’s Hand. I am no longer even a finger, I fear.    You shall rise again, I am sure. A man like you. My sweet lady Shae tells me you are newly wed. Would that you had sent for me earlier. I should have been honored to sing at your feast.    The last thing my wife needs is more songs,  said Tyrion.  As for Shae, we both know she is no lady, and I would thank you never to speak her name aloud.    As the Hand commands,  Symon said.  The last time Tyrion had seen the man, a sharp word had been enough to set him sweating, but it seemed the singer had found some courage somewhere. Most like in that flagon. Or perhaps Tyrion himself was to blame for this new boldness. I threatened him, but nothing ever came of the threat, so now he believes me toothless. He sighed.  I am told you are a very gifted singer.    You are most kind to say so, my lord.   Tyrion gave him a smile.  I think it is time you brought your music to the Free Cities. They are great lovers of song in Braavos and Pentos and Lys, and generous with those who please them.  He took a sip of wine. It was foul stuff, but strong.  A tour of all nine cities would be best. You wouldn’t want to deny anyone the joy of hearing you sing. A year in each should suffice.  He reached inside his cloak, to where the gold was hidden.  With the port closed, you will need to go to Duskendale to take ship, but my man Bronn will find a horse for you, and I would be honored if you would let me pay your passage…    But my lord,  the man objected,  you have never heard me sing. Pray listen a moment.  His fingers moved deftly over the strings of the woodharp, and soft music filled the cellar. Symon began to sing.      He rode through the streets of the city,  down from his hill on high,  O’er the wynds and the steps and the cobbles,  he rode to a woman’s sigh.  For she was his secret treasure,  she was his shame and his bliss.  And a chain and a keep are nothing,  compared to a woman’s kiss.       There’s more,  the man said as he broke off,  Oh, a good deal more. The refrain is especially nice, I think. For hands of gold are always cold, but a woman’s hands are warm…    Enough.  Tyrion slid his fingers from his cloak, empty.  That’s not a song I would care to hear again. Ever.    No?  Symon Silver Tongue put his harp aside and took a sip of wine.  A pity. Still, each man has his song, as my old master used to say when he was teaching me to play. Others might like my tune better. The queen, perhaps. Or your lord father.   Tyrion rubbed the scar over his nose, and said,  My father has no time for singers, and my sister is not as generous as one might think. A wise man could earn more from silence than from song.  He could not put it much plainer than that.  Symon seemed to take his meaning quick enough.  You will find my price modest, my lord.    That’s good to know.  This would not be a matter of thirty golden dragons, Tyrion feared."
}