{
  "id": "dc1d9306afb613d452f1f46fb8addb99edc7a200",
  "text": " Then he could go back to hating your father's memory in peace....\"  Harry tried to understand this but it made his head pound, so he stopped.  \"And sir, there's one more thing...\"  \"Just the one?\"  \"How did I get the Stone out of the mirror?\"  \"Ah, now, I'm glad you asked me that. It was one of my more brilliant ideas, and between you and me, that's saying something. You see, only one who wanted to find the Stone -- find it, but not use it -- would be able to get it, otherwise they'd just see themselves making gold or drinking Elixir of Life. My brain surprises even me sometimes.... Now, enough questions. I suggest you make a start on these sweets. Ah! Bettie Bott's Every Flavor Beans! I was unfortunate enough in my youth to come across a vomitflavored one, and since then I'm afraid I've rather lost my liking for them -- but I think I'll be safe with a nice toffee, don't you?\"  He smiled and popped the golden-brown bean into his mouth. Then he choked and said, \"Alas! Ear wax!\"  Madam Pomfrey, the nurse, was a nice woman, but very strict.  \"Just five minutes,\" Harry pleaded.  \"Absolutely not.\"  \"You let Professor Dumbledore in...\"  \"Well, of course, that was the headmaster, quite different. You need rest.\"  \"I am resting, look, lying down and everything. Oh, go on, Madam Pomfrey...\"  \"Oh, very well,\" she said. \"But five minutes only.\"  And she let Ron and Hermione in.  \"Harry!\"  Hermione looked ready to fling her arms around him again, but Harry was glad she held herself in as his head was still very sore.  \"Oh, Harry, we were sure you were going to -- Dumbledore was so worried --\"  \"The whole school's talking about it,\" said Ron. \"What really happened?\"  It was one of those rare occasions when the true story is even more strange and exciting than the wild rumors. Harry told them everything: Quirrell; the mirror; the Stone; and Voldemort. Ron and Hermione were a very good audience; they gasped in all the right places, and when Harry told them what was under Quirrell's turban, Hermione screamed out loud.  \"So the Stone's gone?\" said Ron finally. \"Flamel's just going to die?\"  \"That's what I said, but Dumbledore thinks that -- what was it? -- 'to the well-organized mind, death is but the next great adventure.  \"I always said he was off his rocker,\" said Ron, looking quite impressed at how crazy his hero was.  \"So what happened to you two?\" said Harry.  \"Well, I got back all right,\" said Hermione. \"I brought Ron round -- that took a while -- and we were dashing up to the owlery to contact Dumbledore when we met him in the entrance hall -- he already knew -- he just said, 'Harry's gone after him, hasn't he?' and hurtled off to the third floor.\"  \"D'you think he meant you to do it?\" said Ron. \"Sending you your father's cloak and everything?\"  \"Well, \" Hermione exploded, \"if he did -- I mean to say that's terrible -- you could have been killed.\"  \"No, it isn't,\" said Harry thoughtfully. \"He's a funny man, Dumbledore. I think he sort of wanted to give me a chance. I think he knows more or less everything that goes on here, you know. I reckon he had a pretty good idea we were going to try, and instead of stopping us, he just taught us enough to help. I don't think it was an accident he let me find out how the mirror worked. It's almost like he thought I had the right to face Voldemort if I could....\"  \"Yeah, Dumbledore's off his rocker, all right,\" said Ron proudly. \"Listen, you've got to be up for the end-of-year feast tomorrow. The points are all in and Slytherin won, of course -- you missed the last Quidditch match, we were steamrollered by Ravenclaw without you -- but the food'll be good.\"  At that moment, Madam Pomfrey bustled over.  \"You've had nearly fifteen minutes, now OUT\" she said firmly.  After a good night's sleep, Harry felt nearly back to normal.  I want to go to the feast,\" he told Madam Pomfrey as she straightened his many candy boxes. I can, can't I?\"  \"Professor Dumbledore says you are to be allowed to go,\" she said stiffily, as though in her opinion Professor Dumbledore didn't realize how risky feasts could be. \"And you have another visitor.\"  \"Oh, good,\" said Harry. \"Who is it?\"  Hagrid sidled through the door as he spoke. As usual when he was indoors, Hagrid looked too big to be allowed. He sat down next to Harry, took one look at him, and burst into tears.  \"It's -- all -- my -- ruddy -- fault!\" he sobbed, his face in his hands. I told the evil git how ter get past Fluffy! I told him! It was the only thing he didn't know, an' I told him! Yeh could've died! All fer a dragon egg! I'll never drink again! I should be chucked out an' made ter live as a Muggle!\"  \"Hagrid!\" said Harry, shocked to see Hagrid shaking with grief and remorse, great tears leaking down into his beard. \"Hagrid, he'd have found out somehow, this is Voldemort we're talking about, he'd have found out even if you hadn't told him.\"  \"Yeh could've died!\" sobbed Hagrid. \"An' don' say the name!\"  \"VOLDEMORT!\" Harry bellowed, and Hagrid was so shocked, he stopped crying."
}