{
  "id": "dc663a246e69a2d99ff464dda2c9a04db40bd08b",
  "text": "  We have needed to be. In olden days the ironmen would come raiding in their longboats, or wildlings from the Frozen Shore. The men would be off fishing, like as not. The wives they left behind had to defend themselves and their children, or else be carried off.    There’s a carving on our gate,  said Dacey.  A woman in a bearskin, with a child in one arm suckling at her breast. In the other hand she holds a battleaxe. She’s no proper lady, that one, but I always loved her.    My nephew Jorah brought home a proper lady once,  said Lady Maege.  He won her in a tourney. How she hated that carving.    Aye, and all the rest,  said Dacey.  She had hair like spun gold, that Lynesse. Skin like cream. But her soft hands were never made for axes.    Nor her teats for giving suck,  her mother said bluntly.  Catelyn knew of whom they spoke; Jorah Mormont had brought his second wife to Winterfell for feasts, and once they had guested for a fortnight. She remembered how young the Lady Lynesse had been, how fair, and how unhappy. One night, after several cups of wine, she had confessed to Catelyn that the north was no place for a Hightower of Oldtown.  There was a Tully of Riverrun who felt the same once,  she had answered gently, trying to console,  but in time she found much here she could love.   All lost now, she reflected. Winterfell and Ned, Bran and Rickon, Sansa, Arya, all gone. Only Robb remains. Had there been too much of Lynesse Hightower in her after all, and too little of the Starks? Would that I had known how to wield an axe, perhaps I might have been able to protect them better.  Day followed day, and still the rain kept falling. All the way up the Blue Fork they rode, past Sevenstreams where the river unraveled into a confusion of rills and brooks, then through Hag’s Mire, where glistening green pools waited to swallow the unwary and the soft ground sucked at the hooves of their horses like a hungry babe at its mother’s breast. The going was worse than slow. Half the wayns had to be abandoned to the muck, their loads distributed amongst mules and draft horses.  Lord Jason Mallister caught up with them amidst the bogs of Hag’s Mire. There was more than an hour of daylight remaining when he rode up with his column, but Robb called a halt at once, and Ser Raynald Westerling came to escort Catelyn to the king’s tent. She found her son seated beside a brazier, a map across his lap. Grey Wind slept at his feet. The Greatjon was with him, along with Galbart Glover, Maege Mormont, Edmure, and a man that Catelyn did not know, a fleshy balding man with a cringing look to him. No lordling, this one, she knew the moment she laid eyes on the stranger. Not even a warrior.  Jason Mallister rose to offer Catelyn his seat. His hair had almost as much white in it as brown, but the Lord of Seagard was still a handsome man; tall and lean, with a chiseled clean-shaven face, high cheekbones, and fierce blue-grey eyes.  Lady Stark, it is ever a pleasure. I bring good tidings, I hope.    We are in sore need of some, my lord.  She sat, listening to the rain patter down noisily against the canvas overhead.  Robb waited for Ser Raynald to close the tent flap.  The gods have heard our prayers, my lords. Lord Jason has brought us the captain of the Myraham, a merchanter out of Oldtown. Captain, tell them what you told me.    Aye, Your Grace.  He licked his thick lips nervously.  My last port of call afore Seagard, that was Lordsport on Pyke. The ironmen kept me there more’n half a year, they did. King Balon’s command. Only, well, the long and the short of it is, he’s dead.    Balon Greyjoy?  Catelyn’s heart skipped a beat.  You are telling us that Balon Greyjoy is dead?   The shabby little captain nodded.  You know how Pyke’s built on a headland, and part on rocks and islands off the shore, with bridges between? The way I heard it in Lordsport, there was a blow coming in from the west, rain and thunder, and old King Balon was crossing one of them bridges when the wind got hold of it and just tore the thing to pieces. He washed up two days later, all bloated and broken. Crabs ate his eyes, I hear.   The Greatjon laughed.  King crabs, I hope, to sup upon such royal jelly, eh?   The captain bobbed his head.  Aye, but that’s not all of it, no!  He leaned forward.  The brother’s back.    Victarion?  asked Galbart Glover, surprised.   Euron. Crow’s Eye, they call him, as black a pirate as ever raised a sail. He’s been gone for years, but Lord Balon was no sooner cold than there he was, sailing into Lordsport in his Silence. Black sails and a red hull, and crewed by mutes. He’d been to Asshai and back, I heard. Wherever he was, though, he’s home now, and he marched right into Pyke and sat his arse in the Seastone Chair, and drowned Lord Botley in a cask of seawater when he objected. That was when I ran back to Myraham and slipped anchor, hoping I could get away whilst things were confused. And so I did, and here I am.    Captain,  said Robb when the man was done,  you have my thanks, and you will not go unrewarded."
}