{
  "id": "dc7fbd310b9eee469ec8f91770337e57467fa38f",
  "text": " When Harry relieved this owl of its burden, it ruffled its feathers importantly, stretched its wings, and took off through the window into the night.  Harry sat down on his bed and grabbed Errol's package, ripped off the brown paper, and discovered a present wrapped in gold, and his first ever birthday card. Fingers trembling slightly, he opened the envelope. Two pieces of paper fell out -- a letter and a newspaper clipping.  The clipping had clearly come out of the wizarding newspaper, the Daily Prophet, because the people in the black-and-white picture were moving. Harry picked up the clipping, smoothed it out, and read:  MINISTRY OF MAGIC EMPLOYEE SCOOPS GRAND PRIZE  Arthur Weasley, Head of the Misuse of Muggle Artifacts Office at the Ministry of Magic, has won the annual Daily Prophet Grand Prize Galleon Draw.  A delighted Mr. Weasley told the Daily Prophet, \"We will be spending the gold on a summer holiday in Egypt, where our eldest son, Bill, works as a curse breaker for Gringotts Wizarding Bank.\"  The Weasley family will be spending a month in Egypt, returning for the start of the new school year at Hogwarts, which five of the Weasley children currently attend.  Harry scanned the moving photograph, and a grin spread across his face as he saw all nine of the Weasleys waving furiously at him, standing in front of a large pyramid. Plump little Mrs. Weasley; tail, balding Mr. Weasley; six sons; and one daughter, all (though the black-and-white picture didn't show it) with flaming-red hair. Right in the middle of the picture was Ron, tall and gangling, with his pet rat, Scabbers, on his shoulder and his arm around his little sister, Ginny.  Harry couldn't think of anyone who deserved to win a large pile of gold more than the Weasleys, who were very nice and extremely poor. He picked up Ron's letter and unfolded it.  Dear Harry,  Happy birthday!  Look, I' really sorry about that telephone call. I hope the Muggles didn't give you a hard time. I asked Dad, and he reckons I shouldn't have shouted.  It's amazing here in Egypt. Bill's taken us around all the tombs and you wouldn't believe the curses those old Egyptian wizards put on them. Mum wouldn't let Ginny come in the last one. There were all these mutant skeletons in there, of Muggles who'd broken in and grown extra heads and stuff.  I couldn't believe it when Dad won the Daily Prophet Draw. Seven hundred galleons! Most of it's gone on this trip, but they're going to buy me a new wand for next year.  Harry remembered only too well the occasion when Ron's old wand had snapped. It had happened when the car the two of them had been flying to Hogwarts had crashed into a tree on the school grounds.  We'll be back about a week before term starts and we'll be going up to London to get my wand and our new books. Any chance of meeting you there?  Don't let the Muggles get you down!  Try and come to London,  Ron  P.S. Percy's Head Boy. He got the letter last week.  Harry glanced back at the photograph. Percy, who was in his seventh and final year at Hogwarts, was looking particularly smug. He had pinned his Head Boy badge to the fez perched jauntily on top of his neat hair, his horn-rimmed glasses flashing in the Egyptian sun.  Harry now turned to his present and unwrapped it. Inside was what looked like a miniature glass spinning top. There was another note from Ron beneath it.  Harry -- this is a Pocket Sneakoscope. If there's someone untrustworthy around, it's supposed to light up and spin. Bill says it's rubbish sold for wizard tourists and isn't reliable, because it kept lighting up at dinner last night. But he didn't realize Fred and George had put beetles in his soup.  Bye --  Ron  Harry put the Pocket Sneakoscope on his bedside table, where it stood quite still, balanced on its point, reflecting the luminous hands of his clock. He looked at it happily for a few seconds, then picked up the parcel Hedwig had brought.  Inside this, too, there was a wrapped present, a card, and a letter, this time from Hermione.  Dear Harry,  Ron wrote to me and told me about his phone call to your Uncle Vernon. I do hope you're all right.  I'm on holiday in France at the moment and I didn't know how I was going to send this to you -- what if they'd opened it at customs? -- but then Hedwig turned up! I think she wanted to make sure you got something for your birthday for a change. I bought your present by owl-order; there was an advertisement in the Daily Prophet (I've been getting it delivered; it's so good to keep up with what's going on in the wizarding world), Did you see that picture of Ron and his family a week ago? I bet he's learning loads. I'm really jealous -- the ancient Egyptian wizards were fascinating.  There's some interesting local history of witchcraft here, too. I've rewritten my whole History of Magic essay to include some of the things I've found out, I hope it's not too long -- it's two rolls of parchment more than Professor Binns asked for.  Ron says he's going to be in London in the last week of the holidays."
}