{
  "id": "dd0ba92db791edc20de765620ef8c58eeff2cd72",
  "text": " Just as it had before he faced the Horntail, time was slipping away as though somebody had bewitched the clocks to go extra-fast.  There was a week to go before February the twenty-fourth (there was still time) . . . there were five days to go (he was bound to find something soon) .. . three days to go (please let me find something... please). . . With two days left.  Harry started to go off food again.  The only good thing about breakfast on Monday was the return of the brown owl he had sent to Sirius.  He pulled off the parchment, unrolled it, and saw the shortest letter Sirius had ever written to him.  Send date of next Hogsmeade weekend by return owl.  Harry turned the parchment over and looked at the back, hoping to see something else, but it was blank. \"Weekend after next,\" whispered Hermione, who had read the note over Harrys shoulder.  \"Here - take my quill and send this owl back straight away.\" Harry scribbled the dates down on the back of Sirius's letter, tied it onto the brown owl's leg, and watched it take flight again.  What had he expected?  Advice on how to survive underwater?  He had been so intent on telling Sirius all about Snape and Moody he had completely forgotten to mention the eggs clue. \"What's he want to know about the next Hogsmeade weekend for?\" said Ron. \"Dunno,\" said Harry dully.  The momentary happiness that had flared inside him at the sight of the owl had died.  \"Come on ...Care of Magical Creatures.\" Whether Hagrid was trying to make up for the Blast-Ended Skrewts, or because there were now only two skrewts left, or because he was trying to prove he could do anything that Professor Grubbly-Plank could.  Harry didnt know, but Hagrid had been continuing her lessons on unicorns ever since he'd returned to work.  It turned out that Hagrid knew quite as much about unicorns as he did about monsters, though it was clear that he found their lack of poisonous fangs disappointing. Today he had managed to capture two unicorn foals.  Unlike full-grown unicorns, they were pure gold.  Parvati and Lavender went into transports of delight at the sight of them, and even Pansy Parkinson had to work hard to conceal how much she liked them. \"Easier ter spot than the adults,\" Hagrid told the class.  \"They turn silver when they're abou' two years old, an' they grow horns at aroun four.  Don' go pure white till they're full grown, 'round about seven.  They're a bit more trustin when they're babies .. . don mind boys so much.... C'mon, move in a bit, yeh can pat 'em if yeh want. . . give 'em a few o' these sugar lumps. . . . \"You okay. Harry?\"  Hagrid muttered, moving aside slightly, while most of the others swarmed around the baby unicorns. \"Yeah,\" said Harry.  \"Jus' nervous, eh?\"  said Hagrid. \"Bit,\" said Harry.  \"Harry,\" said Hagrid, clapping a massive hand on his shoulder, so that Harry's knees buckled under its weight, \"I'd've bin worried before I saw yeh take on tha Horntail, but I know now yeh can do anythin' yeh set yer mind ter.  I'm not worried at all.  Yeh're goin ter be fine. Got yer clue worked out, haven' yeh?\" Harry nodded, but even as he did so, an insane urge to confess that he didn't have any idea how to survive at the bottom of the lake for an hour came over him.  He looked up at Hagrid - perhaps he had to go into the lake sometimes, to deal with the creatures in it?  He looked after everything else on the grounds, after all- \"Yeh're goin' ter win,\" Hagrid growled, patting Harrys shoulder again, so that Harry actually felt himself sink a couple of inches into the soft ground.  \"I know it.  I can feel it.  Yeh're goin' ter win, Harry n Harry just couldn't bring himself to wipe the happy, confident smile off Hagrid's face. Pretending he was interested in the young unicorns, he forced a smile in return, and moved forward to pat them with the others.  By the evening before the second task.  Harry felt as though he were trapped in a nightmare.  He was fully aware that even if, by some miracle, he managed to find a suitable spell, he'd have a real job mastering it overnight.  How could he have let this happen?  Why hadn't he got to work on the egg's clue sooner?  Why had he ever let his mind wander in class - what if a teacher had once mentioned how to breathe underwater? He sat with Hermione and Ron in the library as the sun set outside, tearing feverishly through page after page of spells, hidden from one another by the massive piles of books on the desk in front of each of them.  Harry s heart gave a huge leap every time he saw the word \"water\" on a page, but more often than not it was merely \"Take two pints of water, half a pound of shredded mandrake leaves, and a newt...\" \"I don't reckon it can be done,\" said Rons voice flatly from the other side of the table. \"There's nothing.  Nothing.  Closest was that thing to dry up puddles and ponds, that Drought Charm, but that was nowhere near powerful enough to drain the lake.\" \"There must be something,\" Hermione muttered, moving a candle closer to her."
}