{
  "id": "dd7ee1e88e59f25e1910f637d41945a6f4fb164b",
  "text": " When ought I to start?        ' Boromir  looked  in surprise  at Bilbo, but the laughter died  on his  lips  when he saw that  all the others regarded  the  old  hobbit with grave  respect. Only Gluin smiled, but his smile came from old memories.        `Of course,  my dear Bilbo,' said Gandalf. `If  you had  really started  this affair,  you might be expected to finish  it. But you know  well enough  now that starting is too great a claim for  any, and that only  a small part  is played in  great deeds by any hero. You need not bow! Though the word was  meant, and we do not doubt that under jest you  are  making a valiant offer.  But one beyond your strength, Bilbo. You cannot take this thing back. It has  passed on. If you need my advice any longer, I should say that your  part is  ended,  unless  as a  recorder.  Finish  your book,  and  leave  the  ending  unaltered! There is still hope for it. But get ready to write a sequel, when  they come back.'   ####-     Bilbo laughed. `I have never known you give me pleasant advice before.'  he said.  `As  all your  unpleasant  advice has been  good, I wonder if this  advice is not  bad. Still, I don't suppose I have the strength  or luck left   to deal with the Ring. It has  grown, and I have  not.  But tell me: what do  you mean by they?'       `The messengers who are sent with the Ring.'       `Exactly! And who are  they to be?  That seems to me  what this Council   has to decide, and all  that  it has to decide. Elves  may  thrive on speech  alone, and Dwarves endure great weariness;  but I am only an old hobbit, and  I miss  my meal at noon. Can't you think of some  names  now?  Or put it off  till after dinner?'       No one answered. The  noon-bell rang. Still no one spoke. Frodo glanced  at all the faces, but they were not  turned to him. All the Council sat with  downcast eyes,  as if in deep  thought. A great dread fell on him,  as if he  was  awaiting  the pronouncement of some doom that he had long  foreseen  and  vainly  hoped might after all never be spoken.  An  overwhelming longing  to  rest and remain at peace by Bilbo's side in Rivendell filled all  his heart.  At last with an effort  he spoke, and wondered to hear his  own words, as if  some other will was using his small voice.       `I will take the Ring,' he said, `though I do not know the way.'       Elrond raised  his eyes and looked  at  him, and Frodo felt  his  heart  pierced by the sudden keenness  of the glance. `If  I understand aright  all  that I  have heard,' he said, `I think that this task  is appointed for you,  Frodo; and that if you do not find a way, no  one will. This is the hour  of  the Shire-folk, when they arise from  their quiet fields to shake the towers  and counsels of the Great. Who of all the Wise  could  have foreseen it? Or,   if they are wise, why  should they expect  to know it,  until  the hour  has  struck?       `But it is a heavy burden. So heavy that  none could lay it on another.  I do not lay it  on  you. But  if you  take it freely, I  will say that your  choice  is right;  and though all the mighty elf-friends of  old, Hador, and  H®rin, and T®rin, and Beren himself were assembled together your seat  should  be among them.'       `But you won't send him off alone surely, Mast er?' cried Sam, unable to  contain himself any longer, and jumping up from the corner where he had been  quietly sitting on the floor.   ####-     `No indeed!'  said Elrond, turning towards  him with a smile.  `You  at  least shall go with him. It  is  hardly  possi ble to separate  you from him,  even when he is summoned to a secret council and you are not.'       Sam sat  down, blushing and muttering.  `A nice  pickle we  have landed   ourselves in, Mr. Frodo!' he said, shaking his head.     ####-   Chapter 3. The Ring Goes South            Later that day the hobbits held a meeting of their own in Bilbo's room.  Merry  and Pippin were indignant when they heard that Sam had crept into the  Council, and had been chosen as Frodo's companion.       `It's most  unfair,' said  Pippin. `Instea d of  throwing  him out,  and  clapping him in chains, Elrond goes and rewards him for his cheek!'       `Rewards!'  said Frodo.  'I can't imagine a more severe punishment. You   are not  thinking what  you  are saying:  condemned  to  go on this hopeless  journey, a  reward? Yesterday I dreamed that my  task  was done, and I could  rest here, a long while, perhaps for good.'       'I don't wonder,' said Merry, 'and I wish you could. But we are envying  Sam, not you. If you have to go, then it will be  a punishment for any of us  to  be left behind, even in Rivendell. We have  come a long way with you and  been through some stiff times. We want to go on.'       `That's  what  I  meant,'  said  Pippin. `We  hobbits  ought  to  stick   together, and  we will. I shall go,  unless they chain me up.  There must be  someone with intelligence in the party.'       'Then  you certainly will not  be chosen, Peregrin Took!' said Gandalf,  looking in through  the window, which was  near the ground."
}