{
  "id": "ddce299d993b3d08727f584916a88c879cf6708a",
  "text": "  Queen Selyse’s uncle was a keg of a man with thick arms and bandy legs. He had the prominent ears of a Florent, even larger than his niece’s. The coarse hair that sprouted from his did not stop him hearing most of what went on in the castle. For ten years Ser Axell had served as castellan of Dragonstone while Stannis sat on Robert’s council in King’s Landing, but of late he had emerged as the foremost of the queen’s men.  Ser Davos, it is good to see you, as ever,  he said.   And you, my lord.    I made note of you this morning as well. The false gods burned with a merry light, did they not?    They burned brightly.  Davos did not trust this man, for all his courtesy. House Florent had declared for Renly.   The Lady Melisandre tells us that sometimes R’hllor permits his faithful servants to glimpse the future in flames. It seemed to me as I watched the fire this morning that I was looking at a dozen beautiful dancers, maidens garbed in yellow silk spinning and swirling before a great king. I think it was a true vision, ser. A glimpse of the glory that awaits His Grace after we take King’s Landing and the throne that is his by rights.   Stannis has no taste for such dancing, Davos thought, but he dared not offend the queen’s uncle.  I saw only fire,  he said,  but the smoke was making my eyes water. You must pardon me, ser, the king awaits.  He pushed past, wondering why Ser Axell had troubled himself. He is a queen’s man and I am the king’s.  Stannis sat at his Painted Table with Maester Pylos at his shoulder, an untidy pile of papers before them.  Ser,  the king said when Davos entered,  come have a look at this letter.   Obediently, he selected a paper at random.  It looks handsome enough, Your Grace, but I fear I cannot read the words.  Davos could decipher maps and charts as well as any, but letters and other writings were beyond his powers. But my Devan has learned his letters, and young Steffon and Stannis as well.   I’d forgotten.  A furrow of irritation showed between the king’s brows.  Pylos, read it to him.    Your Grace.  The maester took up one of the parchments and cleared his throat.  All men know me for the trueborn son of Steffon Baratheon, Lord of Storm’s End, by his lady wife Cassana of House Estermont. I declare upon the honor of my House that my beloved brother Robert, our late king, left no trueborn issue of his body, the boy Joffrey, the boy Tommen, and the girl Myrcella being abominations born of incest between Cersei Lannister and her brother Jaime the Kingslayer. By right of birth and blood, I do this day lay claim to the Iron Throne of the Seven Kingdoms of Westeros. Let all true men declare their loyalty. Done in the Light of the Lord, under the sign and seal of Stannis of House Baratheon, the First of His Name, King of the Andals, the Rhoynar, and the First Men, and Lord of the Seven Kingdoms.  The parchment rustled softly as Pylos laid it down.   Make it Ser Jaime the Kingslayer henceforth,  Stannis said, frowning.  Whatever else the man may be, he remains a knight. I don’t know that we ought to call Robert my beloved brother either. He loved me no more than he had to, nor I him.    A harmless courtesy, Your Grace,  Pylos said.   A lie. Take it out.  Stannis turned to Davos.  The maester tells me that we have one hundred seventeen ravens on hand. I mean to use them all. One hundred seventeen ravens will carry one hundred seventeen copies of my letter to every corner of the realm, from the Arbor to the Wall. Perhaps a hundred will win through against storm and hawk and arrow. If so, a hundred maesters will read my words to as many lords in as many solars and bedchambers… and then the letters will like as not be consigned to the fire, and lips pledged to silence. These great lords love Joffrey, or Renly, or Robb Stark. I am their rightful king, but they will deny me if they can. So I have need of you.    I am yours to command, my king. As ever.   Stannis nodded.  I mean for you to sail Black Betha north, to Gulltown, the Fingers, the Three Sisters, even White Harbor. Your son Dale will go south in Wraith, past Cape Wrath and the Broken Arm, all along the coast of Dorne as far as the Arbor. Each of you will carry a chest of letters, and you will deliver one to every port and holdfast and fishing village. Nail them to the doors of septs and inns for every man to read who can.   Davos said,  That will be few enough.    Ser Davos speaks truly, Your Grace,  said Maester Pylos.  It would be better to have the letters read aloud.    Better, but more dangerous,  said Stannis.  These words will not be kindly received.    Give me knights to do the reading,  Davos said.  That will carry more weight than anything I might say.   Stannis seemed well satisfied with that.  I can give you such men, yes. I have a hundred knights who would sooner read than fight. Be open where you can and stealthy where you must. Use every smuggler’s trick you know, the black sails, the hidden coves, whatever it requires."
}