{
  "id": "ddd223b6801bbd920410d8ec1c26522a07b80fef",
  "text": " Then he came down   ####-the slopes and when he reached the woods they all went up in fire. By that time all  the bells were  ringing  in Dale and  the warriors were arming. The dwarves  rushed  out  of  their  great  gate;  but  there was  the  dragon waiting  for  them. None  escaped  that way.  The  river  rushed  up  in  steam  and  a  fog  fell  on Dale, and  in  the  fog  the  dragon came on them and destroyed most of the warriors-the usual unhappy story,  it was only too common in those days. Then he went back and crept in through the  Front  Gate  and  routed  out  all  the  halls,  and  lanes,  and  tunnels,  alleys,  cellars,  mansions  and passages. After  that  there were no dwarves  left  alive  inside,  and he  took  all  their  wealth  for  himself.  Probably,  for  that  is  the  dragons'  way,  he  has  piled it all up in a great heap far inside, and sleeps on it for a bed. Later he used to  crawl  out  of  the  great  gate  and  come  by  night  to  Dale,  and  carry  away  people,  especially maidens, to eat, until Dale was ruined, and all the people dead or gone.  What goes on there now I don't know for certain, but I don't suppose anyone lives  nearer to the Mountain than the far edge of the Long Lake now-a-days.  \"The  few  of  us  that  were  well  outside  sat  and  wept  in  hiding,  and  cursed  Smaug;  and  there we were unexpectedly  joined by my  father  and my grandfather  with singed beards. They looked very grim but they said very little. When I asked  how  they had got away,  they  told me  to hold my  tongue, and said  that one day  in  the proper time I should know. After that we went away, and we have had to earn  our  livings  as  best we  could  up  and  down  the  lands,  often enough sinking as  low  as  blacksmith-work  or  even  coalmining.  But  we  have  never  forgotten  our  stolen  treasure. And even now, when I will allow we have a good bit laid by and are not  so  badly  off\"-here Thorin  stroked  the gold  chain  round his neck-\"we still mean to  get it back, and to bring our curses home to Smaug-if we can.  \"I  have  often  wondered  about  my  father's  and  my  grandfather's  escape.  I  see  now  they  must  have  had  a  private  Side-door  which  only  they  knew  about.  But  apparently  they made a map, and  I  should  like  to know how Gandalf got hold of  it, and why it did not come down to me, the rightful heir.\"  \"I did not 'get hold of it,' I was given it,\" said the wizard.  \"Your grandfather Thror was killed, you  remember,  in  the mines of Moria by  Azog the Goblin —\"  \"Curse his name, yes,\" said Thorin.  \"And  Thrain  your  father  went  away  on  the  twenty-first  of  April,  a  hundred  years ago last Thursday, and has never been seen by you since—\"  \"True, true,\" said Thorin.  \"Well,  your  father  gave me  this  to  give  to  you;  and  if  I have  chosen my own  time and way of handing it over, you can hardly blame me, considering the trouble   ####-I had to find you. Your father could not remember his own name when he gave me  the  paper,  and  he  never  told  me  yours;  so  on  the  whole  I  think  I  ought  to  be  praised and thanked. Here it is,\" said he handing the map to Thorin.  \"I don't understand,\" said Thorin, and Bilbo felt he would have liked to say the  same. The explanation did not seem to explain.  \"Your  grandfather,\"  said  the  wizard  slowly  and  grimly,  \"gave  the map  to  his  son for safety before he went  to  the mines of Moria. Your father went away  to  try  his  luck with  the map after your grandfather was killed; and  lots of adventures of  a  most  unpleasant  sort  he  had,  but  he  never  got  near  the  Mountain. How  he  got  there  I  don't  know,  but  I  found  him  a  prisoner  in  the  dungeons  of  the  Necromancer.\"  \"Whatever  were  you  doing  there?\"  asked  Thorin  with  a  shudder,  and  all  the  dwarves shivered.  \"Never  you  mind.  I  was  finding  things  out,  as  usual;  and  a  nasty  dangerous  business it was. Even I, Gandalf, only just escaped. I tried to save your father, but  it  was  too  late.  He  was  witless  and  wandering,  and  had  forgotten  almost  everything  except  the  map  and  the  key.\"  \"We  have  long  ago  paid  the  goblins  of  Moria,\"  said  Thorin;  \"we  must  give  a  thought  to  the  Necromancer.\"  \"Don't  be  absurd! He is an enemy quite beyond the powers of all the dwarves put together, if  they could all be collected again from the four corners of the world. The one thing  your  father  wished  was  for  his  son  to  read  the map  and  use  the  key.  The  dragon  and the Mountain are more than big enough tasks for you!\"  \"Hear, hear!\" said Bilbo, and accidentally said  it aloud, \"Hear what?\"  they all  said  turning  suddenly  towards  him,  and  he  was  so  flustered  that  he  answered  \"Hear what I have got to say!\" \"What's that?\" they asked.  \"Well, I should say that you ought to go East and have a look round. After all  there  is  the Side-door, and dragons must sleep sometimes, I suppose."
}