{
  "id": "dde9463306c0cae6b98208981b80d9fc7ad6d8e0",
  "text": " \"And they're favorites for the World Cup!\"  A large witch in front of Harry moved, and he was able to read the sign next to the broom:  ** THE FIREBOLT **  THIS STATE-OF-THE-ART PACING BROOM SPORTS A STREAM-LINED, SUPERFINE HANDLE OF ASH, TREATED WITH A DIAMOND-HARD POLISH AND HAND- NUMBERED WITH ITS OWN REGISTRATION NUMBER. EACH INDIVIDUALLY SELECTED BIRCH TWIG IN THE BROOMTAIL HAS BEEN HONED TO AERODYNAMIC PERFECTION, GIVING THE FIREBOLT UNSURPASSABLE BALANCE AND PINPOINT PRECISION. THE FIREBOLT HAS AN ACCELERATION OF 150 MILES AN HOUR IN TEN SECONDS AND INCORPORATES AN UNBREAKABLE BRAKING CHARM. PRICE ON REQUEST.  Price on request... Harry didn't like to think how much gold the Firebolt would cost. He had never wanted anything as much in his whole life -- but he had never lost a Quidditch match on his Nim bus Two Thousand, and what was the point in emptying his Gringotts vault for the Firebolt, when he had a very good broom already? Harry didn't ask for the price, but he returned, almost every day after that, just to look at the Firebolt.  There were, however, things that Harry needed to buy. He went to the Apothecary to replenish his store of potions ingredients, and as his school robes were now several inches too short in the arm and leg, he visited Madam Malkin's Robes for All Occasions and bought new ones. Most important of all, he had to buy his new schoolbooks, which would include those for his two new subjects, Care of Magical Creatures and Divination.  Harry got a surprise as he looked in at the bookshop window. Instead of the usual display of gold- embossed spellbooks the size of paving slabs, there was a large iron cage behind the glass that held about a hundred copies of The Monster Book of Monsters. Torn pages were flying everywhere as the books grappled with each other, locked together in furious wrestling matches and snapping aggressively.  Harry pulled his booklist out of his pocket and consulted it for the first time. The Monster Book of Monsters was listed as the required book for Care of Magical Creatures. Now Harry understood why Hagrid had said it would come in useful. He felt relieved; he had been wondering whether Hagrid wanted help with some terrifying new pet.  As Harry entered Flourish and Blotts, the manager came hurrying toward him.  \"Hogwarts?\" he said abruptly. \"Come to get your new books?\"  \"Yes,\" said Harry, \"I need --\"  \"Get out of the way,\" said the manager impatiently, brushing Harry aside. He drew on a pair of very thick gloves, picked up a large, knobbly walking stick, and proceeded toward the door of the Monster Books' cage.  \"Hang on,\" said Harry quickly, \"I've already got one of those.\"  \"Have you?\" A look of enormous relief spread over the manager's face. \"Thank heavens for that. I've been bitten five times already this morning --\"  A loud ripping noise rent the air; two of the Monster Books had seized a third and were pulling it apart.  \"Stop it! Stop it!\" cried the manager, poking the walking stick through the bars and knocking the books apart. \"I'm never stocking them again, never! It's been bedlam! I thought we'd seen the worst when we bought two hundred copies of the Invisible Book of Invisibility -cost a fortune, and we never found them.... Well... is there anything else I can help you with?\"  \"Yes,\" said Harry, looking down his booklist, \"I need Unfogging the Future by Cassandra Vablatsky.\"  \"Ah, starting Divination, are you?\" said the manager, stripping off his gloves and leading Harry into the back of the shop, where there was a corner devoted to fortune-telling. A small table was stacked with volumes such as Predicting the Unpredictable: Insulate Yourself Against Shocks and Broken Balls: When Fortunes Turn Foul.  \"Here you are,,' said the manager, who had climbed a set of steps to take down a thick, black- bound book. \"Unfogging the Future. Very good guide to all your basic fortune-telling methods - palmistry, crystal balls, bird entrails.  But Harry wasn't listening. His eyes had fallen on another book, which was among a display on a small table: Death Omens.- What to Do When You Know the Worst Is Coming.  \"Oh, I wouldn't read that if I were you,\" said the manager lightly, looking to see what Harry was staring at. \"You'll start seeing death omens everywhere. It's enough to frighten anyone to death. \"  But Harry continued to stare at the front cover of the book; it showed a black dog large as a bear, with gleaming eyes. It looked oddly familiar...  The manager pressed Unfogging the Future into Harry's hands.  \"Anything else?\" he said.  \"Yes,\" said Harry, tearing his eyes away from the dog's and dazedly consulting his booklist. \"Er -- I need Intermediate Transfiguration and The Standard Book of Spells, Grade Three.\"  Harry emerged from Flourish and Blotts ten minutes later with his new books under his arms and made his way back to the Leaky Cauldron, hardly noticing where he was going and bumping into several people.  He tramped up the stairs to his room, went inside, and tipped his books onto his bed."
}