{
  "id": "de58512525a9ebf53693241ae77a3ee4a1aa414b",
  "text": " He has your look.    I’m a girl,  Arya said, exasperated. If the old man was down from the Wall, he must have come by way of Winterfell.  Do you know my brothers?  she asked excitedly.  Robb and Bran are at Winterfell, and Jon’s on the Wall. Jon Snow, he’s in the Night’s Watch too, you must know him, he has a direwolf, a white one with red eyes. Is Jon a ranger yet? I’m Arya Stark.  The old man in his smelly black clothes was looking at her oddly, but Arya could not seem to stop talking.  When you ride back to the Wall, would you bring Jon a letter if I wrote one?  She wished Jon were here right now. He’d believe her about the dungeons and the fat man with the forked beard and the wizard in the steel cap.   My daughter often forgets her courtesies,  Eddard Stark said with a faint smile that softened his words.  I beg your forgiveness, Yoren. Did my brother Benjen send you?    No one sent me, m’lord, saving old Mormont. I’m here to find men for the Wall, and when Robert next holds court, I’ll bend the knee and cry our need, see if the king and his Hand have some scum in the dungeons they’d be well rid of. You might say as Benjen Stark is why we’re talking, though. His blood ran black. Made him my brother as much as yours. It’s for his sake I’m come. Rode hard, I did, near killed my horse the way I drove her, but I left the others well behind.    The others?   Yoren spat.  Sellswords and freeriders and like trash. That inn was full o’ them, and I saw them take the scent. The scent of blood or the scent of gold, they smell the same in the end. Not all o’ them made for King’s Landing, either. Some went galloping for Casterly Rock, and the Rock lies closer. Lord Tywin will have gotten the word by now, you can count on it.   Father frowned.  What word is this?   Yoren eyed Arya.  One best spoken in private, m’lord, begging your pardons.    As you say. Desmond, see my daughter to her chambers.  He kissed her on the brow.  We’ll finish our talk on the morrow.   Arya stood rooted to the spot.  Nothing bad’s happened to Jon, has it?  she asked Yoren.  Or Uncle Benjen?    Well, as to Stark, I can’t say. The Snow boy was well enough when I left the Wall. It’s not them as concerns me.   Desmond took her hand.  Come along, milady. You heard your lord father.   Arya had no choice but to go with him, wishing it had been Fat Tom. With Tom, she might have been able to linger at the door on some excuse and hear what Yoren was saying, but Desmond was too single-minded to trick.  How many guards does my father have?  she asked him as they descended to her bedchamber.   Here at King’s Landing? Fifty.    You wouldn’t let anyone kill him, would you?  she asked.  Desmond laughed.  No fear on that count, little lady. Lord Eddard’s guarded night and day. He’ll come to no harm.    The Lannisters have more than fifty men,  Arya pointed out.   So they do, but every northerner is worth ten of these southron swords, so you can sleep easy.    What if a wizard was sent to kill him?    Well, as to that,  Desmond replied, drawing his longsword,  wizards die the same as other men, once you cut their heads off.       EDDARD   Robert, I beg of you,  Ned pleaded,  hear what you are saying. You are talking of murdering a child.    The whore is pregnant!  The king’s fist slammed down on the council table loud as a thunderclap.  I warned you this would happen, Ned. Back in the barrowlands, I warned you, but you did not care to hear it. Well, you’ll hear it now. I want them dead, mother and child both, and that fool Viserys as well. Is that plain enough for you? I want them dead.   The other councillors were all doing their best to pretend that they were somewhere else. No doubt they were wiser than he was. Eddard Stark had seldom felt quite so alone.  You will dishonor yourself forever if you do this.    Then let it be on my head, so long as it is done. I am not so blind that I cannot see the shadow of the axe when it is hanging over my own neck.    There is no axe,  Ned told his king.  Only the shadow of a shadow, twenty years removed… if it exists at all.    If?  Varys asked softly, wringing powdered hands together.  My lord, you wrong me. Would I bring ties to king and council?   Ned looked at the eunuch coldly.  You would bring us the whisperings of a traitor half a world away, my lord. Perhaps Mormont is wrong. Perhaps he is lying.    Ser Jorah would not dare deceive me,  Varys said with a sly smile.  Rely on it, my lord. The princess is with child.    So you say. If you are wrong, we need not fear. If the girl miscarries, we need not fear. If she births a daughter in place of a son, we need not fear. If the babe dies in infancy, we need not fear.    But if it is a boy?  Robert insisted.  If he lives?    The narrow sea would still lie between us. I shall fear the Dothraki the day they teach their horses to run on water.   The king took a swallow of wine and glowered at Ned across the council table.  So you would counsel me to do nothing until the dragonspawn has landed his army on my shores, is that it?    This ‘dragonspawn’ is in his mother’s belly,  Ned said."
}