{
  "id": "de740e87af96cc8911070ebede8fd0067a3f1d57",
  "text": " I have  only once or twice  been in here  after   dark, and then only near the hedge. I thought all the  trees were whispering  to each  other,  passing news and plots along in an unintelligible language;  and the branches swayed and groped without any wind. They  do  say the trees  do  actually move, and can surround strangers and hem them in. In  fact long   ago they  attacked the Hedge: they came and  planted themselves right by it,   and leaned over it. But the hobbits came and cut down hundreds of trees, and  made a great  bonfire in the  Forest, and  burned all the  ground in  a long  strip east of the Hedge. After that the  trees gave up the attack,  but they  became very unfriendly.  There  is  still a wide  bare  space not far inside  where the bonfire was made.'       'Is it only the trees that are dangerous?' asked Pippin.       'There are  various queer things living deep  in the Forest, and on the  far  side,' said Merry, 'or at least I have heard so; but I have never  seen  any of them. But something makes paths. Whenever  one comes inside one  finds  open tracks; but they seem to shift and change from time  to time in a queer  fashion.  Not far from  this tunnel there is, or was for  a  long time,  the  beginning of quite  a broad path leading to the Bonfire  Glade,  and then on   ####-more  or less in our direction, east and a little  north. That is the path I  am going to try and find.'       The hobbits now left the tunnel -gate and rode across  the  wide hollow.   On the far side was a faint path leading up on to the floor of the Forest, a   hundred yards a nd more beyond  the Hedge;  but it  vanished  as  soon as  it  brought them under the trees.  Looking back they could see the  dark line of  the  Hedge  through  the stems of trees  that were already thick about them.  Looking  ahead  they  could  see  only tree-trunks of innumerable sizes  and   shapes: straight  or bent,  twisted, leaning,  squat  or slender, smooth  or   gnarled and branched;  and all the stems were green  or grey with  moss  and   slimy, shaggy growths.        Merry alone  seemed fairly cheerful.  'You had  better lead  on and find  that path,'  Frodo  said to him.  'Don't  let us lose one another, or forget  which way the Hedge lies!'       They picked a  way  among the trees, and  their  ponies plodded  along,  carefully  avoiding the many  writhing  and interlacing roots. There  was no  undergrowth. The ground was  rising  steadily,  and as they went  forward it   seemed  that the trees became  taller, darker,  and  thicker. There  was  no  sound,  except  an occasional drip  of  moisture falling  through  the still  leaves.  For  the  moment  there  was no  whispering  or movement  among the  branches; but  they  all got  an uncomfortable feeling that they were  being  watched with disapproval, deepening to dislike and even enmity.  The feeling  steadily  grew, until they found  themselves looking up quickly, or glancing  back over their shoulders, as if they expected a sudden blow.        There was not  as  yet  any  sign  of  a path,  and  the  trees  seemed  constantly to bar their way. Pippin suddenly  felt that he could not bear it  any longer, and without warning let out  a shout. 'Oi! Oi!' he  cried. 'I am  not going to do anything. Just let me pass through, will you!'       The others halted startled; but the  cry  fell as if muffled by a heavy  curtain. There was no echo or answer though the wood  seemed to  become  more  crowded and more watchful than before.       'I should not shout, if I were you,' said Merry. It does more harm than  good.'       Frodo began to wonder if it were possible to find a way through, a nd if  he had been right  to make  the others come into this abominable wood. Merry  was looking from side to side, and seemed already uncertain which way to go.   ####-Pippin noticed it. 'It  has not taken you long to lose  us,' he said. But at  that moment Merry gave a whistle of relief and pointed ahead.       'Well, well!'  he  said. 'These trees do  shift.  There is the  Bonfire  Glade in front of  us (or I hope so), but the path to it seems to have moved  away!'       The light grew clearer as they  went forward. Suddenly they came out of  the trees and found themselves in a wide circular space. There was sky above  them, blue and clear to  their surprise, for down under the Forest -roof they  had not been able to see the rising morning and the lifting of the mist. The  sun  was  not,  however,  high  enough  yet to shine down into the clearing,  though its light was on  the  tree-tops. The  leaves  were  all  thicker and  greener about  the edges of  the  glade, enclosing  it with  an almost solid  wall. No tree grew there,  only rough grass and many tall plants: stalky  and  faded hemlocks  and wood-parsley,  fire-weed seeding into fluffy ashes,  and  rampant nettles and  thistles.  A dreary place: but it seemed a charming and  cheerful garden after the close Forest.       The hobbits  felt encouraged, and looked up hopefully at the broadening  daylight in the  sky."
}