{
  "id": "de956ff5b50f21b77d9d402544dc351cd1c6bebf",
  "text": "  He reached down a hand to help the other man to his feet.  Lord Alester brushed the filthy straw from his clothing.  I… I must apologize for my appearance, ser. My chests were lost when the Lannisters overran our camp. I escaped with no more than the mail on my back and the rings on my fingers.   He still wears those rings, noted Davos, who had lacked even all of his fingers.   No doubt some cook’s boy or groom is prancing around King’s Landing just now in my slashed velvet doublet and jeweled cloak,  Lord Alester went on, oblivious.  But war has its horrors, as all men know. No doubt you suffered your own losses.    My ship,  said Davos.  All my men. Four of my sons.    May the… may the Lord of Light lead them through the darkness to a better world,  the other man said.  May the Father judge them justly, and the Mother grant them mercy, Davos thought, but he kept his prayer to himself. The Seven had no place on Dragonstone now.   My own son is safe at Brightwater,  the lord went on,  but I lost a nephew on the Fury. Ser Imry, my brother Ryam’s son.   It had been Ser Imry Florent who led them blindly up the Blackwater Rush with all oars pulling, paying no heed to the small stone towers at the mouth of the river. Davos was not like to forget him.  My son Maric was your nephew’s oarmaster.  He remembered his last sight of Fury, engulfed in wildfire.  Has there been any word of survivors?    The Fury burned and sank with all hands,  his lordship said.  Your son and my nephew were lost, with countless other good men. The war itself was lost that day, ser.   This man is defeated. Davos remembered Melisandre’s talk of embers in the ashes igniting great blazes. Small wonder he ended here.  His Grace will never yield, my lord.    Folly, that’s folly.  Lord Alester sat on the floor again, as if the effort of standing for a moment had been too much for him.  Stannis Baratheon will never sit the Iron Throne. Is it treason to say the truth? A bitter truth, but no less true for that. His fleet is gone, save for the Lyseni, and Salladhor Saan will flee at the first sight of a Lannister sail. Most of the lords who supported Stannis have gone over to Joffrey or died…    Even the lords of the narrow sea? The lords sworn to Dragonstone?   Lord Alester waved his hand feebly.  Lord Celtigar was captured and bent the knee. Monford Velaryon died with his ship, the red woman burned Sunglass, and Lord Bar Emmon is fifteen, fat, and feeble. Those are your lords of the narrow sea. Only the strength of House Florent is left to Stannis, against all the might of Highgarden, Sunspear, and Casterly Rock, and now most of the storm lords as well. The best hope that remains is to try and salvage something with a peace. That is all I meant to do. Gods be good, how can they call it treason?   Davos stood frowning.  My lord, what did you do?    Not treason. Never treason. I love His Grace as much as any man. My own niece is his queen, and I remained loyal to him when wiser men fled. I am his Hand, the Hand of the King, how can I be a traitor? I only meant to save our lives, and… honor… yes.  He licked his lips.  I penned a letter. Salladhor Saan swore that he had a man who could get it to King’s Landing, to Lord Tywin. His lordship is a… a man of reason, and my terms… the terms were fair… more than fair.    What terms were these, my lord?    It is filthy here,  Lord Alester said suddenly.  And that odor… what is that odor?    The pail,  said Davos, gesturing.  We have no privy here. What terms?   His lordship stared at the pail in horror.  That Lord Stannis give up his claim to the Iron Throne and retract all he said of Joffrey’s bastardy, on the condition that he be accepted back into the king’s peace and confirmed as Lord of Dragonstone and Storm’s End. I vowed to do the same, for the return of Brightwater Keep and all our lands. I thought… Lord Tywin would see the sense in my proposal. He still has the Starks to deal with, and the ironmen as well. I offered to seal the bargain by wedding Shireen to Joffrey’s brother Tommen.  He shook his head.  The terms… they are as good as we are ever like to get. Even you can see that, surely?    Yes,  said Davos,  even me.  Unless Stannis should father a son, such a marriage would mean that Dragonstone and Storm’s End would one day pass to Tommen, which would doubtless please Lord Tywin. Meanwhile, the Lannisters would have Shireen as hostage to make certain Stannis raised no new rebellions.  And what did His Grace say when you proposed these terms to him?    He is always with the red woman, and… he is not in his right mind, I fear. This talk of a stone dragon… madness, I tell you, sheer madness. Did we learn nothing from Aerion Brightfire, from the nine mages, from the alchemists? Did we learn nothing from Summerhall? No good has ever come from these dreams of dragons, I told Axell as much. My way was better. Surer. And Stannis gave me his seal, he gave me leave to rule. The Hand speaks with the king’s voice."
}