{
  "id": "dec132c64a0b135fd2f44425cb10c4ddca91bf2f",
  "text": " Stew went flying everywhere, spattering the brothers. Thorne recoiled. People were shouting, but Jon Snow did not hear them. He lunged at Ser Alliser’s face with the dagger, slashing at those cold onyx eyes, but Sam threw himself between them and before Jon could get around him, Pyp was on his back clinging like a monkey, and Grenn was grabbing his arm while Toad wrenched the knife from his fingers.  Later, much later, after they had marched him back to his sleeping cell, Mormont came down to see him, raven on his shoulder.  I told you not to do anything stupid, boy,  the Old Bear said.  Boy,  the bird chorused. Mormont shook his head, disgusted.  And to think I had high hopes for you.   They took his knife and his sword and told him he was not to leave his cell until the high officers met to decide what was to be done with him. And then they placed a guard outside his door to make certain he obeyed. His friends were not allowed to see him, but the Old Bear did relent and permit him Ghost, so he was not utterly alone.   My father is no traitor,  he told the direwolf when the rest had gone. Ghost looked at him in silence. Jon slumped against the wall, hands around his knees, and stared at the candle on the table beside his narrow bed. The flame flickered and swayed, the shadows moved around him, the room seemed to grow darker and colder. I will not sleep tonight, Jon thought.  Yet he must have dozed. When he woke, his legs were stiff and cramped and the candle had long since burned out. Ghost stood on his hind legs, scrabbling at the door. Jon was startled to see how tall he’d grown.  Ghost, what is it?  he called softly. The direwolf turned his head and looked down at him, baring his fangs in a silent snarl. Has he gone mad? Jon wondered.  It’s me, Ghost,  he murmured, trying not to sound afraid. Yet he was trembling, violently. When had it gotten so cold?  Ghost backed away from the door. There were deep gouges where he’d raked the wood. Jon watched him with mounting disquiet.  There’s someone out there, isn’t there?  he whispered. Crouching, the direwolf crept backward, white fur rising on the back of his neck. The guard, he thought, they left a man to guard my door, Ghost smells him through the door, that’s all it is.  Slowly, Jon pushed himself to his feet. He was shivering uncontrollably, wishing he still had a sword. Three quick steps brought him to the door. He grabbed the handle and pulled it inward. The creak of the hinges almost made him jump.  His guard was sprawled bonelessly across the narrow steps, looking up at him. Looking up at him, even though he was lying on his stomach. His head had been twisted completely around.  It can’t be, Jon told himself. This is the Lord Commander’s Tower, it’s guarded day and night, this couldn’t happen, it’s a dream, I’m having a nightmare.  Ghost slid past him, out the door. The wolf started up the steps, stopped, looked back at Jon. That was when he heard it; the soft scrape of a boot on stone, the sound of a latch turning. The sounds came from above. From the Lord Commander’s chambers.  A nightmare this might be, yet it was no dream.  The guard’s sword was in its sheath. Jon knelt and worked it free. The heft of steel in his fist made him bolder. He moved up the steps, Ghost padding silently before him. Shadows lurked in every turn of the stair. Jon crept up warily, probing any suspicious darkness with the point of his sword.  Suddenly he heard the shriek of Mormont’s raven.  Corn,  the bird was screaming.  Corn, corn, corn, corn, corn, corn.  Ghost bounded ahead, and Jon came scrambling after. The door to Mormont’s solar was wide open. The direwolf plunged through. Jon stopped in the doorway, blade in hand, giving his eyes a moment to adjust. Heavy drapes had been pulled across the windows, and the darkness was black as ink.  Who’s there?  he called out.  Then he saw it, a shadow in the shadows, sliding toward the inner door that led to Mormont’s sleeping cell, a man-shape all in black, cloaked and hooded… but beneath the hood, its eyes shone with an icy blue radiance…  Ghost leapt. Man and wolf went down together with neither scream nor snarl, rolling, smashing into a chair, knocking over a table laden with papers. Mormont’s raven was flapping overhead, screaming,  Corn, corn, corn, corn.  Jon felt as blind as Maester Aemon. Keeping the wall to his back, he slid toward the window and ripped down the curtain. Moonlight flooded the solar. He glimpsed black hands buried in white fur, swollen dark fingers tightening around his direwolf’s throat. Ghost was twisting and snapping, legs flailing in the air, but he could not break free.  Jon had no time to be afraid. He threw himself forward, shouting, bringing down the longsword with all his weight behind it. Steel sheared through sleeve and skin and bone, yet the sound was wrong somehow. The smell that engulfed him was so queer and cold he almost gagged. He saw arm and hand on the floor, black fingers wriggling in a pool of moonlight."
}