{
  "id": "dec3cd18fe0d26ea5f23ef38c65ba1b073a4fa21",
  "text": "   Arya wanted to scream. It was just like Sansa to go and attract the septa’s attention.  Here,  she said, surrendering up her work.  The septa examined the fabric.  Arya, Arya, Arya,  she said.  This will not do. This will not do at all.   Everyone was looking at her. It was too much. Sansa was too well bred to smile at her sister’s disgrace, but Jeyne was smirking on her behalf. Even Princess Myrcella looked sorry for her. Arya felt tears filling her eyes. She pushed herself out of her chair and bolted for the door.  Septa Mordane called after her.  Arya, come back here! Don’t you take another step! Your lady mother will hear of this. In front of our royal princess too! You’ll shame us all!   Arya stopped at the door and turned back, biting her lip. The tears were running down her cheeks now. She managed a stiff little bow to Myrcella.  By your leave, my lady.   Myrcella blinked at her and looked to her ladies for guidance. But if she was uncertain, Septa Mordane was not.  Just where do you think you are going, Arya?  the septa demanded.  Arya glared at her.  I have to go shoe a horse,  she said sweetly, taking a brief satisfaction in the shock on the septa’s face. Then she whirled and made her exit, running down the steps as fast as her feet would take her.  It wasn’t fair. Sansa had everything. Sansa was two years older; maybe by the time Arya had been born, there had been nothing left. Often it felt that way. Sansa could sew and dance and sing. She wrote poetry. She knew how to dress. She played the high harp and the bells. Worse, she was beautiful. Sansa had gotten their mother’s fine high cheekbones and the thick auburn hair of the Tullys. Arya took after their lord father. Her hair was a lusterless brown, and her face was long and solemn. Jeyne used to call her Arya Horseface, and neigh whenever she came near. It hurt that the one thing Arya could do better than her sister was ride a horse. Well, that and manage a household. Sansa had never had much of a head for figures. If she did marry Prince Joff, Arya hoped for his sake that he had a good steward.  Nymeria was waiting for her in the guardroom at the base of the stairs. She bounded to her feet as soon as she caught sight of Arya. Arya grinned. The wolf pup loved her, even if no one else did. They went everywhere together, and Nymeria slept in her room, at the foot of her bed. If Mother had not forbidden it, Arya would gladly have taken the wolf with her to needlework. Let Septa Mordane complain about her stitches then.  Nymeria nipped eagerly at her hand as Arya untied her. She had yellow eyes. When they caught the sunlight, they gleamed like two golden coins. Arya had named her after the warrior queen of the Rhoyne, who had led her people across the narrow sea. That had been a great scandal too. Sansa, of course, had named her pup  Lady.  Arya made a face and hugged the wolfling tight. Nymeria licked her ear, and she giggled.  By now Septa Mordane would certainly have sent word to her lady mother. If she went to her room, they would find her. Arya did not care to be found. She had a better notion. The boys were at practice in the yard. She wanted to see Robb put gallant Prince Joffrey flat on his back.  Come,  she whispered to Nymeria. She got up and ran, the wolf coming hard at her heels.  There was a window in the covered bridge between the armory and the Great Keep where you had a view of the whole yard. That was where they headed.  They arrived, flushed and breathless, to find Jon seated on the sill, one leg drawn up languidly to his chin. He was watching the action, so absorbed that he seemed unaware of her approach until his white wolf moved to meet them. Nymeria stalked closer on wary feet. Ghost, already larger than his litter mates, smelled her, gave her ear a careful nip, and settled back down.  Jon gave her a curious look.  Shouldn’t you be working on your stitches, little sister?   Arya made a face at him.  I wanted to see them fight.   He smiled.  Come here, then.   Arya climbed up on the window and sat beside him, to a chorus of thuds and grunts from the yard below.  To her disappointment, it was the younger boys drilling. Bran was so heavily padded he looked as though he had belted on a featherbed, and Prince Tommen, who was plump to begin with, seemed positively round. They were huffing and puffing and hitting at each other with padded wooden swords under the watchful eye of old Ser Rodrik Cassel, the master-at-arms, a great stout keg of a man with magnificent white cheek whiskers. A dozen spectators, man and boy, were calling out encouragement, Robb’s voice the loudest among them. She spotted Theon Greyjoy beside him, his black doublet emblazoned with the golden kraken of his House, a look of wry contempt on his face. Both of the combatants were staggering. Arya judged that they had been at it awhile.   A shade more exhausting than needlework,  Jon observed.   A shade more fun than needlework,  Arya gave back at him. Jon grinned, reached over, and messed up her hair."
}