{
  "id": "decaeca1c5ce3afa29d7ae519c1a19d69a3a4c32",
  "text": "    As you command, Your Grace,  Ser Boros said. He bowed deeply, spun on his heel, and took his leave, his long white cloak stirring the air behind him.  Sansa was confused.  I don’t understand,  she said.  Where is Jeyne’s father? Why can’t Ser Boros take her to him instead of Lord Petyr having to do it?  She had promised herself she would be a lady, gentle as the queen and as strong as her mother, the Lady Catelyn, but all of a sudden she was scared again. For a second she thought she might cry.  Where are you sending her? She hasn’t done anything wrong, she’s a good girl.    She’s upset you,  the queen said gently.  We can’t be having that. Not another word, now. Lord Baelish will see that Jeyne’s well taken care of, I promise you.  She patted the chair beside her.  Sit down, Sansa. I want to talk to you.   Sansa seated herself beside the queen. Cersei smiled again, but that did not make her feel any less anxious. Varys was wringing his soft hands together, Grand Maester Pycelle kept his sleepy eyes on the papers in front of him, but she could feel Littlefinger staring. Something about the way the small man looked at her made Sansa feel as though she had no clothes on. Goose bumps pimpled her skin.   Sweet Sansa,  Queen Cersei said, laying a soft hand on her wrist.  Such a beautiful child. I do hope you know how much Joffrey and I love you.    You do?  Sansa said, breathless. Littlefinger was forgotten. Her prince loved her. Nothing else mattered.  The queen smiled.  I think of you almost as my own daughter. And I know the love you bear for Joffrey.  She gave a weary shake of her head.  I am afraid we have some grave news about your lord father. You must be brave, child.   Her quiet words gave Sansa a chill.  What is it?    Your father is a traitor, dear,  Lord Varys said.  Grand Maester Pycelle lifted his ancient head.  With my own ears, I heard Lord Eddard swear to our beloved King Robert that he would protect the young princes as if they were his own sons. And yet the moment the king was dead, he called the small council together to steal Prince Joffrey’s rightful throne.    No,  Sansa blurted.  He wouldn’t do that. He wouldn’t!   The queen picked up a letter. The paper was torn and stiff with dried blood, but the broken seal was her father’s, the direwolf stamped in pale wax.  We found this on the captain of your household guard, Sansa. It is a letter to my late husband’s brother Stannis, inviting him to take the crown.    Please, Your Grace, there’s been a mistake.  Sudden panic made her dizzy and faint.  Please, send for my father, he’ll tell you, he would never write such a letter, the king was his friend.    Robert thought so,  said the queen.  This betrayal would have broken his heart. The gods are kind, that he did not live to see it.  She sighed.  Sansa, sweetling, you must see what a dreadful position this has left us in. You are innocent of any wrong, we all know that, and yet you are the daughter of a traitor. How can I allow you to marry my son?    But I love him,  Sansa wailed, confused and frightened. What did they mean to do to her? What had they done to her father? It was not supposed to happen this way. She had to wed Joffrey, they were betrothed, he was promised to her, she had even dreamed about it. It wasn’t fair to take him away from her on account of whatever her father might have done.   How well I know that, child,  Cersei said, her voice so kind and sweet.  Why else should you have come to me and told me of your father’s plan to send you away from us, if not for love?    It was for love,  Sansa said in a rush.  Father wouldn’t even give me leave to say farewell.  She was the good girl, the obedient girl, but she had felt as wicked as Arya that morning, sneaking away from Septa Mordane, defying her lord father. She had never done anything so willful before, and she would never have done it then if she hadn’t loved Joffrey as much as she did.  He was going to take me back to Winterfell and marry me to some hedge knight, even though it was Joff I wanted. I told him, but he wouldn’t listen.  The king had been her last hope. The king could command Father to let her stay in King’s Landing and marry Prince Joffrey, Sansa knew he could, but the king had always frightened her. He was loud and rough-voiced and drunk as often as not, and he would probably have just sent her back to Lord Eddard, if they even let her see him. So she went to the queen instead, and poured out her heart, and Cersei had listened and thanked her sweetly… only then Ser Arys had escorted her to the high room in Maegor’s Holdfast and posted guards, and a few hours later, the fighting had begun outside.  Please,  she finished,  you have to let me marry Joffrey, I’ll be ever so good a wife to him, you’ll see. I’ll be a queen just like you, I promise.   Queen Cersei looked to the others.  My lords of the council, what do you say to her plea?    The poor child,  murmured Varys.  A love so true and innocent, Your Grace, it would be cruel to deny it… and yet, what can we do? Her father stands condemned."
}