{
  "id": "df34f25043f68b7dc3265d7c4b0f5b4ab3b04908",
  "text": " Broken and rusty chains lay at  the edge and trailed down into the black pit. Fragments of stone lay near.       'One of you might have fallen in and  still be wondering  when you were  going to strike the bottom,' said Aragorn to Merry. 'Let  the guide go first   while you have one.'       'This seems  to  have been a guardroom, made for  the  watching  of the  three passages,'  said Gimli. `That hole was plainly a  well for the guards'  use, covered with a stone lid. But the  lid is broken, and we  must all take   ####-care in the dark.'       Pippin  felt  curiously attracted by  the  well. While the  others were  unrolling  blankets and making beds against the walls of the chamber, as far   as  possible from the hole in  the floor, he crept  to the  edge  and peered  over. A chill air seemed to  strike his face,  rising from invisible depths.  Moved by  a sudden impulse he groped for a loose  stone, and let it drop. He  felt  his heart beat many times before there was any sound. Then  far below,   as if  the stone had fallen into deep water in  some cavernous place,  there  came a plunk, very distant, but magnified and repeated in the hollow shaft.       `What's that? ' cried Gandalf.  He was relieved  when  Pippin confessed  what he had done; but he was angry, and Pippin could see  his  eye glinting.   'Fool  of a Took!  '  he growled. 'This  is a serious journey,  not a hobbit  walking-party. Throw yourself in next time, and  then you will be no further   nuisance. Now be quiet! '       Nothing more was heard for several  minutes; but then there came out of  the depths faint knocks: tom-tap, tap-tom. They stopped, and when the echoes  had  died away, they  were repeated:  tap-tom,  tom-tap, tap-tap, tom.  They   sounded  disquietingly  like signals of  some  sort;  but after a  while the  knocking died away and was not heard again.       'That  was  the  sound of a  hammer, or I have never heard  one,'  said  Gimli.       `Yes,' said  Gandalf, 'and I do not like it. It may  have nothing to do  with Peregrin's  foolish  stone; but  probably something  has been disturbed  that would have been better left quiet.  Pray, do nothing of the kind again!   Let us hope we shall get some rest without further trouble. You, Pippin, can  go on the first watch, as a  reward,' he growled, as he  rolled himself in a   blanket.        Pippin  sat  miserably  by  the door in  the pitch dark; but he kept on  turning  round, fearing  that some unknown thing would  crawl  up out of the  well.  He  wished he could cover  the  hole,  if only with a blanket, but he  dared not move or go near it, even though Gandalf seemed to be asleep.       Actually Gandalf was awake, though  lying still and silent. He was deep  in  thought,  trying  to recall  every memory of  his former journey in  the  Mines,  and considering  anxiously  the next  course  that he should take; a   false turn now might be disastrous.  After an hour  he rose up and came over   to Pippin.       `Get into a corner  and have a sleep, my lad,' he said in a kindly tone.   ####-'You want to sleep, I expect. I cannot get a wink, so  I may  as well do the  watching.'       'I know what is the matter with me,' he muttered, as he sat down by the  door.  'I  need  smoke!  I have not tasted  it since the morning  before the  snowstorm.'       The  last thing that Pippin saw, as sleep took  him, was a dark glimpse  of  the  old  wizard huddled on  the floor,  shielding a glowing chip in his  gnarled hands  between his knees.  The flicker for  a moment showed his sharp  nose. and the puff of smoke.       It was  Gandalf who roused them all from sleep. He  had sat and watched  all alone for  about six hours, and had let  the others  rest.  `And  in the  watches I have  made up my mind,' he  said. `I  do  not  like the feel of the  middle way; and  I do not like the smell of the left-hand way: there is foul  air down there, or I am no guide. I shall take the right -hand passage. It is  time we began to climb up again.'       For eight dark hours, not counting two brief  halts,  they marched  on;   and they met no  danger, and heard nothing, and  saw nothing  but the  faint  gleam  of  the wizard's  light, bobbing like  a will-o'-the-wisp in front of  them. The passage  they  had  chosen wound steadily upwards. As  far as they  could judge it went in great mounting curves, and as it rose it grew loftier   and wider.  There  were  now no openings  to  other galleries or  tunnels on  either side, and the floor  was level  and sound,  without  pits or  cracks.  Evidently  they had struck  what once had  been an important road; and  they  went forward quicker than they had done on their first march.       In this way they advanced some fifteen miles, measured in a direct line  east, though  they must have actually walked twenty miles  or  more. As  the  road climbed  upwards`  Frodo's spirits rose  a little;  but he  still  felt  oppressed, and still at times he heard, or thought he heard, away behind the  Company and beyond the fall and patter of  their feet, a following  footstep  that was not an echo."
}