{
  "id": "df35f07dd3e0ce3cfd0fef67dbb4ca267e79d8d0",
  "text": "   Aye,  said Tom, setting the woodharp aside,  and better horses than the three you gave away.   Husband dropped the vegetables on a table, annoyed.  I never gave them away. I sold them for a good price, and got us a skiff as well. Anyways, you lot were supposed to get them back.   I knew they were outlaws, Arya thought, listening. Her hand went under the table to touch the hilt of her dagger, and make sure it was still there. If they try to rob us, they’ll be sorry.   They never came our way,  said Lem.   Well, I sent them. You must have been drunk, or asleep.    Us? Drunk?  Tom drank a long draught of ale.  Never.    You could have taken them yourself,  Lem told Husband.   What, with only the boy here? I told you twice, the old woman was up to Lambswold helping that Fern birth her babe. And like as not it was one o’ you planted the bastard in the poor girl’s belly.  He gave Tom a sour look.  You, I’d wager, with that harp o’ yours, singing all them sad songs just to get poor Fern out of her smallclothes.    If a song makes a maid want to slip off her clothes and feel the good warm sun kiss her skin, why, is that the singer’s fault?  asked Tom.  And ’twas Anguy she fancied, besides. ‘Can I touch your bow?’ I heard her ask him. ‘Ooohh, it feels so smooth and hard. Could I give it a little pull, do you think?’   Husband snorted.  You and Anguy, makes no matter which. You’re as much to blame as me for them horses. They was three, you know. What can one man do against three?    Three,  said Lem scornfully,  but one a woman and t’other in chains, you said so yourself.   Husband made a face.  A big woman, dressed like a man. And the one in chains… I didn’t fancy the look of his eyes.   Anguy smiled over his ale.  When I don’t fancy a man’s eyes, I put an arrow through one.   Arya remembered the shaft that had brushed by her ear. She wished she knew how to shoot arrows.  Husband was not impressed.  You be quiet when your elders are talking. Drink your ale and mind your tongue, or I’ll have the old woman take a spoon to you.    My elders talk too much, and I don’t need you to tell me to drink my ale.  He took a big swallow, to show that it was so.  Arya did the same. After days of drinking from brooks and puddles, and then the muddy Trident, the ale tasted as good as the little sips of wine her father used to allow her. A smell was drifting out from the kitchen that made her mouth water, but her thoughts were still full of that boat. Sailing it will be harder than stealing it. If we wait until they’re all asleep…  The serving boy reappeared with big round loaves of bread. Arya broke off a chunk hungrily and tore into it. It was hard to chew, though, sort of thick and lumpy, and burned on the bottom.  Hot Pie made a face as soon as he tasted it.  That’s bad bread,  he said.  It’s burned, and tough besides.    It’s better when there’s stew to sop up,  said Lem.   No, it isn’t,  said Anguy,  but you’re less like to break your teeth.    You can eat it or go hungry,  said Husband.  Do I look like some bloody baker? I’d like to see you make better.    I could,  said Hot Pie.  It’s easy. You kneaded the dough too much, that’s why it’s so hard to chew.  He took another sip of ale, and began talking lovingly of breads and pies and tarts, all the things he loved. Arya rolled her eyes.  Tom sat down across from her.  Squab,  he said,  or Arry, or whatever your true name might be, this is for you.  He placed a dirty scrap of parchment on the wooden tabletop between them.  She looked at it suspiciously.  What is it?    Three golden dragons. We need to buy those horses.   Arya looked at him warily.  They’re our horses.    Meaning you stole them yourselves, is that it? No shame in that, girl. War makes thieves of many honest folk.  Tom tapped the folded parchment with his finger.  I’m paying you a handsome price. More than any horse is worth, if truth be told.   Hot Pie grabbed the parchment and unfolded it.  There’s no gold,  he complained loudly.  It’s only writing.    Aye,  said Tom,  and I’m sorry for that. But after the war, we mean to make that good, you have my word as a king’s man.   Arya pushed back from the table and got to her feet.  You’re no king’s men, you’re robbers.    If you’d ever met a true robber, you’d know they do not pay, not even in paper. It’s not for us we take your horses, child, it’s for the good of the realm, so we can get about more quickly and fight the fights that need fighting. The king’s fights. Would you deny the king?   They were all watching her; the Archer, big Lem, Husband with his sallow face and shifty eyes. Even Sharna, who stood in the door to the kitchen squinting. They are going to take our horses no matter what I say, she realized. We’ll need to walk to Riverrun, unless…  We don’t want paper.  Arya slapped the parchment out of Hot Pie’s hand.  You can have our horses for that boat outside. But only if you show us how to work it.   Tom Sevenstrings stared at her a moment, and then his wide homely mouth quirked into a rueful grin."
}