{
  "id": "df624a14b6850dd5c4b85057eaefe4875af424fd",
  "text": " Lord Walder took a cup of red himself, and raised it high with a spotted hand.  My guests,  he said.  My honored guests. Be welcome beneath my roof, and at my table.    We thank you for your hospitality, my lord,  Robb replied. Edmure echoed him, along with the Greatjon, Ser Marq Piper, and the others. They drank his wine and ate his bread and butter. Catelyn tasted the wine and nibbled at some bread, and felt much the better for it. Now we should be safe, she thought.  Knowing how petty the old man could be, she had expected their rooms to be bleak and cheerless. But the Freys had made more than ample provision for them, it seemed. The bridal chamber was large and richly appointed, dominated by a great featherbed with corner posts carved in the likeness of castle towers. Its draperies were Tully red and blue, a nice courtesy. Sweet-smelling carpets covered a plank floor, and a tall shuttered window opened to the south. Catelyn’s own room was smaller, but handsomely furnished and comfortable, with a fire burning in the hearth. Lame Lothar assured them that Robb would have an entire suite, as befit a king.  If there is anything you require, you need only tell one of the guards.  He bowed and withdrew, limping heavily as he made his way down the curving steps.   We should post our own guards,  Catelyn told her brother. She would rest easier with Stark and Tully men outside her door. The audience with Lord Walder had not been as painful as she feared, yet all the same she would be glad to be done with this. A few more days, and Robb will be off to battle, and me to a comfortable captivity at Seagard. Lord Jason would show her every courtesy, she had no doubt, but the prospect still depressed her.  She could hear the sounds of horses below as the long column of mounted men wound their way across the bridge from castle to castle. The stones rumbled to the passage of heavy-laden wayns. Catelyn went to the window and gazed out, to watch Robb’s host emerge from the eastern twin.  The rain seems to be lessening.    Now that we’re inside.  Edmure stood before the fire, letting the warmth wash over him.  What did you make of Roslin?   Too small and delicate. Childbirth will go hard on her. But her brother seemed well pleased with the girl, so all she said was,  Sweet.    I believe she liked me. Why was she crying?    She’s a maid on the eve of her wedding. A few tears are to be expected.  Lysa had wept lakes the morning of their own wedding, though she had managed to be dry-eyed and radiant when Jon Arryn swept his cream-and-blue cloak about her shoulders.   She’s prettier than I dared hope.  Edmure raised a hand before she could speak.  I know there are more important things, spare me the sermon, septa. Even so… did you see some of those other maids Frey trotted out? The one with the twitch? Was that the shaking sickness? And those twins had more craters and eruptions on their faces than Petyr Pimple. When I saw that lot, I knew Roslin would be bald and one-eyed, with Jinglebell’s wits and Black Walder’s temper. But she seems gentle as well as fair.  He looked perplexed,  Why would the old weasel refuse to let me choose unless he meant to foist off someone hideous?    Your fondness for a pretty face is well known,  Catelyn reminded him.  Perhaps Lord Walder actually wants you to be happy with your bride.  Or more like, he did not want you balking over a boil and upsetting all his plans.  Or it may be that Roslin is the old man’s favorite. The Lord of Riverrun is a much better match than most of his daughters can hope for.    True.  Her brother still seemed uncertain, however.  Is it possible the girl is barren?    Lord Walder wants his grandson to inherit Riverrun. How would it serve him to give you a barren wife?    It rids him of a daughter no one else would take.    Small good that will do him. Walder Frey is a peevish man, not a stupid one.    Still… it is possible?    Yes,  Catelyn conceded, reluctantly.  There are illnesses a girl can have in childhood that leave her unable to conceive. There’s no reason to believe that Lady Roslin was so afflicted, though.  She looked round the room.  The Freys have received us more kindly than I had anticipated, if truth be told.   Edmure laughed.  A few barbed words and some unseemly gloating. From him that’s courtesy. I expected the old weasel to piss in our wine and make us praise the vintage.   The jest left Catelyn strangely disquieted.  If you will excuse me, I should change from these wet clothes.    As you wish.  Edmure yawned.  I may nap an hour.   She retreated to her own room. The chest of clothes she’d brought from Riverrun had been carried up and laid at the foot of the bed. After she’d undressed and hung her wet clothing by the fire, she donned a warm wool dress of Tully red and blue, washed and brushed her hair and let it dry, and went in search of Freys.  Lord Walder’s black oak throne was empty when she entered the hall, but some of his sons were drinking by the fire."
}