{
  "id": "dfc936f127f3bed5f63d3e1e2aca07cd61dc1d67",
  "text": " Nor happy. Once out of Harrenhal, her usual pighead stubbornness had soon reasserted itself.  I want my arms and armor back,  she had insisted.  Oh, by all means, let us have you back in steel,  Jaime replied.  A helm, especially. We’ll all be happier if you keep your mouth shut and your visor down.   That much Brienne could do, but her sullen silences soon began to fray his good humor almost as much as Qyburn’s endless attempts to be ingratiating. I never thought I would find myself missing the company of Cleos Frey, gods help me. He was beginning to wish he had left her for the bear after all.   King’s Landing,  Jaime announced when he found her.  Our journey’s done, my lady. You’ve kept your vow, and delivered me to King’s Landing. All but a few fingers and a hand.   Brienne’s eyes were listless.  That was only half my vow. I told Lady Catelyn I would bring her back her daughters. Or Sansa, at the least. And now…   She never met Robb Stark, yet her grief for him runs deeper than mine for Joff. Or perhaps it was Lady Catelyn she mourned. They had been at Brindlewood when they had that news, from a red-faced tub of a knight named Ser Bertram Beesbury, whose arms were three beehives on a field striped black and yellow. A troop of Lord Piper’s men had passed through Brindlewood only yesterday, Beesbury told them, rushing to King’s Landing beneath a peace banner of their own.  With the Young Wolf dead Piper saw no point to fighting on. His son is captive at the Twins.  Brienne gaped like a cow about to choke on her cud, so it fell to Jaime to draw out the tale of the Red Wedding.   Every great lord has unruly bannermen who envy him his place,  he told her afterward.  My father had the Reynes and Tarbecks, the Tyrells have the Florents, Hoster Tully had Walder Frey. Only strength keeps such men in their place. The moment they smell weakness… during the Age of Heroes, the Boltons used to flay the Starks and wear their skins as cloaks.  She looked so miserable that Jaime almost found himself wanting to comfort her.  Since that day Brienne had been like one half-dead. Even calling her  wench  failed to provoke any response. The strength is gone from her. The woman had dropped a rock on Robin Ryger, battled a bear with a tourney sword, bitten off Vargo Hoat’s ear, and fought Jaime to exhaustion… but she was broken now, done.  I’ll speak to my father about returning you to Tarth, if it please you,  he told her.  Or if you would rather stay, I could perchance find some place for you at court.    As a lady companion to the queen?  she said dully.  Jaime remembered the sight of her in that pink satin gown, and tried not to imagine what his sister might say of such a companion.  Perhaps a post with the City Watch…    I will not serve with oathbreakers and murderers.   Then why did you ever bother putting on a sword? he might have said, but he bit back the words.  As you will, Brienne.  One-handed, he wheeled his horse about and left her.  The Gate of the Gods was open when they reached it, but two dozen wayns were lined up along the roadside, loaded with casks of cider, barrels of apples, bales of hay, and some of the biggest pumpkins Jaime had ever seen. Almost every wagon had its guards; men-at-arms wearing the badges of small lordlings, sellswords in mail and boiled leather, sometimes only a pink-cheeked farmer’s son clutching a homemade spear with a fire-hardened point. Jaime smiled at them all as he trotted past. At the gate, the gold cloaks were collecting coin from each driver before waving the wagons through.  What’s this?  Steelshanks demanded.   They got to pay for the right to sell inside the city. By command of the King’s Hand and the master of coin.   Jaime looked at the long line of wayns, carts, and laden horses.  Yet they still line up to pay?    There’s good coin to be made here now that the fighting’s done,  the miller in the nearest wagon told them cheerfully.  It’s the Lannisters hold the city now, old Lord Tywin of the Rock. They say he shits silver.    Gold,  Jaime corrected dryly.  And Littlefinger mints the stuff from goldenrod, I vow.    The Imp is master of coin now,  said the captain of the gate.  Or was, till they arrested him for murdering the king.  The man looked the northmen over suspiciously.  Who are you lot?    Lord Bolton’s men, come to see the King’s Hand.   The captain glanced at Nage with his peace banner.  Come to bend the knee, you mean. You’re not the first. Go straight up to the castle, and see you make no trouble.  He waved them through and turned back to the wagons.  If King’s Landing mourned its dead boy king, Jaime would never have known it. On the Street of Seeds a begging brother in threadbare robes was praying loudly for Joffrey’s soul, but the passersby paid him no more heed than they would a loose shutter banging in the wind. Elsewhere milled the usual crowds; gold cloaks in their black mail, bakers’ boys selling tarts and breads and hot pies, whores leaning out of windows with their bodices half unlaced, gutters redolent of nightsoil."
}