{
  "id": "dfd3dfaa69956ab1f904795719f9ee61d66a7c60",
  "text": "  A tenth part. In gold or silver coin, or ivory. Meereen has no need of saffron, cloves, or zorse hides.    It shall be done as you command, glorious queen,  said Daario.  My Stormcrows will collect your tenth.  if the Stormcrows saw to the collections at least half the gold would somehow go astray, Dany knew. But the Second Sons were just as bad, and the Unsullied were as unlettered as they were incorruptible.  Records must be kept,  she said.  Seek among the freedmen for men who can read, write, and do sums.   His business done, the captain of the Indigo Star bowed and took his leave. Dany shifted uncomfortably on the ebony bench. She dreaded what must come next, yet she knew she had put it off too long already. Yunkai and Astapor, threats of war, marriage proposals, the march west looming over all… I need my knights. I need their swords, and I need their counsel. Yet the thought of seeing Jorah Mormont again made her feel as if she’d swallowed a spoonful of flies; angry, agitated, sick. She could almost feel them buzzing round her belly. I am the blood of the dragon. I must be strong. I must have fire in my eyes when I face them, not tears.  Tell Belwas to bring my knights,  Dany commanded, before she could change her mind.  My good knights.   Strong Belwas was puffing from the climb when he marched them through the doors, one meaty hand wrapped tight around each man’s arm. Ser Barristan walked with his head held high, but Ser Jorah stared at the marble floor as he approached. The one is proud, the other guilty. The old man had shaved off his white beard. He looked ten years younger without it. But her balding bear looked older than he had. They halted before the bench. Strong Belwas stepped back and stood with his arms crossed across his scarred chest. Ser Jorah cleared his throat.  Khaleesi…   She had missed his voice so much, but she had to be stern.  Be quiet. I will tell you when to speak.  She stood.  When I sent you down into the sewers, part of me hoped I’d seen the last of you. It seemed a fitting end for liars, to drown in slavers’ filth. I thought the gods would deal with you, but instead you returned to me. My gallant knights of Westeros, an informer and a turncloak. My brother would have hanged you both.  Viserys, would have, anyway. She did not know what Rhaegar would have done.  I will admit you helped win me this city…   Ser Jorah’s mouth tightened.  We won you this city. We sewer rats.    Be quiet,  she said again… though there was truth to what he said. While Joso’s Cock and the other rams were battering the city gates and her archers were firing flights of flaming arrows over the walls, Dany had sent two hundred men along the river under cover of darkness to fire the hulks in the harbor. But that was only to hide their true purpose. As the flaming ships drew the eyes of the defenders on the walls, a few half-mad swimmers found the sewer mouths and pried loose a rusted iron grating. Ser Jorah, Ser Barristan, Strong Belwas, and twenty brave fools slipped beneath the brown water and up the brick tunnel, a mixed force of sellswords, Unsullied, and freedmen. Dany had told them to choose only men who had no families… and preferably no sense of smell.  They had been lucky as well as brave. It had been a moon’s turn since the last good rain, and the sewers were only thigh-high. The oilcloth they’d wrapped around their torches kept them dry, so they had light. A few of the freedmen were frightened of the huge rats until Strong Belwas caught one and bit it in two. One man was killed by a great pale lizard that reared up out of the dark water to drag him off by the leg, but when next ripples were spied Ser Jorah butchered the beast with his blade. They took some wrong turnings, but once they found the surface Strong Belwas led them to the nearest fighting pit, where they surprised a few guards and struck the chains off the slaves. Within an hour, half the fighting slaves in Meereen had risen.   You helped win this city,  she repeated stubbornly.  And you have served me well in the past. Ser Barristan saved me from the Titan’s Bastard, and from the Sorrowful Man in Qarth. Ser Jorah saved me from the poisoner in Vaes Dothrak, and again from Drogo’s bloodriders after my sun-and-stars had died.  So many people wanted her dead, sometimes she lost count.  And yet you lied, deceived me, betrayed me.  She turned to Ser Barristan.  You protected my father for many years, fought beside my brother on the Trident, but you abandoned Viserys in his exile and bent your knee to the Usurper instead. Why? And tell it true.    Some truths are hard to hear. Robert was a… a good knight… chivalrous, brave… he spared my life, and the lives of many others… Prince Viserys was only a boy, it would have been years before he was fit to rule, and… forgive me, my queen, but you asked for truth… even as a child, your brother Viserys oft seemed to be his father’s son, in ways that Rhaegar never did.    His father’s son?  Dany frowned."
}