{
  "id": "dfdad2af037e51ef8122da0b662e7af142dcafa9",
  "text": " When she did, a dozen yellow chicks escaped and began running in all directions.  Catch them!  Butterbumps exclaimed. Little Lady Bulwer snagged one and handed it to him, whereby he tilted back his head, popped it into his huge rubbery mouth, and seemed to swallow it whole. When he belched, tiny yellow feathers flew out his nose. Lady Bulwer began to wail in distress, but her tears turned into a sudden squeal of delight when the chick came squirming out of the sleeve of her gown and ran down her arm.  As the servants brought out a broth of leeks and mushrooms, Butterbumps began to juggle and Lady Olenna pushed herself forward to rest her elbows on the table.  Do you know my son, Sansa? Lord Puff Fish of Highgarden?    A great lord,  Sansa answered politely.   A great oaf,  said the Queen of Thorns.  His father was an oaf as well. My husband, the late Lord Luthor. Oh, I loved him well enough, don’t mistake me. A kind man, and not unskilled in the bedchamber, but an appalling oaf all the same. He managed to ride off a cliff whilst hawking. They say he was looking up at the sky and paying no mind to where his horse was taking him.   And now my oaf son is doing the same, only he’s riding a lion instead of a palfrey. It is easy to mount a lion and not so easy to get off, I warned him, but he only chuckles. Should you ever have a son, Sansa, beat him frequently so he learns to mind you. I only had the one boy and I hardly beat him at all, so now he pays more heed to Butterbumps than he does to me. A lion is not a lap cat, I told him, and he gives me a ‘tut-tut-Mother.’ There is entirely too much tut-tutting in this realm, if you ask me. All these kings would do a deal better if they would put down their swords and listen to their mothers.   Sansa realized that her mouth was open again. She filled it with a spoon of broth while Lady Alerie and the other women were giggling at the spectacle of Butterbumps bouncing oranges off his head, his elbows, and his ample rump.   I want you to tell me the truth about this royal boy,  said Lady Olenna abruptly.  This Joffrey.   Sansa’s fingers tightened round her spoon. The truth? I can’t. Don’t ask it, please, I can’t.  I… I… I…    You, yes. Who would know better? The lad seems kingly enough, I’ll grant you. A bit full of himself, but that would be his Lannister blood. We have heard some troubling tales, however. Is there any truth to them? Has this boy mistreated you?   Sansa glanced about nervously. Butterbumps popped a whole orange into his mouth, chewed and swallowed, slapped his cheek, and blew seeds out of his nose. The women giggled and laughed. Servants were coming and going, and the Maidenvault echoed to the clatter of spoons and plates. One of the chicks hopped back onto the table and ran through Lady Graceford’s broth. No one seemed to be paying them any mind, but even so, she was frightened.  Lady Olenna was growing impatient.  Why are you gaping at Butterbumps? I asked a question, I expect an answer. Have the Lannisters stolen your tongue, child?   Ser Dontos had warned her to speak freely only in the godswood.  Joff… King Joffrey, he’s… His Grace is very fair and handsome, and… and as brave as a lion.    Yes, all the Lannisters are lions, and when a Tyrell breaks wind it smells just like a rose,  the old woman snapped.  But how kind is he? How clever? Has he a good heart, a gentle hand? Is he chivalrous as befits a king? Will he cherish Margaery and treat her tenderly, protect her honor as he would his own?    He will,  Sansa lied.  He is very… very comely.    You said that. You know, child, some say that you are as big a fool as Butterbumps here, and I am starting to believe them. Comely? I have taught my Margaery what comely is worth, I hope. Somewhat less than a mummer’s fart. Aerion Brightfire was comely enough, but a monster all the same. The question is, what is Joffrey?  She reached to snag a passing servant.  I am not fond of leeks. Take this broth away, and bring me some cheese.    The cheese will be served after the cakes, my lady.    The cheese will be served when I want it served, and I want it served now.  The old woman turned back to Sansa.  Are you frightened, child? No need for that, we’re only women here. Tell me the truth, no harm will come to you.    My father always told the truth.  Sansa spoke quietly, but even so, it was hard to get the words out.   Lord Eddard, yes, he had that reputation, but they named him traitor and took his head off even so.  The old woman’s eyes bore into her, sharp and bright as the points of swords.   Joffrey,  Sansa said.  Joffrey did that. He promised me he would be merciful, and cut my father’s head off. He said that was mercy, and he took me up on the walls and made me look at it. The head. He wanted me to weep, but…  She stopped abruptly, and covered her mouth. I’ve said too much, oh gods be good, they’ll know, they’ll hear, someone will tell on me.   Go on.  It was Margaery who urged. Joffrey’s own queen-to-be."
}