{
  "id": "e012c20be7d91be01f66b7b6dbbd4d6b5d47b332",
  "text": "  Yes, I hoped the boy would die. So did you. Even Robert thought that would have been for the best. ‘We kill our horses when they break a leg, and our dogs when they go blind, but we are too weak to give the same mercy to crippled children,’ he told me. He was blind himself at the time, from drink.   Robert? Jaime had guarded the king long enough to know that Robert Baratheon said things in his cups that he would have denied angrily the next day.  Were you alone when Robert said this?    You don’t think he said it to Ned Stark, I hope? Of course we were alone. Us and the children.  Cersei removed her hairnet and draped it over a bedpost, then shook out her golden curls.  Perhaps Myrcella sent this man with the dagger, do you think so?   It was meant as mockery, but she’d cut right to the heart of it, Jaime saw at once.  Not Myrcella. Joffrey.   Cersei frowned.  Joffrey had no love for Robb Stark, but the younger boy was nothing to him. He was only a child himself .     A child hungry for a pat on the head from that sot you let him believe was his father.  He had an uncomfortable thought.  Tyrion almost died because of this bloody dagger. If he knew the whole thing was Joffrey’s work, that might be why…    I don’t care why,  Cersei said.  He can take his reasons down to hell with him. If you had seen how Joff died… he fought, Jaime, he fought for every breath, but it was as if some malign spirit had its hands about his throat. He had such terror in his eyes… When he was little, he’d run to me when he was scared or hurt and I would protect him. But that night there was nothing I could do. Tyrion murdered him in front of me, and there was nothing I could do.  Cersei sank to her knees before his chair and took Jaime’s good hand between both of hers.  Joff is dead and Myrcella’s in Dorne. Tommen’s all I have left. You mustn’t let Father take him from me. Jaime, please.    Lord Tywin has not asked for my approval. I can talk to him, but he will not listen…    He will if you agree to leave the Kingsguard.    I’m not leaving the Kingsguard.   His sister fought back tears.  Jaime, you’re my shining knight. You cannot abandon me when I need you most! He is stealing my son, sending me away… and unless you stop him, Father is going to force me to wed again!   Jaime should not have been surprised, but he was. The words were a blow to his gut harder than any that Ser Addam Marbrand had dealt him.  Who?    Does it matter? Some lord or other. Someone Father thinks he needs. I don’t care. I will not have another husband. You are the only man I want in my bed, ever again.    Then tell him that!   She pulled her hands away.  You are talking madness again. Would you have us ripped apart, as Mother did that time she caught us playing? Tommen would lose the throne, Myrcella her marriage… I want to be your wife, we belong to each other, but it can never be, Jaime. We are brother and sister.    The Targaryens…    We are not Targaryens!    Quiet,  he said, scornfully.  So loud, you’ll wake my Sworn Brothers. We can’t have that, now, can we? People might learn that you had come to see me.    Jaime,  she sobbed,  don’t you think I want it as much as you do? It makes no matter who they wed me to, I want you at my side, I want you in my bed, I want you inside me. Nothing has changed between us. Let me prove it to you.  She pushed up his tunic and began to fumble with the laces of his breeches.  Jaime felt himself responding.  No,  he said,  not here.  They had never done it in White Sword Tower, much less in the Lord Commander’s chambers.  Cersei, this is not the place.    You took me in the sept. This is no different.  She drew out his cock and bent her head over it.  Jaime pushed her away with the stump of his right hand.  No. Not here, I said.  He forced himself to stand.  For an instant he could see confusion in her bright green eyes, and fear as well. Then rage replaced it. Cersei gathered herself together, got to her feet, straightened her skirts.  Was it your hand they hacked off in Harrenhal, or your manhood?  As she shook her head, her hair tumbled around her bare white shoulders.  I was a fool to come. You lacked the courage to avenge Joffrey, why would I think that you’d protect Tommen? Tell me, if the Imp had killed all three of your children, would that have made you wroth?    Tyrion is not going to harm Tommen or Myrcella. I am still not certain he killed Joffrey.   Her mouth twisted in anger.  How can you say that? After all his threats—    Threats mean nothing. He swears he did not do it.    Oh, he swears, is that it? And dwarfs don’t lie, is that what you think?    Not to me. No more than you would.    You great golden fool. He’s lied to you a thousand times, and so have I.  She bound up her hair again, and scooped up the hairnet from the bedpost where she’d hung it.  Think what you will. The little monster is in a black cell, and soon Ser Ilyn will have his head off. Perhaps you’d like it for a keepsake.  She glanced at the pillow."
}