{
  "id": "e07dafcbaff00aa772b7b742605384ec6ae6a926",
  "text": "  Again,  said Jon, and,  Again,  and,  Again.  Other longbowmen were firing too, from every tower top in range, some sending their arrows up in high arcs to drop before the Wall. When Jon ran out of fire arrows, he and Satin began to light the torches and fling them from the crenels.  Up above another fire was blooming. The old wooden steps had drunk up oil like a sponge, and Donal Noye had drenched them from the ninth landing all the way down to the seventh. Jon could only hope that most of their own people had staggered up to safety before Noye threw the torches. The black brothers at least had known the plan, but the villagers had not.  Wind and fire did the rest. All Jon had to do was watch. With flames below and flames above, the wildlings had nowhere to go. Some continued upward, and died. Some went downward, and died. Some stayed where they were. They died as well. Many leapt from the steps before they burned, and died from the fall. Twenty-odd Thenns were still huddled together between the fires when the ice cracked from the heat, and the whole lower third of the stair broke off, along with several tons of ice. That was the last that Jon Snow saw of Styr, the Magnar of Thenn. The Wall defends itself, he thought.  Jon asked Satin to help him down to the yard. His wounded leg hurt so badly that he could hardly walk, even with the crutch.  Bring the torch,  he told the boy from Oldtown.  I need to look for someone.  It had been mostly Thenns on the steps. Surely some of the free folk had escaped. Mance’s people, not the Magnar’s. She might have been one. So they climbed down past the bodies of the men who’d tried the trapdoor, and Jon wandered through the dark with his crutch under one arm, and the other around the shoulders of a boy who’d been a whore in Oldtown.  The stables and the common hall had burned down to smoking cinders by then, but the fire still raged along the wall, climbing step by step and landing by landing. From time to time they’d hear a groan and then a craaaack, and another chunk would come crashing off the Wall. The air was full of ash and ice crystals.  He found Quort dead, and Stone Thumbs dying. He found some dead and dying Thenns he had never truly known. He found Big Boil, weak from all the blood he’d lost but still alive.  He found Ygritte sprawled across a patch of old snow beneath the Lord Commander’s Tower, with an arrow between her breasts. The ice crystals had settled over her face, and in the moonlight it looked as though she wore a glittering silver mask.  The arrow was black, Jon saw, but it was fletched with white duck feathers. Not mine, he told himself, not one of mine. But he felt as if it were.  When he knelt in the snow beside her, her eyes opened.  Jon Snow,  she said, very softly. It sounded as though the arrow had found a lung.  Is this a proper castle now? Not just a tower?    It is.  Jon took her hand.   Good,  she whispered.  I wanted t’ see one proper castle, before… before I…    You’ll see a hundred castles,  he promised her.  The battle’s done. Maester Aemon will see to you.  He touched her hair.  You’re kissed by fire, remember? Lucky. It will take more than an arrow to kill you. Aemon will draw it out and patch you up, and we’ll get you some milk of the poppy for the pain.   She just smiled at that.  D’you remember that cave? We should have stayed in that cave. I told you so.    We’ll go back to the cave,  he said.  You’re not going to die, Ygritte. You’re not.    Oh.  Ygritte cupped his cheek with her hand.  You know nothing, Jon Snow,  she sighed, dying.      Bran    It is only another empty castle,  Meera Reed said as she gazed across the desolation of rubble, ruins, and weeds.  No, thought Bran, it is the Nightfort, and this is the end of the world. In the mountains, all he could think of was reaching the Wall and finding the three-eyed crow, but now that they were here he was filled with fears. The dream he’d had… the dream Summer had had… No, I mustn’t think about that dream. He had not even told the Reeds, though Meera at least seemed to sense that something was wrong. If he never talked of it maybe he could forget he ever dreamed it, and then it wouldn’t have happened and Robb and Grey Wind would still be…   Hodor.  Hodor shifted his weight, and Bran with it. He was tired. They had been walking for hours. At least he’s not afraid. Bran was scared of this place, and almost as scared of admitting it to the Reeds. I’m a prince of the north, a Stark of Winterfell, almost a man grown, I have to be as brave as Robb.  Jojen gazed up at him with his dark green eyes.  There’s nothing here to hurt us, Your Grace.   Bran wasn’t so certain. The Nightfort had figured in some of Old Nan’s scariest stories. It was here that Night’s King had reigned, before his name was wiped from the memory of man. This was where the Rat Cook had served the Andal king his prince-and-bacon pie, where the seventy-nine sentinels stood their watch, where brave young Danny Flint had been raped and murdered."
}