{
  "id": "e0b51ef262269d69279943de61014e4911f40e45",
  "text": " All I need do is walk, Sam told himself, as he took that first step toward home. But before an hour was gone he had begun to struggle, and to lag…  They were lagging now as well, he saw. He remembered Pyp saying once how Small Paul was the strongest man in the Watch. He must be, to carry me. Yet even so, the snow was growing deeper, the ground more treacherous, and Paul’s strides had begun to shorten. More horsemen passed, wounded men who looked at Sam with dull incurious eyes. Some torch bearers went by as well.  You’re falling behind,  one told them. The next agreed.  No one’s like to wait for you, Paul. Leave the pig for the dead men.    He promised I could have a bird,  Small Paul said, even though Sam hadn’t, not truly. They aren’t mine to give.  I want me a bird that talks, and eats corn from my hand.    Bloody fool,  the torch man said. Then he was gone.  It was a while after when Grenn stopped suddenly.  We’re alone,  he said in a hoarse voice.  I can’t see the other torches. Was that the rear guard?   Small Paul had no answer for him. The big man gave a grunt and sank to his knees. His arms trembled as he lay Sam gently in the snow.  I can’t carry you no more. I would, but I can’t.  He shivered violently.  The wind sighed through the trees, driving a fine spray of snow into their faces. The cold was so bitter that Sam felt naked. He looked for the other torches, but they were gone, every one of them. There was only the one Grenn carried, the flames rising from it like pale orange silks. He could see through them, to the black beyond. That torch will burn out soon, he thought, and we are all alone, without food or friends or fire.  But that was wrong. They weren’t alone at all.  The lower branches of the great green sentinel shed their burden of snow with a soft wet plop. Grenn spun, thrusting out his torch.  Who goes there?  A horse’s head emerged from the darkness. Sam felt a moment’s relief, until he saw the horse. Hoarfrost covered it like a sheen of frozen sweat, and a nest of stiff black entrails dragged from its open belly. On its back was a rider pale as ice. Sam made a whimpery sound deep in his throat. He was so scared he might have pissed himself all over again, but the cold was in him, a cold so savage that his bladder felt frozen solid. The Other slid gracefully from the saddle to stand upon the snow. Sword-slim it was, and milky white. Its armor rippled and shifted as it moved, and its feet did not break the crust of the new-fallen snow.  Small Paul unslung the long-hafted axe strapped across his back.  Why’d you hurt that horse? That was Mawney’s horse.   Sam groped for the hilt of his sword, but the scabbard was empty. He had lost it on the Fist, he remembered too late.   Get away!  Grenn took a step, thrusting the torch out before him.  Away, or you burn.  He poked at it with the flames.  The Other’s sword gleamed with a faint blue glow. It moved toward Grenn, lightning quick, slashing. When the ice blue blade brushed the flames, a screech stabbed Sam’s ears sharp as a needle. The head of the torch tumbled sideways to vanish beneath a deep drift of snow, the fire snuffed out at once. And all Grenn held was a short wooden stick. He flung it at the Other, cursing, as Small Paul charged in with his axe.  The fear that filled Sam then was worse than any fear he had ever felt before, and Samwell Tarly knew every kind of fear.  Mother have mercy,  he wept, forgetting the old gods in his terror.  Father protect me, oh oh…  His fingers found his dagger and he filled his hand with that.  The wights had been slow clumsy things, but the Other was light as snow on the wind. It slid away from Paul’s axe, armor rippling, and its crystal sword twisted and spun and slipped between the iron rings of Paul’s mail, through leather and wool and bone and flesh. It came out his back with a hissssssssssss and Sam heard Paul say,  Oh,  as he lost the axe. Impaled, his blood smoking around the sword, the big man tried to reach his killer with his hands and almost had before he fell. The weight of him tore the strange pale sword from the Other’s grip.  Do it now. Stop crying and fight, you baby. Fight, craven. It was his father he heard, it was Alliser Thorne, it was his brother Dickon and the boy Rast. Craven, craven, craven. He giggled hysterically, wondering if they would make a wight of him, a huge fat white wight always tripping over its own dead feet. Do it, Sam. Was that Jon, now? Jon was dead. You can do it, you can, just do it. And then he was stumbling forward, falling more than running, really, closing his eyes and shoving the dagger blindly out before him with both hands. He heard a crack, like the sound ice makes when it breaks beneath a man’s foot, and then a screech so shrill and sharp that he went staggering backward with his hands over his muffled ears, and fell hard on his arse.  When he opened his eyes the Other’s armor was running down its legs in rivulets as pale blue blood hissed and steamed around the black dragonglass dagger in its throat."
}