{
  "id": "e1189cf135570b006290192de9755d7fbe661b6a",
  "text": "  Sit and talk with me.    You honor me.  The knight seated himself cross-legged on the cushion. A slave knelt before him, offering a wooden platter full of ripe figs. Ser Jorah took one and bit it in half.   Where is my brother?  Dany asked.  He ought to have come by now, for the feast.    I saw His Grace this morning,  he told her.  He told me he was going to the Western Market, in search of wine.    Wine?  Dany said doubtfully. Viserys could not abide the taste of the fermented mare’s milk the Dothraki drank, she knew that, and he was oft at the bazaars these days, drinking with the traders who came in the great caravans from east and west. He seemed to find their company more congenial than hers.   Wine,  Ser Jorah confirmed,  and he has some thought to recruit men for his army from the sellswords who guard the caravans.  A serving girl laid a blood pie in front of him, and he attacked it with both hands.   Is that wise?  she asked.  He has no gold to pay soldiers. What if he’s betrayed?  Caravan guards were seldom troubled much by thoughts of honor, and the Usurper in King’s Landing would pay well for her brother’s head.  You ought to have gone with him, to keep him safe. You are his sworn sword.    We are in Vaes Dothrak,  he reminded her.  No one may carry a blade here or shed a man’s blood.    Yet men die,  she said.  Jhogo told me. Some of the traders have eunuchs with them, huge men who strangle thieves with wisps of silk. That way no blood is shed and the gods are not angered.    Then let us hope your brother will be wise enough not to steal anything.  Ser Jorah wiped the grease off his mouth with the back of his hand and leaned close over the table.  He had planned to take your dragon’s eggs, until I warned him that I’d cut off his hand if he so much as touched them.   For a moment Dany was so shocked she had no words.  My eggs… but they’re mine, Magister Illyrio gave them to me, a bride gift, why would Viserys want… they’re only stones…    The same could be said of rubies and diamonds and fire opals, Princess… and dragon’s eggs are rarer by far. Those traders he’s been drinking with would sell their own manhoods for even one of those stones, and with all three Viserys could buy as many sellswords as he might need.   Dany had not known, had not even suspected.  Then… he should have them. He does not need to steal them. He had only to ask. He is my brother… and my true king.    He is your brother,  Ser Jorah acknowledged.   You do not understand, ser,  she said.  My mother died giving me birth, and my father and my brother Rhaegar even before that. I would never have known so much as their names if Viserys had not been there to tell me. He was the only one left. The only one. He is all I have.    Once,  said Ser Jorah.  No longer, Khaleesi. You belong to the Dothraki now. In your womb rides the stallion who mounts the world.  He held out his cup, and a slave filled it with fermented mare’s milk, sour-smelling and thick with clots.  Dany waved her away. Even the smell of it made her feel ill, and she would take no chances of bringing up the horse heart she had forced herself to eat.  What does it mean?  she asked.  What is this stallion? Everyone was shouting it at me, but I don’t understand.    The stallion is the khal of khals promised in ancient prophecy, child. He will unite the Dothraki into a single khalasar and ride to the ends of the earth, or so it was promised. All the people of the world will be his herd.    Oh,  Dany said in a small voice. Her hand smoothed her robe down over the swell of her stomach.  I named him Rhaego.    A name to make the Usurper’s blood run cold.   Suddenly Doreah was tugging at her elbow.  My lady,  the handmaid whispered urgently,  your brother…   Dany looked down the length of the long, roofless hall and there he was, striding toward her. From the lurch in his step, she could tell at once that Viserys had found his wine… and something that passed for courage.  He was wearing his scarlet silks, soiled and travel-stained. His cloak and gloves were black velvet, faded from the sun. His boots were dry and cracked, his silver-blond hair matted and tangled. A longsword swung from his belt in a leather scabbard. The Dothraki eyed the sword as he passed; Dany heard curses and threats and angry muttering rising all around her, like a tide. The music died away in a nervous stammering of drums.  A sense of dread closed around her heart.  Go to him,  she commanded Ser Jorah.  Stop him. Bring him here. Tell him he can have the dragon’s eggs if that is what he wants.  The knight rose swiftly to his feet.   Where is my sister?  Viserys shouted, his voice thick with wine.  I’ve come for her feast. How dare you presume to eat without me? No one eats before the king. Where is she? The whore can’t hide from the dragon.   He stopped beside the largest of the three firepits, peering around at the faces of the Dothraki. There were five thousand men in the hall, but only a handful who knew the Common Tongue."
}