{
  "id": "e1265b590e3a2dcd063dc7d68a401b2667e695b7",
  "text": " I don’t know what to do with him.  He paused a moment, chewing on his lower lip the way he’d done when he was little.  Mother, I need you too. I’m trying but I can’t… I can’t do it all by myself.  His voice broke with sudden emotion, and Catelyn remembered that he was only fourteen. She wanted to get up and go to him, but Bran was still holding her hand and she could not move.  Outside the tower, a wolf began to howl. Catelyn trembled, just for a second.   Bran’s.  Robb opened the window and let the night air into the stuffy tower room. The howling grew louder. It was a cold and lonely sound, full of melancholy and despair.   Don’t,  she told him.  Bran needs to stay warm.    He needs to hear them sing,  Robb said. Somewhere out in Winterfell, a second wolf began to howl in chorus with the first. Then a third, closer.  Shaggydog and Grey Wind,  Robb said as their voices rose and fell together.  You can tell them apart if you listen close.   Catelyn was shaking. It was the grief, the cold, the howling of the direwolves. Night after night, the howling and the cold wind and the grey empty castle, on and on they went, never changing, and her boy lying there broken, the sweetest of her children, the gentlest, Bran who loved to laugh and climb and dreamt of knighthood, all gone now, she would never hear him laugh again. Sobbing, she pulled her hand free of his and covered her ears against those terrible howls.  Make them stop!  she cried.  I can’t stand it, make them stop, make them stop, kill them all if you must, just make them stop!   She didn’t remember falling to the floor, but there she was, and Robb was lifting her, holding her in strong arms.  Don’t be afraid, Mother. They would never hurt him.  He helped her to her narrow bed in the corner of the sickroom.  Close your eyes,  he said gently.  Rest. Maester Luwin tells me you’ve hardly slept since Bran’s fall.    I can’t,  she wept.  Gods forgive me, Robb, I can’t, what if he dies while I’m asleep, what if he dies, what if he dies…  The wolves were still howling. She screamed and held her ears again.  Oh, gods, close the window!    If you swear to me you’ll sleep.  Robb went to the window, but as he reached for the shutters another sound was added to the mournful howling of the direwolves.  Dogs,  he said, listening.  All the dogs are barking. They’ve never done that before…  Catelyn heard his breath catch in his throat. When she looked up, his face was pale in the lamplight.  Fire,  he whispered.  Fire, she thought, and then, Bran!  Help me,  she said urgently, sitting up.  Help me with Bran.   Robb did not seem to hear her.  The library tower’s on fire,  he said.  Catelyn could see the flickering reddish light through the open window now. She sagged with relief. Bran was safe. The library was across the bailey, there was no way the fire would reach them here.  Thank the gods,  she whispered.  Robb looked at her as if she’d gone mad.  Mother, stay here. I’ll come back as soon as the fire’s out.  He ran then. She heard him shout to the guards outside the room, heard them descending together in a wild rush, taking the stairs two and three at a time.  Outside, there were shouts of  Fire!  in the yard, screams, running footsteps, the whinny of frightened horses, and the frantic barking of the castle dogs. The howling was gone, she realized as she listened to the cacophony. The direwolves had fallen silent.  Catelyn said a silent prayer of thanks to the seven faces of god as she went to the window. Across the bailey, long tongues of flame shot from the windows of the library. She watched the smoke rise into the sky and thought sadly of all the books the Starks had gathered over the centuries. Then she closed the shutters.  When she turned away from the window, the man was in the room with her.   You weren’t s’posed to be here,  he muttered sourly.  No one was s’posed to be here.   He was a small, dirty man in filthy brown clothing, and he stank of horses. Catelyn knew all the men who worked in their stables, and he was none of them. He was gaunt, with limp blond hair and pale eyes deep-sunk in a bony face, and there was a dagger in his hand.  Catelyn looked at the knife, then at Bran.  No,  she said. The word stuck in her throat, the merest whisper.  He must have heard her.  It’s a mercy,  he said.  He’s dead already.    No,  Catelyn said, louder now as she found her voice again.  No, you can’t.  She spun back toward the window to scream for help, but the man moved faster than she would have believed. One hand clamped down over her mouth and yanked back her head, the other brought the dagger up to her windpipe. The stench of him was overwhelming.  She reached up with both hands and grabbed the blade with all her strength, pulling it away from her throat. She heard him cursing into her ear. Her fingers were slippery with blood, but she would not let go of the dagger. The hand over her mouth clenched more tightly, shutting off her air. Catelyn twisted her head to the side and managed to get a piece of his flesh between her teeth."
}