{
  "id": "e15879b842161283e287fcf07b69071998281244",
  "text": "    Gods save us,  Lord Lefford swore.   Greatjon Umber fired the siege towers we were building, and Lord Blackwood found Ser Edmure Tully in chains among the other captives, and made off with them all. Our south camp was under the command of Ser Forley Prester. He retreated in good order when he saw that the other camps were lost, with two thousand spears and as many bowmen, but the Tyroshi sellsword who led his freeriders struck his banners and went over to the foe.    Curse the man.  His uncle Kevan sounded more angry than surprised.  I warned Jaime not to trust that one. A man who fights for coin is loyal only to his purse.   Lord Tywin wove his fingers together under his chin. Only his eyes moved as he listened. His bristling golden side-whiskers framed a face so still it might have been a mask, but Tyrion could see tiny beads of sweat dappling his father’s shaven head.   How could it happen?  Ser Harys Swyft wailed again.  Ser Jaime taken, the siege broken… this is a catastrophe!   Ser Addam Marbrand said,  I am sure we are all grateful to you for pointing out the obvious, Ser Harys. The question is, what shall we do about it?    What can we do? Jaime’s host is all slaughtered or taken or put to flight, and the Starks and the Tullys sit squarely across our line of supply. We are cut off from the west! They can march on Casterly Rock if they so choose, and what’s to stop them? My lords, we are beaten. We must sue for peace.    Peace?  Tyrion swirled his wine thoughtfully, took a deep draft, and hurled his empty cup to the floor, where it shattered into a thousand pieces.  There’s your peace, Ser Harys. My sweet nephew broke it for good and all when he decided to ornament the Red Keep with Lord Eddard’s head. You’ll have an easier time drinking wine from that cup than you will convincing Robb Stark to make peace now. He’s winning… or hadn’t you noticed?    Two battles do not make a war,  Ser Addam insisted.  We are far from lost. I should welcome the chance to try my own steel against this Stark boy.    Perhaps they would consent to a truce, and allow us to trade our prisoners for theirs,  offered Lord Lefford.   Unless they trade three-for-one, we still come out light on those scales,  Tyrion said acidly.  And what are we to offer for my brother? Lord Eddard’s rotting head?    I had heard that Queen Cersei has the Hand’s daughters,  Lefford said hopefully.  If we give the lad his sisters back…   Ser Addam snorted disdainfully.  He would have to be an utter ass to trade Jaime Lannister’s life for two girls.    Then we must ransom Ser Jaime, whatever it costs,  Lord Lefford said.  Tyrion rolled his eyes.  If the Starks feel the need for gold, they can melt down Jaime’s armor.    if we ask for a truce, they will think us weak,  Ser Addarn argued.  We should march on them at once.    Surely our friends at court could be prevailed upon to join us with fresh troops,  said Ser Harys.  And someone might return to Casterly Rock to raise a new host.   Lord Tywin Lannister rose to his feet.  They have my son,  he said once more, in a voice that cut through the babble like a sword through suet.  Leave me. All of you.   Ever the soul of obedience, Tyrion rose to depart with the rest, but his father gave him a look.  Not you, Tyrion. Remain. And you as well, Kevan. The rest of you, out.   Tyrion eased himself back onto the bench, startled into speechlessness. Ser Kevan crossed the room to the wine casks.  Uncle,  Tyrion called,  if you would be so kind—    Here.  His father offered him his cup, the wine untouched.  Now Tyrion truly was nonplussed. He drank.  Lord Tywin seated himself.  You have the right of it about Stark. Alive, we might have used Lord Eddard to forge a peace with Winterfell and Riverrun, a peace that would have given us the time we need to deal with Robert’s brothers. Dead…  His hand curled into a fist.  Madness. Rank madness.    Joff’s only a boy,  Tyrion pointed out.  At his age, I committed a few follies of my own.   His father gave him a sharp look.  I suppose we ought to be grateful that he has not yet married a whore.   Tyrion sipped at his wine, wondering how Lord Tywin would look if he flung the cup in his face.   Our position is worse than you know,  his father went on.  It would seem we have a new king.   Ser Kevan looked poleaxed.  A new—who? What have they done to Joffrey?   The faintest flicker of distaste played across Lord Tywin’s thin lips.  Nothing… yet. My grandson still sits the Iron Throne, but the eunuch has heard whispers from the south. Renly Baratheon wed Margaery Tyrell at Highgarden this fortnight past, and now he has claimed the crown. The bride’s father and brothers have bent the knee and sworn him their swords.    Those are grave tidings.  When Ser Kevan frowned, the furrows in his brow grew deep as canyons.   My daughter commands us to ride for King’s Landing at once, to defend the Red Keep against King Renly and the Knight of Flowers.  His mouth tightened.  Commands us, mind you."
}