{
  "id": "e192d71076bd5a6ff1db45b6892eca639c632540",
  "text": " She saw two destriers collide in full armor, going down in a tangle of steel and horseflesh.  A tourney,  Hal Mollen declared. He had a penchant for loudly announcing the obvious.   Oh, splendid,  Ser Wendel Manderly said as a knight in a rainbow-striped cloak wheeled to deliver a backhand blow with a long-handled axe that shattered the shield of the man pursuing him and sent him reeling in his stirrups.  The press in front of them made further progress difficult.  Lady Stark,  Ser Colen said,  if your men would be so good as to wait here, I’ll present you to the king.    As you say.  She gave the command, though she had to raise her voice to be heard above the tourney din. Ser Colen walked his horse slowly through the throngs, with Catelyn riding in his wake. A roar went up from the crowd as a helmetless red-bearded man with a griffin on his shield went down before a big knight in blue armor. His steel was a deep cobalt, even the blunt morningstar he wielded with such deadly effect, his mount barded in the quartered sun-and-moon heraldry of House Tarth.   Red Ronnet’s down, gods be damned,  a man cursed.   Loras’ll do for that blue—  a companion answered before a roar drowned out the rest of his words.  Another man was fallen, trapped beneath his injured horse, both of them screaming in pain. Squires rushed out to aid them.  This is madness, Catelyn thought. Real enemies on every side and half the realm in flames, and Renly sits here playing at war like a boy with his first wooden sword.  The lords and ladies in the gallery were as engrossed in the melee as the men on the ground. Catelyn marked them well. Her father had oft treated with the southron lords, and not a few had been guests at Riverrun. She recognized Lord Mathis Rowan, stouter and more florid than ever, the golden tree of his House spread across his white doublet. Below him sat Lady Oakheart, tiny and delicate, and to her left Lord Randyll Tarly of Horn Hill, his greatsword Heartsbane propped up against the back of his seat. Others she knew only by their sigils, and some not at all.  In their midst, watching and laughing with his young queen by his side, sat a ghost in a golden crown.  Small wonder the lords gather around him with such fervor, she thought, he is Robert come again. Renly was handsome as Robert had been handsome; long of limb and broad of shoulder, with the same coal-black hair, fine and straight, the same deep blue eyes, the same easy smile. The slender circlet around his brows seemed to suit him well. It was soft gold, a ring of roses exquisitely wrought; at the front lifted a stag’s head of dark green jade, adorned with golden eyes and golden antlers.  The crowned stag decorated the king’s green velvet tunic as well, worked in gold thread upon his chest; the Baratheon sigil in the colors of Highgarden. The girl who shared the high seat with him was also of Highgarden: his young queen, Margaery, daughter to Lord Mace Tyrell. Their marriage was the mortar that held the great southron alliance together, Catelyn knew. Renly was one-and-twenty, the girl no older than Robb, very pretty, with a doe’s soft eyes and a mane of curling brown hair that fell about her shoulders in lazy ringlets. Her smile was shy and sweet.  Out in the field, another man lost his seat to the knight in the rainbow-striped cloak, and the king shouted approval with the rest.  Loras!  she heard him call.  Loras! Highgarden!  The queen clapped her hands together in excitement.  Catelyn turned to see the end of it. Only four men were left in the fight now, and there was small doubt whom king and commons favored. She had never met Ser Loras Tyrell, but even in the distant north one heard tales of the prowess of the young Knight of Flowers. Ser Loras rode a tall white stallion in silver mail, and fought with a long-handled axe. A crest of golden roses ran down the center of his helm.  Two of the other survivors had made common cause. They spurred their mounts toward the knight in the cobalt armor. As they closed to either side, the blue knight reined hard, smashing one man full in the face with his splintered shield while his black destrier lashed out with a steel-shod hoof at the other. In a blink, one combatant was unhorsed, the other reeling. The blue knight let his broken shield drop to the ground to free his left arm, and then the Knight of Flowers was on him. The weight of his steel seemed to hardly diminish the grace and quickness with which Ser Loras moved, his rainbow cloak swirling about him.  The white horse and the black one wheeled like lovers at a harvest dance, the riders throwing steel in place of kisses. Longaxe flashed and morningstar whirled. Both weapons were blunted, yet still they raised an awful clangor. Shieldless, the blue knight was getting much the worse of it. Ser Loras rained down blows on his head and shoulders, to shouts of  Highgarden!  from the throng. The other gave answer with his morningstar, but whenever the ball came crashing in, Ser Loras interposed his battered green shield, emblazoned with three golden roses."
}