{
  "id": "e28a5fa316a3745ee09acf553a20372b85d42ebd",
  "text": " When the longaxe caught the blue knight’s hand on the backswing and sent the morningstar flying from his grasp, the crowd screamed like a rutting beast. The Knight of Flowers raised his axe for the final blow.  The blue knight charged into it. The stallions slammed together, the blunted axehead smashed against the scarred blue breastplate… but somehow the blue knight had the haft locked between steel-gauntleted fingers. He wrenched it from Ser Loras’s hand, and suddenly the two were grappling mount-to-mount, and an instant later they were falling. As their horses pulled apart, they crashed to the ground with bone-jarring force. Loras Tyrell, on the bottom, took the brunt of the impact. The blue knight pulled a long dirk free and flicked open Tyrell’s visor. The roar of the crowd was too loud for Catelyn to hear what Ser Loras said, but she saw the word form on his split, bloody lips. Yield.  The blue knight climbed unsteady to his feet, and raised his dirk in the direction of Renly Baratheon, the salute of a champion to his king. Squires dashed onto the field to help the vanquished knight to his feet. When they got his helm off, Catelyn was startled to see how young he was. He could not have had more than two years on Robb. The boy might have been as comely as his sister, but the broken lip, unfocused eyes, and blood trickling through his matted hair made it hard to be certain.   Approach,  King Renly called to the champion.  He limped toward the gallery. At close hand, the brilliant blue armor looked rather less splendid; everywhere it showed scars, the dents of mace and warhammer, the long gouges left by swords, chips in the enameled breastplate and helm. His cloak hung in rags. From the way he moved, the man within was no less battered. A few voices hailed him with cries of  Tarth!  and, oddly,  A Beauty! A Beauty!  but most were silent. The blue knight knelt before the king.  Grace,  he said, his voice muffled by his dented greathelm.   You are all your lord father claimed you were.  Renly’s voice carried over the field.  I’ve seen Ser Loras unhorsed once or twice… but never quite in that fashion.    That were no proper unhorsing,  complained a drunken archer nearby, a Tyrell rose sewn on his jerkin.  A vile trick, pulling the lad down.   The press had begun to open up.  Ser Colen,  Catelyn said to her escort,  who is this man, and why do they mislike him so?   Ser Colen frowned.  Because he is no man, my lady. That’s Brienne of Tarth, daughter to Lord Selwyn the Evenstar.    Daughter?  Catelyn was horrified.   Brienne the Beauty, they name her… though not to her face, lest they be called upon to defend those words with their bodies.   She heard King Renly declare the Lady Brienne of Tarth the victor of the great melee at Bitterbridge, last mounted of one hundred sixteen knights.  As champion, you may ask of me any boon that you desire. If it lies in my power, it is yours.    Your Grace,  Brienne answered,  I ask the honor of a place among your Rainbow Guard. I would be one of your seven, and pledge my life to yours, to go where you go, ride at your side, and keep you safe from all hurt and harm.    Done,  he said.  Rise, and remove your helm.   She did as he bid her. And when the greathelm was lifted, Catelyn understood Ser Colen’s words.  Beauty, they called her… mocking. The hair beneath the visor was a squirrel’s nest of dirty straw, and her face… Brienne’s eyes were large and very blue, a young girl’s eyes, trusting and guileless, but the rest… her features were broad and coarse, her teeth prominent and crooked, her mouth too wide, her lips so plump they seemed swollen. A thousand freckles speckled her cheeks and brow, and her nose had been broken more than once. Pity filled Catelyn’s heart. Is there any creature on earth as unfortunate as an ugly woman?  And yet, when Renly cut away her torn cloak and fastened a rainbow in its place, Brienne of Tarth did not look unfortunate. Her smile lit up her face, and her voice was strong and proud as she said,  My life for yours, Your Grace. From this day on, I am your shield, I swear it by the old gods and the new.  The way she looked at the king—looked down at him, she was a good hand higher, though Renly was near as tall as his brother had been—was painful to see.   Your Grace!  Ser Colen of Greenpools swung down off his horse to approach the gallery.  I beg your leave.  He went to one knee.  I have the honor to bring you the Lady Catelyn Stark, sent as envoy by her son Robb, Lord of Winterfell.    Lord of Winterfell and King in the North, ser,  Catelyn corrected him. She dismounted and moved to Ser Colen’s side.  King Renly looked surprised.  Lady Catelyn? We are most pleased.  He turned to his young queen.  Margaery my sweet, this is the Lady Catelyn Stark of Winterfell.    You are most welcome here, Lady Stark,  the girl said, all soft courtesy.  I am sorry for your loss.    You are kind,  said Catelyn.   My lady, I swear to you, I will see that the Lannisters answer for your husband’s murder,  the king declared."
}