{
  "id": "e2dacd5a02c0c9d0c2c931209fa840fef4225078",
  "text": " In the end only six hundred of them remained… but more than twelve thousand Dothraki lay dead upon that field, including Khal Temmo, his bloodriders, his kos, and all his sons. On the morning of the fourth day, the new khal led the survivors past the city gates in a stately procession. One by one, each man cut off his braid and threw it down before the feet of the Three Thousand.   Since that day, the city guard of Qohor has been made up solely of Unsullied, every one of whom carries a tall spear from which hangs a braid of human hair.   That is what you will find in Astapor, Your Grace. Put ashore there, and continue on to Pentos overland. It will take longer, yes… but when you break bread with Magister Illyrio, you will have a thousand swords behind you, not just four.   There is wisdom in this, yes, Dany thought, but…  How am I to buy a thousand slave soldiers? All I have of value is the crown the Tourmaline Brotherhood gave me.    Dragons will be as great a wonder in Astapor as they were in Qarth. It may be that the slavers will shower you with gifts, as the Qartheen did. If not… these ships carry more than your Dothraki and their horses. They took on trade goods at Qarth, I’ve been through the holds and seen for myself. Bolts of silk and bales of tiger skin, amber and jade carvings, saffron, myrrh… slaves are cheap, Your Grace. Tiger skins are costly.    Those are Illyrio’s tiger skins,  she objected.   And Illyrio is a friend to House Targaryen.    All the more reason not to steal his goods.    What use are wealthy friends if they will not put their wealth at your disposal, my queen? If Magister Illyrio would deny you, he is only Xaro Xhoan Daxos with four chins. And if he is sincere in his devotion to your cause, he will not begrudge you three shiploads of trade goods. What better use for his tiger skins than to buy you the beginnings of an army?   That’s true. Dany felt a rising excitement.  There will be dangers on such a long march…    There are dangers at sea as well. Corsairs and pirates hunt the southern route, and north of Valyria the Smoking Sea is demon-haunted. The next storm could sink or scatter us, a kraken could pull us under… or we might find ourselves becalmed again, and die of thirst as we wait for the wind to rise. A march will have different dangers, my queen, but none greater.    What if Captain Groleo refuses to change course, though? And Arstan, Strong Belwas, what will they do?   Ser Jorah stood.  Perhaps it’s time you found that out.    Yes,  she decided.  I’ll do it!  Dany threw back the coverlets and hopped from the bunk.  I’ll see the captain at once, command him to set course for Astapor.  She bent over her chest, threw open the lid, and seized the first garment to hand, a pair of loose sandsilk trousers.  Hand me my medallion belt,  she commanded Jorah as she pulled the sandsilk up over her hips.  And my vest—  she started to say, turning.  Ser Jorah slid his arms around her.   Oh,  was all Dany had time to say as he pulled her close and pressed his lips down on hers. He smelled of sweat and salt and leather, and the iron studs on his jerkin dug into her naked breasts as he crushed her hard against him. One hand held her by the shoulder while the other slid down her spine to the small of her back, and her mouth opened for his tongue, though she never told it to. His beard is scratchy, she thought, but his mouth is sweet. The Dothraki wore no beards, only long mustaches, and only Khal Drogo had ever kissed her before. He should not be doing this. I am his queen, not his woman.  It was a long kiss, though how long Dany could not have said. When it ended, Ser Jorah let go of her, and she took a quick step backward.  You… you should not have…    I should not have waited so Iong,  he finished for her.  I should have kissed you in Qarth, in Vaes Tolorru. I should have kissed you in the red waste, every night and every day. You were made to be kissed, often and well.  His eyes were on her breasts.  Dany covered them with her hands, before her nipples could betray her.  I… that was not fitting. I am your queen.    My queen,  he said,  and the bravest, sweetest, and most beautiful woman I have ever seen. Daenerys—    Your Grace!    Your Grace,  he conceded,  the dragon has three heads, remember? You have wondered at that, ever since you heard it from the warlocks in the House of Dust. Well, here’s your meaning: Balerion, Meraxes, and Vhagar, ridden by Aegon, Rhaenys, and Visenya. The three-headed dragon of House Targaryen—three dragons, and three riders.    Yes,  said Dany,  but my brothers are dead.    Rhaenys and Visenya were Aegon’s wives as well as his sisters. You have no brothers, but you can take husbands. And I tell you truly, Daenerys, there is no man in all the world who will ever be half so true to you as me.       Bran   The ridge slanted sharply from the earth, a long fold of stone and soil shaped like a claw. Trees clung to its lower slopes, pines and hawthorn and ash, but higher up the ground was bare, the ridgeline stark against the cloudy sky."
}