{
  "id": "e438ed35c515e845df9521b3e93c35a3156fbfed",
  "text": "\"  Ron seized his knife, pulled Malfoy's roots toward him, and began to chop them roughly, so that they were all different sizes.  \"Professor,\" drawled Malfoy, \"Weasley's mutilating my roots, sit.\"  Snape approached their table, stared down his hooked nose at the roots, then gave Ron an unpleasant smile from beneath his long, greasy black hair.  \"Change roots with Malfoy, Weasley.\"  \"But, sit --!\"  Ron had spent the last quarter of an hour carefully shredding his own roots into exactly equal pieces.  \"Now,\" said Snape in his most dangerous voice.  Ron shoved his own beautifully cut roots across the table a, Malfoy, then took up the knife again.  \"And, sir, I'll need this shrivelfig skinned,\" said Malfoy, his voice full of malicious laughter.  \"Potter, you can skin Malfoy's shrivelfig,\" said Snape, giving Harry the look of loathing he always reserved just for him.  Harry took Malfoy's shrivelfig as Ron began trying to repair the damage to the roots he now had to use. Harry skinned the shrivelfig as fast as he could and flung it back across the table at Malfoy without speaking. Malfoy was smirking more broadly than ever.  \"Seen your pal Hagrid lately?\" he asked them quietly.  \"None of your business,\" said Ron jerkily, without looking up.  \"I'm afraid he won't be a teacher much longer,\" said Malfoy in a tone of mock sorrow. \"Father's not very happy about my injury --\"  \"Keep talking, Malfoy, and I'll give you a real injury,\" snarled Ron.  \"- he's complained to the school governors. And to the Ministry of Magic. Father's got a lot of influence, you know. And a lasting injury like this\" -- he gave a huge, fake sigh -- \"who knows if my arm'll ever be the same again?\"  \"So that's why you're putting it on,\" said Harry, accidentally beheading a dead caterpillar because his hand was shaking in anger. \"To try to get Hagrid fired.\"  \"Well,\" said Malfoy, lowering his voice to a whisper, \"partly, Potter. But there are other benefits too. Weasley, slice my caterpillars for me.\"  A few cauldrons away, Neville was in trouble. Neville regularly went to pieces in Potions lessons; it was his worst subject, and his great fear of Professor Snape made things ten times worse. His potion, which was supposed to be a bright, acid green, had turned --  \"Orange, Longbottom,\" said Snape, ladling some up and allowing to splash back into the cauldron, so that everyone could see.  \"Orange. Tell me, boy, does anything penetrate that thick skull of yours? Didn't you hear me say, quite clearly, that only one -tat spleen was needed? Didn't I state plainly that a dash of leech juice would suffice? What do I have to do to make you understand, Longbottom?\"  Neville was pink and trembling. He looked as though he was on the verge of tears.  \"Please, sir,\" said Hermione, \"please, I could help Neville put it right --\"  \"I don't remember asking you to show off, Miss Granger,\" said Snape coldly, and Hermione went as pink as Neville. \"Longbottom, at the end of this lesson we will feed a few drops of this potion to your toad and see what happens. Perhaps that will encourage you to do it properly.\"  Snape moved away, leaving Neville breathless with fear.  \"Help me!\" he moaned to Hermione.  \"Hey, Harry,\" said Seamus Finnigan, leaning over to borrow Harry's brass scales, \"have you heard? Daily Prophet this morning -- they reckon Sirius Black's been sighted.\"  \"Where?\" said Harry and Ron quickly. On the other side of the table, Malfoy looked up, listening closely.  \"Not too far from here,\" said Seamus, who looked excited. \"It was a Muggle who saw him. 'Course, she didn't really understand. The Muggles think he's just an ordinary criminal, don't they? So she phoned the telephone hot line. By the time the Ministry of Magic got there, he was gone.\"  \"Not too far from here... \" Ron repeated, looking significantly at Harry. He turned around and saw Malfoy watching closely. \"What, Malfoy? Need something else skinned?\"  But Malfoy's eyes were shining malevolently, and they were fixed Harry. He leaned across the table.  Black single-handed, Potter?\"  \"Thinking Of trying to catch  \"Yeah, that's right,\" said Harry offhandedly.  Malfoys thin mouth was curving in a mean smile.  \"Of course, if it was me,\" he said quietly, \"I'd have done something before now. I wouldn't be staying in school like a good boy, I'd be out there looking for him.\"  \"What are you talking about, Malfoy?\" said Ron roughly.  \"Don't you know, Potter?\" breathed Malfoy, his pate eyes narrowed.  \"Know what?\"  Malfoy let out a low, sneering laugh.  \"Maybe you'd rather not risk your neck,\" he said. \"Want to leave it to the dementors, do you? But if it was me, I'd want revenge. I'd hunt him down myself.\"  \"What are you talking about?\" said Harry angrily, but at that moment Snape called, \"You should have finished adding your ingredients by now; this potion needs to stew before it can be drunk, so clear away while it simmers and then we'll test Longbottom's... \"  Crabbe and Goyle laughed openly, watching Neville sweat as he stirred his potion feverishly."
}