{
  "id": "e4572ffdfbb90d634c59c8eb637e76b0085443d0",
  "text": "\"  \"This way,\" said Harry, pointing down a stone passageway, which was the only way forward.  All they could hear apart from their footsteps was the gentle drip of water trickling down the walls. The passageway sloped downward, and Harry was reminded of Gringotts. With an unpleasant jolt of the heart, he remembered the dragons said to be guarding vaults in the wizards' bank. If they met a dragon, a fully-grown dragon -- Norbert had been bad enough...  \"Can you hear something?\" Ron whispered.  Harry listened. A soft rustling and clinking seemed to be coming from up ahead.  \"Do you think it's a ghost?\"  \"I don't know... sounds like wings to me.\"  \"There's light ahead -- I can see something moving.\"  They reached the end of the passageway and saw before them a brilliantly lit chamber, its ceiling arching high above them. It was full of small, jewel-bright birds, fluttering and tumbling all around the room. On the opposite side of the chamber was a heavy wooden door.  \"Do you think they'll attack us if we cross the room?\" said Ron.  \"Probably,\" said Harry. \"They don't look very vicious, but I suppose if they all swooped down at once... well, there's no other choice... I'll run.\"  He took a deep breath, covered his face with his arms, and sprinted across the room. He expected to feel sharp beaks and claws tearing at him any second, but nothing happened. He reached the door untouched. He pulled the handle, but it was locked.  The other two followed him. They tugged and heaved at the door, but it wouldn't budge, not even when Hermione tried her Alohomora charm.  \"Now what?\" said Ron.  \"These birds... they can't be here just for decoration,\" said Hermione.  They watched the birds soaring overhead, glittering -- glittering?  \"They're not birds!\" Harry said suddenly. \"They're keys! Winged keys -- look carefully. So that must mean...\" he looked around the chamber while the other two squinted up at the flock of keys. \"... yes -- look! Broomsticks! We've got to catch the key to the door!\"  \"But there are hundreds of them!\"  Ron examined the lock on the door.  \"We're looking for a big, old-fashioned one -- probably silver, like the handle.\"  They each seized a broomstick and kicked off into the air, soaring into the midst of the cloud of keys. They grabbed and snatched, but the bewitched keys darted and dived so quickly it was almost impossible to catch one.  Not for nothing, though, was Harry the youngest Seeker in a century. He had a knack for spotting things other people didn't. After a minute's weaving about through the whirl of rainbow feathers, he noticed a large silver key that had a bent wing, as if it had already been caught and stuffed roughly into the keyhole.  \"That one!\" he called to the others. \"That big one -- there -- no, there -- with bright blue wings -- the feathers are all crumpled on one side.\"  Ron went speeding in the direction that Harry was pointing, crashed into the ceiling, and nearly fell off his broom.  \"We've got to close in on it!\" Harry called, not taking his eyes off the key with the damaged wing. \"Ron, you come at it from above -- Hermione, stay below and stop it from going down and I'll try and catch it. Right, NOW!\"  Ron dived, Hermione rocketed upward, the key dodged them both, and Harry streaked after it; it sped toward the wall, Harry leaned forward and with a nasty, crunching noise, pinned it against the stone with one hand. Ron and Hermione's cheers echoed around the high chamber.  They landed quickly, and Harry ran to the door, the key struggling in his hand. He rammed it into the lock and turned -- it worked. The moment the lock had clicked open, the key took flight again, looking very battered now that it had been caught twice.  \"Ready?\" Harry asked the other two, his hand on the door handle. They nodded. He pulled the door open.  The next chamber was so dark they couldn't see anything at all. But as they stepped into it, light suddenly flooded the room to reveal an astonishing sight.  They were standing on the edge of a huge chessboard, behind the black chessmen, which were all taller than they were and carved from what looked like black stone. Facing them, way across the chamber, were the white pieces. Harry, Ron and Hermione shivered slightly -- the towering white chessmen had no faces.  \"Now what do we do?\" Harry whispered.  \"It's obvious, isn't it?\" said Ron. \"We've got to play our way across the room.\"  Behind the white pieces they could see another door.  \"How?\" said Hermione nervously.  \"I think,\" said Ron, \"we're going to have to be chessmen.\"  He walked up to a black knight and put his hand out to touch the knight's horse. At once, the stone sprang to life. The horse pawed the ground and the knight turned his helmeted head to look down at Ron.  \"Do we -- er -- have to join you to get across?\" The black knight nodded. Ron turned to the other two.  \"This needs thinking about  he said. I suppose we've got to take the place of three of the black pieces....\"  Harry and Hermione stayed quiet, watching Ron think."
}