{
  "id": "e46a5b036cdc20b8bb2e1e4ff795fb8c8f6dda48",
  "text": "  Warrior defend me,  he groaned,  now I know how Qhorin Halfhand must have felt.   That was too much. Jon wrenched free of his friends and retreated to the armory, alone. His ears were still ringing from the blow Emmett had dealt him. He sat on the bench and buried his head in his hands. Why am I so angry? he asked himself, but it was a stupid question. Lord of Winterfell. I could be the Lord of Winterfell. My father’s heir.  It was not Lord Eddard’s face he saw floating before him, though; it was Lady Catelyn’s. With her deep blue eyes and hard cold mouth, she looked a bit like Stannis. Iron, he thought, but brittle. She was looking at him the way she used to look at him at Winterfell, whenever he had bested Robb at swords or sums or most anything. Who are you? that look had always seemed to say. This is not your place. Why are you here?  His friends were still out in the practice yard, but Jon was in no fit state to face them. He left the armory by the back, descending a steep flight of stone steps to the wormways, the tunnels that linked the castle’s keeps and towers below the earth. It was short walk to the bathhouse, where he took a cold plunge to wash the sweat off and soaked in a hot stone tub. The warmth took some of the ache from his muscles and made him think of Winterfell’s muddy pools, steaming and bubbling in the godswood. Winterfell, he thought. Theon left it burned and broken, but I could restore it. Surely his father would have wanted that, and Robb as well. They would never have wanted the castle left in ruins.  You can’t be the Lord of Winterfell, you’re bastard-born, he heard Robb say again. And the stone kings were growling at him with granite tongues. You do not belong here. This is not your place. When Jon closed his eyes he saw the heart tree, with its pale limbs, red leaves, and solemn face. The weirwood was the heart of Winterfell, Lord Eddard always said… but to save the castle Jon would have to tear that heart up by its ancient roots, and feed it to the red woman’s hungry fire god. I have no right, he thought. Winterfell belongs to the old gods.  The sound of voices echoing off the vaulted ceiling brought him back to Castle Black.  I don’t know,  a man was saying, in a voice thick with doubts.  Maybe if I knew the man better… Lord Stannis didn’t have much good to say of him, I’ll tell you that.    When has Stannis Baratheon ever had much good to say of anyone?  Ser Alliser’s flinty voice was unmistakable.  If we let Stannis choose our Lord Commander, we become his bannermen in all but name. Tywin Lannister is not like to forget that, and you know it will be Lord Tywin who wins in the end. He’s already beaten Stannis once, on the Blackwater.    Lord Tywin favors Slynt,  said Bowen Marsh, in a fretful, anxious voice.  I can show you his letter, Othell. ‘Our faithful friend and servant’ he called him.   Jon Snow sat up suddenly, and the three men froze at the sound of the slosh.  My lords,  he said with cold courtesy.   What are you doing here, bastard?  Thorne asked.   Bathing. But don’t let me spoil your plotting.  Jon climbed from the water, dried, dressed, and left them to conspire.  Outside, he found he had no idea where he was going. He walked past the shell of the Lord Commander’s Tower, where once he’d saved the Old Bear from a dead man; past the spot where Ygritte had died with that sad smile on her face; past the King’s Tower where he and Satin and Deaf Dick Follard had waited for the Magnar and his Thenns; past the heaped and charred remains of the great wooden stair. The inner gate was open, so Jon went down the tunnel, through the Wall. He could feel the cold around him, the weight of all the ice above his head. He walked past the place where Donal Noye and Mag the Mighty had fought and died together, through the new outer gate, and back into the pale cold sunlight.  Only then did he permit himself to stop, to take a breath, to think. Othell Yarwyck was not a man of strong convictions, except when it came to wood and stone and mortar. The Old Bear had known that. Thorne and Marsh will sway him, Yarwyck will support Lord Janos, and Lord Janos will be chosen Lord Commander. And what does that leave me, if not Winterfell?  A wind swirled against the Wall, tugging at his cloak. He could feel the cold coming off the ice the way heat comes off a fire. Jon pulled up his hood and began to walk again. The afternoon was growing old, and the sun was low in the west. A hundred yards away was the camp where King Stannis had confined his wildling captives within a ring of ditches, sharpened stakes, and high wooden fences. To his left were three great firepits, where the victors had burned the bodies of all the free folk to die beneath the Wall, huge pelted giants and little Hornfoot men alike. The killing ground was still a desolation of scorched weeds and hardened pitch, but Mance’s people had left traces of themselves everywhere; a torn hide that might have been part of a tent, a giant’s maul, the wheel of a chariot, a broken spear, a pile of mammoth dung."
}