{
  "id": "e589269be317ffb135dc71b7863311fbfce9b7d0",
  "text": "... Was it so impossible his father had done the same? Had he been seeing things across the take? The figure had been too far away to see distinctly... yet he had felt sure, for a moment, before he'd lost consciousness....  The leaves overhead rustled faintly in the breeze. The moon drifted in and out of sight behind the shifting clouds. Hermione sat with her face turned toward the Willow, waiting.  And then, at last, after over an hour...  \"Here we come!\" Hermione whispered.  She and Harry got to their feet. Buckbeak raised his head. They saw Lupin, Ron, and Pettigrew clambering awkwardly out of the hole in the roots. Then came Hermione... then the unconscious Snape, drifting weirdly upward. Next came Harry and Black. They all began to walk toward the castle.  Harry's heart was starting to beat very fast. He glanced up at the sky. Any moment now, that cloud was going to move aside and show the moon....  \"Harry,\" Hermione muttered as though she knew exactly what he was thinking, \"we've got to stay put. We mustn't be seen. There's nothing we can do....\"  \"So we're just going to let Pettigrew escape all over again.. said Harry quietly.  \"How do you expect to find a rat in the dark?\" snapped Hermione. \"There's nothing we can do! We came back to help Sirius; we're not supposed to be doing anything else!\"  \"All right!\"  The moon slid out from behind its cloud. They saw the tiny figures across the grounds stop. Then they saw movement --  \"There goes Lupin,\" Hermione whispered. \"He's transforming  \"Hermione!\" said Harry suddenly. \"We've got to move!\"  \"We mustn't, I keep telling you --\"  \"Not to interfere! Lupin's going to run into the forest, right at us!\"  Hermione gasped.  \"Quick!\" she moaned, dashing to untie Buckbeak. \"Quick! Where are we going to go? Where are we going to hide? The dementors wilt be coming any moment --\"  \"Back to Hagrid's!\" Harry said. \"It's empty now -- come on!\"  They ran as fast as they could, Buckbeak cantering along behind them. They could hear the werewolf howling behind them....  The cabin was in sight; Harry skidded to the door, wrenched it open, and Hermione and Buckbeak flashed past him; Harry threw himself in after them and bolted the door. Fang the boarhound barked loudly.  \"Shh, Fang, it's us!\" said Hermione, hurrying over and scratching his ears to quieten him. \"That was really close!\" she said to Harry.  \"Yeah...\"  Harry was looking out of the window. It was much harder to see what was going on from here. Buckbeak seemed very happy to find himself back inside Hagrid's house. He lay down in front of the fire, folded his wings contentedly, and seemed ready for a good nap.  \"I think I'd better go outside again, you know,\" said Harry slowly. \"I can't see what's going on -- we won't know when it's time --\"  Hermione looked up. Her expression was suspicious.  \"I'm not going to try and interfere,\" said Harry quickly. \"But if we don't see what's going on, how're we going to know when it's time to rescue Sirius?\"  \"Well... okay, then... I'll wait here with Buckbeak... but Harry, be careful -- there's a werewolf out there -- and the dementors  Harry stepped outside again and edged around the cabin. He could hear yelping in the distance. That meant the dementors were closing in on Sirius.... He and Hermione would be running to him any moment....  Harry stared out toward the lake, his heart doing a kind of drumroll in his chest.... Whoever had sent that Patronus would be appearing at any moment....  For a fraction of a second he stood, irresolute, in front of Hagrid's door. You must not be seen. But he didn't want to be seen. He wanted to do the seeing.... He had to know...  And there were the dementors. They were emerging out of the darkness from every direction, gliding around the edges of the lake.... They were moving away from where Harry stood, to the opposite bank.... He wouldn't have to get near them....  Harry began to run. He had no thought in his head except his father... If it was him... if it really was him... he had to know, had to find out....  The lake was coming nearer and nearer, but there was no sign of anybody. On the opposite bank, he could see tiny glimmers of silver -- his own attempts at a Patronus --  There was a bush at the very edge of the water. Harry threw himself behind it, peering desperately through the leaves. On the opposite bank, the glimmers of silver were suddenly extinguished. A terrified excitement shot through him -- any moment now --  \"Come on!\" he muttered, staring about. \"Where are you? Dad, come on --\"  But no one came. Harry raised his head to look at the circle of dementors across the lake. One of them was lowering its hood. It was time for the rescuer to appear -- but no one was coming to help this time --  And then it hit him -- he understood. He hadn't seen his father -- he had seen himself --  Harry flung himself out from behind the bush and pulled out his wand.  \"EXPECTO PATRONUM! \"he yelled.  And out of the end of his wand burst, not a shapeless cloud of mist, but a blinding, dazzling, silver animal."
}