{
  "id": "e5af39daa1913496743a65e93174020ed21c004f",
  "text": " There was a brief  red flame that flickered under the clouds and died  away. The Mountain too slept uneasily.       The last stage of their journey to  Orodruin came, and it was a torment  greater than Sam had ever thought that he could bear. He was in pain, and so   parched that he could no longer swallow even a mouthful of food. It remained  dark, not  only because of the  smokes of the Mountain: there seemed to be a   storm  coming  up,  and  away  to  the  south-east there  was  a  shimmer of  lightnings under the black skies. Worst of all,  the air  was full of fumes;   breathing was painful and difficult, and  a dizziness  came on them, so that  they staggered and often fell. And  yet their wills did not  yield, and they  struggled on.       The  Mountain crept  up ever nearer, until, if they  lifted their heavy  heads, it  filled all  their sight, looming vast before them: a huge mass of  ash  and slag and burned stone, out  of which a  sheer -sided cone was raised  into  the clouds. Before the  daylong dusk ended and true  night  came again  they had crawled and stumbled to its very feet.       With a gasp  Frodo cast  himself on  the ground. Sam sat by him. To his  surprise he felt tired but lighter, and his head seemed clear again. No more   ####-debates disturbed  his mind.  He knew all the arguments of despair and would  not listen to them. His wi ll was set, and only death would break it. He felt  no longer either desire  or need of sleep, but  rather  of  watchfulness. He  knew  that all the hazards and perils were now  drawing together to a point:  the next day would  be a day of doom, the day  of final  effort or disaster,  the last gasp.       But when  would it come? The night seemed endless and  timeless, minute  after  minute  falling dead and adding up to  no  passing hour,  bringing no  change. Sam  began to wonder if a second darkness had begun and no day  would  ever  reappear. At  last he  groped  for  Frodo's  hand.  It  was  cold  and  trembling. His master was shivering.       'I  didn't ought  to have left  my blanket  behind,' muttered Sam;  and  lying down he tried to comfort Frodo with his arms and body. Then sleep took   him,  and the dim light of  the last day of  their  quest found them side by  side. The wind  had fallen  the day before  as it shifted from the West, and  now  it came from the North  and began  to rise; and slowly the light of the  unseen Sun filtered down into the shadows where the hobbits lay.       'Now for it! Now  for the last  gasp!' said Sam as he  struggled to his  feet.  He bent over Frodo, rousing  him gently.  Frodo groaned; but  with  a   great effort of will he staggered up; and then he fell upon his knees again.   He raised his eyes with difficulty to the dark slopes of Mount Doom towering  above him, and then pitifully he began to crawl forward on his hands.        Sam looked at him and wept in his heart, but  no tears came to his  dry  and stinging eyes. 'I said I'd carry him, if it broke my back,' he muttered,  'and I will!'       'Come, Mr. Frodo!' he cried. 'I can't carry it for you, but I can carry  you and  it as well.  So  up you get! Come on, Mr. Frodo dear! Sam will give  you a ride. Just tell him where to go, and he'll go.'       As Frodo clung upon his back, arms loosely about his neck, legs clasped  firmly under his arms, Sam staggered to his  feet; and then to his amazement   he felt the  burden light. He had feared that he would  have barely strength  to lift  his  master alone, and beyond that he had expected to share in  the  dreadful dragging weight of the  accursed  Ring.  But it was not so. Whether   because Frodo  was so worn by his  long pains, wound  of knife, and venomous  sting,  and  sorrow, fear, and homeless wandering, or  because some  gift of  final  strength was given to  him, Sam lifted Frodo with no more  difficulty   ####-than if he were carrying a hobbit-child pig-a -back in some romp on the lawns  or hayfields of the Shire. He took a deep breath and started off.       They had reached the Mountain's foot on its northern side, and a little  to the westward; there its long grey  slopes, though broken, were not sheer.  Frodo did  not speak,  and so Sam  struggled on as best he could, having  no   guidance but the will to climb as high as might be  before his strength gave  out  and his will broke. On he toiled, up and up, turning this way and  that  to lessen  the slope, often stumbling forward, and at the last crawling like  a snail  with  a  heavy burden on its back. When his will could drive him no  further, and his limbs gave way, he stopped and laid his master gently down.        Frodo opened his eyes and  drew a breath.  It was easier  to breathe up  here  above the reeks that coiled and drifted down below. 'Thank you,  Sam,'  he said in a cracked whisper. 'How far is there to go?'       'I don't know,' said Sam, 'because I don't know where we're going.'       He looked back, and then he looked up; and he was amazed to see how far  his last effort had brought him."
}