{
  "id": "e5c961634e9ba28fff0fcd7ddb6af9107c6489ba",
  "text": " To the King’s Grace. And he threatened him…    Be quiet, Cersei. Joffrey, when your enemies defy you, you must serve them steel and fire. When they go to their knees, however, you must help them back to their feet. Elsewise no man will ever bend the knee to you. And any man who must say ‘I am the king’ is no true king at all. Aerys never understood that, but you will. When I’ve won your war for you, we will restore the king’s peace and the king’s justice. The only head that need concern you is Margaery Tyrell’s maidenhead.   Joffrey had that sullen, sulky look he got. Cersei had him firmly by the shoulder, but perhaps she should have had him by the throat. The boy surprised them all. Instead of scuttling safely back under his rock, Joff drew himself up defiantly and said,  You talk about Aerys, Grandfather, but you were scared of him.   Oh, my, hasn’t this gotten interesting? Tyrion thought.  Lord Tywin studied his grandchild in silence, gold flecks shining in his pale green eyes.  Joffrey, apologize to your grandfather,  said Cersei.  He wrenched free of her.  Why should I? Everyone knows it’s true. My father won all the battles. He killed Prince Rhaegar and took the crown, while your father was hiding under Casterly Rock.  The boy gave his grandfather a defiant look.  A strong king acts boldly, he doesn’t just talk.    Thank you for that wisdom, Your Grace,  Lord Tywin said, with a courtesy so cold it was like to freeze their ears off.  Ser Kevan, I can see the king is tired. Please see him safely back to his bedchamber. Pycelle, perhaps some gentle potion to help His Grace sleep restfully?    Dreamwine, my lord?    I don’t want any dreamwine,  Joffrey insisted.  Lord Tywin would have paid more heed to a mouse squeaking in the corner.  Dreamwine will serve. Cersei, Tyrion, remain.   Ser Kevan took Joffrey firmly by the arm and marched him out the door, where two of the Kingsguard were waiting. Grand Maester Pycelle scurried after them as fast as his shaky old legs could take him. Tyrion remained where he was.   Father, I am sorry,  Cersei said, when the door was shut.  Joff has always been willful, I did warn you…    There is a long league’s worth of difference between willful and stupid. ‘A strong king acts boldly?’ Who told him that?    Not me, I promise you,  said Cersei.  Most like it was something he heard Robert say…    The part about you hiding under Casterly Rock does sound like Robert.  Tyrion didn’t want Lord Tywin forgetting that bit.   Yes, I recall now,  Cersei said,  Robert often told Joff that a king must be bold.    And what were you telling him, pray? I did not fight a war to seat Robert the Second on the Iron Throne. You gave me to understand the boy cared nothing for his father.    Why would he? Robert ignored him. He would have beat him if I’d allowed it. That brute you made me marry once hit the boy so hard he knocked out two of his baby teeth, over some mischief with a cat. I told him I’d kill him in his sleep if he ever did it again, and he never did, but sometimes he would say things…    It appears things needed to be said.  Lord Tywin waved two fingers at her, a brusque dismissal.  Go.   She went, seething.   Not Robert the Second,  Tyrion said.  Aerys the Third.    The boy is thirteen. There is time yet.  Lord Tywin paced to the window. That was unlike him; he was more upset than he wished to show.  He requires a sharp lesson.   Tyrion had gotten his own sharp lesson at thirteen. He felt almost sorry for his nephew. On the other hand, no one deserved it more.  Enough of Joffrey,  he said.  Wars are won with quills and ravens, wasn’t that what you said? I must congratulate you. How long have you and Walder Frey been plotting this?    I mislike that word,  Lord Tywin said stiffly.   And I mislike being left in the dark.    There was no reason to tell you. You had no part in this.    Was Cersei told?  Tyrion demanded to know.   No one was told, save those who had a part to play. And they were only told as much as they needed to know. You ought to know that there is no other way to keep a secret—here, especially. My object was to rid us of a dangerous enemy as cheaply as I could, not to indulge your curiosity or make your sister feel important.  He closed the shutters, frowning.  You have a certain cunning, Tyrion, but the plain truth is you talk too much. That loose tongue of yours will be your undoing.    You should have let Joff tear it out,  suggested Tyrion.   You would do well not to tempt me,  Lord Tywin said.  I’ll hear no more of this. I have been considering how best to appease Oberyn Martell and his entourage.    Oh? Is this something I’m allowed to know, or should I leave so you can discuss it with yourself?   His father ignored the sally.  Prince Oberyn’s presence here is unfortunate. His brother is a cautious man, a reasoned man, subtle, deliberate, even indolent to a degree. He is a man who weighs the consequences of every word and every action. But Oberyn has always been half-mad."
}