{
  "id": "e64f75b3f56ae4b8d6461619584e9fc848ec4a04",
  "text": " I, a spy for Voldemort? When did I ever sneak around people who were stronger and more powerful than myself? But you, Peter -- I'll never understand why I didn't see you were the spy from the start. You always liked big friends who'd look after you, didn't you? It used to be us... me and Remus... and James....  Pettigrew wiped his face again; he was almost panting for breath.  \"Me, a spy... must be out of your mind... never... don't know how you can say such a --\"  \"Lily and James only made you Secret-Keeper because I suggested it,\" Black hissed, so venomously that Pettigrew took a step backward. \"I thought it was the perfect plan... a bluff... Voldemort would be sure to come after me, would never dream they'd use a weak, talentless thing like you.... It must have been the finest moment of your miserable life, telling Voldemort you could hand him the Potters.\"  Pettigrew was muttering distractedly; Harry caught words like \"far-fetched\" and \"lunacy,\" but he couldn't help paying more attention to the ashen color of Pettigrew's face and the way his eyes continued to dart toward the windows and door.  \"Professor Lupin?\" said Hermione timidly. \"Can -- can I say something?\"  \"Certainly, Hermione,\" said Lupin courteously.  \"Well -- Scabbers -- I mean, this -- this man -- he's been sleeping in Harry's dormitory for three years. If he's working for You-Know-Who, how come he never tried to hurt Harry before now?\"  \"There!\" said Pettigrew shrilly, pointing at Ron with his maimed hand. \"Thank you! You see, Remus? I have never hurt a hair of Harry's head! Why should I?\"  \"I'll tell you why,\" said Black. \"Because you never did anything for anyone unless you could see what was in it for you. Voldemort's been in hiding for fifteen years, they say he's half dead. You weren't about to commit murder right under Albus Dumbledore's nose, for a wreck of a wizard who'd lost all of his power, were you? You'd want to be quite sure he was the biggest bully in the playground before you went back to him, wouldn't you? Why else did you find a wizard family to take you in? Keeping an ear out for news, weren't YOU, Peter? Just in case your old protector regained strength, and it was safe to rejoin him....\"  Pettigrew opened his mouth and closed it several times. He seemed to have lost the ability to talk.  \"Er -- Mr. Black -- Sirius?\" said Hermione.  Black jumped at being addressed like this and stared at Hermione as though he had never seen anything quite like her.  \"If you don't mind me asking, how -- how did you get out of Azkaban, if you didn't use Dark Magic?\"  \"Thank you!\" gasped Pettigrew, nodding frantically at her. \"Exactly! Precisely what I --\"  But Lupin silenced him with a look. Black was frowning slightly at Hermione, but not as though he were annoyed with her. He seemed to be pondering his answer.  \"I don't know how I did it,\" he said slowly. \"I think the only reason I never lost my mind is that I knew I was innocent. That wasn't a happy thought, so the dementors couldn't suck it out of me... but it kept me sane and knowing who I am... helped me keep my powers... so when it all became ... too much... I could transform in my cell... become a dog. Dementors can't see, you know....\" He swallowed. \"They feel their way toward people by feeding off their emotions.... They could tell that my feelings were less -- less human, less complex when I was a dog... but they thought, of course, that I was losing my mind like everyone else in there, so it didn't trouble them. But I was weak, very weak, and I had no hope of driving them away from me without a wand....\"  \"But then I saw Peter in that picture... I realized he was at Hogwarts with Harry... perfectly positioned to act, if one hint reached his ears that the Dark Side was gathering strength again....\"  Pettigrew was shaking his head, mouthing noiselessly, but staring all the while at Black as though hypnotized.  \"... ready to strike at the moment he could be sure of allies... and to deliver the last Potter to them. if he gave them Harry, who'd dare say he'd betrayed Lord Voldemort? He'd be welcomed back with honors....  \"So you see, I had to do something. I was the only one who knew Peter was still alive....\"  Harry remembered what Mr. Weasley had told Mrs. Wealsey. \"The guards say he's been talking in his sleep... always the same words... 'He's at Hogwarts.'\"  \"It was as if someone had lit a fire In my head, and the dementors couldn't destroy it.... It wasn't a happy feeling... it was an obsession... but it gave me strength, it cleared my mind. So, one night when they opened my door to bring food, I slipped past them as a dog.... It's so much harder for them to sense animal emotions that they were confused.... I was thin, very thin... thin enough to slip through the bars.... I swam as a dog back to the mainland.... I journeyed north and slipped into the Hogwarts grounds as a dog. I've been living in the forest ever since, except when I came to watch the Quidditch, of course. You fly as well as your father did, Harry."
}