{
  "id": "e658e31e05c6edc3f1885d684750b334d02476fd",
  "text": " The Mother shaped us to protect our children, and our only dishonor is in failure. You’ll know that, when you have a child.    A child?  said Sansa, uncertainly.  Lysa waved a hand negligently.  Not for many years. You are too young to be a mother. One day you shall want children, though. Just as you will want to marry.    I… I am married, my lady.    Yes, but soon a widow. Be glad the Imp preferred his whores. It would not be fitting for my son to take that dwarf’s leavings, but as he never touched you… How would you like to marry your cousin, the Lord Robert?   The thought made Sansa weary. All she knew of Robert Arryn was that he was a little boy, and sickly. It is not me she wants her son to marry, it is my claim. No one will ever marry me for love. But lying came easy to her now.  I… can scarcely wait to meet him, my lady. But he is still a child, is he not?    He is eight. And not robust. But such a good boy, so bright and clever. He will be a great man, Alayne. The seed is strong, my lord husband said before he died. His last words. The gods sometimes let us glimpse the future as we lay dying. I see no reason why you should not be wed as soon as we know that your Lannister husband is dead. A secret wedding, to be sure. The Lord of the Eyrie could scarcely be thought to have married a bastard, that would not be fitting. The ravens should bring us the word from King’s Landing once the Imp’s head rolls. You and Robert can be wed the next day, won’t that be joyous? It will be good for him to have a little companion. He played with Vardis Egen’s boy when we first returned to the Eyrie, and my steward’s sons as well, but they were much too rough and I had no choice but to send them away. Do you read well, Alayne?    Septa Mordane was good enough to say so.    Robert has weak eyes, but he loves to be read to,  Lady Lysa confided.  He likes stories about animals the best. Do you know the little song about the chicken who dressed as a fox? I sing him that all the time, he never grows tired of it. And he likes to play hopfrog and spin-the-sword and come-into-my-castle, but you must always let him win. That’s only proper, don’t you think? He is the Lord of the Eyrie, after all, you must never forget that. You are well born, and the Starks of Winterfell were always proud, but Winterfell has fallen and you are really just a beggar now, so put that pride aside. Gratitude will better become you, in your present circumstances. Yes, and obedience. My son will have a grateful and obedient wife.       Jon   Day and night the axes rang.  Jon could not remember the last time he had slept. When he closed his eyes he dreamed of fighting; when he woke he fought. Even in the King’s Tower he could hear the ceaseless thunk of bronze and flint and stolen steel biting into wood, and it was louder when he tried to rest in the warming shed atop the Wall. Mance had sledgehammers at work as well, and long saws with teeth of bone and flint. Once, as he was drifting off into an exhausted sleep, there came a great cracking from the haunted forest, and a sentinel tree came crashing down in a cloud of dirt and needles.  He was awake when Owen came to him, lying restless under a pile of furs on the floor of the warming shed.  Lord Snow,  said Owen, shaking his shoulder,  the dawn.  He gave Jon a hand to help pull him back onto his feet. Others were waking as well, jostling one another as they pulled on their boots and buckled their swordbelts in the close confines of the shed. No one spoke. They were all too tired for talk. Few of them ever left the Wall these days. It took too long to ride up and down in the cage. Castle Black had been abandoned to Maester Aemon, Ser Wynton Stout, and a few others too old or ill to fight.   I had a dream that the king had come,  Owen said happily.  Maester Aemon sent a raven, and King Robert came with all his strength. I dreamed I saw his golden banners.   Jon made himself smile.  That would be a welcome sight to see, Owen.  Ignoring the twinge of pain in his leg, he swept a black fur cloak about his shoulders, gathered up his crutch, and went out onto the Wall to face another day.  A gust of wind sent icy tendrils wending through his long brown hair. Half a mile north, the wildling encampments were stirring, their campfires sending up smoky fingers to scratch against the pale dawn sky. Along the edge of the forest they had raised their tents of hide and fur, even a crude longhall of logs and woven branches; there were horselines to the east, mammoths to the west, and men everywhere, sharpening their swords, putting points on crude spears, donning makeshift armor of hide and horn and bone. For every man that he could see, Jon knew there were a score unseen in the wood. The brush gave them some shelter from the elements and hid them from the eyes of the hated crows.  Already their archers were stealing forward, pushing their rolling mantlets.  Here come our breakfast arrows,  Pyp announced cheerfully, as he did every morning."
}