{
  "id": "e67adca6cb512a238bc80ef2088bb5ce5deaafc7",
  "text": " Hermione was muttering instructions to him out of the corner of her mouth, so that Snape wouldn't see. Harry and Ron packed away their unused ingredients and went to wash their hands and ladles in the stone basin in the corner.  \"What did Malfoy mean?\" Harry muttered to Ron as he stuck his hands under the icy jet that poured from the gargoyle's mouth \"Why would I want revenge on Black? He hasn't done anything to me -- yet.  \"He's making it up,\" said Ron savagely. \"He's trying to make you do something stupid....\"  The end of the lesson in sight, Snape strode over to Neville, who was cowering by his cauldron.  \"Everyone gather 'round,\" said Snape, his black eyes glittering, and watch what happens to Longbottom's toad. If he has managed to produce a Shrinking Solution, it will shrink to a tadpole. If, as I don't doubt, he has done it wrong, his toad is likely to be poisoned.\"  The Gryffindors watched fearfully. The Slytherins looked excited. Snape picked up Trevor the toad in his left hand and dipped a small spoon into Neville's potion, which was now green. He trickled a few drops down Trevor's throat.  There was a moment of hushed silence, in which Trevor gulped; then there was a small pop, and Trevor the tadpole was wriggling in Snape's palm.  The Gryffindors burst into applause. Snape, looking sour, pulled a small bottle from the pocket of his robe, poured a few drops on top of Trevor, and he reappeared suddenly, fully grown.  \"Five points from Gryffindor,\" said Snape, which wiped the smiles from every face. \"I told you not to help him, Miss Granger. Class dismissed.\"  Harry, Ron, and Hermione climbed the steps to the entrance hall. Harry was still thinking about what Malfoy had said, while Ron was seething about Snape.  \"Five points from Gryffindor because the potion was all right!  Why didn't You lie, Hermione? You should've said Neville did it all by himself!\"  Hermione didn't answer. Ron looked around.  \"Where is she?\"  Harry turned too. They were at the top of the steps now, watching the rest of the class pass them, heading for the Great Hall and lunch.  \"She was right behind us,\" said Ron, frowning.  Malfoy passed them, walking between Crabbe and Goyle. He smirked at Harry and disappeared.  \"There she is,\" said Harry.  Hermione was panting slightly, hurrying up the stairs; one hand clutched her bag, the other seemed to be tucking something down the front of her robes.  \"How did you do that?\" said Ron.  \"What?\" said Hermione, joining them.  \"One minute you were right behind us, the next moment, you were back at the bottom of the stairs again.\"  \"What?\" Hermione looked slightly confused. \"Oh -- I had to go back for something. Oh no --\"  A seam had split on Hermione's bag. Harry wasn't surprised; he could see that it was crammed with at least a dozen large and heavy books.  \"Why are you carrying all these around with you?\" Ron asked her.  \"You know how many subjects I'm taking,\" said Hermione breathlessly. \"Couldn't hold these for me, could you?\"  \"But --\" Ron was turning over the books she had handed him, looking at the covers. \"You havent got any of these subjects today. It's only Defense Against the Dark Arts this afternoon.\"  \"Oh yes,\" said Hermione vaguely, but she packed all the books back into her bag just the same. I hope there's something good for lunch, I'm starving,\" she added, and she marched off toward the Great Hall.  \"D'you get the feeling Hermione's not telling us something?Ron asked Harry.  Professor Lupin wasn't there when they arrived at his first Defense Against the Dark Arts lesson. They all sat down, took out their books, quills, and parchment, and were talking when he finally entered the room. Lupin smiled vaguely and placed his tatty old briefcase on the teacher's desk. He was as shabby as ever but looked healthier than he had on the train, as though he had had a few square meals.  \"Good afternoon,\" he said. \"Would you please put all your books back in your bags. Today's will be a practical lesson. You will need only your wands.\"  A few curious looks were exchanged as the class put away their books. They had never had a practical Defense Against the Dark Arts before, unless you counted the memorable class last year when their old teacher had brought a cageful of pixies -to class and set them loose.  \"Right then,\" said Professor Lupin, when everyone was ready. \"If you'd follow me.\"  Puzzled but interested, the class got to its feet and followed Professor Lupin out of the classroom. He led them along the deserted corridor and around a corner, where the first thing they saw was Peeves the Poltergeist, who was floating upside down in midair and stuffing the nearest keyhole with chewing gum.  Peeves didn't look up until Professor Lupin was two feet away; ,hen he wiggled his curly-toed feet and broke into song.  \"Loony, loopy Lupin,\" Peeves sang. \"Loony, loopy Lupin, loony, loopy Lupin --\"  Rude and unmanageable as he almost always was, Peeves usually showed some respect toward the teachers."
}