{
  "id": "e6bd4526bd4cca84a377bbd7deee9a3f419b7359",
  "text": "  By the end of the class, Harry, like everyone else, was sweaty, aching, and covered in earth. Everyone traipsed back to the castle for a quick wash and then the Gryffindors hurried off to Transfiguration.  Professor McGonagall's classes were always hard work, but today was especially difficult. Everything Harry had learned last year seemed to have leaked out of his head during the summer. He was supposed to be turning a beetle into a button, but all he managed  * 94  to do was give his beetle a lot of exercise as it scuttled over the desktop avoiding his wand.  Ron was having far worse problems. He had patched up his wand with some borrowed Spellotape, but it seemed to be damaged beyond repair. It kept crackling and sparking at odd moments, and every time Ron tried to transfigure his beetle it engulfed him in thick gray smoke that smelled of rotten eggs. Unable to see what he was doing, Ron accidentally squashed his beetle with his elbow and had to ask for a new one. Professor McGonagall wasn't pleased.  Harry was relieved to hear the lunch bell. His brain felt like a wrung sponge. Everyone fiIed out of the classroom except him and Ron, who was whacking his wand furiously on the desk.  \"Stupid - useless - thing -\"  \"Write home for another one,\" Harry suggested as the wand let off a volley of bangs like a firecracker.  \"Oh, yeah, and get another Howler back,\" said Ron, stuffing the now hissing wand into his bag. \" `It's your own fault your wand got snapped - '\"  They went down to lunch, where Ron's mood was not improved by Hermione's showing them the handful of perfect coat buttons she had produced in Transfiguration.  \"What've we got this afternoon?\" said Harry, hastily changing the subject.  \"Defense Against the Dark Arts,\" said Hermione at once.  \"Why, \"demanded Ron, seizing her schedule, \"have you outlined all Lockhart's lessons in little hearts?\"  Hermione snatched the schedule back, blushing furiously.  * 95 *  They finished lunch and went outside into the overcast courtyard. Hermione sat down on a stone step and buried her nose in Voyages with Vampires again. Harry and Ron stood talking about Quidditch for several minutes before Harry became aware that he was being closely watched. Looking up, he saw the very small, mousy-haired boy he'd seen trying on the Sorting Hat last night staring at Harry as though transfixed. He was clutching what looked like an ordinary Muggle camera, and the moment Harry looked at him, he went bright red.  \"All right, Harry? I'm -I'm Colin Creevey,\" he said breathlessly, taking a tentative step forward. \"I'm in Gryffindor, too. D'you think - would it be all right if - can I have a picture?\" he said, raising the camera hopefully.  \"A picture?\" Harry repeated blankly.  \"So I can prove I've met you,\" said Colin Creevey eagerly, edging further forward. \"I know all about you. Everyone's told me. About how you survived when You-Know-Who tried to kill you and how he disappeared and everything and how you've still got a lightning scar on your forehead\" (his eyes raked Harry's hairline) \"and a boy in my dormitory said if I develop the film in the right potion, the pictures'll move.\" Colin drew a great shuddering breath of excitement and said, \"It's amazing here, isn't it? I never knew all the odd stuff I could do was magic till I got the letter from Hogwarts. My dad's a milkman, he couldn't believe it either. So I'm taking loads of pictures to send home to him. And it'd be really good if I had one of you\" - he looked imploringly at Harry - \"maybe your friend could take it and I could stand next to you? And then, could you sign it?\"  96  \"Signed photos? You're giving out signed photos, Potter?\"  Loud and scathing, Draco Malfoy's voice echoed around the courtyard. He had stopped right behind Colin, flanked, as he always was at Hogwarts, by his large and thuggish cronies, Crabbe and Goyle.  \"Everyone line up!\" Malfoy roared to the crowd. \"Harry Potter's giving out signed photos!\"  \"No, I'm not,\" said Harry angrily, his fists clenching. \"Shut up, Malfoy.\"  \"You're just jealous,\" piped up Colin, whose entire body was about as thick as Crabbe's neck.  `jealous?\"said Malfoy, who didn't need to shout anymore: half the courtyard was listening in. \"Of what? I don't want a foul scar right across my head, thanks. I don't think getting your head cut open makes you that special, myself.\"  Crabbe and Goyle were sniggering stupidly.  \"Eat slugs, Malfoy,\" said Ron angrily. Crabbe stopped laughing and started rubbing his knuckles in a menacing way.  \"Be careful, Weasley,\" sneered Malfoy. \"You don't want to start any trouble or your Mommy'll have to come and take you away from school.\" He put on a shrill, piercing voice. \"Ifyou put another toe out of line' - \"  A knot of Slytherin fifth-years nearby laughed loudly at this.  \"Weasley would like a signed photo, Potter,\" smirked Malfoy. \"It'd be worth more than his family's whole house -\"  Ron whipped out his Spellotaped wand, but Hermione shut Voyages with Vampires with a snap and whispered, \"Look out!\"  \"What's all this, what's all this?\" Gilderoy Lockhart was striding  * 97  toward them, his turquoise robes swirling behind him."
}