{
  "id": "e6da217627b20219de0cee60b7cd90f835aa4c1a",
  "text": "    Fascinating,  said Littlefinger.  And all the more reason I’d sooner bed down in the dungeon.   Perhaps you’ll get that wish, Tyrion thought, but he said,  Courage and folly are cousins, or so I’ve heard. Whatever curse may linger over the Tower of the Hand, I pray I’m small enough to escape its notice.   Janos Slynt laughed, Littlefinger smiled, and Grand Maester Pycelle followed them both out, bowing gravely.   I hope Father did not send you all this way to plague us with history lessons,  his sister said when they were alone.   How I have yearned for the sound of your sweet voice,  Tyrion sighed to her.   How I have yearned to have that eunuch’s tongue pulled out with hot pincers,  Cersei replied.  Has father lost his senses? Or did you forge this letter?  She read it once more, with mounting annoyance.  Why would he inflict you on me? I wanted him to come himself.  She crushed Lord Tywin’s letter in her fingers.  I am Joffrey’s regent, and I sent him a royal command!    And he ignored you,  Tyrion pointed out.  He has quite a large army, he can do that. Nor is he the first. Is he?   Cersei’s mouth tightened. He could see her color rising.  If I name this letter a forgery and tell them to throw you in a dungeon, no one will ignore that, I promise you.   He was walking on rotten ice now, Tyrion knew. One false step and he would plunge through.  No one,  he agreed amiably,  least of all our father. The one with the army. But why should you want to throw me into a dungeon, sweet sister, when I’ve come all this long way to help you?     I do not require your help. It was our father’s presence that I commanded.    Yes,  he said quietly,  but it’s Jaime you want.   His sister fancied herself subtle, but he had grown up with her. He could read her face like one of his favorite books, and what he read now was rage, and fear, and despair.  Jaime—    —is my brother no less than yours,  Tyrion interrupted.  Give me your support and I promise you, we will have Jaime freed and returned to us unharmed.    How?  Cersei demanded.  The Stark boy and his mother are not like to forget that we beheaded Lord Eddard.    True,  Tyrion agreed,  yet you still hold his daughters, don’t you? I saw the older girl out in the yard with Joffrey.    Sansa,  the queen said.  I’ve given it out that I have the younger brat as well, but it’s a lie. I sent Meryn Trant to take her in hand when Robert died, but her wretched dancing master interfered and the girl fled. No one has seen her since. Likely she’s dead. A great many people died that day.   Tyrion had hoped for both Stark girls, but he supposed one would have to do.  Tell me about our friends on the council.   His sister glanced at the door.  What of them?    Father seems to have taken a dislike to them. When I left him, he was wondering how their heads might look on the wall beside Lord Stark’s.  He leaned forward across the table.  Are you certain of their loyalty? Do you trust them?    I trust no one,  Cersei snapped.  I need them. Does Father believe they are playing us false?    Suspects, rather.    Why? What does he know?   Tyrion shrugged.  He knows that your son’s short reign has been a long parade of follies and disasters. That suggests that someone is giving Joffrey some very bad counsel.   Cersei gave him a searching look.  Joff has had no lack of good counsel. He’s always been strong-willed. Now that he’s king, he believes he should do as he pleases, not as he’s bid.    Crowns do queer things to the heads beneath them,  Tyrion agreed.  This business with Eddard Stark… Joffrey’s work?   The queen grimaced.  He was instructed to pardon Stark, to allow him to take the black. The man would have been out of our way forever, and we might have made peace with that son of his, but Joff took it upon himself to give the mob a better show. What was I to do? He called for Lord Eddard’s head in front of half the city. And Janos Slynt and Ser Ilyn went ahead blithely and shortened the man without a word from me!  Her hand tightened into a fist.  The High Septon claims we profaned Baelor’s Sept with blood, after lying to him about our intent.    It would seem he has a point,  said Tyrion.  So this Lord Slynt, he was part of it, was he? Tell me, whose fine notion was it to grant him Harrenhal and name him to the council?    Littlefinger made the arrangements. We needed Slynt’s gold cloaks. Eddard Stark was plotting with Renly and he’d written to Lord Stannis, offering him the throne. We might have lost all. Even so, it was a close thing. If Sansa hadn’t come to me and told me all her father’s plans…   Tyrion was surprised.  Truly? His own daughter?  Sansa had always seemed such a sweet child, tender and courteous.   The girl was wet with love. She would have done anything for Joffrey, until he cut off her father’s head and called it mercy. That put an end to that.    His Grace has a unique way of winning the hearts of his subjects,  Tyrion said with a crooked smile.  Was it Joffrey’s wish to dismiss Ser Barristan Selmy from his Kingsguard too?   Cersei sighed."
}