{
  "id": "e84706db897dbab46796ce2e7f07aa52df358649",
  "text": " Now dry your eyes. Illyrio is bringing him over, and he will not see you crying.   Dany turned and saw that it was true. Magister Illyrio, all smiles and bows, was escorting Khal Drogo over to where they stood. She brushed away unfallen tears with the back of her hand.   Smile,  Viserys whispered nervously, his hand failing to the hilt of his sword.  And stand up straight. Let him see that you have breasts. Gods know, you have little enough as is.   Daenerys smiled, and stood up straight.      EDDARD  The visitors poured through the castle gates in a river of gold and silver and polished steel, three hundred strong, a pride of bannermen and knights, of sworn swords and freeriders. Over their heads a dozen golden banners whipped back and forth in the northern wind, emblazoned with the crowned stag of Baratheon.  Ned knew many of the riders. There came Ser Jaime Lannister with hair as bright as beaten gold, and there Sandor Clegane with his terrible burned face. The tall boy beside him could only be the crown prince, and that stunted little man behind them was surely the Imp, Tyrion Lannister.  Yet the huge man at the head of the column, flanked by two knights in the snow-white cloaks of the Kingsguard, seemed almost a stranger to Ned… until he vaulted off the back of his warhorse with a familiar roar, and crushed him in a bone-crunching hug.  Ned! Ah, but it is good to see that frozen face of yours.  The king looked him over top to bottom, and laughed.  You have not changed at all.   Would that Ned had been able to say the same. Fifteen years past, when they had ridden forth to win a throne, the Lord of Storm’s End had been clean-shaven, clear-eyed, and muscled like a maiden’s fantasy. Six and a half feet tall, he towered over lesser men, and when he donned his armor and the great antlered helmet of his House, he became a veritable giant. He’d had a giant’s strength too, his weapon of choice a spiked iron warhammer that Ned could scarcely lift. In those days, the smell of leather and blood had clung to him like perfume.  Now it was perfume that clung to him like perfume, and he had a girth to match his height. Ned had last seen the king nine years before during Balon Greyjoy’s rebellion, when the stag and the direwolf had joined to end the pretensions of the self-proclaimed King of the Iron Islands. Since the night they had stood side by side in Greyjoy’s fallen stronghold, where Robert had accepted the rebel lord’s surrender and Ned had taken his son Theon as hostage and ward, the king had gained at least eight stone. A beard as coarse and black as iron wire covered his jaw to hide his double chin and the sag of the royal jowls, but nothing could hide his stomach or the dark circles under his eyes.  Yet Robert was Ned’s king now, and not just a friend, so he said only,  Your Grace. Winterfell is yours.   By then the others were dismounting as well, and grooms were coming forward for their mounts. Robert’s queen, Cersei Lannister, entered on foot with her younger children. The wheelhouse in which they had ridden, a huge double-decked carriage of oiled oak and gilded metal pulled by forty heavy draft horses, was too wide to pass through the castle gate. Ned knelt in the snow to kiss the queen’s ring, while Robert embraced Catelyn like a long-lost sister. Then the children had been brought forward, introduced, and approved of by both sides.  No sooner had those formalities of greeting been completed than the king had said to his host,  Take me down to your crypt, Eddard. I would pay my respects.   Ned loved him for that, for remembering her still after all these years. He called for a lantern. No other words were needed. The queen had begun to protest. They had been riding since dawn, everyone was tired and cold, surely they should refresh themselves first. The dead would wait. She had said no more than that; Robert had looked at her, and her twin brother Jaime had taken her quietly by the arm, and she had said no more.  They went down to the crypt together, Ned and this king he scarcely recognized. The winding stone steps were narrow. Ned went first with the lantern.  I was starting to think we would never reach Winterfell,  Robert complained as they descended.  In the south, the way they talk about my Seven Kingdoms, a man forgets that your part is as big as the other six combined.    I trust you enjoyed the journey, Your Grace?   Robert snorted.  Bogs and forests and fields, and scarcely a decent inn north of the Neck. I’ve never seen such a vast emptiness. Where are all your people?    Likely they were too shy to come out,  Ned jested. He could feel the chill coming up the stairs, a cold breath from deep within the earth.  Kings are a rare sight in the north.   Robert snorted.  More likely they were hiding under the snow. Snow, Ned!  The king put one hand on the wall to steady himself as they descended.   Late summer snows are common enough,  Ned said.  I hope they did not trouble you. They are usually mild."
}