{
  "id": "e89637d95cab2247a4ec488615f76209b1730a04",
  "text": "  \"Password?\" said the Fat Lady, jerking out of a doze.  \"Fortuna Major,\" said Harry listlessly.  The portrait swung open and he climbed through the hole into the common room. It was full of chattering first and second years, and a few older students, who had obviously visited Hogsmeade so often the novelty had worn off  \"Harry! Harry! Hi, Harry!\"  It was Colin Creevey, a second year who was deeply in awe of Harry and never missed an opportunity to speak to him.  \"Aren't you going to Hogsmeade, Harry? Why not? Hey\" -- Colin looked eagerly around at his friends -- \"you can come and sit with us, if you like, Harry!\"  \"Er -- no, thanks, Colin,\" said Harry, who wasn't in the mood to have a lot of people staring avidly at the scar on his forehead. \"I -- I've got to go to the library, got to get some work done.\"  After that, he had no choice but to turn right around and head back out of the portrait hole again.  \"What was the point waking me up?\" the Fat Lady called grumpily after him as he walked away.  Harry wandered dispiritedly toward the library, but halfway there he changed his mind; he didn't feel like working. He turned around and came face-to-face with Filch, who had obviously just seen off the last of the Hogsmeade visitors.  \"What are you doing?\" Filch snarled suspiciously.  \"Nothing,\" said Harry truthfully.  \"Nothing!\" spat Filch, his jowls quivering unpleasantly. \"A likely story! Sneaking around on your own -- why aren't you in Hogsmeade buying Stink Pellets and Belch Powder and Whizzing Worms like the rest of your nasty little friends?\"  Harry shrugged.  \"Well, get back to your common room where you belong!\" snapped Filch, and he stood glaring until Harry had passed out of sight.  But Harry didn't go back to the common room; he climbed a staircase, thinking vaguely of visiting the Owlery to see Hedwig, and was walking along another corridor when a voice from inside one of the rooms said, \"Harry?\"  Harry doubled back to see who had spoken and met Professor Lupin, looking around his office door.  \"What are you doing?\" said Lupin, though in a very different voice from Filch. \"Where are Ron and Hermione?\"  \"Hogsmeade,\" said Harry, in a would-be casual voice.  \"Ah,\" said Lupin. He considered Harry for a moment. \"Why don't you come in? I've just taken delivery of a grindylow for our next lesson.\" \"A what?\" said Harry. I  He followed Lupin into his office. In the corner stood a very large tank of water. A sickly green creature with sharp little horns had its face pressed against the glass, pulling faces and flexing its long, spindly fingers.  \"Water demon,\" said Lupin, surveying the grindylow thoughtfully. \"We shouldn't have much difficulty with him, not after the kappas. The trick is to break his grip. You notice the abnormally long fingers? Strong, but very brittle.\"  The grindylow bared its green teeth and then buried itself in a tangle of weeds in a corner.  \"Cup of tea?\" Lupin said, looking around for his kettle. \"I was just thinking of making one.\"  \"All right,\" said Harry awkwardly.  Lupin tapped the kettle with his wand and a blast of steam issued suddenly from the spout.  \"Sit down,\" said Lupin, taking the lid off a dusty tin. \"I've only got teabags, I'm afraid -- but I daresay you've had enough of tea leaves?\"  Harry looked at him. Lupin's eyes were twinkling.  \"How did you know about that?\" Harry asked.  \"Professor McGonagall told me,\" said Lupin, passing Harry a chipped mug of tea. \"You're not worried, are you?\"  \"No,\" said Harry.  He thought for a moment of telling Lupin about the dog he'd seen in Magnolia Crescent but decided not to. He didn't want Lupin to think he was a coward, especially since Lupin alreadv seemed to think he couldn't cope with a boggart.  Something of Harry's thoughts seemed to have shown on his face, because Lupin said, \"Anything worrying you, Harry?\"  \"No,\" Harry lied. He drank a bit of tea and watched the grindylow brandishing a fist at him. \"Yes,\" he said suddenly, putting his tea down on Lupin's desk. \"You know that day we fought the boggart?\"  \"Yes,\" said Lupin slowly.  \"Why didn't you let me fight it?\" said Harry abruptly.  Lupin raised his eyebrows.  \"I would have thought that was obvious, Harry,\" he said, sounding surprised.  Harry, who had expected Lupin to deny that he'd done any such thing, was taken aback.  \"Why?\" he said again.  \"Well,\" said Lupin, frowning slightly, \"I assumed that if the boggart faced you, it would assume the shape of Lord Voldemort.\"  Harry stared. Not only was this the last answer he'd expected, but Lupin had said Voldemort's name. The only person Harry had ever heard say the name aloud (apart from himself) was Professor Dumbledore.  \"Clearly, I was wrong,\" said Lupin, still frowning at Harry. \"But I didn't think it a good idea for Lord Voldemort to materialize in the staffroom. I imagined that people would panic.\"  \"I didn't think of Voldemort,\" said Harry honestly. \"I -- I remembered those dementors.\"  \"I see,\" said Lupin thoughtfully. \"Well, well."
}