{
  "id": "e921660de854644b5ae3d99e01661f7221df0efb",
  "text": " Gregor’s big wooden shield took its share of hits as well, until a dog’s head peeped out from under the star, and elsewhere the raw oak showed through. Clegane would grunt from time to time, and once Tyrion heard him mutter a curse, but otherwise he fought in a sullen silence.  Not Oberyn Martell.  You raped her,  he called, feinting.  You murdered her,  he said, dodging a looping cut from Gregor’s greatsword.  You killed her children,  he shouted, slamming the spearpoint into the giant’s throat, only to have it glance off the thick steel gorget with a screech.   Oberyn is toying with him,  said Ellaria Sand.  That is fool’s play, thought Tyrion.  The Mountain is too bloody big to be any man’s toy.   All around the yard, the throng of spectators was creeping in toward the two combatants, edging forward inch by inch to get a better view. The Kingsguard tried to keep them back, shoving at the gawkers forcefully with their big white shields, but there were hundreds of gawkers and only six of the men in white armor.   You raped her.  Prince Oberyn parried a savage cut with his spearhead.  You murdered her.  He sent the spearpoint at Clegane’s eyes, so fast the huge man flinched back.  You killed her children.  The spear flickered sideways and down, scraping against the Mountain’s breastplate.  You raped her. You murdered her. You killed her children.  The spear was two feet longer than Ser Gregor’s sword, more than enough to keep him at an awkward distance. He hacked at the shaft whenever Oberyn lunged at him, trying to lop off the spearhead, but he might as well have been trying to hack the wings off a fly.  You raped her. You murdered her. You killed her children.  Gregor tried to bull rush, but Oberyn skipped aside and circled round his back.  You raped her. You murdered her. You killed her children.    Be quiet.  Ser Gregor seemed to be moving a little slower, and his greatsword no longer rose quite so high as it had when the contest began.  Shut your bloody mouth.    You raped her,  the prince said, moving to the right.   Enough!  Ser Gregor took two long strides and brought his sword down at Oberyn’s head, but the Dornishman backstepped once more.  You murdered her,  he said.   SHUT UP!  Gregor charged headlong, right at the point of the spear, which slammed into his right breast then slid aside with a hideous steel shriek. Suddenly the Mountain was close enough to strike, his huge sword flashing in a steel blur. The crowd was screaming as well. Oberyn slipped the first blow and let go of the spear, useless now that Ser Gregor was inside it. The second cut the Dornishman caught on his shield. Metal met metal with an ear-splitting clang sending the Red Viper reeling. Ser Gregor followed, bellowing. He doesn’t use words, he just roars like an animal, Tyrion thought. Oberyn’s retreat became a headlong backward flight mere inches ahead of the greatsword as it slashed at his chest, his arms, his head.  The stable was behind him. Spectators screamed and shoved at each other to get out of the way. One stumbled into Oberyn’s back. Ser Gregor hacked down with all his savage strength. The Red Viper threw himself sideways, rolling. The luckless stableboy behind him was not so quick. As his arm rose to protect his face, Gregor’s sword took it off between elbow and shoulder.  Shut UP!  the Mountain howled at the stableboy’s scream, and this time he swung the blade sideways, sending the top half of the lad’s head across the yard in a spray of blood and brains. Hundreds of spectators suddenly seemed to lose all interest in the guilt or innocence of Tyrion Lannister, judging by the way they pushed and shoved at each other to escape the yard.  But the Red Viper of Dorne was back on his feet, his long spear in hand.  Elia,  he called at Ser Gregor.  You raped her. You murdered her. You killed her children. Now say her name.   The Mountain whirled. Helm, shield, sword, surcoat; he was spattered with gore from head to heels.  You talk too much,  he grumbled.  You make my head hurt.    I will hear you say it. She was Elia of Dorne.   The Mountain snorted contemptuously, and came on… and in that moment, the sun broke through the low clouds that had hidden the sky since dawn.  The sun of Dorne, Tyrion told himself, but it was Gregor Clegane who moved first to put the sun at his back. This is a dim and brutal man, but he has a warrior’s instincts.  The Red Viper crouched, squinting, and sent his spear darting forward again. Ser Gregor hacked at it, but the thrust had only been a feint. Off balance, he stumbled forward a step.  Prince Oberyn tilted his dinted metal shield. A shaft of sunlight blazed blindingly off polished gold and copper, into the narrow slit of his foe’s helm. Clegane lifted his own shield against the glare. Prince Oberyn’s spear flashed like lightning and found the gap in the heavy plate, the joint under the arm. The point punched through mail and boiled leather. Gregor gave a choked grunt as the Dornishman twisted his spear and yanked it free."
}