{
  "id": "e944e85d55f0efe410a857dc0df3159bfe410f51",
  "text": "  Flags were waving all over the stadium, the Irish national anthem blared from all sides; the veela were shrinking back into their usual, beautiful selves now, though looking dispirited and forlorn. \"Vell, ve fought bravely,\" said a gloomy voice behind Harry.  He looked around; it was the Bulgarian Minister of Magic. \"You can speak English!\"  said Fudge, sounding outraged. \"And you've been letting me mime everything all day!\"  \"Veil, it vos very funny,\" said the Bulgarian minister, shrugging. \"And as the Irish team performs a lap of honor, flanked by their mascots, the Quidditch World Cup itself is brought into the Top Box!\"  roared Bagman. Harry's eyes were suddenly dazzled by a blinding white light, as the Top Box was magically illuminated so that everyone in the stands could see the inside. Squinting toward the entrance, he saw two panting wizards carrying a vast golden cup into the box, which they handed to Cornelius Fudge, who was still looking very disgruntled that he'd been using sign language all day for nothing. \"Let's have a really loud hand for the gallant losers - Bulgaria!\"  Bagman shouted. And up the stairs into the box came the seven defeated Bulgarian players. The crowd below was applauding appreciatively; Harry could see thousands and thousands of Omniocular lenses flashing and winking in their direction. One by one, the Bulgarians filed between the rows of seats in the box, and Bagman called out the name of each as they shook hands with their own minister and then with Fudge. Krum, who was last in line, looked a real mess.  Two black eyes were blooming spectacularly on his bloody face.  He was still holding the Snitch.  Harry noticed that he seemed much less coordinated on the ground.  He was slightly duck-footed and distinctly round-shouldered.  But when Krum's name was announced, the whole stadium gave him a resounding, earsplitting roar. And then came the Irish team.  Aidan Lynch was being supported by Moran and Connolly; the second crash seemed to have dazed him and his eyes looked strangely unfocused. But he grinned happily as Troy and Quigley lifted the Cup into the air and the crowd below thundered its approval.  Harry's hands were numb with clapping. At last, when the Irish team had left the box to perform another lap of honor on their brooms (Aidan Lynch on the back of Confolly's, clutching hard around his waist and still grinning in a bemused sort of way), Bagman pointed his wand at his throat and muttered, \"Quietus.\" \"They'll be talking about this one for years,\" he said hoarsely, \"a really unexpected twist, that. . . . shame it couldn't have lasted longer. . . . Ah yes... . yes, I owe you. . . how much?\" For Fred and George had just scrambled over the backs of their seats and were standing in front of Ludo Bagman with broad grins on their faces, their hands outstretched.   CHAPTER NINE - THE DARK MARK    Don't tell your mother you've been gambling,\" Mr. Weasley implored Fred and George as they all made their way slowly down the purple-carpeted stairs.   \"Don't worry, Dad,\" said Fred gleefully, \"we've got big plans for this money. We don't want it confiscated.\"   Mr. Weasley looked for a moment as though he was going to ask what these big plans were, but seemed to decide, upon reflection, that he didn't want to know.   They were soon caught up in the crowds now flooding out of the stadium and back to their campsites. Raucous singing was borne toward them on the night air as they retraced their steps along the lantern-lit path, and leprechauns kept shooting over their heads, cackling and waving their lanterns.  When they finally reached the tents, nobody felt like sleeping at all, and given the level of noise around them, Mr. Weasley agreed that they could all have one last cup of cocoa together before turning in.  They were soon arguing enjoyably about the match; Mr. Weasley got drawn into a disagreement about cobbing with Charlie, and it was only when Ginny fell asleep right at the tiny table and spilled hot chocolate all over the floor that Mr. Weasley called a halt to the verbal replays and insisted that everyone go to bed.  Hermione and Ginny went into the next tent, and Harry and the rest of the Weasleys changed into pajamas and clambered into their bunks.  From the other side of the campsite they could still hear much singing and the odd echoing bang. \"Oh I am glad I'm not on duty,\" muttered Mr. Weasley sleepily.  \"I wouldn't fancy having to go and tell the Irish they've got to stop celebrating.\" Harry, who was on a top bunk above Ron, lay staring up at the canvas ceiling of the tent, watching the glow of an occasional leprechaun lantern flying overhead, and picturing again some of Krum's more spectacular moves.  He was itching to get back on his own Firebolt and try out the Wronski Feint. . . . Somehow Oliver Wood had never managed to convey with all his wriggling diagrams what that move was supposed to look like.. . . Harry saw himself in robes that had his name on the back, and imagined the sensation of hearing a hundred-thousand-strong crowd roar, as Ludo Bagman's voice echoed throughout the stadium, \"I give you."
}