{
  "id": "e956b23005410c3c7f534497a89a3ff94e9be7bf",
  "text": "   I don’t. No more than I care if they live or die.    It was you who had Yaya whipped.  It was not a question.   Your sister told me of your threats against my grandsons.  Lord Tywin’s voice was colder than ice.  Did she lie?   Tyrion would not deny it.  I made threats, yes. To keep Alayaya safe. So the Kettleblacks would not misuse her.    To save a whore’s virtue, you threatened your own House, your own kin? Is that the way of it?    You were the one who taught me that a good threat is often more telling than a blow. Not that Joffrey hasn’t tempted me sore a few hundred times. If you’re so anxious to whip people, start with him. But Tommen… why would I harm Tommen? He’s a good lad, and mine own blood.    As was your mother.  Lord Tywin rose abruptly, to tower over his dwarf son.  Go back to your bed, Tyrion, and speak to me no more of your rights to Casterly Rock. You shall have your reward, but it shall be one I deem appropriate to your service and station. And make no mistake—this was the last time I will suffer you to bring shame onto House Lannister. You are done with whores. The next one I find in your bed, I’ll hang.       Davos   He watched the sail grow for a long time, trying to decide whether he would sooner live or die.  Dying would be easier, he knew. All he had to do was crawl inside his cave and let the ship pass by, and death would find him. For days now the fever had been burning through him, turning his bowels to brown water and making him shiver in his restless sleep. Each morning found him weaker. It will not be much longer, he had taken to telling himself.  If the fever did not kill him, thirst surely would. He had no fresh water here, but for the occasional rainfall that pooled in hollows on the rock. Only three days past (or had it been four? On his rock, it was hard to tell the days apart) his pools had been dry as old bone, and the sight of the bay rippling green and grey all around him had been almost more than he could bear. Once he began to drink seawater the end would come swiftly, he knew, but all the same he had almost taken that first swallow, so parched was his throat. A sudden squall had saved him. He had grown so feeble by then that it was all he could do to lie in the rain with his eyes closed and his mouth open, and let the water splash down on his cracked lips and swollen tongue. But afterward he felt a little stronger, and the island’s pools and cracks and crevices once more had brimmed with life.  But that had been three days ago (or maybe four), and most of the water was gone now. Some had evaporated, and he had sucked up the rest. By the morrow he would be tasting the mud again, and licking the damp cold stones at the bottom of the depressions.  And if not thirst or fever, starvation would kill him. His island was no more than a barren spire jutting up out of the immensity of Blackwater Bay. When the tide was low, he could sometimes find tiny crabs along the stony strand where he had washed ashore after the battle. They nipped his fingers painfully before he smashed them apart on the rocks to suck the meat from their claws and the guts from their shells.  But the strand vanished whenever the tide came rushing in, and Davos had to scramble up the rock to keep from being swept out into the bay once more. The point of the spire was fifteen feet above the water at high tide, but when the bay grew rough the spray went even higher, so there was no way to keep dry, even in his cave (which was really no more than a hollow in the rock beneath an overhang). Nothing grew on the rock but lichen, and even the seabirds shunned the place. Now and again some gulls would land atop the spire and Davos would try to catch one, but they were too quick for him to get close. He took to flinging stones at them, but he was too weak to throw with much force, so even when his stones hit the gulls would only scream at him in annoyance and then take to the air.  There were other rocks visible from his refuge, distant stony spires taller than his own. The nearest stood a good forty feet above the water, he guessed, though it was hard to be sure at this distance. A cloud of gulls swirled about it constantly, and often Davos thought of crossing over to raid their nests. But the water was cold here, the currents strong and treacherous, and he knew he did not have the strength for such a swim. That would kill him as sure as drinking seawater.  Autumn in the narrow sea could often be wet and rainy, he remembered from years past. The days were not bad so long as the sun was shining, but the nights were growing colder and sometimes the wind would come gusting across the bay, driving a line of whitecaps before it, and before long Davos would be soaked and shivering. Fever and chills assaulted him in turn, and of late he had developed a persistent racking cough.  His cave was all the shelter he had, and that was little enough. Driftwood and bits of charred debris would wash up on the strand during low tide, but he had no way to strike a spark or start a fire."
}