{
  "id": "e96caa479bdbcfd8820a2621572ea23a852633f9",
  "text": "  \"Why don't you just drop a couple of subjects?\" Harry asked, watching her lifting books as she searched for her rune dictionary.  \"I couldn't do that!\" said Hermione, looking scandalized.  \"Arithmancy looks terrible,\" said Harry, picking up a very complicated-looking number chart.  \"Oh no, it's wonderful!\" said Hermione earnestly. \"It's my favorite subject! It's --\"  But exactly what was wonderful about Arithmancy, Harry never found out. At that precise moment, a strangled yell echoed down the boys' staircase. The whole common room fell silent, staring, petrified, at the entrance. Then came hurried footsteps, growing louder and louder -- and then Ron came leaping into view, dragging with him a bedsheet.  \"LOOK!\" he bellowed, striding over to Hermione's table.  \"LOOK!\" he yelled, shaking the sheets in her face.  \"Ron, what --?\"  \"SCABBERS! LOOK! SCABBERS!\"  Hermione was leaning away from Ron, looking utterly bewildered. Harry looked down at the sheet Ron was holding. There was something red on it. Something that looked horribly like --  \"BLOOD!\" Ron yelled into the stunned silence. \"HE'S GONE! AND YOU KNOW WHAT WAS ON THE FLOOR?\"  \"N -- no,\" said Hermione in a trembling voice.  Ron threw something down onto Hermione's rune translation. Hermione and Harry leaned forward. Lying on top of the weird, spiky shapes were several long, ginger cat hairs.  CHAPTER THIRTEEN  GRYFFINDOR VERSUS RAVENCLAW  It looked like the end of Ron and Hermione's friendship. Each was so angry with the other that Harry couldn't see how they'd ever make up.  Ron was enraged that Hermione had never taken Crookshanks's attempts to eat Scabbers seriously, hadn't bothered to keep a close enough watch on him, and was still trying to pretend that Crookshanks was innocent by suggesting that Ron look for Scabbers under all the boys' beds. Hermione, meanwhile, maintained fiercely that Ron had no proof that Crookshanks had eaten Scabbers, that the ginger hairs might have been there since Christmas, and that Ron had been prejudiced against her cat ever since Crookshanks had landed on Ron's head in the Magical Menagerie.  Personally, Harry was sure that Crookshanks had eaten Scabbers, and when he tried to point out to Hermione that the evidence all pointed that way, she lost her temper with Harry too.  \"Okay, side with Ron, I knew you would!\" she said shrilly. \"First the Firebolt, now Scabbers, everything's my fault, isn't it! just leave me alone, Harry, I've got a lot of work to do!\"  Ron had taken the loss of his rat very hard indeed.  \"Come on, Ron, you were always saying how boring Scabbers was,\" said Fred bracingly. \"And he's been off-color for ages, he was wasting away. It was probably better for him to snuff it quickly -- one swallow -- he probably didn't feel a thing.\"  \"Fred!\" said Ginny indignantly.  \"All he did was eat and sleep, Ron, you said it yourself,\" said George.  \"He bit Goyle for us once!\" Ron said miserably. \"Remember, Harry?\"  \"Yeah, that's true,\" said Harry.  \"His finest hour,\" said Fred, unable to keep a straight face. \"Let the scar on Goyle's finger stand as a lasting tribute to his memory. Oh, come on, Ron, get yourself down to Hogsmeade and buy a new rat, what's the point of moaning?\"  In a last-ditch attempt to cheer Ron up, Harry persuaded him to come along to the Gryffindor team's final practice before the Ravenclaw match, so that he could have a ride on the Firebolt after they'd finished. This did seem to take Ron's mind off Scabbers for a moment (\"Great! Can I try and shoot a few goals on it?\") so they set off for the Quidditch field together.  Madam Hooch, who was still overseeing Gryffindor practices to keep an eye on Harry, was just as impressed with the Firebolt as everyone else had been. She took it in her hands before takeoff and gave them the benefit of her professional opinion.  \"Look at the balance on it! If the Nimbus series has a fault, it's a slight list to the tail end -- you often find they develop a drag after a few years. They've updated the handle too, a bit slimmer than the Cleansweeps, reminds me of the old Silver Arrows -- a Pity they've stopped making them. I learned to fly on one, and a very fine old broom it was too....\"  She continued in this vein for some time, until Wood said, \"Er -- Madam Hooch? Is it okay if Harry has the Firebolt back? We need to practice....\"  \"Oh -- right -- here you are, then, Potter,\" said Madam Hooch. \"I'll sit over here with Weasley....\"  She and Ron left the field to sit in the stadium, and the Gryffindor team gathered around Wood for his final instructions for tomorrow's match.  \"Harry, I've just found out who Ravenclaw is playing as Seeker. It's Cho Chang. She's a fourth year, and she's pretty good.... I really hoped she wouldn't be fit, she's had some problems with injuries....\" Wood scowled his displeasure that Cho Chang had made a full recovery, then said, \"On the other hand, she rides a Comet Two Sixty, which is going to look like a joke next to the Firebolt."
}