{
  "id": "e97328ed9f44743d0fc55d7b7173d7cee76718a0",
  "text": "  When I take King’s Landing, I’ll send you Cersei’s head.   And will that bring my Ned back to me? she thought.  It will be enough to know that justice has been done, my lord.    Your Grace,  Brienne the Blue corrected sharply.  And you should kneel when you approach the king.    The distance between a lord and a grace is a small one, my lady,  Catelyn said.  Lord Renly wears a crown, as does my son. If you wish, we may stand here in the mud and debate what honors and titles are rightly due to each, but it strikes me that we have more pressing matters to consider.   Some of Renly’s lords bristled at that, but the king only laughed.  Well said, my lady. There will be time enough for graces when these wars are done. Tell me, when does your son mean to march against Harrenhal?   Until she knew whether this king was friend or foe, Catelyn was not about to reveal the least part of Robb’s dispositions.  I do not sit on my son’s war councils, my lord.    So long as he leaves a few Lannisters for me, I’ll not complain. What has he done with the Kingslayer?    Jaime Lannister is held prisoner at Riverrun.    Still alive?  Lord Mathis Rowan seemed dismayed.  Bemused, Renly said,  It would seem the direwolf is gentler than the lion.    Gentler than the Lannisters,  murmured Lady Oakheart with a bitter smile,  is drier than the sea.    I call it weak.  Lord Randyll Tarly had a short, bristly grey beard and a reputation for blunt speech.  No disrespect to you, Lady Stark, but it would have been more seemly had Lord Robb come to pay homage to the king himself, rather than hiding behind his mother’s skirts.    King Robb is warring, my lord,  Catelyn replied with icy courtesy,  not playing at tourney.   Renly grinned.  Go softly, Lord Randyll, I fear you’re overmatched.  He summoned a steward in the livery of Storm’s End.  Find a place for the lady’s companions, and see that they have every comfort. Lady Catelyn shall have my own pavilion. Since Lord Caswell has been so kind as to give me use of his castle, I have no need of it. My lady, when you are rested, I would be honored if you would share our meat and mead at the feast Lord Caswell is giving us tonight. A farewell feast. I fear his lordship is eager to see the heels of my hungry horde.    Not true, Your Grace,  protested a wispy young man who must have been Caswell.  What is mine is yours.    Whenever someone said that to my brother Robert, he took them at their word,  Renly said.  Do you have daughters?    Yes, Your Grace. Two.    Then thank the gods that I am not Robert. My sweet queen is all the woman I desire.  Renly held out his hand to help Margaery to her feet.  We’ll talk again when you’ve had a chance to refresh yourself, Lady Catelyn.   Renly led his bride back toward the castle while his steward conducted Catelyn to the king’s green silk pavilion.  If you have need of anything, you have only to ask, my lady.   Catelyn could scarcely imagine what she might need that had not already been provided. The pavilion was larger than the common rooms of many an inn and furnished with every comfort: feather mattress and sleeping furs, a wood-and-copper tub large enough for two, braziers, to keep off the night’s chill, slung leather camp chairs, a writing table with quills and inkpot, bowls of peaches, plums, and pears, a flagon of wine with a set of matched silver cups, cedar chests packed full of Renly’s clothing, books, maps, game boards, a high harp, a tall bow and a quiver of arrows, a pair of red-tailed hunting hawks, a vertible armory of fine weapons. He does not stint himself, this Renly, she thought as she looked about. Small wonder this host moves so slowly.  Beside the entrance, the king’s armor stood sentry; a suit of forest-green plate, its fittings chased with gold, the helm crowned by a great rack of golden antlers. The steel was polished to such a high sheen that she could see her reflection in the breastplate, gazing back at her as if from the bottom of a deep green pond. The face of a drowned woman, Catelyn thought. Can you drown in grief? She turned away sharply, angry with her own frailty. She had no time for the luxury of self-pity. She must wash the dust from her hair and change into a gown more fitting for a king’s feast.  Ser Wendel Manderly, Lucas Blackwood, Ser Perwyn Frey, and the rest of her highborn companions accompanied her to the castle. The great hall of Lord Caswell’s keep was great only by courtesy, yet room was found on the crowded benches for Catelyn’s men, amidst Renly’s own knights. Catelyn was assigned a place on the dais between red-faced Lord Mathis Rowan and genial Ser Jon Fossoway of the green-apple Fossoways. Ser Jon made jests, while Lord Mathis inquired politely after the health of her father, brother, and children.  Brienne of Tarth had been seated at the far end of the high table. She did not gown herself as a lady, but chose a knight’s finery instead, a velvet doublet quartered rose-and-azure, breeches and boots and a fine-tooled swordbelt, her new rainbow cloak flowing down her back."
}