{
  "id": "ea10136d4a85c19206f0109301f9ef87f7796856",
  "text": " Davos threaded their way deftly between the jagged rocks until the cave mouth loomed up before them. He let the waves carry them inside. They crashed around him, slamming the boat this way and that and soaking them to the skin. A half-seen finger of rock came rushing up out of the gloom, snarling foam, and Davos barely kept them off it with an oar.  Then they were past, engulfed in darkness, and the waters smoothed.  The little boat slowed and swirled. The sound of their breathing echoed until it seemed to surround them. Davos had not expected the blackness. The last time, torches had burned all along the tunnel, and the eyes of starving men had peered down through the murder holes in the ceiling. The portcullis was somewhere ahead, he knew. Davos used the oars to slow them, and they drifted against it almost gently.   This is as far as we go, unless you have a man inside to lift the gate for us.  His whispers scurried across the lapping water like a line of mice on soft pink feet.   Have we passed within the walls?    Yes. Beneath. But we can go no farther. The portcullis goes all the way to the bottom. And the bars are too closely spaced for even a child to squeeze through.   There was no answer but a soft rustling. And then a light bloomed amidst the darkness.  Davos raised a hand to shield his eyes, and his breath caught in his throat. Melisandre had thrown back her cowl and shrugged out of the smothering robe. Beneath, she was naked, and huge with child. Swollen breasts hung heavy against her chest, and her belly bulged as if near to bursting.  Gods preserve us,  he whispered, and heard her answering laugh, deep and throaty. Her eyes were hot coals, and the sweat that dappled her skin seemed to glow with a light of its own. Melisandre shone.  Panting, she squatted and spread her legs. Blood ran down her thighs, black as ink. Her cry might have been agony or ecstasy or both. And Davos saw the crown of the child’s head push its way out of her. Two arms wriggled free, grasping, black fingers coiling around Melisandre’s straining thighs, pushing, until the whole of the shadow slid out into the world and rose taller than Davos, tall as the tunnel, towering above the boat. He had only an instant to look at it before it was gone, twisting between the bars of the portcullis and racing across the surface of the water, but that instant was long enough.  He knew that shadow. As he knew the man who’d cast it.      JON  The call came drifting through the black of night. Jon pushed himself onto an elbow, his hand reaching for Longclaw by force of habit as the camp began to stir. The horn that wakes the sleepers, he thought.  The long low note lingered at the edge of hearing. The sentries at the ringwall stood still in their footsteps, breath frosting and heads turned toward the west. As the sound of the horn faded, even the wind ceased to blow. Men rolled from their blankets and reached for spears and swordbelts, moving quietly, listening. A horse whickered and was hushed. For a heartbeat it seemed as if the whole forest were holding its breath. The brothers of the Night’s Watch waited for a second blast, praying they should not hear it, fearing that they would.  When the silence had stretched unbearably long and the men knew at last that the horn would not wind again, they grinned at one another sheepishly, as if to deny that they had been anxious. Jon Snow fed a few sticks to the fire, buckled on his swordbelt, pulled on his boots, shook the dirt and dew from the cloak, and fastened it around his shoulders. The flames blazed up beside him, welcome heat beating against his face as he dressed. He could hear the Lord Commander moving inside the tent. After a moment Mormont lifted the flap.  One blast?  On his shoulder, his raven sat fluffed and silent, looking miserable.   One, my lord,  Jon agreed.  Brothers returning.   Mormont moved to the fire.  The Halfhand. And past time.  He had grown more restive every day they waited; much longer and he would have been fit to whelp cubs.  See that there’s hot food for the men and fodder for the horses. I’ll see Qhorin at once.    I’ll bring him, my lord.  The men from the Shadow Tower had been expected days ago. When they had not appeared, the brothers had begun to wonder. Jon had heard gloomy mutterings around the cookfire, and not just from Dolorous Edd. Ser Ottyn Wythers was for retreating to Castle Black as soon as possible. Ser Mallador Locke would strike for the Shadow Tower, hoping to pick up Qhorin’s trail and learn what had befallen him. And Thoren Smallwood wanted to push on into the mountains.  Mance Rayder knows he must battle the Watch,  Thoren had declared,  but he will never look for us so far north. If we ride up the Milkwater, we can take him unawares and cut his host to ribbons before he knows we are on him.    The numbers would be greatly against us,  Ser Ottyn had objected.  Craster said he was gathering a great host. Many thousands. Without Qhorin, we are only two hundred."
}