{
  "id": "ea60944c3394de4226096f465078573b4489510d",
  "text": " She could not forget the children on their posts, the birds tearing at their entrails, their skinny arms pointing up the coast road.  Ser Jorah, you say we have no food left. If I march west, how can I feed my freedmen?    You can’t. I am sorry, Khaleesi. They must feed themselves or starve. Many and more will die along the march, yes. That will be hard, but there is no way to save them. We need to put this scorched earth well behind us.   Dany had left a trail of corpses behind her when she crossed the red waste. It was a sight she never meant to see again.  No,  she said.  I will not march my people off to die.  My children.  There must be some way into this city.    I know a way.  Brown Ben Plumm stroked his speckled grey-and-white beard.  Sewers.    Sewers? What do you mean?    Great brick sewers empty into the Skahazadhan, carrying the city’s wastes. They might be a way in, for a few. That was how I escaped Meereen, after Scarb lost his head.  Brown Ben made a face.  The smell has never left me. I dream of it some nights.   Ser Jorah looked dubious.  Easier to go out than in, it would seem to me. These sewers empty into the river, you say? That would mean the mouths are right below the walls.    And closed with iron grates,  Brown Ben admitted,  though some have rusted through, else I would have drowned in shit. Once inside, it is a long foul climb in pitch-dark through a maze of brick where a man could lose himself forever. The filth is never lower than waist high, and can rise over your head from the stains I saw on the walls. There’s things down there too. Biggest rats you ever saw, and worse things. Nasty.   Daario Naharis laughed.  As nasty as you, when you came crawling out? If any man were fool enough to try this, every slaver in Meereen would smell them the moment they emerged.   Brown Ben shrugged.  Her Grace asked if there was a way in, so I told her… but Ben Plumm isn’t going down in them sewers again, not for all the gold in the Seven Kingdoms. If there’s others want to try it, though, they’re welcome.   Aggo, Jhogo, and Grey Worm all tried to speak at once, but Dany raised her hand for silence.  These sewers do not sound promising.  Grey Worm would lead his Unsullied down the sewers if she commanded it, she knew; her bloodriders would do no less. But none of them was suited to the task. The Dothraki were horsemen, and the strength of the Unsullied was their discipline on the battlefield. Can I send men to die in the dark on such a slender hope?  I must think on this some more. Return to your duties.   Her captains bowed and left her with her handmaids and her dragons. But as Brown Ben was leaving, Viserion spread his pale white wings and flapped lazily at his head. One of the wings buffeted the sellsword in his face. The white dragon landed awkwardly with one foot on the man’s head and one on his shoulder, shrieked, and flew off again.  He likes you, Ben,  said Dany.   And well he might.  Brown Ben laughed.  I have me a drop of the dragon blood myself, you know.    You?  Dany was startled. Plumm was a creature of the free companies, an amiable mongrel. He had a broad brown face with a broken nose and a head of nappy grey hair, and his Dothraki mother had bequeathed him large, dark, almond-shaped eyes. He claimed to be part Braavosi, part Summer Islander, part Ibbenese, part Qohorik, part Dothraki, part Dornish, and part Westerosi, but this was the first she had heard of Targaryen blood. She gave him a searching look and said,  How could that be?    Well,  said Brown Ben,  there was some old Plumm in the Sunset Kingdoms who wed a dragon princess. My grandmama told me the tale. He lived in King Aegon’s day.    Which King Aegon?  Dany asked.  Five Aegons have ruled in Westeros.  Her brother’s son would have been the sixth, but the Usurper’s men had dashed his head against a wall.   Five, were there? Well, that’s a confusion. I could not give you a number, my queen. This old Plumm was a lord, though, must have been a famous fellow in his day, the talk of all the land. The thing was, begging your royal pardon, he had himself a cock six foot long.   The three bells in Dany’s braid tinkled when she laughed.  You mean inches, I think.    Feet,  Brown Ben said firmly.  If it was inches, who’d want to talk about it, now? Your Grace.   Dany giggled like a little girl.  Did your grandmother claim she’d actually seen this prodigy?    That the old crone never did. She was half-Ibbenese and half-Qohorik, never been to Westeros, my grandfather must have told her. Some Dothraki killed him before I was born.    And where did your grandfather’s knowledge come from?    One of them tales told at the teat, I’d guess.  Brown Ben shrugged.  That’s all I know about Aegon the Unnumbered or old Lord Plumm’s mighty manhood, I fear. I best see to my Sons.    Go do that,  Dany told him.  When Brown Ben left, she lay back on her cushions.  If you were grown,  she told Drogon, scratching him between the horns,  I’d fly you over the walls and melt that harpy down to slag."
}