{
  "id": "ea6a96b6c4b75269df0ab1b1b28f4887add12c12",
  "text": "  He isn't hesitating about which way  to  go. Of course not!  What's the good of Minas Tirith anyway? To him, I mean, begging your  pardon,  Master Boromir,' he added, and turned. It was then that they discovered that  Boromir, who at first had been sitting silent on  the outside of the circle,  was no longer there.       `Now where's he got to? ' cried Sam, looking worried.  'He's been a bit  queer lately, to my mind. But anyway he's  not in this business. He's off to  his  home, as he always said;  and no blame to  him. But Mr. Frodo, he knows  he's got to find the Cracks of Doom,  if  he can. But he's  afraid . Now it's  come to the point, he's just plain terrified. That's what his trouble is. Of  course  he's had  a bit of schooling, so to speak-we  all have-since we left  home, or  he'd be so terrified he'd just  fling  the Ring in the  River  and  bolt. But he's still too frightened to start. And he isn't worrying about us  either: whether we'll  go along with him or no. He knows we mean to.  That's  another thing that's  bothering  him. If  he  screws himself up to go, he'll  want to go alone. Mark my words!  We're going to  have trouble when he  comes  back. For he'll screw himself up all right, as sure as his name's Baggins.'       'I believe  you speak more  wisely than any of us,  Sam,' said Aragorn.  `And what shall we do, if you prove right? '   ####-     'Stop him! Don't let him go! ' cried Pippin.       'I wonder?  '  said Aragorn.  `He is  the Bearer, and  the fate  of the  Burden is on him. I do not think that it is our part to drive him one way or  the  other. Nor  do I  think that we  should succeed, if we tried. There are  other powers at work far stronger.'       `Well, I wish  Frodo would \"screw himself up\" and come back. and let us  get it over,' said Pippin. `This waiting is horrible! Surely the time is up?   '       `Yes,' said Aragorn. 'The hour  is long passed. The morning is  wearing  away. We must call for him.'       At  that  moment Boromir  reappeared.  He  came out from the  trees and  walked  towards them  without speaking.  His  face  looked grim and sad.  He  paused as if counting those that were present, and then sat down aloof, with  his eyes on the ground.       `Where have you been, Boromir? ' asked Aragorn. `Have you seen Frodo? '       Boromir hesitated for  a second.  `Yes,  and no,'  he  answered slowly.  `Yes: I found him some way up the hill,  and I spoke to  him. I urged him to   come to  Minas Tirith and  not to go  east. I grew angry and he  left me. He  vanished. I have  never seen such a thing happen before. though I have heard  of it in tales. He must have put the Ring on. I could not  find him again. I  thought he would return to you.'       'Is that all that you have to say? ' said Aragorn, looking hard and not  too kindly at Boromir.       `Yes,' he answered. `I will say no more yet.'       `This is  bad!' cried Sam, jumping up. `I don't know  what this Man has  been up to. Why should Mr. Frodo put  the thing on? He didn't ought to have;  and if he has, goodness knows what may have happened!'       'But he wouldn't keep it on`' said Merry. `Not when he had  escaped the  unwelcome visitor, like Bilbo used to.'       `But where did he go? Where is he? ' cried Pippin. 'He's been away ages  now.'       `How long is it since you saw Frodo last, Boromir? ' asked Aragorn.       `Half  an hour, maybe,' he answered.  `Or it  might be an hour. I  have  wandered for  some time since.  I do not  know! I do not know! ' He  put his  head in his hands, and sat as if bowed with grief.        `An hour since he vanished! ' shouted Sam. `We must try and find him at  once. Come on! '   ####-     `Wait  a moment!  ' cried Aragorn. `We must  divide up into pairs,  and  arrange-here, hold on! Wait! '       It was no good. They took no notice of him. Sam had dashed  off  first.  Merry  and Pippin  had followed, and were already disappearing westward into  the trees  by  the  shore,  shouting:  Frodo! Frodo!  in  their clear,  high  hobbit-voices. Legolas and  Gimli were running.  A  sudden  panic or madness  seemed to have fallen on the Company.       `We  shall all be scattered and lost,' groaned Aragorn. `Boromir!  I do  not know what part you have played in this mischief, but help  now! Go after  those  two  young hobbits,  and guard them at  the least, even if you cannot  find Frodo. Come back to this spot, if you find him, or any traces of him. I  shall return soon.'       Aragorn  sprang swiftly away and  went in pursuit of  Sam. Just  as  he  reached the  little lawn among the rowans  he  overtook him, toiling uphill,  panting and calling, Frodo!       `Come with me, Sam! '  he said.  `None of us should be alone.  There is  mischief about. I feel it.  I am going to the top, to  the Seat of Amon Hen,  to  see what may be   seen. And look! It is  as  my heart guessed, Frodo went   this way. Follow me, and keep your eyes open! ' He sped up the path.       Sam did his best, but he could not keep up with Strider the Ranger, and  soon fell behind."
}