{
  "id": "ea97a1b18ea297eeb7caf2b116177cd167f34a37",
  "text": " BANG! Several people screamed - Harry felt something white-hot graze the side of his face - he plunged his hand into his robes for his wand, but before he'd even touched it, he heard a second loud BANG, and a roar that echoed through the entrance hall. \"OH NO YOU DON'T, LADDIE!\" Harry spun around. Professor Moody was limping down the marble staircase.  His wand was out and it was pointing right at a pure white ferret, which was shivering on the stone-flagged floor, exactly where Malfoy had been standing. There was a terrified silence in the entrance hall.  Nobody but Moody was moving a muscle.  Moody turned to look at Harry -- at least, his normal eye was looking at Harry; the other one was pointing into the back of his head. \"Did he get you?\"  Moody growled.  His voice was low and gravelly. \"No,\" said Harry, \"missed.\" \"LEAVE IT!\"  Moody shouted. \"Leave - what?\" Harry said, bewildered. \"Not you - him!\" Moody growled, jerking his thumb over his shoulder at Crabbe, who had just frozen, about to pick up the white ferret.  It seemed that Moody's rolling eye was magical and could see out of the back of his head. Moody started to limp toward Crabbe, Goyle, and the ferret, which gave a terrified squeak and took off, streaking toward the dungeons. \"I don't think so!\" roared Moody, pointing his wand at the ferret again - it flew ten feet into the air, fell with a smack to the floor, and then bounced upward once more. \"I don't like people who attack when their opponent's back's turned,\" growled Moody as the ferret bounced higher and higher, squealing in pain.  \"Stinking, cowardly, scummy thing to do...\" The ferret flew through the air, its legs and tail flailing helplessly.   \"Never - do - that - again -\" said Moody, speaking each word as the ferret hit the stone floor and bounced upward again.  \"Professor Moody!\"  said a shocked voice. Professor McGonagall was coming down the marble staircase with her arms full of books. \"Hello, Professor McGonagall,\" said Moody calmly, bouncing the ferret still higher.  \"What - what are you doing?\"  said Professor McGonagall, her eyes following the bouncing ferret's progress through the air. \"Teaching,\" said Moody. \"Teach - Moody, is that a student?\"  shrieked Professor McGonagall, the books spilling out of her arms. \"Yep,\" said Moody. \"No!\"  cried Professor McGonagall, running down the stairs and pulling out her wand; a moment later, with a loud snapping noise, Draco Malfoy had reappeared, lying in a heap on the floor with his sleek blond hair all over his now brilliantly pink face.  He got to his feet, wincing. \"Moody, we never use Transfiguration as a punishment!\" said Professor McGonagall wealdy. \"Surely Professor Dumbledore told you that?\" \"He might've mentioned it, yeah,\" said Moody, scratching his chin unconcernedly, \"but I thought a good sharp shock -\" \"We give detentions, Moody!  Or speak to the offender's Head of House!\" \"I'll do that, then,\" said Moody, staring at Malfoy with great dislike. Malfoy, whose pale eyes were still watering with pain and humiliation, looked malevolently up at Moody and muttered something in which the words \"my father\" were distinguishable. \"Oh yeah?\" said Moody quietly, limping forward a few steps, the dull clunk of his wooden leg echoing around the hall.  \"Well, I know your father of old, boy... . You tell him Moody's keeping a close eye on his son. . . you tell him that from me. . . . Now, your Head of House'll be Snape, will it?\"  \"Yes,\" said Malfoy resentfully. \"Another old friend,\" growled Moody. \"I've been looking forward to a chat with old Snape. . . . Come on, you. . .\" And he seized Malfoy's upper arm and marched him off toward the dungeons. Professor McGonagall stared anxiously after them for a few moments, then waved her wand at her fallen books, causing them to soar up into the air and back into her arms. \"Don't talk to me,\" Ron said quietly to Harry and Hermione as they sat down at the Gryffindor table a few minutes later, surrounded by excited talk on all sides about what had just happened. \"Why not?\" said Hermione in surprise. \"Because I want to fix that in my memory forever,\" said Ron, his eyes closed and an uplifted expression on his face. \"Draco Malfoy, the amazing bouncing ferret.\" Harry and Hermione both laughed, and Hermione began doling beef casserole onto each of their plates. \"He could have really hurt Malfoy, though,\" she said. \"It was good, really, that Professor McGonagall stopped it -\" \"Hermione!\" said Ron furiously, his eyes snapping open again, \"you're ruining the best moment of my life!\" Hermione made an impatient noise and began to eat at top speed again. \"Don't tell me you're going back to the library this evening?\" said Harry, watching her. \"Got to,\" said Hermione thickly. \"Loads to do.\" \"But you told us Professor Vector -\" \"It's not schoolwork,\" she said. Within five minutes, she had cleared her plate and departed.  No sooner had she gone than her seat was taken by Fred Weasley. \"Moody!\" he said. \"How cool is he?\" \"Beyond cool,\" said George, sitting down opposite Fred."
}