{
  "id": "eaacff183faf74f6a4f53a0b10bbf410555d3c0a",
  "text": " Maester Luwin is a wise counsellor, but unskilled in the arts of war.    Have no fear on that count, Lady Stark,  the Greatjon told her in his bass rumble.  Winterfell is safe. We’ll shove our swords up Tywin Lannister’s bunghole soon enough, begging your pardons, and then it’s on to the Red Keep to free Ned.    My lady, a question, as it please you.  Roose Bolton, Lord of the Dreadfort, had a small voice, yet when he spoke larger men quieted to listen. His eyes were curiously pale, almost without color, and his look disturbing.  It is said that you hold Lord Tywin’s dwarf son as captive. Have you brought him to us? I vow, we should make good use of such a hostage.    I did hold Tyrion Lannister, but no longer,  Catelyn was forced to admit. A chorus of consternation greeted the news.  I was no more pleased than you, my lords. The gods saw fit to free him, with some help from my fool of a sister.  She ought not to be so open in her contempt, she knew, but her parting from the Eyrie had not been pleasant. She had offered to take Lord Robert with her, to foster him at Winterfell for a few years. The company of other boys would do him good, she had dared to suggest. Lysa’s rage had been frightening to behold.  Sister or no,  she had replied,  if you try to steal my son, you will leave by the Moon Door.  After that there was no more to be said.  The lords were anxious to question her further, but Catelyn raised a hand.  No doubt we will have time for all this later, but my journey has fatigued me. I would speak with my son alone. I know you will forgive me, my lords.  She gave them no choice; led by the ever-obliging Lord Hornwood, the bannermen bowed and took their leave.  And you, Theon,  she added when Greyjoy lingered. He smiled and left them.  There was ale and cheese on the table. Catelyn tilled a horn, sat, sipped, and studied her son. He seemed taller than when she’d left, and the wisps of beard did make him look older.  Edmure was sixteen when he grew his first whiskers.    I will be sixteen soon enough,  Robb said.   And you are fifteen now. Fifteen, and leading a host to battle. Can you understand why I might fear, Robb?   His look grew stubborn.  There was no one else.    No one?  she said.  Pray, who were those men I saw here a moment ago? Roose Bolton, Rickard Karstark, Galbart and Robett Glover, the Greatjon, Helman Tallhart… you might have given the command to any of them. Gods be good, you might even have sent Theon, though he would not be my choice.    They are not Starks,  he said.   They are men, Robb, seasoned in battle. You were fighting with wooden swords less than a year past.   She saw anger in his eyes at that, but it was gone as quick as it came, and suddenly he was a boy again.  I know,  he said, abashed.  Are you… are you sending me back to Winterfell?   Catelyn sighed.  I should. You ought never have left. Yet I dare not, not now. You have come too far. Someday these lords will look to you as their liege. If I pack you off now, like a child being sent to bed without his supper, they will remember, and laugh about it in their cups. The day will come when you need them to respect you, even fear you a little. Laughter is poison to fear. I will not do that to you, much as I might wish to keep you safe.    You have my thanks, Mother,  he said, his relief obvious beneath the formality.  She reached across his table and touched his hair.  You are my firstborn, Robb. I have only to look at you to remember the day you came into the world, red-faced and squalling.   He rose, clearly uncomfortable with her touch, and walked to the hearth. Grey Wind rubbed his head against his leg.  You know… about Father?    Yes.  The reports of Robert’s sudden death and Ned’s fall had frightened Catelyn more than she could say, but she would not let her son see her fear.  Lord Manderly told me when I landed at White Harbor. Have you had any word of your sisters?    There was a letter,  Robb said, scratching his direwolf under the jaw.  One for you as well, but it came to Winterfell with mine.  He went to the table, rummaged among some maps and papers, and returned with a crumpled parchment.  This is the one she wrote me, I never thought to bring yours.   Something in Robb’s tone troubled her. She smoothed out the paper and read. Concern gave way to disbelief, then to anger, and lastly to fear.  This is Cersei’s letter, not your sister’s,  she said when she was done.  The real message is in what Sansa does not say. All this about how kindly and gently the Lannisters are treating her… I know the sound of a threat, even whispered. They have Sansa hostage, and they mean to keep her.    There’s no mention of Arya,  Robb pointed out, miserable.   No.  Catelyn did not want to think what that might mean, not now, not here.   I had hoped… if you still held the Imp, a trade of hostages…  He took Sansa’s letter and crumpled it in his fist, and she could tell from the way he did it that it was not the first time.  Is there word from the Eyrie? I wrote to Aunt Lysa, asking help."
}