{
  "id": "eaf7f7a327aac29d3290a892450348622588e074",
  "text": "  Assuming you are on my side…    Can you doubt it?    Why no, I trust you implicitly.  A bitter laugh echoed off the shuttered windows.  I trust you like one of my own blood, in truth. Now tell me how Cortnay Penrose died.    It is said that he threw himself from a tower.    Threw himself? No, I will not believe that!    His guards saw no man enter his chambers, nor did they find any within afterward.    Then the killer entered earlier and hid under the bed,  Tyrion suggested,  or he climbed down from the roof on a rope. Perhaps the guards are lying. Who’s to say they did not do the thing themselves?    Doubtless you are right, my lord.   His smug tone said otherwise.  But you do not think so? How was it done, then?   For a long moment Varys said nothing. The only sound was the stately clack of horseshoes on cobbles. Finally the eunuch cleared his throat.  My lord, do you believe in the old powers?    Magic, you mean?  Tyrion said impatiently.  Bloodspells, curses, shapeshifting, those sorts of things?  He snorted.  Do you mean to suggest that Ser Cortnay was magicked to his death?    Ser Cortnay had challenged Lord Stannis to single combat on the morning he died. I ask you, is this the act of a man lost to despair? Then there is the matter of Lord Renly’s mysterious and most fortuitous murder, even as his battle lines were forming up to sweep his brother from the field.  The eunuch paused a moment.  My lord, you once asked me how it was that I was cut.    I recall,  said Tyrion.  You did not want to talk of it.    Nor do I, but…  This pause was longer than the one before, and when Varys spoke again his voice was different somehow.  I was an orphan boy apprenticed to a traveling folly. Our master owned a fat little cog and we sailed up and down the narrow sea performing in all the Free Cities and from time to time in Oldtown and King’s Landing.   One day at Myr, a certain man came to our folly. After the performance, he made an offer for me that my master found too tempting to refuse. I was in terror. I feared the man meant to use me as I had heard men used small boys, but in truth the only part of me he had need of was my manhood. He gave me a potion that made me powerless to move or speak, yet did nothing to dull my senses. With a long hooked blade, he sliced me root and stem, chanting all the while. I watched him burn my manly parts on a brazier. The flames turned blue, and I heard a voice answer his call, though I did not understand the words they spoke.   The mummers had sailed by the time he was done with me. Once I had served his purpose, the man had no further interest in me, so he put me out. When I asked him what I should do now, he answered that he supposed I should die. To spite him, I resolved to live. I begged, I stole, and I sold what parts of my body still remained to me. Soon I was as good a thief as any in Myr, and when I was older I learned that often the contents of a man’s letters are more valuable than the contents of his purse.   Yet I still dream of that night, my lord. Not of the sorcerer, nor his blade, nor even the way my manhood shriveled as it burned. I dream of the voice. The voice from the flames. Was it a god, a demon, some conjurer’s trick? I could not tell you, and I know all the tricks. All I can say for a certainty is that he called it, and it answered, and since that day I have hated magic and all those who practice it. If Lord Stannis is one such, I mean to see him dead.   When he was done, they rode in silence for a time. Finally Tyrion said,  A harrowing tale. I’m sorry.   The eunuch sighed.  You are sorry, but you do not believe me. No, my lord, no need to apologize. I was drugged and in pain and it was a very long time ago and far across the sea. No doubt I dreamed that voice. I’ve told myself as much a thousand times.    I believe in steel swords, gold coins, and men’s wits,  said Tyrion.  And I believe there once were dragons. I’ve seen their skulls, after all.    Let us hope that is the worst thing you ever see, my lord.    On that we agree.  Tyrion smiled.  And for Ser Cortnay’s death, well, we know Stannis hired sellsails from the Free Cities. Perhaps he bought himself a skilled assassin as well.    A very skilled assassin.    There are such. I used to dream that one day I’d be rich enough to send a Faceless Man after my sweet sister.    Regardless of how Ser Cortnay died,  said Varys,  he is dead, the castle fallen. Stannis is free to march.    Any chance we might convince the Dornishmen to descend on the Marches?  asked Tyrion.   None.    A pity. Well, the threat may serve to keep the Marcher lords close to their castles, at least. What news of my father?    If Lord Tywin has won across the Red Fork, no word has reached me yet. If he does not hasten, he may be trapped between his foes. The Oakheart leaf and the Rowan tree have been seen north of the Mander.    No word from Littlefinger?    Perhaps he never reached Bitterbridge. Or perhaps he’s died there. Lord Tarly has seized Renly’s stores and put a great many to the sword; Florents, chiefly."
}