{
  "id": "eb212ae30722eefa07b24e78642e1d3fa094cd70",
  "text": " This seemed to cheer Ron up.  \"... and until Hagrid told me, I didn't know anything about be ing a wizard or about my parents or Voldemort\"  Ron gasped.  \"What?\" said Harry.  \"You said You-Know-Who's name!\" said Ron, sounding both shocked and impressed. \"I'd have thought you, of all people --\"  \"I'm not trying to be brave or anything, saying the name,\" said Harry, I just never knew you shouldn't. See what I mean? I've got loads to learn.... I bet,\" he added, voicing for the first time something that had been worrying him a lot lately, \"I bet I'm the worst in the class.\"  \"You won't be. There's loads of people who come from Muggle families and they learn quick enough.\"  While they had been talking, the train had carried them out of London. Now they were speeding past fields full of cows and sheep. They were quiet for a time, watching the fields and lanes flick past.  Around half past twelve there was a great clattering outside in the corridor and a smiling, dimpled woman slid back their door and said, \"Anything off the cart, dears?\"  Harry, who hadn't had any breakfast, leapt to his feet, but Ron's ears went pink again and he muttered that he'd brought sandwiches. Harry went out into the corridor.  He had never had any money for candy with the Dursleys, and now that he had pockets rattling with gold and silver he was ready to buy as many Mars Bars as he could carry -- but the woman didn't have Mars Bars. What she did have were Bettie Bott's Every Flavor Beans, Drooble's Best Blowing Gum, Chocolate Frogs. Pumpkin Pasties, Cauldron Cakes, Licorice Wands, and a number of other strange things Harry had never seen in his life. Not wanting to miss anything, he got some of everything and paid the woman eleven silver Sickles and seven bronze Knuts.  Ron stared as Harry brought it all back in to the compartment and tipped it onto an empty seat.  \"Hungry, are you?\"  \"Starving,\" said Harry, taking a large bite out of a pumpkin pasty.  Ron had taken out a lumpy package and unwrapped it. There were four sandwiches inside. He pulled one of them apart and said, \"She always forgets I don't like corned beef.\"  \"Swap you for one of these,\" said Harry, holding up a pasty. \"Go on --\"  \"You don't want this, it's all dry,\" said Ron. \"She hasn't got much time,\" he added quickly, \"you know, with five of us.\"  \"Go on, have a pasty,\" said Harry, who had never had anything to share before or, indeed, anyone to share it with. It was a nice feeling, sitting there with Ron, eating their way through all Harry's pasties, cakes, and candies (the sandwiches lay forgotten).  \"What are these?\" Harry asked Ron, holding up a pack of Chocolate Frogs. \"They're not really frogs, are they?\" He was starting to feel that nothing would surprise him.  \"No,\" said Ron. \"But see what the card is. I'm missing Agrippa.\"  \"What?\"  \"Oh, of course, you wouldn't know -- Chocolate Frogs have cards, inside them, you know, to collect -- famous witches and wizards. I've got about five hundred, but I haven't got Agrippa or Ptolemy.\"  Harry unwrapped his Chocolate Frog and picked up the card. It showed a man's face. He wore half- moon glasses, had a long, crooked nose, and flowing silver hair, beard, and mustache. Underneath the picture was the name Albus Dumbledore.  \"So this is Dumbledore!\" said Harry.  \"Don't tell me you'd never heard of Dumbledore!\" said Ron. \"Can I have a frog? I might get Agrippa -- thanks  Harry turned over his card and read:  ALBUS DUMBLEDORE  CURRENTLY HEADMASTER OF HOGWARTS  Considered by many the greatest wizard of modern times, Dumbledore is particularly famous for his defeat of the dark wizard Grindelwald in 1945, for the discovery of the twelve uses of dragon's blood, and his work on alchemy with his partner, Nicolas Flamel. Professor Dumbledore enjoys chamber music and tenpin bowling.  Harry turned the card back over and saw, to his astonishment, that Dumbledore's face had disappeared.  \"He's gone!\"  \"Well, you can't expect him to hang around all day,\" said Ron. \"He'll be back. No, I've got Morgana again and I've got about six of her... do you want it? You can start collecting.\"  Ron's eyes strayed to the pile of Chocolate Frogs waiting to be unwrapped.  \"Help yourself,\" said Harry. \"But in, you know, the Muggle world, people just stay put in photos.\"  \"Do they? What, they don't move at all?\" Ron sounded amazed. \"weird!\"  Harry stared as Dumbledore sidled back into the picture on his card and gave him a small smile. Ron was more interested in eating the frogs than looking at the Famous Witches and Wizards cards, but Harry couldn't keep his eyes off them. Soon he had not only Dumbledore and Morgana, but Hengist of Woodcroft, Alberic Grunnion, Circe, Paracelsus, and Merlin. He finally tore his eyes away from the druidess Cliodna, who was scratching her nose, to open a bag of Bertie Bott's Every Flavor Beans.  \"You want to be careful with those,\" Ron warned Harry. \"When they say every flavor, they mean every flavor -- you know, you get all the ordinary ones like chocolate and peppermint and mar- malade, but then you can get spinach and liver and tripe."
}