{
  "id": "eb4aeb670bc3b2f77fed58d6c60ba686268c3472",
  "text": "  Misery  me!  I  have  heard  songs  of  many  battles,  and  I  have  always  understood  that  defeat  may  be  glorious. It seems very uncomfortable, not to say distressing. I wish I was well out  of it.\"  The  clouds  were  torn  by  the  wind,  and  a  red  sunset  slashed  the West.  Seeing  the  sudden  gleam  in  the  gloom  Bilbo  looked  round. He  gave  a  great  cry:  he  had  seen  a  sight  that  made  his  heart  leap,  dark  shapes  small  yet  majestic  against  the  distant glow.   \"The Eagles! The Eagles!\" he shouted. \"The Eagles are coming!\"   ####-Bilbo's eyes were seldom wrong. The eagles were coming down the wind, line  after line, in such a host as must have gathered from all the eyries of the North.  \"The  Eagles!  the  Eagles!\"  Bilbo  cried,  dancing  and  waving  his  arms.  If  the  elves could not see him they could hear him. Soon they too took up the cry, and it  echoed  across  the  valley. Many wondering  eyes  looked up,  though as yet nothing  could be seen except from the southern shoulders of the Mountain.  \"The Eagles!\" cried Bilbo once more, but at that moment a stone hurtling from  above smote heavily on his helm, and he fell with a crash and knew no more.   ####-<h4>Chapter 18</h4> <br>   The Return Journey     When Bilbo came  to himself, he was  literally by himself. He was  lying on  the  flat stones of Ravenhill, and no one was near. A cloudless day, but cold, was broad  above him. He was shaking, and as chilled as stone, but his head burned with fire.  \"Now I wonder what has happened?\" he said to himself. \"At any rate I am not  yet one of the fallen heroes; but I suppose there is still time enough for that!\"  He  sat  up  painfully.  Looking  into  the  valley  he  could  see  no  living  goblins.  After  a while as his head cleared a  little, he  thought he could see elves moving  in  the  rocks  below.  He  rubbed  his  eyes.  Surely  there  was  a  camp  still  in  the  plain  some  distance  off;  and  there  was  a  coming  and  going  about  the  Gate?  Dwarves  seemed  to  be  busy  removing  the wall. But  all was deadly  still. There was no  call  and  no  echo  of  a  song.  Sorrow  seemed  to  be  in  the  air.  \"Victory  after  all,  I  suppose!\"  he  said,  feeling  his  aching  head.  \"Well,  it  seems  a  very  gloomy  business.\"  Suddenly he was aware of a man climbing up and coming towards him.  \"Hullo there!\" he called with a shaky voice. \"Hullo there! What news?\"  \"What  voice  is  it  that  speaks  among  the  stones?\"  said  the  man  halting  and  peering about him not far from where Bilbo sat.  Then Bilbo remembered his ring! \"Well I'm blessed!\" said he. \"This invisibility  has  its  drawbacks  after  all.  Otherwise  I  suppose  I  might  have  spent  a  warm  and  comfortable night in bed!\"  \"It's me, Bilbo Baggins,  companion  of Thorin!\"  he  cried,  hurriedly  taking  off  the ring.  \"It  is  well  that  I  have  found  you!\"  said  the  man  striding  forward.  \"You  are  needed and we have looked for you long. You would have been numbered among  the  dead,  who  are many,  if  Gandalf  the  wizard  had  not  said  that  your  voice  was  last  heard  in  this  place.  I  have  been  sent  to  look  here  for  the  last  time.  Are  you  much hurt?\"  \"A  nasty  knock  on  the  head,  I  think,\"  said  Bilbo.  \"But  I  have  a  helm  and  a  hard skull. All the same I feel sick and my legs are like straws.\"  \"I  will  carry  you  down  to  the  camp  in  the  valley,\"  said  the man,  and  picked  him lightly up.  The man was swift and sure-footed. It was not long before Bilbo was set down  before  a  tent  in Dale;  and  there  stood Gandalf, with  his  arm  in  a  sling.  Even  the   ####-wizard had not escaped without a wound; and  there were  few unharmed in all the  host.  When Gandalf saw Bilbo, he was delighted. \"Baggins!\" he exclaimed. \"Well I  never! Alive after all – 1 am glad! I began to wonder if even your luck would see  you through! A terrible business, and it nearly was disastrous. But other news can  wait. Come!\" he said more gravely. \"You are called for;\" and leading the hobbit he  took him within the tent.  \"Hail! Thorin,\" he said as he entered. \"I have brought him.\"  There  indeed  lay  Thorin  Oakenshield,  wounded  with  many  wounds,  and  his  rent  armour  and  notched  axe  were  cast  upon  the  floor.  He  looked  up  as  Bilbo  came beside him.  \"Farewell,  good  thief,\"  he  said.  \"I  go  now  to  the  halls  of waiting  to  sit  beside  my  fathers,  until  the world  is  renewed. Since  I  leave  now  all  gold  and  silver,  and  go  where  it  is  of  little  worth,  I  wish  to  part  in  friendship  from  you,  and  I  would  take back my words and deeds at the Gate.\"  Bilbo  knelt  on  one  knee  filled  with  sorrow.  \"Farewell,  King  under  the  Mountain!\"  he  said.  \"This  is  a  bitter  adventure,  if  it  must  end  so;  and  not  a  mountain  of  gold  can  amend  it. Yet  I  am  glad  that  I  have  shared  in  your  perils  –  that has been more than any Baggins deserves."
}