{
  "id": "ebc1b0c1617b1abce702f5976ac7e87b4163d0d9",
  "text": " Crouch's feet. \"But she was frightened!\"  Hermione burst out angrily, glaring at Mr. Crouch.  \"Your elf's scared of heights, and those wizards in masks were levitating people!  You can't blame her for wanting to get out of their way!\" Mr. Crouch took a step backward, freeing himself from contact with the elf, whom he was surveying as though she were something filthy and rotten that was contaminating his over-shined shoes. \"I have no use for a house-elf who disobeys me,\" he said coldly,  looking over at Hermione.  \"I have no use for a servant who forgets what is due to her master, and to her master's reputation.\" Winky was crying so hard that her sobs echoed around the clearing.  There was a very nasty silence, which was ended by Mr. Weasley, who said quietly, \"Well, I think I'll take my lot back to the tent, if nobody's got any objections.  Amos, that wand's told us all it can - if Harry could have it back, please -\" Mr. Diggory handed Harry his wand and Harry pocketed it. \"Come on, you three,\" Mr. Weasley said quietly.  But Hermione didn't seem to want to move; her eyes were still upon the sobbing elf.  \"Hermione!\" Mr. Weasley said, more urgently. She turned and followed Harry and Ron out of the clearing and off through the trees. \"What's going to happen to Winky?\" said Hermione, the moment they had left the clearing. \"I don't know,\" said Mr. Weasley. \"The way they were treating her!\" said Hermione furiously. \"Mr. Diggory, calling her 'elf' all the time. . . and Mr. Crouch!  He knows she didn't do it and he's still going to sack her! He didn't care how frightened she'd been, or how upset she was - it was like she wasn't even human!\" \"Well, she's not,\" said Ron. Hermione rounded on him. \"That doesn't mean she hasn't got feelings, Ron.  It's disgusting the way -\" \"Hermione, I agree with you,\" said Mr. Weasley quickly, beckoning her on, \"but now is not the time to discuss elf rights.  I want to get back to the tent as fast as we can. What happened to the others?\"  \"We lost them in the dark,\" said Ron.  \"Dad, why was everyone so uptight about that skull thing?\" \"I'll explain everything back at the tent,\" said Mr. Weasley tensely. But when they reached the edge of the wood, their progress was impeded. A large crowd of frightened-looking witches and wizards was congregated there, and when they saw Mr. Weasley coming toward them, many of them surged forward. \"What's going on in there?\" \"Who conjured it?\" \"Arthur - it's not - Him?\" \"Of course it's not Him,\" said Mr. Weasley impatiently. \"We don't know who it was; it looks like they Disapparated.  Now excuse me, please, I want to get to bed.\" He led Harry, Ron, and Hermione through the crowd and back into the campsite.  All was quiet now; there was no sign of the masked wizards, though several ruined tents were still smoking. Charlie's head was poking out of the boys' tent. \"Dad, what's going on?\" he called through the dark. \"Fred, George, and Ginny got back okay, but the others -\" \"I've got them here,\" said Mr. Weasley, bending down and entering the tent. Harry, Ron, and Hermione entered after him. Bill was sitting at the small kitchen table, holding a bedsheet to his arm, which was bleeding profusely. Charlie had a large rip in his shirt, and Percy was sporting a bloody nose. Fred, George, and Ginny looked unhurt, though shaken. \"Did you get them, Dad?\" said Bill sharply. \"The person who conjured the Mark?\" \"No,\" said Mr. Weasley. \"We found Barry Crouch's elf holding Harry's wand, but we're none the wiser about who actually conured the Mark.\" \"What?\" said Bill, Charlie, and Percy together. \"Harry's wand?\" said Fred. \"Mr. Crouch's elf\" said Percy, sounding thunderstruck. With some assistance from Harry, Ron, and Hermione, Mr. Weasley explained what had happened in the woods.  When they had finished their story, Percy swelled indignantly. \"Well, Mr. Crouch is quite right to get rid of an elf like that!\"  he said.  \"Running away when he'd expressly told her not to. . . embarrassing him in front of the whole Ministry. . . how would that have looked, if she'd been brought up in front of the Department for the Regulation and Control -\" \"She didn't do anything - she was just in the wrong place at the wrong time!\"  Hermione snapped at Percy, who looked very taken aback.  Hermione had always got on fairly well with Percy - better, indeed, than any of the others. \"Hermione, a wizard in Mr. Crouch's position can't afford a house-elf who's going to run amok with a wand!\"  said Percy pompously, recovering himself. \"She didn't run amok!\" shouted Hermione. \"She just picked it up off the ground!\" \"Look, can someone just explain what that skull thing was?\"  said Ron impatiently.  \"It wasn't hurting anyone. . . . Why's it such a big deal?\" \"I told you, it's You-Know-Who's symbol, Ron,\" said Hermione, before anyone else could answer.  \"I read about it in The Rise and Fall of the Dark Arts.\" \"And it hasn't been seen for thirteen years,\" said Mr. Weasley quietly. \"Of course people panicked."
}