{
  "id": "ebd6d3373122052e26f8fcf59dda328e6f58d1fc",
  "text": "  City’s starving, it’s a crime to waste food. You have any wine?   Next he’ll want me to pour it for him, Tyrion thought darkly.  You go too far,  he warned.   And you never go far enough.  Bronn tossed the wingbone to the rushes.  Ever think how easy life would be if the other one had been born first?  He thrust his fingers inside the capon and tore off a handful of breast.  The weepy one, Tommen. Seems like he’d do whatever he was told, as a good king should.   A chill crept down Tyrion’s spine as he realized what the sellsword was hinting at. If Tommen was king…  There was only one way Tommen would become king. No, he could not even think it. Joffrey was his own blood, and Jaime’s son as much as Cersei’s.  I could have your head off for saying that,  he told Bronn, but the sellsword only laughed.   Friends,  said Varys,  quarreling will not serve us. I beg you both, take heart.    Whose?  asked Tyrion sourly. He could think of several tempting choices.      DAVOS  Ser Cortnay Penrose wore no armor. He sat a sorrel stallion, his standard-bearer a dapple grey. Above them flapped Baratheon’s crowned stag and the crossed quills of Penrose, white on a russet field. Ser Cortnay’s spade-shaped beard was russet as well, though he’d gone wholly bald on top. If the size and splendor of the king’s party impressed him, it did not show on that weathered face.  They trotted up with much clinking of chain and rattle of plate. Even Davos wore mail, though he could not have said why; his shoulders and lower back ached from the unaccustomed weight. It made him feel cumbered and foolish, and he wondered once more why he was here. It is not for me to question the king’s commands, and yet…  Every man of the party was of better birth and higher station than Davos Seaworth, and the great lords glittered in the morning sun. Silvered steel and gold inlay brightened their armor, and their warhelms were crested in a riot of silken plumes, feathers, and cunningly wrought heraldic beasts with gemstone eyes. Stannis himself looked out of place in this rich and royal company. Like Davos, the king was plainly garbed in wool and boiled leather, though the circlet of red gold about his temples lent him a certain grandeur. Sunlight flashed off its flame-shaped points whenever he moved his head.  This was the closest Davos had come to His Grace in the eight days since Black Betha had joined the rest of the fleet off Storm’s End. He’d sought an audience within an hour of his arrival, only to be told that the king was occupied. The king was often occupied, Davos learned from his son Devan, one of the royal squires. Now that Stannis Baratheon had come into his power, the lordlings buzzed around him like flies round a corpse. He looks half a corpse too, years older than when I left Dragonstone. Devan said the king scarcely slept of late.  Since Lord Renly died, he has been troubled by terrible nightmares,  the boy had confided to his father.  Maester’s potions do not touch them. Only the Lady Melisandre can soothe him to sleep.   Is that why she shares his pavilion now? Davos wondered. To pray with him? Or does she have another way to soothe him to sleep? it was an unworthy question, and one he dared not ask, even of his own son. Devan was a good boy, but he wore the flaming heart proudly on his doublet, and his father had seen him at the nightfires as dusk fell, beseeching the Lord of Light to bring the dawn. He is the king’s squire, he told himself, it is only to be expected that he would take the king’s god.  Davos had almost forgotten how high and thick the walls of Storm’s End loomed up close. King Stannis halted beneath them, a few feet from Ser Cortnay and his standard-bearer.  Ser,  he said with stiff courtesy. He made no move to dismount.   My lord.  That was less courteous, but not unexpected.   It is customary to grant a king the style Your Grace,  announced Lord Florent. A red gold fox poked its shining snout out from his breastplate through a circle of lapis lazuli flowers. Very tall, very courtly, and very rich, the Lord of Brightwater Keep had been the first of Renly’s bannermen to declare for Stannis, and the first to renounce his old gods and take up the Lord of Light. Stannis had left his queen on Dragonstone along with her uncle Axell, but the queen’s men were more numerous and powerful than ever, and Alester Florent was the foremost.  Ser Cortnay Penrose ignored him, preferring to address Stannis.  This is a notable company. The great lords Estermont, Errol, and Varner. Ser Jon of the green-apple Fossoways and Ser Bryan of the red. Lord Caron and Ser Guyard of King Renly’s Rainbow Guard… and the puissant Lord Alester Florent of Brightwater, to be sure. Is that your Onion Knight I spy to the rear? Well met, Ser Davos. I fear I do not know the lady.    I am named Melisandre, ser.  She alone came unarmored, but for her flowing red robes. At her throat the great ruby drank the daylight.  I serve your king, and the Lord of Light."
}