{
  "id": "ec3a7aeec36f3ca4a7fc06d380f5c0a04e1548ec",
  "text": " His mouth was stiff and sore, as if a punch had split his lip.  And drink. Wine. No poppy.   The maester rose flush-faced and hurried off. He came back with a flagon of pale amber wine and a small silvered looking glass in an ornate golden frame. Sitting on the edge of the bed, he poured half a cup of wine and held it to Tyrion’s swollen lips. The trickle went down cool, though he could hardly taste it.  More,  he said when the cup was empty. Maester Ballabar poured again. By the end of the second cup, Tyrion Lannister felt strong enough to face his face.  He turned over the glass, and did not know whether he ought to laugh or cry. The gash was long and crooked, starting a hair under his left eye and ending on the right side of his jaw. Three-quarters of his nose was gone, and a chunk of his lip. Someone had sewn the torn flesh together with catgut, and their clumsy stitches were still in place across the seam of raw, red, half-healed flesh.  Pretty,  he croaked, flinging the glass aside.  He remembered now. The bridge of boats, Ser Mandon Moore, a hand, a sword coming at his face. If I had not pulled back, that cut would have taken off the top of my head. Jaime had always said that Ser Mandon was the most dangerous of the Kingsguard, because his dead empty eyes gave no hint to his intentions. I should never have trusted any of them. He’d known that Ser Meryn and Ser Boros were his sister’s, and Ser Osmund later, but he had let himself believe that the others were not wholly lost to honor. Cersei must have paid him to see that I never came back from the battle. Why else? I never did Ser Mandon any harm that I know of. Tyrion touched his face, plucking at the proud flesh with blunt thick fingers. Another gift from my sweet sister.  The maester stood beside the bed like a goose about to take flight.  My lord, there, there will most like be a scar…    Most like?  His snort of laughter turned into a wince of pain. There would be a scar, to be sure. Nor was it likely that his nose would be growing back anytime soon. It was not as if his face had ever been fit to look at.  Teach me, not to, play with, axes.  His grin felt tight.  Where, are we? What, what place?  It hurt to talk, but Tyrion had been too long in silence.   Ah, you are in Maegor’s Holdfast, my lord. A chamber over the Queen’s Ballroom. Her Grace wanted you kept close, so she might watch over you herself.   I’ll wager she did.  Return me,  Tyrion commanded.  Own bed. Own chambers.  Where I will have my own men about me, and my own maester too, if I find one I can trust.   Your own… my lord, that would not be possible. The King’s Hand has taken up residence in your former chambers.    I. Am. King’s Hand.  He was growing exhausted by the effort of speaking, and confused by what he was hearing.  Maester Ballabar looked distressed.  No, my lord, I… you were wounded, near death. Your lord father has taken up those duties now. Lord Tywin, he…    Here?    Since the night of the battle. Lord Tywin saved us all. The smallfolk say it was King Renly’s ghost, but wiser men know better. It was your father and Lord Tyrell, with the Knight of Flowers and Lord Littlefinger. They rode through the ashes and took the usurper Stannis in the rear. It was a great victory, and now Lord Tywin has settled into the Tower of the Hand to help His Grace set the realm to rights, gods be praised.    Gods be praised,  Tyrion repeated hollowly. His bloody father and bloody Littlefinger and Renly’s ghost?  I want…  Who do I want? He could not tell pink Ballabar to fetch him Shae. Who could he send for, who could he trust? Varys? Bronn? Ser Jacelyn?  …my squire,  he finished.  Pod. Payne.  It was Pod on the bridge of boats, the lad saved my life.   The boy? The odd boy?    Odd boy. Podrick. Payne. You go. Send him.    As you will, my lord.  Maester Ballabar bobbed his head and hurried out. Tyrion could feel the strength seeping out of him as he waited. He wondered how long he had been here, asleep. Cersei would have me sleep forever, but I won’t be so obliging.  Podrick Payne entered the bedchamber timid as a mouse.  My lord?  He crept close to the bed. How can a boy so bold in battle be so frightened in a sickroom? Tyrion wondered.  I meant to stay by you, but the maester sent me away.    Send him away. Hear me. Talk’s hard. Need dreamwine. Dreamwine, not milk of the poppy. Go to Frenken. Frenken, not Ballabar. Watch him make it. Bring it here.  Pod stole a glance at Tyrion’s face, and just as quickly averted his eyes. Well, I cannot blame him for that.  I want,  Tyrion went on,  mine own. Guard. Bronn. Where’s Bronn?    They made him a knight.   Even frowning hurt.  Find him. Bring him.    As you say. My lord. Bronn.   Tyrion seized the lad’s wrist.  Ser Mandon?   The boy flinched.  I n-never meant to k-k-k-k—    Dead? You’re, certain? Dead?   He shuffled his feet, sheepish.  Drowned.    Good. Say nothing. Of him. Of me. Any of it. Nothing.   By the time his squire left, the last of Tyrion’s strength was gone as well."
}