{
  "id": "ec50225a19049540bed4b758772691aecf1ffe69",
  "text": "  Tyrion pushed forward.  MY LORDS!  he shouted. He had to shout, to have any hope of being heard.  His father raised a hand. Bit by bit, the hall grew silent.   Get this lying whore out of my sight,  said Tyrion,  and I will give you your confession.   Lord Tywin nodded, gestured. Shae looked half in terror as the gold cloaks formed up around her. Her eyes met Tyrion’s as they marched her from the wall. Was it shame he saw there, or fear? He wondered what Cersei had promised her. You will get the gold or jewels, whatever it was you asked for, he thought as he watched her back recede, but before the moon has turned she’ll have you entertaining the gold cloaks in their barracks.  Tyrion stared up at his father’s hard green eyes with their flecks of cold bright gold.  Guilty,  he said,  so guilty. Is that what you wanted to hear?   Lord Tywin said nothing. Mace Tyrell nodded. Prince Oberyn looked mildly disappointed.  You admit you poisoned the king?    Nothing of the sort,  said Tyrion.  Of Joffrey’s death I am innocent. I am guilty of a more monstrous crime.  He took a step toward his father.  I was born. I lived. I am guilty of being a dwarf, I confess it. And no matter how many times my good father forgave me, I have persisted in my infamy.    This is folly, Tyrion,  declared Lord Tywin.  Speak to the matter at hand. You are not on trial for being a dwarf.    That is where you err, my lord. I have been on trial for being a dwarf my entire life.    Have you nothing to say in your defense?    Nothing but this: I did not do it. Yet now I wish I had.  He turned to face the hall, that sea of pale faces.  I wish I had enough poison for you all. You make me sorry that I am not the monster you would have me be, yet there it is. I am innocent, but I will get no justice here. You leave me no choice but to appeal to the gods. I demand trial by battle.    Have you taken leave of your wits?  his father said.   No, I’ve found them. I demand trial by battle!   His sweet sister could not have been more pleased.  He has that right, my lords,  she reminded the judges.  Let the gods judge. Ser Gregor Clegane will stand for Joffrey. He returned to the city the night before last, to put his sword at my service.   Lord Tywin’s face was so dark that for half a heartbeat Tyrion wondered if he’d drunk some poisoned wine as well. He slammed his fist down on the table, too angry to speak. It was Mace Tyrell who turned to Tyrion and asked the question.  Do you have a champion to defend your innocence?    He does, my lord.  Prince Oberyn of Dorne rose to his feet.  The dwarf has quite convinced me.   The uproar was deafening. Tyrion took especial pleasure in the sudden doubt he glimpsed in Cersei’s eyes. It took a hundred gold cloaks pounding the butts of their spears against the floor to quiet the throne room again. By then Lord Tywin Lannister had recovered himself.  Let the issue be decided on the morrow,  he declared in iron tones.  I wash my hands of it.  He gave his dwarf son a cold angry look, then strode from the hall, out the king’s door behind the Iron Throne, his brother Kevan at his side.  Later, back in his tower cell, Tyrion poured himself a cup of wine and sent Podrick Payne off for cheese, bread, and olives. He doubted whether he could keep down anything heavier just now. Did you think I would go meekly, Father? he asked the shadow his candles etched upon the wall. I have too much of you in me for that. He felt strangely at peace, now that he had snatched the power of life and death from his father’s hands and placed it in the hands of the gods. Assuming there are gods, and they give a mummer’s fart. If not, then I’m in Dornish hands. No matter what happened, Tyrion had the satisfaction of knowing that he’d kicked Lord Tywin’s plans to splinters. If Prince Oberyn won, it would further inflame Highgarden against the Dornish; Mace Tyrell would see the man who crippled his son helping the dwarf who almost poisoned his daughter to escape his rightful punishment. And if the Mountain triumphed, Doran Martell might well demand to know why his brother had been served with death instead of the justice Tyrion had promised him. Dorne might crown Myrcella after all.  It was almost worth dying to know all the trouble he’d made. Will you come to see the end, Shae? Will you stand there with the rest, watching as Ser Ilyn lops my ugly head off? Will you miss your giant of Lannister when he’s dead? He drained his wine, flung the cup aside, and sang lustily.      He rode through the streets of the city,  down from his hill on high,  O’er the wynds and the steps and the cobbles,  he rode to a woman’s sigh.  For she was his secret treasure,  she was his shame and his bliss.  And a chain and a keep are nothing,  compared to a woman’s kiss.      Ser Kevan did not visit him that night. He was probably with Lord Tywin, trying to placate the Tyrells. I have seen the last of that uncle, I fear. He poured another cup of wine. A pity he’d had Symon Silver Tongue killed before learning all the words of that song."
}