{
  "id": "ec605f7d6f04ca901783e627183b918b1f7ad6b2",
  "text": " I would have given him my favor. I gave him everything. He is mine now. Not Catelyn’s and not yours.   All of Sansa’s resolve had withered in the face of her aunt’s onslaught. Lysa Arryn was frightening her as much as Queen Cersei ever had.  He’s yours, my lady,  she said, trying to sound meek and contrite.  May I have your leave to go?    You may not.  Her aunt’s breath smelled of wine.  If you were anyone else, I would banish you. Send you down to Lord Nestor at the Gates of the Moon, or back to the Fingers. How would you like to spend your life on that bleak shore, surrounded by slatterns and sheep pellets? That was what my father meant for Petyr. Everyone thought it was because of that stupid duel with Brandon Stark, but that wasn’t so. Father said I ought to thank the gods that so great a lord as Jon Arryn was willing to take me soiled, but I knew it was only for the swords. I had to marry Jon, or my father would have turned me out as he did his brother, but it was Petyr I was meant for. I am telling you all this so you will understand how much we love each other, how long we have suffered and dreamed of one another. We made a baby together, a precious little baby.  Lysa put her hands flat against her belly, as if the child was still there.  When they stole him from me, I made a promise to myself that I would never let it happen again. Jon wished to send my sweet Robert to Dragonstone, and that sot of a king would have given him to Cersei Lannister, but I never let them… no more than I’ll let you steal my Petyr Littlefinger. Do you hear me, Alayne or Sansa or whatever you call yourself? Do you hear what I am telling you?    Yes. I swear, I won’t ever kiss him again, or… or entice him.  Sansa thought that was what her aunt wanted to hear.   So you admit it now? It was you, just as I thought. You are as wanton as your mother.  Lysa grabbed her by the wrist.  Come with me now. There is something I want to show you.    You’re hurting me.  Sansa squirmed.  Please, Aunt Lysa, I haven’t done anything. I swear it.   Her aunt ignored her protests.  Marillion!  she shouted.  I need you, Marillion! I need you!   The singer had remained discreetly in the rear of the hall, but at Lady Arryn’s shout he came at once.  My lady?    Play us a song. Play ‘The False and the Fair.’   Marillions fingers brushed the strings.  The lord he came a-riding upon a rainy day, hey-nonny, hey-nonny, hey-nonny-hey…   Lady Lysa pulled at Sansa’s arm. It was either walk or be dragged, so she chose to walk, halfway down the hall and between a pair of pillars, to a white weirwood door set in the marble wall. The door was firmly closed, with three heavy bronze bars to hold it in place, but Sansa could hear the wind outside worrying at its edges. When she saw the crescent moon carved in the wood, she planted her feet.  The Moon Door.  She tried to yank free.  Why are you showing me the Moon Door?    You squeak like a mouse now, but you were bold enough in the garden, weren’t you? You were bold enough in the snow.    The lady sat a-sewing upon a rainy day,  Marillion sang.  Hey-nonny, hey-nonny, hey-nonny-hey.    Open the door,  Lysa commanded.  Open it, I say. You will do it, or I’ll send for my guards.  She shoved Sansa forward.  Your mother was brave, at least. Lift off the bars.   If I do as she says, she will let me go. Sansa grabbed one of the bronze bars, yanked it loose, and tossed it down. The second bar clattered to the marble, then the third. She had barely touched the latch when the heavy wooden door flew inward and slammed back against the wall with a bang. Snow had piled up around the frame, and it all came blowing in at them, borne on a blast of cold air that left Sansa shivering. She tried to step backward, but her aunt was behind her. Lysa seized her by the wrist and put her other hand between her shoulder blades, propelling her forcefully toward the open door.  Beyond was white sky, falling snow, and nothing else.   Look down,  said Lady Lysa.  Look down.   She tried to wrench free, but her aunt’s fingers were digging into her arm like claws. Lysa gave her another shove, and Sansa shrieked. Her left foot broke through a crust of snow and knocked it loose. There was nothing in front of her but empty air, and a waycastle six hundred feet below clinging to the side of the mountain.  Don’t!  Sansa screamed.  You’re scaring me!  Behind her, Marillion was still playing his woodharp and singing,  Hey-nonny, hey-nonny, hey-nonny-hey.    Do you still want my leave to go? Do you?    No.  Sansa planted her feet and tried to squirm backward, but her aunt did not budge.  Not this way. Please…  She put a hand up, her fingers scrabbling at the doorframe, but she could not get a grip, and her feet were sliding on the wet marble floor. Lady Lysa pressed her forward inexorably. Her aunt outweighed her by three stone.  The lady lay a-kissing, upon a mound of hay,  Marillion was singing. Sansa twisted sideways, hysterical with fear, and one foot slipped out over the void."
}