{
  "id": "ec775da69426126a620039cdd29d3b5441c1e346",
  "text": " He didn't feel much like going into the matter with this boy.  \"Oh, sorry,\" said the other,. not sounding sorry at all. \"But they were our kind, weren't they?\"  \"They were a witch and wizard, if that's what you mean.\"  \"I really don't think they should let the other sort in, do you? They're just not the same, they've never been brought up to know our ways. Some of them have never even heard of Hogwarts until they get the letter, imagine. I think they should keep it in the old wizarding families. What's your surname, anyway?\"  But before Harry could answer, Madam Malkin said, \"That's you done, my dear,\" and Harry, not sorry for an excuse to stop talking to the boy, hopped down from the footstool.  \"Well, I'll see you at Hogwarts, I suppose,\" said the drawling boy.  Harry was rather quiet as he ate the ice cream Hagrid had bought him (chocolate and raspberry with chopped nuts).  \"What's up?\" said Hagrid.  \"Nothing,\" Harry lied. They stopped to buy parchment and quills. Harry cheered up a bit when he found a bottle of ink that changed color as you wrote. When they had left the shop, he said, \"Hagrid, what's Quidditch?\"  \"Blimey, Harry, I keep forgettin' how little yeh know -- not knowin' about Quidditch!\"  \"Don't make me feel worse,\" said Harry. He told Hagrid about the pate boy in Madam Malkin's.  \"--and he said people from Muggle families shouldn't even be allowed in.\"  \"Yer not from a Muggle family. If he'd known who yeh were -- he's grown up knowin' yer name if his parents are wizardin' folk. You saw what everyone in the Leaky Cauldron was like when they saw yeh. Anyway, what does he know about it, some o' the best I ever saw were the only ones with magic in 'em in a long line 0' Muggles -- look at yer mum! Look what she had fer a sister!\"  \"So what is Quidditch?\"  \"It's our sport. Wizard sport. It's like -- like soccer in the Muggle world -- everyone follows Quidditch -- played up in the air on broomsticks and there's four balls -- sorta hard ter explain the rules.\" \"And what are Slytherin and Hufflepuff?\"  \"School houses. There's four. Everyone says Hufflepuff are a lot o' duffers, but --\"  \"I bet I'm in Hufflepuff\" said Harry gloomily.  \"Better Hufflepuff than Slytherin,\" said Hagrid darkly. \"There's not a single witch or wizard who went bad who wasn't in Slytherin. You-Know-Who was one.\"  \"Vol-, sorry - You-Know-Who was at Hogwarts?\"  \"Years an' years ago,\" said Hagrid.  They bought Harry's school books in a shop called Flourish and Blotts where the shelves were stacked to the ceiling with books as large as paving stones bound in leather; books the size of postage stamps in covers of silk; books full of peculiar symbols and a few books with nothing in them at all. Even Dudley, who never read anything, would have been wild to get his hands on some of these. Hagrid almost had to drag Harry away from Curses and Countercurses (Bewitch Your Friends and Befuddle Your Enemies with the Latest Revenges: Hair Loss, Jelly-Legs, Tongue- Tying and Much, Much More) by Professor Vindictus Viridian.  \"I was trying to find out how to curse Dudley.\"  \"I'm not sayin' that's not a good idea, but yer not ter use magic in the Muggle world except in very special circumstances,\" said Hagrid. \"An' anyway, yeh couldn' work any of them curses yet, yeh'll need a lot more study before yeh get ter that level.\"  Hagrid wouldn't let Harry buy a solid gold cauldron, either (\"It says pewter on yer list\"), but they got a nice set of scales for weighing potion ingredients and a collapsible brass telescope. Then they visited the Apothecary, which was fascinating enough to make up for its horrible smell, a mixture of bad eggs and rotted cabbages. Barrels of slimy stuff stood on the floor; jars of herbs, dried roots, and bright powders lined the walls; bundles of feathers, strings of fangs, and snarled claws hung from the ceiling. While Hagrid asked the man behind the counter for a supply of some basic potion ingredients for Harry, Harry himself examined silver unicorn horns at twenty-one Galleons each and minuscule, glittery-black beetle eyes (five Knuts a scoop).  Outside the Apothecary, Hagrid checked Harry's list again.  \"Just yer wand left - A yeah, an' I still haven't got yeh a birthday present.\"  Harry felt himself go red.  \"You don't have to --\"  \"I know I don't have to. Tell yeh what, I'll get yer animal. Not a toad, toads went outta fashion years ago, yeh'd be laughed at - an' I don' like cats, they make me sneeze. I'll get yer an owl. All the kids want owls, they're dead useful, carry yer mail an' everythin'.\"  Twenty minutes later, they left Eeylops Owl Emporium, which had been dark and full of rustling and flickering, jewel-bright eyes. Harry now carried a large cage that held a beautiful snowy owl, fast asleep with her head under her wing. He couldn't stop stammering his thanks, sounding just like Professor Quirrell.  \"Don' mention it,\" said Hagrid gruffly. \"Don' expect you've had a lotta presents from them Dursleys. Just Ollivanders left now - only place fer wands, Ollivanders, and yeh gotta have the best wand."
}