{
  "id": "ece9695a3cc31164203a1b5ce6ca281269fde0a5",
  "text": " What is more they made him hungry; so this  time he tried something a bit more difficult and more unpleasant:     It cannot be seen, cannot be felt,  Cannot be heard, cannot be smelt.   ####-It lies behind stars and under hills,  And empty holes it fills.  It comes first and follows after,   Ends life, kills laughter.      Unfortunately  for  Gollum  Bilbo  had  heard  that  sort  of  thing  before;  and  the  answer  was  all  round  him  anyway.  \"Dark!\"  he  said  without  even  scratching  his  head or putting on his thinking cap.     A box without hinges, key, or lid,  Yet golden treasure inside is hid,     he asked  to gain  time, until he could  think of a really hard one. This he  thought a  dreadfully  easy  chestnut,  though  he  had  not  asked  it  in  the  usual  words.  But  it  proved a nasty poser for Gollum. He hissed to himself, and still he did not answer;  he whispered and spluttered.  After  some  while  Bilbo  became  impatient.  \"Well,  what  is  it?\"  he  said.  \"The  answer's  not  a  kettle  boiling  over,  as  you  seem  to  think  from  the  noise  you  are  making.\"  \"Give us a chance; let it give us a chance, my preciouss-ss-ss.\"  \"Well,\" said Bilbo, after giving him a long chance, \"what about your guess?\"  But  suddenly  Gollum  remembered  thieving  from  nests  long  ago,  and  sitting  under  the  river bank  teaching his grandmother,  teaching his grandmother  to suck- \"Eggses!\" he hissed. \"Eggses it is!\" Then he asked:     A live without breath,  As cold as death;  Never thirsty, ever drinking,  All in mail never clinking.     He  also  in  his  turn  thought  this  was  a  dreadfully  easy  one,  because  he  was  always  thinking  of  the  answer. But  he  could  not  remember  anything  better  at  the  moment,  he was  so  flustered  by  the  egg-question. All  the  same  it was  a poser  for  poor  Bilbo,  who  never  had  anything  to  do  with  the  water  if  he  could  help  it.  I  imagine you know the answer, of course, or can guess it as easy as winking, since  you  are  sitting  comfortably  at  home  and  have  not  the  danger  of  being  eaten  to  disturb  your  thinking.  Bilbo  sat  and  cleared  his  throat  once  or  twice,  but  no  answer came.   ####-After  a  while  Gollum  began  to  hiss  with  pleasure  to  himself:  \"Is  it  nice,  my  preciousss? Is it juicy? Is it scrumptiously crunchable?\" He began to peer at Bilbo  out of the darkness.  \"Half  a  moment,\"  said  the  hobbit  shivering.  \"I  gave  you  a  good  long  chance  just now.\"  \"It must make  haste,  haste!\"  said Gollum,  beginning  to  climb  out  of  his  boat  on to the shore to get at Bilbo. But when he put his long webby foot in the water, a  fish jumped out in a fright and fell on Bilbo's toes.  \"Ugh!\"  he  said,  \"it  is  cold  and  clammy!\"-and  so  he  guessed.  \"Fish!  Fish!\"  he  cried. \"It is fish!\"  Gollum was  dreadfully  disappointed;  but Bilbo  asked  another  riddle  as  quick  as ever be could, so that Gollum had to get back into his boat and think.    No-legs lay on one-leg, two-legs sat near on three-legs, four-legs got some.    It was not really the right time for this riddle, but Bilbo was in a hurry. Gollum  might  have  had  some  trouble  guessing  it,  if  he  had  asked  it  at  another time. As it  was,  talking  of  fish,  \"no-legs\" was not so very difficult, and after that the rest was  easy. \"Fish on a  little  table, man at  table sitting on a stool,  the cat has  the bones\"- that  of  course  is  the  answer,  and  Gollum  soon  gave  it.  Then  he  thought  the  time  had come to ask something hard and horrible. This is what he said:     This thing all things devours:   Birds, beasts, trees, flowers;   Gnaws iron, bites steel;  Grinds hard stones to meal;  Slays king, ruins town,  And beats high mountain down.     Poor  Bilbo  sat  in  the  dark  thinking  of  all  the  horrible  names  of  all  the  giants  and ogres he had ever heard told of in tales, but not one of them had done all these  things.  He  had  a  feeling  that  the  answer  was  quite  different  and  that  he  ought  to  know it, but he could not think of it. He began to get frightened, and that is bad for  thinking.  Gollum  began  to  get  out  of  his  boat.  He  flapped  into  the  water  and  paddled  to  the  bank;  Bilbo  could  see  his  eyes  coming  towards  him.  His  tongue  seemed  to  stick  in  his mouth; he wanted  to  shout out:  \"Give me more  time! Give  me time!\" But all that came out with a sudden squeal was:  \"Time! Time!\"   ####-Bilbo was saved by pure luck. For that of course was the answer.   Gollum was  disappointed  once more;  and  now  he was  getting  angry,  and also  tired  of  the  game.  It  had made  him  very  hungry  indeed.  This  time  he  did  not  go  back  to  the  boat.  He  sat  down  in  the  dark  by  Bilbo.  That  made  the  hobbit  most  dreadfully uncomfortable and scattered his wits.  \"It's  got  to  ask  uss  a  quesstion, my  preciouss, yes, yess, yesss."
}