{
  "id": "ee05acdb42f2822c9a0d6381da20036a3bf265d5",
  "text": "  \"The  mountain's  sides  were  green with woods  and  all  the  sheltered  valley  rich  and  pleasant  in  the  days when  the  bells  rang  in  that  town.\" He  looked  both  sad  and  grim  as  he  said  this: he had  been one of Thorin's companions on the day the Dragon came.  They did not dare to follow the river much further to. wards the Gate; but they  went on beyond the end of the southern spur, until lying hidden behind a rock they  could  look  out  and  see  the  dark  cavernous  opening  in  a  great  cliff-wall between  the  arms  of  the Mountain. Out  of  it  the waters  of  the Running River  sprang;  and  out  of  it  too  there  came  a  steam  and  a  dark  smoke. Nothing moved  in  the waste,  save  the  vapour  and  the  water,  and  every  now  and  again  a  black  and  ominous  crow. The only sound was  the sound of  the stony water, and every now and again  the harsh croak of a bird. Balin shuddered.  \"Let us return!\" he said. \"We can do no good here!– And I don't like these dark  birds, they look like spies of evil.\"  \"The dragon is still alive and in the halls under the Mountain then-or I imagine  so from the smoke,\" said the hobbit.  \"That  does  not  prove  it,\"  said Balin,  \"though  I  don't  doubt  you  are  right. But  he might be gone  away  some  time, or  he might be lying out on the mountain-side  keeping watch, and still I expect smokes and steams would come out of the gates:  all the halls within must be filled with his foul reek.\"    With  such  gloomy  thoughts,  followed  ever  by  croaking  crows  above  them,  they made  their weary way  back  to  the  camp. Only  in  June  they  had  been  guests  in  the fair house of Elrond, and  though autumn was now crawling  towards winter   ####-that  pleasant  time  now  seemed  years  ago.  They were  alone  in  the  perilous waste  without  hope  of  further  help. They were  at  the  end  of  their  journey,  but  as  far  as  ever, it seemed, from the end of their quest. None of them had much spirit left.  Now  strange  to  say  Mr.  Baggins  had  more  than  the  others.  He  would  often  borrow Thorin's map  and  gaze  at  it,  pondering over  the  runes and  the message of  the  moon-letters  Elrond  had  read.  It  was  he  that  made  the  dwarves  begin  the  dangerous  search  on  the  western  slopes  for  the  secret  door.  They  moved  their  camp  then  to  a  long  valley,  narrower  than  the  great  dale  in  the  South where  the  Gates  of  the  river  stood,  and  walled  with  lower  spurs  of  the  Mountain.  Two  of  these  here  thrust  forward west  from  the main mass  in  long  steep-sided ridges  that  fell ever downwards towards the plain. On this western side there were fewer signs  of  the  dragon's  marauding  feet,  and  there  was  some  grass  for  their  ponies.  From  this western  camp,  shadowed  all day by  cliff  and wall until  the  sun began  to  sink  towards  the  forest,  day  by  day  they  toiled  in  parties  searching  for  paths  up  the  mountain-side. If the map was true, somewhere high above the cliff at the valley's  head must stand the secret door. Day by day they came back to their camp without  success.  But at  last unexpectedly  they  found what  they were seeking. Fili and Kili and  the  hobbit went  back one day down  the valley and scrambled among  the  tumbled  rocks  at  its  southern  corner.  About  midday,  creeping  behind  a  great  stone  that  stood  alone  like  a  pillar,  Bilbo  came  on  what  looked  like  rough  steps  going  upwards.  Following  these  excitedly  he  and  the dwarves  found  traces of  a narrow  track,  often  lost,  often  rediscovered,  that  wandered  on  to  the  top  of  the  southern  ridge and brought them at last to a still narrower ledge, which turned north across  the  face of  the Mountain. Looking down  they  saw  that they were at the top of the  cliff  at  the  valley's  head  and  were  gazing  down  on  to  their  own  camp  below.  Silently, clinging to the rocky wall on their right, they went in single file along the  ledge,  till  the  wall  opened  and  they  turned  into  a  little  steep-walled  bay,  grassy- floored,  still  and quiet.  Its  entrance which  they had  found  could not be  seen  from  below because of  the overhang of  the  cliff, nor  from  further off because  it was  so  small that it looked like a dark crack and no more. It was not a cave and was open  to  the  sky  above;  but  at  its  inner  end  a  flat  wall  rose  up  that  in  the  lower  I  part,  close  to  the  ground,  was  as  smooth  and  upright  as  mason's  work,  but  without  a  joint or crevice to be seen.  \"No sign was  there of post or  lintel or  threshold, nor any sign of bar or bolt or  key-hole; yet they did not doubt that they had found the door at last.   ####-They  beat  on  it,  they  thrust  and  pushed  at  it,  they  implored  it  to  move,  they  spoke  fragments of broken  spells of opening, and nothing  stirred."
}