{
  "id": "ee077351d8d5bf3e312408f1d20befd7717fccb4",
  "text": "  Harry could hear two voices arguing, coming closer and closer. \"- that's blackmail, that is, we could get into a lot of trouble for that-\" \"- we've tried being polite; it's time to play dirty, like him.  He wouldn't like the Ministry of Magic knowing what he did -\" \"I'm telling you, if you put that in writing, it's blackmail!\" \"Yeah, and you won't be complaining if we get a nice fat payoff, will you?\" The Owlery door banged open. Fred and George came over the threshold, then froze at the sight of Harry, Ron, and Hermione. \"What're you doing here?\"  Ron and Fred said at the same time. \"Sending a letter,\" said Harry and George in unison. \"What, at this time?\"  said Hermione and Fred. Fred grinned. \"Fine - we won't ask you what you're doing, if you don't ask us,\" he said. He was holding a sealed envelope in his hands.  Harry glanced at it, but Fred, whether accidentally or on purpose, shifted his hand so that the name on it was covered. \"Well, don't let us hold you up,\" Fred said, making a mock bow and pointing at the door. Ron didn't move.  \"Who're you blackmailing?\" he said. The grin vanished from Fred's face. Harry saw George half glance at Fred, before smiling at Ron. \"Don't be stupid, I was only joking,\" he said easily. \"Didn't sound like that,\" said Ron. Fred and George looked at each other.  Then Fred said abruptly, \"I've told you before, Ron, keep your nose out if you like it the shape it is.  Can't see why you would, but -\" \"It's my business if you're blackmailing someone,\" said Ron.  \"George's right, you could end up in serious trouble for that.\" \"Told you, I was joking,\" said George.  He walked over to Fred, pulled the letter out of his hands, and began attaching it to the leg of the nearest barn owl.  \"You're starting to sound a bit like our dear older brother, you are, Ron.  Carry on like this and you'll be made a prefect.\" \"No, I won't!\" said Ron hotly. George carried the barn owl over to the window and it took off.  George turned around and grinned at Ron. \"Well, stop telling people what to do then. See you later.\" He and Fred left the Owlery.  Harry, Ron, and Hermione stared at one another. \"You don't think they know something about all this, do you?\"  Hermione whispered. \"About Crouch and everything?\" \"No,\" said Harry.  \"If it was something that serious, they'd tell someone. They'd tell Dumbledore.\" Ron, however, was looking uncomfortable. \"What's the matter?\" Hermione asked him. \"Well. . .\" said Ron slowly, \"I dunno if they would.  They're . . . they're obsessed with making money lately, I noticed it when I was hanging around with them - when - you know -\" \"We weren't talking.\" Harry finished the sentence for him. \"Yeah, but blackmail...\" \"It's this joke shop idea they've got,\" said Ron.  \"I thought they were only saying it to annoy Mum, but they really mean it, they want to start one.  They've only got a year left at Hogwarts, they keep going on about how it's time to think about their future, and Dad can't help them, and they need gold to get started.\" Hermione was looking uncomfortable now. \"Yes, but. . . they wouldn't do anything against the law to get gold.\" \"Wouldn't they?\" said Ron, looking skeptical.  \"I dunno . . . they don't exactly mind breaking rules, do they?\" \"Yes, but this is the law\" said Hermione, looking scared.  \"This isn't some silly school rule. . . . They'll get a lot more than detention for blackmail!  Ron. . . maybe you'd better tell Percy. . . .\" \"Are you mad?\"  said Ron.  \"Tell Percy?  He'd probably do a Crouch and turn them in.\" He stared at the window through which Fred and George's owl had departed, then said, \"Come on, let's get some breakfast.\" \"D'you think it's too early to go and see Professor Moody?\"  Hermione said as they went down the spiral staircase. \"Yes,\" said Harry.  \"He'd probably blast us through the door if we wake him at the crack of dawn; he'll think we're trying to attack him while he's asleep.  Let's give it till break.\" History of Magic had rarely gone so slowly.  Harry kept checking Ron's watch, having finally discarded his own, but Ron's was moving so slowly he could have sworn it had stopped working too.  All three of them were so tired they could happily have put their heads down on the desks and slept; even Hermione wasn't taking her usual notes, but was sitting with her head on her hand, gazing at Professor Binns with her eyes out of focus. When the bell finally rang, they hurried out into the corridors toward the Dark Arts classroom and found Professor Moody leaving it.  He looked as tired as they felt.  The eyelid of his normal eye was drooping, giving his face an even more lopsided appearance than usual. \"Professor Moody?\"  Harry called as they made their way toward him through the crowd. \"Hello, Potter,\" growled Moody.  His magical eye followed a couple of passing first years, who sped up, looking nervous; it rolled into the back of Moody's head and watched them around the corner before he spoke again. \"Come in here.\" He stood back to let them into his empty classroom, limped in after them, and closed the door."
}