{
  "id": "ee2cd038b394592a36bb03aa72c19bb84389c480",
  "text": " Wheat and corn and barley grew high in its fields, and even in Highgarden the pumpkins were no larger nor the fruit any sweeter than here. They stood at the western end of the valley, where the high road crested the last pass and began its winding descent to the bottomlands two miles below. The Vale was narrow here, no more than a half day’s ride across, and the northern mountains seemed so close that Catelyn could almost reach out and touch them. Looming over them all was the jagged peak called the Giant’s Lance, a mountain that even mountains looked up to, its head lost in icy mists three and a half miles above the valley floor. Over its massive western shoulder flowed the ghost torrent of Alyssa’s Tears. Even from this distance, Catelyn could make out the shining silver thread, bright against the dark stone.  When her uncle saw that she had stopped, he moved his horse closer and pointed.  It’s there, beside Alyssa’s Tears. All you can see from here is a flash of white every now and then, if you look hard and the sun hits the walls just right.   Seven towers, Ned had told her, like white daggers thrust into the belly of the sky, so high you can stand on the parapets and look down on the clouds.  How long a ride?  she asked.   We can be at the mountain by evenfall,  Uncle Brynden said,  but the climb will take another day.   Ser Rodrik Cassel spoke up from behind.  My lady,  he said,  I fear I can go no farther today.  His face sagged beneath his ragged, newgrown whiskers, and he looked so weary Catelyn feared he might fall off his horse.   Nor should you,  she said.  You have done all I could have asked of you, and a hundred times more. My uncle will see me the rest of the way to the Eyrie. Lannister must come with me, but there is no reason that you and the others should not rest here and recover your strength.    We should be honored to have them to guest,  Ser Donnel said with the grave courtesy of the young. Beside Ser Rodrik, only Bronn, Ser Willis Wode, and Marillion the singer remained of the party that had ridden with her from the inn by the crossroads.   My lady,  Marillion said, riding forward.  I beg you allow me to accompany you to the Eyrie, to see the end of the tale as I saw its beginnings.  The boy sounded haggard, yet strangely determined; he had a fevered shine to his eyes.  Catelyn had never asked the singer to ride with them; that choice he had made himself, and how he had come to survive the journey when so many braver men lay dead and unburied behind them, she could never say. Yet here he was, with a scruff of beard that made him look almost a man. Perhaps she owed him something for having come this far.  Very well,  she told him.   I’ll come as well,  Bronn announced.  She liked that less well. Without Bronn she would never have reached the Vale, she knew; the sellsword was as fierce a fighter as she had ever seen, and his sword had helped cut them through to safety. Yet for all that, Catelyn misliked the man. Courage he had, and strength, but there was no kindness in him, and little loyalty. And she had seen him riding beside Lannister far too often, talking in low voices and laughing at some private joke. She would have preferred to separate him from the dwarf here and now, but having agreed that Marillion might continue to the Eyrie, she could see no gracious way to deny that same right to Bronn.  As you wish,  she said, although she noted that he had not actually asked her permission.  Ser Willis Wode remained with Ser Rodrik, a soft-spoken septon fussing over their wounds. Their horses were left behind as well, poor ragged things. Ser Donnel promised to send birds ahead to the Eyrie and the Gates of the Moon with the word of their coming. Fresh mounts were brought forth from the stables, surefooted mountain stock with shaggy coats, and within the hour they set forth once again. Catelyn rode beside her uncle as they began the descent to the valley floor. Behind came Bronn, Tyrion Lannister, Marillion, and six of Brynden’s men.  Not until they were a third of the way down the mountain path, well out of earshot of the others, did Brynden Tully turn to her and say,  So, child. Tell me about this storm of yours.    I have not been a child in many years, Uncle,  Catelyn said, but she told him nonetheless. It took longer than she would have believed to tell it all, Lysa’s letter and Bran’s fall, the assassin’s dagger and Littlefinger and her chance meeting with Tyrion Lannister in the crossroads inn.  Her uncle listened silently, heavy brows shadowing his eyes as his frown grew deeper. Brynden Tully had always known how to listen… to anyone but her father. He was Lord Hoster’s brother, younger by five years, but the two of them had been at war as far back as Catelyn could remember. During one of their louder quarrels, when Catelyn was eight, Lord Hoster had called Brynden  the black goat of the Tully flock.  Laughing, Brynden had pointed out that the sigil of their house was a leaping trout, so he ought to be a black fish rather than a black goat, and from that day forward he had taken it as his personal emblem."
}