{
  "id": "ee67b89c5c19739820a92d3f4f15af318183d6fb",
  "text": "   The clans have grown bolder since Lord Jon died,  Ser Donnel said. He was a stocky youth of twenty years, earnest and homely, with a wide nose and a shock of thick brown hair.  If it were up to me, I would take a hundred men into the mountains, root them out of their fastnesses, and teach them some sharp lessons, but your sister has forbidden it. She would not even permit her knights to fight in the Hand’s tourney. She wants all our swords kept close to home, to defend the Vale… against what, no one is certain. Shadows, some say.  He looked at her anxiously, as if he had suddenly remembered who she was.  I hope I have not spoken out of turn, my lady. I meant no offense.    Frank talk does not offend me, Ser Donnel.  Catelyn knew what her sister feared. Not shadows, Lannisters, she thought to herself, glancing back to where the dwarf rode beside Bronn. The two of them had grown thick as thieves since Chiggen had died. The little man was more cunning than she liked. When they had entered the mountains, he had been her captive, bound and helpless. What was he now? Her captive still, yet he rode along with a dirk through his belt and an axe strapped to his saddle, wearing the shadowskin cloak he’d won dicing with the singer and the chainmail hauberk he’d taken off Chiggen’s corpse. Two score men flanked the dwarf and the rest of her ragged band, knights and men-at-arms in service to her sister Lysa and Jon Arryn’s young son, and yet Tyrion betrayed no hint of fear. Could I be wrong? Catelyn wondered, not for the first time. Could he be innocent after all, of Bran and Jon Arryn and all the rest? And if he was, what did that make her? Six men had died to bring him here.  Resolute, she pushed her doubts away.  When we reach your keep, I would take it kindly if you could send for Maester Colemon at once. Ser Rodrik is feverish from his wounds.  More than once she had feared the gallant old knight would not survive the journey. Toward the end he could scarcely sit his horse, and Bronn had urged her to leave him to his fate, but Catelyn would not hear of it. They had tied him in the saddle instead, and she had commanded Marillion the singer to watch over him.  Ser Donnel hesitated before he answered.  The Lady Lysa has commanded the maester to remain at the Eyrie at all times, to care for Lord Robert,  he said.  We have a septon at the gate who tends to our wounded. He can see to your man’s hurts.   Catelyn had more faith in a maester’s learning than a septon’s prayers. She was about to say as much when she saw the battlements ahead, long parapets built into the very stone of the mountains on either side of them. Where the pass shrank to a narrow defile scarce wide enough for four men to ride abreast, twin watchtowers clung to the rocky slopes, joined by a covered bridge of weathered grey stone that arched above the road. Silent faces watched from arrow slits in tower, battlements, and bridge. When they had climbed almost to the top, a knight rode out to meet them. His horse and his armor were grey, but his cloak was the rippling blue-and-red of Riverrun, and a shiny black fish, wrought in gold and obsidian, pinned its folds against his shoulder.  Who would pass the Bloody Gate?  he called.   Ser Donnel Waynwood, with the Lady Catelyn Stark and her companions,  the young knight answered.  The Knight of the Gate lifted his visor.  I thought the lady looked familiar. You are far from home, little Cat.    And you, Uncle,  she said, smiling despite all she had been through. Hearing that hoarse, smoky voice again took her back twenty years, to the days of her childhood.   My home is at my back,  he said gruffly.   Your home is in my heart,  Catelyn told him.  Take off your helm. I would look on your face again.    The years have not improved it, I fear,  Brynden Tully said, but when he lifted off the helm, Catelyn saw that he lied. His features were lined and weathered, and time had stolen the auburn from his hair and left him only grey, but the smile was the same, and the bushy eyebrows fat as caterpillars, and the laughter in his deep blue eyes.  Did Lysa know you were coming?    There was no time to send word ahead,  Catelyn told him. The others were coming up behind her.  I fear we ride before the storm, Uncle.    May we enter the Vale?  Ser Donnel asked. The Waynwoods were ever ones for ceremony.   In the name of Robert Arryn, Lord of the Eyrie, Defender of the Vale, True Warden of the East, I bid you enter freely, and charge you to keep his peace,  Ser Brynden replied.  Come.   And so she rode behind him, beneath the shadow of the Bloody Gate where a dozen armies had dashed themselves to pieces in the Age of Heroes. On the far side of the stoneworks, the mountains opened up suddenly upon a vista of green fields, blue sky, and snowcapped mountains that took her breath away. The Vale of Arryn bathed in the morning light.  It stretched before them to the misty cast, a tranquil land of rich black soil, wide slow-moving rivers, and hundreds of small lakes that shone like mirrors in the sun, protected on all sides by its sheltering peaks."
}