{
  "id": "ef6cb5f3eed20f404a50d35295a4078fc86455a9",
  "text": "  The same,  he admitted.  A great man.   Missandei leaned close to Dany.  He was a butcher in Grazdan’s kitchen,  the girl whispered in her ear.  It was said he could slaughter a pig faster than any man in Astapor.   I have given Astapor a butcher king. Dany felt ill, but she knew she must not let the envoy see it.  I will pray that King Cleon rules well and wisely. What would he have of me?   Ghael rubbed his mouth.  Perhaps we should speak more privily, Your Grace?    I have no secrets from my captains and commanders.    As you wish. Great Cleon bids me declare his devotion to the Mother of Dragons. Your enemies are his enemies, he says, and chief among them are the Wise Masters of Yunkai. He proposes a pact between Astapor and Meereen, against the Yunkai’i.    I swore no harm would come to Yunkai if they released their slaves,  said Dany.   These Yunkish dogs cannot be trusted, Your Worship. Even now they plot against you. New levies have been raised and can be seen drilling outside the city walls, warships are being built, envoys have been sent to New Ghis and Volantis in the west, to make alliances and hire sellswords. They have even dispatched riders to Vaes Dothrak to bring a khalasar down upon you. Great Cleon bid me tell you not to be afraid. Astapor remembers. Astapor will not forsake you. To prove his faith, Great Cleon offers to seal your alliance with a marriage.    A marriage? To me?   Ghael smiled. His teeth were brown and rotten.  Great Cleon will give you many strong sons.   Dany found herself bereft of words, but little Missandei came to her rescue.  Did his first wife give him sons?   The envoy looked at her unhappily.  Great Cleon has three daughters by his first wife. Two of his newer wives are with child. But he means to put all of them aside if the Mother of Dragons will consent to wed him.    How noble of him,  said Dany.  I will consider all you’ve said, my lord.  She gave orders that Ghael be given chambers for the night, somewhere lower in the pyramid.  All my victories turn to dross in my hands, she thought. Whatever I do, all I make is death and horror. When word of what had befallen Astapor reached the streets, as it surely would, tens of thousands of newly freed Meereenese slaves would doubtless decide to follow her when she went west, for fear of what awaited them if they stayed… yet it might well be that worse would await them on the march. Even if she emptied every granary in the city and left Meereen to starve, how could she feed so many? The way before her was fraught with hardship, bloodshed, and danger. Ser Jorah had warned her of that. He’d warned her of so many things… he’d… No, I will not think of Jorah Mormont. Let him keep a little longer.  I shall see this trader captain,  she announced. Perhaps he would have some better tidings.  That proved to be a forlorn hope. The master of the Indigo Star was Qartheen, so he wept copiously when asked about Astapor.  The city bleeds. Dead men rot unburied in the streets, each pyramid is an armed camp, and the markets have neither food nor slaves for sale. And the poor children! King Cleaver’s thugs have seized every highborn boy in Astapor to make new Unsullied for the trade, though it will be years before they are trained.   The thing that surprised Dany most was how unsurprised she was. She found herself remembering Eroeh, the Lhazarene girl she had once tried to protect, and what had happened to her. It will be the same in Meereen once I march, she thought. The slaves from the fighting pits, bred and trained to slaughter, were already proving themselves unruly and quarrelsome. They seemed to think they owned the city now, and every man and woman in it. Two of them had been among the eight she’d hanged. There is no more I can do, she told herself.  What do you want of me, Captain?    Slaves,  he said.  My holds are full to bursting with ivory, ambergris, zorse hides, and other fine goods. I would trade them here for slaves, to sell in Lys and Volantis.    We have no slaves for sale,  said Dany.   My queen?  Daario stepped forward.  The riverside is full of Meereenese, begging leave to be allowed to sell themselves to this Qartheen. They are thicker than the flies.   Dany was shocked.  They want to be slaves?    The ones who come are well spoken and gently born, sweet queen. Such slaves are prized. In the Free Cities they will be tutors, scribes, bed slaves, even healers and priests. They will sleep in soft beds, eat rich foods, and dwell in manses. Here they have lost all, and live in fear and squalor.    I see.  Perhaps it was not so shocking, if these tales of Astapor were true. Dany thought a moment.  Any man who wishes to sell himself into slavery may do so. Or woman.  She raised a hand.  But they may not sell their children, nor a man his wife.    In Astapor the city took a tenth part of the price, each time a slave changed hands,  Missandei told her.   We’ll do the same,  Dany decided. Wars were won with gold as much as swords."
}