{
  "id": "efcfdf45bb36193a9f6a7e99bff150e227c79e06",
  "text": " He was still ahorse, dreaming of a long hot soak, a roast fowl, and a featherbed, when the king’s steward told him that Grand Maester Pycelle had convened an urgent meeting of the small council. The honor of the Hand’s presence was requested as soon as it was convenient.  It will be convenient on the morrow,  Ned snapped as he dismounted.  The steward bowed very low.  I shall give the councillors your regrets, my lord.    No, damn it,  Ned said. It would not do to offend the council before he had even begun.  I will see them. Pray give me a few moments to change into something more presentable.    Yes, my lord,  the steward said.  We have given you Lord Arryn’s former chambers in the Tower of the Hand, if it please you. I shall have your things taken there.    My thanks,  Ned said as he ripped off his riding gloves and tucked them into his belt. The rest of his household was coming through the gate behind him. Ned saw Vayon Poole, his own steward, and called out.  It seems the council has urgent need of me. See that my daughters find their bedchambers, and tell Jory to keep them there. Arya is not to go exploring.  Poole bowed. Ned turned back to the royal steward.  My wagons are still straggling through the city. I shall need appropriate garments.    It will be my great pleasure,  the steward said.  And so Ned had come striding into the council chambers, bone-tired and dressed in borrowed clothing, to find four members of the small council waiting for him.  The chamber was richly furnished. Myrish carpets covered the floor instead of rushes, and in one corner a hundred fabulous beasts cavorted in bright paints on a carved screen from the Summer Isles. The walls were hung with tapestries from Norvos and Qohor and Lys, and a pair of Valyrian sphinxes flanked the door, eyes of polished garnet smoldering in black marble faces.  The councillor Ned liked least, the eunuch Varys, accosted him the moment he entered.  Lord Stark, I was grievous sad to hear about your troubles on the kingsroad. We have all been visiting the sept to light candles for Prince Joffrey. I pray for his recovery.  His hand left powder stains on Ned’s sleeve, and he smelled as foul and sweet as flowers on a grave.   Your gods have heard you,  Ned replied, cool yet polite.  The prince grows stronger every day.  He disentangled himself from the eunuch’s grip and crossed the room to where Lord Renly stood by the screen, talking quietly with a short man who could only be Littlefinger. Renly had been a boy of eight when Robert won the throne, but he had grown into a man so like his brother that Ned found it disconcerting. Whenever he saw him, it was as if the years had slipped away and Robert stood before him, fresh from his victory on the Trident.   I see you have arrived safely, Lord Stark,  Renly said.   And you as well,  Ned replied.  You must forgive me, but sometimes you look the very image of your brother Robert.    A poor copy,  Renly said with a shrug.   Though much better dressed,  Littlefinger quipped.  Lord Renly spends more on clothing than half the ladies of the court.   It was true enough. Lord Renly was in dark green velvet, with a dozen golden stags embroidered on his doublet. A cloth-of-gold half cape was draped casually across one shoulder, fastened with an emerald brooch.  There are worse crimes,  Renly said with a laugh.  The way you dress, for one.   Littlefinger ignored the jibe. He eyed Ned with a smile on his lips that bordered on insolence.  I have hoped to meet you for some years, Lord Stark. No doubt Lady Catelyn has mentioned me to you.    She has,  Ned replied with a chill in his voice. The sly arrogance of the comment rankled him.  I understand you knew my brother Brandon as well.   Renly Baratheon laughed. Varys shuffled over to listen.   Rather too well,  Littlefinger said.  I still carry a token of his esteem. Did Brandon speak of me too?    Often, and with some heat,  Ned said, hoping that would end it. He had no patience with this game they played, this dueling with words.   I should have thought that heat ill suits you Starks,  Littlefinger said.  Here in the south, they say you are all made of ice, and melt when you ride below the Neck.    I do not plan on melting soon, Lord Baelish. You may count on it.  Ned moved to the council table and said,  Maester Pycelle, I trust you are well.   The Grand Maester smiled gently from his tall chair at the foot of the table.  Well enough for a man of my years, my lord,  he replied,  yet I do tire easily, I fear.  Wispy strands of white hair fringed the broad bald dome of his forehead above a kindly face. His maester’s collar was no simple metal choker such as Luwin wore, but two dozen heavy chains wound together into a ponderous metal necklace that covered him from throat to breast. The links were forged of every metal known to man: black iron and red gold, bright copper and dull lead, steel and tin and pale silver, brass and bronze and platinum. Garnets and amethysts and black pearls adorned the metalwork, and here and there an emerald or ruby."
}