{
  "id": "f046fddb9dedd96b78ad90c80c2e675b5605dda4",
  "text": "  She kissed one of the dogs on the nose and grinned at Theon.  All he could do was stand and gape at her. Asha. No. She cannot be Asha. He realized suddenly that there were two Ashas in his head. One was the little girl he had known. The other, more vaguely imagined, looked something like her mother. Neither looked a bit like this… this… this…   The pimples went when the breasts came,  she explained while she tussled with a dog,  but I kept the vulture’s beak.   Theon found his voice.  Why didn’t you tell me?   Asha let go of the hound and straightened.  I wanted to see who you were first. And I did.  She gave him a mocking half bow.  And now, little brother, pray excuse me. I need to bathe and dress for the feast. I wonder if I still have that chainmail gown I like to wear over my boiled leather smallclothes?  She gave him that evil grin, and crossed the bridge with that walk he’d liked so well, half saunter and half sway.  When Theon turned away, Wex was smirking at him. He gave the boy a clout on the ear.  That’s for enjoying this so much.  And another, harder.  And that’s for not warning me. Next time, grow a tongue.   His own chambers in the Guest Keep had never seemed so chilly, though the thralls had left a brazier burning. Theon kicked his boots off, let his cloak fall to the floor, and poured himself a cup of wine, remembering a gawky girl with knob knees and pimples. She unlaced my breeches, he thought, outraged, and she said… oh, gods, and I said… He groaned. He could not possibly have made a more appalling fool of himself.  No, he thought then. She was the one who made me a fool. The evil bitch must have enjoyed every moment of it. And the way she kept reaching for my cock…  He took his cup and went to the window seat, where he sat drinking and watching the sea while the sun darkened over Pyke. I have no place here, he thought, and Asha is the reason, may the Others take her! The water below turned from green to grey to black. By then he could hear distant music, and he knew it was time to change for the feast.  Theon chose plain boots and plainer clothes, somber shades of black and grey to fit his mood. No ornament; he had nothing bought with iron. I might have taken something off that wildling I killed to save Bran Stark, but he had nothing worth the taking. That’s my cursed luck, I kill the poor.  The long smoky hall was crowded with his father’s lords and captains when Theon entered, near four hundred of them. Dagmer Cleftjaw had not yet returned from Old Wyk with the Stonehouses and Drumms, but all the rest were there—Harlaws from Harlaw, Blacktydes from Blacktyde, Sparrs, Merlyns, and Goodbrothers from Great Wyk, Saltcliffes and Sunderlies from Saltcliffe, and Botleys and Wynches from the other side of Pyke. The thralls were pouring ale, and there was music, fiddles and skins and drums. Three burly men were doing the finger dance, spinning short-hafted axes at each other. The trick was to catch the axe or leap over it without missing a step. It was called the finger dance because it usually ended when one of the dancers lost one… or two, or five.  Neither the dancers nor the drinkers took much note of Theon Greyjoy as he strode to the dais. Lord Balon occupied the Seastone Chair, carved in the shape of a great kraken from an immense block of oily black stone. Legend said that the First Men had found it standing on the shore of Old Wyk when they came to the Iron Islands. To the left of the high seat were Theon’s uncles. Asha was ensconced at his right hand, in the place of honor.  You come late, Theon,  Lord Balon observed.   I ask your pardon.  Theon took the empty seat beside Asha. Leaning close, he hissed in her ear,  You’re in my place.   She turned to him with innocent eyes.  Brother, surely you are mistaken. Your place is at Winterfell.  Her smile cut.  And where are all your pretty clothes? I heard you fancied silk and velvet against your skin.  She was in soft green wool herself, simply cut, the fabric clinging to the slender lines of her body.   Your hauberk must have rusted away, sister,  he threw back.  A great pity. I’d like to see you all in iron.   Asha only laughed.  You may yet, little brother… if you think your Sea Bitch can keep up with my Black Wind.  One of their father’s thralls came near, bearing a flagon of wine.  Are you drinking ale or wine tonight, Theon?  She leaned over close.  Or is it still a taste of my mother’s milk you thirst for?   He flushed.  Wine,  he told the thrall. Asha turned away and banged on the table, shouting for ale.  Theon hacked a loaf of bread in half, hollowed out a trencher, and summoned a cook to fill it with fish stew. The smell of the thick cream made him a little ill, but he forced himself to eat some. He’d drunk enough wine to float him through two meals. If I retch, it will be on her.  Does Father know that you’ve married his shipwright?  he asked his sister.   No more than Sigrin does.  She gave a shrug.  Esgred was the first ship he built."
}