{
  "id": "f06277aef8e2f9fd37c0367391c9156895243483",
  "text": "  Krum was still staring at the ground.  Fleur had now taken to retracing Cedric's steps, around and around the tent. And Bagman's commentary made everything much, much worse.. . . Horrible pictures formed in Harry's mind as he heard:  \"Oooh, narrow miss there, very narrow\". . . \"He's taking risks, this one!\". . . \"Clever move - pity it didn't work!\" And then, after about fifteen minutes, Harry heard the deafening roar that could mean only one thing: Cedric had gotten past his dragon and captured the golden egg. \"Very good indeed!\"  Bagman was shouting.  \"And now the marks from the judges!\" But he didn't shout out the marks; Harry supposed the judges were holding them up and showing them to the crowd. \"One down, three to go!\"  Bagman yelled as the whistle blew again.  \"Miss Delacour, if you please!\" Fleur was trembling from head to foot; Harry felt more warmly toward her than he had done so far as she heft the tent with her head held high and her hand clutching her wand.  He and Krum were left alone, at opposite sides of the tent, avoiding each other's gaze. The same process started again. . . .\"Oh I'm not sure that was wise!\"  they could hear Bagman shouting gleefully.  \"Oh. . . nearly!  Careful now. . . good lord, I thought she'd had it then!\" Ten minutes later, Harry heard the crowd erupt into applause once more. . . . Fleur must have been successful too.  A pause, while Fleur's marks were being shown. . . more clapping.. . then, for the third time, the whistle. \"And here comes Mr. Krum!\"  cried Bagman, and Krum slouched out, leaving Harry quite alone. He felt much more aware of his body than usual; very aware of the way his heart was pumping fast, and his fingers tingling with fear. . . yet at the same time, he seemed to be outside himself, seeing the walls of the tent, and hearing the crowd, as though from far away. \"Very daring!\"  Bagman was yelling, and Harry heard the Chinese Fireball emit a horrible, roaring shriek, while the crowd drew its collective breath.  \"That's some nerve he's showing - and - yes, he's got the egg!\" Applause shattered the wintery air like breaking glass; Krum had finished - it would be Harry's turn any moment. He stood up, noticing dimly that his legs seemed to be made of marshmallow.  He waited.  And then he heard the whistle blow.  He walked out through the entrance of the tent, the panic rising into a crescendo inside him.  And now he was walking past the trees, through a gap in the enclosure fence. He saw everything in front of him as though it was a very highly colored dream.  There were hundreds and hundreds of faces staring down at him from stands that had been magicked there since he'd last stood on this spot.  And there was the Horntail, at the other end of the enclosure, crouched low over her clutch of eggs, her wings half-furled, her evil, yellow eyes upon him, a monstrous, scaly, black lizard, thrashing her spiked tail, heaving yard-long gouge marks in the hard ground.  The crowd was making a great deal of noise, but whether friendly or not, Harry didn't know or care.  It was time to do what he had to do. . . to focus his mind, entirely and absolutely, upon the thing that was his only chance. He raised his wand. \"Accio Firebolt!\" he shouted. Harry waited, every fiber of him hoping, praying. . . . If it hadn't worked. . . if it wasn't coming. . . He seemed to be looking at everything around him through some sort of shimmering, transparent barrier, like a heat haze, which made the enclosure and the hundreds of faces around him swim strangely.... And then he heard it, speeding through the air behind him; he turned and saw his Firebolt hurtling toward him around the edge of the woods, soaring into the enclosure, and stopping dead in midair beside him, waiting for him to mount. The crowd was making even more noise. . . . Bagman was shouting something. . . but Harry's ears were not working properly anymore. . . listening wasn't important.... He swung his leg over the broom and kicked off from the ground.  And a second later, something miraculous happened.... As he soared upward, as the wind rushed through his hair, as the crowd's faces became mere flesh-colored pinpnicks below, and the Horntail shrank to the size of a dog, he realized that he had heft not only the ground behind, but also his fear. . . . He was back where he belonged.... This was just another Quidditch match, that was all. . . just another Quidditch match, and that Horntail was just another ugly opposing team. He looked down at the clutch of eggs and spotted the gold one, gleaming against its cement-colored fellows, residing safely between the dragon's front legs.  \"Okay,\" Harry told himself, \"diversionary tactics. . . let's go. . .\" He dived.  The Horntail's head followed him; he knew what it was going to do and pulled out of the dive just in time; a jet of fire had been released exactly where he would have been had he not swerved away. . . but Harry didn't care.. . that was no more than dodging a Bludger."
}