{
  "id": "f09f45e2bfd433abb5a3e97a61b1473ceb026305",
  "text": " . . . \"Peeves?\" said Snape softly, staring at the egg in Filch's hands.  \"But Peeves couldn't get into my office. . . .\" \"This egg was in your office. Professor?\" \"Of course not,\" Snape snapped.  \"I heard banging and wailing -\" \"Yes, Professor, that was the egg -\"  \"- I was coming to investigate -\"  \"- Peeves threw it. Professor -\" \"- and when I passed my office, I saw that the torches were lit and a cupboard door was ajar!  Somebody has been searching it!\" But Peeves couldn't -\"  \"I know he couldn't, Filch!\" Snape snapped again. \"I seal my office with a spell none but a wizard could break!\"  Snape looked up the stairs, straight through Harry, and then down into the corridor below.  \"I want you to come and help me search for the intruder, Filch.\" \"I - yes, Professor - but -\" Filch looked yearningly up the stairs, right through Harry, who could see that he was very reluctant to forgo the chance of cornering Peeves.  Go, Harry pleaded with him silently, go with Snape . . . go. . . Mrs. Norris was peering around Filch's legs.... Harry had the distinct impression that she could smell him.. . . Why had he filled that bath with so much perfumed foam? \"The thing is, Professor,\" said Filch plaintively, \"the headmaster will have to listen to me this time.  Peeves has been stealing from a student, it might be my chance to get him thrown out of the castle once and for all -\" \"Filch, I don't give a damn about that wretched poltergeist; it's my office that's -\" Clunk. Clunk. Clunk. Snape stopped talking very abruptly.  He and Filch both looked down at the foot of the stairs.  Harry saw Mad-Eye Moody limp into sight through the narrow gap between their heads. Moody was wearing his old traveling cloak over his nightshirt and leaning on his staff as usual. \"Pajama party, is it?\"  he growled up the stairs. \"Professor Snape and I heard noises, Professor,\" said Filch at once.  \"Peeves the Poltergeist, throwing things around as usual - and then Professor Snape discovered that someone had broken into his off -\" \"Shut up!\"  Snape hissed to Filch. Moody took a step closer to the foot of the stairs.  Harry saw Moodys magical eye travel over Snape, and then, unmistakably, onto himself. Harrys heart gave a horrible jolt. Moody could see through Invisibility Cloaks... he alone could see the full strangeness of the scene: Snape in his nightshirt, Filch clutching the egg, and he, Harry, trapped in the stairs behind them.  Moody's lopsided gash of a mouth opened in surprise.  For a few seconds, he and Harry stared straight into each other's eyes.  Then Moody closed his mouth and turned his blue eye upon Snape again.   \"Did I hear that correctly, Snape?\" he asked slowly. \"Someone broke into your office?\" \"It is unimportant,\" said Snape coldly.  \"On the contrary,\" growled Moody, \"it is very important.  Who'd want to break into your office?\" \"A student, I daresay,\" said Snape.  Harry could see a vein flickering horribly on Snape's greasy temple.  \"It has happened before.  Potion ingredients have gone missing from my private store cupboard ... students attempting illicit mixtures, no doubt....\" \"Reckon they were after potion ingredients, eh?\" said Moody.  \"Not hiding anything else in your office, are you?\" Harry saw the edge of Snapes sallow face turn a nasty brick color, the vein in his temple pulsing more rapidly. \"You know I'm hiding nothing, Moody,\" he said in a soft and dangerous voice, \"as you've searched my office pretty thoroughly yourself.\" Moodys face twisted into a smile. \"Auror's privilege, Snape. Dumbledore told me to keep an eye -\" \"Dumbledore happens to trust me,\" said Snape through clenched teeth.  \"I refuse to believe that he gave you orders to search my office!\" \"Course Dumbledore trusts you,\" growled Moody.  \"Hes a trusting man, isn't he? Believes in second chances.  But me - I say there are spots that don't come off, Snape.  Spots that never come off, d'you know what I mean?\" Snape suddenly did something very strange.  He seized his left forearm convulsively with his right hand, as though something on it had hurt him. Moody laughed. \"Get back to bed, Snape.\" \"You don't have the authority to send me anywhere!\"  Snape hissed, letting go of his arm as though angry with himself.  \"I have as much right to prowl this school after dark as you do!\" \"Prowl away,\" said Moody, but his voice was full of menace.  \"I look forward to meeting you in a dark corridor some time.... You've dropped something, by the way. ...\" With a stab of horror. Harry saw Moody point at the Marauders Map, still lying on the staircase six steps below him.  As Snape and Filch both turned to look at it, Harry threw caution to the winds; he raised his arms under the cloak and waved furiously at Moody to attract his attention, mouthing \"It's mine!  Mine!\" Snape had reached out for it, a horrible expression of dawning comprehension on his face - \"Accio Parchment!\" The map flew up into the air, slipped through Snapes outstretched fingers, and soared down the stairs into Moodys hand."
}