{
  "id": "f0c75f586173e4d5b749e80d6e8b9419f7d64eac",
  "text": " The riders let them come and go unmolested, so long as they observed the peace of the sacred city, did not profane the Mother of Mountains or the Womb of the World, and honored the crones of the dosh khaleen with the traditional gifts of salt, silver, and seed. The Dothraki did not truly comprehend this business of buying and selling.  Dany liked the strangeness of the Eastern Market too, with all its queer sights and sounds and smells. She often spent her mornings there, nibbling tree eggs, locust pie, and green noodles, listening to the high ululating voices of the spellsingers, gaping at manticores in silver cages and immense grey elephants and the striped black-and-white horses of the Jogos Nhai. She enjoyed watching all the people too: dark solemn Asshai’i and tall pale Qartheen, the bright-eyed men of Yi Ti in monkey-tail hats, warrior maids from Bayasabhad, Shamyriana, and Kayakayanaya with iron rings in their nipples and rubies in their cheeks, even the dour and frightening Shadow Men, who covered their arms and legs and chests with tattoos and hid their faces behind masks. The Eastern Market was a place of wonder and magic for Dany.  But the Western Market smelled of home.  As Irri and Jhiqui helped her from her litter, she sniffed, and recognized the sharp odors of garlic and pepper, scents that reminded Dany of days long gone in the alleys of Tyrosh and Myr and brought a fond smile to her face. Under that she smelled the heady sweet perfumes of Lys. She saw slaves carrying bolts of intricate Myrish lace and fine wools in a dozen rich colors. Caravan guards wandered among the aisles in copper helmets and knee-length tunics of quilted yellow cotton, empty scabbards swinging from their woven leather belts. Behind one stall an armorer displayed steel breastplates worked with gold and silver in ornate patterns, and helms hammered in the shapes of fanciful beasts. Next to him was a pretty young woman selling Lannisport goldwork, rings and brooches and torcs and exquisitely wrought medallions suitable for belting. A huge eunuch guarded her stall, mute and hairless, dressed in sweat-stained velvets and scowling at anyone who came close. Across the aisle, a fat cloth trader from Yi Ti was haggling with a Pentoshi over the price of some green dye, the monkey tail on his hat swaying back and forth as he shook his head.   When I was a little girl, I loved to play in the bazaar,  Dany told Ser Jorah as they wandered down the shady aisle between the stalls.  It was so alive there, all the people shouting and laughing, so many wonderful things to look at… though we seldom had enough coin to buy anything… well, except for a sausage now and again, or honeyfingers… do they have honeyfingers in the Seven Kingdoms, the kind they bake in Tyrosh?    Cakes, are they? I could not say, Princess.  The knight bowed.  If you would pardon me for a time, I will seek out the captain and see if he has letters for us.    Very well. I’ll help you find him.    There is no need for you to trouble yourself.  Ser Jorah glanced away impatiently.  Enjoy the market. I will rejoin you when my business is concluded.   Curious, Dany thought as she watched him stride off through the throngs. She didn’t see why she should not go with him. Perhaps Ser Jorah meant to find a woman after he met with the merchant captain. Whores frequently traveled with the caravans, she knew, and some men were queerly shy about their couplings. She gave a shrug.  Come,  she told the others.  Her handmaids trailed along as Dany resumed her stroll through the market.  Oh, look,  she exclaimed to Doreah,  those are the kind of sausages I meant.  She pointed to a stall where a wizened little woman was grilling meat and onions on a hot firestone.  They make them with lots of garlic and hot peppers.  Delighted with her discovery, Dany insisted the others join her for a sausage. Her handmaids wolfed theirs down giggling and grinning, though the men of her khas sniffed at the grilled meat suspiciously.  They taste different than I remember,  Dany said after her first few bites.   In Pentos, I make them with pork,  the old woman said,  but all my pigs died on the Dothraki sea. These are made of horsemeat, Khaleesi, but I spice them the same.    Oh.  Dany felt disappointed, but Quaro liked his sausage so well he decided to have another one, and Rakharo had to outdo him and eat three more, belching loudly. Dany giggled.   You have not laughed since your brother the Khal Rhaggat was crowned by Drogo,  said Irri.  It is good to see, Khaleesi.   Dany smiled shyly. It was sweet to laugh. She felt half a girl again.  They wandered for half the morning. She saw a beautiful feathered cloak from the Summer Isles, and took it for a gift. In return, she gave the merchant a silver medallion from her belt. That was how it was done among the Dothraki. A birdseller taught a green-and-red parrot to say her name, and Dany laughed again, yet still refused to take him. What would she do with a green-and-red parrot in a khalasar? She did take a dozen flasks of scented oils, the perfumes of her childhood; she had only to close her eyes and sniff them and she could see the big house with the red door once more."
}