{
  "id": "f0ef4e5ab1a52dec74a59483a1e61253b9781864",
  "text": " It will be up to him to make a marriage for the girl.   Janos Slynt’s face had gone from red to white.  Wh-what… what do you…?  His jowls were quivering like mounds of suet.   What do I mean to do with you?  Tyrion let the oaf tremble for a moment before he answered.  The carrack Summer’s Dream sails on the morning tide. Her master tells me she will call at Gulltown, the Three Sisters, the isle of Skagos, and Eastwatch-by-the-Sea. When you see Lord Commander Mormont, give him my fond regards, and tell him that I have not forgotten the needs of the Night’s Watch. I wish you long life and good service, my lord.   Once Janos Slynt realized he was not to be summarily executed, color returned to his face. He thrust his jaw out.  We will see about this, Imp. Dwarf. Perhaps it will be you on that ship, what do you think of that? Perhaps it will be you on the Wall.  He gave a bark of anxious laughter.  You and your threats, well, we will see. I am the king’s friend, you know. We shall hear what Joffrey has to say about this. And Littlefinger and the queen, oh, yes. Janos Slynt has a good many friends. We will see who goes sailing, I promise you. Indeed we will.   Slynt spun on his heel like the watchman he’d once been, and strode the length of the Small Hall, boots ringing on the stone. He clattered up the steps, threw open the door… and came face-to-face with a tall, lantern-jawed man in black breastplate and gold cloak. Strapped to the stump of his right wrist was an iron hand.  Janos,  he said, deep-set eyes glinting under a prominent brow ridge and a shock of salt-and-pepper hair. Six gold cloaks moved quietly into the Small Hall behind him as Janos Slynt backed away.   Lord Slynt,  Tyrion called out,  I believe you know Ser Jacelyn Bywater, our new Commander of the City Watch.    We have a litter waiting for you, my lord,  Ser Jacelyn told Slynt.  The docks are dark and distant, and the streets are not safe by night. Men.   As the gold cloaks ushered out their onetime commander, Tyrion called Ser Jacelyn to his side and handed him a roll of parchment.  It’s a long voyage, and Lord Slynt will want for company. See that these six join him on the Summer’s Dream.   Bywater glanced over the names and smiled.  As you will.    There’s one,  Tyrion said quietly.  Deem. Tell the captain it would not be taken amiss if that one should happen to be swept overboard before they reach Eastwatch.    I’m told those northern waters are very stormy, my lord.  Ser Jacelyn bowed and took his leave, his cloak rippling behind him. He trod on Slynt’s cloth-of-gold cape on his way.  Tyrion sat alone, sipping at what remained of the fine sweet Dornish wine. Servants came and went, clearing the dishes from the table. He told them to leave the wine. When they were done, Varys came gliding into the hall, wearing flowing lavender robes that matched his smell.  Oh sweetly done, my good lord.    Then why do I have this bitter taste in my mouth?  He pressed his fingers into his temples.  I told them to throw Allar Deem into the sea. I am sorely tempted to do the same with you.    You might be disappointed by the result,  Varys replied.  The storms come and go, the waves crash overhead, the big fish eat the little fish, and I keep on paddling. Might I trouble you for a taste of the wine that Lord Slynt enjoyed so much?   Tyrion waved at the flagon, frowning.  Varys filled a cup.  Ah. Sweet as summer.  He took another sip.  I hear the grapes singing on my tongue.    I wondered what that noise was. Tell the grapes to keep still, my head is about to split. It was my sister. That was what the oh-so-loyal Lord Janos refused to say. Cersei sent the gold cloaks to that brothel.   Varys tittered nervously. So he had known all along.   You left that part out,  Tyrion said accusingly.   Your own sweet sister,  Varys said, so grief-stricken he looked close to tears.  It is a hard thing to tell a man, my lord. I was fearful how you might take it. Can you forgive me?    No,  Tyrion snapped.  Damn you. Damn her.  He could not touch Cersei, he knew. Not yet, not even if he’d wanted to, and he was far from certain that he did. Yet it rankled, to sit here and make a mummer’s show of justice by punishing the sorry likes of Janos Slynt and Allar Deem, while his sister continued on her savage course.  In future, you will tell me what you know, Lord Varys. All of what you know.   The eunuch’s smile was sly.  That might take rather a long time, my good lord. I know quite a lot.    Not enough to save this child, it would seem.    Alas, no. There was another bastard, a boy, older. I took steps to see him removed from harm’s way… but I confess, I never dreamed the babe would be at risk. A baseborn girl, less than a year old, with a whore for a mother. What threat could she pose?    She was Robert’s,  Tyrion said bitterly.  That was enough for Cersei, it would seem.    Yes. It is grievous sad. I must blame myself for the poor sweet babe and her mother, who was so young and loved the king."
}