{
  "id": "f236a7cf0efc877e653d01bcef8a5d2ed626ff84",
  "text": " If not, I have killed us both.   It was him, she thought. He killed Joffrey. She had to go, for him as much as for herself.  You go first, ser.  If he did fall, she did not want him falling down on her head and knocking both of them off the cliff.   As you wish, my lady.  He gave her a sloppy kiss and swung his legs clumsily over the precipice, kicking about until he found a foothold.  Let me get down a bit, and come after. You will come now? You must swear it.    I’ll come,  she promised.  Ser Dontos disappeared. She could hear him huffing and puffing as he began the descent. Sansa listened to the tolling of the bell, counting each ring. At ten, gingerly, she eased herself over the edge of the cliff, poking with her toes until they found a place to rest. The castle walls loomed large above her, and for a moment she wanted nothing so much as to pull herself up and run back to her warm rooms in the Kitchen Keep. Be brave, she told herself. Be brave, like a lady in a song.  Sansa dared not look down. She kept her eyes on the face of the cliff, making certain of each step before reaching for the next. The stone was rough and cold. Sometimes she could feel her fingers slipping, and the handholds were not as evenly spaced as she would have liked. The bells would not stop ringing. Before she was halfway down her arms were trembling and she knew that she was going to fall. One more step, she told herself, one more step. She had to keep moving. If she stopped, she would never start again, and dawn would find her still clinging to the cliff, frozen in fear. One more step, and one more step.  The ground took her by surprise. She stumbled and fell, her heart pounding. When she rolled onto her back and stared up at from where she had come, her head swam dizzily and her fingers clawed at the dirt. I did it. I did it, I didn’t fall, I made the climb and now I’m going home.  Ser Dontos pulled her back onto her feet.  This way. Quiet now, quiet, quiet.  He stayed close to the shadows that lay black and thick beneath the cliffs. Thankfully they did not have to go far. Fifty yards downriver, a man sat in a small skiff, half-hidden by the remains of a great galley that had gone aground there and burned. Dontos limped up to him, puffing.  Oswell?    No names,  the man said.  In the boat.  He sat hunched over his oars, an old man, tall and gangling, with long white hair and a great hooked nose, with eyes shaded by a cowl.  Get in, be quick about it,  he muttered.  We need to be away.   When both of them were safe aboard, the cowled man slid the blades into the water and put his back into the oars, rowing them out toward the channel. Behind them the bells were still tolling the boy king’s death. They had the dark river all to themselves.  With slow, steady, rhythmic strokes, they threaded their way downstream, sliding above the sunken galleys, past broken masts, burned hulls, and torn sails. The oarlocks had been muffled, so they moved almost soundlessly. A mist was rising over the water. Sansa saw the embattled ramparts of one of the Imp’s winch towers looming above, but the great chain had been lowered, and they rowed unimpeded past the spot where a thousand men had burned. The shore fell away, the fog grew thicker, the sound of the bells began to fade. Finally even the lights were gone, lost somewhere behind them. They were out in Blackwater Bay, and the world shrank to dark water, blowing mist, and their silent companion stooped over the oars.  How far must we go?  she asked.   No talk.  The oarsman was old, but stronger than he looked, and his voice was fierce. There was something oddly familiar about his face, though Sansa could not say what it was.   Not far.  Ser Dontos took her hand in his own and rubbed it gently.  Your friend is near, waiting for you.    No talk!  the oarsman growled again.  Sound carries over water, Ser Fool.   Abashed, Sansa bit her lip and huddled down in silence. The rest was rowing, rowing, rowing.  The eastern sky was vague with the first hint of dawn when Sansa finally saw a ghostly shape in the darkness ahead; a trading galley, her sails furled, moving slowly on a single bank of oars. As they drew closer, she saw the ship’s figurehead, a merman with a golden crown blowing on a great seashell horn. She heard a voice cry out, and the galley swung slowly about.  As they came alongside, the galley dropped a rope ladder over the rail. The rower shipped the oars and helped Sansa to her feet.  Up now. Go on, girl, I got you.  Sansa thanked him for his kindness, but received no answer but a grunt. It was much easier going up the rope ladder than it had been coming down the cliff. The oarsman Oswell followed close behind her, while Ser Dontos remained in the boat.  Two sailors were waiting by the rail to help her onto the deck. Sansa was trembling.  She’s cold,  she heard someone say. He took off his cloak and put it around her shoulders.  There, is that better, my lady? Rest easy, the worst is past and done."
}