{
  "id": "f297be32ff0e153532cceac266affd41f9f72201",
  "text": "  Men called out to him as he crossed the castle yard, but Ned ignored them in his haste. He would have run, but he was still the King’s Hand, and a Hand must keep his dignity. He was aware of the eyes that followed him, of the muttered voices wondering what he would do.  The castle was a modest holding a half day’s ride south of the Trident. The royal party had made themselves the uninvited guests of its lord, Ser Raymun Darry, while the hunt for Arya and the butcher’s boy was conducted on both sides of the river. They were not welcome visitors. Ser Raymun lived under the king’s peace, but his family had fought beneath Rhaegar’s dragon banners at the Trident, and his three older brothers had died there, a truth neither Robert nor Ser Raymun had forgotten. With king’s men, Darry men, Lannister men, and Stark men all crammed into a castle far too small for them, tensions burned hot and heavy.  The king had appropriated Ser Raymun’s audience chamber, and that was where Ned found them. The room was crowded when he burst in. Too crowded, he thought; left alone, he and Robert might have been able to settle the matter amicably.  Robert was slumped in Darry’s high seat at the far end of the room, his face closed and sullen. Cersei Lannister and her son stood beside him. The queen had her hand on Joffrey’s shoulder. Thick silken bandages still covered the boy’s arm.  Arya stood in the center of the room, alone but for Jory Cassel, every eye upon her.  Arya,  Ned called loudly. He went to her, his boots ringing on the stone floor. When she saw him, she cried out and began to sob.  Ned went to one knee and took her in his arms. She was shaking.  I’m sorry,  she sobbed,  I’m sorry, I’m sorry.    I know,  he said. She felt so tiny in his arms, nothing but a scrawny little girl. It was hard to see how she had caused so much trouble.  Are you hurt?    No.  Her face was dirty, and her tears left pink tracks down her cheeks.  Hungry some. I ate some berries, but there was nothing else.    We’ll feed you soon enough,  Ned promised. He rose to face the king.  What is the meaning of this?  His eyes swept the room, searching for friendly faces. But for his own men, they were few enough. Ser Raymun Darry guarded his look well. Lord Renly wore a half smile that might mean anything, and old Ser Barristan was grave; the rest were Lannister men, and hostile. Their only good fortune was that both Jaime Lannister and Sandor Clegane were missing, leading searches north of the Trident.  Why was I not told that my daughter had been found?  Ned demanded, his voice ringing.  Why was she not brought to me at once?   He spoke to Robert, but it was Cersei Lannister who answered.  How dare you speak to your king in that manner!   At that, the king stirred.  Quiet, woman,  he snapped. He straightened in his seat.  I am sorry, Ned. I never meant to frighten the girl. It seemed best to bring her here and get the business done with quickly.    And what business is that?  Ned put ice in his voice.  The queen stepped forward.  You know full well, Stark. This girl of yours attacked my son. Her and her butcher’s boy. That animal of hers tried to tear his arm off.    That’s not true,  Arya said loudly.  She just bit him a little. He was hurting Mycah.    Joff told us what happened,  the queen said.  You and the butcher boy beat him with clubs while you set your wolf on him.    That’s not how it was,  Arya said, close to tears again. Ned put a hand on her shoulder.   Yes it is!  Prince Joffrey insisted.  They all attacked me, and she threw Lion’s Tooth in the river!  Ned noticed that he did not so much as glance at Arya as he spoke.   Liar!  Arya yelled.   Shut up!  the prince yelled back.   Enough!  the king roared, rising from his seat, his voice thick with irritation. Silence fell. He glowered at Arya through his thick beard.  Now, child, you will tell me what happened. Tell it all, and tell it true. It is a great crime to lie to a king.  Then he looked over at his son.  When she is done, you will have your turn. Until then, hold your tongue.   As Arya began her story, Ned heard the door open behind him. He glanced back and saw Vayon Poole enter with Sansa. They stood quietly at the back of the hall as Arya spoke. When she got to the part where she threw Joffrey’s sword into the middle of the Trident, Renly Baratheon began to laugh. The king bristled.  Ser Barristan, escort my brother from the hall before he chokes.   Lord Renly stifled his laughter.  My brother is too kind. I can find the door myself.  He bowed to Joffrey.  Perchance later you’ll tell me how a nine-year-old girl the size of a wet rat managed to disarm you with a broom handle and throw your sword in the river.  As the door swung shut behind him, Ned heard him say,  Lion’s Tooth,  and guffaw once more.  Prince Joffrey was pale as he began his very different version of events. When his son was done talking, the king rose heavily from his seat, looking like a man who wanted to be anywhere but here."
}