{
  "id": "f2a6858db7a58c34df9c6745c0189a888980a047",
  "text": " They could smell the fury of it, and when the thunder came it seemed to shake the night.  And death leapt down amongst them.  The lightning flash left Jon night-blind, but he glimpsed the hurtling shadow half a heartbeat before he heard the shriek. The first Thenn died as the old man had, blood gushing from his torn throat. Then the light was gone and the shape was spinning away, snarling, and another man went down in the dark. There were curses, shouts, howls of pain. Jon saw Big Boil stumble backward and knock down three men behind him. Ghost, he thought for one mad instant. Ghost leapt the Wall. Then the lightning turned the night to day, and he saw the wolf standing on Del’s chest, blood running black from his jaws. Grey. He’s grey.  Darkness descended with the thunderclap. The Thenns were jabbing with their spears as the wolf darted between them. The old man’s mare reared, maddened by the smell of slaughter, and lashed out with her hooves. Longclaw was still in his hand. All at once Jon Snow knew he would never get a better chance.  He cut down the first man as he turned toward the wolf, shoved past a second, slashed at a third. Through the madness he heard someone call his name, but whether it was Ygritte or the Magnar he could not say. The Thenn fighting to control the horse never saw him. Longclaw was feather-light. He swung at the back of the man’s calf, and felt the steel bite down to the bone. When the wildling fell the mare bolted, but somehow Jon managed to grab her mane with his off hand and vault himself onto her back. A hand closed round his ankle, and he hacked down and saw Bodger’s face dissolve in a welter of blood. The horse reared, lashing out. One hoof caught a Thenn in the temple, with a crunch.  And then they were running. Jon made no effort to guide the horse. It was all he could do to stay on her as they plunged through mud and rain and thunder. Wet grass whipped at his face and a spear flew past his ear. If the horse stumbles and breaks a leg, they will run me down and kill me, he thought, but the old gods were with him and the horse did not stumble. Lightning shivered through the black dome of sky, and thunder rolled across the plains. The shouts dwindled and died behind him.  Long hours later, the rain stopped. Jon found himself alone in a sea of tall black grass. There was a deep throbbing ache in his right thigh. When he looked down, he was surprised to see an arrow jutting out the back of it. When did that happen? He grabbed hold of the shaft and gave it a tug, but the arrowhead was sunk deep in the meat of his leg, and the pain when he pulled on it was excruciating. He tried to think back on the madness at the inn, but all he could remember was the beast, gaunt and grey and terrible. It was too large to be a common wolf. A direwolf, then. It had to be. He had never seen an animal move so fast. Like a grey wind… could Robb have returned to the north?  Jon shook his head. He had no answers. It was too hard to think… about the wolf, the old man, Ygritte, any of it…  Clumsily, he slid down off the mare’s back. His wounded leg buckled under him, and he had to swallow a scream. This is going to be agony. The arrow had to come out, though, and nothing good could come of waiting. Jon curled his hand around the fletching, took a deep breath, and shoved the arrow forward. He grunted, then cursed. It hurt so much he had to stop. I am bleeding like a butchered pig, he thought, but there was nothing to be done for it until the arrow was out. He grimaced and tried again… and soon stopped again, trembling. Once more. This time he screamed, but when he was done the arrowhead was poking through the front of his thigh. Jon pushed back his bloody breeches to get a better grip, grimaced, and slowly drew the shaft through his leg. How he got through that without fainting he never knew.  He lay on the ground afterward, clutching his prize and bleeding quietly, too weak to move. After a while, he realized that if he did not make himself move he was like to bleed to death. Jon crawled to the shallow stream where the mare was drinking, washed his thigh in the cold water, and bound it tight with a strip of cloth torn from his cloak. He washed the arrow too, turning it in his hands. Was the fletching grey, or white? Ygritte fletched her arrows with pale grey goose feathers. Did she loose a shaft at me as I fled? Jon could not blame her for that. He wondered if she’d been aiming for him or the horse. If the mare had gone down, he would have been doomed.  A lucky thing my leg got in the way,  he muttered.  He rested for a while to let the horse graze. She did not wander far. That was good. Hobbled with a bad leg, he could never have caught her. It was all he could do to force himself back to his feet and climb onto her back. How did I ever mount her before, without saddle or stirrups, and a sword in one hand? That was another question he could not answer.  Thunder rumbled softly in the distance, but above him the clouds were breaking up."
}