{
  "id": "f2f419e93334b44dfff6af7cf21b110520df6091",
  "text": " \"But this time, Lord Voldemort was acting through somebody else. By means of this diary.\"  He held up the small black book with the large hole through the center, watching Mr. Malfoy closely. Harry, however, was watching Dobby.  The elf was doing something very odd. His great eyes fixed meaningfully on Harry, he kept pointing at the diary, then at Mr. Malfoy, and then hitting himself hard on the head with his fist.  \"I see. . . \" said Mr. Malfoy slowly to Dumbledore.  \"A clever plan,\" said Dumbledore in a level voice, still staring Mr. Malfoy straight in the eye. \"Because if Harry here\" --Mr. Malfoy shot Harry a swift, sharp look -- \"and his friend Ron hadn't discovered this book, why -- Ginny Weasley might have taken all  *335*  the blame. No one would ever have been able to prove she hadn't acted of her own free will ......  Mr. Malfoy said nothing. His face was suddenly masklike.  \"And imagine,\" Dumbledore went on, \"what might have happened then .... The Weasleys are one of our most prominent pure-blood families. Imagine the effect on Arthur Weasley and his Muggle Protection Act, if his own daughter was discovered attacking and - killing Muggle-borns .... Very fortunate the diary was discovered, and Riddle's memories wiped from it. \"Who knows what the consequences might have been otherwise ......  Mr. Malfoy forced himself to speak.  \"Very fortunate,\" he said stiffly.  And still, behind his back, Dobby was pointing, first to the diary, then to Lucius Malfoy, then punching himself in the head.  And Harry suddenly understood. He nodded at Dobby, and Dobby backed into a corner, now twisting his ears in punishment.  \"Don't you want to know how Ginny got hold of that diary, Mr. Malfoy?\" said Harry.  Lucius Malfoy rounded on him.  \"How should I know how the stupid little girl got hold of it?\" he said.  \"Because you gave it to her,\" said Harry. \"In Flourish and Blotts. You picked up her old Transfiguration book and slipped the diary inside it, didn't you?\"  He saw Mr. Malfoy's white hands clench and unclench.  \"Prove it,\" he hissed.  \"Oh, no one will be able to do that,\" said Dumbledore, smiling at Harry. \"Not now that Riddle has vanished from the book. On  *336*  the other hand, I would advise you, Lucius, not to go giving out any more of Lord Voldemort's old school things. If any more of them find their way into innocent hands, I think Arthur Weasley, for one, will make sure they are traced back to you ......  Lucius Malfoy stood for a moment, and Harry distinctly saw his right hand twitch as though he was longing to reach for his wand. Instead, he turned to his house-elf  \"We're going, Dobby!\"  He wrenched open the door and as the elf came hurrying up to him, he kicked him right through it. They could hear Dobby squealing with pain all the way along the corridor. Harry stood for a moment, thinking hard. Then it came to him -  \"Professor Dumbledore,\" he said hurriedly. \"Can I give that diary back to Mr. Malfoy, please?\"  \"Certainly, Harry,\" said Dumbledore calmly. \"But hurry. The feast, remember ......  Harry grabbed the diary and dashed out of the office. He could hear Dobby's squeals of pain receding around the corner. Quickly, wondering if this plan could possibly work, Harry took off one of his shoes, pulled off his slimy, filthy sock, and stuffed the diary into it. Then he ran down the dark corridor.  He caught up with them at the top of the stairs.  \"Mr. Malfoy,\" he gasped, skidding to a halt, \"I've got something for you --\"  And he forced the smelly sock into Lucius Malfoy's hand.  \")What the --?\"  Mr. Malfoy ripped the sock off the diary, threw it aside, then looked furiously from the ruined book to Harry.  *',531*  You'll meet the same sticky end as your parents one of these days, Harry Potter,\" he said softly. \"They were meddlesome fools, too.  He turned to go.  \"Come, Dobby. I said, come.\"  But Dobby didn't move. He was holding up Harry's disgusting, slimy sock, and looking at it as though it were a priceless treasure.  \"Master has given a sock,\" said the elf in wonderment. \"Master gave it to Dobby.\"  \"What's that?\" spat Mr. Malfoy. \"What did you say?\"  \"Got a sock,\" said Dobby in disbelief. \"Master threw it, and Dobby caught it, and Dobby -- Dobby is free. \"  Lucius Malfoy stood frozen, staring at the elf Then he lunged at Harry.  \"You've lost me my servant, boy!\"  But Dobby shouted, \"You shall not harm Harry Potter!\"  There was a loud bang, and Mr. Malfoy was thrown backward. He crashed down the stairs, three at a time, landing in a crumpled heap on the landing below. He got up, his face livid, and pulled out his wand, but Dobby raised a long, threatening finger.  \"You shall go now,\" he said fiercely, pointing down at Mr. Malfoy. \"You shall not touch Harry Potter. You shall go now.\"  Lucius Malfoy had no choice. With a last, incensed stare at the pair of them, he swung his cloak around him and hurried out of sight.  \"Harry Potter freed Dobby!\" said the elf shrilly, gazing up at Harry, moonlight from the nearest window reflected in his orb-like eyes."
}