{
  "id": "f397f1de2f51ee2230b56b7ec0733163a36ce606",
  "text": " \"Penalty shot to Gryffindor for an unprovoked attack on their Chaser! Penalty shot to Slytherin for deliberate damage to their Chaser!\"  \"Come off it, Miss!\" howled Fred, but Madam Hooch blew her whistle and Alicia flew forward to take the penalty.  \"Come on, Alicia!\" yelled Lee into the silence that had descended on the crowd. \"YES! SHE'S BEATEN THE KEEPER! TWENTY-ZERO TO GRYFFINDOR!\"  Harry turned the Firebolt sharply to watch Flint, still bleeding freely, fly forward to take the Slytherin penalty. Wood was hovering in front of the Gryffindor goal posts, his jaw clenched.  \"'Course, Wood's a superb Keeper!\" Lee Jordan told the crowd as Flint waited for Madam Hooch's whistle. \"Superb! Very difficult to pass -- very difficult indeed -- YES! I DON'T BELIEVE IT! HE'S SAVED IT!\"  Relieved, Harry zoomed away, gazing around for the Snitch, but still making sure he caught every word of Lee's commentary. It was essential that he hold Malfoy off the Snitch until Gryffindor was more than fifty points up --  \"Gryffindor in possession, no, Slytherin in possession -- no!  Gryffindor back in possession and it's Katie Bell, Katie Bell for Gryffindor with the Quaffle, she's streaking up the field -- THAT WAS DELIBERATE!\"  Montague, a Slytherin Chaser, had swerved in front of Katie, and instead of seizing the Quaffle had grabbed her head. Katie cart wheeled in the air, managed to stay on her broom, but dropped the Quaffle.  Madam Hooch's whistle rang out again as she soared over to Montague and began shouting at him. A minute later, Katie had put another penalty past the Slytherin Seeker.  \"THIRTY-ZERO! TAKE THAT, YOU DIRTY, CHEATING --\"  \"Jordan, if you can't commentate in an unbiased way --\"  \"I'm telling it like it is, Professor!\"  Harry felt a huge jolt of excitement. He had seen the Snitch it was shimmering at the foot of one of the Gryffindor goal posts -- but he mustn't catch it yet -- and if Malfoy saw it -  Faking a look of sudden concentration, Harry pulled his Firebolt around and sped off toward the Slytherin end -- it worked. Malfoy went haring after him, clearly thinking Harry had seen the Snitch there....  WHOOSH.  One of the Bludgers came streaking past Harry's right ear, hit by the gigantic Slytherin Beater, Derrick. Then again  WHOOSH.  The second Bludger grazed Harry's elbow. The other Beater, Bole, was closing in.  Harry had a fleeting glimpse of Bole and Derrick zooming toward him, clubs raised --  He turned the Firebolt upward at the last second, and Bole and Derrick collided with a sickening crunch.  \"Ha haaa!\" yelled Lee Jordan as the Slytherin Beaters lurched away from each other, clutching their heads. \"Too bad, boys! You'll need to get up earlier than that to beat a Firebold And it's Gryffindor in possession again, as Johnson takes the Quaffle -- Flint alongside her -- poke him in the eye, Angelina! -- it was a joke, Professor, it was a joke -- oh no -- Flint in possession, Flint flying toward the Gryffindor goal posts, come on now, Wood, save --!\"  But Flint had scored; there was an eruption of cheers from the Slytherin end, and Lee swore so badly that Professor McGonagall tried to tug the magical megaphone away from him.  \"Sorry, Professor, sorry! WoiA happen again! So, Gryffindor in the lead, thirty points to ten, and Gryffindor in possession --\"  it was turning into the dirtiest game Harry had ever played in. Enraged that Gryffindor had taken such an early lead, the Slytherins were rapidly resorting to any means to take the Quaffle. Bole hit Alicia with his club and tried to say he'd thought she was a Bludger. George Weasley elbowed Bole in the face in retaliation. Madam Hooch awarded both teams penalties, and Wood pulled off another spectacular save, making the score forty-ten to Gryffindor.  The Snitch had disappeared again. Malfoy was still keeping close to Harry as he soared over the match, looking around for it once Gryffindor was fifty points ahead -  Katie scored. Fifty-ten. Fred and George Weasley were swooping around her, clubs raised, in case any of the Slytherins were thinking of revenge. Bole and Derrick took advantage of Fred's and George's absence to aim both Bludgers at Wood; they caught him in the stomach, one after the other, and he rolled over in the air, clutching his broom, completely winded.  Madam Hooch was beside herself  \"YOU DO NOT ATTACK THE KEEPER UNLESS THE QUAFFLE IS WITHIN THE SCORING AREA!\" she shrieked at Bole and Derrick. \"Gryffindor penalty!\"  And Angelina scored. Sixty-ten. Moments later, Fred Weasley pelted a Bludger at Warrington, knocking the Quaffle Out of his hands; Alicia seized it and put it through the Slytherin goal -- seventy-ten.  The Gryffindor crowd below was screaming itself hoarse -- Gryffindor was sixty points in the lead, and if Harry caught the Snitch now, the Cup was theirs. Harry could almost feel hundreds of eyes following him as he soared around the field, high above the rest of the game, with Malfoy speeding along behind him.  And then he saw it."
}