{
  "id": "f3bf613e61db7d6b78e5f420b33b5638527e41e6",
  "text": " Whatever am I going to do? I might have  known  that  something  dreadful  would  happen  to  me  in  the  end.  I  don't  think  I  could bear to see the unhappy valley of Dale again, and as for that steaming gate!  ! !\"  That  night  he  was  very  miserable  and  hardly  slept.  Next  day  the  dwarves  all  went  wandering  off  in  various  directions;  some  were  exercising  the  ponies  down  below,  some  were  roving  about  the  mountain-side. All day Bilbo  sat gloomily  in  the  grassy  bay  gazing  at  the  stone,  or  out  west  through  the  narrow  opening. He   ####-had  a  queer  feeling  that  he  was  waiting  for  something.  \"Perhaps  the  wizard  will  suddenly come back today,\" he thought.  If  he  lifted  his  head  he  could  see  a  glimpse  of  the  distant  forest.  As  the  sun  turned west there was a gleam of yellow upon its far roof, as if the light caught the  last pale  leaves. Soon he  saw  the orange ball of  the  sun  sinking  towards  the  level  of his eyes. He went  to  the opening and  there pale and faint was a  thin new moon  above  the  rim  of Earth. At  that  very moment  he  heard  a  sharp crack behind him.  There on the grey stone in the grass was an enormous thrush, nearly coal black, its  pale  yellow  breast  freckled  dark  spots.  Crack!  It  had  caught  a  snail  and  was  knocking it on the stone. Crack! Crack!  Suddenly  Bilbo  understood.  Forgetting  all  danger  he  stood  on  the  ledge  and  hailed  the  dwarves,  shouting  and  paying. Those  that were  nearest  came  tumbling  over the rocks and as fast as they could along the ledge to him, wondering what on  earth  was  the  matter;  the  others  shouted  to  be  hauled  up  the  ropes  (except  Bombur, of course: he was asleep).  Quickly  Bilbo  explained.  They  all  fell  silent:  the  hobbit  standing  by  the  grey  stone,  and  the  dwarves with wagging  beards watching  impatiently.  The  sun  sank  lower  and  lower,  and  their  hopes  fell.  It  sank  into  a  belt  of  reddened  cloud  and  disappeared.  The  dwarves  groaned,  but  still  Bilbo  stood  almost  without  moving.  The  little  moon  was  dipping  to  the  horizon.  Evening  was  coming  on.  Then  suddenly  when  their  hope  was  lowest  a  red  ray  of  the  sun  escaped  like  a  finger  through  a  rent  in  the  cloud.  A  gleam  of  light  came  straight  through  the  opening  into  the  bay  and  fell  on  the  smooth  rock-face.  The  old  thrush,  who  had  been  watching from a high perch with beady eyes and head cocked on one side, gave a  sudden  trill. There was a  loud attack. A  flake of  rock split  from  the wall and  fell.  A  hole  appeared  suddenly  about  three  feet  from  the  ground.  Quickly,  trembling  lest the chance should fade, the dwarves rushed to the rock and pushed-in vain.  \"The key! The key!\" cried Bilbo. \"Where is Thorin?\"  Thorin hurried up.  \"The key!\" shouted Bilbo. \"The key that went with the map! Try it now while  there is still time!\"  Then Thorin stepped up and drew the key on its chain from round his neck. He  put  it  to  the  hole.  It  fitted  and it turned! Snap! The gleam went out, the sun sank,  the moon was gone, and evening sprang into the sky.   Now  they  all  pushed  together,  and  slowly  a  part  of  the  rock-wall  gave  way.  Long straight cracks appeared and widened. A door five feet high and three broad  was  out-  lined,  and  slowly  without  a  sound  swung  inwards.  It  seemed  as  if   ####-darkness  flowed  out  like  a  vapour  from  the  hole  in  the  mountain-side,  and  deep  darkness  in  which  nothing  could  be  seen  lay  before  their  eyes  mouth  leading  in  and down.     ####-<h4>Chapter 12</h4> <br>   Inside Information     For  a  long  time  the  dwarves  stood  in  the  dark  before  the  door  and  debated,  until at last Thorin spoke:  \"Now  is  the  time  for  our  esteemed  Mr.  Baggins,  who  has  proved  himself  a  good  companion  on  our  long  road,  and  a  hobbit  full  of  courage and  resource  far  exceeding  his  size,  and  if  I may  say  so  possessed  of  good  luck  far  exceeding  the  usual  allowance-now  is  the  time  for  him  to  perform  the  service  for which  he was  included in our Company; now is the time for him to earn his Reward.\"  You are  familiar with Thorin's style on  important occasions, so  I will not give  you  any  more  of  it,  though  he  went  on  a  good  deal  longer  than  this.  It  certainly  was an important occasion, but Bilbo felt impatient. By now he was quite familiar  with Thorin too, and he knew what be was driving at.  \"If you mean you think it is my job to go into the secret passage first, O Thorin  Thrain's son Oakenshield, may your beard grow ever longer,\" he said crossly, \"say  so  at  once  and  have  done!  I  might  refuse.  I  have  got  you  out  of  two  messes  already,  which  were  hardly  in  the  original  bargain,  so  that  I  am,  I  think,  already  owed  some  reward."
}