{
  "id": "f413dec5868f02d144ed7fce7991c0b53ed955f2",
  "text": "  Quickly  they  got  out  boards  and  trestles  from  the  side  walls  and set them up near the fire.  Then  baa-baa-baa!  was  heard,  and  in  came  some  snow-white  sheep  led  by  a  large  coal-black  ram.  One  bore  a  white  cloth  embroidered  at  the  edges  with   ####-figures of animals; others bore on  their broad backs  trays with bowls and platters  and knives and wooden spoons, which the dogs took and quickly laid on the trestle  tables.  These  were  very  low,   low  enough  even  for  Bilbo  to  sit  at  comfortably.  Beside  them  a  pony  pushed  two  low-seated  benches  with  wide  rush-bottoms and  little  short  thick  legs  for Gandalf  and Thorin, while  at  the  far  end  he  put Beorn's  big  black  chair  of  the  same  sort  (in which  he  sat with his great  legs  stuck  far out  under the table). These were all the chairs he had in his hall, and he probably had  them  low  like  the  tables for  the convenience of  the wonderful animals  that waited  on him. What did  the  rest sit on? They were not  forgotten. The other ponies came  in  rolling  round  drum-shaped  sections  of  logs,  smoothed  and  polished,  and  low  enough  even  for Bilbo;  so  soon  they were  all  seated  at Beorn's  table,  and  the hall  had not seen such a gathering for many a year.   There  they  had  a  supper, or  a dinner,  such  as  they had not had  since  they  left  the Last Homely House  in  the West and  said good-bye to Elrond. The light of the  torches  and  the  fire  flickered  about  them,  and  on  the  table  were  two  tall  red  beeswax candles. All the time they ate, Beorn in his deep rolling voice told tales of  the  wild  lands  on  this  side  of  the  mountains,  and  especially  of  the  dark  and  dangerous wood,  that  lay  outstretched  far  to North  and  South  a  day's  ride  before  them, barring their way to the East, the terrible forest of Mirkwood.  The  dwarves  listened  and  shook  their  beards,  for  they  knew  that  they  must  soon  venture  into  that  forest  and  that  after  the mountains  it  was  the  worst  of  the  perils  they  had  to  pass  before  they  came  to  the  dragon's  stronghold. When  dinner  was  over  they  began  to  tell  tales  of  their  own,  but  Beorn  seemed  to  be  growing  drowsy  and  paid  little  heed  to  them.  They  spoke  most  of  gold  and  silver  and  jewels  and  the making  of  things  by  smith-craft,  and Beorn did not  appear  to  care  for  such  things:  there were no things of gold or silver in his hall, and few save the  knives were made of metal at all.  They  sat  long  at  the  table with  their wooden  drinking-bowls filled with mead.  The dark night came on outside. The fires in the middle of the hall were built with  fresh logs and the torches were put out, and still they sat in the light of the dancing  flames with  the pillars of  the house standing  tall behind  them, arid dark at  the  top  like  trees  of  the  forest.  Whether  it  was  magic  or  not,  it  seemed  to  Bilbo  that he  heard  a  sound  like  wind  in  the  branches  stirring  in  the  rafters,  and  the  hoot  of  owls.  Soon  he  began  to  nod  with  sleep  and  the  voices  seemed  to  grow  far  away,  until he woke with a start.  The great door had creaked and slammed. Beorn was gone. The dwarves were  sitting  cross-legged  on  the  floor  round  the  fire,  and  presently  they  began  to  sing.   ####-Some  of  the  verses  were  like  this,  but  there  were  many  more,  and  their  singing  went on for a long while:     ####-The wind was on the withered heath,  but in the forest stirred no leaf:  there shadows lay by night and day,   and dark things silent crept beneath.  The wind came down from mountains cold,  and like a tide it roared and rolled;  the branches groaned, the forest moaned,  and leaves were laid upon the mould.    The wind went on from West to East ;   all movement in the forest ceased,  but shrill and harsh across the marsh   its whistling voices were released.    The grasses hissed, their tassels bent,  the reeds were rattling-on it went  o' er shaken pool under heavens cool  where racing clouds were torn and rent.    It passed the lonely Mountain bare   and swept above the dragon's lair :   there black and dark lay boulders stark  and flying smoke was in the air.     It left the world and took its flight  over the wide seas of the night.  The moon set sail upon the gale,  and stars were fanned to leaping light.     Bilbo  began  to  nod  again.  Suddenly  up  stood  Gandalf.  \"It  is  time  for  us  to  sleep,\"  be  said,  \"—for us, but not I think for Beorn. In this hall we can rest sound  and  safe,  but  I  warn  you  all  not  to  forget what  Beorn  said  before  he  left  us:  you  must not stray outside until the sun is up, on your peril.\"  Bilbo found that beds had already been laid at the side of the hall, on a sort of  raised  platform  between  the  pillars  and  the  outer  wall."
}