{
  "id": "f4217f403d11e259b0473f820de9bbc03c2fb3f7",
  "text": " \"No - no more than Rosier deserved!\"  said Karkaroff, a real note of panic in his voice now. Harry could see that he was starting to worry that none of his information would be of any use to the Ministry. Karkaroff's eyes darted toward the door in the corner, behind which the dementors undoubtedly still stood, waiting. \"Any more?\"  said Crouch. \"Yes!\"  said Karkaroff.  \"There was Travers - he helped murder the McKinnons! Mulciber - he specialized in the Imperius Curse, forced countless people to do horrific things! Rookwood, who was a spy, and passed He-Who-Must-Not-Be-Named useful information from inside the Ministry itself!\" Harry could tell that, this time, Karkaroff had struck gold. The watching crowd was all murmuring together. \"Rookwood?\" said Mr. Crouch, nodding to a witch sitting in front of him, who began scribbling upon her piece of parchment.  \"Augustus Rookwood of the Department of Mysteries?\" \"The very same,\" said Karkaroff eagerly.  \"I believe he used a network of well-placed wizards, both inside the Ministry and out, to collect information -\" \"But Travers and Mulciber we have,\" said Mr. Crouch.  \"Very well, Karkaroff, if that is all, you will be returned to Azkaban while we decide -\" \"Not yet!\" cried Karkaroff, looking quite desperate. \"Wait, I have more!\" Harry could see him sweating in the torchlight, his white skin contrasting strongly with the black of his hair and beard. \"Snape!\" he shouted. \"Severus Snape!\" \"Snape has been cleared by this council,\" said Crouch disdainfully.  \"He has been vouched for by Albus Dumbledore.\" \"No!\"  shouted Karkaroff, straining at the chains that bound him to the chair.  \"I assure you!  Severus Snape is a Death Eater!\" Dumbledore had gotten to his feet. \"I have given evidence already on this matter,\" he said calmly.  \"Severus Snape was indeed a Death Eater. However, he rejoined our side before Lord Voldemort's downfall and turned spy for us, at great personal risk.  He is now no more a Death Eater than I am.\" Harry turned to look at Mad-Eye Moody. He was wearing a look of deep skepticism behind Dumbledore's back. \"Very well, Karkaroff,\" Crouch said coldly, \"you have been of assistance.  I shall review your case.  You will return to Azkaban in the meantime. ...\" Mr. Crouch's voice faded.  Harry looked around; the dungeon was dissolving as though it were made of smoke; everything was fading; he could see only his own body - all else was swirling darkness. . . . And then, the dungeon returned.  Harry was sitting in a different seat, still on the highest bench, but now to the left side of Mr. Crouch.  The atmosphere seemed quite different: relaxed, even cheerful.  The witches and wizards all around the walls were talking to one another, almost as though they were at some sort of sporting event.  Harry noticed a witch halfway up the rows of benches opposite.  She had short blonde hair, was wearing magenta robes, and was sucking the end of an acid-green quill.  It was, unmistakably, a younger Rita Skeeter.  Harry looked around; Dumbledore was sitting beside him again, wearing different robes.  Mr. Crouch looked more tired and somehow fiercer, gaunter. . . . Harry understood. It was a different memory, a different day ... a different trial. The door in the corner opened, and Ludo Bagman walked into the room. This was not, however, a Ludo Bagman gone to seed, but a Ludo Bagman who was clearly at the height of his Quidditch-playing fitness.  His nose wasn't broken now; he was tall and lean and muscular.  Bagman looked nervous as he sat down in the chained chair, but it did not bind him there as it had bound Karkaroff, and Bagman, perhaps taking heart from this, glanced around at the watching crowd, waved at a couple of them, and managed a small smile. \"Ludo Bagman, you have been brought here in front of the Council of Magical Law to answer charges relating to the activities of the Death Eaters,\" said Mr. Crouch.  \"We have heard the evidence against you, and are about to reach our verdict.  Do you have anything to add to your testimony before we pronounce judgment?\" Harry couldn't believe his ears. Ludo Bagman, a Death Eater? \"Only,\" said Bagman, smiling awkwardly, \"well - I know I've been a bit of an idiot -\" One or two wizards and witches in the surrounding seats smiled indulgently.  Mr. Crouch did not appear to share their feelings.  He was staring down at Ludo Bagman with an expression of the utmost severity and dislike. \"You never spoke a truer word, boy,\" someone muttered dryly to Dumbledore behind Harry.  He looked around and saw Moody sitting there again.  \"If I didn't know he'd always been dim, I'd have said some of those Bludgers had permanently affected his brain. ...\" \"Ludovic Bagman, you were caught passing information to Lord Voldemort's supporters,\" said Mr. Crouch.  \"For this, I suggest a term of imprisonment in Azkaban lasting no less than -\" But there was an angry outcry from the surrounding benches.  Several of the witches and wizards around the walls stood up, shaking their heads, and even their fists, at Mr."
}