{
  "id": "f465d549c62be92fe926bcbc5eb304053c1db9c4",
  "text": " I am blood of the dragon, she told herself. I am Daenerys Stormborn, Princess of Dragonstone, of the blood and seed of Aegon the Conqueror.  The sun was only a quarter of the way up the sky when she saw her first man die. Drums were beating as some of the women danced for the khal. Drogo watched without expression, but his eyes followed their movements, and from time to time he would toss down a bronze medallion for the women to fight over.  The warriors were watching too. One of them finally stepped into the circle, grabbed a dancer by the arm, pushed her down to the ground, and mounted her right there, as a stallion mounts a mare. Illyrio had told her that might happen.  The Dothraki mate like the animals in their herds. There is no privacy in a khalasar, and they do not understand sin or shame as we do.   Dany looked away from the coupling, frightened when she realized what was happening, but a second warrior stepped forward, and a third, and soon there was no way to avert her eyes. Then two men seized the same woman. She heard a shout, saw a shove, and in the blink of an eye the arakhs were out, long razor-sharp blades, half sword and half scythe. A dance of death began as the warriors circled and slashed, leaping toward each other, whirling the blades around their heads, shrieking insults at each clash. No one made a move to interfere.  It ended as quickly as it began. The arakhs shivered together faster than Dany could follow, one man missed a step, the other swung his blade in a flat arc. Steel bit into flesh just above the Dothraki’s waist, and opened him from backbone to belly button, spilling his entrails into the dust. As the loser died, the winner took hold of the nearest woman—not even the one they had been quarreling over—and had her there and then. Slaves carried off the body, and the dancing resumed.  Magister Illyrio had warned Dany about this too.  A Dothraki wedding without at least three deaths is deemed a dull affair,  he had said. Her wedding must have been especially blessed; before the day was over, a dozen men had died.  As the hours passed, the terror grew in Dany, until it was all she could do not to scream. She was afraid of the Dothraki, whose ways seemed alien and monstrous, as if they were beasts in human skins and not true men at all. She was afraid of her brother, of what he might do if she failed him. Most of all, she was afraid of what would happen tonight under the stars, when her brother gave her up to the hulking giant who sat drinking beside her with a face as still and cruel as a bronze mask.  I am the blood of the dragon, she told herself again.  When at last the sun was low in the sky, Khal Drogo clapped his hands together, and the drums and the shouting and feasting came to a sudden halt. Drogo stood and pulled Dany to her feet beside him. It was time for her bride gifts.  And after the gifts, she knew, after the sun had gone down, it would be time for the first ride and the consummation of her marriage. Dany tried to put the thought aside, but it would not leave her. She hugged herself to try to keep from shaking.  Her brother Viserys gifted her with three handmaids. Dany knew they had cost him nothing; Illyrio no doubt had provided the girls. Irri and Jhiqui were copper-skinned Dothraki with black hair and almond-shaped eyes, Doreah a fair-haired, blue-eyed Lysene girl.  These are no common servants, sweet sister,  her brother told her as they were brought forward one by one.  Illyrio and I selected them personally for you. Irri will teach you riding, Jhiqui the Dothraki tongue, and Doreah will instruct you in the womanly arts of love.  He smiled thinly.  She’s very good, Illyrio and I can both swear to that.   Ser Jorah Mormont apologized for his gift.  It is a small thing, my princess, but all a poor exile could afford,  he said as he laid a small stack of old books before her. They were histories and songs of the Seven Kingdoms, she saw, written in the Common Tongue. She thanked him with all her heart.  Magister Illyrio murmured a command, and four burly slaves hurried forward, bearing between them a great cedar chest bound in bronze. When she opened it, she found piles of the finest velvets and damasks the Free Cities could produce… and resting on top, nestled in the soft cloth, three huge eggs. Dany gasped. They were the most beautiful things she had ever seen, each different than the others, patterned in such rich colors that at first she thought they were crusted with jewels, and so large it took both of her hands to hold one. She lifted it delicately, expecting that it would be made of some fine porcelain or delicate enamel, or even blown glass, but it was much heavier than that, as if it were all of solid stone. The surface of the shell was covered with tiny scales, and as she turned the egg between her fingers, they shimmered like polished metal in the light of the setting sun. One egg was a deep green, with burnished bronze flecks that came and went depending on how Dany turned it."
}