{
  "id": "f4fce0add95a551f37607867b3db27b1554f8166",
  "text": " Great Uncle Algie came round for dinner, and he was hanging me out of an upstairs window by the ankles when my Great Auntie Enid offered him a meringue and he accidentally let go. But I bounced -- all the way down the garden and into the road. They were all really pleased, Gran was crying, she was so happy. And you should have seen their faces when I got in here -- they thought I might not be magic enough to come, you see. Great Uncle Algie was so pleased he bought me my toad.\"  On Harry's other side, Percy Weasley and Hermione were talking about lessons (\"I do hope they start right away, there's so much to learn, I'm particularly interested in Transfiguration, you know, turning something into something else, of course, it's supposed to be very difficult-\"; \"You'll be starting small, just matches into needles and that sort of thing -- \").  Harry, who was starting to feel warm and sleepy, looked up at  the High Table again. Hagrid was drinking deeply from his goblet. Professor McGonagall was talking to Professor Dumbledore. Professor Quirrell, in his absurd turban, was talking to a teacher with greasy black hair, a hooked nose, and sallow skin.  It happened very suddenly. The hook-nosed teacher looked past Quirrell's turban straight into Harry's eyes -- and a sharp, hot pain shot across the scar on Harry's forehead.  \"Ouch!\" Harry clapped a hand to his head.  \"What is it?\" asked Percy.  \"N-nothing.\"  The pain had gone as quickly as it had come. Harder to shake off was the feeling Harry had gotten from the teacher's look -- a feeling that he didn't like Harry at all.  \"Who's that teacher talking to Professor Quirrell?\" he asked Percy.  \"Oh, you know Quirrell already, do you? No wonder he's looking so nervous, that's Professor Snape. He teaches Potions, but he doesn't want to -- everyone knows he's after Quirrell's job. Knows an awful lot about the Dark Arts, Snape.\"  Harry watched Snape for a while, but Snape didn't look at him again.  At last, the desserts too disappeared, and Professor Dumbledore got to his feet again. The hall fell silent.  \"Ahern -- just a few more words now that we are all fed and watered. I have a few start-of-term notices to give you.  \"First years should note that the forest on the grounds is forbidden to all pupils. And a few of our older students would do well to remember that as well.\"  Dumbledore's twinkling eyes flashed in the direction of the Weasley twins.  \"I have also been asked by Mr. Filch, the caretaker, to remind you all that no magic should be used between classes in the corridors.  \"Quidditch trials will be held in the second week of the term. Anyone interested in playing for their house teams should contact Madam Hooch.  \"And finally, I must tell you that this year, the third-floor corridor on the right-hand side is out of bounds to everyone who does not wish to die a very painful death.\"  Harry laughed, but he was one of the few who did.  \"He's not serious?\" he muttered to Percy.  \"Must be,\" said Percy, frowning at Dumbledore. \"It's odd, because he usually gives us a reason why we're not allowed to go somewhere -- the forest's full of dangerous beasts, everyone knows that. I do think he might have told us prefects, at least.\"  \"And now, before we go to bed, let us sing the school song!\" cried Dumbledore. Harry noticed that the other teachers' smiles had become rather fixed.  Dumbledore gave his wand a little flick, as if he was trying to get a fly off the end, and a long golden ribbon flew out of it, which rose high above the tables and twisted itself, snakelike, into words.  \"Everyone pick their favorite tune,\" said Dumbledore, \"and off we go!\" And the school bellowed:  \"Hogwarts, Hogwarts, Hoggy Warty Hogwarts,  Teach us something please,  Whether we be old and bald  Or young with scabby knees,  Our heads could do with filling  With some interesting stuff,  For now they're bare and full of air,  Dead flies and bits of fluff,  So teach us things worth knowing,  Bring back what we've forgot,  just do your best, we'll do the rest,  And learn until our brains all rot.  Everybody finished the song at different times. At last, only the Weasley twins were left singing along to a very slow funeral march. Dumbledore conducted their last few lines with his wand and when they had finished, he was one of those who clapped loudest.  \"Ah, music,\" he said, wiping his eyes. \"A magic beyond all we do here! And now, bedtime. Off you trot!\"  The Gryffindor first years followed Percy through the chattering crowds, out of the Great Hall, and up the marble staircase. Harry's legs were like lead again, but only because he was so tired and full of food. He was too sleepy even to be surprised that the people in the portraits along the corridors whispered and pointed as they passed, or that twice Percy led them through doorways hidden behind sliding panels and hanging tapestries. They climbed more staircases, yawning and dragging their feet, and Harry was just wondering how much farther they had to go when they came to a sudden halt."
}