{
  "id": "f5677d90bac4b0dc5c39a93ef86bdba734dc1e2f",
  "text": " He seemed  to be  crouched  right  down with  his  flat  hands  splayed  on  the  floor, and his head  thrust   ####-out, nose almost to the stone. Though he was only a black shadow in the gleam of  his own eyes, Bilbo could see or feel that he was tense as a bowstring, gathered for  a spring.  Bilbo  almost  stopped  breathing,  and  went  stiff  himself. He was desperate. He  must  get  away,  out  of  this  horrible  darkness,  while  he  had  any  strength  left.  He  must  fight.  He  must  stab  the  foul  thing,  put  its  eyes  out,  kill  it.  It  meant  to  kill  him.  No,  not  a  fair  fight.  He  was  invisible  now.  Gollum  had  no  sword. Gollum  had  not  actually  threatened  to  kill  him,  or  tried  to  yet.  And  he  was  miserable,  alone, lost. A sudden understanding, a pity mixed with horror, welled up in Bilbo's  heart:  a  glimpse  of  endless  unmarked  days  without  light  or  hope  of  betterment,  hard stone, cold fish, sneaking and whispering. All these thoughts passed in a flash  of a second. He  trembled. And  then quite suddenly  in another flash, as  if  lifted by  a new strength and resolve, he leaped.  No great leap for a man, but a leap in the dark. Straight over Gollum's head he  jumped,  seven  feet  forward  and  three  in  the  air;  indeed, had he known  it, he only  just missed cracking his skull on the low arch of the passage.  Gollum  threw  himself  backwards,  and  grabbed  as  the  hobbit  flew  over  him,  but  too  late:  his  hands  snapped  on  thin  air,  and  Bilbo,  falling  fair  on  his  sturdy  feet, sped off down the new tunnel. He did not turn to see what Gollum was doing.  There was a hissing and cursing almost at his heels at  first,  then  it stopped. All at  once  there  came  a  bloodcurdling  shriek,  filled  with  hatred  and  despair.  Gollum  was defeated. He dared go no  further. He had  lost:  lost his prey, and  lost,  too,  the  only thing he had ever cared for, his precious. The cry brought Bilbo's heart to his  mouth,  but  still  he  held  on. Now  faint  as  an  echo,  but menacing,  the  voice  came  behind:  \"Thief, thief, thief! Baggins! We hates it, we hates it, we hates it for ever!\"  Then  there was  a  silence. But  that  too  seemed menacing  to Bilbo.  \"If  goblins  are  so  near  that  he  smelt  them,\" he  thought, \"then  they'll have heard his shrieking  and cursing. Careful now, or this way will lead you to worse things.\"  The passage was low and roughly made. It was not too difficult for the hobbit,  except when,  in  spite of all care, he  stubbed his poor  toes again, several times, on  nasty  jagged  stones  in  the  floor.  \"A  bit  low  for  goblins,  at  least  for  the  big  ones,\"  thought Bilbo,  not  knowing  that  even  the  big  ones,  the  ores  of  the mountains,  go  along at a great speed stooping low with their hands almost on the ground.  Soon the passage that had been sloping down began to go up again, and after a  while  it  climbed  steeply.  That  slowed  Bilbo  down.  But  at  last  the  slope  stopped,  the passage  turned a corner, and dipped down again, and  there, at  the bottom of a   ####-short  incline,  he  saw,  filtering  round  another  corner-a  glimpse  of  light.  Not  red  light,  as  of  fire  or  lantern,  but  a  pale  out-of-doors  sort of  light. Then Bilbo began  to run.  Scuttling as fast as his legs would carry him he turned the last corner and came  suddenly  right  into  an  open  space, where  the  light,  after  all  that  time  in  the  dark,  seemed  dazzlingly  bright.  Really  it  was  only  a  leak  of  sunshine  in  through  a  doorway, where a great door, a stone door, was left standing open.  Bilbo  blinked,  and  then  suddenly  he  saw  the  goblins:  goblins  in  full  armour  with drawn swords sitting just inside the door, and watching it with wide eyes, and  watching the passage that led to it. They were aroused, alert, ready for anything.  They saw him sooner than he saw them. Yes, they saw him. Whether it was .an  accident,  or  a  last  trick  of  the  ring  before  it  took  a  new master,  it was  not  on  his  finger. With yells of delight the goblins rushed upon him.  A  pang  of  fear  and  loss,  like  an  echo  of  Gollum's  misery,  smote  Bilbo,  and  forgetting even  to draw his sword he struck his hands  into his pockets. And- there  was  the  ring  still,  in  his  left  pocket,  and  it  slipped  on  his  finger.  The  goblins  stopped  short.  They  could  not  see  a  sign  of  him.  He  had  vanished.  They  yelled  twice as loud as before, but not so delightedly.   \"Where is it?\" they cried.  \"Go back up the passage!\" some shouted.  \"This way!\" some yelled. \"That way!\" others yelled.  \"Look out for the door,\" bellowed the captain.  Whistles  blew,  armour  clashed,  swords  rattled,  goblins  cursed  and  swore  and  ran hither and thither, falling over one another and getting very angry. There was a  terrible outcry, to-do, and disturbance."
}