{
  "id": "f5fc6343b03706eb88ed127f5cc7e59e30fe1736",
  "text": " Her brother Edmure, yes; it would not have surprised her to learn that Edmure had a dozen natural children. But not her father, not Lord Hoster Tully, never.  Could Tansy be some pet name he called Lysa, the way he called me Cat? Lord Hoster had mistaken her for her sister before. You’ll have others, he said. Sweet babes, and trueborn. Lysa had miscarried five times, twice in the Eyrie, thrice at King’s Landing… but never at Riverrun, where Lord Hoster would have been at hand to comfort her. Never, unless… unless she was with child, that first time…  She and her sister had been married on the same day, and left in their father’s care when their new husbands had ridden off to rejoin Robert’s rebellion. Afterward, when their moon blood did not come at the accustomed time, Lysa had gushed happily of the sons she was certain they carried.  Your son will be heir to Winterfell and mine to the Eyrie. Oh, they’ll be the best of friends, like your Ned and Lord Robert. They’ll be more brothers than cousins, truly, I just know it.  She was so happy.  But Lysa’s blood had come not long after, and all the joy had gone out of her. Catelyn had always thought that Lysa had simply been a little late, but if she had been with child…  She remembered the first time she gave her sister Robb to hold; small, red-faced, and squalling, but strong even then, full of life. No sooner had Catelyn placed the babe in her sister’s arms than Lysa’s face dissolved into tears. Hurriedly she had thrust the baby back at Catelyn and fled.  If she had lost a child before, that might explain Father’s words, and much else besides… Lysa’s match with Lord Arryn had been hastily arranged, and Jon was an old man even then, older than their father. An old man without an heir. His first two wives had left him childless, his brother’s son had been murdered with Brandon Stark in King’s Landing, his gallant cousin had died in the Battle of the Bells. He needed a young wife if House Arryn was to continue… a young wife known to be fertile.  Catelyn rose, threw on a robe, and descended the steps to the darkened solar to stand over her father. A sense of helpless dread filled her.  Father,  she said,  Father, I know what you did.  She was no longer an innocent bride with a head full of dreams. She was a widow, a traitor, a grieving mother, and wise, wise in the ways of the world.  You made him take her,  she whispered.  Lysa was the price Jon Arryn had to pay for the swords and spears of House Tully.   Small wonder her sister’s marriage had been so loveless. The Arryns were proud, and prickly of their honor. Lord Jon might wed Lysa to bind the Tullys to the cause of the rebellion, and in hopes of a son, but it would have been hard for him to love a woman who came to his bed soiled and unwilling. He would have been kind, no doubt; dutiful, yes; but Lysa needed warmth.  The next day, as she broke her fast, Catelyn asked for quill and paper and began a letter to her sister in the Vale of Arryn. She told Lysa of Bran and Rickon, struggling with the words, but mostly she wrote of their father. His thoughts are all of the wrong he did you, now that his time grows short. Maester Vyman says he dare not make the milk of the poppy any stronger. It is time for Father to lay down his sword and shield. It is time for him to rest. Yet he fights on grimly, will not yield. It is for your sake, I think. He needs your forgiveness. The war has made the road from the Eyrie to Riverrun dangerous to travel, I know, but surely a strong force of knights could see you safely through the Mountains of the Moon? A hundred men, or a thousand? And if you cannot come, will you not write him at least? A few words of love, so he might die in peace? Write what you will, and I shall read it to him, and ease his way.  Even as she set the quill aside and asked for sealing wax, Catelyn sensed that the letter was like to be too little and too late. Maester Vyman did not believe Lord Hoster would linger long enough for a raven to reach the Eyrie and return. Though he has said much the same before… Tully men did not surrender easily, no matter the odds. After she entrusted the parchment to the maester’s care, Catelyn went to the sept and lit a candle to the Father Above for her own father’s sake, a second to the Crone, who had let the first raven into the world when she peered through the door of death, and a third to the Mother, for Lysa and all the children they had both lost.  Later that day, as she sat at Lord Hoster’s bedside with a book, reading the same passage over and over, she heard the sound of loud voices and a trumpet’s blare. Ser Robin, she thought at once, flinching. She went to the balcony, but there was nothing to be seen out on the rivers, but she could hear the voices more clearly from outside, the sound of many horses, the clink of armor, and here and there a cheer. Catelyn made her way up the winding stairs to the roof of the keep. Ser Desmond did not forbid me the roof, she told herself as she climbed."
}