{
  "id": "f65e64ab9b83ce82ed341b3ef9ae63bea3807e43",
  "text": "       On the great  beast  thundered, blundering  in blind wrath through pool  and thicket. Arrows skipped and snapped harmlessly about  the triple hide of  his flanks. Men of  both sides  fled before him,  but  many  he overtook and  crushed  to  the  ground. Soon he was lost  to  view, still  trumpeting  and  stamping far away. What became of him Sam never heard: whether  he escaped  to  roam the wild for a time, until he perished far from his home or was trapped  in some deep pit; or whether he raged on until he plunged in the Great River   and was swallowed up.       Sam drew a  deep breath. 'An Oliphaunt it  was!' he said. `S o there are   ####-Oliphaunts, and I have seen one.  What a life! But no one  at home will ever   believe me. Well, if that's over, I'll have a bit of sleep.'       'Sleep while you  may,' said Mablung. `But  the Captain will return, if  he is unhurt; and when he comes we shall depart swiftly. We shall be pursued  as soon as news of our deed reaches the Enemy, and that will not be long.'       `Go quietly when you must!' said Sam.  `No need  to disturb my sleep. I  was walking all night.'       Mablung  laughed.  `I  do not  think  the Captain will leave you  here,  Master Samwise,' he said. 'But you shall see.'     ####-   Chapter 5. The Window on the West            It seemed to Sam that he had only dozed for a few minutes when he awoke  to find that it was late afternoon and Faramir had come back. He had brought  many men  with him; indeed all the survivors of the foray  were now gathered  on the  slope nearby, two  or  three  hundred  strong.  They sat in  a  wide  semicircle,  between the  arms  of which Faramir was  seated  on the ground,   while  Frodo  stood  before him.  It looked strangely  like the  trial  of a   prisoner.       Sam crept out from the fern, but no one paid any  attention to him, and  he placed himself at the end of the rows of men, where he could see and hear  all that wa s  going on. He  watched and listened  intently, ready to dash to  his  master's  aid if needed. He  could see  Faramir's face,  which  was now  unmasked:  it  was  stern  and commanding, and  a keen  wit lay  behind  his  searching glance. Doubt was in the grey eyes that gazed steadily at Frodo.       Sam soon became aware that  the Captain was not satisfied  with Frodo's  account of  himself at several  points:  what part  he  had  to  play in the  Company  that set out from Rivendell; why he had  left Boromir; and where he  was now going. In particular he returned often to Isildur's Bane. Plainly he  saw that Frodo was concealing from him some matter of great importance.       'But  it  was at the coming of the Halfling  that Isildur's Bane should  waken,  or so  one must  read the words,' he  insisted. `If then you are the  Halfling that was  named,  doubtless you brought this thing, whatever it may  be, to the Council of which you speak, and there Boromir saw it. Do you deny  it?  '       Frodo made no answer. 'So! ' said Faramir. `I  wish then  to learn from  you more of it; for  what  concerns Boromir concerns  me. An orc-arrow  slew  Isildur, so far as old tales tell. But orc-arrows are plenty,  and the sight  of one would not be taken as a  sign of Doom by Boromir of  Gondor.  Had you   this thing  in keeping?  It is hidden, you say;  but is not that because you   choose to hide it? '       'No, not because I choose,' answered Frodo. `It  does not belong to me.  It does not belong to any mortal, great or small; though if any  could claim  it, it would  be Aragorn son  of Arathorn, whom  I named, the  leader of our  Company from Moria to Rauros.'   ####-     'Why so, and not  Boromir, prince of the City that the  sons of Elendil  founded?  '       'Because Aragorn is descended in direct lineage, father to father, from  Isildur  Elendil's son  himself. And the sword  that he  bears was Elendil's  sword.'       A  murmur of  astonishment ran through all the ring  of men. Some cried   aloud: 'The sword of Elendil! The  sword  of Elendil comes  to Minas Tirith!   Great tidings! ' But Faramir's face was unmoved.       `Maybe,' he said. `But so great a claim will need to be established and  clear proofs  will  be  required,  should this  Aragorn ever  come  to Minas  Tirith. He  had not come,  nor any of your  Company, when I set out six days  ago.'       'Boromir was satisfied of that claim,' said Frodo. `Indeed, if  Boromir  were here, he would answer all your  questions. And since  he was already at  Rauros many days back, and intended then to go straight to your city, if you   return, you may  soon learn the  answers  there. My part in the  Company was  known to him, as  to all the others. for it was appointed to me by Elrond of  Imladris  himself before the  whole Council. On that errand I came into this  country, but it is not mine to reveal to any  outside the Company. Yet those  who claim to oppose the Enemy would do well not to hinder it.'       Frodo's tone was  proud, whatever he felt, and Sam approved of it;  but  it did not appease Faramir."
}