{
  "id": "f6f4c76fd538d9bbd5ff67629a12d64b3e84dcdb",
  "text": " It would not do to have you recognized. Perhaps you could fondle a breast or two, just in passing.   They went inside, through a crowded common room where a fat woman was singing bawdy songs while pretty young girls in linen shifts and wisps of colored silk pressed themselves against their lovers and dandled on their laps. No one paid Ned the least bit of attention. Ser Rodrik waited below while Littlefinger led him up to the third floor, along a corridor, and through a door.  Inside, Catelyn was waiting. She cried out when she saw him, ran to him, and embraced him fiercely.   My lady,  Ned whispered in wonderment.   Oh, very good,  said Littlefinger, closing the door.  You recognized her.    I feared you’d never come, my lord,  she whispered against his chest.  Petyr has been bringing me reports. He told me of your troubles with Arya and the young prince. How are my girls?    Both in mourning, and full of anger,  he told her.  Cat, I do not understand. What are you doing in King’s Landing? What’s happened?  Ned asked his wife.  Is it Bran? Is he… Dead was the word that came to his lips, but he could not say it.   It is Bran, but not as you think,  Catelyn said.  Ned was lost.  Then how? Why are you here, my love? What is this place?    Just what it appears,  Littlefinger said, easing himself onto a window seat.  A brothel. Can you think of a less likely place to find a Catelyn Tully?  He smiled.  As it chances, I own this particular establishment, so arrangements were easily made. I am most anxious to keep the Lannisters from learning that Cat is here in King’s Landing.    Why?  Ned asked. He saw her hands then, the awkward way she held them, the raw red scars, the stiffness of the last two fingers on her left.  You’ve been hurt.  He took her hands in his own, turned them over.  Gods. Those are deep cuts… a gash from a sword or… how did this happen, my lady?   Catelyn slid a dagger out from under her cloak and placed it in his hand.  This blade was sent to open Bran’s throat and spill his life’s blood.   Ned’s head jerked up.  But… who… why would…   She put a finger to his lips.  Let me tell it all, my love. It will go faster that way. Listen.   So he listened, and she told it all, from the fire in the library tower to Varys and the guardsmen and Littlefinger. And when she was done, Eddard Stark sat dazed beside the table, the dagger in his hand. Bran’s wolf had saved the boy’s life, he thought dully. What was it that Jon had said when they found the pups in the snow? Your children were meant to have these pups, my lord. And he had killed Sansa’s, and for what? Was it guilt he was feeling? Or fear? If the gods had sent these wolves, what folly had he done?  Painfully, Ned forced his thoughts back to the dagger and what it meant.  The Imp’s dagger,  he repeated. It made no sense. His hand curled around the smooth dragonbone hilt, and he slammed the blade into the table, felt it bite into the wood. It stood mocking him.  Why should Tyrion Lannister want Bran dead? The boy has never done him harm.    Do you Starks have nought but snow between your ears?  Littlefinger asked.  The Imp would never have acted alone.   Ned rose and paced the length of the room.  If the queen had a role in this or, gods forbid, the king himself… no, I will not believe that.  Yet even as he said the words, he remembered that chill morning on the barrowlands, and Robert’s talk of sending hired knives after the Targaryen princess. He remembered Rhaegar’s infant son, the red ruin of his skull, and the way the king had turned away, as he had turned away in Darry’s audience hall not so long ago. He could still hear Sansa pleading, as Lyanna had pleaded once.   Most likely the king did not know,  Littlefinger said.  It would not be the first time. Our good Robert is practiced at closing his eyes to things he would rather not see.   Ned had no reply for that. The face of the butcher’s boy swam up before his eyes, cloven almost in two, and afterward the king had said not a word. His head was pounding.  Littlefinger sauntered over to the table, wrenched the knife from the wood.  The accusation is treason either way. Accuse the king and you will dance with Ilyn Payne before the words are out of your mouth. The queen… if you can find proof, and if you can make Robert listen, then perhaps…    We have proof,  Ned said.  We have the dagger.    This?  Littlefinger flipped the knife casually end over end.  A sweet piece of steel, but it cuts two ways, my lord. The Imp will no doubt swear the blade was lost or stolen while he was at Winterfell, and with his hireling dead, who is there to give him the lie?  He tossed the knife lightly to Ned.  My counsel is to drop that in the river and forget that it was ever forged.   Ned regarded him coldly.  Lord Baelish, I am a Stark of Winterfell. My son lies crippled, perhaps dying. He would be dead, and Catelyn with him, but for a wolf pup we found in the snow. If you truly believe I could forget that, you are as big a fool now as when you took up sword against my brother."
}