{
  "id": "f707e9aaf35a3ca916e8e862a20d3d2f09fd4e81",
  "text": " He made me… watch.  Aye, and more than watch. I took her too… my wife…   I never knew he would do that. You must believe me.    Oh, must I?  Tyrion snarled.  Why should I believe you about anything, ever? She was my wife!    Tyrion—   He hit him. It was a slap, backhanded, but he put all his strength into it, all his fear, all his rage, all his pain. Jaime was squatting, unbalanced. The blow sent him tumbling backward to the floor.  I… I suppose I earned that.    Oh, you’ve earned more than that, Jaime. You and my sweet sister and our loving father, yes, I can’t begin to tell you what you’ve earned. But you’ll have it, that I swear to you. A Lannister always pays his debts.  Tyrion waddled away, almost stumbling over the turnkey again in his haste. Before he had gone a dozen yards, he bumped up against an iron gate that closed the passage. Oh, gods. It was all he could do not to scream.  Jaime came up behind him.  I have the gaoler’s keys.    Then use them.  Tyrion stepped aside.  Jaime unlocked the gate, pushed it open, and stepped through. He looked back over his shoulder.  Are you coming?    Not with you.  Tyrion stepped through.  Give me the keys and go. I will find Varys on my own.  He cocked his head and stared up at his brother with his mismatched eyes.  Jaime, can you flght left-handed?    Rather less well than you,  Jaime said bitterly.   Good. Then we will be well matched if we should ever meet again. The cripple and the dwarf.   Jaime handed him the ring of keys.  I gave you the truth. You owe me the same. Did you do it? Did you kill him?   The question was another knife, twisting in his guts.  Are you sure you want to know?  asked Tyrion.  Joffrey would have been a worse king than Aerys ever was. He stole his father’s dagger and gave it to a footpad to slit the throat of Brandon Stark, did you know that?    I… I thought he might have.    Well, a son takes after his father. Joff would have killed me as well, once he came into his power. For the crime of being short and ugly, of which I am so conspicuously guilty.    You have not answered my question.    You poor stupid blind crippled fool. Must I spell every little thing out for you? Very well. Cersei is a lying whore, she’s been fucking Lancel and Osmund Kettleblack and probably Moon Boy for all I know. And I am the monster they all say I am. Yes, I killed your vile son.  He made himself grin. It must have been a hideous sight to see, there in the torchlit gloom.  Jaime turned without a word and walked away.  Tyrion watched him go, striding on his long strong legs, and part of him wanted to call out, to tell him that it wasn’t true, to beg for his forgiveness. But then he thought of Tysha, and he held his silence. He listened to the receding footsteps until he could hear them no longer, then waddled off to look for Varys.  The eunuch was lurking in the dark of a twisting turnpike stair, garbed in a moth-eaten brown robe with a hood that hid the paleness of his face.  You were so long, I feared that something had gone amiss,  he said when he saw Tyrion.   Oh, no,  Tyrion assured him, in poisonous tones.  What could possibly have gone amiss?  He twisted his head back to stare up.  I sent for you during my trial.    I could not come. The queen had me watched, night and day. I dared not help you.    You’re helping me now.    Am I? Ah.  Varys giggled. It seemed strangely out of place in this place of cold stone and echoing darkness.  Your brother can be most persuasive.    Varys, you are as cold and slimy as a slug, has anyone ever told you? You did your best to kill me. Perhaps I ought to return the favor.   The eunuch sighed.  The faithful dog is kicked, and no matter how the spider weaves, he is never loved. But if you slay me here, I fear for you, my lord. You may never find your way back to daylight.  His eyes glittered in the shifting torchlight, dark and wet.  These tunnels are full of traps for the unwary.   Tyrion snorted.  Unwary? I’m the wariest man who ever lived, you helped see to that.  He rubbed at his nose.  So tell me, wizard, where is my innocent maiden wife?    I have found no trace of Lady Sansa in King’s Landing sad to say. Nor of Ser Dontos Hollard, who by rights should have turned up somewhere drunk by now. They were seen together on the serpentine steps the night she vanished. After that, nothing. There was much confusion that night. My little birds are silent.  Varys gave a gentle tug at the dwarf’s sleeve and pulled him into the stair.  My lord, we must away. Your path is down.   That’s no lie, at least. Tyrion waddled along in the eunuch’s wake, his heels scraping against the rough stone as they descended. It was very cold within the stairwell, a damp bone-chilling cold that set him to shivering at once.  What part of the dungeons are these?  he asked.   Maegor the Cruel decreed four levels of dungeons for his castle,  Varys replied.  On the upper level, there are large cells where common criminals may be confined together."
}