{
  "id": "f72a33c835a28243b039063d8d1edfc48c7bad82",
  "text": " Ron was leaning out of the back window of an old turquoise car, which was parked in midair Grinning at Harry from the front seats were Fred and George, Ron's elder twin brothers.  \"All right, Harry?\" asked George.  \"What's been going on?\" said Ron. \"Why haven't you been answering my letters? I've asked you to stay about twelve times, and then Dad came home and said you'd got an official warning for using magic in front of Muggles -\"  \"It wasn't me - and how did he know?\"  \"He works for the Ministry,\" said Ron. \"You know we're not supposed to do spells outside school -\"    \"You should talk,\" said Harry, staring at the floating car.  \"Oh, this doesn't count,\" said Ron. \"We're only borrowing this. It's Dad's, we didn't enchant it. But doing magic in front of those Muggles you live with -\"  \"I told you, I didn't - but it'll take too long to explain now look, can you tell them at Hogwarts that the Dursleys have locked me up and won't let me come back, and obviously I can't magic myself out, because the Ministry'Il think that's the second spell I've done in three days, so -\"  \"Stop gibbering,\" said Ron. \"We've come to take you home with us.\"  \"But you can't magic me out either -\"  \"We don't need to,\" said Ron, jerking his head toward the front seat and grinning. \"You forget who I've got with me.\"  \"Tie that around the bars,\" said Fred, throwing the end of a rope to Harry.  \"If the Dursleys wake up, I'm dead,\" said Harry as he tied the rope tightly around a bar and Fred revved up the car.  \"Don't worry,\" said Fred, \"and stand back.\"  Harry moved back into the shadows next to Hedwig, who seemed to have realized how important this was and kept still and silent. The car revved louder and louder and suddenly, with a crunching noise, the bars were pulled clean out of the window as Fred drove straight up in the air. Harry ran back to the window to see the bars dangling a few feet above the ground. Panting, Ron hoisted them up into the car. Harry listened anxiously, but there was no sound from the Dursleys' bedroom.  When the bars were safely in the back seat with Ron, Fred reversed as close as possible to Harry's window.  \"Get in,\" Ron said.  \"But all my Hogwarts stuff - my wand - my broomstick -\"  \"Where is it?\"  \"Locked in the cupboard under the stairs, and I can't get out of this room -\"  \"No problem,\" said George from the front passenger seat. \"Out of the way, Harry.\"  Fred and George climbed catlike through the window into Harry's room. You had to hand it to them, thought Harry, as George took an ordinary hairpin from his pocket and started to pick the lock.  \"A lot of wizards think it's a waste of time, knowing this sort of Muggle trick,\" said Fred, \"but we feel they're skills worth learning, even if they are a bit slow.\"  There was a small click and the door swung open.  \"So - we'll get your trunk - you grab anything you need from your room and hand it out to Ron,\" whispered George.  \"Watch out for the bottom stair - it creaks,\" Harry whispered back as the twins disappeared onto the dark landing.  Harry dashed around his room, collecting his things and passing them out of the window to Ron. Then he went to help Fred and George heave his trunk up the stairs. Harry heard Uncle Vernon cough.  At last, panting, they reached the landing, then carried the trunk through Harry's room to the open window. Fred climbed back into the car to pull with Ron, and Harry and George pushed from the bedroom side. Inch by inch, the trunk slid through the window.  Uncle Vernon coughed again.  \"A bit more,\" panted Fred, who was pulling from inside the car. \"One good push -\"  Harry and George threw their shoulders against the trunk and it slid out of the window into the back seat of the car.  \"Okay, let's go,\" George whispered.  But as Harry climbed onto the windowsill there came a sudden loud screech from behind him, followed immediately by the thunder of Uncle Vernon's voice.  \"THAT RUDDY OWL!\"  \"I've forgotten Hedwig!\"  Harry tore back across the room as the landing light clicked on - he snatched up Hedwig's cage, dashed to the window, and passed it out to Ron. He was scrambling back onto the chest of drawers when Uncle Vernon hammered on the unlocked door and it crashed open.  For a split second, Uncle Vernon stood framed in the doorway; then he let out a bellow like an angry bull and dived at Harry, grabbing him by the ankle.  Ron, Fred, and George seized Harry's arms and pulled as hard as they could.  \"Petunia!\" roared Uncle Vernon. \"He's getting away! HE'S GETTING AWAY!\"  But the Weasleys gave a gigantic tug and Harry's leg slid out of Uncle Vernon's grasp - Harry was in the car - he'd slammed the door shut  \"Put your foot down, Fred!\" yelled Ron, and the car shot suddenly toward the moon.  Harry couldn't believe it - he was free. He rolled down the  window, the night air whipping his hair, and looked back at the shrinking rooftops of Privet Drive. Uncle Vernon, Aunt Petunia, and Dudley were all hanging, dumbstruck, out of Harry's window."
}