{
  "id": "f7683eeabbee84ab367123fa5679851cfe39203c",
  "text": " The Magnar at least was a foe that he could hate. Give me Styr.  His fingers were growing stiff and his thumb was bleeding, but still Jon notched and drew and loosed. A gout of flame caught his eye, and he turned to see door of the common hall afire. It was only a few moments before the whole great timbered hall was burning. Three-Finger Hobb and his Mole’s Town helpers were safe atop the Wall, he knew, but it felt like a punch in the belly all the same.  JON,  Deaf Dick yelled in his thick voice,  the armory.  They were on the roof, he saw. One had a torch. Dick hopped up on the crenel for a better shot, jerked his crossbow to his shoulder, and sent a quarrel thrumming toward the torch man. He missed.  The archer down below him didn’t.  Follard never made a sound, only toppled forward headlong over the parapet. It was a hundred feet to the yard below. Jon heard the thump as he was peering round a straw soldier, trying to see where the arrow had come from. Not ten feet from Deaf Dick’s body, he glimpsed a leather shield, a ragged cloak, a mop of thick red hair. Kissed by fire, he thought, lucky. He brought his bow up, but his fingers would not part, and she was gone as suddenly as she’d appeared. He swiveled, cursing, and loosed a shaft at the men on the armory roof instead, but he missed them as well.  By then the east stables were afire too, black smoke and wisps of burning hay pouring from the stalls. When the roof collapsed, a flames rose up roaring, so loud they almost drowned out the warhorns of the Thenns. Fifty of them were pounding up the kingsroad in tight column, their shields held up above their heads. Others were swarming through the vegetable garden, across the flagstone yard, around the old dry well. Three had hacked their way through the doors of Maester Aemon’s apartments in the timber keep below the rookery, and a desperate fight was going on atop the Silent Tower, longswords against bronze axes. None of that mattered. The dance has moved on, he thought.  Jon hobbled across to Satin and grabbed him by the shoulder.  With me,  he shouted. Together they moved to the north parapet, where the King’s Tower looked down on the gate and Donal Noye’s makeshift wall of logs and barrels and sacks of corn. The Thenns were there before them.  They wore halfhelms, and had thin bronze disks sewn to their long leather shirts. Many wielded bronze axes, though a few were chipped stone. More had short stabbing spears with leaf-shaped heads that gleamed redly in the light from the burning stables. They were screaming in the Old Tongue as they stormed the barricade, jabbing with their spears, swinging their bronze axes, spilling corn and blood with equal abandon while crossbow quarrels and arrows rained down on them from the archers that Donal Noye had posted on the stair.   What do we do?  Satin shouted.   We kill them,  Jon shouted back, a black arrow in his hand.  No archer could have asked for an easier shot. The Thenns had their backs to the King’s Tower as they charged the crescent, clambering over bags and barrels to reach the men in black. Both Jon and Satin chanced to choose the same target. He had just reached the top of the barricade when an arrow sprouted from his neck and a quarrel between his shoulder blades. Half a heartbeat later a longsword took him in the belly and he fell back onto the man behind him. Jon reached down to his quiver and found it empty again. Satin was winding back his crossbow. He left him to it and went for more arrows, but he hadn’t taken more than three steps before the trap slammed open three feet in front of him. Bloody hell, I never even heard the door break.  There was no time to think or plan or shout for help. Jon dropped his bow, reached back over his shoulder, ripped Longclaw from its sheath, and buried the blade in the middle of the first head to pop out of the tower. Bronze was no match for Valyrian steel. The blow sheared right through the Thenn’s helm and deep into his skull, and he went crashing back down where he’d come from. There were more behind him, Jon knew from the shouting. He fell back and called to Satin. The next man to make the climb got a quarrel through his cheek. He vanished too.  The oil,  Jon said. Satin nodded. Together they snatched up the thick quilted pads they’d left beside the fire, lifted the heavy kettle of boiling oil, and dumped it down the hole on the Thenns below. The shrieks were as bad as anything he had ever heard, and Satin looked as though he was going to be sick. Jon kicked the trapdoor shut, set the heavy iron kettle on top of it, and gave the boy with the pretty face a hard shake.  Retch later,  Jon yelled.  Come.   They had only been gone from the parapets for a few moments, but everything below had changed. A dozen black brothers and a few Mole’s Town men still stood atop the crates and barrels, but the wildlings were swarming over all along the crescent, pushing them back. Jon saw one shove his spear up through Rast’s belly so hard he lifted him into the air."
}