{
  "id": "f77aed6af03ec9951a6c97eef991687f97ae56bd",
  "text": "  Harry, Ron, and Hermione followed her, looking back over their shoulders at Hagrid's cabin.  All the curtains were closed.  Was Hagrid in there, alone and ill? \"What's wrong with Hagrid?\"  Harry said, hurrying to catch up with Professor Grubbly-Plank. \"Never you mind,\" she said as though she thought he was being nosy. \"I do mind, though,\" said Harry hotly.  \"What's up with him?\" Professor Grubbly-Plank acted as though she couldn't hear him.  She led them past the paddock where the huge Beauxbatons horses were standing, huddled against the cold, and toward a tree on the edge of the forest, where a large and beautiful unicorn was tethered. Many of the girls \"ooooohed!\" at the sight of the unicorn. \"Oh it's so beautiful!\" whispered Lavender Brown.  \"How did she get it?  They're supposed to be really hard to catch!\" The unicorn was so brightly white it made the snow all around look gray.  It was pawing the ground nervously with its golden hooves and throwing back its horned head. \"Boys keep back!\" barked Professor Grubbly-Plank, throwing out an arm and catching Harry hard in the chest.  \"They prefer the woman's touch, unicorns.  Girls to the front, and approach with care, come on, easy does it. ...\" She and the girls walked slowly forward toward the unicorn, leaving the boys standing near the paddock fence, watching.  The moment Professor Grubbly-Plank was out of earshot. Harry turned to Ron. \"What d'you reckons wrong with him? You don't think a skrewt - ?\" \"Oh he hasn't been attacked, Potter, if that's what you're thinking,\" said Malfoy softly. \"No, he's just too ashamed to show his big, ugly face.\" \"What d'you mean?\"  said Harry sharply. Malfoy put his hand inside the pocket of his robes and pulled out a folded page of newsprint. \"There you go,\" he said. \"Hate to break it to you. Potter. ...\" He smirked as Harry snatched the page, unfolded it, and read it, with Ron, Seamus, Dean, and Neville looking over his shoulder.  It was an article topped with a picture of Hagrid looking extremely shifty.  DUMBLEDORE'S GIANT MISTAKE  Albus Dumbledore, eccentric Headmaster of Hogwarts School of Witchcraft and Wizardry, has never been afraid to make controversial staff appointments, writes Rita Skeeter, Special Correspondent.  In September of this year, he hired Alastor \"Mad-Eye\" Moody, the notoriously jinx-happy ex-Auror, to teach Defense Against the Dark Arts, a decision that caused many raised eyebrows at the Ministry of Magic, given Moody's well-known habit of attacking anybody who makes a sudden movement in his presence.  Mad-Eye Moody, however, looks responsible and kindly when set beside the part-human Dumbledore employs to teach Care of Magical Creatures. Rubeus Hagrid, who admits to being expelled from Hogwarts in his third year, has enjoyed the position of gamekeeper at the school ever since, a job secured for him by Dumbledore.  Last year, however, Hagrid used his mysterious influence over the headmaster to secure the additional post of Care of Magical Creatures teacher, over the heads of many better-qualified candidates. An alarmingly large and ferocious-looking man, Hagrid has been using his newfound authority to terrify the students in his care with a succession of horrific creatures. While Dumbledore turns a blind eye, Hagrid has maimed several pupils during a series of lessons that many admit to being \"very frightening.\" 'I was attacked by a hippogriff, and my friend Vincent Crabbe got a bad bite off a flobberworm,\" says Draco Malfoy, a fourth-year student. \"We all hate Hagrid, but we're just too scared to say anything.\" Hagrid has no intention of ceasing his campaign of intimidation, however. In conversation with a Daily Prophet reporter last month, he admitted breeding creatures he has dubbed \"Blast-Ended Skrewts,\" highly dangerous crosses between manti-cores and fire-crabs.  The creation of new breeds of magical creature is, of course, an activity usually closely observed by the Department for the Regulation and Control of Magical Creatures. Hagrid, however, considers himself to be above such petty restrictions. \"I was just having some fun,\" he says, before hastily changing the subject. As if this were not enough, the Daily Prophet has now unearthed evidence that Hagrid is not - as he has always pretended - a pure-blood wizard. He is not, in fact, even pure human. His mother, we can exclusively reveal, is none other than the giantess Fridwulfa, whose whereabouts are currently unknown. Bloodthirsty and brutal, the giants brought themselves to the point of extinction by warring amongst themselves during the last century. The handful that remained joined the ranks of He-Who-Must-Not-Be-Named, and were responsible for some of the worst mass Muggle killings of his reign of terror. While many of the giants who served He-Who-Must-Not-Be-Named were killed by Aurors working against the Dark Side, Fridwulfa was not among them. It is possible she escaped to one of the giant communities still existing in foreign mountain ranges."
}