{
  "id": "f7ac90b367d3d61a932fc5cf54cd27942175ec9b",
  "text": "    I shall wait in the stables.  He bowed and stomped off.  Tyrion drew Shae down beside him.  You are not safe here.    I have my walls, and the guards you gave me.    Sellswords,  Tyrion said.  They like my gold well enough, but will they die for it? As for these walls, a man could stand on another’s shoulders and be over in a heartbeat. A manse much like this one was burned during the riots. They killed the goldsmith who owned it for the crime of having a full larder, just as they tore the High Septon to pieces, raped Lollys half a hundred times, and smashed Ser Aron’s skull in. What do you think they would do if they got their hands on the Hand’s lady?    The Hand’s whore, you mean?  She looked at him with those big bold eyes of hers.  Though I would be your lady, m’lord. I’d dress in all the beautiful things you gave me, in satin and samite and cloth-of-gold, and I’d wear your jewels and hold your hand and sit by you at feasts. I could give you sons, I know I could… and I vow I’d never shame you.   My love for you shames me enough.  A sweet dream, Shae. Now put it aside, I beg you. It can never be.    Because of the queen? I’m not afraid of her either.    I am.    Then kill her and be done with it. It’s not as if there was any love between you.   Tyrion sighed.  She’s my sister. The man who kills his own blood is cursed forever in the sight of gods and men. Moreover, whatever you and I may think of Cersei, my father and brother hold her dear. I can scheme with any man in the Seven Kingdoms, but the gods have not equipped me to face Jaime with swords in hand.    The Young Wolf and Lord Stannis have swords and they don’t scare you.   How little you know, sweetling.  Against them I have all the power of House Lannister. Against Jaime or my father, I have no more than a twisted back and a pair of stunted legs.    You have me.  Shae kissed him, her arms sliding around his neck as she pressed her body to his.  The kiss aroused him, as her kisses always did, but this time Tyrion gently disentangled himself.  Not now. Sweetling, I have… well, call it the seed of a plan. I think I might be able to bring you into the castle kitchens.   Shae’s face went still.  The kitchens?    Yes. If I act through Varys, no one will be the wiser.   She giggled.  M’lord, I’d poison you. Every man who’s tasted my cooking has told me what a good whore I am.    The Red Keep has sufficient cooks. Butchers and bakers too. You’d need to pose as a scullion.    A pot girl,  she said,  in scratchy brown roughspun. Is that how m’lord wants to see me?    M’lord wants to see you alive,  Tyrion said.  You can scarcely scour pots in silk and velvet.    Has m’lord grown tired of me?  She reached a hand under his tunic and found his cock. In two quick strokes she had it hard.  He still wants me.  She laughed.  Would you like to fuck your kitchen wench, m’lord? You can dust me with flour and suck gravy off my titties if you…    Stop it.  The way she was acting reminded him of Dancy, who had tried so hard to win her wager. He yanked her hand away to keep her from further mischief.  This is not the time for bed sport, Shae. Your life may be at stake.   Her grin was gone.  If I’ve displeased m’lord, I never meant it, only… couldn’t you just give me more guards?   Tyrion breathed a deep sigh. Remember how young she is, he told himself. He took her hand.  Your gems can be replaced, and new gowns can be sewn twice as lovely as the old. To me, you’re the most precious thing within these walls. The Red Keep is not safe either, but it’s a deal safer than here. I want you there.    In the kitchens.  Her voice was flat.  Scouring pots.    For a short while.    My father made me his kitchen wench,  she said, her mouth twisting.  That was why I ran off.    You told me you ran off because your father made you his whore,  he reminded her.   That too. I didn’t like scouring his pots no more than I liked his cock in me.  She tossed her head.  Why can’t you keep me in your tower? Half the lords at court keep bedwarmers.    I was expressly forbidden to take you to court.    By your stupid father.  Shae pouted.  You’re old enough to keep all the whores you want. Does he take you for a beardless boy? What could he do, spank you?   He slapped her. Not hard, but hard enough.  Damn you,  he said.  Damn you. Never mock me. Not you.   For a moment Shae did not speak. The only sound was the cricket, chirping, chirping.  Beg pardon, m’lord,  she said at last, in a heavy wooden voice.  I never meant to be impudent.   And I never meant to strike you. Gods be good, am I turning into Cersei?  That was ill done,  he said.  On both our parts. Shae, you do not understand.  Words he had never meant to speak came tumbling out of him like mummers from a hollow horse.  When I was thirteen, I wed a crofter’s daughter. Or so I thought her. I was blind with love for her, and thought she felt the same for me, but my father rubbed my face in the truth. My bride was a whore Jaime had hired to give me my first taste of manhood."
}