{
  "id": "f7b70d2e676ccd7d5d7d15493c4f47403506d4b8",
  "text": "  He ate  any living thing, even  orc, if  he could catch it and strangle it without a struggle. He possessed a   secret treasure that had come to him long ages ago,  when he  still lived in  the light: a ring  of gold  that made its  wearer invisible. It was the  one  thing he  loved, his 'precious', and he talked to  it, even when it  was not  with him. For he kept it hidden safe in a hole on his island, except when he  was hunting or spying on the ores of the mines.       Maybe he would have attacked Bilbo at once, if the ring had been on him  when they met;  but it was  not, and  the hobbit held  in his hand an Elvish  knife,  which served him as a sword. So to gain time Gollum challenged Bilbo  to the Riddle-game,  saying that if he  asked a riddle which Bilbo could not   ####-guess, then  he would kill him and eat him;  but if Bilbo defeated him, then  he would do as Bilbo wished: he would lead him to a way out of the tunnels.        Since he was lost in the dark without hope, and could neither go on nor   back. Bilbo accepted the challenge; and they asked one another many riddles.   In the end Bilbo won the game, more by luck (as it seemed) than by wits; for  he was stumped at last  for a riddle to ask, and cried out, as his hand came  upon the ring he lad picked up and forgotten:  What  haw I got in my pocket?  This Gollum failed to answer, though he demanded three guesses.       The  Authorities, it is true, differ whether  this last  question was a   mere  'question' and not  a  'riddle' according to  the strict rules  of the  Game; but all agree that, after accepting it and trying to guess the answer,  Gollum was bound by his promise. And Bilbo pressed him to keep his word;  for  the  thought  came  to him that  this slimy creature might prove false, even  though  such  promises  were held sacred, and of old all  but  the wickedest  things feared to break them. But after ages alone in the dark Gollum's heart  was black, and  treachery was in it.  He slipped  away, and  returned to the  island, of which Bilbo knew nothing,  not far off in the dark  water. There,  he  thought,  lay  his  ring.  He was hungry now,  and angry, and  once  his  'precious' was with him he would not fear any weapon at all.       But the ring was  not on the island; he had  lost it, it was  gone. His  screech  sent a shiver down Bilbo's back, though he  did not  yet understand  what  had happened. But Gollum had at last leaped to a guess, too late. What  has  it got  in its pocketses? he  cried. The light in his eyes  was like  a   green flame as he sped back to murder the hobbit and recover his 'precious'.   Just  in  time Bilbo saw his peril,  and he fled blindly up the passage away  from the water;  and once more he was saved by his luck. For  just as he ran  he  put  his  hand in his  pocket, and  the ring  slipped  quietly on to his  finger. So it was that  Gollum passed him  without seeing him, and  went  to   guard  the  way out, lest the 'thief' should escape.  Warily Bilbo  followed  him, as he went along, cursing, and talking to himself about his 'precious';   from which  talk at last even Bilbo guessed the truth,  and hope came to him  in the darkness: he himself had  found the marvellous  ring and a chance  of  escape from the orcs and from Gollum.       At length they  came to a halt before an unseen opening that led to the  lower  gates  of  the mines,  on the eastward  side of the mountains.  There  Gollum  crouched at bay, smelling and listening;  and Bilbo  was  tempted to   ####-slay him with his sword. But  pity stayed him, and though  he kept the ring,  in  which  his  only hope lay, he  would not  use  it  to  help him kill the  wretched creature at a disadvantage. In  the  end, gathering his courage, he  leaped  over  Gollum in the dark, and fled away down the passage, pursued by  his enemy's cries  of hate and despair: Thief,  thief! Baggins!  We hates it  for ever!       Now it is a curious fact that this is not the story as Bilbo first told  it to his companions.  To  them his account was  that Gollum had promised to  give  him a present, if he  won the game;  but when  Gollum went to fetch it   from his island he found the treasure was gone: a magic ring, which had been  given to him long ago on his birthday. Bilbo guessed that this was the  very  ring  that he  had found, and as he had won the game, it was already  his by  right. But being in a tight place, he said nothing about it, and made Gollum  show him  the way out, as a reward instead of  a present. This account Bilbo  set down in  his memoirs, and he seems never to have altered it himself, not   even after  the  Council of  Elrond.  Evidently  it  still  appeared in  the  origina l Red Book, as it  did  in several of the  copies  and abstracts. But  many copies contain the  true account (as an alternative), derived no  doubt  from notes by Frodo  or Samwise, both of whom learned the truth, though they  seem to have been unwilling to delete anything  actually written by the  old  hobbit himself."
}