{
  "id": "f7c515e3a5c43758e3e5f07fa4d1a856c5a3fe60",
  "text": "  He had taken wounds before, but never like this. He had never known there could be such pain. Sometimes, unbidden, old prayers bubbled from his lips, prayers he learned as a child and never thought of since, prayers he had first prayed with Cersei kneeling beside him in the sept at Casterly Rock. Sometimes he even wept, until he heard the Mummers laughing. Then he made his eyes go dry and his heart go dead, and prayed for his fever to burn away his tears. Now I know how Tyrion has felt, all those times they laughed at him.  After the second time he fell from the saddle, they bound him tight to Brienne of Tarth and made them share a horse again. One day, instead of back to front, they bound them face-to-face.  The lovers,  Shagwell sighed loudly,  and what a lovely sight they are. ’Twould be cruel to separate the good knight and his lady.  Then he laughed that high shrill laugh of his, and said,  Ah, but which one is the knight and which one is the lady?   If I had my hand, you’d learn that soon enough, Jaime thought. His arms ached and his legs were numb from the ropes, but after a while none of that mattered. His world shrunk to the throb of agony that was his phantom hand, and Brienne pressed against him. She’s warm, at least, he consoled himself, though the wench’s breath was as foul as his own.  His hand was always between them. Urswyck had hung it about his neck on a cord, so it dangled down against his chest, slapping Brienne’s breasts as Jaime slipped in and out of consciousness. His right eye was swollen shut, the wound inflamed where Brienne had cut him during their fight, but it was his hand that hurt the most. Blood and pus seeped from his stump, and the missing hand throbbed every time the horse took a step.  His throat was so raw that he could not eat, but he drank wine when they gave it to him, and water when that was all they offered. Once they handed him a cup and he quaffed it straight away, trembling, and the Brave Companions burst into laughter so loud and harsh it hurt his ears.  That’s horse piss you’re drinking, Kingslayer,  Rorge told him. Jaime was so thirsty he drank it anyway, but afterward he retched it all back up. They made Brienne wash the vomit out of his beard, just as they made her clean him up when he soiled himself in the saddle.  One damp cold morning when he was feeling slightly stronger, a madness took hold of him and he reached for the Dornishman’s sword with his left hand and wrenched it clumsily from its scabbard. Let them kill me, he thought, so long as I die fighting, a blade in hand. But it was no good. Shagwell came hopping from leg to leg, dancing nimbly aside when Jaime slashed at him. Unbalanced, he staggered forward, hacking wildly at the fool, but Shagwell spun and ducked and darted until all the Mummers were laughing at Jaime’s futile efforts to land a blow. When he tripped over a rock and stumbled to his knees, the fool leapt in and planted a wet kiss atop his head.  Rorge finally flung him aside and kicked the sword from Jaime’s feeble fingers as he tried to bring it up.  That wath amuthing, Kingthlayer,  said Vargo Hoat,  but if you try it again, I thall take your other hand, or perhapth a foot.   Jaime lay on his back afterward, staring at the night sky, trying not to feel the pain that snaked up his right arm every time he moved it. The night was strangely beautiful. The moon was a graceful crescent, and it seemed as though he had never seen so many stars. The King’s Crown was at the zenith, and he could see the Stallion rearing, and there the Swan. The Moonmaid, shy as ever, was half-hidden behind a pine tree. How can such a night be beautiful? he asked himself. Why would the stars want to look down on such as me?   Jaime,  Brienne whispered, so faintly he thought he was dreaming it.  Jaime, what are you doing?    Dying,  he whispered back.   No,  she said,  no, you must live.   He wanted to laugh.  Stop telling me what do, wench. I’ll die if it pleases me.    Are you so craven?   The word shocked him. He was Jaime Lannister, a knight of the Kingsguard, he was the Kingslayer. No man had ever called him craven. Other things they called him, yes; oathbreaker, liar, murderer. They said he was cruel, treacherous, reckless. But never craven.  What else can I do, but die?    Live,  she said,  live, and fight, and take revenge.  But she spoke too loudly. Rorge heard her voice, if not her words, and came over to kick her, shouting at her to hold her bloody tongue if she wanted to keep it.  Craven, Jaime thought, as Brienne fought to stifle her moans. Can it be? They took my sword hand. Was that all I was, a sword hand? Gods be good, is it true?  The wench had the right of it. He could not die. Cersei was waiting for him. She would have need of him. And Tyrion, his little brother, who loved him for a lie. And his enemies were waiting too; the Young Wolf who had beaten him in the Whispering Wood and killed his men around him, Edmure Tully who had kept him in darkness and chains, these Brave Companions."
}