{
  "id": "f7c964fc7e5a8c29be4dce136a095a9f06128441",
  "text": " I would tell you the names of all the men I have slain, but before I could finish your dragons would grow large as castles, the walls of Yunkai would crumble into yellow dust, and winter would come and go and come again.   Dany laughed. She liked the swagger she saw in this Daario Naharis.  Draw your sword and swear it to my service.   In a blink, Daario’s arakh was free of its sheath. His submission was as outrageous as the rest of him, a great swoop that brought his face down to her toes.  My sword is yours. My life is yours. My love is yours. My blood, my body, my songs, you own them all. I live and die at your command, fair queen.    Then live,  Dany said,  and fight for me tonight.    That would not be wise, my queen.  Ser Jorah gave Daario a cold, hard stare.  Keep this one here under guard until the battle’s fought and won.   She considered a moment, then shook her head.  If he can give us the Stormcrows, surprise is certain.    And if he betrays you, surprise is lost.   Dany looked down at the sellsword again. He gave her such a smile that she flushed and turned away.  He won’t.    How can you know that?   She pointed to the lumps of blackened flesh the dragons were consuming, bite by bloody bite.  I would call that proof of his sincerity. Daario Naharis, have your Stormcrows ready to strike the Yunkish rear when my attack begins. Can you get back safely?    If they stop me, I will say I have been scouting, and saw nothing.  The Tyroshi rose to his feet, bowed, and swept out.  Ser Jorah Mormont lingered.  Your Grace,  he said, too bluntly,  that was a mistake. We know nothing of this man—    We know that he is a great fighter.    A great talker, you mean.    He brings us the Stormcrows.  And he has blue eyes.   Five hundred sellswords of uncertain loyalty.    All loyalties are uncertain in such times as these,  Dany reminded him. And I shall be betrayed twice more, once for gold and once for love.   Daenerys, I am thrice your age,  Ser Jorah said.  I have seen how false men are. Very few are worthy of trust, and Daario Naharis is not one of them. Even his beard wears false colors.   That angered her.  Whilst you have an honest beard, is that what you are telling me? You are the only man I should ever trust?   He stiffened.  I did not say that.    You say it every day. Pyat Pree’s a liar, Xaro’s a schemer, Belwas a braggart, Arstan an assassin… do you think I’m still some virgin girl, that I cannot hear the words behind the words?    Your Grace—   She bulled over him.  You have been a better friend to me than any I have known, a better brother than Viserys ever was. You are the first of my Queensguard, the commander of my army, my most valued counselor, my good right hand. I honor and respect and cherish you—but I do not desire you, Jorah Mormont, and I am weary of your trying to push every other man in the world away from me, so I must needs rely on you and you alone. It will not serve, and it will not make me love you any better.   Mormont had flushed red when she first began, but by the time Dany was done his face was pale again. He stood still as stone.  If my queen commands,  he said, curt and cold.  Dany was warm enough for both of them.  She does,  she said.  She commands. Now go see to your Unsullied, ser. You have a battle to fight and win.   When he was gone, Dany threw herself down on her pillows beside her dragons. She had not meant to be so sharp with Ser Jorah, but his endless suspicion had finally woken her dragon.  He will forgive me, she told herself. I am his liege. Dany found herself wondering whether he was right about Daario. She felt very lonely all of a sudden. Mirri Maz Duur had promised that she would never bear a living child. House Targaryen will end with me. That made her sad.  You must be my children,  she told the dragons,  my three fierce children. Arstan says dragons live longer than men, so you will go on after I am dead.   Drogon looped his neck around to nip at her hand. His teeth were very sharp, but he never broke her skin when they played like this. Dany laughed, and rolled him back and forth until he roared, his tail lashing like a whip. It is longer than it was, she saw, and tomorrow it will be longer still. They grow quickly now, and when they are grown I shall have my wings. Mounted on a dragon, she could lead her own men into battle, as she had in Astapor, but as yet they were still too small to bear her weight.  A stillness settled over her camp when midnight came and went. Dany remained in her pavilion with her maids, while Arstan Whitebeard and Strong Belwas kept the guard. The waiting is the hardest part. To sit in her tent with idle hands while her battle was being fought without her made Dany feel half a child again.  The hours crept by on turtle feet. Even after Jhiqui rubbed the knots from her shoulders, Dany was too restless for sleep. Missandei offered to sing her a lullaby of the Peaceful People, but Dany shook her head.  Bring me Arstan,  she said."
}