{
  "id": "f7e702489dfc4da248d4f63257e9a003d8faa1fa",
  "text": " Slytherin was leading the tournament by exactly two hundred points. This meant (as Wood constantly reminded his team) that they needed to win the match by more than that amount to win the Cup. It also meant that the burden of winning fell largely on Harry, because capturing the Snitch was worth one hundred and fifty points.  \"So you must catch it only if we're more than fifty points up,\" Wood told Harry constantly. \"Only if we're more than fifty points up, Harry, or we win the match but lose the Cup. You've got that, Haven't you? You must catch the Snitch only if we're --\"  \"I KNOW, OLIVER!\" Harry yelled.  The whole of Gryffindor House was obsessed with the coming match. Gryffindor hadn't won the Quidditch Cup since the legendary Charlie Weasley (Ron's second oldest brother) had been seeker. But Harry doubted whether any of them, even Wood, wanted to win as much as he did. The enmity between Harry and Malfoy was at its highest point ever. Malfoy was still smarting ,bout the mud-throwing incident in Hogsmeade and was even more furious that Harry had somehow wormed his way out of punishment. Harry hadn't forgotten Malfoy's attempt to sabotage him in the match against Ravenclaw, but it was the matter of Buckbeak that made him most determined to beat Malfoy in front of the entire school.  Never, in anyone's memory, had a match approached in such a highly charged atmosphere. By the time the holidays were over, tension between the two teams and their Houses was at the breaking point. A number of small scuffles broke out in the corridors, culminating in a nasty incident in which a Gryffindor fourth year and a Slytherin sixth year ended up in the hospital wing with leeks sprouting out of their ears.  Harry was having a particularly bad time of it. He couldn't walk to class without Slytherins sticking out their legs and trying to trip him up; Crabbe and Goyle kept popping up wherever he went, and slouching away looking disappointed when they saw him surrounded by people. Wood had given instructions that Harry should be accompanied everywhere he went, in case the Slytherins tried to put him out of action. The whole of Gryffindor House took up the challenge enthusiastically, so that it was impossible for Harry to get to classes on time because he was surrounded by a vast, chattering crowd. Harry was more concerned for his Firebolt's safety than his own. When he wasn't flying it, he locked it securely in his trunk and frequently dashed back up to Gryffindor Tower at break times to check that it was still there.  All usual pursuits were abandoned in the Gryffindor common room the night before the match. Even Hermione had Put down her books.  \"I can't work, I can't concentrate,\" she said nervously.  There was a great deal of noise. Fred and George Weasley were dealing with the pressure by being louder and more exuberant than ever. Oliver Wood was crouched over a model of a Quidditch field in the corner, prodding little figures across it with his wand and muttering to himself Angelina, Alicia, and Katie were laughing at Fred's and George's jokes. Harry was sitting with Ron and Hermione, removed from the center of things, trying not to think about the next day, because every time he did, he had the horrible sensation that something very large was fighting to get out of his stomach.  \"You're going to be fine,\" Hermione told him, though she looked positively terrified.  \"You've got a Firebolt!\" said Ron.  \"Yeah...\" said Harry, his stomach writhing.  It came as a relief when Wood suddenly stood up and yelled, \"Team! Bed!\"  Harry slept badly. First he dreamed that he had overslept, and that Wood was yelling, \"Where were you? We had to use Neville instead!\" Then he dreamed that Malfoy and the rest of the Slytherin team arrived for the match riding dragons. He was flying at breakneck speed, trying to avoid a spurt of flames from Malfoy's steed's mouth, when he realized he had forgotten his Firebolt. He fell through the air and woke with a start.  It was a few seconds before Harry remembered that the match hadn't taken place yet, that he was safe in bed, and that the Slytherin team definitely wouldn't be allowed to play on dragons. He was feeling very thirsty. Quietly as he could, he got out of his four-poster and went to pour himself some water from the silver jug beneath the window.  The grounds were still and quiet. No breath of wind disturbed the treetops in the Forbidden Forest; the Whomping Willow was motionless and innocent-looking. It looked as though the conditions for the match would be perfect.  Harry set down his goblet and was about to turn back to his bed when something caught his eye. An animal of some kind was prowling across the silvery lawn.  Harry dashed to his bedside table, snatched up his glasses, and put them on, then hurried back to the window. It couldn't be the Grim -- not now -- not right before the match -  He peered out at the grounds again and, after a minute's frantic searching, spotted it. It was skirting the edge of the forest now."
}