{
  "id": "f8808959e9b79935569fafb543d12f4d46e7011e",
  "text": "... Come on, let's go.\"  Harry had barely closed the door on Myrtle's gurgling sobs when a loud voice made all three of them jump.  \"RON!\"  Percy Weasley had stopped dead at the head of the stairs, prefect badge agleam, an expression of complete shock on his face.  \"That's a girls' bathroom!\" he gasped. \"What were you -?\"  \"Just having a look around,\" Ron shrugged. \"Clues, you know -\"  Percy swelled in a manner that reminded Harry forcefully of Mrs. Weasley.  \"Get - away - from - there -\" Perry said, striding toward them and starting to bustle them along, flapping his arms. \"Don't you care what this looks like? Coming back here while everyone's at dinner -\"  \"Why shouldn't we be here?\" said Ron hotly, stopping short and glaring at Percy. \"Listen, we never laid a finger on that cat!\"  \"That's what I told Ginny,\" said Percy fiercely, \"but she still seems to think you're going to be expelled, I've never seen her so upset, crying her eyes out, you might think of her, all the first years are thoroughly overexcited by this business -\"  \"You don't care about Ginny,\" said Ron, whose ears were now  *157*  reddening. \"You're just worried I'm going to mess up your chances of being Head Boy -\"  \"Five points from Gryffindor!\" Percy said tersely, fingering his prefect badge. \"And I hope it teaches you a lesson! No more detective work, or I'll write to Mum!\"  And he strode off, the back of his neck as red as Ron's ears.  Harry, Ron, and Hermione chose seats as far as possible from Percy in the common room that night. Ron was still in a very bad temper and kept blotting his Charms homework. When he reached absently for his wand to remove the smudges, it ignited the parchment. Fuming almost as much as his homework, Ron slammed The Standard Book of Spells, Grade 2 shut. To Harry's surprise, Hermione followed suit.  \"Who can it be, though?\" she said in a quiet voice, as though continuing a conversation they had just been having. \"Who'd want to frighten all the Squibs and Muggle-borns out of Hogwarts?\"  \"Let's think,\" said Ron in mock puzzlement. \"Who do we know who thinks Muggle-borns are scum?\"  He looked at Hermione. Hermione looked back, unconvinced.  \"If you're talking about Malfoy -\"  \"Of course I am!\" said Ron. \"You heard him - `You'll be next, Mudbloods!'- come on, you've only got to look at his foul rat face to know it's him -\"  \"Malfoy, the Heir of Slytherin?\" said Hermione skeptically.  \"Look at his family,\" said Harry, closing his books, too. \"The whole lot of them have been in Slytherin; he's always boasting about it. They could easily be Slytherin's descendants. His father's definitely evil enough.\"  *158*  \"They couldve had the key to the Chamber of Secrets for centuries!\" said Ron. \"Handing it down, father to son ......  \"Well,\" said Hermione cautiously, \"I suppose it's possible ......  \"But how do we prove it?\" said Harry darkly.  \"There might be a way,\" said Hermione slowly, dropping her voice still further with a quick glance across the room at Percy. \"Of course, it would be difficult. And dangerous, very dangerous. We'd be breaking about fifty school rules, I expect -\"  \"If, in a month or so, you feel like explaining, you will let us know, won't you?\" said Ron irritably.  \"All right,\" said Hermione coldly. \"What we'd need to do is to get inside the Slytherin common room and ask Malfoy a few questions without him realizing it's us.\"  \"But that's impossible,\" Harry said as Ron laughed.  \"No, it's not,\" said Hermione. \"All we'd need would be some Polyjuice Potion.\"  \"What's that?\" said Ron and Harry together.  \"Snape mentioned it in class a few weeks ago -\"  \"D'you think we've got nothing better to do in Potions than listen to Snape?\" muttered Ron.  \"It transforms you into somebody else. Think about it! We could change into three of the Slytherins. No one would know it was us. Malfoy would probably tell us anything. He's probably boasting about it in the Slytherin common room right now, if only we could hear him.\"  \"This Polyjuice stuff sounds a bit dodgy to me,\" said Ron, frowning. \"What if we were stuck looking like three of the Slytherins forever?\"  \"It wears off after a while,\" said Hermione, waving her hand  *159*  impatiently. \"But getting hold of the recipe will be very difficult. Snape said it was in a book called Moste Potente Potions and it's bound to be in the Restricted Section of the library.\" There was only one way to get out a book from the Restricted Section: You needed a signed note of permission from a teacher. \"Hard to see why we'd want the book, really,\" said Ron, \"if we weren't going to try and make one of the potions.\" \"I think,\" said Hermione, \"that if we made it sound as though we were just interested in the theory, we might stand a chance ...... \"Oh, come on, no teacher's going to fall for that,\" said Ron. \"They'd have to be really thick . . . .\"  C H-H A P T V It  T 1' N  THE ROGUE BLUDGER  ince the disastrous episode of the pixies, Professor Lockhart had not brought live creatures to class."
}