{
  "id": "f8c1c24bfd42c41ac7ef352d1d0e613d1982c554",
  "text": " Come to the godswood tonight, if you want to go home. She drifted to her window. Below, she could see a short knight in moon-pale armor and a heavy white cloak pacing the drawbridge. From his height, it could only be Ser Preston Greenfield. The queen had given her freedom of the castle, but even so, he would want to know where she was going if she tried to leave Maegor’s Holdfast at this time of night. What was she to tell him? Suddenly she was glad she had burned the note.  She unlaced her gown and crawled into her bed, but she did not sleep. Was he still there? she wondered. How long will he wait? It was so cruel, to send her a note and tell her nothing. The thoughts went round and round in her head.  If only she had someone to tell her what to do. She missed Septa Mordane, and even more Jeyne Poole, her truest friend. The septa had lost her head with the rest, for the crime of serving House Stark. Sansa did not know what had happened to Jeyne, who had disappeared from her rooms afterward, never to be mentioned again. She tried not to think of them too often, yet sometimes the memories came unbidden, and then it was hard to hold back the tears. Once in a while, Sansa even missed her sister. By now Arya was safe back in Winterfell, dancing and sewing, playing with Bran and baby Rickon, even riding through the winter town if she liked. Sansa was allowed to go riding too, but only in the bailey, and it got boring going round in a circle all day.  She was wide awake when she heard the shouting. Distant at first, then growing louder. Many voices yelling together. She could not make out the words. And there were horses as well, and pounding feet, shouts of command. She crept to her window and saw men running on the walls, carrying spears and torches. Go back to your bed, Sansa told herself, this is nothing that concerns you, just some new trouble out in the city. The talk at the wells had all been of troubles in the city of late. People were crowding in, running from the war, and many had no way to live save by robbing and killing each other. Go to bed.  But when she looked, the white knight was gone, the bridge across the dry moat down but undefended.  Sansa turned away without thinking and ran to her wardrobe. Oh, what am I doing? she asked herself as she dressed. This is madness. She could see the lights of many torches on the curtain walls. Had Stannis and Renly come at last to kill Joffrey and claim their brother’s throne? If so, the guards would raise the drawbridge, cutting off Maegor’s Holdfast from the outer castle. Sansa threw a plain grey cloak over her shoulders and picked up the knife she used to cut her meat. If it is some trap, better that I die than let them hurt me more, she told herself. She hid the blade under her cloak.  A column of red-cloaked swordsmen ran past as she slipped out into the night. She waited until they were well past before she darted across the undefended drawbridge. In the yard, men were buckling on swordbelts and cinching the saddles of their horses. She glimpsed Ser Preston near the stables with three others of the Kingsguard, white cloaks bright as the moon as they helped Joffrey into his armor. Her breath caught in her throat when she saw the king. Thankfully, he did not see her. He was shouting for his sword and crossbow.  The noise receded as she moved deeper into the castle, never daring to look back for fear that Joffrey might be watching… or worse, following. The serpentine steps twisted ahead, striped by bars of flickering light from the narrow windows above. Sansa was panting by the time she reached the top. She ran down a shadowy colonnade and pressed herself against a wall to catch her breath. When something brushed against her leg, she almost jumped out of her skin, but it was only a cat, a ragged black tom with a chewed-off ear. The creature spit at her and leapt away.  By the time she reached the godswood, the noises had faded to a faint rattle of steel and a distant shouting. Sansa pulled her cloak tighter. The air was rich with the smells of earth and leaf. Lady would have liked this place, she thought. There was something wild about a godswood; even here, in the heart of the castle at the heart of the city, you could feel the old gods watching with a thousand unseen eyes.  Sansa had favored her mother’s gods over her father’s. She loved the statues, the pictures in leaded glass, the fragrance of burning incense, the septons with their robes and crystals, the magical play of the rainbows over altars inlaid with mother-of-pearl and onyx and lapis lazuli. Yet she could not deny that the godswood had a certain power too. Especially by night. Help me, she prayed, send me a friend, a true knight to champion me…  She moved from tree to tree, feeling the roughness of the bark beneath her fingers. Leaves brushed at her cheeks. Had she come too late? He would not have left so soon, would he? Or had he even been here? Dare she risk calling out? It seemed so hushed and still here…   I feared you would not come, child."
}