{
  "id": "f90fcdf92c635c6bf13c2529b7b187bda3def4d7",
  "text": " \"That was a very decent thing you just did, Potter,\" Moody said quietly. Harry didn't know what to say; this wasn't the reaction he had expected at all. \"Sit down,\" said Moody, and Harry sat, looking around. He had visited this office under two of its previous occupants.  In Professor Lockhart's day, the walls had been plastered with beaming, winking pictures of Professor Lockhart himself. When Lupin had lived here, you were more likely to come across a specimen of some fascinating new Dark creature he had procured for them to study in class.  Now, however, the office was full of a number of exceptionally odd objects that Harry supposed Moody had used in the days when he had been an Auror. On his desk stood what looked hike a large, cracked, glass spinning top; Harry recognized it at once as a Sneakoscope, because he owned one himself, though it was much smaller than Moody's.  In the corner on a small table stood an object that looked something like an extra-squiggly, golden television aerial.  It was humming slightly.  What appeared to be a mirror hung opposite Harry on the wall, but it was not reflecting the room.  Shadowy figures were moving around inside it, none of them clearly in focus. \"Like my Dark Detectors, do you?\" s aid Moody, who was watching Harry closely. \"What's that?\"  Harry asked, pointing at the squiggly golden aerial. \"Secrecy Sensor.  Vibrates when it detects concealment and lies.. . no use here, of course, too much interference - students in every direction lying about why they haven't done their homework  Been humming ever since I got here.  I had to disable my Sneakoscope because it wouldn't stop whistling.  It's extra-sensitive, picks up stuff about a mile around.  Of course, it could be picking up more than kid stuff,\" he added in a growl. \"And what's the mirror for?\" \"Oh that's my Foe-Glass.  See them out there, skulking around?  I'm not really in trouble until I see the whites of their eyes.  That's when I open my trunk.\" He let out a short, harsh laugh, and pointed to the large trunk under the window.  It had seven keyholes in a row.  Harry wondered what was in there, until Moody's next question brought him sharply back to earth. \"So. . . found out about the dragons, have you?\" Harry hesitated.  He'd been afraid of this - but he hadn't told Cedric, and he certainly wasn't going to tell Moody, that Hagrid had broken the rules. \"It's all right,\" said Moody, sitting down and stretching out his wooden leg with a groan. \"Cheating's a traditional part of the Triwizard Tournament and always has been.\" \"I didn't cheat,\" said Harry sharply.  \"It was - a sort of accident that I found out.\" Moody grinned.  \"I wasn't accusing you, laddie.  I've been telling Dumbledore from the start, he can be as high-minded as he likes, but you can bet old Karkaroff and Maxime won't be.  They'll have told their champions everything they can.  They want to win.  They want to beat Dumbledore.  They'd like to prove he's only human.\" Moody gave another harsh laugh, and his magical eye swiveled around so fast it made Harry feel queasy to watch it. \"So. . . got any ideas how you're going to get past your dragon yet?\" said Moody. \"No,\" said Harry. \"Well, I'm not going to tell you,\" said Moody gruffly.  \"I don't show favoritism, me.  I'm just going to give you some good, general advice.  And the first bit is - play to your strengths.\" \"I haven't got any,\" said Harry, before he could stop himself.  \"Excuse me,\" growled Moody, \"you've got strengths if I say you've got them.  Think now.  What are you best at?\" Harry tried to concentrate.  What was he best at?  Well, that was easy, really -- \"Quidditch,\" he said dully, \"and a fat lot of help -\"  \"That's right,\" said Moody, staring at him very hard, his magical eye barely moving at all.  \"You're a damn good flier from what I've heard.\" \"Yeah, but.. .\" Harry stared at him.  \"I'm not allowed a broom, I've only got my wand...\" \"My second piece of general advice,\" said Moody loudly, interrupting him, \"is to use a nice, simple spell that will enable you to get what you need.\"  Harry looked at him blankly.  What did he need? \"Come on, boy. . .\" whispered Moody.  \"Put them together... it's not that difficult...\" And it clicked.  He was best at flying.  He needed to pass the dragon in the air.  For that, he needed his Firebolt.  And for his Fire-bolt, he needed -   \"Hermione,\" Harry whispered, when he had sped into greenhouse three minutes later, uttering a hurried apology to Professor Sprout as he passed her.  \"Hermione - I need you to help me.\" \"What d'you think I've been trying to do, Harry?\"  she whispered back, her eyes round with anxiety over the top of the quivering Flutterby Bush she was pruning. \"Hermione, I need to learn how to do a Summoning Charm properly by tomorrow afternoon.\"  And so they practiced.  They didn't have lunch, but headed for a free classroom, where Harry tried with all his might to make various objects fly across the room toward him.  He was still having problems."
}