{
  "id": "f949ed7f6053b124d4ceddacdd175dfc0a46f493",
  "text": " Two of the whores had even offered to fight, and had shown enough skill with the crossbow to be given a place on the steps forty feet up.   It’s cold.  Satin stood with his hands tucked into his armpits under his cloak. His cheeks were bright red.  Jon made himself smile.  The Frostfangs are cold. This is a brisk autumn day.    I hope I never see the Frostfangs then. I knew a girl in Oldtown who liked to ice her wine. That’s the best place for ice, I think. In wine.  Satin glanced south, frowned.  You think the scarecrow sentinels scared them off, my lord?    We can hope.  It was possible, Jon supposed… but more likely the wildlings had simply paused for a bit of rape and plunder in Mole’s Town. Or maybe Styr was waiting for nightfall, to move up under cover of darkness.  Midday came and went, with still no sign of Thenns on the kingsroad. Jon heard footsteps inside the tower, though, and Owen the Oaf popped up out of the trapdoor, red-faced from the climb. He had a basket of buns under one arm, a wheel of cheese under the other, a bag of onions dangling from one hand.  Hobb said to feed you, in case you’re stuck up here awhile.   That, or for our last meal.  Thank him for us, Owen.   Dick Follard was deaf as a stone, but his nose worked well enough. The buns were still warm from the oven when he went digging in the basket and plucked one out. He found a crock of butter as well, and spread some with his dagger.  Raisins,  he announced happily.  Nuts, too.  His speech was thick, but easy enough to understand once you got used to it.   You can have mine too,  said Satin.  I’m not hungry.    Eat,  Jon told him.  There’s no knowing when you’ll have another chance.  He took two buns himself . The nuts were pine nuts, and besides the raisins there were bits of dried apple.   Will the wildlings come today, Lord Snow?  Owen asked.   You’ll know if they do,  said Jon.  Listen for the horns.    Two. Two is for wildlings.  Owen was tall, towheaded, and amiable, a tireless worker and surprisingly deft when it came to working wood and fixing catapults and the like, but as he’d gladly tell you, his mother had dropped him on his head when he was a baby, and half his wits had leaked out through his ear.   You remember where to go?  Jon asked him.   I’m to go to the stairs, Donal Noye says. I’m to go up to the third landing and shoot my crossbow down at the wildlings if they try to climb over the barrier. The third landing, one two three.  His head bobbed up and down.  If the wildlings attack, the king will come and help us, won’t he? He’s a mighty warrior, King Robert. He’s sure to come. Maester Aemon sent him a bird.   There was no use telling him that Robert Baratheon was dead. He would forget it, as he’d forgotten it before.  Maester Aemon sent him a bird,  Jon agreed. That seemed to make Owen happy.  Maester Aemon had sent a lot of birds… not to one king, but to four. Wildlings at the gate, the message ran. The realm in danger. Send all the help you can to Castle Black, Even as far as Oldtown and the Citadel the ravens flew, and to half a hundred mighty lords in their castles. The northern lords offered their best hope, so to them Aemon had sent two birds. To the Umbers and the Boltons, to Castle Cerwyn and Torrhen’s Square, Karhold and Deepwood Motte, to Bear Island, Oldcastle, Widow’s Watch, White Harbor, Barrowton, and the Rills, to the mountain fastnesses of the Liddles, the Burleys, the Norreys, the Harclays, and the Wulls, the black birds brought their plea. Wildlings at the gate. The north in danger. Come with all your strength.  Well, ravens might have wings, but lords and kings do not. If help was coming, it would not come today.  As morning turned to afternoon, the smoke of Mole’s Town blew away and the southern sky was clear again. No clouds, thought Jon. That was good. Rain or snow could doom them all.  Clydas and Maester Aemon rode the winch cage up to safety at the top of the Wall, and most of the Mole’s Town wives as well. Men in black cloaks paced restlessly on the tower tops and shouted back and forth across the courtyards. Septon Cellador led the men on the barricade in a prayer, beseeching the Warrior to give them strength. Deaf Dick Follard curled up beneath his cloak and went to sleep. Satin walked a hundred leagues in circles, round and round the crenellations. The Wall wept and the sun crept across a hard blue sky. Near evenfall, Owen the Oaf returned with a loaf of black bread and a pail of Hobb’s best mutton, cooked in a thick broth of ale and onions. Even Dick woke up for that. They ate every bit of it, using chunks of bread to wipe the bottom of the pail. By the time they were done the sun was low in the west, the shadows sharp and black throughout the castle.  Light the fire,  Jon told Satin,  and fill the kettle with oil.   He went downstairs himself to bar the door, to try and work some of the stiffness from his leg. That was a mistake, and Jon soon knew it, but he clutched the crutch and saw it through all the same."
}