{
  "id": "f97615cd68ef08828d38bc17339dbe9fb6c9aeaf",
  "text": "  He has giant’s blood in him, or I’m the queen.    Maester Luwin says there are no more giants. He says they’re all dead, like the children of the forest. All that’s left of them are old bones in the earth that men turn up with plows from time to time.    Let Maester Luwin ride beyond the Wall,  Osha said.  He’ll find giants then, or they’ll find him. My brother killed one. Ten foot tall she was, and stunted at that. They’ve been known to grow big as twelve and thirteen feet. Fierce things they are too, all hair and teeth, and the wives have beards like their husbands, so there’s no telling them apart. The women take human men for lovers, and it’s from them the half bloods come. It goes harder on the women they catch. The men are so big they’ll rip a maid apart before they get her with child.  She grinned at him.  But you don’t know what I mean, do you, boy?    Yes I do,  Bran insisted. He understood about mating; he had seen dogs in the yard, and watched a stallion mount a mare. But talking about it made him uncomfortable. He looked at Hodor.  Go back and bring your clothes, Hodor,  he said.  Go dress.    Hodor.  He walked back the way he had come, ducking under a low-hanging tree limb.  He was awfully big, Bran thought as he watched him go.  Are there truly giants beyond the Wall?  he asked Osha, uncertainly.   Giants and worse than giants, Lordling. I tried to tell your brother when he asked his questions, him and your maester and that smiley boy Greyjoy. The cold winds are rising, and men go out from their fires and never come back… or if they do, they’re not men no more, but only wights, with blue eyes and cold black hands. Why do you think I run south with Stiv and Hali and the rest of them fools? Mance thinks he’ll fight, the brave sweet stubborn man, like the white walkers were no more than rangers, but what does he know? He can call himself King-beyond-the-Wall all he likes, but he’s still just another old black crow who flew down from the Shadow Tower. He’s never tasted winter. I was born up there, child, like my mother and her mother before her and her mother before her, born of the Free Folk. We remember.  Osha stood, her chains rattling together.  I tried to tell your lordling brother. Only yesterday, when I saw him in the yard. ‘M’lord Stark,’ I called to him, respectful as you please, but he looked through me, and that sweaty oaf Greatjon Umber shoves me out of the path. So be it. I’ll wear my irons and hold my tongue. A man who won’t listen can’t hear.    Tell me. Robb will listen to me, I know he will.    Will he now? We’ll see. You tell him this, m’lord. You tell him he’s bound on marching the wrong way. It’s north he should be taking his swords. North, not south. You hear me?   Bran nodded.  I’ll tell him.   But that night, when they feasted in the Great Hall, Robb was not with them. He took his meal in the solar instead, with Lord Rickard and the Greatjon and the other lords bannermen, to make the final plans for the long march to come. It was left to Bran to fill his place at the head of the table, and act the host to Lord Karstark’s sons and honored friends. They were already at their places when Hodor carried Bran into the hall on his back, and knelt beside the high seat. Two of the serving men helped lift him from his basket. Bran could feel the eyes of every stranger in the hall. It had grown quiet.  My lords,  Hallis Mollen announced,  Brandon Stark, of Winterfell.    I welcome you to our fires,  Bran said stiffly,  and offer you meat and mead in honor of our friendship.   Harrion Karstark, the oldest of Lord Rickard’s sons, bowed, and his brothers after him, yet as they settled back in their places he heard the younger two talking in low voices, over the clatter of wine cups.  …sooner die than live like that,  muttered one, his father’s namesake Eddard, and his brother Torrhen said likely the boy was broken inside as well as out, too craven to take his own life.  Broken, Bran thought bitterly as he clutched his knife. Is that what he was now? Bran the Broken?  I don’t want to be broken,  he whispered fiercely to Maester Luwin, who’d been seated to his right.  I want to be a knight.    There are some who call my order the knights of the mind,  Luwin replied.  You are a surpassing clever boy when you work at it, Bran. Have you ever thought that you might wear a maester’s chain? There is no limit to what you might learn.    I want to learn magic,  Bran told him.  The crow promised that I would fly.   Maester Luwin sighed.  I can teach you history, healing, herblore. I can teach you the speech of ravens, and how to build a castle, and the way a sailor steers his ship by the stars. I can teach you to measure the days and mark the seasons, and at the Citadel in Oldtown they can teach you a thousand things more. But, Bran, no man can teach you magic.    The children could,  Bran said.  The children of the forest.  That reminded him of the promise he had made to Osha in the godswood, so he told Luwin what she had said."
}