{
  "id": "f97cf5b175c3c70bfd58ba8e82598ca15bc6bfa1",
  "text": " Ron was still goggling at the girl as though he had never seen one before. Harry started to laugh. The sound seemed to jog Ron back to his senses. \"She's a veela!\"  he said hoarsely to Harry. \"Of course she isn't!\" said Hermione tartly.  \"I don't see anyone else gaping at her like an idiot!\" But she wasn't entirely right about that.  As the girl crossed the Hall, many boys' heads turned, and some of them seemed to have become temporarily speechless, just like Ron. \"I'm telling you, that's not a normal girl!\" said Ron, leaning sideways so he could keep a clear view of her. \"They don't make them like that at Hogwarts!\" \"They make them okay at Hogwarts,\" said Harry without thinking.  Cho happened to be sitting only a few places away from the girl with the silvery hair. \"When you've both put your eyes back in,\" said Hermione briskly, \"you'll be able to see who's just arrived.\" She was pointing up at the staff table. The two remaining empty seats had just been filled. Ludo Bagman was now sitting on Professor Karkaroff's other side, while Mr. Crouch, Percy's boss, was next to Madame Maxime. \"What are they doing here?\" said Harry in surprise. \"They organized the Triwizard Tournament, didn't they?\" said Hermione. \"I suppose they wanted to be here to see it start.\" When the second course arrived they noticed a number of unfamiliar desserts too. Ron examined an odd sort of pale blancmange closely, then moved it carefully a few inches to his right, so that it would be clearly visible from the Ravenclaw table. The girl who looked like a veela appeared to have eaten enough, however, and did not come over to get it. Once the golden plates had been wiped clean, Dumbledore stood up again.  A pleasant sort of tension seemed to fill the Hall now.  Harry felt a slight thrill of excitement, wondering what was coming.  Several seats down from them, Fred and George were leaning forward, staring at Dumbledore with great concentration. \"The moment has come,\" said Dumbledore, smiling around at the sea of upturned faces. \"The Triwizard Tournament is about to start. I would like to say a few words of explanation before we bring in the casket --\"  \"The what?\" Harry muttered. Ron shrugged. \"- just to clarify the procedure that we will be following this year.  But first, let me introduce, for those who do not know them, Mr. Bartemius Crouch, Head of the Department of International Magical Cooperation\" - there was a smattering of polite applause - \"and Mr. Ludo Bagman, Head of the Department of Magical Games and Sports.\" There was a much louder round of applause for Bagman than for Crouch, perhaps because of his fame as a Beater, or simply because he looked so much more likable.  He acknowledged it with a jovial wave of his hand.  Bartemius Crouch did not smile or wave when his name was announced.  Remembering him in his neat suit at the Quidditch World Cup, Harry thought he looked strange in wizard's robes.  His toothbrush mustache and severe parting looked very odd next to Dumbledore's long white hair and beard. \"Mr. Bagman and Mr. Crouch have worked tirelessly over the last few months on the arrangements for the Triwizard Tournament,\" Dumbledore continued, \"and they will be joining myself, Professor Karkaroff, and Madame Maxime on the panel that will judge the champions' efforts.\" At the mention of the word \"champions,\" the attentiveness of the listening students seemed to sharpen.  Perhaps Dumbledore had noticed their sudden stillness, for he smiled as he said, \"The casket, then, if you please, Mr. Filch.\" Filch, who had been lurking unnoticed in a far corner of the Hall, now approached Dumbledore carrying a great wooden chest encrusted with jewels. It looked extremely old. A murmur of excited interest rose from the watching students; Dennis Creevey actually stood on his chair to see it properly, but, being so tiny, his head hardly rose above anyone else's. \"The instructions for the tasks the champions will face this year have already been examined by Mr. Crouch and Mr. Bagman,\" said Dumbledore as Filch placed the chest carefully on the table before him, \"and they have made the necessary arrangements for each challenge.  There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways.. their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.\" At this last word, the Hall was filled with a silence so absolute that nobody seemed to be breathing. \"As you know, three champions compete in the tournament,\" Dumbledore went on calmly, \"one from each of the participating schools.  They will be marked on how well they perform each of the Tournament tasks and the champion with the highest total after task three will win the Triwizard Cup.  The champions will be chosen by an impartial selector:  the Goblet of Fire.\" Dumbledore now took out his wand and tapped three times upon the top of the casket. The lid creaked slowly open.  Dumbledore reached inside it and pulled out a large, roughly hewn wooden cup."
}