{
  "id": "f9d5893e815dd193d56e8e03935cc4b065f0bbe5",
  "text": " \"Well, the/re quite capable of dealing with wizards,\" said Hermione, taking another sip of butterbeer.  \"They're very clever.  They're not like house-elves, who never stick up for themselves.\" \"Uh-oh,\" said Ron, staring at the door. Rita Skeeter had just entered.  She was wearing banana-yellow robes today; her long nails were painted shocking pink, and she was accompanied by her paunchy photographer.  She bought drinks, and she and the photographer made their way through the crowds to a table nearby.  Harry, Ron, and Hermione glaring at her as she approached.  She was talking fast and looking very satisfied about something. \"... didn't seem very keen to talk to us, did he, Bozo?  Now, why would that be, do you think?  And what's he doing with a pack of goblins in tow anyway?  Showing them the sights . .. what nonsense ... he was always a bad liar.  Reckon something's up?  Think we should do a bit of digging?  'Disgraced Ex-Head of Magical Games and Sports, Ludo Bagman . . .' Snappy start to a sentence, Bozo - we just need to find a story to fit it -\" \"Trying to ruin someone else's life?\" said Harry loudly. A few people looked around. Rita Skeeter's eyes widened behind her jeweled spectacles as she saw who had spoken. \"Harry!\" she said, beaming. \"How lovely! Why don't you come and join- ?\" \"I wouldn't come near you with a ten-foot broomstick,\" said Harry furiously.  \"What did you do that to Hagrid for, eh?\" Rita Skeeter raised her heavily penciled eyebrows. \"Our readers have a right to the truth, Harry. I am merely doing my-\" \"Who cares if he's half-giant?\"  Harry shouted.  \"There's nothing wrong with him!\" The whole pub had gone very quiet. Madam Rosmerta was staring over from behind the bar, apparently oblivious to the fact that the flagon she was filling with mead was overflowing. Rita Skeeters smile flickered very slightly, but she hitched it back almost at once; she snapped open her crocodile-skin handbag, pulled out her Quick-Quotes Quill, and said, \"How about giving me an interview about the Hagrid you know. Harry?  The man behind the muscles? Your unlikely friendship and the reasons behind it.  Would you call him a father substitute?\" Hermione stood up very abruptly, her butterbeer clutched in her hand as though it were a grenade. \"You horrible woman,\" she said, through gritted teeth, \"you don't care, do you, anything for a story, and anyone will do, wont they?  Even Ludo Bagman -\" \"Sit down, you silly little girl, and don't talk about things you don't understand,\" said Rita Skeeter coldly, her eyes hardening as they fell on Hermione.  \"I know things about Ludo Bagman that would make your hair curl... not that it needs it -\" she added, eyeing Hermione's bushy hair. \"Let's go,\" said Hermione, \"c'mon. Harry - Ron . ..\" They left; many people were staring at them as they went.  Harry glanced back as they reached the door.  Rita Skeeter's Quick-Quotes Quill was out; it was zooming backward and forward over a piece of parchment on the table. \"She'll be after you next, Hermione,\" said Ron in a low and worried voice as they walked quickly back up the street. \"Let her try!\" said Hermione defiantly; she was shaking with rage. \"I'll show her! Silly little girl, am I?  Oh, I'll get her back for this.  First Harry, then Hagrid ...\" \"You don't want to go upsetting Rita Skeeter,\" said Ron nervously. \"I'm serious, Hermione, she'll dig up something on you -\" \"My parents don't read the Daily Prophet.  She can't scare me into hiding!\"  said Hermione, now striding along so fast that it was all Harry and Ron could do to keep up with her.  The last time Harry had seen Hermione in a rage like this, she had hit Draco Malfoy around the face.  \"And Hagrid isn't hiding anymore!  He should never have let that excuse for a human being upset him!  Come on!\" Breaking into a run, she led them all the way back up the road, through the gates flanked by winged boars, and up through the grounds to Hagrid's cabin. The curtains were still drawn, and they could hear Fang barking as they approached. \"Hagrid!\" Hermione shouted, pounding on his front door.  \"Hagrid, that's enough!  We know you're in there!  Nobody cares if your mum was a giantess, Hagrid!  You can't let that foul Skeeter woman do this to you!  Hagrid, get out here, you're just being -\" The door opened. Hermione said, \"About t-!\" and then stopped, very suddenly, because she had found herself face-to-face, not with Hagrid, but with Albus Dumbledore. \"Good afternoon,\" he said pleasantly, smiling down at them. \"We-er-we wanted to see Hagrid,\" said Hermione in a rather small voice. \"Yes, I surmised as much,\" said Dumbledore, his eyes twinkling.  \"Why don't you come in?\" \"Oh . . . um ... okay,\" said Hermione. She, Ron, and Harry went into the cabin; Fang launched himself upon Harry the moment he entered, barking madly and trying to lick his ears.  Harry fended off Fang and looked around. Hagrid was sitting at his table, where there were two large mugs of tea.  He looked a real mess."
}