{
  "id": "fa21d80bf103fd76b2bcdd2ab048ae7523598e1c",
  "text": " Now we scratch in the ground and toss lines in the sea like other men, and count ourselves lucky if we have salt cod and porridge enough to get us through a winter.  He took her nipple in his mouth, and bit it until she gasped.   You can put it in me again, if it please you,  she whispered in his ear as he sucked.  When he raised his head from her breast, the skin was dark red where his mouth had marked her.  It would please me to teach you something new. Unlace me and pleasure me with your mouth.    With my mouth?   His thumb brushed lightly over her full lips.  It’s what those lips were made for, sweetling. If you were my salt wife, you’d do as I command.   She was timid at first, but learned quickly for such a stupid girl, which pleased him. Her mouth was as wet and sweet as her cunt, and this way he did not have to listen to her mindless prattle. Once I would have kept her as a salt wife in truth, he thought to himself as he slid his fingers through her tangled hair. Once. When we still kept the Old Way, lived by the axe instead of the pick, taking what we would, be it wealth, women, or glory. In those days, the ironborn did not work mines; that was labor for the captives brought back from the hostings, and so too the sorry business of farming and tending goats and sheep. War was an ironman’s proper trade. The Drowned God had made them to reave and rape, to carve out kingdoms and write their names in fire and blood and song.  Aegon the Dragon had destroyed the Old Way when he burned Black Harren, gave Harren’s kingdom back to the weakling rivermen, and reduced the Iron Islands to an insignificant backwater of a much greater realm. Yet the old red tales were still told around driftwood fires and smoky hearths all across the islands, even behind the high stone halls of Pyke. Theon’s father numbered among his titles the style of Lord Reaper, and the Greyjoy words boasted that We Do Not Sow.  It had been to bring back the Old Way more than for the empty vanity of a crown that Lord Balon had staged his great rebellion. Robert Baratheon had written a bloody end to that hope, with the help of his friend Eddard Stark, but both men were dead now. Mere boys ruled in their stead, and the realm that Aegon the Conqueror had forged was smashed and sundered. This is the season, Theon thought as the captain’s daughter slid her lips up and down the length of him, the season, the year, the day, and I am the man. He smiled crookedly, wondering what his father would say when Theon told him that he, the last-born, babe and hostage, he had succeeded where Lord Balon himself had failed.  His climax came on him sudden as a storm, and he filled the girl’s mouth with his seed. Startled, she tried to pull away, but Theon held her tight by the hair. Afterward, she crawled up beside him.  Did I please milord?    Well enough,  he told her.   It tasted salty,  she murmured.   Like the sea?   She nodded.  I have always loved the sea, milord.    As I have,  he said, rolling her nipple idly between his fingers. It was true. The sea meant freedom to the men of the Iron Islands. He had forgotten that until the Myraham had raised sail at Seagard. The sounds brought old feelings back; the creak of wood and rope, the captain’s shouted commands, the snap of the sails as the wind filled them, each as familiar as the beating of his own heart, and as comforting. I must remember this, Theon vowed to himself. I must never go far from the sea again.   Take me with you, milord,  the captain’s daughter begged.  I don’t need to go to your castle. I can stay in some town, and be your salt wife.  She reached out to stroke his cheek.  Theon Greyjoy pushed her hand aside and climbed off the bunk.  My place is Pyke, and yours is on this ship.    I can’t stay here now.   He laced up his breeches.  Why not?    My father,  she told him.  Once you’re gone, he’ll punish me, milord. He’ll call me names and hit me.   Theon swept his cloak off its peg and over his shoulders.  Fathers are like that,  he admitted as he pinned the folds with a silver clasp.  Tell him he should be pleased. As many times as I’ve fucked you, you’re likely with child. It’s not every man who has the honor of raising a king’s bastard.  She looked at him stupidly, so he left her there.  The Myraham was rounding a wooded point. Below the pine-clad bluffs, a dozen fishing boats were pulling in their nets. The big cog stayed well out from them, tacking. Theon moved to the bow for a better view. He saw the castle first, the stronghold of the Botleys. When he was a boy it had been timber and wattle, but Robert Baratheon had razed that structure to the ground. Lord Sawane had rebuilt in stone, for now a small square keep crowned the hill. Pale green flags drooped from the squat corner towers, each emblazoned with a shoal of silvery fish.  Beneath the dubious protection of the fish-ridden little castle lay the village of Lordsport, its harbor aswarm with ships. When last he’d seen Lordsport, it had been a smoking wasteland, the skeletons of burnt longships and smashed galleys littering the stony shore like the bones of dead leviathans, the houses no more than broken walls and cold ashes."
}