{
  "id": "fa3737fbad9a756a0b06706c749c000016cd4634",
  "text": " Long silken plumes flew from their helms, and rainbow cloaks draped their shoulders.  Within, Catelyn found Brienne armoring the king for battle while the Lords Tarly and Rowan spoke of dispositions and tactics. It was pleasantly warm inside, the heat shimmering off the coals in a dozen small iron braziers.  I must speak with you, Your Grace,  she said, granting him a king’s style for once, anything to make him heed her.   In a moment, Lady Catelyn,  Renly replied. Brienne fit backplate to breastplate over his quilted tunic. The king’s armor was a deep green, the green of leaves in a summer wood, so dark it drank the candlelight. Gold highlights gleamed from inlay and fastenings like distant fires in that wood, winking every time he moved.  Pray continue, Lord Mathis.    Your Grace,  Mathis Rowan said with a sideways glance at Catelyn.  As I was saying, our battles are well drawn up. Why wait for daybreak? Sound the advance.    And have it said that I won by treachery, with an unchivalrous attack? Dawn was the chosen hour.    Chosen by Stannis,  Randyll Tarly pointed out.  He’d have us charge into the teeth of the rising sun. We’ll be half-blind.    Only until first shock,  Renly said confidently.  Ser Loras will break them, and after that it will be chaos.  Brienne tightened green leather straps and buckled golden buckles.  When my brother falls, see that no insult is done to his corpse. He is my own blood, I will not have his head paraded about on a spear.    And if he yields?  Lord Tarly asked.   Yields?  Lord Rowan laughed.  When Mace Tyrell laid siege to Storm’s End, Stannis ate rats rather than open his gates.    Well I remember.  Renly lifted his chin to allow Brienne to fasten his gorget in place.  Near the end, Ser Gawen Wylde and three of his knights tried to steal out a postern gate to surrender. Stannis caught them and ordered them flung from the walls with catapults. I can still see Gawen’s face as they strapped him down. He had been our master-at-arms.   Lord Rowan appeared puzzled.  No men were hurled from the walls. I would surely remember that.    Maester Cressen told Stannis that we might be forced to eat our dead, and there was no gain in flinging away good meat.  Renly pushed back his hair. Brienne bound it with a velvet tie and pulled a padded cap down over his ears, to cushion the weight of his helm.  Thanks to the Onion Knight we were never reduced to dining on corpses, but it was a close thing. Too close for Ser Gawen, who died in his cell.    Your Grace.  Catelyn had waited patiently, but time grew short.  You promised me a word.   Renly nodded.  See to your battles, my lords… oh, and if Barristan Selmy is at my brother’s side, I want him spared.    There’s been no word of Ser Barristan since Joffrey cast him out,  Lord Rowan objected.   I know that old man. He needs a king to guard, or who is he? Yet he never came to me, and Lady Catelyn says he is not with Robb Stark at Riverrun. Where else but with Stannis?    As you say, Your Grace. No harm will come to him.  The lords bowed deeply and departed.   Say your say, Lady Stark,  Renly said. Brienne swept his cloak over his broad shoulders. It was cloth-of-gold, heavy, with the crowned stag of Baratheon picked out in flakes of jet.   The Lannisters tried to kill my son Bran. A thousand times I have asked myself why. Your brother gave me my answer. There was a hunt the day he fell. Robert and Ned and most of the other men rode out after boar, but Jaime Lannister remained at Winterfell, as did the queen.   Renly was not slow to take the implication.  So you believe the boy caught them at their incest…    I beg you, my lord, grant me leave to go to your brother Stannis and tell him what I suspect.    To what end?    Robb will set aside his crown if you and your brother will do the same,  she said, hoping it was true. She would make it true if she must; Robb would listen to her, even if his lords would not.  Let the three of you call for a Great Council, such as the realm has not seen for a hundred years. We will send to Winterfell, so Bran may tell his tale and all men may know the Lannisters for the true usurpers. Let the assembled lords of the Seven Kingdoms choose who shall rule them.   Renly laughed.  Tell me, my lady, do direwolves vote on who should lead the pack?  Brienne brought the king’s gauntlets and greathelm, crowned with golden antlers that would add a foot and a half to his height.  The time for talk is done. Now we see who is stronger.  Renly pulled a lobstered green-and-gold gauntlet over his left hand, while Brienne knelt to buckle on his belt, heavy with the weight of longsword and dagger.   I beg you in the name of the Mother,  Catelyn began when a sudden gust of wind flung open the door of the tent. She thought she glimpsed movement, but when she turned her head, it was only the king’s shadow shifting against the silken walls. She heard Renly begin a jest, his shadow moving, lifting its sword, black on green, candles guttering, shivering, something was queer, wrong, and then she saw Renly’s sword still in its scabbard, sheathed still, but the shadowsword…   Cold,  said Renly in a small puzzled voice, a heartbeat before the steel of his gorget parted like cheesecloth beneath the shadow of a blade that was not there."
}