{
  "id": "fa3f993f5857196e29f14cddf88744e523ee754d",
  "text": " Fudge took off his pinstriped cloak and tossed it aside, then hitched up the trousers of his bottle-green suit and sat down opposite Harry.  \"I am Cornelius Fudge, Harry. The Minister of Magic.\"  Harry already knew this, of course; he had seen Fudge once before, but as he had been wearing his father's Invisibility Cloak at the time, Fudge wasn't to know that.  Tom the innkeeper reappeared, wearing an apron over his nightshirt and bearing a tray of tea and crumpets. He placed the tray on a table between Fudge and Harry and left the parlor, closing the door behind him.  \"Well, Harry,\" said Fudge, pouring out tea, \"you've had us all in a right flap, I don't mind telling you. Running away from your aunt and uncle's house like that! I'd started to think... but you're safe, and that's what matters.\"  Fudge buttered himself a crumpet and pushed the plate toward Harry.  \"Eat, Harry, you look dead on your feet. Now then... You will be pleased to hear that we have dealt with the unfortunate blowing-up of Miss Marjorie Dursley. Two members of the Accidental Magic Reversal Department were dispatched to Privet Drive a few hours ago. Miss Dursley has been punctured and her memory has been modified. She has no recollection of the incident at all. So that's that, and no harm done.\"  Fudge smiled at Harry over the rim of his teacup, rather like an uncle surveying a favorite nephew. Harry, who couldn't believe his ears, opened his mouth to speak, couldn't think of anything to say, and closed it again.  \"Ah, you're worrying about the reaction of your aunt and uncle?\" said Fudge. \"Well, I won't deny that they are extremely angry, Harry, but they are prepared to take you back next summer as long as you stay at Hogwarts for the Christmas and Easter holidays.\"  Harry unstuck his throat.  \"I always stay at Hogwarts for the Christmas and Easter holidays,\" he said, \"and I don't ever want to go back to Privet Drive.\"  \"Now, now, I'm sure you'll feel differently once you've calmed down,\" said Fudge in a worried tone. \"They are your family, after all, and I'm sure you are fond of each other -- er -- very deep down.\"  It didn't occur to Harry to put Fudge right. He was still waiting to hear what was going to happen to him now.  \"So all that remains,\" said Fudge, now buttering himself a second crumpet, \"is to decide where you're going to spend the last two weeks of your vacation. I suggest you take a room here at the Leaky Cauldron and  \"Hang on,\" blurted Harry. \"What about my punishment?\"  Fudge blinked. \"Punishment?\"  \"I broke the law!\" Harry said. \"The Decree for the Restriction of Underage Wizardry!\"  \"Oh, my dear boy, we're not going to punish you for a little thing like that!\" cried Fudge, waving his crumpet impatiently. \"It was an accident! We don't send people to Azkaban just for blowing up their aunts!\"  But this didn't tally at all with Harry's past dealings with the Ministry of Magic.  \"Last year, I got an official warning just because a house-elf smashed a pudding in my uncle's house!\" he told Fudge, frowning. \"The Ministry of Magic said I'd be expelled from Hogwarts if there was any more magic there!\"  Unless Harry's eyes were deceiving him, Fudge was suddenly looking awkward.  \"Circumstances change, Harry... We have to take into account... in the present climate... Surely you don't want to be expelled?\"  \"Of course I don't,\" said Harry.  \"Well then, what's A the fuss about?\" laughed Fudge. \"Now, have a crumpet, Harry, while I go and see if Tom's got a room for you.\"  Fudge strode out of the parlor and Harry stared after him. There was something extremely odd going on. Why had Fudge been waiting for him at the Leaky Cauldron, if not to punish him for what he'd done? And now Harry came to think of it, surely it wasn't usual for the Minister of Magic himself to get involved in matters of underage magic?  Fudge came back, accompanied by Tom the innkeeper.  \"Room eleven's free, Harry,\" said Fudge. \"I think you'll be very comfortable. just one thing, and I'm sure you'll understand... I don't want you wandering off into Muggle London, all right? Keep to Diagon Alley. And you're to be back here before dark each night. Sure you'll understand. Tom will be keeping an eye on you for me.\"  \"Okay,\" said Harry slowly, \"but why?\"  \"Don't want to lose you again, do we?\" said Fudge with a hearty laugh. \"No, no... best we know where you are.... I mean...\"  Fudge cleared his throat loudly and picked up his pinstriped cloak.  \"Well, I'll be off, plenty to do, you know...  \"Have you had any luck with Black yet?\" Harry asked.  Fudge's finger slipped on the silver fastenings of his cloak.  \"What's that? Oh, you've heard -- well, no, not yet, but it's only a matter of time. The Azkaban guards have never yet failed... and they are angrier than I've ever seen them.\"  Fudge shuddered slightly.  \"So, I'll say good-bye.\"  He held out his hand and Harry, shaking it, had a sudden idea.  \"Er -- Minister? Can I ask you something?\"  \"Certainly,\" said Fudge with a smile."
}