{
  "id": "fa40ca1ac1df2eee9b69a81848a6a55a8462d877",
  "text": "  As it happens, I am a widower these past eight years. Past time I took another wife, don’t you agree, my lords? A man does get lonely.  Tossing the bones aside, he reached for a leg.  Or if the lady fancies a younger lad, well, my son Wendel is unwed as well. He is off south guarding Lady Catelyn, but no doubt he will wish to take a bride on his return. A valiant boy, and jolly. just the man to teach her to laugh again, eh?  He wiped a bit of grease off his chin with the sleeve of his tunic.  Bran could hear the distant clash of arms through the windows. He cared nothing about marriages. I wish I was down in the yard.  His lordship waited until the table had been cleared before he raised the matter of a letter he had received from Lord Tywin Lannister, who held his elder son, Ser Wylis, taken captive on the Green Fork.  He offers him back to me without ransom, provided I withdraw my levies from His Grace and vow to fight no more.    You will refuse him, of course,  said Ser Rodrik.   Have no fear on that count,  the lord assured them.  King Robb has no more loyal servant than Wyman Manderly. I would be loath to see my son languish at Harrenhal any longer than he must, however. That is an ill place. Cursed, they say. Not that I am the sort to swallow such tales, but still, there it is. Look at what’s befallen this Janos Slynt. Raised up to Lord of Harrenhal by the queen, and cast down by her brother. Shipped off to the Wall, they say. I pray some equitable exchange of captives can be arranged before too very long. I know Wylis would not want to sit out the rest of the war. Gallant, that son of mine, and fierce as a mastiff.   Bran’s shoulders were stiff from sitting in the same chair by the time the audience drew to a close. And that night, as he sat to supper, a horn sounded to herald the arrival of another guest. Lady Donella Hornwood brought no tail of knights and retainers; only herself, and six tired men-at-arms with a moosehead badge on their dusty orange livery.  We are very sorry for all you have suffered, my lady,  Bran said when she came before him to speak her words of greetings. Lord Hornwood had been killed in the battle on the Green Fork, their only son cut down in the Whispering Wood.  Winterfell will remember.    That is good to know.  She was a pale husk of a woman, every line of her face etched with grief.  I am very weary, my lord. If I might have leave to rest, I should be thankful.    To be sure,  Ser Rodrik said.  There is time enough for talk on the morrow.   When the morrow came, most of the morning was given over to talk of grains and greens and salting meat. Once the maesters in their Citadel had proclaimed the first of autumn, wise men put away a portion of each harvest… though how large a portion was a matter that seemed to require much talk. Lady Hornwood was storing a fifth of her harvest. At Maester Luwin’s suggestion, she vowed to increase that to a quarter.   Bolton’s bastard is massing men at the Dreadfort,  she warned them.  I hope he means to take them south to join his father at the Twins, but when I sent to ask his intent, he told me that no Bolton would be questioned by a woman. As if he were trueborn and had a right to that name.    Lord Bolton has never acknowledged the boy, so far as I know,  Ser Rodrik said.  I confess, I do not know him.    Few do,  she replied.  He lived with his mother until two years past, when young Domeric died and left Bolton without an heir. That was when he brought his bastard to the Dreadfort. The boy is a sly creature by all accounts, and he has a servant who is almost as cruel as he is. Reek, they call the man. It’s said he never bathes. They hunt together, the Bastard and this Reek, and not for deer. I’ve heard tales, things I can scarce believe, even of a Bolton. And now that my lord husband and my sweet son have gone to the gods, the Bastard looks at my lands hungrily.   Bran wanted to give the lady a hundred men to defend her rights, but Ser Rodrik only said,  He may look, but should he do more I promise you there will be dire retribution. You will be safe enough, my lady… though perhaps in time, when your grief is passed, you may find it prudent to wed again.    I am past my childbearing years, what beauty I had long fled,  she replied with a tired half smile,  yet men come sniffing after me as they never did when I was a maid.    You do not look favorably on these suitors?  asked Luwin.   I shall wed again if His Grace commands it,  Lady Hornwood replied,  but Mors Crowfood is a drunken brute, and older than my father. As for my noble cousin of Manderly, my lord’s bed is not large enough to hold one of his majesty, and I am surely too small and frail to lie beneath him.   Bran knew that men slept on top of women when they shared a bed. Sleeping under Lord Manderly would be like sleeping under a fallen horse, he imagined. Ser Rodrik gave the widow a sympathetic nod.  You will have other suitors, my lady. We shall try and find you a prospect more to your taste."
}