{
  "id": "fab22221f23a947abdf62bd38ac5e752200491ba",
  "text": "  No, Catelyn wanted to tell him, it’s only now beginning.   Yes,  Lysa said glumly, her voice as cold and dead as the captain of her guard.   Can I make the little man fly now?   Across the garden, Tyrion Lannister got to his feet.  Not this little man,  he said.  This little man is going down in the turnip hoist, thank you very much.    You presume—  Lysa began.   I presume that House Arryn remembers its own words,  the Imp said.  As High as Honor.    You promised I could make him fly,  the Lord of the Eyrie screamed at his mother. He began to shake.  Lady Lysa’s face was flushed with fury.  The gods have seen fit to proclaim him innocent, child. We have no choice but to free him.  She lifted her voice.  Guards. Take my lord of Lannister and his… creature here out of my sight. Escort them to the Bloody Gate and set them free. See that they have horses and supplies sufficient to reach the Trident, and make certain all their goods and weapons are returned to them. They shall need them on the high road.    The high road,  Tyrion Lannister said. Lysa allowed herself a faint, satisfied smile. It was another sort of death sentence, Catelyn realized. Tyrion Lannister must know that as well. Yet the dwarf favored Lady Arryn with a mocking bow.  As you command, my lady,  he said.  I believe we know the way.       JON   You are as hopeless as any boys I have ever trained,  Ser Alliser Thorne announced when they had all assembled in the yard.  Your hands were made for manure shovels, not for swords, and if it were up to me, the lot of you would be set to herding swine. But last night I was told that Gueren is marching five new boys up the kingsroad. One or two may even be worth the price of piss. To make room for them, I have decided to pass eight of you on to the Lord Commander to do with as he will.  He called out the names one by one.  Toad. Stone Head. Aurochs. Lover. Pimple. Monkey. Ser Loon.  Last, he looked at Jon.  And the Bastard.   Pyp let fly a whoop and thrust his sword into the air. Ser Alliser fixed him with a reptile stare.  They will call you men of Night’s Watch now, but you are bigger fools than the Mummer’s Monkey here if you believe that. You are boys still, green and stinking of summer, and when the winter comes you will die like flies.  And with that, Ser Alliser Thorne took his leave of them.  The other boys gathered round the eight who had been named, laughing and cursing and offering congratulations. Halder smacked Toad on the butt with the flat of his sword and shouted,  Toad, of the Night’s Watch!  Yelling that a black brother needed a horse, Pyp leapt onto Grenn’s shoulders, and they tumbled to the ground, rolling and punching and hooting. Dareon dashed inside the armory and returned with a skin of sour red. As they passed the wine from hand to hand, grinning like fools, Jon noticed Samwell Tarly standing by himself beneath a bare dead tree in the corner of the yard. Jon offered him the skin.  A swallow of wine?   Sam shook his head.  No thank you, Jon.    Are you well?    Very well, truly,  the fat boy lied.  I am so happy for you all.  His round face quivered as he forced a smile.  You will be First Ranger someday, just as your uncle was.    Is,  Jon corrected. He would not accept that Benjen Stark was dead. Before he could say more, Haider cried,  Here, you planning to drink that all yourself?  Pyp snatched the skin from his hand and danced away, laughing. While Grenn seized his arm, Pyp gave the skin a squeeze, and a thin stream of red squirted Jon in the face. Haider howled in protest at the waste of good wine. Jon sputtered and struggled. Matthar and Jeren climbed the wall and began pelting them all with snowballs.  By the time he wrenched free, with snow in his hair and wine stains on his surcoat, Samwell Tarly had gone.  That night, Three-Finger Hobb cooked the boys a special meal to mark the occasion. When Jon arrived at the common hall, the Lord Steward himself led him to the bench near the fire. The older men clapped him on the arm in passing. The eight soon-to-be brothers feasted on rack of lamb baked in a crust of garlic and herbs, garnished with sprigs of mint, and surrounded by mashed yellow turnips swimming in butter.  From the Lord Commander’s own table,  Bowen Marsh told them. There were salads of spinach and chickpeas and turnip greens, and afterward bowls of iced blueberries and sweet cream.   Do you think they’ll keep us together?  Pyp wondered as they gorged themselves happily.  Toad made a face.  I hope not. I’m sick of looking at those ears of yours.    Ho,  said Pyp.  Listen to the crow call the raven black. You’re certain to be a ranger, Toad. They’ll want you as far from the castle as they can. If Mance Rayder attacks, lift your visor and show your face, and he’ll run off screaming.   Everyone laughed but Grenn.  I hope I’m a ranger.    You and everyone else,  said Matthar. Every man who wore the black walked the Wall, and every man was expected to take up steel in its defense, but the rangers were the true fighting heart of the Night’s Watch."
}