{
  "id": "fad250f790c36b38bec7937b8d879f9c2ba39a62",
  "text": " If you refuse to serve him, he will wonder why, and sooner or later he will begin to suspect that you oppose him. Can’t you see the danger that would put us in?   Ned shook his head, refusing to believe.  Robert would never harm me or any of mine. We were closer than brothers. He loves me. If I refuse him, he will roar and curse and bluster, and in a week we will laugh about it together. I know the man!    You knew the man,  she said.  The king is a stranger to you.  Catelyn remembered the direwolf dead in the snow, the broken antler lodged deep in her throat. She had to make him see.  Pride is everything to a king, my lord. Robert came all this way to see you, to bring you these great honors, you cannot throw them back in his face.    Honors?  Ned laughed bitterly.   In his eyes, yes,  she said.   And in yours?    And in mine,  she blazed, angry now. Why couldn’t he see?  He offers his own son in marriage to our daughter, what else would you call that? Sansa might someday be queen. Her sons could rule from the Wall to the mountains of Dorne. What is so wrong with that?    Gods, Catelyn, Sansa is only eleven,  Ned said.  And Joffrey… Joffrey is…   She finished for him.  …crown prince, and heir to the Iron Throne. And I was only twelve when my father promised me to your brother Brandon.   That brought a bitter twist to Ned’s mouth.  Brandon. Yes. Brandon would know what to do. He always did. It was all meant for Brandon. You, Winterfell, everything. He was born to be a King’s Hand and a father to queens. I never asked for this cup to pass to me.    Perhaps not,  Catelyn said,  but Brandon is dead, and the cup has passed, and you must drink from it, like it or not.   Ned turned away from her, back to the night. He stood staring out in the darkness, watching the moon and the stars perhaps, or perhaps the sentries on the wall.  Catelyn softened then, to see his pain. Eddard Stark had married her in Brandon’s place, as custom decreed, but the shadow of his dead brother still lay between them, as did the other, the shadow of the woman he would not name, the woman who had borne him his bastard son.  She was about to go to him when the knock came at the door, loud and unexpected. Ned turned, frowning.  What is it?   Desmond’s voice came through the door.  My lord, Maester Luwin is without and begs urgent audience.    You told him I had left orders not to be disturbed?    Yes, my lord. He insists.    Very well. Send him in.   Ned crossed to the wardrobe and slipped on a heavy robe. Catelyn realized suddenly how cold it had become. She sat up in bed and pulled the furs to her chin.  Perhaps we should close the windows,  she suggested.  Ned nodded absently. Maester Luwin was shown in.  The maester was a small grey man. His eyes were grey, and quick, and saw much. His hair was grey, what little the years had left him. His robe was grey wool, trimmed with white fur, the Stark colors. Its great floppy sleeves had pockets hidden inside. Luwin was always tucking things into those sleeves and producing other things from them: books, messages, strange artifacts, toys for the children. With all he kept hidden in his sleeves, Catelyn was surprised that Maester Luwin could lift his arms at all.  The maester waited until the door had closed behind him before he spoke.  My lord,  he said to Ned,  pardon for disturbing your rest. I have been left a message.   Ned looked irritated.  Been left? By whom? Has there been a rider? I was not told.    There was no rider, my lord. Only a carved wooden box, left on a table in my observatory while I napped. My servants saw no one, but it must have been brought by someone in the king’s party. We have had no other visitors from the south.    A wooden box, you say?  Catelyn said.   Inside was a fine new lens for the observatory, from Myr by the look of it. The lenscrafters of Myr are without equal.   Ned frowned. He had little patience for this sort of thing, Catelyn knew.  A lens,  he said.  What has that to do with me?    I asked the same question,  Maester Luwin said.  Clearly there was more to this than the seeming.   Under the heavy weight of her furs, Catelyn shivered.  A lens is an instrument to help us see.    Indeed it is.  He fingered the collar of his order; a heavy chain worn tight around the neck beneath his robe, each link forged from a different metal.  Catelyn could feel dread stirring inside her once again.  What is it that they would have us see more clearly?    The very thing I asked myself.  Maester Luwin drew a tightly rolled paper out of his sleeve.  I found the true message concealed within a false bottom when I dismantled the box the lens had come in, but it is not for my eyes.   Ned held out his hand.  Let me have it, then.   Luwin did not stir.  Pardons, my lord. The message is not for you either. It is marked for the eyes of the Lady Catelyn, and her alone. May I approach?   Catelyn nodded, not trusting to speak. The maester placed the paper on the table beside the bed."
}