{
  "id": "fafda259a077fb35190e7c5d2ab4f9c59494da83",
  "text": " It's a long time, Mr. Frodo, since I had a proper sleep, and my  eyes just closed down on their own.'       Frodo now led the way, northward as near as he could  guess,  among the  stones  and boulders lying thick at  the bottom of  the  great  ravine.  But  presently he stopped again.       'It's no good, Sam,' he said. 'I  can't  manage  it. This mail-shirt, I  mean. Not in my present state. Even my mithril-coat seemed heavy when I  was  tired. This is far heavier. And what's the use of it? We shan't win  through  by fighting.'       'But we may  have some to do,' said  Sam. 'And there's knives and stray  arrows. That  Gollum isn't dead, for one thing. I don't like to think of you   with naught but a bit of leather between you and a stab in the dark.'       'Look here, Sam dear lad,' said Frodo: 'I am tired, weary,  I haven't a   hope left.  But I have to go on trying to get  to the Mountain, as long as I  can move. The  Ring is enough. This extra  weight is killing me. It must go.  But don't think  I'm ungrateful. I hate  to think of the foul work  you must   have had among the bodies to find it for me.'       'Don't talk about it, Mr. Frodo. Bless you! I'd  carry you  on my back,  if I could. Let it go then!'       Frodo laid aside his cloak and took off the orc-mail and flung it away.  He shivered a little. 'What I really need is something warm,' he said. 'It's  gone cold, or else I've caught a chill.'       'You can have my cloak,  Mr. Frodo,' said Sam. He unslung his  pack and   took out the elven-cloak. 'How's  this, Mr.  Frodo?' he said. 'You wrap that  orc-rag close round you, and  put the belt outside it. Then this can go over  all.  It  don't  look quite orc-fashion, but it'll  keep you  warmer; and  I  daresay it'll  keep you from harm better than any other gear. It was made by  the Lady.'       Frodo took the cloak and fastened the brooch. 'That's better!' he said.  'I feel much lighter. I  can go  on now.  But this  blind dark  seems to  be   ####-getting into my  heart.  As I lay in  prison,  Sam. I tried to  remember the  Brandywine, and  Woody  End,  and  The  Water  running  through  the mill at  Hobbiton. But I can't see them now.'       'There  now, Mr.  Frodo, it's you  that's  talking of water this time!'  said Sam. 'If only the  Lady could see us or hear us, I'd say to  her: (Your  Ladyship,  all  we  want is  light  and  water:  just clean water and  plain  daylight, better than any jewels,  begging your pardon.( But it's a long way  to Lurien.' Sam sighed and waved his  hand towards the heights of the  Ephel  D®ath, now only to be guessed as a deeper blackness against the black sky.         They  started  off again. They  had not gone  far  when  Frodo  paused.   'There's a Black Rider over us,' he said. 'I can feel it. We had better keep  still for a while.'       Crouched under  a great  boulder they sat facing back  westward and did  not speak  for some  time. Then  Frodo  breathed  a  sigh of  relief.  'It's  passed,' he said.  They  stood up, and then they both stared in wonder. Away  to their left, southward, against a sky that was turning grey, the peaks and  high  ridges  of  the great range began  to appear  dark and black,  visible  shapes. Light  was growing behind them.  Slowly it crept towards the  North.  There  was battle far above  in  the high spaces of the  air. The  billowing  clouds of Mordor were being driven back, their edges tattering as a wind out  of  the living world came up and swept the fumes and smokes towards the dark  land of their home. Under  the lifting skirts of the dreary canopy dim light  leaked into Mordor like pale morning through the grimed window of a prison.       'Look at it, Mr. Frodo!'  said  Sam. 'Look  at it!  The wind's changed.  Something's happening. He's not having it all  his own way.  His darkness is  breaking up out in the world there. I wish I could see what is going on!'       It was  the morning  of the fifteenth of  March,  and over the  Vale of  Anduin the Sun was rising  above the eastern shadow, and the south-west wind  was blowing. Thjoden lay dying on the Pelennor Fields.        As Frodo and Sam stood and gazed, the rim of light spread all along the  line  of the Ephel D®ath, and then they saw a shape, moving at a great speed  out of  the West, at first only a  black speck against  the glimmering strip  above the mountain-tops, but  growing, until it plunged like a bolt into the  dark canopy and passed high above them. As it went it sent out a long shrill   cry, the voice of a Nazgyl; but this cry no longer held any terror for them:  it was a cry of woe and dismay, ill tidings for the Dark Tower. The Lord  of   ####-the Ring-wraiths had met his doom.       'What did I tell you? Something's happening!'  cried Sam. '  (The  war's  going well,(  said Shagrat; but Gorbag he  wasn't so sure. And  he was right  there too. Things are looking up, Mr. Frodo. Haven't you got some hope now?'       'Well  no,  not much,  Sam,'  Frodo  sighed."
}