{
  "id": "fb6080fa24d81c33b409f2780c78e27056404a79",
  "text": "  \"Stop! Stop!\" screamed Lockhart, but Snape took charge.  \"Finite Incantatem!\" he shouted; Harry's feet stopped dancing, Malfoy stopped laughing, and they were able to look up.  A haze of greenish smoke was hovering over the scene. Both Neville and Justin were lying on the floor, panting; Ron was holding up an ashen-faced Seamus, apologizing for whatever his broken wand had done; but Hermione and Millicent Bulstrode were still moving; Millicent had Hermione in a headlock and Hermione was whimpering in pain; both their wands lay forgotten on the floor. Harry leapt forward and pulled Millicent off. It was difficult: She was a lot bigger than he was.  \"Dear, dear,\" said Lockhart, skittering through the crowd, looking at the aftermath of the duels. \"Up you go, Macmillan ....  *192*  Careful there, Miss Fawcett .... Pinch it hard, it'll stop bleeding in a second, Boot  \"I think Id better teach you how to block unfriendly spells,\" said Lockhart, standing flustered in the midst of the hall. He glanced at Snape, whose black eyes glinted, and looked quickly away. \"Let's have a volunteer pair - Longbottom and Finch-Fletchley, how about you -\"  \"A bad idea, Professor Lockhart,\" said Snape, gliding over like a large and malevolent bat. \"Longbottom causes devastation with the simplest spells. We'll be sending what's left of Finch-Fletchley up to the hospital wing in a matchbox.\" Neville's round, pink face went pinker. \"How about Malfoy and Potter?\" said Snape with a twisted smile.  \"Excellent idea!\" said Lockhart, gesturing Harry and Malfoy into the middle of the hall as the crowd backed away to give them room.  \"Now, Harry,\" said Lockhart. \"When Draco points his wand at you, you do this.\"  He raised his own wand, attempted a complicated sort of wiggling action, and dropped it. Snape smirked as Lockhart quickly picked it up, saying, \"Whoops -my wand is a little overexcited -\"  Snape moved closer to Malfoy, bent down, and whispered something in his ear. Malfoy smirked, too. Harry looked up nervously at Lockhart and said, \"Professor, could you show me that blocking thing again?\"  \"Scared?\" muttered Malfoy, so that Lockhart couldn't hear him.  \"You wish,\" said Harry out of the corner of his mouth.  Lockhart cuffed Harry merrily on the shoulder. \"Just do what I did, Harry!\"  \"What, drop my wand?\"  But Lockhart wasn't listening.  \"Three - two - one - go!\" he shouted.  Malfoy raised his wand quickly and bellowed, \"Serpensortia!\"  The end of his wand exploded. Harry watched, aghast, as a long black snake shot out of it, fell heavily onto the floor between them, and raised itself, ready to strike. There were screams as the crowd backed swiftly away, clearing the floor.  \"Don't move, Potter,\" said Snape lazily, clearly enjoying the sight of Harry standing motionless, eye to eye with the angry snake. \"I'll get rid of it ......  \"Allow me!\" shouted Lockhart. He brandished his wand at the snake and there was a loud bang; the snake, instead of vanishing, flew ten feet into the air and fell back to the floor with a loud smack. Enraged, hissing furiously, it slithered straight toward Justin Finch-Fletchley and raised itself again, fangs exposed, poised to strike.  Harry wasn't sure what made him do it. He wasn't even aware of deciding to do it. All he knew was that his legs were carrying him forward as though he was on casters and that he had shouted stupidly at the snake, \"Leave him alone!\" And miraculously - inexplicably - the snake slumped to the floor, docile as a thick, black garden hose, its eyes now on Harry. Harry felt the fear drain out of him. He knew the snake wouldn't attack anyone now, though how he knew it, he couldn't have explained.  He looked up at Justin, grinning, expecting to see Justin looking  *194*  relieved, or puzzled, or even grateful - but certainly not angry and scared.  \"What do you think you're playing at?\" he shouted, and before Harry could say anything, Justin had turned and stormed out of the hall.  Snape stepped forward, waved his wand, and the snake vanished in a small puff of black smoke. Snape, too, was looking at Harry in an unexpected way: It was a shrewd and calculating look, and Harry didn't like it. He was also dimly aware of an ominous muttering all around the walls. Then he felt a tugging on the back of his robes.  \"Come on,\" said Rods voice in his ear. \"Move - come on -\"  Ron steered him out of the hall, Hermione hurrying alongside them. As they went through the doors, the people on either side drew away as though they were frightened of catching something. Harry didn't have a clue what was going on, and neither Ron nor Hermione explained anything until they had dragged him all the way up to the empty Gryffindor common room. Then Ron pushed Harry into an armchair and said, \"You're a Parselmouth. Why didn't you tell us?\"  \"I'm a what?\" said Harry.  `A Parselmouth!\" said Ron. \"You can talk to snakes!\"  \"I know,\" said Harry. \"I mean, that's only the second time I've ever done it. I accidentally set a boa constrictor on my cousin Dudley at the zoo once - long story - but it was telling me it had never seen Brazil and I sort of set it free without meaning to that was before I knew I was a wizard -\"  \"A boa constrictor told you it had never seen Brazil?\" Ron repeated faintly."
}