{
  "id": "fb858070b781955240b297c7d1cf3cc1d9f22807",
  "text": " No doubt he would be more comfortable in the rear, guarding our baggage train.    Do me no kindnesses, Father,  he said angrily.  If you have no other command to offer me, I’ll lead your van.   Lord Tywin studied his dwarf son.  I said nothing about command. You will serve under Ser Gregor.   Tyrion took one bite of pork, chewed a moment, and spit it out angrily.  I find I am not hungry after all,  he said, climbing awkwardly off the bench.  Pray excuse me, my lords.   Lord Tywin inclined his head, dismissing him. Tyrion turned and walked away. He was conscious of their eyes on his back as he waddled down the hill. A great gust of laughter went up from behind him, but he did not look back. He hoped they all choked on their suckling pigs.  Dusk had settled, turning all the banners black. The Lannister camp sprawled for miles between the river and the kingsroad. In amongst the men and the horses and the trees, it was easy to get lost, and Tyrion did. He passed a dozen great pavilions and a hundred cookfires. Fireflies drifted amongst the tents like wandering stars. He caught the scent of garlic sausage, spiced and savory, so tempting it made his empty stomach growl. Away in the distance, he heard voices raised in some bawdy song. A giggling woman raced past him, naked beneath a dark cloak, her drunken pursuer stumbling over tree roots. Farther on, two spearmen faced each other across a little trickle of a stream, practicing their thrust-and-parry in the fading light, their chests bare and slick with sweat.  No one looked at him. No one spoke to him. No one paid him any mind. He was surrounded by men sworn to House Lannister, a vast host twenty thousand strong, and yet he was alone.  When he heard the deep rumble of Shagga’s laughter booming through the dark, he followed it to the Stone Crows in their small corner of the night. Conn son of Coratt waved a tankard of ale.  Tyrion Halfman! Come, sit by our fire, share meat with the Stone Crows. We have an ox.    I can see that, Conn son of Coratt.  The huge red carcass was suspended over a roaring fire, skewered on a spit the size of a small tree. No doubt it was a small tree. Blood and grease dripped down into the flames as two Stone Crows turned the meat.  I thank you. Send for me when the ox is cooked.  From the look of it, that might even be before the battle. He walked on.  Each clan had its own cookfire; Black Ears did not eat with Stone Crows, Stone Crows did not eat with Moon Brothers, and no one ate with Burned Men. The modest tent he had coaxed out of Lord Lefford’s stores had been erected in the center of the four fires. Tyrion found Bronn sharing a skin of wine with the new servants. Lord Tywin had sent him a groom and a body servant to see to his needs, and even insisted he take a squire. They were seated around the embers of a small cookfire. A girl was with them; slim, dark-haired, no more than eighteen by the look of her. Tyrion studied her face for a moment, before he spied fishbones in the ashes.  What did you eat?    Trout, m’lord,  said his groom.  Bronn caught them.   Trout, he thought. Suckling pig. Damn my father. He stared mournfully at the bones, his belly rumbling.  His squire, a boy with the unfortunate name of Podrick Payne, swallowed whatever he had been about to say. The lad was a distant cousin to Ser Ilyn Payne, the king’s headsman… and almost as quiet, although not for want of a tongue. Tyrion had made him stick it out once, just to be certain.  Definitely a tongue,  he had said.  Someday you must learn to use it.   At the moment, he did not have the patience to try and coax a thought out of the lad, whom he suspected had been inflicted on him as a cruel jape. Tyrion turned his attention back to the girl.  Is this her?  he asked Bronn.  She rose gracefully and looked down at him from the lofty height of five feet or more.  It is, m’lord, and she can speak for herself, if it please you.   He cocked his head to one side.  I am Tyrion, of House Lannister. Men call me the Imp.    My mother named me Shae. Men call me… often.   Bronn laughed, and Tyrion had to smile.  Into the tent, Shae, if you would be so kind.  He lifted the flap and held it for her. Inside, he knelt to light a candle.  The life of a soldier was not without certain compensations. Wherever you have a camp, you are certain to have camp followers. At the end of the day’s march, Tyrion had sent Bronn back to find him a likely whore.  I would prefer one who is reasonably young, with as pretty a face as you can find,  he had said.  If she has washed sometime this year, I shall be glad. If she hasn’t, wash her. Be certain that you tell her who I am, and warn her of what I am.  Jyck had not always troubled to do that. There was a look the girls got in their eyes sometimes when they first beheld the lordling they’d been hired to pleasure… a took that Tyrion Lannister did not ever care to see again.  He lifted the candle and looked her over. Bronn had done well enough; she was doe-eyed and slim, with small firm breasts and a smile that was by turns shy, insolent, and wicked."
}