{
  "id": "fb91c5ba826b477b6c32bff0f0cd0e45d8228301",
  "text": " Weasley with A their shopping.  Mr. Weasley put down his paper, and Harry saw the now familiar picture of Sirius Black staring up at him.  \"They still haven't caught him, then?\" he asked.  \"No,\" said Mr. Weasley, looking extremely grave. \"They've pulled us all off our regular jobs at the Ministry to try and find him, but no luck so far.\"  \"Would we get a reward if we caught him?\" asked Ron. \"It'd be good to get some more money --\"  \"Don't be ridiculous, Ron,\" said Mr. Weasley, who on closer inspection looked very strained. \"Black's not going to be caught by a thirteen-year-old wizard. It's the Azkaban guards who'll get him back, You mark my words.\"  At that moment Mrs. Weasley entered the bar, laden with shopping bags and followed by the twins, Fred and George, who were about to start their fifth year at Hogwarts; the newly elected Head Boy, Percy; and the Weasleys' youngest child and only girl, Ginny.  Ginny, who had always been very taken with Harry, seemed even more heartily embarrassed than usual when she saw him, perhaps because he had saved her life during their previous year at Hogwarts. She went very red and muttered \"hello\" without looking at him. Percy, however, held out his hand solemnly as though he and Harry had never met and said, \"Harry. How nice to see you.  \"Hello, Percy,\" said Harry, trying not to laugh.  I hope you're well?\" said Percy pompously, shaking hands. It was rather like being introduced to the mayor.  \"Very well, thanks --\"  \"Harry!\" said Fred, elbowing Percy out of the way and bowing deeply. \"Simply splendid to see you, old boy --\"  \"Marvelous,\" said George, pushing Fred aside and seizing Harry's hand in turn. \"Absolutely spiffing.\"  Percy scowled.  \"That's enough, now,\" said Mrs. Weasley.  \"Mum!\" said Fred as though he'd only just spotted her and seizing her hand too. \"How really corking to see you --\"  \"I said, that's enough,\" said Mrs. Weasley, depositing her shopping in an empty chair. \"Hello, Harry, dear. I suppose you've heard our exciting news?\" She pointed to the brand-new silver badge on Percy's chest. \"Second Head Boy in the family!\" she said, swelling with pride.  \"And last,\" Fred muttered under his breath.  I don't doubt that,\" said Mrs. Weasley, frowning suddenly. \"I notice they haven't made you two prefects.\"  \"What do we want to be prefects for?\" said George, looking revolted at the very idea. \"It'd take all the fun out of life.\"  Ginny giggled.  \"Yo u want to set a better example for your sister!\" snapped Mrs. Weasley.  \"Ginny's got other brothers to set her an example, Mother,\" said Percy loftily. \"I'm going up to change for dinner...\"  He disappeared and George heaved a sigh.  \"We tried to shut him in a pyramid,\" he told Harry. \"But Mum spotted us.\"  Dinner that night was a very enjoyable affair. Tom the innkeeper put three tables together in the parlor, and the seven Weasleys, Harry, and Hermione ate their way through five delicious courses.  \"How're we getting to King's Cross tomorrow, Dad?\" asked Fred as they dug into a sumptuous chocolate pudding.  \"The Ministry's providing a couple of cars,\" said Mr. Weasley.  Everyone looked up at him.  \"Why?\" said Percy curiously.  \"It's because of you, Perce,\" said George seriously. \"And there'll be little flags on the hoods, with HB on them\"  \"-- for Humongous Bighead,\" said Fred.  Everyone except Percy and Mrs. Weasley snorted into their pudding.  \"Why are the Ministry providing cars, Father?\" Percy asked again, in a dignified voice.  \"Well, as we haven't got one anymore,\" said Mr. Weasley,  \"-- and as I work there, they're doing me a favor --\"  His voice was casual, but Harry couldn't help noticing that Mr. Weasley's ears had gone red, just like Ron's did when he was under Pressure.  \"Good thing, too,\" said Mrs. Weasley briskly. \"Do you realize how much luggage you've all got between you? A nice sight you'd be on the Muggle Underground.... You are all packed, aren't you?\"  \"Ron hasn't put all his new things in his trunk yet,\" said Percy, in a long-suffering voice. \"He's dumped them on my bed.\"  \"You'd better go and pack properly, Ron, because we won't have much time in the morning,\" Mrs. Weasley called down the table. Ron scowled at Percy.  After dinner everyone felt very full and sleepy. One by one they made their way upstairs to their rooms to check their things for the next day. Ron and Percy were next door to Harry. He had just closed and locked his own trunk when he heard angry voices through the wall, and went to see what was going on.  The door of number twelve was ajar and Percy was shouting.  \"It was here, on the bedside table, I took it off for polishing  \"I haven't touched it, all right?\" Ron roared back.  \"What's up?\" said Harry.  \"My Head Boy badge is gone,\" said Percy, rounding on Harry.  \"So's Scabbers's rat tonic,\" said Ron, throwing things out of his trunk to look. \"I think I might've left it in the bar --\"  \"You're not going anywhere till you've found my badge!\" yelled Percy.  \"I'll get Scabbers's stuff, I'm packed,\" Harry said to Ron, and he went downstairs."
}