{
  "id": "fbb4c82e78c7c5b3496e8fa21fcf033927badf75",
  "text": " Or do you think I’m so old I can’t remember? I’m ninety and I remember very well. I remember what to do with a woman too. That wife of mine will give me a son before this time next year, I’ll wager. Or a daughter, that can’t be helped. Boy or girl, it will be red, wrinkled, and squalling, and like as not she’ll want to name it Walder or Walda.   Catelyn was not concerned with what Lady Frey might choose to name her child.  Jon Arryn was going to foster his son with Lord Stannis, you are quite certain of that?    Yes, yes, yes,  the old man said.  Only he died, so what does it matter? You say you want to cross the river?    We do.    Well, you can’t!  Lord Walder announced crisply.  Not unless I allow it, and why should I? The Tullys and the Starks have never been friends of mine.  He pushed himself back in his chair and crossed his arms, smirking, waiting for her answer.  The rest was only haggling.  A swollen red sun hung low against the western hills when the gates of the castle opened. The drawbridge creaked down, the portcullis winched up, and Lady Catelyn Stark rode forth to rejoin her son and his lords bannermen. Behind her came Ser Jared Frey, Ser Hosteen Frey, Ser Danwell Frey, and Lord Walder’s bastard son Ronel Rivers, leading a long column of pikemen, rank on rank of shuffling men in blue steel ringmail and silvery grey cloaks.  Robb galloped out to meet her, with Grey Wind racing beside his stallion.  It’s done,  she told him.  Lord Walder will grant you your crossing. His swords are yours as well, less four hundred he means to keep back to hold the Twins. I suggest that you leave four hundred of your own, a mixed force of archers and swordsmen. He can scarcely object to an offer to augment his garrison… but make certain you give the command to a man you can trust. Lord Walder may need help keeping faith.    As you say, Mother,  Robb answered, gazing at the ranks of pikemen.  Perhaps… Ser Helman Tallhart, do you think?    A fine choice.    What… what did he want of us?    If you can spare a few of your swords, I need some men to escort two of Lord Frey’s grandsons north to Winterfell,  she told him.  I have agreed to take them as wards. They are young boys, aged eight years and seven. It would seem they are both named Walder. Your brother Bran will welcome the companionship of lads near his own age, I should think.    Is that all? Two fosterlings? That’s a small enough price to—    Lord Frey’s son Olyvar will be coming with us,  she went on.  He is to serve as your personal squire. His father would like to see him knighted, in good time.    A squire.  He shrugged.  Fine, that’s fine, if he’s—    Also, if your sister Arya is returned to us safely, it is agreed that she will marry Lord Walder’s youngest son, Elmar, when the two of them come of age.   Robb looked nonplussed.  Arya won’t like that one bit.    And you are to wed one of his daughters, once the fighting is done,  she finished.  His lordship has graciously consented to allow you to choose whichever girl you prefer. He has a number he thinks might be suitable.   To his credit, Robb did not flinch.  I see.    Do you consent?    Can I refuse?    Not if you wish to cross.    I consent,  Robb said solemnly. He had never seemed more manly to her than he did in that moment. Boys might play with swords, but it took a lord to make a marriage pact, knowing what it meant.  They crossed at evenfall as a horned moon floated upon the river. The double column wound its way through the gate of the eastern twin like a great steel snake, slithering across the courtyard, into the keep and over the bridge, to issue forth once more from the second castle on the west bank.  Catelyn rode at the head of the serpent, with her son and her uncle Ser Brynden and Ser Stevron Frey. Behind followed nine tenths of their horse; knights, lancers, freeriders, and mounted bowmen. It took hours for them all to cross. Afterward, Catelyn would remember the clatter of countless hooves on the drawbridge, the sight of Lord Walder Frey in his litter watching them pass, the glitter of eyes peering down through the slats of the murder holes in the ceiling as they rode through the Water Tower.  The larger part of the northern host, pikes and archers and great masses of men-at-arms on foot, remained upon the east bank under the command of Roose Bolton. Robb had commanded him to continue the march south, to confront the huge Lannister army coming north under Lord Tywin.  For good or ill, her son had thrown the dice.      JON   Are you well, Snow?  Lord Mormont asked, scowling.   Well,  his raven squawked.  Well.    I am, my lord,  Jon lied… loudly, as if that could make it true.  And you?   Mormont frowned.  A dead man tried to kill me. How well could I be?  He scratched under his chin. His shaggy grey beard had been singed in the fire, and he’d hacked it off. The pale stubble of his new whiskers made him look old, disreputable, and grumpy.  You do not look well. How is your hand?    Healing."
}