{
  "id": "fbe9b3e289b1de8a9baaa6fbc249a8ce2b4afc5b",
  "text": "'       She  did not answer, but  as  he looked  at her it  seemed to  him that  something  in her  softened, as though  a bitter frost  were yielding at the  first faint presage of Spring. A  tear sprang in her  eye  and fell down her   cheek, like  a  glistening rain-drop.  Her proud head drooped a little. Then  quietly, more as if speaking  to herself than to him: 'But the healers would  have me lie abed seven days yet,'  she said. 'And  my  window does not  look  eastward.' Her voice was now that of a maiden young and sad.       Faramir  smiled, though his heart was  filled with  pity.  'Your window  does not look eastward?'  he said. 'That  can be  amended.  In  this I  will  command  the Warden. If  you will stay in this  house in our care, lady, and  take your rest, then you  shall walk in this garden in the sun, as you will;  and you shall  look east, whither all our hopes have gone. And here you will   find me, walking and waiting, and also looking east.  It would ease my care,   if you would speak to me, or walk at whiles with me.'       Then she raised her head and looked him in the eyes again; and a colour  came in her  pale face.  'How should I ease your care,  my  lord?' she said.  'And I do not desire the speech of living men.'   ####-     'Would you have my plain answer?' he said.       'I would.'       'Then, Jowyn  of Rohan, I say to  you  that you  are  beautiful. In the  valleys  of our hills there are flowers fair  and bright, and maidens fairer   still; but neither flower nor lady have I seen till now in Gondor so lovely,  and so sorrowful. It may be that only a few days are left ere darkness falls  upon our world,  and when it comes I hope to  face it steadily; but it would  ea se my heart, if while the Sun yet shines, I  could see you  still. For you   and I have both passed under the wings of the Shadow, and the same hand drew  us back.'       'Alas, not me, lord!' she said. 'Shadow  lies on me still.  Look not to  me for healing! I am a shieldmaiden and my hand is ungentle. But I thank you   for this at least, that I need not keep to my chamber. I will walk abroad by  the grace of the Steward of the City.' And she did him a courtesy and walked  back to the house. But Faramir for a long while walked  alone in the garden,   and his glance now strayed rather to the house than to the eastward walls.       When he returned to his chamber he called for the Warden, and heard all   that he could tell of the Lady of Rohan.       'But I doubt  not,  lor d,'  said the Warden, 'that you would learn more  from the Halfling that is with us; for he was in the riding of the king, and  with the Lady at the end, they say.'       And so Merry was sent to Faramir, and while that day lasted they talked  long  together, and  Faramir  learned  much, more  even  than Merry put into  words; and  he  thought  that he understood now  something of the grief  and  unrest of Jowyn of Rohan. And in the  fair evening Faramir and  Merry walked  in the garden, but she did not come.       But in the morning, as Faramir came from the Houses, he saw her, as she  stood upon the walls; and she was clad all in white, and gleamed in the sun.  And he called to her, and she came down, and they walked on the grass or sat  under a green  tree  together , now in  silence, now in speech. And  each day  after they did likewise. And the Warden looking  from his window was glad in  heart.  for  he was a healer. and his care was lightened; and certain it was  that, heavy as was the dread and foreboding of those days upon the hearts of  men, still these two of his charges prospered and grew daily in strength.       And so the  fifth day came since the Lady Jowyn went  first to Faramir;  and they stood now together once more upon the walls of  the City and looked  out. No tidings  had  yet come, and all hearts  were darkened. The  weather,   ####-too, was  bright  no  longer. It was cold. A wind  that had sprung up in the  night was  blowing  now keenly from  the North, and it was  rising; but  the  lands about looked grey and dr ear.       They were clad in warm  raiment and heavy cloaks, and over all the Lady   Jowyn wore a  great blue  mantle of  the colour of deep summer -night, and it   was set with silver stars  about hem and  throat. Faramir had  sent for this  robe and had wrapped  it about her;  and he thought that  she looked fair and   queenly indeed as  she stood there at  his  side. The mantle was wrought for   his  mother,  Finduilas of Amroth,  who died untimely, and was  to him but a  memory of loveliness in far days and of his first grief; and her robe seemed  to him raiment fitting for the beauty and sadness of Jowyn.       But  she  now  shivered  beneath the  starry  mantle,  and  she  looked  northward, above the grey hither lands, into the eye of the  cold wind where  far away the sky was hard and clear.       'What do you look for, Jowyn?' said Faramir.       'Does not the Black Gate lie yonder?' said she. 'And must he not now be  come thither? It is seven days since he rode away."
}