{
  "id": "fc06c09939e5eaeecffff6bf6a71457618b3fc5f",
  "text": "   And a terrible defeat for the north, certainly,  observed Littlefinger,  yet one in which Robb Stark played no part. The Young Wolf remains unbeaten in the field.    What do we know of Stark’s plans and movements?  asked Mathis Rowan, ever blunt and to the point.   He has run back to Riverrun with his plunder, abandoning the castles he took in the west,  announced Lord Tywin.  Our cousin Ser Daven is reforming the remnants of his late father’s army at Lannisport. When they are ready he shall join Ser Forley Prester at the Golden Tooth. As soon as the Stark boy starts north, Ser Forley and Ser Daven will descend on Riverrun.    You are certain Lord Stark means to go north?  Lord Rowan asked.  Even with the ironmen at Moat Cailin?   Mace Tyrell spoke up.  Is there anything as pointless as a king without a kingdom? No, it’s plain, the boy must abandon the riverlands, join his forces to Roose Bolton’s once more, and throw all his strength against Moat Cailin. That is what I would do.   Tyrion had to bite his tongue at that. Robb Stark had won more battles in a year than the Lord of Highgarden had in twenty. Tyrell’s reputation rested on one indecisive victory over Robert Baratheon at Ashford, in a battle largely won by Lord Tarly’s van before the main host had even arrived. The siege of Storm’s End, where Mace Tyrell actually did hold the command, had dragged on a year to no result, and after the Trident was fought, the Lord of Highgarden had meekly dipped his banners to Eddard Stark.   I ought to write Robb Stark a stern letter,  Littlefinger was saying.  I understand his man Bolton is stabling goats in my high hall, it’s really quite unconscionable.   Ser Kevan Lannister cleared his throat.  As regards the Starks… Balon Greyjoy, who now styles himself King of the Isles and the North, has written to us offering terms of alliance.    He ought to be offering fealty,  snapped Cersei.  By what right does he call himself king?    By right of conquest,  Lord Tywin said.  King Balon has strangler’s fingers round the Neck. Robb Stark’s heirs are dead, Winterfell is fallen, and the ironmen hold Moat Cailin, Deepwood Motte, and most of the Stony Shore. King Balon’s longships command the sunset sea, and are well placed to menace Lannisport, Fair Isle, and even Highgarden, should we provoke him.    And if we accept this alliance?  inquired Lord Mathis Rowan.  What terms does he propose?    That we recognize his kingship and grant him everything north of the Neck.   Lord Redwyne laughed.  What is there north of the Neck that any sane man would want? If Greyjoy will trade swords and sails for stone and snow, I say do it, and count ourselves lucky.    Truly,  agreed Mace Tyrell.  That’s what I would do. Let King Balon finish the northmen whilst we finish Stannis.   Lord Tywin’s face gave no hint as to his feelings.  There is Lysa Arryn to deal with as well. Jon Arryn’s widow, Hoster Tully’s daughter, Catelyn Stark’s sister… whose husband was conspiring with Stannis Baratheon at the time of his death.    Oh,  said Mace Tyrell cheerfully,  women have no stomach for war. Let her be, I say, she’s not like to trouble us.    I agree,  said Redwyne.  The Lady Lysa took no part in the fighting, nor has she committed any overt acts of treason.   Tyrionstirred.  She did throw me in a cell and put me on trial for my life,  he pointed out, with a certain amount of rancor.  Nor has she returned to King’s Landing to swear fealty to Joff, as she was commanded. My lords, grant me the men, and I will sort out Lysa Arryn.  He could think of nothing he would enjoy more, except perhaps strangling Cersei. Sometimes he still dreamed of the Eyrie’s sky cells, and woke drenched in cold sweat.  Mace Tyrell’s smile was jovial, but behind it Tyrion sensed contempt.  Perhaps you’d best leave the fighting to fighters,  said the Lord of Highgarden.  Better men than you have lost great armies in the Mountains of the Moon, or shattered them against the Bloody Gate. We know your worth, my lord, no need to tempt fate.   Tyrion pushed off his cushions, bristling, but his father spoke before he could lash back.  I have other tasks in mind for Tyrion. I believe Lord Petyr may hold the key to the Eyrie.    Oh, I do,  said Littleflnger,  I have it here between my legs.  There was mischief in his grey-green eyes.  My lords, with your leave, I propose to travel to the Vale and there woo and win Lady Lysa Arryn. Once I am her consort, I shall deliver you the Vale of Arryn without a drop of blood being spilled.   Lord Rowan looked doubtful.  Would Lady Lysa have you?    She’s had me a few times before, Lord Mathis, and voiced no complaints.    Bedding,  said Cersei,  is not wedding. Even a cow like Lysa Arryn might be able to grasp the difference.    To be sure. It would not have been fitting for a daughter of Riverrun to marry one so far below her.  Littlefinger spread his hands.  Now, though… a match between the Lady of the Eyrie and the Lord of Harrenhal is not so unthinkable, is it?   Tyrion noted the look that passed between Paxter Redwyne and Mace Tyrell."
}