{
  "id": "fc82ad75187229fa0839a5c8bc4d627248d6afc4",
  "text": "  Stark!  they called as Bran trotted past, rising to their feet.  Winterfell! Winterfell!   He was old enough to know that it was not truly him they shouted for—it was the harvest they cheered, it was Robb and his victories, it was his lord father and his grandfather and all the Starks going back eight thousand years. Still, it made him swell with pride. For so long as it took him to ride the length of that hall he forgot that he was broken. Yet when he reached the dais, with every eye upon him, Osha and Hodor undid his straps and buckles, lifted him off Dancer’s back, and carried him to the high seat of his fathers.  Ser Rodrik was seated to Bran’s left, his daughter Beth beside him. Rickon was to his right, his mop of shaggy auburn hair grown so long that it brushed his ermine mantle. He had refused to let anyone cut it since their mother had gone. The last girl to try had been bitten for her efforts.  I wanted to ride too,  he said as Hodor led Dancer away.  I ride better than you.    You don’t, so hush up,  he told his brother. Ser Rodrik bellowed for quiet. Bran raised his voice. He bid them welcome in the name of his brother, the King in the North, and asked them to thank the gods old and new for Robb’s victories and the bounty of the harvest.  May there be a hundred more,  he finished, raising his father’s silver goblet.   A hundred more!  Pewter tankards, clay cups, and iron-banded drinking horns clashed together. Bran’s wine was sweetened with honey and fragrant with cinnamon and cloves, but stronger than he was used to. He could feel its hot snaky fingers wriggling through his chest as he swallowed. By the time he set down the goblet, his head was swimming.   You did well, Bran,  Ser Rodrik told him.  Lord Eddard would have been most proud.  Down the table, Maester Luwin nodded his agreement as the servers began to carry in the food.  Such food Bran had never seen; course after course after course, so much that he could not manage more than a bite or two of each dish. There were great joints of aurochs roasted with leeks, venison pies chunky with carrots, bacon, and mushrooms, mutton chops sauced in honey and cloves, savory duck, peppered boar, goose, skewers of pigeon and capon, beef-and-barley stew, cold fruit soup. Lord Wyman had brought twenty casks of fish from White Harbor packed in salt and seaweed; whitefish and winkles, crabs and mussels, clams, herring, cod, salmon, lobster and lampreys. There was black bread and honeycakes and oaten biscuits; there were turnips and pease and beets, beans and squash and huge red onions; there were baked apples and berry tarts and pears poached in strongwine. Wheels of white cheese were set at every table, above and below the salt, and flagons of hot spice wine and chilled autumn ale were passed up and down the tables.  Lord Wyman’s musicians played bravely and well, but harp and fiddle and horn were soon drowned beneath a tide of talk and laughter, the clash of cup and plate, and the snarling of hounds fighting for table scraps. The singer sang good songs,  Iron Lances  and  The Burning of the Ships  and  The Bear and the Maiden Fair,  but only Hodor seemed to be listening. He stood beside the piper, hopping from one foot to the other.  The noise swelled to a steady rumbling roar, a great heady stew of sound. Ser Rodrik talked with Maester Luwin above Beth’s curly head, while Rickon screamed happily at the Walders. Bran had not wanted the Freys at the high table, but the maester reminded him that they would soon be kin. Robb was to marry one of their aunts, and Arya one of their uncles.  She never will,  Bran said,  not Arya,  but Maester Luwin was unyielding, so there they were beside Rickon.  The serving men brought every dish to Bran first, that he might take the lord’s portion if he chose. By the time they reached the ducks, he could eat no more. After that he nodded approval at each course in turn, and waved it away. If the dish smelled especially choice, he would send it to one of the lords on the dais, a gesture of friendship and favor that Maester Luwin told him he must make. He sent some salmon down to poor sad Lady Hornwood, the boar to the boisterous Umbers, a dish of goose-in-berries to Cley Cerwyn, and a huge lobster to Joseth the master of horse, who was neither lord nor guest, but had seen to Dancer’s training and made it possible for Bran to ride. He sent sweets to Hodor and Old Nan as well, for no reason but he loved them. Ser Rodrik reminded him to send something to his foster brothers, so he sent Little Walder some boiled beets and Big Walder the buttered turnips.  On the benches below, Winterfell men mixed with smallfolk from the winter town, friends from the nearer holdfasts, and the escorts of their lordly guests. Some faces Bran had never seen before, others he knew as well as his own, yet they all seemed equally foreign to him. He watched them as from a distance, as if he still sat in the window of his bedchamber looking down on the yard below, seeing everything yet a part of nothing."
}