{
  "id": "fce2738c952bdd518c16e853feb70c9ba0df88e9",
  "text": " Make no mistake, dwarf. I fought for you, but I do not love you.    It was your blade I needed,  Tyrion said,  not your love.  He dumped his armful of wood on the ground.  Bronn grinned.  You’re bold as any sellsword, I’ll give you that. How did you know I’d take your part?    Know?  Tyrion squatted awkwardly on his stunted legs to build the fire.  I tossed the dice. Back at the inn, you and Chiggen helped take me captive. Why? The others saw it as their duty, for the honor of the lords they served, but not you two. You had no lord, no duty, and precious little honor, so why trouble to involve yourselves?  He took out his knife and whittled some thin strips of bark off one of the sticks he’d gathered, to serve as kindling.  Well, why do sellswords do anything? For gold. You were thinking Lady Catelyn would reward you for your help, perhaps even take you into her service. Here, that should do, I hope. Do you have a flint?   Bronn slid two fingers into the pouch at his belt and tossed down a flint. Tyrion caught it in the air.   My thanks,  he said.  The thing is, you did not know the Starks. Lord Eddard is a proud, honorable, and honest man, and his lady wife is worse. Oh, no doubt she would have found a coin or two for you when this was all over, and pressed it in your hand with a polite word and a look of distaste, but that’s the most you could have hoped for. The Starks look for courage and loyalty and honor in the men they choose to serve them, and if truth be told, you and Chiggen were lowborn scum.  Tyrion struck the flint against his dagger, trying for a spark. Nothing.  Bronn snorted.  You have a bold tongue, little man. One day someone is like to cut it out and make you eat it.    Everyone tells me that.  Tyrion glanced up at the sellsword.  Did I offend you? My pardons… but you are scum, Bronn, make no mistake. Duty, honor, friendship, what’s that to you? No, don’t trouble yourself, we both know the answer. Still, you’re not stupid. Once we reached the Vale, Lady Stark had no more need of you… but I did, and the one thing the Lannisters have never lacked for is gold. When the moment came to toss the dice, I was counting on your being smart enough to know where your best interest lay. Happily for me, you did.  He slammed stone and steel together again, fruitlessly.   Here,  said Bronn, squatting,  I’ll do it.  He took the knife and flint from Tyrion’s hands and struck sparks on his first try. A curl of bark began to smolder.   Well done,  Tyrion said.  Scum you may be, but you’re undeniably useful, and with a sword in your hand you’re almost as good as my brother Jaime. What do you want, Bronn? Gold? Land? Women? Keep me alive, and you’ll have it.   Bronn blew gently on the fire, and the flames leapt up higher.  And if you die?    Why then, I’ll have one mourner whose grief is sincere,  Tyrion said, grinning.  The gold ends when I do.   The fire was blazing up nicely. Bronn stood, tucked the flint back into his pouch, and tossed Tyrion his dagger.  Fair enough,  he said.  My sword’s yours, then… but don’t go looking for me to bend the knee and m’lord you every time you take a shit. I’m no man’s toady.    Nor any man’s friend,  Tyrion said.  I’ve no doubt you’d betray me as quick as you did Lady Stark, if you saw a profit in it. If the day ever comes when you’re tempted to sell me out, remember this, Bronn—I’ll match their price, whatever it is. I like living. And now, do you think you could do something about finding us some supper?    Take care of the horses,  Bronn said, unsheathing the long dirk he wore at his hip. He strode into the trees.  An hour later the horses had been rubbed down and fed, the fire was crackling away merrily, and a haunch of a young goat was turning above the flames, spitting and hissing.  All we lack now is some good wine to wash down our kid,  Tyrion said.   That, a woman, and another dozen swords,  Bronn said. He sat cross-legged beside the fire, honing the edge of his longsword with an oilstone. There was something strangely reassuring about the rasping sound it made when he drew it down the steel.  It will be full dark soon,  the sellsword pointed out.  I’ll take first watch… for all the good it will do us. It might be kinder to let them kill us in our sleep.    Oh, I imagine they’ll be here long before it comes to sleep.  The smell of the roasting meat made Tyrion’s mouth water.  Bronn watched him across the fire.  You have a plan,  he said flatly, with a scrape of steel on stone.   A hope, call it,  Tyrion said.  Another toss of the dice.    With our lives as the stake?   Tyrion shrugged.  What choice do we have?  He leaned over the fire and sawed a thin slice of meat from the kid.  Ahhhh,  he sighed happily as he chewed. Grease ran down his chin.  A bit tougher than I’d like, and in want of spicing, but I’ll not complain too loudly. If I were back at the Eyrie, I’d be dancing on a precipice in hopes of a boiled bean.    And yet you gave the turnkey a purse of gold,  Bronn said."
}