{
  "id": "fcfd5f64b76617cafddee7983a2d6edff7c4f489",
  "text": " Did he not come?    He came,  Tyrion admitted,  and then he went.    I shall send him to you again.   But it was the next morning before Podrick Payne returned. He stepped inside the room hesitantly, with fear written all over his face. Bronn came in behind him. The sellsword knight wore a jerkin studded with silver and a heavy riding cloak, with a pair of fine-tooled leather gloves thrust through his swordbelt.  One look at Bronn’s face gave Tyrion a queasy feeling in the pit of his stomach.  It took you long enough.    The boy begged, or I wouldn’t have come at all. I am expected at Castle Stokeworth for supper.    Stokeworth?  Tyrion hopped from the bed.  And pray, what is there for you in Stokeworth?    A bride.  Bronn smiled like a wolf contemplating a lost lamb.  I’m to wed Lollys the day after next.    Lollys.  Perfect, bloody perfect. Lady Tanda’s lackwit daughter gets a knightly husband and a father of sorts for the bastard in her belly, and Ser Bronn of the Blackwater climbs another rung. It had Cersei’s stinking fingers all over it.  My bitch sister has sold you a lame horse. The girl’s dim-witted.    If I wanted wits, I’d marry you.    Lollys is big with another man’s child.    And when she pops him out, I’ll get her big with mine.    She’s not even heir to Stokeworth,  Tyrion pointed out.  She has an elder sister. Falyse. A married sister.    Married ten years, and still barren,  said Bronn.  Her lord husband shuns her bed. It’s said he prefers virgins.    He could prefer goats and it wouldn’t matter. The lands will still pass to his wife when Lady Tanda dies.    Unless Falyse should die before her mother.   Tyrion wondered whether Cersei had any notion of the sort of serpent she’d given Lady Tanda to suckle. And if she does, would she care?  Why are you here, then?   Bronn shrugged.  You once told me that if anyone ever asked me to sell you out, you’d double the price.   Yes.  Is it two wives you want, or two castles?    One of each would serve. But if you want me to kill Gregor Clegane for you, it had best be a damned big castle.   The Seven Kingdoms were full of highborn maidens, but even the oldest, poorest, and ugliest spinster in the realm would balk at wedding such lowborn scum as Bronn. Unless she was soft of body and soft of head, with a fatherless child in her belly from having been raped half a hundred times. Lady Tanda had been so desperate to find a husband for Lollys that she had even pursued Tyrion for a time, and that had been before half of King’s Landing enjoyed her. No doubt Cersei had sweetened the offer somehow, and Bronn was a knight now, which made him a suitable match for a younger daughter of a minor house.   I find myself woefully short of both castles and highborn maidens at the moment,  Tyrion admitted.  But I can offer you gold and gratitude, as before.    I have gold. What can I buy with gratitude?    You might be surprised. A Lannister pays his debts.    Your sister is a Lannister too.    My lady wife is heir to Winterfell. Should I emerge from this with my head still on my shoulders, I may one day rule the north in her name. I could carve you out a big piece of it.    If and when and might be,  said Bronn.  And it’s bloody cold up there. Lollys is soft, warm, and close. I could be poking her two nights hence.    Not a prospect I would relish.    Is that so?  Bronn grinned.  Admit it, Imp. Given a choice between fucking Lollys and fighting the Mountain, you’d have your breeches down and cock up before a man could blink.   He knows me too bloody well. Tyrion tried a different tack.  I’d heard that Ser Gregor was wounded on the Red Fork, and again at Duskendale. The wounds are bound to slow him.   Bronn looked annoyed.  He was never fast. Only freakish big and freakish strong. I’ll grant you, he’s quicker than you’d expect for a man that size. He has a monstrous long reach, and doesn’t seem to feel blows the way a normal man would.    Does he frighten you so much?  asked Tyrion, hoping to provoke him.   If he didn’t frighten me, I’d be a bloody fool.  Bronn gave a shrug.  Might be I could take him. Dance around him until he was so tired of hacking at me that he couldn’t lift his sword. Get him off his feet somehow. When they’re flat on their backs it don’t matter how tall they are. Even so, it’s chancy. One misstep and I’m dead. Why should I risk it? I like you well enough, ugly little whoreson that you are… but if I fight your battle, I lose either way. Either the Mountain spills my guts, or I kill him and lose Stokeworth. I sell my sword, I don’t give it away. I’m not your bloody brother.    No,  said Tyrion sadly.  You’re not.  He waved a hand.  Begone, then. Run to Stokeworth and Lady Lollys. May you find more joy in your marriage bed than I ever found in mine.   Bronn hesitated at the door.  What will you do, Imp?    Kill Gregor myself. Won’t that make for a jolly song?    I hope I hear them sing it.  Bronn grinned one last time, and walked out of the door, the castle, and his life."
}