{
  "id": "fd0572047ce75baf93e9b20ac7c806db987f1d86",
  "text": "  Does Thoros of Myr still ride with him?    Aye. The red wizard. I’ve heard tell he has strange powers.   Well, he had the power to match Robert Baratheon drink for drink, and there were few enough who could say that. Jaime had once heard Thoros tell the king that he became a red priest because the robes hid the winestains so well. Robert had laughed so hard he’d spit ale all over Cersei’s silken mantle.  Far be it from me to make objection,  he said,  but perhaps the Trident is not our safest course.    I’d say that’s so,  their cook agreed.  Even if you get past Red Deer island and don’t meet up with Lord Beric and the red wizard, there’s still the ruby ford before you. Last I heard, it was the Leech Lord’s wolves held the ford, but that was some time past. By now it could be lions again, or Lord Beric, or anyone.    Or no one,  Brienne suggested.   If m’lady cares to wager her skin on that I won’t stop her… but if I was you, I’d leave this here river, cut overland. If you stay off the main roads and shelter under the trees of a night, hidden as it were… well, I still wouldn’t want to go with you, but you might stand a mummer’s chance.   The big wench was looking doubtful.  We would need horses.    There are horses here,  Jaime pointed out.  I heard one in the stable.    Aye, there are,  said the innkeep, who wasn’t an innkeep.  Three of them, as it happens, but they’re not for sale.   Jaime had to laugh.  Of course not. But you’ll show them to us anyway.   Brienne scowled, but the man who wasn’t an innkeep met her eyes without blinking, and after a moment, reluctantly, she said,  Show me,  and they all rose from the table.  The stables had not been mucked out in a long while, from the smell of them. Hundreds of fat black flies swarmed amongst the straw, buzzing from stall to stall and crawling over the mounds of horse dung that lay everywhere, but there were only the three horses to be seen. They made an unlikely trio; a lumbering brown plow horse, an ancient white gelding blind in one eye, and a knight’s palfrey, dapple grey and spirited.  They’re not for sale at any price,  their alleged owner announced.   How did you come by these horses?  Brienne wanted to know.   The dray was stabled here when the wife and me come on the inn,  the man said,  along with the one you just ate. The gelding come wandering up one night, and the boy caught the palfrey running free, still saddled and bridled. Here, I’ll show you.   The saddle he showed them was decorated with silver inlay. The saddlecloth had originally been checkered pink and black, but now it was mostly brown. Jaime did not recognize the original colors, but he recognized bloodstains easily enough.  Well, her owner won’t be coming to claim her anytime soon.  He examined the palfrey’s legs, counted the gelding’s teeth.  Give him a gold piece for the grey, if he’ll include the saddle,  he advised Brienne.  A silver for the plow horse. He ought to pay us for taking the white off his hands.    Don’t speak discourteously of your horse, ser.  The wench opened the purse Lady Catelyn had given her and took out three golden coins.  I will pay you a dragon for each.   He blinked and reached for the gold, then hesitated and drew his hand back.  I don’t know. I can’t ride no golden dragon if I need to get away. Nor eat one if I’m hungry.    You can have our skiff as well,  she said.  Sail up the river or down, as you like.    Let me have a taste o’ that gold.  The man took one of the coins from her palm and bit it.  Hm. Real enough, I’d say. Three dragons and the skiff?    He’s robbing you blind, wench,  Jaime said amiably.   I’ll want provisions too,  Brienne told their host, ignoring Jaime.  Whatever you have that you can spare.    There’s more oatcakes.  The man scooped the other two dragons from her palm and jingled them in his fist, smiling at the sound they made.  Aye, and smoked salt fish, but that will cost you silver. My beds will be costing as well. You’ll be wanting to stay the night.    No,  Brienne said at once.  The man frowned at her.  Woman, you don’t want to go riding at night through strange country on horses you don’t know. You’re like to blunder into some bog or break your horse’s leg.    The moon will be bright tonight,  Brienne said.  We’ll have no trouble finding our way.   Their host chewed on that.  If you don’t have the silver, might be some coppers would buy you them beds, and a coverlet or two to keep you warm. It’s not like I’m turning travelers away, if you get my meaning.    That sounds more than fair,  said Ser Cleos.   The coverlets is fresh washed, too. My wife saw to that before she had to go off. Not a flea to be found neither, you have my word on that.  He jingled the coins again, smiling.  Ser Cleos was plainly tempted.  A proper bed would do us all good, my lady,  he said to Brienne.  We’d make better time on the morrow once refreshed.  He looked to his cousin for support.   No, coz, the wench is right. We have promises to keep, and long leagues before us."
}