{
  "id": "fd0738663a02224b98916b1d956505c518b0db37",
  "text": " The candles were down to stubs, so Arya changed them out. Under the windows was a huge oaken table where the lord wrote his letters. She stacked the books, changed the candles, put the quills and inks and sealing wax in order.  A large ragged sheepskin was tossed across the papers. Arya had started to roll it up when the colors caught her eye: the blue of lakes and rivers, the red dots where castles and cities could be found, the green of woods. She spread it out instead. THE LANDS OF THE TRIDENT, said the ornate script beneath the map. The drawing showed everything from the Neck to the Blackwater Rush. There’s Harrenhal at the top of the big lake, she realized, but where’s Riverrun? Then she saw. It’s not so far…  The afternoon was still young by the time she was done, so Arya took herself off to the godswood. Her duties were lighter as Lord Bolton’s cupbearer than they had been under Weese or even Pinkeye, though they required dressing like a page and washing more than she liked. The hunt would not return for hours, so she had a little time for her needlework.  She slashed at birch leaves till the splintery point of the broken broomstick was green and sticky.  Ser Gregor,  she breathed.  Dunsen, Polliver, Raff the Sweetling.  She spun and leapt and balanced on the balls of her feet, darting this way and that, knocking pinecones flying.  The Tickler,  she called out one time,  the Hound,  the next.  Ser Ilyn, Ser Meryn, Queen Cersei.  The bole of an oak loomed before her, and she lunged to drive her point through it, grunting  Joffrey, Joffrey, Joffrey.  Her arms and legs were dappled by sunlight and the shadows of leaves. A sheen of sweat covered her skin by the time she paused. The heel of her right foot was bloody where she’d skinned it, so she stood one-legged before the heart tree and raised her sword in salute.  Valar morghulis,  she told the old gods of the north. She liked how the words sounded when she said them.  As Arya crossed the yard to the bathhouse, she spied a raven circling down toward the rookery, and wondered where it had come from and what message it carried. Might be it’s from Robb, come to say it wasn’t true about Bran and Rickon. She chewed on her lip, hoping. If I had wings I could fly back to Winterfell and see for myself. And if it was true, I’d just fly away, fly up past the moon and the shining stars, and see all the things in Old Nan’s stories, dragons and sea monsters and the Titan of Braavos, and maybe I wouldn’t ever fly back unless I wanted to.  The hunting party returned near evenfall with nine dead wolves. Seven were adults, big grey-brown beasts, savage and powerful, their mouths drawn back over long yellow teeth by their dying snarls. But the other two had only been pups. Lord Bolton gave orders for the skins to be sewn into a blanket for his bed.  Cubs still have that soft fur, my lord,  one of his men pointed out.  Make you a nice warm pair of gloves.   Bolton glanced up at the banners waving above the gatehouse towers.  As the Starks are wont to remind us, winter is coming. Have it done.  When he saw Arya looking on, he said,  Nan, I’ll want a flagon of hot spice wine, I took a chill in the woods. See that it doesn’t get cold. I’m of a mind to sup alone. Barley bread, butter, and boar.    At once, my lord.  That was always the best thing to say.  Hot Pie was making oatcakes when she entered the kitchen. Three other cooks were boning fish, while a spit boy turned a boar over the flames.  My lord wants his supper, and hot spice wine to wash it down,  Arya announced,  and he doesn’t want it cold.  One of the cooks washed his hands, took out a kettle, and filled it with a heavy, sweet red. Hot Pie was told to crumble in the spices as the wine heated. Arya went to help.   I can do it,  he said sullenly.  I don’t need you to show me how to spice wine.   He hates me too, or else he’s scared of me. She backed away, more sad than angry. When the food was ready, the cooks covered it with a silver cover and wrapped the flagon in a thick towel to keep it warm. Dusk was settling outside. On the walls the crows muttered round the heads like courtiers round a king. One of the guards held the door to Kingspyre.  Hope that’s not weasel soup,  he jested.  Roose Bolton was seated by the hearth reading from a thick leatherbound book when she entered.  Light some candles,  he commanded her as he turned a page.  It grows gloomy in here.   She placed the food at his elbow and did as he bid her, filling the room with flickering light and the scent of cloves. Bolton turned a few more pages with his finger, then closed the book and placed it carefully in the fire. He watched the flames consume it, pale eyes shining with reflected light. The old dry leather went up with a whoosh, and the yellow pages stirred as they burned, as if some ghost were reading them.  I will have no further need of you tonight,  he said, never looking at her.  She should have gone, silent as a mouse, but something had hold of her."
}