{
  "id": "fd07eea94867095cc72e96ad443549c6fa05fd20",
  "text": "  They  are sparing only a tithe  of  their strength. Still  every little is a gain.'       And  so  the  companies  came and  were hailed and  cheered  and passed  through  the Gate, men of the Outlands marching to defend the City of Gondor   in a dark hour; but always too few, always less than hope looked for or need  asked. The  men of  Ringlu  Vale  behind the  son  of  their  lord, Dervorin  striding  on foot: three hundreds. From  the uplands of  Morthond, the great  Blackroot Vale,  tall Duinhir with  his sons, Duilin and  Derufin,  and five  hundred bowmen. From the  Anfalas, the Langstrand far away,  a  long line of  men of many sorts, hunters and herdsmen and men of little villages, scantily  equipped  save for the hou sehold of Golasgil their lord. From Lamedon, a few  grim hillmen without a  captain.  Fisher -folk of the Ethir, some hundred  or   more spared from the ships. Hirluin the Fair of the Green Hills from Pinnath  Gelin with three hundreds  of gallant green-clad men. And last and proudest,   Imrahil,  Prince  of Dol Amroth,  kinsman of the  Lord, with  gilded banners  bearing his token of the Ship and  the Silver Swan, and a company of knights  in full harness riding grey horses; and behind them seven hundreds of men at  arms, tall as lords, grey-eyed, dark-haired, singing as they came.       And  that was  all, less than  three thousands full told. No more would  come. Their cries and the tramp of their feet passed into  the City and died  away. The onlookers stood silent for a while. Dust hung  in the air, for the  wind had  died and  the  evening  was heavy. Already  the  closing  hour was  drawing nigh, and the red sun had gone behind  Mindolluin. Shadow  came  down  on the City.       Pippin  looked  up,  and  it  seemed to  him that  the  sky  had  grown  ashen-grey, as  if a vast dust  and  smoke hung above  them, and  light came   ####-dully  through it. But in the West  the dying  sun had  set all  the fume on  fire, and now Mindolluin stood black against a burning smoulder flecked  with  embers. 'So ends a  fair day in wrath!' he said forgetful of the lad  at his  side.       'So it  will, if  I  have not returned before the sundown-bells,'  said  Bergil. 'Come! There goes the trumpet for the closing of the Gate.'       Hand  in hand they went  back into the City, the last to  pass the Gate  before it  was  shut;  and as they  reached the Lampwrights'  Street all the  bells in the towers tolled solemnly. Lights sprang in many windows, and from  the houses and wards of the men at arms along the walls there came the sound  of song.       'Farewell  for  this  time,'  said  Bergil.  'Take  my  greetings to my  :father, and thank him for the company that he sent. Come again soon, I beg.   Almost  I wish now that there was no war,  for we might have  had some merry  times. We might have journeyed to Lossarnach, to my grandsire's house; it is  good to be  there in Spring, the  woods and fields are  full of flowers. But  maybe we will go thither together  yet.  They will never overcome our  Lord,  and my father is very valiant. Farewell and return!'       They  parted and Pippin hurried back towards the citadel.  It seemed  a   long way, and he  grew hot and  very hungry; and night closed down swift and  dark.  Not a star pricked the sky. He  was late for the daymeal in the mess,  and Beregond greeted him gladly, and sat him at his side to hear news of his  son.  After the  meal Pippin stayed a while,  and then took his leave, for a   strange gloom was on him, and now he desired very much to see Gandalf  again.       'Can you find your way?' said Beregond at  the door of the  small hall,  on the north side of the citadel, where  they had sat. 'It is a black night,  and all the blacker  since  orders came that lights are  to be dimmed within  the City, and none are to shine out from  the walls. And I can give you news  of another order: you will be summoned to the Lord Denethor  early tomorrow.   I  fear you will not  be for the Third  Company. Still we may  hope  to meet  again. Farewell and sleep in peace!'       The lodging was   dark,  save  for a  little lantern  set  on the table.  Gandalf was  not there.  Gloom settled  still  more  heavily  on Pippin.  He  climbed on the bench  and tried  to  peer out of a window,  but it was  like  looking  into a pool of ink. He  got down and closed the shutter and went to  bed.  For a  while he lay and listened for  sounds  of Gandalf's return, and   ####-then he fell into an uneasy sleep.       In  the  night he was wakened by  a light, and he saw that  Gandalf had  come and was pacing to and fro in the room beyond the curtain of the alcove.  There were candles on the  table and rolls of parchment. He heard the wizard  sigh, and mutter: 'When will Faramir return?'       'Hullo!' said Pippin, poking his head round the curtain. 'I thought you   had forgotten  all about me. I am  glad  to see you back. It has been a long  day.'       'But the night  will be too  short,' said  Gandalf."
}