{
  "id": "fd8a9b4b0b0172b171b5f9707a5b99a47bc913ac",
  "text": " There was a trial, Ser Loras said.    Two trials, actually. Words and swords both failed him. A bloody mess. Did you watch from your window?    My cell faces the sea. I heard the shouting, though.    Prince Oberyn of Dorne is dead, Ser Gregor Clegane lies dying, and Tyrion stands condemned before the eyes of gods and men. They’re keeping him in a black cell till they kill him.   Brienne looked at him.  You do not believe he did it.   Jaime gave her a hard smile.  See, wench? We know each other too well. Tyrion’s wanted to be me since he took his first step, but he’d never follow me in kingslaying. Sansa Stark killed Joffrey. My brother’s kept silent to protect her. He gets these fits of gallantry from time to time. The last one cost him a nose. This time it will mean his head.    No,  Brienne said.  It was not my lady’s daughter. It could not have been her.    There’s the stubborn stupid wench that I remember.   She reddened.  My name is…    Brienne of Tarth.  Jaime sighed.  I have a gift for you.  He reached down under the Lord Commander’s chair and brought it out, wrapped in folds of crimson velvet.  Brienne approached as if the bundle was like to bite her, reached out a huge freckled hand, and flipped back a fold of cloth. Rubies glimmered in the light. She picked the treasure up gingerly, curled her fingers around the leather grip, and slowly slid the sword free of its scabbard. Blood and black the ripples shone. A finger of reflected light ran red along the edge.  Is this Valyrian steel? I have never seen such colors.    Nor I. There was a time that I would have given my right hand to wield a sword like that. Now it appears I have, so the blade is wasted on me. Take it.  Before she could think to refuse, he went on.  A sword so fine must bear a name. It would please me if you would call this one Oathkeeper. One more thing. The blade comes with a price.   Her face darkened.  I told you, I will never serve…    …such foul creatures as us. Yes, I recall. Hear me out, Brienne. Both of us swore oaths concerning Sansa Stark. Cersei means to see that the girl is found and killed, wherever she has gone to ground…   Brienne’s homely face twisted in fury.  If you believe that I would harm my lady’s daughter for a sword, you—    Just listen,  he snapped, angered by her assumption.  I want you to find Sansa first, and get her somewhere safe. How else are the two of us going to make good our stupid vows to your precious dead Lady Catelyn?  The wench blinked.  I… I thought…    I know what you thought.  Suddenly Jaime was sick of the sight of her. She bleats like a bloody sheep.  When Ned Stark died, his greatsword was given to the King’s Justice,  he told her.  But my father felt that such a fine blade was wasted on a mere headsman. He gave Ser Ilyn a new sword, and had Ice melted down and reforged. There was enough metal for two new blades. You’re holding one. So you’ll be defending Ned Stark’s daughter with Ned Stark’s own steel, if that makes any difference to you.    Ser, I… I owe you an apolo…   He cut her off.  Take the bloody sword and go, before I change my mind. There’s a bay mare in the stables, as homely as you are but somewhat better trained. Chase after Steelshanks, search for Sansa, or ride home to your isle of sapphires, it’s naught to me. I don’t want to look at you anymore.    Jaime…    Kingslayer,  he reminded her.  Best use that sword to clean the wax out of your ears, wench. We’re done.   Stubbornly, she persisted.  Joffrey was your…    My king. Leave it at that.    You say Sansa killed him. Why protect her?   Because Joff was no more to me than a squirt of seed in Cersei’s cunt. And because he deserved to die.  I have made kings and unmade them. Sansa Stark is my last chance for honor.  Jaime smiled thinly.  Besides, kingslayers should band together. Are you ever going to go?   Her big hand wrapped tight around Oathkeeper.  I will. And I will find the girl and keep her safe. For her lady mother’s sake. And for yours.  She bowed stiffly, whirled, and went.  Jaime sat alone at the table while the shadows crept across the room. As dusk began to settle, he lit a candle and opened the White Book to his own page. Quill and ink he found in a drawer. Beneath the last line Ser Barristan had entered, he wrote in an awkward hand that might have done credit to a six-year-old being taught his first letters by a maester:  Defeated in the Whispering Wood by the Young Wolf Robb Stark during the War of the Five Kings. Held captive at Riverrun and ransomed for a promise unfuffilled. Captured again by the Brave Companions, and maimed at the word of Vargo Hoat their captain, losing his sword hand to the blade of Zollo the Fat. Returned safely to King’s Landing by Brienne, the Maid of Tarth.  When he was done, more than three-quarters of his page still remained to be filled between the gold lion on the crimson shield on top and the blank white shield at the bottom. Ser Gerold Hightower had begun his history, and Ser Barristan Selmy had continued it, but the rest Jaime Lannister would need to write for himself."
}