{
  "id": "fdeb21265a749c096ac3f23b00d2cb2256705b09",
  "text": "\"  It  did.  The  rope went  taut,  and  Fili  pulled  in  vain. Kili  came  to  his  help,  and  then  Oin  and  Gloin.  They  tugged  and  tugged,  and  suddenly  they  all  fell  over  on  their backs. Bilbo was on  the  lockout, however, caught  the rope, and with a piece  of  stick  fended  off  the  little  black  boat  as  it  came  rushing  across  the  stream.  \"Help!\"  he  shouted,  and Balin was  just  in  time  to  seize  the  boat  before  it  floated  off down the current.  \"It  was  tied  after  all,\"  said  he,  looking  at  the  snapped  painter  that  was  still  dangling  from  it.  \"That  was  a  good  pull,  my  lads;  and  a  good  job  that  our  rope  was the stronger.\"   ####-\"Who'll cross first?\" asked Bilbo.  \"I  shall,\"  said Thorin,  \"and  you will come with me, and Fili and Balin. That's  as  many  as  the  boat  will  hold  at  a  time.  After  that  Kili  and  Oin  and  Gloin  and  Don; next On and Nori, Bifur and Bofur; and last Dwalin and Bombur.\"  \"I'm  always  last  and  I  don't  like  it,\"  said  Bombur.  \"It's  somebody  else's  turn  today.\"  \"You  should  not  be  so  fat. As  you  are,  you must  be with  the  last  and  lightest  boatload.  Don't  start  grumbling  against  orders,  or  something  bad  will  happen  to  you.\"  \"There  aren't  any  oars.  How  are  you  going  to  push  the  boat  back  to  the  far  bank?\" asked the hobbit.  \"Give me  another  length  of  rope  and  another  hook,\"  said  Fili,  and when  they  had got  it  ready, he cast  into  the darkness ahead and as high as he could  throw  it.  Since  it did not  fall down again,  they saw  that  it must have stuck in the branches.  \"Get  in now,\" said Fili, \"and one of you haul on  the rope  that  is stuck  in a  tree on  the other  side. One of  the others must keep hold of  the hook we used  at  first,  and  when we  are  safe  on  the  other  side  he  can  hook  it  on,  and  you  can draw  the boat  back.\"  In  this  way  they  were  all  soon  on  the  far  bank  safe  across  the  enchanted  stream.  Dwalin  had  just  scrambled  out  with  the  coiled  rope  on  his  arm,  and  Bombur  (still  grumbling)  was  getting  ready  to  follow,  when  something  bad  did  happen. There was a  flying  sound of hooves on  the path ahead. Out of  the gloom  came suddenly  the shape of a  flying deer.  It charged  into  the dwarves and bowled  them  over,  then  gathered  itself  for  a  leap.  High  it  sprang  and  cleared  the  water  with  a  mighty  jump.  But  it  did  not  reach  the  other  side  in  safety. Thorin was  the  only  one  who  had  kept  his  feet  and  his  wits.  As  soon  as  they  had  landed  he  had  bent his bow and fitted an arrow in case any hidden guardian of the boat appeared.  Now he  sent  a  swift  and  sure  shot  into the leaping beast. As it reached the further  bank  it  stumbled.  The  shadows  swallowed  it  up,  but  they  heard  the  sound  of  hooves quickly falter and then go still.  Before  they  could  shout  in  praise  of  the  shot,  however,  a  dreadful  wail  from  Bilbo  put  all  thoughts  of  venison  out  of  their  minds.  \"Bombur  has  fallen  in!  Bombur is drowning!\" he cried. It was only too true. Bombur had only one foot on  the land when the hart bore down on him, and sprang over him. He had stumbled,  thrusting the boat away from the bank, and then toppled back into the dark water,  his  hands  slipping  off  the  slimy  roots  at  the  edge,  while  the  boat  span  slowly  off  and disappeared.   ####-They  could  still  see  his  hood  above  the  water  when  they  ran  to  the  bank.  Quickly  they  flung  a  rope with  a  hook towards him. His hand caught it, and they  pulled  him  to  the  shore.  He  was  drenched  from  hair  to  boots,  of  course,  but  that  was  not  the  worst.  When  they  laid  him  on  the  bank  he  was  already  fast  asleep,  with one hand clutching the rope so tight that they could not get it from his grasp;  and  fast asleep he  remained  in  spite of all  they could do. They were  still  standing  over him,  cursing  their  ill  luck,  and Bombur's  clumsiness,  and  lamenting  the  loss  of  the  boat  which  made  it  impossible  for  them  to  go  back  and  look  for  the  hart,  when  they became  aware of  the dim blowing of horns  in  the wood  and  the  sound  as  of  dogs  baying  far  off.  Then  they  all  fell  silent;  and  as  they  sat  it  seemed  they  could hear  the noise of a great hunt going by  to  the north of  the path, though they  saw no sign of it. There they sat for a long while and did not dare to make a move.  Bombur  slept  on with  a  smile  on  his  fat  face,  as  if  he  no  longer  cared  for  all  the  troubles that vexed them.  Suddenly  on  the  path  ahead  appeared  some  white  deer,  a  hind  and  fawns  as  snowy  white  as  the  hart  had  been  dark.  They  glimmered  in  the  shadows.  Before  Thorin  could  cry  out  three  of  the  dwarves  had  leaped  to  their  feet  and  loosed  off  arrows  from  their  bows."
}