{
  "id": "fe24b122df8211bba230d659b4e2038b9d223a8c",
  "text": "  * 2-V2 *  Something wet touched Harry's hand and he jumped backward, crushing Rods foot, but it was only Fang's nose.  \"What d'you reckon?\" Harry said to Ron, whose eyes he could just make out, reflecting the light from his wand.  \"We've come this far,\" said Ron.  So they followed the darting shadows of the spiders into the trees. They couldn't move very quickly now; there were tree roots and stumps in their way, barely visible in the near blackness. Harry could feel Fang's hot breath on his hand. More than once, they had to stop, so that Harry could crouch down and find the spiders in the wandlight.  They walked for what seemed like at least half an hour, their robes snagging on low-slung branches and brambles. After a while, they noticed that the ground seemed to be sloping downward, though the trees were as thick as ever.  Then Fang suddenly let loose a great, echoing bark, making both Harry and Ron jump out of their skins.  \"What?\" said Ron loudly, looking around into the pitch-dark, and gripping Harry's elbow very hard.  \"There's something moving over there,\" Harry breathed. \"Listen ... sounds like something big ......  They listened. Some distance to their right, the something big was snapping branches as it carved a path through the trees.  \"Oh, no,\" said Ron. \"Oh, no, oh, no, oh -\"  \"Shut up,\" said Harry frantically. \"It'll hear you.\"  \"Hear me?\" said Ron in an unnaturally high voice. \"It's already heard Fang!\"  The darkness seemed to be pressing on their eyeballs as they  * 273*  stood, terrified, waiting. There was a strange rumbling noise and then silence.  \"What d'you think it's doing?\" said Harry.  \"Probably getting ready to pounce,\" said Ron.  They waited, shivering, hardly daring to move.  \"D'you think it's gone?\" Harry whispered.  \"Dunno -\"  Then, to their right, came a sudden blaze of light, so bright in the darkness that both of them flung up their hands to shield their eyes. Fang yelped and tried to run, but got lodged in a tangle of thorns and yelped even louder.  \"Harry!\" Ron shouted, his voice breaking with relief \"Harry, it's our car!\"  \"What?\"  \"Come on!\"  Harry blundered after Ron toward the light, stumbling and tripping, and a moment later they had emerged into a clearing.  Mr. Weasley's car was standing, empty, in the middle of a circle of thick trees under a roof of dense branches, its headlights ablaze. As Ron walked, open-mouthed, toward it, it moved slowly toward him, exactly like a large, turquoise dog greeting its owner.  \"It's been here all the time!\" said Ron delightedly, walking around the car. \"Look at it. The forest's turned it wild . . . .\"  The sides of the car were scratched and smeared with mud. Apparently it had taken to trundling around the forest on its own. Fang didn't seem at all keen on it; he kept close to Harry, who could feel him quivering. His breathing slowing down again, Harry stuffed his wand back into his robes.  *214*  \"And we thought it was going to attack us!\" said Ron, leaning against the car and patting it. \"I wondered where it had gone!\"  Harry squinted around on the floodlit ground for signs of more spiders, but they had all scuttled away from the glare of the headlights.  \"We've lost the trail,\" he said. \"C'mon, let's go and find them.\"  Ron didn't speak. He didn't move. His eyes were fixed on a point some ten feet above the forest floor, right behind Harry. His face was livid with terror.  Harry didn't even have time to turn around. There was a loud clicking noise and suddenly he felt something long and hairy seize him around the middle and lift him off the ground, so that he was hanging facedown. Struggling, terrified, he heard more clicking, and saw Ron's legs leave the ground, too, heard Fang whimpering and howling - next moment, he was being swept away into the dark trees.  Head hanging, Harry saw that what had hold of him was marching on six immensely long, hairy legs, the front two clutching him tightly below a pair of shining black pincers. Behind him, he could hear another of the creatures, no doubt carrying Ron. They were moving into the very heart of the forest. Harry could hear Fang fighting to free himself from a third monster, whining loudly, but Harry couldn't have yelled even if he had wanted to; he seemed to have left his voice back with the car in the clearing.  He never knew how long he was in the creature's clutches; he only knew that the darkness suddenly lifted enough for him to see that the leaf-strewn ground was now swarming with spiders. Craning his neck sideways, he realized that they had reached the ridge of  *21$*  a vast hollow, a hollow that had been cleared of trees, so that the stars shone brightly onto the worst scene he had ever laid eyes on.  Spiders. Not tiny spiders like those surging over the leaves below. Spiders the size of carthorses, eight-eyed, eight-legged, black, hairy, gigantic. The massive specimen that was carrying Harry made its way down the steep slope toward a misty, domed web in the very center of the hollow, while its fellows closed in all around it, clicking their pincers excitedly at the sight of its load."
}