{
  "id": "fe9f99d3a8c7947317c3c376f59e17495621c535",
  "text": " \"I suppose you added the porcupine quills before taking the cauldron off the fire?\"  Neville whimpered as boils started to pop up all over his nose.  \"Take him up to the hospital wing,\" Snape spat at Seamus. Then he rounded on Harry and Ron, who had been working next to Neville.  \"You -- Potter -- why didn't you tell him not to add the quills? Thought he'd make you look good if he got it wrong, did you? That's another point you've lost for Gryffindor.\"  This was so unfair that Harry opened his mouth to argue, but Ron kicked him behind their cauldron.  \"Doi* push it,\" he muttered, \"I've heard Snape can turn very nasty.\"  As they climbed the steps out of the dungeon an hour later, Harry's mind was racing and his spirits were low. He'd lost two points for Gryffindor in his very first week -- why did Snape hate him so much? \"Cheer up,\" said Ron, \"Snape's always taking points off Fred and George. Can I come and meet Hagrid with you?\"  At five to three they left the castle and made their way across the grounds. Hagrid lived in a small wooden house on the edge of the forbidden forest. A crossbow and a pair of galoshes were outside the front door.  When Harry knocked they heard a frantic scrabbling from inside and several booming barks. Then Hagrid's voice rang out, saying, \"Back, Fang -- back.\"  Hagrid's big, hairy face appeared in the crack as he pulled the door open.  \"Hang on,\" he said. \"Back, Fang.\"  He let them in, struggling to keep a hold on the collar of an enormous black boarhound.  There was only one room inside. Hams and pheasants were hanging from the ceiling, a copper kettle was boiling on the open fire, and in the corner stood a massive bed with a patchwork quilt over it.  \"Make yerselves at home,\" said Hagrid, letting go of Fang, who bounded straight at Ron and started licking his ears. Like Hagrid, Fang was clearly not as fierce as he looked.  \"This is Ron,\" Harry told Hagrid, who was pouring boiling water into a large teapot and putting rock cakes onto a plate.  \"Another Weasley, eh?\" said Hagrid, glancing at Ron's freckles. I spent half me life chasin' yer twin brothers away from the forest.\"  The rock cakes were shapeless lumps with raisins that almost broke their teeth, but Harry and Ron pretended to be enjoying them as they told Hagrid all about their first -lessons. Fang rested his head on Harry's knee and drooled all over his robes.  Harry and Ron were delighted to hear Hagrid call Fitch \"that old git.\"  \"An' as fer that cat, Mrs. Norris, I'd like ter introduce her to Fang sometime. D'yeh know, every time I go up ter the school, she follows me everywhere? Can't get rid of her -- Fitch puts her up to it.\"  Harry told Hagrid about Snape's lesson. Hagrid, like Ron, told Harry not to worry about it, that Snape liked hardly any of the students.  \"But he seemed to really hate me.\"  \"Rubbish!\" said Hagrid. \"Why should he?\"  Yet Harry couldn't help thinking that Hagrid didn't quite meet his eyes when he said that.  \"How's yer brother Charlie?\" Hagrid asked Ron. \"I liked him a lot -- great with animals.\"  Harry wondered if Hagrid had changed the subject on purpose. While Ron told Hagrid all about Charlie's work with dragons, Harry picked up a piece of paper that was lying on the table under the tea cozy. It was a cutting from the Daily Prophet:  GRINGOTTS BREAK-IN LATEST  Investigations continue into the break-in at Gringotts on 31 July, widely believed to be the work of Dark wizards or witches unknown.  Gringotts goblins today insisted that nothing had been taken. The vault that was searched had in fact been emptied the same day.  \"But we're not telling you what was in there, so keep your noses out if you know what's good for you,\" said a Gringotts spokesgoblin this afternoon.  Harry remembered Ron telling him on the train that someone had tried to rob Gringotts, but Ron hadn't mentioned the date.  \"Hagrid!\" said Harry, \"that Gringotts break-in happened on my birthday! It might've been happening while we were there!\"  There was no doubt about it, Hagrid definitely didn't meet Harry's eyes this time. He grunted and offered him another rock cake. Harry read the story again. The vault that was searched had in fact been emptied earlier that same day. Hagrid had emptied vault seven hundred and thirteen, if you could call it emptying, taking out that grubby little package. Had that been what the thieves were looking for?  As Harry and Ron walked back to the castle for dinner, their pockets weighed down with rock cakes they'd been too polite to refuse, Harry thought that none of the lessons he'd had so far had given him as much to think about as tea with Hagrid. Had Hagrid collected that package just in time? Where was it now? And did Hagrid know something about Snape that he didn't want to tell Harry?   CHAPTER NINE  THE MIDNIGHT DUEL  Harry had never believed he would meet a boy he hated more than Dudley, but that was before he met Draco Malfoy. Still, first-year Gryffindors only had Potions with the Slytherins, so they didn't have to put up with Malfoy much."
}