{
  "id": "ffec90c4068947f73960ffa7e9744567900ebfd1",
  "text": " Make them think twice, that would.  And I must say it put me aback a bit when I saw you.'       Then the hobbits suddenly realized  that people had looked at them with  amazement  not out of surprise at their return so much as in wonder at their  gear.  They  themselves  had  become  so  used to warfare and  to  riding in  well-arrayed  companies  that they had quite  forgotten that the bright mail  peeping from  under their cloaks, and the helms of Gondor and the Mark,  and  the  fair devices  on  their  shields,  would seem  outlandish in  their own  country. And Gandalf, too, was now  riding on his tall grey  horse, all clad  in white with a great mantle of blue and silver over all, and the long sword  Glamdring at his side.       Gandalf  laughed. 'Well,  well,'  he  said, 'if they are afraid of just  five of us, then we have met worse enemies on our travels. But  at any  rate  they will give you peace at night while we stay.'       'How long will that be?' said Butterbur.  'I'll  not deny we  should be  glad to have you about for a bit. You see, we're not used to  such troubles;  and  the  Rangers have all gone  away,  folk tell  me.  I don't  think we've  rightly understood  till  now what  they did for us. For there's  been worse  than robbers about.  Wolves  were howling round  the fences last winter. And  there's  dark shapes in the woods, dreadful  things that it makes the  blood  run cold to think of. It's been very disturbing, if you  understand me.'       'I expect it has,' said Gandalf. 'Nearly all  lands have been disturbed  these days, very disturbed. But cheer up,  Barliman!  You  have been  on the  edge  of very great troubles, and I  am only glad to hear that  you have not  been  deeper in.  But  better times are  coming. Maybe,  better than any you   remember. The Rangers have returned. We came back with them.  And there is  a  king again, Barliman. He will soon be turning his mind this way.   ####-     'Then the Greenway will  be opened again , and his  messengers will come  north,  and  there will  be comings and  goings, and the evil things will be  driven out of  the waste-lands. Indeed the  waste in  time will be  waste no  longer,  and  there   will  be  people  and  fields  where  once  ther e  was  wilderness.'       Mr. Butterbur shook his head. 'If there's a few decent respectable folk   on the roads, that  won't do no harm,' he said. 'But  we  don't want no more  rabble and ruffians. And  we don't want no outsiders at Bree, nor  near Bree  at all. We want to be let alone.  I  don't want a  whole  crowd o' strangers  camping here and settling there and tearing up the wild country.'       'You will be let  alone, Barliman,' said Gandalf. 'There is room enough  for realms between Isen and Greyflood, or  along the shore lands south of the   Brandywine, without any one living within many days' ride of  Bree. And many  folk used to dwell away north, a hundred miles or more from here, at the far   end of the Greenway: on the North Downs or by Lake Evendim.'       'Up away by Deadmen's Dike?' said Butterbur, looking even more dubious.   'That's haunted land, they say. None but a robber would go there.'       'The Rangers go  there,' said Gandalf.  'Deadmen's Dike, you say. So it  has  been called for long years;  but its right  name, Barliman, is  Fornost   Erain, Norbury of the Kings. And the King will come there again one day; and  then you'll have some fair folk riding through.'       'Well,  that sounds more hopeful, I'll  allow,' said Butterbur. 'And it  will be good for  business, no doubt. So long as he lets Bree alone.'       'He will,' said Gandalf. 'He knows it and loves it.'       'Does he now?' said Butterbur looking puzzled. 'Though I'm sure I don't  know  why  he  should, sitting  in his  big  chair up in his  great   castle,  hundreds  of miles away. And drinking wine out of a  golden cup, I shouldn't  wonder.  What's  The Pony to him, or mugs  o'  beer? Not  but what my beer's  good, Gandalf. It's been uncommon good, since you came in the autumn of last   year and put a good word on it. And that's been a comfort in trouble, I will  say.'       'Ah!' said Sam. 'But he says your beer is always good.'       'He says?'       'Of course he does. He's Strider. The chief of the Rangers. Haven't you   got that into your head yet?'       It went in at last, and  Butterbur's face was  a study in  wonder.  The  eyes in his broad face grew round, and his mouth opened wide, and he gasped.   ####-'Strider!' he exclaimed when he  got back his breath.  'Him with a crown and  all and a golden cup! Well, what are we coming to?'       'Better times, for Bree at any rate,' said Gandalf.        'I hope so, I'm sure,' said Butterbur. 'Well, this  has been the nicest   chat I've  had  in  a month of  Mondays. And  I'll not deny that I'll  sleep  easier  tonight and with a lighter heart. You've given  me a powerful lot to  think over, but  I'll put that off until tomorrow. I'm  for bed, and I've no  doubt  you'll be glad  of your beds too."
}