{
  "id": "004b658836d0d9f7ac222ab5533d455967032ada",
  "text": " \"If I was ter -- er -- speed things up a bit, would yeh mind not mentionin' it at Hogwarts?\"  \"Of course not,\" said Harry, eager to see more magic. Hagrid pulled out the pink umbrella again, tapped it twice on the side of the boat, and they sped off toward land.  \"Why would you be mad to try and rob Gringotts?\" Harry asked.  \"Spells -- enchantments,\" said Hagrid, unfolding his newspaper as he spoke. \"They say there's dragons guardin' the highsecurity vaults. And then yeh gotta find yer way -- Gringotts is hundreds of miles under London, see. Deep under the Underground. Yeh'd die of hunger tryin' ter get out, even if yeh did manage ter get yer hands on summat.\"  Harry sat and thought about this while Hagrid read his newspaper, the Daily Prophet. Harry had learned from Uncle Vernon that people liked to be left alone while they did this, but it was very difficult, he'd never had so many questions in his life.  \"Ministry o' Magic messin' things up as usual,\" Hagrid muttered, turning the page.  \"There's a Ministry of Magic?\" Harry asked, before he could stop himself.  \"'Course,\" said Hagrid. \"They wanted Dumbledore fer Minister, 0 ' course, but he'd never leave Hogwarts, so old Cornelius Fudge got the job. Bungler if ever there was one. So he pelts Dumbledore with owls every morning, askin' fer advice.\"  \"But what does a Ministry of Magic do?\"  \"Well, their main job is to keep it from the Muggles that there's still witches an' wizards up an' down the country.\"  \"Why?\"  \"Why? Blimey, Harry, everyone'd be wantin' magic solutions to their problems. Nah, we're best left alone.\"  At this moment the boat bumped gently into the harbor wall. Hagrid folded up his newspaper, and they clambered up the stone steps onto the street.  Passersby stared a lot at Hagrid as they walked through the little town to the station. Harry couldn't blame them. Not only was Hagrid twice as tall as anyone else, he kept pointing at perfectly ordinary things like parking meters and saying loudly, \"See that, Harry? Things these Muggles dream up, eh?\"  \"Hagrid,\" said Harry, panting a bit as he ran to keep up, \"did you say there are dragons at Gringotts?\"  \"Well, so they say,\" said Hagrid. \"Crikey, I'd like a dragon.\"  \"You'd like one?\"  \"Wanted one ever since I was a kid -- here we go.\"  They had reached the station. There was a train to London in five minutes' time. Hagrid, who didn't understand \"Muggle money,\" as he called it, gave the bills to Harry so he could buy their tickets.  People stared more than ever on the train. Hagrid took up two seats and sat knitting what looked like a canary-yellow circus tent.  \"Still got yer letter, Harry?\" he asked as he counted stitches. Harry took the parchment envelope out of his pocket.  \"Good,\" said Hagrid. \"There's a list there of everything yeh need.\"  Harry unfolded a second piece of paper he hadn't noticed the night before, and read:  HOGWARTS SCHOOL of WITCHCRAFT and WIZARDRY  UNIFORM  First-year students will require:  1. Three sets of plain work robes (black)  2. One plain pointed hat (black) for day wear  3. One pair of protective gloves (dragon hide or similar)  4. One winter cloak (black, silver fastenings)  Please note that all pupils' clothes should carry name tags  COURSE BOOKS  All students should have a copy of each of the following:  The Standard Book of Spells (Grade 1) by Miranda Goshawk  A History of Magic by Bathilda Bagshot  Magical Theory by Adalbert Waffling  A Beginners' Guide to Transfiguration by Emetic Switch  One Thousand Magical Herbs and Fungi by Phyllida Spore  Magical Drafts and Potions by Arsenius Jigger  Fantastic Beasts and Where to Find Them by Newt Scamander  The Dark Forces: A Guide to Self-Protection by Quentin Trimble  OTHER EQUIPMENT  wand cauldron (pewter, standard size 2) set  glass or crystal phials  telescope set  brass scales  Students may also bring an owl OR a cat OR a toad  PARENTS ARE REMINDED THAT FIRST YEARS ARE NOT ALLOWED THEIR OWN BROOMSTICKS  \"Can we buy all this in London?\" Harry wondered aloud.  \"If yeh know where to go,\" said Hagrid.  Harry had never been to London before. Although Hagrid seemed to know where he was going, he was obviously not used to getting there in an ordinary way. He got stuck in the ticket barrier on the Underground, and complained loudly that the seats were too small and the trains too slow.  \"I don't know how the Muggles manage without magic,\" he said as they climbed a broken-down escalator that led up to a bustling road lined with shops.  Hagrid was so huge that he parted the crowd easily; all Harry had to do was keep close behind him. They passed book shops and music stores, hamburger restaurants and cinemas, but nowhere that looked as if it could sell you a magic wand. This was just an ordinary street full of ordinary people. Could there really be piles of wizard gold buried miles beneath them? Were there really shops that sold spell books and broomsticks? Might this not all be some huge joke that the Dursleys had cooked up? If Harry hadn't known that the Dursleys had no sense of humor, he might have thought so; yet somehow, even though everything Hagrid had told him so far was unbelievable, Harry couldn't help trusting him."
}