{
  "id": "01695cf20a3372ceec50bbd58992366cac0e49e8",
  "text": " Yet the air of the valley was heavy  with fear and enmity. Then they  broke the evil bridge and set red flames in the noisome fields and departed.       The  day  after, being the  third day  since they  set  out  from Minas  Tirith, the army  began its  northward  march along  the  road.  It was some  hundred  miles by that  way  from the  Cross-roads to the Morannon, and what  might befall  them before they  came so  far  none knew They went openly but  heedfully, with mounted scouts before them  on the road, and others on  foot  upon either  side, especially  on  the  eastward flank;  for there lay  dark  thickets, and  a tumbled  land of rocky ghylls  and crags,  behind which the  long  grim slopes of the Ephel D®ath clambered up. The weather of  the world  remained fair and the wind held in the west, but nothing could waft away the  glooms  and the sad  mists  that clung  about  the Mountains of  Shadow; and  behind them at whiles great smokes would arise and hover in the upper winds.        Ever and anon Gandalf let blow the trumpets, and the heralds would cry:   \"The  Lords of Gondor are come! Let  all leave this land  or yield them up!'  But Imrahil said: 'Say not  The Lords of Gondor.  Say The King Elessar.  For  that is true, even though he has  not yet  sat  upon the throne; and it will  give the Enemy more thought, if  the  heralds use that name.' And thereafter   thrice a day the heralds proclaimed the coming of the King Elessar. But none  answered the challenge.       Nonetheless, though they marched in seeming  peace,  the hearts  of all  the army, from the highest to the lowest, were downcast, and with every mile  that they went  north foreboding  of evil grew heavier  on them. It was near   ####-the  end of the second day of their  march  from  the Cross-roads  that they  first met any offer  of battle.  For a strong force  of Orcs and Easterlings  attempted to  take their leading companies in an ambush; and that was in the  very place where Faramir  had waylaid the men of Harad, and the road went in  a deep cutting through an out-thrust of the eastward hills. But the Captains  of the West were well warned by their scouts, skilled men from Henneth  Annyn  led by Mablung; and so the ambush was itself trapped. For horsemen went  wide  about westward and  came  up on the flank of  the enemy and from behind, and  they were destroyed or driven east into the hills.       But  the victory did  little to  enhearten the captains.  'It  is but a   feint,' said Aragorn; 'and its chief purpose, I  deem, was  rather to draw us  on by a false guess of our Enemy's weakness than to  do us much hurt,  yet.'  And from that evening onward the Nazgyl came and followed every move  of  the  army. They still  flew  high and out  of sight of all  save Legolas, and  yet  their presence could  be felt, as a deepening of shadow and a dimming of the   sun; and though the Ringwraiths did not  yet stoop low upon  their foes  and   were silent, uttering no cry, the dread of them could not be shaken off.       So time and  the hopeless  journey wore away. Upon the fourth day  from   the Cross-roads and the sixth from Minas Tirith they came at last to the end  of  the living lands,  and began to pass into the desolation that lay before  the gates of the Pass of Cirith Gorgor; and  they could  descry the  marshes  and the desert that  stretched north and west to  the Emyn Muil. So desolate  were those places and so  deep  the horror that lay on them that some of the  host were unmanned, and they could neither walk nor ride further north.       Aragorn looked  at them,  and there was pity  in his  eyes  rather than  wrath;  for  these were young men from Rohan,  from Westfold  far  away,  or   husbandmen  from  Lossarnach, and to them Mordor had been  from childhood   a  name  of evil,  and yet  unreal, a  legend that had no part in  their simple  life; and now  they walked like men in a  hideous dream made true,  and they  understood not this war nor why fate should lead them to such a pass.        'Go!' said Aragorn. 'But  keep what honour you may, and do not run! And  there is a task which you may attempt and so be not wholly shamed. Take your  way  south-west till you come to Cair Andros, and  if that is still  held by    ####-enemies, as I think, then re-take it, if you can; and hold it to the last in  defence of Gondor and Rohan!'       Then some being shamed by  his mercy  overcame their fear and  went on,  and the others took new hope, hearing of a manful  deed within their measure  that  they  could turn to, and they  departed.  And so,  since many men  had  already  been left  at the Cross-roads,  it was with less than six thousands  that the Captains of the West came at last  to challenge the  Black Gate and  the might of Mordor.       They advanced  now slowly, expecting at every hour some answer to their  challenge, and they drew together, since it was but waste of men to send out  scouts or small parties from the main host."
}