{
  "id": "03a95eb5ac2ae160edc5982aff0ebabbb0bc4aca",
  "text": " He was quicker, Catelyn saw; the knight’s silvered sword never came near to touching him, but his own ugly grey blade hacked a notch from Ser Vardis’s shoulder plate.  The brief flurry of fighting ended as swiftly as it had begun when Bronn sidestepped and slid behind the statue of the weeping woman. Ser Vardis lunged at where he had been, striking a spark off the pale marble of Alyssa’s thigh.   They’re not fighting good, Mother,  the Lord of the Eyrie complained.  I want them to fight.    They will, sweet baby,  his mother soothed him.  The sellsword can’t run all day.   Some of the lords on Lysa’s terrace were making wry jests as they refilled their wine cups, but across the garden, Tyrion Lannister’s mismatched eyes watched the champions dance as if there were nothing else in the world.  Bronn came out from behind the statue hard and fast, still moving left, aiming a two-handed cut at the knight’s unshielded right side. Ser Vardis blocked, but clumsily, and the sellsword’s blade flashed upward at his head. Metal rang, and a falcon’s wing collapsed with a crunch. Ser Vardis took a half step back to brace himself, raised his shield. Oak chips flew as Bronn’s sword hacked at the wooden wall. The sellsword stepped left again, away from the shield, and caught Ser Vardis across the stomach, the razor edge of his blade leaving a bright gash when it bit into the knight’s plate.  Ser Vardis drove forward off his back foot, his own silver blade descending in a savage arc. Bronn slammed it aside and danced away. The knight crashed into the weeping woman, rocking her on her plinth. Staggered, he stepped backward, his head turning this way and that as he searched for his foe. The slit visor of his helm narrowed his vision.   Behind you, ser!  Lord Hunter shouted, too late. Bronn brought his sword down with both hands, catching Ser Vardis in the elbow of his sword arm. The thin lobstered metal that protected the joint crunched. The knight grunted, turning, wrenching his weapon up. This time Bronn stood his ground. The swords flew at each other, and their steel song filled the garden and rang off the white towers of the Eyrie.   Ser Vardis is hurt,  Ser Rodrik said, his voice grave.  Catelyn did not need to be told; she had eyes, she could see the bright finger of blood running along the knight’s forearm, the wetness inside the elbow joint. Every parry was a little slower and a little lower than the one before. Ser Vardis turned his side to his foe, trying to use his shield to block instead, but Bronn slid around him, quick as a cat. The sellsword seemed to be getting stronger. His cuts were leaving their marks now. Deep shiny gashes gleamed all over the knight’s armor, on his right thigh, his beaked visor, crossing on his breastplate, a long one along the front of his gorget. The moon-and-falcon rondel over Ser Vardis’s right arm was sheared clean in half, hanging by its strap. They could hear his labored breath, rattling through the air holes in his visor.  Blind with arrogance as they were, even the knights and lords of the Vale could see what was happening below them, yet her sister could not.  Enough, Ser Vardis!  Lady Lysa called down.  Finish him now, my baby is growing tired.   And it must be said of Ser Vardis Egen that he was true to his lady’s command, even to the last. One moment he was reeling backward, half-crouched behind his scarred shield; the next he charged. The sudden bull rush caught Bronn off balance. Ser Vardis crashed into him and slammed the lip of his shield into the sellsword’s face. Almost, almost, Bronn lost his feet… he staggered back, tripped over a rock, and caught hold of the weeping woman to keep his balance. Throwing aside his shield, Ser Vardis lurched after him, using both hands to raise his sword. His right arm was blood from elbow to fingers now, yet his last desperate blow would have opened Bronn from neck to navel… if the sellsword had stood to receive it.  But Bronn jerked back. Jon Arryn’s beautiful engraved silver sword glanced off the marble elbow of the weeping woman and snapped clean a third of the way up the blade. Bronn put his shoulder into the statue’s back. The weathered likeness of Alyssa Arryn tottered and fell with a great crash, and Ser Vardis Egen went down beneath her.  Bronn was on him in a heartbeat, kicking what was left of his shattered rondel aside to expose the weak spot between arm and breastplate. Ser Vardis was lying on his side, pinned beneath the broken torso of the weeping woman. Catelyn heard the knight groan as the sellsword lifted his blade with both hands and drove it down and in with all his weight behind it, under the arm and through the ribs. Ser Vardis Egen shuddered and lay still.  Silence hung over the Eyrie. Bronn yanked off his halfhelm and let it fall to the grass. His lip was smashed and bloody where the shield had caught him, and his coal-black hair was soaked with sweat. He spit out a broken tooth.   Is it over, Mother?  the Lord of the Eyrie asked."
}