{
  "id": "04f026b711aeea22b399068fcec3860d6cfeb4f9",
  "text": "  No horn was blown, my lord, or my rangers would have heard it. I do not have sufficient men to mount as many patrols as I should like… and since Benjen was lost, we have stayed closer to the Wall than we were wont to do before, by your own command.   The Old Bear grunted.  Yes. Well. Be that as it may.  He made an impatient gesture.  Tell me how they died.   Squatting beside the dead man he had named Jafer Flowers, Ser Jaremy grasped his head by the scalp. The hair came out between his fingers, brittle as straw. The knight cursed and shoved at the face with the heel of his hand. A great gash in the side of the corpse’s neck opened like a mouth, crusted with dried blood. Only a few ropes of pale tendon still attached the head to the neck.  This was done with an axe.    Aye,  muttered Dywen, the old forester.  Belike the axe that Othor carried, m’lord.   Jon could feel his breakfast churning in his belly, but he pressed his lips together and made himself look at the second body. Othor had been a big ugly man, and he made a big ugly corpse. No axe was in evidence. Jon remembered Othor; he had been the one bellowing the bawdy song as the rangers rode out. His singing days were done. His flesh was blanched white as milk, everywhere but his hands. His hands were black like Jafer’s. Blossoms of hard cracked blood decorated the mortal wounds that covered him like a rash, breast and groin and throat. Yet his eyes were still open. They stared up at the sky, blue as sapphires.  Ser Jaremy stood.  The wildlings have axes too.   Mormont rounded on him.  So you believe this is Mance Rayder’s work? This close to the Wall?    Who else, my lord?   Jon could have told him. He knew, they all knew, yet no man of them would say the words. The Others are only a story, a tale to make children shiver. If they ever lived at all, they are gone eight thousand years. Even the thought made him feel foolish; he was a man grown now, a black brother of the Night’s Watch, not the boy who’d once sat at Old Nan’s feet with Bran and Robb and Arya.  Yet Lord Commander Mormont gave a snort.  If Ben Stark had come under wildling attack a half day’s ride from Castle Black, he would have returned for more men, chased the killers through all seven hells and brought me back their heads.    Unless he was slain as well,  Ser Jaremy insisted.  The words hurt, even now. It had been so long, it seemed folly to cling to the hope that Ben Stark was still alive, but Jon Snow was nothing if not stubborn.   It has been close on half a year since Benjen left us, my lord,  Ser Jaremy went on.  The forest is vast. The wildlings might have fallen on him anywhere. I’d wager these two were the last survivors of his party, on their way back to us… but the enemy caught them before they could reach the safety of the Wall. The corpses are still fresh, these men cannot have been dead more than a day…    No,  Samwell Tarly squeaked.  Jon was startled. Sam’s nervous, high-pitched voice was the last he would have expected to hear. The fat boy was frightened of the officers, and Ser Jaremy was not known for his patience.   I did not ask for your views, boy,  Rykker said coldly.   Let him speak, ser,  Jon blurted.  Mormont’s eyes flicked from Sam to Jon and back again.  If the lad has something to say, I’ll hear him out. Come closer, boy. We can’t see you behind those horses.   Sam edged past Jon and the garrons, sweating profusely.  My lord, it… it can’t be a day or… look… the blood…    Yes?  Mormont growled impatiently.  Blood, what of it?    He soils his smallclothes at the sight of it,  Chett shouted out, and the rangers laughed.  Sam mopped at the sweat on his brow.  You… you can see where Ghost… Jon’s direwolf… you can see where he tore off that man’s hand, and yet… the stump hasn’t bled, look…  He waved a hand.  My father… L-lord Randyll, he, he made me watch him dress animals sometimes, when… after…  Sam shook his head from side to side, his chins quivering. Now that he had looked at the bodies, he could not seem to look away.  A fresh kill… the blood would still flow, my lords. Later… later it would be clotted, like a… a jelly, thick and… and…  He looked as though he was going to be sick.  This man… look at the wrist, it’s all… crusty… dry… like…   Jon saw at once what Sam meant. He could see the torn veins in the dead man’s wrist, iron worms in the pale flesh. His blood was a black dust. Yet Jaremy Rykker was unconvinced.  If they’d been dead much longer than a day, they’d be ripe by now, boy. They don’t even smell.   Dywen, the gnarled old forester who liked to boast that he could smell snow coming on, sidled closer to the corpses and took a whiff.  Well, they’re no pansy flowers, but… m’lord has the truth of it. There’s no corpse stink.    They… they aren’t rotting.  Sam pointed, his fat finger shaking only a little.  Look, there’s… there’s no maggots or… or… worms or anything… they’ve been lying here in the woods, but they… they haven’t been chewed or eaten by animals… only Ghost… otherwise they’re… they’re…    Untouched,  Jon said softly."
}