{
  "id": "07aee5b58173f7d1a4c848dec9bf4b16fac2d3d8",
  "text": "      ####-<h4>Chapter 13</h4> <br>   Not at Home     In  the  meanwhile,  the  dwarves  sat  in  darkness,  and  utter  silence  fell  about  them.  Little  they  ate  and  little  they  spoke.  They  could  not  count  the  passing  of  time; and  they  scarcely dared  to move,  for  the whisper of  their voices echoed and  rustled in the tunnel. If they dozed, they woke still to darkness and to silence going  on unbroken. At last after days and days of waiting, as it seemed, when they were  becoming  choked  and  dazed  for  want  of  air,  they  could  bear  it  no  longer.  They  would  almost  have  welcomed  sounds  from  below  of  the  dragon's  return.  In  the  silence  they  feared  some  cunning  devilry  of  his,  but  they  could  not  sit  there  for  ever.  Thorin spoke: \"Let us  try  the door!\" he said. \"I must feel  the wind on my face  soon  or  die.  I  think  I  would  rather  be  smashed  by  Smaug  in  the  open  than  suffocate in here!\"  So several of the dwarves got up and groped back to where the door had been.  But  they  found  that  the  upper  end  of  the  tunnel  had  been  shattered  and  blocked  with broken  rock. Neither key nor  the magic  it had once obeyed would ever  open  that door again.  \"We are trapped!\" they groaned. \"This is the end. We shall die here.\"  But  somehow,  just  when  the  dwarves  were  most  despairing,  Bilbo  felt  a  strange  lightening  of  the  heart,  as  if  a  heavy  weight  had  gone  from  under  his  waistcoat.  \"Come, come!\" he  said.  \"While  there's  life  there's hope!\" as my  father used  to  say,  and  'Third  time  pays  for  all.'  I  am  going  down  the  tunnel  once  again.  I  have  been  that  way  twice,  when  I  knew  there  was  a  dragon  at  the  other  end,  so  I  will  risk  a  third  visit  when  I  am  no  longer  sure.  Anyway  the  only  way  out  is  down.  And I think time you had better all come with me.\"  In desperation they agreed, and Thorin was the first go forward by Bilbo's side.  \"Now  do  be  careful!\"  whispered  the  hobbit,  \"and  quiet  as  you  can  be! There  may be no Smaug at the bottom but then again there may be. Don't let us take any  unnecessary risks!\"  Down,  down  they  went.  The  dwarves  could  not,  course,  compare  with  the  hobbit  in  real  stealth,  and  the made  a  deal  of  puffing  and  shuffling which  echoes  magnified alarmingly; but  though every now and again Bilbo  in  fear  stopped and  listened,  not  a  sound  stirred  below  Near  the  bottom,  as  well  as  he  could  judge,   ####-Bilbo slipped on his ring and went ahead. But he did not need it: the darkness was  complete,  and  they were  all  invisible,  ring  or  no  ring.  In  fact  so  black was  it  that  the  hobbit  came  to  the  opening  unexpectedly,  put  his  hand  on  air,  stumbled  for  ward, and rolled headlong into the hall!  There he  lay face downwards on  the floor and did no dare  to get up, or hardly  even  to  breathe.  But  nothing  moved.  There  was  not  a  gleam  of  light-unless,  as  seemed to him, when at last he slowly raised his head, there was a pale white glint,  above him and far off in the gloom. But certainly it was not a spark of dragon-fire,  though the wormstench was heavy in the place, and the taste of vapour was on his  tongue.  At length Mr. Baggins could bear it no longer. \"Come found you, Smaug, you  worm!\"  he  squeaked  aloud.  \"Stop  playing  hide-and-seek!  Give  me  a  light,  and  then eat me if you can catch me!\"  Faint echoes ran round the unseen hall, but there was no answer. Bilbo got up,  and found that he did not know in what direction to turn.  \"Now  I  wonder  what  on  earth  Smaug  is  playing  at,\"  he  said.  \"He  is  not  at  home  today  (or  tonight, or whatever it is), I do believe. If Oin and Gloin have not  lost  their  time  tinder-boxes,  perhaps  we  can  make  a  little  light,  and  have  a  look  round before the luck turns.\"  \"Light!\" he cried. \"Can anybody make a light?\"  The  dwarves,  of  course, were  very alarmed when Bilbo fell forward down the  step with a bump into the hall, and they sat huddled just where he had left them at  the end the tunnel.  \"Sh!  sh!\"  they  hissed,  when  they  heard  his  voice:  and  though  that  helped  the  hobbit  to  find  out where  they  were, was  some  time  before  he  could  get  anything  else out of  them. But  in  the end, when Bilbo actually began  to stamp  in  the  floor,  and  screamed  out  light!'  at  the  top  of  his  thrill  voice,  Thorin  gave  way,  and  Oin  and Gloin were sent back  to  their bundles  at the top of the tunnel. After a while a  twinkling  gleam  showed  them  returning,  in  with  a  small  pine-torch  alight  in  his  hand,  and  Gloin  with  a  bundle  of  others  under  his  arm.  Quickly  Bilbo  trotted  to  the  door  and  took  the  torch;  but  he  could  not  persuade  the  dwarves  to  light  the  others  or  to  come  and  join  him  yet.  As  Thorin  carefully  explained,  Mr."
}