{
  "id": "0868b95fc88e6e8b963f4f4c2823fe38a803bb95",
  "text": " Lowborn, no more than a hedge knight, Kettleblack was utterly dependent on Cersei for his advancement, which was doubtless why she’d picked him.  Ser Osmund is as loyal as he is brave,  she’d told Joffrey when she put forward his name. It was true, unfortunately. The good Ser Osmund had been selling her secrets to Bronn since the day she’d hired him, but Tyrion could scarcely tell her that.  He supposed he ought not complain. The appointment gave him another ear close to the king, unbeknownst to his sister. And even if Ser Osmund proved an utter craven, he would be no worse than Ser Boros Blount, currently residing in a dungeon at Rosby. Ser Boros had been escorting Tommen and Lord Gyles when Ser Jacelyn Bywater and his gold cloaks had surprised them, and had yielded up his charge with an alacrity that would have enraged old Ser Barristan Selmy as much as it did Cersei; a knight of the Kingsguard was supposed to die in defense of the king and royal family. His sister had insisted that Joffrey strip Blount of his white cloak on the grounds of treason and cowardice. And now she replaces him with another man just as hollow.  The praying, vowing, and anointing seemed to take most of the morning. Tyrion’s legs soon began to ache. He shifted his weight from one foot to the other, restless. Lady Tanda stood several rows up, he saw, but her daughter was not with her. He had been half hoping to catch a glimpse of Shae. Varys said she was doing well, but he would prefer to see for himself.   Better a lady’s maid than a pot girl,  Shae had said when Tyrion told her the eunuch’s scheme.  Can I take my belt of silver flowers and my gold collar with the black diamonds you said looked like my eyes? I won’t wear them if you say I shouldn’t.   Loath as he was to disappoint her, Tyrion had to point out that while Lady Tanda was by no means a clever woman, even she might wonder if her daughter’s bedmaid seemed to own more jewelry than her daughter.  Choose two or three dresses, no more,  he commanded her.  Good wool, no silk, no samite, and no fur. The rest I’ll keep in my own chambers for when you visit me.  It was not the answer Shae had wanted, but at least she was safe.  When the investiture was finally done Joffrey marched out between Ser Balon and Ser Osmund in their new white cloaks, while Tyrion lingered for a word with the new High Septon (who was his choice, and wise enough to know who put the honey on his bread).  I want the gods on our side,  Tyrion told him bluntly.  Tell them that Stannis has vowed to burn the Great Sept of Baelor.    Is it true, my lord?  asked the High Septon, a small, shrewd man with a wispy white beard and wizened face.  Tyrion shrugged.  It may be. Stannis burned the godswood at Storm’s End as an offering to the Lord of Light. If he’d offend the old gods, why should he spare the new? Tell them that. Tell them that any man who thinks to give aid to the usurper betrays the gods as well as his rightful king.    I shall, my lord. And I shall command them to pray for the health of the king and his Hand as well.   Hallyne the Pyromancer was waiting on him when Tyrion returned to his solar, and Maester Frenken had brought messages. He let the alchemist wait a little longer while he read what the ravens had brought him. There was an old letter from Doran Martell, warning him that Storm’s End had fallen, and a much more intriguing one from Balon Greyjoy on Pyke, who styled himself King of the Isles and the North. He invited King Joffrey to send an envoy to the Iron Islands to fix the borders between their realms and discuss a possible alliance.  Tyrion read the letter three times and set it aside. Lord Balon’s longships would have been a great help against the fleet sailing up from Storm’s End, but they were thousands of leagues away on the wrong side of Westeros, and Tyrion was far from certain that he wanted to give away half the realm. Perhaps I should spill this one in Cersei’s lap, or take it to the council.  Only then did he admit Hallyne with the latest tallies from the alchemists.  This cannot be true,  said Tyrion as he pored over the ledgers.  Almost thirteen thousand jars? Do you take me for a fool? I’m not about to pay the king’s gold for empty jars and pots of sewage sealed with wax, I warn you.    No, no,  Hallyne squeaked,  the sums are accurate, I swear. We have been, hmmm, most fortunate, my lord Hand. Another cache of Lord Rossart’s was found, more than three hundred jars. Under the Dragonpit! Some whores have been using the ruins to entertain their patrons, and one of them fell through a patch of rotted floor into a cellar. When he felt the jars, he mistook them for wine. He was so drunk he broke the seal and drank some.    There was a prince who tried that once,  said Tyrion dryly.  I haven’t seen any dragons rising over the city, so it would seem it didn’t work this time either.  The Dragonpit atop the hill of Rhaenys had been abandoned for a century and a half. He supposed it was as good a place as any to store wildfire, and better than most, but it would have been nice if the late Lord Rossart had told someone."
}