{
  "id": "08d9d5b628f80b056c6d316af7aabb976354c167",
  "text": " A few feet away, a taller, leaner man in a leather shirt sewn with bronze scales stood frowning over a map, a two-handed greatsword slung across his back in a leather sheath. He was straight as a spear, all long wiry muscle, clean-shaved, bald, with a strong straight nose and deepset grey eyes. He might even have been comely if he’d had ears, but he had lost both along the way, whether to frostbite or some enemy’s knife Jon could not tell. Their lack made the man’s head seem narrow and pointed.  Both the white-bearded man and the bald one were warriors, that was plain to Jon at a glance. These two are more dangerous than Rattleshirt by far. He wondered which was Mance Rayder.      As he lay on the ground with the darkness around,  and the taste of his blood on his tongue,  His brothers knelt by him and prayed him a prayer,  and he smiled and he laughed and he sung,   Brothers, oh brothers, my days here are done,  the Dornishman’s taken my life,  But what does it matter, for all men must die,  and I’ve tasted the Dornishman’s wife!       As the last strains of  The Dornishman’s Wife  faded, the bald earless man glanced up from his map and scowled ferociously at Rattleshirt and Ygritte, with Jon between them.  What’s this?  he said.  A crow?    The black bastard what gutted Orell,  said Rattleshirt,  and a bloody warg as well.    You were to kill them all.    This one come over,  explained Ygritte.  He slew Qhorin Halfhand with his own hand.    This boy?  The earless man was angered by the news.  The Halfhand should have been mine. Do you have a name, crow?    Jon Snow, Your Grace.  He wondered whether he was expected to bend the knee as well.   Your Grace?  The earless man looked at the big white-bearded one.  You see. He takes me for a king.   The bearded man laughed so hard he sprayed bits of chicken everywhere. He rubbed the grease from his mouth with the back of a huge hand.  A blind boy, must be. Who ever heard of a king without ears? Why, his crown would fall straight down to his neck! Har!  He grinned at Jon, wiping his fingers clean on his breeches.  Close your beak, crow. Spin yourself around, might be you’d find who you’re looking for.   Jon turned.  The singer rose to his feet.  I’m Mance Rayder,  he said as he put aside the lute.  And you are Ned Stark’s bastard, the Snow of Winterfell.    Stunned, Jon stood speechless for a moment, before he recovered enough to say,  How… how could you know…    That’s a tale for later,  said Mance Rayder.  How did you like the song, lad?    Well enough. I’d heard it before.    But what does it matter, for all men must die,  the King-beyond-the-Wall said lightly,  and I’ve tasted the Dornishman’s wife. Tell me, does my Lord of Bones speak truly? Did you slay my old friend the Halffiand?    I did.  Though it was his doing more than mine.   The Shadow Tower will never again seem as fearsome,  the king said with sadness in his voice.  Qhorin was my enemy. But also my brother, once. So… shall I thank you for killing him, Jon Snow? Or curse you?  He gave Jon a mocking smile.  The King-beyond-the-Wall looked nothing like a king, nor even much a wildling. He was of middling height, slender, sharp-faced, with shrewd brown eyes and long brown hair that had gone mostly to grey. There was no crown on his head, no gold rings on his arms, no jewels at his throat, not even a gleam of silver. He wore wool and leather, and his only garment of note was his ragged black wool cloak, its long tears patched with faded red silk.   You ought to thank me for killing your enemy,  Jon said finally,  and curse me for killing your friend.    Har!  boomed the white-bearded man.  Well answered!    Agreed.  Mance Rayder beckoned Jon closer.  If you would join us, you’d best know us. The man you took for me is Styr, Magnar of Thenn. Magnar means ‘lord’ in the Old Tongue.  The earless man stared at Jon coldly as Mance turned to the white-bearded one.  Our ferocious chicken-eater here is my loyal Tormund. The woman—   Tormund rose to his feet.  Hold. You gave Styr his style, give me mine.   Mance Rayder laughed.  As you wish. Jon Snow, before you stands Tormund Giantsbane, Tall-talker, Horn-blower, and Breaker of Ice. And here also Tormund Thunderfist, Husband to Bears, the Mead-king of Ruddy Hall, Speaker to Gods and Father of Hosts.    That sounds more like me,  said Tormund.  Well met, Jon Snow. I am fond o’ wargs, as it happens, though not o’ Starks.    The good woman at the brazier,  Mance Rayder went on,  is Dalla.  The pregnant woman smiled shyly.  Treat her like you would any queen, she is carrying my child.  He turned to the last two.  This beauty is her sister Val. Young Jarl beside her is her latest pet.    I am no man’s pet,  said Jarl, dark and fierce.   And Val’s no man,  white-bearded Tormund snorted.  You ought to have noticed that by now, lad.    So there you have us, Jon Snow,  said Mance Rayder.  The King-beyond-the-Wall and his court, such as it is. And now some words from you, I think."
}