{
  "id": "0bf15ae253fc127a033284dff84f4042a46ea75c",
  "text": "       Clop-clop, clop-clop. The rider was nearly on them.       'Hallo there!' called Farmer Maggot. The advancing hoofs stopped short.   They thought they could dimly guess a dark cloaked shape in the mist, a yard  or two ahead. 'Now then!'  said the  farmer, throwing the  reins to  Sam and  striding forward. 'Don't you come a step nearer! What do you want, and where  are you going?'       'I want Mr. Baggins. Have you seen him?' sa id a muffled voice - but the  voice was  the voice of Merry Brandybuck.  A dark lantern was uncovered, and  its light fell on the astonished face of the farmer.       'Mr. Merry!' he cried.       'Yes, of course! Who  did you think it was?' said Merry coming forward.   As  he came out of the mist and their fears subsided, he seemed suddenly  to  diminish to  ordinary  hobbit-size. He was  riding a pony, and a  scarf  was  swathed round his neck and over his chin to keep out the fog.       Frodo  sprang  out of  the waggon to greet  him. 'So  there you are  at  last!'  said Merry.  'I was beginning to wonder if you would  turn up at all  today, and I was just going back to supper. When it grew foggy I came across  and rode up  towards Stock to see if you had fallen in  any ditches. But I'm  blest  if  I  know  which way  you  have come. Where did you  find them, Mr.  Maggot? In your duck-pond?'       'No,  I  caught 'em trespassing,'  said the farmer, 'and nearly set  my  dogs on  'em;  but they'll tell  you all the story,  I 've no doubt.  Now, if  you'll excuse  me, Mr. Merry and Mr. Frodo and  all, I'd best be turning for   home. Mrs. Maggot will be worriting with the night getting thick.'       He backed the waggon into the lane and turned it. 'Well, good  night to  you all,' he said. 'It's been a queer day, and no mistake. But all's well as  ends well; though perhaps  we should not say  that  until  we reach  our own  doors. I'll not deny that I'll be glad now when I  do.' He lit his lanterns,   and got up.  Suddenly he produced a large basket from under the seat.  'I was  nearly forgetting,' he said. 'Mrs. Maggot put this up  for Mr. Baggins, with  her compliments.'  He handed  it down and moved off, followed by a chorus of  thanks and good-nights.       They  watched  the  pale  rings  of  light  round his lanterns as  they   ####-dwindled  into  the  foggy night. Suddenly  Frodo laughed: from the  covered  basket he held, the scent of mushrooms was rising.     ####-   Chapter 5. A Conspiracy Unmasked            'Now we had  better get home  ourselves,' said  Merry. There's something  funny about all this, I see; but it must wait till we get in.'       They turned down  the Ferry lane, which was straight and well-kept  and   edged with  large white-washed stones. In a hundred yards  or so  it brought   them to  the  river -bank,  where there was a broad wooden  landing-stage.  A  large  flat  ferry-boat was  moored beside it.  The white  bollards near the  water's edge glimmered in the light of two lamps on high posts. Behind  them  the mists in the flat fields were now above the hedges; but the water before  them was dark,  with only  a few curling wisps like steam among the reeds by  the bank. There seemed to be less fog on the further side.       Merry  led the pony  over a gangway  on to  the ferry,  and the  others  followed.  Merry  then  pushed slowly off with  a  long pole. The Brandywine  flowed slow and broad before them. On the other side the bank was steep, and  up it a  winding path climbed from the further landing. Lamps were twinkling  there. Behind loomed  up the Buck Hill; and out of it, through stray shrouds  of mist, shone many  round windows, yellow and red. They were the windows  of  Brandy Hall, the ancient home of the Brandybucks.        Long  ago Gorhendad Oldbuck,  head of the  Oldbuck family,  one of  the  oldest  in  the Marish or indeed in the Shire, had crossed  the river, which  was the original  boundary of  the land  eastwards. He built (and excavated)   Brandy  Hall, changed his name to Brandybuck,  and settled  down  to  become  master of  what was virtually  a small independent country. His  family grew  and grew,  and after his days  continued to grow, until Brandy Hall occupied  the whole of the low hill, and had three large front-doors, many side-doors,   and about a hundred windows. The  Brandybucks and  their numerous  dependants  then  began  to burrow, and later to  build,  all round about. That was  the  origin  of Buckland, a thickly inhabited strip between the river and the Old  Forest, a sort  of colony from the Shire. Its  chief village was Bucklebury,  clustering in the banks and slopes behind Brandy Hall.       The people in the Marish were  friendly with the Bucklanders,  and  the  authority of the Master  of the  Hall (as the head of the Brandybuck  family   ####-was called) was still acknowledged by the farmers between Stock  and Rushey.  But  most of the folk of the old Shire regarded the Bucklanders as peculiar,  half foreigners as it were."
}