{
  "id": "0e9d7bb6959e0d59687f55d0e2e4f6d5f11c7a9e",
  "text": " They talk as though I am not there, and —he leaned close, breathing his winey breath right in her face— the Spider pays in gold for any little trifle. I think Moon Boy has been his for years.   He is drunk again. My poor Florian he names himself, and so he is. But he is all I have.  Is it true Lord Stannis burned the godswood at Storm’s End?   Dontos nodded.  He made a great pyre of the trees as an offering to his new god. The red priestess made him do it. They say she rules him now, body and soul. He’s vowed to burn the Great Sept of Baelor too, if he takes the city.    Let him.  When Sansa had first beheld the Great Sept with its marble walls and seven crystal towers, she’d thought it was the most beautiful building in the world, but that had been before Joffrey beheaded her father on its steps.  I want it burned.    Hush, child, the gods will hear you.    Why should they? They never hear my prayers.    Yes they do. They sent me to you, didn’t they?   Sansa picked at the bark of a tree. She felt light-headed, almost feverish.  They sent you, but what good have you done? You promised you would take me home, but I’m still here.   Dontos patted her arm.  I’ve spoken to a certain man I know, a good friend to me… and you, my lady. He will hire a swift ship to take us to safety, when the time is right.    The time is right now,  Sansa insisted,  before the fighting starts. They’ve forgotten about me. I know we could slip away if we tried.    Child, child.  Dontos shook his head.  Out of the castle, yes, we could do that, but the city gates are more heavily guarded than ever, and the Imp has even closed off the river.   It was true. The Blackwater Rush was as empty as Sansa had ever seen it. All the ferries had been withdrawn to the north bank, and the trading galleys had fled or been seized by the Imp to be made over for battle. The only ships to be seen were the king’s war galleys. They rowed endlessly up and down, staying to the deep water in the middle of the river and exchanging flights of arrows with Stannis’s archers on the south shore.  Lord Stannis himself was still on the march, but his vanguard had appeared two nights ago during the black of the moon. King’s Landing had woken to the sight of their tents and banners. They were five thousand, Sansa had heard, near as many as all the gold cloaks in the city. They flew the red or green apples of House Fossoway, the turtle of Estermont, and the fox-and-flowers of Florent, and their commander was Ser Guyard Morrigen, a famous southron knight who men now called Guyard the Green. His standard showed a crow in flight, its black wings spread wide against a storm-green sky. But it was the pale yellow banners that worried the city. Long ragged tails streamed behind them like flickering flames, and in place of a lord’s sigil they bore the device of a god: the burning heart of the Lord of Light.   When Stannis comes, he’ll have ten times as many men as Joffrey does, everyone says so.   Dontos squeezed her shoulder.  The size of his host does not matter, sweetling, so long as they are on the wrong side of the river. Stannis cannot cross without ships.    He has ships. More than Joffrey.    It’s a long sail from Storm’s End, the fleet will need to come up Massey’s Hook and through the Gullet and across Blackwater Bay. Perhaps the good gods will send a storm to sweep them from the seas.  Dontos gave a hopeful smile.  It is not easy for you, I know. You must be patient, child. When my friend returns to the city, we shall have our ship. Have faith in your Florian, and try not to be afraid.   Sansa dug her nails into her hand. She could feel the fear in her tummy, twisting and pinching, worse every day. Nightmares of the day Princess Myrcella had sailed still troubled her sleep; dark suffocating dreams that woke her in the black of night, struggling for breath. She could hear the people screaming at her, screaming without words, like animals. They had hemmed her in and thrown filth at her and tried to pull her off her horse, and would have done worse if the Hound had not cut his way to her side. They had torn the High Septon to pieces and smashed in Ser Aron’s head with a rock. Try not to be afraid! he said.  The whole city was afraid. Sansa could see it from the castle walls. The smallfolk were hiding themselves behind closed shutters and barred doors as if that would keep them safe. The last time King’s Landing had fallen, the Lannisters looted and raped as they pleased and put hundreds to the sword, even though the city had opened its gates. This time the Imp meant to fight, and a city that fought could expect no mercy at all.  Dontos was prattling on.  If I were still a knight, I should have to put on armor and man the walls with the rest. I ought to kiss King Joffrey’s feet and thank him sweetly.    If you thanked him for making you a fool, he’d make you a knight again,  Sansa said sharply.  Dontos chuckled.  My Jonquil’s a clever girl, isn’t she?    Joffrey and his mother say I’m stupid."
}