{
  "id": "0fb4f9531926165e897a0da1ed1b38146d79ae45",
  "text": " His blood is in both of them, he thought.  Proclaim who you bloody well like,  he told Crakehall. Then he climbed the Iron Throne and seated himself with his sword across his knees, to see who would come to claim the kingdom. As it happened, it had been Eddard Stark.  You had no right to judge me either, Stark.  In his dreams the dead came burning, gowned in swirling green flames. Jaime danced around them with a golden sword, but for every one he struck down two more arose to take his place.  Brienne woke him with a boot in the ribs. The world was still black, and it had begun to rain. They broke their fast on oatcakes, salt fish, and some blackberries that Ser Cleos had found, and were back in the saddle before the sun came up.      Tyrion   The eunuch was humming tunelessly to himself as he came through the door, dressed in flowing robes of peach-colored silk and smelling of lemons. When he saw Tyrion seated by the hearth, he stopped and grew very still.  My lord Tyrion,  came out in a squeak, punctuated by a nervous giggle.   So you do remember me? I had begun to wonder.    It is so very good to see you looking so strong and well.  Varys smiled his slimiest smile.  Though I confess, I had not thought to find you in mine own humble chambers.    They are humble. Excessively so, in truth.  Tyrion had waited until Varys was summoned by his father before slipping in to pay him a visit. The eunuch’s apartments were sparse and small, three snug windowless chambers under the north wall.  I’d hoped to discover bushel baskets of juicy secrets to while away the waiting, but there’s not a paper to be found.  He’d searched for hidden passages too, knowing the Spider must have ways of coming and going unseen, but those had proved equally elusive.  There was water in your flagon, gods have mercy,  he went on,  your sleeping cell is no wider than a coffin, and that bed… is it actually made of stone, or does it only feel that way?   Varys closed the door and barred it.  I am plagued with backaches, my lord, and prefer to sleep upon a hard surface.    I would have taken you for a featherbed man.    I am full of surprises. Are you cross with me for abandoning you after the battle?    It made me think of you as one of my family.    It was not for want of love, my good lord. I have such a delicate disposition, and your scar is so dreadful to look upon…  He gave an exaggerated shudder.  Your poor nose…   Tyrion rubbed irritably at the scab.  Perhaps I should have a new one made of gold. What sort of nose would you suggest, Varys? One like yours, to smell out secrets? Or should I tell the goldsmith that I want my father’s nose?  He smiled.  My noble father labors so diligently that I scarce see him anymore. Tell me, is it true that he’s restoring Grand Maester Pycelle to the small council?    It is, my lord.    Do I have my sweet sister to thank for that?  Pycelle had been his sister’s creature; Tyrion had stripped the man of office, beard, and dignity, and flung him down into a black cell.   Not at all, my lord. Thank the archmaesters of Oldtown, those who wished to insist on Pycelle’s restoration on the grounds that only the Conclave may make or unmake a Grand Maester.   Bloody fools, thought Tyrion.  I seem to recall that Maegor the Cruel’s headsman unmade three with his axe.    Quite true,  Varys said.  And the second Aegon fed Grand Maester Gerardys to his dragon.    Alas, I am quite dragonless. I suppose I could have dipped Pycelle in wildfire and set him ablaze. Would the Citadel have preferred that?    Well, it would have been more in keeping with tradition.  The eunuch tittered.  Thankfully, wiser heads prevailed, and the Conclave accepted the fact of Pycelle’s dismissal and set about choosing his successor. After giving due consideration to Maester Turquin the cordwainer’s son and Maester Erreck the hedge knight’s bastard, and thereby demonstrating to their own satisfaction that ability counts for more than birth in their order, the Conclave was on the verge of sending us Maester Gormon, a Tyrell of Highgarden. When I told your lord father, he acted at once.   The Conclave met in Oldtown behind closed doors, Tyrion knew; its deliberations were supposedly a secret. So Varys has little birds in the Citadel too.  I see. So my father decided to nip the rose before it bloomed.  He had to chuckle.  Pycelle is a toad. But better a Lannister toad than a Tyrell toad, no?    Grand Maester Pycelle has always been a good friend to your House,  Varys said sweetly.  Perhaps it will console you to learn that Ser Boros Blount is also being restored.   Cersei had stripped Ser Boros of his white cloak for failing to die in the defense of Prince Tommen when Bronn had seized the boy on the Rosby road. The man was no friend of Tyrion’s, but after that he likely hated Cersei almost as much. I suppose that’s something.  Blount is a blustering coward,  he said amiably.   Is he? Oh dear. Still, the knights of the Kingsguard do serve for life, traditionally."
}