{
  "id": "135223e916a913fb63022a8ce50cb6b07a371e55",
  "text": " Hagrid, who had told them last lesson that they had finished with unicorns, was waiting for them outside his cabin with a fresh supply of open crates at his feet.  Harrys heart sank at the sight of the crates - surely not another skrewt hatching? - but when he got near enough to see inside, he found himself looking at a number of flurry black creatures with long snouts.  Their front paws were curiously flat, like spades, and they were blinking up at the class, looking politely puzzled at all the attention. \"These're nifflers,\" said Hagrid, when the class had gathered around.  \"Yeh find 'em down mines mostly.  They like sparkly stuff. . . . There yeh go, look.\" One of the nifflers had suddenly leapt up and attempted to bite Pansy Parkinson's watch off her wrist. She shrieked and jumped backward. \"Useful little treasure detectors,\" said Hagrid happily.  \"Thought we'd have some fun with 'em today.  See over there?\"  He pointed at the large patch of freshly turned earth Harry had watched him digging from the Owlery window.  \"I've buried some gold coins.  I've got a prize fer whoever picks the niffler that digs up most.  Jus' take off all yer valuables, an' choose a niffler, an get ready ter set 'em loose.\" Harry took off his watch, which he was only wearing out of habit, as it didn't work anymore, and stuffed it into his pocket.  Then he picked up a niffler.  It put its long snout in Harry's ear and sniffed enthusiastically. It was really quite cuddly. \"Hang on,\" said Hagrid, looking down into the crate, \"there's a spare niffler here . . . who's missin?  Where's Hermione?\" \"She had to go to the hospital wing,\" said Ron. \"We'll explain later,\" Harry muttered; Pansy Parkinson was listening. It was easily the most fun they had ever had in Care of Magical Creatures.  The nifflers dived in and out of the patch of earth as though it were water, each scurrying back to the student who had released it and spitting gold into their hands.  Ron's was particularly efficient; it had soon filled his lap with coins. \"Can you buy these as pets, Hagrid?\"  he asked excitedly as his niffler dived back into the soil, splattering his robes. \"Yer mum wouldn' be happy, Ron,\" said Hagrid, grinning.  \"They wreck houses, nifflers. I reckon they've nearly got the lot, now,\" he added, pacing around the patch of earth while the nifflers continued to dive.  \"I on'y buried a hundred coins.  Oh there y'are, Hermione!\" Hermione was walking toward them across the lawn.  Her hands were very heavily bandaged and she looked miserable.  Pansy Parkinson was watching her beadily. \"Well, let's check how yeh've done!\" said Hagrid.  \"Count yer coins!  An' there's no point tryin' ter steal any, Goyle,\" he added, his beetle-black eyes narrowed.  \"It's leprechaun gold.  Vanishes after a few hours.\" Goyle emptied his pockets, looking extremely sulky.  It turned out that Ron's niffler had been most successful, so Hagrid gave him an enormous slab of Honeydukes chocolate for a prize.  The bell rang across the grounds for lunch; the rest of the class set off back to the castle, but Harry, Ron, and Hermione stayed behind to help Hagrid put the nifflers back in their boxes. Harry noticed Madame Maxime watching them out other carriage window. \"What yeh done ter your hands, Hermione?\"  said Hagrid, looking concerned. Hermione told him about the hate mail she had received that morning, and the envelope full of bubotuber pus. \"Aaah, don worry,\" said Hagrid gendy, looking down at her.  \"I got some o' those letters an all, after Rita Skeeter wrote abou me mum.  'Yeh're a monster an yeh should be put down.'  'Yer mother killed innocent people an if you had any decency you d jump in a lake.'\" \"No!\" said Hermione, looking shocked. \"Yeah,\" said Hagrid, heaving the niffler crates over by his cabin wall.  \"They're jus' nutters, Hermione.  Don' open 'em if yeh get any more.  Chuck 'em straigh' in the fire.\" \"You missed a really good lesson,\" Harry told Hermione as they headed back toward the castle.  \"They're good, nifflers, aren't they, Ron?\" Ron, however, was frowning at the chocolate Hagrid had given him. He looked thoroughly put out about something. \"What's the matter?\"  said Harry.  \"Wrong flavor?\" \"No,\" said Ron shortly.  \"Why didn't you tell me about the gold?\" \"What gold?\"  said Harry. \"The gold I gave you at the Quidditch World Cup,\" said Ron.  \"The leprechaun gold I gave you for my Omnioculars.  In the Top Box.  Why didn't you tell me it disappeared?\" Harry had to think for a moment before he realized what Ron was talking about. \"Oh . . .\" he said, the memory coming back to him at last.  \"I dunno ... I never noticed it had gone.  I was more worried about my wand, wasn't I?\" They climbed the steps into the entrance hall and went into the Great Hall for lunch. \"Must be nice,\" Ron said abruptly, when they had sat down and started serving themselves roast beef and Yorkshire puddings.  \"To have so much money you don't notice if a pocketful of Galleons goes missing.\" \"Listen, I had other stuff on my mind that night!\" s aid Harry impatiently."
}