{
  "id": "13c639353a547cf4ac81fcfdd3c5132467ee6ee2",
  "text": " Chett kicked the nearest dog, yanked on their leashes, and started up the hill. Smile all you want, Ser Piggy. We’ll see who laughs tonight. He only wished he had time to kill Tollett as well. Gloomy horsefaced fool, that’s what he is.  The climb was steep, even on this side of the Fist, which had the gentlest slope. Partway up the dogs started barking and pulling at him, figuring that they’d get fed soon. He gave them a taste of his boot instead, and a crack of the whip for the big ugly one that snapped at him. Once they were tied up, he went to report.  The prints were there like Giant said, but the dogs wouldn’t track,  he told Mormont in front of his big black tent.  Down by the river like that, could be old prints.    A pity.  Lord Commander Mormont had a bald head and a great shaggy grey beard, and sounded as tired as he looked.  We might all have been better for a bit of fresh meat.  The raven on his shoulder bobbed its head and echoed,  Meat. Meat. Meat.   We could cook the bloody dogs, Chett thought, but he kept his mouth shut until the Old Bear sent him on his way. And that’s the last time I’ll need to bow my head to that one, he thought to himself with satisfaction. It seemed to him that it was growing even colder, which he would have swom. Wasn’t possible. The dogs huddled together miserably in the hard frozen mud, and Chett was half tempted to crawl in with them. Instead he wrapped a black wool scarf round the lower part of his face, leaving a slit for his mouth between the winds. It was warmer if he kept moving, he found, so he made a slow circuit of the perimeter with a wad of sourleaf, sharing a chew or two with the black brothers on guard and hearing what they had to say. None of the men on the day watch were part of his scheme; even so, he figured it was good to have some sense of what they were thinking.  Mostly what they were thinking was that it was bloody cold.  The wind was rising as the shadows lengthened. It made a high thin sound as it shivered through the stones of the ringwall.  I hate that sound,  little Giant said.  It sounds like a babe in the brush, wailing away for milk.   When he finished the circuit and returned to the dogs, he found Lark waiting for him.  The officers are in the Old Bear’s tent again, talking something fierce.    That’s what they do,  said Chett.  They’re highborn, all but Blane, they get drunk on words instead of wine.   Lark sidled closer.  Cheese-for-wits keeps going on about the bird,  he warned, glancing about to make certain no one was close.  Now he’s asking if we cached any seed for the damn thing.    It’s a raven,  said Chett.  It eats corpses.   Lark grinned.  His, might be?   Or yours. It seemed to Chett that they needed the big man more than they needed Lark.  Stop fretting about Small Paul. You do your part, he’ll do his.   Twilight was creeping through the woods by the time he rid himself of the Sisterman and sat down to edge his sword. It was bloody hard work with his gloves on, but he wasn’t about to take them off. Cold as it was, any fool that touched steel with a bare hand was going to lose a patch of skin.  The dogs whimpered when the sun went down. He gave them water and curses.  Half a night more, and you can find your own feast.  By then he could smell supper.  Dywen was holding forth at the cookfire as Chett got his heel of hardbread and a bowl of bean and bacon soup from Hake the cook.  The wood’s too silent,  the old forester was saying.  No frogs near that river, no owls in the dark. I never heard no deader wood than this.    Them teeth of yours sound pretty dead,  said Hake.  Dywen clacked his wooden teeth.  No wolves neither. There was, before, but no more. Where’d they go, you figure?    Someplace warm,  said Chett.  Of the dozen odd brothers who sat by the fire, four were his. He gave each one a hard squinty look as he ate, to see if any showed signs of breaking. Dirk seemed calm enough, sitting silent and sharpening his blade, the way he did every night. And Sweet Donnel Hill was all easy japes. He had white teeth and fat red lips and yellow locks that he wore in an artful tumble about his shoulders, and he claimed to be the bastard of some Lannister. Maybe he was at that. Chett had no use for pretty boys, nor for bastards neither, but Sweet Donnel seemed like to hold his own.  He was less certain about the forester the brothers called Sawwood, more for his snoring than for anything to do with trees. Just now he looked so restless he might never snore again. And Maslyn was worse. Chett could see sweat trickling down his face, despite the frigid wind. The beads of moisture sparkled in the firelight, like so many little wet jewels. Maslyn wasn’t eating neither, only staring at his soup as if the smell of it was about to make him sick. I’ll need to watch that one, Chett thought.   Assemble!  The shout came suddenly, from a dozen throats, and quickly spread to every part of the hilltop camp.  Men of the Night’s Watch! Assemble at the central fire!   Frowning, Chett finished his soup and followed the rest."
}