{
  "id": "184e26c76133b188654f9e30ee55f06ceafc9af5",
  "text": "   We should start back,  Gared urged as the woods began to grow dark around them.  The wildlings are dead.    Do the dead frighten you?  Ser Waymar Royce asked with just the hint of a smile.  Gared did not rise to the bait. He was an old man, past fifty, and he had seen the lordlings come and go.  Dead is dead,  he said.  We have no business with the dead.    Are they dead?  Royce asked softly.  What proof have we?    Will saw them,  Gared said.  If he says they are dead, that’s proof enough for me.   Will had known they would drag him into the quarrel sooner or later. He wished it had been later rather than sooner.  My mother told me that dead men sing no songs,  he put in.   My wet nurse said the same thing, Will,  Royce replied.  Never believe anything you hear at a woman’s tit. There are things to be learned even from the dead.  His voice echoed, too loud in the twilit forest.   We have a long ride before us,  Gared pointed out.  Eight days, maybe nine. And night is falling.   Ser Waymar Royce glanced at the sky with disinterest.  It does that every day about this time. Are you unmanned by the dark, Gared?   Will could see the tightness around Gared’s mouth, the barely suppressed anger in his eyes under the thick black hood of his cloak. Gared had spent forty years in the Night’s Watch, man and boy, and he was not accustomed to being made light of. Yet it was more than that. Under the wounded pride, Will could sense something else in the older man. You could taste it; a nervous tension that came perilous close to fear.  Will shared his unease. He had been four years on the Wall. The first time he had been sent beyond, all the old stories had come rushing back, and his bowels had turned to water. He had laughed about it afterward. He was a veteran of a hundred rangings by now, and the endless dark wilderness that the southron called the haunted forest had no more terrors for him.  Until tonight. Something was different tonight. There was an edge to this darkness that made his hackles rise. Nine days they had been riding, north and northwest and then north again, farther and farther from the Wall, hard on the track of a band of wildling raiders. Each day had been worse than the day that had come before it. Today was the worst of all. A cold wind was blowing out of the north, and it made the trees rustle like living things. All day, Will had felt as though something were watching him, something cold and implacable that loved him not. Gared had felt it too. Will wanted nothing so much as to ride hellbent for the safety of the Wall, but that was not a feeling to share with your commander.  Especially not a commander like this one.  Ser Waymar Royce was the youngest son of an ancient house with too many heirs. He was a handsome youth of eighteen, grey-eyed and graceful and slender as a knife. Mounted on his huge black destrier, the knight towered above Will and Gared on their smaller garrons. He wore black leather boots, black woolen pants, black moleskin gloves, and a fine supple coat of gleaming black ringmail over layers of black wool and boiled leather. Ser Waymar had been a Sworn Brother of the Night’s Watch for less than half a year, but no one could say he had not prepared for his vocation. At least insofar as his wardrobe was concerned.  His cloak was his crowning glory; sable, thick and black and soft as sin.  Bet he killed them all himself, he did,  Gared told the barracks over wine,  twisted their little heads off, our mighty warrior.  They had all shared the laugh.  It is hard to take orders from a man you laughed at in your cups, Will reflected as he sat shivering atop his garron. Gared must have felt the same.   Mormont said as we should track them, and we did,  Gared said.  They’re dead. They shan’t trouble us no more. There’s hard riding before us. I don’t like this weather. If it snows, we could be a fortnight getting back, and snow’s the best we can hope for. Ever seen an ice storm, my lord?   The lordling seemed not to hear him. He studied the deepening twilight in that half-bored, half-distracted way he had. Will had ridden with the knight long enough to understand that it was best not to interrupt him when he looked like that.  Tell me again what you saw, Will. All the details. Leave nothing out.   Will had been a hunter before he joined the Night’s Watch. Well, a poacher in truth. Mallister freeriders had caught him red-handed in the Mallisters’ own woods, skinning one of the Mallisters’ own bucks, and it had been a choice of putting on the black or losing a hand. No one could move through the woods as silent as Will, and it had not taken the black brothers long to discover his talent.   The camp is two miles farther on, over that ridge, hard beside a stream,  Will said.  I got close as I dared. There’s eight of them, men and women both. No children I could see. They put up a lean-to against the rock. The snow’s pretty well covered it now, but I could still make it out. No fire burning, but the firepit was still plain as day."
}