{
  "id": "192ad650318978f68c1384845c39bd4268d5d5b4",
  "text": " Joffrey is still Robert’s eldest trueborn son, so the throne is rightfully his by all the laws of the realm. Were he to die, and I mean to see that he does, he has a younger brother. Tommen is next in line after Joffrey.    Tommen is no less a Lannister,  Ser Marq Piper snapped.   As you say,  said Robb, troubled.  Yet if neither one is king, still, how could it be Lord Renly? He’s Robert’s younger brother. Bran can’t be Lord of Winterfell before me, and Renly can’t be king before Lord Stannis.   Lady Mormont agreed.  Lord Stannis has the better claim.    Renly is crowned,  said Marq Piper.  Highgarden and Storm’s End support his claim, and the Dornishmen will not be laggardly. If Winterfell and Riverrun add their strength to his, he will have five of the seven great houses behind him. Six, if the Arryns bestir themselves! Six against the Rock! My lords, within the year, we will have all their heads on pikes, the queen and the boy king, Lord Tywin, the Imp, the Kingslayer, Ser Kevan, all of them! That is what we shall win if we join with King Renly. What does Lord Stannis have against that, that we should cast it all aside?    The right,  said Robb stubbornly. Catelyn thought he sounded eerily like his father as he said it.   So you mean us to declare for Stannis?  asked Edmure.   I don’t know,  said Robb.  I prayed to know what to do, but the gods did not answer. The Lannisters killed my father for a traitor, and we know that was a lie, but if Joffrey is the lawful king and we fight against him, we will be traitors.    My lord father would urge caution,  aged Ser Stevron said, with the weaselly smile of a Frey.  Wait, let these two kings play their game of thrones. When they are done fighting, we can bend our knees to the victor, or oppose him, as we choose. With Renly arming, likely Lord Tywin would welcome a truce… and the safe return of his son. Noble lords, allow me to go to him at Harrenhal and arrange good terms and ransoms…   A roar of outrage drowned out his voice.  Craven!  the Greatjon thundered.  Begging for a truce will make us seem weak,  declared Lady Mormont.  Ransoms be damned, we must not give up the Kingslayer,  shouted Rickard Karstark.   Why not a peace?  Catelyn asked.  The lords looked at her, but it was Robb’s eyes she felt, his and his alone.  My lady, they murdered my lord father, your husband,  he said grimly. He unsheathed his longsword and laid it on the table before him, the bright steel on the rough wood.  This is the only peace I have for Lannisters.   The Greatjon bellowed his approval, and other men added their voices, shouting and drawing swords and pounding their fists on the table. Catelyn waited until they had quieted.  My lords,  she said then,  Lord Eddard was your liege, but I shared his bed and bore his children. Do you think I love him any less than you?  Her voice almost broke with her grief, but Catelyn took a long breath and steadied herself.  Robb, if that sword could bring him back, I should never let you sheathe it until Ned stood at my side once more… but he is gone, and hundred Whispering Woods will not change that. Ned is gone, and Daryn Hornwood, and Lord Karstark’s valiant sons, and many other good men besides, and none of them will return to us. Must we have more deaths still?    You are a woman, my lady,  the Greatjon rumbled in his deep voice.  Women do not understand these things.    You are the gentle sex,  said Lord Karstark, with the lines of grief fresh on his face.  A man has a need for vengeance.    Give me Cersei Lannister, Lord Karstark, and you would see how gentle a woman can be,  Catelyn replied.  Perhaps I do not understand tactics and strategy… but I understand futility. We went to war when Lannister armies were ravaging the riverlands, and Ned was a prisoner, falsely accused of treason. We fought to defend ourselves, and to win my lord’s freedom.   Well, the one is done, and the other forever beyond our reach. I will mourn for Ned until the end of my days, but I must think of the living. I want my daughters back, and the queen holds them still. If I must trade our four Lannisters for their two Starks, I will call that a bargain and thank the gods. I want you safe, Robb, ruling at Winterfell from your father’s seat. I want you to live your life, to kiss a girl and wed a woman and father a son. I want to write an end to this. I want to go home, my lords, and weep for my husband.   The hall was very quiet when Catelyn finished speaking.   Peace,  said her uncle Brynden.  Peace is sweet, my lady… but on what terms? It is no good hammering your sword into a plowshare if you must forge it again on the morrow.    What did Torrhen and my Eddard die for, if I am to return to Karhold with nothing but their bones?  asked Rickard Karstark.   Aye,  said Lord Bracken.  Gregor Clegane laid waste to my fields, slaughtered my smallfolk, and left Stone Hedge a smoking ruin. Am I now to bend the knee to the ones who sent him? What have we fought for, if we are to put all back as it was before?   Lord Blackwood agreed, to Catelyn’s surprise and dismay."
}