{
  "id": "1e257a92ab3a86c030c261c34d738508cc5dfaa2",
  "text": "  Her eyes were so tired she was poring over the tiny print of Olde and Forgotten Bewitchments and Charmes with her nose about an inch from the page.  \"They'd never have set a task that was undoable.\" \"They have,\" said Ron.  \"Harry, just go down to the lake tomorrow, right, stick your head in, yell at the merpeople to give back whatever they've nicked, and see if they chuck it out. Best you can do, mate.\" \"There's a way of doing it!\"  Hermione said crossly.  \"There Just has to be!\" She seemed to be taking the library's lack of useful information on the subject as a personal insult; it had never failed her before. \"I know what I should have done,\" said Harry, resting, face-down, on Saucy Tricks for Tricky Sorts.  \"I should've learned to be an Animagus like Sirius.\" An Animagus was a wizard who could transform into an animal. \"Yeah, you could've turned into a goldfish any time you wanted!\"  said Ron. \"Or a frog,\" yawned Harry.  He was exhausted.  \"It takes years to become an Animagus, and then you have to register yourself and everything,\" said Hermione vaguely, now squinting down the index of Weird Wizarding Dilemmas and Their Solutions.  \"Professor McGonagall told us, remember... you've got to register yourself with the Improper Use of Magic Office ...what animal you become, and your markings, so you can't abuse it...\"             \"Hermione, I was joking,\" said Harry wearily.  \"I know I haven't got a chance of turning into a frog by tomorrow morning....\" \"Oh this is no use,\" Hermione said, snapping shut Weird Wizarding Dilemmas.  \"Who on earth wants to make their nose hair grow into ringlets?\" \"I wouldn't mind,\" said Fred Weasleys voice. \"Be a talking point, wouldn't it?\" Harry, Ron, and Hermione looked up.  Fred and George had just emerged from behind some bookshelves. \"What're you two doing here?\" Ron asked. \"Looking for you,\" said George. \"McGonagall wants you, Ron.  And you, Hermione.\" \"Why?\"  said Hermione, looking surprised. \"Dunno ... she was looking a bit grim, though,\" said Fred. \"We're supposed to take you down to her office,\" said George. Ron and Hermione stared at Harry, who felt his stomach drop.  Was Professor McGonagall about to tell Ron and Hermione off?  Perhaps she'd noticed how much they were helping him, when he ought to be working out how to do the task alone? \"We'll meet you back in the common room,\" Hermione told Harry as she got up to go with Ron - both of them looked very anxious.  \"Bring as many of these books as you can, okay?\" \"Right,\" said Harry uneasily. By eight o'clock. Madam Pince had extinguished all the lamps and came to chivvy Harry out of the library.  Staggering under the weight of as many books as he could carry, Harry returned to the Gryffindor common room, pulled a table into a corner, and continued to search.  There was nothing in Madcap Magic for Wacky Warlocks. . . nothing in A Guide to Medieval Sorcery . . . not one mention of underwater exploits in An Anthology of Eighteenth-Century Charms, or in Dreadful Denizens of the Deep, or Powers You Never Knew You Had and What to Do with Them Now Youve Wised Up. Crookshanks crawled into Harrys lap and curled up, purring deeply.  The common room emptied slowly around Harry.  People kept wishing him luck for the next morning in cheery, confident voices like Hagrid s, all of them apparently convinced that he was about to pull off another stunning performance like the one he had managed in the first task.  Harry couldn't answer them, he just nodded, feeling as though there were a golfball stuck in his throat. By ten to midnight, he was alone in the room with Crookshanks.  He had searched all the remaining books, and Ron and Hermione had not come back. It's over, he told himself.  You can't do it.  You'll just have to go down to the lake in the morning and tell the judges.... He imagined himself explaining that he couldn't do the task.  He pictured Bagman's look of round-eyed surprise, Karkaroffs satisfied, yellow-toothed smile.  He could almost hear Fleur Delacour saying \"I knew it. . . 'e is too young, 'e is only a little boy.\"  He saw Malfoy flashing his POTTER STINKS badge at the front of the crowd, saw Hagrid s crestfallen, disbelieving face. . . . Forgetting that Crookshanks was on his lap.  Harry stood up very suddenly; Crookshanks hissed angrily as he landed on the floor, gave Harry a disgusted look, and stalked away with his bottlebrush tail in the air, but Harry was already hurrying up the spiral staircase to his dormitory. ... He would grab the Invisibility Cloak and go back to the library, he'd stay there all night if he had to. ... \"Lumos,\" Harry whispered fifteen minutes later as he opened the library door. Wand tip alight, he crept along the bookshelves, pulling down more books - books of hexes and charms, books on merpeople and water monsters, books on famous witches and wizards, on magical inventions, on anything at all that might include one passing reference to underwater survival.  He carried them over to a table, then set to work, searching them by the narrow beam of his wand, occasionally checking his watch."
}