{
  "id": "1eb4f9126a777adfd4b53228ea2916797a9c110b",
  "text": "  Lord Harroway’s Town,  he said, and then, when he saw it,  Seven hells!  The town was drowned and desolate. The rising waters had overflowed the riverbanks. All that remained of Harroway town was the upper story of a daub-and-wattle inn, the seven-sided dome of a sunken sept, two-thirds of a stone roundtower, some moldy thatch roofs, and a forest of chimneys.  But there was smoke coming from the tower, Arya saw, and below one arched window a wide flat-bottomed boat was chained up tight. The boat had a dozen oarlocks and a pair of great carved wooden horse heads mounted fore and aft. The two-headed horse, she realized. There was a wooden house with a sod roof right in the middle of the deck, and when the Hound cupped his hands around his mouth and shouted two men came spilling out. A third appeared in the window of the roundtower, clutching a loaded crossbow.  What do you want?  he shouted across the swirling brown waters.   Take us over,  the Hound shouted back.  The men in the boat conferred with one another. One of them, a grizzled grey-haired man with thick arms and a bent back, stepped to the rail.  It will cost you.    Then I’ll pay.   With what? Arya wondered. The outlaws had taken Clegane’s gold, but maybe Lord Beric had left him some silver and copper. A ferry ride shouldn’t cost more than a few coppers…  The ferrymen were talking again. Finally the bent-backed one turned away and gave a shout. Six more men appeared, pulling up hoods to keep the rain off their heads. Still more squirmed out the holdfast window and leapt down onto the deck. Half of them looked enough like the bent-backed man to be his kin. Some of them undid the chains and took up long poles, while the others slid heavy wide-bladed oars through the locks. The ferry swung about and began to creep slowly toward the shallows, oars stroking smoothly on either side. Sandor Clegane rode down the hill to meet it.  When the aft end of the boat slammed into the hillside, the ferrymen opened a wide door beneath the carved horse’s head, and extended a heavy oaken plank. Stranger balked at the water’s edge, but the Hound put his heels into the courser’s flank and urged him up the gangway. The bent-backed man was waiting for them on deck.  Wet enough for you, ser?  he asked, smiling.  The Hound’s mouth gave a twitch.  I need your boat, not your bloody wit.  He dismounted, and pulled Arya down beside him. One of the boatmen reached for Stranger’s bridle.  I wouldn’t,  Clegane said, as the horse kicked. The man leapt back, slipped on the rain-slick deck, and crashed onto his arse, cursing.  The ferryman with the bent back wasn’t smiling any longer.  We can get you across,  he said sourly.  It will cost you a gold piece. Another for the horse. A third for the boy.    Three dragons?  Clegane gave a bark of laughter.  For three dragons I should own the bloody ferry.    Last year, might be you could. But with this river, I’ll need extra hands on the poles and oars just to see we don’t get swept a hundred miles out to sea. Here’s your choice. Three dragons, or you teach that hellhorse how to walk on water.    I like an honest brigand. Have it your way. Three dragons… when you put us ashore safe on the north bank.    I’ll have them now, or we don’t go.  The man thrust out a thick, callused hand, palm up.  Clegane rattled his longsword to loosen the blade in the scabbard.  Here’s your choice. Gold on the north bank, or steel on the south.   The ferryman looked up at the Hound’s face. Arya could tell that he didn’t like what he saw there. He had a dozen men behind him, strong men with oars and hardwood poles in their hands, but none of them were rushing forward to help him. Together they could overwhelm Sandor Clegane, though he’d likely kill three or four of them before they took him down.  How do I know you’re good for it?  the bent-backed man asked, after a moment.  He’s not, she wanted to shout. Instead she bit her lip.   Knight’s honor,  the Hound said, unsmiling.  He’s not even a knight. She did not say that either.   That will do.  The ferryman spat.  Come on then, we can have you across before dark. Tie the horse up, I don’t want him spooking when we’re under way. There’s a brazier in the cabin if you and your son want to get warm.    I’m not his stupid son!  said Arya furiously. That was even worse than being taken for a boy. She was so angry that she might have told them who she really was, only Sandor Clegane grabbed her by the back of the collar and hoisted her one-handed off the deck.  How many times do I need to tell you to shut your bloody mouth?  He shook her so hard her teeth rattled, then let her fall.  Get in there and get dry, like the man said.   Arya did as she was told. The big iron brazier was glowing red, filling the room with a sullen suffocating heat. It felt pleasant to stand beside it, to warm her hands and dry off a little bit, but as soon as she felt the deck move under her feet she slipped back out through the forward door."
}