{
  "id": "1eb647951f1995475bec85787702f050194d60fe",
  "text": " The shield atop his page showed the arms of House Selmy: three stalks of wheat, yellow, on a brown field. Jaime was amused, though unsurprised, to find that Ser Barristan had taken the time to record his own dismissal before leaving the castle.      Ser Barristan of House Selmy. Firstborn son of Ser Lyonel Selmy of Harvest Hall. Served as squire to Ser Manfred Swann. Named  the Bold  in his 10th year, when he donned borrowed armor to appear as a mystery knight in the tourney at Blackhaven, where he was defeated and unmasked by Duncan, Prince of Dragonflies. Knighted in his 16th year by King Aegon V Targaryen, after performing great feats of prowess as a mystery knight in the winter tourney at King’s Landing, defeating Prince Duncan the Small and Ser Duncan the Tall, Lord Commander of the Kingsguard. Slew Maelys the Monstrous, last of the Blackfyre Pretenders, in single combat during the War of the Ninepenny Kings. Defeated Lormelle Long Lance and Cedrik Storm, the Bastard of Bronzegate. Named to the Kingsguard in his 23rd year, by Lord Commander Ser Gerold Hightower. Defended the passage against all challengers in the tourney of the Silver Bridge. Victor in the mêlée at Maidenpool. Brought King Aerys II to safety during the Defiance of Duskendale, despite an arrow wound in the chest. Avenged the murder of his Sworn Brother, Ser Gwayne Gaunt. Rescued Lady Jeyne Swann and her septa from the Kingswood Brotherhood, defeating Simon Toyne and the Smiling Knight, and slaying the former. In the Oldtown tourney, defeated and unmasked the mystery knight Blackshield, revealing him as the Bastard of Uplands. Sole champion of Lord Steffon’s tourney at Storm’s End, whereat he unhorsed Lord Robert Baratheon, Prince Oberyn Martell, Lord Leyton Hightower, Lord Jon Connington, Lord Jason Mallister, and Prince Rhaegar Targaryen. Wounded by arrow, spear, and sword at the Battle of the Trident whilst fighting beside his Sworn Brothers and Rhaegar Prince of Dragonstone. Pardoned, and named Lord Commander of the Kingsguard, by King Robert I Baratheon. Served in the honor guard that brought Lady Cersei of House Lannister to King’s Landing to wed King Robert. Led the attack on Old Wyk during Balon Greyjoy’s Rebellion. Champion of the tourney at King’s Landing, in his 57th year. Dismissed from service by King Joffrey I Baratheon in his 61st year, for reasons of advanced age.      The earlier part of Ser Barristan’s storied career had been entered by Ser Gerold Hightower in a big forceful hand. Selmy’s own smaller and more elegant writing took over with the account of his wounding on the Trident.  Jaime’s own page was scant by comparison.      Ser Jaime of House Lannister. Firstborn son of Lord Tywin and Lady Joanna of Casterly Rock. Served against the Kingswood Brotherhood as squire to Lord Sumner Crakehall. Knighted in his 15th year by Ser Arthur Dayne of the Kingsguard, for valor in the field. Chosen for the Kingsguard in his 15th year by King Aerys II Targaryen. During the Sack of King’s Landing, slew King Aerys II at the foot of the Iron Throne. Thereafter known as the  Kingslayer.  Pardoned for his crime by King Robert I Baratheon. Served in the honor guard that brought his sister the Lady Cersei Lannister to King’s Landing to wed King Robert. Champion in the tourney held at King’s Landing on the occasion of their wedding.      Summed up like that, his life seemed a rather scant and mingy thing. Ser Barristan could have recorded a few of his other tourney victories, at least. And Ser Gerold might have written a few more words about the deeds he’d performed when Ser Arthur Dayne broke the Kingswood Brotherhood. He had saved Lord Sumner’s life as Big Belly Ben was about to smash his head in, though the outlaw had escaped him. And he’d held his own against the Smiling Knight, though it was Ser Arthur who slew him. What a fight that was, and what a foe. The Smiling Knight was a madman, cruelty and chivalry all jumbled up together, but he did not know the meaning of fear. And Dayne, with Dawn in hand… the outlaw’s longsword had so many notches by the end that Ser Arthur had stopped to let him fetch a new one.  It’s that white sword of yours I want,  the robber knight told him as they resumed, though he was bleeding from a dozen wounds by then.  Then you shall have it, ser,  the Sword of the Morning replied, and made an end of it.  The world was simpler in those days, Jaime thought, and men as well as swords were made of finer steel. Or was it only that he had been fifteen? They were all in their graves now, the Sword of the Morning and the Smiling Knight, the White Bull and Prince Lewyn, Ser Oswell Whent with his black humor, earnest Jon Darry, Simon Toyne and his Kingswood Brotherhood, bluff old Sumner Crakehall. And me, that boy I was… when did he die, I wonder? When I donned the white cloak? When I opened Aerys’s throat? That boy had wanted to be Ser Arthur Dayne, but someplace along the way he had become the Smiling Knight instead."
}