{
  "id": "20b4e868e0fcfb8bace623df268a42d6f10f8adf",
  "text": "  \"Please, Hermione, tell me you weren't one of the forty-six, 51 said Ron as they left the Great Hall for their first lesson. Hermione suddenly became very interested in searching her bag for her schedule and didn't answer.  All day long, the dwarfs kept barging into their classes to deliver valentines, to the annoyance of the teachers, and late that afternoon as the Gryffindors were walking upstairs for Charms, one of the dwarfs caught up with Harry.  \"Oy, you! 'Arty Potter!\" shouted a particularly grim-looking dwarf, elbowing people out of the way to get to Harry.  Hot all over at the thought of being given a valentine in front of a line of first years, which happened to include Ginny Weasley, Harry tried to escape. The dwarf, however, cut his way through the crowd by kicking people's shins, and reached him before he'd gone two paces.  \"I've got a musical message to deliver to 'Arry Potter in person,\" he said, twanging his harp in a threatening sort of way.  \"Not here,\" Harry hissed, trying to escape.  \"Stay still!\" grunted the dwarf, grabbing hold of Harry's bag and pulling him back.  \"Let me go!\" Harry snarled, tugging.  With a loud ripping noise, his bag split in two. His books, wand, parchment, and quill spilled onto the floor and his ink bottle smashed over everything.  Harry scrambled around, trying to pick it all up before the dwarf started singing, causing something of a holdup in the corridor.  *237*  \"What's going on here?\" came the cold, drawling voice of Draco Malfoy. Harry started stuffing everything feverishly into his ripped bag, desperate to get away before Malfoy could hear his musical valentine.  \"What's all this commotion?\" said another familiar voice as Percy Weasley arrived.  Losing his head, Harry tried to make a run for it, but the dwarf seized him around the knees and brought him crashing to the floor.  \"Right,\" he said, sitting on Harry's ankles. \"Here is your singing valentine:  His eyes are as green as a fresh pickled toad,  His hair is as dark as a blackboard. I wish he was mine, he's really divine, The hero who conquered the Dark Lord  Harry would have given all the gold in Gringotts to evaporate on the spot. Trying valiantly to laugh along with everyone else, he got up, his feet numb from the weight of the dwarf, as Percy Weasley did his best to disperse the crowd, some of whom were crying with mirth.  \"Off you go, off you go, the bell rang five minutes ago, off to class, now,\" he said, shooing some of the younger students away. \"And you, Malfoy-\"  Harry, glancing over, saw Malfoy stoop and snatch up something. Leering, he showed it to Crabbe and Goyle, and Harry realized that he'd got Riddle's diary.  \"Give that back,\" said Harry quietly.  \"Wonder what Potter's written in this?\" said Malfoy, who obvi  * 238  ously hadn't noticed the year on the cover and thought he had Harry's own diary. A hush fell over the onlookers. Ginny was staring from the diary to Harry, looking terrified.  \"Hand it over, Malfoy,\" said Percy sternly.  \"When I've had a look,\" said Malfoy, waving the diary tauntingly at Harry.  Percy said, \"As a school prefect -\" but Harry had lost his temper. He pulled out his wand and shouted, \"Expelliarmus!\" and just as Snape had disarmed Lockhart, so Malfoy found the diary shooting out of his hand into the air. Ron, grinning broadly, caught it.  \"Harry!\" said Percy loudly. \"No magic in the corridors. I'll have to report this, you know!\"  But Harry didn't care, he was one-up on Malfoy, and that was worth five points from Gryffindor any day. Malfoy was looking furious, and as Ginny passed him to enter her classroom, he yelled spitefully after her, \"I don't think Potter liked your valentine much!\"  Ginny covered her face with her hands and ran into class. Snarling, Ron pulled out his wand, too, but Harry pulled him away. Ron didn't need to spend the whole of Charms belching slugs.  It wasn't until they had reached Professor Flitwick's class that Harry noticed something rather odd about Riddle's diary. All his other books were drenched in scarlet ink. The diary, however, was as clean as it had been before the ink bottle had smashed all over it. He tried to point this out to Ron, but Ron was having trouble with his wand again; large purple bubbles were blossoming out of the end, and he wasn't much interested in anything else.  Harry went to bed before anyone else in his dormitory that night. This was partly because he didn't think he could stand Fred and George singing, \"His eyes are as green as a fresh pickled toad\" one more time, and partly because he wanted to examine Riddle's diary again, and knew that Ron thought he was wasting his time.  Harry sat on his four-poster and flicked through the blank pages, not one of which had a trace of scarlet ink on it. Then he pulled a new bottle out of his bedside cabinet, dipped his quill into it, and dropped a blot onto the first page of the diary.  The ink shone brightly on the paper for a second and then, as though it was being sucked into the page, vanished."
}