{
  "id": "213fd921d53595cc4b82a8562ced6f31d3566ebf",
  "text": " Below her the world turned from black to indigo to green as dawn crept across fields and forests. Pale white mists rose off Alyssa’s Tears, where the ghost waters plunged over the shoulder of the mountain to begin their long tumble down the face of the Giant’s Lance. Catelyn could feel the faint touch of spray on her face.  Alyssa Arryn had seen her husband, her brothers, and all her children slain, and yet in life she had never shed a tear. So in death, the gods had decreed that she would know no rest until her weeping watered the black earth of the Vale, where the men she had loved were buried. Alyssa had been dead six thousand years now, and still no drop of the torrent had ever reached the valley floor far below. Catelyn wondered how large a waterfall her own tears would make when she died.  Tell me the rest of it,  she said.   The Kingslayer is massing a host at Casterly Rock,  Ser Rodrik Cassel answered from the room behind her.  Your brother writes that he has sent riders to the Rock, demanding that Lord Tywin proclaim his intent, but he has had no answer. Edmure has commanded Lord Vance and Lord Piper to guard the pass below the Golden Tooth. He vows to you that he will yield no foot of Tully land without first watering it with Lannister blood.   Catelyn turned away from the sunrise. Its beauty did little to lighten her mood; it seemed cruel for a day to dawn so fair and end so foul as this one promised to.  Edmure has sent riders and made vows,  she said,  but Edmure is not the Lord of Riverrun. What of my lord father?    The message made no mention of Lord Hoster, my lady.  Ser Rodrik tugged at his whiskers. They had grown in white as snow and bristly as a thornbush while he was recovering from his wounds; he looked almost himself again.   My father would not have given the defense of Riverrun over to Edmure unless he was very sick,  she said, worried.  I should have been woken as soon as this bird arrived.    Your lady sister thought it better to let you sleep, Maester Colemon told me.    I should have been woken,  she insisted.   The maester tells me your sister planned to speak with you after the combat,  Ser Rodrik said.   Then she still plans to go through with this mummer’s farce?  Catelyn grimaced.  The dwarf has played her like a set of pipes, and she is too deaf to hear the tune. Whatever happens this morning, Ser Rodrik, it is past time we took our leave. My place is at Winterfell with my sons. If you are strong enough to travel, I shall ask Lysa for an escort to see us to Gulltown. We can take ship from there.    Another ship?  Ser Rodrik looked a shade green, yet he managed not to shudder.  As you say, my lady.   The old knight waited outside her door as Catelyn summoned the servants Lysa had given her. If she spoke to her sister before the duel, perhaps she could change her mind, she thought as they dressed her. Lysa’s policies varied with her moods, and her moods changed hourly. The shy girl she had known at Riverrun had grown into a woman who was by turns proud, fearful, cruel, dreamy, reckless, timid, stubborn, vain, and, above all, inconstant.  When that vile turnkey of hers had come crawling to tell them that Tyrion Lannister wished to confess, Catelyn had urged Lysa to have the dwarf brought to them privately, but no, nothing would do but that her sister must make a show of him before half the Vale. And now this…   Lannister is my prisoner,  she told Ser Rodrik as they descended the tower stairs and made their way through the Eyrie’s cold white halls. Catelyn wore plain grey wool with a silvered belt.  My sister must be reminded of that.   At the doors to Lysa’s apartments, they met her uncle storming out.  Going to join the fool’s festival?  Ser Brynden snapped.  I’d tell you to slap some sense into your sister, if I thought it would do any good, but you’d only bruise your hand.    There was a bird from Riverrun,  Catelyn began,  a letter from Edmure…    I know, child.  The black fish that fastened his cloak was Brynden’s only concession to ornament.  I had to hear it from Maester Colemon. I asked your sister for leave to take a thousand seasoned men and ride for Riverrun with all haste. Do you know what she told me? The Vale cannot spare a thousand swords, nor even one, Uncle, she said. You are the Knight of the Gate. Your place is here.  A gust of childish laughter drifted through the open doors behind him, and her uncle glanced darkly over his shoulder.  Well, I told her she could bloody well find herself a new Knight of the Gate. Black fish or no, I am still a Tully. I shall leave for Riverrun by evenfall.   Catelyn could not pretend to surprise.  Alone? You know as well as I that you will never survive the high road. Ser Rodrik and I are returning to Winterfell. Come with us, Uncle. I will give you your thousand men. Riverrun will not fight alone.   Brynden thought a moment, then nodded a brusque agreement.  As you say. It’s the long way home, but I’m more like to get there."
}