{
  "id": "2163f456f8b10a7f1da4e8d11bf324eec3360cf7",
  "text": " Even as children, they would creep into each other’s beds and sleep with their arms entwined. Even in the womb. Long before his sister’s flowering or the advent of his own manhood, they had seen mares and stallions in the fields and dogs and bitches in the kennels and played at doing the same. Once their mother’s maid had caught them at it… he did not recall just what they had been doing, but whatever it was had horrified Lady Joanna. She’d sent the maid away, moved Jaime’s bedchamber to the other side of Casterly Rock, set a guard outside Cersei’s, and told them that they must never do that again or she would have no choice but to tell their lord father. They need not have feared, though. It was not long after that she died birthing Tyrion. Jaime barely remembered what his mother had looked like.  Perhaps Stannis Baratheon and the Starks had done him a kindness. They had spread their tale of incest all over the Seven Kingdoms, so there was nothing left to hide. Why shouldn’t I marry Cersei openly and share her bed every night? The dragons always married their sisters. Septons, lords, and smallfolk had turned a blind eye to the Targaryens for hundreds of years, let them do the same for House Lannister. It would play havoc with Joffrey’s claim to the crown, to be sure, but in the end it had been swords that had won the Iron Throne for Robert, and swords could keep Joffrey there as well, regardless of whose seed he was. We could marry him to Myrcella, once we’ve sent Sansa Stark back to her mother. That would show the realm that the Lannisters are above their laws, like gods and Targaryens.  Jaime had decided that he would return Sansa, and the younger girl as well if she could be found. It was not like to win him back his lost honor, but the notion of keeping faith when they all expected betrayal amused him more than he could say.  They were riding past a trampled wheatfield and a low stone wall when Jaime heard a soft thrum from behind, as if a dozen birds had taken flight at once.  Down!  he shouted, throwing himself against the neck of his horse. The gelding screamed and reared as an arrow took him in the rump. Other shafts went hissing past. Jaime saw Ser Cleos lurch from the saddle, twisting as his foot caught in the stirrup. His palfrey bolted, and Frey was dragged past shouting, head bouncing against the ground.  Jaime’s gelding lumbered off ponderously, blowing and snorting in pain. He craned around to look for Brienne. She was still ahorse, an arrow lodged in her back and another in her leg, but she seemed not to feel them. He saw her pull her sword and wheel in a circle, searching for the bowmen.  Behind the wall,  Jaime called, fighting to turn his half-blind mount back toward the fight. The reins were tangled in his damned chains, and the air was full of arrows again.  At them!  he shouted, kicking to show her how it was done. The old sorry horse found a burst of speed from somewhere. Suddenly they were racing across the wheatfield, throwing up clouds of chaff. Jaime had just enough time to think, The wench had better follow before they realize they’re being charged by an unarmed man in chains. Then he heard her coming hard behind.  Evenfall!  she shouted as her plow horse thundered by. She brandished her longsword.  Tarth! Tarth!   A few last arrows sped harmlessly past; then the bowmen broke and ran, the way unsupported bowmen always broke and ran before the charge of knights. Brienne reined up at the wall. By the time Jaime reached her, they had all melted into the wood twenty yards away.  Lost your taste for battle?    They were running.    That’s the best time to kill them.   She sheathed her sword.  Why did you charge?    Bowmen are fearless so long as they can hide behind walls and shoot at you from afar, but if you come at them, they run. They know what will happen when you reach them. You have an arrow in your back, you know. And another in your leg. You ought to let me tend them.    You?    Who else? The last I saw of cousin Cleos, his palfrey was using his head to plow a furrow. Though I suppose we ought to find him. He is a Lannister of sorts.   They found Cleos still tangled in his stirrup. He had an arrow through his right arm and a second in his chest, but it was the ground that had done for him. The top of his head was matted with blood and mushy to the touch, pieces of broken bone moving under the skin beneath the pressure of Jaime’s hand.  Brienne knelt and held his hand.  He’s still warm.    He’ll cool soon enough. I want his horse and his clothes. I’m weary of rags and fleas.    He was your cousin.  The wench was shocked.   Was,  Jaime agreed.  Have no fear, I am amply provisioned in cousins. I’ll have his sword as well. You need someone to share the watches.    You can stand a watch without weapons.  She rose.   Chained to a tree? Perhaps I could. Or perhaps I could make my own bargain with the next lot of outlaws and let them slit that thick neck of yours, wench.    I will not arm you."
}