{
  "id": "21e9bbca63a893dcb1ff5b2e62c5c37cd95cd513",
  "text": " Do as you will, but do not ask me to fix my seal to it.   For a moment Robert did not seem to understand what Ned was saying. Defiance was not a dish he tasted often. Slowly his face changed as comprehension came. His eyes narrowed and a flush crept up his neck past the velvet collar. He pointed an angry finger at Ned.  You are the King’s Hand, Lord Stark. You will do as I command you, or I’ll find me a Hand who will.    I wish him every success.  Ned unfastened the heavy clasp that clutched at the folds of his cloak, the ornate silver hand that was his badge of office. He laid it on the table in front of the king, saddened by the memory of the man who had pinned it on him, the friend he had loved.  I thought you a better man than this, Robert. I thought we had made a nobler king.   Robert’s face was purple.  Out,  he croaked, choking on his rage.  Out, damn you, I’m done with you. What are you waiting for? Go, run back to Winterfell. And make certain I never look on your face again, or I swear, I’ll have your head on a spike!   Ned bowed, and turned on his heel without another word. He could feel Robert’s eyes on his back. As he strode from the council chambers, the discussion resumed with scarcely a pause.  On Braavos there is a society called the Faceless Men,  Grand Maester Pycelle offered.   Do you have any idea how costly they are?  Littlefinger complained.  You could hire an army of common sellswords for half the price, and that’s for a merchant. I don’t dare think what they might ask for a princess.   The closing of the door behind him silenced the voices. Ser Boros Blount was stationed outside the chamber, wearing the long white cloak and armor of the Kingsguard. He gave Ned a quick, curious glance from the corner of his eye, but asked no questions.  The day felt heavy and oppressive as he crossed the bailey back to the Tower of the Hand. He could feel the threat of rain in the air. Ned would have welcomed it. It might have made him feel a trifle less unclean. When he reached his solar, he summoned Vayon Poole. The steward came at once.  You sent for me, my lord Hand?    Hand no longer,  Ned told him.  The king and I have quarreled. We shall be returning to Winterfell.    I shall begin making arrangements at once, my lord. We will need a fortnight to ready everything for the journey.    We may not have a fortnight. We may not have a day. The king mentioned something about seeing my head on a spike.  Ned frowned. He did not truly believe the king would harm him, not Robert. He was angry now, but once Ned was safely out of sight, his rage would cool as it always did.  Always? Suddenly, uncomfortably, he found himself recalling Rhaegar Targaryen. Fifteen years dead, yet Robert hates him as much as ever. It was a disturbing notion… and there was the other matter, the business with Catelyn and the dwarf that Yoren had warned him of last night. That would come to light soon, as sure as sunrise, and with the king in such a black fury… Robert might not care a fig for Tyrion Lannister, but it would touch on his pride, and there was no telling what the queen might do.   It might be safest if I went on ahead,  he told Poole.  I will take my daughters and a few guardsmen. The rest of you can follow when you are ready. Inform Jory, but tell no one else, and do nothing until the girls and I have gone. The castle is full of eyes and ears, and I would rather my plans were not known.    As you command, my lord.   When he had gone, Eddard Stark went to the window and sat brooding. Robert had left him no choice that he could see. He ought to thank him. It would be good to return to Winterfell. He ought never have left. His sons were waiting there. Perhaps he and Catelyn would make a new son together when he returned, they were not so old yet. And of late he had often found himself dreaming of snow, of the deep quiet of the wolfswood at night.  And yet, the thought of leaving angered him as well. So much was still undone. Robert and his council of cravens and flatterers would beggar the realm if left unchecked… or, worse, sell it to the Lannisters in payment of their loans. And the truth of Jon Arryn’s death still eluded him. Oh, he had found a few pieces, enough to convince him that Jon had indeed been murdered, but that was no more than the spoor of an animal on the forest floor. He had not sighted the beast itself yet, though he sensed it was there, lurking, hidden, treacherous.  It struck him suddenly that he might return to Winterfell by sea. Ned was no sailor, and ordinarily would have preferred the kingsroad, but if he took ship he could stop at Dragonstone and speak with Stannis Baratheon. Pycelle had sent a raven off across the water, with a polite letter from Ned requesting Lord Stannis to return to his seat on the small council. As yet, there had been no reply, but the silence only deepened his suspicions. Lord Stannis shared the secret Jon Arryn had died for, he was certain of it. The truth he sought might very well be waiting for him on the ancient island fortress of House Targaryen."
}