{
  "id": "2537d6883c4fbe43323b1aec42b76da84ac6ed2c",
  "text": " The Old Bear might not be hungry, but Jon was. He drifted over toward the fire.  Dywen was holding forth, spoon in hand.  I know this wood as well as any man alive, and I tell you, I wouldn’t care to ride through it alone tonight. Can’t you smell it?   Grenn was staring at him with wide eyes, but Dolorous Edd said,  All I smell is the shit of two hundred horses. And this stew. Which has a similar aroma, now that I come to sniff it.    I’ve got your similar aroma right here.  Hake patted his dirk. Grumbling, he filled Jon’s bowl from the kettle.  The stew was thick with barley, carrot, and onion, with here and there a ragged shred of salt beef, softened in the cooking.   What is it you smell, Dywen?  asked Grenn.  The forester sucked on his spoon a moment. He had taken out his teeth. His face was leathery and wrinkled, his hands gnarled as old roots.  Seems to me like it smells… well… cold.    Your head’s as wooden as your teeth,  Hake told him.  There’s no smell to cold.   There is, thought Jon, remembering the night in the Lord Commander’s chambers. It smells like death. Suddenly he was not hungry anymore. He gave his stew to Grenn, who looked in need of an extra supper to warm him against the night.  The wind was blowing briskly when he left. By morning, frost would cover the ground, and the tent ropes would be stiff and frozen. A few fingers of spiced wine sloshed in the bottom of the kettle. Jon fed fresh wood to the fire and put the kettle over the flames to reheat. He flexed his fingers as he waited, squeezing and spreading until the hand tingled. The first watch had taken up their stations around the perimeter of the camp. Torches flickered all along the ringwall. The night was moonless, but a thousand stars shone overhead.  A sound rose out of the darkness, faint and distant, but unmistakable: the howling of wolves. Their voices rose and fell, a chilly song, and lonely. It made the hairs rise along the back of his neck. Across the fire, a pair of red eyes regarded him from the shadows. The light of the flames made them glow.   Ghost,  Jon breathed, surprised.  So you came inside after all, eh?  The white wolf often hunted all night; he had not expected to see him again till daybreak.  Was the hunting so bad?  he asked.  Here. To me, Ghost.   The direwolf circled the fire, sniffing Jon, sniffing the wind, never still. It did not seem as if he were after meat right now. When the dead came walking, Ghost knew. He woke me, warned me. Alarmed, he got to his feet.  is something out there? Ghost, do you have a scent?  Dywen said he smelled cold.  The direwolf loped off, stopped, looked back. He wants me to follow. Pulling up the hood of his cloak, Jon walked away from the tents, away from the warmth of his fire, past the lines of shaggy little garrons. One of the horses whickered nervously when Ghost padded by. Jon soothed him with a word and paused to stroke his muzzle. He could hear the wind whistling through cracks in the rocks as they neared the ringwall. A voice called out a challenge. Jon stepped into the torchlight.  I need to fetch water for the Lord Commander.    Go on, then,  the guard said.  Be quick about it.  Huddled beneath his black cloak, with his hood drawn up against the wind, the man never even looked to see if he had a bucket.  Jon slipped sideways between two sharpened stakes while Ghost slid beneath them. A torch had been thrust down into a crevice, its flames flying pale orange banners when the gusts came. He snatched it up as he squeezed through the gap between the stones. Ghost went racing down the hill. Jon followed more slowly, the torch thrust out before him as he made his descent. The camp sounds faded behind him. The night was black, the slope steep, stony, and uneven. A moment’s inattention would be a sure way to break an ankle… or his neck. What am I doing? he asked himself as he picked his way down.  The trees stood beneath him, warriors armored in bark and leaf, deployed in their silent ranks awaiting the command to storm the hill. Black, they seemed… it was only when his torchlight brushed against them that Jon glimpsed a flash of green. Faintly, he heard the sound of water flowing over rocks. Ghost vanished in the underbrush. Jon struggled after him, listening to the call of the brook, to the leaves sighing in the wind. Branches clutched at his cloak, while overhead thick limbs twined together and shut out the stars.  He found Ghost lapping from the stream.  Ghost,  he called,  to me. Now.  When the direwolf raised his head, his eyes glowed red and baleful, and water streamed down from his jaws like slaver. There was something fierce and terrible about him in that instant. And then he was off, bounding past Jon, racing through the trees.  Ghost, no, stay,  he shouted, but the wolf paid no heed. The lean white shape was swallowed by the dark, and Jon had only two choices—to climb the hill again, alone, or to follow.  He followed, angry, holding the torch out low so he could see the rocks that threatened to trip him with every step, the thick roots that seemed to grab as his feet, the holes where a man could twist an ankle."
}