{
  "id": "25be21485972b51328e729f86d5587c0a9d00269",
  "text": " He could not say which two. Another impact echoed over the water an instant later, and then a third. Beneath the screech of splintering wood, he heard the deep thrum-thump of the Fury’s fore catapult. Stag of the Sea split one of Joffrey’s galleys clean in two, but Dog’s Nose was afire and Queen Alysanne was locked between Lady of Silk and Lady’s Shame, her crew fighting the boarders rail-to-rail.  Directly ahead, Davos saw the enemy’s Kingslander drive between Faithful and Sceptre. The former slid her starboard oars out of the way before impact, but Sceptre’s portside oars snapped like so much kindling as Kingslander raked along her side.  Loose,  Davos commanded, and his bowmen sent a withering rain of shafts across the water. He saw Kingslander’s captain fall, and tried to recall the man’s name.  Ashore, the arms of the great trebuchets rose one, two, three, and a hundred stones climbed high into the yellow sky. Each one was as large as a man’s head; when they fell they sent up great gouts of water, smashed through oak planking, and turned living men into bone and pulp and gristle. All across the river the first line was engaged. Grappling hooks were flung out, iron rams crashed through wooden hulls, boarders swarmed, flights of arrows whispered through each other in the drifting smoke, and men died… but so far, none of his.  Black Betha swept upriver, the sound of her oarmaster’s drum thundering in her captain’s head as he looked for a likely victim for her ram. The beleaguered Queen Alysanne was trapped between two Lannister warships, the three made fast by hooks and lines.   Ramming speed!  Davos shouted.  The drumbeats blurred into a long fevered hammering, and Black Betha flew, the water turning white as milk as it parted for her prow. Allard had seen the same chance; Lady Marya ran beside them. The first line had been transformed into a confusion of separate struggles. The three tangled ships loomed ahead, turning, their decks a red chaos as men hacked at each other with sword and axe. A little more, Davos Seaworth beseeched the Warrior, bring her around a little more, show me her broadside.  The Warrior must have been listening. Black Betha and Lady Marya slammed into the side of Lady’s Shame within an instant of each other, ramming her fore and aft with such force that men were thrown off the deck of Lady of Silk three boats away. Davos almost bit his tongue off when his teeth jarred together. He spat out blood. Next time close your mouth, you fool. Forty years at sea, and yet this was the first time he’d rammed another ship. His archers were loosing arrows at will.   Back water,  he commanded. When Black Betha reversed her oars, the river rushed into the splintered hole she left, and Lady’s Shame fell to pieces before his eyes, spilling dozens of men into the river. Some of the living swam; some of the dead floated; the ones in heavy mail and plate sank to the bottom, the quick and the dead alike. The pleas of drowning men echoed in his ears.  A flash of green caught his eye, ahead and off to port, and a nest of writhing emerald serpents rose burning and hissing from the stern of Queen Alysanne. An instant later Davos heard the dread cry of  Wildfire!   He grimaced. Burning pitch was one thing, wildfire quite another. Evil stuff, and well-nigh unquenchable. Smother it under a cloak and the cloak took fire; slap at a fleck of it with your palm and your hand was aflame.  Piss on wildfire and your cock burns off,  old seamen liked to say. Still, Ser Imry had warned them to expect a taste of the alchemists’ vile substance. Fortunately, there were few true pyromancers left. They will soon run out, Ser Imry had assured them.  Davos reeled off commands; one bank of oars pushed off while the other backed water, and the galley came about. Lady Marya had won clear too, and a good thing; the fire was spreading over Queen Alysanne and her foes faster than he would have believed possible. Men wreathed in green flame leapt into the water, shrieking like nothing human. On the walls of King’s Landing, spitfires were belching death, and the great trebuchets behind the Mud Gate were throwing boulders. One the size of an ox crashed down between Black Betha and Wraith, rocking both ships and soaking every man on deck. Another, not much smaller, found Bold Laughter. The Velaryon galley exploded like a child’s toy dropped from a tower, spraying splinters as long as a man’s arm.  Through black smoke and swirling green fire, Davos glimpsed a swarm of small boats bearing downriver: a confusion of ferries and wherries, barges, skiffs, rowboats, and hulks that looked too rotten to float. It stank of desperation; such driftwood could not turn the tide of a fight, only get in the way. The lines of battle were hopelessly ensnarled, he saw. Off to port, Lord Steffon, Ragged Jenna, and Swift Sword had broken through and were sweeping upriver. The starboard wing was heavily engaged, however, and the center had shattered under the stones of those trebuchets, some captains turning downstream, others veering to port, anything to escape that crushing rain."
}