{
  "id": "26713867e7ce2f38138caeae31b096a72991da00",
  "text": " For it was in the  one thousand  six hundred  and first   year of the  Third Age  that the  Fallohide brothers, Marcho and Blanco, set  out  from  Bree; and having  obtained  permission  from  the  high  king  at  Fornost1,  they crossed the brown river Baranduin with a  great following of   ####-Hobbits.  They passed over the Bridge of Stonebows, that had been  built  in  the  days  of the  power of the North Kingdom,  and they took ail  the  land  beyond  to  dwell in,  between  the river and  the Far Downs.  All  that was  demanded of them was  that they should keep the Great Bridge in  repair, and  all other bridges  and roads,  speed the king's messengers, and  acknowledge  his lordship.       Thus began  the Shire-reckoning, for the year  of  the  crossing of the  Brandywine (as the  Hobbits turned the name) became  Year One  of the Shire,  and all later dates were reckoned from it.2 At once the western Hobbits fell  in love with their new land, and they  remained there, and soon passed  once  more out  of the history  of Men and of Elves. While there  was still a king  they  were in name his subjects, but they were, in  fact, ruled by their own  chieftains  and meddled not at all with events in the world outside. To  the  last  battle at Fornost with the Witch -lord of Angmar they  sent some bowmen  to the aid of the king, or so they maintained, though no tales of Men record  it.  But in that war the North Kingdom ended; and then the  Hobbits took the  land for their own, and they chose from their own chiefs a Thain to hold the  authority of the king that  was  gone. There for a thousand years  they were  little troubled  by wars, and  they prospered and  multiplied after the Dark  Plague (S.R. 37) until the disaster of  the Long Winter and the famine  that  followed it. Many thousands then  perished, but the Days of Dearth (1158-60)  were at the time of this  tale long past and  the Hobbits  had again  become  accustomed  to plenty. The land  was rich and kindly, and though it had long  been deserted  when they entered it,  it  had  before been  well tilled, and  there the king had once had many farms, cornlands, vineyards, and woods.        Forty leagues it stretched from the Far Downs to the Brandywine Bridge,  and fifty from the northern moors to  the marshes in the south. The  Hobbits  named  it  the Shire, as the region of the  authority of their Thain,  and a   district of well-ordered  business; and there  in that pleasant  comer of the  world they plied their well-ordered business of living, and they heeded less  and less the world outside where dark things moved, until they came to think  that  peace and  plenty were the rule in Middle-earth and the  right of  all  sensible folk. They forgot or ignored what little they had ever known of the  Guardians, and of  the labours of those that made possible the long peace of  the  Shire. They were, in fact, sheltered, but they had ceased  to  remember   it.       At no  time had Hobbits of any  kind been  warlike, and  they had never    ####-fought  among  themselves. In olden days  they had, of  course,  been  often  obliged to fight to maintain themselves in a hard world; but in Bilbo's time  that was very ancient history. The last battle, before this story opens, and  indeed the  only  one  that had ever been  fought  within the borders of the  Shire, was beyond  living memory: the Battle  of  Greenfields, S.R. 1147, in   which Bandobras Took routed an invasion of Orcs. Even the weathers had  grown  milder, and the  wolves  that had once  come ravening  out of the  North  in  bitter white winters were  now only  a grandfather's tale. So,  though there  was still  some store of  weapons in the  Shire, these were  used  mostly as  trophies, hanging above hearths or on  walls, or gathered into the museum at  Michel Delving. The  Mathom-house it was  called; for  anything that Hobbits  had  no immediate use for, but were unwilling to throw away,  they  called a   mathom.  Their dwellings were apt to become rather crowded with mathoms,  and  many of the presents that passed from hand to hand were of that son.       Nonetheless, ease and peace had left this people still curiously tough.  They were,  if it came to it, difficult to daunt or to kill; and they  were,  perhaps,  so unwearyingly fond of  good things not least because they could,  when put to it, do without them,  and could survive rough handling by grief,   foe,  or weather in  a way that astonished those who did not know them  well  and  looked  no further than their bellies and their well-fed  faces. Though  slow to quarrel, and for sport killing nothing that lived, they were doughty  at bay,  and  at  need could still handle arms. They shot well with the bow,   for they were keen-eyed and sure at the mark. Not only with bows and arrows.   If any Hobbit stooped for a stone,  it was well to get  quickly under cover,  as all trespassing beasts knew very well.       All Hobbits had originally  lived in  holes in the  ground, or  so they  believed,  and in such dwellings they still  felt most at  home; but  in  the  course of time they had been obliged to adopt other forms of abode."
}