{
  "id": "2869b38882f5a9f1720cba9ffce507b2529fa006",
  "text": "   Oh, trout makes for a tasty supper.  Bolton lifted a pale finger toward his cupbearer.  Though my poor Elmar is bereft. He was to wed Arya Stark, but my good father of Frey had no choice but to break the betrothal when King Robb betrayed him.    Is there word of Arya Stark?  Brienne leaned forward.  Lady Catelyn had feared that… is the girl still alive?    Oh, yes,  said the Lord of the Dreadfort.   You have certain knowledge of that, my lord?   Roose Bolton shrugged.  Arya Stark was lost for a time, it was true, but now she has been found. I mean to see her returned safely to the north.    Her and her sister both,  said Brienne.  Tyrion Lannister has promised us both girls for his brother.   That seemed to amuse the Lord of the Dreadfort.  My lady, has no one told you? Lannisters lie.    Is that a slight on the honor of my House?  Jaime picked up the cheese knife with his good hand.  A rounded point, and dull,  he said, sliding his thumb along the edge of the blade,  but it will go through your eye all the same.  Sweat beaded his brow. He could only hope he did not look as feeble as he felt.  Lord Bolton’s little smile paid another visit to his lips.  You speak boldly for a man who needs help to break his bread. My guards are all around us, I remind you.    All around us, and half a league away.  Jaime glanced down the vast length of the hall.  By the time they reach us, you’ll be as dead as Aerys.    ’Tis scarcely chivalrous to threaten your host over his own cheese and olives,  the Lord of the Dreadfort scolded.  In the north, we hold the laws of hospitality sacred still.    I’m a captive here, not a guest. Your goat cut off my hand. If you think some prunes will make me overlook that, you’re bloody well mistaken.   That took Roose Bolton aback.  Perhaps I am. Perhaps I ought to make a wedding gift of you to Edmure Tully… or strike your head off, as your sister did for Eddard Stark.    I would not advise it. Casterly Rock has a long memory.    A thousand leagues of mountain, sea, and bog lie between my walls and your rock. Lannister enmity means little to Bolton.    Lannister friendship could mean much.  Jaime thought he knew the game they were playing now. But does the wench know as well? He dare not look to see.   I am not certain you are the sort of friends a wise man would want.  Roose Bolton beckoned to the boy.  Elmar, carve our guests a slice off the roast.   Brienne was served first, but made no move to eat.  My lord,  she said,  Ser Jaime is to be exchanged for Lady Catelyn’s daughters. You must free us to continue on our way.    The raven that came from Riverrun told of an escape, not an exchange. And if you helped this captive slip his bonds, you are guilty of treason, my lady.   The big wench rose to her feet.  I serve Lady Stark.    And I the King in the North. Or the King Who Lost the North, as some now call him. Who never wished to trade Ser Jaime back to the Lannisters.    Sit down and eat, Brienne,  Jaime urged, as Elmar placed a slice of roast before him, dark and bloody.  If Bolton meant to kill us, he wouldn’t be wasting his precious prunes on us, at such peril to his bowels.  He stared at the meat and realized there was no way to cut it, one-handed. I am worth less than a girl now, he thought. The goat’s evened the trade, though I doubt Lady Catelyn will thank him when Cersei returns her whelps in like condition. The thought made him grimace. I will get the blame for that as well, I’ll wager.  Roose Bolton cut his meat methodically, the blood running across his plate.  Lady Brienne, will you sit if I tell you that I hope to send Ser Jaime on, just as you and Lady Stark desire?    I… you’d send us on?  The wench sounded wary, but she sat.  That is good, my lord.    It is. However, Lord Vargo has created me one small… difficulty.  He turned his pale eyes on Jaime.  Do you know why Hoat cut off your hand?    He enjoys cutting off hands.  The linen that covered Jaime’s stump was spotted with blood and wine.  He enjoys cutting off feet as well. He doesn’t seem to need a reason.    Nonetheless, he had one. Hoat is more cunning than he appears. No man commands a company such as the Brave Companions for long unless he has some wits about him.  Bolton stabbed a chunk of meat with the point of his dagger, put it in his mouth, chewed thoughtfully, swallowed.  Lord Vargo abandoned House Lannister because I offered him Harrenhal, a reward a thousand times greater than any he could hope to have from Lord Tywin. As a stranger to Westeros, he did not know the prize was poisoned.    The curse of Harren the Black?  mocked Jaime.   The curse of Tywin Lannister.  Bolton held out his goblet and Elmar refilled it silently.  Our goat should have consulted the Tarbecks or the Reynes. They might have warned him how your lord father deals with betrayal.    There are no Tarbecks or Reynes,  said Jaime.   My point precisely. Lord Vargo doubtless hoped that Lord Stannis would triumph at King’s Landing, and thence confirm him in his possession of this castle in gratitude for his small part in the downfall of House Lannister."
}