{
  "id": "2c8e365672f408f435176cf64d0ee373735d56f7",
  "text": " So they  all  got  up  and  prepared  to  move.  The  wind  was  howling  and  the  thunder  still  growling, and  they had a business getting  themselves and  their ponies along. Still  it was not very far to go, and before long they came to a big rock standing out into  the path. If you stepped behind, you found a low arch in the side of the mountain.  There was just room to get the ponies through with a squeeze, when they had been  unpacked  and  unsaddled.  As  they  passed  under  the  arch,  it was  good  to  hear  the  wind and the rain outside instead of all about them, and to feel safe from the giants  and their rocks. But the wizard was taking no risks. He lit up his wand  - as he did  that  day  in Bilbo's  dining-room  that  seemed  so  long ago,  if you remember—, and  by its light they explored the cave from end to end.  It seemed quite a fair size, but not  too  large and mysterious. It had a dry floor  and some comfortable nooks. At one end there was room for the ponies; and there  they stood (mighty glad of the change) steaming, and champing in their nosebags.  Oin  and Gloin wanted  to  light  a  fire  at  the  door  to  dry  their  clothes,  but Gandalf  would not hear of  it. So  they  spread out  their wet  things on  the  floor, and got dry  ones out of  their bundles;  then they made their blankets comfortable, got out their  pipes  and  blew  smoke  rings,  which  Gandalf  turned  into  different  colours  and  set  dancing  up  by  the  roof  to  amuse  them.  They  talked  and  talked,  and  forgot  about  the  storm, and discussed what each would  do with his share of the treasure (when  they got it, which at the moment did not seem so impossible); and so they dropped  off  to  sleep  one  by  one.  And  that  was  the  last  time  that  they  used  the  ponies,  packages, baggages, tools and paraphernalia that they had brought with them.  It  turned  out  a  good  thing  that  night  that  they  had  brought  little  Bilbo  with  them, after all. For somehow, he could not go  to sleep for a  long while; and when  he did sleep, he had very nasty dreams. He dreamed that a crack in the wall at the  back  of  the  cave  got  bigger  and  bigger,  and  opened wider  and wider,  and  he was   ####-very  afraid  but  could  not  call  out  or  do  anything  but  lie  and  look.  Then  he  dreamed  that  the floor of  the cave was giving way, and he was slipping-beginning  to fall down, down, goodness knows where to.  At  that he woke up with a horrible start, and found  that part of his dream was  true. A crack had opened at the back of the cave, and was already a wide passage.  He  was  just  in  time  to  see  the  last  of  the  ponies'  tails  disappearing  into  it.  Of  course  he  gave  a  very  loud  yell,  as  loud  a  yell  as  a  hobbit  can  give,  which  is  surprising for their size.  Out  jumped  the  goblins,  big  goblins,  great  ugly-looking  goblins,  lots  of  goblins,  before  you  could  say  rocks  and  blocks.  There were  six  to each dwarf, at  least,  and  two  even  for Bilbo;  and  they were  all  grabbed  and  carried  through  the  crack,  before  you  could  say  tinder  and  flint.  But  not  Gandalf.  Bilbo's  yell  had  done  that  much  good.  It  had  wakened  him  up  wide  in  a  splintered  second,  and  when  goblins  came  to  grab  him,  there  was  a  terrible  flash  like  lightning  in  the  cave, a smell like gunpowder, and several of them fell dead.  The  crack  closed with  a  snap,  and  Bilbo  and  the  dwarves were  on  the wrong  side  of  it! Where was Gandalf? Of  that neither they nor the goblins had any idea,  and  the  goblins  did  not  wait  to  find  out.  It  was  deep,  deep,  dark,  such  as  only  goblins  that  have  taken  to  living  in  the  heart  of  the  mountains  can  see  through.  The  passages  there  were  crossed  and  tangled  in  all  directions,  but  the  goblins  knew  their  way,  as  well  as  you  do  to  the  nearest  post-office;  and  the  way  went  down and down, and it was most horribly stuffy. The goblins were very rough, and  pinched  unmercifully,  and  chuckled  and  laughed  in  their  horrible  stony  voices;  and Bilbo was more  unhappy  even  than when  the  troll  had  picked  him  up  by  his  toes.  He  wished  again  and  again  for  his  nice  bright  hobbit-hole. Not  for  the  last  time.  Now  there  came  a  glimmer  of  a  red  light  before  them.  The  goblins  began  to  sing,  or  croak,  keeping  time  with  the  flap  of  their  flat  feet  on  the  stone,  and  shaking their prisoners as well.     Clap! Snap! the black crack!  Grip, grab! Pinch, nab!  And down down to Goblin -town   You go, my lad!    Clash, crash! Crush, smash!  Hammer and tongs! Knocker and gongs!  Pound, pound, far underground!   ####-Ho, ho! my lad!    Swish, smack! Whip crack!  Batter and beat! Yammer and bleat!  Work, work! Nor dare to shirk,  While Goblins quaff, and Goblins laugh,  Round and round far underground  Below, my lad!     It  sounded  truly  terrifying."
}