{
  "id": "2d21f2910b2c49de6e50d670b1730aa0ad0f8dbd",
  "text": " Since then Arya had taken to walking around with her cloak draped over her right arm, to conceal the blade at her hip. The wooden sword she carried in her left hand, out where everybody could see it, to scare off robbers, but there were men in the pot-shops who wouldn’t have been scared off if she’d had a battle-axe. It was enough to make her lose her taste for pigeon and stale bread. Often as not, she went to bed hungry rather than risk the stares.  Once she was outside the city, she would find berries to pick, or orchards she might raid for apples and cherries. Arya remembered seeing some from the kingsroad on the journey south. And she could dig for roots in the forest, even run down some rabbits. In the city, the only things to run down were rats and cats and scrawny dogs. The potshops would give you a fistful of coppers for a litter of pups, she’d heard, but she didn’t like to think about that.  Down below the Street of Flour was a maze of twisting alleys and cross streets. Arya scrambled through the crowds, trying to put distance between her and the gold cloaks. She had learned to keep to the center of the street. Sometimes she had to dodge wagons and horses, but at least you could see them coming. If you walked near the buildings, people grabbed you. In some alleys you couldn’t help but brush against the walls; the buildings leaned in so close they almost met.  A whooping gang of small children went running past, chasing a rolling hoop. Arya stared at them with resentment, remembering the times she’d played at hoops with Bran and Jon and their baby brother Rickon. She wondered how big Rickon had grown, and whether Bran was sad. She would have given anything if Jon had been here to call her  little sister  and muss her hair. Not that it needed mussing. She’d seen her reflection in puddles, and she didn’t think hair got any more mussed than hers.  She had tried talking to the children she saw in the street, hoping to make a friend who would give her a place to sleep, but she must have talked wrong or something. The little ones only looked at her with quick, wary eyes and ran away if she came too close. Their big brothers and sisters asked questions Arya couldn’t answer, called her names, and tried to steal from her. Only yesterday, a scrawny barefoot girl twice her age had knocked her down and tried to pull the boots off her feet, but Arya gave her a crack on her ear with her stick sword that sent her off sobbing and bleeding.  A gull wheeled overhead as she made her way down the hill toward Flea Bottom. Arya glanced at it thoughtfully, but it was well beyond the reach of her stick. It made her think of the sea. Maybe that was the way out. Old Nan used to tell stories of boys who stowed away on trading galleys and sailed off into all kinds of adventures. Maybe Arya could do that too. She decided to visit the riverfront. It was on the way to the Mud Gate anyway, and she hadn’t checked that one today.  The wharfs were oddly quiet when Arya got there. She spied another pair of gold cloaks, walking side by side through the fish market, but they never so much as looked at her. Half the stalls were empty, and it seemed to her that there were fewer ships at dock than she remembered. Out on the Blackwater, three of the king’s war galleys moved in formation, gold-painted hulls splitting the water as their oars rose and fell. Arya watched them for a bit, then began to make her way along the river.  When she saw the guardsmen on the third pier, in grey woolen cloaks trimmed with white satin, her heart almost stopped in her chest. The sight of Winterfell’s colors brought tears to her eyes. Behind them, a sleek three-banked trading galley rocked at her moorings. Arya could not read the name painted on the hull; the words were strange, Myrish, Braavosi, perhaps even High Valyrian. She grabbed a passing longshoreman by the sleeve.  Please,  she said,  what ship is this?    She’s the Wind Witch, out of Myr,  the man said.   She’s still here,  Arya blurted. The longshoreman gave her a queer look, shrugged, and walked away. Arya ran toward the pier. The Wind Witch was the ship Father had hired to take her home… still waiting! She’d imagined it had sailed ages ago.  Two of the guardsmen were dicing together while the third walked rounds, his hand on the pommel of his sword. Ashamed to let them see her crying like a baby, she stopped to rub at her eyes. Her eyes her eyes her eyes, why did…  Look with your eyes, she heard Syrio whisper.  Arya looked. She knew all of her father’s men. The three in the grey cloaks were strangers.  You,  the one walking rounds called out.  What do you want here, boy?  The other two looked up from their dice.  It was all Arya could do not to bolt and run, but she knew that if she did, they would be after her at once. She made herself walk closer. They were looking for a girl, but he thought she was a boy. She’d be a boy, then.  Want to buy a pigeon?  She showed him the dead bird.   Get out of here,  the guardsman said."
}