{
  "id": "2e63f4bd3c39229c3ffd89a53628b337af0f029b",
  "text": "  None  seemed  to  find  their  mark.  The  deer  turned  and  vanished  in  the  trees  as  silently  as  they  had  come,  and  in  vain  the  dwarves  shot  their arrows after them.  \"Stop!  stop!\"  shouted  Thorin;  but  it  was  too  late,  the  excited  dwarves  had  wasted  their  last  arrows,  and  now  the  bows  that  Beorn  had  given  them  were  useless.  They  were  a  gloomy  party  that  night,  and  the  gloom  gathered  still  deeper  on  them in the following days. They had crossed the enchanted stream; but beyond it  the  path  seemed  to  straggle  on  just  as  before,  and  in  the  forest  they  could  see  no  change.  Yet  if  they  had  known  more  about  it  and  considered  the  meaning  of  the  hunt  and  the  white  deer  that  had  appeared  upon  their  path,  they  would  have  known  that  they  were  at  last  drawing  towards  the  eastern  edge,  and  would  soon  have  come,  if  they  could  have  kept  up  their  courage  and  their  hope,  to  thinner  trees and places where the sunlight came again.  But  they  did  not  know  this,  and  they  were  burdened  with  the  heavy  body  of  Bombur,  which  they  had  to  carry  along  with  them  as  best  they  could,  taking  the  wearisome  task  in  turns  of  four  each while  the  others  shared  their  packs.  If  these  had not become all too light in the last few days, they would never have managed  it;  but  a  slumbering  and  smiling  Bombur  was  a  poor  exchange  for  packs  filled  with  food  however  heavy.  In  a  few  days  a  time  came when  there was  practically   ####-nothing  left  to  eat  or  to  drink. Nothing wholesome  could  they  see  growing  in  the  woods, only funguses and herbs with pale leaves and unpleasant smell.  About four days from the enchanted stream they  came to a part where most of  the trees were beeches. They were at first inclined to be cheered by the change, for  here  there  was  no  undergrowth  and  the  shadow  was  not  so  deep.  There  was  a  greenish light about them, and in places they could see some distance to either side  of  the  path.  Yet  the  light  only  showed  them  endless  lines  of  straight  grey  trunks  like the pillars of some huge twilight hall. There was a breath of air and a noise of  wind,  but  it  had  a  sad  sound.  A  few  leaves  came  rustling  down  to  remind  them  that  outside  autumn was  coming  on.  Their  feet  ruffled  among  the  dead  leaves  of  countless other  autumns  that drifted over  the banks of  the path  from  the deep  red  carpets of the forest.  Still Bombur  slept  and  they grew very weary. At  times  they heard disquieting  laughter.  Sometimes  there  was  singing  in  the  distance  too.  The  laughter  was  the  laughter of fair voices not of goblins, and the singing was beautiful, but it sounded  eerie and  strange, and  they were not comforted,  rather  they hurried on  from  those  parts with what strength they had left.  Two  days  later  they  found  their  path  going  downwards  and  before  long  they  were in a valley filled almost entirely with a mighty growth of oaks.  \"Is there no end to this accursed forest?\" said Thorin.  \"Somebody must climb a tree and see if he can get his head above the roof and  have  a  look  round.  The  only  way  is  to  choose  the  tallest  tree  that  overhangs  the  path.\"  Of course \"somebody\" meant Bilbo. They chose him because  to be of any use  the  climber  must  get  his  head  above  the  topmost  leaves,  and  so  he must  be  light  enough for the highest and slenderest branches to bear him. Poor Mr. Baggins had  never had much practice in climbing trees, but they hoisted him up into the lowest  branches of an enormous oak that grew right out into the path, and up he had to go  as best he could. He pushed his way through the tangled twigs with many a slap in  the eye; he was greened and grimed from the old bark of the greater boughs; more  than  once  he  slipped  and  caught  himself  just  in  time; and at  last, after a dreadful  struggle  in  a  difficult  place  where  there  seemed  to  be  no  convenient  branches  at  all, he got near the top. All the time he was wondering whether there were spiders  in the tree, and how he was going to get down again (except by falling).  In  the  end  he  poked  his  head  above  the  roof  of  leaves,  and  then  he  found  spiders  all  right.  But  they  were  only  small  ones  of  ordinary  size,  and  they  were  after  the  butterflies.  Bilbo's  eyes  were  nearly  blinded  by  the  light.  He  could  hear   ####-the dwarves shouting up at him from far below, but he could not answer, only hold  on  and  blink.  The  sun  was  shining  brilliantly,  and  it  was  a  long  while  before  he  could  bear  it. When  he  could,  he  saw  all  round  him  a  sea  of  dark  green,  ruffled  here  and  there  by the breeze; and there were everywhere hundreds of butterflies. I  expect  they were a kind of  'purple emperor,' a butterfly  that  loves  the  tops of oak- woods,  but  these  were  not  purple  at  all,  they  were  a  dark  dark  velvety  black  without any markings to be seen."
}