{
  "id": "2f36a22963447039a9cacbb414805eb87203e4c8",
  "text": " 'Now,   wait a bit and be patient! ' he said. Then he lay on the ground, leaning out  and looking  down: but the light  seemed to be fading quickly, although  the   sun had not yet set. 'I think we  could manage this,' he  said presently. `I   could at any rate; and you could too. if you kept your  head and followed me   carefully.'       `I don't know how you can be so sure,' said Sam. `Why! You can't see to  the bottom in this light. What if you comes to a place where there's nowhere  to put your feet or your hands?'       'Climb back, I suppose,' said Frodo.       'Easy said,' objected Sam. 'Better wait till morning and more light.'       `No! Not if I can help it,' said Frodo with a sudden strange vehemence.  `I grudge every hour, every minute. I'm  going down to try it out.  Don't you   follow till I come back or call!'       Gripping  the stony lip of  the  fall with  his fingers he  let himself  gently down, until when his arms were almost at full stretch, his toes found  a ledge.  'On_ e step down!  ' he  said. 'And this ledge broadens out to the  right. I could stand there without a hold. I'll--' his words were cut short.       The  hurrying  darkness, now gathering  great speed, rushed up from the  East and swallowed the sky. There was a dry splitting crack of thunder right   overhead. Searing  lightning smote down into the hills. Then came a blast of  savage wind, and with  it, mingling with its  roar, there came a high shrill  shriek. The hobbits had heard just such a cry far away in the Marish as they  fled  from Hobbiton, and even there  in the woods of the Shire it had frozen   ####-their blood.  Out  here  in the waste its terror was far greater: it pierced  them  with cold blades of horror and despair, stopping heart and breath. Sam  fell flat on his face. Involuntarily Frodo loosed his hold and put his hands  over his head and ears. He swayed,  slipped,  and slithered downwards with a  wailing cry.       Sam  heard him and crawled with an effort to the edge. 'Master, master!  ' he called.  'Master!'.        He heard no answer.  He  found he was  shaking all over, but he gathered   his breath, and once again he shouted: 'Master!' The wind seemed to blow his  voice back into his throat, but as it passed, roaring up  the gully and away  over the hills, a faint answering cry came to his ears:        'All right, all right! I'm here. But I can't see.'       Frodo  was  calling with a  weak voice. ,He  was not actually very  far  away. He had slid and not fallen, and had come up with a jolt to his feet on  a wider ledge not  many yards lower down. Fortunately  the  rock -face at this  point leaned well back and  the  wind had pressed him against the  cliff, so  that he had not toppled  over. He steadied himself a little, laying his face  against the cold stone, feeling  his heart pounding. But either the darkness  had  grown  complete, or else  his eyes had lost  their sight. All was black   about him. He wondered if he had been struck blind. He took a deep breath.        `Come  back!  Come  back! '  he heard Sam's voice out  of the blackness  above.       `I can't,' he said. `I  can't see. I can't find any hold. I can't  move  yet.'       `What  can  I do, Mr. Frodo? What can I do?  ' shouted Sam, leaning out  dangerously far.  Why could not his master see?  It was dim, certainly,  but  not as dark as all that. He could see Frodo below him, a grey forlorn figure  splayed against  the cliff. But  he was far out of the  reach of any helping  hand.       There  was another crack  of  thunder;  and then  the  rain came.  In a   blinding sheet, mingled with hail, it drove against the cliff, bitter cold.       'I'm  coming  down to you,' shouted Sam, though how he hoped to help in  that way he could not have said.       `No,  no!  wait!  ' Frodo  called back, more strongly now. `I  shall be  better  soon. I feel  better already. Wait! You can't do anything  without a   rope.'       `Rope!'  cried  Sam, talking wildly to himself  in  his  excitement and   ####-relief. `Well, if I don't deserve  to be hung on the end of one as a warning  to numbskulls!  You're nowt  but a ninnyhammer, Sam Gamgee: that's  what  the  Gaffer said to me often enough, it being a word of his. Rope!'       `Stop  chattering!' cried  Frodo,  now  recovered  enough to feel  both  amused and annoyed. 'Never mind your Gaffer! Are you trying to tell yourself  you've got some rope in your pocket? If so, out with it!       `Yes, Mr. Frodo, in my pack and  all.  Carried it hundreds of miles and  I'd clean forgotten it!'       `Then get busy and let an end down!'       Quickly  Sam  unslung  his pack and rummaged in it. There indeed at the  bottom was a coil  of the silken-grey rope made by the folk  of  Lurien.  He  cast an end to his master. The darkness seemed to lift from Frodo's eyes, or   else his sight was returning. He could see the grey line as it came dangling  down, and he thought it had a faint silver sheen. Now that he had some point   in the darkness to  fix his eyes on, he felt less giddy."
}