{
  "id": "2f7c0d2686f407fdf8b95cb7ca17c51df99624dc",
  "text": "  With a fearful big razor, yes.   Bronn’s coal-black hair was freshly washed and brushed straight back from the hard lines of his face, and he was dressed in high boots of soft, tooled leather, a wide belt studded with nuggets of silver, and a cloak of pale green silk. Across the dark grey wool of his doublet, a burning chain was embroidered diagonally in bright green thread.   Where have you been?  Tyrion demanded of him.  I sent for you… it must have been a fortnight ago.    Four days ago, more like,  the sellsword said,  and I’ve been here twice, and found you dead to the world.    Not dead. Though my sweet sister did try.  Perhaps he should not have said that aloud, but Tyrion was past caring. Cersei was behind Ser Mandon’s attempt to kill him, he knew that in his gut.  What’s that ugly thing on your chest?   Bronn grinned.  My knightly sigil. A flaming chain, green, on a smoke-grey field. By your lord father’s command, I’m Ser Bronn of the Blackwater now, Imp. See you don’t forget it.   Tyrion put his hands on the featherbed and squirmed back a few inches, against the pillows.  I was the one who promised you knighthood, remember?  He had liked that  by your lord father’s command  not at all. Lord Tywin had wasted little time. Moving his son from the Tower of the Hand to claim it for himself was a message anyone could read, and this was another.  I lose half my nose and you gain a knighthood. The gods have a deal to answer for.  His voice was sour.  Did my father dub you himself?    No. Them of us as survived the fight at the winch towers got ourselves dabbed by the High Septon and dubbed by the Kingsguard. Took half the bloody day, with only three of the White Swords left to do the honors.    I knew Ser Mandon died in the battle.  Shoved into the river by Pod, half a heartbeat before the treacherous bastard could drive his sword through my heart.  Who else was lost?    The Hound,  said Bronn.  Not dead, only gone. The gold cloaks say he turned craven and you led a sortie in his place.   Not one of my better notions. Tyrion could feel the scar tissue pull tight when he frowned. He waved Bronn toward a chair.  My sister has mistaken me for a mushroom. She keeps me in the dark and feeds me shit. Pod’s a good lad, but the knot in his tongue is the size of Casterly Rock, and I don’t trust half of what he tells me. I sent him to bring Ser Jacelyn and he came back and told me he’s dead.    Him, and thousands more.  Bronn sat.   How?  Tyrion demanded, feeling that much sicker.   During the battle. Your sister sent the Kettleblacks to fetch the king back to the Red Keep, the way I hear it. When the gold cloaks saw him leavin’ half of them decided they’d leave with him. Ironhand put himself in their path and tried to order them back to the walls. They say Bywater was blistering them good and almost had ’em ready to turn when someone put an arrow through his neck. He didn’t seem so fearsome then, so they dragged him off his horse and killed him.   Another debt to lay at Cersei’s door.  My nephew,  he said,  Joffrey. Was he in any danger?    No more’n some, and less than most.    Had he suffered any harm? Taken a wound? Mussed his hair, stubbed his toe, cracked a nail?    Not as I heard.    I warned Cersei what would happen. Who commands the gold cloaks now?    Your lord father’s given them to one of his westermen, some knight named Addam Marbrand.   In most cases the gold cloaks would have resented having an outsider placed over them, but Ser Addam Marbrand was a shrewd choice. Like Jaime, he was the sort of man other men liked to follow. I have lost the City Watch.  I sent Pod looking for Shagga, but he’s had no luck.    The Stone Crows are still in the kingswood. Shagga seems to have taken a fancy to the place. Timett led the Burned Men home, with all the plunder they took from Stannis’s camp after the fighting. Chella turned up with a dozen Black Ears at the River Gate one morning, but your father’s red cloaks chased them off while the Kingslanders threw dung and cheered.   Ingrates. The Black Ears died for them. Whilst Tyrion lay drugged and dreaming, his own blood had pulled his claws out, one by one.  I want you to go to my sister. Her precious son made it through the battle unscathed, so Cersei has no more need of a hostage. She swore to free Alayaya once—    She did. Eight, nine days ago, after the whipping.   Tyrion shoved himself up higher, ignoring the sudden stab of pain through his shoulder.  Whipping?    They tied her to a post in the yard and scourged her, then shoved her out the gate naked and bloody.   She was learning to read, Tyrion thought, absurdly. Across his face the scar stretched tight, and for a moment it felt as though his head would burst with rage. Alayaya was a whore, true enough, but a sweeter, braver, more innocent girl he had seldom met. Tyrion had never touched her; she had been no more than a veil, to hide Shae. In his carelessness, he had never thought what the role might cost her."
}