{
  "id": "323b46f7f5d5fbd8d223f5a42b71417b55e26297",
  "text": " The galleys of the first line of battle obscured his vision, so Davos paced the deck searching for a better view. He saw no sign of any boom; the mouth of the river was open, as if to swallow them all. Except…  In his smuggling days, Davos had often jested that he knew the waterfront at King’s Landing a deal better than the back of his hand, since he had not spent a good part of his life sneaking in and out of the back of his hand. The squat towers of raw new stone that stood opposite one another at the mouth of the Blackwater might mean nothing to Ser Imry Florent, but to him it was as if two extra fingers had sprouted from his knuckles.  Shading his eyes against the westering sun, he peered at those towers more closely. They were too small to hold much of a garrison. The one on the north bank was built against the bluff with the Red Keep frowning above; its counterpart on the south shore had its footing in the water. They dug a cut through the bank, he knew at once. That would make the tower very difficult to assault; attackers would need to wade through the water or bridge the little channel. Stannis had posted bowmen below, to fire up at the defenders whenever one was rash enough to lift his head above the ramparts, but otherwise had not troubled.  Something flashed down low where the dark water swirled around the base of the tower. It was sunlight on steel, and it told Davos Seaworth all he needed to know. A chain boom… and yet they have not closed the river against us. Why?  He could make a guess at that as well, but there was no time to consider the question. A shout went up from the ships ahead, and the warhorns blew again: the enemy was before them.  Between the flashing oars of Sceptre and Faithful, Davos saw a thin line of galleys drawn across the river, the sun glinting off the gold paint that marked their hulls. He knew those ships as well as he knew his own. When he had been a smuggler, he’d always felt safer knowing whether the sail on the horizon marked a fast ship or a slow one, and whether her captain was a young man hungry for glory or an old one serving out his days.  Ahooooooooooooooooooooooooooo, the warhorns called.  Battle speed,  Davos shouted. On port and starboard he heard Dale and Allard giving the same command. Drums began to beat furiously, oars rose and fell, and Black Betha surged forward. When he glanced toward Wraith, Dale gave him a salute. Swordfish was lagging once more, wallowing in the wake of the smaller ships to either side; elsewise the line was straight as a shield wall.  The river that had seemed so narrow from a distance now stretched wide as a sea, but the city had grown gigantic as well. Glowering down from Aegon’s High Hill, the Red Keep commanded the approaches. Its iron-crowned battlements, massive towers, and thick red walls gave it the aspect of a ferocious beast hunched above river and streets. The bluffs on which it crouched were steep and rocky, spotted with lichen and gnarled thorny trees. The fleet would have to pass below the castle to reach the harbor and city beyond.  The first line was in the river now, but the enemy galleys were backing water. They mean to draw us in. They want us jammed close, constricted, no way to sweep around their flanks… and with that boom behind us. He paced his deck, craning his neck for a better look at Joffrey’s fleet. The boy’s toys included the ponderous Godsgrace, he saw, the old slow Prince Aemon, the Lady of Silk and her sister Lady’s Shame, Wildwind, Kingslander, White Hart, Lance, Seaflower. But where was the Lionstar? Where was the beautiful Lady Lyanna that King Robert had named in honor of the maid he’d loved and lost? And where was King Robert’s Hammer? She was the largest war galley in the royal fleet, four hundred oars, the only warship the boy king owned capable of overmatching Fury. By rights she should have formed the heart of any defense.  Davos tasted a trap, yet he saw no sign of any foes sweeping in behind them, only the great fleet of Stannis Baratheon in their ordered ranks, stretching back to the watery horizon. Will they raise the chain and cut us in two? He could not see what good that would serve. The ships left out in the bay could still land men north of the city; a slower crossing, but safer.  A flight of flickering orange birds took wing from the castle, twenty or thirty of them; pots of burning pitch, arcing out over the river trailing threads of flame. The waters ate most, but a few found the decks of galleys in the first line of battle, spreading flame when they shattered. Men-at-arms were scrambling on Queen Alysanne’s deck, and he could see smoke rising from three different spots on Dragonsbane, nearest the bank. By then a second flight was on its way, and arrows were falling as well, hissing down from the archers’ nests that studded the towers above. A soldier tumbled over Cat’s gunwale, crashed off the oars, and sank. The first man to die today, Davos thought, but he will not be the last."
}