{
  "id": "33af602c4a72b7a0b6ace3366577c07daecb4399",
  "text": " Please leave your luggage on the train, it will be taken to the school separately.\"  Harry's stomach lurched with nerves and Ron, he saw, looked pale under his freckles. They crammed their pockets with the last of the sweets and joined the crowd thronging the corridor.  The train slowed right down and finally stopped. People pushed their way toward the door and out on to a tiny, dark platform. Harry shivered in the cold night air. Then a lamp came bobbing over the heads of the students, and Harry heard a familiar voice: \"Firs' years! Firs' years over here! All right there, Harry?\"  Hagrid's big hairy face beamed over the sea of heads.  \"C'mon, follow me -- any more firs' years? Mind yer step, now! Firs' years follow me!\"  Slipping and stumbling, they followed Hagrid down what seemed to be a steep, narrow path. It was so dark on either side of them that Harry thought there must be thick trees there. Nobody spoke much. Neville, the boy who kept losing his toad, sniffed once or twice.  \"Ye' all get yer firs' sight o' Hogwarts in a sec,\" Hagrid called over his shoulder, \"jus' round this bend here.\"  There was a loud \"Oooooh!\"  The narrow path had opened suddenly onto the edge of a great black take. Perched atop a high mountain on the other side, its windows sparkling in the starry sky, was a vast castle with many turrets and towers.  \"No more'n four to a boat!\" Hagrid called, pointing to a fleet of little boats sitting in the water by the shore. Harry and Ron were followed into their boat by Neville and Hermione. \"Everyone in?\" shouted Hagrid, who had a boat to himself. \"Right then -- FORWARD!\"  And the fleet of little boats moved off all at once, gliding across the lake, which was as smooth as glass. Everyone was silent, staring up at the great castle overhead. It towered over them as they sailed nearer and nearer to the cliff on which it stood.  \"Heads down!\" yelled Hagrid as the first boats reached the cliff; they all bent their heads and the little boats carried them through a curtain of ivy that hid a wide opening in the cliff face. They were carried along a dark tunnel, which seemed to be taking them right underneath the castle, until they reached a kind of underground harbor, where they clambered out onto rocks and pebbles.  \"Oy, you there! Is this your toad?\" said Hagrid, who was checking the boats as people climbed out of them.  \"Trevor!\" cried Neville blissfully, holding out his hands. Then they clambered up a passageway in the rock after Hagrid's lamp, coming out at last onto smooth, damp grass right in the shadow of the castle.  They walked up a flight of stone steps and crowded around the huge, Oak front door.  \"Everyone here? You there, still got yer toad?\"  Hagrid raised a gigantic fist and knocked three times on the castle door.   CHAPTER SEVEN  THE SORTING HAT  The door swung open at once. A tall, black-haired witch in emerald-green robes stood there. She had a very stern face and Harry's first thought was that this was not someone to cross.  \"The firs' years, Professor McGonagall,\" said Hagrid.  \"Thank you, Hagrid. I will take them from here.\"  She pulled the door wide. The entrance hall was so big you could have fit the whole of the Dursleys' house in it. The stone walls were lit with flaming torches like the ones at Gringotts, the ceiling was too high to make out, and a magnificent marble staircase facing them led to the upper floors.  They followed Professor McGonagall across the flagged stone floor. Harry could hear the drone of hundreds of voices from a doorway to the right -the rest of the school must already be here -- but Professor McGonagall showed the first years into a small, empty chamber off the hall. They crowded in, standing rather closer together than they would usually have done, peering about nervously.  \"Welcome to Hogwarts,\" said Professor McGonagall. \"The start-of-term banquet will begin shortly, but before you take your seats in the Great Hall, you will be sorted into your houses. The Sorting is a very important ceremony because, while you are here, your house will be something like your family within Hogwarts. You will have classes with the rest of your house, sleep in your house dormitory, and spend free time in your house common room.  \"The four houses are called Gryffindor, Hufflepuff, Ravenclaw, and Slytherin. Each house has its own noble history and each has produced outstanding witches and wizards. While you are at Hogwarts, your triumphs will earn your house points, while any rulebreaking will lose house points. At the end of the year, the house with the most points is awarded the house cup, a great honor. I hope each of you will be a credit to whichever house becomes yours.  \"The Sorting Ceremony will take place in a few minutes in front of the rest of the school. I suggest you all smarten yourselves up as much as you can while you are waiting.\"  Her eyes lingered for a moment on Neville's cloak, which was fastened under his left ear, and on Ron's smudged nose. Harry nervously tried to flatten his hair."
}