{
  "id": "3410f078e4b5bff7f4bea9a2bad81a0ddd50b210",
  "text": " He had his sword raised and men were rallying to him when a wedge of knights smashed into them with lance and sword and longaxe. Mance’s mare went up on her hind legs, kicking, and a spear took her through the breast. Then the steel tide washed over him.  It’s done, Jon thought, they’re breaking. The wildlings were running, throwing down their weapons, Hornfoot men and cave dwellers and Thenns in bronze scales, they were running. Mance was gone, someone was waving Harma’s head on a pole, Tormund’s lines had broken. Only the giants on their mammoths were holding, hairy islands in a red steel sea. The fires were leaping from tent to tent and some of the tall pines were going up as well. And through the smoke another wedge of armored riders came, on barded horses. Floating above them were the largest banners yet, royal standards as big as sheets; a yellow one with long pointed tongues that showed a flaming heart, and another like a sheet of beaten gold, with a black stag prancing and rippling in the wind.  Robert, Jon thought for one mad moment, remembering poor Owen, but when the trumpets blew again and the knights charged, the name they cried was  Stannis! Stannis! STANNIS!   Jon turned away, and went inside the tent.      Arya   Outside the inn on a weathered gibbet, a woman’s bones were twisting and rattling at every gust of wind.  I know this inn. There hadn’t been a gibbet outside the door when she had slept here with her sister Sansa under the watchful eye of Septa Mordane, though.  We don’t want to go in,  Arya decided suddenly,  there might be ghosts.    You know how long it’s been since I had a cup of wine?  Sandor swung down from the saddle.  Besides, we need to learn who holds the ruby ford. Stay with the horses if you want, it’s no hair off my arse.    What if they know you?  Sandor no longer troubled to hide his face. He no longer seemed to care who knew him.  They might want to take you captive.    Let them try.  He loosened his longsword in its scabbard, and pushed through the door.  Arya would never have a better chance to escape. She could ride off on Craven and take Stranger too. She chewed her lip. Then she led the horses to the stables, and went in after him.  They know him. The silence told her that. But that wasn’t the worst thing. She knew them too. Not the skinny innkeep, nor the women, nor the fieldhands by the hearth. But the others. The soldiers. She knew the soldiers.   Looking for your brother, Sandor?  Polliver’s hand was down the bodice of the girl on his lap, but now he slid it out.   Looking for a cup of wine. Innkeep, a flagon of red.  Clegane threw a handful of coppers on the floor.   I don’t want no trouble, ser,  the innkeep said.   Then don’t call me ser.  His mouth twitched.  Are you deaf, fool? I ordered wine.  As the man ran off, Clegane shouted after him,  Two cups! The girl’s thirsty too!   There are only three, Arya thought. Polliver gave her a fleeting glance and the boy beside him never looked at her at all, but the third one gazed long and hard. He was a man of middling height and build, with a face so ordinary that it was hard to say how old he was. The Tickler. The Tickler and Polliver both. The boy was a squire, judging by his age and dress. He had a big white pimple on one side of his nose, and some red ones on his forehead.  Is this the lost puppy Ser Gregor spoke of?  he asked the Tickler.  The one who piddled in the rushes and ran off?   The Tickler put a warning hand on the boy’s arm, and gave a short sharp shake of his head. Arya read that plain enough.  The squire didn’t, or else he didn’t care.  Ser said his puppy brother tucked his tail between his legs when the battle got too warm at King’s Landing. He said he ran off whimpering.  He gave the Hound a stupid mocking grin.  Clegane studied the boy and never said a word. Polliver shoved the girl off his lap and got to his feet.  The lad’s drunk,  he said. The man-at-arms was almost as tall as the Hound, though not so heavily muscled. A spade-shaped beard covered his jaws and jowls, thick and black and neatly trimmed, but his head was more bald than not.  He can’t hold his wine, is all.    Then he shouldn’t drink.    The puppy doesn’t scare…  the boy began, till the Tickler casually twisted his ear between thumb and forefinger. The words became a squeal of pain.  The innkeep came scurrying back with two stone cups and a flagon on a pewter platter. Sandor lifted the flagon to his mouth. Arya could see the muscles in his neck working as he gulped. When he slammed it back down on the table, half the wine was gone.  Now you can pour. Best pick up those coppers too, it’s the only coin you’re like to see today.    We’ll pay when we’re done drinking,  said Polliver.   When you’re done drinking you’ll tickle the innkeep to see where he keeps his gold. The way you always do.   The innkeep suddenly remembered something in the kitchen. The locals were leaving too, and the girls were gone. The only sound in the common room was the faint crackling of the fire in the hearth."
}