{
  "id": "3580f302f634d0b3cfe8d988adb3233cb6712213",
  "text": " Deep shadows draped the walls. One of the torches had guttered out, leaving only three. Catelyn sat staring into her wine goblet. The vintage tasted thin and sour on her tongue. Brienne was across from her. Between them, her father’s high seat was as empty as the rest of the hall. Even the servants were gone. She had given them leave to join the celebration.  The walls of the keep were thick, yet even so, they could hear the muffled sounds of revelry from the yard outside. Ser Desmond had brought twenty casks up from the cellars, and the smallfolk were celebrating Edmure’s imminent return and Robb’s conquest of the Crag by hoisting horns of nut-brown ale.  I cannot blame them, Catelyn thought. They do not know. And if they did, why should they care? They never knew my sons. Never watched Bran climb with their hearts in their throats, pride and terror so mingled they seemed as one, never heard him laugh, never smiled to see Rickon trying so fiercely to be like his older brothers. She stared at the supper set before her: trout wrapped in bacon, salad of turnip greens and red fennel and sweetgrass, pease and onions and hot bread. Brienne was eating methodically, as if supper were another chore to be accomplished. I am become a sour woman, Catelyn thought. I take no joy in mead nor meat, and song and laughter have become suspicious strangers to me. I am a creature of grief and dust and bitter longings. There is an empty place within me where my heart was once.  The sound of the other woman’s eating had become intolerable to her.  Brienne, I am no fit company. Go join the revels, if you would. Drink a horn of ale and dance to Rymund’s harping.    I am not made for revels, my lady.  Her big hands tore apart a heel of black bread. Brienne stared at the chunks as if she had forgotten what they were.  If you command it, I…   Catelyn could sense her discomfort.  I only thought you might enjoy happier company than mine.    I’m well content.  The girl used the bread to sop up some of the bacon grease the trout had been fried in.   There was another bird this morning.  Catelyn did not know why she said it.  The maester woke me at once. That was dutiful, but not kind. Not kind at all.  She had not meant to tell Brienne. No one knew but her and Maester Vyman, and she had meant to keep it that way until… until…  Until what? Foolish woman, will holding it secret in your heart make it any less true? If you never tell, never speak of it, will it become only a dream, less than a dream, a nightmare half-remembered? Oh, if only the gods would be so good.   Is it news of King’s Landing?  asked Brienne.   Would that it was. The bird came from Castle Cerwyn, from Ser Rodrik, my castellan.  Dark wings, dark words.  He has gathered what power he could and is marching on Winterfell, to take the castle back.  How unimportant all that sounded now.  But he said… he wrote… he told me, he…    My lady, what is it? Is it some news of your sons?   Such a simple question that was; would that the answer could be as simple. When Catelyn tried to speak, the words caught in her throat.  I have no sons but Robb.  She managed those terrible words without a sob, and for that much she was glad.  Brienne looked at her with horror.  My lady?    Bran and Rickon tried to escape, but were taken at a mill on the Acorn Water. Theon Greyjoy has mounted their heads on the walls of Winterfell. Theon Greyjoy, who ate at my table since he was a boy of ten.  I have said it, gods forgive me. I have said it and made it true.  Brienne’s face was a watery blur. She reached across the table, but her fingers stopped short of Catelyn’s, as if the touch might be unwelcome.  I… there are no words, my lady. My good lady. Your sons, they… they’re with the gods now.    Are they?  Catelyn said sharply.  What god would let this happen? Rickon was only a baby. How could he deserve such a death? And Bran… when I left the north, he had not opened his eyes since his fall. I had to go before he woke. Now I can never return to him, or hear him laugh again.  She showed Brienne her palms, her fingers.  These scars… they sent a man to cut Bran’s throat as he lay sleeping. He would have died then, and me with him, but Bran’s wolf tore out the man’s throat.  That gave her a moment’s pause.  I suppose Theon killed the wolves too. He must have, elsewise… I was certain the boys would be safe so long as the direwolves were with them. Like Robb with his Grey Wind. But my daughters have no wolves now.   The abrupt shift of topic left Brienne bewildered.  Your daughters…    Sansa was a lady at three, always so courteous and eager to please. She loved nothing so well as tales of knightly valor. Men would say she had my look, but she will grow into a woman far more beautiful than I ever was, you can see that. I often sent away her maid so I could brush her hair myself. She had auburn hair, lighter than mine, and so thick and soft… the red in it would catch the light of the torches and shine like copper."
}