{
  "id": "361af22788c2d1859812f342fae3215245adfb01",
  "text": ".. but I  * 31:L *  admit, even I was surprised how well the plan worked. I thought someone must realize that Hagrid couldn't possibly be the Heir of Slytherin. It had taken me five whole years to find out everything I could about the Chamber of Secrets and discover the secret entrance ... as though Hagrid had the brains, or the power!  \"Only the Transfiguration teacher, Dumbledore, seemed to think Hagrid was innocent. He persuaded Dipper to keep Hagrid and train him as gamekeeper. Yes, I think Dumbledore might have guessed .... Dumbledore never seemed to like me as much as the other teachers did ......  \"I bet Dumbledore saw right through you,\" said Harry, his teeth gritted.  \"Well, he certainly kept an annoyingly close watch on me after Hagrid was expelled,\" said Riddle carelessly. \"I knew it wouldn't be safe to open the Chamber again while I was still at school. But I wasn't going to waste those long years Id spent searching for it. I decided to leave behind a diary, preserving my sixteen-year-old self in its pages, so that one day, with luck, I would be able to lead another in my footsteps, and finish Salazar Slytherin's noble work.\"  \"Well, you haven't finished it,\" said Harry triumphantly. \"No one's died this time, not even the cat. In a few hours the Mandrake Draught will be ready and everyone who was Petrified will be all right again -\"  \"Haven't I already told you,\" said Riddle quietly, \"that killing Mudbloods doesn't matter to me anymore? For many months now, my new target has been -you.\"  Harry stared at him.  \"Imagine how angry I was when the next time my diary was  *312*  opened, it was Ginny who was writing to me, not you. She saw you with the diary, you see, and panicked. \"What if you found out how to work it, and I repeated all her secrets to you? What if, even worse, I told you who'd been strangling roosters? So the foolish little brat waited until your dormitory was deserted and stole it back. But I knew what I must do. It was clear to me that you were on the trail of Slytherin's heir. From everything Ginny had told me about you, I knew you would go to any lengths to solve the mystery --  particularly if one of your best friends was attacked. And Ginny had told me the whole school was buzzing because you could speak Parseltongue ....  \"So I made Ginny write her own farewell on the wall and come down here to wait. She struggled and cried and became very boring. But there isn't much life left in her .... She put too much into the diary, into me. Enough to let me leave its pages at last .... I have been waiting for you to appear since we arrived here. I knew you'd come. I have many questions for you, Harry Potter.\"  \"Like what?\" Harry spat, fists still clenched.  \"Well,\" said Riddle, smiling pleasantly, \"how is it that you a skinny boy with no extraordinary magical talent - managed to defeat the greatest wizard of all time? How did you escape with nothing but a scar, while Lord Voldemort's powers were destroyed?\"  There was an odd red gleam in his hungry eyes now.  \"Why do you care how I escaped?\" said Harry slowly. \"Voldemort was after your time ......  \"Voldemort,\" said Riddle softly, \"is my past, present, and future, Harry Potter . . . .\"  He pulled Harry's wand from his pocket and began to trace it through the air, writing three shimmering words:  TOM MARVOLO RIDDLE  Then he waved the wand once, and the letters of his name rearranged themselves:  I AM LORD VOLDEMORT  \"You see?\" he whispered. \"It was a name I was already using at Hogwarts, to my most intimate friends only, of course. You think I was going to use my filthy Muggle father's name forever? I, in whose veins runs the blood of Salazar Slytherin himself, through my mother's side? I, keep the name of a foul, common Muggle, who abandoned me even before I was born, just because he found out his wife was a witch? No, Harry - I fashioned myself a new name, a name I knew wizards everywhere would one day fear to speak, when I had become the greatest sorcerer in the world!\"  Harry's brain seemed to have jammed. He stared numbly at Riddle, at the orphaned boy who had grown up to murder Harry's own parents, and so many others .... At last he forced himself to -,peak.  \"You're not,\" he said, his quiet voice full of hatred.  \"Not what?\" snapped Riddle.  \"Not the greatest sorcerer in the world,\" said Harry, breathing fast. \"Sorry to disappoint you and all that, but the greatest wizard in the world is Albus Dumbledore. Everyone says so. Even when you were strong, you didn't dare try and take over at Hogwarts. Dumbledore saw through you when you were at school and he still frightens you now, wherever you're hiding these days -\"  The smile had gone from Riddle's face, to be replaced by a very ugly look.  *31-4*  \"Dumbledore's been driven out of this castle by the mere memory of me!\" he hissed.  \"He's not as gone as you might think!\" Harry retorted. He was speaking at random, wanting to scare Riddle, wishing rather than believing it to be true  Riddle opened his mouth, but froze."
}