{
  "id": "382e40f557c7ea2cb5909bd58018a1c7ff2ded51",
  "text": " But I must warn you, Harry, that the charm might be too advanced for you. Many qualified wizards have difficulty with it.\"  \"What does a Patronus look like?\" said Harry curiously.  \"Each one is unique to the wizard who conjures it.\"  \"And how do you conjure it?\"  \"With an incantation, which will work only if you are concentrating, with all your might, on a single, very happy memory.\"  Harry cast his mind about for a happy memory. Certainly, nothing that had happened to him at the Dursleys' was going to do. Finally, he settled on the moment when he had first ridden a broomstick.  \"Right,\" he said, trying to recall as exactly as possible the wonderful, soaring sensation of his stomach.  \"The incantation is this --\" Lupin cleared his throat. \"Expecto patronum!\"  \"Expecto patronum, \" Harry repeated under his breath, \"expecto patronum.\"  \"Concentrating hard on your happy memory?\"  \"Oh -- yeah --\" said Harry, quickly forcing his thoughts back to that first broom ride. \"Expecto patrono -- no, patronum -- sorry -- expecto patronum, expecto patronum\"  Something whooshed suddenly out of the end of his wand; it looked like a wisp of silvery gas.  \"Did you see that?\" said Harry excitedly. \"Something happened!\"  \"Very good,\" said Lupin, smiling. \"Right, then -- ready to try it on a dementor?\"  \"Yes,\" Harry said, gripping his wand very tightly, and moving into the middle of the deserted classroom. He tried to keep his mind on flying, but something else kept intruding.... Any second now, he might hear his mother again... but he shouldn't think that, or he would hear her again, and he didn't want to... or did he?  Lupin grasped the lid of the packing case and pulled.  A dementor rose slowly from the box, its hooded face turned toward Harry, one glistening, scabbed hand gripping its cloak. The lamps around the classroom flickered and went out. The dementor stepped from the box and started to sweep silently toward Harry, drawing a deep, rattling breath. A wave of piercing cold broke over him --  \"Expecto patronum!\" Harry yelled. \"Expecto patronum! Expecto --\"  But the classroom and the dementor were dissolving.... Harry was failing again through thick white fog, and his mother's voice was louder than ever, echoing inside his head -- \"Not Harry! Not Harry! please -- I'll do anything!\"  \"Stand aside. Stand aside, girl!\"  \"Harry!\"  Harry jerked back to life. He was lying flat on his back on the floor. The classroom lamps were alight again. He didn't have to ask what had happened.  \"Sorry,\" he muttered, sitting up and feeling cold sweat trickling down behind his glasses.  \"Are you all right?\" said Lupin.  \"Yes...\" Harry pulled himself up on one of the desks and leaned against it.  \"Here --\" Lupin handed him a Chocolate Frog. \"Eat this before we try again. I didn't expect you to do it your first time; in fact, I would have been astounded if you had.\"  \"It's getting worse,\" Harry muttered, biting off the Frog's head. \"I could hear her louder that time -- and him -- Voldemort  Lupin looked paler than usual. ,  \"Harry, if you don't want to continue, I will more than understand --\"  \"I do!\" said Harry fiercely, stuffing the rest of the Chocolate Frog into his mouth. \"I've got to! What if the dementors turn up at our match against Ravenclaw? I can't afford to fall off again. If we lose this game we've lost the Quidditch Cup!\"  \"All right then... \" said Lupin. \"You might want to select 'other memory, a happy memory, I mean, to concentrate on.... That one doesn't seem to have been strong enough....\"  Harry thought hard and decided his feelings when Gryffindor had won the House Championship last year had definitely qualified as very happy. He gripped his wand tightly again and took up his position in the middle of the classroom.  \"Ready?\" said Lupin, gripping the box lid.  \"Ready,\" said Harry; trying hard to fill his head with happy thoughts about Gryffindor winning, and not dark thoughts about what was going to happen when the box opened.  \"Go!\" said Lupin, pulling off the lid. The room went icily cold and dark once more. The dementor glided forward, drawing its breath; one rotting hand was extending toward Harry -  \"Expecto patronum!\" Harry yelled. \"Expecto patronum! Expecto Pat --\"  White fog obscured his senses... big, blurred shapes were moving around him... then came a new voice, a man's voice, shouting, panicking --  \"Lily, take Harry and go! It's him! Go! Run! I'll hold him off --\"  The sounds of someone stumbling ftom a room -- a door bursting open -- a cackle of high- pitched laughter --  \"Harry! Harry... wake up....\"  Lupin was tapping Harry hard on the face. This time it was a minute before Harry understood why he was lying on a dusty classroom floor.  \"I heard my dad,\" Harry mumbled. \"That's the first time I've ever heard him -- he tried to take on Voldemort himself, to give my mum time to run for it....\"  Harry suddenly realized that there were tears on his face mingling with the sweat. He bent his face as low as possible, wiping them off on his robes, pretending to do up his shoelace, so that Lupin wouldn't see."
}