{
  "id": "398edac4668607ea272a6fcc162997c25bc117bb",
  "text": " He'd been talk ing of nothing else for two weeks. Some rich builder and his wife were coming to dinner and Uncle Vernon was hoping to get a huge order from him (Uncle Vernon's company made drills).  \"I think we should run through the schedule one more time,\" said Uncle Vernon. \"We should all be in position at eight o'clock. Petunia, you will be -?\"  \"In the lounge,\" said Aunt Petunia promptly, \"waiting to welcome them graciously to our home.\"  \"Good, good. And Dudley?\"  \"I'll be waiting to open the door.\" Dudley put on a foul, simpering smile. \"May I take your coats, Mr. and Mrs. Mason?\"  \"They'll love him!\" cried Aunt Petunia rapturously.  \"Excellent, Dudley,\" said Uncle Vernon. Then he rounded on Harry. \"And you?\"  \"I'll be in my bedroom, making no noise and pretending I'm not there,\" said Harry tonelessly.  \"Exactly,\" said Uncle Vernon nastily. \"I will lead them into the lounge, introduce you, Petunia, and pour them -drinks. At eight- fifteen -\"  \"I'll announce dinner,\" said Aunt Petunia.  \"And, Dudley, you'll say -\"  \"May I take you through to the dining room, Mrs. Mason?\" said Dudley, offering his fat arm to an invisible woman.  \"My perfect little gentleman!\" sniffed Aunt Petunia.  \"And you?\" said Uncle Vernon viciously to Harry.  \"I'll be in my room, making no noise and pretending I'm not there,\" said Harry dully.  \"Precisely. Now, we should aim to get in a few good compliments at dinner. Petunia, any ideas?\"  \"Vernon tells me you're a wonderful golfer, Mr. Mason.... Do tell me where you bought your dress, Mrs. Mason ......  \"Perfect. . . Dudley?\"  \"How about -'We had to write an essay about our hero at school, Mr. Mason, and I wrote about you.\"'  This was too much for both Aunt Petunia and Harry. Aunt Petunia burst into tears and hugged her son, while Harry ducked under the table so they wouldn't see him laughing.  \"And you, boy?\"  Harry fought to keep his face straight as he emerged.  \"I'll be in my room, making no noise and pretending I'm not there,\" he said.  \"Too right, you will,\" said Uncle Vernon forcefully. \"The Ma sons don't know anything about you and it's going to stay that way. When dinner's over, you take Mrs. Mason back to the lounge for coffee, Petunia, and I'll bring the subject around to drills. With any luck, I'll have the deal signed and sealed before the news at ten. be shopping for a vacation home in Majorca this time to morrow. Harry couldn't feel too excited about this. He didn't think the Dursleys would like him any better in Majorca than they did on Privet Drive. \"Right - I'm off into town to pick up the dinner jackets for Dudley and me. And you,\" he snarled at Harry. \"You stay out of your aunt's way while she's cleaning.\" Harry left through the back door. It was a brilliant, sunny day. He crossed the lawn, slumped down on the garden bench, and sang under his breath: \"Happy birthday to me ... happy birthday to me. . . No cards, no presents, and he would be spending the evening pretending not to exist. He gazed miserably into the hedge. He had never felt so lonely. More than anything else at Hogwarts, more even than playing Quidditch, Harry missed his best friends, Ron Weasley and Hermione Granger. They, however, didn't seem to be missing him at all. Neither of them had written to him all summer, even though Ron had said he was going to ask Harry to come and stay. Countless times, Harry had been on the point of unlocking Hedwig's cage by magic and sending her to Ron and Hermione with a letter, but it wasn't worth the risk. Underage wizards weren't allowed to use magic outside of school. Harry hadn't told the  Dursleys this; he knew it was only their terror that he might turn them all into dung beetles that stopped them from locking him in the cupboard under the stairs with his wand and broomstick. For the first couple of weeks back, Harry had enjoyed muttering nonsense words under his breath and watching Dudley tearing out of the room as fast as his fat legs would carry him. But the long silence from Ron and Hermione had made Harry feel so cut off from the magical world that even taunting Dudley had lost its appeal - and now Ron and Hermione had forgotten his birthday.  What wouldn't he give now for a message from Hogwarts? From any witch or wizard? He'd almost be glad of a sight of his archenemy, Draco Malfoy, just to be sure it hadn't all been a dream ....  Not that his whole year at Hogwarts had been fun. At the very end of last term, Harry had come face-to-face with none other than Lord Voldemort himself. Voldemort might be a ruin of his former self, but he was still terrifying, still cunning, still determined to regain power. Harry had slipped through Voldemort's clutches for a second time, but it had been a narrow escape, and even now, weeks later, Harry kept waking in the night, drenched in cold sweat, wondering where Voldemort was now, remembering his livid face, his wide, mad eyes  Harry suddenly sat bolt upright on the garden bench. He had been staring absent-mindedly into the hedge - and the hedge was staring back."
}