{
  "id": "3a4b0e12e0029ca9822e8dbb64abcea857ef21b6",
  "text": "\"  It was only when he was back in bed that it struck Harry that Dumbledore might not have been quite truthful. But then, he thought, as he shoved Scabbers off his pillow, it had been quite a personal question.   CHAPTER THIRTEEN  NICOLAS FLAMEL  Dumbledore had convinced Harry not to go looking for the Mirror of Erised again, and for the rest of the Christmas holidays the invisibility cloak stayed folded at the bottom of his trunk. Harry wished he could forget what he'd seen in the mirror as easily, but he couldn't. He started having nightmares. Over and over again he dreamed about his parents disappearing in a flash of green light, while a high voice cackled with laughter.  \"You see, Dumbledore was right, that mirror could drive you mad,\" said Ron, when Harry told him about these drearns.  Hermione, who came back the day before term started, took a different view of things. She was torn between horror at the idea of Harry being out of bed, roaming the school three nights in a row (\"If Filch had caught you!\"), and disappointment that he hadn't at least found out who Nicolas Flamel was.  They had almost given up hope of ever finding Flamel in a li- brary book, even though Harry was still sure he'd read the name somewhere. Once term had started, they were back to skimming through books for ten minutes during their breaks. Harry had even less time than the other two, because Quidditch practice had started again.  Wood was working the team harder than ever. Even the endless rain that had replaced the snow couldn't dampen his spirits. The Weasleys complained that Wood was becoming a fanatic, but Harry was on Wood's side. If they won their next match, against Hufflepuff, they would overtake Slytherin in the house championship for the first time in seven years. Quite apart from wanting to win, Harry found that he had fewer nightmares when he was tired out after training.  Then, during one particularly wet and muddy practice session, Wood gave the team a bit of bad news. He'd just gotten very angry with the Weasleys, who kept dive-bombing each other and pretending to fall off their brooms.  \"Will you stop messing around!\" he yelled. \"That's exactly the sort of thing that'll lose us the match! Snape's refereeing this time, and he'll be looking for any excuse to knock points off Gryffindor!\"  George Weasley really did fall off his broom at these words.  \"Snape's refereeing?\" he spluttered through a mouthful of mud. \"When's he ever refereed a Quidditch match? He's not going to be fair if we might overtake Slytherin.\"  The rest of the team landed next to George to complain, too.  \"It's not my fault,\" said Wood. \"We've just got to make sure we play a clean game, so Snape hasn't got an excuse to pick on us.\"  Which was all very well, thought Harry, but he had another reason for not wanting Snape near him while he was playing Quidditch....  The rest of the team hung back to talk to one another as usual at the end of practice, but Harry headed straight back to the Gryffindor common room, where he found Ron and Hermione playing chess. Chess was the only thing Hermione ever lost at, something Harry and Ron thought was very good for her.  \"Don't talk to me for a moment,\" said Ron when Harry sat down next to him, \"I need to concen --\" He caught sight of Harry's face. \"What's the matter with you? You look terrible.\"  Speaking quietly so that no one else would hear, Harry told the other two about Snape's sudden, sinister desire to be a Quidditch referee.  \"Don't play,\" said Hermione at once.  \"Say you're ill,\" said Ron.  \"Pretend to break your leg,\" Hermione suggested.  \"Really break your leg,\" said Ron.  \"I can't,\" said Harry. \"There isn't a reserve Seeker. If I back out, Gryffindor can't play at all.\"  At that moment Neville toppled into the common room. How he had managed to climb through the portrait hole was anyone's guess, because his legs had been stuck together with what they recognized at once as the Leg-Locker Curse. He must have had to bunny hop all the way up to Gryffindor tower.  Everyone fell over laughing except Hermione, who leapt up and performed the countercurse. Neville's legs sprang apart and he got to his feet, trembling. \"What happened?\" Hermione asked him, leading him over to sit with Harry and Ron.  \"Malfoy,\" said Neville shakily. \"I met him outside the library. He said he'd been looking for someone to practice that on.\"  \"Go to Professor McGonagall!\" Hermione urged Neville. \"Report him!\"  Neville shook his head.  \"I don't want more trouble,\" he mumbled.  \"You've got to stand up to him, Neville!\" said Ron. \"He's used to walking all over people, but that's no reason to lie down in front of him and make it easier.\"  \"There's no need to tell me I'm not brave enough to be in Gryffindor, Malfoy's already done that,\" Neville choked out.  Harry felt in the pocket of his robes and pulled out a Chocolate Frog, the very last one from the box Hermione had given him for Christmas. He gave it to Neville, who looked as though he might cry."
}