{
  "id": "3c6c944665167d10c42cacde73f676cfe5f0ca2b",
  "text": "    Brother,  said Thoros of Myr,  the only shame was not telling them at once.   The outlaws sheltered that night in the brewhouse beside the little river. Their hosts had a cache of food hidden beneath the floor of the stables, so they shared a simple supper; oaten bread, onions, and a watery cabbage soup tasting faintly of garlic. Arya found a slice of carrot floating in her bowl, and counted herself lucky. The brothers never asked the outlaws for names. They know, Arya thought. How could they not? Lord Beric wore the lightning bolt on breastplate, shield, and cloak, and Thoros his red robes, or what remained of them. One brother, a young novice, was bold enough to tell the red priest not to pray to his false god so long as he was under their roof.  Bugger that,  said Lem Lemoncloak.  He’s our god too, and you owe us for your bloody lives. And what’s false about him? Might be your Smith can mend a broken sword, but can he heal a broken man?    Enough, Lem,  Lord Beric commanded.  Beneath their roof we will honor their rules.    The sun will not cease to shine if we miss a prayer or two,  Thoros agreed mildly.  I am one who would know.   Lord Beric himself did not eat. Arya had never seen him eat, though from time to time he took a cup of wine. He did not seem to sleep, either. His good eye would often close, as if from weariness, but when you spoke to him it would flick open again at once. The Marcher lord was still clad in his ratty black cloak and dented breastplate with its chipped enamel lightning. He even slept in that breastplate. The dull black steel hid the terrible wound the Hound had given him, the same way his thick woolen scarf concealed the dark ring about his throat. But nothing hid his broken head, all caved in at the temple, or the raw red pit that was his missing eye, or the shape of the skull beneath his face.  Arya looked at him warily, remembering all the tales told of him in Harrenhal. Lord Beric seemed to sense her fear. He turned his head, and beckoned her closer.  Do I frighten you, child?    No.  She chewed her lip.  Only… well… I thought the Hound had killed you, but…    A wound,  said Lem Lemoncloak.  A grievous wound, aye, but Thoros healed it. There’s never been no better healer.   Lord Beric gazed at Lem with a queer look in his good eye and no look at all in the other, only scars and dried blood.  No better healer,  he agreed wearily.  Lem, past time to change the watch, I’d think. See to it, if you’d be so good.    Aye, m’lord.  Lem’s big yellow cloak swirled behind him as he strode out into the windy night.   Even brave men blind themselves sometimes, when they are afraid to see,  Lord Beric said when Lem was gone.  Thoros, how many times have you brought me back now?   The red priest bowed his head.  It is R’hllor who brings you back, my lord. The Lord of Light. I am only his instrument.    How many times?  Lord Beric insisted.   Six,  Thoros said reluctantly.  And each time is harder. You have grown reckless, my lord. Is death so very sweet?    Sweet? No, my friend. Not sweet.    Then do not court it so. Lord Tywin leads from the rear. Lord Stannis as well. You would be wise to do the same. A seventh death might mean the end of both of us.   Lord Beric touched the spot above his left ear where his temple was caved in.  Here is where Ser Burton Crakehall broke helm and head with a blow of his mace.  He unwound his scarf, exposing the black bruise that encircled his neck.  Here the mark the manticore made at Rushing Falls. He seized a poor beekeeper and his wife, thinking they were mine, and let it be known far and wide that he would hang them both unless I gave myself up to him. When I did he hanged them anyway, and me on the gibbet between them.  He lifted a finger to the raw red pit of his eye.  Here is where the Mountain thrust his dirk through my visor.  A weary smile brushed his lips.  That’s thrice I have died at the hands of House Clegane. You would think that I might have learned…   It was a jest, Arya knew, but Thoros did not laugh. He put a hand on Lord Beric’s shoulder.  Best not to dwell on it.    Can I dwell on what I scarce remember? I held a castle on the Marches once, and there was a woman I was pledged to marry, but I could not find that castle today, nor tell you the color of that woman’s hair. Who knighted me, old friend? What were my favorite foods? It all fades. Sometimes I think I was born on the bloody grass in that grove of ash, with the taste of fire in my mouth and a hole in my chest. Are you my mother, Thoros?   Arya stared at the Myrish priest, all shaggy hair and pink rags and bits of old armor. Grey stubble covered his cheeks and the sagging skin beneath his chin. He did not look much like the wizards in Old Nan’s stories, but even so…   Could you bring back a man without a head?  Arya asked.  Just the once, not six times. Could you?    I have no magic, child. Only prayers. That first time, his lordship had a hole right through him and blood in his mouth, I knew there was no hope."
}