{
  "id": "3d6f4a48af22ee5a43fff213e4c62e7378ca8d92",
  "text": "  'Never be ashamed,' my ol' dad used ter say, 'there's some who'll hold it against you, but they're not worth botherin' with.' An' he was right.  I've bin an idiot.  I'm not botherin' with her no more, I promise yeh that.  Big bones . . . I'll give her big bones.\" Harry, Ron, and Hermione looked at one another nervously; Harry would rather have taken fifty Blast-Ended Skrewts for a walk than admit to Hagrid that he had overheard him talking to Madame Maxime, but Hagrid was still talking, apparently unaware that he had said anything odd. \"Yeh know wha, Harry?\" he said, looking up from the photograph of his father, his eyes very bright, \"when I firs' met you, you reminded me o' me a bit.  Mum an' Dad gone, an' you was feelin' like yeh wouldn' fit in at Hogwarts, remember?  Not sure yeh were really up to it... an' now look at yeh, Harry!  School champion!\" He looked at Harry for a moment and then said, very seriously, \"Yeh know what I'd love.  Harry?  I'd love yeh ter win, I really would.  It'd show 'em all... yeh don' have ter be pureblood ter do it.  Yeh don have ter be ashamed of what yeh are.  It'd show 'em Dumbledore's the one who's got it righ', lettin' anyone in as long as they can do magic.  How you doin' with that egg, Harry?\" \"Great,\" said Harry. \"Really great.\" Hagrid's miserable face broke into a wide, watery smile. \"Tha's my boy. . . you show 'em, Harry, you show 'em.  Beat 'em all.\" Lying to Hagrid wasn't quite like lying to anyone else.  Harry went back to the castle later that afternoon with Ron and Hermione, unable to banish the image of the happy expression on Hagrid's whiskery face as he had imagined Harry winning the tournament.  The incomprehensible egg weighed more heavily than ever on Harrys conscience that evening, and by the time he had got into bed, he had made up his mind - it was time to shelve his pride and see if Cedric's hint was worth anything. CHAPTER TWENTY-FIVE - THE EGG AND THE EYE  Harry had no idea how long a bath he would need to work out the secret of the golden egg, he decided to do it at night, when he would be able to take as much time as he wanted. Reluctant though he was to accept more favors from Cedric, he also decided to use the prefects' bathroom; far fewer people were allowed in there, so it was much less likely that he would be disturbed. Harry planned his excursion carefully, because he had been caught out of bed and out-of-bounds by Filch the caretaker in the middle of the night once before, and had no desire to repeat the experience.  The Invisibility Cloak would, of course, be essential, and as an added precaution, Harry thought he would take the Marauders Map, which, next to the cloak, was the most useful aid to rule-breaking Harry owned.  The map showed the whole of Hogwarts, including its many shortcuts and secret passageways and, most important of all, it revealed the people inside the castle as minuscule, labeled dots, moving around the corridors, so that Harry would be forewarned if somebody was approaching the bathroom. On Thursday night, Harry sneaked up to bed, put on the cloak, crept back downstairs, and, just as he had done on the night when Hagrid had shown him the dragons, waited for the portrait hole to open.  This time it was Ron who waited outside to give the Fat Lady the password (\"banana fritters\"), \"Good luck,\" Ron muttered, climbing into the room as Harry crept out past him. It was awkward moving under the cloak tonight, because Harry had the heavy egg under one arm and the map held in front of his nose with the other. However, the moonlit corridors were empty and silent, and by checking the map at strategic intervals, Harry was able to ensure that he wouldn't run into anyone he wanted to avoid.  When he reached the statue of Boris the Bewildered, a lost-looking wizard with his gloves on the wrong hands, he located the right door, leaned close to it, and muttered the password, \"Pine fresh,\" just as Cedric had told him. The door creaked open. Harry slipped inside, bolted the door behind him, and pulled off the Invisibility Cloak, looking around. His immediate reaction was that it would be worth becoming a prefect just to be able to use this bathroom.  It was softly lit by a splendid candle-filled chandelier, and everything was made of white marble, including what looked like an empty, rectangular swimming pool sunk into the middle of the floor.  About a hundred golden taps stood all around the pools edges, each with a differently colored Jewel set into its handle.  There was also a diving board.  Long white linen curtains hung at the windows; a large pile of fluffy white towels sat in a corner, and there was a single golden-framed painting on the wall.  It featured a blonde mermaid who was fast asleep on a rock, her long hair over her face.  It fluttered every time she snored. Harry moved forward, looking around, his footsteps echoing off the walls.  Magnificent though the bathroom was - and quite keen though he was to try out a few of those taps - now he was here he couldn't quite suppress the feeling that Cedric might have been having him on."
}