{
  "id": "3f899240a8519833135c5ad0f862b47399ed5dca",
  "text": " The Three Broomsticks was packed, mainly with Hogwarts students enjoying their free afternoon, but also with a variety of magical people Harry rarely saw anywhere else. Harry supposed that as Hogsmeade was the only all-wizard village in Britain, it was a bit of a haven for creatures like hags, who were not as adept as wizards at disguising themselves. It was very hard to move through crowds in the Invisibility Cloak, in case you accidentally trod on someone, which tended to lead to awkward questions.  Harry edged slowly toward a spare table in the corner while Hermione went to buy drinks.  On his way through the pub, Harry spotted Ron, who was sitting with Fred, George, and Lee Jordan.  Resisting the urge to give Ron a good hard poke in the back of the head, he finally reached the table and sat down at it. Hermione joined him a moment later and slipped him a butterbeer under his cloak. \"I look like such an idiot, sitting here on my own,\" she muttered. \"Lucky I brought something to do.\" And she pulled out a notebook in which she had been keeping a record of S.P.E.W. members.  Harry saw his and Ron's names at the top of the very short list.  It seemed a long time ago that they had sat making up those predictions together, and Hermione had turned up and appointed them secretary and treasurer. \"You know, maybe I should try and get some of the villagers involved in S.P.E.W.,\" Hermione said thoughtfully, looking around the pub. \"Yeah, right,\" said Harry.  He took a swig of butterbeer under his cloak.  \"Hermione, when are you going to give up on this spew stuff?\" \"When house-elves have decent wages and working conditions!\"  she hissed back. \"You know, I'm starting to think it's time for more direct action.  I wonder how you get into the school kitchens?\" \"No idea, ask Fred and George,\" said Harry. Hermione lapsed into thoughtful silence, while Harry drank his butterbeer, watching the people in the pub.  All of them looked cheerful and relaxed.  Ernie Macmillan and Hannah Abbot were swapping Chocolate Frog cards at a nearby table; both of them sporting Support Cedric Diggory! badges on their cloaks.  Right over by the door he saw Cho and a large group of her Ravenclaw friends.  She wasn't wearing a Cedric badge though. . . . This cheered up Harry very slightly. What wouldn't he have given to be one of these peophe, sitting around laughing and talking, with nothing to worry about but homework?  He imagined how it would have felt to be here if his name hadn't come out of the Goblet of Fire.  He wouldn't be wearing the Invisibility Cloak, for one thing.  Ron would be sitting with him.  The three of them would probably be happily imagining what deadly dangerous task the school champions would be facing on Tuesday.  He'd have been really hooking forward to it, watching them do whatever it was...cheering on Cedric with everyone else, safe in a seat at the back of the stands... He wondered how the other champions were feeling.  Every time he had seen Cedric lately, he had been surrounded by admirers and looking nervous but excited.  Harry glimpsed Fleur Delacour from time to time in the corridors; she looked exactly as she always did, haughty and unruffled.  And Krum just sat in the library, poring over books. Harry thought of Sirius, and the tight, tense knot in his chest seemed to ease slightly.  He would be speaking to him in just over twelve hours, for tonight was the night they were meeting at the common room fire - assuming nothing went wrong, as everything else had done lately... \"Look, it's Hagrid!\" said Hermione. The back of Hagrid's enormous shaggy head - he had mercifully abandoned his bunches - emerged over the crowd.  Harry wondered why he hadn't spotted him at once, as Hagrid was so large, but standing up carefully, he saw that Hagrid had been leaning low, talking to Professor Moody.  Hagrid had his usual enormous tankard in front of him, but Moody was drinking from his hip flask.  Madam Rosmerta, the pretty landlady, didn't seem to think much of this; she was looking askance at Moody as she collected glasses from tables around them. Perhaps she thought it was an insult to her mulled mead, but Harry knew better.  Moody had told them all during their last Defense Against the Dark Arts lesson that he preferred to prepare his own food and drink at all times, as it was so easy for Dark wizards to poison an unattended cup. As Harry watched, he saw Hagrid and Moody get up to leave.  He waved, then remembered that Hagrid couldn't see him.  Moody, however, paused, his magical eye on the corner where Harry was standing.  He tapped Hagrid in the small of the back (being unable to reach his shoulder), muttered something to him, and then the pair of them made their way back across the pub toward Harry and Hermione's table. \"All right, Hermione?\" said Hagrid loudly. \"Hello,\" said Hermione, smiling back. Moody limped around the table and bent down; Harry thought he was reading the S.P.E.W. notebook, until he muttered, \"Nice cloak, Potter."
}