{
  "id": "41275621509e6784d76f2c2f9ff4c99c8fba6631",
  "text": " \"You can't go now! Not with all the Dark stuff going on here!\"  \"Well - I must say - when I took the job -\" Lockhart muttered, now piling socks on top of his robes. \"nothing in the job description - didn't expect -\"  \"You mean you're running away?\" said Harry disbelievingly. \"After all that stuff you did in your books -\"  \"Books can be misleading,\" said Lockhart delicately.  \"You wrote them!\" Harry shouted.  \"My dear boy,\" said Lockhart, straightening up and frowning at Harry. \"Do use your common sense. My books wouldn't have sold half as well if people didn't think Id done all those things. No one wants to read about some ugly old Armenian warlock, even if he did save a village from werewolves. He'd look dreadful on the front cover. No dress sense at all. And the witch who banished the Bandon Banshee had a harelip. I mean, come on -\"  \"So you've just been taking credit for what a load of other people have done?\" said Harry incredulously.  \"Harry, Harry,\" said Lockhart, shaking his head impatiently, \"it's not nearly as simple as that. There was work involved. I had  *297*  to track these people down. Ask them exactly how they managed to do what they did. Then I had to put a Memory Charm on them so they wouldn't remember doing it. If there's one thing I pride myself on, it's my Memory Charms. No, it's been a lot of work, Harry. It's not all book signings and publicity photos, you know. You want fame, you have to be prepared for a long hard slog.\"  He banged the lids of his trunks shut and locked them.  \"Let's see,\" he said. \"I think that's everything. Yes. Only one thing left.\"  He pulled out his wand and turned to them.  \"Awfully sorry, boys, but I'll have to put a Memory Charm on you now. Can't have you blabbing my secrets all over the place. Id never sell another book -\"  Harry reached his wand just in time. Lockhart had barely raised his, when Harry bellowed, \"Expelliarmus!\"  Lockhart was blasted backward, falling over his trunk; his wand flew high into the air; Ron caught it, and flung it out of the open window.  \"Shouldn't have let Professor Snape teach us that one,\" said Harry furiously, kicking Lockhart's trunk aside. Lockhart was looking up at him, feeble once more. Harry was still pointing his wand at him.  \"What d'you want me to do?\" said Lockhart weakly. \"I don't know where the Chamber of Secrets is. There's nothing I can do.\"  \"You're in luck,\" said Harry, forcing Lockhart to his feet at wandpoint. \"We think we know where it is. And what's inside it. Let's go.\"  *298*  They marched Lockhart out of his office and down the nearest stairs, along the dark corridor where the messages shone on the wall, to the door of Moaning Myrtle's bathroom.  They sent Lockhart in first. Harry was pleased to see that he was shaking.  Moaning Myrtle was sitting on the tank of the end toilet.  \"Oh, it's you,\" she said when she saw Harry. \"What do you want this time?\"  \"To ask you how you died,\" said Harry.  Myrtle's whole aspect changed at once. She looked as though she had never been asked such a flattering question.  \"Ooooh, it was dreadful,\" she said with relish. \"It happened right in here. I died in this very stall. I remember it so well. Id hidden because Olive Hornby was teasing me about my glasses. The door was locked, and I was crying, and then I heard somebody come in. They said something funny. A different language, I think it must have been. Anyway, what really got me was that it was a boy speaking. So I unlocked the door, to tell him to go and use his own toilet, and then -\" Myrtle swelled importantly, her face shining. \"I died.\"  \"How?\" said Harry.  \"No idea,\" said Myrtle in hushed tones. \"I just remember seeing a pair of great, big, yellow eyes. My whole body sort of seized up, and then I was floating away . . . .\" She looked dreamily at Harry. \"And then I came back again. I was determined to haunt Olive Hornby, you see. Oh, she was sorry she'd ever laughed at my glasses.\"  \"Where exactly did you see the eyes?\" said Harry.  *299*  \"Somewhere there,\" said Myrtle, pointing vaguely toward the sink in front of her toilet.  Harry and Ron hurried over to it. Lockhart was standing well back, a look of utter terror on his face.  It looked like an ordinary sink. They examined every inch of it, inside and out, including the pipes below. And then Harry saw it: Scratched on the side of one of the copper taps was a tiny snake.  \"That tap's never worked,\" said Myrtle brightly as he tried to turn it.  \"Harry,\" said Ron. \"Say something. Something in Parseltongue.\"  \"But -\" Harry thought hard. The only times he'd ever managed to speak Parseltongue were when he'd been faced with a real snake. He stared hard at the tiny- engraving, trying to imagine it was real.  \"Open up,\" he said.  He looked at Ron, who shook his head.  \"English,\" he said.  Harry looked back at the snake, willing himself to believe it was alive. If he moved his head, the candlelight made it look as though it were moving.  \"Open up,\" he said.  Except that the words weren't what he heard; a strange hissing had escaped him, and at once the tap glowed with a brilliant white light and began to spin."
}