{
  "id": "415424523f374c12a0c3161b48e43044075b4ab5",
  "text": " Everyone looked quickly at Professor Lupin to see how he would take this; to their surprise, he was still smiling.  \"I'd take that gum out of the keyhole if I were you, Peeves,\" he said pleasantly. \"Mr. Filch won't be able to get in to his brooms.\"  Filch was the Hogwarts caretaker, a bad-tempered, failed wizard who waged a constant war against the students and, indeed, Peeves. However, Peeves paid no attention to Professor Lupin's words, except to blow a loud wet raspberry.  Professor Lupin gave a small sigh and took out his wand.  \"This is a useful little spell, he told the class over his shoulder. \"Please watch closely.\"  He raised the wand to shoulder height, said, \"Waddiwasi! \"and pointed it at Peeves.  With the force of a bullet, the wad of chewing gum shot out of the keyhole and straight down Peeves's left nostril; he whirled upright and zoomed away, cursing.  \"Cool, sit!\" said Dean Thomas in amazement.  \"Thank you, Dean,\" said Professor Lupin, putting his wand away again. \"Shall we proceed?\"  They set off again, the class looking at shabby Professor Lupin with increased respect. He led them down a second corridor and stopped, right outside the staffroom door.  \"Inside, please,\" said Professor Lupin, opening it and standing back.  The staffroom, a long, paneled room full of old, mismatched chairs, was empty except for one teacher. Professor Snape was sitting in a low armchair, and he looked around as the class filed in. His eyes were glittering and there was a nasty sneer playing around his mouth. As Professor Lupin came in and made to close the door behind him, Snape said, \"Leave it open, Lupin. I'd rather not witness this.\"  He got to his feet and strode past the class, his black robes billowing behind him. At the doorway he turned on his heel and said, \"Possibly no one's warned you, Lupin, but this class contains Neville Longbottom. I would advise you not to entrust him with anything difficult. Not unless Miss Granger is hissing instructions in his ear.\"  Neville went scarlet. Harry glared at Snape; it was bad enough that he bullied Neville in his own classes, let alone doing it in front of other teachers.  Professor Lupin had raised his eyebrows.  \"I was hoping that Neville would assist me with the first stage of the operation,\" he said, \"and I am sure he will perform it admirably.\"  Neville's face went, if possible, even redder. Snape's lip curled, but he left, shutting the door with a snap.  \"Now, then,\" said Professor Lupin, beckoning the class toward the end of the room, where there was nothing but an old wardrobe where the teachers kept their spare robes. As Professor Lupin went to stand next to it, the wardrobe gave a sudden wobble, banging off the wall.  \"Nothing to worry about,\" said Professor Lupin calmly because a few people had jumped backward in alarm. \"There's a boggart in there.\"  Most people seemed to feel that this was something to worry about. Neville gave Professor Lupin a look of pure terror, and Seamus Finnigan eyed the now rattling doorknob apprehensively.  \"Boggarts like dark, enclosed spaces,\" said Professor Lupin. \"Wardrobes, the gap beneath beds, the cupboards under sinks -- I've even met one that had lodged itself in a grandfather clock. This one moved in yesterday afternoon, and I asked the headmaster if the staff would leave it to give my third years some practice.  \"So, the first question we must ask ourselves is, what is a boggart?\"  Hermione put up her hand.  \"It's a shape-shifter,\" she said. \"It can take the shape of whatever it thinks will frighten us most.\"  \"Couldn't have put it better myself,\" said Professor Lupin, and Hermione glowed. \"So the boggart sitting in the darkness within has not yet assumed a form. He does not yet know what will frighten the person on the other side of the door. Nobody knows what a boggart looks like when he is alone, but when I let him out, he will immediately become whatever each of us most fears.  \"This means,\" said Professor Lupin, choosing to ignore Neville's 'mall sputter of terror, \"that we have a huge advantage over the boggart before we begin. Have you spotted it, Harry?\"  Trying to answer a question with Hermione next to him, bobbing up and down on the balls of her feet with her hand in the air, was very off-putting, but Harry had a go.  \"Er -- because there are so many of us, it won't know what shape it should be?\"  \"Precisely,\" said Professor Lupin, and Hermione put her hand down, looking a little disappointed. \"It's always best to have com pany when you're dealing with a boggart. He becomes confused. Which should he become, a headless corpse or a flesh-eating slug? I once saw a boggart make that very mistake -- tried to frighten two people at once and turned himself into half a slug. Not remotely frightening.  \"The charm that repels a boggart is simple, yet it requires force of mind. You see, the thing that really finishes a boggart is laughter. What you need to do is force it to assume a shape that you find amusing.  \"We will practice the charm without wands first."
}