{
  "id": "4347c90a0de097a7578c3300af82d91e3110a0a8",
  "text": "  The shortest way to the central keep where her father lay dying was through the godswood, with its grass and wildflowers and thick stands of elm and redwood. A wealth of rustling leaves still clung to the branches of the trees, all ignorant of the word the white raven had brought to Riverrun a fortnight past. Autumn had come, the Conclave had declared, but the gods had not seen fit to tell the winds and woods as yet. For that Catelyn was duly grateful. Autumn was always a fearful time, with the specter of winter looming ahead. Even the wisest man never knew whether his next harvest would be the last.  Hoster Tully, Lord of Riverrun, lay abed in his solar, with its commanding view to the east where the rivers Tumblestone and Red Fork met beyond the walls of his castle. He was sleeping when Catelyn entered, his hair and beard as white as his featherbed, his once portly frame turned small and frail by the death that grew within him.  Beside the bed, still dressed in mail hauberk and travel-stained cloak, sat her father’s brother, the Blackfish. His boots were dusty and spattered with dried mud.  Does Robb know you are returned, Uncle?  Ser Brynden Tully was Robb’s eyes and ears, the commander of his scouts and outriders.   No. I came here straight from the stables, when they told me the king was holding court. His Grace will want to hear my tidings in private first I’d think.  The Blackfish was a tall, lean man, grey of hair and precise in his movements, his clean-shaven face lined and windburnt.  How is he?  he asked, and she knew he did not mean Robb.   Much the same. The maester gives him dreamwine and milk of the poppy for his pain, so he sleeps most of the time, and eats too little. He seems weaker with each day that passes.    Does he speak?    Yes… but there is less and less sense to the things he says. He talks of his regrets, of unfinished tasks, of people long dead and times long past. Sometimes he does not know what season it is, or who I am. Once he called me by Mother’s name.    He misses her still,  Ser Brynden answered.  You have her face. I can see it in your cheekbones, and your jaw…    You remember more of her than I do. It has been a long time.  She seated herself on the bed and brushed away a strand of fine white hair that had fallen across her father’s face.   Each time I ride out, I wonder if I shall find him alive or dead on my return.  Despite their quarrels, there was a deep bond between her father and the brother he had once disowned.   At least you made your peace with him.   They sat for a time in silence, until Catelyn raised her head.  You spoke of tidings that Robb needed to hear?  Lord Hoster moaned and rolled onto his side, almost as if he had heard.  Brynden stood.  Come outside. Best if we do not wake him.   She followed him out onto the stone balcony that jutted three-sided from the solar like the prow of a ship. Her uncle glanced up, frowning.  You can see it by day now. My men call it the Red Messenger… but what is the message?   Catelyn raised her eyes, to where the faint red line of the comet traced a path across the deep blue sky like a long scratch across the face of god.  The Greatjon told Robb that the old gods have unfurled a red flag of vengeance for Ned. Edmure thinks it’s an omen of victory for Riverrun—he sees a fish with a long tail, in the Tully colors, red against blue.  She sighed.  I wish I had their faith. Crimson is a Lannister color.    That thing’s not crimson,  Ser Brynden said.  Nor Tully red, the mud red of the river. That’s blood up there, child, smeared across the sky.    Our blood or theirs?    Was there ever a war where only one side bled?  Her uncle gave a shake of the head.  The riverlands are awash in blood and flame all around the Gods Eye. The fighting has spread south to the Blackwater and north across the Trident, almost to the Twins. Marq Piper and Karyl Vance have won some small victories, and this southron lordling Beric Dondarrion has been raiding the raiders, falling upon Lord Tywin’s foraging parties and vanishing back into the woods. It’s said that Ser Burton Crakehall was boasting that he’d slain Dondarrion, until he led his column into one of Lord Beric’s traps and got every man of them killed.    Some of Ned’s guard from King’s Landing are with this Lord Beric,  Catelyn recalled.  May the gods preserve them.    Dondarrion and this red priest who rides with him are clever enough to preserve themselves, if the tales be true,  her uncle said,  but your father’s bannermen make a sadder tale. Robb should never have let them go. They’ve scattered like quail, each man trying to protect his own, and it’s folly, Cat, folly. Jonos Bracken was wounded in the fighting amidst the ruins of his castle, and his nephew Hendry slain. Tytos Blackwood’s swept the Lannisters off his lands, but they took every cow and pig and speck of grain and left him nothing to defend but Raventree Hall and a scorched desert. Darry men recaptured their lord’s keep but held it less than a fortnight before Gregor Clegane descended on them and put the whole garrison to the sword, even their lord."
}