{
  "id": "44842f28445f6116d26f52a32883936f3fd41e34",
  "text": " Smoke was pouring out the open door like a writhing black snake, and she could hear the screams of the poor animals inside, donkeys and horses and men. She chewed her lip, and darted through the doors, crouched low where the smoke wasn’t quite so thick.  A donkey was caught in a ring of fire, shrieking in terror and pain. She could smell the stench of burning hair. The roof was gone up too, and things were falling down, pieces of flaming wood and bits of straw and hay. Arya put a hand over her mouth and nose. She couldn’t see the wagon for the smoke, but she could still hear Biter screaming. She crawled toward the sound.  And then a wheel was looming over her. The wagon jumped and moved a half foot when Biter threw himself against his chains again. Jaqen saw her, but it was too hard to breathe, let alone talk. She threw the axe into the wagon. Rorge caught it and lifted it over his head, rivers of sooty sweat pouring down his noseless face. Arya was running, coughing. She heard the steel crash through the old wood, and again, again. An instant later came a crack as loud as thunder, and the bottom of the wagon came ripping loose in an explosion of splinters.  Arya rolled headfirst into the tunnel and dropped five feet. She got dirt in her mouth but she didn’t care, the taste was fine, the taste was mud and water and worms and life. Under the earth the air was cool and dark. Above was nothing but blood and roaring red and choking smoke and the screams of dying horses. She moved her belt around so Needle would not be in her way, and began to crawl. A dozen feet down the tunnel she heard the sound, like the roar of some monstrous beast, and a cloud of hot smoke and black dust came billowing up behind her, smelling of hell. Arya held her breath and kissed the mud on the floor of the tunnel and cried. For whom, she could not say.      TYRION  The queen was not disposed to wait on Varys.  Treason is vile enough,  she declared furiously,  but this is barefaced naked villainy, and I do not need that mincing eunuch to tell me what must be done with villains.   Tyrion took the letters from his sister’s hand and compared them side by side. There were two copies, the words exactly alike, though they had been written by different hands.   Maester Frenken received the first missive at Castle Stokeworth,  Grand Maester Pycelle explained.  The second copy came through Lord Gyles.   Littlefinger fingered his beard.  If Stannis bothered with them, it’s past certain every other lord in the Seven Kingdoms saw a copy as well.    I want these letters burned, every one,  Cersei declared.  No hint of this must reach my son’s ears, or my father’s.    I imagine Father’s heard rather more than a hint by now,  Tyrion said dryly.  Doubtless Stannis sent a bird to Casterly Rock, and another to Harrenhal. As for burning the letters, to what point? The song is sung, the wine is spilled, the wench is pregnant. And this is not as dire as it seems, in truth.   Cersei turned on him in green-eyed fury.  Are you utterly witless? Did you read what he says? The boy Joffrey, he calls him. And he dares to accuse me of incest, adultery, and treason!   Only because you’re guilty. It was astonishing to see how angry Cersei could wax over accusations she knew perfectly well to be true. If we lose the war, she ought to take up mummery, she has a gift for it. Tyrion waited until she was done and said,  Stannis must have some pretext to justify his rebellion. What did you expect him to write? ‘Joffrey is my brother’s trueborn son and heir, but I mean to take his throne for all that’?    I will not suffer to be called a whore!   Why, sister, he never claims Jaime paid you. Tyrion made a show of glancing over the writing again. There had been some niggling phrase… Done in the Light of the Lord,  he read.  A queer choice of words, that.   Pycelle cleared his throat.  These words often appear in letters and documents from the Free Cities. They mean no more than, let us say, written in the sight of god. The god of the red priests. It is their usage, I do believe.    Varys told us some years past that Lady Selyse had taken up with a red priest,  Littlefinger reminded them.  Tyrion tapped the paper.  And now it would seem her lord husband has done the same. We can use that against him. Urge the High Septon to reveal how Stannis has turned against the gods as well as his rightful king…    Yes, yes,  the queen said impatiently,  but first we must stop this filth from spreading further. The council must issue an edict. Any man heard speaking of incest or calling Joff a bastard should lose his tongue for it.    A prudent measure,  said Grand Maester Pycelle, his chain of office clinking as he nodded.   A folly,  sighed Tyrion.  When you tear out a man’s tongue, you are not proving him a liar, you’re only telling the world that you fear what he might say.    So what would you have us do?  his sister demanded.   Very little. Let them whisper, they’ll grow bored with the tale soon enough."
}