{
  "id": "49312b625b9059fcdf656883c0f0ef6ae7bcc660",
  "text": " His brother Stannis, Lord Tywin Lannister, Eddard Stark…  He spat.   You hate this Lord Stark,  Dany said.   He took from me all I loved, for the sake of a few lice-ridden poachers and his precious honor,  Ser Jorah said bitterly. From his tone, she could tell the loss still pained him. He changed the subject quickly.  There,  he announced, pointing.  Vaes Dothrak. The city of the horselords.   Khal Drogo and his bloodriders led them through the great bazaar of the Western Market, down the broad ways beyond. Dany followed close on her silver, staring at the strangeness about her. Vaes Dothrak was at once the largest city and the smallest that she had ever known. She thought it must be ten times as large as Pentos, a vastness without walls or limits, its broad windswept streets paved in grass and mud and carpeted with wildflowers. In the Free Cities of the west, towers and manses and hovels and bridges and shops and halls all crowded in on one another, but Vaes Dothrak sprawled languorously, baking in the warm sun, ancient, arrogant, and empty.  Even the buildings were so queer to her eyes. She saw carved stone pavilions, manses of woven grass as large as castles, rickety wooden towers, stepped pyramids faced with marble, log halls open to the sky. In place of walls, some palaces were surrounded by thorny hedges.  None of them are alike,  she said.   Your brother had part of the truth,  Ser Jorah admitted.  The Dothraki do not build. A thousand years ago, to make a house, they would dig a hole in the earth and cover it with a woven grass roof. The buildings you see were made by slaves brought here from lands they’ve plundered, and they built each after the fashion of their own peoples.   Most of the halls, even the largest, seemed deserted.  Where are the people who live here?  Dany asked. The bazaar had been full of running children and men shouting, but elsewhere she had seen only a few eunuchs going about their business.   Only the crones of the dosh khaleen dwell permanently in the sacred city, them and their slaves and servants,  Ser Jorah replied,  yet Vaes Dothrak is large enough to house every man of every khalasar, should all the khals return to the Mother at once. The crones have prophesied that one day that will come to pass, and so Vaes Dothrak must be ready to embrace all its children.   Khal Drogo finally called a halt near the Eastern Market where the caravans from Yi Ti and Asshai and the Shadow Lands came to trade, with the Mother of Mountains looming overhead. Dany smiled as she recalled Magister Illyrio’s slave girl and her talk of a palace with two hundred rooms and doors of solid silver. The  palace  was a cavernous wooden feasting hall, its rough-hewn timbered walls rising forty feet, its roof sewn silk, a vast billowing tent that could be raised to keep out the rare rains, or lowered to admit the endless sky. Around the hall were broad grassy horse yards fenced with high hedges, firepits, and hundreds of round earthen houses that bulged from the ground like miniature hills, covered with grass.  A small army of slaves had gone ahead to prepare for Khal Drogo’s arrival. As each rider swung down from his saddle, he unbelted his arakh and handed it to a waiting slave, and any other weapons he carried as well. Even Khal Drogo himself was not exempt. Ser Jorah had explained that it was forbidden to carry a blade in Vaes Dothrak, or to shed a free man’s blood. Even warring khalasars put aside their feuds and shared meat and mead together when they were in sight of the Mother of Mountains. In this place, the crones of the dosh khaleen had decreed, all Dothraki were one blood, one khalasar, one herd.  Cohollo came to Dany as Irri and Jhiqui were helping her down off her silver. He was the oldest of Drogo’s three bloodriders, a squat bald man with a crooked nose and a mouth full of broken teeth, shattered by a mace twenty years before when he saved the young khalakka from sellswords who hoped to sell him to his father’s enemies. His life had been bound to Drogo’s the day her lord husband was born.  Every khal had his bloodriders. At first Dany had thought of them as a kind of Dothraki Kingsguard, sworn to protect their lord, but it went further than that. Jhiqui had taught her that a bloodrider was more than a guard; they were the khal’s brothers, his shadows, his fiercest friends.  Blood of my blood,  Drogo called them, and so it was; they shared a single life. The ancient traditions of the horselords demanded that when the khal died, his bloodriders died with him, to ride at his side in the night lands. If the khal died at the hands of some enemy, they lived only long enough to avenge him, and then followed him joyfully into the grave. In some khalasars, Jhiqui said, the bloodriders shared the khal’s wine, his tent, and even his wives, though never his horses. A man’s mount was his own.  Daenerys was glad that Khal Drogo did not hold to those ancient ways. She should not have liked being shared."
}