{
  "id": "4aa5b0df6dfba2ac500932163a994089ea85e531",
  "text": "  The war had not ended until the day she and Lysa had been wed. It was at their wedding feast that Brynden told his brother he was leaving Riverrun to serve Lysa and her new husband, the Lord of the Eyrie. Lord Hoster had not spoken his brother’s name since, from what Edmure told her in his infrequent letters.  Nonetheless, during all those years of Catelyn’s girlhood, it had been Brynden the Blackfish to whom Lord Hoster’s children had run with their tears and their tales, when Father was too busy and Mother too ill. Catelyn, Lysa, Edmure… and yes, even Petyr Baelish, their father’s ward… he had listened to them all patiently, as he listened now, laughing at their triumphs and sympathizing with their childish misfortunes.  When she was done, her uncle remained silent for a long time, as his horse negotiated the steep, rocky trail.  Your father must be told,  he said at last.  If the Lannisters should march, Winterfell is remote and the Vale walled up behind its mountains, but Riverrun lies right in their path.    I’d had the same fear,  Catelyn admitted.  I shall ask Maester Colemon to send a bird when we reach the Eyrie.  She had other messages to send as well; the commands that Ned had given her for his bannermen, to ready the defenses of the north.  What is the mood in the Vale?  she asked.   Angry,  Brynden Tully admitted.  Lord Jon was much loved, and the insult was keenly felt when the king named Jaime Lannister to an office the Arryns had held for near three hundred years. Lysa has commanded us to call her son the True Warden of the East, but no one is fooled. Nor is your sister alone in wondering at the manner of the Hand’s death. None dare say Jon was murdered, not openly, but suspicion casts a long shadow.  He gave Catelyn a look, his mouth tight.  And there is the boy.    The boy? What of him?  She ducked her head as they passed under a low overhang of rock, and around a sharp turn.  Her uncle’s voice was troubled.  Lord Robert,  he sighed.  Six years old, sickly, and prone to weep if you take his dolls away. Jon Arryn’s trueborn heir, by all the gods, yet there are some who say he is too weak to sit his father’s seat, Nestor Royce has been high steward these past fourteen years, while Lord Jon served in King’s Landing, and many whisper that he should rule until the boy comes of age. Others believe that Lysa must marry again, and soon. Already the suitors gather like crows on a battlefield. The Eyrie is full of them.    I might have expected that,  Catelyn said. Small wonder there; Lysa was still young, and the kingdom of Mountain and Vale made a handsome wedding gift.  Will Lysa take another husband?    She says yes, provided she finds a man who suits her,  Brynden Tully said,  but she has already rejected Lord Nestor and a dozen other suitable men. She swears that this time she will choose her lord husband.    You of all people can scarce fault her for that.   Ser Brynden snorted.  Nor do I, but… it seems to me Lysa is only playing at courtship. She enjoys the sport, but I believe your sister intends to rule herself until her boy is old enough to be Lord of the Eyrie in truth as well as name.    A woman can rule as wisely as a man,  Catelyn said.   The right woman can,  her uncle said with a sideways glance.  Make no mistake, Cat. Lysa is not you.  He hesitated a moment.  If truth be told, I fear you may not find your sister as helpful as you would like.   She was puzzled.  What do you mean?    The Lysa who came back from King’s Landing is not the same girl who went south when her husband was named Hand. Those years were hard for her. You must know. Lord Arryn was a dutiful husband, but their marriage was made from politics, not passion.    As was my own.    They began the same, but your ending has been happier than your sister’s. Two babes stillborn, twice as many miscarriages, Lord Arryn’s death… Catelyn, the gods gave Lysa only the one child, and he is all your sister lives for now, poor boy. Small wonder she fled rather than see him handed over to the Lannisters. Your sister is afraid, child, and the Lannisters are what she fears most. She ran to the Vale, stealing away from the Red Keep like a thief in the night, and all to snatch her son out of the lion’s mouth… and now you have brought the lion to her door.    In chains,  Catelyn said. A crevasse yawned on her right, falling away into darkness. She reined up her horse and picked her way along step by careful step.   Oh?  Her uncle glanced back, to where Tyrion Lannister was making his slow descent behind them.  I see an axe on his saddle, a dirk at his belt, and a sellsword that trails after him like a hungry shadow. Where are the chains, sweet one?   Catelyn shifted uneasily in her seat.  The dwarf is here, and not by choice. Chains or no, he is my prisoner. Lysa will want him to answer for his crimes no less than I. It was her own lord husband the Lannisters murdered, and her own letter that first warned us against them.   Brynden Blackfish gave her a weary smile."
}