{
  "id": "4c1bd31d444e539d92e357aa3f0fda66db6fc63e",
  "text": "  The comet led me to Qarth for a reason. I had hoped to find my army here, but it seems that will not be. What else remains, I ask myself?  I am afraid, she realized, but I must be brave.  Come the morrow, you must go to Pyat Pree.       TYRION  The girl never wept. Young as she was, Myrcella Baratheon was a princess born. And a Lannister, despite her name, Tyrion reminded himself, as much Jaime’s blood as Cersei’s.  To be sure, her smile was a shade tremulous when her brothers took their leave of her on the deck of the Seaswift, but the girl knew the proper words to say, and she said them with courage and dignity. When the time came to part, it was Prince Tommen who cried, and Myrcella who gave him comfort.  Tyrion looked down upon the farewells from the high deck of King Robert’s Hammer, a great war galley of four hundred oars. Rob’s Hammer, as her oarsmen called her, would form the main strength of Myrcella’s escort. Lionstar, Bold Wind, and Lady Lyanna would sail with her as well.  It made Tyrion more than a little uneasy to detach so great a part of their already inadequate fleet, depleted as it was by the loss of all those ships that had sailed with Lord Stannis to Dragonstone and never returned, but Cersei would hear of nothing less. Perhaps she was wise. If the girl was captured before she reached Sunspear, the Dornish alliance would fall to pieces. So far Doran Martell had done no more than call his banners. Once Myrcella was safe in Braavos, he had pledged to move his strength to the high passes, where the threat might make some of the Marcher lords rethink their loyalties and give Stannis pause about marching north. It was purely a feint, however. The Martells would not commit to actual battle unless Dorne itself was attacked, and Stannis was not so great a fool. Though some of his bannermen may be, Tyrion reflected. I should think on that.  He cleared his throat.  You know your orders, Captain.    I do, my lord. We are to follow the coast, staying always in sight of land, until we reach Crackclaw Point. From there we are to strike out across the narrow sea for Braavos. On no account are we to sail within sight of Dragonstone.    And if our foes should chance upon you nonetheless?    If a single ship, we are to run them off or destroy them. If there are more, the Bold Wind will cleave to the Seaswift to protect her while the rest of the fleet does battle.   Tyrion nodded. If the worst happened, the little Seaswift ought to be able to outrun pursuit. A small ship with big sails, she was faster than any warship afloat, or so her captain had claimed. Once Myrcella reached Braavos, she ought to be safe. He was sending Ser Arys Oakheart as her sworn shield, and had engaged the Braavosi to bring her the rest of the way to Sunspear. Even Lord Stannis would hesitate to wake the anger of the greatest and most powerful of the Free Cities. Traveling from King’s Landing to Dorne by way of Braavos was scarcely the most direct of routes, but it was the safest… or so he hoped.  If Lord Stannis knew of this sailing, he could not choose a better time to send his fleet against us. Tyrion glanced back to where the Rush emptied out into Blackwater Bay and was relieved to see no signs of sails on the wide green horizon. At last report, the Baratheon fleet still lay off Storm’s End, where Ser Cortnay Penrose continued to defy the besiegers in dead Renly’s name. Meanwhile, Tyrion’s winch towers stood three-quarters complete. Even now men were hoisting heavy blocks of stone into place, no doubt cursing him for making them work through the festivities. Let them curse. Another fortnight, Stannis, that’s all I require. Another fortnight and it will be done.  Tyrion watched his niece kneel before the High Septon to receive his blessing on her voyage. Sunlight caught in his crystal crown and spilled rainbows across Myrcella’s upturned face. The noise from the riverside made it impossible to hear the prayers. He hoped the gods had sharper ears. The High Septon was as fat as a house, and more pompous and long of wind than even Pycelle. Enough, old man, make an end to it, Tyrion thought irritably. The gods have better things to do than listen to you, and so do I.  When at last the droning and mumbling was done, Tyrion took his farewell of the captain of Rob’s Hammer.  Deliver my niece safely to Braavos, and there will be a knighthood waiting for you on your return,  he promised.  As he made his way down the steep plank to the quay, Tyrion could feel unkind eyes upon him. The galley rocked gently and the movement underfoot made his waddle worse than ever. I’ll wager they’d love to snigger. No one dared, not openly, though he heard mutterings mingled with the creak of wood and rope and the rush of the river around the pilings. They do not love me, he thought. Well, small wonder. I’m well fed and ugly, and they are starving.  Bronn escorted him through the crowd to join his sister and her sons. Cersei ignored him, preferring to lavish her smiles on their cousin."
}