{
  "id": "4e07b70d778abe18c4b0cd693a70142a5588dea1",
  "text": " At their head was a knight in dark armor. His rounded helm gleamed a sullen red, and a pale pink cloak streamed from his shoulders. Outside the main gate he reined up, and one of his men shouted for the castle to open.   Are you friend or foe?  Black Lorren bellowed down.   Would a foe bring such fine gifts?  Red Helm waved a hand, and three corpses were dumped in front of the gates. A torch was waved above the bodies, so the defenders upon the walls might see the faces of the dead.   The old castellan,  said Black Lorren.   With Leobald Tallhart and Cley Cerwyn.  The boy lord had taken an arrow in the eye, and Ser Rodrik had lost his left arm at the elbow. Maester Luwin gave a wordless cry of dismay, turned away from the battlements, and fell to his knees sick.   The great pig Manderly was too craven to leave White Harbor, or we would have brought him as well,  shouted Red Helm.  I am saved, Theon thought. So why did he feel so empty? This was victory, sweet victory, the deliverance he had prayed for. He glanced at Maester Luwin. To think how close I came to yielding, and taking the black…   Open the gates for our friends.  Perhaps tonight Theon would sleep without fear of what his dreams might bring.  The Dreadfort men made their way across the moat and through the inner gates. Theon descended with Black Lorren and Maester Luwin to meet them in the yard. Pale red pennons trailed from the ends of a few lances, but many more carried battle-axes and greatswords and shields hacked half to splinters.  How many men did you lose?  Theon asked Red Helm as he dismounted.   Twenty or thirty.  The torchlight glittered off the chipped enamel of his visor. His helm and gorget were wrought in the shape of a man’s face and shoulders, skinless and bloody, mouth open in a silent howl of anguish.   Ser Rodrik had you five-to-one.    Aye, but he thought us friends. A common mistake. When the old fool gave me his hand, I took half his arm instead. Then I let him see my face.  The man put both hands to his helm and lifted it off his head, holding it in the crook of his arm.   Reek,  Theon said, disquieted. How did a serving man get such fine armor?  The man laughed.  The wretch is dead.  He stepped closer.  The girl’s fault. If she had not run so far, his horse would not have lamed, and we might have been able to flee. I gave him mine when I saw the riders from the ridge. I was done with her by then, and he liked to take his turn while they were still warm. I had to pull him off her and shove my clothes into his hands—calfskin boots and velvet doublet, silver-chased swordbelt, even my sable cloak. Ride for the Dreadfort, I told him, bring all the help you can. Take my horse, he’s swifter, and here, wear the ring my father gave me, so they’ll know you came from me. He’d learned better than to question me. By the time they put that arrow through his back, I’d smeared myself with the girl’s filth and dressed in his rags. They might have hanged me anyway, but it was the only chance I saw.  He rubbed the back of his hand across his mouth.  And now, my sweet prince, there was a woman promised me, if I brought two hundred men. Well, I brought three times as many, and no green boys nor fieldhands neither, but my father’s own garrison.   Theon had given his word. This was not the time to flinch. Pay him his pound of flesh and deal with him later.  Harrag,  he said,  go to the kennels and bring Palla out for…?    Ramsay.  There was a smile on his plump lips, but none in those pale pale eyes.  Snow, my wife called me before she ate her fingers, but I say Bolton.  His smile curdled.  So you’d offer me a kennel girl for my good service, is that the way of it?   There was a tone in his voice Theon did not like, no more than he liked the insolent way the Dreadfort men were looking at him.  She was what was promised.    She smells of dogshit. I’ve had enough of bad smells, as it happens. I think I’ll have your bedwarmer instead. What do you call her? Kyra?    Are you mad?  Theon said angrily.  I’ll have you—   The Bastard’s backhand caught him square, and his cheekbone shattered with a sickening crunch beneath the lobstered steel. The world vanished in a red roar of pain.  Sometime later, Theon found himself on the ground. He rolled onto his stomach and swallowed a mouthful of blood. Close the gates! he tried to shout, but it was too late. The Dreadfort men had cut down Red Rolfe and Kenned, and more were pouring through, a river of mail and sharp swords. There was a ringing in his ears, and horror all around him. Black Lorren had his sword out, but there were already four of them pressing in on him. He saw Ulf go down with a crossbow bolt through the belly as he ran for the Great Hall. Maester Luwin was trying to reach him when a knight on a warhorse planted a spear between his shoulders, then swung back to ride over him. Another man whipped a torch round and round his head and then lofted it toward the thatched roof of the stables.  Save me the Freys,  the Bastard was shouting as the flames roared upward,  and burn the rest."
}