{
  "id": "4fd7805c63d9f542a04c3ac6f3bf804778b6cba9",
  "text": " I heard children crying as the riders drove them off with their whips. Tell me again what you saved.    Your life.   Mirri Maz Duur laughed cruelly.  Look to your khal and see what life is worth, when all the rest is gone.   Dany called out for the men of her khas and bid them take Mirri Maz Duur and bind her hand and foot, but the maegi smiled at her as they carried her off, as if they shared a secret. A word, and Dany could have her head off… yet then what would she have? A head? If life was worthless, what was death?  They led Khal Drogo back to her tent, and Dany commanded them to fill a tub, and this time there was no blood in the water. She bathed him herself, washing the dirt and the dust from his arms and chest, cleaning his face with a soft cloth, soaping his long black hair and combing the knots and tangles from it till it shone again as she remembered. It was well past dark before she was done, and Dany was exhausted. She stopped for drink and food, but it was all she could do to nibble at a fig and keep down a mouthful of water. Sleep would have been a release, but she had slept enough… too long, in truth. She owed this night to Drogo, for all the nights that had been, and yet might be.  The memory of their first ride was with her when she led him out into the darkness, for the Dothraki believed that all things of importance in a man’s life must be done beneath the open sky. She told herself that there were powers stronger than hatred, and spells older and truer than any the maegi had learned in Asshai. The night was black and moonless, but overhead a million stars burned bright. She took that for an omen.  No soft blanket of grass welcomed them here, only the hard dusty ground, bare and strewn with stones. No trees stirred in the wind, and there was no stream to soothe her fears with the gentle music of water. Dany told herself that the stars would be enough.  Remember, Drogo,  she whispered.  Remember our first ride together, the day we wed. Remember the night we made Rhaego, with the khalasar all around us and your eyes on my face. Remember how cool and clean the water was in the Womb of the World. Remember, my sun-and-stars. Remember, and come back to me.   The birth had left her too raw and torn to take him inside of her, as she would have wanted, but Doreah had taught her other ways. Dany used her hands, her mouth, her breasts. She raked him with her nails and covered him with kisses and whispered and prayed and told him stories, and by the end she had bathed him with her tears. Yet Drogo did not feel, or speak, or rise.  And when the bleak dawn broke over an empty horizon, Dany knew that he was truly lost to her.  When the sun rises in the west and sets in the east,  she said sadly.  When the seas go dry and mountains blow in the wind like leaves. When my womb quickens again, and I bear a living child. Then you will return, my sun-and-stars, and not before.   Never, the darkness cried, never never never.  Inside the tent Dany found a cushion, soft silk stuffed with feathers. She clutched it to her breasts as she walked back out to Drogo, to her sun-and-stars. If I look back I am lost. It hurt even to walk, and she wanted to sleep, to sleep and not to dream.  She knelt, kissed Drogo on the lips, and pressed the cushion down across his face.      TYRION   They have my son,  Tywin Lannister said.   They do, my lord.  The messenger’s voice was dulled by exhaustion. On the breast of his torn surcoat, the brindled boar of Crakehall was half-obscured by dried blood.  One of your sons, Tyrion thought. He took a sip of wine and said not a word, thinking of Jaime. When he lifted his arm, pain shot through his elbow, reminding him of his own brief taste of battle. He loved his brother, but he would not have wanted to be with him in the Whispering Wood for all the gold in Casterly Rock.  His lord father’s assembled captains and bannermen had fallen very quiet as the courier told his tale. The only sound was the crackle and hiss of the log burning in the hearth at the end of the long, drafty common room.  After the hardships of the long relentless drive south, the prospect of even a single night in an inn had cheered Tyrion mightily… though he rather wished it had not been this inn again, with all its memories. His father had set a grueling pace, and it had taken its toll. Men wounded in the battle kept up as best they could or were abandoned to fend for themselves. Every morning they left a few more by the roadside, men who went to sleep never to wake. Every afternoon a few more collapsed along the way. And every evening a few more deserted, stealing off into the dusk. Tyrion had been half-tempted to go with them.  He had been upstairs, enjoying the comfort of a featherbed and the warmth of Shae’s body beside him, when his squire had woken him to say that a rider had arrived with dire news of Riverrun. So it had all been for nothing. The rush south, the endless forced marches, the bodies left beside the road… all for naught."
}