{
  "id": "505bfe07df45e43b69f9be46fae4ec8093c4a515",
  "text": "  He could hear her still at times. Promise me, she had cried, in a room that smelled of blood and roses. Promise me, Ned. The fever had taken her strength and her voice had been faint as a whisper, but when he gave her his word, the fear had gone out of his sister’s eyes. Ned remembered the way she had smiled then, how tightly her fingers had clutched his as she gave up her hold on life, the rose petals spilling from her palm, dead and black. After that he remembered nothing. They had found him still holding her body, silent with grief. The little crannogman, Howland Reed, had taken her hand from his. Ned could recall none of it.  I bring her flowers when I can,  he said.  Lyanna was… fond of flowers.   The king touched her cheek, his fingers brushing across the rough stone as gently as if it were living flesh.  I vowed to kill Rhaegar for what he did to her.    You did,  Ned reminded him.   Only once,  Robert said bitterly.  They had come together at the ford of the Trident while the battle crashed around them, Robert with his warhammer and his great antlered helm, the Targaryen prince armored all in black. On his breastplate was the three-headed dragon of his House, wrought all in rubies that flashed like fire in the sunlight. The waters of the Trident ran red around the hooves of their destriers as they circled and clashed, again and again, until at last a crushing blow from Robert’s hammer stove in the dragon and the chest beneath it. When Ned had finally come on the scene, Rhaegar lay dead in the stream, while men of both armies scrabbled in the swirling waters for rubies knocked free of his armor.   In my dreams, I kill him every night,  Robert admitted.  A thousand deaths will still be less than he deserves.   There was nothing Ned could say to that. After a quiet, he said,  We should return, Your Grace. Your wife will be waiting.    The Others take my wife,  Robert muttered sourly, but he started back the way they had come, his footsteps falling heavily.  And if I hear ‘Your Grace’ once more, I’ll have your head on a spike. We are more to each other than that.    I had not forgotten,  Ned replied quietly. When the king did not answer, he said,  Tell me about Jon.   Robert shook his head.  I have never seen a man sicken so quickly. We gave a tourney on my son’s name day. If you had seen Jon then, you would have sworn he would live forever. A fortnight later he was dead. The sickness was like a fire in his gut. It burned right through him.  He paused beside a pillar, before the tomb of a long-dead Stark.  I loved that old man.    We both did.  Ned paused a moment.  Catelyn fears for her sister. How does Lysa bear her grief?   Robert’s mouth gave a bitter twist.  Not well, in truth,  he admitted.  I think losing Jon has driven the woman mad, Ned. She has taken the boy back to the Eyrie. Against my wishes. I had hoped to foster him with Tywin Lannister at Casterly Rock. Jon had no brothers, no other sons. Was I supposed to leave him to be raised by women?   Ned would sooner entrust a child to a pit viper than to Lord Tywin, but he left his doubts unspoken. Some old wounds never truly heal, and bleed again at the slightest word.  The wife has lost the husband,  he said carefully.  Perhaps the mother feared to lose the son. The boy is very young.    Six, and sickly, and Lord of the Eyrie, gods have mercy,  the king swore.  Lord Tywin had never taken a ward before. Lysa ought to have been honored. The Lannisters are a great and noble House. She refused to even hear of it. Then she left in the dead of night, without so much as a by-your-leave. Cersei was furious.  He sighed deeply.  The boy is my namesake, did you know that? Robert Arryn. I am sworn to protect him. How can I do that if his mother steals him away?    I will take him as ward, if you wish,  Ned said.  Lysa should consent to that. She and Catelyn were close as girls, and she would be welcome here as well.    A generous offer, my friend,  the king said,  but too late. Lord Tywin has already given his consent. Fostering the boy elsewhere would be a grievous affront to him.    I have more concern for my nephew’s welfare than I do for Lannister pride,  Ned declared.   That is because you do not sleep with a Lannister.  Robert laughed, the sound rattling among the tombs and bouncing from the vaulted ceiling. His smile was a flash of white teeth in the thicket of the huge black beard.  Ah, Ned,  he said,  you are still too serious.  He put a massive arm around Ned’s shoulders.  I had planned to wait a few days to speak to you, but I see now there’s no need for it. Come, walk with me.   They started back down between the pillars. Blind stone eyes seemed to follow them as they passed. The king kept his arm around Ned’s shoulder.  You must have wondered why I finally came north to Winterfell, after so long.   Ned had his suspicions, but he did not give them voice.  For the joy of my company, surely,  he said lightly.  And there is the Wall. You need to see it, Your Grace, to walk along its battlements and talk to those who man it."
}