{
  "id": "51116fc60084a914d53dcd4f5545150d9d21a5f4",
  "text": " Where it touched the ground it melted, but all about him rock and root and branch wore a thin blanket of white. As he waited, he was conscious of how uncomfortable he felt. He could not feel his legs, hanging useless in the stirrups, but the strap around his chest was tight and chafing, and the melting snow had soaked through his gloves to chill his hands. He wondered what was keeping Theon and Maester Luwin and Joseth and the rest.  When he heard the rustle of leaves, Bran used the reins to make Dancer turn, expecting to see his friends, but the ragged men who stepped out onto the bank of the stream were strangers.   Good day to you,  he said nervously. One look, and Bran knew they were neither foresters nor farmers. He was suddenly conscious of how richly he was dressed. His surcoat was new, dark grey wool with silver buttons, and a heavy silver pin fastened his fur-trimmed cloak at the shoulders. His boots and gloves were lined with fur as well.   All alone, are you?  said the biggest of them, a bald man with a raw windburnt face.  Lost in the wolfswood, poor lad.    I’m not lost.  Bran did not like the way the strangers were looking at him. He counted four, but when he turned his head, he saw two others behind him.  My brother rode off just a moment ago, and my guard will be here shortly.    Your guard, is it?  a second man said. Grey stubble covered his gaunt face.  And what would they be guarding, my little lord? Is that a silver pin I see there on your cloak?    Pretty,  said a woman’s voice. She scarcely looked like a woman; tall and lean, with the same hard face as the others, her hair hidden beneath a bowl-shaped halfhelm. The spear she held was eight feet of black oak, tipped in rusted steel.   Let’s have a look,  said the big bald man.  Bran watched him anxiously. The man’s clothes were filthy, fallen almost to pieces, patched here with brown and here with blue and there with a dark green, and faded everywhere to grey, but once that cloak might have been black. The grey stubbly man wore black rags too, he saw with a sudden start. Suddenly Bran remembered the oathbreaker his father had beheaded, the day they had found the wolf pups; that man had worn black as well, and Father said he had been a deserter from the Night’s Watch. No man is more dangerous, he remembered Lord Eddard saying. The deserter knows his life is forfeit if he is taken, so he will not flinch from any crime, no matter how vile or cruel.   The pin, lad,  the big man said. He held out his hand.   We’ll take the horse too,  said another of them, a woman shorter than Robb, with a broad fiat face and lank yellow hair.  Get down, and be quick about it.  A knife slid from her sleeve into her hand, its edge jagged as a saw.   No,  Bran blurted.  I can’t…   The big man grabbed his reins before Bran could think to wheel Dancer around and gallop off.  You can, lordling… and will, if you know what’s good for you.    Stiv, look how he’s strapped on.  The tall woman pointed with her spear.  Might be it’s the truth he’s telling.    Straps, is it?  Stiv said. He drew a dagger from a sheath at his belt.  There’s ways to deal with straps.    You some kind of cripple?  asked the short woman.  Bran flared.  I’m Brandon Stark of Winterfell, and you better let go of my horse, or I’ll see you all dead.   The gaunt man with the grey stubbled face laughed.  The boy’s a Stark, true enough. Only a Stark would be fool enough to threaten where smarter men would beg.    Cut his little cock off and stuff it in his mouth,  suggested the short woman.  That should shut him up.    You’re as stupid as you are ugly, Hali,  said the tall woman.  The boy’s worth nothing dead, but alive… gods be damned, think what Mance would give to have Benjen Stark’s own blood to hostage!    Mance be damned,  the big man cursed.  You want to go back there, Osha? More fool you. Think the white walkers will care if you have a hostage?  He turned back to Bran and slashed at the strap around his thigh. The leather parted with a sigh.  The stroke had been quick and careless, biting deep. Looking down, Bran glimpsed pale flesh where the wool of his leggings had parted. Then the blood began to flow. He watched the red stain spread, feeling light-headed, curiously apart; there had been no pain, not even a hint of feeling. The big man grunted in surprise.   Put down your steel now, and I promise you shall have a quick and painless death,  Robb called out.  Bran looked up in desperate hope, and there he was. The strength of the words were undercut by the way his voice cracked with strain. He was mounted, the bloody carcass of an elk slung across the back of his horse, his sword in a gloved hand.   The brother,  said the man with the grey stubbly face.   He’s a fierce one, he is,  mocked the short woman. Hali, they called her.  You mean to fight us, boy?    Don’t be a fool, lad. You’re one against six.  The tall woman, Osha, leveled her spear.  Off the horse, and throw down the sword. We’ll thank you kindly for the mount and for the venison, and you and your brother can be on your way."
}