{
  "id": "51a18ea8d7adff39aee63ac2d86f0e7bced94fc7",
  "text": " Have I told you about old Dick, now?    Only three hundred times.  Every man at Castle Black had heard Ulmer’s tales of the great outlaw band of yore; of Simon Toyne and the Smiling Knight, Oswyn Longneck the Thrice-Hanged, Wenda the White Fawn, Fletcher Dick, Big Belly Ben, and all the rest. Searching for escape, Sweet Donnel looked about and spied Sam standing in the muck.  Slayer,  he called.  Come, show us how you slew the Other.  He held out the tall yew longbow.  Sam turned red.  It wasn’t an arrow, it was a dagger, dragonglass…  He knew what would happen if he took the bow. He would miss the butt and send the arrow sailing over the dike off into the trees. Then he’d hear the laughter.   No matter,  said Alan of Rosby, another fine bowman.  We’re all keen to see the Slayer shoot. Aren’t we, lads?   He could not face them; the mocking smiles, the mean little jests, the contempt in their eyes. Sam turned to go back the way he’d come, but his right foot sank deep in the muck, and when he tried to pull it out his boot came off. He had to kneel to wrench it free, laughter ringing in his ears. Despite all his socks, the snowmelt had soaked through to his toes by the time he made his escape. Useless, he thought miserably. My father saw me true. I have no right to be alive when so many brave men are dead.  Grenn was tending the firepit south of the compound gate, stripped to the waist as he split logs. His face was red with exertion, the sweat steaming off his skin. But he grinned as Sam came chuffing up.  The Others get your boot, Slayer?   Him too?  It was the mud. Please don’t call me that.    Why not?  Grenn sounded honestly puzzled.  It’s a good name, and you came by it fairly.   Pyp always teased Grenn about being thick as a castle wall, so Sam explained patiently.  It’s just a different way of calling me a coward,  he said, standing on his left leg and wriggling back into his muddy boot.  They’re mocking me, the same way they mock Bedwyck by calling him ‘Giant’.    He’s not a giant, though,  said Grenn,  and Paul was never small. Well, maybe when he was a babe at the breast, but not after. You did slay the Other, though, so it’s not the same.    I just… I never… I was scared!    No more than me. It’s only Pyp who says I’m too dumb to be frightened. I get as frightened as anyone.  Grenn bent to scoop up a split log, and tossed it into the fire.  I used to be scared of Jon, whenever I had to fight him. He was so quick, and he fought like he meant to kill me.  The green damp wood sat in the flames, smoking before it took fire.  I never said, though. Sometimes I think everyone is just pretending to be brave, and none of us really are. Maybe pretending is how you get brave, I don’t know. Let them call you Slayer, who cares?    You never liked Ser Alliser to call you Aurochs.    He was saying I was big and stupid.  Grenn scratched at his beard.  If Pyp wanted to call me Aurochs, though, he could. Or you, or Jon. An aurochs is a fierce strong beast, so that’s not so bad, and I am big, and getting bigger. Wouldn’t you rather be Sam the Slayer than Ser Piggy?    Why can’t I just be Samwell Tarly?  He sat down heavily on a wet log that Grenn had yet to split.  It was the dragonglass that slew it. Not me, the dragonglass.   He had told them. He had told them all. Some of them didn’t believe him, he knew. Dirk had shown Sam his dirk and said,  I got iron, what do I want with glass?  Black Bernarr and the three Garths made it plain that they doubted his whole story, and Rolley of Sisterton came right out and said,  More like you stabbed some rustling bushes and it turned out to be Small Paul taking a shit, so you came up with a lie.   But Dywen listened, and Dolorous Edd, and they made Sam and Grenn tell the Lord Commander. Mormont frowned all through the tale and asked pointed questions, but he was too cautious a man to shun any possible advantage. He asked Sam for all the dragonglass in his pack, though that was little enough. Whenever Sam thought of the cache Jon had found buried beneath the Fist, it made him want to cry. There’d been dagger blades and spearheads, and two or three hundred arrowheads at least. Jon had made daggers for himself, Sam, and Lord Commander Mormont, and he’d given Sam a spearhead, an old broken horn, and some arrowheads. Grenn had taken a handful of arrowheads as well, but that was all.  So now all they had was Mormont’s dagger and the one Sam had given Grenn, plus nineteen arrows and a tall hardwood spear with a black dragonglass head. The sentries passed the spear along from watch to watch, while Mormont had divided the arrows among his best bowmen. Muttering Bill, Garth Greyfeather, Ronnel Harclay, Sweet Donnel Hill, and Alan of Rosby had three apiece, and Ulmer had four. But even if they made every shaft tell, they’d soon be down to fire arrows like all the rest. They had loosed hundreds of fire arrows on the Fist, yet still the wights kept coming.  It will not be enough, Sam thought."
}