{
  "id": "51e580c7d327709dc48396ef48bf32a8d3fad09d",
  "text": " The Old Bear had sent out rangers in search of him. Ser Jaremy Rykker had led two sweeps, and Quorin Halfhand had gone forth from the Shadow Tower, but they’d found nothing aside from a few blazes in the trees that his uncle had left to mark his way. In the stony highlands to the northwest, the marks stopped abruptly and all trace of Ben Stark vanished.   Do you ever find anyone in your dream?  Sam asked.  Jon shook his head.  No one. The castle is always empty.  He had never told anyone of the dream, and he did not understand why he was telling Sam now, yet somehow it felt good to talk of it.  Even the ravens are gone from the rookery, and the stables are full of bones. That always scares me. I start to run then, throwing open doors, climbing the tower three steps at a time, screaming for someone, for anyone. And then I find myself in front of the door to the crypts. It’s black inside, and I can see the steps spiraling down. Somehow I know I have to go down there, but I don’t want to. I’m afraid of what might be waiting for me. The old Kings of Winter are down there, sitting on their thrones with stone wolves at their feet and iron swords across their laps, but it’s not them I’m afraid of. I scream that I’m not a Stark, that this isn’t my place, but it’s no good, I have to go anyway, so I start down, feeling the walls as I descend, with no torch to light the way. It gets darker and darker, until I want to scream.  He stopped, frowning, embarrassed.  That’s when I always wake.  His skin cold and clammy, shivering in the darkness of his cell. Ghost would leap up beside him, his warmth as comforting as daybreak. He would go back to sleep with his face pressed into the direwolf s shaggy white fur.  Do you dream of Horn Hill?  Jon asked.   No.  Sam’s mouth grew tight and hard.  I hated it there.  He scratched Ghost behind the ear, brooding, and Jon let the silence breathe. After a long while Samwell Tarly began to talk, and Jon Snow listened quietly, and learned how it was that a self-confessed coward found himself on the Wall.  The Tarlys were a family old in honor, bannermen to Mace Tyrell, Lord of Highgarden and Warden of the South. The eldest son of Lord Randyll Tarly, Samwell was born heir to rich lands, a strong keep, and a storied two-handed greatsword named Heartsbane, forged of Valyrian steel and passed down from father to son near five hundred years.  Whatever pride his lord father might have felt at Samwell’s birth vanished as the boy grew up plump, soft, and awkward. Sam loved to listen to music and make his own songs, to wear soft velvets, to play in the castle kitchen beside the cooks, drinking in the rich smells as he snitched lemon cakes and blueberry tarts. His passions were books and kittens and dancing, clumsy as he was. But he grew ill at the sight of blood, and wept to see even a chicken slaughtered. A dozen masters-at-arms came and went at Horn Hill, trying to turn Samwell into the knight his father wanted. The boy was cursed and caned, slapped and starved. One man had him sleep in his chainmail to make him more martial. Another dressed him in his mother’s clothing and paraded him through the bailey to shame him into valor. He only grew fatter and more frightened, until Lord Randyll’s disappointment turned to anger and then to loathing.  One time,  Sam confided, his voice dropping from a whisper,  two men came to the castle, warlocks from Qarth with white skin and blue lips. They slaughtered a bull aurochs and made me bathe in the hot blood, but it didn’t make me brave as they’d promised. I got sick and retched. Father had them scourged.   Finally, after three girls in as many years, Lady Tarly gave her lord husband a second son. From that day, Lord Randyll ignored Sam, devoting all his time to the younger boy, a fierce, robust child more to his liking. Samwell had known several years of sweet peace with his music and his books.  Until the dawn of his fifteenth name day, when he had been awakened to find his horse saddled and ready. Three men-at-arms had escorted him into a wood near Horn Hill, where his father was skinning a deer.  You are almost a man grown now, and my heir,  Lord Randyll Tarly had told his eldest son, his long knife laying bare the carcass as he spoke.  You have given me no cause to disown you, but neither will I allow you to inherit the land and title that should be Dickon’s. Heartsbane must go to a man strong enough to wield her, and you are not worthy to touch her hilt. So I have decided that you shall this day announce that you wish to take the black. You will forsake all claim to your brother’s inheritance and start north before evenfall.   If you do not, then on the morrow we shall have a hunt, and somewhere in these woods your horse will stumble, and you will be thrown from the saddle to die… or so I will tell your mother. She has a woman’s heart and finds it in her to cherish even you, and I have no wish to cause her pain. Please do not imagine that it will truly be that easy, should you think to defy me."
}