{
  "id": "5204712b45bb55f454555a844f02bc52b876f57e",
  "text": "  Beside the gently lapping waters of Gods Eye, a long gibbet of raw green wood had been thrown up, and things that had once been men dangled there, their feet in chains, while crows pecked at their flesh and flapped from corpse to corpse. For every crow there were a hundred flies. When the wind blew off the lake, the nearest corpse twisted on its chain, ever so slightly. The crows had eaten most of its face, and something else had been at it as well, something much larger. Throat and chest had been torn apart, and glistening green entrails and ribbons of ragged flesh dangled from where the belly had been opened. one arm had been ripped right off the shoulder; Arya saw the bones a few feet away, gnawed and cracked, picked clean of meat.  She made herself look at the next man and the one beyond him and the one beyond him, telling herself she was hard as a stone. Corpses all, so savaged and decayed that it took her a moment to realize they had been stripped before they were hanged. They did not look like naked people; they hardly looked like people at all. The crows had eaten their eyes, and sometimes their faces. Of the sixth in the long row, nothing remained but a single leg, still tangled in its chains, swaying with each breeze.  Fear cuts deeper than swords. Dead men could not hurt her, but whoever had killed them could. Well beyond the gibbet, two men in mail hauberks stood leaning on their spears in front of the long low building by the water, the one with the slate roof. A pair of tall poles had been driven into the muddy ground in front of it, banners drooping from each staff. One looked red and one paler, white or yellow maybe, but both were limp and with the dusk settling, she could not even be certain that red one was Lannister crimson. I don’t need to see the lion, I can see all the dead people, who else would it be but Lannisters?  Then there was a shout.  The two spearmen turned at the cry, and a third man came into view, shoving a captive before him. It was growing too dark to make out faces, but the prisoner was wearing a shiny steel helm, and when Arya saw the horns she knew it was Gendry. You stupid stupid stupid STUPID! she thought. If he’d been here she would have kicked him again.  The guards were talking loudly, but she was too far away to make out the words, especially with the crows gabbling and flapping closer to hand. One of the spearmen snatched the helm off Gendry’s head and asked him a question, but he must not have liked the answer, because he smashed him across the face with the butt of his spear and knocked him down. The one who’d captured him gave him a kick, while the second spearman was trying on the bull’s-head helm. Finally they pulled him to his feet and marched him off toward the storehouse. When they opened the heavy wooden doors, a small boy darted out, but one of the guards grabbed his arm and flung him back inside. Arya heard sobbing from inside the building, and then a shriek so loud and full of pain that it made her bite her lip.  The guards shoved Gendry inside with the boy and barred the doors behind them. Just then, a breath of wind came sighing off the lake, and the banners stirred and lifted. The one on the tall staff bore the golden lion, as she’d feared. On the other, three sleek black shapes ran across a field as yellow as butter. Dogs, she thought. Arya had seen those dogs before, but where?  It didn’t matter. The only thing that mattered was that they had Gendry. Even if he was stubborn and stupid, she had to get him out. She wondered if they knew that the queen wanted him.  One of the guards took off his helm and donned Gendry’s instead. It made her angry to see him wearing it, but she knew there was nothing she could do to stop him. She thought she heard more screams from inside the windowless storehouse, muffled by the masonry, but it was hard to be certain.  She stayed long enough to see the guard changed, and much more besides. Men came and went. They led their horses down to the stream to drink. A hunting party returned from the wood, carrying a deer’s carcass slung from a pole. She watched them clean and gut it and build a cookfire on the far side of the stream, and the smell of cooking meat mingled queerly with the stench of corruption. Her empty belly roiled and she thought she might retch. The prospect of food brought other men out of the houses, near all of them wearing bits of mail or boiled leather. When the deer was cooked, the choicest portions were carried to one of the houses.  She thought that the dark might let her crawl close and free Gendry, but the guards kindled torches off the cookfire. A squire brought meat and bread to the two guarding the storehouse, and later two more men joined them and they all passed a skin of wine from hand to hand. When it was empty the others left, but the two guards remained, leaning on their spears.  Arya’s arms and legs were stiff when she finally wriggled out from under the briar into the dark of the wood."
}