{
  "id": "52d4a40b82b06caf7c3a2db2546b083cae7b14aa",
  "text": " When it was done, she stood it on end and used the tip of her little finger to poke holes in it for windows. The crenellations around the top took a little more care, but when they were done she had a tower. I need some walls now, Sansa thought, and then a keep. She set to work.  The snow fell and the castle rose. Two walls ankle-high, the inner taller than the outer. Towers and turrets, keeps and stairs, a round kitchen, a square armory, the stables along the inside of the west wall. It was only a castle when she began, but before very long Sansa knew it was Winterfell. She found twigs and fallen branches beneath the snow and broke off the ends to make the trees for the godswood. For the gravestones in the lichyard she used bits of bark. Soon her gloves and her boots were crusty white, her hands were tingling, and her feet were soaked and cold, but she did not care. The castle was all that mattered. Some things were hard to remember, but most came back to her easily, as if she had been there only yesterday. The Library Tower, with the steep stonework stair twisting about its exterior. The gatehouse, two huge bulwarks, the arched gate between them, crenellations all along the top…  And all the while the snow kept falling, piling up in drifts around her buildings as fast as she raised them. She was patting down the pitched roof of the Great Hall when she heard a voice, and looked up to see her maid calling from her window. Was my lady well? Did she wish to break her fast? Sansa shook her head, and went back to shaping snow, adding a chimney to one end of the Great Hall, where the hearth would stand inside.  Dawn stole into her garden like a thief. The grey of the sky grew lighter still, and the trees and shrubs turned a dark green beneath their stoles of snow. A few servants came out and watched her for a time, but she paid them no mind and they soon went back inside where it was warmer. Sansa saw Lady Lysa gazing down from her balcony, wrapped up in a blue velvet robe trimmed with fox fur, but when she looked again her aunt was gone. Maester Colemon popped out of the rookery and peered down for a while, skinny and shivering but curious.  Her bridges kept falling down. There was a covered bridge between the armory and the main keep, and another that went from the fourth floor of the bell tower to the second floor of the rookery, but no matter how carefully she shaped them, they would not hold together. The third time one collapsed on her, she cursed aloud and sat back in helpless frustration.   Pack the snow around a stick, Sansa.   She did not know how long he had been watching her, or when he had returned from the Vale.  A stick?  she asked.   That will give it strength enough to stand, I’d think,  Petyr said.  May I come into your castle, my lady?   Sansa was wary.  Don’t break it. Be…    …gentle?  He smiled.  Winterfell has withstood flercer enemies than me. It is Winterfell, is it not?    Yes,  Sansa admitted.  He walked along outside the walls.  I used to dream of it, in those years after Cat went north with Eddard Stark. In my dreams it was ever a dark place, and cold.    No. It was always warm, even when it snowed. Water from the hot springs is piped through the walls to warm them, and inside the glass gardens it was always like the hottest day of summer.  She stood, towering over the great white castle.  I can’t think how to do the glass roof over the gardens.   Littlefinger stroked his chin, where his beard had been before Lysa had asked him to shave it off.  The glass was locked in frames, no? Twigs are your answer. Peel them and cross them and use bark to tie them together into frames. I’ll show you.  He moved through the garden, gathering up twigs and sticks and shaking the snow from them. When he had enough, he stepped over both walls with a single long stride and squatted on his heels in the middle of the yard. Sansa came closer to watch what he was doing. His hands were deft and sure, and before long he had a crisscrossing latticework of twigs, very like the one that roofed the glass gardens of Winterfell.  We will need to imagine the glass, to be sure,  he said when he gave it to her.   This is just right,  she said.  He touched her face.  And so is that.   Sansa did not understand.  And so is what?    Your smile, my lady. Shall I make another for you?    If you would.    Nothing could please me more.   She raised the walls of the glass gardens while Littlefinger roofed them over, and when they were done with that he helped her extend the walls and build the guardshall. When she used sticks for the covered bridges, they stood, just as he had said they would. The First Keep was simple enough, an old round drum tower, but Sansa was stymied again when it came to putting the gargoyles around the top. Again he had the answer.  It’s been snowing on your castle, my lady,  he pointed out.  What do the gargoyles look like when they’re covered with snow?   Sansa closed her eyes to see them in memory.  They’re just white lumps."
}