{
  "id": "5407273820e74887c1dc0155a20cbfa7239380a6",
  "text": "  By the grace of his liege lord, he holds a stout keep and lands of his own. The man is an anointed knight.    A false knight!  Ser Marq said.  Lord Tywin’s mad dog.    My lord Hand,  Pycelle declared in a stiff voice,  I urge you to remind this good knight that Lord Tywin Lannister is the father of our own gracious queen.    Thank you, Grand Maester Pycelle,  Ned said.  I fear we might have forgotten that if you had not pointed it out.   From his vantage point atop the throne, he could see men slipping out the door at the far end of the hall. Hares going to ground, he supposed… or rats off to nibble the queen’s cheese. He caught a glimpse of Septa Mordane in the gallery, with his daughter Sansa beside her. Ned felt a flash of anger; this was no place for a girl. But the septa could not have known that today’s court would be anything but the usual tedious business of hearing petitions, settling disputes between rival holdfasts, and adjudicating the placement of boundary stones.  At the council table below, Petyr Baelish lost interest in his quill and leaned forward.  Ser Marq, Ser Karyl, Ser Raymun—perhaps I might ask you a question? These holdfasts were under your protection. Where were you when all this slaughtering and burning was going on?   Ser Karyl Vance answered.  I was attending my lord father in the pass below the Golden Tooth, as was Ser Marq. When the word of these outrages reached Ser Edmure Tully, he sent word that we should take a small force of men to find what survivors we could and bring them to the king.   Ser Raymun Darry spoke up.  Ser Edmure had summoned me to Riverrun with all my strength. I was camped across the river from his walls, awaiting his commands, when the word reached me. By the time I could return to my own lands, Clegane and his vermin were back across the Red Fork, riding for Lannister’s hills.   Littlefinger stroked the point of his beard thoughtfully.  And if they come again, ser?    If they come again, we’ll use their blood to water the fields they burnt,  Ser Marq Piper declared hotly.   Ser Edmure has sent men to every village and holdfast within a day’s ride of the border,  Ser Karyl explained.  The next raider will not have such an easy time of it.   And that may be precisely what Lord Tywin wants, Ned thought to himself, to bleed off strength from Riverrun, goad the boy into scattering his swords. His wife’s brother was young, and more gallant than wise. He would try to hold every inch of his soil, to defend every man, woman, and child who named him lord, and Tywin Lannister was shrewd enough to know that.   If your fields and holdfasts are safe from harm,  Lord Petyr was saying,  what then do you ask of the throne?    The lords of the Trident keep the king’s peace,  Ser Raymun Darry said.  The Lannisters have broken it. We ask leave to answer them, steel for steel. We ask justice for the smallfolk of Sherrer and Wendish Town and the Mummer’s Ford.    Edmure agrees, we must pay Gregor Clegane back his bloody coin,  Ser Marq declared,  but old Lord Hoster commanded us to come here and beg the king’s leave before we strike.   Thank the gods for old Lord Hoster, then. Tywin Lannister was as much fox as lion. If indeed he’d sent Ser Gregor to burn and pillage—and Ned did not doubt that he had—he’d taken care to see that he rode under cover of night, without banners, in the guise of a common brigand. Should Riverrun strike back, Cersei and her father would insist that it had been the Tullys who broke the king’s peace, not the Lannisters. The gods only knew what Robert would believe.  Grand Maester Pycelle was on his feet again.  My lord Hand, if these good folk believe that Ser Gregor has forsaken his holy vows for plunder and rape, let them go to his liege lord and make their complaint. These crimes are no concern of the throne. Let them seek Lord Tywin’s justice.    It is all the king’s justice,  Ned told him.  North, south, east, or west, all we do we do in Robert’s name.    The king’s justice,  Grand Maester Pycelle said.  So it is, and so we should defer this matter until the king—    The king is hunting across the river and may not return for days,  Lord Eddard said.  Robert bid me to sit here in his place, to listen with his ears, and to speak with his voice. I mean to do just that… though I agree that he must be told.  He saw a familiar face beneath the tapestries.  Ser Robar.   Ser Robar Royce stepped forward and bowed.  My lord.    Your father is hunting with the king,  Ned said.  Will you bring them word of what was said and done here today?    At once, my lord.    Do we have your leave to take our vengeance against Ser Gregor, then?  Marq Piper asked the throne.   Vengeance?  Ned said.  I thought we were speaking of justice. Burning Clegane’s fields and slaughtering his people will not restore the king’s peace, only your injured pride.  He glanced away before the young knight could voice his outraged protest, and addressed the villagers.  People of Sherrer, I cannot give you back your homes or your crops, nor can I restore your dead to life."
}