{
  "id": "546c75121b84ab0ac7f6881b103dc668566944c8",
  "text": "  The king ground his teeth.  No.   Ser Cortnay did not seem surprised.  Is it the justice of your cause you doubt, my lord, or the strength of your arm? Are you afraid I’ll piss on your burning sword and put it out?    Do you take me for an utter fool, ser?  asked Stannis.  I have twenty thousand men. You are besieged by land and sea. Why would I choose single combat when my eventual victory is certain?  The king pointed a finger at him.  I give you fair warning. If you force me to take my castle by storm, you may expect no mercy. I will hang you for traitors, every one of you.    As the gods will it. Bring on your storm, my lord—and recall, if you do, the name of this castle.  Ser Cortnay gave a pull on his reins and rode back toward the gate.  Stannis said no word, but turned his horse around and started back toward his camp. The others followed.  If we storm these walls thousands will die,  fretted ancient Lord Estermont, who was the king’s grandfather on his mother’s side.  Better to hazard but a single life, surely? Our cause is righteous, so the gods must surely bless our champion’s arms with victory.   God, old man, thought Davos. You forget, we have only one now, Melisandre’s Lord of Light.  Ser Jon Fossoway said,  I would gladly take this challenge myself, though I’m not half the swordsman Lord Caron is, or Ser Guyard. Renly left no notable knights at Storm’s End. Garrison duty is for old men and green boys.   Lord Caron agreed.  An easy victory, to be sure. And what glory, to win Storm’s End with a single stroke!   Stannis raked them all with a look.  You chatter like magpies, and with less sense. I will have quiet.  The king’s eyes fell on Davos.  Ser. Ride with me.  He spurred his horse away from his followers. Only Melisandre kept pace, bearing the great standard of the fiery heart with the crowned stag within. As if it had been swallowed whole.  Davos saw the looks that passed between the lordlings as he rode past them to join the king. These were no onion knights, but proud men from houses whose names were old in honor. Somehow he knew that Renly had never chided them in such a fashion. The youngest of the Baratheons had been born with a gift for easy courtesy that his brother sadly lacked.  He eased back to a slow trot when his horse came up beside the king’s.  Your Grace.  Seen at close hand, Stannis looked worse than Davos had realized from afar. His face had grown haggard, and he had dark circles under his eyes.   A smuggler must be a fair judge of men,  the king said.  What do you make of this Ser Cortnay Penrose?    A stubborn man,  said Davos carefully.   Hungry for death, I call it. He throws my pardon in my face. Aye, and throws his life away in the bargain, and the lives of every man inside those walls. Single combat?  The king snorted in derision.  No doubt he mistook me for Robert.    More like he was desperate. What other hope does he have?    None. The castle will fall. But how to do it quickly?  Stannis brooded on that for a moment. Under the steady clop-clop of hooves, Davos could hear the faint sound of the king grinding his teeth.  Lord Alester urges me to bring old Lord Penrose here. Ser Cortnay’s father. You know the man, I believe?    When I came as your envoy, Lord Penrose received me more courteously than most,  Davos said.  He is an old done man, sire. Sickly and failing.    Florent would have him fail more visibly. In his son’s sight, with a noose about his neck.   It was dangerous to oppose the queen’s men, but Davos had vowed always to tell his king the truth.  I think that would be ill done, my liege. Ser Cortnay will watch his father die before he would ever betray his trust. It would gain us nothing, and bring dishonor to our cause.    What dishonor?  Stannis bristled.  Would you have me spare the lives of traitors?    You have spared the lives of those behind us.    Do you scold me for that, smuggler?    It is not my place.  Davos feared he had said too much.  The king was relentless.  You esteem this Penrose more than you do my lords bannermen. Why?    He keeps faith.    A misplaced faith in a dead usurper.    Yes,  Davos admitted,  but still, he keeps faith.    As those behind us do not?   Davos had come too far with Stannis to play coy now.  Last year they were Robert’s men. A moon ago they were Renly’s. This morning they are yours. Whose will they be on the morrow?   And Stannis laughed. A sudden gust, rough and full of scorn.  I told you, Melisandre,  he said to the red woman,  my Onion Knight tells me the truth.    I see you know him well, Your Grace,  the red woman said.   Davos, I have missed you sorely,  the king said.  Aye, I have a tail of traitors, your nose does not deceive you. My lords bannermen are inconstant even in their treasons. I need them, but you should know how it sickens me to pardon such as these when I have punished better men for lesser crimes. You have every right to reproach me, Ser Davos.    You reproach yourself more than I ever could, Your Grace."
}