{
  "id": "559754a4349af5256468210bad0e246c2708b4d3",
  "text": " \"It's bad enough without you lot in trouble an' all!\"  They had no choice. As Hermione threw the cloak over Harry and Ron, they heard voices at the front of the cabin. Hagrid looked at the place where they had just vanished from sight.  \"Go quick,\" he said hoarsely. \"Don' listen....\"  And he strode back into his cabin as someone knocked at the front door.  Slowly, in a kind of horrified trance, Harry, Ron, and Hermione set off silently around Hagrid's house. As they reached the other side, the front door closed with a sharp snap.  \"Please, let's hurry,\" Hermione whispered. \"I can't stand it, I can't bear it....\"  They started up the sloping lawn toward the castle. The sun was sinking fast now; the sky had turned to a clear, purple-tinged grey, but to the west there was a ruby-red glow.  Ron stopped dead.  \"Oh, please, Ron,\" Hermione began.  \"It's Scabbers -- he won't -- stay put --\"  Ron was bent over, trying to keep Scabbers in his pocket, but the rat was going berserk; squeaking madly, twisting and flailing, trying to sink his teeth into Ron's hand.  \"Scabbers, it's me, you idiot, it's Ron,\" Ron hissed.  They heard a door open behind them and men's voices.  \"Oh, Ron, please let's move, they're going to do it!\" Hermione breathed.  \"Okay -- Scabbers, stay put --\"  They walked forward; Harry, like Hermione, was trying not to listen to the rumble of voices behind them. Ron stopped again.  \"I can't hold him -- Scabbers, shut up, everyone'll hear us --\"  The rat was squealing wildly, but not loudly enough to cover up the sounds drifting from Hagrid's garden. There was a jumble of indistinct male voices, a silence, and then, without warning, the unmistakable swish and thud of an axe.  Hermione swayed on the spot.  \"They did it!\" she whispered to Harry. \"I d -- don't believe it -- they did it!\"  CHAPTER SEVENTEEN  CAT, RAT, AND DOG  Harry's mind had gone blank with shock. The three of them stood transfixed with horror under the Invisibility Cloak. The very last rays of the setting sun were casting a bloody light over the long- shadowed grounds. Then, behind them, they heard a wild howling.  \"Hagrid,\" Harry muttered. Without thinking about what he was doing, he made to turn back, but both Ron and Hermione seized his arms.  \"We can't,\" said Ron, who was paper-white. \"He'll be in worse trouble if they know we've been to see him....\"  Hermione's breathing was shallow and uneven.  \"How -- could -- they?\" she choked. \"How could they?\"  \"Come on,\" said Ron, whose teeth seemed to be chattering.  They set off back toward the castle, walking slowly to keep themselves hidden under the cloak. The light was fading fast now.  By the time they reached open ground, darkness was settling like a spell around them.  \"Scabbers, keep still,\" Ron hissed, clamping his hand over his chest. The rat was wriggling madly. Ron came to a sudden halt, trying to force Scabbers deeper into his pocket. \"What's the matter with you, You stupid rat? Stay still -- OUCH! He bit me!\"  \"Ron, be quiet!\" Hermione whispered urgently. \"Fudge'll be out here in a minute --\"  \"He won't -- stay -- put --\"  Scabbers was plainly terrified. He was writhing with all his might, trying to break free of Ron's grip.  \"What's the matter with him?\"  But Harry had just seen -- stinking toward them, his body low to the ground, wide yellow eyes glinting eerily in the darkness -- Crookshanks. Whether he could see them or was following the sound of Scabbers's squeaks, Harry couldn't tell.  \"Crookshanks!\" Hermione moaned. \"No, go away, Crookshanks! Go away!\"  But the cat was getting nearer --  \"Scabbers -- NO!\"  Too late -- the rat had slipped between Ron's clutching fingers, hit the ground, and scampered away. In one bound, Crookshanks sprang after him, and before Harry or Hermione could stop him, Ron had thrown the Invisibility Cloak off himself and pelted away into the darkness.  \"Ron!\" Hermione moaned.  She and Harry looked at each other, then followed at a sprint; it \"\"as impossible to run full out under the cloak; they pulled it off and it streamed behind them like a banner as they hurtled after Ron; they could hear his feet thundering along ahead and his shouts at Crookshanks.  \"Get away from him -- get away -- Scabbers, come here --\"  There was a loud thud.  \"Gotcha! Get off, you stinking cat --\"  Harry and Hermione almost fell over Ron; they skidded to a stop right in front of him. He was sprawled on the ground, but Scabbers was back in his pocket; he had both hands held tight over the quivering lump.  \"Ron -- come on back under the cloak --\" Hermione panted. \"Dumbledore the Minister -- they'll be coming back out in a minute --\"  But before they could cover themselves again, before they could even catch their breath, they heard the soft pounding of gigantic paws.... Something was bounding toward them, quiet as a shadow -- an enormous, pale-eyed, jet-black dog.  Harry reached for his wand, but too late -- the dog had made an enormous leap and the front paws hit him on the chest; he keeled over backward in a whirl of hair; he felt its hot breath, saw inch- long teeth -  But the force of its leap had carried it too far; it rolled off him."
}