{
  "id": "58349884a6d339cbde180994a09cadbda50d15e4",
  "text": " I have a brother too.       Tyrion    Tyrion,  Ser Kevan Lannister said wearily,  if you are indeed innocent of Joffrey’s death, you should have no difficulty proving it at trial.   Tyrion turned from the window.  Who is to judge me?    Justice belongs to the throne. The king is dead, but your father remains Hand. Since it is his own son who stands accused and his grandson who was the victim, he has asked Lord Tyrell and Prince Oberyn to sit in judgment with him.   Tyrion was scarcely reassured. Mace Tyrell had been Joffrey’s goodfather, however briefly, and the Red Viper was… well, a snake.  Will I be allowed to demand trial by battle?    I would not advise that.    Why not?  It had saved him in the Vale, why not here?  Answer me, Uncle. Will I be allowed a trial by battle, and a champion to prove my innocence?    Certainly, if such is your wish. However, you had best know that your sister means to name Ser Gregor Clegane as her champion, in the event of such a trial.   The bitch checks my moves before I make them. A pity she didn’t choose a Kettleblack. Bronn would make short work of any of the three brothers, but the Mountain That Rides was a kettle of a different color.  I shall need to sleep on this.  I need to speak with Bronn, and soon. He didn’t want to think about what this was like to cost him. Bronn had a lofty notion of what his skin was worth.  Does Cersei have witnesses against me?    More every day.    Then I must have witnesses of my own.    Tell me who you would have, and Ser Addam will send the Watch to bring them to the trial.    I would sooner find them myself.    You stand accused of regicide and kinslaying. Do you truly imagine you will be allowed to come and go as you please?  Ser Kevan waved at the table.  You have quill, ink, and parchment. Write the names of such witnesses as you require, and I shall do all in my power to produce them, you have my word as a Lannister. But you shall not leave this tower, except to go to trial.   Tyrion would not demean himself by begging.  Will you permit my squire to come and go? The boy Podrick Payne?    Certainly, if that is your wish. I shall send him to you.    Do so. Sooner would be better than later, and now would be better than sooner.  He waddled to the writing table. But when he heard the door open, he turned back and said,  Uncle?   Ser Kevan paused.  Yes?    I did not do this.    I wish I could believe that, Tyrion.   When the door closed, Tyrion Lannister pulled himself up into the chair, sharpened a quill, and pulled a blank parchment. Who will speak for me? He dipped his quill in the inkpot.  The sheet was still maiden when Podrick Payne appeared, sometime later.  My lord,  the boy said.  Tyrion put down the quill.  Find Bronn and bring him at once. Tell him there’s gold in it, more gold than he’s ever dreamt of, and see that you don’t return without him.    Yes, my lord. I mean, no. I won’t. Return.  He went.  He had not returned by sunset, nor by moonrise. Tyrion fell asleep in the window seat to wake stiff and sore at dawn. A serving man brought porridge and apples to break his fast, with a horn of ale. He ate at the table, the blank parchment before him. An hour later, the serving man returned for the bowl.  Have you seen my squire?  Tyrion asked him. The man shook his head.  Sighing, he turned back to the table, and dipped the quill again. Sansa, he wrote upon the parchment. He sat staring at the name, his teeth clenched so hard they hurt.  Assuming Joffrey had not simply choked to death on a bit of food, which even Tyrion found hard to swallow, Sansa must have poisoned him. Joff practically put his cup down in her lap, and he’d given her ample reason. Any doubts Tyrion might have had vanished when his wife did. One flesh, one heart, one soul. His mouth twisted. She wasted no time proving how much those vows meant to her, did she? Well, what did you expect, dwarf?  And yet… where would Sansa have gotten poison? He could not believe the girl had acted alone in this. Do I really want to find her? Would the judges believe that Tyrion’s child bride had poisoned a king without her husband’s knowledge? I wouldn’t. Cersei would insist that they had done the deed together.  Even so, he gave the parchment to his uncle the next day. Ser Kevan frowned at it.  Lady Sansa is your only witness?    I will think of others in time.    Best think of them now. The judges mean to begin the trial three days hence.    That’s too soon. You have me shut up here under guard, how am I to find witnesses to my innocence?    Your sister’s had no difficulty finding witnesses to your guilt.  Ser Kevan rolled up the parchment.  Ser Addam has men hunting for your wife. Varys has offered a hundred stags for word of her whereabouts, and a hundred dragons for the girl herself. If the girl can be found she will be found, and I shall bring her to you. I see no harm in husband and wife sharing the same cell and giving comfort to one another.    You are too kind. Have you seen my squire?    I sent him to you yesterday."
}