{
  "id": "5957043bca148cb23799641448124786d73187e9",
  "text": " As  they  came  through  yet more  doors  at  the  further  end,  a  sound  of  water  fell  upon  their ears, and the grey light grew suddenly more full.  \"There is the birth of the Running River,\" said Thorin. \"From here it hastens to  the Gate. Let us follow it!\"  Out  of  a  dark  opening  in  a  wall  of  rock  there  issued  a  boiling  water,  and  it  flowed  swirling  in  a  narrow  channel,  carved  and  made  straight  and  deep  by  the  cunning of ancient hands. Beside it ran a stone-paved road, wide enough for many  men  abreast.  Swiftly  along  this  they  ran,  and  round  a  wide-sweeping  turn-and  behold!  before  them  stood  the  broad  light  of  day.  In  front  there  rose  a  tall  arch,  still  showing  the  fragments  of  old  carven  work  within,  worn  and  splintered  and  blackened  though  it was. A misty  sun  sent  its  pale  light  between  the  arms  of  the  Mountain, and beams of gold fell on the pavement at the threshold.  A whirl of bats frightened from slumber by their smoking torches flurried over  them;  as  they  sprang  forward  their  feet  slithered  on  stones  rubbed  smooth  and  slimed  by  the  passing  of  the  dragon.  Now  before  them  the  water  fell  noisily  outward and foamed down towards the valley. They flung their pale torches to the  ground,  and  stood  gazing  out  with  dazzled  eyes.  They  were  come  to  the  Front  Gate, and were looking out upon Dale.  \"Well!\"  said  Bilbo,  \"I  never  expected  to  be  looking  out  of  this  door.  And  I  never  expected  to  be  so  pleased  to  see  the  sun  again,  and  to  feel  the wind  on my  face. But, ow! this wind is cold!\"  It  was.  A  bitter  easterly  breeze  blew  with  a  threat  of  oncoming  winter.  It  swirled  over  and  round  the  arms  of  the  Mountain  into  the  valley,  and  sighed  among the rocks. After their long time in the stewing depths of the dragon-haunted   ####-caverns,  they  shivered  in  the  sun.  Suddenly  Bilbo  realized  that  he  was  not  only  tired but also very hungry indeed. \"It seems to be late morning,\" he said, \"and so I  suppose  it  is more  or  less  breakfast-time  –  if  there  is any breakfast  to have. But  I  don't  feel  that  Smaug's  front  doorstep  is  the  safest  place  for  a  meal.  Do  let's  go  somewhere where we can sit quiet for a bit!\"  \"Quite  right!\"  said  Balin.  \"And  I  think  I  know  which  way  we  should  go:  we  ought to make for the old look-out post at the Southwest corner of the Mountain.\"  \"How far is that?\" asked the hobbit.  \"Five  hours march,  I  should  think.  It will  be  rough  going.  The  road  from  the  Gate along  the  left edge of  the  stream  seems all broken up. But  look down  there!  The river loops suddenly east across Dale in front of the ruined town. At that point  there was once a bridge, leading to steep stairs that climbed up the right bank, and  so to a road running towards Ravenhill. There is (or was) a path that left the road  and climbed up to the post. A hard climb, too, even if the old steps are still there.\"  \"Dear  me!\"  grumbled  the  hobbit.  \"More  walking  and  more  climbing  without  breakfast! I wonder how many breakfasts, and other meals, we have missed inside  that nasty clockless, timeless hole?\"  As  a  matter  of  fact  two  nights  and  the  day  between  had  gone  by  (and  not  altogether without  food)  since  the dragon  smashed  the magic door, but Bilbo had  quite  lost  count,  and  it  might  have  been  one  night  or  a  week  of  nights  for  all  he  could tell.  \"Come, come!\" said Thorin  laughing – his spirits had begun to rise again, and  he  rattled  the  precious  stones  in  his  pockets.  \"Don't  call  my  place  a  nasty  hole!  You wait till it has been cleaned and redecorated!\"  \"That won't be till Smaug's dead,\" said Bilbo glumly. \"In the meanwhile where  is he? I would give a good breakfast to know. I hope he is not up on the Mountain  looking down at us!\"    That idea disturbed the dwarves mightily, and they quickly decided that Bilbo  and Balin were right.  \"We must move  away  from  here,\"  said Don.  \"I  feel  as  if his  eyes were on  the  back of my head.\"  \"It's  a  cold  lonesome  place,\"  said Bombur.  \"There may  be  drink,  but  I  see  no  sign of food. A dragon would always be hungry in such parts.\"  \"Come on! Come on!\" cried the others. \"Let us follow Balm's path!\"  Under the rocky wall to the right there was no path, so on they trudged among  the  stones  on  the  left  side  of  the  river,  and  the  emptiness  and  desolation  soon   ####-sobered  even Thorin  again. The  bridge  that Balin  had  spoken  of  they  found  long  fallen, and most of its stones were now only boulders in the shallow noisy stream;  but they forded the water without much difficulty, and found the ancient steps, and  climbed  the  high  bank.  After  going  a  short  way  they  struck  the  old  road,  and  before  long  came  to  a  deep  dell sheltered among  the rocks;  there  they rested for a  while and had such a breakfast as they could, chiefly cram and water."
}