{
  "id": "5da3fb075ddfb7a1c640015d9f69931d71383830",
  "text": " There was an instant of vertigo, a sickening lurch as the window flashed past. He shot out a hand, grabbed for the ledge, lost it, caught it again with his other hand. He swung against the building, hard. The impact took the breath out of him. Bran dangled, one-handed, panting.  Faces appeared in the window above him.  The queen. And now Bran recognized the man beside her. They looked as much alike as reflections in a mirror.   He saw us,  the woman said shrilly.   So he did,  the man said.  Bran’s fingers started to slip. He grabbed the ledge with his other hand. Fingernails dug into unyielding stone. The man reached down.  Take my hand,  he said.  Before you fall.   Bran seized his arm and held on tight with all his strength. The man yanked him up to the ledge.  What are you doing?  the woman demanded.  The man ignored her. He was very strong. He stood Bran up on the sill.  How old are you, boy?    Seven,  Bran said, shaking with relief. His fingers had dug deep gouges in the man’s forearm. He let go sheepishly.  The man looked over at the woman.  The things I do for love,  he said with loathing. He gave Bran a shove.  Screaming, Bran went backward out the window into empty air. There was nothing to grab on to. The courtyard rushed up to meet him.  Somewhere off in the distance, a wolf was howling. Crows circled the broken tower, waiting for corn.      TYRION  Somewhere in the great stone maze of Winterfell, a wolf howled. The sound hung over the castle like a flag of mourning.  Tyrion Lannister looked up from his books and shivered, though the library was snug and warm. Something about the howling of a wolf took a man right out of his here and now and left him in a dark forest of the mind, running naked before the pack.  When the direwolf howled again, Tyrion shut the heavy leatherbound cover on the book he was reading, a hundred-year-old discourse on the changing of the seasons by a long-dead maester. He covered a yawn with the back of his hand. His reading lamp was flickering, its oil all but gone, as dawn light leaked through the high windows. He had been at it all night, but that was nothing new. Tyrion Lannister was not much a one for sleeping.  His legs were stiff and sore as he eased down off the bench. He massaged some life back into them and limped heavily to the table where the septon was snoring softly, his head pillowed on an open book in front of him. Tyrion glanced at the title. A life of the Grand Maester Aethelmure, no wonder.  Chayle,  he said softly. The young man jerked up, blinking, confused, the crystal of his order swinging wildly on its silver chain.  I’m off to break my fast. See that you return the books to the shelves. Be gentle with the Valyrian scrolls, the parchment is very dry. Ayrmidon’s Engines of War is quite rare, and yours is the only complete copy I’ve ever seen.  Chayle gaped at him, still half-asleep. Patiently, Tyrion repeated his instructions, then clapped the septon on the shoulder and left him to his tasks.  Outside, Tyrion swallowed a lungful of the cold morning air and began his laborious descent of the steep stone steps that corkscrewed around the exterior of the library tower. It was slow going; the steps were cut high and narrow, while his legs were short and twisted. The rising sun had not yet cleared the walls of Winterfell, but the men were already hard at it in the yard below. Sandor Clegane’s rasping voice drifted up to him.  The boy is a long time dying. I wish he would be quicker about it.   Tyrion glanced down and saw the Hound standing with young Joffrey as squires swarmed around them.  At least he dies quietly,  the prince replied.  It’s the wolf that makes the noise. I could scarce sleep last night.   Clegane cast a long shadow across the hard-packed earth as his squire lowered the black helm over his head.  I could silence the creature, if it please you,  he said through his open visor. His boy placed a longsword in his hand. He tested the weight of it, slicing at the cold morning air. Behind him, the yard rang to the clangor of steel on steel.  The notion seemed to delight the prince.  Send a dog to kill a dog!  he exclaimed.  Winterfell is so infested with wolves, the Starks would never miss one.   Tyrion hopped off the last step onto the yard.  I beg to differ, nephew,  he said.  The Starks can count past six. Unlike some princes I might name.   Joffrey had the grace at least to blush.   A voice from nowhere,  Sandor said. He peered through his helm, looking this way and that.  Spirits of the air!   The prince laughed, as he always laughed when his bodyguard did this mummer’s farce. Tyrion was used to it.  Down here.   The tall man peered down at the ground, and pretended to notice him.  The little lord Tyrion,  he said.  My pardons. I did not see you standing there.    I am in no mood for your insolence today.  Tyrion turned to his nephew.  Joffrey, it is past time you called on Lord Eddard and his lady, to offer them your comfort.   Joffrey looked as petulant as only a boy prince can look."
}