{
  "id": "5e4f5b3c6ab40d6a913a8d9c7f2de4931992944d",
  "text": " She might have struck downriver for the ports at Meereen and Yunkai and Astapor, but Rakharo warned her that Pono’s khalasar had ridden that way, driving thousands of captives before them to sell in the flesh marts that festered like open sores on the shores of Slaver’s Bay.  Why should I fear Pono?  Dany objected.  He was Drogo’s ko, and always spoke me gently.    Ko Pono spoke you gently,  Ser Jorah Mormont said.  Khal Pono will kill you. He was the first to abandon Drogo. Ten thousand warriors went with him. You have a hundred.   No, Dany thought. I have four. The rest are women, old sick men and boys whose hair has never been braided.  I have the dragons,  she pointed out.   Hatchlings,  Ser Jorah said.  One swipe from an arakh would put an end to them, though Porto is more like to seize them for himself. Your dragon eggs were more precious than rubies. A living dragon is beyond price. In all the world, there are only three. Every man who sees them will want them, my queen.    They are mine,  she said fiercely. They had been born from her faith and her need, given life by the deaths of her husband and unborn son and the maegi Mirri Maz Duur. Dany had walked into the flames as they came forth, and they had drunk milk from her swollen breasts.  No man will take them from me while I live.    You will not live long should you meet Khal Pono. Nor Khal Jhaqo, nor any of the others. You must go where they do not.   Dany had named him the first of her Queensguard… and when Mormont’s gruff counsel and the omens agreed, her course was clear. She called her people together and mounted her silver mare. Her hair had burned away in Drogo’s pyre, so her handmaids garbed her in the skin of the hrakkar Drogo had slain, the white lion of the Dothraki sea. Its fearsome head made a hood to cover her naked scalp, its pelt a cloak that flowed across her shoulders and down her back. The cream-colored dragon sunk sharp black claws into the lion’s mane and coiled its tail around her arm, while Ser Jorah took his accustomed place by her side.   We follow the comet,  Dany told her khalasar. Once it was said, no word was raised against it. They had been Drogo’s people, but they were hers now. The Unburnt, they called her, and Mother of Dragons. Her word was their law.  They rode by night, and by day took refuge from the sun beneath their tents. Soon enough Dany learned the truth of Doreah’s words. This was no kindly country. They left a trail of dead and dying horses behind them as they went, for Pono, Jhaqo, and the others had seized the best of Drogo’s herds, leaving to Dany the old and the scrawny, the sickly and the lame, the broken animals and the ill-tempered. It was the same with the people. They are not strong, she told herself, so I must be their strength. I must show no fear, no weakness, no doubt. However frightened my heart, when they look upon my face they must see only Drogo’s queen. She felt older than her fourteen years. If ever she had truly been a girl, that time was done.  Three days into the march, the first man died. A toothless oldster with cloudy blue eyes, he fell exhausted from his saddle and could not rise again. An hour later he was done. Blood flies swarmed about his corpse and carried his ill luck to the living.  His time was past,  her handmaid Irri declared.  No man should live longer than his teeth.  The others agreed. Dany bid them kill the weakest of their dying horses, so the dead man might go mounted into the night lands.  Two nights later, it was an infant girl who perished. Her mother’s anguished wailing lasted all day, but there was nothing to be done. The child had been too young to ride, poor thing. Not for her the endless black grasses of the night lands; she must be born again.  There was little forage in the red waste, and less water. It was a sere and desolate land of low hills and barren windswept plains. The rivers they crossed were dry as dead men’s bones. Their mounts subsisted on the tough brown devilgrass that grew in clumps at the base of rocks and dead trees. Dany sent outriders ranging ahead of the column, but they found neither wells nor springs, only bitter pools, shallow and stagnant, shrinking in the hot sun. The deeper they rode into the waste, the smaller the pools became, while the distance between them grew. If there were gods in this trackless wilderness of stone and sand and red clay, they were hard dry gods, deaf to prayers for rain.  Wine gave out first, and soon thereafter the clotted mare’s milk the horselords loved better than mead. Then their stores of flatbread and dried meat were exhausted as well. Their hunters found no game, and only the flesh of their dead horses filled their bellies. Death followed death. Weak children, wrinkled old women, the sick and the stupid and the heedless, the cruel land claimed them all. Doreah grew gaunt and hollow-eyed, and her soft golden hair turned brittle as straw.  Dany hungered and thirsted with the rest of them. The milk in her breasts dried up, her nipples cracked and bled, and the flesh fell away from her day by day until she was lean and hard as a stick, yet it was her dragons she feared for."
}