{
  "id": "60360412a7dbd5305ba17ba2906c15a1eb460014",
  "text": " But the gash across his face was raw and red, and his nose was a hideous scab.  You are very beautiful, Sansa,  he told her.   It is good of you to say so, my lord.  She did not know what else to say. Should I tell him he is handsome? He’ll think me a fool or a liar. She lowered her gaze and held her tongue.   My lady, this is no way to bring you to your wedding. I am sorry for that. And for making this so sudden, and so secret. My lord father felt it necessary, for reasons of state. Else I would have come to you sooner, as I wished.  He waddled closer.  You did not ask for this marriage, I know. No more than I did. If I had refused you, however, they would have wed you to my cousin Lancel. Perhaps you would prefer that. He is nearer your age, and fairer to look upon. If that is your wish, say so, and I will end this farce.   I don’t want any Lannister, she wanted to say. I want Willas, I want Highgarden and the puppies and the barge, and sons named Eddard and Bran and Rickon. But then she remembered what Dontos had told her in the godswood. Tyrell or Lannister, it makes no matter, it’s not me they want, only my claim.  You are kind, my lord,  she said, defeated.  I am a ward of the throne and my duty is to marry as the king commands.   He studied her with his mismatched eyes.  I know I am not the sort of husband young girls dream of, Sansa,  he said softly,  but neither am I Joffrey.    No,  she said.  You were kind to me. I remember.   Tyrion offered her a thick, blunt-fingered hand.  Come, then. Let us do our duty.   So she put her hand in his, and he led her to the marriage altar, where the septon waited between the Mother and the Father to join their lives together. She saw Dontos in his fool’s motley, looking at her with big round eyes. Ser Balon Swann and Ser Boros Blount were there in Kingsguard white, but not Ser Loras. None of the Tyrells are here, she realized suddenly. But there were other witnesses aplenty; the eunuch Varys, Ser Addam Marbrand, Lord Philip Foote, Ser Bronn, Jalabhar Xho, a dozen others. Lord Gyles was coughing, Lady Ermesande was at the breast, and Lady Tanda’s pregnant daughter was sobbing for no apparent reason. Let her sob, Sansa thought. Perhaps I shall do the same before this day is done.  The ceremony passed as in a dream. Sansa did all that was required of her. There were prayers and vows and singing, and tall candles burning, a hundred dancing lights that the tears in her eyes transformed into a thousand. Thankfully no one seemed to notice that she was crying as she stood there, wrapped in her father’s colors; or if they did, they pretended not to. In what seemed no time at all, they came to the changing of the cloaks.  As father of the realm, Joffrey took the place of Lord Eddard Stark. Sansa stood stiff as a lance as his hands came over her shoulders to fumble with the clasp of her cloak. One of them brushed her breast and lingered to give it a little squeeze. Then the clasp opened, and Joff swept her maiden’s cloak away with a kingly flourish and a grin.  His uncle’s part went less well. The bride’s cloak he held was huge and heavy, crimson velvet richly worked with lions and bordered with gold satin and rubies. No one had thought to bring a stool, however, and Tyrion stood a foot and a half shorter than his bride. As he moved behind her, Sansa felt a sharp tug on her skirt. He wants me to kneel, she realized, blushing. She was mortified. It was not supposed to be this way. She had dreamed of her wedding a thousand times, and always she had pictured how her betrothed would stand behind her tall and strong, sweep the cloak of his protection over her shoulders, and tenderly kiss her cheek as he leaned forward to fasten the clasp.  She felt another tug at her skirt, more insistent. I won’t. Why should I spare his feelings, when no one cares about mine?  The dwarf tugged at her a third time. Stubbornly she pressed her lips together and pretended not to notice. Someone behind them tittered. The queen, she thought, but it didn’t matter. They were all laughing by then, Joffrey the loudest.  Dontos, down on your hands and knees,  the king commanded.  My uncle needs a boost to climb his bride.   And so it was that her lord husband cloaked her in the colors of House Lannister whilst standing on the back of a fool.  When Sansa turned, the little man was gazing up at her, his mouth tight, his face as red as her cloak. Suddenly she was ashamed of her stubbornness. She smoothed her skirts and knelt in front of him, so their heads were on the same level.  With this kiss I pledge my love, and take you for my lord and husband.    With this kiss I pledge my love,  the dwarf replied hoarsely,  and take you for my lady and wife.  He leaned forward, and their lips touched briefly.  He is so ugly, Sansa thought when his face was close to hers. He is even uglier than the Hound.  The septon raised his crystal high, so the rainbow light fell down upon them.  Here in the sight of gods and men,  he said,  I do solemnly proclaim Tyrion of House Lannister and Sansa of House Stark to be man and wife, one flesh, one heart, one soul, now and forever, and cursed be the one who comes between them."
}