{
  "id": "61b5d784b87fc81e0cc926e58bbb5d030488fcf7",
  "text": " Their faces were stern and strong, and some of them had done terrible things, but they were Starks every one, and Bran knew all their tales. He had never feared the crypts; they were part of his home and who he was, and he had always known that one day he would lie here too.  But now he was not so certain. If I go up, will I ever come back down? Where will I go when I die?   Wait,  Osha said when they reached the twisting stone stairs that led up to the surface, and down to the deeper levels where kings more ancient still sat their dark thrones. She handed Meera the torch.  I’ll grope my way up.  For a time they could hear the sound of her footfalls, but they grew softer and softer until they faded away entirely.  Hodor,  said Hodor nervously.  Bran had told himself a hundred times how much he hated hiding down here in the dark, how much he wanted to see the sun again, to ride his horse through wind and rain. But now that the moment was upon him, he was afraid. He’d felt safe in the darkness; when you could not even find your own hand in front of your face, it was easy to believe that no enemies could ever find you either. And the stone lords had given him courage. Even when he could not see them, he had known they were there.  It seemed a long while before they heard anything again. Bran had begun to fear that something had happened to Osha. His brother was squirming restlessly.  I want to go home!  he said loudly. Hodor bobbed his head and said,  Hodor.  Then they heard the footsteps again, growing louder, and after a few minutes Osha emerged into the light, looking grim.  Something is blocking the door. I can’t move it.    Hodor can move anything,  said Bran.  Osha gave the huge stableboy an appraising look.  Might be he can. Come on, then.   The steps were narrow, so they had to climb in single file. Osha led. Behind came Hodor, with Bran crouched low on his back so his head wouldn’t hit the ceiling. Meera followed with the torch, and Jojen brought up the rear, leading Rickon by the hand. Around and around they went, and up and up. Bran thought he could smell smoke now, but perhaps that was only the torch.  The door to the crypts was made of ironwood. It was old and heavy, and lay at a slant to the ground. Only one person could approach it at a time. Osha tried once more when she reached it, but Bran could see that it was not budging.  Let Hodor try.   They had to pull Bran from his basket first, so he would not get squished. Meera squatted beside him on the steps, one arm thrown protectively across his shoulders, as Osha and Hodor traded places.  Open the door, Hodor,  Bran said.  The huge stableboy put both hands flat on the door, pushed, and grunted.  Hodor?  He slammed a fist against the wood, and it did not so much as jump.  Hodor.    Use your back,  urged Bran.  And your legs.   Turning, Hodor put his back to the wood and shoved. Again. Again.  Hodor!  He put one foot on a higher step so he was bent under the slant of the door and tried to rise. This time the wood groaned and creaked.  Hodor!  The other foot came up a step, and Hodor spread his legs apart, braced, and straightened. His face turned red, and Bran could see cords in his neck bulging as he strained against the weight above him.  Hodor hodor hodor hodor hodor HODOR!  From above came a dull rumble. Then suddenly the door jerked upward and a shaft of daylight fell across Bran’s face, blinding him for a moment. Another shove brought the sound of shifting stone, and then the way was open. Osha poked her spear through and slid out after it, and Rickon squirmed through Meera’s legs to follow. Hodor shoved the door open all the way and stepped to the surface. The Reeds had to carry Bran up the last few steps.  The sky was a pale grey, and smoke eddied all around them. They stood in the shadow of the First Keep, or what remained of it. One whole side of the building had torn loose and fallen away. Stone and shattered gargoyles lay strewn across the yard. They fell just where I did, Bran thought when he saw them. Some of the gargoyles had broken into so many pieces it made him wonder how he was alive at all. Nearby some crows were pecking at a body crushed beneath the tumbled stone, but he lay facedown and Bran could not say who he was.  The First Keep had not been used for many hundreds of years, but now it was more of a shell than ever. The floors had burned inside it, and all the beams. Where the wall had fallen away, they could see right into the rooms, even into the privy. Yet behind, the broken tower still stood, no more burned than before. Jojen Reed was coughing from the smoke.  Take me home!  Rickon demanded.  I want to be home!  Hodor stomped in a circle.  Hodor,  he whimpered in a small voice. They stood huddled together with ruin and death all around them.   We made noise enough to wake a dragon,  Osha said,  but there’s no one come. The castle’s dead and burned, just as Bran dreamed, but we had best—  She broke off suddenly at a noise behind them, and whirled with her spear at the ready."
}