{
  "id": "64e0fb1ccbf3aa833401f91ea9b4fcd5aa7a3f67",
  "text": " \"Inseparable!\"  \"Of course they were,\" said Fudge. \"Potter trusted Black beyond all his other friends. Nothing changed when they left school. Black was best man when James married Lily. Then they named him godfather to Harry. Harry has no idea, of course. You can imagine how the idea would torment him.\"  \"Because Black turned out to be in league with You-Know-Who?\" whispered Madam Rosmerta.  \"Worse even than that, rn'dear....\" Fudge dropped his voice and proceeded in a sort of low rumble. \"Not many people are aware that the Potters knew You-Know-Who was after them. Dumbledore, who was of course working tirelessly against You-Know-Who, had a number of useful spies. One of them tipped him off, and he alerted James and Lily at once. He advised them to go into hiding. Well, of course, You-Know-Who wasn't an easy person to hide from. Dumbledore told them that their best chance was the Fidelius Charm.\"  \"How does that work?\" said Madam Rosmerta, breathless with interest. Professor Flitwick cleared his throat.  \"An immensely complex spell,\" he said squeakily, \"involving the magical concealment of a secret inside a single, living soul. The information is hidden inside the chosen person, or Secret-Keeper, and is henceforth impossible to find -- unless, of course, the Secret-Keeper chooses to divulge it. As long as the Secret-Keeper refused to speak, You-Know-Who could search the village where Lily and James were staying for years and never find them, not even if he had his nose pressed against their sitting room window!\"  \"So Black was the Potters' Secret-Keeper?\" whispered Madam Rosmerta.  \"Naturally,\" said Professor McGonagall. \"James Potter told Dumbledore that Black would die rather than tell where they were, that Black was planning to go into hiding himself... and yet, Dumbledore remained worried. I remember him offering to be the Potters' Secret-Keeper himself.\"  \"He suspected Black?\" gasped Madam Rosmerta.  \"He was sure that somebody close to the Potters had been keeping You-Know-Who informed of their movements,\" said Professor McGonagall darkly. \"Indeed, he had suspected for some time that someone on our side had turned traitor and was passing a lot of information to You-Know-Who.\"  \"But James Potter insisted on using Black?\"  \"He did,\" said Fudge heavily. \"And then, barely a week after the Fidelius Charm had been performed --\" \"Black betrayed them?\" breathed Madam Rosmerta.  \"He did indeed. Black was tired of his double-agent role, he was ready to declare his support openly for You-Know-Who, and he seems to have planned this for the moment of the Potters' death. But, as we all know, You-Know-Who met his downfall in little Harry Potter. Powers gone, horribly weakened, he fled. And this left Black in a very nasty position indeed. His master had fallen at the very moment when he, Black, had shown his true colors as a traitor. He had no choice but to run for it --\"  \"Filthy, stinkin' turncoat!\" Hagrid said, so loudly that half the bar went quiet.  \"Shh!\" said Professor McGonagall.  \"I met him!\" growled Hagrid. \"I musta bin the last ter see him before he killed all them people! It was me what rescued Harry from Lily an' James's house after they was killed! jus' got him outta the ruins, poor little thing, with a great slash across his forehead, an' his parents dead... an' Sirius Black turns up, on that flyin' motorbike he used ter ride. Never occurred ter me what he was doin' there. I didn' know he'd bin Lily an' James's Secret-Keeper. Thought he'd jus' heard the news o' You-Know-Who's attack an' come ter see what he could do. White an' shakin', he was. An' yeh know what I did? I COMFORTED THE MURDERIN' TRAITOR!\" Hagrid roared.  \"Hagrid, please!\" said Professor McGonagall. \"Keep your voice down!\"  \"How was I ter know he wasn' upset abou' Lily an' James? It was You-Know-Who he cared abou'! An' then he says, 'Give Harry ter me, Hagrid, I'm his godfather, I'll look after him --' Ha! But I'd had me orders from Dumbledore, an' I told Black no, Dumbledore said Harry was ter go ter his aunt an' uncle's. Black argued, but in the end he gave in. Told me ter take his motorbike ter get Harry there. 'I won't need it anymore,' he says.  \"I shoulda known there was somethin' fishy goin' on then. He loved that motorbike, what was he givin' it ter me for? Why wouldn' he need it anymore? Fact was, it was too easy ter trace. Dumbledore knew he'd bin the Potters' Secret-Keeper. Black knew he was goin' ter have ter run fer it that night, knew it was a matter o' hours before the Ministry was after him.  \"But what if I'd given Harry to him, eh? I bet he'd 've pitched him off the bike halfway out ter sea. His bes' friends' son! But when a wizard goes over ter the Dark Side, there's nothin' and no one that matters to em anymore....\"  A long silence followed Hagrid's story. Then Madam Rosmerta said with some satisfaction, \"But he didn't manage to disappear, did he? The Ministry of Magic caught up with him next day!\"  \"Alas, if only we had,\" said Fudge bitterly."
}