{
  "id": "65fcb359debfa47f406550daa89babed5513b87d",
  "text": " Send us an answer back with Hedwig.  Hagrid   Harry borrowed Ron's quill, scribbled Yes, please, see you later on the back of the note, and sent Hedwig off again.  It was lucky that Harry had tea with Hagrid to look forward to, because the Potions lesson turned out to be the worst thing that had happened to him so far.  At the start-of-term banquet, Harry had gotten the idea that Professor Snape disliked him. By the end of the first Potions lesson, he knew he'd been wrong. Snape didn't dislike Harry -- he hated him.  Potions lessons took place down in one of the dungeons. It was colder here than up in the main castle, and would have been quite creepy enough without the pickled animals floating in glass jars all around the walls.  Snape, like Flitwick, started the class by taking the roll call, and like Flitwick, he paused at Harry's name.  \"Ah, Yes,\" he said softly, \"Harry Potter. Our new -- celebrity.\"  Draco Malfoy and his friends Crabbe and Goyle sniggered behind their hands. Snape finished calling the names and looked up at the class. His eyes were black like Hagrid's, but they had none of Hagrid's warmth. They were cold and empty and made you think of dark tunnels.  \"You are here to learn the subtle science and exact art of potionmaking,\" he began. He spoke in barely more than a whisper, but they caught every word -- like Professor McGonagall, Snape had y caught every word -- like Professor McGonagall, Snape had the gift of keeping a class silent without effort. \"As there is little foolish wand-waving here, many of you will hardly believe this is magic. I don't expect you will really understand the beauty of the softly simmering cauldron with its shimmering fumes, the delicate power of liquids that creep through human veins, bewitching the mind, ensnaring the senses.... I can teach you how to bottle fame, brew glory, even stopper death -- if you aren't as big a bunch of dunderheads as I usually have to teach.\"  More silence followed this little speech. Harry and Ron exchanged looks with raised eyebrows. Hermione Granger was on the edge of her seat and looked desperate to start proving that she wasn't a dunderhead.  \"Potter!\" said Snape suddenly. \"What would I get if I added powdered root of asphodel to an infusion of wormwood?\"  Powdered root of what to an infusion of what? Harry glanced at Ron, who looked as stumped as he was; Hermione's hand had shot into the air.  \"I don't know, sit,\" said Harry.  Snape's lips curled into a sneer.  \"Tut, tut -- fame clearly isn't everything.\"  He ignored Hermione's hand.  \"Let's try again. Potter, where would you look if I told you to find me a bezoar?\"  Hermione stretched her hand as high into the air as it would go without her leaving her seat, but Harry didn't have the faintest idea what a bezoar was. He tried not to look at Malfoy, Crabbe, and Goyle, who were shaking with laughter.  \"I don't know, sit.\" \"Thought you wouldn't open a book before coming, eh, Potter?\" Harry forced himself to keep looking straight into those cold eyes. He had looked through his books at the Dursleys', but did Snape expect him to remember everything in One Thousand Magical Herbs and Fungi?  Snape was still ignoring Hermione's quivering hand.  \"What is the difference, Potter, between monkshood and wolfsbane?\"  At this, Hermione stood up, her hand stretching toward the dungeon ceiling.  \"I don't know,\" said Harry quietly. \"I think Hermione does, though, why don't you try her?\"  A few people laughed; Harry caught Seamus's eye, and Seamus winked. Snape, however, was not pleased.  \"Sit down,\" he snapped at Hermione. \"For your information, Potter, asphodel and wormwood make a sleeping potion so powerful it is known as the Draught of Living Death. A bezoar is a stone taken from the stomach of a goat and it will save you from most poisons. As for monkshood and wolfsbane, they are the same plant, which also goes by the name of aconite. Well? Why aren't you all copying that down?\"  There was a sudden rummaging for quills and parchment. Over the noise, Snape said, \"And a point will be taken from Gryffindor House for your cheek, Potter.\"  Things didn't improve for the Gryffindors as the Potions lesson continued. Snape put them all into pairs and set them to mixing up a simple potion to cure boils. He swept around in his long black cloak, watching them weigh dried nettles and crush snake fangs, criticizing almost everyone except Malfoy, whom he seemed to like. He was just telling everyone to look at the perfect way Malfoy had stewed his horned slugs when clouds of acid green smoke and a loud hissing filled the dungeon. Neville had somehow managed to melt Seamus's cauldron into a twisted blob, and their potion was seeping across the stone floor, burning holes in people's shoes. Within seconds, the whole class was standing on their stools while Neville, who had been drenched in the potion when the cauldron collapsed, moaned in pain as angry red boils sprang up all over his arms and legs.  \"Idiot boy!\" snarled Snape, clearing the spilled potion away with one wave of his wand."
}