{
  "id": "6c3105fad5835a79d8b88fb4dbaa3f76e2dccea1",
  "text": " Who did your leeches kill?    Do you doubt the power of R’hllor?   No. Davos remembered too well the living shadow that had squirmed from out her womb that night beneath Storm’s End, its black hands pressing at her thighs. I must go carefully here, or some shadow may come seeking me as well.  Even an onion smuggler knows two onions from three. You are short a king, my lady.   Stannis gave a snort of laughter.  He has you there, my lady. Two is not three.    To be sure, Your Grace. One king might die by chance, even two… but three? if Joffrey should die in the midst of all his power, surrounded by his armies and his Kingsguard, would not that show the power of the Lord at work?    It might.  The king spoke as if he grudged each word.   Or not.  Davos did his best to hide his fear.   Joffrey shall die,  Queen Selyse declared, serene in her confidence.   It may be that he is dead already,  Ser Axell added.  Stannis looked at them with annoyance.  Are you trained crows, to croak at me in turns? Enough.    Husband, hear me—  the queen entreated.   Why? Two is not three. Kings can count as well as smugglers. You may go.  Stannis turned his back on them.  Melisandre helped the queen to her feet. Selyse swept stiffly from the chamber, the red woman trailing behind. Ser Axell lingered long enough to give Davos one last look. An ugly look on an ugly face, he thought as he met the stare.  After the others had gone, Davos cleared his throat. The king looked up.  Why are you still here?    Sire, about Edric Storm…   Stannis made a sharp gesture.  Spare me.   Davos persisted.  Your daughter takes her lessons with him, and plays with him every day in Aegon’s Garden.    I know that.    Her heart would break if anything ill should—    I know that as well.    If you would only see him—    I have seen him. He looks like Robert. Aye, and worships him. Shall I tell him how often his beloved father ever gave him a thought? My brother liked the making of children well enough, but after birth they were a bother.    He asks after you every day, he—    You are making me angry, Davos. I will hear no more of this bastard boy.    His name is Edric Storm, sire.    I know his name. Was there ever a name so apt? It proclaims his bastardy, his high birth, and the turmoil he brings with him. Edric Storm. There, I have said it. Are you satisfied, my lord Hand?    Edric—  he started.   —is one boy! He may be the best boy who ever drew breath and it would not matter. My duty is to the realm.  His hand swept across the Painted Table.  How many boys dwell in Westeros? How many girls? How many men, how many women? The darkness will devour them all, she says. The night that never ends. She talks of prophecies… a hero reborn in the sea, living dragons hatched from dead stone… she speaks of signs and swears they point to me. I never asked for this, no more than I asked to be king. Yet dare I disregard her?  He ground his teeth.  We do not choose our destinies. Yet we must… we must do our duty, no? Great or small, we must do our duty. Melisandre swears that she has seen me in her flames, facing the dark with Lightbringer raised on high. Lightbringer!  Stannis gave a derisive snort.  It glimmers prettily, I’ll grant you, but on the Blackwater this magic sword served me no better than any common steel. A dragon would have turned that battle. Aegon once stood here as I do, looking down on this table. Do you think we would name him Aegon the Conqueror today if he had not had dragons?    Your Grace,  said Davos,  the cost…    I know the cost! Last night, gazing into that hearth, I saw things in the flames as well. I saw a king, a crown of fire on his brows, burning… burning, Davos. His own crown consumed his flesh and turned him into ash. Do you think I need Melisandre to tell me what that means? Or you?  The king moved, so his shadow fell upon King’s Landing.  If Joffrey should die… what is the life of one bastard boy against a kingdom?    Everything,  said Davos, softly.  Stannis looked at him, jaw clenched.  Go,  the king said at last,  before you talk yourself back into the dungeon.   Sometimes the storm winds blow so strong a man has no choice but to furl his sails.  Aye, Your Grace.  Davos bowed, but Stannis had seemingly forgotten him already.  It was chilly in the yard when he left the Stone Drum. A wind blew briskly from the cast, making the banners snap and flap noisily along the walls. Davos could smell salt in the air. The sea. He loved that smell. It made him want to walk a deck again, to raise his canvas and sail off south to Marya and his two small ones. He thought of them most every day now, and even more at night. Part of him wanted nothing so much as to take Devan and go home. I cannot. Not yet. I am a lord now, and the King’s Hand, I must not fail him.  He raised his eyes to gaze up at the walls. In place of merlons, a thousand grotesques and gargoyles looked down on him, each different from all the others; wyvems, griffins, demons, manticores, minotaurs, basilisks, hellhounds, cockatrices, and a thousand queerer creatures sprouted from the castle’s battlements as if they’d grown there."
}