{
  "id": "6d88c8eb4bbd93a7511121075c5e5ffcb9c867a6",
  "text": "  \"Let's go. . . .\" But Ron didn't move. \"What's up?\" said Harry, looking at him. Ron looked around at Harry, his expression very serious indeed. \"Did you know?\" he whispered. \"About Hagrid being half-giant?\" \"No,\" Harry said, shrugging. \"So what?\" He knew immediately, from the look Ron was giving him, that he was once again revealing his ignorance of the wizarding world.  Brought up by the Dursleys, there were many things that wizards took for granted that were revelations to Harry, but these surprises had become fewer with each successive year.  Now, however, he could tell that most wizards would not have said \"So what?\" upon finding out that one of their friends had a giantess for a mother. \"I'll explain inside,\" said Ron quietly, \"c'mon. . ..\" Fleur and Roger Davies had disappeared, probably into a more private clump of bushes.  Harry and Ron returned to the Great Hall.  Parvati and Padma were now sitting at a distant table with a whole crowd of Beauxbatons boys, and Hermione was once more dancing with Krum.  Harry and Ron sat down at a table far removed from the dance floor. \"So?\" Harry prompted Ron. \"What's the problem with giants?\" \"Well, they're . . . they're . . .\" Ron struggled for words. \". . . not very nice,\" he finished lamely. \"Who cares?\" Harry said.  \"There's nothing wrong with Hagrid!\" \"I know there isn't, but. . . blimey, no wonder he keeps it quiet,\" Ron said, shaking his head.  \"I always thought he'd got in the way of a bad Engorgement Charm when he was a kid or something.  Didn't like to mention it. ...\" \"But what's it matter if his mother was a giantess?\" said Harry. \"Well... no one who knows him will care, 'cos they'll know he's not dangerous,\" said Ron slowly.  \"But. . . Harry, they're just vicious, giants.  It's like Hagrid said, it's in their natures, they're like trolls . . . they just like killing, everyone knows that.  There aren't any left in Britain now, though.\" \"What happened to them?\" \"Well, they were dying out anyway, and then loads got themselves killed by Aurors. There're supposed to be giants abroad, though. . . . They hide out in mountains mostly. . . .\" \"I don't know who Maxime thinks she's kidding,\" Harry said, watching Madame Maxime sitting alone at the judges' table, looking very somber.  \"If Hagrid's half-giant, she definitely is.  Big bones . .. the only thing that's got bigger bones than her is a dinosaur.\" Harry and Ron spent the rest of the ball discussing giants in their corner, neither of them having any inclination to dance.  Harry tried not to watch Cho and Cedric too much; it gave him a strong desire to kick something. When the Weird Sisters finished playing at midnight, everyone gave them a last, loud round of applause and started to wend their way into the entrance hall.  Many people were expressing the wish that the ball could have gone on longer, but Harry was perfectly happy to be going to bed; as far as he was concerned, the evening hadn't been much fun. Out in the entrance hall, Harry and Ron saw Hermione saying good night to Krum before he went back to the Durmstrang ship.  She gave Ron a very cold look and swept past him up the marble staircase without speaking.  Harry and Ron followed her, but halfway up the staircase Harry heard someone calling him. \"Hey-Harry!\" It was Cedric Diggory.  Harry could see Cho waiting for him in the entrance hall below. \"Yeah?\"  said Harry coldly as Cedric ran up the stairs toward him. Cedric looked as though he didn't want to say whatever it was in front of Ron, who shrugged, looking bad-tempered, and continued to climb the stairs. \"Listen ...\" Cedric lowered his voice as Ron disappeared.  \"I owe you one for telling me about the dragons.  You know that golden egg?  Does yours wail when you open it?\" \"Yeah,\" said Harry. \"Well... take a bath, okay?\" \"What?\" \"Take a bath, and - er - take the egg with you, and - er - just mull things over in the hot water.  It'll help you think. . . . Trust me.\" Harry stared at him. \"Tell you what,\" Cedric said, \"use the prefects' bathroom.  Fourth door to the left of that statue of Boris the Bewildered on the fifth floor.  Password's 'pine fresh.'  Gotta go ... want to say good night -\" He grinned at Harry again and hurried back down the stairs to Cho. Harry walked back to Gryffindor Tower alone.  That had been extremely strange advice.  Why would a bath help him to work out what the wailing egg meant?  Was Cedric pulling his leg?  Was he trying to make Harry look like a fool, so Cho would like him even more by comparison? The Fat Lady and her friend Vi were snoozing in the picture over the portrait hole. Harry had to yell \"Fairy lights!\" before he woke them up, and when he did, they were extremely irritated.  He climbed into the common room and found Ron and Hermione having a blazing row.  Standing ten feet apart, they were bellowing at each other, each scarlet in the face. \"Well, if you don't like it, you know what the solution is, don't you?\"  yelled Hermione; her hair was coming down out of its elegant bun now, and her face was screwed up in anger."
}