{
  "id": "6ec8a9d31e57691aa32e57d39f4f5c4007a9b646",
  "text": "  Then he heard the noise.  His eyes opened. What was that? He held his breath. Did I dream it? Was I having a stupid nightmare? He didn’t want to wake Meera and Jojen for a bad dream, but… there… a soft scuffling sound, far off… Leaves, it’s leaves rattling off the walls outside and rustling together… or the wind, it could be the wind… The sound wasn’t coming from outside, though. Bran felt the hairs on his arm start to rise. The sound’s inside, it’s in here with us, and it’s getting louder. He pushed himself up onto an elbow, listening. There was wind, and blowing leaves as well, but this was something else. Footsteps. Someone was coming this way. Something was coming this way.  It wasn’t the sentinels, he knew. The sentinels never left the Wall. But there might be other ghosts in the Nightfort, ones even more terrible. He remembered what Old Nan had said of Mad Axe, how he took his boots off and prowled the castle halls barefoot in the dark, with never a sound to tell you where he was except for the drops of blood that fell from his axe and his elbows and the end of his wet red beard. Or maybe it wasn’t Mad Axe at all, maybe it was the thing that came in the night. The ’prentice boys all saw it, Old Nan said, but afterward when they told their Lord Commander every description had been different. And three died within the year, and the fourth went mad, and a hundred years later when the thing had come again, the ’prentice boys were seen shambling along behind it, all in chains.  That was only a story, though. He was just scaring himself. There was no thing that comes in the night, Maester Luwin had said so. If there had ever been such a thing, it was gone from the world now, like giants and dragons. It’s nothing, Bran thought.  But the sounds were louder now.  It’s coming from the well, he realized. That made him even more afraid. Something was coming up from under the ground, coming up out of the dark. Hodor woke it up. He woke it up with that stupid piece of slate, and now it’s coming. It was hard to hear over Hodor’s snores and the thumping of his own heart. Was that the sound blood made dripping from an axe? Or was it the faint, far-off rattling of ghostly chains? Bran listened harder. Footsteps. It was definitely footsteps, each one a little louder than the one before. He couldn’t tell how many, though. The well made the sounds echo. He didn’t hear any dripping, or chains either, but there was something else… a high thin whimpering sound, like someone in pain, and heavy muffled breathing. But the footsteps were loudest. The footsteps were coming closer.  Bran was too frightened to shout. The fire had burned down to a few faint embers and his friends were all asleep. He almost slipped his skin and reached out for his wolf, but Summer might be miles away. He couldn’t leave his friends helpless in the dark to face whatever was coming up out of the well. I told them not to come here, he thought miserably. I told them there were ghosts. I told them that we should go to Castle Black.  The footfalls sounded heavy to Bran, slow, ponderous, scraping against the stone. It must be huge. Mad Axe had been a big man in Old Nan’s story, and the thing that came in the night had been monstrous. Back in Winterfell, Sansa had told him that the demons of the dark couldn’t touch him if he hid beneath his blanket. He almost did that now, before he remembered that he was a prince, and almost a man grown.  Bran wriggled across the floor, dragging his dead legs behind him until he could reach out and touch Meera on the foot. She woke at once. He had never known anyone to wake as quick as Meera Reed, or to be so alert so fast. Bran pressed a finger to his mouth so she’d know not to speak. She heard the sound at once, he could see that on her face; the echoing footfalls, the faint whimpering, the heavy breathing.  Meera rose to her feet without a word and reclaimed her weapons. With her three-pronged frog spear in her right hand and the folds of her net dangling from her left, she slipped barefoot toward the well. Jojen dozed on, oblivious, while Hodor muttered and thrashed in restless sleep. She kept to the shadows as she moved, stepped around the shaft of moonlight as quiet as a cat. Bran was watching her all the while, and even he could barely see the faint sheen of her spear. I can’t let her fight the thing alone, he thought. Summer was far away, but…  …he slipped his skin, and reached for Hodor.  It was not like sliding into Summer. That was so easy now that Bran hardly thought about it. This was harder, like trying to pull a left boot on your right foot. It fit all wrong, and the boot was scared too, the boot didn’t know what was happening, the boot was pushing the foot away. He tasted vomit in the back of Hodor’s throat, and that was almost enough to make him flee. Instead he squirmed and shoved, sat up, gathered his legs under him—his huge strong legs—and rose. I’m standing. He took a step. I’m walking. It was such a strange feeling that he almost fell."
}