{
  "id": "6fa8808947311ab2cb090bf4789b4bd34f43cfd1",
  "text": "  Their paths now went into  thickets  where  the dusk had already gathered. Night came beneath the trees  as they walked, and the Elves uncovered their silver lamps.        Suddenly they came out into the open again and found themselves under a  pale evening sky pricked by a  few early  stars.  There  was a wide treeless  space  before  them, running in a  great circle  and bending  away on  either   hand. Beyond it was a deep fosse lost in soft shadow, but the grass upon its  brink was green, as if it  glowed still in memory of the sun that  had gone.  Upon the further side there rose to a great height a green wall encircling a   green hill thronged with mallorn-trees taller than any they had yet seen  in  all the land. Their height  could not be  guessed,  but they stood up in the  twilight like living towers. In  their, many-tiered branches and amid  their  ever -moving  leaves  countless  lights were  gleaming,  green and  gold  and   silver. Haldir turned towards the Company.       `Welcome to  Caras  Galadhon!  ' he  said. 'Here  is the  city  of  the  Galadhrim where dwell  the Lord Celeborn  and Galadriel  the Lady of Lurien.  But we  cannot enter here,  for  the gates do not look northward. We must go   round to the  southern side,  and the  way is  not  short,  for the city  is  great.'       There was a road  paved with white stone  running on the outer brink of  the  fosse. Along this  they wen t westward, with the city  ever  climbing up  like  a  green cloud upon their left; and as the night deepened  more lights  sprang forth, until all the  hill seemed afire with stars. They came at last  to  a white  bridge, and crossing found  the  great gates of the  city: they  faced south-west, set between the  ends of the  encircling  wall  that  here  overlapped, and they were tall and strong, and hung with many lamps.        Haldir knocked  and  spoke,  and the gates  opened soundlessly; but  of  guards Frodo could see no sign. The  travellers passed within, and the gates  shut behind them. They were in a deep lane between the ends of the wall, and  passing quickly through it they entered the City of the Trees. No folk could  they  see, nor  hear  any feet upon the paths;  but  there were many voices,   about them, and  in the air  above. Far away up  on the hill they could hear   ####-the sound of singing falling from on high like soft rain upon leaves.        They went along many paths and climbed many  stairs, until they came to  the high places and saw before them amid a wide  lawn a fountain shimmering.  It was lit by silver lamps that swung from the boughs of trees,  and it fell  into a  basin of silver, from which a white stream spilled.  Upon the  south  side of the lawn  there stood the mightiest  of  all  the trees;  its  great  smooth  bole  gleamed  like  grey  silk, and up it  towered, until its first  branches, far above, opened their huge limbs under shadowy clouds of leaves.   Beside it  a  broad white ladder stood, and   at  its foot three  Elves  were  seated. They sprang up as the travellers approached, and Frodo saw that they  were tall and  clad in grey  mail, and from their shoulders hung long  white  cloaks.       'Here dwell Celeborn and Galadriel,'  said Haldir.  `It is  their  wish  that you should ascend and speak with them.'       One of the  Elf-wardens then blew a clear note on a small horn, and  it  was answered  three times from far  above. `I will  go first,' said  Haldir.  'Let Frodo come  next and  with him  Legolas. The others may follow  as they  wish. It is a  long climb for those that are not  accustomed to such stairs,   but you may rest upon the way.'       As he climbed slowly up Frodo passed many flets: some on one side, some  on  another,  and some set about  the  bole of the tree,  so that the ladder   passed through them. At a  great height above the ground he came to  a  wide  talan, like the deck of a great ship. On it was built a house, so large that  almost  it would have served  for  a hall of Men upon the earth. He  entered  behind  Haldir, and found that he was  in a chamber of oval  shape,  in  the  midst of which grew the trunk of the great mallorn, now tapering towards its  crown, and yet making still a pillar of wide girth.       The chamber was  filled with a  soft  light; its walls were  green  and  silver and  its roof  of gold. Many Elves were  seated there.  On two chairs  beneath the  bole of the tree and canopied by a living bough there sat, side  by side, Celeborn and Galadriel.  They stood up to greet  their guests, after   the  manner  of Elves, even those who were accounted mighty kings. Very tall  they were, and the Lady no less tall than the Lord; and they were grave  and  beautiful.  They were clad wholly  in white; and the hair of the Lady was of  deep gold, and the hair of the  Lord Celeborn was of silver long and bright;  but no sign  of  age was upon  them, unless it were  in  the depths of their  eyes; for these were keen as lances in the starlight, and yet  profound, the   ####-wells of deep memory."
}