{
  "id": "72d6912de02ab8d05a0fc71438e808cb2e447524",
  "text": " \"Severus, please fetch me the strongest Truth Potion you possess, and then go down to the kitchens and bring up the house-elf called Winky.  Minerva, kindly go down to Hagrid's house, where you will find a large black dog sitting in the pumpkin patch.  Take the dog up to my office, tell him I will be with him shortly, then come back here.\" If either Snape or McGonagall found these instructions peculiar, they hid their confusion. Both turned at once and left the office.  Dumbledore walked over to the trunk with seven locks, fitted the first key in the lock, and opened it.  It contained a mass of spell-books.  Dumbledore closed the trunk, placed a second key in the second lock, and opened the trunk again.  The spellbooks had vanished; this time it contained an assortment of broken Sneako-scopes, some parchment and quills, and what looked like a silvery Invisibility Cloak.  Harry watched, astounded, as Dumbledore placed the third, fourth, fifth, and sixth keys in their respective locks, reopening the trunk each time, and revealing different contents each time.  Then he placed the seventh key in the lock, threw open the lid, and Harry let out a cry of amazement. He was looking down into a kind of pit, an underground room, and lying on the floor some ten feet below, apparently fast asleep, thin and starved in appearance, was the real Mad-Eye Moody.  His wooden leg was gone, the socket that should have held the magical eye looked empty beneath its lid, and chunks of his grizzled hair were missing.  Harry stared, thunderstruck, between the sleeping Moody in the trunk and the unconscious Moody lying on the floor of the office. Dumbledore climbed into the trunk, lowered himself, and fell lightly onto the floor beside the sleeping Moody.  He bent over him. \"Stunned - controlled by the Imperius Curse - very weak,\" he said.  \"Of course, they would have needed to keep him alive.  Harry, throw down the imposter's cloak - he's freezing. Madam Pomfrey will need to see him, but he seems in no immediate danger.\" Harry did as he was told; Dumbledore covered Moody in the cloak, tucked it around him, and clambered out of the trunk again.  Then he picked up the hip flask that stood upon the desk, unscrewed it, and turned it over.  A thick glutinous liquid splattered onto the office floor. \"Polyjuice Potion, Harry,\" said Dumbledore.  \"You see the simplicity of it, and the brilliance.  For Moody never does drink except from his hip flask, he's well known for it.  The imposter needed, of course, to keep the real Moody close by, so that he could continue making the potion.  You see his hair ...\"  Dumbledore looked down on the Moody in the trunk.  \"The imposter has been cutting it off all year, see where it is uneven?  But I think, in the excitement of tonight, our fake Moody might have forgotten to take it as frequendy as he should have done ... on the hour . . . every hour. . . . We shall see.\" Dumbledore pulled out the chair at the desk and sat down upon it, his eyes fixed upon the unconscious Moody on the floor.  Harry stared at him too.  Minutes passed in silence... . Then, before Harry's very eyes, the face of the man on the floor began to change.  The scars were disappearing, the skin was becoming smooth; the mangled nose became whole and started to shrink.  The long mane of grizzled gray hair was withdrawing into the scalp and turning the color of straw.  Suddenly, with a loud clunk, the wooden leg fell away as a normal leg regrew in its place; next moment, the magical eyeball had popped out of the man's face as a real eye replaced it; it rolled away across the floor and continued to swivel in every direction. Harry saw a man lying before him, pale-skinned, slightly freckled, with a mop of fair hair.  He knew who he was.  He had seen him in Dumbledore's Pensieve, had watched him being led away from court by the dementors, trying to convince Mr. Crouch that he was innocent. . . but he was lined around the eyes now and looked much older. . . . There were hurried footsteps outside in the corridor.  Snape had returned with Winky at his heels.  Professor McGonagall was right behind them. \"Crouch!\"  Snape said, stopping dead in the doorway.  \"Barty Crouch!\" \"Good heavens,\" said Professor McGonagall, stopping dead and staring down at the man on the floor. Filthy, disheveled, Winky peered around Snape's legs.  Her mouth opened wide and she let out a piercing shriek. \"Master Barty, Master Barty, what is you doing here?\" She flung herself forward onto the young man's chest. \"You is killed him!  You is killed him!  You is killed Master's son!\" \"He is simply Stunned, Winky,\" said Dumbledore.  \"Step aside, please.  Severus, you have the potion?\" Snape handed Dumbledore a small glass bottle of completely clear liquid: the Veritaserum with which he had threatened Harry in class.  Dumbledore got up, bent over the man on the floor, and pulled him into a sitting position against the wall beneath the Foe-Glass, in which the reflections of Dumbledore, Snape, and McGonagall were still glaring down upon them all."
}