{
  "id": "73a900d2e0bbc45ba4cae0517034c71df5496559",
  "text": "  A sharp rap on the door heralded Jory Cassel. Ned closed Malleon’s tome and bid him enter.  I’ve promised the City Watch twenty of my guard until the tourney is done,  he told him.  I rely on you to make the choice. Give Alyn the command, and make certain the men understand that they are needed to stop fights, not start them.  Rising, Ned opened a cedar chest and removed a light linen undertunic.  Did you find the stableboy?    The watchman, my lord,  Jory said.  He vows he’ll never touch another horse.    What did he have to say?    He claims he knew Lord Arryn well. Fast friends, they were.  Jory snorted.  The Hand always gave the lads a copper on their name days, he says. Had a way with horses. Never rode his mounts too hard, and brought them carrots and apples, so they were always pleased to see him.    Carrots and apples,  Ned repeated. It sounded as if this boy would be even less use than the others. And he was the last of the four Littlefinger had turned up. Jory had spoken to each of them in turn. Ser Hugh had been brusque and uninformative, and arrogant as only a new-made knight can be. If the Hand wished to talk to him, he should be pleased to receive him, but he would not be questioned by a mere captain of guards… even if said captain was ten years older and a hundred times the swordsman. The serving girl had at least been pleasant. She said Lord Jon had been reading more than was good for him, that he was troubled and melancholy over his young son’s frailty, and gruff with his lady wife. The potboy, now cordwainer, had never exchanged so much as a word with Lord Jon, but he was full of oddments of kitchen gossip: the lord had been quarreling with the king, the lord only picked at his food, the lord was sending his boy to be fostered on Dragonstone, the lord had taken a great interest in the breeding of hunting hounds, the lord had visited a master armorer to commission a new suit of plate, wrought all in pale silver with a blue jasper falcon and a mother-of-pearl moon on the breast. The king’s own brother had gone with him to help choose the design, the potboy said. No, not Lord Renly, the other one, Lord Stannis.   Did our watchman recall anything else of note?    The lad swears Lord Jon was as strong as a man half his age. Often went riding with Lord Stannis, he says.   Stannis again, Ned thought. He found that curious. Jon Arryn and he had been cordial, but never friendly. And while Robert had been riding north to Winterfell, Stannis had removed himself to Dragonstone, the Targaryen island fastness he had conquered in his brother’s name. He had given no word as to when he might return.  Where did they go on these rides?  Ned asked.   The boy says that they visited a brothel.    A brothel?  Ned said.  The Lord of the Eyrie and Hand of the King visited a brothel with Stannis Baratheon?  He shook his head, incredulous, wondering what Lord Renly would make of this tidbit. Robert’s lusts were the subject of ribald drinking songs throughout the realm, but Stannis was a different sort of man; a bare year younger than the king, yet utterly unlike him, stern, humorless, unforgiving, grim in his sense of duty.   The boy insists it’s true. The Hand took three guardsmen with him, and the boy says they were joking of it when he took their horses afterward.    Which brothel?  Ned asked.   The boy did not know. The guards would.    A pity Lysa carried them off to the Vale,  Ned said dryly.  The gods are doing their best to vex us. Lady Lysa, Maester Colemon, Lord Stannis… everyone who might actually know the truth of what happened to Jon Arryn is a thousand leagues away.    Will you summon Lord Stannis back from Dragonstone?    Not yet,  Ned said.  Not until I have a better notion of what this is all about and where he stands.  The matter nagged at him. Why did Stannis leave? Had he played some part in Jon Arryn’s murder? Or was he afraid? Ned found it hard to imagine what could frighten Stannis Baratheon, who had once held Storm’s End through a year of siege, surviving on rats and boot leather while the Lords Tyrell and Redwyne sat outside with their hosts, banqueting in sight of his walls.   Bring me my doublet, if you would. The grey, with the direwolf sigil. I want this armorer to know who I am. It might make him more forthcoming.   Jory went to the wardrobe.  Lord Renly is brother to Lord Stannis as well as the king.    Yet it seems that he was not invited on these rides.  Ned was not sure what to make of Renly, with all his friendly ways and easy smiles. A few days past, he had taken Ned aside to show him an exquisite rose gold locklet. Inside was a miniature painted in the vivid Myrish style, of a lovely young girl with doe’s eyes and a cascade of soft brown hair. Renly had seemed anxious to know if the girl reminded him of anyone, and when Ned had no answer but a shrug, he had seemed disappointed. The maid was Loras Tyrell’s sister Margaery, he’d confessed, but there were those who said she looked like Lyanna."
}