{
  "id": "74ffcbb229a38050b96a973b1e94579a47daa2b5",
  "text": " Clever girls go barefoot.    I have a message.  Arya eyed the serving girl uncertainly. When she did not seem likely to go away, she leaned in until her mouth was almost touching his ear.  Weese,  she whispered.  Jaqen H’ghar closed his eyes again, floating languid, half-asleep.  Tell his lordship a man shall attend him at his leisure.  His hand moved suddenly, splashing hot water at her, and Arya had to leap back to keep from getting drenched.  When she told Tuffleberry what Weese had said, the brewer cursed loudly.  You tell Weese my lads got duties to attend to, and you tell him he’s a pox-ridden bastard too, and the seven hells will freeze over before he gets another horn of my ale. I’ll have them barrels within the hour or Lord Tywin will hear of it, see if he don’t.   Weese cursed too when Arya brought back that message, even though she left out the pox-ridden bastard part. He fumed and threatened, but in the end he rounded up six men and sent them off grumbling to fetch the barrels down to the brewhouse.  Supper that evening was a thin stew of barley, onion, and carrots, with a wedge of stale brown bread. One of the women had taken to sleeping in Weese’s bed, and she got a piece of ripe blue cheese as well, and a wing off the capon that Weese had spoken of that morning. He ate the rest himself, the grease running down in a shiny line through the boils that festered at the corner of his mouth. The bird was almost gone when he glanced up from his trencher and saw Arya staring.  Weasel, come here.   A few mouthfuls of dark meat still clung to one thigh. He forgot, but now he’s remembered, Arya thought. It made her feel bad for telling Jaqen to kill him. She got off the bench and went to the head of the table.   I saw you looking at me.  Weese wiped his fingers on the front of her shift. Then he grabbed her throat with one hand and slapped her with the other.  What did I tell you?  He slapped her again, backhand.  Keep those eyes to yourself, or next time I’ll spoon one out and feed it to my bitch.  A shove sent her stumbling to the floor. Her hem caught on a loose nail in the splintered wooden bench and ripped as she fell.  You’ll mend that before you sleep,  Weese announced as he pulled the last bit of meat off the capon. When he was finished he sucked his fingers noisily, and threw the bones to his ugly spotted dog.   Weese,  Arya whispered that night as she bent over the tear in her shift.  Dunsen, Polliver, Raff the Sweetling,  she said, calling a name every time she pushed the bone needle through the undyed wool.  The Tickler and the Hound. Ser Gregor, Ser Amory, Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei.  She wondered how much longer she would have to include Weese in her prayer, and drifted off to sleep dreaming that on the morrow, when she woke, he’d be dead.  But it was the sharp toe of Weese’s boot that woke her, as ever. The main strength of Lord Tywin’s host would ride this day, he told them as they broke their fast on oatcakes.  Don’t none of you be thinking how easy it’ll be here once m’lord of Lannister is gone,  he warned.  The castle won’t grow no smaller, I promise you that, only now there’ll be fewer hands to tend to it. You lot of slugabeds are going to learn what work is now, yes you are.   Not from you. Arya picked at her oaten cake. Weese frowned at her, as if he smelled her secret. Quickly she dropped her gaze to her food, and dared not raise her eyes again.  Pale light filled the yard when Lord Tywin Lannister took his leave of Harrenhal. Arya watched from an arched window halfway up the Wailing Tower. His charger wore a blanket of enameled crimson scales and gilded crinet and chamfron, while Lord Tywin himself sported a thick ermine cloak. His brother Ser Kevan looked near as splendid. No less than four standard-bearers went before them, carrying huge crimson banners emblazoned with the golden lion. Behind the Lannisters came their great lords and captains. Their banners flared and flapped, a pageant of color: red ox and golden mountain, purple unicorn and bantam rooster, brindled boar and badger, a silver ferret and a juggler in motley, stars and sunbursts, peacock and panther, chevron and dagger, black hood and blue beetle and green arrow.  Last of all came Ser Gregor Clegane in his grey plate steel, astride a stallion as bad-tempered as his rider. Polliver rode beside him, with the black dog standard in his hand and Gendry’s horned helm on his head. He was a tall man, but he looked no more than a half-grown boy when he rode in his master’s shadow.  A shiver crept up Arya’s spine as she watched them pass under the great iron portcullis of Harrenhal. Suddenly she knew that she had made a terrible mistake. I’m so stupid, she thought. Weese did not matter, no more than Chiswyck had. These were the men who mattered, the ones she ought to have killed. Last night she could have whispered any of them dead, if only she hadn’t been so mad at Weese for hitting her and lying about the capon."
}