{
  "id": "765e1b45dbcbc5ab7f3a43bca565411c62a7dce1",
  "text": "  Jon took a step toward the tent, thinking of the Horn of Winter, but the shadowcat blocked him, tail lashing. The beast’s nostrils flared, and slaver ran from his curved front teeth. He smells my fear. He missed Ghost more than ever then. The two wolves were behind him, growling.   Banners,  he heard Varamyr murmur,  I see golden banners, oh…  A mammoth lumbered by, trumpeting, a half-dozen bowmen in the wooden tower on its back.  The king… no…   Then the skinchanger threw back his head and screamed.  The sound was shocking, ear-piercing, thick with agony. Varamyr fell, writhing, and the ’cat was screaming too… and high, high in the eastern sky, against the wall of cloud, Jon saw the eagle burning. For a heartbeat it flamed brighter than a star, wreathed in red and gold and orange, its wings beating wildly at the air as if it could fly from the pain. Higher it flew, and higher, and higher still.  The scream brought Val out of the tent, white-faced.  What is it, what’s happened?  Varamyr’s wolves were fighting each other, and the shadowcat had raced off into the trees, but the man was still twisting on the ground.  What’s wrong with him?  Val demanded, horrified.  Where’s Mance?    There.  Jon pointed.  Gone to fight.  The king led his ragged wedge into a knot of rangers, his sword flashing.   Gone? He can’t be gone, not now. It’s started.    The battle?  He watched the rangers scatter before Harma’s bloody dog’s head. The raiders screamed and hacked and chased the men in black back into the trees. But there were more men coming from the wood, a column of horse. Knights on heavy horse, Jon saw. Harma had to regroup and wheel to meet them, but half of her men had raced too far ahead.   The birth!  Val was shouting at him.  Trumpets were blowing all around, loud and brazen. The wildlings have no trumpets, only warhorns. They knew that as well as he did; the sound sent free folk running in confusion, some toward the fighting, others away. A mammoth was stomping through a flock of sheep that three men were trying to herd off west. The drums were beating as the wildlings ran to form squares and lines, but they were too late, too disorganized, too slow. The enemy was emerging from the forest, from the east, the northeast, the north; three great columns of heavy horse, all dark glinting steel and bright wool surcoats. Not the men of Eastwatch, those had been no more than a line of scouts. An army. The king? Jon was as confused as the wildlings. Could Robb have returned? Had the boy on the Iron Throne finally bestirred himself?  You best get back inside the tent,  he told Val.  Across the field one column had washed over Harma Dogshead. Another smashed into the flank of Tormund’s spearmen as he and his sons desperately tried to turn them. The giants were climbing onto their mammoths, though, and the knights on their barded horses did not like that at all; he could see how the coursers and destriers screamed and scattered at the sight of those lumbering mountains. But there was fear on the wildling side as well, hundreds of women and children rushing away from the battle, some of them blundering right under the hooves of garrons. He saw an old woman’s dog cart veer into the path of three chariots, to send them crashing into each other.   Gods,  Val whispered,  gods, why are they doing this?    Go inside the tent and stay with Dalla. It’s not safe out here.  It wouldn’t be a great deal safer inside, but she didn’t need to hear that.   I need to find the midwife,  Val said.   You’re the midwife. I’ll stay here until Mance comes back.  He had lost sight of Mance but now he found him again, cutting his way through a knot of mounted men. The mammoths had shattered the center column, but the other two were closing like pincers. On the eastern edge of the camps, some archers were loosing fire arrows at the tents. He saw a mammoth pluck a knight from his saddle and fling him forty feet with a flick of its trunk. Wildlings streamed past, women and children running from the battle, some with men hurrying them along. A few of them gave Jon dark looks but Longclaw was in his hand, and no one troubled him. Even Varamyr fled, crawling off on his hands and knees.  More and more men were pouring from the trees, not only knights now but freeriders and mounted bowmen and men-at-arms in jacks and kettle helms, dozens of men, hundreds of men. A blaze of banners flew above them. The wind was whipping them too wildly for Jon to see the sigils, but he glimpsed a seahorse, a field of birds, a ring of flowers. And yellow, so much yellow, yellow banners with a red device, whose arms were those?  East and north and northeast, he saw bands of wildlings trying to stand and fight, but the attackers rode right over them. The free folk still had the numbers, but the attackers had steel armor and heavy horses. In the thickest part of the fray, Jon saw Mance standing tall in his stirrups. His red-and-black cloak and raven-winged helm made him easy to pick out."
}