{
  "id": "7a7153300437e72b919d27399215d316338c83b3",
  "text": " He was  quite  hidden  in  its  boughs,  but  you  could  see  his  eyes  gleaming in the moon as he peeped out.  And Bilbo? He could not get into any tree, and was scuttling about from trunk  to trunk, like a rabbit that has lost its hole and has a dog after it.  \"You've left the burglar behind again}\" said Nori to Dori looking down.  \"I  can't  be  always  carrying  burglars  on  my  back,\"  said  Dori,  \"down  tunnels  and up trees! What do you think I am? A porter?\"  \"He'll be eaten if we don't 'do something,\" said Thorin, for there were howls all  around  them  now,  getting  nearer  and  nearer.  \"Dori!\"  he  called,  for  Dori  was  lowest down in the easiest tree, \"be quick, and give Mr. Baggins a hand up!\"  Dori was really a decent fellow in spite of his grumbling. Poor Bilbo could not  reach  his  hand  even  when  he  climbed  down  to  the  bottom  branch  and  hung  his  arm down as far as ever he could. So Dori actually climbed out of the tree and let  Bilbo scramble up and stand on his back.  Just  at  that  moment  the  wolves  trotted  howling  into  the  clearing.  All  of  a  sudden  there  were  hundreds  of  eyes  looking  at  them.  Still  Dori  did  not  let  Bilbo  down.  He  waited  till  he  had  clambered  off  his  shoulders  into  the  branches,  and  then he jumped for the branches himself. Only just in time! A wolf snapped- at his  cloak as he swung up, and nearly got him. In a minute there was a whole pack of  them yelping all round  the  tree and  leaping up at  the  trunk, with eyes blazing and  tongues hanging out.   ####-But  even  the  wild  Wargs  (for  so  the  evil  wolves  over  the  Edge  of  the  Wild  were named) cannot climb  trees. For a  time  they were  safe.  'Luckily  it was warm  and not windy. Trees are not very comfortable to sit in for long at any time; but in  the  cold  and  the wind, with wolves  all  round  below waiting  for  you,  they  can  be  perfectly miserable places.  This  glade  in  the  ring  of  trees  was  evidently  a  meeting-place  of  the  wolves.  More  and  more  kept  coming  in.  They  left  guards  at  the  foot  of  the  tree  in which  Dori  and  Bilbo  were,  and  then  went  sniffling  about  till  they  had  smelt  out  every  tree that had anyone in it. These they guarded too, while all the rest (hundreds and  hundreds  it  seemed) went  and  sat  in  a  great  circle  in  the  glade;  and  in the middle  of  the circle was a great grey wolf. He  spoke  to  them  in  the dreadful  language of  the  Wargs.  Gandalf  understood  it.  Bilbo  did  not,  but  it  sounded  terrible  to  him,  and  as  if  all  their  talk  was  about  cruel  and  wicked  things,  as  it  was.  Every  now  and then all the Wargs in the circle would answer their grey chief all together, and  their dreadful clamour almost made the hobbit fall out of his pine-tree.  I  will  tell  you  what  Gandalf  heard,  though  Bilbo  did  not  understand  it.  The  Wargs  and  the  goblins  often  helped  one  another  in wicked  deeds. Goblins  do  not  usually venture very  far  from  their mountains, unless  they  are driven out  and  are  looking  for  new  homes,  or  are marching  to  war  (which  I  am  glad  to  say  has  not  happened for a long while). But in those days they sometimes used to go on raids,  especially to get food or slaves to work for them. Then they often got the Wargs to  help  and  shared  the  plunder with  them. Sometimes  they  rode  on wolves  like men  do  on  horses.  Now  it  seemed  that  a  great  goblin-raid  had  been  planned  for  that  very  night.  The  Wargs  had  come  to  meet  the  goblins  and  the  goblins  were  late.  The  reason,  no  doubt,  was  the  death  of  the  Great  Goblin,  and  all  the  excitement  caused  by  the  dwarves  and  Bilbo  and  the  wizard,  for  whom  they  were  probably  still hunting.  In spite of  the dangers of  this  far  land bold men had of  late been making  their  way  back  into  it  from  the  South,  cutting  down  trees,  and  building  themselves  places to live in among the more pleasant woods in the valleys and along the river- shores. There were many of  them, and  they were brave and well-armed, and even  the Wargs dared not attack  them  if  there were many  together, or  in  the bright day.  But  now  they  had  planned with  the  goblins'  help  to  come  by  night  upon  some  of  the  villages nearest  the mountains.  If  their plan had been carried out,  there would  have been none  left  there next day;  all would have been killed  except  the  few  the  goblins kept from the wolves and carried back as prisoners to their caves.   ####-This was dreadful talk to listen to, not only because of the brave woodmen and  their  wives  and  children,  but  also  because  of  the  danger  which  now  threatened  Gandalf  and his  friends. The Wargs were  angry  and puzzled  at  finding  them here  in  their  very meeting-place. They  thought  they were  friends of  the woodmen, and  were  come  to  spy  on  them,  and  would  take  news  of  their  plans  down  into  the  valleys,  and  then  the  goblins  and  the wolves would  have  to  fight  a  terrible  battle  instead  of  capturing  prisoners  and  devouring  people  waked  suddenly  from  their  sleep."
}