{
  "id": "7ac742c19bead465b3069a134b3dbbe6a9db3c5b",
  "text": "   Catelyn was horrorstruck.  Darry was only a child.    Aye, and the last of his line as well. The boy would have brought a fine ransom, but what does gold mean to a frothing dog like Gregor Clegane? That beast’s head would make a noble gift for all the people of the realm, I vow.   Catelyn knew Ser Gregor’s evil reputation, yet still… Don’t speak to me of heads, Uncle. Cersei has mounted Ned’s on a spike above the walls of the Red Keep, and left it for the crows and flies.  Even now, it was hard for her to believe that he was truly gone. Some nights she would wake in darkness, half-asleep, and for an instant expect to find him there beside her.  Clegane is no more than Lord Tywin’s catspaw.  For Tywin Lannister—Lord of Casterly Rock, Warden of the West, father to Queen Cersei, Ser Jaime the Kingslayer, and Tyrion the Imp, and grandfather to Joffrey Baratheon, the new-crowned boy king—was the true danger, Catelyn believed.   True enough,  Ser Brynden admitted.  And Tywin Lannister is no man’s fool. He sits safe behind the walls of Harrenhal, feeding his host on our harvest and burning what he does not take. Gregor is not the only dog he’s loosed. Ser Amory Lorch is in the field as well, and some sellsword out of Qohor who’d sooner maim a man than kill him. I’ve seen what they leave behind them. Whole villages put to the torch, women raped and mutilated, butchered children left unburied to draw wolves and wild dogs… it would sicken even the dead.    When Edmure hears this, he will rage.    And that will be just as Lord Tywin desires. Even terror has its purpose, Cat. Lannister wants to provoke us to battle.    Robb is like to give him that wish,  Catelyn said, fretful.  He is restless as a cat sitting here, and Edmure and the Greatjon and the others will urge him on.  Her son had won two great victories, smashing Jaime Lannister in the Whispering Wood and routing his leaderless host outside the walls of Riverrun in the Battle of the Camps, but from the way some of his bannermen spoke of him, he might have been Aegon the Conqueror reborn.  Brynden Blackfish arched a bushy grey eyebrow.  More fool they. My first rule of war, Cat—never give the enemy his wish. Lord Tywin would like to fight on a field of his own choosing. He wants us to march on Harrenhal.    Harrenhal.  Every child of the Trident knew the tales told of Harrenhal, the vast fortress that King Harren the Black had raised beside the waters of Gods Eye three hundred years past, when the Seven Kingdoms had been seven kingdoms, and the riverlands were ruled by the ironmen from the islands. In his pride, Harren had desired the highest hall and tallest towers in all Westeros. Forty years it had taken, rising like a great shadow on the shore of the lake while Harren’s armies plundered his neighbors for stone, lumber, gold, and workers. Thousands of captives died in his quarries, chained to his sledges, or laboring on his five colossal towers. Men froze by winter and sweltered in summer. Weirwoods that had stood three thousand years were cut down for beams and rafters. Harren had beggared the riverlands and the Iron Islands alike to ornament his dream. And when at last Harrenhal stood complete, on the very day King Harren took up residence, Aegon the Conqueror had come ashore at King’s Landing.  Catelyn could remember hearing Old Nan tell the story to her own children, back at Winterfell.  And King Harren learned that thick walls and high towers are small use against dragons,  the tale always ended.  For dragons fly.  Harren and all his line had perished in the fires that engulfed his monstrous fortress, and every house that held Harrenhal since had come to misfortune. Strong it might be, but it was a dark place, and cursed.   I would not have Robb fight a battle in the shadow of that keep,  Catelyn admitted.  Yet we must do something, Uncle.    And soon,  her uncle agreed.  I have not told you the worst of it, child. The men I sent west have brought back word that a new host is gathering at Casterly Rock.   Another Lannister army. The thought made her ill.  Robb must be told at once. Who will command?    Ser Stafford Lannister, it’s said.  He turned to gaze out over the rivers, his red-and-blue cloak stirring in the breeze.   Another nephew?  The Lannisters of Casterly Rock were a damnably large and fertile house.   Cousin,  Ser Brynden corrected.  Brother to Lord Tywin’s late wife, so twice related. An old man and a bit of a dullard, but he has a son, Ser Daven, who is more formidable.    Then let us hope it is the father and not the son who takes this army into the field.    We have some time yet before we must face them. This lot will be sellswords, freeriders, and green boys from the stews of Lannisport. Ser Stafford must see that they are armed and drilled before he dare risk battle… and make no mistake, Lord Tywin is not the Kingslayer. He will not rush in heedless. He will wait patiently for Ser Stafford to march before he stirs from behind the walls of Harrenhal."
}