{
  "id": "7ae908a3c4b375d485de29e7edf7298fe21c544e",
  "text": "  \"The  summer  is  getting  on  down  below,\"  thought  Bilbo,  \"and  haymaking  is  going  on  and  picnics. They will  be  harvesting  and  blackberrying,  before we  even  begin to go down the other side at this rate.\" And the others were thinking equally  gloomy  thoughts,  although  when  they  had  said  good-bye  to  Elrond  in  the  high  hope  of  a  midsummer  morning,  they'  had  spoken  gaily  of  the  passage  of  the  mountains,  and  of  riding  swift  across  the  lands  beyond.  They  had  thought  of  coming  to  the  secret  door  in  the  Lonely  Mountain,  perhaps  that  very  next  first  moon  of  Autumn—\"  and  perhaps  it  will  be  Durin's  Day\"  they  had  said.  Only  Gandalf had  shaken his head  and  said nothing. Dwarves had not passed  that way  for  many  years,  but  Gandalf  had,  and  he  knew  how  evil  and  danger  had  grown  and  thriven  in  the Wild, since  the dragons had driven men from the lands, and the  goblins had spread  in secret after  the battle of  the Mines of Moria. Even  the good  plans  of  wise  wizards  like  Gandalf  and  of  good  friends  like  Elrond  go  astray  sometimes when  you  are  off  on  dangerous  adventures  over  the Edge  of  the Wild;  and Gandalf was a wise enough wizard to know it.   ####-He  knew  that  something  unexpected  might  happen,  and  he  hardly  dared  to  hope  that  they  would  pass  without  fearful  adventure  over  those  great  tall  mountains  with  lonely  peaks  and  valleys  where  no  king  ruled. They did not. All  was  well,  until  one  day  they  met  a  thunderstorm  -  more  than  a  thunderstorm,  a  thunder-battle.  You  know  how  terrific  a  really  big  thunderstorm  can  be  down  in  the  land  and  in  a  river-valley;  especially  at  times  when  two  great  thunderstorms  meet  and  clash. More  terrible  still  are  thunder  and  lightning  in  the  mountains  at  night,  when  storms  come  up  from  East  and  West  and  make  war.  The  lightning  splinters  on  the  peaks,  and  rocks  shiver,  and  great  crashes  split  the  air  and  go  rolling  and  tumbling  into  every  cave  and  hollow;  and  the  darkness  is  filled  with  overwhelming noise and sudden light.  Bilbo had never seen or imagined anything of the kind. They were high up in a  narrow place, with a dreadful fall into a dim valley at one side of them. There they  were  sheltering  under  a  hanging  rock  for  the  night,  and  he  lay  beneath  a  blanket  and  shook  from  head  to  toe. When  he  peeped  out  in  the  lightning-flashes, he saw  that  across  the  valley  the  stone-giants  were  out  and  were  hurling  rocks  at  one  another  for a. game, and catching  them, and  tossing  them down  into  the darkness  where  they  smashed among  the  trees  far below, or  splintered  into  little bits with a  bang.  Then  came  a  wind  and  a  rain,  and  the  wind  whipped  the  rain  and  the  hail  about  in  every  direction,  so  that  an  overhanging  rock  was  no  protection  at  all.  Soon  they were  getting  drenched  and  their  ponies were  standing with  their  heads  down  and  their  tails  between  their  legs,  and  some  of  them  were  whinnying  with  fright.  They  could  hear  the  giants  guffawing  and  shouting  all  over  the  mountainsides.  \"This won't  do  at  all!\"  said Thorin.  \"If we  don't  get  blown  off  or  drowned,  or  struck by lightning, we shall be picked up by some giant and kicked sky-high for a  football.\"  \"Well,  if  you  know  of  anywhere  better, take us there!\" said Gandalf, who was  feeling very grumpy, and was far from happy about the giants himself.  The  end of  their  argument was  that  they  sent Fill  and Kili  to  look  for  a better  shelter. They had very sharp eyes, and being the youngest of the dwarves by some  fifty  years  they  usually  got  these  sort  of  jobs  (when  everybody  could  see  that  it  was  absolutely  no  use  sending Bilbo). There  is  nothing  like  looking,  if  you want  to find something (or so Thorin said to the young dwarves). You certainly usually  find  something,  if  you  look,  but  it  is  not  always  quite  the  something  you  were  after. So it proved on this occasion.   ####-Soon  Fili  and  Kili  came  crawling  back,  holding  on  to  the  rocks  in  the  wind.  \"We have  found a dry cave,\"  they said, \"not  far  round  the next corner; and ponies  and all could get inside.\"  \"Have  you  thoroughly  explored  it?\"  said  the wizard, who  knew  that  caves  up  in the mountains were seldom unoccupied.  \"Yes,  yes!\"  they  said,  though  everybody  knew  they  could  not  have  been  long  about  it;  they had come back too quick. \"It isn't all that big, and it does not go far  back.\"  That,  of  course,  is  the  dangerous  part  about  caves:  you  don't  know  how  far  they  go  back,  sometimes,  or  where  a  passage  behind  may  lead  to,  or  what  is  waiting for you inside. But now Fili and Kill's news seemed good enough."
}