{
  "id": "7c518df0e69153331a189bd62530961a7e2e5bc2",
  "text": " She hated the villagers for their sheepishness, almost as much as she hated herself.  The Lannisters had taken everything: father, friends, home, hope, courage. One had taken Needle, while another had broken her wooden stick sword over his knee. They had even taken her stupid secret. The storehouse had been big enough for her to creep off and make her water in some corner when no one was looking, but it was different on the road. She held it as long as she could, but finally she had to squat by a bush and skin down her breeches in front of all of them. It was that or wet herself. Hot Pie gaped at her with big moon eyes, but no one else even troubled to look. Girl sheep or boy sheep, Ser Gregor and his men did not seem to care.  Their captors permitted no chatter. A broken lip taught Arya to hold her tongue. Others never learned at all. One boy of three would not stop calling for his father, so they smashed his face in with a spiked mace. Then the boy’s mother started screaming and Raff the Sweetling killed her as well.  Arya watched them die and did nothing. What good did it do you to be brave? One of the women picked for questioning had tried to be brave, but she had died screaming like all the rest. There were no brave people on that march, only scared and hungry ones. Most were women and children. The few men were very old or very young; the rest had been chained to that gibbet and left for the wolves and the crows. Gendry was only spared because he’d admitted to forging the horned helm himself; smiths, even apprentice smiths, were too valuable to kill.  They were being taken to serve Lord Tywin Lannister at Harrenhal, the Mountain told them.  You’re traitors and rebels, so thank your gods that Lord Tywin’s giving you this chance. It’s more than you’d get from the outlaws. Obey, serve, and live.    It’s not just, it’s not,  she heard one wizened old woman complain to another when they had bedded down for the night.  We never did no treason, the others come in and took what they wanted, same as this bunch.    Lord Beric did us no hurt, though,  her friend whispered.  And that red priest with him, he paid for all they took.    Paid? He took two of my chickens and gave me a bit of paper with a mark on it. Can I eat a bit of raggy old paper, I ask you? Will it give me eggs?  She looked about to see that no guards were near, and spat three times.  There’s for the Tullys and there’s for the Lannisters and there’s for the Starks.    It’s a sin and a shame,  an old man hissed.  When the old king was still alive, he’d not have stood for this.    King Robert?  Arya asked, forgetting herself.   King Aerys, gods grace him,  the old man said, too loudly. A guard came sauntering over to shut them up. The old man lost both his teeth, and there was no more talk that night.  Besides his captives, Ser Gregor was bringing back a dozen pigs, a cage of chickens, a scrawny milk cow, and nine wagons of salt fish. The Mountain and his men had horses, but the captives were all afoot, and those too weak to keep up were killed out of hand, along with anyone foolish enough to flee. The guards took women off into the bushes at night, and most seemed to expect it and went along meekly enough. One girl, prettier than the others, was made to go with four or five different men every night, until finally she hit one with a rock. Ser Gregor made everyone watch while he took off her head with a sweep of his massive two-handed greatsword.  Leave the body for the wolves,  he commanded when the deed was done, handing the sword to his squire to be cleaned.  Arya glanced sidelong at Needle, sheathed at the hip of a black-bearded, balding man-at-arms called Polliver. It’s good that they took it away, she thought. Otherwise she would have tried to stab Ser Gregor, and he would have cut her right in half, and the wolves would eat her too.  Polliver was not so bad as some of the others, even though he’d stolen Needle. The night she was caught, the Lannister men had been nameless strangers with faces as alike as their nasal helms, but she’d come to know them all. You had to know who was lazy and who was cruel, who was smart and who was stupid. You had to learn that even though the one they called Shitmouth had the foulest tongue she’d ever heard, he’d give you an extra piece of bread if you asked, while jolly old Chiswyck and soft-spoken Raff would just give you the back of their hand.  Arya watched and listened and polished her hates the way Gendry had once polished his horned helm. Dunsen wore those bull’s horns now, and she hated him for it. She hated Polliver for Needle, and she hated old Chiswyck who thought he was funny. And Raff the Sweetling, who’d driven his spear through Lommy’s throat, she hated even more. She hated Ser Amory Lorch for Yoren, and she hated Ser Meryn Trant for Syrio, the Hound for killing the butcher’s boy Mycah, and Ser Ilyn and Prince Joffrey and the queen for the sake of her father and Fat Tom and Desmond and the rest, and even for Lady, Sansa’s wolf."
}