{
  "id": "7cae1a244a276b8575228f69ccfcd8b656fb8def",
  "text": "    Is it true he tried to raise Dorne for Viserys?    No one speaks of it, but yes. Ravens flew and riders rode, with what secret messages I never knew. Jon Arryn sailed to Sunspear to return Prince Lewyn’s bones, sat down with Prince Doran, and ended all the talk of war. But Robert never went to Dorne thereafter, and Prince Oberyn seldom left it.    Well, he’s here now, with half the nobility of Dorne in his tail, and he grows more impatient every day,  said Tyrion.  Perhaps I should show him the brothels of King’s Landing, that might distract him. A tool for every task, isn’t that how it works? My tool is yours, Father. Never let it be said that House Lannister blew its trumpets and I did not respond.   Lord Tywin’s mouth tightened.  Very droll. Shall I have them sew you a suit of motley, and a little hat with bells on it?    If I wear it, do I have leave to say anything I want about His Grace King Joffrey?   Lord Tywin seated himself again and said,  I was made to suffer my father’s follies. I will not suffer yours. Enough.    Very well, as you ask so pleasantly. The Red Viper is not going to be pleasant, I fear… nor will he content himself with Ser Gregor’s head alone.    All the more reason not to give it to him.    Not to…?  Tyrion was shocked.  I thought we were agreed that the woods were full of beasts.    Lesser beasts.  Lord Tywin’s fingers laced together under his chin.  Ser Gregor has served us well. No other knight in the realm inspires such terror in our enemies.    Oberyn knows that Gregor was the one who…    He knows nothing. He has heard tales. Stable gossip and kitchen calumnies. He has no crumb of proof. Ser Gregor is certainly not about to confess to him. I mean to keep him well away for so long as the Dornishmen are in King’s Landing.    And when Oberyn demands the justice he’s come for?    I will tell him that Ser Amory Lorch killed Elia and her children,  Lord Tywin said calmly.  So will you, if he asks.    Ser Amory Lorch is dead,  Tyrion said flatly.   Precisely. Vargo Hoat had Ser Amory torn apart by a bear after the fall of Harrenhal. That ought to be sufficiently grisly to appease even Oberyn Martell.    You may call that justice…    It is justice. It was Ser Amory who brought me the girl’s body, if you must know. He found her hiding under her father’s bed, as if she believed Rhaegar could still protect her. Princess Elia and the babe were in the nursery a floor below.    Well, it’s a tale, and Ser Amory’s not like to deny it. What will you tell Oberyn when he asks who gave Lorch his orders?    Ser Amory acted on his own in the hope of winning favor from the new king. Robert’s hatred for Rhaegar was scarcely a secret.   It might serve, Tyrion had to concede, but the snake will not be happy.  Far be it from me to question your cunning, Father, but in your place I do believe I’d have let Robert Baratheon bloody his own hands.   Lord Tywin stared at him as if he had lost his wits.  You deserve that motley, then. We had come late to Robert’s cause. It was necessary to demonstrate our loyalty. When I laid those bodies before the throne, no man could doubt that we had forsaken House Targaryen forever. And Robert’s relief was palpable. As stupid as he was, even he knew that Rhaegar’s children had to die if his throne was ever to be secure. Yet he saw himself as a hero, and heroes do not kill children.  His father shrugged.  I grant you, it was done too brutally. Elia need not have been harmed at all, that was sheer folly. By herself she was nothing.    Then why did the Mountain kill her?    Because I did not tell him to spare her. I doubt I mentioned her at all. I had more pressing concerns. Ned Stark’s van was rushing south from the Trident, and I feared it might come to swords between us. And it was in Aerys to murder Jaime, with no more cause than spite. That was the thing I feared most. That, and what Jaime himself might do.  He closed a fist.  Nor did I yet grasp what I had in Gregor Clegane, only that he was huge and terrible in battle. The rape… even you will not accuse me of giving that command, I would hope. Ser Amory was almost as bestial with Rhaenys. I asked him afterward why it had required half a hundred thrusts to kill a girl of… two? Three? He said she’d kicked him and would not stop screaming. If Lorch had half the wits the gods gave a turnip, he would have calmed her with a few sweet words and used a soft silk pillow.  His mouth twisted in distaste.  The blood was in him.   But not in you, Father. There is no blood in Tywin Lannister.  Was it a soft silk pillow that slew Robb Stark?    It was to be an arrow, at Edmure Tully’s wedding feast. The boy was too wary in the field. He kept his men in good order, and surrounded himself with outriders and bodyguards.    So Lord Walder slew him under his own roof, at his own table?  Tyrion made a fist.  What of Lady Catelyn?    Slain as well, I’d say. A pair of wolfskins. Frey had intended to keep her captive, but perhaps something went awry."
}