{
  "id": "7ef4718ae4d9acec09bdf2baa33fe80f0e1f45f2",
  "text": "  This had to be Charlie, who worked with dragons in Romania.  Charlie was built like the twins, shorter and stockier than Percy and Ron, who were both long and lanky.  He had a broad, good-natured face, which was weather-beaten and so freckly that he looked almost tanned; his arms were muscular, and one of them had a large, shiny burn on it. Bill got to his feet, smiling, and also shook Harry's hand.  Bill came as something of a surprise.  Harry knew that he worked for the wizarding bank, Gringotts, and that Bill had been Head Boy at Hogwarts; Harry had always imagined Bill to be an older version of Percy:  fussy about rule-breaking and fond of bossing everyone around.  However, Bill was - there was no other word for it - cool.  He was tall, with long hair that he had tied back in a ponytail.  He was wearing an earring with what looked like a fang dangling from it.  Bill's clothes would not have looked out of place at a rock concert, except that Harry recognized his boots to be made, not of leather, but of dragon hide. Before any of them could say anything else, there was a faint popping noise, and Mr. Weasley appeared out of thin air at George's shoulder.  He was looking angrier than Harry had ever seen him. \"That wasn't funny Fred!\" he shouted. \"What on earth did you give that Muggle boy?\" \"I didn't give him anything,\" said Fred, with another evil grin.  I just dropped it.... It was his fault he went and ate it, I never told him to.\" \"You dropped it on purpose!\" roared Mr. Weasley.  \"You knew he'd eat it, you knew he was on a diet -\" \"How big did his tongue get?\" George asked eagerly. \"It was four feet long before his parents would let me shrink it!\" Harry and the Weasleys roared with laughter again. \"It isn't funny!\" Mr. Weasley shouted.  \"That sort of behavior seriously undermines wizard-Muggle relations!  I spend half my life campaigning against the mistreatment of Muggles, and my own sons \"We didn't give it to him because he's a Muggle!\" said Fred indignantly. \"No, we gave it to him because he's a great bullying git,\" said George.  \"Isn't he, Harry?\" \"Yeah, he is, Mr. Weasley,\" said Harry earnestly. \"That's not the point!\" raged Mr. Weasley.  \"You wait until I tell your mother -\" \"Tell me what?\" said a voice behind them. Mrs. Weasley had just entered the kitchen.  She was a short, plump woman with a very kind face, though her eyes were presently narrowed with suspicion. \"Oh hello, Harry, dear,\" she said, spotting him and smiling.  Then her eyes snapped back to her husband. \"Tell me what, Arthur?\" Mr. Weasley hesitated.  Harry could tell that, however angry he was with Fred and George, he hadn't really intended to tell Mrs. Weasley what had happened.  There was a silence, while Mr. Weasley eyed his wife nervously.  Then two girls appeared in the kitchen doorway behind Mrs. Weasley.  One, with very bushy brown hair and rather large front teeth, was Harry's and Ron's friend, Hermione Granger.  The other, who was small and red-haired, was Ron's younger sister, Ginny. Both of them smiled at Harry, who grinned back, which made Ginny go scarlet - she had been very taken with Harry ever since his first visit to the Burrow. \"Tell me what, Arthur?\"  Mrs. Weasley repeated, in a dangerous sort of voice. \"It's nothing, Molly,\" mumbled Mr. Weasley, \"Fred and George just - but I've had words with them -\" \"What have they done this time?\" said Mrs. Weasley.  \"If it's got anything to do with Weasleys' Wizard Wheezes -\" \"Why don't you show Harry where he's sleeping, Ron?\" said Hermione from the doorway. \"He knows where he's sleeping,\" said Ron, \"in my room, he slept there last -\" \"We can all go,\" said Hermione pointedly. \"Oh,\" said Ron, cottoning on.  \"Right.\" \"Yeah, we'll come too,\" said George. \"You stay where you are!\" snarled Mrs. Weasley. Harry and Ron edged out of the kitchen, and they, Hermione, and Ginny set off along the narrow hallway and up the rickety staircase that zigzagged through the house to the upper stories. \"What are Weasleys' Wizard Wheezes?\" Harry asked as they climbed. Ron and Ginny both laughed, although Hermione didn't. \"Mum found this stack of order forms when she was cleaning Fred and George's room,\" said Ron quietly.  \"Great long price lists for stuff they've invented.  Joke stuff, you know.  Fake wands and trick sweets, loads of stuff.  It was brilliant, I never knew they'd been inventing all that . . .\" \"We've been hearing explosions out of their room for ages, but we never thought they were actually making things,\" said Ginny.  \"We thought they just liked the noise.\" \"Only, most of the stuff - well, all of it, really - was a bit dangerous,\" said Ron, \"and, you know, they were planning to sell it at Hogwarts to make some money, and Mum went mad at them.  Told them they weren't allowed to make any more of it, and burned all the order forms.... She's furious at them anyway.  They didn't get as many O.W.L.s as she expected.\" O.W.L.s were Ordinary Wizarding Levels, the examinations Hogwarts students took at the age of fifteen."
}