{
  "id": "81b3ca71f27a493d37c40154ae39e5612820006c",
  "text": " Yet it  is  a great  gift. There  is none like  to Shadowfax. In him  one of  the mighty  steeds of old  has returned. None  such shall  return again. And  to you  my  other guests I  will offer such things as may be found in my armoury. Swords  you  do  not need,  but there  are helms and coats  of mail of cunning work,   ####-gifts to my fathers out of Gondor. Choose from these ere we go, and may they  serve you well!'       Now men came bearing  raiment  of  war from  the  king's hoard and they  arrayed Aragorn and Legolas in shining mail. Helms too they chose, and round  shields: their bosses were  overlaid with gold and set with gems,  green and  red  and white.  Gandalf took no armour; and Gimli needed no coat of  rings,  even if one had been found to match his stature, for there was no hauberk in  the hoards of Edoras  of  better make than his short corslet forged  beneath  the Mountain  in the North.  But he  chose a  cap of iron  and leather  that  fitted well upon his  round head; and  a small  shield he also took. It bore  the  running  horse,  white upon green, that was the emblem of  the House of  Eorl.       'May it keep you well!' said Thjoden.  'It was made for me in Thengel's  day, while still I was a boy.'       Gimli bowed.  'I am proud, Lord  of the Mark, to bear your  device,' he  said. 'Indeed  sooner would I bear a  horse than be borne by one. I  love my  feet better. But, maybe, I shall come yet where I can stand and fight.'       'It may well be so,' said Thjoden.       The king now rose, and at once Jowyn came forward bearing wine.  'Ferthu  Thjoden hbl!' she  said. 'Receive  now this  cup  and drink  in happy  hour.  Health be with thee at thy going and coming!'       Thjoden drank from the cup, and she then proffered it to the guests. As  she stood before  Aragorn she paused suddenly and  looked  upon him, and her  eyes were shining. And he  looked down upon her fair face and smiled; but as  he took the cup, his hand  met hers,  and he knew  that she trembled at  the  touch. 'Hail  Aragorn son of Arathorn!' she said. 'Hail Lady of  Rohan!'  he  answered, but his face now was troubled and he did not smile.       When  they had  all drunk, the king went  down  the hall to  the doors.   There  the  guards awaited him, and  heralds  stood, and all  the  lords and  chiefs were gathered together that remained in Edoras or dwelt nearby.       'Behold! I  go forth, and  it  seems like to be  my last riding,'  said  Thjoden. 'I have  no  child. Thjodred  my  son  is  slain.  I name Jomer  my  sister -son to be my heir. If neither of us return, then choose a new lord as  you will. But to some one I must now entrust my people that I  leave behind,   to rule them in my place. Which of you will stay?'       No man spoke.       'Is there none whom you would name? In whom do my people trust?'   ####-     'In the House of Eorl,' answered Hbma.       'But Jomer I cannot spare, nor  would he stay,'  said the king; 'and he  is the last of that House.'       'I  said not Jomer,'  answered Hbma. 'And he is not the  last. There is  Jowyn, daughter of Jomund, his sister. She is fearless and high-hearted. All  love her. Let her be as lord to the Eorlingas, while we are gone.'       'It shall be so,' said Thjoden. 'Let the heralds  announce to  the folk   that the Lady Jowyn will lead them!'       Then the king sat upon a seat before his doors, and  Jowyn knelt before  him   and  received  from   him  a  sword  and  a  fair  corslet.  'Farewell  sister -daughter!' he said. 'Dark is the hour, yet maybe we shall  return  to  the Golden Hall. But in Dunharrow the people may long defend themselves,  and  if the battle go ill, thither will come all who escape.' 'Speak not so!' she  answered.  'A  year shall I endure  for every  day  that passes  until  your  return.' But as she spoke her eyes went to Aragorn who stood nearby.       'The king shall come again,' he said.  'Fear not! Not West but East does  our doom await us.'       The  king now went down  the stair  with Gandalf beside him. The others  followed. Aragorn looked back  as they  passed towards the gate. Alone Jowyn  stood before the  doors of the house at the stair's head; the  sword was set  upright before her, and her hands were laid upon the hilt. She was  clad now  in mail and shone like silver in the sun.       Gimli walked with Legolas. his axe on his  shoulder. 'Well, at last  we  set off!' he said. 'Men need many words before deeds. My  axe is restless in  my  hands.  Though I doubt not that these Rohirrim are fell -handed when they  come  to it. Nonetheless this is not the warfare  that suits me. How shall I  come to  the battle?  I  wish  I  could  walk and  not  bump like a sack  at  Gandalf's saddlebow.'       'A safer seat than many, I guess,' said Legolas. 'Yet doubtless Gandalf  will  gladly put you  down  on  your  feet  when  blows  begin; or Shadowfax  himself. An axe is no weapon for a rider.'       'And a Dwarf is no horseman. It is orc-necks I would hew, not shave the  scalps of Men,' said Gimli, patting the haft of his axe."
}