{
  "id": "86a13df1193dd06a4634d2fe31bee1fdbf055e28",
  "text": "  Malfoy was gloating at every possible opportunity. \"Missing your half-breed pal?\" he kept whispering to Harry whenever there was a teacher around, so that he was safe from Harry's retaliation. \"Missing the elephant-man?\" There was a Hogsmeade visit halfway through January.  Hermione was very surprised that Harry was going to go. \"I just thought you'd want to take advantage of the common room being quiet,\" she said. \"Really get to work on that egg.\" \"Oh I - I reckon I've got a pretty good idea what it's about now,\" Harry lied. \"Have you really?\"  said Hermione, looking impressed.  \"Well done!\" Harrys insides gave a guilty squirm, but he ignored them.  He still had five weeks to work out that egg clue, after all, and that was ages. . . whereas if he went into Hogsmeade, he might run into Hagrid, and get a chance to persuade him to come back. He, Ron, and Hermione left the castle together on Saturday and set off through the cold, wet grounds toward the gates.  As they passed the Durmstrang ship moored in the lake, they saw Viktor Krum emerge onto the deck, dressed in nothing but swimming trunks.  He was very skinny indeed, but apparently a lot tougher than he looked, because he climbed up onto the side of the ship, stretched out his arms, and dived, right into the lake. \"He's mad!\"  said Harry, staring at Krums dark head as it bobbed out into the middle of the lake.  \"It must be freezing, it's January!\" \"It's a lot colder where he comes from,\" said Hermione.  \"I suppose it feels quite warm to him.\" \"Yeah, but there's still the giant squid,\" said Ron.  He didn't sound anxious - if anything, he sounded hopeful.  Hermione noticed his tone of voice and frowned. \"He's really nice, you know,\" she said.  \"He's not at all like you'd think, coming from Durmstrang.  He likes it much better here, he told me.\" Ron said nothing.  He hadn't mentioned Viktor Krum since the ball, but Harry had found a miniature arm under his bed on Boxing Day, which had looked very much as though it had been snapped off a small model figure wearing Bulgarian Quidditch robes. Harry kept his eyes skinned for a sign of Hagrid all the way down the slushy High Street, and suggested a visit to the Three Broomsticks once he had ascertained that Hagrid was not in any of the shops. The pub was as crowded as ever, but one quick look around at all the tables told Harry that Hagrid wasn't there.  Heart sinking, he went up to the bar with Ron and Hermione, ordered three butterbeers from Madam Rosmerta, and thought gloomily that he might just as well have stayed behind and listened to the egg wailing after all. \"Doesn't he ever go into the office?\" Hermione whispered suddenly. \"Look!\" She pointed into the mirror behind the bar, and Harry saw Ludo Bagman reflected there, sitting in a shadowy corner with a bunch of goblins.  Bagman was talking very fast in a low voice to the goblins, all of whom had their arms crossed and were looking rather menacing. It was indeed odd. Harry thought, that Bagman was here at the Three Broomsticks on a weekend when there was no Triwizard event, and therefore no judging to be done.  He watched Bagman in the mirror.  He was looking strained again, quite as strained as he had that night in the forest before the Dark Mark had appeared.  But just then Bagman glanced over at the bar, saw Harry, and stood up. \"In a moment, in a moment!\"  Harry heard him say brusquely to the goblins, and Bagman hurried through the pub toward Harry, his boyish grin back in place. \"Harry!\" he said. \"How are you? Been hoping to run into you! Everything going all right?\" \"Fine, thanks,\" said Harry. \"Wonder if I could have a quick, private word, Harry?\"  said Bagman eagerly.  \"You couldn't give us a moment, you two, could you?\" \"Er - okay,\" said Ron, and he and Hermione went off to find a table. Bagman led Harry along the bar to the end furthest from Madam Rosmerta. \"Well, I just thought I'd congratulate you again on your splendid performance against that Horntail, Harry,\" said Bagman. \"Really superb.\" \"Thanks,\" said Harry, but he knew this couldn't be all that Bagman wanted to say, because he could have congratulated Harry in front of Ron and Hermione.  Bagman didn't seem in any particular rush to spill the beans, though. Harry saw him glance into the mirror over the bar at the goblins, who were all watching him and Harry in silence through their dark, slanting eyes. \"Absolute nightmare,\" said Bagman to Harry in an undertone, noticing Harry watching the goblins too.  \"Their English isn't too good . . . it's like being back with all the Bulgarians at the Quidditch World Cup . . . but at least they used sign language another human could recognize.  This lot keep gabbling in Gobblede-gook . . . and I only know one word of Gobbledegook.  Bladvak.  It means 'pickax.'  I don't like to use it in case they think I'm threatening them.\" He gave a short, booming laugh. \"What do they want?\" Harry said, noticing how the goblins were still watching Bagman very closely."
}