{
  "id": "8701687df655f82804e550f9411610bc0115c7a1",
  "text": "  Aye. Safer apart. But where to take them? I’d thought, might be these Cerwyns…   Maester Luwin shook his head, though it was plain to see what the effort cost him.  Cerwyn boy’s dead. Ser Rodrik, Leobald Tallhart, Lady Hornwood… all slain. Deepwood fallen, Moat Cailin, soon Torrhen’s Square. Ironmen on the Stony Shore. And east, the Bastard of Bolton.    Then where?  asked Osha.   White Harbor… the Umbers… I do not know… war everywhere… each man against his neighbor, and winter coming… such folly, such black mad folly…  Maester Luwin reached up and grasped Bran’s forearm, his fingers closing with a desperate strength.  You must be strong now. Strong.    I will be,  Bran said, though it was hard. Ser Rodrik killed and Maester Luwin, everyone, everyone…   Good,  the maester said.  A good boy. Your… your father’s son, Bran. Now go.   Osha gazed up at the weirwood, at the red face carved in the pale trunk.  And leave you for the gods?    I beg…  The maester swallowed.  A… a drink of water, and… another boon. If you would…    Aye.  She turned to Meera.  Take the boys.   Jojen and Meera led Rickon out between them. Hodor followed. Low branches whipped at Bran’s face as they pushed between the trees, and the leaves brushed away his tears. Osha joined them in the yard a few moments later. She said no word of Maester Luwin.  Hodor must stay with Bran, to be his legs,  the wildling woman said briskly.  I will take Rickon with me.    We’ll go with Bran,  said Jojen Reed.   Aye, I thought you might,  said Osha.  Believe I’ll try the East Gate, and follow the kingsroad a ways.    We’ll take the Hunter’s Gate,  said Meera.   Hodor,  said Hodor.  They stopped at the kitchens first. Osha found some loaves of burned bread that were still edible, and even a cold roast fowl that she ripped in half. Meera unearthed a crock of honey and a big sack of apples. Outside, they made their farewells. Rickon sobbed and clung to Hodor’s leg until Osha gave him a smack with the butt end of her spear. Then he followed her quick enough. Shaggydog stalked after them. The last Bran saw of them was the direwolf’s tail as it vanished behind the broken tower.  The iron portcullis that closed the Hunter’s Gate had been warped so badly by heat it could not be raised more than a foot. They had to squeeze beneath its spikes, one by one.   Will we go to your lord father?  Bran asked as they crossed the drawbridge between the walls.  To Greywater Watch?   Meera looked to her brother for the answer.  Our road is north,  Jojen announced.  At the edge of the wolfswood, Bran turned in his basket for one last glimpse of the castle that had been his life. Wisps of smoke still rose into the grey sky, but no more than might have risen from Winterfell’s chimneys on a cold autumn afternoon. Soot stains marked some of the arrow loops, and here and there a crack or a missing merlon could be seen in the curtain wall, but it seemed little enough from this distance. Beyond, the tops of the keeps and towers still stood as they had for hundreds of years, and it was hard to tell that the castle had been sacked and burned at all. The stone is strong, Bran told himself, the roots of the trees go deep, and under the ground the Kings of Winter sit their thrones. So long as those remained, Winterfell remained. It was not dead, just broken. Like me, he thought. I’m not dead either.      APPENDIX  THE KINGS AND THEIR COURTS      THE KING ON THE IRON THRONE  JOFFREY BARATHEON, the First of His Name, a boy of thirteen years, the eldest son of King Robert I Baratheon and Queen Cersei of House Lannister,  —his mother, QUEEN CERSEI, Queen Regent and Protector of the Realm,  —his sister, PRINCESS MYRCELLA, a girl of nine,  —his brother, PRINCE TOMMEN, a boy of eight, heir to the Iron Throne,  —his uncles, on his father’s side:    —STANNIS BARATHEON, Lord of Dragonstone, styling himself King Stannis the First,  —RENLY BARATHEON, Lord of Storm’s End, styling himself King Renly the First,    —his uncles, on his mother’s side:    —SER JAIME LANNISTER, the Kingslayer, Lord Commander of the Kingsguard, a captive at Riverrun,  —TYRION LANNISTER, acting Hand of the King,    —Tyrion’s squire, PODRICK PAYNE,  —Tyrion’s guards and sworn swords:      —BRONN, a sellsword, black of hair and heart,  —SHAGGA SON OF DOLF, of the Stone Crows,  —TIMETT SON OF TIMETT, of the Burned Men,  —CHELLA DAUGHTER OF CHEYK, of the Black Ears,  —CRAWN SON OF CALOR, of the Moon Brothers,      —Tyrion’s concubine, SHAE, a camp follower, eighteen,      —his small council:    —GRAND MAESTER PYCELLE,  —LORD PETYR BAELISH, called LITTLEFINGER, master of coin,  —LORD JANOS SLYNT, Commander of the City Watch of King’s Landing (the  gold cloaks ),  —VARYS, a eunuch, called the SPIDER, master of whisperers,      —his Kingsguard:    —SER JAIME LANNISTER, called the KINGSLAYER, Lord Commander, a captive at Riverrun,  —SANDOR CLEGANE, called the HOUND,  —SER BOROS BLOUNT,  —SER MERYN TRANT,  —SER ARYS OAKHEART,  —SER PRESTON GREENFIELD,  —SER MANDON MOORE,      —his court and retainers:    —SER ILYN PAYNE, the King’s justice, a headsman,  —VYLARR, captain of the Lannister household guards at King’s Landing (the  red cloaks ),  —SER LANCEL LANNISTER, formerly squire to King Robert, recently knighted,  —TYREK LANNISTER, formerly squire to King Robert,  —SER ARON SANTAGAR, master-at-arms,  —SER BALON SWANN, second son to Lord Gulian Swann of Stonehelm,  —LADY ERMESANDE HAYFORD, a babe at the breast,  —SER DONTOS HOLLARD, called the RED, a drunk,  —JALABHAR XHO, an exiled prince from the Summer Isles,  —MOON BOY, a jester and fool,  —LADY TANDA STOKEWORTH,      —FALYSE, her elder daughter,  —LOLLYS, her younger daughter, a maiden of thirty-three years,      —LORD GYLES ROSBY,  —SER HORAS REDWYNE and his twin SER HOBBER REDWYNE, sons of the Lord of the Arbor,      —the people of King’s Landing:    —the City Watch (the  gold cloaks ):      —JANOS SLYNT, Lord of Harrenhal, Lord Commander,      —MORROS, his eldest son and heir,      —ALLAR DEEM, Slynt’s chief sergeant,  —SER JACELYN BYWATER, called IRONHAND, captain of the River Gate,      —HALLYNE THE PYROMANCER, a Wisdom of the Guild of Alchemists,  —CHATAYA, owner of an expensive brothel,      —ALAYAYA, DANCY, MAREI, some of her girls,      —TOBHO MOTT, a master armorer,  —SALLOREON, a master armorer,  —IRONBELLY, a blacksmith,  —LOTHAR BRUNE, a freerider,  —SER OSMUND KETTLEBLACK, a hedge knight of unsavory reputation,      —OSFRYD and OSNEY KETTLEBLACK, his brothers,      —SYMON SILVER TONGUE, a singer."
}