{
  "id": "88a131555ab557c975a532e65ba6b85f75761533",
  "text": " As she rose, a stab of pain went through her legs and brought it all back. Tears filled her eyes. Someone had laid out a robe for her beside the bed. Sansa slipped it on and opened the door. Outside stood a hard-faced woman with leathery brown skin, three necklaces looped about her scrawny neck. One was gold and one was silver and one was made of human ears.  Where does she think she’s going?  the woman asked, leaning on a tall spear.   The godswood.  She had to find Ser Dontos, beg him to take her home now before it was too late.   The halfman said you’re not to leave,  the woman said.  Pray here, the gods will hear.   Meekly, Sansa dropped her eyes and retreated back inside. She realized suddenly why this place seemed so familiar. They’ve put me in Arya’s old bedchamber, from when Father was the Hand of the King. All her things are gone and the furnishings have been moved around, but it’s the same…  A short time later, a serving girl brought a platter of cheese and bread and olives, with a flagon of cold water.  Take it away,  Sansa commanded, but the girl left the food on a table. She was thirsty, she realized. Every step sent knives through her thighs, but she made herself cross the room. She drank two cups of water, and was nibbling on an olive when the knock came.  Anxiously, she turned toward the door, smoothed down the folds of her robe.  Yes?   The door opened, and Tyrion Lannister stepped inside.  My lady. I trust I am not disturbing you?    Am I your prisoner?    My guest.  He was wearing his chain of office, a necklace of linked golden hands.  I thought we might talk.    As my lord commands.  Sansa found it hard not to stare; his face was so ugly it held a queer fascination for her.   The food and garments are to your satisfaction?  he asked.  If there is anything else you need, you have only to ask.    You are most kind. And this morning… it was very good of you to help me.    You have a right to know why Joffrey was so wroth. Six nights gone, your brother fell upon my uncle Stafford, encamped with his host at a village called Oxcross not three days ride from Casterly Rock. Your northerners won a crushing victory. We received word only this morning.   Robb will kill you all, she thought, exulting.  It’s… terrible, my lord. My brother is a vile traitor.   The dwarf smiled wanly.  Well, he’s no fawn, he’s made that clear enough.    Ser Lancel said Robb led an army of wargs…   The Imp gave a disdainful bark of laughter.  Ser Lancel’s a wineskin warrior who wouldn’t know a warg from a wart. Your brother had his direwolf with him, but I suspect that’s as far as it went. The northmen crept into my uncle’s camp and cut his horse lines, and Lord Stark sent his wolf among them. Even war-trained destriers went mad. Knights were trampled to death in their pavilions, and the rabble woke in terror and fled, casting aside their weapons to run the faster. Ser Stafford was slain as he chased after a horse. Lord Rickard Karstark drove a lance through his chest. Ser Rubert Brax is also dead, along with Ser Lymond Vikary, Lord Crakehall, and Lord Jast. Half a hundred more have been taken captive, including Jast’s sons and my nephew Martyn Lannister. Those who survived are spreading wild tales and swearing that the old gods of the north march with your brother.    Then… there was no sorcery?   Lannister snorted.  Sorcery is the sauce fools spoon over failure to hide the flavor of their own incompetence. My mutton-headed uncle had not even troubled to post sentries, it would seem. His host was raw—apprentice boys, miners, fieldhands, fisherfolk, the sweepings of Lannisport. The only mystery is how your brother reached him. Our forces still hold the stronghold at the Golden Tooth, and they swear he did not pass.  The dwarf gave an irritated shrug.  Well, Robb Stark is my father’s bane. Joffrey is mine. Tell me, what do you feel for my kingly nephew?    I love him with all my heart,  Sansa said at once.   Truly?  He did not sound convinced.  Even now?    My love for His Grace is greater than it has ever been.   The Imp laughed aloud.  Well, someone has taught you to lie well. You may be grateful for that one day, child. You are a child still, are you not? Or have you flowered?   Sansa blushed. It was a rude question, but the shame of being stripped before half the castle made it seem like nothing.  No, my lord.    That’s all to the good. If it gives you any solace, I do not intend that you ever wed Joffrey. No marriage will reconcile Stark and Lannister after all that has happened, I fear. More’s the pity. The match was one of King Robert’s better notions, if Joffrey hadn’t mucked it up.   She knew she ought to say something, but the words caught in her throat.   You grow very quiet,  Tyrion Lannister observed.  Is this what you want? An end to your betrothal?    I…  Sansa did not know what to say. Is it a trick? Will he punish me if I tell the truth? She stared at the dwarf’s brutal bulging brow, the hard black eye and the shrewd green one, the crooked teeth and wiry beard."
}