{
  "id": "8a4c7f8bb31c03c4019fcadad3b58d2dae1de59c",
  "text": "  A striding huntsman had been worked in scarlet thread upon the breast of the fat boy’s fur-trimmed surcoat. Jon did not recognize the sigil. Ser Alliser Thorne looked over his new charge and said,  It would seem they have run short of poachers and thieves down south. Now they send us pigs to man the Wall. Is fur and velvet your notion of armor, my Lord of Ham?   It was soon revealed that the new recruit had brought his own armor with him; padded doublet, boiled leather, mail and plate and helm, even a great wood-and-leather shield blazoned with the same striding huntsman he wore on his surcoat. As none of it was black, however, Ser Alliser insisted that he reequip himself from the armory. That took half the morning. His girth required Donal Noye to take apart a mail hauberk and refit it with leather panels at the sides. To get a helm over his head the armorer had to detach the visor. His leathers bound so tightly around his legs and under his arms that he could scarcely move. Dressed for battle, the new boy looked like an overcooked sausage about to burst its skin.  Let us hope you are not as inept as you look,  Ser Alliser said.  Halder, see what Ser Piggy can do.   Jon Snow winced. Halder had been born in a quarry and apprenticed as a stonemason. He was sixteen, tall and muscular, and his blows were as hard as any Jon had ever felt.  This will be uglier than a whore’s ass,  Pyp muttered, and it was.  The fight lasted less than a minute before the fat boy was on the ground, his whole body shaking as blood leaked through his shattered helm and between his pudgy fingers.  I yield,  he shrilled.  No more, I yield, don’t hit me.  Rast and some of the other boys were laughing.  Even then, Ser Alliser would not call an end.  On your feet, Ser Piggy,  he called.  Pick up your sword.  When the boy continued to cling to the ground, Thorne gestured to Halder.  Hit him with the flat of your blade until he finds his feet.  Halder delivered a tentative smack to his foe’s upraised cheeks.  You can hit harder than that,  Thorne taunted. Halder took hold of his longsword with both hands and brought it down so hard the blow split leather, even on the flat. The new boy screeched in pain.  Jon Snow took a step forward. Pyp laid a mailed hand on his arm.  Jon, no,  the small boy whispered with an anxious glance at Ser Alliser Thorne.   On your feet,  Thorne repeated. The fat boy struggled to rise, slipped, and fell heavily again.  Ser Piggy is starting to grasp the notion,  Ser Alliser observed.  Again.   Halder lifted the sword for another blow.  Cut us off a ham!  Rast urged, laughing.  Jon shook off Pyp’s hand.  Halder, enough.   Halder looked to Ser Alliser.   The Bastard speaks and the peasants tremble,  the master-at-arms said in that sharp, cold voice of his.  I remind you that I am the master-at-arms here, Lord Snow.    Look at him, Halder,  Jon urged, ignoring Thorne as best he could.  There’s no honor in beating a fallen foe. He yielded.  He knelt beside the fat boy.  Halder lowered his sword.  He yielded,  he echoed.  Ser Alliser’s onyx eyes were fixed on Jon Snow.  It would seem our Bastard is in love,  he said as Jon helped the fat boy to his feet.  Show me your steel, Lord Snow.   Jon drew his longsword. He dared defy Ser Alliser only to a point, and he feared he was well beyond it now.  Thorne smiled.  The Bastard wishes to defend his lady love, so we shall make an exercise of it. Rat, Pimple, help our Stone Head here.  Rast and Albett moved to join Halder.  Three of you ought to be sufficient to make Lady Piggy squeal. All you need do is get past the Bastard.    Stay behind me,  Jon said to the fat boy. Ser Alliser had often sent two foes against him, but never three. He knew he would likely go to sleep bruised and bloody tonight. He braced himself for the assault.  Suddenly Pyp was beside him.  Three to two will make for better sport,  the small boy said cheerfully. He dropped his visor and slid out his sword. Before Jon could even think to protest, Grenn had stepped up to make a third.  The yard had grown deathly quiet. Jon could feel Ser Alliser’s eyes.  Why are you waiting?  he asked Rast and the others in a voice gone deceptively soft, but it was Jon who moved first. Halder barely got his sword up in time.  Jon drove him backward, attacking with every blow, keeping the older boy on the heels. Know your foe, Ser Rodrik had taught him once; Jon knew Halder, brutally strong but short of patience, with no taste for defense. Frustrate him, and he would leave himself open, as certain as sunset.  The clang of steel echoed through the yard as the others joined battle around him. Jon blocked a savage cut at his head, the shock of impact running up his arm as the swords crashed together. He slammed a sidestroke into Halder’s ribs, and was rewarded with a muffled grunt of pain. The counterstroke caught Jon on the shoulder. Chainmail crunched, and pain flared up his neck, but for an instant Halder was unbalanced. Jon cut his left leg from under him, and he fell with a curse and a crash."
}