{
  "id": "8b053e581c8c3c7e962c02eab0cc34c95ef8de90",
  "text": " Aunt Marge thrust the suitcase into Harry's stomach, knocking the wind out of him, seized Dudley in a tight one-armed hug, and planted a large kiss on his cheek.  Harry knew perfectly well that Dudley only put up with Aunt Marge's hugs because he was well paid for it, and sure enough, when they broke apart, Dudley had a crisp twenty-pound note clutched in his fat fist.  \"Petunia!\" shouted Aunt Marge, striding past Harry as though he was a hat stand. Aunt Marge and Aunt Petunia kissed, or rather, Aunt Marge bumped her large jaw against Aunt Petunia's bony cheekbone.  Uncle Vernon now came in, smiling jovially as he shut the door.  \"Tea, Marge?\" he said. \"And what will Ripper take?\"  \"Ripper can have some tea out of my saucer,\" said Aunt Marge as they all proceeded into the kitchen, leaving Harry alone in the hall with the suitcase. But Harry wasn't complaining; any excuse not to be with Aunt Marge was fine by him, so he began to heave the case upstairs into the spare bedroom, taking as long as he could.  By the time he got back to the kitchen, Aunt Marge had been supplied with tea and fruitcake, and Ripper was lapping noisily in the corner. Harry saw Aunt Petunia wince slightly as specks of tea and drool flecked her clean floor. Aunt Petunia hated animals.  \"Who's looking after the other dogs, Marge?\" Uncle Vernon asked.  \"Oh, I've got Colonel Fubster managing them,\" boomed Aunt Marge. \"He's retired now, good for him to have something to do. But I couldn't leave poor old Ripper. He pines if he's away from me.\"  Ripper began to growl again as Harry sat down. This directed Aunt Marge's attention to Harry for the first time.  \"So!\" she barked. \"Still here, are you?\"  \"Yes,\" said Harry.  \"Don't you say yes' in that ungrateful tone,\" Aunt Marge growled. \"It's damn good of Vernon and Petunia to keep you. Wouldn't have done it myself. You'd have gone straight to an orphanage if you'd been dumped on my doorstep.\"  Harry was bursting to say that he'd rather live in an orphanage than with the Dursleys, but the thought of the Hogsmeade form stopped him. He forced his face into a painful smile.  \"Don't you smirk at me!\" boomed Aunt Marge. \"I can see you haven't improved since I last saw you. I hoped school would knock some manners into you.\" She took a large gulp of tea, wiped her mustache, and said, \"Where is it that you send him, again, Vernon?\"  \"St. Brutus's,\" said Uncle Vernon promptly. \"It's a first-rate institution for hopeless cases.\"  \"I see,\" said Aunt Marge. \"Do they use the cane at St. Brutus's, boy?\" she barked across the table.  \"Er --\"  Uncle Vernon nodded curtly behind Aunt Marge's back.  \"Yes,\" said Harry. Then, feeling he might as well do the thing properly, he added, \"all the time.\"  \"Excellent,\" said Aunt Marge. \"I won't have this namby-pamby, wishy-washy nonsense about not hitting people who deserve it. A good thrashing is what's needed in ninety-nine cases out of a hundred. Have you been beaten often?\"  \"Oh, yeah,\" said Harry, \"loads of times.\"  Aunt Marge narrowed her eyes.  \"I still don't like your tone, boy,\" she said. \"If you can speak of your beatings in that casual way, they clearly aren't hitting you hard enough. Petunia, I'd write if I were you. Make it clear that you approve the use of extreme force in this boy's case.\"  Perhaps Uncle Vernon was worried that Harry might forget their bargain; in any case, he changed the subject abruptly.  \"Heard the news this morning, Marge? What about that escaped prisoner, eh?\"  As Aunt Marge started to make herself at home, Harry caught himself thinking almost longingly of life at number four without her. Uncle Vernon and Aunt Petunia usually encouraged Harry to stay out of their way, which Harry was only too happy to do. Aunt Marge, on the other hand, wanted Harry under her eye at all times, so that she could boom out suggestions for his improvement. She delighted in comparing Harry with Dudley, and took huge pleasure in buying Dudley expensive presents while glaring at Harry, as though daring him to ask why he hadn't got a present too. She also kept throwing out dark hints about what made Harry such an unsatisfactory person.  \"You mustn't blame yourself for the way the boy's turned out, Vernon,\" she said over lunch on the third day. \"If there's something rotten on the inside, there's nothing anyone can do about it.\"  Harry tried to concentrate on his food, but his hands shook and his face was starting to burn with anger. Remember the form, he told himself Think about Hogsmeade. Don't say anything. Don't rise  Aunt Marge reached for her glass of wine.  \"It's one of the basic rules of breeding,\" she said. \"You see it all the time with dogs. If there's something wrong with the bitch, there'll be something wrong with the pup --\"  At that moment, the wineglass Aunt Marge was holding exploded in her hand. Shards of glass flew in every direction and Aunt Marge sputtered and blinked, her great ruddy face dripping.  \"Marge!\" squealed Aunt Petunia. \"Marge, are you all right?\"  \"Not to worry,\" grunted Aunt Marge, mopping her face with her napkin."
}