{
  "id": "8cfd5c3299dd7caeee46fceb7160f6db2f026afd",
  "text": "  She murmured sleepily as Theon slid out from under her arm and got to his feet. A few embers still smoldered in the hearth. Wex slept on the floor at the foot of the bed, rolled up inside his cloak and dead to the world. Nothing moved. Theon crossed to the window and threw open the shutters. Night touched him with cold fingers, and gooseprickles rose on his bare skin. He leaned against the stone sill and looked out on dark towers, empty yards, black sky, and more stars than a man could ever count if he lived to be a hundred. A half-moon floated above the Bell Tower and cast its reflection on the roof of the glass gardens. He heard no alarms, no voices, not so much as a footfall.  All’s well, Greyjoy. Hear the quiet? You ought to be drunk with joy. You took Winterfell with fewer than thirty men, a feat to sing of. Theon started back to bed. He’d roll Kyra on her back and fuck her again, that ought to banish these phantoms. Her gasps and giggles would make a welcome respite from this silence.  He stopped. He had grown so used to the howling of the direwolves that he scarcely heard it anymore… but some part of him, some hunter’s instinct, heard its absence.  Urzen stood outside his door, a sinewy man with a round shield slung over his back.  The wolves are quiet,  Theon told him.  Go see what they’re doing, and come straight back.  The thought of the direwolves running loose gave him a queasy feeling. He remembered the day in the wolfswood when the wildlings had attacked Bran. Summer and Grey Wind had torn them to pieces.  When he prodded Wex with the toe of his boot, the boy sat up and rubbed his eyes.  Make certain Bran Stark and his little brother are in their beds, and be quick about it.    M’lord?  Kyra called sleepily.   Go back to sleep, this does not concern you.  Theon poured himself a cup of wine and drank it down. All the time he was listening, hoping to hear a howl. Too few men, he thought sourly. I have too few men. If Asha does not come…  Wex returned the quickest, shaking his head side to side. Cursing, Theon found his tunic and breeches on the floor where he had dropped them in his haste to get at Kyra. Over the tunic he donned a jerkin of iron-studded leather, and he belted a longsword and dagger at his waist. His hair was wild as the wood, but he had larger concerns.  By then Urzen was back.  The wolves be gone.   Theon told himself he must be as cold and deliberate as Lord Eddard.  Rouse the castle,  he said.  Herd them out into the yard, everyone, we’ll see who’s missing. And have Lorren make a round of the gates. Wex, with me.   He wondered if Stygg had reached Deepwood Motte yet. The man was not as skilled a rider as he claimed—none of the ironmen were much good in the saddle—but there’d been time enough. Asha might well be on her way. And if she learns that I have lost the Starks… It did not bear thinking about.  Bran’s bedchamber was empty, as was Rickon’s half a turn below. Theon cursed himself. He should have kept a guard on them, but he’d deemed it more important to have men walking the walls and protecting the gates than to nursemaid a couple of children, one a cripple.  Outside he heard sobbing as the castle folk were pulled from their beds and driven into the yard. I’ll give them reason to sob. I’ve used them gently, and this is how they repay me. He’d even had two of his own men whipped bloody for raping that kennel girl, to show them he meant to be just. They still blame me for the rape, though. And the rest. He deemed that unfair. Mikken had killed himself with his mouth, just as Benfred had. As for Chayle, he had to give someone to the Drowned God, his men expected it.  I bear you no ill will,  he’d told the septon before they threw him down the well,  but you and your gods have no place here now.  You’d think the others might be grateful he hadn’t chosen one of them, but no. He wondered how many of them were part of this plot against him.  Urzen returned with Black Lorren.  The Hunter’s Gate,  Lorren said.  Best come see.   The Hunter’s Gate was conveniently sited close to the kennels and kitchens. It opened directly on fields and forests, allowing riders to come and go without first passing through the winter town, and so was favored by hunting parties.  Who had the guard here?  Theon demanded.   Drennan and Squint.   Drennan was one of the men who’d raped Palla.  If they’ve let the boys escape, I’ll have more than a little skin off their back this time, I swear it.    No need for that,  Black Lorren said curtly.  Nor was there. They found Squint floating facedown in the moat, his entrails drifting behind him like a nest of pale snakes. Drennan lay half naked in the gatehouse, in the snug room where the drawbridge was worked. His throat had been opened ear to ear. A ragged tunic concealed the half-healed scars on his back, but his boots were scattered amidst the rushes, and his breeches tangled about his feet. There was cheese on a small table near the door, beside an empty flagon."
}