{
  "id": "8d3495f06e33830e340d8ecc4bf270f4e928aade",
  "text": " He lent honor to any man he served. Can anyone say the same of the Hound? You feed your dog bones under the table, you do not seat him beside you on the high bench.  He pointed a finger at Tyrion’s face.  If Cersei cannot curb the boy, you must. And if these councillors are playing us false…   Tyrion knew.  Spikes,  he sighed.  Heads. Walls.    I see you have taken a few lessons from me.    More than you know, Father,  Tyrion answered quietly. He finished his wine and set the cup aside, thoughtful. A part of him was more pleased than he cared to admit. Another part was remembering the battle upriver, and wondering if he was being sent to hold the left again.  Why me?  he asked, cocking his head to one side.  Why not my uncle? Why not Ser Addam or Ser Flement or Lord Serrett? Why not a… bigger man?   Lord Tywin rose abruptly.  You are my son.   That was when he knew. You have given him up for lost, he thought. You bloody bastard, you think Jaime’s good as dead, so I’m all you have left. Tyrion wanted to slap him, to spit in his face, to draw his dagger and cut the heart out of him and see if it was made of old hard gold, the way the smallfolks said. Yet he sat there, silent and still.  The shards of the broken cup crunched beneath his father’s heels as Lord Tywin crossed the room.  One last thing,  he said at the door.  You will not take the whore to court.   Tyrion sat alone in the common room for a long while after his father was gone. Finally he climbed the steps to his cozy garret beneath the bell tower. The ceiling was low, but that was scarcely a drawback for a dwarf. From the window, he could see the gibbet his father had erected in the yard. The innkeep’s body turned slowly on its rope whenever the night wind gusted. Her flesh had grown as thin and ragged as Lannister hopes.  Shae murmured sleepily and rolled toward him when he sat on the edge of the featherbed. He slid his hand under the blanket and cupped a soft breast, and her eyes opened.  M’lord,  she said with a drowsy smile.  When he felt her nipple stiffen, Tyrion kissed her.  I have a mind to take you to King’s Landing, sweetling,  he whispered.      JON  The mare whickered softly as Jon Snow tightened the cinch.  Easy, sweet lady,  he said in a soft voice, quieting her with a touch. Wind whispered through the stable, a cold dead breath on his face, but Jon paid it no mind. He strapped his roll to the saddle, his scarred fingers stiff and clumsy.  Ghost,  he called softly,  to me.  And the wolf was there, eyes like embers.   Jon, please. You must not do this.   He mounted, the reins in his hand, and wheeled the horse around to face the night. Samwell Tarly stood in the stable door, a full moon peering over his shoulder. He threw a giant’s shadow, immense and black.  Get out of my way, Sam.    Jon, you can’t,  Sam said.  I won’t let you.    I would sooner not hurt you,  Jon told him.  Move aside, Sam, or I’ll ride you down.    You won’t. You have to listen to me. Please…   Jon put his spurs to horseflesh, and the mare bolted for the door. For an instant Sam stood his ground, his face as round and pale as the moon behind him, his mouth a widening O of surprise. At the last moment, when they were almost on him, he jumped aside as Jon had known he would, stumbled, and fell. The mare leapt over him, out into the night.  Jon raised the hood of his heavy cloak and gave the horse her head. Castle Black was silent and still as he rode out, with Ghost racing at his side. Men watched from the Wall behind him, he knew, but their eyes were turned north, not south. No one would see him go, no one but Sam Tarly, struggling back to his feet in the dust of the old stables. He hoped Sam hadn’t hurt himself, falling like that. He was so heavy and so ungainly, it would be just like him to break a wrist or twist his ankle getting out of the way.  I warned him,  Jon said aloud.  It was nothing to do with him, anyway.  He flexed his burned hand as he rode, opening and closing the scarred fingers. They still pained him, but it felt good to have the wrappings off.  Moonlight silvered the hills as he followed the twisting ribbon of the kingsroad. He needed to get as far from the Wall as he could before they realized he was gone. On the morrow he would leave the road and strike out overland through field and bush and stream to throw off pursuit, but for the moment speed was more important than deception. It was not as though they would not guess where he was going.  The Old Bear was accustomed to rise at first light, so Jon had until dawn to put as many leagues as he could between him and the Wall… if Sam Tarly did not betray him. The fat boy was dutiful and easily frightened, but he loved Jon like a brother. If questioned, Sam would doubtless tell them the truth, but Jon could not imagine him braving the guards in front of the King’s Tower to wake Mormont from sleep.  When Jon did not appear to fetch the Old Bear’s breakfast from the kitchen, they’d look in his cell and find Longclaw on the bed."
}