{
  "id": "94381e3371b055eb67a16a096fb607494c1fe26d",
  "text": " The books she was carrying tumbled out of her arms, but she didn't pick them up. \"How do you know --?\" she spluttered.  \"Professor, I think -- I know -- that Sn- that someone's going to try and steal the Stone. I've got to talk to Professor Dumbledore.\"  She eyed him with a mixture of shock and suspicion.  \"Professor Dumbledore will be back tomorrow,\" she said finally. I don't know how you found out about the Stone, but rest assured, no one can possibly steal it, it's too well protected.\"  \"But Professor --\"  \"Potter, I know what I'm talking about,\" she said shortly. She bent down and gathered up the fallen books. I suggest you all go back outside and enjoy the sunshine.\"  But they didn't.  \"It's tonight,\" said Harry, once he was sure Professor McGonagall was out of earshot. \"Snape's going through the trapdoor tonight. He's found out everything he needs, and now he's got Dumbledore out of the way. He sent that note, I bet the Ministry of Magic will get a real shock when Dumbledore turns up.\"  \"But what can we --\"  Hermione gasped. Harry and Ron wheeled round.  Snape was standing there.  \"Good afternoon,\" he said smoothly.  They stared at him.  \"You shouldn't be inside on a day like this,\" he said, with an odd, twisted smile.  \"We were --\" Harry began, without any idea what he was going to say.  \"You want to be more careful,\" said Snape. \"Hanging around  like this, people will think you're up to something. And Gryffindor really can't afford to lose any more points, can it?\"  Harry flushed. They turned to go outside, but Snape called them back.  \"Be warned, Potter -- any more nighttime wanderings and I will personally make sure you are expelled. Good day to you.\"  He strode off in the direction of the staffroom.  Out on the stone steps, Harry turned to the others.  \"Right, here's what we've got to do,\" he whispered urgently. \"One of us has got to keep an eye on Snape -- wait outside the staff room and follow him if he leaves it. Hermione, you'd better do that.\"  \"Why me?\"  \"It's obvious,\" said Ron. \"You can pretend to be waiting for Professor Flitwick, you know.\" He put on a high voice, \"'Oh Professor Flitwick, I'm so worried, I think I got question fourteen b wrong....'\"  \"Oh, shut up,\" said Hermione, but she agreed to go and watch out for Snape.  \"And we'd better stay outside the third-floor corridor,\" Harry told Ron. \"Come on.\"  But that part of the plan didn't work. No sooner had they reached the door separating Fluffy from the rest of the school than Professor McGonagall turned up again and this time, she lost her temper.  \"I suppose you think you're harder to get past than a pack of enchantments!\" she stormed. \"Enough of this nonsense! If I hear you 've come anywhere near here again, I'll take another fifty points from Gryffindor! Yes, Weasley, from my own house!\" Harry and Ron went back to the common room, Harry had just said, \"At least Hermione's on Snape's tail,\" when the portrait of the Fat Lady swung open and Hermione came in.  \"I'm sorry, Harry!\" she wailed. \"Snape came out and asked me what I was doing, so I said I was waiting for Flitwick, and Snape went to get him, and I've only just got away, I don't know where Snape went.\"  \"Well, that's it then, isn't it?\" Harry said.  The other two stared at him. He was pale and his eyes were glittering.  \"I'm going out of here tonight and I'm going to try and get to the Stone first.\"  \"You're mad!\" said Ron.  \"You can't!\" said Hermione. \"After what McGonagall and Snape have said? You'll be expelled!\"  \"SO WHAP\" Harry shouted. \"Don't you understand? If Snape gets hold of the Stone, Voldemort's coming back! Haven't you heard what it was like when he was trying to take over? There won't be any Hogwarts to get expelled from! He'll flatten it, or turn it into a school for the Dark Arts! Losing points doesn't matter anymore, can't you see? D'you think he'll leave you and your families alone if Gryffindor wins the house cup? If I get caught before I can get to the Stone, well, I'll have to go back to the Dursleys and wait for Voldemort to find me there, it's only dying a bit later than I would have, because I'm never going over to the Dark Side! I'm going through that trapdoor tonight and nothing you two say is going to stop me! Voldemort killed my parents, remember?\"  He glared at them.  \"You're right Harry,\" said Hermione in a small voice.  \"I'll use the invisibility cloak,\" said Harry. \"It's just lucky I got it back.\"  \"But will it cover all three of us?\" said Ron.  \"All -- all three of us?\"  \"Oh, come off it, you don't think we'd let you go alone?\"  \"Of course not,\" said Hermione briskly. \"How do you think you'd get to the Stone without us? I'd better go and took through my books, there might be something useful...\"  \"But if we get caught, you two will be expelled, too.\"  \"Not if I can help it,\" said Hermione grimly. \"Flitwick told me in secret that I got a hundred and twelve percent on his exam. They're not throwing me out after that.\"  After dinner the three of them sat nervously apart in the common room."
}