{
  "id": "9486ece9df3b42df51623e6148142f678f52ddc5",
  "text": " Then he heard faintly a sound like sniffing: and something seemed  to  be  scrabbling on the bark of  the tree-trunk. He  stared down into  the  dark, holding his breath.       Something was now  climbing slowly, and  its breath  came  like a   soft  hissing through closed teeth. Then coming  up, close  to the stem, Frodo saw   ####-two pale eyes. They stopped and gazed upward unwinking. Suddenly they  turned  away, and a shadowy figure slipped round the trunk of the tree and vanished.       Immediately  afterwards Haldir  came  climbing swiftly  up through  the  branches. `There was something in this tree that I have never seen  before,'  he said. `It was not an orc. It fled as  soon as I touched the tree-stem. It  seemed to be wary, and to have some skill in trees, or I  might have thought   that it was one of you hobbits.        'I did not  shoot, for I  dared not arouse any  cries:  we cannot  risk   battle. A strong company of Orcs has passed. They crossed the Nimrodel-curse  their foul feet in its clean water!-and went on down the old road beside the  river. They seemed to pick up some scent, and they searched the ground for a  while near the place where you halted. The three of us could not challenge a   hundred,  so we went ahead and spoke  with feigned  voices, leading  them on  into the wood.       `Orophin  has  now  gone in haste  back  to our  dwellings  to warn our  people. None of the Orcs will  ever return out of  Lurien. And there will be  many Elves hidden on the northern border before another night falls. Bu t you  must take the road south as soon as it is fully light.'       Day came pale from the East. As the light grew  it filtered through the  yellow leaves of  the mallorn, and  it  seemed to the hobbits that the early  sun of a  cool summer's morning was  shining. Pale-blue sky peeped among the  moving branches. Looking  through an opening on the south side  of the  flet   Frodo saw all the valley of the Silverlode lying  like a  sea of fallow gold  tossing gently in the breeze.       The  morning was  still  young and cold when the Company set out again,  guided now  by Haldir and his  brother  R®mil. `Farewell,  sweet Nimrodel! '  cried Legolas. Frodo looked back and  caught a gleam of white foam among  the  grey tree-stems.  `Farewell,' he said. It seemed to him  tha t he would never   hear again  a running water so beautiful, for  ever blending its innumerable  notes in an endless changeful music.       They went back to the path that  still  went on along the west side  of  the  Silverlode, and for some way they followed it southward. There were the  prints of orc-feet in the earth. But soon Haldir turned aside into the trees  and halted on the bank of the river under their shadows.       `There is one of my  people yonder across the stream,' he said  `though   ####-you may not see him.' He gave a call like the low whistle of a bird, and out  of a thicket of  young trees an Elf stepped, clad in grey, but with his hood  thrown back; his hair glinted like gold in the morning sun. Haldir skilfully  cast over the stream a coil of grey rope, and he caught it and bound the end  about a tree near the bank.       `Celebrant is  already  a  strong stream here, as you see,' said Haldir  'and it runs both swift and deep, and is very cold. We do not set foot in it  so far  north, unless  we must. But  in these days of watchfulness we do not  make bridges. This is how we cross! Follow me!' He  made his end of the rope  fast about another tree,  and then ran lightly along it, over the  river and  back again, as if he were on a road.       `I  can walk  this path,' said  Legolas; `but the others have not  this  skill. Must they swim?'       `No!' said Haldir. `We have two  more ropes. We  will fasten them above  the other, one shoulder-high,  and another half-high, and holding these  the  strangers should be able to cross with care.'       When this  slender bridge had been made, the Company passed  over, some  cautiously and slowly, others more easily. Of  the hobbits Pippin proved the  best for he was  sure-footed, and he walked  over quickly, holding only with  one hand;  but he kept his eyes on the bank ahead and did not look down. Sam  shuffled along, clutching hard, and looking down into the pale eddying water  as if it was a chasm in the mountains.        He breathed with relief when he was safely across. `Live and  learn! as  my gaffer used to say. Though he was thinking of gardening,  not of roosting  like a bird,  nor  of trying  to walk like a spider. Not even my  uncle Andy  ever did a trick like that! '       When  at length  all the Company was gathered on the  east  bank of the  Silverlode,  the Elves untied the ropes and  coiled two of them.  R®mil, who  had remained  on  the  other side, drew back the last  one, slung  it on his  shoulder, and  with a wave of his hand went away,  back to  Nimrodel to keep  watch.       `Now, friends,'  said  Haldir, `you have entered the Naith of Lurien or   the  Gore, as you would  say, for it is the land that lies like a spear -head  between the arms of Silverlode  and Anduin the Great."
}