{
  "id": "94f79fbc8e73d73dc04c6e320cc13803def0bb64",
  "text": "  There’s a village close,  Grigg the Goat told the Magnar.  Two miles, three. We could shelter there.  Styr agreed at once.  It was well past dark and the storm was raging by the time they reached the place. The village sat beside a lake, and had been so long abandoned that most of the houses had collapsed. Even the small timber inn that must once have been a welcome sight for travelers stood half-fallen and roofless. We will find scant shelter here, Jon thought gloomily. Whenever the lightning flashed he could see a stone roundtower rising from an island out in the lake, but without boats they had no way to reach it.  Errok and Del had crept ahead to scout the ruins, but Del was back almost at once. Styr halted the column and sent a dozen of his Thenns trotting forward, spears in hand. By then Jon had seen it too: the glimmer of a fire, reddening the chimney of the inn. We are not alone. Dread coiled inside him like a snake. He heard a horse neigh, and then shouts. Ride with them, eat with them, fight with them, Qhorin had said.  But the fighting was done.  There’s only one of them,  Errok said when he came back.  An old man with a horse.   The Magnar shouted commands in the Old Tongue and a score of his Thenns spread out to establish a perimeter around the village, whilst others went prowling through the houses to make certain no one else was hiding amongst the weeds and tumbled stones. The rest crowded into the roofless inn, jostling each other to get closer to the hearth. The broken branches the old man had been burning seemed to generate more smoke than heat, but any warmth was welcome on such a wild rainy night. Two of the Thenns had thrown the man to the ground and were going through his things. Another held his horse, while three more looted his saddlebags.  Jon walked away. A rotten apple squished beneath his heel. Styr will kill him. The Magnar had said as much at Greyguard; any kneelers they met were to be put to death at once, to make certain they could not raise the alarm. Ride with them, eat with them, fight with them. Did that mean he must stand mute and helpless while they slit an old man’s throat?  Near the edge of the village, Jon came face-to-face with one of the guards Styr had posted. The Thenn growled something in the Old Tongue and pointed his spear back toward the inn. Get back where you belong, Jon guessed. But where is that?  He walked towards the water, and discovered an almost dry spot beneath the leaning daub-and-wattle wall of a tumbledown cottage that had mostly tumbled down. That was where Ygritte found him sitting, staring off across the rain-whipped lake.  I know this place,  he told her when she sat beside him.  That tower… look at the top of it the next time the lightning flashes, and tell me what you see.    Aye, if you like,  she said, and then,  Some o’ the Thenns are saying they heard noises out there. Shouting, they say.    Thunder.    They say shouting. Might be it’s ghosts.   The holdfast did have a grim haunted look, standing there black against the storm on its rocky island with the rain lashing at the lake all around it.  We could go out and take a look,  he suggested.  I doubt we could get much wetter than we are.    Swimming? In the storm?  She laughed at the notion.  Is this a trick t’ get the clothes off me, Jon Snow?    Do I need a trick for that now?  he teased.  Or is that you can’t swim a stroke?  Jon was a strong swimmer himself, having learned the art as a boy in Winterfell’s great moat.  Ygritte punched his arm.  You know nothing, Jon Snow. I’m half a fish, I’ll have you know.    Half fish, half goat, half horse… there’s too many halves to you, Ygritte.  He shook his head.  We wouldn’t need to swim, if this is the place I think. We could walk.   She pulled back and gave him a look.  Walk on water? What southron sorcery is that?    No sorc—  he began, as a huge bolt of lightning stabbed down from the sky and touched the surface of the lake. For half a heartbeat the world was noonday bright. The clap of thunder was so loud that Ygritte gasped and covered her ears.   Did you look?  Jon asked, as the sound rolled away and the night turned black again.  Did you see?    Yellow,  she said.  Is that what you meant? Some o’ them standing stones on top were yellow.    We call them merlons. They were painted gold a long time ago. This is Queenscrown.   Across the lake, the tower was black again, a dim shape dimly seen.  A queen lived there?  asked Ygritte.   A queen stayed there for a night.  Old Nan had told him the story, but Maester Luwin had confirmed most of it.  Alysanne, the wife of King Jaehaerys the Conciliator. He’s called the Old King because he reigned so long, but he was young when he first came to the Iron Throne. In those days, it was his wont to travel all over the realm. When he came to Winterfell, he brought his queen, six dragons, and half his court. The king had matters to discuss with his Warden of the North, and Alysanne grew bored, so she mounted her dragon Silverwing and flew north to see the Wall."
}