{
  "id": "9563658c087091dc8cdadaf3b803995a90baac5e",
  "text": "\"  A magic wand... this was what Harry had been really looking forward to.  The last shop was narrow and shabby. Peeling gold letters over the door read Ollivanders: Makers of Fine Wands since 382 B.C. A single wand lay on a faded purple cushion in the dusty window.  A tinkling bell rang somewhere in the depths of the shop as they stepped inside. It was a tiny place, empty except for a single, spindly chair that Hagrid sat on to wait. Harry felt strangely as though he had entered a very strict library; he swallowed a lot of new questions that had just occurred to him and looked instead at the thousands of narrow boxes piled neatly right up to the ceiling. For some reason, the back of his neck prickled. The very dust and silence in here seemed to tingle with some secret magic.  \"Good afternoon,\" said a soft voice. Harry jumped. Hagrid must have jumped, too, because there was a loud crunching noise and he got quickly off the spindly chair.  An old man was standing before them, his wide, pale eyes shining like moons through the gloom of the shop.  \"Hello,\" said Harry awkwardly.  \"Ah yes,\" said the man. \"Yes, yes. I thought I'd be seeing you soon. Harry Potter.\" It wasn't a question. \"You have your mother's eyes. It seems only yesterday she was in here herself, buying her first wand. Ten and a quarter inches long, swishy, made of willow. Nice wand for charm work.\"  Mr. Ollivander moved closer to Harry. Harry wished he would blink. Those silvery eyes were a bit creepy.  \"Your father, on the other hand, favored a mahogany wand. Eleven inches. Pliable. A little more power and excellent for transfiguration. Well, I say your father favored it -- it's really the wand that chooses the wizard, of course.\"  Mr. Ollivander had come so close that he and Harry were almost nose to nose. Harry could see himself reflected in those misty eyes.  \"And that's where...\"  Mr. Ollivander touched the lightning scar on Harry's forehead with a long, white finger.  \"I'm sorry to say I sold the wand that did it,\" he said softly. \"Thirteen-and-a-half inches. Yew. Powerful wand, very powerful, and in the wrong hands... well, if I'd known what that wand was going out into the world to do....\"  He shook his head and then, to Harry's relief, spotted Hagrid.  \"Rubeus! Rubeus Hagrid! How nice to see you again.... Oak, sixteen inches, rather bendy, wasn't it?\"  \"It was, sir, yes,\" said Hagrid.  \"Good wand, that one. But I suppose they snapped it in half when you got expelled?\" said Mr. Ollivander, suddenly stern.  \"Er -- yes, they did, yes,\" said Hagrid, shuffling his feet. \"I've still got the pieces, though,\" he added brightly.  \"But you don't use them?\" said Mr. Ollivander sharply.  \"Oh, no, sit,\" said Hagrid quickly. Harry noticed he gripped his pink umbrella very tightly as he spoke.  \"Hmmm,\" said Mr. Ollivander, giving Hagrid a piercing look. \"Well, now -- Mr. Potter. Let me see.\" He pulled a long tape measure with silver markings out of his pocket. \"Which is your wand arm?\"  \"Er -- well, I'm right-handed,\" said Harry.  \"Hold out your arm. That's it.\" He measured Harry from shoulder to finger, then wrist to elbow, shoulder to floor, knee to armpit and round his head. As he measured, he said, \"Every Ollivander wand has a core of a powerful magical substance, Mr. Potter. We use unicorn hairs, phoenix tail feathers, and the heartstrings of dragons. No two Ollivander wands are the same, just as no two unicorns, dragons, or phoenixes are quite the same. And of course, you will never get such good results with another wizard's wand.\"  Harry suddenly realized that the tape measure, which was measuring between his nostrils, was doing this on its own. Mr. Ollivander was flitting around the shelves, taking down boxes.  \"That will do,\" he said, and the tape measure crumpled into a heap on the floor. \"Right then, Mr. Potter. Try this one. Beechwood and dragon heartstring. Nine inches. Nice and flexible. just take it and give it a wave.\"  Harry took the wand and (feeling foolish) waved it around a bit, but Mr. Ollivander snatched it out of his hand almost at once.  \"Maple and phoenix feather. Seven inches. Quite whippy. Try --\"  Harry tried -- but he had hardly raised the wand when it, too, was snatched back by Mr. Ollivander.  \"No, no -here, ebony and unicorn hair, eight and a half inches, springy. Go on, go on, try it out.\"  Harry tried. And tried. He had no idea what Mr. Ollivander was waiting for. The pile of tried wands was mounting higher and higher on the spindly chair, but the more wands Mr. Ollivander pulled from the shelves, the happier he seemed to become.  \"Tricky customer, eh? Not to worry, we'll find the perfect match here somewhere -- I wonder, now - - yes, why not -- unusual combination -- holly and phoenix feather, eleven inches, nice and supple.\"  Harry took the wand. He felt a sudden warmth in his fingers. He raised the wand above his head, brought it swishing down through the dusty air and a stream of red and gold sparks shot from the end like a firework, throwing dancing spots of light on to the walls."
}