{
  "id": "959406f6ad18bef4a62ee701c8818c98b903a72d",
  "text": "  They wouldn’t let me out to say good-bye.    What did you do now?  Jon was amused.  Arya disentangled herself from him and made a face.  Nothing. I was all packed and everything.  She gestured at the huge chest, no more than a third full, and at the clothes that were scattered all over the room.  Septa Mordane says I have to do it all over. My things weren’t properly folded, she says. A proper southron lady doesn’t just throw her clothes inside her chest like old rags, she says.    Is that what you did, little sister?    Well, they’re going to get all messed up anyway,  she said.  Who cares how they’re folded?    Septa Mordane,  Jon told her.  I don’t think she’d like Nymeria helping, either.  The she-wolf regarded him silently with her dark golden eyes.  It’s just as well. I have something for you to take with you, and it has to be packed very carefully.   Her face lit up.  A present?    You could call it that. Close the door.   Wary but excited, Arya checked the hall.  Nymeria, here. Guard.  She left the wolf out there to warn of intruders and closed the door. By then Jon had pulled off the rags he’d wrapped it in. He held it out to her.  Arya’s eyes went wide. Dark eyes, like his.  A sword,  she said in a small, hushed breath.  The scabbard was soft grey leather, supple as sin. Jon drew out the blade slowly, so she could see the deep blue sheen of the steel.  This is no toy,  he told her.  Be careful you don’t cut yourself. The edges are sharp enough to shave with.    Girls don’t shave,  Arya said.   Maybe they should. Have you ever seen the septa’s legs?   She giggled at him.  It’s so skinny.    So are you,  Jon told her.  I had Mikken make this special. The bravos use swords like this in Pentos and Myr and the other Free Cities. It won’t hack a man’s head off, but it can poke him full of holes if you’re fast enough.    I can be fast,  Arya said.   You’ll have to work at it every day.  He put the sword in her hands, showed her how to hold it, and stepped back.  How does it feel? Do you like the balance?    I think so,  Arya said.   First lesson,  Jon said.  Stick them with the pointy end.   Arya gave him a whap on the arm with the flat of her blade. The blow stung, but Jon found himself grinning like an idiot.  I know which end to use,  Arya said. A doubtful look crossed her face.  Septa Mordane will take it away from me.    Not if she doesn’t know you have it,  Jon said.   Who will I practice with?    You’ll find someone,  Jon promised her.  King’s Landing is a true city, a thousand times the size of Winterfell. Until you find a partner, watch how they fight in the yard. Run, and ride, make yourself strong. And whatever you do…   Arya knew what was coming next. They said it together.   …don’t… tell… Sansa!   Jon messed up her hair.  I will miss you, little sister.   Suddenly she looked like she was going to cry.  I wish you were coming with us.    Different roads sometimes lead to the same castle. Who knows?  He was feeling better now. He was not going to let himself be sad.  I better go. I’ll spend my first year on the Wall emptying chamber pots if I keep Uncle Ben waiting any longer.   Arya ran to him for a last hug.  Put down the sword first,  Jon warned her, laughing. She set it aside almost shyly and showered him with kisses.  When he turned back at the door, she was holding it again, trying it for balance.  I almost forgot,  he told her.  All the best swords have names.    Like Ice,  she said. She looked at the blade in her hand.  Does this have a name? Oh, tell me.    Can’t you guess?  Jon teased.  Your very favorite thing.   Arya seemed puzzled at first. Then it came to her. She was that quick. They said it together:   Needle!   The memory of her laughter warmed him on the long ride north.      DAENERYS  Daenerys Targaryen wed Khal Drogo with fear and barbaric splendor in a field beyond the walls of Pentos, for the Dothraki believed that all things of importance in a man’s life must be done beneath the open sky.  Drogo had called his khalasar to attend him and they had come, forty thousand Dothraki warriors and uncounted numbers of women, children, and slaves. Outside the city walls they camped with their vast herds, raising palaces of woven grass, eating everything in sight, and making the good folk of Pentos more anxious with every passing day.   My fellow magisters have doubled the size of the city guard,  Illyrio told them over platters of honey duck and orange snap peppers one night at the manse that had been Drogo’s. The khal had joined his khalasar, his estate given over to Daenerys and her brother until the wedding.   Best we get Princess Daenerys wedded quickly before they hand half the wealth of Pentos away to sellswords and bravos,  Ser Jorah Mormont jested. The exile had offered her brother his sword the night Dany had been sold to Kbal Drogo; Viserys had accepted eagerly. Mormont had been their constant companion ever since.  Magister Illyrio laughed lightly through his forked beard, but Viserys did not so much as smile."
}