{
  "id": "97032b0faa709cd52713b3f702a9532df22a9eb3",
  "text": "    Well, then. Gargoyles are hard, but white lumps should be easy.  And they were.  The Broken Tower was easier still. They made a tall tower together, kneeling side by side to roll it smooth, and when they’d raised it Sansa stuck her fingers through the top, grabbed a handful of snow, and flung it full in his face. Petyr yelped, as the snow slid down under his collar.  That was unchivalrously done, my lady.    As was bringing me here, when you swore to take me home.   She wondered where this courage had come from, to speak to him so frankly. From Winterfell, she thought. I am stronger within the walls of Winterfell.  His face grew serious.  Yes, I played you false in that… and in one other thing as well.   Sansa’s stomach was aflutter.  What other thing?    I told you that nothing could please me more than to help you with your castle. I fear that was a lie as well. Something else would please me more.  He stepped closer.  This.   Sansa tried to step back, but he pulled her into his arms and suddenly he was kissing her. Feebly, she tried to squirm, but only succeeded in pressing herself more tightly against him. His mouth was on hers, swallowing her words. He tasted of mint. For half a heartbeat she yielded to his kiss… before she turned her face away and wrenched free.  What are you doing?   Petyr straightened his cloak.  Kissing a snow maid.    You’re supposed to kiss her.  Sansa glanced up at Lysa’s balcony, but it was empty now.  Your lady wife.    I do. Lysa has no cause for complaint.  He smiled.  I wish you could see yourself, my lady. You are so beautiful. You’re crusted over with snow like some little bear cub, but your face is flushed and you can scarcely breathe. How long have you been out here? You must be very cold. Let me warm you, Sansa. Take off those gloves, give me your hands.    I won’t.  He sounded almost like Marillion, the night he’d gotten so drunk at the wedding. Only this time Lothor Brune would not appear to save her; Ser Lothor was Petyr’s man.  You shouldn’t kiss me. I might have been your own daughter…    Might have been,  he admitted, with a rueful smile.  But you’re not, are you? You are Eddard Stark’s daughter, and Cat’s. But I think you might be even more beautiful than your mother was, when she was your age.    Petyr, please.  Her voice sounded so weak.  Please…    A castle!   The voice was loud, shrill, and childish. Littleflnger turned away from her.  Lord Robert.  He sketched a bow.  Should you be out in the snow without your gloves?    Did you make the snow castle, Lord Littlefinger?    Alayne did most of it, my lord.   Sansa said,  It’s meant to be Winterfell.    Winterfell?  Robert was small for eight, a stick of a boy with splotchy skin and eyes that were always runny. Under one arm he clutched the threadbare cloth doll he carried everywhere.   Winterfell is the seat of House Stark,  Sansa told her husband-to-be.  The great castle of the north.    It’s not so great.  The boy knelt before the gatehouse.  Look, here comes a giant to knock it down.  He stood his doll in the snow and moved it jerkily.  Tromp tromp I’m a giant, I’m a giant,  he chanted.  Ho ho ho, open your gates or I’ll mash them and smash them.  Swinging the doll by the legs, he knocked the top off one gatehouse tower and then the other.  It was more than Sansa could stand.  Robert, stop that.  Instead he swung the doll again, and a foot of wall exploded. She grabbed for his hand but she caught the doll instead. There was a loud ripping sound as the thin cloth tore. Suddenly she had the doll’s head, Robert had the legs and body, and the rag-and-sawdust stuffing was spilling in the snow.  Lord Robert’s mouth trembled.  You killlllllllllled him,  he wailed. Then he began to shake. It started with no more than a little shivering, but within a few short heartbeats he had collapsed across the castle, his limbs flailing about violently. White towers and snowy bridges shattered and fell on all sides. Sansa stood horrified, but Petyr Baelish seized her cousin’s wrists and shouted for the maester.  Guards and serving girls arrived within instants to help restrain the boy, Maester Colemon a short time later. Robert Arryn’s shaking sickness was nothing new to the people of the Eyrie, and Lady Lysa had trained them all to come rushing at the boy’s first cry. The maester held the little lord’s head and gave him half a cup of dreamwine, murmuring soothing words. Slowly the violence of the fit seemed to ebb away, till nothing remained but a small shaking of the hands.  Help him to my chambers,  Colemon told the guards.  A leeching will help calm him.    It was my fault.  Sansa showed them the doll’s head.  I ripped his doll in two. I never meant to, but…    His lordship was destroying the castle,  said Petyr.   A giant,  the boy whispered, weeping.  It wasn’t me, it was a giant hurt the castle. She killed him! I hate her! She’s a bastard and I hate her! I don’t want to be leeched!    My lord, your blood needs thinning,  said Maester Colemon."
}