{
  "id": "9721878c5eb775437fa6074a495a26b0316087e4",
  "text": "  Soon  they  could  hear  even  the  flap  of  the  goblin  feet,  many  many  feet which  seemed  only  just  round  the  last  corner.  The  blink  of  red  torches  could  be  seen  behind  them  in  the tunnel they were following; and they were getting deadly tired.  \"Why,  O  why  did  I  ever  leave  my  hobbit-hole!\"  said  poor  Mr.  Baggins  bumping up and down on Bombur's back.  \"Why, O why did I ever bring a wretched little hobbit on a treasure hunt!\" said  poor Bombur, who was fat, and staggered along with the sweat dripping down his  nose in his heat and terror.   At  this  point  Gandalf  fell  behind,  and  Thorin  with  him.  They  turned  a  sharp  corner. \"About turn!\" he shouted. \"Draw your sword, Thorin!\"  There was nothing else  to be done; and  the goblins did not  like  it. They came  scurrying  round  the corner  in  full cry, and  found Goblin-cleaver and Foe-hammer   ####-shining  cold  and  bright  right  in  their  astonished  eyes.  The  ones  in  front  dropped  their  torches  and  gave  one  yell  before  they  were  killed.  The  ones  behind  yelled  still  more,  and  leaped  back  knocking  over  those  that  were  running  after  them.  \"Biter  and Beater!\"  they  shrieked;  and  soon  they were  all  in  confusion,  and most  of them were hustling back the way they had come.  It was quite a  long while before any of  them dared  to  turn  that comer. By  that  time the dwarves had gone on again, a long, long, way on into the dark tunnels of  the  goblins'  realm.  When  the  goblins  discovered  that,  they  put  out  their  torches  and they slipped on soft shoes, and they chose out their very quickest runners with  the sharpest ears and eyes. These ran forward, as swift as weasels in the dark,  and  with hardly any more noise than bats.  That  is  why  neither  Bilbo,  nor  the  dwarves,  nor  even  Gandalf  heard  them  coming. Nor did they see them. But they were seen by the goblins that ran silently  up  behind,  for  Gandalf  was  letting  his  wand  give  out  a  faint  light  to  help  the  dwarves as they went along.  Quite suddenly Dori, now at the back again carrying Bilbo, was grabbed from  behind in the dark. He shouted and fell; and the hobbit rolled off his shoulders into  the blackness, bumped his head on hard rock, and remembered nothing more.     ####-<h4>Chapter 5 </h4> <br>  Riddles in the Dark     When Bilbo opened his eyes, he wondered  if he had; for  it was  just as dark as  with them shut. No one was anywhere near him. Just imagine his fright! He could  hear nothing, see nothing, and he could feel nothing except the stone of the floor.   Very slowly he got up and groped about on all fours, till he touched the wall of  the  tunnel;  but  neither  up  nor  down  it  could  he  find  anything:  nothing  at  all,  no  sign of goblins, no sign of dwarves. His head was swimming, and he was far from  certain  even  of  the  direction  they  had  been  going  in  when  he  had  his  fall.  He  guessed  as well  as  he  could,  and  crawled  along  for  a  good way,  till  suddenly  his  hand met what felt like a tiny ring of cold metal lying on the floor of the tunnel. It  was  a  turning  point  in  his  career,  but  he  did  not  know  it.  He  put  the  ring  in  his  pocket  almost without  thinking;  certainly  it  did  not  seem  of  any  particular  use  at  the moment. He did not go much  further, but sat down on  the cold  floor and gave  himself  up  to  complete  miserableness,  for  a  long  while.  He  thought  of  himself  frying bacon and eggs  in his own kitchen at home  - for he could feel inside that it  was high time for some meal or other; but that only made him miserabler.   He could not think what to do; nor could he think what had happened; or why  he  had  been  left  behind;  or  why,  if  he  had  been  left  behind,  the  goblins  had  not  caught  him;  or  even  why  his  head  was  so  sore.  The  truth  was  he  had  been  lying  quiet, out of sight and out of mind, in a very dark corner for a long while.  After some time he felt for his pipe. It was not broken, and that was something.  Then  he  felt  for  his  pouch,  and  there  was  some  tobacco  in  it,  and  that  was  something more. Then he felt for matches and he could not find any at all, and that  shattered his hopes completely. Just as well for him, as he agreed when he came to  his senses. Goodness knows what the striking of matches and the smell of tobacco  would  have  brought  on  him  out  of  dark  holes  in  that  horrible  place.  Still  at  the  moment he felt very crushed. But in slapping all his pockets and feeling all round  himself  for matches his hand came on  the hilt of his  little sword  - the little dagger  that he got from the trolls, and that he had quite forgotten; nor do the goblins seem  to have noticed it, as he wore it inside his breeches.  Now  he  drew  it  out.  It  shone  pale  and  dim  before  his  eyes.  \"So  it  is  an  elvish  blade, too,\" he thought; \"and goblins are not very near, and yet not far enough."
}