{
  "id": "973018a9b4b32b0e25d5f3ec77f131d0377113cc",
  "text": "  \"I  can  give  you  a  day  or  two more.  Probably  I  can  help  you  out of your  present  plight,  and  I  need  a  little  help myself. We  have  no  food,  and  no  baggage,  and no ponies to ride; and you don't know where you are. Now I can tell you that.  You are still some miles north of the path which we should have been following, if  we  had  not  left  the mountain  pass  in  a  hurry.  Very  few people  live  in  these parts,  unless  they  have  come  here  since  I was  last  down  this way, which  is  some  years  ago.  But  there  is  somebody  that  I  know  of,  who  lives  not  far  away.  That  Somebody made the  steps on the great rock-the Carrock I believe he calls it. He does not come here  often,  certainly  not  in  the  daytime,  and  it  is  no  good  waiting  for  him.  In  fact  it  would  be  very  dangerous. We  must  go  and  find  him;  and  if  all  goes  well  at  our  meeting,  I  think I shall be off and wish you like the eagles  'farewell wherever you  fare!' \"  They  begged  him  not  to  leave  them. They  offered  him  dragon-gold and silver  and jewels, but he would not change his mind.  \"We  shall  see, we  shall  see!\" he  said,  \"and  I  think  I have earned already some  of your dragon-gold - when you have got it.\"   ####-  After that they stopped pleading. Then they took off their clothes and bathed in  the river, which was shallow and clear and stony at the ford. When they had dried  in the sun, which was now strong and warm, they were refreshed, if still sore and a  little  hungry.  Soon  they  crossed  the  ford  (carrying  the  hobbit),  and  then  began  to  march  through  the  long  green  grass  and  down  the  lines  of  the  wide-armed oaks  and the tall elms.  \"And  why  is  it  called  the  Carrock?\"  asked  Bilbo  as  he  went  along  at  the  wizard's side.  \"He  called  it  the  Carrock,  because  carrock  is  his  word  for  it.  He  calls  things  like  that  carrocks,  and  this  one  is  the Carrock  because  it  is  the  only  one  near  his  home and he knows it well.\"  \"Who calls it? Who knows it?\"  \"The  Somebody  I  spoke  of-a  very  great  person.  You  must  all  be  very  polite  when  I  introduce  you.  I  shall  introduce  you  slowly,  two  by  two,  I  think;  and  you  must  be  careful  not  to  annoy  him,  or  heaven  knows what will  happen. He can be  appalling  when  he  is  angry,  though  he  is  kind  enough  if  humoured.  Still  I  warn  you he gets angry easily.\"  The dwarves all gathered round when they heard the wizard talking like this to  Bilbo.  \"Is  that  the  person  you  are  taking  us  to  now?\"  they  asked.  \"Couldn't  you  find someone more easy-tempered? Hadn't you better explain it all a bit clearer?\"- and so on.  \"Yes  it  certainly  is!  No  I  could  not!  And  I  was  explaining  very  carefully,\"  answered  the  wizard  crossly.  \"If  you  must  know  more,  his  name  is  Beorn. He  is  very strong, and he is a skin-changer.\"  \"What!  a  furrier,  a  man  that  calls  rabbits  conies,  when  he  doesn't  turn  their  skins into squirrels?\" asked Bilbo.  \"Good gracious heavens, no, no, NO, NO!\" said Gandalf. \"Don't be a fool Mr.  Baggins  if you  can help  it; and  in  the name of all wonder don't mention  the word  furrier  again  as  long  as  you  are  within  a  hundred  miles  of  his  house,  nor,  rug,  cape,  tippet, muff, nor any other such unfortunate word! He  is a skin-changer. He  changes  his  skin;  sometimes  he  is  a  huge  black  bear,  sometimes  he  is  a  great  strong black-haired man with huge arms and a great beard. I cannot tell you much  more,  though  that ought  to be enough. Some say  that he  is a bear descended from  the  great  and  ancient  bears  of  the  mountains  that  lived  there  before  the  giants  came. Others  say  that he  is  a man descended  from  the  first men who  lived before  Smaug  or  the  other  dragons  came  into  this  part  of  the  world,  and  before  the   ####-goblins came into the hills out of the North. I cannot say, though I fancy the last is  the true tale. He is not the sort of person to ask questions of.  \"At any rate he is under no enchantment but his own. He lives in an oak-wood  and has a great wooden house; and as a man he keeps cattle and horses which are  nearly  is marvellous  as himself. They work  for him  and  talk  to him. He does not  eat  them;  neither  does  he  hunt  or  eat  wild  animals.  He  keeps  hives  and  hives  of  great fierce bees, and  lives most on cream and honey. As a bear he ranges far and  wide.  I  once  saw  him  sitting all alone on the top of the Carrock at night watching  the  moon  sinking  towards  the  Misty  Mountains,  and  I  heard  him  growl  in  the  tongue  of  bears;  'The  day  will  come  when  they  will  perish  and  I  shall  go  back!'  That is why I believe he once came from the mountains himself.\"    Bilbo and the dwarves had now plenty to think about, and they asked no more  questions."
}