{
  "id": "97619ddde17be6992912e1b0eebc16c42eb32f8b",
  "text": " Weasley.  \"He works for the Department for the Regulation and Control of Magical Creatures.  And I think you know his son, Cedric?\" Cedric Diggory was an extremely handsome boy of around seventeen.  He was Captain and Seeker of the Hufflepuff House Quidditch team at Hogwarts. \"Hi,\" said Cedric, looking around at them all. Everybody said hi back except Fred and George, who merely nodded.  They had never quite forgiven Cedric for beating their team, Gryffindor, in the first Quidditch match of the previous year. \"Long walk, Arthur?\"  Cedric's father asked.  \"Not too bad,\" said Mr. Weasley.  \"We live just on the other side of the village there. You?\" \"Had to get up at two, didn't we, Ced?  I tell you, I'll be glad when he's got his Apparition test.  Still ... not complaining ... Quidditch World Cup, wouldn't miss it for a sackful of Galleons - and the tickets cost about that. Mind you, looks like I got off easy. . . .\" Amos Diggory peered good-naturedly around at the three Weasley boys, Harry, Hermione, and Ginny.  \"All these yours, Arthur?\" \"Oh no, only the redheads,\" said Mr. Weasley, pointing out his children.  \"This is Hermione, friend of Ron's - and Harry, another friend -\" \"Merlin's beard,\" said Amos Diggory, his eyes widening. \"Harry? Harry Potter?\" \"Er - yeah,\" said Harry. Harry was used to people looking curiously at him when they met him, used to the way their eyes moved at once to the lightning scar on his forehead, but it always made him feel uncomfortable. \"Ced's talked about you, of course,\" said Amos Diggory.  \"Told us all about playing against you last year... I said to him, I said - Ced, that'll be something to tell your grandchildren, that will.... You beat Harry Potter!\" Harry couldn't think of any reply to this, so he remained silent. Fred and George were both scowling again.  Cedric looked slightly embarrassed. \"Harry fell off his broom, Dad,\" he muttered.  I told you ... it was an accident....\" \"Yes, but you didn't fall off, did you?\" roared Amos genially, slapping his son on his back. \"Always modest, our Ced, always the gentleman ... but the best man won, I'm sure Harry'd say the same, wouldn't you, eh?  One falls off his broom, one stays on, you don't need to be a genius to tell which one's the better flier!\" \"Must be nearly time,\" said Mr. Weasley quickly, pulling out his watch again.  \"Do you know whether we're waiting for any more, Amos?\" \"No, the Lovegoods have been there for a week already and the Fawcetts couldn't get tickets,\" said Mr. Diggory.  \"There aren't any more of us in this area, are there?\" \"Not that I know of,\" said Mr. Weasley.  \"Yes, it's a minute off ... We'd better get ready....\" He looked around at Harry and Hermione. \"You just need to touch the Portkey, that's all, a finger will do -\" With difficulty, owing to their bulky backpacks, the nine of them crowded around the old boot held out by Amos Diggory. They all stood there, in a tight circle, as a chill breeze swept over the hilltop.  Nobody spoke.  It suddenly occurred to Harry how odd this would look if a Muggle were to walk up here now ... nine people, two of them grown men, clutching this manky old boot in the semidarkness, waiting.... \"Three. . .\" muttered Mr. Weasley, one eye still on his watch, two. . . one. . .\" It happened immediately:  Harry felt as though a hook just behind his navel had been suddenly jerked irresistibly forward.  His feet left the ground; he could feel Ron and Hermione on either side of him, their shoulders banging into his; they were all speeding forward in a howl of wind and swirling color; his forefinger was stuck to the boot as though it was pulling him magnetically onward and then - His feet slammed into the ground; Ron staggered into him and he fell over; the Portkey hit the ground near his head with a heavy thud. Harry looked up. Mr. Weasley, Mr. Diggory, and Cedric were still standing, though looking very windswept; everybody else was on the ground. \"Seven past five from Stoatshead Hill,\" said a voice.  CHAPTER SEVEN - BAGMAN AND CROUCH  Harry disentangled himself from Ron and got to his feet.  They had arrived on what appeared to be a deserted stretch of misty moor.  In front of them was a pair of tired and grumpy-looking wizards, one of whom was holding a large gold watch, the other a thick roll of parchment and a quill.  Both were dressed as Muggles, though very inexpertly:  The man with the watch wore a tweed suit with thigh-length galoshes; his colleague, a kilt and a poncho. \"Morning, Basil,\" said Mr. Weasley, picking up the boot and handing it to the kilted wizard, who threw it into a large box of used Portkeys beside him; Harry could see an old newspaper, an empty drinks can, and a punctured football. \"Hello there, Arthur,\" said Basil wearily.  \"Not on duty, eh?  It's all right for some.... We've been here all night.... You'd better get out of the way, we've got a big party coming in from the Black Forest at five fifteen.  Hang on, I'll find your campsite.... Weasley ..."
}