{
  "id": "9895265ea821b4458e21be009bf5e37d197fc3f3",
  "text": " Not only were there a dozen frost-covered Christmas trees and thick streamers of holly and mistletoe crisscrossing the ceiling, but enchanted snow was falling, warm and dry, from the ceiling. Dumbledore led them in a few of his favorite carols, Hagrid booming more and more loudly with every goblet of eggnog he consumed. Percy, who hadn't noticed that Fred had bewitched his prefect badge so that it now read \"Pinhead,\" kept asking them all what they were sniggering at. Harry didn't even care that Draco Malfoy was making loud, snide remarks  * 2:L2 *  about his new sweater from the Slytherin table. With a bit of luck, Malfoy would be getting his comeuppance in a few hours' time.  Harry and Ron had barely finished their third helpings of Christmas pudding when Hermione ushered them out of the hall to finalize their plans for the evening.  \"We still need a bit of the people you're changing into,\" said Hermione matter-of-facdy, as though she were sending them to the supermarket for laundry detergent. \"And obviously, it'll be best if you can get something of Crabbe's and Goyle's; they're Malfoys best friends, he'll tell them anything. And we also need to make sure the real Crabbe and Goyle can't burst in on us while we're interrogating him.  \"I've got it all worked out,\" she went on smoothly, ignoring Harry's and Ron's stupefied faces. She held up two plump chocolate cakes. \"I've filled these with a simple Sleeping Draught. All you have to do is make sure Crabbe and Goyle find them. You know how greedy they are, they're bound to eat them. Once they're asleep, pull out a few of their hairs and hide them in a broom closet.\"  Harry and Ron looked incredulously at each other.  \"Hermione, I don't think -\"  \"That could go seriously wrong -\"  But Hermione had a steely glint in her eye not unlike the one Professor McGonagall sometimes had.  \"The potion will be useless without Crabbe's and Goyle's hair,\" she said sternly. \"You do want to investigate Malfoy, don't you?\"  \"Oh, all right, all right,\" said Harry. \"But what about you? Whose hair are you ripping out?\"  *213*  \"I've already got mine!\" said Hermione brightly, pulling a tiny bottle out of her pocket and showing them the single hair inside it. \"Remember Millicent Bulstrode wrestling with me at the Dueling Club? She left this on my robes when she was trying to strangle me! And she's gone home for Christmas - so I'll just have to tell the Slytherins I've decided to come back.\"  When Hermione had bustled off to check on the Polyjuice Potion again, Ron turned to Harry with a doom-laden expression.  \"Have you ever heard of a plan where so many things could go wrong?\"  But to Harry's and Ron's utter amazement, stage one of the operation went just as smoothly as Hermione had said. They lurked in the deserted entrance hall after Christmas tea, waiting for Crabbe and Goyle who had remained alone at the Slytherin table, shoveling down fourth helpings of trifle. Harry had perched the chocolate cakes on the end of the banisters. When they spotted Crabbe and Goyle coming out of the Great Hall, Harry and Ron hid quickly behind a suit of armor next to the front door.  \"How thick can you get?\" Ron whispered ecstatically as Crabbe gleefully pointed out the cakes to Goyle and grabbed them. Grinning stupidly, they stuffed the cakes whole into their large mouths. For a moment, both of them chewed greedily, looks of triumph on their faces. Then, without the smallest change of expression, they both keeled over backward onto the floor.  By far the hardest part was hiding them in the closet across the hall. Once they were safely stowed among the buckets and mops, Harry yanked out a couple of the bristles that covered Goyle's fore  * _2 14 *  head and Ron pulled out several of Crabbe's hairs. They also stole their shoes, because their own were far too small for Crabbe- and Goyle-size feet. Then, still stunned at what they had just done, they sprinted up to Moaning Myrtle's bathroom.  They could hardly see for the thick black smoke issuing from the stall in which Hermione was stirring the cauldron. Pulling their robes up over their faces, Harry and Ron knocked softly on the door.  \"Hermione?\"  They heard the scrape of the lock and Hermione emerged, shiny- faced and looking anxious. Behind her they heard the gloop gloop of the bubbling, glutinous potion. Three glass tumblers stood ready on the toilet seat.  \"Did you get them?\" Hermione asked breathlessly.  Harry showed her Goyle's hair.  \"Good. And I sneaked these spare robes out of the laundry,\" Hermione said, holding up a small sack. \"You'll need bigger sizes once you're Crabbe and Goyle.\"  The three of them stared into the cauldron. Close up, the potion looked like thick, dark mud, bubbling sluggishly.  \"I'm sure I've done everything right,\" said Hermione, nervously rereading the splotched page of Moste Potente Potions. \"It looks like the book says it should ... once we've drunk it, we'll have exactly an hour before we change back into ourselves."
}