{
  "id": "98f634c21fd06372b0c2a460ed7f6452fd25c012",
  "text": " You’re to go with Lord Davos.    I am?  Edric got to his feet.  Where are we going?  His mouth set stubbornly.  I won’t go pray to the Lord of Light. I am a Warrior’s man, like my father.    We know,  Davos said.  Come, lad, we must not dawdle.   Edric donned a thick hooded cloak of undyed wool. Maester Pylos helped him fasten it, and pulled the hood up to shadow his face.  Are you coming with us, Maester?  the boy asked.   No.  Pylos touched the chain of many metals he wore about his neck.  My place is here on Dragonstone. Go with Lord Davos now, and do as he says. He is the King’s Hand, remember. What did I tell you about the King’s Hand?    The Hand speaks with the king’s voice.   The young maester smiled.  That’s so. Go now.   Davos had been uncertain of Pylos. Perhaps he resented him for taking old Cressen’s place. But now he could only admire the man’s courage. This could mean his life as well.  Outside the maester’s chambers, Ser Gerald Gower waited by the steps. Edric Storm looked at him curiously. As they made their descent he asked,  Where are we going, Lord Davos?    To the water. A ship awaits you.   The boy stopped suddenly.  A ship?    One of Salladhor Saan’s. Salla is a good friend of mine.    I shall go with you, Cousin,  Ser Andrew assured him.  There’s nothing to be frightened of.    I am not frightened,  Edric said indignantly.  Only… is Shireen coming too?    No,  said Davos.  The princess must remain here with her father and mother.    I have to see her then,  Edric explained.  To say my farewells. Otherwise she’ll be sad.   Not so sad as if she sees you burn.  There is no time,  Davos said.  I will tell the princess that you were thinking of her. And you can write her, when you get to where you’re going.   The boy frowned.  Are you sure I must go? Why would my uncle send me from Dragonstone? Did I displease him? I never meant to.  He got that stubborn look again.  I want to see my uncle. I want to see King Stannis.   Ser Andrew and Ser Gerald exchanged a look.  There’s no time for that, Cousin,  Ser Andrew said.   I want to see him!  Edric insisted, louder.   He does not want to see you.  Davos had to say something, to get the boy moving.  I am his Hand, I speak with his voice. Must I go to the king and tell him that you would not do as you were told? Do you know how angry that will make him? Have you ever seen your uncle angry?  He pulled off his glove and showed the boy the four fingers that Stannis had shortened.  I have.   It was all lies; there had been no anger in Stannis Baratheon when he cut the ends off his onion knight’s fingers, only an iron sense of justice. But Edric Storm had not been born then, and could not know that. And the threat had the desired effect.  He should not have done that,  the boy said, but he let Davos take him by the hand and draw him down the steps.  The Bastard of Nightsong joined them at the cellar door. They walked quickly, across a shadowed yard and down some steps, under the stone tail of a frozen dragon. Lewys the Fishwife and Omer Blackberry waited at the postern gate, two guards bound and trussed at their feet.  The boat?  Davos asked them.   It’s there,  Lewys said.  Four oarsmen. The galley is anchored just past the point. Mad Prendos.   Davos chuckled. A ship named after a madman. Yes, that’s fitting. Salla had a streak of the pirate’s black humor.  He went to one knee before Edric Storm.  I must leave you now,  he said.  There’s a boat waiting, to row you out to a galley. Then it’s off across the sea. You are Robert’s son so I know you will be brave, no matter what happens.    I will. Only…  The boy hesitated.   Think of this as an adventure, my lord.  Davos tried to sound hale and cheerful.  It’s the start of your life’s great adventure. May the Warrior defend you.    And may the Father judge you justly, Lord Davos.  The boy went with his cousin Ser Andrew out the postern gate. The others followed, all but the Bastard of Nightsong. May the Father judge me justly, Davos thought ruefully. But it was the king’s judgment that concerned him now.   These two?  asked Ser Rolland of the guards, when he had closed and barred the gate.   Drag them into a cellar,  said Davos.  You can cut them free when Edric’s safely under way.   The Bastard gave a curt nod. There were no more words to say; the easy part was done. Davos pulled his glove on, wishing he had not lost his luck. He had been a better man and a braver one with that bag of bones around his neck. He ran his shortened fingers through thinning brown hair, and wondered if it needed to be cut. He must look presentable when he stood before the king.  Dragonstone had never seemed so dark and fearsome. He walked slowly, his footsteps echoing off black walls and dragons. Stone dragons who will never wake, I pray. The Stone Drum loomed huge ahead of him. The guards at the door uncrossed their spears as he approached. Not for the onion knight, but for the King’s Hand. Davos was the Hand going in, at least."
}