{
  "id": "9907a846839e79f5ef0fe6f86a3d79b2e15f262f",
  "text": "    Oh, is it love we’re talking now? And here I thought it was just cocks and cunts.    Is it love you fancy?  He’d decided that he liked this wench, whoever she was; her sharp wit was a welcome respite from the damp gloom of Pyke.  Shall I name my longship after you, and play you the high harp, and keep you in a tower room in my castle with only jewels to wear, like a princess in a song?    You ought to name your ship after me,  she said, ignoring all the rest.  It was me who built her.    Sigrin built her. My lord father’s shipwright.    I’m Esgred. Ambrode’s daughter, and wife to Sigrin.   He had not known that Ambrode had a daughter, or Sigrin a wife… but he’d met the younger shipwright only once, and the older one he scarce remembered.  You’re wasted on Sigrin.    Oho. Sigrin told me this sweet ship is wasted on you.   Theon bristled.  Do you know who I am?    Prince Theon of House Greyjoy. Who else? Tell me true, my lord, how well do you love her, this new maid of yours? Sigrin will want to know.   The longship was so new that she still smelled of pitch and resin. His uncle Aeron would bless her on the morrow, but Theon had ridden over from Pyke to get a look at her before she was launched. She was not so large as Lord Balon’s own Great Kraken or his uncle Victarion’s Iron Victory, but she looked swift and sweet, even sitting in her wooden cradle on the strand; lean black hull a hundred feet long, a single tall mast, fifty long oars, deck enough for a hundred men… and at the prow, the great iron ram in the shape of an arrowhead.  Sigrin did me good service,  he admitted.  Is she as fast as she looks?    Faster—for a master that knows how to handle her.    It has been a few years since I sailed a ship.  And I’ve never captained one, if truth be told.  Still, I’m a Greyjoy, and an ironman. The sea is in my blood.    And your blood will be in the sea, if you sail the way you talk,  she told him.   I would never mistreat such a fair maiden.    Fair maiden?  She laughed.  She’s a sea bitch, this one.    There, and now you’ve named her. Sea Bitch.   That amused her; he could see the sparkle in her dark eyes.  And you said you’d name her after me,  she said in a voice of wounded reproach.   I did.  He caught her hand.  Help me, my lady. In the green lands, they believe a woman with child means good fortune for any man who beds her.    And what would they know about ships in the green lands? Or women, for that matter? Besides, I think you made that up.    If I confess, will you still love me?    Still? When have I ever loved you?    Never,  he admitted,  but I am trying to repair that lack, my sweet Esgred. The wind is cold. Come aboard my ship and let me warm you. On the morrow my uncle Aeron will pour seawater over her prow and mumble a prayer to the Drowned God, but I’d sooner bless her with the milk of my loins, and yours.    The Drowned God might not take that kindly.    Bugger the Drowned God. If he troubles us, I’ll drown him again. We’re off to war within a fortnight. Would you send me into battle all sleepless with longing?    Gladly.    A cruel maid. My ship is well named. If I steer her onto the rocks in my distraction, you’ll have yourself to blame.    Do you plan to steer with this?  Esgred brushed the front of his breeches once more, and smiled as a finger traced the iron outline of his manhood.   Come back to Pyke with me,  he said suddenly, thinking, What will Lord Balon say? And why should I care? I am a man grown, if I want to bring a wench to bed it is no one’s business but my own.   And what would I do in Pyke?  Her hand stayed where it was.   My father will feast his captains tonight.  He had them to feast every night, while he waited for the last stragglers to arrive, but Theon saw no need to tell all that.   Would you make me your captain for the night, my lord prince?  She had the wickedest smile he’d ever seen on a woman.   I might. If I knew you’d steer me safe into port.    Well, I know which end of the oar goes in the sea, and there’s no one better with ropes and knots.  One-handed, she undid the lacing of his breeches, then grinned and stepped lightly away from him.  A pity I’m a woman wed, and new with child.   Flustered, Theon laced himself back up.  I need to start back to the castle. if you do not come with me, I may lose my way for grief, and all the islands would be poorer.    We couldn’t have that… but I have no horse, my lord.    You could take my squire’s mount.    And leave your poor squire to walk all the way to Pyke?    Share mine, then.    You’d like that well enough.  The smile again.  Now, would I be behind you, or in front?    You would be wherever you liked.    I like to be on top.   Where has this wench been all my life?  My father’s hall is dim and dank. It needs Esgred to make the fires blaze.    The lordling has a honeyed tongue.    Isn’t that where we began?   She threw up her hands.  And where we end. Esgred is yours, sweet prince. Take me to your castle. Let me see your proud towers rising from the sea."
}