{
  "id": "9ddab6ebe20c2a81bbd8090ae4a6113e31d6ac8a",
  "text": " They passed the last of the apple trees and crested a rise, and the castles, river, and camps all appeared at once. There were hundreds of horses and thousands of men, most of them milling about the three huge feast tents that stood side by side facing the castle gates, like three great canvas longhalls. Robb had made his camp well back from the walls, on higher, drier ground, but the Green Fork had overflown its bank and even claimed a few carelessly placed tents.  The music from the castles was louder here. The sound of the drums and horns rolled across the camp. The musicians in the nearer castle were playing a different song than the ones in the castle on the far bank, though, so it sounded more like a battle than a song.  They’re not very good,  Arya observed.  The Hound made a sound that might have been a laugh.  There’s old deaf women in Lannisport complaining of the din, I’ll warrant. I’d heard Walder Frey’s eyes were failing, but no one mentioned his bloody ears.   Arya found herself wishing it were day. If the sun was out and the wind was blowing, she would have been able to see the banners better. She would have looked for the direwolf of Stark, or maybe the Cerwyn battleaxe or the Glover fist. But in the gloom of night all the colors looked grey. The rain had dwindled down to a fine drizzle, almost a mist, but an earlier downpour had left the banners wet as dishrags, sodden and unreadable.  A hedge of wagons and carts had been drawn up along the perimeter to make a crude wooden wall against any attack. That was where the guards stopped them. The lantern their sergeant carried shed enough light for Arya to see that his cloak was a pale pink, spotted with red teardrops. The men under him had the Leech Lord’s badge sewn over their hearts, the flayed man of the Dreadfort. Sandor Clegane gave them the same tale he’d used on the outriders, but the Bolton sergeant was a harder sort of nut than Ser Donnel Haigh had been.  Salt pork’s no fit meat for a lord’s wedding feast,  he said scornfully.   Got pickled pigs’ feet too, ser.    Not for the feast, you don’t. The feast’s half done. And I’m a northman, not some milksuck southron knight.    I was told to see the steward, or the cook…    Castle’s closed. The lordlings are not to be disturbed.  The sergeant considered a moment.  You can unload by the feast tents, there.  He pointed with a mailed hand.  Ale makes a man hungry, and old Frey won’t miss a few pigs’ feet. He don’t have the teeth for such anyhow. Ask for Sedgekins, he’ll know what’s to be done with you.  He barked a command, and his men rolled one of the wagons aside for them to enter.  The Hound’s whip spurred the team toward the tents. No one seemed to pay them any mind. They splashed past rows of brightly colored pavilions, their walls of wet silk lit up like magic lanterns by lamps and braziers inside; pink and gold and green they glimmered, striped and fretty and chequy, emblazoned with birds and beasts, chevrons and stars, wheels and weapons. Arya spotted a yellow tent with six acorns on its panels, three over two over one. Lord Smallwood, she knew, remembering Acorn Hall so far away, and the lady who’d said she was pretty.  But for every shimmering silk pavilion there were two dozen of felt or canvas, opaque and dark. There were barracks tents too, big enough to shelter two score footsoldiers, though even those were dwarfed by the three great feast tents. The drinking had been going on for hours, it seemed. Arya heard shouted toasts and the clash of cups, mixed in with all the usual camp sounds, horses whinnying and dogs barking, wagons rumbling through the dark, laughter and curses, the clank and clatter of steel and wood. The music grew still louder as they approached the castle, but under that was a deeper, darker sound: the river, the swollen Green Fork, growling like a lion in its den.  Arya twisted and turned, trying to look everywhere at once, hoping for a glimpse of a direwolf badge, for a tent done up in grey and white, for a face she knew from Winterfell. All she saw were strangers. She stared at a man relieving himself in the reeds, but he wasn’t Alebelly. She saw a half-dressed girl burst from a tent laughing, but the tent was pale blue, not grey like she’d thought at first, and the man who went running after her wore a treecat on his doublet, not a wolf. Beneath a tree, four archers were slipping waxed strings over the notches of their longbows, but they were not her father’s archers. A maester crossed their path, but he was too young and thin to be Maester Luwin. Arya gazed up at the Twins, their high tower windows glowing softly wherever a light was burning. Through the haze of rain, the castles looked spooky and mysterious, like something from one of Old Nan’s tales, but they weren’t Winterfell.  The press was thickest at the feast tents. The wide flaps were tied back, and men were pushing in and out with drinking horns and tankards in their hands, some with camp followers."
}