{
  "id": "a1c1588da4af51f7cc924938dd8cf2dcb638aa41",
  "text": "   She had to bite her lip to keep from sobbing.  The wedding feast was held in the Small Hall. There were perhaps fifty guests; Lannister retainers and allies for the most part, joining those who had been at the wedding. And here Sansa found the Tyrells. Margaery gave her such a sad look, and when the Queen of Thorns tottered in between Left and Right, she never looked at her at all. Elinor, Alla, and Megga seemed determined not to know her. My friends, Sansa thought bitterly.  Her husband drank heavily and ate but little. He listened whenever someone rose to make a toast and sometimes nodded a curt acknowledgment, but otherwise his face might have been made of stone. The feast seemed to go on forever, though Sansa tasted none of the food. She wanted it to be done, and yet she dreaded its end. For after the feast would come the bedding. The men would carry her up to her wedding bed, undressing her on the way and making rude jokes about the fate that awaited her between the sheets, while the women did Tyrion the same honors. Only after they had been bundled naked into bed would they be left alone, and even then the guests would stand outside the bridal chamber, shouting ribald suggestions through the door. The bedding had seemed wonderfully wicked and exciting when Sansa was a girl, but now that the moment was upon her she felt only dread. She did not think she could bear for them to rip off her clothes, and she was certain she would burst into tears at the first randy jape.  When the musicians began to play, she timidly laid her hand on Tyrion’s and said,  My lord, should we lead the dance?   His mouth twisted.  I think we have already given them sufficent amusement for one day, don’t you?    As you say, my lord.  She pulled her hand back.  Joffrey and Margaery led in their place. How can a monster dance so beautifully? Sansa wondered. She had often daydreamed of how she would dance at her wedding, with every eye upon her and her handsome lord. In her dreams they had all been smiling. Not even my husband is smiling.  Other guests soon joined the king and his betrothed on the floor. Elinor danced with her young squire, and Megga with Prince Tommen. Lady Merryweather, the Myrish beauty with the black hair and the big dark eyes, spun so provocatively that every man in the hall was soon watching her. Lord and Lady Tyrell moved more sedately. Ser Kevan Lannister begged the honor of Lady Janna Fossoway, Lord Tyrell’s sister. Merry Crane took the floor with the exile prince Jalabhar Xho, gorgeous in his feathered finery. Cersei Lannister partnered first Lord Redwyne, then Lord Rowan, and finally her own father, who danced with smooth unsmiling grace.  Sansa sat with her hands in her lap, watching how the queen moved and laughed and tossed her blonde curls. She charms them all, she thought dully. How I hate her. She looked away, to where Moon Boy danced with Dontos.   Lady Sansa.  Ser Garlan Tyrell stood beside the dais.  Would you honor me? If your lord consents?   The Imp’s mismatched eyes narrowed.  My lady can dance with whomever she pleases.   Perhaps she ought to have remained beside her husband, but she wanted to dance so badly… and Ser Garlan was brother to Margaery, to Willas, to her Knight of Flowers.  I see why they name you Garlan the Gallant, ser,  she said, as she took his hand.   My lady is gracious to say so. My brother Willas gave me that name, as it happens. To protect me.    To protect you?  She gave him a puzzled look.  Ser Garlan laughed.  I was a plump little boy, I fear, and we do have an uncle called Garth the Gross. So Willas struck first, though not before threatening me with Garlan the Greensick, Garlan the Galling, and Garlan the Gargoyle.   It was so sweet and silly that Sansa had to laugh, despite everything. Afterward she was absurdly grateful. Somehow the laughter made her hopeful again, if only for a little while. Smiling, she let the music take her, losing herself in the steps, in the sound of flute and pipes and harp, in the rhythm of the drum… and from time to time in Ser Garlan’s arms, when the dance brought them together.  My lady wife is most concerned for you,  he said quietly, one such time.   Lady Leonette is too sweet. Tell her I am well.    A bride at her wedding should be more than well.  His voice was not unkind.  You seemed close to tears.    Tears of joy, ser.    Your eyes give the lie to your tongue.  Ser Garlan turned her, drew her close to his side.  My lady, I have seen how you look at my brother. Loras is valiant and handsome, and we all love him dearly… but your Imp will make a better husband. He is a bigger man than he seems, I think.   The music spun them apart before Sansa could think of a reply. It was Mace Tyrell opposite her, red-faced and sweaty, and then Lord Merryweather, and then Prince Tommen.  I want to be married too,  said the plump little princeling, who was all of nine.  I’m taller than my uncle!    I know you are,  said Sansa, before the partners changed again."
}