{
  "id": "a3e422214ad1e064b0c82a25a7c3a9716dc22711",
  "text": " I shall not conceal from you that I have very little patience with it. True Seers are very rare, and Professor Trelawney --\"  She stopped again, and then said, in a very matter-of-fact tone, \"You look in excellent health to me, Potter, so you will excuse me if I don't let you off homework today. I assure you that if you die, you need not hand it in.\"  Hermione laughed. Harry felt a bit better. It was harder to feel scared of a lump of tea leaves away from the dim red light and befuddling perfume of Professor Trelawney's classroom. Not everyone was convinced, however. Ron still looked worried, and Lavender whispered, \"But what about Neville's cup?\"  When the Transfiguration class had finished, they joined the crowd thundering toward the Great Hall for lunch.  \"Ron, cheer up,\" said Hermione, pushing a dish of stew toward him. \"You heard what Professor McGonagall said.\"  Ron spooned stew onto his plate and picked up his fork but didn't start.  \"Harry,\" he said, in a low, serious voice, \"You haven't seen a great black dog anywhere, have you?\"  \"Yeah, I have,\" said Harry. \"I saw one the night I left the Dursleys'. \"  Ron let his fork fall with a clatter.  \"Probably a stray,\" said Hermione calmly.  Ron looked at Hermione as though she had gone mad.  \"Hermione, if Harry's seen a Grim, that's -- that's bad,\" he said. \"My -- my uncle Bilius saw one and -- and he died twenty-four hours later!\"  \"Coincidence,\" said Hermione airily, pouring herself some pumpkin juice.  \"You don't know what you're talking about!\" said Ron, starting to get angry. \"Grims scare the living daylights out of most wizards!\"  \"There you are, then,\" said Hermione in a superior tone. \"They see the Grim and die of fright. The Grim's not an omen, it's the cause of death! And Harry's still with us because he's not stupid enough to see one and think, right, well, I'd better kick the bucket then!\"  Ron mouthed wordlessly at Hermione, who opened her bag, took out her new Arithmancy book, and propped it open against the juice jug.  \"I think Divination seems very woolly,\" she said, searching for her page. \"A lot of guesswork, if you ask me.\"  \"There was nothing woolly about the Grim in that cup!\" said Ron hotly.  \"You didn't seem quite so confident when you were telling Harry it was a sheep,\" said Hermione coolly.  \"Professor Trelawney said you didn't have the right aura! You just don't like being bad at something for a change!\"  He had touched a nerve. Hermione slammed her Arithmancy book down on the table so hard that bits of meat and carrot flew everywhere.  \"If being good at Divination means I have to pretend to see death omens in a lump of tea leaves, I'm not sure I'll be studying it much longer! That lesson was absolute rubbish compared with my Arithmancy class!\"  She snatched up her bag and stalked away.  Ron frowned after her.  \"What's she talking about?\" he said to Harry. \"She hasn't been to an Arithmancy class yet.\"  Harry was pleased to get out of the castle after lunch. Yesterday's rain had cleared; the sky was a clear, pale gray, and the grass was springy and damp underfoot as they set off for their first ever Care of Magical Creatures class.  Ron and Hermione weren't speaking to each other. Harry walked beside them in silence as they went down the sloping lawns to Hagrid's hut on the edge of the Forbidden Forest. It was only when he spotted three only-too- familiar backs ahead of them that he realized they must be having these lessons with the Slytherins. Malfoy was talking animatedly to Crabbe and Goyle, who were chortling. Harry was quite sure he knew what they were talking about.  Hagrid was waiting for his class at the door of his hut. He stood in his moleskin overcoat, with Fang the boarhound at his heels, looking impatient to start.  \"C'mon, now, get a move on!\" he called as the class approached. \"Got a real treat for yeh today! Great lesson comin' up! Everyone here? Right, follow me!\"  For one nasty moment, Harry thought that Hagrid was going to lead them into the forest; Harry had had enough unpleasant experiences in there to last him a lifetime. However, Hagrid strolled off around the edge of the trees, and five minutes later, they found themselves outside a kind of paddock. There was nothing in there.  \"Everyone gather 'round the fence here!\" he called. \"That's it -- make sure yeh can see -- now, firs' thing yeh'll want ter do is open yer books --\"  \"How?\" said the cold, drawling voice of Draco Malfoy.  \"Eh?\" said Hagrid.  \"How do we open our books?\" Malfoy repeated. He took out his copy of The Monster Book of Monsters, which he had bound shut with a length of rope. Other people took theirs out too; some, like Harry, had belted their book shut; others had crammed them inside tight bags or clamped them together with binder clips.  \"Hasn' -- hasn' anyone bin able ter open their books?\" said Hagrid, looking crestfallen.  The class all shook their heads.  \"Yeh've got ter stroke 'em,\" said Hagrid, as though this was the most obvious thing in the world."
}