{
  "id": "a4fae283e9926c60ec23a891426926a7c3430f32",
  "text": "  \"Come with me, Potter,\" said Snape.  Harry followed him downstairs, trying to wipe his hands clean on the inside of his robes without Snape noticing. They walked down the stairs to the dungeons and then into Snape's office.  Harry had been in here only once before, and he had been in very serious trouble then too. Snape had aquired a few more slimy horrible things in jars since last time, all standing on shelves behind his desk, glinting in the firelight and adding to the threatening atmosphere.  \"Sit,\" said Snape.  Harry sat. Snape, however, remained, standing.  \"Mr. Malfoy has just been to see me with a strange story, Potter,\" said Snape.  Harry didn't say anything.  \"He tells me that he was up by the Shrieking Shack when he ran into Weasley -- apparently alone.\"  Still, Harry didn't speak.  \"Mr. Malfoy states that he was standing talking to Weasley, when a large amount of mud hit him in the back of the head. How do you think that could have happened?\"  Harry tried to look mildly surprised.  \"I don't know, Professor.\"  Snape's eyes were boring into Harry's. It was exactly like trying to stare down a hippogriff. Harry tried hard not to blink.  \"Mr. Malfoy then saw an extraordinary apparition. Can you imagine what it might have been, Potter?\"  \"No,\" said Harry, now trying to sound innocently curious.  \"It was your head, Potter. Floating in midair.\"  There was a long silence.  \"Maybe he'd better go to Madam Pomfrey,\" said Harry. \"If he's seeing things like --\"  \"What would your head have been doing in Hogsmeade, Potter?\" said Snape softly. \"Your head is not allowed in Hogsmeade. No part of your body has permission to be in Hogsmeade.\"  \"I know that,\" said Harry, striving to keep his face free of guilt or fear. \"It sounds like Malfoy's having hallucin --\"  \"Malfoy is not having hallucinations,\" snarled Snape, and he bent down, a hand on each arm of Harry's chair, so that their faces were a foot apart. \"If your head was in Hogsmeade, so was the rest of you.\"  \"I've been up in Gryffindor Tower,\" said Harry. \"Like you told --\" \"Can anyone confirm that?\"  Harry didn't say anything. Snape's thin mouth curled into a horrible smile.  \"So,\" he said, straightening up again. \"Everyone from the Minister of Magic downward has been trying to keep famous Harry Potter safe from Sirius Black. But famous Harry Potter is a law unto himself Let the ordinary people worry about his safety! Famous Harry Potter goes where he wants to, with no thought for the consequences.  Harry stayed silent. Snape was trying to provoke him into telling the truth. He wasn't going to do it. Snape had no proof -- yet.  \"How extraordinarily like your father you are, Potter,\" Snape said suddenly, his eyes glinting. \"He too was exceedingly arrogant. A small amount of talent on the Quidditch field made him think he was a cut above the rest of us too. Strutting around the place with his friends and admirers... The resemblance between you is uncanny.\"  \"My dad didn't strut,\" said Harry, before he could stop himself. \"And neither do I.\"  \"Your father didn't set much store by rules either,\" Snape went on, pressing his advantage, his thin face full of malice. \"Rules were for lesser mortals, not Quidditch Cup-winners. His head was so swollen --\"  \"SHUT UP!\"  Harry was suddenly on his feet. Rage such as he had not felt since his last night in Privet Drive was coursing through him. He didn't care that Snape's face had gone rigid, the black eyes flashing dangerously.  \"What did you say to me, Potter?\"  \"I told you to shut up about my dad!\" Harry yelled. I know the truth, all right? He saved your life! Dumbledore told me! You wouldn't even be here if it wasn't for my dad!\"  Snape's sallow skin had gone the color of sour milk.  \"And did the headmaster tell you the circumstances in which your father saved my life?\" he whispered. \"Or did he consider the details too unpleasant for precious Potter's delicate ears?\"  Harry bit his lip. He didn't know what had happened and didn't want to admit it -- but Snape seemed to have guessed the truth.  I would hate for you to run away with a false idea of your father, Potter,\" he said, a terrible grin twisting his face. \"Have you been imagining some act of glorious heroism? Then let me correct you -- your saintly father and his friends played a highly amusing joke on me that would have resulted in my death if your father hadn't got cold feet at the last moment. There was nothing brave about what he did. He was saving his own skin as much as mine. Had their joke succeeded, he would have been expelled from Hogwarts.\"  Snape's uneven, yellowish teeth were bared.  \"Turn out your pockets, Potter!\" he spat suddenly.  Harry didn't move. There was a pounding in his ears.  \"Turn out your pockets, or we go straight to the headmaster! Pull them out, Potter!\"  Cold with dread, Harry slowly pulled out the bag of Zonko's tricks and the Marauder's Map.  Snap picked up the Zonko's bag.  \"Ron gave them to me,\" said Harry, praying he'd get a chance to tip Ron off before Snape saw him."
}