{
  "id": "aa7ac64f31b18a907a660487a300722dc3ca46ed",
  "text": " Poor Lord of Harmony. Dany pitied him. It must be terrible to be alone for all time, attended by hordes of butterfly women you could make or unmake at a word. Westeros had seven gods at least, though Viserys had told her that some septons said the seven were only aspects of a single god, seven facets of a single crystal. That was just confusing. The red priests believed in two gods, she had heard, but two who were eternally at war. Dany liked that even less. She would not want to be eternally at war.  Missandei served her duck eggs and dog sausage, and half a cup of sweetened wine mixed with the juice of a lime. The honey drew flies, but a scented candle drove them off. The flies were not so troublesome up here as they were in the rest of her city, she had found, something else she liked about the pyramid.  I must remember to do something about the flies,  Dany said.  Are there many flies on Naath, Missandei?    On Naath there are butterflies,  the scribe responded in the Common Tongue.  More wine?    No. I must hold court soon.  Dany had grown very fond of Missandei. The little scribe with the big golden eyes was wise beyond her years. She is brave as well. She had to be, to survive the life she’s lived. One day she hoped to see this fabled isle of Naath. Missandei said the Peaceful People made music instead of war. They did not kill, not even animals; they ate only fruit and never flesh. The butterfly spirits sacred to their Lord of Harmony protected their isle against those who would do them harm. Many conquerors had sailed on Naath to blood their swords, only to sicken and die. The butterflies do not help them when the slave ships come raiding, though.  I am going to take you home one day, Missandei,  Dany promised. If I had made the same promise to Jorah, would he still have sold me?  I swear it.    This one is content to stay with you, Your Grace. Naath will be there, always. You are good to this—to me.    And you to me.  Dany took the girl by the hand.  Come help me dress.   Jhiqui helped Missandei bathe her while Irri was laying out her clothes. Today she wore a robe of purple samite and a silver sash, and on her head the three-headed dragon crown the Tourmaline Brotherhood had given her in Qarth. Her slippers were silver as well, with heels so high that she was always half afraid she was about to topple over. When she was dressed, Missandei brought her a polished silver glass so she could see how she looked. Dany stared at herself in silence. Is this the face of a conqueror? So far as she could tell, she still looked like a little girl.  No one was calling her Daenerys the Conqueror yet, but perhaps they would. Aegon the Conqueror had won Westeros with three dragons, but she had taken Meereen with sewer rats and a wooden cock, in less than a day. Poor Groleo. He still grieved for his ship, she knew. If a war galley could ram another ship, why not a gate? That had been her thought when she commanded the captains to drive their ships ashore. Their masts had become her battering rams, and swarms of freedmen had torn their hulls apart to build mantlets, turtles, catapults, and ladders. The sellwords had given each ram a bawdy name, and it had been the mainmast of Meraxes—formerly Joso’s Prank—that had broken the eastern gate. Joso’s Cock, they called it. The fighting had raged bitter and bloody for most of a day and well into the night before the wood began to splinter and Meraxes’ iron figurehead, a laughing jester’s face, came crashing through.  Dany had wanted to lead the attack herself, but to a man her captains said that would be madness, and her captains never agreed on anything. Instead she remained in the rear, sitting atop her silver in a long shirt of mail. She heard the city fall from half a league away, though, when the defenders’ shouts of defiance changed to cries of fear. Her dragons had roared as one in that moment, filling the night with flame. The slaves are rising, she knew at once. My sewer rats have gnawed off their chains.  When the last resistance had been crushed by the Unsullied and the sack had run its course, Dany entered her city. The dead were heaped so high before the broken gate that it took her freedmen near an hour to make a path for her silver. Joso’s Cock and the great wooden turtle that had protected it, covered with horsehides, lay abandoned within. She rode past burned buildings and broken windows, through brick streets where the gutters were choked with the stiff and swollen dead. Cheering slaves lifted bloodstained hands to her as she went by, and called her  Mother.   In the plaza before the Great Pyramid, the Meereenese huddled forlorn. The Great Masters had looked anything but great in the morning light. Stripped of their jewels and their fringed tokars, they were contemptible; a herd of old men with shriveled balls and spotted skin and young men with ridiculous hair. Their women were either soft and fleshy or as dry as old sticks, their face paint streaked by tears."
}