{
  "id": "aab1d229c15a47aa1bc235d91d4545030c2940f5",
  "text": "  Sam,  with  a  cry, hacked  at  the  spear-shaft, and it broke. But  even as the orc flung down the truncheon and   swept  out his scimitar, And®ril came down upon his helm. There  was a flash  like flame and the helm burst  asunder.  The orc fell with cloven  head. His  followers fled howling, as Boromir and Aragorn sprang at them.       Doom, doom went  the drums  in the  deep.  The  great voice  rolled out  again.       'Now! ' shouted Gandalf. 'Now is the last chance. Run for it! '       Aragorn picked up Frodo  where  he lay by the  wall and  made  for  the  stair, pushing Merry and Pippin in  front  of him. The others followed;  but  Gimli had  to be dragged away  by Legolas: in spite of the peril he lingered  by  Balin's tomb  with his head bowed.  Boromir hauled the eastern  door to,   grinding upon its hinges: it  had great iron rings on either side, but could  not be fastened.       'I am all right,' gasped Frodo. `I can walk. Put me down! '       Aragorn nearly dropped him in his  amazement. 'I thought you were dead!  ' he cried.       'Not yet! '  said Gandalf. 'But there is time  for wonder.  Off you go,  all of you, down the stairs! Wait a few minutes for me at the bottom, but if  I  do  not come soon, go on!  Go  quickly and choose paths leading right and  downwards.'       'We cannot leave you to hold the door alone! ' said Aragorn.       `Do as I say! ' said Gandalf fiercely.  `Swords are no  more use  here.  Go!'       The passage was lit by no shaft and was utterly dark. They groped their  way down  a long  flight  of steps, and then looked back; but they could see  nothing, except high above them the faint glimmer  of the wizard's staff. He  seemed  to  be still  standing on guard by  the closed door.  Frodo breathed  heavily  and  leaned  aga inst Sam, who  put his arms  about him.  They stood  peering up  the  stairs  into the darkness. Frodo thought he could hear  the  voice of  Gandalf above, muttering words that ran down the sloping roof with  a sighing  echo. He could not catch  what was said .  The  walls seemed to be  trembling.  Every  now and again the drum-beats  throbbed and rolled:  doom,  doom.       Suddenly at the top of the stair there was a stab of white  light. Then  there  was a dull rumble and a heavy thud. The drum-beats broke  out wildly:   ####-doom-boom, doom-boom, and then  stopped. Gandalf came flying down the   steps  and fell to the ground in the midst of the Company.       `Well, well! That's over!  ' said the wizard struggling to his feet. `I   have done  all that I  could. But I have met my  match, and have nearly been  destroyed. But don't stand here! Go  on! You  will have to  do without light  for a  while: I am rather  shaken. Go on! Go on! Where are  you, Gimli? Come  ahead with me! Keep close behind, all of you!'       They stumbled a fter him  wondering what had happened.  Doom,  doom  went  the drum-beats  again: they now sounded muffled and  far away, but they were  following. There was no  other sound  of pursuit, neither tramp of feet, nor  any  voice. Gandalf took  no turns, right or left, for the passage seemed to  be  going in the direction that he desired. Every now and again it descended   a  flight of steps, fifty or more, to a  lower level. At the moment that was  their chief danger; for in the dark they could not see a descent, until they  came on it, and put their feet out into  emptiness.  Gandalf felt the ground  with his staff like a blind man.       At the end of an hour they had gone a mile, or maybe a little more, and  had descended many flights of stairs. There was still  no sound  of pursuit.  Almost  they  began to hope that they  would  escape. At the  bottom  of the   seventh flight Gandalf halted.       `It is getting hot! ' he  gasped. `We ought to  be down at least to the  level of the Gates now.  Soon I think we should look for  a left -hand turn to  take us  east. I  hope  it is not far. I am very weary. I  must  rest here a   moment, even if all the orcs ever spawned are after us.'       Gimli took  his arm and  helped  him down to a seat on the step.  `What  happened away up there a t the  door? ' he asked. `Did you meet the beater of  the drums?  '       'I  do not know,' answered Gandalf. `But I found myself suddenly  faced  by something  that I have not met before. I could think of nothing to do but  to try and  put a  shutting-spell on the door. I know many; but to do things  of that kind rightly requires time,  and even then the door can be broken by  strength.       `As  I stood there  I could hear orc-voices on  the other  side: at any  moment  I thought they would burst it open. I could not hear  what was said;  they seemed to be talking in their  own hideous language.  All  I caught was   ####-ghvsh;  that is  \"fire\". Then something came into the chamber  --  I felt it  through  the door, and the orcs themselves were  afraid and fell  silent. It  laid hold of the iron ring, and then it perceived me and my spell."
}