{
  "id": "ab9f632dcfc003660a4010942725d2ad6eff85d3",
  "text": "  Further along the table, sitting next to Professor McGonagall, was Snape.  His eyes lingered on Harry for a moment as Harry looked at him.  His expression was difficult to read.  He looked as sour and unpleasant as ever.  Harry continued to watch him, long after Snape had looked away. What was it that Snape had done on Dumbledores orders, the night that Voldemort had returned?  And why. . . why . . . was Dumbledore so convinced that Snape was truly on their side?  He had been their spy, Dumbledore had said so in the Pensieve.  Snape had turned spy against Voldemort, \"at great personal risk.\"  Was that the job he had taken up again?  Had he made contact with the Death Eaters, perhaps?  Pretended that he had never really gone over to Dumbledore, that he had been, like Voldemort himself, biding his time? Harry's musings were ended by Professor Dumbledore, who stood up at the staff table. The Great Hall, which in any case had been less noisy than it usually was at the Leaving Feast, became very quiet. \"The end,\" said Dumbledore, looking around at them all, \"of another year.\" He paused, and his eyes fell upon the Hufflepuff table.  Theirs had been the most subdued table before he had gotten to his feet, and theirs were still the saddest and palest faces in the Hall. \"There is much that I would like to say to you all tonight,\" said Dumbledore, \"but I must first acknowledge the loss of a very fine person, who should be sitting here,\" he gestured toward the Hufflepuffs, \"enjoying our feast with us.  I would like you all, please, to stand, and raise your glasses, to Cedric Diggory.\" They did it, all of them; the benches scraped as everyone in the Hall stood, and raised their goblets, and echoed, in one loud, low, rumbling voice, \"Cedric Diggory.\" Harry caught a glimpse of Cho through the crowd.  There were tears pouring silently down her face.  He looked down at the table as they all sat down again. \"Cedric was a person who exemplified many of the qualities that distinguish Hufflepuff house,\" Dumbledore continued. \"He was a good and loyal friend, a hard worker, he valued fair play.  His death has affected you all, whether you knew him well or not.  I think that you have the right, therefore, to know exactly how it came about.\" Harry raised his head and stared at Dumbledore. \"Cedric Diggory was murdered by Lord Voldemort.\" A panicked whisper swept the Great Hall.  People were staring at Dumbledore in disbelief, in horror.  He looked perfectly calm as he watched them mutter themselves into silence. \"The Ministry of Magic,\" Dumbledore continued, \"does not wish me to tell you this.  It is possible that some of your parents will be horrified that I have done so - either because they will not believe that Lord Voldemort has returned, or because they think I should not tell you so, young as you are.  It is my belief, however, that the truth is generally preferable to lies, and that any attempt to pretend that Cedric died as the result of an accident, or some sort of blunder of his own, is an insult to his memory.\" Stunned and frightened, every face in the Hall was turned toward Dumbledore now... or almost every face.  Over at the Slytherin table.  Harry saw Draco Malfoy muttering something to Crabbe and Goyle.  Harry felt a hot, sick swoop of anger in his stomach.  He forced himself to look back at Dumbledore. \"There is somebody else who must be mentioned in connection with Cedrics death,\" Dumbledore went on. \"I am talking, of course, about Harry Potter.\" A kind of ripple crossed the Great Hall as a few heads turned in Harry's direction before flicking back to face Dumbledore. \"Harry Potter managed to escape Lord Voldemort,\" said Dumbledore.  \"He risked his own life to return Cedric's body to Hogwarts.  He showed, in every respect, the sort of bravery that few wizards have ever shown in facing Lord Voldemort, and for this, I honor him.\" Dumbledore turned gravely to Harry and raised his goblet once more.  Nearly everyone in the Great Hall followed suit.  They murmured his name, as they had murmured Cedric's, and drank to him.  But through a gap in the standing figures.  Harry saw that Malfoy, Crabbe, Goyle, and many of the other Slytherins had remained defiantly in their seats, their goblets untouched.  Dumbledore, who after all possessed no magical eye, did not see them. When everyone had once again resumed their seats, Dumbledore continued, \"The Triwizard Tournament's aim was to further and promote magical understanding.  In the light of what has happened - of Lord Voldemorts return - such ties are more important than ever before.\" Dumbledore looked from Madame Maxime and Hagrid, to Fleur Delacour and her fellow Beauxbatons students, to Viktor Krum and the Durmstrangs at the Slytherin table.  Krum, Harry saw, looked wary, almost frightened, as though he expected Dumbledore to say something harsh. \"Every guest in this Hall,\" said Dumbledore, and his eyes lingered upon the Durmstrang students, \"will be welcomed back here at any time, should they wish to come."
}