{
  "id": "ac8946d09ff454dac28802acd8b20e7ebe12fe05",
  "text": " Catelyn wondered if that would be enough, if it came to war. Her father was the staunchest man who’d ever lived, and she had no doubt that he would call his banners… but would the banners come? The Darrys and Rygers and Mootons had sworn oaths to Riverrun as well, yet they had fought with Rhaegar Targaryen on the Trident, while Lord Frey had arrived with his levies well after the battle was over, leaving some doubt as to which army he had planned to join (theirs, he had assured the victors solemnly in the aftermath, but ever after her father had called him the Late Lord Frey). It must not come to war, Catelyn thought fervently. They must not let it.  Ser Rodrik came for her just as the bell ceased its clangor.  We had best make haste if we hope to eat tonight, my lady.    It might be safer if we were not knight and lady until we pass the Neck,  she told him.  Common travelers attract less notice. A father and daughter taken to the road on some family business, say.    As you say, my lady,  Ser Rodrik agreed. It was only when she laughed that he realized what he’d done.  The old courtesies die hard, my—my daughter.  He tried to tug on his missing whiskers, and sighed with exasperation.  Catelyn took his arm.  Come, Father,  she said.  You’ll find that Masha Heddle sets a good table, I think, but try not to praise her. You truly don’t want to see her smile.   The common room was long and drafty, with a row of huge wooden kegs at one end and a fireplace at the other. A serving boy ran back and forth with skewers of meat while Masha drew beer from the kegs, chewing her sourleaf all the while.  The benches were crowded, townsfolk and farmers mingling freely with all manner of travelers. The crossroads made for odd companions; dyers with black and purple hands shared a bench with rivermen reeking of fish, an ironsmith thick with muscle squeezed in beside a wizened old septon, hard-bitten sellswords and soft plump merchants swapped news like boon companions.  The company included more swords than Catelyn would have liked. Three by the fire wore the red stallion badge of the Brackens, and there was a large party in blue steel ringmail and capes of a silvery grey. On their shoulder was another familiar sigil, the twin towers of House Frey. She studied their faces, but they were all too young to have known her. The senior among them would have been no older than Bran when she went north.  Ser Rodrik found them an empty place on the bench near the kitchen. Across the table a handsome youth was fingering a woodharp.  Seven blessings to you, goodfolk,  he said as they sat. An empty wine cup stood on the table before him.   And to you, singer,  Catelyn returned. Ser Rodrik called for bread and meat and beer in a tone that meant now. The singer, a youth of some eighteen years, eyed them boldly and asked where they were going, and from whence they had come, and what news they had, letting the questions fly as quick as arrows and never pausing for an answer.  We left King’s Landing a fortnight ago,  Catelyn replied, answering the safest of his questions.   That’s where I’m bound,  the youth said. As she had suspected, he was more interested in telling his own story than in hearing theirs. Singers loved nothing half so well as the sound of their own voices.  The Hand’s tourney means rich lords with fat purses. The last time I came away with more silver than I could carry… or would have, if I hadn’t lost it all betting on the Kingslayer to win the day.    The gods frown on the gambler,  Ser Rodrik said sternly. He was of the north, and shared the Stark views on tournaments.   They frowned on me, for certain,  the singer said.  Your cruel gods and the Knight of Flowers altogether did me in.    No doubt that was a lesson for you,  Ser Rodrik said.   It was. This time my coin will champion Ser Loras.   Ser Rodrik tried to tug at whiskers that were not there, but before he could frame a rebuke the serving boy came scurrying up. He laid trenchers of bread before them and filled them with chunks of browned meat off a skewer, dripping with hot juice. Another skewer held tiny onions, fire peppers, and fat mushrooms. Ser Rodrik set to lustily as the lad ran back to fetch them beer.   My name is Marillion,  the singer said, plucking a string on his woodharp.  Doubtless you’ve heard me play somewhere?   His manner made Catelyn smile. Few wandering singers ever ventured as far north as Winterfell, but she knew his like from her girlhood in Riverrun.  I fear not,  she told him.  He drew a plaintive chord from the woodharp.  That is your loss,  he said.  Who was the finest singer you’ve ever heard?    Alia of Braavos,  Ser Rodrik answered at once.   Oh, I’m much better than that old stick,  Marillion said.  If you have the silver for a song, I’ll gladly show you.    I might have a copper or two, but I’d sooner toss it down a well than pay for your howling,  Ser Rodrik groused. His opinion of singers was well known; music was a lovely thing for girls, but he could not comprehend why any healthy boy would fill his hand with a harp when he might have had a sword."
}