{
  "id": "ae9f011cb28fd2f8e1ec9bdd89ec52ca8e95665f",
  "text": "  Joffrey’s voice cracked as he shouted up from the wallwalk, where he huddled with his guards behind the ramparts. The golden circlet of kingship adorned his battle helm.  My Kingslander’s burning, Queen Cersei, Loyal Man. Look, that’s Seaflower, there.  He pointed with his new sword, out to where the green flames were licking at Seaflower’s golden hull and creeping up her oars. Her captain had turned her upriver, but not quickly enough to evade the wildfire.  She was doomed, Tyrion knew. There was no other way. If we had not come forth to meet them, Stannis would have sensed the trap. An arrow could be aimed, and a spear, even the stone from a catapult, but wildfire had a will of its own. Once loosed, it was beyond the control of mere men.  It could not be helped,  he told his nephew.  Our fleet was doomed in any case.   Even from atop the merlon—he had been too short to see over the ramparts, so he’d had them boost him up—the flames and smoke and chaos of battle made it impossible for Tyrion to see what was happening downriver under the castle, but he had seen it a thousand times in his mind’s eye. Bronn would have whipped the oxen into motion the moment Stannis’s flagship passed under the Red Keep; the chain was ponderous heavy, and the great winches turned but slowly, creaking and rumbling. The whole of the usurper’s fleet would have passed by the time the first glimmer of metal could be seen beneath the water. The links would emerge dripping wet, some glistening with mud, link by link by link, until the whole great chain stretched taut. King Stannis had rowed his fleet up the Blackwater, but he would not row out again.  Even so, some were getting away. A river’s current was a tricky thing, and the wildfire was not spreading as evenly as he had hoped. The main channel was all aflame, but a good many of the Myrmen had made for the south bank and looked to escape unscathed, and at least eight ships had landed under the city walls. Landed or wrecked, but it comes to the same thing, they’ve put men ashore. Worse, a good part of the south wing of the enemy’s first two battle lines had been well upstream of the inferno when the hulks went up. Stannis would be left with thirty or forty galleys, at a guess; more than enough to bring his whole host across, once they had regained their courage.  That might take a bit of time; even the bravest would be dismayed after watching a thousand or so of his fellows consumed by wildfire. Hallyne said that sometimes the substance burned so hot that flesh melted like tallow. Yet even so…  Tyrion had no illusions where his own men were concerned. If the battle looks to be going sour they’ll break, and they’ll break bad, Jacelyn Bywater had warned him, so the only way to win was to make certain the battle stayed sweet, start to finish.  He could see dark shapes moving through the charred ruins of the riverfront wharfs. Time for another sortie, he thought. Men were never so vulnerable as when they first staggered ashore. He must not give the foe time to form up on the north bank.  He scrambled down off the merlon.  Tell Lord Jacelyn we’ve got enemy on the riverfront,  he said to one of the runners Bywater had assigned him. To another he said,  Bring my compliments to Ser Arneld and ask him to swing the Whores thirty degrees west.  The angle would allow them to throw farther, if not as far out into the water.   Mother promised I could have the Whores,  Joffrey said. Tyrion was annoyed to see that the king had lifted the visor of his helm again. Doubtless the boy was cooking inside all that heavy steel… but the last thing he needed was some stray arrow punching through his nephew’s eye.  He clanged the visor shut.  Keep that closed, Your Grace; your sweet person is precious to us all.  And you don’t want to spoil that pretty face, either.  The Whores are yours.  It was as good a time as any; flinging more firepots down onto burning ships seemed pointless. Joff had the Antler Men trussed up naked in the square below, antlers nailed to their heads. When they’d been brought before the Iron Throne for justice, he had promised to send them to Stannis. A man was not as heavy as a boulder or a cask of burning pitch, and could be thrown a deal farther. Some of the gold cloaks had been wagering on whether the traitors would fly all the way across the Blackwater.  Be quick about it, Your Grace,  he told Joffrey.  We’ll want the trebuchets throwing stones again soon enough. Even wildfire does not burn forever.   Joffrey hurried off happy, escorted by Ser Meryn, but Tyrion caught Ser Osmund by the wrist before he could follow.  Whatever happens, keep him safe and keep him there, is that understood?    As you command.  Ser Osmund smiled amiably.  Tyrion had warned Trant and Kettleblack what would happen to them should any harm come to the king. And Joffrey had a dozen veteran gold cloaks waiting at the foot of the steps. I’m protecting your wretched bastard as well as I can, Cersei, he thought bitterly."
}