{
  "id": "afc8900ff694516d8ade6424404b83f9cb451602",
  "text": " Tyrion had never been fond of singers, and he liked this one even less than the run of the breed, sight unseen. When he pushed open the door, the man broke off.  My lord Hand.  He knelt, balding and kettle-bellied, murmuring,  An honor, an honor.    M’lord.  Shae smiled at the sight of him. He liked that smile, the quick unthinking way it came to her pretty face. The girl wore her purple silk, belted with a cloth-of-silver sash. The colors favored her dark hair and the smooth cream of her skin.   Sweetling,  he called her.  And who is this?   The singer raised his eyes.  I am called Symon Silver Tongue, my lord. A player, a singer, a taleteller—    And a great fool,  Tyrion finished.  What did you call me, when I entered?    Call? I only…  The silver in Symon’s tongue seemed to have turned to lead.  My lord Hand, I said, an honor…    A wiser man would have pretended not to recognize me. Not that I would have been fooled, but you ought to have tried. What am I to do with you now? You know of my sweet Shae, you know where she dwells, you know that I visit by night alone.    I swear, I’ll tell no one…    On that much we agree. Good night to you.  Tyrion led Shae up the stairs.   My singer may never sing again now,  she teased.  You’ve scared the voice from him.    A little fear will help him reach those high notes.   She closed the door to their bedchamber.  You won’t hurt him, will you?  She lit a scented candle and knelt to pull off his boots.  His songs cheer me on the nights you don’t come.    Would that I could come every night,  he said as she rubbed his bare feet.  How well does he sing?    Better than some. Not so good as others.   Tyrion opened her robe and buried his face between her breasts. She always smelled clean to him, even in this reeking sty of a city.  Keep him if you like, but keep him close. I won’t have him wandering the city spreading tales in pot-shops.    He won’t—  she started.  Tyrion covered her mouth with his own. He’d had talk enough; he needed the sweet simplicity of the pleasure he found between Shae’s thighs. Here, at least, he was welcome, wanted.  Afterward, he eased his arm out from under her head, slipped on his tunic, and went down to the garden. A half-moon silvered the leaves of the fruit trees and shone on the surface of the stone bathing pond. Tyrion seated himself beside the water. Somewhere off to his right a cricket was chirping, a curiously homey sound. It is peaceful here, he thought, but for how long?  A whiff of something rank made him turn his head. Shae stood in the door behind him, dressed in the silvery robe he’d given her. I loved a maid as white as winter, with moonglow in her hair. Behind her stood one of the begging brothers, a portly man in filthy patched robes, his bare feet crusty with dirt, a bowl hung about his neck on a leather thong where a septon would have worn a crystal. The smell of him would have gagged a rat.   Lord Varys has come to see you,  Shae announced.  The begging brother blinked at her, astonished. Tyrion laughed.  To be sure. How is it you knew him when I did not?   She shrugged.  It’s still him. Only dressed different.    A different look, a different smell, a different way of walking,  said Tyrion.  Most men would be deceived.    And most women, maybe. But not whores. A whore learns to see the man, not his garb, or she turns up dead in an alley.   Varys looked pained, and not because of the false scabs on his feet. Tyrion chuckled.  Shae, would you bring us some wine?  He might need a drink. Whatever brought the eunuch here in the dead of night was not like to be good.   I almost fear to tell you why I’ve come, my lord,  Varys said when Shae had left them.  I bring dire tidings.    You ought to dress in black feathers, Varys, you’re as bad an omen as any raven.  Awkwardly, Tyrion pushed to his feet, half afraid to ask the next question.  Is it Jaime?  If they have harmed him, nothing will save them.   No, my lord. A different matter. Ser Cortnay Penrose is dead. Storm’s End has opened its gates to Stannis Baratheon.   Dismay drove all other thoughts from Tyrion’s mind. When Shae returned with the wine, he took one sip and flung the cup away to explode against the side of the house. She raised a hand to shield herself from the shards as the wine ran down the stones in long fingers, black in the moonlight.  Damn him!  Tyrion said.  Varys smiled, showing a mouth full of rotted teeth.  Who, my lord? Ser Cortnay or Lord Stannis?    Both of them.  Storm’s End was strong, it should have been able to hold out for half a year or more… time enough for his father to finish with Robb Stark.  How did this happen?   Varys glanced at Shae.  My lord, must we trouble your sweet lady’s sleep with such grim and bloody talk?    A lady might be afraid,  said Shae,  but I’m not.    You should be,  Tyrion told her.  With Storm’s End fallen, Stannis will soon turn his attention toward King’s Landing.  He regretted flinging away that wine now.  Lord Varys, give us a moment, and I’ll ride back to the castle with you."
}