{
  "id": "b34dd1af3ce0ba4b283d6e19f54ee68a6650ab40",
  "text": "  Tell me.    At King Joffrey’s wedding feast,  the man said,  there is to be a tournament of singers.    And jugglers, and jesters, and dancing bears.    Only one dancing bear, my lord,  said Symon, who had plainly attended Cersei’s arrangements with far more interest than Tyrion had,  but seven singers. Galyeon of Cuy, Bethany Fair-fingers, Aemon Costayne, Alaric of Eysen, Hamish the Harper, Collio Quaynis, and Orland of Oldtown will compete for a gilded lute with silver strings… yet unaccountably, no invitation has been forthcoming for one who is master of them all.    Let me guess. Symon Silver Tongue?   Symon smiled modestly.  I am prepared to prove the truth of my boast before king and court. Hamish is old, and oft forgets what he is singing. And Collio, with that absurd Tyroshi accent! if you understand one word in three, count yourself fortunate.    My sweet sister has arranged the feast. Even if I could secure you this invitation, it might look queer. Seven kingdoms, seven vows, seven challenges, seventy-seven dishes… but eight singers? What would the High Septon think?    You did not strike me as a pious man, my lord.    Piety is not the point. Certain forms must be observed.   Symon took a sip of wine.  Still… a singer’s life is not without peril. We ply our trade in alehouses and wine sinks, before unruly drunkards. If one of your sister’s seven should suffer some mishap, I hope you might consider me to fill his place.  He smiled slyly, inordinately pleased with himself.   Six singers would be as unfortunate as eight, to be sure. I will inquire after the health of Cersei’s seven. If any of them should be indisposed, my man Bronn will find you.    Very good, my lord.  Symon might have left it at that, but flushed with triumph, he added,  I shall sing the night of King Joffrey’s wedding. Should it happen that I am called to court, why, I will want to offer the king my very best compositions, songs I have sung a thousand times that are certain to please. If I should find myself singing in some dreary winesink, though… well, that would be an apt occasion to try my new song. For hands of gold are always cold, but a woman’s hands are warm.    That will not be necessary,  said Tyrion.  You have my word as a Lannister, Bronn will call upon you soon.    Very good, my lord.  The balding kettle-bellied singer took up his woodharp again.  Bronn was waiting with the horses at the mouth of the alley. He helped Tyrion into his saddle.  When do I take the man to Duskendale?    You don’t.  Tyrion turned his horse.  Give him three days, then inform him that Hamish the Harper has broken his arm. Tell him that his clothes will never serve for court, so he must be fitted for new garb at once. He’ll come with you quick enough.  He grimaced.  You may want his tongue, I understand it’s made of silver. The rest of him should never be found.   Bronn grinned.  There’s a pot shop I know in Flea Bottom makes a savory bowl of brown. All kinds of meat in it, I hear.    Make certain I never eat there.  Tyrion spurred to a trot. He wanted a bath, and the hotter the better.  Even that modest pleasure was denied him, however; no sooner had he returned to his chambers than Podrick Payne informed him that he had been summoned to the Tower of the Hand.  His lordship wants to see you. The Hand. Lord Tywin.    I recall who the Hand is, Pod,  Tyrion said.  I lost my nose, not my wits.   Bronn laughed.  Don’t bite the boy’s head off now.    Why not? He never uses it.  Tyrion wondered what he’d done now. Or more like, what I have failed to do. A summons from Lord Tywin always had teeth; his father never sent for him just to share a meal or a cup of wine, that was for certain.  As he entered his lord father’s solar a few moments later, he heard a voice saying,  …cherrywood for the scabbards, bound in red leather and ornamented with a row of lion’s-head studs in pure gold. Perhaps with garnets for the eyes…    Rubies,  Lord Tywin said.  Garnets lack the fire.   Tyrion cleared his throat.  My lord. You sent for me?   His father glanced up.  I did. Come have a look at this.  A bundle of oilcloth lay on the table between them, and Lord Tywin had a longsword in his hand.  A wedding gift for Joffrey,  he told Tyrion. The light streaming through the diamond-shaped panes of glass made the blade shimmer black and red as Lord Tywin turned it to inspect the edge, while the pommel and crossguard flamed gold.  With this fool’s jabber of Stannis and his magic sword, it seemed to me that we had best give Joffrey something extraordinary as well. A king should bear a kingly weapon.    That’s much too much sword for Joff,  Tyrion said.   He will grow into it. Here, feel the weight of it.  He offered the weapon hilt first.  The sword was much lighter than he had expected. As he turned it in his hand he saw why. Only one metal could be beaten so thin and still have strength enough to fight with, and there was no mistaking those ripples, the mark of steel that has been folded back on itself many thousands of times."
}