{
  "id": "b4f6f61eb9caa771edd2927c6068a065359cef66",
  "text": " The Sword of the Morning still hung in the south, the bright white star in its hilt blazing like a diamond in the dawn, but the blacks and greys of the darkling forest were turning once again to greens and golds, reds and russets. And above the soldier pines and oaks and ash and sentinels stood the Wall, the ice pale and glimmering beneath the dust and dirt that pocked its surface.  The Magnar sent a dozen men riding west and a dozen more east, to climb the highest hills they could find and watch for any sign of rangers in the wood or riders on the high ice. The Thenns carried bronze-banded warhorns to give warning should the Watch be sighted. The other wildlings fell in behind Jarl, Jon and Ygritte with the rest. This was to be the young raider’s hour of glory.  The Wall was often said to stand seven hundred feet high, but Jarl had found a place where it was both higher and lower. Before them, the ice rose sheer from out of the trees like some immense cliff, crowned by wind-carved battlements that loomed at least eight hundred feet high, perhaps nine hundred in spots. But that was deceptive, Jon realized as they drew closer. Brandon the Builder had laid his huge foundation blocks along the heights wherever feasible, and hereabouts the hills rose wild and rugged.  He had once heard his uncle Benjen say that the Wall was a sword east of Castle Black, but a snake to the west. It was true. Sweeping in over one huge humped hill, the ice dipped down into a valley, climbed the knife edge of a long granite ridgeline for a league or more, ran along a jagged crest, dipped again into a valley deeper still, and then rose higher and higher, leaping from hill to hill as far as the eye could see, into the mountainous west.  Jarl had chosen to assault the stretch of ice along the ridge. Here, though the top of the Wall loomed eight hundred feet above the forest floor, a good third of that height was earth and stone rather than ice; the slope was too steep for their horses, almost as difficult a scramble as the Fist of the First Men, but still vastly easier to ascend than the sheer vertical face of the Wall itself. And the ridge was densely wooded as well, offering easy concealment. Once brothers in black had gone out every day with axes to cut back the encroaching trees, but those days were long past, and here the forest grew right up to the ice.  The day promised to be damp and cold, and damper and colder by the Wall, beneath those tons of ice. The closer they got, the more the Thenns held back. They have never seen the Wall before, not even the Magnar, Jon realized. It frightens them. In the Seven Kingdoms it was said that the Wall marked the end of the world. That is true for them as well. It was all in where you stood.  And where do I stand? Jon did not know. To stay with Ygritte, he would need to become a wildling heart and soul. If he abandoned her to return to his duty, the Magnar might cut her heart out. And if he took her with him… assuming she would go, which was far from certain… well, he could scarcely bring her back to Castle Black to live among the brothers. A deserter and a wildling could expect no welcome anywhere in the Seven Kingdoms. We could go look for Gendel’s children, I suppose. Though they’d be more like to eat us than to take us in.  The Wall did not awe Jarl’s raiders, Jon saw. They have done this before, every man of them. Jarl called out names when they dismounted beneath the ridge, and eleven gathered round him. All were young. The oldest could not have been more than five-and-twenty, and two of the ten were younger than Jon. Every one was lean and hard, though; they had a look of sinewy strength that reminded him of Stonesnake, the brother the Halfhand had sent off afoot when Rattleshirt was hunting them.  In the very shadow of the Wall the wildlings made ready, winding thick coils of hempen rope around one shoulder and down across their chests, and lacing on queer boots of supple doeskin. The boots had spikes jutting from the toes; iron, for Jarl and two others, bronze for some, but most often jagged bone. Small stone-headed hammers hung from one hip, a leathern bag of stakes from the other. Their ice axes were antlers with sharpened tines, bound to wooden hafts with strips of hide. The eleven climbers sorted themselves into three teams of four; Jarl himself made the twelfth man.  Mance promises swords for every man of the first team to reach the top,  he told them, his breath misting in the cold air.  Southron swords of castle-forged steel. And your name in the song he’ll make of this, that too. What more could a free man ask? Up, and the Others take the hindmost!   The Others take them all, thought Jon, as he watched them scramble up the steep slope of the ridge and vanish beneath the trees. It would not be the first time wildlings had scaled the Wall, not even the hundred and first. The patrols stumbled on climbers two or three times a year, and rangers sometimes came on the broken corpses of those who had fallen."
}