{
  "id": "b52f9420eeeb31dce43ffe285adf59ceadf4ae87",
  "text": " Yet with Lynesse’s favor knotted round my arm, I was a different man. I won joust after joust. Lord Jason Mallister fell before me, and Bronze Yohn Royce. Ser Ryman Frey, his brother Ser Hosteen, Lord Whent, Strongboar, even Ser Boros Blount of the Kingsguard, I unhorsed them all. In the last match, I broke nine lances against Jaime Lannister to no result, and King Robert gave me the champion’s laurel. I crowned Lynesse queen of love and beauty, and that very night went to her father and asked for her hand. I was drunk, as much on glory as on wine. By rights I should have gotten a contemptuous refusal, but Lord Leyton accepted my offer. We were married there in Lannisport, and for a fortnight I was the happiest man in the wide world.    Only a fortnight?  asked Dany. Even I was given more happiness than that, with Drogo who was my sun-and-stars.   A fortnight was how long it took us to sail from Lannisport back to Bear Island. My home was a great disappointment to Lynesse. It was too cold, too damp, too far away, my castle no more than a wooden longhall. We had no masques, no mummer shows, no balls or fairs. Seasons might pass without a singer ever coming to play for us, and there’s not a goldsmith on the island. Even meals became a trial. My cook knew little beyond his roasts and stews, and Lynesse soon lost her taste for fish and venison.   I lived for her smiles, so I sent all the way to Oldtown for a new cook, and brought a harper from Lannisport. Goldsmiths, jewelers, dressmakers, whatever she wanted I found for her, but it was never enough. Bear Island is rich in bears and trees, and poor in aught else. I built a fine ship for her and we sailed to Lannisport and Oldtown for festivals and fairs, and once even to Braavos, where I borrowed heavily from the money-lenders. It was as a tourney champion that I had won her hand and heart, so I entered other tourneys for her sake, but the magic was gone. I never distinguished myself again, and each defeat meant the loss of another charger and another suit of jousting armor, which must needs be ransomed or replaced. The cost could not be borne. Finally I insisted we return home, but there matters soon grew even worse than before. I could no longer pay the cook and the harper, and Lynesse grew wild when I spoke of pawning her jewels.   The rest… I did things it shames me to speak of. For gold. So Lynesse might keep her jewels, her harper, and her cook. In the end it cost me all. When I heard that Eddard Stark was coming to Bear Island, I was so lost to honor that rather than stay and face his judgment, I took her with me into exile. Nothing mattered but our love, I told myself. We fled to Lys, where I sold my ship for gold to keep us.   His voice was thick with grief, and Dany was reluctant to press him any further, yet she had to know how it ended.  Did she die there?  she asked him gently.   Only to me,  he said.  In half a year my gold was gone, and I was obliged to take service as a sellsword. While I was fighting Braavosi on the Rhoyne, Lynesse moved into the manse of a merchant prince named Tregar Ormollen. They say she is his chief concubine now, and even his wife goes in fear of her.   Dany was horrified.  Do you hate her?    Almost as much as I love her,  Ser Jorah answered.  Pray excuse me, my queen. I find I am very tired.   She gave him leave to go, but as he was lifting the flap of her tent, she could not stop herself calling after him with one last question.  What did she look like, your Lady Lynesse?   Ser Jorah smiled sadly.  Why, she looked a bit like you, Daenerys.  He bowed low.  Sleep well, my queen.   Dany shivered, and pulled the lionskin tight about her. She looked like me. It explained much that she had not truly understood. He wants me, she realized. He loves me as he loved her, not as a knight loves his queen but as a man loves a woman. She tried to imagine herself in Ser Jorah’s arms, kissing him, pleasuring him, letting him enter her. It was no good. When she closed her eyes, his face kept changing into Drogo’s.  Khal Drogo had been her sun-and-stars, her first, and perhaps he must be her last. The maegi Mirri Maz Duur had sworn she should never bear a living child, and what man would want a barren wife? And what man could hope to rival Drogo, who had died with his hair uncut and rode now through the night lands, the stars his khalasar?  She had heard the longing in Ser Jorah’s voice when he spoke of his Bear Island. He can never have me, but one day I can give him back his home and honor. That much I can do for him.  No ghosts troubled her sleep that night. She dreamed of Drogo and the first ride they had taken together on the night they were wed. In the dream it was not horses they rode, but dragons.  The next morn, she summoned her bloodriders.  Blood of my blood,  she told the three of them,  I have need of you. Each of you is to choose three horses, the hardiest and healthiest that remain to us. Load as much water and food as your mounts can bear, and ride forth for me."
}