{
  "id": "b53bc50c3f8907631a768792ec6023ca90ff9f1d",
  "text": "  It  was  the  trees  at  the  bottom  that  saved  them.  They  slid  into  the  edge  of  a  climbing  wood  of  pines  that  here  stood  right  up  the  mountain  slope  from  the  deeper  darker  forests  of  the  valleys  below.  Some  caught  hold  of  the  trunks  and  swung  themselves  into  lower  branches,  some  (like  the  little  hobbit)  got  behind  a  tree to shelter from the onslaught of the rocks. Soon the danger was over, the slide  had  stopped,  and  the  last  faint  crashes  could  be  heard  as  the  largest  of  the  disturbed  stones  went  bounding  and  spinning  among  the  bracken  and  the  pine- roots far below.   \"Well!  that  has  got  us  on  a  bit,\"  said  Gandalf;  \"and  even  goblins  tracking  us  will have a job to come down here quietly.\"   ####-\"I  daresay,\"  grumbled Bombur;  \"but  they won't  find  it  difficult  to  send  stones  bouncing  down  on  our  heads.\"  The  dwarves  (and  Bilbo)  were  feeling  far  from  happy, and were rubbing their bruised and damaged legs and feet.  \"Nonsense!  We  are  going  to  turn  aside  here  out  of  the  path  of  the  slide.  We  must  be  quick! Look  at  the  light!\" The  sun  had  long  gone behind  the mountains.  Already  the  shadows  were  deepening  about  them,  though  far  away  through  the  trees and over  the black  tops of  those growing  lower down  they could still see  the  evening  lights  on  the  plains  beyond. They  limped  along  now  as  fast  as  they were  able  down  the  gentle  slopes  of  a  pine  forest  in  a  slanting  path  leading  steadily  southwards. At  times  they were pushing  through a sea of bracken with  tall  fronds  rising  right  above  the  hobbit's  head;  at  times  they  were  marching  along  quiet  as  quiet  over  a  floor  of  pine-needles;  and  all  the  while  the  forest-gloom got heavier  and  the  forest-silence deeper. There was no wind that evening to bring even a sea- sighing into the branches of the trees.    \"Must we go any further?\" asked Bilbo, when it was so dark that he could only  just  see  Thorin's  beard  wagging  beside  him,  and  so  quiet  that  he  could  hear  the  dwarves'  breathing  like  a  loud  noise.  \"My  toes  are  all  bruised  and  bent,  and  my  legs ache, and my stomach is wagging like an empty sack.\"  \"A bit further,\" said Gandalf.  After  what  seemed  ages  further  they  came  suddenly  to  an  opening  where  no  trees  grew.  The  moon  was  up  and  was  shining  into  the  clearing.  Somehow  it  struck  all of  them  as not  at  all  a nice place,  although  there was nothing wrong  to  see.  All  of a sudden  they heard a howl away down hill, a  long shuddering howl. It  was  answered  by  another  away  to  the  right  and  a  good  deal  nearer  to  them;  then  by  another  not  far  away  to  the  left.  It  was  wolves  howling  at  the  moon,  wolves  gathering together!  There were no wolves living near Mr. Baggins' hole at home, but he knew that  noise.  He  had  had  it  described  to  him  often  enough  in  tales.  One  of  his  elder  cousins  (on  the  Took  side),  who  had  been  a  great  traveller,  used  to  imitate  it  to  frighten him. To hear  it  out  in  the forest under  the moon was  too much for Bilbo.  Even  magic  rings  are  not  much  use  against  wolves-especially  against  the  evil  packs that lived under the shadow of the goblin-infested mountains, over the Edge  of  the Wild  on  the  borders  of  the  unknown. Wolves of  that sort smell keener  than  goblins, and do not need to see you to catch you!   ####-\"What  shall  we  do,  what  shall  we  do!\"  he  cried.  \"Escaping  goblins  to  be  caught  by wolves!\"  he  said,  and  it  became  a  proverb,  though we  now  say  'out  of  the frying-pan into the fire' in the same sort of uncomfortable situations.  \"Up the trees quick!\" cried Gandalf; and they ran to the trees at the edge of the  glade,  hunting  for  those  that  had  branches  fairly  low,  or  were  slender  enough  to  swarm  up.  They  found  them  as  quick  as  ever  they  could,  you  can  guess;  and  up  they went as high as ever  they could  trust  the branches. You would have  laughed  (from a safe distance), if you had seen the dwarves sitting up in the trees with their  beards dangling down, like old gentlemen gone cracked and playing at being boys.  Fili and Kili were at the top of a tall larch like an enormous Christmas tree. Dori,  Nori,  On,  Oin,  and  Gloin  were  more  comfortable  in  a  huge  pine  with  regular  branches  sticking  out  at  intervals  like  the  spokes  of  a  wheel.  Bifur,  Bofur,  Bombur,  and  Thorin  were  in  another.  Dwalin  and  Balin  had  swarmed  up  a  tall  slender fir with few branches and were  trying  to find a place  to sit  in  the greenery  of  the  topmost  boughs.  Gandalf,  who  was  a  good  deal  taller  than  the  others,  had  found  a  tree  into  which  they  could  not  climb,  a  large  pine  standing  at  the  very  edge  of  the  glade."
}