{
  "id": "b63aecafed6e71638eb03b98f845774e93d4076c",
  "text": "  Hermione opened her mouth, perhaps to tell Ron exactly how to use the Curse of the Bogies, but Harry hissed at her to be quiet and beckoned them all forward.  They flitted along corridors striped with bars of moonlight from the high windows. At every turn Harry expected to run into Filch or Mrs. Norris, but they were lucky. They sped up a staircase to the third floor and tiptoed toward the trophy room.  Malfoy and Crabbe weren't there yet. The crystal trophy cases glimmered where the moonlight caught them. Cups, shields, plates, and statues winked silver and gold in the darkness. They edged along the walls, keeping their eyes on the doors at either end of the room. Harry took out his wand in case Malfoy leapt in and started at once. The minutes crept by.  \"He's late, maybe he's chickened out,\" Ron whispered.  Then a noise in the next room made them jump. Harry had only just raised his wand when they heard someone speak -and it wasn't Malfoy.  \"Sniff around, my sweet, they might be lurking in a corner.\"  It was Filch speaking to Mrs. Norris. Horror-struck, Harry waved madly at the other three to follow him as quickly as possible; they scurried silently toward the door, away from Filch's voice. Neville's robes had barely whipped round the corner when they heard Filch enter the trophy room.  \"They're in here somewhere,\" they heard him mutter, \"probably hiding.\"  \"This way!\" Harry mouthed to the others and, petrified, they began to creep down a long gallery full of suits of armor. They could hear Filch getting nearer. Neville suddenly let out a frightened squeak and broke into a run -he tripped, grabbed Ron around the waist, and the pair of them toppled right into a suit of armor.  The clanging and crashing were enough to wake the whole castle.  \"RUN!\" Harry yelled, and the four of them sprinted down the gallery, not looking back to see whether Filch was following -- they swung around the doorpost and galloped down one corridor then another, Harry in the lead, without any idea where they were or where they were going -- they ripped through a tapestry and found themselves in a hidden passageway, hurtled along it and came out near their Charms classroom, which they knew was miles from the trophy room.  \"I think we've lost him,\" Harry panted, leaning against the cold wall and wiping his forehead. Neville was bent double, wheezing and spluttering.  I -- told -you,\" Hermione gasped, clutching at the stitch in her chest, \"I -- told -- you.\"  \"We've got to get back to Gryffindor tower,\" said Ron, \"quickly as possible.\"  \"Malfoy tricked you,\" Hermione said to Harry. \"You realize that, don't you? He was never going to meet you -- Filch knew someone was going to be in the trophy room, Malfoy must have tipped him off.\"  Harry thought she was probably right, but he wasn't going to tell her that.  \"Let's go.\"  It wasn't going to be that simple. They hadn't gone more than a dozen paces when a doorknob rattled and something came shooting out of a classroom in front of them.  It was Peeves. He caught sight of them and gave a squeal of delight.  \"Shut up, Peeves -- please -- you'll get us thrown out.\"  Peeves cackled.  \"Wandering around at midnight, Ickle Firsties? Tut, tut, tut. Naughty, naughty, you'll get caughty.\"  \"Not if you don't give us away, Peeves, please.\"  \"Should tell Filch, I should,\" said Peeves in a saintly voice, but his eyes glittered wickedly. \"It's for your own good, you know.\"  \"Get out of the way,\" snapped Ron, taking a swipe at Peeves this was a big mistake.  \"STUDENTS OUT OF BED!\" Peeves bellowed, \"STUDENTS OUT OF BED DOWN THE CHARMS CORRIDOR\"  Ducking under Peeves, they ran for their lives, right to the end of the corridor where they slammed into a door -- and it was locked.  \"This is it!\" Ron moaned, as they pushed helplessly at the door, \"We're done for! This is the end!\" They could hear footsteps, Filch running as fast as he could toward Peeves's shouts.  \"Oh, move over,\" Hermione snarled. She grabbed Harry's wand, tapped the lock, and whispered, 'Alohomora!\"  The lock clicked and the door swung open -- they piled through it, shut it quickly, and pressed their ears against it, listening.  \"Which way did they go, Peeves?\" Filch was saying. \"Quick, tell me.\"  \"Say 'please.\"'  \"Don't mess with me, Peeves, now where did they go?\"  \"Shan't say nothing if you don't say please,\" said Peeves in his annoying singsong voice.  \"All right -please.\"  \"NOTHING! Ha haaa! Told you I wouldn't say nothing if you didn't say please! Ha ha! Haaaaaa!\" And they heard the sound of Peeves whooshing away and Filch cursing in rage.  \"He thinks this door is locked,\" Harry whispered. \"I think we'll be okay -- get off, Neville!\" For Neville had been tugging on the sleeve of Harry's bathrobe for the last minute. \"What?\"  Harry turned around -- and saw, quite clearly, what. For a moment, he was sure he'd walked into a nightmare -- this was too much, on top of everything that had happened so far.  They weren't in a room, as he had supposed."
}