{
  "id": "b7f8fedf43995d9c90b26efd6dd5c7dd72067f75",
  "text": " Hodor had heard all the stories before, but Jojen might not have.  Old ghosts, from before the Old King, even before Aegon the Dragon, seventy-nine deserters who went south to be outlaws. One was Lord Ryswell’s youngest son, so when they reached the barrowlands they sought shelter at his castle, but Lord Ryswell took them captive and returned them to the Nightfort. The Lord Commander had holes hewn in the top of the Wall and he put the deserters in them and sealed them up alive in the ice. They have spears and horns and they all face north. The seventy-nine sentinels, they’re called. They left their posts in life, so in death their watch goes on forever. Years later, when Lord Ryswell was old and dying, he had himself carried to the Nightfort so he could take the black and stand beside his son. He’d sent him back to the Wall for honor’s sake, but he loved him still, so he came to share his watch.   They spent half the day poking through the castle. Some of the towers had fallen down and others looked unsafe, but they climbed the bell tower (the bells were gone) and the rookery (the birds were gone). Beneath the brewhouse they found a vault of huge oaken casks that boomed hollowly when Hodor knocked on them. They found a library (the shelves and bins had collapsed, the books were gone, and rats were everywhere). They found a dank and dim-lit dungeon with cells enough to hold five hundred captives, but when Bran grabbed hold of one of the rusted bars it broke off in his hand. Only one crumbling wall remained of the great hall, the bathhouse seemed to be sinking into the ground, and a huge thornbush had conquered the practice yard outside the armory where black brothers had once labored with spear and shield and sword. The armory and the forge still stood, however, though cobwebs, rats, and dust had taken the places of blades, bellows, and anvil. Sometimes Summer would hear sounds that Bran seemed deaf to, or bare his teeth at nothing, the fur on the back of his neck bristling… but the Rat Cook never put in an appearance, nor the seventy-nine sentinels, nor Mad Axe. Bran was much relieved. Maybe it is only a ruined empty castle.  By the time Meera returned, the sun was only a sword’s breath above the western hills.  What did you see?  her brother Jojen asked her.   I saw the haunted forest,  she said in a wistful tone.  Hills rising wild as far as the eye can see, covered with trees that no axe has ever touched. I saw the sunlight glinting off a lake, and clouds sweeping in from the west. I saw patches of old snow, and icicles long as pikes. I even saw an eagle circling. I think he saw me too. I waved at him.    Did you see a way down?  asked Jojen.  She shook her head.  No. It’s a sheer drop, and the ice is so smooth… I might be able to make the descent if I had a good rope and an axe to chop out handholds, but…    …but not us,  Jojen finished.   No,  his sister agreed.  Are you sure this is the place you saw in your dream? Maybe we have the wrong castle.    No. This is the castle. There is a gate here.   Yes, thought Bran, but it’s blocked by stone and ice.  As the sun began to set the shadows of the towers lengthened and the wind blew harder, sending gusts of dry dead leaves rattling through the yards. The gathering gloom put Bran in mind of another of Old Nan’s stories, the tale of Night’s King. He had been the thirteenth man to lead the Night’s Watch, she said; a warrior who knew no fear.  And that was the fault in him,  she would add,  for all men must know fear.  A woman was his downfall; a woman glimpsed from atop the Wall, with skin as white as the moon and eyes like blue stars. Fearing nothing, he chased her and caught her and loved her, though her skin was cold as ice, and when he gave his seed to her he gave his soul as well.  He brought her back to the Nightfort and proclaimed her a queen and himself her king, and with strange sorceries he bound his Sworn Brothers to his will. For thirteen years they had ruled, Night’s King and his corpse queen, till finally the Stark of Winterfell and Joramun of the wildlings had joined to free the Watch from bondage. After his fall, when it was found he had been sacrificing to the Others, all records of Night’s King had been destroyed, his very name forbidden.   Some say he was a Bolton,  Old Nan would always end.  Some say a Magnar out of Skagos, some say Umber, Flint, or Norrey. Some would have you think he was a Woodfoot, from them who ruled Bear island before the ironmen came. He never was. He was a Stark, the brother of the man who brought him down.  She always pinched Bran on the nose then, he would never forget it.  He was a Stark of Winterfell, and who can say? Mayhaps his name was Brandon. Mayhaps he slept in this very bed in this very room.   No, Bran thought, but he walked in this castle, where we’ll sleep tonight. He did not like that notion very much at all. Night’s King was only a man by light of day, Old Nan would always say, but the night was his to rule."
}