{
  "id": "b99a26480003b970bfdbe99766950781f681ab31",
  "text": "  Have Ser Cleos Frey brought a flagon of wine. I mean to question him soon, and I want his tongue well loosened.    As you command, my lady.   Not long after, a rider with the Mallister eagle sewn on his breast arrived with a message from Lord Jason, telling of another skirmish and another victory. Ser Flement Brax had tried to force a crossing at a different ford six leagues to the south. This time the Lannisters shortened their lances and advanced across the river behind on foot, but the Mallister bowmen had rained high arcing shots down over their shields, while the scorpions Edmure had mounted on the riverbank sent heavy stones crashing through to break up the formation.  They left a dozen dead in the water, only two reaching the shallows, where we dealt with them briskly,  the rider reported. He also told of fighting farther upstream, where Lord Karyl Vance held the fords.  Those thrusts too were turned aside, at grievous cost to our foes.   Perhaps Edmure was wiser than I knew, Catelyn thought. His lords all saw the sense in his battle plans, why was I so blind? My brother is not the little boy I remember, no more than Robb is.  She waited until evening before going to pay her call upon Ser Cleos Frey, reasoning that the longer she delayed, the drunker he was likely to be. As she entered the tower cell, Ser Cleos stumbled to his knees.  My lady, I knew naught of any escape. The Imp said a Lannister must needs have a Lannister escort, on my oath as a knight—    Arise, ser.  Catelyn seated herself.  I know no grandson of Walder Frey would be an oathbreaker.  Unless it served his purpose.  You brought peace terms, my brother said.    I did.  Ser Cleos lurched to his feet. She was pleased to see how unsteady he was.   Tell me,  she commanded, and he did.  When he was done, Catelyn sat frowning. Edmure had been right, these were no terms at all, except… Lannister will exchange Arya and Sansa for his brother?    Yes. He sat on the Iron Throne and swore it.    Before witnesses?    Before all the court, my lady. And the gods as well. I said as much to Ser Edmure, but he told me it was not possible, that His Grace Robb would never consent.    He told you true.  She could not even say that Robb was wrong. Arya and Sansa were children. The Kingslayer, alive and free, was as dangerous as any man in the realm. That road led nowhere.  Did you see my girls? Are they treated well?   Ser Cleos hesitated.  I… yes, they seemed…   He is fumbling for a lie, Catelyn realized, but the wine has fuddled his wits.  Ser Cleos,  she said coolly,  you forfeited the protection of your peace banner when your men played us false. Lie to me, and you’ll hang from the walls beside them. Believe that. I shall ask you once more—did you see my daughters?   His brow was damp with sweat.  I saw Sansa at the court, the day Tyrion told me his terms. She looked most beautiful, my lady. Perhaps a, a bit wan. Drawn, as it were.   Sansa, but not Arya. That might mean anything. Arya had always been harder to tame. Perhaps Cersei was reluctant to parade her in open court for fear of what she might say or do. They might have her locked safely out of sight. Or they might have killed her. Catelyn shoved the thought away.  His terms, you said… yet Cersei is Queen Regent.    Tyrion spoke for both of them. The queen was not there. She was indisposed that day, I was told.    Curious.  Catelyn thought back to that terrible trek through the Mountains of the Moon, and the way Tyrion Lannister had somehow seduced that sellsword from her service to his own. The dwarf is too clever by half. She could not imagine how he had survived the high road after Lysa had sent him from the Vale, yet it did not surprise her. He had no part in Ned’s murder, at the least. And he came to my defense when the clansmen attacked us. If I could trust his word…  She opened her hands to look down at the scars across her fingers. His dagger’s marks, she reminded herself. His dagger, in the hand of the killer he paid to open Bran’s throat. Though the dwarf denied it, to be sure. Even after Lysa locked him in one of her sky cells and threatened him with her moon door, he had still denied it.  He lied,  she said, rising abruptly.  The Lannisters are liars every one, and the dwarf is the worst of them. The killer was armed with his own knife.   Ser Cleos stared.  I know nothing of any—    You know nothing,  she agreed, sweeping from the cell. Brienne fell in beside her, silent. It is simpler for her, Catelyn thought with a pang of envy. She was like a man in that. For men the answer was always the same, and never farther away than the nearest sword. For a woman, a mother, the way was stonier and harder to know.  She took a late supper in the Great Hall with her garrison, to give them what encouragement she could. Rymund the Rhymer sang through all the courses, sparing her the need to talk. He closed with the song he had written about Robb’s victory at Oxcross.  And the stars in the night were the eyes of his wolves, and the wind itself was their song."
}