{
  "id": "b9dc57cda1db414b61319e34948daefe27284ebd",
  "text": " The horrible truth sank into Harry like a stone.  \"We didn't -- lose?\"  \"Diggory got the Snitch,\" said George. \"Just after you fell. He didn't realize what had happened. When he looked back and saw you on the ground, he tried to call it off. Wanted a rematch. But they won fair and square... even Wood admits it.\"  \"Where is Wood?\" said Harry, suddenly realizing he wasn't there.  \"Still in the showers,\" said Fred. \"We think he's trying to drown himself.\"  Harry put his face to his knees, his hands gripping his hair. Fred grabbed his shoulder and shook it roughly.  \"C'mon, Harry, you've never missed the Snitch before.\"  \"There had to be one time you didn't get it,\" said George.  \"It's not over yet,\" said Fred. \"We lost by a hundred points\"  \"Right? So if Hufflepuff loses to Ravenclaw and we beat Ravenclaw and Slytherin --.\"  \"Hufflepuff'll have to lose by at least two hundred points,\" said George.  \"But if they beat Ravenclaw...\"  \"No Way, Ravenclaw is too good. But if Slytherin loses against Hufflepuff...\"  \"It all depends on the points -- a margin of a hundred either way.\"  Harry lay there, not saying a word. They had lost... for the first time ever, he had lost a Quidditch match.  After ten minutes or so, Madam Pomfrey came over to tell the team to leave him in peace.  \"We'll come and see you later,\" Fred told him. \"Don't beat yourself up, Harry, you're still the best Seeker we've ever had.\"  The team trooped out, trailing mud behind them. Madam Pomfrey shut the door behind them, looking disapproving. Ron and Hermione moved nearer to Harry's bed.  \"Dumbledore was really angry,\" Hermione said in a quaking voice. \"I've never seen him like that before. He ran onto the field as You fell, waved his wand, and you sort of slowed down before you hit the ground. Then he whirled his wand at the dementors. Shot silver stuff at them. They left the stadium right away... He was furious they'd come onto the grounds. We heard him --\"  \"Then he magicked you onto a stretcher,\" said Ron. \"And walked up to school with you floating on it. Everyone thought you were --\"  His voice faded, but Harry hardly noticed. He was thinking about what the dementors had done to him... about the screaming voice. He looked up and saw Ron and Hermione lookin, at him so anxiously that he quickly cast around for something matter-of-fact to say.  \"Did someone get my Nimbus?\"  Ron and Hermione looked quickly at each other.  \"Er --\"  \"What?\" said Harry, looking from one to the other.  \"Well... when you fell off, it got blown away,\" said Hermione hesitantly.  \"And?\"  \"And it hit -- it hit -- oh, Harry -- it hit the Whomping Willow.\"  Harry's insides lurched. The Whomping Willow was a very violent tree that stood alone in the middle of the grounds.  \"And?\" he said, dreading the answer.  \"Well, you know the Whomping Willow,\" said Ron. \"It -- it doesn't like being hit.\"  \"Professor Flitwick brought it back just before you came around, said Hermione in a very small voice.  Slowly, she reached down for a bag at her feet, turned it upside down, and tipped a dozen bits of splintered wood and twig onto the bed, the only remains of Harry's faithful, finally beaten broomstick.  CHAPTER TEN  THE MARAUDER'S MAP  Madam Pomfrey insisted on keeping Harry in the hospital wing for the rest of the weekend. He didn't argue or complain, but he wouldn't let her throw away the shattered remnants of his Nimbus Two Thousand. He knew he was being stupid, knew that the Nimbus was beyond repair, but Harry couldn't help it; he felt as though he'd lost one of his best friends.  He had a stream of visitors, all intent on cheering him up. Hagrid sent him a bunch of earwiggy flowers that looked like yellow cabbages, and Ginny Weasley, blushing furiously, turned up with a get-well card she had made herself, which sang shrilly unless Harry kept it shut under his bowl of fruit. The Gryffindor team visited again on Sunday morning, this time accompanied by Wood, who told Harry (in a hollow, dead sort of voice) that he didn't blame    him in the slightest. Ron and Hermione left Harry's bedside only at night- But nothing anyone said or did could make Harry feel any better, because they knew only half of what was troubling him.  He hadn't told anyone about the Grim, not even Ron -and Hermione, because he knew Ron would panic and Hermione would scoff. The fact remained, however, that it had now appeared twice, and both appearances had been followed by near-fatal accidents; the first time, he had nearly been run over by the Knight Bus; the second, fallen fifty feet from his broomstick. Was the Grim going to haunt him until he actually died? Was he going to spend the rest of his life looking over his shoulder for the beast?  And then there were the dementors. Harry felt sick and humiliated every time he thought of them. Everyone said the dementors were horrible, but no one else collapsed every time they went near one. No one else heard echoes in their head of their dying parents.  Because Harry knew who that screaming voice belonged to now."
}