{
  "id": "baab0ac11663cdc67c2eca2dc16f28166b58cda5",
  "text": ".. or was it merely a bundle of robes? Harry lowered his wand slightly and glanced sideways at Cedric.  Cedric shot him a quizzical look.  They both turned back to watch the approaching figure. It stopped beside a towering marble headstone, only six feet from them.  For a second. Harry and Cedric and the short figure simply looked at one another. And then, without warning, Harry's scar exploded with pain.  It was agony such as he had never felt in all his life; his wand slipped from his fingers as he put his hands over his face; his knees buckled; he was on the ground and he could see nothing at all; his head was about to split open. From far away, above his head, he heard a high, cold voice say, \"Kill the spare.\" A swishing noise and a second voice, which screeched the words to the night: \"Avada Kedavra!\" A blast of green light blazed through Harry's eyelids, and he heard something heavy fall to the ground beside him; the pain in his scar reached such a pitch that he retched, and then it diminished; terrified of what he was about to see, he opened his stinging eyes. Cedric was lying spread-eagled on the ground beside him.  He was dead. For a second that contained an eternity, Harry stared into Cedric's face, at his open gray eyes, blank and expressionless as the windows of a deserted house, at his half-open mouth, which looked slightly surprised.  And then, before Harry's mind had accepted what he was seeing, before he could feel anything but numb disbelief, he felt himself being pulled to his feet. The short man in the cloak had put down his bundle, lit his wand, and was dragging Harry toward the marble headstone.  Harry saw the name upon it flickering in the wandlight before he was forced around and slammed against it.  TOM RIDDLE  The cloaked man was now conjuring tight cords around Harry, tying him from neck to ankles to the headstone.  Harry could hear shallow, fast breathing from the depths of the hood; he struggled, and the man hit him - hit him with a hand that had a finger missing.  And Harry realized who was under the hood.  It was Wormtail. \"You!\"  he gasped. But Wormtail, who had finished conjuring the ropes, did not reply; he was busy checking the tightness of the cords, his fingers trembling uncontrollably, rumbling over the knots. Once sure that Harry was bound so tightly to the headstone that he couldn't move an inch, Wormtail drew a length of some black material from the inside of his cloak and stuffed it roughly into Harry's mouth; then, without a word, he turned from Harry and hurried away. Harry couldn't make a sound, nor could he see where Wormtail had gone; he couldn't turn his head to see beyond the headstone; he could see only what was right in front of him. Cedric's body was lying some twenty feet away.  Some way beyond him, glinting in the starlight, lay the Triwizard Cup.  Harry's wand was on the ground at Cedric's feet.  The bundle of robes that Harry had thought was a baby was close by, at the foot of the grave.  It seemed to be stirring fretfully.  Harry watched it, and his scar seared with pain again . . . and he suddenly knew that he didn't want to see what was in those robes ... he didn't want that bundle opened.... He could hear noises at his feet.  He looked down and saw a gigantic snake slithering through the grass, circling the headstone where he was tied.  Wormtail's fast, wheezy breathing was growing louder again.  It sounded as though he was forcing something heavy across the ground. Then he came back within Harry's range of vision, and Harry saw him pushing a stone cauldron to the foot of the grave.  It was full of what seemed to be water - Harry could hear it slopping around - and it was larger than any cauldron Harry had ever used; a great stone belly large enough for a full-grown man to sit in. The thing inside the bundle of robes on the ground was stirring more persistently, as though it was trying to free itself.  Now Wormtail was busying himself at the bottom of the cauldron with a wand.  Suddenly there were crackling names beneath it.  The large snake slithered away into the darkness. The liquid in the cauldron seemed to heat very fast.  The surface began not only to bubble, but to send out fiery sparks, as though it were on fire.  Steam was thickening, blurring the outline of Wormtail tending the fire.  The movements beneath the robes became more agitated.  And Harry heard the high, cold voice again. \"Hurry!\" The whole surface of the water was alight with sparks now.  It might have been encrusted with diamonds. \"It is ready. Master.\" \"Now ...\" said the cold voice. Wormtail pulled open the robes on the ground, revealing what was inside them, and Harry let out a yell that was strangled in the wad of material blocking his mouth. It was as though Wormtail had flipped over a stone and revealed something ugly, slimy, and blind - but worse, a hundred times worse.  The thing Wormtail had been carrying had the shape of a crouched human child, except that Harry had never seen anything less like a child."
}