{
  "id": "bf90599d44fdf6cf383eb16667aab6836c3d3dc2",
  "text": "   I know a story about a boy who hated stories,  Old Nan said with her stupid little smile, her needles moving all the while, click click click, until Bran was ready to scream at her.  It would never be the way it had been, he knew. The crow had tricked him into flying, but when he woke up he was broken and the world was changed. They had all left him, his father and his mother and his sisters and even his bastard brother Jon. His father had promised he would ride a real horse to King’s Landing, but they’d gone without him. Maester Luwin had sent a bird after Lord Eddard with a message, and another to Mother and a third to Jon on the Wall, but there had been no answers.  Ofttimes the birds are lost, child,  the maester had told him.  There’s many a mile and many a hawk between here and King’s Landing, the message may not have reached them.  Yet to Bran it felt as if they had all died while he had slept… or perhaps Bran had died, and they had forgotten him. Jory and Ser Rodrik and Vayon Poole had gone too, and Hullen and Harwin and Fat Tom and a quarter of the guard.  Only Robb and baby Rickon were still here, and Robb was changed. He was Robb the Lord now, or trying to be. He wore a real sword and never smiled. His days were spent drilling the guard and practicing his swordplay, making the yard ring with the sound of steel as Bran watched forlornly from his window. At night he closeted himself with Maester Luwin, talking or going over account books. Sometimes he would ride out with Hallis Mollen and be gone for days at a time, visiting distant holdfasts. Whenever he was away more than a day, Rickon would cry and ask Bran if Robb was ever coming back. Even when he was home at Winterfell, Robb the Lord seemed to have more time for Hallis Mollen and Theon Greyjoy than he ever did for his brothers.   I could tell you the story about Brandon the Builder,  Old Nan said.  That was always your favorite.   Thousands and thousands of years ago, Brandon the Builder had raised Winterfell, and some said the Wall. Bran knew the story, but it had never been his favorite. Maybe one of the other Brandons had liked that story. Sometimes Nan would talk to him as if he were her Brandon, the baby she had nursed all those years ago, and sometimes she confused him with his uncle Brandon, who was killed by the Mad King before Bran was even born. She had lived so long, Mother had told him once, that all the Brandon Starks had become one person in her head.   That’s not my favorite,  he said.  My favorites were the scary ones.  He heard some sort of commotion outside and turned back to the window. Rickon was running across the yard toward the gatehouse, the wolves following him, but the tower faced the wrong way for Bran to see what was happening. He smashed a fist on his thigh in frustration and felt nothing.   Oh, my sweet summer child,  Old Nan said quietly,  what do you know of fear? Fear is for the winter, my little lord, when the snows fall a hundred feet deep and the ice wind comes howling out of the north. Fear is for the long night, when the sun hides its face for years at a time, and little children are born and live and die all in darkness while the direwolves grow gaunt and hungry, and the white walkers move through the woods.    You mean the Others,  Bran said querulously.   The Others,  Old Nan agreed.  Thousands and thousands of years ago, a winter fell that was cold and hard and endless beyond all memory of man. There came a night that lasted a generation, and kings shivered and died in their castles even as the swineherds in their hovels. Women smothered their children rather than see them starve, and cried, and felt their tears freeze on their cheeks.  Her voice and her needles fell silent, and she glanced up at Bran with pale, filmy eyes and asked,  So, child. This is the sort of story you like?    Well,  Bran said reluctantly,  yes, only…   Old Nan nodded.  In that darkness, the Others came for the first time,  she said as her needles went click click click.  They were cold things, dead things, that hated iron and fire and the touch of the sun, and every creature with hot blood in its veins. They swept over holdfasts and cities and kingdoms, felled heroes and armies by the score, riding their pale dead horses and leading hosts of the slain. All the swords of men could not stay their advance, and even maidens and suckling babes found no pity in them. They hunted the maids through frozen forests, and fed their dead servants on the flesh of human children.   Her voice had dropped very low, almost to a whisper, and Bran found himself leaning forward to listen.   Now these were the days before the Andals came, and long before the women fled across the narrow sea from the cities of the Rhoyne, and the hundred kingdoms of those times were the kingdoms of the First Men, who had taken these lands from the children of the forest. Yet here and there in the fastness of the woods the children still lived in their wooden cities and hollow hills, and the faces in the trees kept watch."
}