{
  "id": "bfcea37d2c368055ff8d5457bb87837fca356885",
  "text": " He laughed aloud. Anguy joined in, and then they were all laughing, Lem Lemoncloak, Sharna and Husband, even the serving boy, who had stepped out from behind the casks with a crossbow under one arm. Arya wanted to scream at them, but instead she started to smile…   Riders!  Gendry’s shout was shrill with alarm. The door burst open and there he was.  Soldiers,  he panted.  Coming down the river road, a dozen of them.   Hot Pie leapt up, knocking over his tankard, but Tom and the others were unpertubed.  There’s no cause for spilling good ale on my floor,  said Sharna.  Sit back down and calm yourself, boy, there’s rabbit coming. You too, girl. Whatever harm’s been done you, it’s over and it’s done and you’re with king’s men now. We’ll keep you safe as best we can.   Arya’s only answer was to reach over her shoulder for her sword, but before she had it halfway drawn Lem grabbed her wrist.  We’ll have no more of that, now.  He twisted her arm until her hand opened. His fingers were hard with callus and fearsomely strong. Again! Arya thought. It’s happening again, like it happened in the village, with Chiswyck and Raff and the Mountain That Rides. They were going to steal her sword and turn her back into a mouse. Her free hand closed around her tankard, and she swung it at Lem’s face. The ale sloshed over the rim and splashed into his eyes, and she heard his nose break and saw the spurt of blood. When he roared his hands went to his face, and she was free.  Run!  she screamed, bolting.  But Lem was on her again at once, with his long legs that made one of his steps equal to three of hers. She twisted and kicked, but he yanked her off her feet effortlessly and held her dangling while the blood ran down his face.   Stop it, you little fool,  he shouted, shaking her back and forth.  Stop it now!  Gendry moved to help her, until Tom Sevenstrings stepped in front of him with a dagger.  By then it was too late to flee. She could hear horses outside, and the sound of men’s voices. A moment later a man came swaggering through the open door, a Tyroshi even bigger than Lem with a great thick beard, bright green at the ends but growing out grey. Behind came a pair of crossbowmen helping a wounded man between them, and then others…  A more ragged band Arya had never seen, but there was nothing ragged about the swords, axes, and bows they carried. One or two gave her curious glances as they entered, but no one said a word. A one-eyed man in a rusty pothelm sniffed the air and grinned, while an archer with a head of stiff yellow hair was shouting for ale. After them came a spearman in a lioncrested helm, an older man with a limp, a Braavosi sellsword, a…   Harwin?  Arya whispered. It was! Under the beard and the tangled hair was the face of Hullen’s son, who used to lead her pony around the yard, ride at quintain with Jon and Robb, and drink too much on feast days. He was thinner, harder somehow, and at Winterfell he had never worn a beard, but it was him—her father’s man.  Harwin!  Squirming, she threw herself forward, trying to wrench free of Lem’s iron grip.  It’s me,  she shouted,  Harwin, it’s me, don’t you know me, don’t you?  The tears came, and she found herself weeping like a baby, just like some stupid little girl.  Harwin, it’s me!   Harwin’s eyes went from her face to the flayed man on her doublet.  How do you know me?  he said, frowning suspiciously.  The flayed man… who are you, some serving boy to Lord Leech?   For a moment she did not know how to answer. She’d had so many names. Had she only dreamed Arya Stark?  I’m a girl,  she sniffed.  I was Lord Bolton’s cupbearer but he was going to leave me for the goat, so I ran off with Gendry and Hot Pie. You have to know me! You used to lead my pony, when I was little.   His eyes went wide.  Gods be good,  he said in a choked voice.  Arya Underfoot? Lem, let go of her.    She broke my nose.  Lem dumped her unceremoniously to the floor.  Who in seven hells is she supposed to be?    The Hand’s daughter.  Harwin went to one knee before her.  Arya Stark, of Winterfell.       Catelyn   Robb, she knew, the moment she heard the kennels erupt.  Her son had returned to Riverrun, and Grey Wind with him. Only the scent of the great grey direwolf could send the hounds into such a frenzy of baying and barking. He will come to me, she knew. Edmure had not returned after his first visit, preferring to spend his days with Marq Piper and Patrek Mallister, listening to Rymund the Rhymer’s verses about the battle at the Stone Mill. Robb is not Edmure, though. Robb will see me.  It had been raining for days now, a cold grey downpour that well suited Catelyn’s mood. Her father was growing weaker and more delirious with every passing day, waking only to mutter,  Tansy,  and beg forgiveness. Edmure shunned her, and Ser Desmond Grell still denied her freedom of the castle, however unhappy it seemed to make him. Only the return of Ser Robin Ryger and his men, footweary and drenched to the bone, served to lighten her spirits."
}