{
  "id": "c339498d09993a0fd9ce69cdc51a3b937e3b0056",
  "text": " Have you ever heard of a decent one who could talk to snakes? They called Slytherin himself Serpent-tongue.\"  There was some heavy murmuring at this, and Ernie went on, \"Remember what was written on the wall? Enemies of the Heir, Beware. Potter had some sort of run-in with Filch. Next thing we know, Flich's cat's attacked. That first year, Creevey, was annoying Potter at the Quidditch match, taking pictures of him while he was lying in the mud. Next thing we know - Creevey's been attacked.\"  \"He always seems so nice, though,\" said Hannah uncertainly, \"and, well, he's the one who made You-Know-Who disappear. He can't be all bad, can he?\"  Ernie lowered his voice mysteriously, the Hufflepuffs bent closer, and Harry edged nearer so that he could catch Ernie's words.  \"No one knows how he survived that attack by You-Know-Who. I mean to say, he was only a baby when it happened. He should have been blasted into smithereens. Only a really powerful Dark wizard could have survived a curse like that.\" He dropped his voice until it was barely more than a whisper, and said, \"That's probably why You- Know-Who wanted to kill him in the first place. Didn't want another Dark Lord competing with him. I wonder what other powers Potter's been hiding?\"  Harry couldn't take anymore. Clearing his throat loudly, he stepped out from behind the bookshelves. If he hadn't been feeling so angry, he would have found the sight that greeted him funny: Every one of the Hufflepuffs looked as though they had been Petrified by the sight of him, and the color was draining out of Ernie's face.  *199*  \"Hello,\" said Harry. \"I'm looking for Justin Finch-Fletchley.\"  The Hufepuffs' worst fears had clearly been confirmed. They all looked fearfully at Ernie.  \"What do you want with him?\" said Ernie in a quavering voice.  \"I wanted to tell him what really happened with that snake at the Dueling Club,\" said Harry.  Ernie bit his white lips and then, taking a deep breath, said, \"We were all there. We saw what happened.\"  \"Then you noticed that after I spoke to it, the snake backed off?\" said Harry.  \"All I saw,\" said Ernie stubbornly, though he was trembling as he spoke, \"was you speaking Parseltongue and chasing the snake toward Justin. \"  \"I didn't chase it at him!\" Harry said, his voice shaking with anger. \"It didn't even touch him!\"  \"It was a very near miss,\" said Ernie. \"And in case you're getting ideas,\" he added hastily, \"I might tell you that you can trace my family back through nine generations of witches and warlocks and my blood's as pure as anyone's, so -\"  - cc I don't care what sort of blood you've got!\" said Harry fiercely. \"Why would I want to attack Muggle-borns?\"  \"I've heard you hate those Muggles you live with,\" said Ernie swiftly.  \"It's not possible to live with the Dursleys and not hate them,\" said Harry. \"Id like to see you try it.\"  He turned on his heel and stormed out of the library, earning himself a reproving glare from Madam Pince, who was polishing the gilded cover of a large spellbook.  *200*  Harry blundered up the corridor, barely noticing where he was going, he was in such a fury. The result was that he walked into something very large and solid, which knocked him backward onto the floor.  \"Oh, hello, Hagrid,\" Harry said, looking up.  Hagrid's face was entirely hidden by a woolly, snow-covered balaclava, but it couldn't possibly be anyone else, as he filled most of the corridor in his moleskin overcoat. A dead rooster was hanging from one of his massive, gloved hands.  \"All righ', Harry?\" he said, pulling up the balaclava so he could speak. \"Why aren't yeh in class?\"  \"Canceled,\" said Harry, getting up. \"What're you doing in here?\"  Hagrid held up the limp rooster.  \"Second one killed this term,\" he explained. \"It's either foxes or a Blood-Suckin Bugbear, an' I need the Headmaster's permission ter put a charm around the hen coop.\"  He peered more closely at Harry from under his thick, snowflecked eyebrows.  \"Yeh sure yeh're all righ'? Yeh look all hot an' bothered -\"  Harry couldn't bring himself to repeat what Ernie and the rest of the Hufflepuffs had been saying about him.  \"It's nothing,\" he said. \"Id better get going, Hagrid, it's Transfiguration next and I've got to pick up my books.\"  He walked off, his mind still full of what Ernie had said about him.   \"Justin's been waiting for something like this to happen ever since he let slip to Potter he was Muggle-born .....  * 2 0 IL *  Harry stamped up the stairs and turned along another corridor, which was particularly dark; the torches had been extinguished by a strong, icy draft that was blowing through a loose windowpane. He was halfway down the passage when he tripped headlong over something lying on the floor.  He turned to squint at what he'd fallen over and felt as though his stomach had dissolved.  Justin Finch-Fletchley was lying on the floor, rigid and cold, a look of shock frozen on his face, his eyes staring blankly at the ceiling. And that wasn't all. Next to him was another figure, the strangest sight Harry had ever seen."
}