{
  "id": "c4ab14c7c1a9013a1243dd285be4d8d18ced17c4",
  "text": "  The maester listened politely.  The wildling woman could give Old Nan lessons in telling tales, I think,  he said when Bran was done.  I will talk with her again if you like, but it would be best if you did not trouble your brother with this folly. He has more than enough to concern him without fretting over giants and dead men in the woods. It’s the Lannisters who hold your lord father, Bran, not the children of the forest.  He put a gentle hand on Bran’s arm.  Think on what I said, child.   And two days later, as a red dawn broke across a windswept sky, Bran found himself in the yard beneath the gatehouse, strapped atop Dancer as he said his farewells to his brother.   You are the lord in Winterfell now,  Robb told him. He was mounted on a shaggy grey stallion, his shield hung from the horse’s side; wood banded with iron, white and grey, and on it the snarling face of a direwolf. His brother wore grey chainmail over bleached leathers, sword and dagger at his waist, a fur-trimmed cloak across his shoulders.  You must take my place, as I took Father’s, until we come home.    I know,  Bran replied miserably. He had never felt so little or alone or scared. He did not know how to be a lord.   Listen to Maester Luwin’s counsel, and take care of Rickon. Tell him that I’ll be back as soon as the fighting is done.   Rickon had refused to come down. He was up in his chamber, redeyed and defiant.  No!  he’d screamed when Bran had asked if he didn’t want to say farewell to Robb.  NO farewell!    I told him,  Bran said.  He says no one ever comes back.    He can’t be a baby forever. He’s a Stark, and near four.  Robb sighed.  Well, Mother will be home soon. And I’ll bring back Father, I promise.   He wheeled his courser around and trotted away. Grey Wind followed, loping beside the warhorse, lean and swift. Hallis Mollen went before them through the gate, carrying the rippling white banner of House Stark atop a high standard of grey ash. Theon Greyjoy and the Greatjon fell in on either side of Robb, and their knights formed up in a double column behind them, steel-tipped lances glinting in the sun.  Uncomfortably, he remembered Osha’s words. He’s marching the wrong way, he thought. For an instant he wanted to gallop after him and shout a warning, but when Robb vanished beneath the portcullis, the moment was gone.  Beyond the castle walls, a roar of sound went up. The foot soldiers and townsfolk were cheering Robb as he rode past, Bran knew; cheering for Lord Stark, for the Lord of Winterfell on his great stallion, with his cloak streaming and Grey Wind racing beside him. They would never cheer for him that way, he realized with a dull ache. He might be the lord in Winterfell while his brother and father were gone, but he was still Bran the Broken. He could not even get off his own horse, except to fall.  When the distant cheers had faded to silence and the yard was empty at last, Winterfell seemed deserted and dead. Bran looked around at the faces of those who remained, women and children and old men… and Hodor. The huge stableboy had a lost and frightened look to his face.  Hodor?  he said sadly.   Hodor,  Bran agreed, wondering what it meant.      DAENERYS  When he had taken his pleasure, Khal Drogo rose from their sleeping mats to tower above her. His skin shone dark as bronze in the ruddy light from the brazier, the faint lines of old scars visible on his broad chest. Ink-black hair, loose and unbound, cascaded over his shoulders and down his back, well past his waist. His manhood glistened wetly. The khal’s mouth twisted in a frown beneath the droop of his long mustachio.  The stallion who mounts the world has no need of iron chairs.   Dany propped herself on an elbow to look up at him, so tall and magnificent. She loved his hair especially. It had never been cut; he had never known defeat.  It was prophesied that the stallion will ride to the ends of the earth,  she said.   The earth ends at the black salt sea,  Drogo answered at once. He wet a cloth in a basin of warm water to wipe the sweat and oil from his skin.  No horse can cross the poison water.    In the Free Cities, there are ships by the thousand,  Dany told him, as she had told him before.  Wooden horses with a hundred legs, that fly across the sea on wings full of wind.   Khal Drogo did not want to hear it.  We will speak no more of wooden horses and iron chairs.  He dropped the cloth and began to dress.  This day I will go to the grass and hunt, woman wife,  he announced as he shrugged into a painted vest and buckled on a wide belt with heavy medallions of silver, gold, and bronze.   Yes, my sun-and-stars,  Dany said. Drogo would take his bloodriders and ride in search of hrakkar, the great white lion of the plains. If they returned triumphant, her lord husband’s joy would be fierce, and he might be willing to hear her out.  Savage beasts he did not fear, nor any man who had ever drawn breath, but the sea was a different matter. To the Dothraki, water that a horse could not drink was something foul; the heaving grey-green plains of the ocean filled them with superstitious loathing."
}