{
  "id": "c616c2734fc3d910ae61b15135d0e1a149a3e54a",
  "text": " But they had not gone  very far  before Pippin came  running back,  fol lowed  by Merry.  They  both  looked terrified.       'There are trolls!' Pippin panted. 'Down in a clearing in the woods not  far below. We  got a sight of them  through  the tree-trunks.  They are very  large!'       'We  will come and  look at them,' said  Strider,  picking  up a stick.  Frodo said nothing, but Sam looked scared.       The  sun was now  high, and  it  shone  down through the  half-stripped  branches of  the  trees, and lit the clearing with bright patches of  light.  They halted  suddenly  on the  edge,  and  peered  through the  tree-trunks,  holding their breath. There stood  the trolls: three large  trolls.  One was  stooping, and the other two stood staring at him.       Strider walked forward unconcernedly. 'Get up, old stone!' he said, and  brok e his stick upon the stooping troll.       Nothing happened. There  was a  gasp  of astonishment from the hobbits,   and then even Frodo laughed. 'Well!' he said.  'We are forgetting our family  history!  These  must  be the  very  three  that  were  caught  by  Gandalf,   quarrelling over the right way to cook thirteen dwarves and one hobbit.'       'I had no  idea we were  anywhere near the place!' said Pippin. He knew  the  story well. Bilbo  and Frodo had told it often; but as a matter of fact  he had  never mor e than half believed  it. Even now he  looked  at the stone  trolls with suspicion, wondering if some magic might not suddenly bring them  to life again.       'You are forgetting not only your family history, but all you ever knew  about  trolls,' said Strider. 'It is broad daylight with  a bright sun,  and  yet you come back trying to scare me with a tale  of live trolls waiting for    ####-us in this glade! In any case you might have noticed that one of them has an  old bird's nest behind his ear. That would be a most unusual ornament  for a   live troll!'       They  all laughed.  Frodo felt  his spirits  reviving: the reminder  of  Bilbo's  first successful adventure  was  heartening. The sun, too, was warm  and comforting, and the mist before his  eyes seemed to be lifting a little.  They rested for some time in the glade,  and took  their  mid-day meal right  under the shadow of the trolls' large legs.       'Won't somebody give  us  a bit of a song, while the sun is high?' said  Merry, when they had finished. 'We haven't ha d a song or a tale for days.'       'Not since  Weathertop,' said Frodo. The  others looked at him.  'Don't   worry about me!' he added. 'I  feel much  better, but I  don't think I could  sing. Perhaps Sam could dig something out of his memory.'       'Come on,  Sam!' said Merry. 'There's more  stored in your head than you   let on about.'       'I don't know about that,' said Sam. 'But how would this suit? It ain't   what I call proper poetry, if you understand me: just a bit of nonsense. But  these old images here  brought it to my mind.' Standing  up,  with his hands  behind his back, as if he was at school, he began to sing to an old tune.       Troll sat alone on his seat of stone,       And munched and mumbled a bare old bone;       For many a year he had gnawed it near,       For meat was hard to come by.       Done by! Gum by!       In a case in the hills he dwelt alone,       And meat was hard to come by.         Up came Tom with his big boots on.       Said he to Troll: 'Pray, what is yon?       For it looks like the shin o' my nuncle Tim,       As should be a -lyin' in graveyard.       Caveyard! Paveyard!       This many a year has Tim been gone,       And I thought he were lyin' in graveyard.'         'My lad,' said Troll, 'this bone I stole.       But what be bones that lie in a  hole?   ####-     Thy nuncle was dead as a lump o' lead,       Afore I found his shinbone.       Tinbone! Thinbone!       He can spare a share for a poor old troll,       For he don't need his shinbone.'         Said Tom: 'I don't see why the likes o' thee       Without axin' leave should go makin' free       With the shank or the shin o' my father's kin;       So hand the old bone over!       Rover! Trover!       Though dead he be, it belongs to he;       So hand the old bone over!'          'For a couple o' pins,' says Troll, and grins,       'I'll eat thee too, and gnaw thy shins.       A bit o' fresh meal will go down sweet!       I'll try my teeth on thee now.        Hee now! See now!       I'm tired o' gnawing old bones and skins;       I've a mind to dine on thee now.'         But just as he thought his dinner was caught,       He found his hands had hold of naught.       Before he could mind, Tom slipped behind       And gave him the boot to larn him.       Warn him! Darn him!       A bump o' the boot on the seat, Tom thought,       Would be the way to larn him.         But harder than stone is the flesh and bone       Of a troll that sits in the hills alone.       As well set your boot to the mountain's root,       For the seat of a troll don't feel it."
}