{
  "id": "c65b2fb35235fc73de914e01d48ea33fa22e080b",
  "text": "  It would have been entirely unremarkable had it not been full to the brim with dancing blue-white flames. Dumbledore closed the casket and placed the goblet carefully on top of it, where it would be clearly visible to everyone in the Hall. \"Anybody wishing to submit themselves as champion must write their name and school clearly upon a slip of parchment and drop it into the goblet,\" said Dumbledore. \"Aspiring champions have twenty-four hours in which to put their names forward.  Tomorrow night, Halloween, the goblet will return the names of the three it has judged most worthy to represent their schools.  The goblet will be placed in the entrance hall tonight, where it will be freely accessible to all those wishing to compete. \"To ensure that no underage student yields to temptation,\" said Dumbledore, \"I will be drawing an Age Line around the Goblet of Fire once it has been placed in the entrance hall. Nobody under the age of seventeen will be able to cross this line. \"Finally, I wish to impress upon any of you wishing to compete that this tournament is not to be entered into lightly. Once a champion has been selected by the Goblet of Fire, he or she is obliged to see the tournament through to the end.  The placing of your name in the goblet constitutes a binding, magical contract.  There can be no change of heart once you have become a champion.  Please be very sure, therefore, that you are wholeheartedly prepared to play before you drop your name into the goblet.  Now, I think it is time for bed.  Good night to you all.\" \"An Age Line!\"  Fred Weasley said, his eyes glinting, as they all made their way across the Hall to the doors into the entrance hall.  \"Well, that should be fooled by an Aging Potion, shouldn't it?  And once your name's in that goblet, you're laughing - it can't tell whether you're seventeen or not!\" \"But I don't think anyone under seventeen will stand a chance,\" said Hermione, \"we just haven't learned enough. . .\" \"Speak for yourself,\" said George shortly.  \"You'll try and get in, won't you, Harry?\" Harry thought briefly of Dumbledore's insistence that nobody under seventeen should submit their name, but then the wonderful picture of himself winning the Triwizard Tournament filled his mind again. .. . He wondered how angry Dumbledore would be if someone younger than seventeen did find a way to get over the Age Line. \"Where is he?\" said Ron, who wasn't listening to a word of this conversation, but looking through the crowd to see what had become of Krum.  \"Dumbledore didn't say where the Durmstrang people are sleeping, did he?\" But this query was answered almost instantly; they were level with the Slytherin table now, and Karkaroff had just bustled up to his students. \"Back to the ship, then,\" he was saying. \"Viktor, how are you feeling?  Did you eat enough?  Should I send for some mulled wine from the kitchens?\" Harry saw Krum shake his head as he pulled his furs back on.  \"Professor, Ivood like some vine,\" said one of the other Durmstrang boys hopefully. \"I wasn't offering it to you, Poliakoff,\" snapped Karkaroff, his warmly paternal air vanishing in an instant. \"I notice you have dribbled food all down the front of your robes again, disgusting boy -\" Karkaroff turned and led his students toward the doors, reaching them at exactly the same moment as Harry, Ron, and Hermione.  Harry stopped to let him walk through first. \"Thank you,\" said Karkaroff carelessly, glancing at him.  And then Karkaroff froze.  He turned his head back to Harry and stared at him as though he couldn't believe his eyes.  Behind their headmaster, the students from Durmstrang came to a halt too.  Karkaroff's eyes moved slowly up Harry's face and fixed upon his scar.  The Durmstrang students were staring curiously at Harry too.  Out of the corner of his eye, Harry saw comprehension dawn on a few of their faces.  The boy with food all down his front nudged the girl next to him and pointed openly at Harry's forehead. \"Yeah, that's Harry Potter,\" said a growling voice from behind them. Professor Karkaroff spun around. Mad-Eye Moody was standing there, leaning heavily on his staff, his magical eye glaring unblinkingly at the Durmstrang headmaster. The color drained from Karkaroff's face as Harry watched.  A terrible look of mingled fury and fear came over him. \"You!\" he said, staring at Moody as though unsure he was really seeing him. \"Me,\" said Moody grimly. \"And unless you've got anything to say to Potter, Karkaroff, you might want to move. You're blocking the doorway.\" It was true; half the students in the Hall were now waiting behind them, looking over one another's shoulders to see what was causing the holdup. Without another word, Professor Karkaroff swept his students away with him.  Moody watched him until he was out of sight, his magical eye fixed upon his back, a look of intense dislike upon his mutilated face.  As the next day was Saturday, most students would normally have breakfasted late. Harry, Ron, and Hermione, however, were not alone in rising much earlier than they usually did on weekends."
}