{
  "id": "c870bd9d6c47a4ba9ec67b742f399e8f054587a3",
  "text": "  They  were  growing  anxious,  for  they  now  saw  that  the  house  might be hidden almost anywhere between them and the mountains. They came on  unexpected valleys, narrow with deep sides, that opened suddenly at their feet, and  they  looked  down  surprised  to  see  trees  below  them  and  running  water  at  the  bottom.  There  were  gullies  that  they  could  almost  leap  over;  but  very  deep  with  waterfalls in them. There were dark ravines that one could neither jump nor climb  into. There were bogs, some of them green pleasant places to look at with flowers  growing  bright  and  tall;  but  a  pony  that  walked  there  with  a  pack  on  its  back  would never have come out again.  It was indeed a much wider land from the ford to the mountains than ever you  would have guessed. Bilbo was astonished. The only path was marked with white  stones  some  of  which  were  small,  and  others  were  half  covered  with  moss  or  heather.  Altogether  it  was  a  very  slow  business  following  the  track,  even  guided  by Gandalf, who seemed to know his way about pretty well.  His head and beard wagged  this way and  that as he looked for the stones, and  they  followed  his  head,  but  they  seemed  no  nearer  to  the  end  of  the  search when  the day began to fail. Tea-time had long gone by, and it seemed supper-time would  soon  do  the  same.  There  were  moths  fluttering  about,  and  the  light  became  very  dim,  for  the  moon  had  not  risen.  Bilbo's  pony  began  to  stumble  over  roots  and  stones.  They  came  to  the  edge  of  a  steep  fall  in  the  ground  so  suddenly  that  Gandalf s horse nearly slipped down the slope.  \"Here  it  is  at  last!\"  he  called,  and  the  others  gathered  round  him  and  looked  over the edge. They saw a valley far below. They could hear the voice of hurrying  water in rocky bed at the bottom; the scent of trees was in the air; and there was a  light  on  the  valley-side across the water. Bilbo never forgot the way they slithered  and  slipped  in  the  dusk  down  the  steep  zig-zag  path  into  the  secret  valley  of  Rivendell. The air grew warmer as  they got  lower, and  the  smell of  the pine-trees  made  him  drowsy,  so  that  every  now  and  again  he  nodded  and  nearly  fell off, or  bumped  his  nose  on  the  pony's  neck.  Their  spirits  rose  as  they  went  down  and  down. The  trees changed  to beech and oak, and hire was a comfortable  feeling  in  the  twilight. The  last green had  almost  faded out of  the grass, when  they  came  at  length to an open glade not far above the banks of the stream.   ####-\"Hrnmm!  it  smells  like  elves!\"  thought  Bilbo,  and  he  looked  up  at  the  stars.  They  were  burning  bright  and  blue.  Just  then  there  came  a  burst  of  song  like  laughter in the trees:     O! What are you doing,  And where are you going?  Your ponies need shoeing!  The river is flowing!  O! tra-la-la-lally  here down in the valley!    O! What are you seeking,  And where are you making?  The faggots are reeking,  The bannocks are baking!  O! tril-lil-lil-lolly  the valley is jolly,   ha! ha!    O! Where are you going  With beards all a-wagging?  No knowing, no knowing  What brings Mister Baggins,  And Balin and Dwalin   down into the valley  in June  ha! ha!    O! Will you be staying,  Or will you be flying?  Your ponies are straying!  The daylight is dying!  To fly would be folly,   To stay would be jolly  And listen and hark  Till the end of the dark  to our tune  ha! ha.'       ####-So  they  laughed  and  sang  in  the  trees;  and  pretty  fair  nonsense  I  daresay  you  think  it. Not  that  they would  care  they would only  laugh  all  the more  if you  told  them  so.  They  were  elves  of  course.  Soon  Bilbo  caught  glimpses  of  them  as  the  darkness deepened. He loved elves, though he seldom met them; but he was a little  frightened of  them  too. Dwarves don't get on well with  them. Even decent enough  dwarves  like  Thorin  and  his  friends  think  them  foolish  (which  is  a  very  foolish  thing to think), or get annoyed with them. For some elves tease them and laugh at  them, and most of all at their beards.  \"Well,  well!\"  said  a  voice.  \"Just  look!  Bilbo  the  hobbit  on  a  pony,  my  dear!  Isn't it delicious!\"  \"Most astonishing wonderful!\"  Then  off  they  went  into  another  song  as  ridiculous  as  the  one  I  have  written  down  in  full. At  last one, a  tall young  fellow, came out  from  the  trees and bowed  to Gandalf and to Thorin.  \"Welcome to the valley!\" he said.  \"Thank you!\"  said Thorin a bit gruffly; but Gandalf was already off his horse  and among the elves, talking merrily with them.  \"You  are  a  little  out  of  your way,\"  said  the  elf:  \"that  is,  if  you  are making for  the only path across the water and to the house beyond. We will set you right, but  you had best get on foot, until you are over the bridge. Are you going to stay a bit  and  sing  with  us,  or  will  you  go  straight  on?  Supper  is  preparing  over  there,\" he  said."
}