{
  "id": "ca1cc1f0833110265af7eb96565737e384bd85b2",
  "text": " ... It was obvious from the looks on their faces that they had thought he wasn't going to turn up. Harry bent over, hands on his knees, gasping for breath; he had a stitch in his side that felt as though he had a knife between his ribs, but there was no time to get rid of it; Ludo Bagman was now moving among the champions, spacing them along the bank at intervals of ten feet.  Harry was on the very end of the line, next to Krum, who was wearing swimming trunks and was holding his wand ready. \"All right. Harry?\"  Bagman whispered as he moved Harry a few feet farther away from Krum.  \"Know what you're going to do?\" \"Yeah,\" Harry panted, massaging his ribs. Bagman gave Harry's shoulder a quick squeeze and returned to the judges' table; he pointed his wand at his throat as he had done at the World Cup, said, \"Sonorus!\" and his voice boomed out across the dark water toward the stands. \"Well, all our champions are ready for the second task, which will start on my whistle. They have precisely an hour to recover what has been taken from them.  On the count of three, then. One . . . two . . . three!\" The whistle echoed shrilly in the cold, still air; the stands erupted with cheers and applause; without looking to see what the other champions were doing, Harry pulled off his shoes and socks, pulled the handful of gillyweed out of his pocket, stuffed it into his mouth, and waded out into the lake. It was so cold he felt the skin on his legs searing as though this were fire, not icy water. His sodden robes weighed him down as he walked in deeper; now the water was over his knees, and his rapidly numbing feet were slipping over silt and flat, slimy stones.  He was chewing the gillyweed as hard and fast as he could; it felt unpleasantly slimy and rubbery, like octopus tentacles.  Waist-deep in the freezing water he stopped, swallowed, and waited for something to happen. He could hear laughter in the crowd and knew he must look stupid, walking into the lake without showing any sign of magical power.  The part of him that was still dry was covered in goose pimples; half immersed in the icy water, a cruel breeze lifting his hair, Harry started to shiver violently.  He avoided looking at the stands; the laughter was becoming louder, and there were catcalls and jeering from the Slytherins. ... Then, quite suddenly, Harry felt as though an invisible pillow had been pressed over his mouth and nose. He tried to draw breath, but it made his head spin; his lungs were empty, and he suddenly felt a piercing pain on either side of his neck - Harry clapped his hands around his throat and felt two large slits just below his ears, flapping in the cold air. . . . He had gills.  Without pausing to think, he did the only thing that made sense - he flung himself forward into the water. The first gulp of icy lake water felt like the breath of life.  His head had stopped spinning; he took another great gulp of water and felt it pass smoothly through his gills, sending oxygen back to his brain.  He stretched out his hands in front of him and stared at them.  They looked green and ghostly under the water, and they had become webbed.  He twisted around and looked at his bare feet - they had become elongated and the toes were webbed too: It looked as though he had sprouted flippers. The water didn't feel icy anymore either ... on the contrary, he felt pleasantly cool and very light. . . . Harry struck out once more, marveling at how far and fast his flipper-like feet propelled him through the vater, and noticing how clearly he could see, and how he no longer seemed to need to blink.  He had soon swum so far into the lake that he could no longer see the bottom. He flipped over and dived into its depths. Silence pressed upon his ears as he soared over a strange, dark, foggy landscape.  He could only see ten feet around him, so that as he sped throuugh the water new scenes seemed to loom suddenly out of the incoming darkness:  forests of rippling, tangled black weed, wide plains of mud littered with dull, glimmering stones.  He swam deeper and deeper, out toward the middle of the lake, his eyes wide, staring through the eerily gray-lit water around him to the shadow beyond, where the water became opaque. Small fish flickered past him like silver darts.  Once or twice he thought he saw something larger moving ahead of him, but when he got nearer, he discovered it to be nothing but a large, blackened log, or a dense clump of weed.  There was no sign of any of the other champions, merpeople, Ron - nor, thankfully, the giant squid. Light green weed stretched ahead of him as far as he could see, two feet deep, like a meadow of very overgrown grass.  Harry was staring unblinkingly ahead of him, trying to discern shapes through the gloom . . . and then, without warning, something grabbed hold of his ankle. Harry twisted his body around and saw a grindylow, a small, horned water demon, poking out of the weed, its long fingers clutched tightly around Harry's leg, its pointed fangs bared - Harry stuck his webbed hand quickly inside his robes and fumbled for his wand."
}