{
  "id": "cad042c3dbf2934c3043002cc49a922826e834c6",
  "text": " At last he came to the  bend  where  he  had  to  cross  the  water,  if  he  was  to  make  for  the  camp,  as  he  wished. The bed of the stream was there shallow but already broad, and fording it  in the dark was not easy for the little hobbit. He was nearly across when he missed  his  footing  on  a  round  stone  and  fell  into  the  cold  water  with  a  splash.  He  had  barely  scrambled  out  on  the  far  bank,  shivering  and  spluttering,  when  up  came  elves in the gloom with bright lanterns and searched for the cause of the noise.  \"That  was  no  fish!\"  one  said.  \"There  is  a  spy  about.  Hide  your  lights! They  will help him more  than us,  if  it  is  that queer  little creature  that  is said  to be  their  servant.\"  \"Servant,  indeed!\"  snorted  Bilbo;  and  in  the  middle  of  his  snort  he  sneezed  loudly, and the elves immediately gathered towards the sound.  \"Let's  have  a  light!\"  he  said.  \"I  am  here,  if  you want me!\"  and  he  slipped  off  his ring, and popped from behind a rock.   ####-They seized him quickly, in spite of their surprise. \"Who are you? Are you the  dwarves' hobbit? What are you doing? How did you get so far past our sentinels?\"  they asked one after another.   \"I am Mr. Bilbo Baggins,\" he answered, \"companion of Thorin, if you want to  know. I know your king well by sight, though perhaps he doesn't know me to look  at. But Bard will remember me, and it is Bard I particularly want to see.\"  \"Indeed!\" said they, \"and what may be your business?\"   \"Whatever  it  is,  it's my own, my good  elves. But  if you wish  ever  to get back  to  your  own  woods  from  this  cold  cheerless  place,\"  he  answered  shivering,  \"you  will  take me  along  quiet  to a fire, where I can dry-and then you will let me speak  to your chiefs as quick as may be. I have only an hour or two to spare.\"  That is how it came about that some two hours after his escape from the Gate,  Bilbo  was  sitting  beside  a  warm  fire  in  front  of  a  large  tent,  and  there  sat  too,  gazing curiously at him, both the Elvenking and Bard. A hobbit in elvish armour,  partly wrapped in an old blanket, was something new to them.  \"Really you know,\" Bilbo was  saying  in his best business manner,  \"things  are  impossible. Personally I am tired of the whole affair. I wish I was back in the West  in  my  own  home,  where  folk  are  more  reasonable.  But  I  have  an  interest  in  this  matter-one  fourteenth share,  to be precise, according  to a  letter, which  fortunately  I believe I have kept.\" He drew from a pocket in his old jacket (which he still wore  over his mail), crumpled and much folded, Thorin's letter that had been put under  the clock on his mantelpiece in May!  \"A share in the profits, mind you,\" he went on. \"I am aware of that. Personally  I am only too ready to consider all your claims carefully, and deduct what is right  from  the  total  before  putting  in my  own  claim.  However  you  don't  know  Thorin  Oakenshield as well as I do now. I assure you, he is quite ready to sit on a heap of  gold and starve, as long as you sit here.\"  \"Well, let him!\" said Bard. \"Such a fool deserves to starve.\"  \"Quite  so,\"  said  Bilbo.  \"I  see  your  point  of  view.  At  the  same  time  winter  is  coming  on  fast. Before  long  you will  be  having  snow  and what not, and supplies  will  be  difficult  –  even  for  elves  I  imagine.  Also  there  will  be  other  difficulties.  You have not heard of Dain and the dwarves of the Iron Hills?\"  \"We have, a long time ago; but what has he got to do with us?\" asked the king.  \"I  thought  as much.  I  see  I  have  some  information  you  have  not  got.  Dain,  I  may  tell  you,  is  now  less  than  two  days' march  off,  and  has  at  least  five  hundred  grim  dwarves  with  him  –  a  good  many  of  them  have  had  experience  in  the   ####-dreadful  dwarf  and  goblin  wars,  of  which  you  have  no  doubt  heard. When  they  arrive there may be serious trouble.\"  \"Why  do  you  tell  us  this?  Are  you  betraying  your  friends,  or  are  you  threatening us?\" asked Bard grimly.   \"My  dear  Bard!\"  squeaked  Bilbo.  \"Don't  be  so  hasty!  I  never  met  such  suspicious folk! I am merely trying to avoid trouble for all concerned. Now I will  make you an offer!!\"  \"Let us hear it!\" they said.  \"You may  see  it!\"  said  he.  \"It  is  this!\"  and  he  drew  forth  the Arkenstone,  and  threw away the wrapping.  The Elvenking himself, whose eyes were used to things of wonder and beauty,  stood up in amazement. Even Bard gazed marvelling at it in silence. It was as if a  globe had been  filled with moonlight and hung before  them  in a net woven of  the  glint of frosty stars.  \"This  is  the  Arkenstone  of  Thrain,\"  said  Bilbo,  \"the  Heart  of  the  Mountain;  and  it  is  also  the  heart  of  Thorin.  He  values  it  above  a  river  of  gold.  I  give  it  to  you.  It  will  aid  you  in  your  bargaining."
}