{
  "id": "cc4dcd881bf892a57b796ca661d70d04ce5fbc10",
  "text": "  He really couldn't think of anything to say.  The inside of his head seemed to be in complete disarray, as though his brain had been ransacked. \"So. . . tell me. . .\" said Cedric as they reached the entrance hall, which was now lit only by torches in the absence of the Goblet of Fire.  \"How did you get your name in?\" \"I didn't,\" said Harry, staring up at him. \"I didn't put it in. I was telling the truth.\"  \"Ah. . . okay,\" said Cedric.  Harry could tell Cedric didn't believe him.  \"Well . . . see you, then.\" Instead of going up the marble staircase, Cedric headed for a door to its right.  Harry stood listening to him going down the stone steps beyond it, then, slowly, he started to climb the marble ones. Was anyone except Ron and Hermione going to believe him, or would they all think he'd put himself in for the tournament?  Yet how could anyone think that, when he was facing competitors who'd had three years' more magical education than he had - when he was now facing tasks that not only sounded very dangerous, but which were to be performed in front of hundreds of people?  Yes, he'd thought about it. . . he'd fantasized about it.. . but it had been a joke, really, an idle sort of dream. . . he'd never really, seriously considered entering. . But someone else had considered it. . . someone else had wanted him in the tournament, and had made sure he was entered.  Why?  To give him a treat?  He didn't think so, somehow... To see him make a fool of himself?  Well, they were likely to get their wish. . But to get him killed? Was Moody just being his usual paranoid self?  Couldn't someone have put Harry's name in the goblet as a trick, a practical joke?  Did anyone really want him dead? Harry was able to answer that at once.  Yes, someone wanted him dead, someone had wanted him dead ever since he had been a year old. . . Lord Voldemort.  But how could Voldemort have ensured that Harry's name got into the Goblet of Fire?  Voldemort was supposed to be far away, in some distant country, in hiding, alone. . . feeble and powerless.... Yet in that dream he had had, just before he had awoken with his scar hurting, Voldemort had not been alone. . . he had been talking to Wormtail.. . plotting Harry's murder. Harry got a shock to find himself facing the Fat Lady already.  He had barely noticed where his feet were carrying him.  It was also a surprise to see that she was not alone in her frame.  The wizened witch who had flitted into her neighbor's painting when he had joined the champions downstairs was now sitting smugly beside the Fat Lady.  She must have dashed through every picture lining seven staircases to reach here before him.  Both she and the Fat Lady were looking down at him with the keenest interest. \"Well, well, well,\" said the Fat Lady, \"Violet's just told me everything.  Who's just been chosen as school champion, then?\" \"Balderdash,\" said Harry dully. \"It most certainly isn't!\" said the pale witch indignantly. \"No, no, Vi, it's the password,\" said the Fat Lady soothingly, and she swung forward on her hinges to let Harry into the common room. The blast of noise that met Harry's ears when the portrait opened almost knocked him backward.  Next thing he knew, he was being wrenched inside the common room by about a dozen pairs of hands, and was facing the whole of Gryffindor House, all of whom were screaming, applauding, and whistling. \"You should've told us you'd entered!\"  bellowed Fred; he looked half annoyed, half deeply impressed. \"How did you do it without getting a beard?  Brilliant!\"  roared George.  \"I didn't,\" Harry said.  \"I don't know how -\" But Angelina had now swooped down upon him; \"Oh if it couldn't be me, at least it's a Gryffindor -\" \"You'll be able to pay back Diggory for that last Quidditch match, Harry!\"  shrieked Katie Bell, another of the Gryffindor Chasers. \"We've got food, Harry, come and have some -\" \"I'm not hungry, I had enough at the feast -\" But nobody wanted to hear that he wasn't hungry; nobody wanted to hear that he hadn't put his name in the goblet; not one single person seemed to have noticed that he wasn't at all in the mood to celebrate. . . . Lee Jordan had unearthed a Gryffindor banner from somewhere, and he insisted on draping it around Harry like a cloak.  Harry couldn't get away; whenever he tried to sidle over to the staircase up to the dormitories, the crowd around him closed ranks, forcing another butterbeer on him, stuffing crisps and peanuts into his hands. . . . Everyone wanted to know how he had done it, how he had tricked Dumbledore's Age Line and managed to get his name into the goblet.... \"I didn't,\" he said, over and over again, \"I don't know how it happened.\" But for all the notice anyone took, he might just as well not have answered at all. \"I'm tired!\" he bellowed finally, after nearly half an hour.  \"No, seriously, George - I'm going to bed -\" He wanted more than anything to find Ron and Hermione, to find a bit of sanity, but neither of them seemed to be in the common room."
}