{
  "id": "cc51387e8d1c52c85622776e0a93b851f03b6a82",
  "text": "  It might serve,  Lord Rowan said,  if you are certain that you can keep the woman loyal to the King’s Grace.    My lords,  pronounced the High Septon,  autumn is upon us, and all men of good heart are weary of war. If Lord Baelish can bring the Vale back into the king’s peace without more shedding of blood, the gods will surely bless him.    But can he?  asked Lord Redwyne.  Jon Arryn’s son is Lord of the Eyrie now. The Lord Robert.    Only a boy,  said Littleflnger.  I will see that he grows to be Joffrey’s most loyal subject, and a fast friend to us all.   Tyrion studied the slender man with the pointed beard and irreverent grey-green eyes. Lord of Harrenhal an empty honor? Bugger that, Father. Even if he never sets foot in the castle, the title makes this match possible, as he’s known all along.   We have no lack of foes,  said Ser Kevan Lannister.  If the Eyrie can be kept out of the war, all to the good. I am of a mind to see what Lord Petyr can accomplish.   Ser Kevan was his brother’s vanguard in council, Tyrion knew from long experience; he never had a thought that Lord Tywin had not had first. It has all been settled beforehand, he concluded, and this discussion’s no more than show.  The sheep were bleating their agreement, unaware of how neatly they’d been shorn, so it fell to Tyrion to object.  How will the crown pay its debts without Lord Petyr? He is our wizard of coin, and we have no one to replace him.   Littlefinger smiled.  My little friend is too kind. All I do is count coppers, as King Robert used to say. Any clever tradesman could do as well… and a Lannister, blessed with the golden touch of Casterly Rock, will no doubt far surpass me.    A Lannister?  Tyrion had a bad feeling about this.  Lord Tywin’s gold-flecked eyes met his son’s mismatched ones.  You are admirably suited to the task, I believe.    Indeed!  Ser Kevan said heartily.  I’ve no doubt you’ll make a splendid master of coin, Tyrion.   Lord Tywin turned back to Littlefinger.  If Lysa Arryn will take you for a husband and return to the king’s peace, we shall restore the Lord Robert to the honor of Warden of the East. How soon might you leave?    On the morrow, if the winds permit. There’s a Braavosi galley standing out past the chain, taking on cargo by boat. The Merling King. I’ll see her captain about a berth.    You will miss the king’s wedding,  said Mace Tyrell.  Petyr Baelish gave a shrug.  Tides and brides wait on no man, my lord. Once the autumn storms begin the voyage will be much more hazardous. Drowning would definitely diminish my charms as a bridegroom.   Lord Tyrell chuckled.  True. Best you do not linger.    May the gods speed you on your way,  the High Septon said.  All King’s Landing shall pray for your success.   Lord Redwyne pinched at his nose.  May we return to the matter of the Greyjoy alliance? In my view, there is much to be said for it. Greyjoy’s longships will augment my own fleet and give us sufficient strength at sea to assault Dragonstone and end Stannis Baratheon’s pretensions.    King Balon’s longships are occupied for the nonce,  Lord Tywin said politely,  as are we. Greyjoy demands half the kingdom as the price of alliance, but what will he do to earn it? Fight the Starks? He is doing that already. Why should we pay for what he has given us for free? The best thing to do about our lord of Pyke is nothing, in my view. Granted enough time, a better option may well present itself. One that does not require the king to give up half his kingdom.   Tyrion watched his father closely. There’s something he’s not saying. He remembered those important letters Lord Tywin had been writing, the night Tyrion had demanded Casterly Rock. What was it he said? Some battles are won with swords and spears, others with quills and ravens… he wondered who the  better option  was, and what sort of price he was demanding.   Perhaps we ought move on to the wedding,  Ser Kevan said.  The High Septon spoke of the preparations being made at the Great Sept of Baelor, and Cersei detailed the plans she had been making for the feast. They would feed a thousand in the throne room, but many more outside in the yards. The outer and middle wards would be tented in silk, with tables of food and casks of ale for all those who could not be accommodated within the hall.   Your Grace,  said Grand Maester Pycelle,  in regard to the number of guests… we have had a raven from Sunspear. Three hundred Dornishmen are riding toward King’s Landing as we speak, and hope to arrive before the wedding.    How do they come?  asked Mace Tyrell gruffly.  They have not asked leave to cross my lands.  His thick neck had turned a dark red, Tyrion noted. Dornishmen and Highgardeners had never had great love for one another; over the centuries, they had fought border wars beyond count, and raided back and forth across mountains and marches even when at peace. The enmity had waned a bit after Dorne had become part of the Seven Kingdoms… until the Dornish prince they called the Red Viper had crippled the young heir of Highgarden in a tourney."
}