{
  "id": "cd975af2f4ee0c20f64a0327eaaf5de8095f7e14",
  "text": "  The gods are just, yet Blessed Baelor taught us that they are also merciful. What shall be done with this traitor, Your Grace?   A thousand voices were screaming, but Arya never heard them. Prince Joffrey… no, King Joffrey… stepped out from behind the shields of his Kingsguard.  My mother bids me let Lord Eddard take the black, and Lady Sansa has begged mercy for her father.  He looked straight at Sansa then, and smiled, and for a moment Arya thought that the gods had heard her prayer, until Joffrey turned back to the crowd and said,  But they have the soft hearts of women. So long as I am your king, treason shall never go unpunished. Ser Ilyn, bring me his head!   The crowd roared, and Arya felt the statue of Baelor rock as they surged against it. The High Septon clutched at the king’s cape, and Varys came rushing over waving his arms, and even the queen was saying something to him, but Joffrey shook his head. Lords and knights moved aside as he stepped through, tall and fleshless, a skeleton in iron mail, the King’s Justice. Dimly, as if from far off, Arya heard her sister scream. Sansa had fallen to her knees, sobbing hysterically. Ser Ilyn Payne climbed the steps of the pulpit.  Arya wriggled between Baelor’s feet and threw herself into the crowd, drawing Needle. She landed on a man in a butcher’s apron, knocking him to the ground. Immediately someone slammed into her back and she almost went down herself. Bodies closed in around her, stumbling and pushing, trampling on the poor butcher. Arya slashed at them with Needle.  High atop the pulpit, Ser Ilyn Payne gestured and the knight in black-and-gold gave a command. The gold cloaks flung Lord Eddard to the marble, with his head and chest out over the edge.   Here, you!  an angry voice shouted at Arya, but she bowled past, shoving people aside, squirming between them, slamming into anyone in her way. A hand fumbled at her leg and she hacked at it, kicked at shins. A woman stumbled and Arya ran up her back, cutting to both sides, but it was no good, no good, there were too many people, no sooner did she make a hole than it closed again. Someone buffeted her aside. She could still hear Sansa screaming.  Ser Ilyn drew a two-handed greatsword from the scabbard on his back. As he lifted the blade above his head, sunlight seemed to ripple and dance down the dark metal, glinting off an edge sharper than any razor. Ice, she thought, he has Ice! Her tears streamed down her face, blinding her.  And then a hand shot out of the press and closed round her arm like a wolf trap, so hard that Needle went flying from her hand. Arya was wrenched off her feet. She would have fallen if he hadn’t held her up, as easy as if she were a doll. A face pressed close to hers, long black hair and tangled beard and rotten teeth.  Don’t look!  a thick voice snarled at her.   I… I… I…  Arya sobbed.  The old man shook her so hard her teeth rattled.  Shut your mouth and close your eyes, boy.  Dimly, as if from far away, she heard a… a noise… a soft sighing sound, as if a million people had let out their breath at once. The old man’s fingers dug into her arm, stiff as iron.  Look at me. Yes, that’s the way of it, at me.  Sour wine perfumed his breath.  Remember, boy?   It was the smell that did it. Arya saw the matted greasy hair, the patched, dusty black cloak that covered his twisted shoulders, the hard black eyes squinting at her. And she remembered the black brother who had come to visit her father.   Know me now, do you? There’s a bright boy.  He spat.  They’re done here. You’ll be coming with me, and you’ll be keeping your mouth shut.  When she started to reply, he shook her again, even harder.  Shut, I said.   The plaza was beginning to empty. The press dissolved around them as people drifted back to their lives. But Arya’s life was gone. Numb, she trailed along beside… Yoren, yes, his name is Yoren. She did not recall him finding Needle, until he handed the sword back to her.  Hope you can use that, boy.    I’m not—  she started.  He shoved her into a doorway, thrust dirty fingers through her hair, and gave it a twist, yanking her head back.  —not a smart boy, that what you mean to say?   He had a knife in his other hand.  As the blade flashed toward her face, Arya threw herself backward, kicking wildly, wrenching her head from side to side, but he had her by the hair, so strong, she could feel her scalp tearing, and on her lips the salt taste of tears.      BRAN  The oldest were men grown, seventeen and eighteen years from the day of their naming. One was past twenty. Most were younger, sixteen or less.  Bran watched them from the balcony of Maester Luwin’s turret, listening to them grunt and strain and curse as they swung their staves and wooden swords. The yard was alive to the clack of wood on wood, punctuated all too often by thwacks and yowls of pain when a blow struck leather or flesh. Ser Rodrik strode among the boys, face reddening beneath his white whiskers, muttering at them one and all."
}