{
  "id": "ce07f2e7db30e492a7c22ef4b961f1875fa03792",
  "text": "       'What's all this?' said Frodo, feeling inclined to laugh.       This is  what it is, Mr. Baggins, said  the leader  of the Shirriffs, a   two-feather hobbit: 'You're arrested for  Gate-breaking,  and  Tearing up of  Rules,  and  Assaulting  Gate-keepers,  and  Trespassing,  and  Sleeping  in  Shire-buildings without Leave, and Bribing Guards with Food.'       'And what else?' said Frodo.       'That'll do to go on with,' said the Shirriff-leader.       'I  can add some more, if  you like it,' said Sam. 'Calling your  Chief  Names, Wishing to punch his Pimply Face, and Thinking you  Shirriffs look  a   lot of Tom-fools.'       'There now, Mister, that'll do.  It's the Chief's orders that you're to  come  along quiet. We're going to  take you to Bywater and hand  you over to  the Chief's Men; and when he deals with your case you can have your say. But  if  you don't want  to  stay in the  Lockholes any longer than you  need,  I  should cut the say short, if I was you.'       To  the  discomfiture  of  the Shirriffs  Frodo  and his companions all  roared with laughter.  'Don't  be absurd!' said Frodo.  'I am  going where I  please, and in my own time. I happen to be going to Bag End on business, but   ####-if you insist on going too, well that is your affair.'       'Very  well, Mr. Baggins,' said the  leader, pushing the barrier aside.  'But don't forget I've arrested you.'       'I won't,'  said Frodo. 'Never.  But  I may forgive  you. Now I am  not  going any  further today, so if you'll kindly escort me to The Floating Log,  I'll be obliged.'       'I   can't  do   that,  Mr.  Baggins.  The  inn's   closed.  There's  a   Shirriff-house at the far end of the village. I'll take you there. '       'All right,' said Frodo. 'Go on and we'll follow.'       Sam had been looking the Shirriffs up and down and had spotted one that  he knew.  'Hey, come here  Robin Smallburrow!' he called.  'I want a word with  you.'       With a sheepish glance at his leader, who looked  wrathful but did  not   dare to interfere, Shirriff Smallburrow fell back and walked beside Sam, who  got down off his pony.       'Look here, Cock -robin!' said  Sam. 'You're Hobbiton-bred and ought  to  have more sense,  coming a -waylaying Mr. Frodo and all.  And what's all this  about the inn being closed?'       'They're all closed,' said Robin.  'The  Chief  doesn't hold with beer.  Leastways  that is how it started. But now I reckon it's his Men that has it  all.  And he  doesn't  hold with folk moving about; so if they  will or they  must, then they has to go to the Shirriff-house and explain their business.'       'You  ought to   be ashamed of  yourself having anything to do with such  nonsense,' said Sam. 'You used to like the inside of an inn better than  the  outside yourself. You were always popping in, on duty or off.'       'And so I would be still,  Sam,  if I  could. But don't be  hard on me.  What  can I  do? You know  how I went for a Shirriff seven years ago, before  any of this began. Gave me a chance of walking round the  country and seeing  folk, and hearing the news,  and knowing where the  good beer was.  But  now  it's different.'       'But you can give it  up,  stop Shirriffing, if it has  stopped being a   respectable job,' said Sam.       'We're not allowed to,' said Robin.       'If  I hear  not allowed much oftener,' said  Sam, 'I'm  going  to  get  angry.'       'Can't say as I'd be sorry to see  it,'  said Robin lowering his voice.  'If we  all got angry together something might be done. But  it's these Men,   ####-Sam, the Chief's Men. He sends them round everywhere, and if any of us small  folk stand  up for our rights, they drag him off to the Lockholes. They took   old Flourdumpling, old Will Whitfoot the Mayor,  first,  and they've taken a   lot more. Lately it's been getting worse. Often they beat 'em now.'       'Then  why do you do their work far them?' said Sam  angrily. 'Who sent  you to Frogmorton?'       'No one did. We stay  here in the big  Shirriff-house. We're the  First  Eastfarthing Troop now. There's hundreds of Shirriffs all told and they want   more, with  all these new rules. Most of them  are in it against their will,  but not all. Even in  the Shire there are some as like  minding other folk's  business and talking big. And there's worse than  that: there's a  few as do  spy-work for the Chief and his Men.'       'Ah! So that's how you had news of us, is it?'       'That's right. We  aren't allowed to send by it  now, but they use  the  old Quick Post service,  and keep  special runners at  different points. One  came in  from  Whitfurrows  last  night with a \"secret message\", and another   took it on from  here. And a message came back this afternoon saying you was  to be  arrested and taken to Bywater, not direct to the Lockholes. The Chief  wants to see you at once, evidently.'       'He won't be so eager when Mr. Frodo has finished with him,' said Sam.       The Shirriff-house at Frogmorton was as bad as the Bridge-house."
}