{
  "id": "cf91a1e2d57b1dfead0c9290724c0fa704a399fe",
  "text": " \"Hear it?\" said Myrtle. \"Yeah ... 'Come seek us where our voices sound .. .' and if I need persuading ... hang on, I need to listen again....\" He sank back beneath the water.  It took three more underwater renditions of the egg's song before Harry had it memorized; then he trod water for a while, thinking hard, while Myrtle sat and watched him. \"I've got to go and look for people who can't use their voices above the ground. . . .\" he said slowly. \"Er . . . who could that be?\" \"Slow, aren't you?\" He had never seen Moaning Myrtle so cheerful, apart from the day when a dose of PolyJuice Potion had given Hermione the hairy face and tail of a cat.  Harry stared around the bathroom, thinking ... if the voices could only be heard underwater, then it made sense for them to belong to underwater creatures.  He ran this theory past Myrtle, who smirked at him. \"Well, thats what Diggory thought,\" she said. \"He lay there talking to himself for ages about it.  Ages and ages . . . nearly all the bubbles had gone. ...\" \"Underwater ...\" Harry said slowly. \"Myrtle . . . what lives in the lake, apart from the giant squid?\" \"Oh all sorts,\" she said. \"I sometimes go down there . . . sometimes don't have any choice, if someone flushes my toilet when I'm not expecting it....\" Trying not to think about Moaning Myrtle zooming down a pipe to the lake with the contents of a toilet.  Harry said, \"Well, does anything in there have a human voice?  Hang on -\" Harry's eyes had fallen on the picture of the snoozing mermaid on the wall. \"Myrtle, there aren't merpeople in there, are there?\" \"Oooh, very good,\" she said, her thick glasses twinkling, \"it took Diggory much longer than that!  And that was with her awake too\" - Myrtle jerked her head toward the mermaid with an expression of great dislike on her glum face - \"giggling and showing off and flashing her fins.. ..\" \"Thats it, isn't it?\"  said Harry excitedly.  \"The second tasks to go and find the merpeople in the lake and ... and ...\" But he suddenly realized what he was saying, and he felt the excitement drain out of him as though someone had just pulled a plug in his stomach.  He wasn't a very good swimmer; he'd never had much practice.  Dudley had had lessons in his youth, but Aunt Petunia and Uncle Vernon, no doubt hoping that Harry would drown one day, hadn't bothered to give him any.  A couple of lengths of this bath were all very well, but that lake was very large, and very deep . . . and merpeople would surely live right at the bottom. . . . \"Myrtle,\" Harry said slowly, \"how am I supposed to breathe?\" At this, Myrtle's eyes filled with sudden tears again. \"Tactless!\" she muttered, groping in her robes for a handkerchief. \"What's tactless?\" said Harry, bewildered. \"Talking about breathing in front of me!\"  she said shrilly, and her voice echoed loudly around the bathroom.  \"When I can't. . . when I haven't. . . not for ages ...\" She buried her face in her handkerchief and sniffed loudly.  Harry remembered how touchy Myrtle had always been about being dead, but none of the other ghosts he knew made such a fuss about it. \"Sorry,\" he said impatiently. \"I didn't mean - I just forgot. . .\" \"Oh yes, very easy to forget Myrtle's dead,\" said Myrtle, gulping, looking at him out of swollen eyes.  \"Nobody missed me even when I was alive.  Took them hours and hours to find my body - I know, I was sitting there waiting for them.  Olive Hornby came into the bathroom - Are you in here again, sulking, Myrtle?'  she said, 'because Professor Dippet asked me to look for you -' And then she saw my body . . . ooooh, she didn't forget it until her dying day, I made sure of that... followed her around and reminded her, I did. I remember at her brother's wedding -\" But Harry wasn't listening; he was thinking about the merpeople's song again.  \"We've taken what you II sorely miss.\"  That sounded as though they were going to steal something of his, something he had to get back.  What were they going to take? \"--and then, of course, she went to the Ministry of Magic to stop me stalking her, so I had to come back here and live in my toilet.\" \"Good,\" said Harry vaguely.  \"Well, I'm a lot further on than I was. . . . Shut your eyes again, will you?  I'm getting out.\" He retrieved the egg from the bottom of the bath, climbed out, dried himself, and pulled on his pajamas and dressing gown again. \"Will you come and visit me in my bathroom again sometime?\"  Moaning Myrtle asked mournfully as Harry picked up the Invisibility Cloak. \"Er . . . I'll try,\" Harry said, though privately thinking the only way he'd be visiting Myrtle's bathroom again was if every other toilet in the castle got blocked.  \"See you.  Myrtle... thanks for your help.\" \"Bye, 'bye,\" she said gloomily, and as Harry put on the Invisibllity Cloak he saw her zoom back up the tap. Out in the dark corridor, Harry examined the Marauders Map to check that the coast was still clear.  Yes, the dots belonging to Filch and his cat, Mrs. Norris, were safely in their office ."
}