{
  "id": "d04f57cb14da715c2ae91cec3c40e70c64cbf4bb",
  "text": " If you sit on  the  doorstep  long  enough,  I daresay you will  think of  something. And well, don't  you  know,  I  think  we  have  talked  long  enough  for  one  night,  if  you  see  what  I  mean.  What  about  bed,  and  an  early  start,  and  all  that?  I  will  give  you  a  good  breakfast before you go.\"  \"Before  we  go,  I  suppose  you  mean,\"  said  Thorin.  \"Aren't  you  the  burglar?  And isn't sitting on the door-step your job, not to speak of getting inside the door?  But  I agree about bed and breakfast.  I  like eggs with my ham, when starting on a  journey: fried not poached, and mind you don't break 'em.\"  After  all  the  others  had  ordered  their  breakfasts  without  so  much  as  a  please  (which  annoyed  Bilbo  very much),  they  all  got  up.  The  hobbit  had  to  find  room   ####-for  them  all,  and  filled  all  his  spare-rooms  and  made  beds  on  chairs  and  sofas,  before  he  got  them  all  stowed  and  went  to  his  own  little  bed  very  tired  and  not  altogether  happy. One  thing  he  did make  his mind  up  about was  not  to  bother  to  get up very early and cook everybody else's wretched breakfast. The Tookishness  was  wearing  off,  and  he  was  not  now  quite  so  sure  that  he  was  going  on  any  journey  in  the morning.  As  he  lay  in  bed  he  could  hear  Thorin  still  humming  to  himself in the best bedroom next to him:     Far over the misty mountains cold   To dungeons deep and caverns old   We must away, ere break of day,   To find our long-forgotten gold.     Bilbo went  to  sleep with  that  in  his  ears,  and  it  gave  him  very  uncomfortable  dreams. It was long after the break of day, when he woke up.   ####-Chapter 2 <br> Roast Mutton  <br>   Up jumped Bilbo, and putting on his dressing-gown went into the dining-room.  There he saw nobody, but all the signs of a large and hurried breakfast. There was  a  fearful  mess  in  the  room,  and  piles  of  unwashed  crocks  in  the  kitchen.  Nearly  every pot and pan he possessed seemed to have been used. The washing-up was so  dismally real that Bilbo was forced to believe the party of the night before had not  been part of his bad dreams, as he had rather hoped. Indeed he was really relieved  after  all  to  think  that  they  had  all  gone  without  him,  and  without  bothering  to  wake him up (\"but with never a thank-you\" he thought); and yet in a way he could  not help feeling just a trifle disappointed. The feeling surprised him.  \"Don't be a fool, Bilbo Baggins!\" he said  to himself, \"thinking of dragons  and  all  that  outlandish  nonsense  at  your  age!\"  So  be  put  on  an  apron,  lit  fires,  boiled  water,  and  washed  up.  Then  he  had  a  nice  little  breakfast  in  the  kitchen  before  turning  out  the  dining-room. By  that  time  the sun was shining; and  the front door  was  open,  letting  in  a  warm  spring  breeze.  Bilbo  began  to  whistle  loudly  and  to  forget about the night before. In fact he was just sitting down to a nice little second  breakfast  in  the  dining-room by  the open window, when  in walked Gandalf.  \"My  dear  fellow,\"  said  he,  \"whenever  are  you  going  to  come?  What  about  an  early  start?-and here you are having breakfast, or whatever you call  it, at half past  ten!  They left you the message, because they could not wait.\"  \"What message?\" said poor Mr. Baggins all in a fluster.   \"Great Elephants!\" said Gandalf, \"you are not at all yourself this morning-you  have never dusted the mantel- piece!\"  \"What's  that  got  to  do  with  it?  I  have  had  enough  to  do  with  washing  up  for  fourteen!\"  \"If  you  had  dusted  the  mantelpiece  you  would  have  found  this  just under  the  clock,\"  said  Gandalf,  handing  Bilbo  a  note  (written,  of  course,  on  his  own  note- paper).  This is what he read:     \"Thorin and Company to Burglar Bilbo greeting!  For  your  hospitality  our  sincerest  thanks,  and  for  your  offer  of  professional assistance our grateful acceptance. Terms: cash on delivery, up to  and  not  exceeding  one  fourteenth  of  total  profits  (if  any);  all  traveling   ####-expenses  guaranteed  in  any  event;  funeral  expenses  to  be  defrayed  by  us  or  our representatives, if occasion arises and the matter is not otherwise arranged  for.  \"Thinking  it  unnecessary  to  disturb  your  esteemed  repose,  we  have  proceeded  in  advance  to  make  requisite  preparations,  and  shall  await  your  respected person at the Green Dragon Inn, Bywater, at II a.m. sharp. Trusting  that you will be punctual.    \"We have the honour to remain                                    \"Yours deeply                                                \"Thorin& Co.\"     \"That leaves you just ten minutes. You will have to run,\" said Gandalf.  \"But—\" said Bilbo.  \"No time for it,\" said the wizard.  \"But—\"said Bilbo again.  \"No time for that either! Off you go!\"  To  the  end  of  his  days  Bilbo  could  never  remember  how  he  found  himself  outside,  without  a  hat,  walking-stick  or  say  money,  or  anything  that  he  usually  took  when  he  went  out;  leaving  his  second  breakfast  half-finished  and  quite  unwashed-up,  pushing  his  keys  into  Gandalf's  hands,  and  running  as  fast  as  his  furry  feet  could  carry  him  down  the  lane,  past  the  great Mill,  across  The Water,  and then on for a whole mile or more."
}