{
  "id": "d3d60d23d4fd4dcb9df050fa41092724b0cb8ea7",
  "text": " What is dead can never die.  He smiled thinly.  If I make pious noises as required, Damphair will give me no trouble. And my uncle Victarion—    Lord Captain of the Iron Fleet, and a fearsome warrior. I have heard them sing of him in the alehouses.    During my lord father’s rebellion, he sailed into Lannisport with my uncle Euron and burned the Lannister fleet where it lay at anchor,  Theon recalled.  The plan was Euron’s, though. Victarion is like some great grey bullock, strong and tireless and dutiful, but not like to win any races. No doubt, he’ll serve me as loyally as he has served my lord father. He has neither the wits nor the ambition to plot betrayal.    Euron Croweye has no lack of cunning, though. I’ve heard men say terrible things of that one.   Theon shifted his seat.  My uncle Euron has not been seen in the islands for close on two years. He may be dead.  If so, it might be for the best. Lord Balon’s eldest brother had never given up the Old Way, even for a day. His Silence, with its black sails and dark red hull, was infamous in every port from Ibben to Asshai, it was said.   He may be dead,  Esgred agreed,  and if he lives, why, he has spent so long at sea, he’d be half a stranger here. The ironborn would never seat a stranger in the Seastone Chair.    I suppose not,  Theon replied, before it occurred to him that some would call him a stranger as well. The thought made him frown. Ten years is a long while, but I am back now, and my father is far from dead. I have time to prove myself.  He considered fondling Esgred’s breast again, but she would probably only take his hand away, and all this talk of his uncles had dampened his ardor somewhat. Time enough for such play at the castle, in the privacy of his chambers.  I will speak to Helya when we reach Pyke, and see that you have an honored place at the feast,  he said.  I must sit on the dais, at my father’s right hand, but I will come down and join you when he leaves the hall. He seldom lingers long. He has no belly for drink these days.    A grievous thing when a great man grows old.    Lord Balon is but the father of a great man.    A modest lordling.    Only a fool humbles himself when the world is so full of men eager to do that job for him.  He kissed her lightly on the nape of her neck.   What shall I wear to this great feast?  She reached back and pushed his face away.   I’ll ask Helya to garb you. One of my lady mother’s gowns might do. She is off on Harlaw, and not expected to return.    The cold winds have worn her away, I hear. Will you not go see her? Harlaw is only a day’s sail, and surely Lady Greyjoy yearns for a last sight of her son.    Would that I could. I am kept too busy here. My father relies on me, now that I am returned. Come peace, perhaps…    Your coming might bring her peace.    Now you sound a woman,  Theon complained.   I confess, I am… and new with child.   Somehow that thought excited him.  So you say, but your body shows no signs of it. How shall it be proven? Before I believe you, I shall need to see your breasts grow ripe, and taste your mother’s milk.    And what will my husband say to this? Your father’s own sworn man and servant?    We’ll give him so many ships to build, he’ll never know you’ve left him.   She laughed.  It’s a cruel lordling who’s seized me. If I promise you that one day you may watch my babe get suck, will you tell me more of your war, Theon of House Greyjoy? There are miles and mountains still ahead of us, and I would hear of this wolf king you served, and the golden lions he fights.   Ever anxious to please her, Theon obliged. The rest of the long ride passed swiftly as he filled her pretty head with tales of Winterfell and war. Some of the things he said astonished him. She is easy to talk to, gods praise her, he reflected. I feel as though I’ve known her for years. If the wench’s pillow play is half the equal of her wit, I’ll need to keep her… He thought of Sigrin the Shipwright, a thick-bodied, thick-witted man, flaxen hair already receding from a pimpled brow, and shook his head. A waste. A most tragic waste.  It seemed scarcely any time at all before the great curtain wall of Pyke loomed up before them.  The gates were open. Theon put his heels into Smiler and rode through at a brisk trot. The hounds were barking wildly as he helped Esgred dismount. Several came bounding up, tails wagging. They shot straight past him and almost bowled the woman over, leaping all around her, yapping and licking.  Off,  Theon shouted, aiming an ineffectual kick at one big brown bitch, but Esgred was laughing and wrestling with them.  A stableman came pounding up after the dogs.  Take the horse,  Theon commanded him,  and get these damn dogs away—   The lout paid him no mind. His face broke into a huge gap-toothed smile and he said,  Lady Asha. You’re back.    Last night,  she said.  I sailed from Great Wyk with Lord Goodbrother, and spent the night at the inn. My little brother was kind enough to let me ride with him from Lordsport."
}