{
  "id": "d4f7815f9a5d5812de6bd5e956c594a15b3b0505",
  "text": " Your Grace, forgive this one her outburst. Your slave’s name is Missandei, but…    Missandei is no longer a slave. I free you, from this instant. Come ride with me in the litter, I wish to talk.  Rakharo helped them in, and Dany drew the curtains shut against the dust and heat.  If you stay with me you will serve as one of my handmaids,  she said as they set off.  I shall keep you by my side to speak for me as you spoke for Kraznys. But you may leave my service whenever you choose, if you have father or mother you would sooner return to.    This one will stay,  the girl said.  This one… I… there is no place for me to go. This… I will serve you, gladly.    I can give you freedom, but not safety,  Dany warned.  I have a world to cross and wars to fight. You may go hungry. You may grow sick. You may be killed.    Valar morghulis,  said Missandei, in High Valyrian.   All men must die,  Dany agreed,  but not for a long while, we may pray.  She leaned back on the pillows and took the girl’s hand.  Are these Unsullied truly fearless?    Yes, Your Grace.    You serve me now. Is it true they feel no pain?    The wine of courage kills such feelings. By the time they slay their sucklings, they have been drinking it for years.    And they are obedient?    Obedience is all they know. If you told them not to breathe, they would find that easier than not to obey.   Dany nodded.  And when I am done with them?    Your Grace?    When I have won my war and claimed the throne that was my father’s, my knights will sheathe their swords and return to their keeps, to their wives and children and mothers… to their lives. But these eunuchs have no lives. What am I to do with eight thousand eunuchs when there are no more battles to be fought?    The Unsullied make flne guards and excellent watchmen, Your Grace,  said Missandei.  And it is never hard to find a buyer for such fine well-blooded troops.    Men are not bought and sold in Westeros, they tell me.    With all respect, Your Grace, Unsullied are not men.    If I did resell them, how would I know they could not be used against me?  Dany asked pointedly.  Would they do that? Fight against me, even do me harm?    If their master commanded. They do not question, Your Grace. All the questions have been culled from them. They obey.  She looked troubled.  When you are… when you are done with them… your Grace might command them to fall upon their swords.    And even that, they would do?    Yes.  Missandei’s voice had grown soft.  Your Grace.   Dany squeezed her hand.  You would sooner I did not ask it of them, though. Why is that? Why do you care?    This one does not… I… Your Grace…    Tell me.   The girl lowered her eyes.  Three of them were my brothers once, Your Grace.   Then I hope your brothers are as brave and clever as you. Dany leaned back into her pillow, and let the litter bear her onward, back to Balerion one last time to set her world in order. And back to Drogon. Her mouth set grimly.  It was a long, dark, windy night that followed. Dany fed her dragons as she always did, but found she had no appetite herself. She cried awhile, alone in her cabin, then dried her tears long enough for yet another argument with Groleo.  Magister Illyrio is not here,  she finally had to tell him,  and if he was, he could not sway me either. I need the Unsullied more than I need these ships, and I will hear no more about it.   The anger burned the grief and fear from her, for a few hours at the least. Afterward she called her bloodriders to her cabin, with Ser Jorah. They were the only ones she truly trusted.  She meant to sleep afterward, to be well rested for the morrow, but an hour of restless tossing in the stuffy confines of the cabin soon convinced her that was hopeless. Outside her door she found Aggo fitting a new string to his bow by the light of a swinging oil lamp. Rakharo sat crosslegged on the deck beside him, sharpening his arakh with a whetstone. Dany told them both to keep on with what they were doing, and went up on deck for a taste of the cool night air. The crew left her alone as they went about their business, but Ser Jorah soon joined her by the rail. He is never far, Dany thought. He knows my moods too well.   Khaleesi. You ought to be asleep. Tomorrow will be hot and hard, I promise you. You’ll need your strength.    Do you remember Eroeh?  she asked him.   The Lhazareen girl?    They were raping her, but I stopped them and took her under my protection. Only when my sun-and-stars was dead Mago took her back, used her again, and killed her. Aggo said it was her fate.    I remember,  Ser Jorah said.   I was alone for a long time, Jorah. All alone but for my brother. I was such a small scared thing. Viserys should have protected me, but instead he hurt me and scared me worse. He shouldn’t have done that. He wasn’t just my brother, he was my king. Why do the gods make kings and queens, if not to protect the ones who can’t protect themselves?    Some kings make themselves. Robert did."
}