{
  "id": "d898ae08d7d734d3285617fdc89d4860e1175de4",
  "text": " \"Always the same,\" said Mr. Weasley, smiling.  \"We can't resist showing off when we get together.  Ah, here we are, look, this is us.\" They had reached the very edge of the wood at the top of the field, and here was an empty space, with a small sign hammered into the ground that read WEEZLY. \"Couldn't have a better spot!\" said Mr. Weasley happily.  \"The field is just on the other side of the wood there, we're as close as we could be.\"  He hoisted his backpack from his shoulders.  \"Right,\" he said excitedly, \"no magic allowed, strictly speaking, not when we're out in these numbers on Muggle land.  We'll be putting these tents up by hand!  Shouldn't be too difficult.... Muggles do it all the time.... Here, Harry, where do you reckon we should start?\" Harry had never been camping in his life; the Dursleys had never taken him on any kind of holiday, preferring to leave him with Mrs. Figg, an old neighbor.  However, he and Hermione worked out where most of the poles and pegs should go, and though Mr. Weasley was more of a hindrance than a help, because he got thoroughly overexcited when it came to using the mallet, they finally managed to erect a pair of shabby two-man tents. All of them stood back to admire their handiwork.  Nobody looking at these tents would guess they belonged to wizards, Harry thought, but the trouble was that once Bill, Charlie, and Percy arrived, they would be a party of ten. Hermione seemed to have spotted this problem too; she gave Harry a quizzical look as Mr. Weasley dropped to his hands and knees and entered the first tent. \"We'll be a bit cramped,\" he called, \"but I think we'll all squeeze in. Come and have a look.\" Harry bent down, ducked under the tent flap, and felt his jaw drop.  He had walked into what looked like an old-fashioned, three room flat, complete with bathroom and kitchen. Oddly enough, it was furnished in exactly the same sort of style as Mrs. Figg's house:  There were crocheted covers on the mismatched chairs and a strong smell of cats. \"Well, it's not for long,\" said Mr. Weasley, mopping his bald patch with a handkerchief and peering in at the four bunk beds that stood in the bedroom.  I borrowed this from Perkins at the office.  Doesn't camp much anymore, poor fellow, he's got lumbago.\" He picked up the dusty kettle and peered inside it.  \"We'll need water.... \"There's a tap marked on this map the Muggle gave us,\" said Ron, who had followed Harry inside the tent and seemed completely unimpressed by its extraordinary inner proportions. \"It's on the other side of the field.\" \"Well, why don't you, Harry, and Hermione go and get us some water then\" - Mr. Weasley handed over the kettle and a couple of saucepans - \"and the rest of us will get some wood for a fire?\" \"But we've got an oven,\" said Ron.  \"Why can't we just -\" \"Ron, anti-Muggle security!\"  said Mr. Weasley, his face shining with anticipation. \"When real Muggles camp, they cook on fires outdoors.  I've seen them at it!\" After a quick tour of the girls' tent, which was slightly smaller than the boys', though without the smell of cats, Harry, Ron, and Hermione set off across the campsite with the kettle and saucepans. Now, with the sun newly risen and the mist lifting, they could see the city of tents that stretched in every direction.  They made their way slowly through the rows, staring eagerly around.  It was only just dawning on Harry how many witches and wizards there must be in the world; he had never really thought much about those in other countries. Their fellow campers were starting to wake up.  First to stir were the families with small children; Harry had never seen witches and wizards this young before.  A tiny boy no older than two was crouched outside a large pyramid-shaped tent, holding a wand and poking happily at a slug in the grass, which was swelling slowly to the size of a salami.  As they drew level with him, his mother came hurrying out of the tent. \"How many times, Kevin?  You don't - touch - Daddy's - wand - yecchh! \" She had trodden on the giant slug, which burst.  Her scolding carried after them on the still air, mingling with the little boy's yells - \"You bust slug!  You bust slug!\" A short way farther on, they saw two little witches, barely older than Kevin, who were riding toy broomsticks that rose only high enough for the girls' toes to skim the dewy grass.  A Ministry wizard had already spotted them; as he hurried past Harry, Ron, and Hermione he muttered distractedly, \"In broad daylight!  Parents having a lie-in, I suppose -\" Here and there adult wizards and witches were emerging from their tents and starting to cook breakfast.  Some, with furtive looks around them, conjured fires with their wands; others were striking matches with dubious looks on their faces, as though sure this couldn't work. Three African wizards sat in serious conversation, all of them wearing long white robes and roasting what looked like a rabbit on a bright purple fire, while a group of middle-aged American witches sat gossiping happily beneath a spangled banner stretched between their tents that read:  THE SALEM WITCHES' INSTITUTE."
}