{
  "id": "d94a0fdcccb773e11212242e10685b24bff1d488",
  "text": " He could write whatever he chose, henceforth.  Whatever he chose…      Jon   The wind was blowing wild from the east, so strong the heavy cage would rock whenever a gust got it in its teeth. It skirled along the Wall, shivering off the ice, making Jon’s cloak flap against the bars. The sky was slate grey, the sun no more than a faint patch of brightness behind the clouds. Across the killing ground, he could see the glimmer of a thousand campfires burning, but their lights seemed small and powerless against such gloom and cold.  A grim day. Jon Snow wrapped gloved hands around the bars and held tight as the wind hammered at the cage once more. When he looked straight down past his feet, the ground was lost in shadow, as if he were being lowered into some bottomless pit. Well, death is a bottomless pit of sorts, he reflected, and when this day’s work is done my name will be shadowed forever.  Bastard children were born from lust and lies, men said; their nature was wanton and treacherous. Once Jon had meant to prove them wrong, to show his lord father that he could be as good and true a son as Robb. I made a botch of that. Robb had become a hero king; if Jon was remembered at all, it would be as a turncloak, an oathbreaker, and a murderer. He was glad that Lord Eddard was not alive to see his shame.  I should have stayed in that cave with Ygritte. If there was a life beyond this one, he hoped to tell her that. She will claw my face the way the eagle did, and curse me for a coward, but I’ll tell her all the same. He flexed his sword hand, as Maester Aemon had taught him. The habit had become part of him, and he would need his fingers to be limber to have even half a chance of murdering Mance Rayder.  They had pulled him out this morning, after four days in the ice, locked up in a cell five by five by five, too low for him to stand, too tight for him to stretch out on his back. The stewards had long ago discovered that food and meat kept longer in the icy storerooms carved from the base of the Wall… but prisoners did not.  You will die in here, Lord Snow,  Ser Alliser had said just before he closed the heavy wooden door, and Jon had believed it. But this morning they had come and pulled him out again, and marched him cramped and shivering back to the King’s Tower, to stand before jowly Janos Slynt once more.   That old maester says I cannot hang you,  Slynt declared.  He has written Cotter Pyke, and even had the bloody gall to show me the letter. He says you are no turncloak.    Aemon’s lived too long, my lord,  Ser Alliser assured him.  His wits have gone dark as his eyes.    Aye,  Slynt said.  A blind man with a chain about his neck, who does he think he is?   Aemon Targaryen, Jon thought, a king’s son and a king’s brother and a king who might have been. But he said nothing.   Still,  Slynt said,  I will not have it said that Janos Slynt hanged a man unjustly. I will not. I have decided to give you one last chance to prove you are as loyal as you claim, Lord Snow. One last chance to do your duty, yes!  He stood.  Mance Rayder wants to parley with us. He knows he has no chance now that Janos Slynt has come, so he wants to talk, this King-beyond-the-Wall. But the man is craven, and will not come to us. No doubt he knows I’d hang him. Hang him by his feet from the top of the Wall, on a rope two hundred feet long! But he will not come. He asks that we send an envoy to him.    We’re sending you, Lord Snow.  Ser Alliser smiled.   Me.  Jon’s voice was flat.  Why me?    You rode with these wildlings,  said Thorne.  Mance Rayder knows you. He will be more inclined to trust you.   That was so wrong Jon might have laughed.  You’ve got it backward. Mance suspected me from the first. If I show up in his camp wearing a black cloak again and speaking for the Night’s Watch, he’ll know that I betrayed him.    He asked for an envoy, we are sending one,  said Slynt.  If you are too craven to face this turncloak king, we can return you to your ice cell. This time without the furs, I think. Yes.    No need for that, my lord,  said Ser Alliser.  Lord Snow will do as we ask. He wants to show us that he is no turncloak. He wants to prove himself a loyal man of the Night’s Watch.   Thorne was much the more clever of the two, Jon realized; this had his stink all over it. He was trapped.  I’ll go,  he said in a clipped, curt voice.   M’lord,  Janos Slynt reminded him.  You’ll address me—    I’ll go, my lord. But you are making a mistake, my lord. You are sending the wrong man, my lord. Just the sight of me is going to anger Mance. My lord would have a better chance of reaching terms if he sent—    Terms?  Ser Alliser chuckled.   Janos Slynt does not make terms with lawless savages, Lord Snow. No, he does not.    We’re not sending you to talk with Mance Rayder,  Ser Alliser said.  We’re sending you to kill him.   The wind whistled through the bars, and Jon Snow shivered. His leg was throbbing, and his head. He was not fit to kill a kitten, yet here he was."
}