{
  "id": "d957dcd84adf8f458c8c0e3a9c252be27b34b3e6",
  "text": "  Osha moved among the tables, pouring ale. One of Leobald Tallhart’s men slid a hand up under her skirts and she broke the flagon over his head, to roars of laughter. Yet Mikken had his hand down some woman’s bodice, and she seemed not to mind. Bran watched Farlen make his red bitch beg for bones and smiled at Old Nan plucking at the crust of a hot pie with wrinkled fingers. On the dais, Lord Wyman attacked a steaming plate of lampreys as if they were an enemy host. He was so fat that Ser Rodrik had commanded that a special wide chair be built for him to sit in, but he laughed loud and often, and Bran thought he liked him. Poor wan Lady Hornwood sat beside him, her face a stony mask as she picked listlessly at her food. At the opposite end of the high table, Hothen and Mors were playing a drinking game, slamming their horns together as hard as knights meeting in joust.  It is too hot here, and too noisy, and they are all getting drunk. Bran itched under his grey and white woolens, and suddenly he wished he were anywhere but here. It is cool in the godswood now. Steam is rising off the hot pools, and the red leaves of the weirwood are rustling. The smells are richer than here, and before long the moon will rise and my brother will sing to it.   Bran?  Ser Rodrik said.  You do not eat.   The waking dream had been so vivid, for a moment Bran had not known where he was.  I’ll have more later,  he said.  My belly’s full to bursting.   The old knight’s white mustache was pink with wine.  You have done well, Bran. Here, and at the audiences. You will be an especial fine lord one day, I think.   I want to be a knight. Bran took another sip of the spiced honey wine from his father’s goblet, grateful for something to clutch. The lifelike head of a snarling direwolf was raised on the side of the cup. He felt the silver muzzle pressing against his palm, and remembered the last time he had seen his lord father drink from this goblet.  It had been the night of the welcoming feast, when King Robert had brought his court to Winterfell. Summer still reigned then. His parents had shared the dais with Robert and his queen, with her brothers beside her. Uncle Benjen had been there too, all in black. Bran and his brothers and sisters sat with the king’s children, Joffrey and Tommen and Princess Myrcella, who’d spent the whole meal gazing at Robb with adoring eyes. Arya made faces across the table when no one was looking; Sansa listened raptly while the king’s high harper sang songs of chivalry, and Rickon kept asking why Jon wasn’t with them.  Because he’s a bastard,  Bran finally had to whisper to him.  And now they are all gone. It was as if some cruel god had reached down with a great hand and swept them all away, the girls to captivity, Jon to the Wall, Robb and Mother to war, King Robert and Father to their graves, and perhaps Uncle Benjen as well…  Even down on the benches, there were new men at the tables. Jory was dead, and Fat Tom, and Porther, Alyn, Desmond, Hullen who had been master of horse, Harwin his son… all those who had gone south with his father, even Septa Mordane and Vayon Poole. The rest had ridden to war with Robb, and might soon be dead as well for all Bran knew. He liked Hayhead and Poxy Tym and Skittrick and the other new men well enough, but he missed his old friends.  He looked up and down the benches at all the faces happy and sad, and wondered who would be missing next year and the year after. He might have cried then, but he couldn’t. He was the Stark in Winterfell, his father’s son and his brother’s heir, and almost a man grown.  At the foot of the hall, the doors opened and a gust of cold air made the torches flame brighter for an instant. Alebelly led two new guests into the feast.  The Lady Meera of House Reed,  the rotund guardsman bellowed over the clamor.  With her brother, Jojen, of Greywater Watch.   Men looked up from their cups and trenchers to eye the newcomers. Bran heard Little Walder mutter,  Frogeaters,  to Big Walder beside him. Ser Rodrik climbed to his feet.  Be welcome, friends, and share this harvest with us.  Serving men hurried to lengthen the table on the dais, fetching trestles and chairs.   Who are they?  Rickon asked.   Mudmen,  answered Little Walder disdainfully.  They’re thieves and cravens, and they have green teeth from eating frogs.   Maester Luwin crouched beside Bran’s seat to whisper counsel in his ear.  You must greet these ones warmly. I had not thought to see them here, but… you know who they are?   Bran nodded.  Crannogmen. From the Neck.    Howland Reed was a great friend to your father,  Ser Rodrik told him.  These two are his, it would seem.   As the newcomers walked the length of the hall, Bran saw that one was indeed a girl, though he would never have known it by her dress. She wore lambskin breeches soft with long use, and a sleeveless jerkin armored in bronze scales. Though near Robb’s age, she was slim as a boy, with long brown hair knotted behind her head and only the barest suggestion of breasts."
}