{
  "id": "db9befbe5860be0453fc3873bcff7580031802ce",
  "text": " Stannis would be camped with his lords on the south bank of the river, doubtless seething with impatience and wondering what Ser Imry had done with his fleet.  Off Merling Rock two days before, they had sighted a half-dozen fishing skiffs. The fisherfolk had fled before them, but one by one they had been overtaken and boarded.  A small spoon of victory is just the thing to settle the stomach before battle,  Ser Imry had declared happily.  It makes the men hungry for a larger helping.  But Davos had been more interested in what the captives had to say about the defenses at King’s Landing. The dwarf had been busy building some sort of boom to close off the mouth of the river, though the fishermen differed as to whether the work had been completed or not. He found himself wishing it had. If the river was closed to them, Ser Imry would have no choice but to pause and take stock.  The sea was full of sound: shouts and calls, warhorns and drums and the trill of pipes, the slap of wood on water as thousands of oars rose and fell.  Keep line,  Davos shouted. A gust of wind tugged at his old green cloak. A jerkin of boiled leather and a pothelm at his feet were his only armor. At sea, heavy steel was as like to cost a man his life as to save it, he believed. Ser Imry and the other highborn captains did not share his view; they glittered as they paced their decks.  Harridan and Seahorse had slipped into their places now, and Lord Celtigar’s Red Claw beyond them. To starboard of Allard’s Lady Marya were the three galleys that Stannis had seized from the unfortunate Lord Sunglass, Piety, Prayer, and Devotion, their decks crawling with archers. Even Swordfish was closing, lumbering and rolling through a thickening sea under both oars and sail. A ship of that many oars ought to be much faster, Davos reflected with disapproval. It’s that ram she carries, it’s too big, she has no balance.  The wind was gusting from the south, but under oars it made no matter. They would be sweeping in on the flood tide, but the Lannisters would have the river current to their favor, and the Blackwater Rush flowed strong and swift where it met the sea. The first shock would inevitably favor the foe. We are fools to meet them on the Blackwater, Davos thought. In any encounter on the open sea, their battle lines would envelop the enemy fleet on both flanks, driving them inward to destruction. On the river, though, the numbers and weight of Ser Imry’s ships would count for less. They could not dress more than twenty ships abreast, lest they risk tangling their oars and colliding with each other.  Beyond the line of warships, Davos could see the Red Keep up on Aegon’s High Hill, dark against a lemon sky, with the mouth of the Rush opening out below. Across the river the south shore was black with men and horses, stirring like angry ants as they caught sight of the approaching ships. Stannis would have kept them busy building rafts and fletching arrows, yet even so the waiting would have been a hard thing to bear. Trumpets sounded from among them, tiny and brazen, soon swallowed by the roar of a thousand shouts. Davos closed his stubby hand around the pouch that held his fingerbones, and mouthed a silent prayer for luck.  Fury herself would center the first line of battle, flanked by the Lord Steffon and the Stag of the Sea, each of two hundred oars. On the port and starboard wings were the hundreds: Lady Harra, Brightfish, Laughing Lord, Sea Demon, Horned Honor, Ragged Jenna, Trident Three, Swift Sword, Princess Rhaenys, Dog’s Nose, Sceptre, Faithful, Red Raven, Queen Alysanne, Cat, Courageous, and Dragonsbane. From every stern streamed the fiery heart of the Lord of Light, red and yellow and orange. Behind Davos and his sons came another line of hundreds commanded by knights and lordly captains, and then the smaller, slower Myrish contingent, none dipping more than eighty oars. Farther back would come the sailed ships, carracks and lumbering great cogs, and last of all Salladhor Saan in his proud Valyrian, a towering three-hundred, paced by the rest of his galleys with their distinctive striped hulls. The flamboyant Lyseni princeling had not been pleased to be assigned the rear guard, but it was clear that Ser Imry trusted him no more than Stannis did. Too many complaints, and too much talk of the gold he was owed. Davos was sorry nonetheless. Salladhor Saan was a resourceful old pirate, and his crews were born seamen, fearless in a fight. They were wasted in the rear.  Ahooooooooooooooooooooooooo. The call rolled across whitecaps and churning oars from the forecastle of the Fury: Ser Imry was sounding the attack. Ahoooooooooooooooooooo, ahooooooooooooooooooooo.  Swordfish had joined the line at last, though she still had her sail raised.  Fast cruise,  Davos barked. The drum began to beat more quickly, and the stroke picked up, the blades of the oars cutting water, splash-swoosh, splash-swoosh, splash-swoosh. On deck, soldiers banged sword against shield, while archers quietly strung their bows and pulled the first arrow from the quivers at their belts."
}