{
  "id": "ddc69ce13b6d93ae53777a6c3e7cafc0a5dc34d3",
  "text": "  Is it a fight?  he asked.   I guess,  said Hot Pie, scrambling on all fours for a big rock to throw. Arya could not believe what she was seeing. She hated Hot Pie! Why would he risk himself for her?  The one with the broken nose still thought it was funny.  You girls put away them rocks and sticks before you get spanked. None of you knows what end of a sword to hold.    I do!  Arya wouldn’t let them die for her like Syrio. She wouldn’t! Shoving through the hedge with Needle in hand, she slid into a water dancer’s stance.  Broken Nose guffawed. The officer looked her up and down.  Put the blade away, little girl, no one wants to hurt you.    I’m not a girl!  she yelled, furious. What was wrong with them? They rode all this way for her and here she was and they were just smiling at her.  I’m the one you want.    He’s the one we want.  The officer jabbed his shortsword toward the Bull, who’d come forward to stand beside her, Praed’s cheap steel in his hand.  But it was a mistake to take his eyes off Yoren, even for an instant. Quick as that, the black brother’s sword was pressed to the apple of the officer’s throat.  Neither’s the one you get, less you want me to see if your apple’s ripe yet. I got me ten, fifteen more brothers in that inn, if you still need convincing. I was you, I’d let loose of that gutcutter, spread my cheeks over that fat little horse, and gallop on back to the city.  He spat, and poked harder with the point of his sword.  Now.   The officer’s fingers uncurled. His sword fell in the dust.   We’ll just keep that,  Yoren said.  Good steel’s always needed on the Wall.    As you say. For now. Men.  The gold cloaks sheathed and mounted up.  You’d best scamper up to that Wall of yours in a hurry, old man. The next time I catch you, I believe I’ll have your head to go with the bastard boy’s.    Better men than you have tried.  Yoren slapped the rump of the officer’s horse with the flat of his sword and sent him reeling off down the kingsroad. His men followed.  When they were out of sight, Hot Pie began to whoop, but Yoren looked angrier than ever.  Fool! You think he’s done with us? Next time he won’t prance up and hand me no damn ribbon. Get the rest out o’ them baths, we need to be moving. Ride all night, maybe we can stay ahead o’ them for a bit.  He scooped up the shortsword the officer had dropped.  Who wants this?    Me!  Hot Pie yelled.   Don’t be using it on Arry.  He handed the boy the sword, hilt first, and walked over to Arya, but it was the Bull he spoke to.  Queen wants you bad, boy.   Arya was lost.  Why should she want him?   The Bull scowled at her.  Why should she want you? You’re nothing but a little gutter rat!    Well, you’re nothing but a bastard boy!  Or maybe he was only pretending to be a bastard boy.  What’s your true name?    Gendry,  he said, like he wasn’t quite sure.   Don’t see why no one wants neither o’ you,  Yoren said,  but they can’t have you regardless. You ride them two coursers. First sight of a gold cloak, make for the Wall like a dragon’s on your tail. The rest o’ us don’t mean spit to them.    Except for you,  Arya pointed out.  That man said he’d take your head too.    Well, as to that,  Yoren said,  if he can get it off my shoulders, he’s welcome to it.       JON   Sam?  Jon called softly.  The air smelled of paper and dust and years. Before him, tall wooden shelves rose up into dimness, crammed with leatherbound books and bins of ancient scrolls. A faint yellow glow filtered through the stacks from some hidden lamp. Jon blew out the taper he carried, preferring not to risk an open flame amidst so much old dry paper. Instead he followed the light, wending his way down the narrow aisles beneath barrel-vaulted ceilings. All in black, he was a shadow among shadows, dark of hair, long of face, grey of eye. Black moleskin gloves covered his hands; the right because it was burned, the left because a man felt half a fool wearing only one glove.  Samwell Tarly sat hunched over a table in a niche carved into the stone of the wall. The glow came from the lamp hung over his head. He looked up at the sound of Jon’s steps.   Have you been here all night?    Have I?  Sam looked startled.   You didn’t break your fast with us, and your bed hadn’t been slept in.  Rast suggested that maybe Sam had deserted, but Jon never believed it. Desertion required its own sort of courage, and Sam had little enough of that.   Is it morning? Down here there’s no way to know.    Sam, you’re a sweet fool,  Jon said.  You’ll miss that bed when we’re sleeping on the cold hard ground, I promise you.   Sam yawned.  Maester Aemon sent me to find maps for the Lord Commander. I never thought… Jon, the books, have you ever seen their like? There are thousands!   He gazed about him.  The library at Winterfell has more than a hundred. Did you find the maps?    Oh, yes.  Sam’s hand swept over the table, fingers plump as sausages indicating the clutter of books and scrolls before him.  A dozen, at the least."
}