{
  "id": "e0c881f56193e6926c6b12c76ec73b66802f57d9",
  "text": " Once, in desperation, he had tried rubbing two pieces of driftwood against each other, but the wood was rotted, and his efforts earned him only blisters. His clothes were sodden as well, and he had lost one of his boots somewhere in the bay before he washed up here.  Thirst; hunger; exposure. They were his companions, with him every hour of every day, and in time he had come to think of them as his friends. Soon enough, one or the other of his friends would take pity on him and free him from this endless misery. Or perhaps he would simply walk into the water one day, and strike out for the shore that he knew lay somewhere to the north, beyond his sight. It was too far to swim, as weak as he was, but that did not matter. Davos had always been a sailor; he was meant to die at sea. The gods beneath the waters have been waiting for me, he told himself. It’s past time I went to them.  But now there was a sail; only a speck on the horizon, but growing larger. A ship where no ship should be. He knew where his rock lay, more or less; it was one of a series of sea monts that rose from the floor of Blackwater Bay. The tallest of them jutted a hundred feet above the tide, and a dozen lesser monts stood thirty to sixty feet high. Sailors called them spears of the merling king, and knew that for every one that broke the surface, a dozen lurked treacherously just below it. Any captain with sense kept his course well away from them.  Davos watched the sail swell through pale red-rimmed eyes, and tried to hear the sound of the wind caught in the canvas. She is coming this way. Unless she changed course soon, she would pass within hailing distance of his meager refuge. It might mean life. If he wanted it. He was not sure he did.  Why should I live? he thought as tears blurred his vision. Gods be good, why? My sons are dead, Dale and Allard, Maric and Matthos, perhaps Devan as well. How can a father outlive so many strong young sons? How would I go on? I am a hollow shell, the crab’s died, there’s nothing left inside. Don’t they know that?  They had sailed up the Blackwater Rush flying the fiery heart of the Lord of Light. Davos and Black Betha had been in the second line of battle, between Dale’s Wraith and Allard on Lady Marya. Maric his thirdborn was oarmaster on Fury, at the center of the first line, while Matthos served as his father’s second. Beneath the walls of the Red Keep Stannis Baratheon’s galleys had joined in battle with the boy king Joffrey’s smaller fleet, and for a few moments the river had rung to the thrum of bowstrings and the crash of iron rams shattering oars and hulls alike.  And then some vast beast had let out a roar, and green flames were all around them: wildfire, pyromancer’s piss, the jade demon. Matthos had been standing at his elbow on the deck of Black Betha when the ship seemed to lift from the water. Davos found himself in the river, flailing as the current took him and spun him around and around. Upstream, the flames had ripped at the sky, fifty feet high. He had seen Black Betha afire, and Fury, and a dozen other ships, had seen burning men leaping into the water to drown. Wraith and Lady Marya were gone, sunk or shattered or vanished behind a veil of wildfire, and there was no time to look for them, because the mouth of the river was almost upon him, and across the mouth of the river the Lannisters had raised a great iron chain. From bank to bank there was nothing but burning ships and wildfire. The sight of it seemed to stop his heart for a moment, and he could still remember the sound of it, the crackle of flames, the hiss of steam, the shrieks of dying men, and the beat of that terrible heat against his face as the current swept him down toward hell.  All he needed to do was nothing. A few moments more, and he would be with his sons now, resting in the cool green mud on the bottom of the bay, with fish nibbling at his face.  Instead he sucked in a great gulp of air and dove, kicking for the bottom of the river. His only hope was to pass under the chain and the burning ships and the wildfire that floated on the surface of the water, to swim hard for the safety of the bay beyond. Davos had always been a strong swimmer, and he’d worn no steel that day, but for the helm he’d lost when he’d lost Black Betha. As he knifed through the green murk, he saw other men struggling beneath the water, pulled down to drown beneath the weight of plate and mail. Davos swam past them, kicking with all the strength left in his legs, giving himself up to the current, the water filling his eyes. Deeper he went, and deeper, and deeper still. With every stroke it grew harder to hold his breath. He remembered seeing the bottom, soft and dim, as a stream of bubbles burst from his lips. Something touched his leg… a snag or a fish or a drowning man, he could not tell.  He needed air by then, but he was afraid. Was he past the chain yet, was he out in the bay? If he came up under a ship he would drown, and if he surfaced amidst the floating patches of wildfire his first breath would sear his lungs to ash."
}