{
  "id": "e4613191ca913e3e2629e855483441f98c86d753",
  "text": "   The bird hates you, Jon Snow,  said Ygritte.  And well he might. He was a man, before you killed him.    I did not know,  said Jon truthfully, trying to remember the face of the man he had slain in the pass.  You told me Mance would take me.    And he will,  Ygritte said.   Mance is not here,  said Rattleshirt.  Ragwyle, gut him.   The big spearwife narrowed her eyes and said,  If the crow would join the free folk, let him show us his prowess and prove the truth of him.    I’ll do whatever you ask.  The words came hard, but Jon said them.  Rattleshirt’s bone armor clattered loudly as he laughed.  Then kill the Halfhand, bastard.    As if he could,  said Qhorin.  Turn, Snow, and die.   And then Qhorin’s sword was coming at him and somehow Longclaw leapt upward to block. The force of impact almost knocked the bastard blade from Jon’s hand, and sent him staggering backward. You must not balk, whatever is asked of you. He shifted to a two-hand grip, quick enough to deliver a stroke of his own, but the big ranger brushed it aside with contemptuous ease. Back and forth they went, black cloaks swirling, the youth’s quickness against the savage strength of Qhorin’s left-hand cuts. The Halfhand’s longsword seemed to be everywhere at once, raining down from one side and then the other, driving him where he would, keeping him off balance. Already he could feel his arms growing numb.  Even when Ghost’s teeth closed savagely around the ranger’s calf, somehow Qhorin kept his feet. But in that instant, as he twisted, the opening was there. Jon planted and pivoted. The ranger was leaning away, and for an instant it seemed that Jon’s slash had not touched him. Then a string of red tears appeared across the big man’s throat, bright as a ruby necklace, and the blood gushed out of him, and Qhorin Halfhand fell.  Ghost’s muzzle was dripping red, but only the point of the bastard blade was stained, the last half inch. Jon pulled the direwolf away and knelt with one arm around him. The light was already fading in Qhorin’s eyes.  …sharp,  he said, lifting his maimed fingers. Then his hand fell, and he was gone.  He knew, he thought numbly. He knew what they would ask of me. He thought of Samwell Tarly then, of Grenn and Dolorous Edd, of Pyp and Toad back at Castle Black. Had he lost them all, as he had lost Bran and Rickon and Robb? Who was he now? What was he?   Get him up.  Rough hands dragged him to his feet. Jon did not resist.  Do you have a name?   Ygritte answered for him.  His name is Jon Snow. He is Eddard Stark’s blood, of Winterfell.   Ragwyle laughed.  Who would have thought it? Qhorin Halfhand slain by some lordling’s byblow.    Gut him.  That was Rattleshirt, still ahorse. The eagle flew to him and perched atop his bony helm, screeching.   He yielded,  Ygritte reminded them.   Aye, and slew his brother,  said a short homely man in a rust-eaten iron halfhelm.  Rattleshirt rode closer, bones clattering.  The wolf did his work for him. It were foully done. The Halfhand’s death was mine.    We all saw how eager you were to take it,  mocked Ragwyle.   He is a warg,  said the Lord of Bones,  and a crow. I like him not.    A warg he may be,  Ygritte said,  but that has never frightened us.  Others shouted agreement. Behind the eyeholes of his yellowed skull Rattleshirt’s stare was malignant, but he yielded grudgingly. These are a free folk indeed, thought Jon.  They burned Qhorin Halfhand where he’d fallen, on a pyre made of pine needles, brush, and broken branches. Some of the wood was still green, and it burned slow and smoky, sending a black plume up into the bright hard blue of the sky. Afterward Rattleshirt claimed some charred bones, while the others threw dice for the ranger’s gear. Ygritte won his cloak.   Will we return by the Skirling Pass?  Jon asked her. He did not know if he could face those heights again, or if his garron could survive a second crossing.   No,  she said.  There’s nothing behind us.  The look she gave him was sad.  By now Mance is well down the Milkwater, marching on your Wall.       BRAN  The ashes fell like a soft grey snow.  He padded over dry needles and brown leaves, to the edge of the wood where the pines grew thin. Beyond the open fields he could see the great piles of man-rock stark against the swirling flames. The wind blew hot and rich with the smell of blood and burnt meat, so strong he began to slaver.  Yet as one smell drew them onward, others warned them back. He sniffed at the drifting smoke. Men, many men, many horses, and fire, fire, fire. No smell was more dangerous, not even the hard cold smell of iron, the stuff of man-claws and hardskin. The smoke and ash clouded his eyes, and in the sky he saw a great winged snake whose roar was a river of flame. He bared his teeth, but then the snake was gone. Behind the cliffs tall fires were eating up the stars.  All through the night the fires crackled, and once there was a great roar and a crash that made the earth jump under his feet."
}