{
  "id": "e537edc33a5c3503f351319e5fbb9cb2ec7bec13",
  "text": "    Ah, but Gregor was his to loathe, not yours to kill. Once Dondarrion lops the summit off our Mountain, the Clegane lands and incomes will pass to Sandor, but I wouldn’t hold my water waiting for his thanks, not that one. And now you must forgive me. Lady Tanda awaits with her fatted calves.   On the way to the door, Lord Petyr spied Grand Maester Malleon’s massive tome on the table and paused to idly flip open the cover.  The Lineages and Histories of the Great Houses of the Seven Kingdoms, With Descriptions of Many High Lords and Noble Ladies and Their Children,  he read.  Now there is tedious reading if ever I saw it. A sleeping potion, my lord?   For a brief moment Ned considered telling him all of it, but there was something in Littlefinger’s japes that irked him. The man was too clever by half, a mocking smile never far from his lips.  Jon Arryn was studying this volume when he was taken sick,  Ned said in a careful tone, to see how he might respond.  And he responded as he always did: with a quip.  In that case,  he said,  death must have come as a blessed relief.  Lord Petyr Baelish bowed and took his leave.  Eddard Stark allowed himself a curse. Aside from his own retainers, there was scarcely a man in this city he trusted. Littlefinger had concealed Catelyn and helped Ned in his inquiries, yet his haste to save his own skin when Jaime and his swords had come out of the rain still rankled. Varys was worse. For all his protestations of loyalty, the eunuch knew too much and did too little. Grand Maester Pycelle seemed more Cersei’s creature with every passing day, and Ser Barristan was an old man, and rigid. He would tell Ned to do his duty.  Time was perilously short. The king would return from his hunt soon, and honor would require Ned to go to him with all he had learned. Vayon Poole had arranged for Sansa and Arya to sail on the Wind Witch out of Braavos, three days hence. They would be back at Winterfell before the harvest. Ned could no longer use his concern for their safety to excuse his delay.  Yet last night he had dreamt of Rhaegar’s children. Lord Tywin had laid the bodies beneath the Iron Throne, wrapped in the crimson cloaks of his house guard. That was clever of him; the blood did not show so badly against the red cloth. The little princess had been barefoot, still dressed in her bed gown, and the boy… the boy…  Ned could not let that happen again. The realm could not withstand a second mad king, another dance of blood and vengeance. He must find some way to save the children.  Robert could be merciful. Ser Barristan was scarcely the only man he had pardoned. Grand Maester Pycelle, Varys the Spider, Lord Balon Greyjoy; each had been counted an enemy to Robert once, and each had been welcomed into friendship and allowed to retain honors and office for a pledge of fealty. So long as a man was brave and honest, Robert would treat him with all the honor and respect due a valiant enemy.  This was something else: poison in the dark, a knife thrust to the soul. This he could never forgive, no more than he had forgiven Rhaegar. He will kill them all, Ned realized.  And yet, he knew he could not keep silent. He had a duty to Robert, to the realm, to the shade of Jon Arryn… and to Bran, who surely must have stumbled on some part of the truth. Why else would they have tried to slay him?  Late that afternoon he summoned Tomard, the portly guardsman with the ginger-colored whiskers his children called Fat Tom. With Jory dead and Alyn gone, Fat Tom had command of his household guard. The thought filled Ned with vague disquiet. Tomard was a solid man; affable, loyal, tireless, capable in a limited way, but he was near fifty, and even in his youth he had never been energetic. Perhaps Ned should not have been so quick to send off half his guard, and all his best swords among them.   I shall require your help,  Ned said when Tomard appeared, looking faintly apprehensive, as he always did when called before his lord.  Take me to the godswood.    Is that wise, Lord Eddard? With your leg and all?    Perhaps not. But necessary.   Tomard summoned Varly. With one arm around each man’s shoulders, Ned managed to descend the steep tower steps and hobble across the bailey.  I want the guard doubled,  he told Fat Tom.  No one enters or leaves the Tower of the Hand without my leave.   Tom blinked.  M’lord, with Alyn and the others away, we are hard-pressed already—    It will only be a short while. Lengthen the watches.    As you say, m’lord,  Tom answered.  Might I ask why—    Best not,  Ned answered crisply.  The godswood was empty, as it always was here in this citadel of the southron gods. Ned’s leg was screaming as they lowered him to the grass beside the heart tree.  Thank you.  He drew a paper from his sleeve, sealed with the sigil of his House.  Kindly deliver this at once.   Tomard looked at the name Ned had written on the paper and licked his lips anxiously.  My lord…    Do as I bid you, Tom,  Ned said.  How long he waited in the quiet of the godswood, he could not say."
}