{
  "id": "e55da4a59661a48433bb6cd65db1efe4e0649827",
  "text": " Bowen Marsh and Othell Yarwyck exchanged a doubtful look, Janos Slynt was fuming, and Three-Finger Hobb looked as though he would sooner be back chopping carrots. But all of them seemed surprised to hear Maester Aemon murmur,  It is the war for the dawn you speak of, my lady. But where is the prince that was promised?    He stands before you,  Melisandre declared,  though you do not have the eyes to see. Stannis Baratheon is Azor Ahai come again, the warrior of fire. In him the prophecies are fulfilled. The red comet blazed across the sky to herald his coming, and he bears Lightbringer, the red sword of heroes.   Her words seemed to make the king desperately uncomfortable, Sam saw. Stannis ground his teeth, and said,  You called and I came, my lords. Now you must live with me, or die with me. Best get used to that.  He made a brusque gesture.  That’s all. Maester, stay a moment. And you, Tarly. The rest of you may go.   Me? Sam thought, stricken, as his brothers were bowing and making their way out. What does he want with me?   You are the one that killed the creature in the snow,  King Stannis said, when only the four of them remained.   Sam the Slayer.  Melisandre smiled.  Sam felt his face turning red.  No, my lady. Your Grace. I mean, I am, yes. I’m Samwell Tarly, yes.    Your father is an able soldier,  King Stannis said.  He defeated my brother once, at Ashford. Mace Tyrell has been pleased to claim the honors for that victory, but Lord Randyll had decided matters before Tyrell ever found the battlefield. He slew Lord Cafferen with that great Valyrian sword of his and sent his head to Aerys.  The king rubbed his jaw with a finger.  You are not the sort of son I would expect such a man to have.    I… I am not the sort of son he wanted, sire.    If you had not taken the black, you would make a useful hostage,  Stannis mused.   He has taken the black, sire,  Maester Aemon pointed out.   I am well aware of that,  the king said.  I am aware of more than you know, Aemon Targaryen.   The old man inclined his head.  I am only Aemon, sire. We give up our House names when we forge our maester’s chains.   The king gave that a curt nod, as if to say he knew and did not care.  You slew this creature with an obsidian dagger, I am told,  he said to Sam.   Y-yes, Your Grace. Jon Snow gave it to me.    Dragonglass.  The red woman’s laugh was music.  Frozen fire, in the tongue of old Valyria. Small wonder it is anathema to these cold children of the Other.    On Dragonstone, where I had my seat, there is much of this obsidian to be seen in the old tunnels beneath the mountain,  the king told Sam.  Chunks of it, boulders, ledges. The great part of it was black, as I recall, but there was some green as well, some red, even purple. I have sent word to Ser Rolland my castellan to begin mining it. I will not hold Dragonstone for very much longer, I fear, but perhaps the Lord of Light shall grant us enough frozen fire to arm ourselves against these creatures, before the castle falls.   Sam cleared his throat.  S-sire. The dagger… the dragonglass only shattered when I tried to stab a wight.   Melisandre smiled.  Necromancy animates these wights, yet they are still only dead flesh. Steel and fire will serve for them. The ones you call the Others are something more.    Demons made of snow and ice and cold,  said Stannis Baratheon.  The ancient enemy. The only enemy that matters.  He considered Sam again.  I am told that you and this wildling girl passed beneath the Wall, through some magic gate.    The B-black Gate,  Sam stammered.  Below the Nightfort.    The Nightfort is the largest and oldest of the castles on the Wall,  the king said.  That is where I intend to make my seat, whilst I fight this war. You will show me this gate.    I,  said Sam,  I w-will, if…  If it is still there. If it will open for a man not of the black. If…   You will,  snapped Stannis.  I shall tell you when.   Maester Aemon smiled.  Your Grace,  he said,  before we go, I wonder if you would do us the great honor of showing us this wondrous blade we have all heard so very much of.    You want to see Lightbringer? A blind man?    Sam shall be my eyes.   The king frowned.  Everyone else has seen the thing, why not a blind man?  His swordbelt and scabbard hung from a peg near the hearth. He took the belt down and drew the longsword out. Steel scraped against wood and leather, and radiance filled the solar; shimmering, shifting, a dance of gold and orange and red light, all the bright colors of fire.   Tell me, Samwell.  Maester Aemon touched his arm.   It glows,  said Sam, in a hushed voice.  As if it were on fire. There are no flames, but the steel is yellow and red and orange, all flashing and glimmering, like sunshine on water, but prettier. I wish you could see it, Maester.    I see it now, Sam. A sword full of sunlight. So lovely to behold.  The old man bowed stiffly.  Your Grace. My lady. This was most kind of you.    When King Stannis sheathed the shining sword, the room seemed to grow very dark, despite the sunlight streaming through the window."
}