{
  "id": "e56a119ff39f7372725c4366a9d2951efbc130e6",
  "text": ".. Harry Potter, you know... we've all got a bit of a blind spot where he's concerned.\"  \"And yet -- is it good for him to be given so much special treatment? Personally, I try and treat him like any other student. And any other student would be suspended -- at the very least -- for leading his friends into such danger. Consider, Minister -- against all school rules -- after all the precautions put in place for his protection -- out-of-bounds, at night, consorting with a werewolf and a murderer -- and I have reason to believe he has been visiting Hogsmeade illegally too --\"  \"Well, well... we shall see, Snape, we shall see.... The boy has undoubtedly been foolish....\"  Harry lay listening with his eyes tight shut. He felt very groggy. The words he was hearing seemed to be traveling very slowly from his ears to his brain, so that it was difficult to understand.... His limbs felt like lead; his eyelids too heavy to lift.... He wanted to lie here, on this comfortable bed, forever....  \"What amazes me most is the behavior of the dementors... you've really no idea what made them retreat, Snape?\"  \"No, Minister... by the time I had come 'round they were heading back to their positions at the entrances....\"  \"Extraordinary. And yet Black, and Harry, and the girl --\"  \"All unconscious by the time I reached them. I bound and gagged Black, naturally, conjured stretchers, and brought them all straight back to the castle.\"  There was a pause. Harry's brain seemed to be moving a little faster, and as it did, a gnawing sensation grew in the pit of his stomach....  He opened his eyes.  Everything was slightly blurred. Somebody had removed his glasses. He was lying in the dark hospital wing. At the very end of the ward, he could make out Madam Pomfrey with her back to him, bending over a bed. Harry squinted. Ron's red hair was visible beneath Madam Pomfrey's arm.  Harry moved his head over on the pillow. In the bed to his right lay Hermione. Moonlight was falling across her bed. Her eyes were open too. She looked petrified, and when she saw that Harry was awake, pressed a finger to her lips, then pointed to the hospital wing door. It was ajar, and the voices of Cornelius Fudge and Snape were coming through it from the corridor outside.  Madam Pomfrey now came walking briskly up the dark ward to Harry's bed. He turned to took at her. She was carrying the largest block of chocolate he had ever seen in his life. It looked like a small boulder.  \"Ah, you're awake!\" she said briskly. She placed the chocolate on Harry's bedside table and began breaking it apart with a small hammer.  \"How's Ron?\" said Harry and Hermione together.  \"He'll live, said Madam Pomfrey grimly. \"As for you two you'll be staying here until I'm satisfied you're -- Potter, what do you think you're doing?\"  Harry was sitting up, putting his glasses back on, and picking up his wand.  \"I need to see the headmaster,\" he said.  \"Potter,\" said Madam Pomfrey soothingly, \"it's all right. They've got Black. He's locked away upstairs. The dementors will be performing the kiss any moment now --\"  \"WHAT?\"  Harry jumped up out of bed; Hermione had done the same. But his shout had been heard in the corridor outside; next second, Cornelius Fudge and Snape had entered the ward.  \"Harry, Harry, what's this?\" said Fudge, looking agitated. \"You should be in bed -- has he had any chocolate?\" he asked Madam Pomfrey anxiously.  \"Minister, listen!\" Harry said. \"Sirius Black's innocent! Peter Pettigrew faked his own death! We saw him tonight! You can't let the dementors do that thing to Sirius, he's --\"  But Fudge was shaking his head with a small smile on his face.  \"Harry, Harry, you're very confused, you've been through a dreadful ordeal, lie back down, now, we've got everything under control....\"  \"YOU HAVEN'T!\" Harry yelled. \"YOUVE GOT THE WRONG MAN!\"  \"Minister, listen, please,\" Hermione said; she had hurried to Harry's side and was gazing imploringly into Fudge's face. \"I saw him too. It was Ron's rat, he's an Animagus, Pettigrew, I mean, and --\"  \"You see, Minister?\" said Snape. \"Confunded, both of them.... Black's done a very good job on them....\" \"WE'RE NOT CONFUNDED!\" Harry roared.  \"Minister! Professor!\" said Madam Pomfrey angrily. \"I must insist that you leave. Potter is my patient, and he should not be distressed!\"  \"I'm not distressed, I'm trying to tell them what happened!\" Harry said furiously. \"If they'd just listen --\"  But Madam Pomfrey suddenly stuffed a large chunk of chocolate into Harry's mouth; he choked, and she seized the opportunity to force him back onto the bed.  \"Now, please, Minister, these children need care. Please leave  The door opened again. It was Dumbledore. Harry swallowed his mouthful of chocolate with great difficulty and got up again.  \"Professor Dumbledore, Sirius Black --\"  \"For heaven's sake!\" said Madam Pomfrey hysterically. \"Is this a hospital wing or not? Headmaster, I must insist --\"  \"My apologies, Poppy, but I need a word with Mr."
}