{
  "id": "e8de4aebe307b6cf488b3ab79f50ebd506331bf0",
  "text": "  \"Brilliant,\" said Hermione. \"This isn't magic -- it's logic -- a puzzle. A lot of the greatest wizards haven't got an ounce of logic, they'd be stuck in here forever.\"  \"But so will we, won't we?\" \"Of course not,\" said Hermione. \"Everything we need is here on this paper. Seven bottles: three are poison; two are wine; one will get us safely through the black fire, and one will get us back through the purple.\"  \"But how do we know which to drink?\"  \"Give me a minute.\"  Hermione read the paper several times. Then she walked up and down the line of bottles, muttering to herself and pointing at them. At last, she clapped her hands.  \"Got it,\" she said. \"The smallest bottle will get us through the black fire -- toward the Stone.\"  Harry looked at the tiny bottle.  \"There's only enough there for one of us,\" he said. \"That's hardly one swallow.\"  They looked at each other.  \"Which one will get you back through the purple flames?\"  Hermione pointed at a rounded bottle at the right end of the line.  \"You drink that,\" said Harry. \"No, listen, get back and get Ron. Grab brooms from the flying- key room, they'll get you out of the trapdoor and past Fluffy -- go straight to the owlery and send Hedwig to Dumbledore, we need him. I might be able to hold Snape off for a while, but I'm no match for him, really.\"  \"But Harry -- what if You-Know-Who's with him?\"  \"Well -- I was lucky once, wasn't I?\" said Harry, pointing at his scar. \"I might get lucky again.\"  Hermione's lip trembled, and she suddenly dashed at Harry and threw her arms around him.  \"Hermione!\"  \"Harry -- you're a great wizard, you know.\"  \"I'm not as good as you,\" said Harry, very embarrassed, as she let go of him.  \"Me!\" said Hermione. \"Books! And cleverness! There are more important things -- friendship and bravery and -- oh Harry -- be careful!\"  \"You drink first,\" said Harry. \"You are sure which is which, aren't you?\"  \"Positive,\" said Hermione. She took a long drink from the round bottle at the end, and shuddered.  \"It's not poison?\" said Harry anxiously.  \"No -- but it's like ice.\"  \"Quick, go, before it wears off.\"  \"Good luck -- take care.\"  \"GO!\"  Hermione turned and walked straight through the purple fire.  Harry took a deep breath and picked up the smallest bottle. He turned to face the black flames.  \"Here I come,\" he said, and he drained the little bottle in one gulp.  It was indeed as though ice was flooding his body. He put the bottle down and walked forward; he braced himself, saw the black flames licking his body, but couldn't feel them -- for a moment he could see nothing but dark fire -- then he was on the other side, in the last chamber.  There was already someone there -- but it wasn't Snape. It wasn't even Voldemort.   CHAPTER SEVENTEEN  THE MAN WITH TWO FACES  It was Quirrell.  \"You!\" gasped Harry.  Quirrell smiled. His face wasn't twitching at all.  \"Me,\" he said calmly. \"I wondered whether I'd be meeting you here, Potter.\"  \"But I thought -- Snape --\"  \"Severus?\" Quirrell laughed, and it wasn't his usual quivering treble, either, but cold and sharp. \"Yes, Severus does seem the type, doesn't he? So useful to have him swooping around like an overgrown bat. Next to him, who would suspect p-p-poor, st-stuttering P-Professor Quirrell?\"  Harry couldn't take it in. This couldn't be true, it couldn't.  \"But Snape tried to kill me!\"  \"No, no, no. I tried to kill you. Your friend Miss Granger accidentally knocked me over as she rushed to set fire to Snape at that Quidditch match. She broke my eye contact with you. Another few seconds and I'd have got you off that broom. I'd have managed it before then if Snape hadn't been muttering a countercurse, trying to save you.\"  \"Snape was trying to save me?\"  \"Of course,\" said Quirrell coolly. \"\\Why do you think he wanted to referee your next match? He was trying to make sure I didn't do it again. Funny, really... he needn't have bothered. I couldn't do anything with Dumbledore watching. All the other teachers thought Snape was trying to stop Gryffindor from winning, he did make himself unpopular... and what a waste of time, when after all that, I'm going to kill you tonight.\"  Quirrell snapped his fingers. Ropes sprang out of thin air and wrapped themselves tightly around Harry.  \"You're too nosy to live, Potter. Scurrying around the school on Halloween like that, for all I knew you'd seen me coming to look at what was guarding the Stone.\"  \"You let the troll in?\"  \"Certainly. I have a special gift with trolls -- you must have seen what I did to the one in the chamber back there? Unfortunately, while everyone else was running around looking for it, Snape, who already suspected me, went straight to the third floor to head me off -- and not only did my troll fail to beat you to death, that three-headed dog didn't even manage to bite Snape's leg off properly.  \"Now, wait quietly, Potter. I need to examine this interesting mirror.  It was only then that Harry realized what was standing behind Quirrell. It was the Mirror of Erised."
}