{
  "id": "ea78b9dfe66e059c9a8789f0f0bb28a362e7cf57",
  "text": "  The books and quills kept losing heart halfway across the room and dropping hike stones to the floor. \"Concentrate, Harry, concentrate. . . .\" \"What d'you think I'm trying to do?\"  said Harry angrily.  \"A great big dragon keeps popping up in my head for some reason...Okay, try again. . . .\" He wanted to skip Divination to keep practicing, but Hermione refused point-blank to skive off Arithmancy, and there was no point in staying without her.  He therefore had to endure over an hour of Professor Trelawney, who spent half the lesson telling everyone that the position of Mars with relation to Saturn at that moment meant that people born in July were in great danger of sudden, violent deaths. \"Well, that's good,\" said Harry loudly, his temper getting the better of him, \"just as long as it's not drawn-out.  I don't want to suffer.\" Ron looked for a moment as though he was going to laugh; he certainly caught Harry's eye for the first time in days, but Harry was still feeling too resentful toward Ron to care.  He spent the rest of the lesson trying to attract small objects toward him under the table with his wand.  He managed to make a fly zoom straight into his hand, though he wasn't entirely sure that was his prowess at Summoning Charms - perhaps the fly was just stupid. He forced down some dinner after Divination, then returned to the empty classroom with Hermione, using the Invisibility Cloak to avoid the teachers.  They kept practicing until past midnight.  They would have stayed longer, but Peeves turned up and, pretending to think that Harry wanted things thrown at him, started chucking chairs across the room.  Harry and Hermione left in a hurry before the noise attracted Filch, and went back to the Gryffindor common room, which was now mercifully empty. At two o'clock in the morning, Harry stood near the fireplace, surrounded by heaps of objects:  books, quills, several upturned chairs, an old set of Gobstones, and Neville's toad, Trevor.  Only in the last hour had Harry really got the hang of the Summoning Charm. \"That's better, Harry, that's loads better,\" Hermione said, looking exhausted but very pleased. \"Well, now we know what to do next time I can't manage a spell,\" Harry said, throwing a rune dictionary back to Hermione, so he could try again, \"threaten me with a dragon.  Right...\"  He raised his wand once more.  \"Accio Dictionary!\" The heavy book soared out of Hermione's hand, flew across the room, and Harry caught it. \"Harry, I really think you've got it!\" said Hermione delightedly. \"Just as long as it works tomorrow,\" Harry said. \"The Firebolt's going to be much farther away than the stuff in here, it's going to be in the castle, and I'm going to be out there on the grounds. . . .\" \"That doesn't matter,\" said Hermione firmly.\" Just as long as you're concentrating really, really hard on it, it'll come.  Harry, we'd better get some sleep.. . you're going to need it.\"  Harry had been focusing so hard on learning the Summoning Charm that evening that some of his blind panic had heft him.  It returned in full measure, however, on the following morning.  The atmosphere in the school was one of great tension and excitement.  Lessons were to stop at midday, giving all the students time to get down to the dragons' enclosure - though of course, they didn't yet know what they would find there. Harry felt oddly separate from everyone around him, whether they were wishing him good luck or hissing \"We'll have a box of tissues ready, Potter\" as he passed.  It was a state of nervousness so advanced that he wondered whether he mightn't just lose his head when they tried to lead him out to his dragon, and start trying to curse everyone in sight.  Time was behaving in a more peculiar fashion than ever, rushing past in great dollops, so that one moment he seemed to be sitting down in his first lesson, History of Magic, and the next, walking into lunch.. . and then (where had the morning gone?  the last of the dragon-free hours?), Professor McGonagall was hurrying over to him in the Great Hall.  Lots of people were watching. \"Potter, the champions have to come down onto the grounds now... . You have to get ready for your first task.\" \"Okay,\" said Harry, standing up, his fork falling onto his plate with a clatter. \"Good luck, Harry,\" Hermione whispered. \"You'll be fine!\" \"Yeah,\" said Harry in a voice that was most unlike his own. He heft the Great Hall with Professor McGonagall.  She didn't seem herself either; in fact, she looked nearly as anxious as Hermione.  As she walked him down the stone steps and out into the cold November afternoon, she put her hand on his shoulder. \"Now, don't panic,\" she said, \"just keep a cool head. . . . We've got wizards standing by to control the situation if it gets out of hand. . . . The main thing is just to do your best, and nobody will think any the worse of you. . . . Are you all right?\" \"Yes,\" Harry heard himself say. \"Yes, I'm fine.\" She was leading him toward the place where the dragons were, around the edge of the forest, but when they approached the clump of trees behind which the enclosure would be clearly visible, Harry saw that a tent had been erected, its entrance facing them, screening the dragons from view."
}