{
  "id": "ea7940839d329b09e9641557cbab409d990864c7",
  "text": "  Just  as  the  goblins  were  recovering  from  the  onslaught  and  the  elf-charge was halted,  there  rose  from across  the valley a deep- throated  roar. With  cries  of  \"Moria!\"  and  \"Dain,  Dain!\"  the  dwarves  of  the  Iron  Hills  plunged  in,  wielding  their  mattocks,  upon  the  other  side;  and  beside  them  came  the  men  of  the  Lake  with  long  swords.  Panic  came  upon  the Goblins;  and  even as they turned to meet this new attack, the elves charged again with renewed  numbers. Already many of  the goblins were  flying back down  the  river  to  escape  from the trap: and many of their own wolves were turning upon them and rending  the  dead  and  the  wounded.  Victory  seemed  at  hand,  when  a  cry  rang  out  on  the  heights above.  Goblins  had  scaled  the Mountain  from  the  other  side  and  already many were  on the slopes above the Gate, and others were streaming down recklessly, heedless  of  those  that  fell  screaming  from  cliff  and  precipice,  to  attack  the  spurs  from  above. Each of these could be reached by paths that ran down from the main mass  of  the Mountain  in  the  centre;  and  the  defenders  had  too  few  to  bar  the  way  for  long. Vi ctory now vanished from hope. They had only stemmed the first onslaught  of the black tide.  Day drew on. The goblins gathered again  in  the valley. There a host of Wargs  came  ravening  and  with  them  came  the  bodyguard  of  Bolg,  goblins  of  huge  size  with scimitars of steel. Soon actual darkness was coming into a stormy sky; while  still  the great bats  swirled  about  the heads  and  ears of  elves  and men, or  fastened  vampire-like  on  the  stricken.  Now  Bard  was  fighting  to  defend  the  Eastern  spur,  and yet giving slowly back; and the elf-lords were at bay about their king upon the  southern arm, near to the watch-post on Ravenhill.  Suddenly  there  was  a  great  shout,  and  from  the  Gate  came  a  trumpet  call.  They had forgotten Thorin! Part of  the wall, moved by  levers, fell outward with a  crash  into  the  pool. Out  leapt  the King  under  the Mountain,  and  his  companions  followed  him.  Hood  and  cloak  were  gone;  they  were  in  shining  armour,  and  red  light  leapt  from  their  eyes.  In  the  gloom  the  great  dwarf  gleamed  like  gold  in  a  dying fire.  Rocks were buried down from on high by the goblins above; but they held on.  leapt  down  to  the  falls'  foot,  and  rushed  forward  to  battle. Wolf  and  rider  fell  or  fled before them. Thorin wielded his axe with mighty strokes, and nothing seemed  to harm him.   ####-\"To  me!  To  me!  Elves  and  Men!  To  me!  O  my  kinsfolk!\"  he  cried,  and  his  voice shook like a horn in the valley.   Down, heedless of order, rushed all the dwarves of Dain to his help. Down too  came  many  of  the  Lake-men,  for Bard  could  not  restrain  them;  and out upon  the  other  side  came many  of  the  spearmen  of  the  elves. Once  again  the  goblins were  stricken in the valley; and they were piled in heaps till Dale was dark and hideous  with  their  corpses.  The  Wargs  were  scattered  and  Thorin  drove  right  against  the  bodyguards  of  Bolg.  But  he  could  not  pierce  their  ranks.  Already  behind  him  among the goblin dead lay many men and many dwarves, and many a fair elf that  should  have  lived  yet  long  ages  merrily  in  the  wood.  And  as  the  valley  widened  his onset grew ever slower. His numbers were too few. His flanks were unguarded.  Soon  the  attackers  were  attacked,  and  they  were  forced  into  a  great  ring,  facing  every  way,  hemmed  all  about  with  goblins  and  wolves  returning  to  the  assault.  The bodyguard of Bolg came howling against them, and drove in upon their ranks  like waves  upon  cliffs  of  sand.  Their  friends  could  not  help  them,  for  the  assault  from  the Mountain was  renewed with  redoubled  force,  and  upon  either  side men  and elves were being slowly beaten down.  On  all  this  Bilbo  looked  with  misery.  He  had  taken  his  stand  on  Ravenhill  among  the Elves-partly because  there was more chance of escape from  that point,  and partly (with the more Tookish part of his mind) because if he was going to be  in  a  last  desperate  stand,  he  preferred  on  the  whole  to  defend  the  Elvenking.  Gandalf,  too,  I  may  say,  was  there,  sitting  on  the  ground  as  if  in  deep  thought,  preparing,  I  suppose,  some  last  blast  of magic  before  the  end.  That  did  not  seem  far off. \"It will not be  long now,\"  thought Bilbo, \"before the goblins win the Gate,  and  we  are  all  slaughtered  or  driven  down  and  captured.  Really  it  is  enough  to  make  one  weep,  after  all  one  has  gone  through.  I  would  rather  old  Smaug  had  been left with all the wretched treasure, than that these vile creatures should get it,  and  poor  old Bombur,  and Balin  and  Fili  and Kili  and  all  the  rest  come  to  a  bad  end;  and  Bard  too,  and  the  Lake-men  and  the  merry  elves."
}