{
  "id": "eba2ef53b1fdb45e6d3eefe5a3ae647e47130b8a",
  "text": "  '\"Since  such  is  your  answer,\"  he  called  in  return,  \"I  declare  the  Mountain  besieged. You shall not depart from it, until you call on your side for a truce and a  parley. We will bear no weapons against you, but we leave you to your gold. You  may eat that, if you will!\"  With  that  the  messengers  departed  swiftly,  and  the  dwarves  were  left  to  consider  their  case. So grim had Thorin become, that even if they had wished, the  others  would  not  have  dared  to  find  fault  with  him;  but  indeed  most  of  them  seemed  to  share  his mind-except perhaps old fat Bombur and Fili and Kili. Bilbo,  of course, disapproved of  the whole  turn of affairs. He had by now had more than  enough of the Mountain, and being besieged inside it was not at all to his taste.  \"The whole place still stinks of dragon,\" he grumbled to himself, \"and it makes  me sick. And cram is beginning simply to stick in my throat.\"   ####-<h4>Chapter 16</h4> <br>   A Thief in the Night     Now the days passed slowly and wearily. Many of the dwarves spent their time  piling  and  ordering  the  treasure;  and  now  Thorin  spoke  of  the  Arkenstone  of  Thrain, and bade them eagerly to look for it in every comer.   \"For the Arkenstone of my father,\" he said, \"is worth more than a river of gold  in  itself,  and  to me  it  is  beyond  price.  That  stone  of  all  the  treasure  I  name  unto  myself, and I will be avenged on anyone who finds it and withholds it.\"  Bilbo heard these words and he grew afraid, wondering what would happen, if  the stone was found-wrapped in an old bundle of tattered oddments that he used as  a pillow. All the same he did not speak of it, for as the weariness of the days grew  heavier, the beginnings of a plan had come into his little head.  Things had gone on like this for some time, when the ravens brought news that  Dain and more than five hundred dwarves, hurrying from the Iron Hills, were now  within about two days' march of Dale, coming from the North-East.  \"But  they  cannot  reach  the  Mountain  unmarked,\"  said  Róac,  \"and  I  fear  lest  there  be  battle  in  the  valley.  I  do  not  call  this  counsel  good.  Though  they  are  a  grim  folk,  they  are  not  likely  to  overcome  the  host  that  besets  you;  and  even  if  they  did  so, what will  you gain? Winter and snow is hastening behind them. How  shall you be  fed without  the  friendship and goodwill of  the  lands about you? The  treasure is likely to be your death, though the dragon is no more!\"'  But  Thorin  was  not moved.  \"Winter  and  snow  will  bite both men and elves,\"  he said, \"and they may find their dwelling in the Waste grievous to bear. With my  friends behind  them and winter upon  them,  they will perhaps be  in softer mood  to  parley with.\"  That night Bilbo made up his mind. The sky was black and moonless. As soon  as  it  was  full  dark,  he  went  to  a  corner  of  an  inner  chamber  just  within  the  gate  and drew from his bundle a rope, and also the Arkenstone wrapped in a rag. Then  he  climbed  to  the  top  of  the  wall.  Only  Bombur  was  there,  for  it  was  his  turn to  watch, and the dwarves kept only one watchman at a time.  \"It is mighty cold!\" said Bombur. \"I wish we could have a fire up here as they  have in the camp!\"  \"It is warm enough inside,\" said Bilbo.   ####-\"I  daresay;  but  I  am  bound  here  till  midnight,\"  grumbled  the  fat  dwarf.  \"A  sorry  business  altogether.  Not  that  I  venture  to  disagree  with  Thorin,  may  his  beard grow ever longer; yet he was ever a dwarf with a stiff neck.\"  \"Not as stiff as my legs,\" said Bilbo. \"I am tired of stairs and stone passages. I  would give a good deal for the feel of grass at my toes.\"  \"I would give a good deal for the feel of a strong drink in my throat, and for a  soft bed after a good supper!\"  \"I  can't  give  you  those,  while  the  siege  is  going  on.  But  it  is  long  since  I  watched,  and  I  will  take  your  turn  for  you,  if  you  like.  There  is  no  sleep  in  me  tonight.\"    \"You  are  a  good  fellow,  Mr.  Baggins,  and  I  will  take  your  offer  kindly.  If  there  should  be  anything  to  note,  rouse me  first, mind  you!  I will  lie  in  the  inner  chamber to the left, not far away.\"  \"Off you go!\" said Bilbo. \"I will wake you at midnight, and you can wake the  next watchman.\" As soon as Bombur had gone, Bilbo put on his ring, fastened his  rope,  slipped  down  over  the wall,  and was  gone. He  had  about  five  hours  before  him.  Bombur  would  sleep  (he  could  sleep  at  any  time,  and  ever  since  the  adventure  in  the  forest he was  always  trying  to  recapture  the beautiful dreams he  had then); and all the others were busy with Thorin. It was unlikely that any, even  Fili  or  Kili,  would  come out on  the wall until  it was  their  turn.  It was very dark,  and  the  road  after  a  while,  when  he  left  the  newly made  path  and  climbed  down  towards the lower course of the stream, was strange to him."
}