{
  "id": "edfdb515a38d7d604a4bce496cb945fcc6b241af",
  "text": " So when his poor torn chest stopped moving, I gave him the good god’s own kiss to send him on his way. I filled my mouth with fire and breathed the flames inside him, down his throat to lungs and heart and soul. The last kiss it is called, and many a time I saw the old priests bestow it on the Lord’s servants as they died. I had given it a time or two myself, as all priests must. But never before had I felt a dead man shudder as the fire filled him, nor seen his eyes come open. It was not me who raised him, my lady. It was the Lord. R’hllor is not done with him yet. Life is warmth, and warmth is fire, and fire is God’s and God’s alone.   Arya felt tears well in her eyes. Thoros used a lot of words, but all they meant was no, that much she understood.   Your father was a good man,  Lord Beric said.  Harwin has told me much of him. For his sake, I would gladly forgo your ransom, but we need the gold too desperately.   She chewed her lip. That’s true, I guess. He had given the Hound’s gold to Greenbeard and the Huntsman to buy provisions south of the Mander, she knew.  The last harvest burned, this one is drowning, and winter will soon be on us,  she had heard him say when he sent them off.  The smallfolk need grain and seed, and we need blades and horses. Too many of my men ride rounseys, drays, and mules against foes mounted on coursers and destriers.   Arya didn’t know how much Robb would pay for her, though. He was a king now, not the boy she’d left at Winterfell with snow melting in his hair. And if he knew the things she’d done, the stableboy and the guard at Harrenhal and all…  What if my brother doesn’t want to ransom me?    Why would you think that?  asked Lord Beric.   Well,  Arya said,  my hair’s messy and my nails are dirty and my feet are all hard.  Robb wouldn’t care about that, probably, but her mother would. Lady Catelyn always wanted her to be like Sansa, to sing and dance and sew and mind her courtesies. Just thinking of it made Arya try to comb her hair with her fingers, but it was all tangles and mats, and all she did was tear some out.  I ruined that gown that Lady Smallwood gave me, and I don’t sew so good.  She chewed her lip.  I don’t sew very well, I mean. Septa Mordane used to say I had a blacksmith’s hands.   Gendry hooted.  Those soft little things?  he called out.  You couldn’t even hold a hammer.    I could if I wanted!  she snapped at him.  Thoros chuckled.  Your brother will pay, child. Have no fear on that count.    Yes, but what if he won’t?  she insisted.  Lord Beric sighed.  Then I will send you to Lady Smallwood for a time, or perhaps to mine own castle of Blackhaven. But that will not be necessary, I’m certain. I do not have the power to give you back your father, no more than Thoros does, but I can at least see that you are returned safely to your mother’s arms.    Do you swear?  she asked him. Yoren had promised to take her home too, only he’d gotten killed instead.   On my honor as a knight,  the lightning lord said solemnly.  It was raining when Lem returned to the brewhouse, muttering curses as water ran off his yellow cloak to puddle on the floor. Anguy and Jack-Be-Lucky sat by the door rolling dice, but no matter which game they played one-eyed Jack had no luck at all. Tom Sevenstrings replaced a string on his woodharp, and sang  The Mother’s Tears,   When Willum’s Wife Was Wet,   Lord Harte Rode Out on a Rainy Day,  and then  The Rains of Castamere.       And who are you, the proud lord said,  that I must bow so low?  Only a cat of a different coat,  that’s all the truth I know  In a coat of gold or a coat of red,  a lion still has claws,  And mine are long and sharp, my lord,  as long and sharp as yours.  And so he spoke, and so he spoke,  that lord of Castamere,  But now the rains weep o’er his hall,  with no one there to hear.  Yes now the rains weep o’er his hall,  and not a soul to hear.      Finally Tom ran out of rain songs and put away his harp. Then there was only the sound of the rain itself beating down on the slate roof of the brewhouse. The dice game ended, and Arya stood on one leg and then the other listening to Merrit complain about his horse throwing a shoe.   I could shoe him for you,  said Gendry, all of a sudden.  I was only a ’prentice, but my master said my hand was made to hold a hammer. I can shoe horses, close up rents in mail, and beat the dents from plate. I bet I could make swords too.    What are you saying, lad?  asked Harwin.   I’ll smith for you.  Gendry went to one knee before Lord Beric.  If you’ll have me, m’lord, I could be of use. I’ve made tools and knives and once I made a helmet that wasn’t so bad. One of the Mountain’s men stole it from me when we was taken.   Arya bit her lip. He means to leave me too.   You would do better serving Lord Tully at Riverrun,  said Lord Beric.  I cannot pay for your work.    No one ever did. I want a forge, and food to eat, some place I can sleep. That’s enough, m’lord.    A smith can find a welcome most anywhere."
}