{
  "id": "eec91050c22276d3f6856a01b1baf34968ef5d66",
  "text": "   Shall I call the guards?    Call them,  Jon said, defiant.  You can’t stop me from seeing him.  He crossed the room, keeping the bed between them, and looked down on Bran where he lay.  She was holding one of his hands. It looked like a claw. This was not the Bran he remembered. The flesh had all gone from him. His skin stretched tight over bones like sticks. Under the blanket, his legs bent in ways that made Jon sick. His eyes were sunken deep into black pits; open, but they saw nothing. The fall had shrunken him somehow. He looked half a leaf, as if the first strong wind would carry him off to his grave.  Yet under the frail cage of those shattered ribs, his chest rose and fell with each shallow breath.   Bran,  he said,  I’m sorry I didn’t come before. I was afraid.  He could feel the tears rolling down his cheeks. Jon no longer cared.  Don’t die, Bran. Please. We’re all waiting for you to wake up. Me and Robb and the girls, everyone…   Lady Stark was watching. She had not raised a cry. Jon took that for acceptance. Outside the window, the direwolf howled again. The wolf that Bran had not had time to name.   I have to go now,  Jon said.  Uncle Benjen is waiting. I’m to go north to the Wall. We have to leave today, before the snows come.  He remembered how excited Bran had been at the prospect of the journey. It was more than he could bear, the thought of leaving him behind like this. Jon brushed away his tears, leaned over, and kissed his brother lightly on the lips.   I wanted him to stay here with me,  Lady Stark said softly.  Jon watched her, wary. She was not even looking at him. She was talking to him, but for a part of her, it was as though he were not even in the room.   I prayed for it,  she said dully.  He was my special boy. I went to the sept and prayed seven times to the seven faces of god that Ned would change his mind and leave him here with me. Sometimes prayers are answered.   Jon did not know what to say.  It wasn’t your fault,  he managed after an awkward silence.  Her eyes found him. They were full of poison.  I need none of your absolution, bastard.   Jon lowered his eyes. She was cradling one of Bran’s hands. He took the other, squeezed it. Fingers like the bones of birds.  Good-bye,  he said.  He was at the door when she called out to him.  Jon,  she said. He should have kept going, but she had never called him by his name before. He turned to find her looking at his face, as if she were seeing it for the first time.   Yes?  he said.   It should have been you,  she told him. Then she turned back to Bran and began to weep, her whole body shaking with the sobs. Jon had never seen her cry before.  It was a long walk down to the yard.  Outside, everything was noise and confusion. Wagons were being loaded, men were shouting, horses were being harnessed and saddled and led from the stables. A light snow had begun to fall, and everyone was in an uproar to be off.  Robb was in the middle of it, shouting commands with the best of them. He seemed to have grown of late, as if Bran’s fall and his mother’s collapse had somehow made him stronger. Grey Wind was at his side.   Uncle Benjen is looking for you,  he told Jon.  He wanted to be gone an hour ago.    I know,  Jon said.  Soon.  He looked around at all the noise and confusion.  Leaving is harder than I thought.    For me too,  Robb said. He had snow in his hair, melting from the heat of his body.  Did you see him?   Jon nodded, not trusting himself to speak.   He’s not going to die,  Robb said.  I know it.    You Starks are hard to kill,  Jon agreed. His voice was flat and tired. The visit had taken all the strength from him.  Robb knew something was wrong.  My mother…    She was… very kind,  Jon told him.  Robb looked relieved.  Good.  He smiled.  The next time I see you, you’ll be all in black.   Jon forced himself to smile back.  It was always my color. How long do you think it will be?    Soon enough,  Robb promised. He pulled Jon to him and embraced him fiercely.  Farewell, Snow.   Jon hugged him back.  And you, Stark. Take care of Bran.    I will.  They broke apart and looked at each other awkwardly.  Uncle Benjen said to send you to the stables if I saw you,  Robb finally said.   I have one more farewell to make,  Jon told him.   Then I haven’t seen you,  Robb replied. Jon left him standing there in the snow, surrounded by wagons and wolves and horses. It was a short walk to the armory. He picked up his package and took the covered bridge across to the Keep.  Arya was in her room, packing a polished ironwood chest that was bigger than she was. Nymeria was helping. Arya would only have to point, and the wolf would bound across the room, snatch up some wisp of silk in her jaws, and fetch it back. But when she smelled Ghost, she sat down on her haunches and yelped at them.  Arya glanced behind her, saw Jon, and jumped to her feet. She threw her skinny arms tight around his neck.  I was afraid you were gone,  she said, her breath catching in her throat."
}