{
  "id": "ef347a9c9fa76b8017c5f2a3e9b946448fc8cf39",
  "text": "  This is our place. Craster keeps us safe. Better to die free than live a slave.    Slave,  muttered the raven.  Mormont leaned forward.  Every village we have passed has been abandoned. Yours are the first living faces we’ve seen since we left the Wall. The people are gone… whether dead, fled, or taken, I could not say. The animals as well. Nothing is left. And earlier, we found the bodies of two of Ben Stark’s rangers only a few leagues from the Wall. They were pale and cold, with black hands and black feet and wounds that did not bleed. Yet when we took them back to Castle Black they rose in the night and killed. One slew Ser Jaremy Rykker and the other came for me, which tells me that they remember some of what they knew when they lived, but there was no human mercy left in them.   The woman’s mouth hung open, a wet pink cave, but Craster only gave a snort.  We’ve had no such troubles here… and I’ll thank you not to tell such evil tales under my roof. I’m a godly man, and the gods keep me safe. If wights come walking, I’ll know how to send them back to their graves. Though I could use me a sharp new axe.  He sent his wife scurrying with a slap on her leg and a shout of  More beer, and be quick about it.    No trouble from the dead,  Jarmen Buckwell said,  but what of the living, my lord? What of your king?    King!  cried Mormont’s raven.  King, king, king.    That Mance Rayder?  Craster spit into the fire.  King-beyond-the-Wall. What do free folk want with kings?  He turned his squint on Mormont.  There’s much I could tell you o’ Rayder and his doings, if I had a mind. This o’ the empty villages, that’s his work. You would have found this hall abandoned as well, if I were a man to scrape to such. He sends a rider, tells me I must leave my own keep to come grovel at his feet. I sent the man back, but kept his tongue. It’s nailed to that wall there.  He pointed.  Might be that I could tell you where to seek Mance Rayder. If I had a mind.  The brown smile again.  But we’ll have time enough for that. You’ll be wanting to sleep beneath my roof, belike, and eat me out of pigs.    A roof would be most welcome, my lord,  Mormont said.  We’ve had hard riding, and too much wet.    Then you’ll guest here for a night. No longer, I’m not that fond o’ crows. The loft’s for me and mine, but you’ll have all the floor you like. I’ve meat and beer for twenty, no more. The rest o’ your black crows can peck after their own corn.    We’ve packed in our own supplies, my lord,  said the Old Bear.  We should be pleased to share our food and wine.   Craster wiped his drooping mouth with the back of a hairy hand.  I’ll taste your wine, Lord Crow, that I will. One more thing. Any man lays a hand on my wives, he loses the hand.    Your roof, your rule,  said Thoren Smallwood, and Lord Mormont nodded stiffly, though he looked none too pleased.   That’s settled, then.  Craster grudged them a grunt.  D’ya have a man can draw a map?    Sam Tarly can.  Jon pushed forward.  Sam loves maps.   Mormont beckoned him closer.  Send him here after he’s eaten. Have him bring quill and parchment. And find Tollett as well. Tell him to bring my axe. A guest gift for our host.    Who’s this one now?  Craster said before Jon could go.  He has the look of a Stark.    My steward and squire, Jon Snow.    A bastard, is it?  Craster looked Jon up and down.  Man wants to bed a woman, seems like he ought to take her to wife. That’s what I do.  He shooed Jon off with a wave.  Well, run and do your service, bastard, and see that axe is good and sharp now, I’ve no use for dull steel.   Jon Snow bowed stiffly and took his leave. Ser Ottyn Wythers was coming in as he was leaving, and they almost collided at the deerhide door. Outside, the rain seemed to have slackened. Tents had gone up all over the compound. Jon could see the tops of others under the trees.  Dolorous Edd was feeding the horses.  Give the wildling an axe, why not?  He pointed out Mormont’s weapon, a short-hafted battle-axe with gold scrollwork inlaid on the black steel blade.  He’ll give it back, I vow. Buried in the Old Bear’s skull, like as not. Why not give him all our axes, and our swords as well? I mislike the way they clank and rattle as we ride. We’d travel faster without them, straight to hell’s door. Does it rain in hell, I wonder? Perhaps Craster would like a nice hat instead.   Jon smiled.  He wants an axe. And wine as well.    See, the Old Bear’s clever. If we get the wildling well and truly drunk, perhaps he’ll only cut off an ear when he tries to slay us with that axe. I have two ears but only one head.    Smallwood says Craster is a friend to the Watch.    Do you know the difference between a wildling who’s a friend to the Watch and one who’s not?  asked the dour squire.  Our enemies leave our bodies for the crows and the wolves. Our friends bury us in secret graves. I wonder how long that bear’s been nailed up on that gate, and what Craster had there before we came hallooing?  Edd looked at the axe doubtfully, the rain running down his long face."
}