{
  "id": "f0d94aadc99976973d9ce5825ec3a79cee80f109",
  "text": " A red flower blossomed, and Jaime had an instant to savor the sight of her blood before his knee slammed into a rock. The pain was blinding. Brienne splashed into him and kicked away his sword.  YIELD!   Jaime drove his shoulder into her legs, bringing her down on top of him. They rolled, kicking and punching until finally she was sitting astride him. He managed to jerk her dagger from its sheath, but before he could plunge it into her belly she caught his wrist and slammed his hands back on a rock so hard he thought she’d wrenched an arm from its socket. Her other hand spread across his face.  Yield!  She shoved his head down, held it under, pulled it up.  Yield!  Jaime spit water into her face. A shove, a splash, and he was under again, kicking uselessly, fighting to breathe. Up again.  Yield, or I’ll drown you!    And break your oath?  he snarled.  Like me?   She let him go, and he went down with a splash.  And the woods rang with coarse laughter.  Brienne lurched to her feet. She was all mud and blood below the waist, her clothing askew, her face red. She looks as if they caught us fucking instead of fighting. Jaime crawled over the rocks to shallow water, wiping the blood from his eye with his chained hands. Armed men lined both sides of the brook. Small wonder, we were making enough noise to wake a dragon.  Well met, friends,  he called to them amiably.  My pardons if I disturbed you. You caught me chastising my wife.    Seemed to me she was doing the chastising.  The man who spoke was thick and powerful, and the nasal bar of his iron halfhelm did not wholly conceal his lack of a nose.  These were not the outlaws who had killed Ser Cleos, Jaime realized suddenly. The scum of the earth surrounded them: swarthy Dornishmen and blond Lyseni, Dothraki with bells in their braids, hairy Ibbenese, coal-black Summer Islanders in feathered cloaks. He knew them. The Brave Companions.  Brienne found her voice.  I have a hundred stags—   A cadaverous man in a tattered leather cloak said,  We’ll take that for a start, m’lady.    Then we’ll have your cunt,  said the noseless man.  It can’t be as ugly as the rest of you.    Turn her over and rape her arse, Rorge,  urged a Dornish spearman with a red silk scarf wound about his helm.  That way you won’t need to look at her.    And rob her o’ the pleasure o’ looking at me?  noseless said, and the others laughed.  Ugly and stubborn though she might be, the wench deserved better than to be gang raped by such refuse as these.  Who commands here?  Jaime demanded loudly.   I have that honor, Ser Jaime.  The cadaver’s eyes were rimmed in red, his hair thin and dry. Dark blue veins could be seen through the pallid skin of his hands and face.  Urswyck I am. Called Urswyck the Faithful.    You know who I am?   The sellsword inclined his head.  it takes more than a beard and a shaved head to deceive the Brave Companions.   The Bloody Mummers, you mean. Jaime had no more use for these than he did for Gregor Clegane or Amory Lorch. Dogs, his father called them all, and he used them like dogs, to hound his prey and put fear in their hearts.  If you know me, Urswyck, you know you’ll have your reward. A Lannister always pays his debts. As for the wench, she’s highborn, and worth a good ransom.   The other cocked his head.  Is it so? How fortunate.   There was something sly about the way Urswyck was smiling that Jaime did not like.  You heard me. Where’s the goat?    A few hours distant. He will be pleased to see you, I have no doubt, but I would not call him a goat to his face. Lord Vargo grows prickly about his dignity.   Since when has that slobbering savage had dignity?  I’ll be sure and remember that, when I see him. Lord of what, pray?    Harrenhal. It has been promised.   Harrenhal? Has my father taken leave of his senses? Jaime raised his hands.  I’ll have these chains off.   Urswyck’s chuckle was papery dry.  Something is very wrong here. Jaime gave no sign of his discomfiture, but only smiled.  Did I say something amusing?   Noseless grinned.  You’re the funniest thing I seen since Biter chewed that septa’s teats off.    You and your father lost too many battles,  offered the Dornishman.  We had to trade our lion pelts for wolfskins.   Urswyck spread his hands.  What Timeon means to say is that the Brave Companions are no longer in the hire of House Lannister. We now serve Lord Bolton, and the King in the North.   Jaime gave him a cold, contemptuous smile.  And men say I have shit for honor?   Urswyck was unhappy with that comment. At his signal, two of the Mummers grasped Jaime by the arms and Rorge drove a mailed fist into his stomach. As he doubled over grunting, he heard the wench protesting,  Stop, he’s not to be harmed! Lady Catelyn sent us, an exchange of captives, he’s under my protection…  Rorge hit him again, driving the air from his lungs. Brienne dove for her sword beneath the waters of the brook, but the Mummers were on her before she could lay hands on it. Strong as she was, it took four of them to beat her into submission."
}