{
  "id": "f46af2114c3ed24f2461174242e951725fef0319",
  "text": "  The students from Beauxbatons had chosen seats at the Ravenclaw table.  They were looking around the Great Hall with glum expressions on their faces.  Three of them were still clutching scarves and shawls around their heads. \"It's not that cold,\" said Hermione defensively.  \"Why didn't they bring cloaks?\" \"Over here! Come and sit over here!\"  Ron hissed.  \"Over here! Hermione, budge up, make a space -\" \"What?\" \"Too late,\" said Ron bitterly. Viktor Krum and his fellow Durmstrang students had settled themselves at the Slytherin table.  Harry could see Malfoy, Crabbe, and Goyle looking very smug about this.  As he watched, Malfoy bent forward to speak to Krum. \"Yeah, that's right, smarm up to him, Malfoy,\" said Ron scathingly.  \"I bet Krum can see right through him, though. . . bet he gets people fawning over him all the time.. . . Where d'you reckon they're going to sleep?  We could offer him a space in our dormitory, Harry. . . I wouldn't mind giving him my bed, I could kip on a camp bed.\"  Hermione snorted. \"They look a lot happier than the Beauxbatons lot,\" said Harry.  The Durmstrang students were pulling off their heavy furs and looking up at the starry black ceiling with expressions of interest; a couple of them were picking up the golden plates and goblets and examining them, apparently impressed. Up at the staff table, Filch, the caretaker, was adding chairs.  He was wearing his moldy old tailcoat in honor of the occasion.  Harry was surprised to see that he added four chairs, two on either side of Dumbledore's. \"But there are only two extra people,\" Harry said.  \"Why's Filch putting out four chairs, who else is coming?\" \"Eh?\"  said Ron vaguely.  He was still staring avidly at Krum. When all the students had entered the Hall and settled down at their House tables, the staff entered, filing up to the top table and taking their seats.  Last in line were Professor Dumbledore, Professor Karkaroff, and Madame Maxime.  When their headmistress appeared, the pupils from Beauxbatons leapt to their feet.  A few of the Hogwarts students laughed.  The Beauxbatons party appeared quite unembarrassed, however, and did not resume their seats until Madame Maxime had sat down on Dumbledore's left-hand side.  Dumbledore remained standing, and a silence fell over the Great Hall. \"Good evening, ladies and gentlemen, ghosts and - most particularly - guests,\" said Dumbledore, beaming around at the foreign students.  \"I have great pleasure in welcoming you all to Hogwarts.  I hope and trust that your stay here will be both comfortable and enjoyable.\" One of the Beauxbatons girls still clutching a muffler around her head gave what was unmistakably a derisive laugh. \"No one's making you stay!\"  Hermione whispered, bristling at her. \"The tournament will be officially opened at the end of the feast,\" said Dumbledore. \"I now invite you all to eat, drink, and make yourselves at home!\" He sat down, and Harry saw Karkaroff lean forward at once and engage him in conversation. The plates in front of them filled with food as usual.  The house-elves in the kitchen seemed to have pulled out all the stops; there was a greater variety of dishes in front of them than Harry had ever seen, including several that were definitely foreign. \"What's that?\" said Ron, pointing at a large dish of some sort of shellfish stew that stood beside a large steak-and-kidney pudding. \"Bouillabaisse,\" said Hermione. \"Bless you,\" said Ron. \"It's French,\" said Hermione, \"I had it on holiday summer before last. It's very nice.\" \"I'll take your word for it,\" said Ron, helping himself to black pudding. The Great Hall seemed somehow much more crowded than usual, even though there were barely twenty additional students there; perhaps it was because their differently colored uniforms stood out so clearly against the black of the Hogwarts' robes.  Now that they had removed their furs, the Durmstrang students were revealed to be wearing robes of a deep bloodred. Hagrid sidled into the Hall through a door behind the staff table twenty minutes after the start of the feast.  He slid into his seat at the end and waved at Harry, Ron, and Hermione with a very heavily bandaged hand. \"Skrewts doing all right, Hagrid?\" Harry called. \"Thrivin',\" Hagrid called back happily. \"Yeah, I'll just bet they are,\" said Ron quietly.  \"Looks like they've finally found a food they like, doesn't it?  Hagrid's fingers.\" At that moment, a voice said, \"Excuse me, are you wanting ze bouillabaisse?\" It was the girl from Beauxbatons who had laughed during Dumbledore's speech.  She had finally removed her muffler.  A long sheet of silvery-blonde hair fell almost to her waist.  She had large, deep blue eyes, and very white, even teeth. Ron went purple. He stared up at her, opened his mouth to reply, but nothing came out except a faint gurgling noise. \"Yeah, have it,\" said Harry, pushing the dish toward the girl. \"You 'ave finished wiz it?\" \"Yeah,\" Ron said breathlessly. \"Yeah, it was excellent.\" The girl picked up the dish and carried it carefully off to the Ravenclaw table."
}