{
  "id": "f5347eceb3dff0b42206950348fa5c52a54c734a",
  "text": " And now the stone was gone and she flew across the Dothraki sea, high and higher, the green rippling beneath, and all that lived and breathed fled in terror from the shadow of her wings. She could smell home, she could see it, there, just beyond that door, green fields and great stone houses and arms to keep her warm, there. She threw open the door.   …the dragon…   And saw her brother Rhaegar, mounted on a stallion as black as his armor. Fire glimmered red through the narrow eye slit of his helm.  The last dragon,  Ser Jorah’s voice whispered faintly.  The last, the last.  Dany lifted his polished black visor. The face within was her own.  After that, for a long time, there was only the pain, the fire within her, and the whisperings of stars.  She woke to the taste of ashes.   No,  she moaned,  no, please.    Khaleesi?  Jhiqui hovered over her, a frightened doe.  The tent was drenched in shadow, still and close. Flakes of ash drifted upward from a brazier, and Dany followed them with her eyes through the smoke hole above. Flying, she thought. I had wings, I was flying. But it was only a dream.  Help me,  she whispered, struggling to rise.  Bring me…  Her voice was raw as a wound, and she could not think what she wanted. Why did she hurt so much? It was as if her body had been torn to pieces and remade from the scraps.  I want…    Yes, Khaleesi.  Quick as that Jhiqui was gone, bolting from the tent, shouting. Dany needed… something… someone… what? It was important, she knew. It was the only thing in the world that mattered. She rolled onto her side and got an elbow under her, fighting the blanket tangled about her legs. It was so hard to move. The world swam dizzily. I have to…  They found her on the carpet, crawling toward her dragon eggs. Ser Jorah Mormont lifted her in his arms and carried her back to her sleeping silks, while she struggled feebly against him. Over his shoulder she saw her three handmaids, Jhogo with his little wisp of mustache, and the flat broad face of Mirri Maz Duur.  I must,  she tried to tell them,  I have to…    …sleep, Princess,  Ser Jorah said.   No,  Dany said.  Please. Please.    Yes.  He covered her with silk, though she was burning.  Sleep and grow strong again, Khaleesi. Come back to us.  And then Mirri Maz Duur was there, the maegi, tipping a cup against her lips. She tasted sour milk, and something else, something thick and bitter. Warm liquid ran down her chin. Somehow she swallowed. The tent grew dimmer, and sleep took her again. This time she did not dream. She floated, serene and at peace, on a black sea that knew no shore.  After a time—a night, a day, a year, she could not say—she woke again. The tent was dark, its silken walls flapping like wings when the wind gusted outside. This time Dany did not attempt to rise.  Irri,  she called,  Jhiqui. Doreah.  They were there at once.  My throat is dry,  she said,  so dry,  and they brought her water. It was warm and flat, yet Dany drank it eagerly, and sent Jhiqui for more. Irri dampened a soft cloth and stroked her brow.  I have been sick,  Dany said. The Dothraki girl nodded.  How long?  The cloth was soothing, but Irri seemed so sad, it frightened her.  Long,  she whispered. When Jhiqui returned with more water, Mirri Maz Duur came with her, eyes heavy from sleep.  Drink,  she said, lifting Dany’s head to the cup once more, but this time it was only wine. Sweet, sweet wine. Dany drank, and lay back, listening to the soft sound of her own breathing. She could feel the heaviness in her limbs, as sleep crept in to fill her up once more.  Bring me…  she murmured, her voice slurred and drowsy.  Bring… I want to hold…    Yes?  the maegi asked.  What is it you wish, Khaleesi?    Bring me… egg… dragon’s egg… please…  Her lashes turned to lead, and she was too weary to hold them up.  When she woke the third time, a shaft of golden sunlight was pouring through the smoke hole of the tent, and her arms were wrapped around a dragon’s egg. It was the pale one, its scales the color of butter cream, veined with whorls of gold and bronze, and Dany could feel the heat of it. Beneath her bedsilks, a fine sheen of perspiration covered her bare skin. Dragondew, she thought. Her fingers trailed lightly across the surface of the shell, tracing the wisps of gold, and deep in the stone she felt something twist and stretch in response. It did not frighten her. All her fear was gone, burned away.  Dany touched her brow. Under the film of sweat, her skin was cool to the touch, her fever gone. She made herself sit. There was a moment of dizziness, and the deep ache between her thighs. Yet she felt strong. Her maids came running at the sound of her voice.  Water,  she told them,  a flagon of water, cold as you can find it. And fruit, I think. Dates.    As you say, Khaleesi.    I want Ser Jorah,  she said, standing. Jhiqui brought a sandsilk robe and draped it over her shoulders.  And a warm bath, and Mirri Maz Duur, and…  Memory came back to her all at once, and she faltered."
}