{
  "id": "f9cf27ecf9121b49c800db0f8df5f8f50dfae818",
  "text": " Weasley's outstretched hand. \"We told you to destroy them!\" said Mrs. Weasley furiously, holding up what were unmistakably more Ton-Tongue Toffees. \"We told you to get rid of the lot! Empty your pockets, go on, both of you!\" It was an unpleasant scene; the twins had evidently been trying to smuggle as many toffees out of the house as possible, and it was only by using her Summoning Charm that Mrs. Weasley managed to find them all. \"Accio! Accio! Accio!\" she shouted, and toffees zoomed from all sorts of unlikely places, including the lining of George's jacket and the turn-ups of Fred's jeans. \"We spent six months developing those!\"  Fred shouted at his mother as she threw the toffees away. \"Oh a fine way to spend six months!\"  she shrieked.  \"No wonder you didn't get more O.W.L.s!\" All in all, the atmosphere was not very friendly as they took their departure.  Mrs. Weasley was still glowering as she kissed Mr. Weasley on the cheek, though not nearly as much as the twins, who had each hoisted their rucksacks onto their backs and walked out without a word to her. \"Well, have a lovely time,\" said Mrs. Weasley, \"and behave yourselves,\" she called after the twins' retreating backs, but they did not look back or answer.  \"I'll send Bill, Charlie, and Percy along around midday,\"  Mrs. Weasley said to Mr. Weasley, as he, Harry, Ron, Hermione, and Ginny set off across the dark yard after Fred and George. It was chilly and the moon was still out.  Only a dull, greenish tinge along the horizon to their right showed that daybreak was drawing closer.  Harry, having been thinking about thousands of wizards speeding toward the Quidditch World Cup, sped up to walk with Mr. Weasley. \"So how does everyone get there without all the Muggles noticing?\" he asked. \"It's been a massive organizational problem,\" sighed Mr. Weasley.  \"The trouble is, about a hundred thousand wizards turn up at the World Cup, and of course, we just haven't got a magical site big enough to accommodate them all.  There are places Muggles can't penetrate, but imagine trying to pack a hundred thousand wizards into Diagon Alley or platform nine and three-quarters.  So we had to find a nice deserted moor, and set up as many anti-Muggle precautions as possible.  The whole Ministry's been working on it for months.  First, of course, we have to stagger the arrivals.  People with cheaper tickets have to arrive two weeks beforehand.  A limited number use Muggle transport, but we can't have too many clogging up their buses and trains - remember, wizards are coming from all over the world.  Some Apparate, of course, but we have to set up safe points for them to appear, well away from Muggles.  I believe there's a handy wood they're using as the Apparition point.  For those who don't want to Apparate, or can't, we use Portkeys.  They're objects that are used to transport wizards from one spot to another at a prearranged time.  You can do large groups at a time if you need to.  There have been two hundred Portkeys placed at strategic points around Britain, and the nearest one to us is up at the top of Stoatshead Hill, so that's where we're headed.\" Mr. Weasley pointed ahead of them, where a large black mass rose beyond the village of Ottery St. Catchpole. \"What sort of objects are Portkeys?\" said Harry curiously. \"Well, they can be anything,\" said Mr. Weasley. \"Unobtrusive things, obviously, so Muggles don't go picking them up and playing with them ... stuff they'll just think is litter....\" They trudged down the dark, dank lane toward the village, the silence broken only by their footsteps.  The sky lightened very slowly as they made their way through the village, its inky blackness diluting to deepest blue.  Harry's hands and feet were freezing.  Mr. Weasley kept checking his watch. They didn't have breath to spare for talking as they began to climb Stoatshead Hill, stumbling occasionally in hidden rabbit holes, slipping on thick black tuffets of grass.  Each breath Harry took was sharp in his chest and his legs were starting to seize up when, at last, his feet found level ground. \"Whew,\" panted Mr. Weasley, taking off his glasses and wiping them on his sweater. \"Well, we've made good time - we've got ten minutes.\"  Hermione came over the crest of the hill last, clutching a stitch in her side. \"Now we just need the Portkey,\" said Mr. Weasley, replacing his glasses and squinting around at the ground.  \"It won't be big.... Come on...\" They spread out, searching.  They had only been at it for a couple of minutes, however, when a shout rent the still air. \"Over here, Arthur!  Over here, son, we've got it.\" Two tall figures were silhouetted against the starry sky on the other side of the hilltop. \"Amos!\"  said Mr. Weasley, smiling as he strode over to the man who had shouted.  The rest of them followed. Mr. Weasley was shaking hands with a ruddy-faced wizard with a scrubby brown beard, who was holding a moldy-looking old boot in his other hand. \"This is Amos Diggory, everyone,\" said Mr."
}