{
  "id": "fdf671e6a9598745a68771666ea720061f91def3",
  "text": "    The dragon speaks as he likes,  Viserys said… in the Common Tongue. He glanced over his shoulder at Aggo and Rakharo, riding behind them, and favored them with a mocking smile.  See, the savages lack the wit to understand the speech of civilized men.  A moss-eaten stone monolith loomed over the road, fifty feet tall. Viserys gazed at it with boredom in his eyes.  How long must we linger amidst these ruins before Drogo gives me my army? I grow tired of waiting.    The princess must be presented to the dosh khaleen…    The crones, yes,  her brother interrupted,  and there’s to be some mummer’s show of a prophecy for the whelp in her belly, you told me. What is that to me? I’m tired of eating horsemeat and I’m sick of the stink of these savages.  He sniffed at the wide, floppy sleeve of his tunic, where it was his custom to keep a sachet. It could not have helped much. The tunic was filthy. All the silk and heavy wools that Viserys had worn out of Pentos were stained by hard travel and rotted from sweat.  Ser Jorah Mormont said,  The Western Market will have food more to your taste, Your Grace. The traders from the Free Cities come there to sell their wares. The khal will honor his promise in his own time.    He had better,  Viserys said grimly.  I was promised a crown, and I mean to have it. The dragon is not mocked.  Spying an obscene likeness of a woman with six breasts and a ferret’s head, he rode off to inspect it more closely.  Dany was relieved, yet no less anxious.  I pray that my sun-and-stars will not keep him waiting too long,  she told Ser Jorah when her brother was out of earshot.  The knight looked after Viserys doubtfully.  Your brother should have bided his time in Pentos. There is no place for him in a khalasar. Illyrio tried to warn him.    He will go as soon as he has his ten thousand. My lord husband promised a golden crown.   Ser Jorah grunted.  Yes, Khaleesi, but… the Dothraki look on these things differently than we do in the west. I have told him as much, as Illyrio told him, but your brother does not listen. The horselords are no traders. Viserys thinks he sold you, and now he wants his price. Yet Khal Drogo would say he had you as a gift. He will give Viserys a gift in return, yes… in his own time. You do not demand a gift, not of a khal. You do not demand anything of a khal.    It is not right to make him wait.  Dany did not know why she was defending her brother, yet she was.  Viserys says he could sweep the Seven Kingdoms with ten thousand Dothraki screamers.   Ser Jorah snorted.  Viserys could not sweep a stable with ten thousand brooms.   Dany could not pretend to surprise at the disdain in his tone.  What… what if it were not Viserys?  she asked.  If it were someone else who led them? Someone stronger? Could the Dothraki truly conquer the Seven Kingdoms?   Ser Jorah’s face grew thoughtful as their horses trod together down the godsway.  When I first went into exile, I looked at the Dothraki and saw half-naked barbarians, as wild as their horses. If you had asked me then, Princess, I should have told you that a thousand good knights would have no trouble putting to flight a hundred times as many Dothraki.    But if I asked you now?    Now,  the knight said,  I am less certain. They are better riders than any knight, utterly fearless, and their bows outrange ours. In the Seven Kingdoms, most archers fight on foot, from behind a shieldwall or a barricade of sharpened stakes. The Dothraki fire from horseback, charging or retreating, it makes no matter, they are full as deadly… and there are so many of them, my lady. Your lord husband alone counts forty thousand mounted warriors in his khalasar.    Is that truly so many?    Your brother Rhaegar brought as many men to the Trident,  Ser Jorah admitted,  but of that number, no more than a tenth were knights. The rest were archers, freeriders, and foot soldiers armed with spears and pikes. When Rhaegar fell, many threw down their weapons and fled the field. How long do you imagine such a rabble would stand against the charge of forty thousand screamers howling for blood? How well would boiled leather jerkins and mailed shirts protect them when the arrows fall like rain?    Not long,  she said,  not well.   He nodded.  Mind you, Princess, if the lords of the Seven Kingdoms have the wit the gods gave a goose, it will never come to that. The riders have no taste for siegecraft. I doubt they could take even the weakest castle in the Seven Kingdoms, but if Robert Baratheon were fool enough to give them battle…    Is he?  Dany asked.  A fool, I mean?   Ser Jorah considered that for a moment.  Robert should have been born Dothraki,  he said at last.  Your khal would tell you that only a coward hides behind stone walls instead of facing his enemy with a blade in hand. The Usurper would agree. He is a strong man, brave… and rash enough to meet a Dothraki horde in the open field. But the men around him, well, their pipers play a different tune."
}