{
  "id": "00948a5cb662317feb909405adcad1750182ad9b",
  "text": "   Ser Aenys was unmoved.  Why should that trouble us?    Ransom him back to Riverrun,  urged Ser Danwell.   Casterly Rock has more gold,  one brother objected.   Kill him!  said another.  His head for Ned Stark’s!   Shagwell the Fool somersaulted to the foot of the steps in his grey and pink motley and began to sing.  There once was a lion who danced with a bear, oh my, oh my…    Thilenth, fool.  Vargo Hoat cuffed the man.  The Kingthlayer ith not for the bear. He ith mine.    He is no one’s should he die.  Roose Bolton spoke so softly that men quieted to hear him.  And pray recall, my lord, you are not master of Harrenhal till I march north.   Fever made Jaime as fearless as he was lightheaded.  Can this be the Lord of the Dreadfort? When last I heard, my father had sent you scampering off with your tail betwixt your legs. When did you stop running my lord?   Bolton’s silence was a hundred times more threatening than Vargo Hoat’s slobbering malevolence. Pale as morning mist, his eyes concealed more than they told. Jaime misliked those eyes. They reminded him of the day at King’s Landing when Ned Stark had found him seated on the Iron Throne. The Lord of the Dreadfort finally pursed his lips and said,  You have lost a hand.    No,  said Jaime,  I have it here, hanging round my neck.   Roose Bolton reached down, snapped the cord, and flung the hand at Hoat.  Take this away. The sight of it offends me.    I will thend it to hith lord father. I will tell him he muth pay one hundred thouthand dragonth, or we thall return the Kingthlayer to him pieth by pieth. And when we hath hith gold, we thall deliver Ther Jaime to Karthark, and collect a maiden too!  A roar of laughter went up from the Brave Companions.   A fine plan,  said Roose Bolton, the same way he might say,  A fine wine,  to a dinner companion,  though Lord Karstark will not be giving you his daughter. King Robb has shortened him by a head, for treason and murder. As to Lord Tywin, he remains at King’s Landing, and there he will stay till the new year, when his grandson takes for bride a daughter of Highgarden.    Winterfell,  said Brienne.  You mean Winterfell. King Joffrey is betrothed to Sansa Stark.    No longer. The Battle of the Blackwater changed all. The rose and the lion joined there, to shatter Stannis Baratheon’s host and burn his fleet to ashes.   I warned you, Urswyck, Jaime thought, and you, goat. When you bet against the lions, you lose more than your purse.  Is there word of my sister?  he asked.   She is well. As is your… nephew.  Bolton paused before he said nephew, a pause that said I know.  Your brother also lives, though he took a wound in the battle.  He beckoned to a dour northman in a studded brigantine.  Escort Ser Jaime to Qyburn. And unbind this woman’s hands.  As the rope between Brienne’s wrists was slashed in two, he said,  Pray forgive us, my lady. In such troubled times it is hard to know friend from foe.   Brienne rubbed inside her wrist where the hemp had scraped her skin bloody.  My lord, these men tried to rape me.    Did they?  Lord Bolton turned his pale eyes on Vargo Hoat.  I am displeased. By that, and this of Ser Jaime’s hand.   There were five northmen and as many Freys in the yard for every Brave Companion. The goat might not be as clever as some, but he could count that high at least. He held his tongue.   They took my sword,  Brienne said,  my armor…    You shall have no need of armor here, my lady,  Lord Bolton told her.  In Harrenhal, you are under my protection. Amabel, find suitable rooms for the Lady Brienne. Walton, you will see to Ser Jaime at once.  He did not wait for an answer, but turned and climbed the steps, his fur-trimmed cloak swirling behind. Jaime had only enough time to exchange a quick look with Brienne before they were marched away, separately.  In the maester’s chambers beneath the rookery, a grey-haired, fatherly man named Qyburn sucked in his breath when he cut away the linen from the stump of Jaime’s hand.   That bad? Will I die?   Qyburn pushed at the wound with a finger, and wrinkled his nose at the gush of pus.  No. Though in a few more days…  He sliced away Jaime’s sleeve.  The corruption has spread. See how tender the flesh is? I must cut it all away. The safest course would be to take the arm off.    Then you’ll die,  Jaime promised.  Clean the stump and sew it up. I’ll take my chances.   Qyburn frowned.  I can leave you the upper arm, make the cut at your elbow, but…    Take any part of my arm, and you’d best chop off the other one as well, or I’ll strangle you with it afterward.   Qyburn looked in his eyes. Whatever he saw there gave him pause.  Very well. I will cut away the rotten flesh, no more. Try to burn out the corruption with boiling wine and a poultice of nettle, mustard seed, and bread mold. Mayhaps that will suffice. It is on your head. You will want milk of the poppy—    No.  Jaime dare not let himself be put to sleep; he might be short an arm when he woke, no matter what the man said."
}