{
  "id": "00c7b9734f00dd64c75be77c444c1a84b9f98b10",
  "text": " Has he forgotten that Ned is gone? Is he still talking to Tansy, or is it me now, or Lysa, or Mother?  When he coughed, the sputum came up bloody. He clutched her fingers.  .. Be a good wife and the gods will bless you… sons… trueborn sons… aaahhh.  The sudden spasm of pain made Lord Hoster’s hand tighten. His nails dug into her hand, and he gave a muffled scream.  Maester Vyman came quickly, to mix another dose of milk of the poppy and help his lord swallow it down. Soon enough, Lord Hoster Tully had fallen back into a heavy sleep.   He was asking after a woman,  said Cat.  Tansy.    Tansy?  The maester looked at her blankly.   You know no one by that name? A serving girl, a woman from some nearby village? Perhaps someone from years past?  Catelyn had been gone from Riverrun for a very long time.   No, my lady. I can make inquiries, if you like. Utherydes Wayn would surely know if any such person ever served at Riverrun. Tansy, did you say? The smallfolk often name their daughters after flowers and herbs.  The maester looked thoughtful.  There was a widow, I recall, she used to come to the castle looking for old shoes in need of new soles. Her name was Tansy, now that I think on it. Or was it Pansy? Some such. But she has not come for many years…    Her name was Violet,  said Catelyn, who remembered the old woman very well.   Was it?  The maester looked apologetic.  My pardons, Lady Catelyn, but I may not stay. Ser Desmond has decreed that we are to speak to you only so far as our duties require.    Then you must do as he commands.  Catelyn could not blame Ser Desmond; she had given him small reason to trust her, and no doubt he feared that she might use the loyalty that many of the folk of Riverrun would still feel toward their lord’s daughter to work some further mischief. I am free of the war, at least, she told herself, if only for a little while.  After the maester had gone, she donned a woolen cloak and stepped out onto the balcony once more. Sunlight shimmered on the rivers, gilding the surface of the waters as they rolled past the castle. Catelyn shaded her eyes against the glare, searching for a distant sail, dreading the sight of one. But there was nothing, and nothing meant that her hopes were still alive.  All that day she watched, and well into the night, until her legs ached from the standing. A raven came to the castle in late afternoon, flapping down on great black wings to the rookery. Dark wings, dark words, she thought, remembering the last bird that had come and the horror it had brought.  Maester Vyman returned at evenfall to minister to Lord Tully and bring Catelyn a modest supper of bread, cheese, and boiled beef with horseradish.  I spoke to Utherydes Wayn, my lady. He is quite certain that no woman by the name of Tansy has ever been at Riverrun during his service.    There was a raven today, I saw. Has Jaime been taken again?  Or slain, gods forbid?   No, my lady, we’ve had no word of the Kingslayer.    Is it another battle, then? is Edmure in difficulty? Or Robb? Please, be kind, put my fears at rest.    My lady, I should not…  Vyman glanced about, as if to make certain no one else was in the room.  Lord Tywin has left the riverlands. All’s quiet on the fords.    Whence came the raven, then?    From the west,  he answered, busying himself with Lord Hoster’s bedclothes and avoiding her eyes.   Was it news of Robb?   He hesitated.  Yes, my lady.    Something is wrong.  She knew it from his manner. He was hiding something from her.  Tell me. Is it Robb? Is he hurt?  Not dead, gods be good, please do not tell me that he is dead.   His Grace took a wound storming the Crag,  Maester Vyman said, still evasive,  but writes that it is no cause for concern, and that he hopes to return soon.    A wound? What sort of wound? How serious?    No cause for concern, he writes.    All wounds concern me. Is he being cared for?    I am certain of it. The maester at the Crag will tend to him, I have no doubt.    Where was he wounded?    My lady, I am commanded not to speak with you. I am sorry.  Gathering up his potions, Vyman made a hurried exit, and once again Catelyn was left alone with her father. The milk of the poppy had done its work, and Lord Hoster was sunk in heavy sleep. A thin line of spittle ran down from one corner of his open mouth to dampen his pillow. Catelyn took a square of linen and wiped it away gently. When she touched him, Lord Hoster moaned.  Forgive me,  he said, so softly she could scarcely hear the words.  Tansy… blood… the blood… gods be kind…   His words disturbed her more than she could say, though she could make no sense of them. Blood, she thought. Must it all come back to blood? Father, who was this woman, and what did you do to her that needs so much forgiveness?  That night Catelyn slept fitfully, haunted by formless dreams of her children, the lost and the dead. Well before the break of day, she woke with her father’s words echoing in her ears. Sweet babes, and trueborn… why would he say that, unless… could he have fathered a bastard on this woman Tansy? She could not believe it."
}