{
  "id": "01079ce7152fa2c1476d23ed1db0e12b7860f14c",
  "text": "   Winter comes for all of us, Catelyn thought. For me, it came when Ned died. It will come for you too, child, and sooner than you like. She did not have the heart to say it.  The king saved her.  Lady Catelyn,  Renly called down.  I feel the need of some air. Will you walk with me?   Catelyn stood at once.  I should be honored.   Brienne was on her feet as well.  Your Grace, give me but a moment to don my mail. You should not be without protection.   King Renly smiled.  If I am not safe in the heart of Lord Caswell’s castle, with my own host around me, one sword will make no matter… not even your sword, Brienne. Sit and eat. If I have need of you, I’ll send for you.   His words seemed to strike the girl harder than any blow she had taken that afternoon.  As you will, Your Grace.  Brienne sat, eyes downcast. Renly took Catelyn’s arm and led her from the hall, past a slouching guardsman who straightened so hurriedly that he near dropped his spear. Renly clapped the man on the shoulder and made a jest of it.   This way, my lady.  The king took her through a low door into a stair tower. As they started up, he said,  Perchance, is Ser Barristan Selmy with your son at Riverrun?    No,  she answered, puzzled.  Is he no longer with Joffrey? He was the Lord Commander of the Kingsguard.   Renly shook his head.  The Lannisters told him he was too old and gave his cloak to the Hound. I’m told he left King’s Landing vowing to take up service with the true king. That cloak Brienne claimed today was the one I was keeping for Selmy, in hopes that he might offer me his sword. When he did not turn up at Highgarden, I thought perhaps he had gone to Riverrun instead.    We have not seen him.    He was old, yes, but a good man still. I hope he has not come to harm. The Lannisters are great fools.  They climbed a few more steps.  On the night of Robert’s death, I offered your husband a hundred swords and urged him to take Joffrey into his power. Had he listened, he would be regent today, and there would have been no need for me to claim the throne.    Ned refused you.  She did not have to be told.   He had sworn to protect Robert’s children,  Renly said.  I lacked the strength to act alone, so when Lord Eddard turned me away, I had no choice but to flee. Had I stayed, I knew the queen would see to it that I did not long outlive my brother.   Had you stayed, and lent your support to Ned, he might still be alive, Catelyn thought bitterly.   I liked your husband well enough, my lady. He was a loyal friend to Robert, I know… but he would not listen and he would not bend. Here, I wish to show you something.  They had reached the top of the stairwell. Renly pushed open a wooden door, and they stepped out onto the roof.  Lord Caswell’s keep was scarcely tall enough to call a tower, but the country was low and flat and Catelyn could see for leagues in all directions. Wherever she looked, she saw fires. They covered the earth like fallen stars, and like the stars there was no end to them.  Count them if you like, my lady,  Renly said quietly.  You will still be counting when dawn breaks in the east. How many fires burn around Riverrun tonight, I wonder?   Catelyn could hear faint music drifting from the Great Hall, seeping out into the night. She dare not count the stars.   I’m told your son crossed the Neck with twenty thousand swords at his back,  Renly went on.  Now that the lords of the Trident are with him, perhaps he commands forty thousand.   No, she thought, not near so many, we have lost men in battle, and others to the harvest.   I have twice that number here,  Renly said,  and this is only part of my strength. Mace Tyrell remains at Highgarden with another ten thousand, I have a strong garrison holding Storm’s End, and soon enough the Dornishmen will join me with all their power. And never forget my brother Stannis, who holds Dragonstone and commands the lords of the narrow sea.    It would seem that you are the one who has forgotten Stannis,  Catelyn said, more sharply than she’d intended.   His claim, you mean?  Renly laughed.  Let us be blunt, my lady. Stannis would make an appalling king. Nor is he like to become one. Men respect Stannis, even fear him, but precious few have ever loved him.    He is still your elder brother. If either of you can be said to have a right to the Iron Throne, it must be Lord Stannis.   Renly shrugged.  Tell me, what right did my brother Robert ever have to the Iron Throne?  He did not wait for an answer.  Oh, there was talk of the blood ties between Baratheon and Targaryen, of weddings a hundred years past, of second sons and elder daughters. No one but the maesters care about any of it. Robert won the throne with his warhammer.  He swept a hand across the campfires that burned from horizon to horizon.  Well, there is my claim, as good as Robert’s ever was. If your son supports me as his father supported Robert, he’ll not find me ungenerous. I will gladly confirm him in all his lands, titles, and honors."
}