{
  "id": "069846865ee6383783879348f026d69b4b2fc27a",
  "text": " Sir Cadogan was the only one brave enough to volunteer.\"  Sir Cadogan, however, was the least of Harry's worries. He was now being closely watched. Teachers found excuses to walk along corridors with him, and Percy Weasley (acting, Harry suspected, on his mother's orders) was tailing him everywhere like an extremely pompous guard dog. To cap it all, Professor McGonagall summoned Harry into her office, with such a somber expression on her face Harry thought someone must have died.  \"There's no point hiding it from you any longer, Potter,\" she said in a very serious voice. \"I know this will come as a shock to you, but Sirius Black --\"  \"I know he's after me,\" said Harry wearily. \"I heard Ron's dad telling his mum. Mr. Weasley works for the Ministry of Magic.\"  Professor McGonagall seemed very taken aback. She stared at Harry for a moment or two, then said, \"I see! Well, in that case, Potter, you'll understand why I don't think it's a good idea for you to be practicing Quidditch in the evenings. Out on the field with only Your team members, it's very exposed, Potter --\"  \"We've got our first match on Saturday!\" said Harry, outraged. \"I've got to train, Professor!\"  Professor McGonagall considered him intently. Harry knew she was deeply interested in the Gryffindor team's prospects; it had been she, after all, who'd suggested him as Seeker in the first Place. He waited, holding his breath.  \"Hmm...\" Professor McGonagall stood up and stared out of the window at the Quidditch field, just visible through the rain. \"Well... goodness knows, I'd like to see us win the Cup at last... but all the same, Potter... I'd be happier if a teacher were present. I'll ask Madam Hooch to oversee your training sessions.\"  The weather worsened steadily as the first Quidditch match drew nearer. Undaunted, the Gryffindor team was training harder than ever under the eye of Madam Hooch. Then, at their final training session before Saturday's match, Oliver Wood gave his team some unwelcome news.  \"We're not playing Slytherin!\" he told them, looking very angry. \"Flint's just been to see me. We're playing Hufflepuff instead.\"  \"Why?\" chorused the rest of the team.  \"Flint's excuse is that their Seeker's arm's still injured,\" said Wood, grinding his teeth furiously. \"But it's obvious why they're doing it. Don't want to play in this weather. Think it'll damage their chances....\"  There had been strong winds and heavy rain all day, and as Wood spoke, they heard a distant rumble of thunder.  \"There's nothing wrong with Malfoy's arm!\" said Harry furiously. \"He's faking it!\"  \"I know that, but we can't prove it,\" said Wood bitterly, \"And we've been practicing all those moves assuming we're playing Slytherin, and instead it's Hufflepuff, and their style's quite different. They've got a new Captain and Seeker, Cedric Diggory --\"  Angelina, Alicia, and Katie suddenly giggled.  \"What?\" said Wood, frowning at this lighthearted behavior.  \"He's that tall, good-looking one, isn't he?\" said Angelina.  \"Strong and silent,\" said Katie, and they started to giggle again.  \"He's only silent because he's too thick to string two words together,\" said Fred impatiently. \"I don't know why you're worried, Oliver, Hufflepuff is a pushover. Last time we played them, Harry caught the Snitch in about five minutes, remember?\"  \"We were playing in completely different conditions!\" Wood shouted, his eyes bulging slightly. \"Diggory's put a very strong side together! He's an excellent Seeker! I was afraid you'd take it like this! We mustn't relax! We must keep our focus! Slytherin is trying to wrong-foot us! We must win!\"  \"Oliver, calm down!\" said Fred, looking slightly alarmed. \"We're taking Hufflepuff very seriously. Seriously.\"  The day before the match, the winds reached howling point and the rain fell harder than ever. It was so dark inside the corridors and classrooms that extra torches and lanterns were lit. The Slytherin team was looking very smug indeed, and none more so than Malfoy.  \"Ah, if only my arm was feeling a bit better!\" he sighed as the gale outside pounded the windows.  Harry had no room in his head to worry about anything except the match tomorrow. Oliver Wood kept hurrying up to him between classes and giving him tips. The third time this happened, Wood talked for so long that Harry suddenly realized he was ten minutes late for Defense Against the Dark Arts, and set off at a run with Wood shouting after him, \"Diggory's got a very fast swerve, Harry, so you might want to try looping him --\"  Harry skidded to a halt outside the Defense Against the Dark Arts classroom, pulled the door open, and dashed inside.  \"Sorry I'm late, Professor Lupin. I --\"  But it wasn't Professor Lupin who looked up at him from the teacher's desk; it was Snape.  \"This lesson began ten minutes ago, Potter, so I think we'll make it ten points from Gryffindor. Sit down.\"  But Harry didn't move.  \"Where's Professor Lupin?\" he said.  \"He says he is feeling too ill to teach today,\" said Snape with a twisted smile."
}