{
  "id": "081e00250213c6e2d1227e66e2783742ed2e3c28",
  "text": " Finally Joss reaches up under her skirt, and she shrieks and drops her flagon and goes running off to the kitchen. Well, it would have ended right there, only what does the old fool do but he goes to Ser and asks him to make us leave the girl alone, him being an anointed knight and all such.   Ser Gregor, he wasn’t paying no mind to none of our fun, but now he looks, you know how he does, and he commands that the girl be brought before him. Now the old man has to drag her out of the kitchen, and no one to blame but hisself. Ser looks her over and says, ‘So this is the whore you’re so concerned for’ and this besotted old fool says, ‘My Layna’s no whore, ser’ right to Gregor’s face. Ser, he never blinks, just says, ‘She is now’ tosses the old man another silver, rips the dress off the wench, and takes her right there on the table in front of her da, her flopping and wiggling like a rabbit and making these noises. The look on the old man’s face, I laughed so hard ale was coming out me nose. Then this boy hears the noise, the son I figure, and comes rushing up from the cellar, so Raff has to stick a dirk in his belly. By then Ser’s done, so he goes back to his drinking and we all have a turn. Tobbot, you know how he is, he flops her over and goes in the back way. The girl was done fighting by the time I had her, maybe she’d decided she liked it after all, though to tell the truth I wouldn’t have minded a little wiggling. And now here’s the best bit… when it’s all done, Ser tells the old man that he wants his change. The girl wasn’t worth a silver, he says… and damned if that old man didn’t fetch a fistful of coppers, beg m’lord’s pardon, and thank him for the custom!   The men all roared, none louder than Chiswyck himself, who laughed so hard at his own story that snot dribbled from his nose down into his scraggy grey beard. Arya stood in the shadows of the stairwell and watched him. She crept back down to the cellars without saying a word. When Weese found that she hadn’t asked about the clothes, he yanked down her breeches and caned her until blood ran down her thighs, but Arya closed her eyes and thought of all the sayings Syrio had taught her, so she scarcely felt it.  Two nights later, he sent her to the Barracks Hall to serve at table. She was carrying a flagon of wine and pouring when she glimpsed Jaqen H’ghar at his trencher across the aisle. Chewing her lip, Arya glanced around warily to make certain Weese was not in sight. Fear cuts deeper than swords, she told herself.  She took a step, and another, and with each she felt less a mouse. She worked her way down the bench, filling wine cups. Rorge sat to Jaqen’s right, deep drunk, but he took no note of her. Arya leaned close and whispered,  Chiswyck,  right in Jaqen’s ear. The Lorathi gave no sign that he had heard.  When her flagon was empty, Arya hurried down to the cellars to refill it from the cask, and quickly returned to her pouring. No one had died of thirst while she was gone, nor even noted her brief absence.  Nothing happened the next day, nor the day after, but on the third day Arya went to the kitchens with Weese to fetch their dinner.  One of the Mountain’s men fell off a wallwalk last night and broke his fool neck,  she heard Weese tell a cook.   Drunk?  the woman asked.   No more’n usual. Some are saying it was Harren’s ghost flung him down.  He snorted to show what he thought of such notions.  It wasn’t Harren, Arya wanted to say, it was me. She had killed Chiswyck with a whisper, and she would kill two more before she was through. I’m the ghost in Harrenhal, she thought. And that night, there was one less name to hate.      CATELYN  The meeting place was a grassy sward dotted with pale grey mushrooms and the raw stumps of felled trees.   We are the first, my lady,  Hallis Mollen said as they reined up amidst the stumps, alone between the armies. The direwolf banner of House Stark flapped and fluttered atop the lance he bore. Catelyn could not see the sea from here, but she could feel how close it was. The smell of salt was heavy on the wind gusting from the east.  Stannis Baratheon’s foragers had cut the trees down for his siege towers and catapults. Catelyn wondered how long the grove had stood, and whether Ned had rested here when he led his host south to lift the last siege of Storm’s End. He had won a great victory that day, all the greater for being bloodless.  Gods grant that I shall do the same, Catelyn prayed. Her own liege men thought she was mad even to come.  This is no fight of ours, my lady,  Ser Wendel Manderly had said.  I know the king would not wish his mother to put herself at risk.    We are all at risk,  she told him, perhaps too sharply.  Do you think I wish to be here, ser?  I belong at Riverrun with my dying father, at Winterfell with my sons.  Robb sent me south to speak for him, and speak for him I shall.  It would be no easy thing to forge a peace between these brothers, Catelyn knew, yet for the good of the realm, it must be tried."
}