{
  "id": "0d79ec6127251721ad276257ec2df3d4ea63459f",
  "text": "   Theon came. He said Winterfell was his now.   The maester set down the candle and wiped the blood off his cheek.  They swam the moat. Climbed the walls with hook and rope. Came over wet and dripping, steel in hand.  He sat on the chair by the door, as fresh blood flowed.  Alebelly was on the gate, they surprised him in the turret and killed him. Hayhead’s wounded as well. I had time to send off two ravens before they burst in. The bird to White Harbor got away, but they brought down the other with an arrow.  The maester stared at the rushes.  Ser Rodrik took too many of our men, but I am to blame as much as he is. I never saw this danger, I never…   Jojen saw it, Bran thought.  You better help me dress.    Yes, that’s so.  In the heavy ironbound chest at the foot of Bran’s bed the maester found smallclothes, breeches, and tunic.  You are the Stark in Winterfell, and Robb’s heir. You must look princely.  Together they garbed him as befit a lord.   Theon wants me to yield the castle,  Bran said as the maester was fastening the cloak with his favorite wolf’s-head clasp of silver and jet.   There is no shame in that. A lord must protect his smallfolk. Cruel places breed cruel peoples, Bran, remember that as you deal with these ironmen. Your lord father did what he could to gentle Theon, but I fear it was too little and too late.   The ironman who came for them was a squat thick-bodied man with a coal-black beard that covered half his chest. He bore the boy easily enough, though he looked none too happy with the task. Rickon’s bedchamber was a half turn down the steps. The four-year-old was cranky at being woken.  I want Mother,  he said.  I want her. And Shaggydog too.    Your mother is far away, my prince.  Maester Luwin pulled a bedrobe over the child’s head.  But I’m here, and Bran.  He took Rickon by the hand and led him out.  Below, they came on Meera and Jojen being herded from their room by a bald man whose spear was three feet taller than he was. When Jojen looked at Bran, his eyes were green pools full of sorrow. Other ironmen had rousted the Freys.  Your brother’s lost his kingdom,  Little Walder told Bran.  You’re no prince now, just a hostage.    So are you,  Jojen said,  and me, and all of us.    No one was talking to you, frogeater.   One of the ironmen went before them carrying a torch, but the rain had started again and soon drowned it out. As they hurried across the yard they could hear the direwolves howling in the godswood. I hope Summer wasn’t hurt falling from the tree.  Theon Greyjoy was seated in the high seat of the Starks. He had taken off his cloak. Over a shirt of fine mail he wore a black surcoat emblazoned with the golden kraken of his House. His hands rested on the wolves’ heads carved at the ends of the wide stone arms.  Theon’s sitting in Robb’s chair,  Rickon said.   Hush, Rickon.  Bran could feel the menace around them, but his brother was too young. A few torches had been lit, and a fire kindled in the great hearth, but most of the hall remained in darkness. There was no place to sit with the benches stacked against the walls, so the castle folk stood in small groups, not daring to speak. He saw Old Nan, her toothless mouth opening and closing. Hayhead was carried in between two of the other guards, a bloodstained bandage wrapped about his bare chest. Poxy Tym wept inconsolably, and Beth Cassel cried with fear.   What have we here?  Theon asked of the Reeds and Freys.   These are Lady Catelyn’s wards, both named Walder Frey,  Maester Luwin explained.  And this is Jojen Reed and his sister Meera, son and daughter to Howland Reed of Greywater Watch, who came to renew their oaths of fealty to Winterfell.    Some might call that ill-timed,  said Theon,  though not for me. Here you are and here you’ll stay.  He vacated the high seat.  Bring the prince here, Lorren.  The black-bearded man dumped Bran onto the stone as if he were a sack of oats.  People were still being driven into the Great Hall, prodded along with shouts and the butts of the spears. Gage and Osha arrived from the kitchens, spotted with flour from making the morning bread. Mikken they dragged in cursing. Farlen entered limping, struggling to support Palla. Her dress had been ripped in two; she held it up with a clenched fist and walked as if every step were agony. Septon Chayle rushed to lend a hand, but one of the ironmen knocked him to the floor.  The last man marched through the doors was the prisoner Reek, whose stench preceded him, ripe and pungent. Bran felt his stomach twist at the smell of him.  We found this one locked in a tower cell,  announced his escort, a beardless youth with ginger-colored hair and sodden clothing, doubtless one of those who’d swum the moat.  He says they call him Reek.    Can’t think why,  Theon said, smiling.  Do you always smell so bad, or did you just finish fucking a pig?    Haven’t fucked no one since they took me, m’lord. Heke’s me true name. I was in service to the Bastard o’ the Dreadfort till the Starks give him an arrow in the back for a wedding gift."
}