{
  "id": "0e802134f3a613e5d2a9a937c5dd82658d01bfff",
  "text": " Sometimes she would sing to him. I loved a maid as fair as summer, with sunlight in her hair.  I love you, Tyrion,  she would whisper before they went to sleep at night.  I love your lips. I love your voice, and the words you say to me, and how you treat me gentle. I love your face.    My face?    Yes. Yes. I love your hands, and how you touch me. Your cock, I love your cock, I love how it feels when it’s in me.    It loves you too, my lady.    I love to say your name. Tyrion Lannister. It goes with mine. Not the Lannister, t’other part. Tyrion and Tysha. Tysha and Tyrion. Tyrion. My lord Tyrion…   Lies, he thought, all feigned, all for gold, she was a whore, Jaime’s whore, Jaime’s gift, my lady of the lie. Her face seemed to fade away, dissolving behind a veil of tears, but even after she was gone he could still hear the faint, far-off sound of her voice, calling his name.  …my lord, can you hear me? My lord? Tyrion? My lord? My lord?   Through a haze of poppied sleep, he saw a soft pink face leaning over him. He was back in the dank room with the torn bed hangings, and the face was wrong, not hers, too round, with a brown fringe of beard.  Do you thirst, my lord? I have your milk, your good milk. You must not fight, no, don’t try to move, you need your rest.  He had the copper funnel in one damp pink hand and a flask in the other.  As the man leaned close, Tyrion’s fingers slid underneath his chain of many metals, grabbed, pulled. The maester dropped the flask, spilling milk of the poppy all over the blanket. Tyrion twisted until he could feel the links digging into the flesh of the man’s fat neck.  No. More,  he croaked, so hoarse he was not certain he had even spoken. But he must have, for the maester choked out a reply.  Unhand, please, my lord… need your milk, the pain… the chain, don’t, unhand, no…   The pink face was beginning to purple when Tyrion let go. The maester reeled back, sucking in air. His reddened throat showed deep white gouges where the links had pressed. His eyes were white too. Tyrion raised a hand to his face and made a ripping motion over the hardened mask. And again. And again.   You… you want the bandages off, is that it?  the maester said at last.  But I’m not to… that would be… be most unwise, my lord. You are not yet healed, the queen would…   The mention of his sister made Tyrion growl. Are you one of hers, then? He pointed a finger at the maester, then coiled his hand into a fist. Crushing, choking, a promise, unless the fool did as he was bid.  Thankfully, he understood.  I… I will do as my lord commands, to be sure, but… this is unwise, your wounds…    Do. It.  Louder that time.  Bowing, the man left the room, only to return a few moments later, bearing a long knife with a slender sawtooth blade, a basin of water, a pile of soft cloths, and several flasks. By then Tyrion had managed to squirm backward a few inches, so he was half sitting against his pillow. The maester bade him be very still as he slid the tip of the knife in under his chin, beneath the mask. A slip of the hand here, and Cersei will be free of me, he thought. He could feel the blade sawing through the stiffened linen, only inches above his throat.  Fortunately this soft pink man was not one of his sister’s braver creatures. After a moment he felt cool air on his cheeks. There was pain as well, but he did his best to ignore that. The maester discarded the bandages, still crusty with potion.  Be still now, I must wash out the wound.  His touch was gentle, the water warm and soothing. The wound, Tyrion thought, remembering a sudden flash of bright silver that seemed to pass just below his eyes.  This is like to sting some,  the maester warned as he wet a cloth with wine that smelled of crushed herbs. It did more than sting. It traced a line of fire all the way across Tyrion’s face, and twisted a burning poker up his nose. His fingers clawed the bedclothes and he sucked in his breath, but somehow he managed not to scream. The maester was clucking like an old hen.  It would have been wiser to leave the mask in place until the flesh had knit, my lord. Still, it looks clean, good, good. When we found you down in that cellar among the dead and dying, your wounds were filthy. One of your ribs was broken, doubtless you can feel it, the blow of some mace perhaps, or a fall, it’s hard to say. And you took an arrow in the arm, there where it joins the shoulder. It showed signs of mortification, and for a time I feared you might lose the limb, but we treated it with boiling wine and maggots, and now it seems to be healing clean…    Name,  Tyrion breathed up at him.  Name.   The maester blinked.  Why, you are Tyrion Lannister, my lord. Brother to the queen. Do you remember the battle? Sometimes with head wounds—    Your name.  His throat was raw, and his tongue had forgotten how to shape the words.   I am Maester Ballabar.    Ballabar,  Tyrion repeated.  Bring me. Looking glass.    My lord,  the maester said,  I would not counsel… that might be, ah, unwise, as it were… your wound…    Bring it,  he had to say."
}