{
  "id": "10fec258747753f5e1c5f391532f2b7984947347",
  "text": " It was night outside.  His legs were aching by the time Ser Axell thrust open a heavy door and gestured him through. Beyond, a high stone bridge arched over emptiness to the massive central tower called the Stone Drum. A sea wind blew restlessly through the arches that supported the roof, and Davos could smell the salt water as they crossed. He took a deep breath, filling his lungs with the clean cold air. Wind and water, give me strength, he prayed. A huge nightfire burned in the yard below, to keep the terrors of the dark at bay, and the queen’s men were gathered around it, singing praises to their new red god.  They were in the center of the bridge when Ser Axell stopped suddenly. He made a brusque gesture with his hand, and his men moved out of earshot.  Were it my choice, I would burn you with my brother Alester,  he told Davos.  You are both traitors.    Say what you will. I would never betray King Stannis.    You would. You will. I see it in your face. And I have seen it in the flames as well. R’hllor has blessed me with that gift. Like Lady Melisandre, he shows me the future in the fire. Stannis Baratheon will sit the Iron Throne. I have seen it. And I know what must be done. His Grace must make me his Hand, in place of my traitor brother. And you will tell him so.   Will I? Davos said nothing.   The queen has urged my appointment,  Ser Axell went on.  Even your old friend from Lys, the pirate Saan, he says the same. We have made a plan together, him and me. Yet His Grace does not act. The defeat gnaws inside him, a black worm in his soul. It is up to us who love him to show him what to do. If you are as devoted to his cause as you claim, smuggler, you will join your voice to ours. Tell him that I am the only Hand he needs. Tell him, and when we sail I shall see that you have a new ship.   A ship. Davos studied the other man’s face. Ser Axell had big Florent ears, much like the queen’s. Coarse hair grew from them, as from his nostrils; more sprouted in tufts and patches beneath his double chin. His nose was broad, his brow beetled, his eyes close-set and hostile. He would sooner give me a pyre than a ship, he said as much, but if I do him this favor…   if you think to betray me,  Ser Axell said,  pray remember that I have been castellan of Dragonstone a good long time. The garrison is mine. Perhaps I cannot burn you without the king’s consent, but who is to say you might not suffer a fall.  He laid a meaty hand on the back of Davos’s neck and shoved him bodily against the waist-high side of the bridge, then shoved a little harder to force his face out over the yard.  Do you hear me?    I hear,  said Davos. And you dare name me traitor?  Ser Axell released him.  Good.  He smiled.  His Grace awaits. Best we do not keep him.   At the very top of Stone Drum, within the great round room called the Chamber of the Painted Table, they found Stannis Baratheon standing behind the artifact that gave the hall its name, a massive slab of wood carved and painted in the shape of Westeros as it had been in the time of Aegon the Conqueror. An iron brazier stood beside the king, its coals glowing a ruddy orange. Four tall pointed windows looked out to north, south, east, and west. Beyond was the night and the starry sky. Davos could hear the wind moving, and fainter, the sounds of the sea.   Your Grace,  Ser Axell said,  as it please you, I have brought the onion knight.    So I see.  Stannis wore a grey wool tunic, a dark red mantle, and a plain black leather belt from which his sword and dagger hung. A red-gold crown with flame-shaped points encircled his brows. The look of him was a shock. He seemed ten years older than the man that Davos had left at Storm’s End when he set sail for the Blackwater and the battle that would be their undoing. The king’s close-cropped beard was spiderwebbed with grey hairs, and he had dropped two stone or more of weight. He had never been a fleshy man, but now the bones moved beneath his skin like spears, fighting to cut free. Even his crown seemed too large for his head. His eyes were blue pits lost in deep hollows, and the shape of a skull could be seen beneath his face.  Yet when he saw Davos, a faint smile brushed his lips.  So the sea has returned me my knight of the fish and onions.    It did, Your Grace.  Does he know that he had me in his dungeon? Davos went to one knee.   Rise, Ser Davos,  Stannis commanded.  I have missed you, ser. I have need of good counsel, and you never gave me less. So tell me true—what is the penalty for treason?   The word hung in the air. A frightful word, thought Davos. Was he being asked to condemn his cellmate? Or himself, perchance? Kings know the penalty for treason better than any man.  Treason?  he finally managed, weakly.   What else would you call it, to deny your king and seek to steal his rightful throne. I ask you again—what is the penalty for treason under the law?   Davos had no choice but to answer.  Death,  he said.  The penalty is death, Your Grace."
}