{
  "id": "137a6d0ab69d7999540d2b903ffe9e735b6a8ea3",
  "text": " We should go too, Arya knew.   If you’re looking for Ser, you come too late,  Polliver said.  He was at Harrenhal, but now he’s not. The queen sent for him.  He wore three blades on his belt, Arya saw; a longsword on his left hip, and on his right a dagger and a slimmer blade, too long to be a dirk and too short to be a sword.  King Joffrey’s dead, you know,  he added.  Poisoned at his own wedding feast.   Arya edged farther into the room. Joffrey’s dead. She could almost see him, with his blond curls and his mean smile and his fat soft lips. Joffrey’s dead! She knew it ought to make her happy, but somehow she still felt empty inside. Joffrey was dead, but if Robb was dead too, what did it matter?   So much for my brave brothers of the Kingsguard.  The Hound gave a snort of contempt.  Who killed him?    The Imp, it’s thought. Him and his little wife.    What wife?    I forgot, you’ve been hiding under a rock. The northern girl. Winterfell’s daughter. We heard she killed the king with a spell, and afterward changed into a wolf with big leather wings like a bat, and flew out a tower window. But she left the dwarf behind and Cersei means to have his head.   That’s stupid, Arya thought. Sansa only knows songs, not spells, and she’d never marry the Imp.  The Hound sat on the bench closest the door. His mouth twitched, but only the burned side.  She ought to dip him in wildfire and cook him. Or tickle him till the moon turns black.  He raised his wine cup and drained it straightaway.  He’s one of them, Arya thought when she saw that. She bit her lip so hard she tasted blood. He’s just like they are. I should kill him when he sleeps.   So Gregor took Harrenhal?  Sandor said.   Didn’t require much taking,  said Polliver.  The sellswords fled as soon as they knew we were coming, all but a few. One of the cooks opened a postern gate for us, to get back at Hoat for cutting off his foot.  He chuckled.  We kept him to cook for us, a couple wenches to warm our beds, and put all the rest to the sword.    All the rest?  Arya blurted out.   Well, Ser kept Hoat to pass the time.   Sandor said,  The Blackfish is still in Riverrun?    Not for long,  said Polliver.  He’s under siege. Old Frey’s going to hang Edmure Tully unless he yields the castle. The only real fighting’s around Raventree. Blackwoods and Brackens. The Brackens are ours now.   The Hound poured a cup of wine for Arya and another for himself, and drank it down while staring at the hearthfire.  The little bird flew away, did she? Well, bloody good for her. She shit on the Imp’s head and flew off.    They’ll find her,  said Polliver.  If it takes half the gold in Casterly Rock.    A pretty girl, I hear,  said the Tickler.  Honey sweet.  He smacked his lips and smiled.   And courteous,  the Hound agreed.  A proper little lady. Not like her bloody sister.    They found her too,  said Polliver.  The sister. She’s for Bolton’s bastard, I hear.   Arya sipped her wine so they could not see her mouth. She didn’t understand what Polliver was talking about. Sansa has no other sister. Sandor Clegane laughed aloud.   What’s so bloody funny?  asked Polliver.  The Hound never flicked an eye at Arya.  If I’d wanted you to know, I’d have told you. Are there ships at Saltpans?    Saltpans? How should I know? The traders are back at Maidenpool, I heard. Randyll Tarly took the castle and locked Mooton in a tower cell. I haven’t heard shit about Saltpans.   The Tickler leaned forward.  Would you put to sea without bidding farewell to your brother?  It gave Arya chills to hear him ask a question.  Ser would sooner you returned to Harrenhal with us, Sandor. I bet he would. Or King’s Landing…    Bugger that. Bugger him. Bugger you.   The Tickler shrugged, straightened, and reached a hand behind his head to rub the back of his neck. Everything seemed to happen at once then; Sandor lurched to his feet, Polliver drew his longsword, and the Tickler’s hand whipped around in a blur to send something silver flashing across the common room. If the Hound had not been moving, the knife might have cored the apple of his throat; instead it only grazed his ribs, and wound up quivering in the wall near the door. He laughed then, a laugh as cold and hollow as if it had come from the bottom of a deep well.  I was hoping you’d do something stupid.  His sword slid from its scabbard just in time to knock aside Polliver’s first cut.  Arya took a step backward as the long steel song began. The Tickler came off the bench with a shortsword in one hand and a dagger in the other. Even the chunky brown-haired squire was up, fumbling for his swordhilt. She snatched her wine cup off the table and threw it at his face. Her aim was better than it had been at the Twins. The cup hit him right on his big white pimple and he went down hard on his tail.  Polliver was a grim, methodical fighter, and he pressed Sandor steadily backward, his heavy longsword moving with brutal precision. The Hound’s own cuts were sloppier, his parries rushed, his feet slow and clumsy."
}