{
  "id": "1461455112955d1c633b3417aefa4c879b2b9871",
  "text": "  Her uncle was the first to greet her. As black a fish as ever, Ser Brynden had no care for what others might think. He leapt off the dais and pulled Catelyn into his arms. When he said,  It is good to see you home, Cat,  she had to struggle to keep her composure.  And you,  she whispered.   Mother.   Catelyn looked up at her tall kingly son.  Your Grace, I have prayed for your safe return. I had heard you were wounded.    I took an arrow through the arm while storming the Crag,  he said.  It’s healed well, though. I had the best of care.    The gods are good, then.  Catelyn took a deep breath. Say it. It cannot be avoided.  They will have told you what I did. Did they tell you my reasons?    For the girls.    I had five children. Now I have three.    Aye, my lady.  Lord Rickard Karstark pushed past the Greatjon, like some grim specter with his black mail and long ragged grey beard, his narrow face pinched and cold.  And I have one son, who once had three. You have robbed me of my vengeance.   Catelyn faced him calmly.  Lord Rickard, the Kingslayer’s dying would not have bought life for your children. His living may buy life for mine.   The lord was unappeased.  Jaime Lannister has played you for a fool. You’ve bought a bag of empty words, no more. My Torrhen and my Eddard deserved better of you.    Leave off, Karstark,  rumbled the Greatjon, crossing his huge arms against his chest.  It was a mother’s folly. Women are made that way.    A mother’s folly?  Lord Karstark rounded on Lord Umber.  I name it treason.    Enough.  For just an instant Robb sounded more like Brandon than his father.  No man calls my lady of Winterfell a traitor in my hearing, Lord Rickard.  When he turned to Catelyn, his voice softened.  If I could wish the Kingslayer back in chains I would. You freed him without my knowledge or consent… but what you did, I know you did for love. For Arya and Sansa, and out of grief for Bran and Rickon. Love’s not always wise, I’ve learned. It can lead us to great folly, but we follow our hearts… wherever they take us. Don’t we, Mother?   Is that what I did?  If my heart led me into folly, I would gladly make whatever amends I can to Lord Karstark and yourself.   Lord Rickard’s face was implacable.  Will your amends warm Torrhen and Eddard in the cold graves where the Kingslayer laid them?  He shouldered between the Greatjon and Maege Mormont and left the hall.  Robb made no move to detain him.  Forgive him, Mother.    If you will forgive me.    I have. I know what it is to love so greatly you can think of nothing else.   Catelyn bowed her head.  Thank you.  I have not lost this child, at least.   We must talk,  Robb went on.  You and my uncles. Of this and… other things. Steward, call an end.   Utherydes Wayn slammed his staff on the floor and shouted the dismissal, and river lords and northerners alike moved toward the doors. It was only then that Catelyn realized what was amiss. The wolf. The wolf is not here. Where is Grey Wind? She knew the direwolf had returned with Robb, she had heard the dogs, but he was not in the hall, not at her son’s side where he belonged.  Before she could think to question Robb, however, she found herself surrounded by a circle of well-wishers. Lady Mormont took her hand and said,  My lady, if Cersei Lannister held two of my daughters, I would have done the same.  The Greatjon, no respecter of proprieties, lifted her off her feet and squeezed her arms with his huge hairy hands.  Your wolf pup mauled the Kingslayer once, he’ll do it again if need be.  Galbart Glover and Lord Jason Mallister were cooler, and Jonos Bracken almost icy, but their words were courteous enough. Her brother was the last to approach her.  I pray for your girls as well, Cat. I hope you do not doubt that.     Of course not.  She kissed him.  I love you for it.   When all the words were done, the Great Hall of Riverrun was empty save for Robb, the three Tullys, and the six strangers Catelyn could not place. She eyed them curiously.  My lady, sers, are you new to my son’s cause?    New,  said the younger knight, him of the seashells,  but fierce in our courage and firm in our loyalties, as I hope to prove to you, my lady.   Robb looked uncomfortable.  Mother,  he said,  may I present the Lady Sybell, the wife of Lord Gawen Westerling of the Crag.  The older woman came forward with solemn mien.  Her husband was one of those we took captive in the Whispering Wood.   Westerling, yes, Catelyn thought. Their banner is six seashells, white on sand. A minor house sworn to the Lannisters.  Robb beckoned the other strangers forward, each in turn.  Ser Rolph Spicer, Lady Sybell’s brother. He was castellan at the Crag when we took it.  The pepperpot knight inclined his head. A square-built man with a broken nose and a close-cropped grey beard, he looked doughty enough.  The children of Lord Gawen and Lady Sybell. Ser Raynald Westerling.  The seashell knight smiled beneath a bushy mustache. Young, lean, rough-hewn, he had good teeth and a thick mop of chestnut hair."
}