{
  "id": "1624875eb84ea4388e212ce414af4bcf38cb8081",
  "text": " Five hundred knights surrounded him, sunlight flashing off the points of their lances. The remnants of the Stark lines shattered like glass beneath the hammer of their charge.  With his elbow swollen and throbbing inside his armor, Tyrion made no attempt to join the slaughter. He and Bronn went looking for his men. Many he found among the dead. Ulf son of Umar lay in a pool of congealing blood, his arm gone at the elbow, a dozen of his Moon Brothers sprawled around him. Shagga was slumped beneath a tree, riddled with arrows, Conn’s head in his lap. Tyrion thought they were both dead, but as he dismounted, Shagga opened his eyes and said,  They have killed Conn son of Coratt.  Handsome Conn had no mark but for the red stain over his breast, where the spear thrust had killed him. When Bronn pulled Shagga to his feet, the big man seemed to notice the arrows for the first time. He plucked them out one by one, cursing the holes they had made in his layers of mail and leather, and yowling like a babe at the few that had buried themselves in his flesh. Chella daughter of Cheyk rode up as they were yanking arrows out of Shagga, and showed them four ears she had taken. Timett they discovered looting the bodies of the slain with his Burned Men. Of the three hundred clansmen who had ridden to battle behind Tyrion Lannister, perhaps half had survived.  He left the living to look after the dead, sent Bronn to take charge of his captive knight, and went alone in search of his father. Lord Tywin was seated by the river, sipping wine from a jeweled cup as his squire undid the fastenings on his breastplate.  A fine victory,  Ser Kevan said when he saw Tyrion.  Your wild men fought well.   His father’s eyes were on him, pale green flecked with gold, so cool they gave Tyrion a chill.  Did that surprise you, Father?  he asked.  Did it upset your plans? We were supposed to be butchered, were we not?   Lord Tywin drained his cup, his face expressionless.  I put the least disciplined men on the left, yes. I anticipated that they would break. Robb Stark is a green boy, more like to be brave than wise. I’d hoped that if he saw our left collapse, he might plunge into the gap, eager for a rout. Once he was fully committed, Ser Kevan’s pikes would wheel and take him in the flank, driving him into the river while I brought up the reserve.    And you thought it best to place me in the midst of this carnage, yet keep me ignorant of your plans.    A feigned rout is less convincing,  his father said,  and I am not inclined to trust my plans to a man who consorts with sellswords and savages.    A pity my savages ruined your dance.  Tyrion pulled off his steel gauntlet and let it fall to the ground, wincing at the pain that stabbed up his arm.   The Stark boy proved more cautious than I expected for one of his years,  Lord Tywin admitted,  but a victory is a victory. You appear to be wounded.   Tyrion’s right arm was soaked with blood.  Good of you to notice, Father,  he said through clenched teeth.  Might I trouble you to send for your maesters? Unless you relish the notion of having a one-armed dwarf for a son…   An urgent shout of  Lord Tywin!  turned his father’s head before he could reply. Tywin Lannister rose to his feet as Ser Addam Marbrand leapt down off his courser. The horse was lathered and bleeding from the mouth. Ser Addam dropped to one knee, a rangy man with dark copper hair that fell to his shoulders, armored in burnished bronzed steel with the fiery tree of his House etched black on his breastplate.  My liege, we have taken some of their commanders. Lord Cerwyn, Ser Wylis Manderly, Harrion Karstark, four Freys. Lord Hornwood is dead, and I fear Roose Bolton has escaped us.    And the boy?  Lord Tywin asked.  Ser Addam hesitated.  The Stark boy was not with them, my lord. They say he crossed at the Twins with the great part of his horse, riding hard for Riverrun.   A green boy, Tyrion remembered, more like to be brave than wise. He would have laughed, if he hadn’t hurt so much.      CATELYN  The woods were full of whispers.  Moonlight winked on the tumbling waters of the stream below as it wound its rocky way along the floor of the valley. Beneath the trees, warhorses whickered softly and pawed at the moist, leafy ground, while men made nervous jests in hushed voices. Now and again, she heard the chink of spears, the faint metallic slither of chain mail, but even those sounds were muffled.   It should not be long now, my lady,  Hallis Mollen said. He had asked for the honor of protecting her in the battle to come; it was his right, as Winterfell’s captain of guards, and Robb had not refused it to him. She had thirty men around her, charged to keep her unharmed and see her safely home to Winterfell if the fighting went against them. Robb had wanted fifty; Catelyn had insisted that ten would be enough, that he would need every sword for the fight. They made their peace at thirty, neither happy with it.   It will come when it comes,  Catelyn told him."
}