{
  "id": "18314bdf1e64bbe2e0bc3452f1e79545945aad1a",
  "text": "  Jaime sat against the bole of an oak and wondered what Cersei and Tyrion were doing just now.  Do you have any siblings, my lady?  he asked.  Brienne squinted at him suspiciously.  No. I was my father’s only s—child.   Jaime chuckled.  Son, you meant to say. Does he think of you as a son? You make a queer sort of daughter, to be sure.   Wordless, she turned away from him, her knuckles tight on her sword hilt. What a wretched creature this one is. She reminded him of Tyrion in some queer way, though at first blush two people could scarcely be any more dissimilar. Perhaps it was that thought of his brother that made him say,  I did not intend to give offense, Brienne. Forgive me.    Your crimes are past forgiving, Kingslayer.    That name again.  Jaime twisted idly at his chains.  Why do I enrage you so? I’ve never done you harm that I know of.    You’ve harmed others. Those you were sworn to protect. The weak, the innocent…    …the king?  It always came back to Aerys.  Don’t presume to judge what you do not understand, wench.    My name is—    —Brienne, yes. Has anyone ever told you that you’re as tedious as you are ugly?    You will not provoke me to anger, Kingslayer.    Oh, I might, if I cared enough to try.    Why did you take the oath?  she demanded.  Why don the white cloak if you meant to betray all it stood for?   Why? What could he say that she might possibly understand?  I was a boy. Fifteen. It was a great honor for one so young.    That is no answer,  she said scornfully.  You would not like the truth. He had joined the Kingsguard for love, of course.  Their father had summoned Cersei to court when she was twelve, hoping to make her a royal marriage. He refused every offer for her hand, preferring to keep her with him in the Tower of the Hand while she grew older and more womanly and ever more beautiful. No doubt he was waiting for Prince Viserys to mature, or perhaps for Rhaegar’s wife to die in childbed. Elia of Dorne was never the healthiest of women.  Jaime, meantime, had spent four years as squire to Ser Sumner Crakehall and earned his spurs against the Kingswood Brotherhood. But when he made a brief call at King’s Landing on his way back to Casterly Rock, chiefly to see his sister, Cersei took him aside and whispered that Lord Tywin meant to marry him to Lysa Tully, had gone so far as to invite Lord Hoster to the city to discuss dower. But if Jaime took the white, he could be near her always. Old Ser Harlan Grandison had died in his sleep, as was only appropriate for one whose sigil was a sleeping lion. Aerys would want a young man to take his place, so why not a roaring lion in place of a sleepy one?   Father will never consent,  Jaime objected.   The king won’t ask him. And once it’s done, Father can’t object, not openly. Aerys had Ser Ilyn Payne’s tongue torn out just for boasting that it was the Hand who truly ruled the Seven Kingdoms. The captain of the Hand’s guard, and yet Father dared not try and stop it! He won’t stop this, either.    But,  Jaime said,  there’s Casterly Rock…    Is it a rock you want? Or me?   He remembered that night as if it were yesterday. They spent it in an old inn on Eel Alley, well away from watchful eyes. Cersei had come to him dressed as a simple serving wench, which somehow excited him all the more. Jaime had never seen her more passionate. Every time he went to sleep, she woke him again. By morning Casterly Rock seemed a small price to pay to be near her always. He gave his consent, and Cersei promised to do the rest.  A moon’s turn later, a royal raven arrived at Casterly Rock to inform him that he had been chosen for the Kingsguard. He was commanded to present himself to the king during the great tourney at Harrenhal to say his vows and don his cloak.  Jaime’s investiture freed him from Lysa Tully. Elsewise, nothing went as planned. His father had never been more furious. He could not object openly—Cersei had judged that correctly—but he resigned the Handship on some thin pretext and returned to Casterly Rock, taking his daughter with him. Instead of being together, Cersei and Jaime just changed places, and he found himself alone at court, guarding a mad king while four lesser men took their turns dancing on knives in his father’s ill-fitting shoes. So swiftly did the Hands rise and fall that Jaime remembered their heraldry better than their faces. The horn-of-plenty Hand and the dancing griffins Hand had both been exiled, the mace-and-dagger Hand dipped in wildfire and burned alive. Lord Rossart had been the last. His sigil had been a burning torch; an unfortunate choice, given the fate of his predecessor, but the alchemist had been elevated largely because he shared the king’s passion for fire. I ought to have drowned Rossart instead of gutting him.  Brienne was still awaiting his answer. Jaime said,  You are not old enough to have known Aerys Targaryen…   She would not hear it.  Aerys was mad and cruel, no one has ever denied that. He was still king, crowned and anointed."
}