{
  "id": "18d3c516695772a685aa64c966347a5435296087",
  "text": " And lights, Legolas! We should make lights, such lamps  as once shone  in Khazad-dym; and when  we  wished  we  would drive away  the  night  that has  lain there  since the hills were made; and when we  desired  rest, we would let the night return.'   ####-     'You  move me, Gimli,' said Legolas. 'I have never heard you speak like  this  before. Almost you make  me regret that  I  have not seen these caves.   Come! Let us make this bargain-if we both return safe out of the perils that  await us, we will journey for a while together. You shall visit Fangorn with  me, and then I will come with you to see Helm's Deep.'       'That would not be the way of return that I should choose,' said Gimli.  'But I will endure Fangorn, if I have your promise to come back to the caves  and share their wonder with me.'       'You have  my promise,' said Legolas. 'But  alas!  Now  we  must  leave  behind both cave and wood for a while: See! We  are coming to the end of the  trees. How far is it to Isengard, Gandalf?'       'About fifteen leagues, as the crows of Saruman make it.' said Gandalf:   'five from the mouth of Deeping-coomb to  the Fords: and ten more from there  to the gates of Isengard. But we shall not ride all the way this night.'       'And  when we come there,  what shall  we see?'  asked Gimli. 'You  may  know, but I cannot guess.'       'I do  not know myself for certain,'  answered the wizard. 'I was there  at  nightfall yesterday, but much may have happened since. Yet  I think that  you will not say that the journey was  in vain  -- not though the Glittering  Caves of Aglarond be left behind.'       At last the company passed  through  the trees, and found that they had  come to the bottom of the Coomb, where  the road from Helm's  Deep  branched,  going one way east to  Edoras,  and the other north to the Fords of Isen. As  they  rode from under the eaves of the wood, Legolas  halted and looked back  with regret. Then he gave a sudden cry.       'There are eyes!' he said.  'Eyes looking out  from the shadows  of the  boughs! I never saw such eyes before.'       The others,  surprised  by  his cry,  halted  and turned;  but  Legolas  started to ride back.       'No, no!' cried Gimli. 'Do  as  you please in your madness,  but let me  first get  down  from  this horse! I wish  to see  no eyes!' 'Stay,  Legolas  Greenleaf!' said Gandalf. 'Do not go back into the wood, not yet! Now is not  your time.'       Even as he spoke,  there came forward out of  the  trees three  strange  shapes.  As  tall as trolls they were, twelve feet  or more in height; their  strong bodies, stout as  young trees, seemed to be clad with raiment or with   ####-hide of close-fitting grey and br own. Their limbs were long, and their hands  had many fingers; their hair was stiff, and their beards grey-green as moss.   They gazed out with solemn  eyes, but they were not  looking at the  riders:   their eyes were bent northwards.  Suddenly they  lifted their long  hands to  their  mouths, and  sent forth ringing calls, clear as notes  of a horn, but  more musical and various.  The calls  were answered; and turning  again, the   riders  saw other creatures of the same  kind approaching, striding  through  the grass. They came swiftly from the North, walking  like wading herons  in  their gait,  but not in their speed; for their legs in their long paces beat  quicker than the heron's  wings.  The riders cried aloud in wonder, and some  set their hands upon their swor d-hilts.       'You need no  weapons,' said Gandalf. 'These are but herdsmen. They are  not enemies, indeed they are not concerned with us at all.'       So  it  seemed to be;  for  as  he spoke the tall creatures,  without a   glance at the riders, strode into the wood and vanished.       'Herdsmen!'  said  Thjoden. 'Where  are their  flocks? What  are  they,  Gandalf? For it is plain that to you, at any rate, they are not strange.'       'They are the shepherds of the trees,' answered Gandalf. 'Is it so long  since you listened to tales by the fireside? There are children in your land  who, out  of the twisted  threads of story, could pick the  answer  to  your  question. You have seen  Ents, O King, Ents out of  Fangorn Forest, which in  your tongue you call the Entwood. Did you think that the name was given only  in  idle  fancy?  Nay, Thjoden,  it is otherwise: to  them  you are  but the  passing tale;  all the years from Eorl the Young to Thjoden  the  Old are of  little count to them; and all the deeds of your house but a small matter.'       The king was silent. 'Ents!' he said at  length. 'Out of the shadows of  legend I  begin a little to  understand the marvel  of the trees, I think. I  have  lived  to see  strange  days. Long  we have tended our beasts  and our  fields, built our houses, wrought  our tools, or ridden away to help in  the  wars  of  Minas Tirith. And that we called  the life of Men,  the way of the  world. We cared little for what lay beyond the borders of our land."
}