{
  "id": "19cd4ad02c1c1a3bab75902cf37f9f2b1a1589fb",
  "text": "  Even from afar, his lord father was resplendent. Tywin Lannister’s battle armor put his son Jaime’s gilded suit to shame. His greatcloak was sewn from countless layers of cloth-of-gold, so heavy that it barely stirred even when he charged, so large that its drape covered most of his stallion’s hindquarters when he took the saddle. No ordinary clasp would suffice for such a weight, so the greatcloak was held in place by a matched pair of miniature lionesses crouching on his shoulders, as if poised to spring. Their mate, a male with a magnificent mane, reclined atop Lord Tywin’s greathelm, one paw raking the air as he roared. All three lions were wrought in gold, with ruby eyes. His armor was heavy steel plate, enameled in a dark crimson, greaves and gauntlets inlaid with ornate gold scrollwork. His rondels were golden sunbursts, all his fastenings were gilded, and the red steel was burnished to such a high sheen that it shone like fire in the light of the rising sun.  Tyrion could hear the rumble of the foemen’s drums now. He remembered Robb Stark as he had last seen him, in his father’s high seat in the Great Hall of Winterfell, a sword naked and shining in his hands. He remembered how the direwolves had come at him out of the shadows, and suddenly he could see them again, snarling and snapping, teeth bared in his face. Would the boy bring his wolves to war with him? The thought made him uneasy.  The northerners would be exhausted after their long sleepless march. Tyrion wondered what the boy had been thinking. Did he think to take them unawares while they slept? Small chance of that; whatever else might be said of him, Tywin Lannister was no man’s fool.  The van was massing on the left. He saw the standard first, three black dogs on a yellow field. Ser Gregor sat beneath it, mounted on the biggest horse Tyrion had ever seen. Bronn took one look at him and grinned.  Always follow a big man into battle.   Tyrion threw him a hard look.  And why is that?    They make such splendid targets. That one, he’ll draw the eyes of every bowman on the field.   Laughing, Tyrion regarded the Mountain with fresh eyes.  I confess, I had not considered it in that light.   Clegane had no splendor about him; his armor was steel plate, dull grey, scarred by hard use and showing neither sigil nor ornament. He was pointing men into position with his blade, a two-handed greatsword that Ser Gregor waved about with one hand as a lesser man might wave a dagger.  Any man runs, I’ll cut him down myself,  he was roaring when he caught sight of Tyrion.  Imp! Take the left. Hold the river. If you can.   The left of the left. To turn their flank, the Starks would need horses that could run on water. Tyrion led his men toward the riverbank.  Look,  he shouted, pointing with his axe.  The river.  A blanket of pale mist still clung to the surface of the water, the murky green current swirling past underneath. The shallows were muddy and choked with reeds.  That river is ours. Whatever happens, keep close to the water. Never lose sight of it. Let no enemy come between us and our river. If they dirty our waters, hack off their cocks and feed them to the fishes.   Shagga had an axe in either hand. He smashed them together and made them ring.  Halfman!  he shouted. Other Stone Crows picked up the cry, and the Black Ears and Moon Brothers as well. The Burned Men did not shout, but they rattled their swords and spears.  Halfman! Halfman! Halfman!   Tyrion turned his courser in a circle to look over the field. The ground was rolling and uneven here; soft and muddy near the river, rising in a gentle slope toward the kingsroad, stony and broken beyond it, to the cast. A few trees spotted the hillsides, but most of the land had been cleared and planted. His heart pounded in his chest in time to the drums, and under his layers of leather and steel his brow was cold with sweat. He watched Ser Gregor as the Mountain rode up and down the line, shouting and gesticulating. This wing too was all cavalry, but where the right was a mailed fist of knights and heavy lancers, the vanguard was made up of the sweepings of the west: mounted archers in leather jerkins, a swarming mass of undisciplined freeriders and sellswords, fieldhands on plow horses armed with scythes and their fathers’ rusted swords, half-trained boys from the stews of Lannisport… and Tyrion and his mountain clansmen.   Crow food,  Bronn muttered beside him, giving voice to what Tyrion had left unsaid. He could only nod. Had his lord father taken leave of his senses? No pikes, too few bowmen, a bare handful of knights, the ill-armed and unarmored, commanded by an unthinking brute who led with his rage… how could his father expect this travesty of a battle to hold his left?  He had no time to think about it. The drums were so near that the beat crept under his skin and set his hands to twitching. Bronn drew his longsword, and suddenly the enemy was there before them, boiling over the tops of the hills, advancing with measured tread behind a wall of shields and pikes."
}