{
  "id": "1ac42e5be4ee7732e111a685b632623c8ef132b1",
  "text": "  Tyrion drove into the gap hard on the king’s hooves. Bronn kept pace, sword in hand. A jagged rock flew past his head as he rode, and a rotten cabbage exploded against Ser Mandon’s shield. To their left, three gold cloaks went down under the surge, and then the crowd was rushing forward, trampling the fallen men. The Hound had vanished behind, though his riderless horse galloped beside them. Tyrion saw Aron Santagar pulled from the saddle, the gold-and-black Baratheon stag torn from his grasp. Ser Balon Swann dropped the Lannister lion to draw his longsword. He slashed right and left as the fallen banner was ripped apart, the thousand ragged pieces swirling away like crimson leaves in a stormwind. In an instant they were gone. Someone staggered in front of Joffrey’s horse and shrieked as the king rode him down. Whether it had been man, woman, or child Tyrion could not have said. Joffrey was galloping at his side, whey-faced, with Ser Mandon Moore a white shadow on his left.  And suddenly the madness was behind and they were clattering across the cobbled square that fronted on the castle barbican. A line of spearmen held the gates. Ser Jacelyn was wheeling his lances around for another charge. The spears parted to let the king’s party pass under the portcullis. Pale red walls loomed up about them, reassuringly high and aswarm with crossbowmen.  Tyrion did not recall dismounting. Ser Mandon was helping the shaken king off his horse when Cersei, Tommen, and Lancel rode through the gates with Ser Meryn and Ser Boros close behind. Boros had blood smeared along his blade, while Meryn’s white cloak had been torn from his back. Ser Balon Swann rode in helmetless, his mount lathered and bleeding at the mouth. Horas Redwyne brought in Lady Tanda, half crazed with fear for her daughter Lollys, who had been knocked from the saddle and left behind. Lord Gyles, more grey of face than ever, stammered out a tale of seeing the High Septon spilled from his litter, screeching prayers as the crowd swept over him. Jalabhar Xho said he thought he’d seen Ser Preston Greenfield of the Kingsguard riding back toward the High Septon’s overturned litter, but he was not certain.  Tyrion was dimly aware of a maester asking if he was injured. He pushed his way across the yard to where his nephew stood, his dung-encrusted crown askew.  Traitors,  Joffrey was babbling excitedly,  I’ll have all their heads, I’ll—   The dwarf slapped his flushed face so hard the crown flew from Joffrey’s head. Then he shoved him with both hands and knocked him sprawling.  You blind bloody fool.    They were traitors,  Joffrey squealed from the ground.  They called me names and attacked me!    You set your dog on them! What did you imagine they would do, bend the knee meekly while the Hound lopped off some limbs? You spoiled witless little boy, you’ve killed Clegane and gods know how many more, and yet you come through unscratched. Damn you!  And he kicked him. It felt so good he might have done more, but Ser Mandon Moore pulled him off as Joffrey howled, and then Bronn was there to take him in hand. Cersei knelt over her son, while Ser Balon Swann restrained Ser Lancel. Tyrion wrenched free of Bronn’s grip.  How many are still out there?  he shouted to no one and everyone.   My daughter,  cried Lady Tanda.  Please, someone must go back for Lollys…    Ser Preston is not returned,  Ser Boros Blount reported,  nor Aron Santagar.    Nor Wet Nurse,  said Ser Horas Redwyne. That was the mocking name the other squires had hung on young Tyrek Lannister.  Tyrion glanced round the yard.  Where’s the Stark girl?   For a moment no one answered. Finally Joffrey said,  She was riding by me. I don’t know where she went.   Tyrion pressed blunt fingers into his throbbing temples. If Sansa Stark had come to harm, Jaime was as good as dead.  Ser Mandon, you were her shield.   Ser Mandon Moore remained untroubled.  When they mobbed the Hound, I thought first of the king.    And rightly so,  Cersei put in.  Boros, Meryn, go back and find the girl.    And my daughter,  Lady Tanda sobbed.  Please, sers…   Ser Boros did not look pleased at the prospect of leaving the safety of the castle.  Your Grace,  he told the queen,  the sight of our white cloaks might enrage the mob.   Tyrion had stomached all he cared to.  The Others take your fucking cloaks! Take them off if you’re afraid to wear them, you bloody oaf… but find me Sansa Stark or I swear, I’ll have Shagga split that ugly head of yours in two to see if there’s anything inside but black pudding.   Ser Boros went purple with rage.  You would call me ugly, you?  He started to raise the bloody sword still clutched in his mailed fist. Bronn shoved Tyrion unceremoniously behind him.   Stop it!  Cersei snapped.  Boros, you’ll do as you’re bid, or we’ll find someone else to wear that cloak. Your oath—    There she is!  Joffrey shouted, pointing.  Sandor Clegane cantered briskly through the gates astride Sansa’s chestnut courser. The girl was seated behind, both arms tight around the Hound’s chest."
}