{
  "id": "1b1fb99c0b556193d05c33b1f0740749dfdb9ba9",
  "text": "  The false knight who profaned his blade with the blood of the king he had sworn to defend.    Have a care for your words, ser,  the queen warned.  You are speaking of our beloved brother, your king’s own blood.   Lord Varys spoke, gentler than the others.  We are not unmindful of your service, good ser. Lord Tywin Lannister has generously agreed to grant you a handsome tract of land north of Lannisport, beside the sea, with gold and men sufficient to build you a stout keep, and servants to see to your every need.   Ser Barristan looked up sharply.  A hall to die in, and men to bury me. I thank you, my lords… but I spit upon your pity.  He reached up and undid the clasps that held his cloak in place, and the heavy white garment slithered from his shoulders to fall in a heap on the floor. His helmet dropped with a clang.  I am a knight,  he told them. He opened the silver fastenings of his breastplate and let that fall as well.  I shall die a knight.    A naked knight, it would seem,  quipped Littlefinger.  They all laughed then, Joffrey on his throne, and the lords standing attendance, Janos Slynt and Queen Cersei and Sandor Clegane and even the other men of the Kingsguard, the five who had been his brothers until a moment ago. Surely that must have hurt the most, Sansa thought. Her heart went out to the gallant old man as he stood shamed and red-faced, too angry to speak. Finally he drew his sword.  Sansa heard someone gasp. Ser Boros and Ser Meryn moved forward to confront him, but Ser Barristan froze them in place with a look that dripped contempt.  Have no fear, sers, your king is safe… no thanks to you. Even now, I could cut through the five of you as easy as a dagger cuts cheese. If you would serve under the Kingslayer, not a one of you is fit to wear the white.  He flung his sword at the foot of the Iron Throne.  Here, boy. Melt it down and add it to the others, if you like. It will do you more good than the swords in the hands of these five. Perhaps Lord Stannis will chance to sit on it when he takes your throne.   He took the long way out, his steps ringing loud against the floor and echoing off the bare stone walls. Lords and ladies parted to let him pass. Not until the pages had closed the great oak-and-bronze doors behind him did Sansa hear sounds again: soft voices, uneasy stirrings, the shuffle of papers from the council table.  He called me boy,  Joffrey said peevishly, sounding younger than his years.  He talked about my uncle Stannis too.    Idle talk,  said Varys the eunuch.  Without meaning…    He could be making plots with my uncles. I want him seized and questioned.  No one moved. Joffrey raised his voice.  I said, I want him seized!   Janos Slynt rose from the council table.  My gold cloaks will see to it, Your Grace.    Good,  said King Joffrey. Lord Janos strode from the hall, his ugly sons double-stepping to keep up as they lugged the great metal shield with the arms of House Slynt.   Your Grace,  Littlefinger reminded the king.  If we might resume, the seven are now six. We find ourselves in need of a new sword for your Kingsguard.   Joffrey smiled.  Tell them, Mother.    The king and council have determined that no man in the Seven Kingdoms is more fit to guard and protect His Grace than his sworn shield, Sandor Clegane.    How do you like that, dog?  King Joffrey asked.  The Hound’s scarred face was hard to read. He took a long moment to consider.  Why not? I have no lands nor wife to forsake, and who’d care if I did?  The burned side of his mouth twisted.  But I warn you, I’ll say no knight’s vows.    The Sworn Brothers of the Kingsguard have always been knights,  Ser Boros said firmly.   Until now,  the Hound said in his deep rasp, and Ser Boros fell silent.  When the king’s herald moved forward, Sansa realized the moment was almost at hand. She smoothed down the cloth of her skirt nervously. She was dressed in mourning, as a sign of respect for the dead king, but she had taken special care to make herself beautiful. Her gown was the ivory silk that the queen had given her, the one Arya had ruined, but she’d had them dye it black and you couldn’t see the stain at all. She had fretted over her jewelry for hours and finally decided upon the elegant simplicity of a plain silver chain.  The herald’s voice boomed out.  If any man in this hall has other matters to set before His Grace, let him speak now or go forth and hold his silence.   Sansa quailed. Now, she told herself, I must do it now. Gods give me courage. She took one step, then another. Lords and knights stepped aside silently to let her pass, and she felt the weight of their eyes on her. I must be as strong as my lady mother.  Your Grace,  she called out in a soft, tremulous voice.  The height of the Iron Throne gave Joffrey a better vantage point than anyone else in the hall. He was the first to see her.  Come forward, my lady,  he called out, smiling.  His smile emboldened her, made her feel beautiful and strong. He does love me, he does."
}