{
  "id": "224fd699ef15b1be86d16bac39176734a391bd18",
  "text": "    What, no goats?  Tyrion said, taking a bite of cheese.  The other clansmen followed Shagga into the common room, Bronn with them. The sellsword gave Tyrion a rueful shrug.   Who might you be?  Lord Tywin asked, cool as snow.   They followed me home, Father,  Tyrion explained.  May I keep them? They don’t eat much.   No one was smiling.  By what right do you savages intrude on our councils?  demanded Ser Kevan.   Savages, lowlander?  Conn might have been handsome if you washed him.  We are free men, and free men by rights sit on all war councils.    Which one is the lion lord?  Chella asked.   They are both old men,  announced Timett son of Timett, who had yet to see his twentieth year.  Ser Kevan’s hand went to his sword hilt, but his brother placed two fingers on his wrist and held him fast. Lord Tywin seemed unperturbed.  Tyrion, have you forgotten your courtesies? Kindly acquaint us with our… honored guests.   Tyrion licked his fingers.  With pleasure,  he said.  The fair maid is Chella daughter of Cheyk of the Black Ears.    I’m no maid,  Chella protested.  My sons have taken fifty ears among them.    May they take fifty more.  Tyrion waddled away from her.  This is Conn son of Coratt. Shagga son of Dolf is the one who looks like Casterly Rock with hair. They are Stone Crows. Here is Ulf son of Umar of the Moon Brothers, and here Timett son of Timett, a red hand of the Burned Men. And this is Bronn, a sellsword of no particular allegiance. He has already changed sides twice in the short time I’ve known him, you and he ought to get on famously, Father.  To Bronn and the clansmen he said,  May I present my lord father, Tywin son of Tytos of House Lannister, Lord of Casterly Rock, Warden of the West, Shield of Lannisport, and once and future Hand of the King.   Lord Tywin rose, dignified and correct.  Even in the west, we know the prowess of the warrior clans of the Mountains of the Moon. What brings you down from your strongholds, my lords?    Horses,  said Shagga.   A promise of silk and steel,  said Timett son of Timett.  Tyrion was about to tell his lord father how he proposed to reduce the Vale of Arryn to a smoking wasteland, but he was never given the chance. The door banged open again. The messenger gave Tyrion’s clansmen a quick, queer look as he dropped to one knee before Lord Tywin.  My lord,  he said,  Ser Addam bid me tell you that the Stark host is moving down the causeway.   Lord Tywin Lannister did not smile. Lord Tywin never smiled, but Tyrion had learned to read his father’s pleasure all the same, and it was there on his face.  So the wolfling is leaving his den to play among the lions,  he said in a voice of quiet satisfaction.  Splendid. Return to Ser Addam and tell him to fall back. He is not to engage the northerners until we arrive, but I want him to harass their flanks and draw them farther south.    It will be as you command.  The rider took his leave.   We are well situated here,  Ser Kevan pointed out.  Close to the ford and ringed by pits and spikes. If they are coming south, I say let them come, and break themselves against us.    The boy may hang back or lose his courage when he sees our numbers,  Lord Tywin replied.  The sooner the Starks are broken, the sooner I shall be free to deal with Stannis Baratheon. Tell the drummers to beat assembly, and send word to Jaime that I am marching against Robb Stark.    As you will,  Ser Kevan said.  Tyrion watched with a grim fascination as his lord father turned next to the half-wild clansmen.  It is said that the men of the mountain clans are warriors without fear.    It is said truly,  Conn of the Stone Crows answered.   And the women,  Chella added.   Ride with me against my enemies, and you shall have all my son promised you, and more,  Lord Tywin told them.   Would you pay us with our own coin?  Ulf son of Umar said.  Why should we need the father’s promise, when we have the son’s?    I said nothing of need,  Lord Tywin replied.  My words were courtesy, nothing more. You need not join us. The men of the winterlands are made of iron and ice, and even my boldest knights fear to face them.   Oh, deftly done, Tyrion thought, smiling crookedly.   The Burned Men fear nothing. Timett son of Timett will ride with the lions.    Wherever the Burned Men go, the Stone Crows have been there first,  Conn declared hotly.  We ride as well.    Shagga son of Dolf will chop off their manhoods and feed them to the crows.    We will ride with you, lion lord,  Chella daughter of Cheyk agreed,  but only if your halfman son goes with us. He has bought his breath with promises. Until we hold the steel he has pledged us, his life is ours.   Lord Tywin turned his gold-flecked eyes on his son.   Joy,  Tyrion said with a resigned smile.      SANSA  The walls of the throne room had been stripped bare, the hunting tapestries that King Robert loved taken down and stacked in the corner in an untidy heap.  Ser Mandon Moore went to take his place under the throne beside two of his fellows of the Kingsguard."
}