{
  "id": "22573c9c53f1acfa32df8a002d63f7c5435ebbce",
  "text": " Oswell and Lothor splashed their way ashore, as did Littlefinger himself. He gave the old woman a kiss on the cheek and grinned at the younger one.  Who fathered this one, Kella?   The fat woman laughed.  I can’t rightly say, m’lord. I’m not one for telling them no.    And all the local lads are grateful, I am quite sure.    It is good to have you home, my lord,  said one old man. He looked to be at least eighty, but he wore a studded brigantine and a longsword at his side.  How long will you be in residence?    As short a time as possible, Bryen, have no fear. Is the place habitable just now, would you say?    If we knew you was coming we would have laid down fresh rushes, m’lord,  said the crone.  There’s a dung fire burning.    Nothing says home like the smell of burning dung.  Petyr turned to Sansa.  Grisel was my wet nurse, but she keeps my castle now. Umfred’s my steward, and Bryen—didn’t I name you captain of the guard the last time I was here?    You did, my lord. You said you’d be getting some more men too, but you never did. Me and the dogs stand all the watches.    And very well, I’m sure. No one has made off with any of my rocks or sheep pellets, I see that plainly.  Petyr gestured toward the fat woman.  Kella minds my vast herds. How many sheep do I have at present, Kella?   She had to think a moment.  Three and twenty, m’lord. There was nine and twenty, but Bryen’s dogs killed one and we butchered some others and salted down the meat.    Ah, cold salt mutton. I must be home. When I break my fast on gulls’ eggs and seaweed soup, I’ll be certain of it.    If you like, m’lord,  said the old woman Grisel.  Lord Petyr made a face.  Come, let’s see if my hall is as dreary as I recall.  He led them up the strand over rocks slick with rotting seaweed. A handful of sheep were wandering about the base of the flint tower, grazing on the thin grass that grew between the sheepfold and thatched stable. Sansa had to step carefully; there were pellets everywhere.  Within, the tower seemed even smaller. An open stone stair wound round the inside wall, from undercroft to roof. Each floor was but a single room. The servants lived and slept in the kitchen at ground level, sharing the space with a huge brindled mastiff and a half-dozen sheepdogs. Above that was a modest hall, and higher still the bedchamber. There were no windows, but arrowslits were embedded in the outer wall at intervals along the curve of the stair. Above the hearth hung a broken longsword and a battered oaken shield, its paint cracked and flaking.  The device painted on the shield was one Sansa did not know; a grey stone head with fiery eyes, upon a light green field.  My grandfather’s shield,  Petyr explained when he saw her gazing at it.  His own father was born in Braavos and came to the Vale as a sellsword in the hire of Lord Corbray, so my grandfather took the head of the Titan as his sigil when he was knighted.    It’s very fierce,  said Sansa.   Rather too fierce, for an amiable fellow like me,  said Petyr.  I much prefer my mockingbird.   Oswell made two more trips out to the Merling King to offload provisions. Among the loads he brought ashore were several casks of wine. Petyr poured Sansa a cup, as promised.  Here, my lady, that should help your tummy, I would hope.   Having solid ground beneath her feet had helped already, but Sansa dutifully lifted the goblet with both hands and took a sip. The wine was very fine; an Arbor vintage, she thought. It tasted of oak and fruit and hot summer nights, the flavors blossoming in her mouth like flowers opening to the sun. She only prayed that she could keep it down. Lord Petyr was being so kind, she did not want to spoil it all by retching on him.  He was studying her over his own goblet, his bright grey-green eyes full of… was it amusement? Or something else? Sansa was not certain.  Grisel,  he called to the old woman,  bring some food up. Nothing too heavy, my lady has a tender tummy. Some fruit might serve, perhaps. Oswell’s brought some oranges and pomegranates from the King.    Yes, m’lord.    Might I have a hot bath as well?  asked Sansa.   I’ll have Kella draw some water, m’lady.   Sansa took another sip of wine and tried to think of some polite conversation, but Lord Petyr saved her the effort. When Grisel and the other servants had gone, he said,  Lysa will not come alone. Before she arrives, we must be clear on who you are.    Who I… I don’t understand.    Varys has informers everywhere. If Sansa Stark should be seen in the Vale, the eunuch will know within a moon’s turn, and that would create unfortunate… complications. It is not safe to be a Stark just now. So we shall tell Lysa’s people that you are my natural daughter.    Natural?  Sansa was aghast.  You mean, a bastard?    Well, you can scarcely be my trueborn daughter. I’ve never taken a wife, that’s well known. What should you be called?    I… I could call myself after my mother…    Catelyn? A bit too obvious… but after my mother, that would serve."
}