{
  "id": "232e2167376d63df878a8341c3cee35609e16269",
  "text": " She had broken her fast on some acorn paste and a handful of bugs. Bugs weren’t so bad when you got used to them. Worms were worse, but still not as bad as the pain in your belly after days without food. Finding bugs was easy, all you had to do was kick over a rock. Arya had eaten a bug once when she was little, just to make Sansa screech, so she hadn’t been afraid to eat another. Weasel wasn’t either, but Hot Pie retched up the beetle he tried to swallow, and Lommy and Gendry wouldn’t even try. Yesterday Gendry had caught a frog and shared it with Lommy, and, a few days before, Hot Pie had found blackberries and stripped the bush bare, but mostly they had been living on water and acorns. Kurz had told them how to use rocks and make a kind of acorn paste. it tasted awful.  She wished the poacher hadn’t died. He’d known more about the woods than all the rest of them together, but he’d taken an arrow through the shoulder pulling in the ladder at the towerhouse. Tarber had packed it with mud and moss from the lake, and for a day or two Kurz swore the wound was nothing, even though the flesh of his throat was turning dark while angry red welts crept up his jaw and down his chest. Then one morning he couldn’t find the strength to get up, and by the next he was dead.  They buried him under a mound of stones, and Cutjack had claimed his sword and hunting horn, while Tarber helped himself to bow and boots and knife. They’d taken it all when they left. At first they thought the two had just gone hunting, that they’d soon return with game and feed them all. But they waited and waited, until finally Gendry made them move on. Maybe Tarber and Cutjack figured they would stand a better chance without a gaggle of orphan boys to herd along. They probably would too, but that didn’t stop her hating them for leaving.  Beneath her tree, Hot Pie barked like a dog. Kurz had told them to use animal sounds to signal to each other. An old poacher’s trick, he’d said, but he’d died before he could teach them how to make the sounds right. Hot Pie’s bird calls were awful. His dog was better, but not much.  Arya hopped from the high branch to one beneath it, her hands out for balance. A water dancer never falls. Lightfoot, her toes curled tight around the branch, she walked a few feet, hopped down to a larger limb, then swung hand over hand through the tangle of leaves until she reached the trunk. The bark was rough beneath her fingers, against her toes. She descended quickly, jumping down the final six feet, rolling when she landed.  Gendry gave her a hand to pull her up.  You were up there a long time. What could you see?    A fishing village, just a little place, north along the shore. Twenty-six thatch roofs and one slate, I counted. I saw part of a wagon. Someone’s there.   At the sound of her voice, Weasel came creeping out from the bushes. Lommy had named her that. He said she looked like a weasel, which wasn’t true, but they couldn’t keep on calling her the crying girl after she finally stopped crying. Her mouth was filthy. Arya hoped she hadn’t been eating mud again.   Did you see people?  asked Gendry.   Mostly just roofs,  Arya admitted,  but some chimneys were smoking, and I heard a horse.  The Weasel put her arms around her leg, clutching tight. Sometimes she did that now.   If there’s people, there’s food,  Hot Pie said, too loudly. Gendry was always telling him to be more quiet, but it never did any good.  Might be they’d give us some.    Might be they’d kill us too,  Gendry said.   Not if we yielded,  Hot Pie said hopefully.   Now you sound like Lommy.   Lommy Greenhands sat propped up between two thick roots at the foot of an oak. A spear had taken him through his left calf during the fight at the holdfast. By the end of the next day, he had to limp along one-legged with an arm around Gendry, and now he couldn’t even do that. They’d hacked branches off trees to make a litter for him, but it was slow, hard work carrying him along, and he whimpered every time they jounced him.   We have to yield,  he said.  That’s what Yoren should have done. He should have opened the gates like they said.   Arya was sick of Lommy going on about how Yoren should have yielded. It was all he talked about when they carried him, that and his leg and his empty belly.  Hot Pie agreed.  They told Yoren to open the gates, they told him in the king’s name. You have to do what they tell you in the king’s name. It was that stinky old man’s fault. If he’d of yielded, they would have left us be.   Gendry frowned.  Knights and lordlings, they take each other captive and pay ransoms, but they don’t care if the likes of you yield or not.  He turned to Arya.  What else did you see?    If it’s a fishing village, they’d sell us fish, I bet,  said Hot Pie. The lake teemed with fresh fish, but they had nothing to catch them with. Arya had tried to use her hands, the way she’d seen Koss do, but fish were quicker than pigeons and the water played tricks on her eyes."
}