{
  "id": "23b623dfca7796ff38982f58a8a3cfc11991a860",
  "text": " For the longest time there was no sound but the wind.  Marillion gasped,  You… you…   The guards were shouting outside the door, pounding with the butts of their heavy spears. Lord Petyr pulled Sansa to her feet.  You’re not hurt?  When she shook her head, he said,  Run let my guards in, then. Quick now, there’s no time to lose. This singer’s killed my lady wife.       Epilogue   The road up to Oldstones went twice around the hill before reaching the summit. Overgrown and stony, it would have been slow going even in the best of times, and last night’s snow had left it muddy as well. Snow in autumn in the riverlands, it’s unnatural, Merrett thought gloomily. It had not been much of a snow, true; just enough to blanket the ground for a night. Most of it had started melting away as soon as the sun came up. Still, Merrett took it for a bad omen. Between rains, floods, fire, and war, they had lost two harvests and a good part of a third. An early winter would mean famine all across the riverlands. A great many people would go hungry, and some of them would starve. Merrett only hoped he wouldn’t be one of them. I may, though. With my luck, I just may. I never did have any luck.  Beneath the castle ruins, the lower slopes of the hill were so thickly forested that half a hundred outlaws could well have been lurking there. They could be watching me even now. Merrett glanced about, and saw nothing but gorse, bracken, thistle, sedge, and blackberry bushes between the pines and grey-green sentinels. Elsewhere skeletal elm and ash and scrub oaks choked the ground like weeds. He saw no outlaws, but that meant little. Outlaws were better at hiding than honest men.  Merrett hated the woods, if truth be told, and he hated outlaws even more.  Outlaws stole my life,  he had been known to complain when in his cups. He was too often in his cups, his father said, often and loudly. Too true, he thought ruefully. You needed some sort of distinction in the Twins, else they were liable to forget you were alive, but a reputation as the biggest drinker in the castle had done little to enhance his prospects, he’d found. I once hoped to be the greatest knight who ever couched a lance. The gods took that away from me. Why shouldn’t I have a cup of wine from time to time? It helps my headaches. Besides, my wife is a shrew, my father despises me, my children are worthless. What do I have to stay sober for?  He was sober now, though. Well, he’d had two horns of ale when he broke his fast, and a small cup of red when he set out, but that was just to keep his head from pounding. Merrett could feel the headache building behind his eyes, and he knew that if he gave it half a chance he would soon feel as if he had a thunderstorm raging between his ears. Sometimes his headaches got so bad that it even hurt too much to weep. Then all he could do was rest on his bed in a dark room with a damp cloth over his eyes, and curse his luck and the nameless outlaw who had done this to him.  Just thinking about it made him anxious. He could no wise afford a headache now. If I bring Petyr back home safely, all my luck will change. He had the gold, all he needed to do was climb to the top of Oldstones, meet the bloody outlaws in the ruined castle, and make the exchange. A simple ransom. Even he could not muck it up… unless he got a headache, one so bad that it left him unable to ride. He was supposed to be at the ruins by sunset, not weeping in a huddle at the side of the road. Merrett rubbed two fingers against his temple. Once more around the hill, and there I am. When the message had come in and he had stepped forward to offer to carry the ransom, his father had squinted down and said,  You, Merrett?  and started laughing through his nose, that hideous heh heh heh laugh of his. Merrett practically had to beg before they’d give him the bloody bag of gold.  Something moved in the underbrush along the side of the road. Merrett reined up hard and reached for his sword, but it was only a squirrel.  Stupid,  he told himself, shoving the sword back in its scabbard without ever having gotten it out.  Outlaws don’t have tails. Bloody hell, Merrett, get hold of yourself.  His heart was thumping in his chest as if he were some green boy on his first campaign. As if this were the kingswood and it was the old Brotherhood I was going to face, not the lightning lord’s sorry lot of brigands. For a moment he was tempted to trot right back down the hill and find the nearest alehouse. That bag of gold would buy a lot of ale, enough for him to forget all about Petyr Pimple. Let them hang him, he brought this on himself. It’s no more than he deserves, wandering off with some bloody camp follower like a stag in rut.  His head had begun to pound; soft now, but he knew it would get worse. Merrett rubbed the bridge of his nose. He really had no right to think so ill of Petyr. I did the same myself when I was his age. In his case all it got him was a pox, but still, he shouldn’t condemn."
}