{
  "id": "270d2ffd37bb93992f782d4efd17a50b1808b98a",
  "text": "  It was too late for that now, however. Theon had no choice but to lead Asha to Ned Stark’s solar. There, before the ashes of a dead fire, he blurted,  Dagmer’s lost the fight at Torrhen’s Square—    The old castellan broke his shield wall, yes,  Asha said calmly.  What did you expect? This Ser Rodrik knows the land intimately, as the Cleftjaw does not, and many of the northmen were mounted. The ironborn lack the discipline to stand a charge of armored horse. Dagmer lives, be grateful for that much. He’s leading the survivors back toward the Stony Shore.   She knows more than I do, Theon realized. That only made him angrier.  The victory has given Leobald Tallhart the courage to come out from behind his walls and join Ser Rodrik. And I’ve had reports that Lord Manderly has sent a dozen barges upriver packed with knights, warhorses, and siege engines. The Umbers are gathering beyond the Last River as well. I’ll have an army at my gates before the moon turns, and you bring me only ten men?    I need not have brought you any.    I commanded you—    Father commanded me to take Deepwood Motte,  she snapped.  He said nothing of me having to rescue my little brother.    Bugger Deepwood,  he said.  It’s a wooden pisspot on a hill. Winterfell is the heart of the land, but how am I to hold it without a garrison?    You might have thought of that before you took it. Oh, it was cleverly done, I’ll grant you. If only you’d had the good sense to raze the castle and carry the two little princelings back to Pyke as hostages, you might have won the war in a stroke.    You’d like that, wouldn’t you? To see my prize reduced to ruins and ashes.    Your prize will be the doom of you. Krakens rise from the sea, Theon, or did you forget that during your years among the wolves? Our strength is in our longships. My wooden pisspot sits close enough to the sea for supplies and fresh men to reach me whenever they are needful. But Winterfell is hundreds of leagues inland, ringed by woods, hills, and hostile holdfasts and castles. And every man in a thousand leagues is your enemy now, make no mistake. You made certain of that when you mounted those heads on your gatehouse.  Asha shook her head.  How could you be such a bloody fool? Children…    They defied me!  he shouted in her face.  And it was blood for blood besides, two sons of Eddard Stark to pay for Rodrik and Maron.  The words tumbled out heedlessly, but Theon knew at once that his father would approve.  I’ve laid my brothers’ ghosts to rest.    Our brothers,  Asha reminded him, with a half smile that suggested she took his talk of vengeance well salted.  Did you bring their ghosts from Pyke, brother? And here I thought they haunted only Father.    When has a maid ever understood a man’s need for revenge?  Even if his father did not appreciate the gift of Winterfell, he must approve of Theon avenging his brothers!  Asha snorted back a laugh.  This Ser Rodrik may well feel the same manly need, did you think of that? You are blood of my blood, Theon, whatever else you may be. For the sake of the mother who bore us both, return to Deepwood Motte with me. Put Winterfell to the torch and fall back while you still can.    No.  Theon adjusted his crown.  I took this castle and I mean to hold it.   His sister looked at him a long time.  Then hold it you shall,  she said,  for the rest of your life.  She sighed.  I say it tastes like folly, but what would a shy maid know of such things?  At the door she gave him one last mocking smile.  You ought to know, that’s the ugliest crown I’ve ever laid eyes on. Did you make it yourself?   She left him fuming, and lingered no longer than was needful to feed and water her horses. Half the men she’d brought returned with her as threatened, riding out the same Hunter’s Gate that Bran and Rickon had used for their escape.  Theon watched them go from atop the wall. As his sister vanished into the mists of the wolfswood he found himself wondering why he had not listened and gone with her.   Gone, has she?  Reek was at his elbow.  Theon had not heard him approach, nor smelled him either. He could not think of anyone he wanted to see less. It made him uneasy to see the man walking around breathing, with what he knew. I should have had him killed after he did the others, he reflected, but the notion made him nervous. Unlikely as it seemed, Reek could read and write, and he was possessed of enough base cunning to have hidden an account of what they’d done.   M’lord prince, if you’ll pardon me saying, it’s not right for her to abandon you. And ten men, that won’t be near enough.    I am well aware of that,  Theon said. So was Asha.   Well, might be I could help you,  said Reek.  Give me a horse and bag o’ coin, and I could find you some good fellows.   Theon narrowed his eyes.  How many?    A hundred, might be. Two hundred. Maybe more.  He smiled, his pale eyes glinting.  I was born up north here. I know many a man, and many a man knows Reek.   Two hundred men were not an army, but you didn’t need thousands to hold a castle as strong as Winterfell."
}