{
  "id": "2868aab7158e0bbf2587bc931974b0ce870253f8",
  "text": " A woman scarcely one step above a whore, and she helped herself to my mother’s jewels! It fell to Tywin to restore House Lannister to its proper place. Just as it fell to him to rule this realm, when he was no more than twenty. He bore that heavy burden for twenty years, and all it earned him was a mad king’s envy. Instead of the honor he deserved, he was made to suffer slights beyond count, yet he gave the Seven Kingdoms peace, plenty, and justice. He is a just man. You would be wise to trust him.   Tyrion blinked in astonishment. Ser Kevan had always been solid, stolid, pragmatic; he had never heard him speak with such fervor before.  You love him.    He is my brother.    I… I will think on what you’ve said.    Think carefully, then. And quickly.   He thought of little else that night, but come morning was no closer to deciding if his father could be trusted. A servant brought him porridge and honey to break his fast, but all he could taste was bile at the thought of confession. They will call me kinslayer till the end of my days. For a thousand years or more, if I am remembered at all, it will be as the monstrous dwarf who poisoned his young nephew at his wedding feast. The thought made him so bloody angry that he flung the bowl and spoon across the room and left a smear of porridge on the wall. Ser Addam Marbrand looked at it curiously when he came to escort Tyrion to trial, but had the good grace not to inquire.   Lord Varys,  the herald said,  master of whisperers.   Powdered, primped, and smelling of rosewater, the Spider rubbed his hands one over the other all the time he spoke. Washing my life away, Tyrion thought, as he listened to the eunuch’s mournful account of how the Imp had schemed to part Joffrey from the Hound’s protection and spoken with Bronn of the benefits of having Tommen as king. Half-truths are worth more than outright lies. And unlike the others, Varys had documents; parchments painstakingly filled with notes, details, dates, whole conversations. So much material that its recitation took all day, and so much of it damning. Varys confirmed Tyrion’s midnight visit to Grand Maester Pycelle’s chambers and the theft of his poisons and potions, confirmed the threat he’d made to Cersei the night of their supper, confirmed every bloody thing but the poisoning itself. When Prince Oberyn asked him how he could possibly know all this, not having been present at any of these events, the eunuch only giggled and said,  My little birds told me. Knowing is their purpose, and mine.   How do I question a little bird? thought Tyrion. I should have had the eunuch’s head off my first day in King’s Landing. Damn him. And damn me for whatever trust I put in him.   Have we heard it all?  Lord Tywin asked his daughter as Varys left the hall.   Almost,  said Cersei.  I beg your leave to bring one final witness before you, on the morrow.    As you wish,  Lord Tywin said.  Oh, good, thought Tyrion savagely. After this farce of a trial, execution will almost come as a relief.  That night, as he sat by his window drinking, he heard voices outside his door. Ser Kevan, come for my answer, he thought at once, but it was not his uncle who entered.  Tyrion rose to give Prince Oberyn a mocking bow.  Are judges permitted to visit the accused?    Princes are permitted to go where they will. Or so I told your guards.  The Red Viper took a seat.   My father will be displeased with you.    The happiness of Tywin Lannister has never been high on my list of concerns. Is it Dornish wine you’re drinking?    From the Arbor.   Oberyn made a face.  Red water. Did you poison him?    No. Did you?   The prince smiled.  Do all dwarfs have tongues like yours? Someone is going to cut it out one of these days.    You are not the first to tell me that. Perhaps I should cut it out myself, it seems to make no end of trouble.    So I’ve seen. I think I may drink some of Lord Redwyne’s grape juice after all.    As you like.  Tyrion served him a cup.  The man took a sip, sloshed it about in his mouth, and swallowed.  It will serve, for the moment. I will send you up some strong Dornish wine on the morrow.  He took another sip.  I have turned up that golden-haired whore I was hoping for.    So you found Chataya’s?    At Chataya’s I bedded the black-skinned girl. Alayaya, I believe she is called. Exquisite, despite the stripes on her back. But the whore I referred to is your sister.    Has she seduced you yet?  Tyrion asked, unsurprised.  Oberyn laughed aloud.  No, but she will if I meet her price. The queen has even hinted at marriage. Her Grace needs another husband, and who better than a prince of Dorne? Ellaria believes I should accept. Just the thought of Cersei in our bed makes her wet, the randy wench. And we should not even need to pay the dwarf’s penny. All your sister requires from me is one head, somewhat overlarge and missing a nose.    And?  said Tyrion, waiting.  By way of answer Prince Oberyn swirled his wine, and said,  When the Young Dragon conquered Dorne so long ago, he left the Lord of Highgarden to rule us after the Submission of Sunspear."
}