{
  "id": "2be9fb356a84ff33eaa8b26af2e2eae54c0d3c5e",
  "text": "\" Harry felt an inexpressible sense of gratitude to Dumbledore for asking the others not to question him.  It wasn't as though he didn't want them there; but the thought of explaining it all over again, the idea of reliving it one more time, was more than he could stand. \"I will be back to see you as soon as I have met with Fudge, Harry,\" said Dumbledore. \"I would like you to remain here tomorrow until I have spoken to the school.\"  He left. As Madam Pomfrey led Harry to a nearby bed, he caught sight of the real Moody lying motionless in a bed at the far end of the room.  His wooden leg and magical eye were lying on the bedside table. \"Is he okay?\"  Harry asked. \"He'll be fine,\" said Madam Pomfrey, giving Harry some pajamas and pulling screens around him.  He took off his robes, pulled on the pajamas, and got into bed. Ron, Hermione, Bill, Mrs. Weasley, and the black dog came around the screen and settled themselves in chairs on either side of him.  Ron and Hermione were looking at him almost cautiously, as though scared of him.        \"I'm all right,\" he told them.  \"Just tired.\" Mrs. Weasleys eyes filled with tears as she smoothed his bed-covers unnecessarily. Madam Pomfrey, who had bustled off to her office, returned holding a small bottle of some purple potion and a goblet. \"You'll need to drink all of this. Harry,\" she said.  \"It's a potion for dreamless sleep.\" Harry took the goblet and drank a few mouthfuls.  He felt himself becoming drowsy at once.  Everything around him became hazy; the lamps around the hospital wing seemed to be winking at him in a friendly way through the screen around his bed; his body felt as though it was sinking deeper into the warmth of the feather matress.  Before he could finish the potion, before he could say another word, his exhaustion had carried him off to sleep.  Harry woke up, so warm, so very sleepy, that he didn't open his eyes, wanting to drop off again.  The room was still dimly lit; he was sure it was still nighttime and had a feeling that he couldn't have been asleep very long. Then he heard whispering around him. \"They'll wake him if they don't shut up!\" \"What are they shouting about?  Nothing else can have happened, can it?\" Harry opened his eyes blearily.  Someone had removed his glasses.  He could see the fuzzy outlines of Mrs. Weasley and Bill close by.  Mrs. Weasley was on her feet. \"That's Fudge's voice,\" she whispered.  \"And that's Minerva McGonagall's, isn't it?  But what are they arguing about?\" Now Harry could hear them too:  people shouting and running toward the hospital wing. \"Regrettable, but all the same, Minerva -\"  Cornelius Fudge was saying loudly. \"You should never have brought it inside the castle!\"  yelled Professor McGonagall. \"When Dumbledore finds out -\" Harry heard the hospital doors burst open.  Unnoticed by any of the people around his bed, all of whom were staring at the door as Bill pulled back the screens, Harry sat up and put his glasses back on. Fudge came striding up the ward.  Professors McGonagall and Snape were at his heels. \"Where's Dumbledore?\"  Fudge demanded of Mrs. Weasley. \"He's not here,\" said Mrs. Weasley angrily.  \"This is a hospital wing. Minister, don't you think you'd do better to -\" But the door opened, and Dumbledore came sweeping up the ward. \"What has happened?\" said Dumbledore sharply, looking from Fudge to Professor McGonagall.  \"Why are you disturbing these people?  Minerva, I'm surprised at you - I asked you to stand guard over Barty Crouch -\" \"There is no need to stand guard over him anymore, Dumble-dore!\"  she shrieked.  \"The Minister has seen to that!\" Harry had never seen Professor McGonagall lose control like this.  There were angry blotches of color in her cheeks, and a hands were balled into fists; she was trembling with fury.- \"When we told Mr. Fudge that we had caught the Death Eater responsible for tonight's events,\" said Snape, in a low voice; he seemed to feel his personal safety was in question.  He insisted on summoning a dementor to accompany him into the castle.  He brought it up to the office where Barty Crouch -\" \"I told him you would not agree, Dumbledore!\"  McGonagall fumed.  \"I told him you would never allow dementors to set foot inside the castle, but -\" \"My dear woman!\"  roared Fudge, who likewise looked angrier than Harry had ever seen him, \"as Minister of Magic, it is my decision whether I wish to bring protection with me when interviewing a possibly dangerous -\" But Professor McGonagall's voice drowned Fudge's. \"The moment that - that thing entered the room,\" she screamed, pointing at Fudge, trembling all over, \"it swooped down on Crouch and - and -\" Harry felt a chill in his stomach as Professor McGonagall struggled to find words to describe what had happened.  He did not need her to finish her sentence.  He knew what the dementor must have done.  It had administered its fatal kiss to Barty Crouch.  It had sucked his soul out through his mouth.  He was worse than dead. \"By all accounts, he is no loss!\" blustered Fudge."
}