{
  "id": "2c67a469f22d41ecb6fd93850dbbafd3aec25aa3",
  "text": " Harry and Ron were delighted when she told Malfoy he'd been doing it wrong for years.  \"Now, when I blow my whistle, you kick off from the ground, hard,\" said Madam Hooch. \"Keep your brooms steady, rise a few feet, and then come straight back down by leaning forward slightly. On my whistle -- three -- two --\"  But Neville, nervous and jumpy and frightened of being left on the ground, pushed off hard before the whistle had touched Madam Hooch's lips.  \"Come back, boy!\" she shouted, but Neville was rising straight up like a cork shot out of a bottle -- twelve feet -- twenty feet. Harry saw his scared white face look down at the ground falling away, saw him gasp, slip sideways off the broom and --  WHAM -- a thud and a nasty crack and Neville lay facedown on the grass in a heap. His broomstick was still rising higher and higher, and started to drift lazily toward the forbidden forest and out of sight.  Madam Hooch was bending over Neville, her face as white as his.  \"Broken wrist,\" Harry heard her mutter. \"Come on, boy -- it's all right, up you get.\".  She turned to the rest of the class.  \"None of you is to move while I take this boy to the hospital wing! You leave those brooms where they are or you'll be out of Hogwarts before you can say 'Quidditch.' Come on, dear.\"  Neville, his face tear-streaked, clutching his wrist, hobbled off with Madam Hooch, who had her arm around him.  No sooner were they out of earshot than Malfoy burst into laughter.  \"Did you see his face, the great lump?\"  The other Slytherins joined in.  \"Shut up, Malfoy,\" snapped Parvati Patil.  \"Ooh, sticking up for Longbottom?\" said Pansy Parkinson, a hard-faced Slytherin girl. \"Never thought you'd like fat little crybabies, Parvati.\"  \"Look!\" said Malfoy, darting forward and snatching something out of the grass. \"It's that stupid thing Longbottom's gran sent him.\"  The Remembrall glittered in the sun as he held it up.  \"Give that here, Malfoy,\" said Harry quietly. Everyone stopped talking to watch.  Malfoy smiled nastily.  \"I think I'll leave it somewhere for Longbottom to find -- how about -- up a tree?\"  \"Give it here!\" Harry yelled, but Malfoy had leapt onto his broomstick and taken off. He hadn't been lying, he could fly well. Hovering level with the topmost branches of an oak he called, \"Come and get it, Potter!\"  Harry grabbed his broom.  \"No!\" shouted Hermione Granger. \"Madam Hooch told us not to move -- you'll get us all into trouble.\"  Harry ignored her. Blood was pounding in his ears. He mounted the broom and kicked hard against the ground and up, up he soared; air rushed through his hair, and his robes whipped out behind him -and in a rush of fierce joy he realized he'd found something he could do without being taught -- this was easy, this was wonderful. He pulled his broomstick up a little to take it even higher, and heard screams and gasps of girls back on the ground and an admiring whoop from Ron.  He turned his broomstick sharply to face Malfoy in midair. Malfoy looked stunned.  \"Give it here,\" Harry called, \"or I'll knock you off that broom!\" \"Oh, yeah?\" said Malfoy, trying to sneer, but looking worried.  Harry knew, somehow, what to do. He leaned forward and grasped the broom tightly in both hands, and it shot toward Malfay like a javelin. Malfoy only just got out of the way in time; Harry made a sharp about-face and held the broom steady. A few people below were clapping.  \"No Crabbe and Goyle up here to save your neck, Malfoy,\" Harry called.  The same thought seemed to have struck Malfoy.  \"Catch it if you can, then!\" he shouted, and he threw the glass ball high into the air and streaked back toward the ground.  Harry saw, as though in slow motion, the ball rise up in the air and then start to fall. He leaned forward and pointed his broom handle down -- next second he was gathering speed in a steep dive, racing the ball -- wind whistled in his ears, mingled with the screams of people watching -- he stretched out his hand -- a foot from the ground he caught it, just in time to pull his broom straight, and he toppled gently onto the grass with the Remembrall clutched safely in his fist.  \"HARRY POTTER!\"  His heart sank faster than he'd just dived. Professor McGonagall was running toward them. He got to his feet, trembling.  \"Never -- in all my time at Hogwarts --\"  Professor McGonagall was almost speechless with shock, and her glasses flashed furiously, \"-- how dare you -- might have broken your neck --\"  \"It wasn't his fault, Professor --\"  \"Be quiet, Miss Patil  \"But Malfoy --\"  \"That's enough, Mr. Weasley. Potter, follow me, now.\"  Harry caught sight of Malfoy, Crabbe, and Goyle's triumphant faces as he left, walking numbly in Professor McGonagall's wake as she strode toward the castle. He was going to be expelled, he just knew it. He wanted to say something to defend himself, but there seemed to be something wrong with his voice. Professor McGonagall was sweeping along without even looking at him; he had to jog to keep up."
}