{
  "id": "2da06357993fdc724218a4d3fbf8d0a02ff75bc1",
  "text": "\"  \"That's the main road,\" said George, peering down through the windshield. \"We'll be there in ten minutes .... Just as well, it's getting light . . . .\"  A faint pinkish glow was visible along the horizon to the east.  Fred brought the car lower, and Harry saw a dark patchwork of fields and clumps of trees.  \"We're a little way outside the village,\" said George. \"Ottery St. Catchpole.\"  Lower and lower went the flying car. The edge of a brilliant red sun was now gleaming through the trees.  \"Touchdown!\" said Fred as, with a slight bump, they hit the ground. They had landed next to a tumbledown garage in a small yard, and Harry looked out for the first time at Ron's house.  It looked as though it had once been a large stone pigpen, but extra rooms had been added here and there until it was several stories high and so crooked it looked as though it were held up by magic (which, Harry reminded himself, it probably was). Four or five chimneys were perched on top of the red roof. A lopsided sign stuck in the ground near the entrance read, THE BuRRow. Around the front door lay a jumble of rubber boots and a very rusty cauldron. Several fat brown chickens were pecking their way around the yard.  \"It's not much,\" said Ron.  \"It's wonderful,\" said Harry happily, thinking of Privet Drive.  They got out of the car.  \"Now, we'll go upstairs really quietly,\" said Fred, \"and wait for Mum to call us for breakfast Then, Ron, you come bounding downstairs going, `Mum, look who turned up in the night!' and she'll be all pleased to see Harry and no one need ever know we flew the car.\"  \"Right,\" said Ron. \"Come on, Harry, I sleep at the - at the top  Ron had gone a nasty greenish color, his eyes fixed on the house. The other three wheeled around.  Mrs. Weasley was marching across the yard, scattering chickens, and for a short, plump, kind-faced woman, it was remarkable how much she looked like a saber-toothed tiger.  \"Ah, \"said Fred.  \"Oh, dear,\" said George.  Mrs. Weasley came to a halt in front of them, her hands on her hips, staring from one guilty face to the next. She was wearing a flowered apron with a wand sticking out of the pocket.  \"So, \"she said.  \"Morning, Mum,\" said George, in what he clearly thought was a jaunty, winning voice.  \"Have you any idea how worried I've been?\" said Mrs. Weasley in a deadly whisper.  \"Sorry, Mum, but see, we had to -\"  All three of Mrs. Weasley's sons were taller than she was, but they cowered as her rage broke over them.  \"Beds empty! No note! Cargone - could have crashed - out of my  mind with worry - did you care? - never, as long as I've lived - you wait until your father gets home, we never had trouble like this from Bill or Charlie or Percy -\"  \"Perfect Percy,\" muttered Fred.  \"YOU COULD DO WITH TAKING A LEAF OUT OF PERCY'S BOOK!\" yelled Mrs. Weasley, prodding a finger in Fred's chest. \"You could have died, you could have been seen, you could have lost your father his job -\"  It seemed to go on for hours. Mrs. Weasley had shouted herself hoarse before she turned on Harry, who backed away.  \"I'm very pleased to see you, Harry, dear,\" she said. \"Come in and have some breakfast.\"  She turned and walked back into the house and Harry, after a nervous glance at Ron, who nodded encouragingly, followed her.  The kitchen was small and rather cramped. There was a  scrubbed wooden table and chairs in the middle, and Harry sat down on the edge of his seat, looking around. He had never been in a wizard house before.  The clock on the wall opposite him had only one hand and no numbers at all. Written around the edge were things like Time to make tea, Time to feed the chickens, and You're late. Books were stacked three deep on the mantelpiece, books with titles like Charm Your Own Cheese, Enchantment in Baking, and One Minute Feasts - It's Magic! And unless Harry's ears were deceiving him, the old radio next to the sink had just announced that coming up was \"Witching Hour, with the popular singing sorceress, Celestina Warbeck.\"  Mrs. Weasley was clattering around, cooking breakfast a little haphazardly, throwing dirty looks at her sons as she threw sausages into the frying pan. Every now and then she muttered things like \"don't know what you were thinking of,\" and \"never would have believed it.\"  \"I don't blame you, dear,\" she assured Harry, tipping eight or nine sausages onto his plate. \"Arthur and I have been worried about you, too. Just last night we were saying we'd come and get you ourselves if you hadn't written back to Ron by Friday. But really,\" (she was now adding three fried eggs to his plate) \"flying an illegal car halfway across the country - anyone could have seen you -\"  She flicked her wand casually at the dishes in the sink, which began to clean themselves, clinking gently in the background.  \"It was cloudy, Mum!\" said Fred.  \"You keep your mouth closed while you're eating!\" Mrs. Weasley snapped.  \"They were starving him, Mum!\" said George.  \"And you!\" said Mrs. Weasley, but it was with a slightly softened expression that she started cutting Harry bread and buttering it for him."
}