{
  "id": "2f4a8f738576a6b71307e4bc56dcb8d14ffaab25",
  "text": " \"I'm his second, who's yours?\"  Malfoy looked at Crabbe and Goyle, sizing them up.  \"Crabbe,\" he said. \"Midnight all right? We'll meet you in the trophy room; that's always unlocked.\"  When Malfoy had gone, Ron and Harry looked at each other. \"What is a wizard's duel?\" said Harry. \"And what do you mean, you're my second?\"  \"Well, a second's there to take over if you die,\" said Ron casually, getting started at last on his cold pie. Catching the look on Harry's face, he added quickly, \"But people only die in proper duels, you know, with real wizards. The most you and Malfoy'll be able to do is send sparks at each other. Neither of you knows enough magic to do any real damage. I bet he expected you to refuse, anyway.\"  \"And what if I wave my wand and nothing happens?\"  \"Throw it away and punch him on the nose,\" Ron suggested. \"Excuse me.\"  They both looked up. It was Hermione Granger.  \"Can't a person eat in peace in this place?\" said Ron.  Hermione ignored him and spoke to Harry.  \"I couldn't help overhearing what you and Malfoy were saying --\"  \"Bet you could,\" Ron muttered.  \"--and you mustn't go wandering around the school at night, think of the points you'll lose Gryffindor if you're caught, and you're bound to be. It's really very selfish of you.\"  \"And it's really none of your business,\" said Harry.  \"Good-bye,\" said Ron.  All the same, it wasn't what you'd call the perfect end to the day, Harry thought, as he lay awake much later listening to Dean and Seamus falling asleep (Neville wasn't back from the hospital wing). Ron had spent all evening giving him advice such as \"If he tries to curse you, you'd better dodge it, because I can't remember how to block them.\" There was a very good chance they were going to get caught by Filch or Mrs. Norris, and Harry felt he was pushing his luck, breaking another school rule today. On the other hand, Malfoys sneering face kept looming up out of the darkness - this was his big chance to beat Malfoy face-to-face. He couldn't miss it.  \"Half-past eleven,\" Ron muttered at last, \"we'd better go.\"  They pulled on their bathrobes, picked up their wands, and crept across the tower room, down the spiral staircase, and into the Gryffindor common room. A few embers were still glowing in the fireplace, turning all the armchairs into hunched black shadows. They had almost reached the portrait hole when a voice spoke from the chair nearest them, \"I can't believe you're going to do this, Harry.\"  A lamp flickered on. It was Hermione Granger, wearing a pink bathrobe and a frown.  \"You!\" said Ron furiously. \"Go back to bed!\"  \"I almost told your brother,\" Hermione snapped, \"Percy -- he's a prefect, he'd put a stop to this.\"  Harry couldn't believe anyone could be so interfering.  \"Come on,\" he said to Ron. He pushed open the portrait of the Fat Lady and climbed through the hole.  Hermione wasn't going to give up that easily. She followed Ron through the portrait hole, hissing at them like an angry goose.  \"Don't you care about Gryffindor, do you only care about yourselves, I don't want Slytherin to win the house cup, and you'll lose all the points I got from Professor McGonagall for knowing about Switching Spells.\"  \"Go away.\" \"All right, but I warned you, you just remember what I said when you're on the train home tomorrow, you're so --\"  But what they were, they didn't find out. Hermione had turned to the portrait of the Fat Lady to get back inside and found herself facing an empty painting. The Fat Lady had gone on a nighttime visit and Hermione was locked out of Gryffindor tower.  \"Now what am I going to do?\" she asked shrilly.  \"That's your problem,\" said Ron. \"We've got to go, we 3 re going to be late.\"  They hadn't even reached the end of the corridor when Hermione caught up with them.  \"I'm coming with you,\" she said.  \"You are not.\"  \"D'you think I'm going to stand out here and wait for Filch to catch me? If he finds all three of us I'll tell him the truth, that I was trying to stop you, and you can back me up.\"  \"You've got some nerve --\" said Ron loudly.  \"Shut up, both of you!\" said Harry sharply. I heard something.\"  It was a sort of snuffling.  \"Mrs. Norris?\" breathed Ron, squinting through the dark.  It wasn't Mrs. Norris. It was Neville. He was curled up on the floor, fast asleep, but jerked suddenly awake as they crept nearer.  \"Thank goodness you found me! I've been out here for hours, I couldn't remember the new password to get in to bed.\"  \"Keep your voice down, Neville. The password's 'Pig snout' but it won't help you now, the Fat Lady's gone off somewhere.\"  \"How's your arm?\" said Harry.  \"Fine,\" said Neville, showing them. \"Madam Pomfrey mended it in about a minute.\"  \"Good - well, look, Neville, we've got to be somewhere, we'll see you later --\"  \"Don't leave me!\" said Neville, scrambling to his feet, \"I don't want to stay here alone, the Bloody Baron's been past twice already.\"  Ron looked at his watch and then glared furiously at Hermione and Neville.  \"If either of you get us caught, I'll never rest until I've learned that Curse of the Bogies Quirrell told us about, and used it on you."
}