{
  "id": "2fb17095c11aacd26ee649a714cc4fa4514697a0",
  "text": " If I had…    It is too late for ifs, and too late for rescues,  Catelyn said.  All that remains is vengeance.    The last word we had from the north, Ser Rodrik had defeated a force of ironmen near Torrhen’s Square, and was assembling a host at Castle Cerwyn to retake Winterfell.  said Robb.  By now he may have done it. There has been no news for a long while. And what of the Trident, if I turn north? I can’t ask the river lords to abandon their own people.    No,  said Catelyn.  Leave them to guard their own, and win back the north with northmen.    How will you get the northmen to the north?  her brother Edmure asked.  The ironmen control the sunset sea. The Greyjoys hold Moat Cailin as well. No army has ever taken Moat Cailin from the south. Even to march against it is madness. We could be trapped on the causeway, with the ironborn before us and angry Freys at our backs.    We must win back the Freys,  said Robb.  With them, we still have some chance of success, however small. Without them, I see no hope. I am willing to give Lord Walder whatever he requires… apologies, honors, lands, gold… there must be something that would soothe his pride…    Not something,  said Catelyn.  Someone.       Jon    Big enough for you?  Snowflakes speckled Tormund’s broad face, melting in his hair and beard.  ‘The giants swayed slowly atop the mammoths as they rode past two by two. Jon’s garron shied, frightened by such strangeness, but whether it was the mammoths or their riders that scared him it was hard to say. Even Ghost backed off a step, baring his teeth in a silent snarl. The direwolf was big, but the mammoths were a deal bigger, and there were many and more of them.  Jon took the horse in hand and held him still, so he could count the giants emerging from the blowing snow and pale mists that swirled along the Milkwater. He was well beyond fifty when Tormund said something and he lost the count. There must be hundreds. No matter how many went past, they just seemed to keep coming.  In Old Nan’s stories, giants were outsized men who lived in colossal castles, fought with huge swords, and walked about in boots a boy could hide in. These were something else, more bearlike than human, and as wooly as the mammoths they rode. Seated, it was hard to say how big they truly were. Ten feet tall maybe, or twelve, Jon thought. Maybe fourteen, but no taller. Their sloping chests might have passed for those of men, but their arms hung down too far, and their lower torsos looked half again as wide as their upper. Their legs were shorter than their arms, but very thick, and they wore no boots at all; their feet were broad splayed things, hard and horny and black. Neckless, their huge heavy heads thrust forward from between their shoulder blades, and their faces were squashed and brutal. Rats’ eyes no larger than beads were almost lost within folds of horny flesh, but they snuffled constantly, smelling as much as they saw.  They’re not wearing skins, Jon realized. That’s hair. Shaggy pelts covered their bodies, thick below the waist, sparser above. The stink that came off them was choking, but perhaps that was the mammoths. And Joramun blew the Horn of Winter, and woke giants from the earth. He looked for great swords ten feet long, but saw only clubs. Most were just the limbs of dead trees, some still trailing shattered branches. A few had stone balls lashed to the ends to make colossal mauls. The song never says if the horn can put them back to sleep.  One of the giants coming up on them looked older than the rest. His pelt was grey and streaked with white, and the mammoth he rode, larger than any of the others, was grey and white as well. Tormund shouted something up to him as he passed, harsh clanging words in a tongue that Jon did not comprehend. The giant’s lips split apart to reveal a mouth full of huge square teeth, and he made a sound half belch and half rumble. After a moment Jon realized he was laughing. The mammoth turned its massive head to regard the two of them briefly, one huge tusk passing over the top of Jon’s head as the beast lumbered by, leaving huge footprints in the soft mud and fresh snow along the river. The giant shouted down something in the same coarse tongue that Tormund had used.   Was that their king?  asked Jon.   Giants have no kings, no more’n mammoths do, nor snow bears, nor the great whales o’ the grey sea. That was Mag Mar Tun Doh Weg. Mag the Mighty. You can kneel to him if you like, he won’t mind. I know your kneeler’s knees must be itching, for want of some king to bend to. Watch out he don’t step on you, though. Giants have bad eyes, and might be he wouldn’t see some little crow all the way down there by his feet.    What did you say to him? Was that the Old Tongue?    Aye. I asked him if that was his father he was forking, they looked so much alike, except his father had a better smell.    And what did he say to you?   Tormund Thunderfist cracked a gap-toothed smile.  He asked me if that was my daughter riding there beside me, with her smooth pink cheeks."
}