{
  "id": "3015748b8dd97fb394f57ed93084f25b9200aa46",
  "text": "  Castles are not friendly places for the frail, Cressen was reminded as he descended the turnpike stairs of Sea Dragon Tower. Lord Stannis would be found in the Chamber of the Painted Table, atop the Stone Drum, Dragonstone’s central keep, so named for the way its ancient walls boomed and rumbled during storms. To reach him they must cross the gallery, pass through the middle and inner walls with their guardian gargoyles and black iron gates, and ascend more steps than Cressen cared to contemplate. Young men climbed steps two at a time; for old men with bad hips, every one was a torment. But Lord Stannis would not think to come to him, so the maester resigned himself to the ordeal. He had Pylos to help him, at the least, and for that he was grateful.  Shuffling along the gallery, they passed before a row of tall arched windows with commanding views of the outer bailey, the curtain wall, and the fishing village beyond. In the yard, archers were firing at practice butts to the call of  Notch, draw, loose.  Their arrows made a sound like a flock of birds taking wing. Guardsmen strode the wallwalks, peering between the gargoyles on the host camped without. The morning air was hazy with the smoke of cookfires, as three thousand men sat down to break their fasts beneath the banners of their lords. Past the sprawl of the camp, the anchorage was crowded with ships. No craft that had come within sight of Dragonstone this past half year had been allowed to leave again. Lord Stannis’s Fury, a triple-decked war galley of three hundred oars, looked almost small beside some of the big-bellied carracks and cogs that surrounded her.  The guardsmen outside the Stone Drum knew the maesters by sight, and passed them through.  Wait here,  Cressen told Pylos, within.  It’s best I see him alone.    It is a long climb, Maester.   Cressen smiled.  You think I have forgotten? I have climbed these steps so often I know each one by name.   Halfway up, he regretted his decision. He had stopped to catch his breath and ease the pain in his hip when he heard the scuff of boots on stone, and came face-to-face with Ser Davos Seaworth, descending.  Davos was a slight man, his low birth written plain upon a common face. A well-worn green cloak, stained by salt and spray and faded from the sun, draped his thin shoulders, over brown doublet and breeches that matched brown eyes and hair. About his neck a pouch of worn leather hung from a thong. His small beard was well peppered with grey, and he wore a leather glove on his maimed left hand. When he saw Cressen, he checked his descent.   Ser Davos,  the maester said.  When did you return?    In the black of morning. My favorite time.  It was said that no one had ever handled a ship by night half so well as Davos Shorthand. Before Lord Stannis had knighted him, he had been the most notorious and elusive smuggler in all the Seven Kingdoms.   And?   The man shook his head.  It is as you warned him. They will not rise, Maester. Not for him. They do not love him.   No, Cressen thought. Nor will they ever. He is strong, able, just… aye, just past the point of wisdom… yet it is not enough. It has never been enough.  You spoke to them all?    All? No. Only those that would see me. They do not love me either, these highborns. To them I’ll always be the Onion Knight.  His left hand closed, stubby fingers locking into a fist; Stannis had hacked the ends off at the last joint, all but the thumb.  I broke bread with Gulian Swann and old Penrose, and the Tarths consented to a midnight meeting in a grove. The others—well, Beric Dondarrion is gone missing, some say dead, and Lord Caron is with Renly. Bryce the Orange, of the Rainbow Guard.    The Rainbow Guard?    Renly’s made his own Kingsguard,  the onetime smuggler explained,  but these seven don’t wear white. Each one has his own color. Loras Tyrell’s their Lord Commander.   It was just the sort of notion that would appeal to Renly Baratheon; a splendid new order of knighthood, with gorgeous new raiment to proclaim it. Even as a boy, Renly had loved bright colors and rich fabrics, and he had loved his games as well.  Look at me!  he would shout as he ran laughing through the halls of Storm’s End.  Look at me, I’m a dragon,  or  Look at me, I’m a wizard,  or  Look at me, look at me, I’m the rain god.   The bold little boy with wild black hair and laughing eyes was a man grown now, one-and-twenty, and still he played his games. Look at me, I’m a king, Cressen thought sadly. Oh, Renly, Renly, dear sweet child, do you know what you are doing? And would you care if you did? Is there anyone who cares for him but me?  What reasons did the lords give for their refusals?  he asked Ser Davos.   Well, as to that, some gave me soft words and some blunt, some made excuses, some promises, some only lied.  He shrugged.  In the end words are just wind.    You could bring him no hope?    Only the false sort, and I’d not do that,  Davos said.  He had the truth from me.   Maester Cressen remembered the day Davos had been knighted, after the siege of Storm’s End."
}