{
  "id": "30b7839dd79a9cbb6adfa7deef9a6db7ee833aee",
  "text": "  \"Flee - I will make your excuses. I, however, am remaining at Hogwarts.\" Snape and Karkaroff came around the corner.  Snape had his wand out and was blasting rosebushes apart, his expression most ill-natured.  Squeals issued from many of the bushes, and dark shapes emerged from them. \"Ten points from Ravenclaw, Fawcett!\" Snape snarled as a girl ran past him.  \"And ten points from Hufflepuff too, Stebbins!\"  as a boy went rushing after her. \"And what are you two doing?\"  he added, catching sight of Harry and Ron on the path ahead.  Karkaroff, Harry saw, looked slightly discomposed to see them standing there.  His hand went nervously to his goatee, and he began winding it around his finger. \"We re walking,\" Ron told Snape shortly. \"Not against the law, is it?\" \"Keep walking, then!\"  Snape snarled, and he brushed past them, his long black cloak billowing out behind him.  Karkaroff hurried away after Snape.  Harry and Ron continued down the path. \"What's got Karkaroff all worried?\"  Ron muttered. \"And since when have he and Snape been on first-name terms?\"said Harry slowly. They had reached a large stone reindeer now, over which they could see the sparkling jets of a tall fountain.  The shadowy outlines of two enormous people were visible on a stone bench, watching the water in the moonlight. And then Harry heard Hagrid speak. \"Momen' I saw yeh, I knew,\" he was saying, in an oddly husky voice. Harry and Ron froze.  This didn't sound like the sort of scene they ought to walk in on, somehow. . . . Harry looked around, back up the path, and saw Fleur Delacour and Roger Davies standing half-concealed in a rosebush nearby.  He tapped Ron on the shoulder and jerked his head toward them, meaning that they could easily sneak off that way without being noticed (Fleur and Davies looked very busy to Harry), but Ron, eyes widening in horror at the sight of Fleur, shook his head vigorously, and pulled Harry deeper into the shadows behind the reindeer. \"What did you know, 'Agrid?\" said Madame Maxime, a purr in her low voice. Harry definitely didn't want to listen to this; he knew Hagrid would hate to be overheard in a situation like this (he certainly would have) - if it had been possible he would have put his fingers in his ears and hummed loudly, but that wasn't really an option.  Instead he tried to interest himself in a beetle crawling along the stone reindeer's back, but the beetle just wasn't interesting enough to block out Hagrid's next words. \"I jus' knew . . . knew you were like me. . . . Was it yer mother or yer father?\" \"I - I don't know what you mean, 'Agrid. ...\" \"It was my mother,\" said Hagrid quietly. \"She was one o' the las' ones in Britain. 'Course, I can' remember her too well. . . she left, see.  When I was abou' three.  She wasn' really the maternal sort.  Well. . . it's not in their natures, is it?  Dunno what happened to her . . . might be dead fer all I know. ...\" Madame Maxime didn't say anything. And Harry, in spite of himself, took his eyes off the beetle and looked over the top of the reindeer's antlers, listening. ... He had never heard Hagrid talk about his childhood before. \"Me dad was broken-hearted when she wen'.  Tiny little bloke, my dad was.  By the time I was six I could lift him up an' put him on top o' the dresser if he annoyed me.  Used ter make him laugh. . . .\"  Hagrid's deep voice broke.  Madame Maxime was listening, motionless, apparently staring at the silvery fountain.  \"Dad raised me . . . but he died, o' course, jus' after I started school.  Sorta had ter make me own way after that.  Dumbledore was a real help, mind. Very kind ter me, he was. . . .\" Hagrid pulled out a large spotted silk handkerchief and blew his nose heavily. \"So ... anyway . . . enough abou' me. What about you? Which side you got it on?\" But Madame Maxime had suddenly got to her feet. \"It is chilly,\" she said - but whatever the weather was doing, it was nowhere near as cold as her voice.  \"I think I will go in now.\" \"Eh?\" said Hagrid blankly. \"No, don go! I've - I've never met another one before!\" \"Anuzzer what, precisely?\" said Madame Maxime, her tone icy. Harry could have told Hagrid it was best not to answer; he stood there in the shadows gritting his teeth, hoping against hope he wouldn't - but it was no good.  \"Another half-giant, o' course!\" said Hagrid. \"'Ow dare you!\" shrieked Madame Maxime.  Her voice exploded through the peaceful night air like a foghorn; behind him.  Harry heard Fleur and Roger fall out of their rosebush.  \"I 'ave nevair been more insulted in my life!  'Alf-giant?  Moi?  I 'ave - I 'ave big bones!\" She stormed away; great multicolored swarms of fairies rose into the air as she passed, angrily pushing aside bushes.  Hagrid was still sitting on the bench, staring after her.  It was much too dark to make out his expression.  Then, after about a minute, he stood up and strode away, not back to the castle, but off out into the dark grounds in the direction of his cabin. \"C'mon,\" Harry said, very quietly to Ron."
}