{
  "id": "3188328650fbe326788c1dfab014527a9bb1a7eb",
  "text": " I had a cart filled with sand, and sent our most able acolytes. We worked only by night, we—    —did a splendid job, I have no doubt.  Tyrion placed the jar he’d been holding back among its fellows. They covered the table, standing in orderly rows of four and marching away into the subterranean dimness. And there were other tables beyond, many other tables.  These, ah, fruits of the late King Aerys, can they still be used?    Oh, yes, most certainly… but carefully, my lord, ever so carefully. As it ages, the substance grows ever more, hmmmm, fickle, let us say. Any flame will set it afire. Any spark. Too much heat and jars will blaze up of their own accord. It is not wise to let them sit in sunlight, even for a short time. Once the fire begins within, the heat causes the substance to expand violently, and the jars shortly fly to pieces. If other jars should happen to be stored in the same vicinity, those go up as well, and so—    How many jars do you have at present?    This morning the Wisdom Munciter told me that we had seven thousand eight hundred and forty. That count includes four thousand jars from King Aerys’s day, to be sure.    Our overripe fruits?   Hallyne bobbed his head.  Wisdom Malliard believes we shall be able to provide a full ten thousand jars, as was promised the queen. I concur.  The pyromancer looked indecently pleased with that prospect.  Assuming our enemies give you the time. The pyromancers kept their recipe for wildfire a closely guarded secret, but Tyrion knew that it was a lengthy, dangerous, and time-consuming process. He had assumed the promise of ten thousand jars was a wild boast, like that of the bannerman who vows to marshal ten thousand swords for his lord and shows up on the day of battle with a hundred and two. If they can truly give us ten thousand…  He did not know whether he ought to be delighted or terrified. Perhaps a smidge of both.  I trust that your guild brothers are not engaging in any unseemly haste, Wisdom. We do not want ten thousand jars of defective wildfire, nor even one… and we most certainly do not want any mishaps.    There will be no mishaps, my lord Hand. The substance is prepared by trained acolytes in a series of bare stone cells, and each jar is removed by an apprentice and carried down here the instant it is ready. Above each work cell is a room filled entirely with sand. A protective spell has been laid on the floors, hmmm, most powerful. Any fire in the cell below causes the floors to fall away, and the sand smothers the blaze at once.    Not to mention the careless acolyte.  By spell Tyrion imagined Hallyne meant clever trick. He thought he would like to inspect one of these false-ceilinged cells to see how it worked, but this was not the time. Perhaps when the war was won.   My brethren are never careless,  Hallyne insisted.  If I may be, hmmmm, frank…    Oh, do.    The substance flows through my veins, and lives in the heart of every pyromancer. We respect its power. But the common soldier, hmmmm, the crew of one of the queen’s spitfires, say, in the unthinking frenzy of battle… any little mistake can bring catastrophe. That cannot be said too often. My father often told King Aerys as much, as his father told old King Jaehaerys.    They must have listened,  Tyrion said.  If they had burned the city down, someone would have told me. So your counsel is that we had best be careful?     Be very careful,  said Hallyne.  Be very very careful.    These clay jars… do you have an ample supply?    We do, my lord, and thank you for asking.    You won’t mind if I take some, then. A few thousand.    A few thousand?    Or however many your guild can spare, without interfering with production. It’s empty pots I’m asking for, understand. Have them sent round to the captains on each of the city gates.    I will, my lord, but why…?   Tyrion smiled up at him.  When you tell me to dress warmly, I dress warmly. When you tell me to be careful, well…  He gave a shrug.  I’ve seen enough. Perhaps you would be so good as to escort me back up to my litter?    It would be my great, hmmm, pleasure, my lord.  Hallyne lifted the lamp and led the way back to the stairs.  It was good of you to visit us. A great honor, hmmm. It has been too long since the King’s Hand graced us with his presence. Not since Lord Rossart, and he was of our order. That was back in King Aerys’s day. King Aerys took a great interest in our work.   King Aerys used you to roast the flesh off his enemies. His brother Jaime had told him a few stories of the Mad King and his pet pyromancers.  Joffrey will be interested as well, I have no doubt.  Which is why I’d best keep him well away from you.   It is our great hope to have the king visit our Guildhall in his own royal person. I have spoken of it to your royal sister. A great feast…   It was growing warmer as they climbed.  His Grace has prohibited all feasting until such time as the war is won.  At my insistence.  The king does not think it fitting to banquet on choice food while his people go without bread."
}