{
  "id": "32af9f5bb7bcf99dddaab064b1dec4b29bc8ceb7",
  "text": "   Jon followed the rest back to the armory, walking alone. He often walked alone here. There were almost twenty in the group he trained with, yet not one he could call a friend. Most were two or three years his senior, yet not one was half the fighter Robb had been at fourteen. Dareon was quick but afraid of being hit. Pyp used his sword like a dagger, Jeren was weak as a girl, Grenn slow and clumsy. Halder’s blows were brutally hard but he ran right into your attacks. The more time he spent with them, the more Jon despised them.  Inside, Jon hung sword and scabbard from a hook in the stone wall, ignoring the others around him. Methodically, he began to strip off his mail, leather, and sweat-soaked woolens. Chunks of coal burned in iron braziers at either end of the long room, but Jon found himself shivering. The chill was always with him here. In a few years he would forget what it felt like to be warm.  The weariness came on him suddenly, as he donned the roughspun blacks that were their everyday wear. He sat on a bench, his fingers fumbling with the fastenings on his cloak. So cold, he thought, remembering the warm halls of Winterfell, where the hot waters ran through the walls like blood through a man’s body. There was scant warmth to be found in Castle Black; the walls were cold here, and the people colder.  No one had told him the Night’s Watch would be like this; no one except Tyrion Lannister. The dwarf had given him the truth on the road north, but by then it had been too late. Jon wondered if his father had known what the Wall would be like. He must have, he thought; that only made it hurt the worse.  Even his uncle had abandoned him in this cold place at the end of the world. Up here, the genial Benjen Stark he had known became a different person. He was First Ranger, and he spent his days and nights with Lord Commander Mormont and Maester Aemon and the other high officers, while Jon was given over to the less than tender charge of Ser Alliser Thorne.  Three days after their arrival, Jon had heard that Benjen Stark was to lead a half-dozen men on a ranging into the haunted forest. That night he sought out his uncle in the great timbered common hall and pleaded to go with him. Benjen refused him curtly.  This is not Winterfell,  he told him as he cut his meat with fork and dagger.  On the Wall, a man gets only what he earns. You’re no ranger, Jon, only a green boy with the smell of summer still on you.   Stupidly, Jon argued.  I’ll be fifteen on my name day,  he said.  Almost a man grown.   Benjen Stark frowned.  A boy you are, and a boy you’ll remain until Ser Alliser says you are fit to be a man of the Night’s Watch. If you thought your Stark blood would win you easy favors, you were wrong. We put aside our old families when we swear our vows. Your father will always have a place in my heart, but these are my brothers now.  He gestured with his dagger at the men around them, all the hard cold men in black.  Jon rose at dawn the next day to watch his uncle leave. One of his rangers, a big ugly man, sang a bawdy song as he saddled his garron, his breath steaming in the cold morning air. Ben Stark smiled at that, but he had no smile for his nephew.  How often must I tell you no, Jon? We’ll speak when I return.   As he watched his uncle lead his horse into the tunnel, Jon had remembered the things that Tyrion Lannister told him on the kingsroad, and in his mind’s eye he saw Ben Stark lying dead, his blood red on the snow. The thought made him sick. What was he becoming?  Afterward he sought out Ghost in the loneliness of his cell, and buried his face in his thick white fur.  If he must be alone, he would make solitude his armor. Castle Black had no godswood, only a small sept and a drunken septon, but Jon could not find it in him to pray to any gods, old or new. If they were real, he thought, they were as cruel and implacable as winter.  He missed his true brothers: little Rickon, bright eyes shining as he begged for a sweet; Robb, his rival and best friend and constant companion; Bran, stubborn and curious, always wanting to follow and join in whatever Jon and Robb were doing. He missed the girls too, even Sansa, who never called him anything but  my half brother  since she was old enough to understand what bastard meant. And Arya… he missed her even more than Robb, skinny little thing that she was, all scraped knees and tangled hair and torn clothes, so fierce and willful. Arya never seemed to fit, no more than he had… yet she could always make Jon smile. He would give anything to be with her now, to muss up her hair once more and watch her make a face, to hear her finish a sentence with him.   You broke my wrist, bastard boy.   Jon lifted his eyes at the sullen voice. Grenn loomed over him, thick of neck and red of face, with three of his friends behind him. He knew Todder, a short ugly boy with an unpleasant voice. The recruits all called him Toad. The other two were the ones Yoren had brought north with them, Jon remembered, rapers taken down in the Fingers."
}