{
  "id": "33c2a87d3f67f8093c1f0d26e754a32677974cd8",
  "text": " She seemed to be swelling with inexpressible anger -- but the swelling didn't stop. Her great red face started to expand, her tiny eyes bulged, and her mouth stretched too tightly for speech -- next second, several buttons had just burst from her tweed jacket and pinged off the walls -- she was inflating like a monstrous balloon, her stomach bursting free of her tweed waistband, each of her fingers blowing up like a salami --  \"MARGE!\" yelled Uncle Vernon and Aunt Petunia together as Aunt Marge's whole body began to rise off her chair toward the ceiling. She was entirely round, now, like a vast life buoy with piggy eyes, and her hands and feet stuck out weirdly as she drifted up into the air, making apoplectic popping noises. Ripper came skidding into the room, barking madly.  \"NOOOOOOO!\"  Uncle Vernon seized one of Marge's feet and tried to pull her down again, but was almost lifted from the floor himself. A second later, Ripper leapt forward and sank his teeth into Uncle Vernon's leg.  Harry tore from the dining room before anyone could stop him, heading for the cupboard under the stairs. The cupboard door burst magically open as he reached it. In seconds, he had heaved his trunk to the front door. He sprinted upstairs and threw himself under the bed, wrenching up the loose floorboard, and grabbed the pillowcase full of his books and birthday presents. He wriggled out, seized Hedwig's empty cage, and dashed back downstairs to his trunk, just as Uncle Vernon burst out of the dining room, his trouser leg in bloody tatters.  \"COME BACK IN HERE!\" he bellowed. \"COME BACK AND PUT HER RIGHT!\"  But a reckless rage had come over Harry. He kicked his trunk open, pulled out his wand, and pointed it at Uncle Vernon.  \"She deserved it,\" Harry said, breathing very fast. \"She deserved what she got. You keep away from me.\"  He fumbled behind him for the latch on the door.  \"I'm going,\" Harry said. \"I've had enough.\"  And in the next moment, he was out in the dark, quiet street, heaving his heavy trunk behind him, Hedwig's cage under his arm.  CHAPTER THREE  THE KNIGHT BUS  Harry was several streets away before he collapsed onto a low wall in Magnolia Crescent, panting from the effort of dragging his trunk. He sat quite still, anger still surging through him, listening to the frantic thumping of his heart.  But after ten minutes alone in the dark street, a new emotion overtook him: panic. Whichever way he looked at it, he had never been in a worse fix. He was stranded, quite alone, in the dark Muggle world, with absolutely nowhere to go. And the worst of it was, he had just done serious magic, which meant that he was almost certainly expelled from Hogwarts. He had broken the Decree for the Restriction of Underage Wizardry so badly, he was surprised Ministry of Magic representatives weren't swooping down on him where he sat.  Harry shivered and looked up and down Magnolia Crescent.  What, was going to happen to him? Would he be arrested, or would he simply be outlawed from the wizarding world? He thought of Ron and Hermione, and his heart sank even lower. Harry was sure that, criminal or not, Ron and Hermione would want to help him now, but they were both abroad, and with Hedwig gone, he had no means of contacting them.  He didn't have any Muggle money, either. There was a little wizard gold in the money bag at the bottom of his trunk, but the rest of the fortune his parents had left him was stored in a vault at Gringotts Wizarding Bank in London. He'd never be able to drag his trunk all the way to London. Unless...  He looked down at his wand, which he was still clutching in his hand. If he was already expelled (his heart was. now thumping painfully fast), a bit more magic couldn't hurt. He had the Invisibility Cloak he had inherited from his father -- what if he bewitched the trunk to make it feather-light, tied it to his broomstick, covered himself in the cloak, and flew to London? Then he could get the rest of his money out of his vault and... begin his life as an outcast. It was a horrible prospect, but he couldn't sit on this wall forever, or he'd find himself trying to explain to Muggle police why he was out in the dead of night with a trunkful of spellbooks and a broomstick.  Harry opened his trunk again and pushed the contents aside, looking for the Invisibility Cloak - but before he had found it, he straightened up suddenly, looking around him once more.  A funny prickling on the back of his neck had made Harry feel he was being watched, but the street appeared to be deserted, and no lights shone from any of the large square houses.  He bent over his trunk again, but almost immediately stood up once more, his hand clenched on his wand. He had sensed rather than heard it: someone or something was standing in the narrow gap between the garage and the fence behind him. Harry squinted at the black alleyway. If only it would move, then he'd know whether it was just a stray cat or -- something else.  \"Lumos,\" Harry muttered, and a light appeared at the end of his wand, almost dazzling him."
}