{
  "id": "33d72f4334e607c82dfd6afca64b95fd20c2b867",
  "text": "  Hermione's hand shook slightly as, for the third time, she raised it into the air. \"Yes?\" said Moody, looking at her. \"Avada Kedavra,\"  Hermione whispered. Several people looked uneasily around at her, including Ron. \"Ah,\" said Moody, another slight smile twisting his lopsided mouth. \"Yes, the last and worst. Avada Kedavra. .. the Killing Curse.\" He put his hand into the glass jar, and almost as though it knew what was coming, the third spider scuttled frantically around the bottom of the jar, trying to evade Moody's fingers, but he trapped it, and placed it upon the desktop.  It started to scuttle frantically across the wooden surface. Moody raised his wand, and Harry felt a sudden thrill of foreboding. \"Avada Kedavra!\"  Moody roared. There was a flash of blinding green light and a rushing sound, as though a vast, invisible something was soaring through the air - instantaneously the spider rolled over onto its back, unmarked, but unmistakably dead.  Several of the students stifled cries; Ron had thrown himself backward and almost toppled off his seat as the spider skidded toward him. Moody swept the dead spider off the desk onto the floor. \"Not nice,\" he said calmly.  \"Not pleasant.  And there's no countercurse.  There's no blocking it.  Only one known person has ever survived it, and he's sitting right in front of me.\" Harry felt his face redden as Moody's eyes (both of them) looked into his own.  He could feel everyone else looking around at him too.  Harry stared at the blank blackboard as though fascinated by it, but not really seeing it at all.... So that was how his parents had died. . . exactly like that spider.  Had they been unblemished and unmarked too?  Had they simply seen the flash of green light and heard the rush of speeding death, before life was wiped from their bodies? Harry had been picturing his parents' deaths over and over again for three years now, ever since he'd found out they had been murdered, ever since he'd found out what had happened that night:  Wormtail had betrayed his parents' whereabouts to Voldemort, who had come to find them at their cottage.  How Voldemort had killed Harry's father first.  How James Potter had tried to hold him off, while he shouted at his wife to take Harry and run. . . Voldemort had advanced on Lily Potter, told her to move aside so that he could kill Harry.. . how she had begged him to kill her instead, refused to stop shielding her son.. . and so Voldemort had murdered her too, before turning his wand on Harry. Harry knew these details because he had heard his parents' voices when he had fought the dementors last year - for that was the terrible power of the dementors: to force their victims to relive the worst memories of their lives, and drown, powerless, in their own despair. Moody was speaking again, from a great distance, it seemed to Harry.  With a massive effort, he pulled himself back to the present and listened to what Moody was saying. \"Avada Kedavra's a curse that needs a powerful bit of magic behind it - you could all get your wands out now and point them at me and say the words, and I doubt I'd get so much as a nosebleed.  But that doesn't matter.  I'm not here to teach you how to do it. \"Now, if there's no countercurse, why am I showing you?  Because you've got to know.  You've got to appreciate what the worst is.  You don't want to find yourself in a situation where you're facing it.  CONSTANT VIGILANCE!\"  he roared, and the whole class jumped again. \"Now. . . those three curses - Avada Kedavra, Imperius, and Cruciatus - are known as the Unforgivable Curses.  The use of any one of them on a fellow human being is enough to earn a life sentence in Azkaban.  That's what you're up against.  That's what I've got to teach you to fight.  You need preparing.  You need arming.  But most of all, you need to practice constant, never-ceasing vigilance.  Get out your quills. . . copy this down. . . .\" They spent the rest of the lesson taking notes on each of the Unforgivable Curses.  No one spoke until the bell rang - but when Moody had dismissed them and they had left the classroom, a torrent of talk burst forth.  Most people were discussing the curses in awed voices - \"Did you see it twitch?\" \"- and when he killed it - just like that!\" They were talking about the lesson, Harry thought, as though it had been some sort of spectacular show, but he hadn't found it very entertaining - and nor, it seemed, had Hermione. \"Hurry up,\" she said tensely to Harry and Ron. \"Not the ruddy library again?\" said Ron. \"No,\" said Hermione curtly, pointing up a side passage.  \"Neville.\"  Neville was standing alone, halfway up the passage, staring at the stone wall opposite him with the same horrified, wide-eyed look he had worn when Moody had demonstrated the Cruciatus Curse. \"Neville?\"  Hermione said gently. Neville looked around. \"Oh hello,\" he said, his voice much higher than usual.  \"Interesting lesson, wasn't it?  I wonder what's for dinner, I'm - I'm starving, aren't you?\" \"Neville, are you all right?\"  said Hermione."
}