{
  "id": "35ae2ea7a0b7cffc50b072663c9076c54a35fc73",
  "text": " He was a butcher’s boy and you killed him. Jory said you cut him near in half, and he never even had a sword.  She could feel them looking at her now, the women and the children and the men who called themselves the knights of the hollow hill.  Who’s this now?  someone asked.  The Hound answered.  Seven hells. The little sister. The brat who tossed Joff’s pretty sword in the river.  He gave a bark of laughter.  Don’t you know you’re dead?    No, you’re dead,  she threw back at him.  Harwin took her arm to draw her back as Lord Beric said,  The girl has named you a murderer. Do you deny killing this butcher’s boy, Mycah?   The big man shrugged.  I was Joffrey’s sworn shield. The butcher’s boy attacked a prince of the blood.    That’s a lie!  Arya squirmed in Harwin’s grip.  It was me. I hit Joffrey and threw Lion’s Paw in the river. Mycah just ran away, like I told him.    Did you see the boy attack Prince Joffrey?  Lord Beric Dondarrion asked the Hound.   I heard it from the royal lips. It’s not my place to question princes.  Clegane jerked his hands toward Arya.  This one’s own sister told the same tale when she stood before your precious Robert.    Sansa’s just a liar,  Arya said, furious at her sister all over again.  It wasn’t like she said. It wasn’t.   Thoros drew Lord Beric aside. The two men stood talking in low whispers while Arya seethed. They have to kill him. I prayed for him to die, hundreds and hundreds of times.  Beric Dondarrion turned back to the Hound.  You stand accused of murder, but no one here knows the truth or falsehood of the charge, so it is not for us to judge you. Only the Lord of Light may do that now. I sentence you to trial by battle.   The Hound frowned suspiciously, as if he did not trust his ears.  Are you a fool or a madman?    Neither. I am a just lord. Prove your innocence with a blade, and you shall be free to go.    No,  Arya cried, before Harwin covered her mouth. No, they can’t, he’ll go free. The Hound was deadly with a sword, everyone knew that. He’ll laugh at them, she thought.  And so he did, a long rasping laugh that echoed off the cave walls, a laugh choking with contempt.  So who will it be?  He looked at Lem Lemoncloak.  The brave man in the piss-yellow cloak? No? How about you, Huntsman? You’ve kicked dogs before, try me.  He saw Greenbeard.  You’re big enough, Tyrosh, step forward. Or do you mean to make the little girl fight me herself?  He laughed again.  Come on, who wants to die?   It’s me you’ll face,  said Lord Beric Dondarrion.  Arya remembered all the tales. He can’t be killed, she thought, hoping against hope. The Mad Huntsman sliced apart the ropes that bound Sandor Clegane’s hands together.  I’ll need sword and armor.  The Hound rubbed a torn wrist.   Your sword you shall have,  declared Lord Beric,  but your innocence must be your armor.   Clegane’s mouth twitched.  My innocence against your breastplate, is that the way of it?    Ned, help me remove my breastplate.   Arya got goosebumps when Lord Beric said her father’s name, but this Ned was only a boy, a fair-haired squire no more than ten or twelve. He stepped up quickly to undo the clasps that fastened the battered steel about the Marcher lord. The quilting beneath was rotten with age and sweat, and fell away when the metal was pulled loose. Gendry sucked in his breath.  Mother have mercy.   Lord Beric’s ribs were outlined starkly beneath his skin. A puckered crater scarred his breast just above his left nipple, and when he turned to call for sword and shield, Arya saw a matching scar upon his back. The lance went through him. The Hound had seen it too. Is he scared? Arya wanted him to be scared before he died, as scared as Mycah must have been.  Ned fetched Lord Beric his swordbelt and a long black surcoat. It was meant to be worn over armor, so it draped his body loosely, but across it crackled the forked purple lightning of his House. He unsheathed his sword and gave the belt back to his squire.  Thoros brought the Hound his swordbelt.  Does a dog have honor?  the priest asked.  Lest you think to cut your way free of here, or seize some child for a hostage… Anguy, Dennet, Kyle, feather him at the first sign of treachery.  Only when the three bowmen had notched their shafts did Thoros hand Clegane the belt.  The Hound ripped the sword free and threw away the scabbard. The Mad Huntsman gave him his oaken shield, all studded with iron and painted yellow, the three black dogs of Clegane emblazoned upon it. The boy Ned helped Lord Beric with his own shield, so hacked and battered that the purple lightning and the scatter of stars upon it had almost been obliterated.  But when the Hound made to step toward his foe, Thoros of Myr stopped him.  First we pray.  He turned toward the fire and lifted his arms.  Lord of Light, look down upon us.   All around the cave, the brotherhood without banners lifted their own voices in response.  Lord of Light, defend us.    Lord of Light, protect us in the darkness."
}