{
  "id": "35c31a0206d9af6af858b4bcd782c9d08d94a2f3",
  "text": " A dark-eyed serving wench brought him cheese and apples, but the innkeep had refused his coin.  It’s an honor to have a knight of the Kingsguard under my roof, ser,  the man had said.  It’s a tale I’ll tell my grandchildren.  Jaime looked at the chimney poking out of the weeds and wondered whether he had ever gotten those grandchildren. Did he tell them the Kingslayer once drank his ale and ate his cheese and apples, or was he ashamed to admit he fed the likes of me? Not that he would ever know; whoever burned the inn had likely killed the grandchildren as well.  He could feel his phantom fingers clench. When Steelshanks said that perhaps they should have a fire and a bit of food, Jaime shook his head.  I mislike this place. We’ll ride on.   By evenfall they had left the lake to follow a rutted track through a wood of oak and elm. Jaime’s stump was throbbing dully when Steelshanks decided to make camp. Qyburn had brought a skin of dreamwine, thankfully. While Walton set the watches, Jaime stretched out near the fire and propped a rolled-up bearskin against a stump as a pillow for his head. The wench would have told him he had to eat before he slept, to keep his strength up, but he was more tired than hungry. He closed his eyes, and hoped to dream of Cersei. The fever dreams were all so vivid…  Naked and alone he stood, surrounded by enemies, with stone walls all around him pressing close. The Rock, he knew. He could feel the immense weight of it above his head. He was home. He was home and whole.  He held his right hand up and flexed his fingers to feel the strength in them. It felt as good as sex. As good as swordplay. Four fingers and a thumb. He had dreamed that he was maimed, but it wasn’t so. Relief made him dizzy. My hand, my good hand. Nothing could hurt him so long as he was whole.  Around him stood a dozen tall dark figures in cowled robes that hid their faces. In their hands were spears.  Who are you?  he demanded of them.  What business do you have in Casterly Rock?   They gave no answer, only prodded him with the points of their spears. He had no choice but to descend. Down a twisting passageway he went, narrow steps carved from the living rock, down and down. I must go up, he told himself. Up, not down. Why am I going down? Below the earth his doom awaited, he knew with the certainty of dream; something dark and terrible lurked there, something that wanted him. Jaime tried to halt, but their spears prodded him on. If only I had my sword, nothing could harm me.  The steps ended abruptly on echoing darkness. Jaime had the sense of vast space before him. He jerked to a halt, teetering on the edge of nothingness. A spearpoint jabbed at the small of the back, shoving him into the abyss. He shouted, but the fall was short. He landed on his hands and knees, upon soft sand and shallow water. There were watery caverns deep below Casterly Rock, but this one was strange to him.  What place is this?    Your place.  The voice echoed; it was a hundred voices, a thousand, the voices of all the Lannisters since Lann the Clever, who’d lived at the dawn of days. But most of all it was his father’s voice, and beside Lord Tywin stood his sister, pale and beautiful, a torch burning in her hand. Joffrey was there as well, the son they’d made together, and behind them a dozen more dark shapes with golden hair.   Sister, why has Father brought us here?    Us? This is your place, Brother. This is your darkness.  Her torch was the only light in the cavern. Her torch was the only light in the world. She turned to go.   Stay with me,  Jaime pleaded.  Don’t leave me here alone.  But they were leaving.  Don’t leave me in the dark!  Something terrible lived down here.  Give me a sword, at least.    I gave you a sword,  Lord Tywin said.  It was at his feet. Jaime groped under the water until his hand closed upon the hilt. Nothing can hurt me so long as I have a sword. As he raised the sword a finger of pale flame flickered at the point and crept up along the edge, stopping a hand’s breath from the hilt. The fire took on the color of the steel itself so it burned with a silvery-blue light, and the gloom pulled back. Crouching, listening, Jaime moved in a circle, ready for anything that might come out of the darkness. The water flowed into his boots, ankle deep and bitterly cold. Beware the water, he told himself. There may be creatures living in it, hidden deeps…  From behind came a great splash. Jaime whirled toward the sound… but the faint light revealed only Brienne of Tarth, her hands bound in heavy chains.  I swore to keep you safe,  the wench said stubbornly.  I swore an oath.  Naked, she raised her hands to Jaime.  Ser. Please. If you would be so good.   The steel links parted like silk.  A sword,  Brienne begged, and there it was, scabbard, belt, and all. She buckled it around her thick waist. The light was so dim that Jaime could scarcely see her, though they stood a scant few feet apart. In this light she could almost be a beauty, he thought."
}