{
  "id": "37e53bd0279f30764b8c3fae495ae57969b45ce9",
  "text": "    Perhaps. Or not. Lord Balon might still have chanced war. The last time he reached for a crown, it cost him two sons. He might have thought it a bargain to lose only one this time.  She touched his arm.  What happened with the Freys, after you wed?   Robb shook his head.  With Ser Stevron, I might have been able to make amends, but Ser Ryman is dull-witted as a stone, and Black Walder… that one was not named for the color of his beard, I promise you. He went so far as to say that his sisters would not be loath to wed a widower. I would have killed him for that if Jeyne had not begged me to be merciful.    You have done House Frey a grievous insult, Robb.    I never meant to. Ser Stevron died for me, and Olyvar was as loyal a squire as any king could want. He asked to stay with me, but Ser Ryman took him with the rest. All their strength. The Greatjon urged me to attack them…    Fighting your own in the midst of your enemies?  she said.  It would have been the end of you.    Yes. I thought perhaps we could arrange other matches for Lord Walder’s daughters. Ser Wendel Manderly has offered to take one, and the Greatjon tells me his uncles wish to wed again. If Lord Walder will be reasonable—    He is not reasonable,  said Catelyn.  He is proud, and prickly to a fault. You know that. He wanted to be grandfather to a king. You will not appease him with the offer of two hoary old brigands and the second son of the fattest man in the Seven Kingdoms. Not only have you broken your oath, but you’ve slighted the honor of the Twins by choosing a bride from a lesser house.   Robb bristled at that.  The Westerlings are better blood than the Freys. They’re an ancient line, descended from the First Men. The Kings of the Rock sometimes wed Westerlings before the Conquest, and there was another Jeyne Westerling who was queen to King Maegor three hundred years ago.    All of which will only salt Lord Walder’s wounds. It has always rankled him that older houses look down on the Freys as upstarts. This insult is not the first he’s borne, to hear him tell it. Jon Arryn was disinclined to foster his grandsons, and my father refused the offer of one of his daughters for Edmure.  She inclined her head toward her brother as he rejoined them.   Your Grace,  Brynden Blackflsh said,  perhaps we had best continue this in private.    Yes.  Robb sounded tired.  I would kill for a cup of wine. The audience chamber, I think.   As they started up the steps, Catelyn asked the question that had been troubling her since she entered the hall.  Robb, where is Grey Wind?    In the yard, with a haunch of mutton. I told the kennelmaster to see that he was fed.    You always kept him with you before.    A hall is no place for a wolf. He gets restless, you’ve seen. Growling and snapping. I should never have taken him into battle with me. He’s killed too many men to fear them now. Jeyne’s anxious around him, and he terrifies her mother.   And there’s the heart of it, Catelyn thought.  He is part of you, Robb. To fear him is to fear you.    I am not a wolf, no matter what they call me.  Robb sounded cross.  Grey Wind killed a man at the Crag, another at Ashemark, and six or seven at Oxcross. If you had seen—    I saw Bran’s wolf tear out a man’s throat at Winterfell,  she said sharply,  and loved him for it.    That’s different. The man at the Crag was a knight Jeyne had known all her life. You can’t blame her for being afraid. Grey Wind doesn’t like her uncle either. He bares his teeth every time Ser Rolph comes near him.   A chill went through her.  Send Ser Rolph away. At once.    Where? Back to the Crag, so the Lannisters can mount his head on a spike? Jeyne loves him. He’s her uncle, and a fair knight besides. I need more men like Rolph Spicer, not fewer. I am not going to banish him just because my wolf doesn’t seem to like the way he smells.    Robb.  She stopped and held his arm.  I told you once to keep Theon Greyjoy close, and you did not listen. Listen now. Send this man away. I am not saying you must banish him. Find some task that requires a man of courage, some honorable duty, what it is matters not… but do not keep him near you.   He frowned.  Should I have Grey Wind sniff all my knights? There might be others whose smell he mislikes.    Any man Grey Wind mislikes is a man I do not want close to you. These wolves are more than wolves, Robb. You must know that. I think perhaps the gods sent them to us. Your father’s gods, the old gods of the north. Five wolf pups, Robb, five for five Stark children.    Six,  said Robb.  There was a wolf for Jon as well. I found them, remember? I know how many there were and where they came from. I used to think the same as you, that the wolves were our guardians, our protectors, until…    Until?  she prompted.  Robb’s mouth tightened.  …Until they told me that Theon had murdered Bran and Rickon. Small good their wolves did them. I am no longer a boy, Mother. I’m a king, and I can protect myself.  He sighed."
}