{
  "id": "383ae9659dd439c9eda4f96cd4a2e17fb26ea3a1",
  "text": "  \"I shall return when we are ready for you,\" said Professor McGonagall. \"Please wait quietly.\"  She left the chamber. Harry swallowed.  \"How exactly do they sort us into houses?\" he asked Ron.  \"Some sort of test, I think. Fred said it hurts a lot, but I think he was joking.\"  Harry's heart gave a horrible jolt. A test? In front of the whole school? But he didn't know any magic yet -- what on earth would he have to do? He hadn't expected something like this the moment they arrived. He looked around anxiously and saw that everyone else looked terrified, too. No one was talking much except Hermione Granger, who was whispering very fast about all the spells she'd learned and wondering which one she'd need. Harry tried hard not to listen to her. He'd never been more nervous, never, not even when he'd had to take a school report home to the Dursleys saying that he'd somehow turned his teacher's wig blue. He kept his eyes fixed on the door. Any second now, Professor McGonagall would come back and lead him to his doom.  Then something happened that made him jump about a foot in the air -- several people behind him screamed.  \"What the --?\"  He gasped. So did the people around him. About twenty ghosts had just streamed through the back wall. Pearly-white and slightly transparent, they glided across the room talking to one another and hardly glancing at the first years. They seemed to be arguing. What looked like a fat little monk was saying: \"Forgive and forget, I say, we ought to give him a second chance --\"  \"My dear Friar, haven't we given Peeves all the chances he deserves? He gives us all a bad name and you know, he's not really even a ghost -- I say, what are you all doing here?\"  A ghost wearing a ruff and tights had suddenly noticed the first years.  Nobody answered.  \"New students!\" said the Fat Friar, smiling around at them. \"About to be Sorted, I suppose?\"  A few people nodded mutely.  \"Hope to see you in Hufflepuff!\" said the Friar. \"My old house, you know.\"  \"Move along now,\" said a sharp voice. \"The Sorting Ceremony's about to start.\"  Professor McGonagall had returned. One by one, the ghosts floated away through the opposite wall.  \"Now, form a line,\" Professor McGonagall told the first years, \"and follow me.\"  Feeling oddly as though his legs had turned to lead, Harry got into line behind a boy with sandy hair, with Ron behind him, and they walked out of the chamber, back across the hall, and through a pair of double doors into the Great Hall.  Harry had never even imagined such a strange and splendid place. It was lit by thousands and thousands of candles that were floating in midair over four long tables, where the rest of the students were sitting. These tables were laid with glittering golden plates and goblets. At the top of the hall was another long table where the teachers were sitting. Professor McGonagall led the first years up here, so that they came to a halt in a line facing the other students, with the teachers behind them. The hundreds of faces staring at them looked like pale lanterns in the flickering candlelight. Dotted here and there among the students, the ghosts shone misty silver. Mainly to avoid all the staring eyes, Harry looked upward and saw a velvety black ceiling dotted with stars. He heard  Hermione whisper, \"Its bewitched to look like the sky outside. I read about it in Hogwarts, A History.\"  It was hard to believe there was a ceiling there at all, and that the Great Hall didn't simply open on to the heavens.  Harry quickly looked down again as Professor McGonagall silently placed a four-legged stool in front of the first years. On top of the stool she put a pointed wizard's hat. This hat was patched and frayed and extremely dirty. Aunt Petunia wouldn't have let it in the house.  Maybe they had to try and get a rabbit out of it, Harry thought wildly, that seemed the sort of thing -- noticing that everyone in the hall was now staring at the hat, he stared at it, too. For a few seconds, there was complete silence. Then the hat twitched. A rip near the brim opened wide like a mouth -- and the hat began to sing:  \"Oh, you may not think I'm pretty,  But don't judge on what you see,  I'll eat myself if you can find  A smarter hat than me.  You can keep your bowlers black,  Your top hats sleek and tall,  For I'm the Hogwarts Sorting Hat  And I can cap them all.  There's nothing hidden in your head  The Sorting Hat can't see,  So try me on and I will tell you  Where you ought to be.  You might belong in Gryffindor,  Where dwell the brave at heart,  Their daring, nerve, and chivalry Set Gryffindors apart;  You might belong in Hufflepuff,  Where they are just and loyal,  Those patient Hufflepuffis are true And unafraid of toil;  Or yet in wise old Ravenclaw,  if you've a ready mind,  Where those of wit and learning,  Will always find their kind;  Or perhaps in Slytherin  You'll make your real friends,  Those cunning folk use any means  To achieve their ends.  So put me on! Don't be afraid!  And don't get in a flap!  You're in safe hands (though I have none)  For I'm a Thinking Cap!\"  The whole hall burst into applause as the hat finished its song."
}