{
  "id": "39805c43810ed20b9c808963398ee69f88fbe7fe",
  "text": " The walls  echoed  to  the  clap,  snap!  and  the  crush,  smash!  and  to  the  ugly  laughter  of  their  ho,  ho! my  lad! The  general meaning  of  the song was only too plain; for now the goblins took out whips and whipped them  with  a  swish,  smack!,  and set them running as fast as they could in front of them;  and  more  than  one  of  the  dwarves  were  already  yammering  and  bleating  like  anything, when they stumbled into a big cavern.  It was  lit by a great red fire  in  the middle, and by  torches along  the walls, and  it  was  full  of  goblins.  They  all  laughed  and  stamped  and  clapped  their  hands,  when  the  dwarves  (with  poor  little  Bilbo  at  the  back  and  nearest  to  the  whips)  came  running  in,  while  the  goblin-drivers  whooped  and  cracked  their  whips  behind. The  ponies were already  there huddled  in a corner; and  there were all  the  baggages  and  packages  lying  broken  open,  and  being  rummaged  by  goblins,  and  smelt by goblins, and fingered by goblins, and quarreled over by goblins.  I  am  afraid  that  was  the  last  they  ever  saw  of  those  excellent  little  ponies,  including  a  jolly  sturdy  little  white  fellow  that  Elrond  had  lent  to  Gandalf,  since  his  horse  was  not  suitable  for  the  mountain-paths.  For  goblins  eat  horses  and  ponies  and  donkeys  (and  other much more  dreadful  things),  and  they are always  hungry.  Just  now  however  the  prisoners  were  thinking  only  of  themselves.  The  goblins  chained  their  hands  behind  their  backs  and  linked  them  all  together  in  a  line  and dragged  them  to  the  far  end of  the  cavern with  little Bilbo  tugging  at the  end of the row.   There in the shadows on a large flat stone sat a tremendous goblin with a huge  head,  and  armed  goblins were  standing  round  him  carrying  the  axes  and  the  bent  swords that they use. Now goblins are cruel, wicked, and bad-hearted. They make  no beautiful things, but they make many clever ones. They can tunnel and mine as  well as any but the most skilled dwarves, when they take the trouble, though they  are  usually  untidy  and  dirty.  Hammers,  axes,  swords,  daggers,  pickaxes,  tongs,  and  also  instruments of  torture,  they make very well, or get other people  to make  to  their design, prisoners and  slaves  that have  to work  till  they die  for want of air   ####-and light. It is not unlikely that they invented some of the machines that have since  troubled  the  world,  especially  the  ingenious  devices  for  killing  large  numbers  of  people at once, for wheels and engines and explosions always delighted them, and  also  not  working  with  their  own  hands  more  than  they  could  help;  but  in  those  days  and  those  wild  parts  they had not  advanced  (as  it  is  called)  so  far. They did  not  hate  dwarves  especially,  no  more  than  they  hated  everybody  and  everything,  and  particularly  the  orderly  and  prosperous;  in  some  parts  wicked  dwarves  had  even  made  alliances  with  them.  But  they  had  a  special  grudge  against  Thorin's  people,  because  of  the war which  you  have  heard mentioned,  but which  does  not  come  into  this  tale; and anyway goblins don't care who  they catch, as  long as  it  is  done smart and secret, and the prisoners are not able to defend themselves.  \"Who are these miserable persons?\" said the Great Goblin.  \"Dwarves, and this!\" said one of the drivers, pulling at Bilbo's chain so that he  fell forward onto his knees.  \"We found them sheltering in our Front Porch.\"  \"What do you mean by it?\" said the Great Goblin turning to Thorin. \"Up to no  good, I'll warrant! Spying on the private business of my people, I guess! Thieves, I  shouldn't  be  surprised  to  learn!  Murderers  and  friends  of  Elves,  not  unlikely!  Come! What have you got to say?\"  \"Thorin  the  dwarf  at  your  service!\"  he  replied-it was merely a polite nothing.  \"Of the things which you suspect and imagine we had no idea at all. We sheltered  from  a  storm  in what  seemed  a  convenient  cave  and  unused;  nothing was  further  from  our  thoughts  than  inconveniencing goblins  in any way whatever.\" That was  true enough!  \"Urn!\"  said  the Great Goblin.  \"So you  say! Might  I  ask what you were doing  up in the mountains at all, and where you were coming from, and where you were  going to? In fact I should like to know all about you. Not that it willdo you much  good,  Thorin  Oakenshield,  I  know  too  much  about  your  folk  already;  but  let's  have the truth, or I will prepare something particularly uncomfortable for you!\"  \"We were on a journey to visit our relatives, our nephews and nieces, and first,  second, and third cousins, and the other descendants of our grandfathers, who live  on  the  East  side  of  these  truly  hospitable  mountains,\"  said  Thorin,  not  quite  knowing  what  to  say  all  at  once  in  a  moment,  when  obviously  the  exact  truth  would not do at all."
}