{
  "id": "3e448c5ec03649f7302d603a3055f51c40ba9446",
  "text": " Qhorin’s helm had been won by the short homely man called Longspear Ryk, but it fit poorly on his narrow head, so he’d given that to Ygritte as well. And Rattleshirt had Qhorin’s bones in his bag, along with the bloody head of Ebben, who set out with Jon to scout the Skirling Pass.Dead, all dead but me, and I am dead to the world.  Ygritte rode just behind him. In front was Longspear Ryk. The Lord of Bones had made the two of them his guards.  If the crow flies, I’ll boil your bones as well,  he warned them when they had set out, smiling through the crooked teeth of the giant’s skull he wore for a helm.  Ygritte hooted at him.  You want to guard him? If you want us to do it, leave us be and we’ll do it.   These are a free folk indeed, Jon saw. Rattleshirt might lead them, but none of them were shy in talking back to him.  The wildling leader fixed him with an unfriendly stare.  Might be you fooled these others, crow, but don’t think you’ll be fooling Mance. He’ll take one look a’ you and know you’re false. And when he does, I’ll make a cloak o’ your wolf there, and open your soft boy’s belly and sew a weasel up inside.   Jon’s sword hand opened and closed, flexing the burned fingers beneath the glove, but Longspear Ryk only laughed.  And where would you find a weasel in the snow?   That first night, after a long day ahorse, they made camp in a shallow stone bowl atop a nameless mountain, huddling close to the fire while the snow began to fall. Jon watched the flakes melt as they drifted over the flames. Despite his layers of wool and fur and leather, he’d felt cold to the bone. Ygritte sat beside him after she had eaten, her hood pulled up and her hands tucked into her sleeves for warmth.  When Mance hears how you did for Halfhand, he’ll take you quick enough,  she told him.   Take me for what?   The girl laughed scornfully.  For one o’ us. D’ya think you’re the first crow ever flew down off the Wall? In your hearts you all want to fly free.    And when I’m free,  he said slowly,  will I be free to go?    Sure you will.  She had a warm smile, despite her crooked teeth.  And we’ll be free to kill you. It’s dangerous being free, but most come to like the taste o’ it.  She put her gloved hand on his leg, just above the knee.  You’ll see.   I will, thought Jon. I will see, and hear, and learn, and when I have I will carry the word back to the Wall. The wildlings had taken him for an oathbreaker, but in his heart he was still a man of the Night’s Watch, doing the last duty that Qhorin Halfhand had laid on him. Before I killed him.  At the bottom of the slope they came upon a little stream flowing down from the foothills to join the Milkwater. It looked all stones and glass, though they could hear the sound of water running beneath the frozen surface. Rattleshirt led them across, shattering the thin crust of ice.  Mance Rayder’s outriders closed in as they emerged. Jon took their measure with a glance: eight riders, men and women both, clad in fur and boiled leather, with here and there a helm or bit of mail. They were armed with spears and fire-hardened lances, all but their leader, a fleshy blond man with watery eyes who bore a great curved scythe of sharpened steel. The Weeper, he knew at once. The black brothers told tales of this one. Like Rattleshirt and Harma Dogshead and Alfyn Crowkiller, he was a known raider.   The Lord o’ Bones,  the Weeper said when he saw them. He eyed Jon and his wolf.  Who’s this, then?    A crow come over,  said Rattleshirt, who preferred to be called the Lord of Bones, for the clattering armor he wore.  He was afraid I’d take his bones as well as Halfhand’s.  He shook his sack of trophies at the other wildlings.   He slew Qhorin Halfhand,  said Longspear Ryk.  Him and that wolf o’ his.    And did for Orell too,  said Rattleshirt.   The lad’s a warg, or close enough,  put in Ragwyle, the big spearwife.  His wolf took a piece o’ Halfhand’s leg.   The Weeper’s red rheumy eyes gave Jon another look.  Aye? Well, he has a wolfish cast to him, now as I look close. Bring him to Mance, might be he’ll keep him.  He wheeled his horse around and galloped off, his riders hard behind him.  The wind was blowing wet and heavy as they crossed the valley of the Milkwater and rode singlefile through the river camp. Ghost kept close to Jon, but the scent of him went before them like a herald, and soon there were wildling dogs all around them, growling and barking. Lenyl screamed at them to be quiet, but they paid him no heed.  They don’t much care for that beast o’ yours,  Longspear Ryk said to Jon.   They’re dogs and he’s a wolf,  said Jon.  They know he’s not their kind.  No more than I am yours. But he had his duty to be mindful of, the task Qhorin Halfhand had laid upon him as they shared that final fire—to play the part of turncloak, and find whatever it was that the wildlings had been seeking in the bleak cold wilderness of the Frostfangs.  Some power,  Qhorin had named it to the Old Bear, but he had died before learning what it was, or whether Mance Rayder had found it with his digging."
}