{
  "id": "431faa7f7f94ee944a0ae6939f5c1b7c30c5044a",
  "text": ".. bless them,\" he added fondly, leading the way toward the nearest entrance, which was already surrounded by a swarm of shouting witches and wizards. \"Prime seats!\"  said the Ministry witch at the entrance when she checked their tickets. \"Top Box!  Straight upstairs, Arthur, and as high as you can go.\" The stairs into the stadium were carpeted in rich purple.  They clambered upward with the rest of the crowd, which slowly filtered away through doors into the stands to their left and right.  Mr. Weasley's party kept climbing, and at last they reached the top of the staircase and found themselves in a small box, set at the highest point of the stadium and situated exactly halfway between the golden goal posts.  About twenty purple-and-gilt chairs stood in two rows here, and Harry, filing into the front seats with the Weasleys, looked down upon a scene the likes of which he could never have imagined. A hundred thousand witches and wizards were taking their places in the seats, which rose in levels around the long oval field.  Everything was suffused with a mysterious golden light, which seemed to come from the stadium itself.  The field looked smooth as velvet from their lofty position.  At either end of the field stood three goal hoops, fifty feet high; right opposite them, almost at Harry's eye level, was a gigantic blackboard.  Gold writing kept dashing across it as though an invisible giant's hand were scrawling upon the blackboard and then wiping it off again; watching it, Harry saw that it was flashing advertisements across the field.  The Bluebottle:  A Broom for All the Family - safe, reliable, and with Built-in Anti-Burgler Buzzer ... Mrs. Shower's All Purpose Magical Mess Remover: No Pain, No Stain! ... Gladrags Wizardwear - London, Paris, Hogsmeade...  Harry tore his eyes away from the sign and looked over his shoulder to see who else was sharing the box with them.  So far it was empty, except for a tiny creature sitting in the second from last seat at the end of the row behind them. The creature, whose legs were so short they stuck out in front of it on the chair, was wearing a tea towel draped like a toga, and it had its face hidden in its hands.  Yet those long, batlike ears were oddly familiar.... \"Dobby?\"  said Harry incredulously. The tiny creature looked up and stretched its fingers, revealing enormous brown eyes and a nose the exact size and shape of a large tomato.  It wasn't Dobby - it was, however, unmistakably a house-elf, as Harry's friend Dobby had been.  Harry had set Dobby free from his old owners, the Malfoy family. \"Did sir just call me Dobby?\"  squeaked the elf curiously from between its fingers.  Its voice was higher even than Dobby's had been, a teeny, quivering squeak of a voice, and Harry suspected though it was very hard to tell with a house-elf - that this one might just be female. Ron and Hermione spun around in their seats to look.  Though they had heard a lot about Dobby from Harry, they had never actually met him.  Even Mr. Weasley looked around in interest. \"Sorry,\" Harry told the elf, \"I just thought you were someone I knew.\" \"But I knows Dobby too, sir!\"  squeaked the elf.  She was shielding her face, as though blinded by light, though the Top Box was not brightly lit.  \"My name is Winky, sir - and you, sir -\" Her dark brown eyes widened to the size of side plates as they rested upon Harry's scar. \"You is surely Harry Potter!\" \"Yeah, I am,\" said Harry. \"But Dobby talks of you all the time, sir!\" s he said, lowering her hands very slightly and looking awestruck. \"How is he?\"  said Harry.  \"How's freedom suiting him?\" \"Ah, sir,\" said Winky, shaking her head, \"ah sir, meaning no disrespect, sir, but I is not sure you did Dobby a favor, sir, when you is setting him free.\" \"Why?\" said Harry, taken aback.  \"What's wrong with him?\" \"Freedom is going to Dobby's head, sir, \" said Winky sadly.  \"Ideas above his station, sir.  Can't get another position, sir.\" \"Why not?\" said Harry. Winky lowered her voice by a half-octave and whispered, \"He is wanting paying for his work, sir.\" \"Paying?\" said Harry blankly.  \"Well - why shouldn't he be paid?\" Winky looked quite horrified at the idea and closed her fingers slightly so that her face was half-hidden again. \"House-elves is not paid, sir!\"  she said in a muffled squeak.  \"No, no, no.  I says to Dobby, I says, go find yourself a nice family and settle down, Dobby.  He is getting up to all sorts of high jinks, sir, what is unbecoming to a house-elf.  You goes racketing around like this, Dobby, I says, and next thing I hear you's up in front of the Department for the Regulation and Control of Magical Creatures, like some common goblin.\" \"Well, it's about time he had a bit of fun,\" said Harry. \"House-elves is not supposed to have fun, Harry Potter,\" said Winky firmly, from behind her hands.  \"House-elves does what they is told.  I is not liking heights at all, Harry Potter\" - she glanced toward the edge of the box and gulped - \"but my master sends me to the Top Box and I comes, sir."
}