{
  "id": "45ecd88befe835f4c4ca1560146226f4ba4df0a9",
  "text": " Long dark hair and blue eyes you could drown in, and he had. So long ago… What a wretched fool you are, dwarf.  Does she come from your home lands, this girl?    Her blood is the blood of summer, my lord, but my daughter was born here in King’s Landing.  His surprise must have shown on his face, for Chataya continued,  My people hold that there is no shame to be found in the pillow house. In the Summer Isles, those who are skilled at giving pleasure are greatly esteemed. Many highborn youths and maidens serve for a few years after their flowerings, to honor the gods.    What do the gods have to do with it?    The gods made our bodies as well as our souls, is it not so? They give us voices, so we might worship them with song. They give us hands, so we might build them temples. And they give us desire, so we might mate and worship them in that way.    Remind me to tell the High Septon,  said Tyrion.  If I could pray with my cock, I’d be much more religious.  He waved a hand.  I will gladly accept your suggestion.    I shall summon my daughter. Come.   The girl met him at the foot of the stairs. Taller than Shae, though not so tall as her mother, she had to kneel before Tyrion could kiss her.  My name is Alayaya,  she said, with only the slightest hint of her mother’s accent.  Come, my lord.  She took him by the hand and drew him up two flights of stairs, then down a long hall. Gasps and shrieks of pleasure were coming from behind one of the closed doors, giggles and whispers from another. Tyrion’s cock pressed against the lacings of his breeches. This could be humiliating, he thought as he followed Alayaya up another stair to the turret room. There was only one door. She led him through and closed it. Within the room was a great canopied bed, a tall wardrobe decorated with erotic carvings, and a narrow window of leaded glass in a pattern of red and yellow diamonds.   You are very beautiful, Alayaya,  Tyrion told her when they were alone.  From head to heels, every part of you is lovely. Yet just now the part that interests me most is your tongue.    My lord will find my tongue well schooled. When I was a girl I learned when to use it, and when not.    That pleases me.  Tyrion smiled.  So what shall we do now? Perchance you have some suggestion?    Yes,  she said.  If my lord will open the wardrobe, he will find what he seeks.   Tyrion kissed her hand, and climbed inside the empty wardrobe. Alayaya closed it after him. He groped for the back panel, felt it slide under his fingers, and pushed it all the way aside. The hollow space behind the walls was pitch-black, but he fumbled until he felt metal. His hand closed around the rung of a ladder. He found a lower rung with his foot, and started down. Well below street level, the shaft opened onto a slanting earthen tunnel, where he found Varys waiting with candle in hand.  Varys did not look at all like himself. A scarred face and a stubble of dark beard showed under his spiked steel cap, and he wore mail over boiled leather, dirk and shortsword at his belt.  Was Chataya’s to your satisfaction, my lord?    Almost too much so,  admitted Tyrion.  You’re certain this woman can be relied on?    I am certain of nothing in this fickle and treacherous world, my lord. Chataya has no cause to love the queen, though, and she knows that she has you to thank for ridding her of Allar Deem. Shall we go?  He started down the tunnel.  Even his walk is different, Tyrion observed. The scent of sour wine and garlic clung to Varys instead of lavender.  I like this new garb of yours,  he offered as they went.   The work I do does not permit me to travel the streets amid a column of knights. So when I leave the castle, I adopt more suitable guises, and thus live to serve you longer.    Leather becomes you. You ought to come like this to our next council session.    Your sister would not approve, my lord.    My sister would soil her smallclothes.  He smiled in the dark.  I saw no signs of any of her spies skulking after me.    I am pleased to hear it, my lord. Some of your sister’s hirelings are mine as well, unbeknownst to her. I should hate to think they had grown so sloppy as to be seen.    Well, I’d hate to think I was climbing through wardrobes and suffering the pangs of frustrated lust all for naught.    Scarcely for naught,  Varys assured him.  They know you are here. Whether any will be bold enough to enter Chataya’s in the guise of patrons I cannot say, but I find it best to err on the side of caution.    How is it a brothel happens to have a secret entrance?    The tunnel was dug for another King’s Hand, whose honor would not allow him to enter such a house openly. Chataya has closely guarded the knowledge of its existence.    And yet you knew of it.    Little birds fly through many a dark tunnel. Careful, the steps are steep.   They emerged through a trap at the back of a stable, having come perhaps a distance of three blocks under Rhaenys’s Hill. A horse whickered in his stall when Tyrion let the door slam shut."
}