{
  "id": "4720d1644f75b249d98b1c8e038cf16d2406a472",
  "text": " The others obeyed without question… except for the Hound, but Joff never asked the Hound to punish her. He used the other five for that.  Ser Arys had light brown hair and a face that was not unpleasant to look upon. Today he made quite the dashing figure, with his white silk cloak fastened at the shoulder by a golden leaf, and a spreading oak tree worked upon the breast of his tunic in shining gold thread.  Who do you think will win the day’s honors?  Sansa asked as they descended the steps arm in arm.   I will,  Ser Arys answered, smiling.  Yet I fear the triumph will have no savor. This will be a small field, and poor. No more than two score will enter the lists, including squires and freeriders. There is small honor in unhorsing green boys.   The last tourney had been different, Sansa reflected. King Robert had staged it in her father’s honor. High lords and fabled champions had come from all over the realm to compete, and the whole city had turned out to watch. She remembered the splendor of it: the field of pavilions along the river with a knight’s shield hung before each door, the long rows of silken pennants waving in the wind, the gleam of sunlight on bright steel and gilded spurs. The days had rung to the sounds of trumpets and pounding hooves, and the nights had been full of feasts and song. Those had been the most magical days of her life, but they seemed a memory from another age now. Robert Baratheon was dead, and her father as well, beheaded for a traitor on the steps of the Great Sept of Baelor. Now there were three kings in the land, and war raged beyond the Trident while the city filled with desperate men. Small wonder that they had to hold Joff’s tournament behind the thick stone walls of the Red Keep.   Will the queen attend, do you think?  Sansa always felt safer when Cersei was there to restrain her son.   I fear not, my lady. The council is meeting, some urgent business.  Ser Arys dropped his voice.  Lord Tywin has gone to ground at Harrenhal instead of bringing his army to the city as the queen commanded. Her Grace is furious.  He fell silent as a column of Lannister guardsmen marched past, in crimson cloaks and lion-crested helms. Ser Arys was fond of gossip, but only when he was certain that no one was listening.  The carpenters had erected a gallery and lists in the outer bailey. It was a poor thing indeed, and the meager throng that had gathered to watch filled but half the seats. Most of the spectators were guardsmen in the gold cloaks of the City Watch or the crimson of House Lannister; of lords and ladies there were but a paltry few, the handful that remained at court. Grey-faced Lord Gyles Rosby was coughing into a square of pink silk. Lady Tanda was bracketed by her daughters, placid dull Lollys and acid-tongued Falyse. Ebon-skinned Jalabhar Xho was an exile who had no other refuge, Lady Ermesande a babe seated on her wet nurse’s lap. The talk was she would soon be wed to one of the queen’s cousins, so the Lannisters might claim her lands.  The king was shaded beneath a crimson canopy, one leg thrown negligently over the carved wooden arm of his chair. Princess Myrcella and Prince Tommen sat behind him. In the back of the royal box, Sandor Clegane stood at guard, his hands resting on his swordbelt. The white cloak of the Kingsguard was draped over his broad shoulders and fastened with a jeweled brooch, the snowy cloth looking somehow unnatural against his brown roughspun tunic and studded leather jerkin.  Lady Sansa,  the Hound announced curtly when he saw her. His voice was as rough as the sound of a saw on wood. The burn scars on his face and throat made one side of his mouth twitch when he spoke.  Princess Myrcella nodded a shy greeting at the sound of Sansa’s name, but plump little Prince Tommen jumped up eagerly.  Sansa, did you hear? I’m to ride in the tourney today. Mother said I could.  Tommen was all of eight. He reminded her of her own little brother, Bran. They were of an age. Bran was back at Winterfell, a cripple, yet safe.  Sansa would have given anything to be with him.  I fear for the life of your foeman,  she told Tommen solemnly.   His foeman will be stuffed with straw,  Joff said as he rose. The king was clad in a gilded breastplate with a roaring lion engraved upon its chest, as if he expected the war to engulf them at any moment. He was thirteen today, and tall for his age, with the green eyes and golden hair of the Lannisters.   Your Grace,  she said, dipping in a curtsy.  Ser Arys bowed.  Pray pardon me, Your Grace. I must equip myself for the lists.   Joffrey waved a curt dismissal while he studied Sansa from head to heels.  I’m pleased you wore my stones.   So the king had decided to play the gallant today. Sansa was relieved.  I thank you for them… and for your tender words. I pray you a lucky name day, Your Grace.    Sit,  Joff commanded, gesturing her to the empty seat beside his own.  Have you heard? The Beggar King is dead.    Who?  For a moment Sansa was afraid he meant Robb."
}