{
  "id": "4b322b7d0ec588a6296435dd522e601f079e6282",
  "text": " On  thinking  things over he was now  regretting  some  of the things he had said to the dragon, and was not eager to repeat them. The old  thrush was sitting on a rock near by with his head cocked on one side, listening to  all  that was  said.  It  shows what  an  ill  temper Bilbo was  in:  he  picked  up  a  stone  and threw it at the thrush, which merely fluttered aside and came back.  \"Drat  the  bird!\"  said  Bilbo  crossly.  \"I  believe  he  is  listening,  and  I  don't  like  the look of him.\"  \"Leave  him  alone!\"  said Thorin.  \"The  thrushes  are  good  and  friendly-this is a  very  old  bird  indeed,  and  is  maybe  the  last  left  of  the  ancient  breed  that  used  to  live about here, tame to the hands of my father and grandfather. They were a long- lived and magical race, and this might even be one of those that were alive then, a  couple of hundreds years or more ago. The Men of Dale used  to have  the  trick of  understanding  their  language,  and  used  them  for messengers  to  fly  to  the Men of  the Lake and elsewhere.\"  \"Well, he'll have news to take to Lake-town all right, if that is what he is after,\"  said Bilbo; \"though I don't suppose there are any people left there that trouble with  thrush-language.\"  \"Why what has happened?\" cried the dwarves. \"Do get on with your tale!\"  So  Bilbo  told  them  all  he  could  remember,  and  he  confessed  that  he  had  a  nasty  feeling  that  the  dragon  guessed  too  much  from  his  riddles  added  to  the  camps  and  the  ponies.  \"I  am  sure  he  knows  we  came  from  Lake-town  and  had  help  from  there;  and  I  have  a  horrible  feeling  that  his  next  move  may  be  in  that  direction.  I  wish  to  goodness  I  had  never  said  that  about  Barrel-rider;  it  would  make even a blind rabbit in these parts think of the Lake-men.\"  \"Well,  well!  It  cannot  be  helped,  and  it  is  difficult  not  to  slip  in  talking  to  a  dragon,  or  so  I  have  always  heard,\"  said  Balin  anxious  to  comfort  him.  \"I  think  you  did  very well,  if  you  ask me-you found out one very useful thing at any rate,  and got home alive, and  that  is more  than most can say who have had words with  the likes of Smaug. It may be a mercy and a blessing yet to know of the bare patch  in the old Worm's diamond waistcoat.\"  That  turned  the  conversation,  and  they  all  began  discussing  dragon-slayings  historical,  dubious,  and  mythical,  and  the  various  sorts  of  stabs  and  jabs  and   ####-undercuts,  and  the  different  arts,  devices  and  stratagems  by which  they  had  been  accomplished. The general opinion was that catching a dragon napping was not as  easy as it sounded, and the attempt to stick one or prod one asleep was more likely  to  end  in  disaster  than  a  bold  frontal  attack.  All  the  while  they  talked  the  thrush  listened,  till  at  last when  the  stars  began  to  peep  forth,  it  silently  spread  its wings  and  flew  away.  And  all  the  while  they  talked  and  the  shadows  lengthened  Bilbo  became more and more unhappy and his foreboding  At last he interrupted them. \"I am sure we are very unsafe here,\" he said, \"and  I don't see the point of sitting here. The dragon has withered all the pleasant green,  and  anyway  the  night  has  come  and  it  is  cold.  But  I  feel  it  in my  bones  that  this  place will be attacked again. Smaug knows now how I came down to his hall, and  you  can  trust  him  to  guess where  the  other  end  of  the  tunnel  is. He will break all  this  side  of  the Mountain  to  bits,  if  necessary,  to  stop  up  our  entrance,  and  if  we  are smashed with it the better he will like it.\"  \"You  are  very  gloomy,  Mr.  Baggins!\"  said  Thorin.  \"Why  has  not  Smaug  blocked  the  lower  end,  then,  if  he  is  so  eager  to  keep  us  out?  He  has  not,  or  we  should have heard him.\"  \"I  don't  know,  I  don't  know-because  at  first  he  wanted  to  try  and  lure  me  in  again, I suppose, and now perhaps because he is waiting till after tonight's hunt, or  because he does not want to damage his bedroom if he can help it – but I wish you  would not argue. Smaug will be coming out at any minute now, and our only hope  is to get well in the tunnel and shut the door.\"  He  seemed  so much  in  earnest  that  the  dwarves  at  last  did  as  he said,  though  they  delayed  shutting  the  door-it  seemed  a  desperate  plan,  for  no  one  knew  whether  or  how  they  could  get  it  open  again  from  the  inside,  and  the  thought  of  being  shut  in  a  place  from  which  the  only  way  out  led  through  the  dragon's  lair  was  not  one  they  liked.  Also  everything  seemed  quite  quiet,  both  outside  and  down the tunnel. So for a longish while they sat inside not far down from the half- open  door  and  went  on  talking.  The  talk  turned  to  the  dragon's  wicked  words  about the dwarves. Bilbo wished he had never heard them, or at least that he could  feel quite certain that the dwarves now were absolutely honest when they declared  that they had never thought at all about what would happen after the treasure had  been won."
}