{
  "id": "4c7847f5123cdef7ca054bceb1fa40967ea85351",
  "text": " .. nothing else seemed to be moving apart from Peeves, though he was bouncing around the trophy room on the floor above. ... Harry had taken his first step back toward Gryffindor Tower when something else on the map caught his eye . . . something distinctly odd. Peeves was not the only thing that was moving.  A single dot was flitting around a room in the bottom left-hand corner - Snapes office.  But the dot wasn't labeled \"Severus Snape\" ... it was Bartemius Crouch. Harry stared at the dot. Mr. Crouch was supposed to be too ill to go to work or to come to the Yule Ball - so what was he doing, sneaking into Hogwarts at one o'clock in the morning?  Harry watched closely as the dot moved around and around the room, pausing here and there. ... Harry hesitated, thinking . . . and then his curiosity got the better of him.  He turned and set off in the opposite direction toward the nearest staircase.  He was going to see what Crouch was up to. Harry walked down the stairs as quietly as possible, though the faces in some of the portraits still turned curiously at the squeak of a floorboard, the rustle of his pajamas.  He crept along the corridor below, pushed aside a tapestry about halfway along, and proceeded down a narrower staircase, a shortcut that would take him down two floors.  He kept glancing down at the map, wondering ... It just didn't seem in character, somehow, for correct, law-abiding Mr. Crouch to be sneaking around somebody else's office this late at night.... And then, halfway down the staircase, not thinking about what he was doing, not concentrating on anything but the peculiar behavior of Mr. Crouch, Harrys leg suddenly sank right through the trick step Neville always forgot to jump.  He gave an ungainly wobble, and the golden egg, still damp from the bath, slipped from under his arm. He lurched forward to try and catch it, but too late; the egg fell down the long staircase with a bang as loud as a bass drum on every step - the Invisibility Cloak slipped - Harry snatched at it, and the Marauder s Map fluttered out of his hand and slid down six stairs, where, sunk in the step to above his knee, he couldn't reach it. The golden egg fell through the tapestry at the bottom of the staircase, burst open, and began wailing loudly in the corridor below.  Harry pulled out his wand and struggled to touch the Marauder s Map, to wipe it blank, but it was too far away to reach - Pulling the cloak back over himself Harry straightened up, listening hard with his eyes screwed up with fear. . . and, almost immediately - \"PEEVES!\" It was the unmistakable hunting cry of Filch the caretaker.  Harry could hear his rapid, shuffling footsteps coming nearer and nearer, his wheezy voice raised in fury. \"What's this racket?  Wake up the whole castle, will you?  I'll have you, Peeves, I'll have you, you'll... and what is this?\" Filch's footsteps halted; there was a clink of metal on metal and the wailing stopped - Filch had picked up the egg and closed it.  Harry stood very still, one leg still Jammed tightly in the magical step, listening.  Any moment now, Filch was going to pull aside the tapestry, expecting to see Peeves . . . and there would be no Peeves ... but if he came up the stairs, he would spot the Marauder's Map . . . and Invisibility Cloak or not, the map would show  \"Harry Potter\" standing exactly where he was. \"Egg?\"  Filch said quietly at the foot of the stairs.  \"My sweet!\" - Mrs. Norris was obviously with him - \"This is a Triwizard clue!  This belongs to a school champion!\" Harry felt sick; his heart was hammering very fast - \"PEEVES!\"  Filch roared gleefully.  \"You've been stealing!\" He ripped back the tapestry below, and Harry saw his horrible, pouchy face and bulging, pale eyes staring up the dark and (to Filch) deserted staircase. \"Hiding, are you?\"  he said softly.  \"I'm coming to get you, Peeves. . . . You've gone and stolen a Triwizard clue, Peeves... . Dumbledore'll have you out of here for this, you filthy, pilfering poltergeist. ...\" Filch started to climb the stairs, his scrawny, dust-colored cat at his heels.  Mrs. Morris's lamp-like eyes, so very like her masters, were fixed directly upon Harry.  He had had occasion before now to wonder whether the Invisibility Cloak worked on cats. . . . Sick with apprehension, he watched Filch drawing nearer and nearer in his old flannel dressing gown - he tried desperately to pull his trapped leg free, but it merely sank a few more inches - any second now, Filch was going to spot the map or walk right into him - \"Filch? Whats going on?\" Filch stopped a few steps below Harry and turned.  At the foot of the stairs stood the only person who could make Harry's situation worse:  Snape.  He was wearing a long gray nightshirt and he looked livid. \"Its Peeves, Professor,\" Filch whispered malevolently.  \"He threw this egg down the stairs.\" Snape climbed up the stairs quickly and stopped beside Filch.  Harry gritted his teeth, convinced his loudly thumping heart would give him away at any second."
}