{
  "id": "4f0366bd5d4801450dd985f0293b2cd287434c5c",
  "text": "...\"  \"Probably cost more than all the Slytherins' brooms put together,\" said Ron happily.  \"Well... who'd send Harry something as expensive as that, and not even tell him they'd sent it?\" said Hermione.  \"Who cares?\" said Ron impatiently. \"Listen, Harry, can I have a go on it? Can I?\"  \"I don't think anyone should ride that broom just yet!\" said Hermione shrilly.  Harry and Ron looked at her.  \"What d'you think Harry's going to do with it -- sweep the floor?\" said Ron.  But before Hermione could answer, Crookshanks sprang from Seamus's bed, right at Ron's chest.  \"GET -- HIM -- OUT -- OF -- HERE!\" Ron bellowed as Crookshanks's claws ripped his pajamas and Scabbers attempted a wild escape over his shoulder. Ron seized Scabbers by the tail and aimed a misjudged kick at Crookshanks that hit the trunk at the end of Harry's bed, knocking it over and causing Ron to hop up and down, howling with pain.  Crookshanks's fur suddenly stood on end. A shrill, tint,, whistling was filling the room. The Pocket Sneakoscope had become dislodged from Uncle Vernon's old socks and was whirling and gleaming on the floor.  I forgot about that!\" Harry said, bending down and picking up the Sneakoscope. I never wear those socks if I can help it....  The Sneakoscope whirled and whistled in his palm. Crookshanks was hissing and spitting at it.  \"You'd better take that cat out of here, Hermione,\" said Ron furiously, sitting on Harry's bed nursing his toe. \"Can't you shut that thing up?\" he added to Harry as Hermione strode out of the room, Crookshanks's yellow eyes still fixed maliciously on Ron.  Harry stuffed the Sneakoscope back inside the socks and threw it back into his trunk. All that could be heard now were Ron's stifled moans of pain and rage. Scabbers was huddled in Ron's hands. It had been a while since Harry had seen him out of Ron's pocket, and he was unpleasantly surprised to see that Scabbers, once so fat, was now very skinny; patches of fur seemed to have fallen out too  \"He's not looking too good, is he?\" Harry said.  \"It's stress!\" said Ron. \"He'd be fine if that big stupid furball left him alone!\"  But Harry, remembering what the woman at the Magical Menagerie had said about rats living only three years, couldn't help feeling that unless Scabbers had powers he had never revealed, he was reaching the end of his life. And despite Ron's frequent conplaints that Scabbers was both boring and useless, he was sure Ron would be very miserable if Scabbers died.  Christmas spirit was definitely thin on the ground in the Gryffindor common room that morning. Hermione had shut Crookshanks in her dormitory, but was furious with Ron for trying to kick him; Ron was still fuming about Crookshanks's fresh attempt to eat Scabbers. Harry gave up trying to make them talk to each other and devoted himself to examining the Firebolt, which he had brought down to the common room with him. For some reason this seemed to annoy Hermione as well; she didn't say anything, but she kept looking darkly at the broom as though it too had been criticizing her cat.  At lunchtime they went down to the Great Hall, to find that the House tables had been moved against the walls again, and that a single table, set for twelve, stood in the middle of the room. Professors Dumbledore, McGonagall, Snape, Sprout, and Flitwick were there, along with Filch, the caretaker, who had taken off his usual brown coat and was wearing a very old and rather moldy- looking tailcoat. There were only three other students, two extremely nervous-looking first years and a sullen-faced Slytherin fifth year.  \"Merry Christmas!\" said Dumbledore as Harry, Ron, and Hermione approached the table. \"As there are so few of us, it seemed foolish to use the House tables.... Sit down, sit down!\"  Harry, Ron, and Hermione sat down side by side at the end of the table.  \"Crackers!\" said Dumbledore enthusiastically, offering the end of a large silver noisemaker to Snape, who took it reluctantly and tugged. With a bang like a gunshot, the cracker flew apart to reveal a large, pointed witchs hat topped with a stuffed vulture.  Harry, remembering the boggart, caught Ron's eye and they both grinned; Snape's mouth thinned and he pushed the hat toward Dumbledore, who swapped it for his wizard's hat at once.  \"Dig in!\" he advised the table, beaming around.  As Harry was helping himself to roast potatoes, the doors of the Great Hall opened again. It was Professor Trelawney, gliding toward them as though on wheels. She had put on a green sequined dress in honor of the occasion, making her look more than ever like a glittering, oversized dragonfly.  \"Sibyll, this is a pleasant surprise!\" said Dumbledore, standing up.  \"I have been crystal gazing, Headmaster,\" said Professor Trelawney in her mistiest, most faraway voice, \"and to my astonishment, I saw myself abandoning my solitary luncheon and coming to join you. Who am I to refuse the promptings of fate? I at once hastened from my tower, and I do beg you to forgive my lateness."
}