{
  "id": "4fb4caad4b7389c4180434e329fc20779e953fd4",
  "text": " Why would anyone want to kill a sleeping child?   Before he could answer, the servants returned with a plate of food fresh from the kitchen. There was much more than she’d asked for: hot bread, butter and honey and blackberry preserves, a rasher of bacon and a soft-boiled egg, a wedge of cheese, a pot of mint tea. And with it came Maester Luwin.   How is my son, Maester?  Catelyn looked at all the food and found she had no appetite.  Maester Luwin lowered his eyes.  Unchanged, my lady.   It was the reply she had expected, no more and no less. Her hands throbbed with pain, as if the blade were still in her, cutting deep. She sent the servants away and looked back to Robb.  Do you have the answer yet?    Someone is afraid Bran might wake up,  Robb said,  afraid of what he might say or do, afraid of something he knows.   Catelyn was proud of him.  Very good.  She turned to the new captain of the guard.  We must keep Bran safe. If there was one killer, there could be others.    How many guards do you want, rn’lady?  Hal asked.   So long as Lord Eddard is away, my son is the master of Winterfell,  she told him.  Robb stood a little taller.  Put one man in the sickroom, night and day, one outside the door, two at the bottom of the stairs. No one sees Bran without my warrant or my mother’s.    As you say, m’lord.    Do it now,  Catelyn suggested.   And let his wolf stay in the room with him,  Robb added.   Yes,  Catelyn said. And then again:  Yes.   Hallis Mollen bowed and left the room.   Lady Stark,  Ser Rodrik said when the guardsman had gone,  did you chance to notice the dagger the killer used?    The circumstances did not allow me to examine it closely, but I can vouch for its edge,  Catelyn replied with a dry smile.  Why do you ask?    We found the knife still in the villain’s grasp. It seemed to me that it was altogether too fine a weapon for such a man, so I looked at it long and hard. The blade is Valyrian steel, the hilt dragonbone. A weapon like that has no business being in the hands of such as him. Someone gave it to him.   Catelyn nodded, thoughtful.  Robb, close the door.   He looked at her strangely, but did as she told him.   What I am about to tell you must not leave this room,  she told them.  I want your oaths on that. If even part of what I suspect is true, Ned and my girls have ridden into deadly danger, and a word in the wrong ears could mean their lives.    Lord Eddard is a second father to me,  said Theon Greyjoy.  I do so swear.    You have my oath,  Maester Luwin said.   And mine, my lady,  echoed Ser Rodrik.  She looked at her son.  And you, Robb?   He nodded his consent.   My sister Lysa believes the Lannisters murdered her husband, Lord Arryn, the Hand of the King,  Catelyn told them.  It comes to me that Jaime Lannister did not join the hunt the day Bran fell. He remained here in the castle.  The room was deathly quiet.  I do not think Bran fell from that tower,  she said into the stillness.  I think he was thrown.   The shock was plain on their faces.  My lady, that is a monstrous suggestion,  said Rodrik Cassel.  Even the Kingslayer would flinch at the murder of an innocent child.    Oh, would he?  Theon Greyjoy asked.  I wonder.    There is no limit to Lannister pride or Lannister ambition,  Catelyn said.   The boy had always been surehanded in the past,  Maester Luwin said thoughtfully.  He knew every stone in Winterfell.    Gods,  Robb swore, his young face dark with anger.  If this is true, he will pay for it.  He drew his sword and waved it in the air.  I’ll kill him myself!   Ser Rodrik bristled at him.  Put that away! The Lannisters are a hundred leagues away. Never draw your sword unless you mean to use it. How many times must I tell you, foolish boy?   Abashed, Robb sheathed his sword, suddenly a child again. Catelyn said to Ser Rodrik,  I see my son is wearing steel now.   The old master-at-arms said,  I thought it was time.   Robb was looking at her anxiously.  Past time,  she said.  Winterfell may have need of all its swords soon, and they had best not be made of wood.   Theon Greyjoy put a hand on the hilt of his blade and said,  My lady, if it comes to that, my House owes yours a great debt.   Maester Luwin pulled at his chain collar where it chafed against his neck.  All we have is conjecture. This is the queen’s beloved brother we mean to accuse. She will not take it kindly. We must have proof, or forever keep silent.    Your proof is in the dagger,  Ser Rodrik said.  A fine blade like that will not have gone unnoticed.   There was only one place to find the truth of it, Catelyn realized.  Someone must go to King’s Landing.    I’ll go,  Robb said.   No,  she told him.  Your place is here. There must always be a Stark in Winterfell.  She looked at Ser Rodrik with his great white whiskers, at Maester Luwin in his grey robes, at young Greyjoy, lean and dark and impetuous. Who to send? Who would be believed? Then she knew. Catelyn struggled to push back the blankets, her bandaged fingers as stiff and unyielding as stone."
}