{
  "id": "523b5e5a71988f754fd9832edc43ec3efcf54139",
  "text": "    You’re hard enough to look at with a nose. Besides, I wanted to make the goat say ‘thapphireth’.  He chuckled.  A good thing for you I’m such a liar. An honorable man would have told the truth about the Sapphire Isle.    All the same,  she said.  I thank you, ser.   His hand was throbbing again. He ground his teeth and said,  A Lannister pays his debts. That was for the river, and those rocks you dropped on Robin Ryger.   The goat wanted to make a show of parading him in, so Jaime was made to dismount a mile from the gates of Harrenhal. A rope was looped around his waist, a second around Brienne’s wrists; the ends were tied to the pommel of Vargo Hoat’s saddle. They stumbled along side by side behind the Qohorik’s striped zorse.  Jaime’s rage kept him walking. The linen that covered the stump was grey and stinking with pus. His phantom fingers screamed with every step. I am stronger than they know, he told himself. I am still a Lannister. I am still a knight of the Kingsguard. He would reach Harrenhal, and then King’s Landing. He would live. And I will pay this debt with interest.  As they approached the clifflike walls of Black Harren’s monstrous castle, Brienne squeezed his arm.  Lord Bolton holds this castle. The Boltons are bannermen to the Starks.    The Boltons skin their enemies.  Jaime remembered that much about the northman. Tyrion would have known all there was to know about the Lord of the Dreadfort, but Tyrion was a thousand leagues away, with Cersei. I cannot die while Cersei lives, he told himself. We will die together as we were born together.  The castleton outside the walls had been burned to ash and blackened stone, and many men and horses had recently encamped beside the lakeshore, where Lord Whent had staged his great tourney in the year of the false spring. A bitter smile touched Jaime’s lips as they crossed that torn ground. Someone had dug a privy trench in the very spot where he’d once knelt before the king to say his vows. I never dreamed how quick the sweet would turn to sour. Aerys would not even let me savor that one night. He honored me, and then he spat on me.   The banners,  Brienne observed.  Flayed man and twin towers, see. King Robb’s sworn men. There, above the gatehouse, grey on white. They fly the direwolf.   Jaime twisted his head upward for a look.  That’s your bloody wolf, true enough,  he granted her.  And those are heads to either side of it.   Soldiers, servants, and camp followers gathered to hoot at them. A spotted bitch followed them through the camps barking and growling until one of the Lyseni impaled her on a lance and galloped to the front of the column.  I am bearing Kingslayer’s banner,  he shouted, shaking the dead dog above Jaime’s head.  The walls of Harrenhal were so thick that passing beneath them was like passing through a stone tunnel. Vargo Hoat had sent two of his Dothraki ahead to inform Lord Bolton of their coming, so the outer ward was full of the curious. They gave way as Jaime staggered past, the rope around his waist jerking and pulling at him whenever he slowed.  I give you the Kingthlayer,  Vargo Hoat proclaimed in that thick slobbery voice of his. A spear jabbed at the small of Jaime’s back, sending him sprawling.  Instinct made him put out his hands to stop his fall. When his stump smashed against the ground the pain was blinding, yet somehow he managed to fight his way back to one knee. Before him, a flight of broad stone steps led up to the entrance of one of Harrenhal’s colossal round towers. Five knights and a northman stood looking down on him; the one pale-eyed in wool and fur, the five fierce in mail and plate, with the twin towers sigil on their surcoats.  A fury of Freys,  Jaime declared.  Ser Danwell, Ser Aenys, Ser Hosteen.  He knew Lord Walder’s sons by sight; his aunt had married one, after all.  You have my condolences.    For what, ser?  Ser Danwell Frey asked.   Your brother’s son, Ser Cleos,  said Jaime.  He was with us until outlaws filled him full of arrows. Urswyck and this lot took his goods and left him for the wolves.    My lords!  Brienne wrenched herself free and pushed forward.  I saw your banners. Hear me for your oath!    Who speaks?  demanded Ser Aenys Frey.   Lannither’th wet nurth.    I am Brienne of Tarth, daughter to Lord Selwyn the Evenstar, and sworn to House Stark even as you are.   Ser Aenys spit at her feet.  That’s for your oaths. We trusted the word of Robb Stark, and he repaid our faith with betrayal.   Now this is interesting. Jaime twisted to see how Brienne might take the accusation, but the wench was as singleminded as a mule with a bit between his teeth.  I know of no betrayal.  She chafed at the ropes around her wrists.  Lady Catelyn commanded me to deliver Lannister to his brother at King’s Landing—    She was trying to drown him when we found them,  said Urswyck the Faithful.  She reddened.  In anger I forgot myself, but I would never have killed him. If he dies the Lannisters will put my lady’s daughters to the sword."
}