{
  "id": "53ca41c813948a0df3c40fb6dfa2561a21f1c47d",
  "text": " Shall I speak to the Old Bear?    Don’t you dare!  Sam pulled up the hood of his enormous black cloak and clambered awkwardly back onto his horse. It was a plow horse, big and slow and clumsy, but better able to bear his weight than the little garrons the rangers rode.  I had hoped we might stay the night in the village,  he said wistfully.  It would be nice to sleep under a roof again.    Too few roofs for all of us.  Jon mounted again, gave Sam a parting smile, and rode off. The column was well under way, so he swung wide around the village to avoid the worst of the congestion. He had seen enough of Whitetree.  Ghost emerged from the undergrowth so suddenly that the garron shied and reared. The white wolf hunted well away from the line of march, but he was not having much better fortune than the foragers Smallwood sent out after game. The woods were as empty as the villages, Dywen had told him one night around the fire.  We’re a large party,  Jon had said.  The game’s probably been frightened away by all the noise we make on the march.    Frightened away by something, no doubt,  Dywen said.  Once the horse had settled, Ghost loped along easily beside him. Jon caught up to Mormont as he was wending his way around a hawthorn thicket.  Is the bird away?  the Old Bear asked.   Yes, my lord. Sam is teaching them to talk.   The Old Bear snorted.  He’ll regret that. Damned things make a lot of noise, but they never say a thing worth hearing.   They rode in silence, until Jon said,  If my uncle found all these villages empty as well—    —he would have made it his purpose to learn why,  Lord Mormont finished for him,  and it may well be someone or something did not want that known. Well, we’ll be three hundred when Qhorin joins us. Whatever enemy waits out here will not find us so easy to deal with. We will find them, Jon, I promise you.   Or they will find us, thought Jon.      ARYA  The river was a blue-green ribbon shining in the morning sun. Reeds grew thick in the shallows along the banks, and Arya saw a water snake skimming across the surface, ripples spreading out behind it as it went. Overhead a hawk flew in lazy circles.  It seemed a peaceful place… until Koss spotted the dead man.  There, in the reeds.  He pointed, and Arya saw it. The body of a soldier, shapeless and swollen. His sodden green cloak had hung up on a rotted log, and a school of tiny silver fishes were nibbling at his face.  I told you there was bodies,  Lommy announced.  I could taste them in that water.   When Yoren saw the corpse, he spat.  Dobber, see if he’s got anything worth the taking. Mail, knife, a bit o’ coin, what have you.  He spurred his gelding and rode out into the river, but the horse struggled in the soft mud and beyond the reeds the water deepened. Yoren rode back angry, his horse covered in brown slime up to the knees.  We won’t be crossing here. Koss, you’ll come with me upriver, look for a ford. Woth, Gerren, you go downstream. The rest o’ you wait here. Put a guard out.   Dobber found a leather purse in the dead man’s belt. Inside were four coppers and a little hank of blond hair tied up with a red ribbon. Lommy and Tarber stripped naked and went wading, and Lommy scooped up handfuls of slimy mud and threw them at Hot Pie, shouting,  Mud Pie! Mud Pie!  In the back of their wagon, Rorge cursed and threatened and told them to unchain him while Yoren was gone, but no one paid him any mind. Kurz caught a fish with his bare hands. Arya saw how he did it, standing over a shallow pool, calm as still water, his hand darting out quick as a snake when the fish swam near. It didn’t look as hard as catching cats. Fish didn’t have claws.  It was midday when the others returned. Woth reported a wooden bridge half a mile downstream, but someone had burned it up. Yoren peeled a sourleaf off the bale.  Might be we could swim the horses over, maybe the donkeys, but there’s no way we’ll get those wagons across. And there’s smoke to the north and west, more fires, could be this side o’ the river’s the place we want to be.  He picked up a long stick and drew a circle in the mud, a line trailing down from it.  That’s Gods Eye, with the river flowing south. We’re here.  He poked a hole beside the line of the river, under the circle.  We can’t go round west of the lake, like I thought. East takes us back to the kingsroad.  He moved the stick up to where the line and circle met.  Near as I recall, there’s a town here. The holdfast’s stone, and there’s a lordling got his seat there too, just a towerhouse, but he’ll have a guard, might be a knight or two. We follow the river north, should be there before dark. They’ll have boats, so I mean to sell all we got and hire us one.  He drew the stick up through the circle of the lake, from bottom to top.  Gods be good, we’ll find a wind and sail across the Gods Eye to Harrentown.  He thrust the point down at the top of the circle.  We can buy new mounts there, or else take shelter at Harrenhal. That’s Lady Whent’s seat, and she’s always been a friend o’ the Watch."
}