{
  "id": "563fdae5e7cc894a66ec4fba7b3a65974036909c",
  "text": " Hermione took one frightened look at the expression on Ron's face, gathered up Crookshanks, and hurried away toward the girls' dormitories.  \"So how about it?\" Ron said to Harry as though there had been no interruption. \"Come on, last time we went you didn't see anything. You haven't even been inside Zonko's yet!\"  Harry looked around to check that Hermione was well out of earshot.  \"Okay,\" he said. \"But I'm taking the Invisibility Cloak this time.\"  On Saturday morning, Harry packed his Invisibility Cloak in his bag, slipped the Marauder's Map into his pocket, and went down to breakfast with everyone else. Hermione kept shooting suspicious looks down the table at him, but he avoided her eye and was careful to let her see him walking back up the marble staircase in the entrance hall as everybody else proceeded to the front doors.  \"'Bye!\" Harry called to Ron. \"See you when you get back!\"  Ron grinned and winked.  Harry hurried up to the third floor, slipping the Marauder's Map out of his pocket as he went. Crouching behind the one-eyed witch, he smoothed it out. A tiny dot was moving in his direction. Harry squinted at it. The minuscule writing next to it read Neville Longbottom.  Harry quickly pulled out his wand, muttered, \"Dissendium!\" and shoved his bag into the statue, but before he could climb in himself, Neville came around the corner.  \"Harry! I forgot you weren't going to Hogsmeade either!\"  \"Hi, Neville,\" said Harry, moving swiftly away from the statue and pushing the map back into his pocket. \"What are you up to?\"  \"Nothing,\" shrugged Neville. \"Want a game of Exploding Snap?\"  \"Er -- not now -- I was going to go to the library and do that vampire essay for Lupin --\"  \"I'll come with you!\" said Neville brightly. I haven't done it either!\"  \"Er -- hang on -- yeah, I forgot, I finished it last night!\"  \"Great, you can help me!\" said Neville, his round face anxious. \"I don't understand that thing about the garlic at all -- do they have to eat it, or --\"  He broke off with a small gasp, looking over Harry's shoulder.  It was Snape. Neville took a quick step behind Harry.  \"And what are you two doing here?\" said Snape, coming to a halt and looking from one to the other. \"An odd place to meet --\"  To Harry's immense disquiet, Snape's black eyes flicked to the doorways on either side of them, and then to the one-eyed witch.  \"We're not -- meeting here,\" said Harry. \"We just -- met here.\"  \"Indeed?\" said Snape. \"You have a habit of turning up in unexpected places, Potter, and you are very rarely there for no good reason.... I suggest the pair of you return to Gryffindor Tower, where you belong.\"  Harry and Neville set off without another word. As they turned the corner, Harry looked back. Snape was running one of his hands over the one-eyed witch's head, examining it closely.  Harry managed to shake Neville off at the Fat Lady by telling him the password, then pretending he'd left his vampire essay in the library and doubling back. Once out of sight of the security trolls, he pulled out the map again and held it close to his nose.  The third floor corridor seemed to be deserted. Harry scanned the map carefully and saw, with a leap of relief, that the tiny dot labeled Severus Snape was now back in its office.  He sprinted back to the one-eyed witch, opened her hump, heaved himself inside, and slid down to meet his bag at the bottom of the stone chute. He wiped the Marauder's Map blank again, then set off at a run.  Harry, completely hidden beneath the Invisibility Cloak, emerged into the sunlight outside Honeydukes and prodded Ron in the back.  It's me,\" he muttered.  \"What kept you?\" Ron hissed.  \"Snape was hanging around.\"  They set off up the High Street.  \"Where are you?\" Ron kept muttering out of the corner of his mouth. \"Are you still there? This feels weird....\"  They went to the post office; Ron pretended to be checking the price of an owl to Bill in Egypt so that Harry could have a good look around. The owls sat hooting softly down at him, at least three hundred of them; from Great Grays right down to tiny little Scops owls (\"Local Deliveries Only\"), which were so small they could have sat in the palm of Harry's hand.  Then they visited Zonko's, which was so packed with students Harry had to exercise great care not to tread on anyone and cause a panic. There were jokes and tricks to fulfill even Fred's and George's wildest dreams; Harry gave Ron whispered orders and passed him some gold from under the cloak. They left Zonko's with their money bags considerably lighter than they had been on entering, but their pockets bulging with Dungbombs, Hiccup Sweets, Frog Spawn Soap, and a Nose-Biting Teacup apiece.  The day was fine and breezy, and neither of them felt like staying indoors, so they walked past the Three Broomsticks and climbed a slope to visit the Shrieking Shack, the most haunted dwelling in Britain. It stood a little way above the rest of the village, and even in daylight was slightly creepy, with its boarded windows and dank overgrown garden."
}