{
  "id": "56f034863cbb3fa9d645c55a6fd800f7b4748159",
  "text": " Be it known that Lord Baelish is granted the castle of Harrenhal with all its attendant lands and incomes, there to make his seat and rule henceforth as Lord Paramount of the Trident. Petyr Baelish and his sons and grandsons shall hold and enjoy these honors until the end of time, and all the lords of the Trident shall do him homage as their rightful liege. The King’s Hand and the small council consent.   On his knees, Littlefinger raised his eyes to King Joffrey.  I thank you humbly, Your Grace. I suppose this means I’ll need to see about getting some sons and grandsons.   Joffrey laughed, and the court with him. Lord Paramount of the Trident, Sansa thought, and Lord of Harrenhal as well. She did not understand why that should make him so happy; the honors were as empty as the title granted to Hallyne the Pyromancer. Harrenhal was cursed, everyone knew that, and the Lannisters did not even hold it at present. Besides, the lords of the Trident were sworn to Riverrun and House Tully, and to the King in the North; they would never accept Littlefinger as their liege. Unless they are made to. Unless my brother and my uncle and my grandfather are all cast down and killed. The thought made Sansa anxious, but she told herself she was being silly. Robb has beaten them every time. He’ll beat Lord Baelish too, if he must.  More than six hundred new knights were made that day. They had held their vigil in the Great Sept of Baelor all through the night and crossed the city barefoot that morning to prove their humble hearts. Now they came forward dressed in shifts of undyed wool to receive their knighthoods from the Kingsguard. It took a long time, since only three of the Brothers of the White Sword were on hand to dub them. Mandon Moore had perished in the battle, the Hound had vanished, Aerys Oakheart was in Dorne with Princess Myrcella, and Jaime Lannister was Robb’s captive, so the Kingsguard had been reduced to Balon Swann, Meryn Trant, and Osmund Kettleblack. Once knighted, each man rose, buckled on his swordbelt, and stood beneath the windows. Some had bloody feet from their walk through the city, but they stood tall and proud all the same, it seemed to Sansa.  By the time all the new knights had been given their sers the hall was growing restive, and none more so than Joffrey. Some of those in the gallery had begun to slip quietly away, but the notables on the floor were trapped, unable to depart without the king’s leave. Judging by the way he was fidgeting atop the Iron Throne, Joff would willingly have granted it, but the day’s work was far from done. For now the coin was turned over, and the captives were ushered in.  There were great lords and noble knights in that company too: sour old Lord Celtigar, the Red Crab; Ser Bonifer the Good; Lord Estermont, more ancient even than Celtigar; Lord Varner, who hobbled the length of the hall on a shattered knee, but would accept no help; Ser Mark Mullendore, grey-faced, his left arm gone to the elbow; fierce Red Ronnet of Griffin Roost; Ser Dermot of the Rainwood; Lord Willurn and his sons Josua and Elyas; Ser Jon Fossoway; Ser Timon the Scrapesword; Aurane, the bastard of Driftmark; Lord Staedmon, called Pennylover; hundreds of others.  Those who had changed their allegiance during the battle needed only to swear fealty to Joffrey, but the ones who had fought for Stannis until the bitter end were compelled to speak. Their words decided their fate. If they begged forgiveness for their treasons and promised to serve loyally henceforth, Joffrey welcomed them back into the king’s peace and restored them to all their lands and rights. A handful remained defiant, however.  Do not imagine this is done, boy,  warned one, the bastard son of some Florent or other.  The Lord of Light protects King Stannis, now and always. All your swords and all your scheming shall not save you when his hour comes.    Your hour is come right now.  Joffrey beckoned to Ser Ilyn Payne to take the man out and strike his head off. But no sooner had that one been dragged away than a knight of solemn mien with a fiery heart on his surcoat shouted out,  Stannis is the true king! A monster sits the Iron Throne, an abomination born of incest!    Be silent,  Ser Kevan Lannister bellowed.  The knight raised his voice instead.  Joffrey is the black worm eating the heart of the realm! Darkness was his father, and death his mother! Destroy him before he corrupts you all! Destroy them all, queen whore and king worm, vile dwarf and whispering spider, the false flowers. Save yourselves!  One of the gold cloaks knocked the man off his feet, but he continued to shout.  The scouring fire will come! King Stannis will return!    Joffrey lurched to his feet.  I’m king! Kill him! Kill him now! I command it.  He chopped down with his hand, a furious, angry gesture… and screeched in pain when his arm brushed against one of the sharp metal fangs that surrounded him. The bright crimson samite of his sleeve turned a darker shade of red as his blood soaked through it."
}