{
  "id": "576ae6449501074b9a793ef7a943a470f99b5b99",
  "text": "   The raven cocked its head and looked at Jon.  Corn?  it said hopefully. When it got neither corn nor answer, it quorked and muttered,  Kettle? Kettle? Kettle?   The rest was arrowheads, a torrent of arrowheads, a flood of arrowheads, arrowheads enough to drown the last few stones and shells, and all the copper pennies too.  When the count was done, Jon found himself surrounded. Some clapped him on the back, whilst others bent the knee to him as if he were a lord in truth. Satin, Owen the Oaf, Halder, Toad, Spare Boot, Giant, Mully, Ulmer of the Kingswood, Sweet Donnel Hill, and half a hundred more pressed around him. Dywen clacked his wooden teeth and said,  Gods be good, our Lord Commander’s still in swaddling clothes.  Iron Emmett said,  I hope this don’t mean I can’t beat the bloody piss out of you next time we train, my lord.  Three-Finger Hobb wanted to know if he’d still be eating with the men, or if he’d want his meals sent up to his solar. Even Bowen Marsh came up to say he would be glad to continue as Lord Steward if that was Lord Snow’s wish.   Lord Snow,  said Cotter Pyke,  if you muck this up, I’m going to rip your liver out and eat it raw with onions.   Ser Denys Mallister was more courteous.  It was a hard thing young Samwell asked of me,  the old knight confessed.  When Lord Qorgyle was chosen, I told myself, ‘No matter, he has been longer on the Wall than you have, your time will come.’ When it was Lord Mormont, I thought, ‘He is strong and fierce, but he is old, your time may yet come.’ But you are half a boy, Lord Snow, and now I must return to the Shadow Tower knowing that my time will never come.  He smiled a tired smile.  Do not make me die regretful. Your uncle was a great man. Your lord father and his father as well. I shall expect full as much of you.    Aye,  said Cotter Pyke.  And you can start by telling those king’s men that it’s done, and we want our bloody supper.    Supper,  screamed the raven.  Supper, supper.   The king’s men cleared the door when they told them of the choosing, and Three-Finger Hobb and half a dozen helpers went trotting off to the kitchen to fetch the food. Jon did not wait to eat. He walked across the castle, wondering if he were dreaming, with the raven on his shoulder and Ghost at his heels. Pyp, Grenn, and Sam trailed after him, chattering, but he hardly heard a word until Grenn whispered,  Sam did it,  and Pyp said,  Sam did it!  Pyp had brought a wineskin with him, and he took a long drink and chanted,  Sam, Sam, Sam the wizard, Sam the wonder, Sam Sam the marvel man, he did it. But when did you hide the raven in the kettle, Sam, and how in seven hells could you be certain it would fly to Jon? It would have mucked up everything if the bird had decided to perch on Janos Slynt’s fat head.    I had nothing to do with the bird,  Sam insisted.  When it flew out of the kettle I almost wet myself.   Jon laughed, half amazed that he still remembered how.  You’re all a bunch of mad fools, do you know that?    Us?  said Pyp.  You call us fools? We’re not the ones who got chosen as the nine-hundredth-and-ninety-eighth Lord Commander of the Night’s Watch. You best have some wine, Lord Jon. I think you’re going to need a lot of wine.   So Jon Snow took the wineskin from his hand and had a swallow. But only one. The Wall was his, the night was dark, and he had a king to face.      Sansa   She awoke all at once, every nerve atingle. For a moment she did not remember where she was. She had dreamt that she was little, still sharing a bedchamber with her sister Arya. But it was her maid she heard tossing in sleep, not her sister, and this was not Winterfell, but the Eyrie. And I am Alayne Stone, a bastard girl. The room was cold and black, though she was warm beneath the blankets. Dawn had not yet come. Sometimes she dreamed of Ser Ilyn Payne and woke with her heart thumping, but this dream had not been like that. Home. It was a dream of home.  The Eyrie was no home. It was no bigger than Maegor’s Holdfast, and outside its sheer white walls was only the mountain and the long treacherous descent past Sky and Snow and Stone to the Gates of the Moon on the valley floor. There was no place to go and little to do. The older servants said these halls rang with laughter when her father and Robert Baratheon had been Jon Arryn’s wards, but those days were many years gone. Her aunt kept a small household, and seldom permitted any guests to ascend past the Gates of the Moon. Aside from her aged maid, Sansa’s only companion was the Lord Robert, eight going on three.  And Marillion. There is always Marillion. When he played for them at supper, the young singer often seemed to be singing directly at her. Her aunt was far from pleased. Lady Lysa doted on Marillion, and had banished two serving girls and even a page for telling lies about him.  Lysa was as lonely as she was. Her new husband seemed to spend more time at the foot of the mountain than he did atop it. He was gone now, had been gone the past four days, meeting with the Corbrays."
}