{
  "id": "58e2b14404d3d48e083c49482ad4a0bf2d4fde26",
  "text": "   You must,  he said.  Sansa must wed Joffrey, that is clear now, we must give them no grounds to suspect our devotion. And it is past time that Arya learned the ways of a southron court. In a few years she will be of an age to marry too.   Sansa would shine in the south, Catelyn thought to herself, and the gods knew that Arya needed refinement. Reluctantly, she let go of them in her heart. But not Bran. Never Bran.  Yes,  she said,  but please, Ned, for the love you bear me, let Bran remain here at Winterfell. He is only seven.    I was eight when my father sent me to foster at the Eyrie,  Ned said.  Ser Rodrik tells me there is bad feeling between Robb and Prince Joffrey. That is not healthy. Bran can bridge that distance. He is a sweet boy, quick to laugh, easy to love. Let him grow up with the young princes, let him become their friend as Robert became mine. Our House will be the safer for it.   He was right; Catelyn knew it. It did not make the pain any easier to bear. She would lose all four of them, then: Ned, and both girls, and her sweet, loving Bran. Only Robb and little Rickon would be left to her. She felt lonely already. Winterfell was such a vast place.  Keep him off the walls, then,  she said bravely.  You know how Bran loves to climb.   Ned kissed the tears from her eyes before they could fall.  Thank you, my lady,  he whispered.  This is hard, I know.    What of Jon Snow, my lord?  Maester Luwin asked.  Catelyn tensed at the mention of the name. Ned felt the anger in her, and pulled away.  Many men fathered bastards. Catelyn had grown up with that knowledge. It came as no surprise to her, in the first year of her marriage, to learn that Ned had fathered a child on some girl chance met on campaign. He had a man’s needs, after all, and they had spent that year apart, Ned off at war in the south while she remained safe in her father’s castle at Riverrun. Her thoughts were more of Robb, the infant at her breast, than of the husband she scarcely knew. He was welcome to whatever solace he might find between battles. And if his seed quickened, she expected he would see to the child’s needs.  He did more than that. The Starks were not like other men. Ned brought his bastard home with him, and called him  son  for all the north to see. When the wars were over at last, and Catelyn rode to Winterfell, Jon and his wet nurse had already taken up residence.  That cut deep. Ned would not speak of the mother, not so much as a word, but a castle has no secrets, and Catelyn heard her maids repeating tales they heard from the lips of her husband’s soldiers. They whispered of Ser Arthur Dayne, the Sword of the Morning, deadliest of the seven knights of Aerys’s Kingsguard, and of how their young lord had slain him in single combat. And they told how afterward Ned had carried Ser Arthur’s sword back to the beautiful young sister who awaited him in a castle called Starfall on the shores of the Summer Sea. The Lady Ashara Dayne, tall and fair, with haunting violet eyes. It had taken her a fortnight to marshal her courage, but finally, in bed one night, Catelyn had asked her husband the truth of it, asked him to his face.  That was the only time in all their years that Ned had ever frightened her.  Never ask me about Jon,  he said, cold as ice.  He is my blood, and that is all you need to know. And now I will learn where you heard that name, my lady.  She had pledged to obey; she told him; and from that day on, the whispering had stopped, and Ashara Dayne’s name was never heard in Winterfell again.  Whoever Jon’s mother had been, Ned must have loved her fiercely, for nothing Catelyn said would persuade him to send the boy away. It was the one thing she could never forgive him. She had come to love her husband with all her heart, but she had never found it in her to love Jon. She might have overlooked a dozen bastards for Ned’s sake, so long as they were out of sight. Jon was never out of sight, and as he grew, he looked more like Ned than any of the trueborn sons she bore him. Somehow that made it worse.  Jon must go,  she said now.   He and Robb are close,  Ned said.  I had hoped…    He cannot stay here,  Catelyn said, cutting him off.  He is your son, not mine. I will not have him.  It was hard, she knew, but no less the truth. Ned would do the boy no kindness by leaving him here at Winterfell.  The look Ned gave her was anguished.  You know I cannot take him south. There will be no place for him at court. A boy with a bastard’s name… you know what they will say of him. He will be shunned.   Catelyn armored her heart against the mute appeal in her husband’s eyes.  They say your friend Robert has fathered a dozen bastards himself.    And none of them has ever been seen at court!  Ned blazed.  The Lannister woman has seen to that. How can you be so damnably cruel, Catelyn? He is only a boy. He—   His fury was on him. He might have said more, and worse, but Maester Luwin cut in.  Another solution presents itself,  he said, his voice quiet."
}