{
  "id": "5bec34dbba35186fc4a30f88656f331855ad7a96",
  "text": " Ned steadied himself with a hand on the bedpost. He had only to look down at Robert to know how bad it was.  What…?  he began, his throat clenched.   A boar.  Lord Renly was still in his hunting greens, his cloak spattered with blood.   A devil,  the king husked.  My own fault. Too much wine, damn me to hell. Missed my thrust.    And where were the rest of you?  Ned demanded of Lord Renly.  Where was Ser Barristan and the Kingsguard?   Renly’s mouth twitched.  My brother commanded us to stand aside and let him take the boar alone.   Eddard Stark lifted the blanket.  They had done what they could to close him up, but it was nowhere near enough. The boar must have been a fearsome thing. It had ripped the king from groin to nipple with its tusks. The wine-soaked bandages that Grand Maester Pycelle had applied were already black with blood, and the smell off the wound was hideous. Ned’s stomach turned. He let the blanket fall.   Stinks,  Robert said.  The stink of death, don’t think I can’t smell it. Bastard did me good, eh? But I… I paid him back in kind, Ned.  The king’s smile was as terrible as his wound, his teeth red.  Drove a knife right through his eye. Ask them if I didn’t. Ask them.    Truly,  Lord Renly murmured.  We brought the carcass back with us, at my brother’s command.    For the feast,  Robert whispered.  Now leave us. The lot of you. I need to speak with Ned.    Robert, my sweet lord…  Cersei began.   I said leave,  Robert insisted with a hint of his old fierceness.  What part of that don’t you understand, woman?   Cersei gathered up her skirts and her dignity and led the way to the door. Lord Renly and the others followed. Grand Maester Pycelle lingered, his hands shaking as he offered the king a cup of thick white liquid.  The milk of the poppy, Your Grace,  he said.  Drink. For your pain.   Robert knocked the cup away with the back of his hand.  Away with you. I’ll sleep soon enough, old fool. Get out.   Grand Maester Pycelle gave Ned a stricken look as he shuffled from the room.   Damn you, Robert,  Ned said when they were alone. His leg was throbbing so badly he was almost blind with pain. Or perhaps it was grief that fogged his eyes. He lowered himself to the bed, beside his friend.  Why do you always have to be so headstrong?    Ah, fuck you, Ned,  the king said hoarsely.  I killed the bastard, didn’t I?  A lock of matted black hair fell across his eyes as he glared up at Ned.  Ought to do the same for you. Can’t leave a man to hunt in peace. Ser Robar found me. Gregor’s head. Ugly thought. Never told the Hound. Let Cersei surprise him.  His laugh turned into a grunt as a spasm of pain hit him.  Gods have mercy,  he muttered, swallowing his agony.  The girl. Daenerys. Only a child, you were right… that’s why, the girl… the gods sent the boar… sent to punish me…  The king coughed, bringing up blood.  Wrong, it was wrong, I… only a girl… Varys, Littlefinger, even my brother… worthless… no one to tell me no but you, Ned… only you…  He lifted his hand, the gesture pained and feeble.  Paper and ink. There, on the table. Write what I tell you.   Ned smoothed the paper out across his knee and took up the quill.  At your command, Your Grace.    This is the will and word of Robert of House Baratheon, the First of his Name, King of the Andals and all the rest—put in the damn titles, you know how it goes. I do hereby command Eddard of House Stark, Lord of Winterfell and Hand of the King, to serve as Lord Regent and Protector of the Realm upon my… upon my death… to rule in my… in my stead, until my son Joffrey does come of age…    Robert…  Joffrey is not your son, he wanted to say, but the words would not come. The agony was written too plainly across Robert’s face; he could not hurt him more. So Ned bent his head and wrote, but where the king had said  my son Joffrey,  he scrawled  my heir  instead. The deceit made him feel soiled. The lies we tell for love, he thought. May the gods forgive me.  What else would you have me say?    Say… whatever you need to. Protect and defend, gods old and new, you have the words. Write. I’ll sign it. You give it to the council when I’m dead.    Robert,  Ned said in a voice thick with grief,  you must not do this. Don’t die on me. The realm needs you.   Robert took his hand, fingers squeezing hard.  You are… such a bad liar, Ned Stark,  he said through his pain.  The realm… the realm knows… what a wretched king I’ve been. Bad as Aerys, the gods spare me.    No,  Ned told his dying friend,  not so bad as Aerys, Your Grace. Not near so bad as Aerys.   Robert managed a weak red smile.  At the least, they will say… this last thing… this I did right. You won’t fail me. You’ll rule now. You’ll hate it, worse than I did… but you’ll do well. Are you done with the scribbling?    Yes, Your Grace.  Ned offered Robert the paper. The king scrawled his signature blindly, leaving a smear of blood across the letter.  The seal should be witnessed.    Serve the boar at my funeral feast,  Robert rasped."
}