{
  "id": "5d6bcf760f2803ce3f57b3da68802986e62034d4",
  "text": "  The sounds were coming from the far side of the castle, by the main gate. A knot of men stood before the portcullis as it rose in jerks and starts, and in the fields beyond, outside the castle, were several hundred riders. When the wind blew, it lifted their banners, and she trembled in relief at the sight of the leaping trout of Riverrun. Edmure.  It was two hours before he saw fit to come to her. By then the castle rang to the sound of noisy reunions as men embraced the women and children they had left behind. Three ravens had risen from the rookery, black wings beating at the air as they took flight. Catelyn watched them from her father’s balcony. She had washed her hair, changed her clothing, and prepared herself for her brother’s reproaches… but even so, the waiting was hard.  When at last she heard sounds outside her door, she sat and folded her hands in her lap. Dried red mud spattered Edmure’s boots, greaves, and surcoat. To look at him, you would never know he had won his battle. He was thin and drawn, with pale cheeks, unkempt beard, and too-bright eyes.   Edmure,  Catelyn said, worried,  you look unwell. Has something happened? Have the Lannisters crossed the river?    I threw them back. Lord Tywin, Gregor Clegane, Addam Marbrand, I turned them away. Stannis, though…  He grimaced.   Stannis? What of Stannis?    He lost the battle at King’s Landing,  Edmure said unhappily.  His fleet was burned, his army routed.   A Lannister victory was ill tidings, but Catelyn could not share her brother’s obvious dismay. She still had nightmares about the shadow she had seen slide across Renly’s tent and the way the blood had come flowing out through the steel of his gorget.  Stannis was no more a friend than Lord Tywin.    You do not understand. Highgarden has declared for Joffrey. Dorne as well. All the south.  His mouth tightened.  And you see fit to loose the Kingslayer. You had no right.    I had a mother’s right.  Her voice was calm, though the news about Highgarden was a savage blow to Robb’s hopes. She could not think about that now, though.   No right,  Edmure repeated.  He was Robb’s captive, your king’s captive, and Robb charged me to keep him safe.    Brienne will keep him safe. She swore it on her sword.    That woman?    She will deliver Jaime to King’s Landing, and bring Arya and Sansa back to us safely.    Cersei will never give them up.    Not Cersei. Tyrion. He swore it, in open court. And the Kingslayer swore it as well.    Jaime’s word is worthless. As for the Imp, it’s said he took an axe in the head during the battle. He’ll be dead before your Brienne reaches King’s Landing, if she ever does.    Dead?  Could the gods truly be so merciless? She had made Jaime swear a hundred oaths, but it was his brother’s promise she had pinned her hopes on.  Edmure was blind to her distress.  Jaime was my charge, and I mean to have him back. I’ve sent ravens—    Ravens to whom? How many?    Three,  he said,  so the message will be certain to reach Lord Bolton. By river or road, the way from Riverrun to King’s Landing must needs take them close by Harrenhal.    Harrenhal.  The very word seemed to darken the room. Horror thickened her voice as she said,  Edmure, do you know what you have done?    Have no fear, I left your part out. I wrote that Jaime had escaped, and offered a thousand dragons for his recapture.   Worse and worse, Catelyn thought in despair. My brother is a fool. Unbidden, unwanted, tears filled her eyes.  If this was an escape,  she said softly,  and not an exchange of hostages, why should the Lannisters give my daughters to Brienne?    It will never come to that. The Kingslayer will be returned to us, I have made certain of it.    All you have made certain is that I shall never see my daughters again. Brienne might have gotten him to King’s Landing safely… so long as no one was hunting for them. But now…  Catelyn could not go on.  Leave me, Edmure.  She had no right to command him, here in the castle that would soon be his, yet her tone would brook no argument.  Leave me to Father and my grief, I have no more to say to you. Go. Go.  All she wanted was to lie down, to close her eyes and sleep, and pray no dreams would come.      Arya   The sky was as black as the walls of Harrenhal behind them, and the rain fell soft and steady, muffling the sound of their horses’ hooves and running down their faces.  They rode north, away from the lake, following a rutted farm road across the torn fields and into the woods and streams. Arya took the lead, kicking her stolen horse to a brisk heedless trot until the trees closed in around her. Hot Pie and Gendry followed as best they could. Wolves howled off in the distance, and she could hear Hot Pie’s heavy breathing. No one spoke. From time to time Arya glanced over her shoulder, to make sure the two boys had not fallen too far behind, and to see if they were being pursued.  They would be, she knew. She had stolen three horses from the stables and a map and a dagger from Roose Bolton’s own solar, and killed a guard on the postern gate, slitting his throat when he knelt to pick up the worn iron coin that Jaqen H’ghar had given her."
}