{
  "id": "609bdab09758d73ea9a124c3ca9f3e437185c658",
  "text": " High above, the men on the Wall saw the column approaching. Jon heard the deep, throaty call of the watchman’s great horn, calling out across the miles; a single long blast that shuddered through the trees and echoed off the ice.  UUUUUUUOOOOOOOOOOOOOOooooooooooooooooooooooo.  The sound faded slowly to silence. One blast meant rangers returning, and Jon thought, I was a ranger for one day, at least. Whatever may come, they cannot take that away from me.  Bowen Marsh was waiting at the first gate as they led their garrons through the icy tunnel. The Lord Steward was red-faced and agitated.  My lord,  he blurted at Mormont as he swung open the iron bars,  there’s been a bird, you must come at once.    What is it, man?  Mormont said gruffly.  Curiously, Marsh glanced at Jon before he answered.  Maester Aemon has the letter. He’s waiting in your solar.    Very well. Jon, see to my horse, and tell Ser Jaremy to put the dead men in a storeroom until the maester is ready for them.  Mormont strode away grumbling.  As they led their horses back to the stable, Jon was uncomfortably aware that people were watching him. Ser Alliser Thorne was drilling his boys in the yard, but he broke off to stare at Jon, a faint half smile on his lips. One-armed Donal Noye stood in the door of the armory.  The gods be with you, Snow,  he called out.  Something’s wrong, Jon thought. Something’s very wrong.  The dead men were carried to one of the storerooms along the base of the Wall, a dark cold cell chiseled from the ice and used to keep meat and grain and sometimes even beer. Jon saw that Mormont’s horse was fed and watered and groomed before he took care of his own. Afterward he sought out his friends. Grenn and Toad were on watch, but he found Pyp in the common hall.  What’s happened?  he asked.  Pyp lowered his voice.  The king’s dead.   Jon was stunned. Robert Baratheon had looked old and fat when he visited Winterfell, yet he’d seemed hale enough, and there’d been no talk of illness.  How can you know?    One of the guards overheard Clydas reading the letter to Maester Aemon.  Pyp leaned close.  Jon, I’m sorry. He was your father’s friend, wasn’t he?    They were as close as brothers, once.  Jon wondered if Joffrey would keep his father as the King’s Hand. It did not seem likely. That might mean Lord Eddard would return to Winterfell, and his sisters as well. He might even be allowed to visit them, with Lord Mormont’s permission. It would be good to see Arya’s grin again and to talk with his father. I will ask him about my mother, he resolved. I am a man now, it is past time he told me. Even if she was a whore, I don’t care, I want to know.   I heard Hake say the dead men were your uncle’s,  Pyp said.   Yes,  Jon replied.  Two of the six he took with him. They’d been dead a long time, only… the bodies are queer.    Queer?  Pyp was all curiosity.  How queer?    Sam will tell you.  Jon did not want to talk of it.  I should see if the Old Bear has need of me.   He walked to the Lord Commander’s Tower alone, with a curious sense of apprehension. The brothers on guard eyed him solemnly as he approached.  The Old Bear’s in his solar,  one of them announced.  He was asking for you.   Jon nodded. He should have come straight from the stable. He climbed the tower steps briskly. He wants wine or a fire in his hearth, that’s all, he told himself.  When he entered the solar, Mormont’s raven screamed at him.  Corn!  the bird shrieked.  Corn! Corn! Corn!    Don’t you believe it, I just fed him,  the Old Bear growled. He was seated by the window, reading a letter.  Bring me a cup of wine, and pour one for yourself.    For myself, my lord?   Mormont lifted his eyes from the letter to stare at Jon. There was pity in that look; he could taste it.  You heard me.   Jon poured with exaggerated care, vaguely aware that he was drawing out the act. When the cups were filled, he would have no choice but to face whatever was in that letter. Yet all too soon, they were filled.  Sit, boy,  Mormont commanded him.  Drink.   Jon remained standing.  It’s my father, isn’t it?   The Old Bear tapped the letter with a finger.  Your father and the king,  he rumbled.  I won’t lie to you, it’s grievous news. I never thought to see another king, not at my age, with Robert half my years and strong as a bull.  He took a gulp of wine.  They say the king loved to hunt. The things we love destroy us every time, lad. Remember that. My son loved that young wife of his. Vain woman. If not for her, he would never have thought to sell those poachers.   Jon could scarcely follow what he was saying.  My lord, I don’t understand. What’s happened to my father?    I told you to sit,  Mormont grumbled.  Sit,  the raven screamed.  And have a drink, damn you. That’s a command, Snow.   Jon sat, and took a sip of wine.   Lord Eddard has been imprisoned. He is charged with treason. It is said he plotted with Robert’s brothers to deny the throne to Prince Joffrey.    No,  Jon said at once."
}