{
  "id": "614d2c71f22a9a61bee5f3bba548a6f313df5e40",
  "text": "   The man squinted down at the parchment.  Writing. What good’s writing? You promised gold. Knight’s honor, you said.    Knights have no bloody honor. Time you learned that, old man.  The Hound gave Stranger the spur and galloped off through the rain. The ferrymen threw curses at their backs, and one or two threw stones. Clegane ignored rocks and words alike, and before long they were lost in the gloom of the trees, the river a dwindling roar behind them.  The ferry won’t cross back till morning,  he said,  and that lot won’t be taking paper promises from the next fools to come along. If your friends are chasing us, they’re going to need to be bloody strong swimmers.   Arya huddled down and held her tongue. Valar morghulis, she thought sullenly. Ser Ilyn, Ser Meryn, King Joffrey, Queen Cersei. Dunsen, Polliver, Raff the Sweetling, Ser Gregor and the Tickler. And the Hound, the Hound, the Hound.  By the time the rain stopped and the clouds broke, she was shivering and sneezing so badly that Clegane called a halt for the night, and even tried to make a fire. The wood they gathered proved too wet, though. Nothing he tried was enough to make the spark catch. Finally he kicked it all apart in disgust.  Seven bloody hells,  he swore.  I hate fires.   They sat on damp rocks beneath an oak tree, listening to the slow patter of water dripping from the leaves as they ate a cold supper of hardbread, moldy cheese, and smoked sausage. The Hound sliced the meat with his dagger, and narrowed his eyes when he caught Arya looking at the knife.  Don’t even think about it.    I wasn’t,  she lied.  He snorted to show what he thought of that, but he gave her a thick slice of sausage. Arya worried it with her teeth, watching him all the while.  I never beat your sister,  the Hound said.  But I’ll beat you if you make me. Stop trying to think up ways to kill me. None of it will do you a bit of good.   She had nothing to say to that. She gnawed on the sausage and stared at him coldly. Hard as stone, she thought.   At least you look at my face. I’ll give you that, you little she-wolf. How do you like it?    I don’t. It’s all burned and ugly.   Clegane offered her a chunk of cheese on the point of his dagger.  You’re a little fool. What good would it do you if you did get away? You’d just get caught by someone worse.    I would not,  she insisted.  There is no one worse.    You never knew my brother. Gregor once killed a man for snoring. His own man.  When he grinned, the burned side of his face pulled tight, twisting his mouth in a queer unpleasant way. He had no lips on that side, and only the stump of an ear.   I did so know your brother.  Maybe the Mountain was worse, now that Arya thought about it.  Him and Dunsen and Polliver, and Raff the Sweetling and the Tickler.   The Hound seemed surprised.  And how would Ned Stark’s precious little daughter come to know the likes of them? Gregor never brings his pet rats to court.    I know them from the village.  She ate the cheese, and reached for a hunk of hardbread.  The village by the lake where they caught Gendry, me, and Hot Pie. They caught Lommy Greenhands too, but Raff the Sweetling killed him because his leg was hurt.   Clegane’s mouth twitched.  Caught you? My brother caught you?  That made him laugh, a sour sound, part rumble and part snarl.  Gregor never knew what he had, did he? He couldn’t have, or he would have dragged you back kicking and screaming to King’s Landing and dumped you in Cersei’s lap. Oh, that’s bloody sweet. I’ll be sure and tell him that, before I cut his heart out.   It wasn’t the first time he had talked of killing the Mountain.  But he’s your brother,  Arya said dubiously.   Didn’t you ever have a brother you wanted to kill?  He laughed again.  Or maybe a sister?  He must have seen something in her face then, for he leaned closer.  Sansa. That’s it, isn’t it? The wolf bitch wants to kill the pretty bird.    No,  Arya spat back at him.  I’d like to kill you.    Because I hacked your little friend in two? I’ve killed a lot more than him, I promise you. You think that makes me some monster. Well, maybe it does, but I saved your sister’s life too. The day the mob pulled her off her horse, I cut through them and brought her back to the castle, else she would have gotten what Lollys Stokeworth got. And she sang for me. You didn’t know that, did you? Your sister sang me a sweet little song.    You’re lying,  she said at once.   You don’t know half as much as you think you do. The Blackwater? Where in seven hells do you think we are? Where do you think we’re going?   The scorn in his voice made her hesitate.  Back to King’s Landing,  she said.  You’re bringing me to Joffrey and the queen.  That was wrong, she realized all of a sudden, just from the way he asked the questions. But she had to say something.   Stupid blind little wolf bitch.  His voice was rough and hard as an iron rasp.  Bugger Joffrey, bugger the queen, and bugger that twisted little gargoyle she calls a brother."
}