{
  "id": "6382952249b3fe5538479eee3144aad9378933fb",
  "text": "  The little man gave the big one a look. One of his eyes was green, one was black, and both were cool.  I was speaking to the king, not to his cur.    I’m glad you’re not dead,  said Princess Myrcella.   We share that view, sweet child.  Tyrion turned to Sansa.  My lady, I am sorry for your losses. Truly, the gods are cruel.   Sansa could not think of a word to say to him. How could he be sorry for her losses? Was he mocking her? It wasn’t the gods who’d been cruel, it was Joffrey.   I am sorry for your loss as well, Joffrey,  the dwarf said.   What loss?    Your royal father? A large fierce man with a black beard; you’ll recall him if you try. He was king before you.    Oh, him. Yes, it was very sad, a boar killed him.    Is that what ‘they’ say, Your Grace?   Joffrey frowned. Sansa felt that she ought to say something. What was it that Septa Mordane used to tell her? A lady’s armor is courtesy, that was it. She donned her armor and said,  I’m sorry my lady mother took you captive, my lord.    A great many people are sorry for that,  Tyrion replied,  and before I am done, some may be a deal sorrier… yet I thank you for the sentiment. Joffrey, where might I find your mother?    She’s with my council,  the king answered.  Your brother Jaime keeps losing battles.  He gave Sansa an angry look, as if it were her fault.  He’s been taken by the Starks and we’ve lost Riverrun and now her stupid brother is calling himself a king.   The dwarf smiled crookedly.  All sorts of people are calling themselves kings these days.   Joff did not know what to make of that, though he looked suspicious and out of sorts.  Yes. Well. I am pleased you’re not dead, Uncle. Did you bring me a gift for my name day?    I did. My wits.    I’d sooner have Robb Stark’s head,  Joff said with a sly glance at Sansa.  Tommen, Myrcella, come.   Sandor Clegane lingered behind a moment.  I’d guard that tongue of yours, little man,  he warned, before he strode off after his liege.  Sansa was left with the dwarf and his monsters. She tried to think of what else she might say.  You hurt your arm,  she managed at last.   One of your northmen hit me with a morningstar during the battle on the Green Fork. I escaped him by falling off my horse.  His grin turned into something softer as he studied her face.  Is it grief for your lord father that makes you so sad?    My father was a traitor,  Sansa said at once.  And my brother and lady mother are traitors as well.  That reflex she had learned quickly.  I am loyal to my beloved Joffrey.    No doubt. As loyal as a deer surrounded by wolves.    Lions,  she whispered, without thinking. She glanced about nervously, but there was no one close enough to hear.  Lannister reached out and took her hand, and gave it a squeeze.  I am only a little lion, child, and I vow, I shall not savage you.  Bowing, he said  But now you must excuse me. I have urgent business with queen and council.   Sansa watched him walk off, his body swaying heavily from side to side with every step, like something from a grotesquerie. He speaks more gently than Joffrey, she thought, but the queen spoke to me gently too. He’s still a Lannister, her brother and Joff’s uncle, and no friend. Once she had loved Prince Joffrey with all her heart, and admired and trusted his mother, the queen. They had repaid that love and trust with her father’s head. Sansa would never make that mistake again.      TYRION  In the chilly white raiment of the Kingsguard, Ser Mandon Moore looked like a corpse in a shroud.  Her Grace left orders, the council in session is not to be disturbed.    I would be only a small disturbance, ser.  Tyrion slid the parchment from his sleeve.  I bear a letter from my father, Lord Tywin Lannister, the Hand of the King. There is his seal.    Her Grace does not wish to be disturbed,  Ser Mandon repeated slowly, as if Tyrion were a dullard who had not heard him the first time.  Jaime had once told him that Moore was the most dangerous of the Kingsguard—excepting himself, always—because his face gave no hint as what he might do next. Tyrion would have welcomed a hint. Bronn and Timett could likely kill the knight if it came to swords, but it would scarcely bode well if he began by slaying one of Joffrey’s protectors. Yet if he let the man turn him away, where was his authority? He made himself smile.  Ser Mandon, you have not met my companions. This is Timett son of Timett, a red hand of the Burned Men. And this is Bronn. Perchance you recall Ser Vardis Egen, who was captain of Lord Arryn’s household guard?    I know the man.  Ser Mandon’s eyes were pale grey, oddly flat and lifeless.   Knew,  Bronn corrected with a thin smile.  Ser Mandon did not deign to show that he had heard that.   Be that as it may,  Tyrion said lightly,  I truly must see my sister and present my letter, ser. If you would be so kind as to open the door for us?   The white knight did not respond. Tyrion was almost at the point of trying to force his way past when Ser Mandon abruptly stood aside."
}