{
  "id": "6466911b00e1f1f8d09b482ecbe0e773f3d458b5",
  "text": "  Tastes well bred.    Better if you fry it up with onions,  Bronn put in.  Wordlessly, Tyrion limped away. The cold had settled deep in his bones, and his legs were so sore he could scarcely walk. Perhaps his dead mare was the lucky one. He had hours more riding ahead of him, followed by a few mouthfuls of food and a short, cold sleep on hard ground, and then another night of the same, and another, and another, and the gods only knew how it would end.  Damn her,  he muttered as he struggled up the road to rejoin his captors, remembering,  damn her and all the Starks.   The memory was still bitter. One moment he’d been ordering supper, and an eye blink later he was facing a room of armed men, with Jyck reaching for a sword and the fat innkeep shrieking,  No swords, not here, please, m’lords.   Tyrion wrenched down Jyck’s arm hurriedly, before he got them both hacked to pieces.  Where are your courtesies, Jyck? Our good hostess said no swords. Do as she asks.  He forced a smile that must have looked as queasy as it felt.  You’re making a sad mistake, Lady Stark. I had no part in any attack on your son. On my honor—    Lannister honor,  was all she said. She held up her hands for all the room to see.  His dagger left these scars. The blade he sent to open my son’s throat.   Tyrion felt the anger all around him, thick and smoky, fed by the deep cuts in the Stark woman’s hands.  Kill him,  hissed some drunken slattern from the back, and other voices took up the call, faster than he would have believed. Strangers all, friendly enough only a moment ago, and yet now they cried for his blood like hounds on a trail.  Tyrion spoke up loudly, trying to keep the quaver from his voice.  If Lady Stark believes I have some crime to answer for, I will go with her and answer for it.   It was the only possible course. Trying to cut their way out of this was a sure invitation to an early grave. A good dozen swords had responded to the Stark woman’s plea for help: the Harrenhal man, the three Brackens, a pair of unsavory sellswords who looked as though they’d kill him as soon as spit, and some fool field hands who doubtless had no idea what they were doing. Against that, what did Tyrion have? A dagger at his belt, and two men. Jyck swung a fair enough sword, but Morrec scarcely counted; he was part groom, part cook, part body servant, and no soldier. As for Yoren, whatever his feelings might have been, the black brothers were sworn to take no part in the quarrels of the realm. Yoren would do nothing.  And indeed, the black brother stepped aside silently when the old knight by Catelyn Stark’s side said,  Take their weapons,  and the sellsword Bronn stepped forward to pull the sword from Jyck’s fingers and relieve them all of their daggers.  Good,  the old man said as the tension in the common room ebbed palpably,  excellent.  Tyrion recognized the gruff voice; Winterfell’s master-at-arms, shorn of his whiskers.  Scarlet-tinged spittle flew from the fat innkeep’s mouth as she begged of Catelyn Stark,  Don’t kill him here!    Don’t kill him anywhere,  Tyrion urged.   Take him somewheres else, no blood here, m’lady, I wants no high lordlin’s quarrels.    We are taking him back to Winterfell,  she said, and Tyrion thought, Well, perhaps… By then he’d had a moment to glance over the room and get a better idea of the situation. He was not altogether displeased by what he saw. Oh, the Stark woman had been clever, no doubt of it. Force them to make a public affirmation of the oaths sworn her father by the lords they served, and then call on them for succor, and her a woman, yes, that was sweet. Yet her success was not as complete as she might have liked. There were close to fifty in the common room by his rough count. Catelyn Stark’s plea had roused a bare dozen; the others looked confused, or frightened, or sullen. Only two of the Freys had stirred, Tyrion noted, and they’d sat back down quick enough when their captain failed to move. He might have smiled if he’d dared.   Winterfell it is, then,  he said instead. That was a long ride, as he could well attest, having just ridden it the other way. So many things could happen along the way.  My father will wonder what has become of me,  he added, catching the eye of the swordsman who’d offered to yield up his room.  He’ll pay a handsome reward to any man who brings him word of what happened here today.  Lord Tywin would do no such thing, of course, but Tyrion would make up for it if he won free.  Ser Rodrik glanced at his lady, his look worried, as well it might be.  His men come with him,  the old knight announced.  And we’ll thank the rest of you to stay quiet about what you’ve seen here.   It was all Tyrion could do not to laugh. Quiet? The old fool. Unless he took the whole inn, the word would begin to spread the instant they were gone. The freerider with the gold coin in his pocket would fly to Casterly Rock like an arrow. If not him, then someone else. Yoren would carry the story south."
}