{
  "id": "647118fe3039ab57b88d43f67167d5702416d36b",
  "text": "  Bilbo  Baggins.  And  you  do  know  my  name,  though  you  don't  remember  that  I  belong  to  it.  I  am   ####-Gandalf,  and  Gandalf  means  me!  To  think  that  I  should  have  lived  to  be  good- morninged by Belladonna Took's son, as if I was selling buttons at the door!\"  \"Gandalf,  Gandalf!  Good  gracious  me!  Not  the  wandering  wizard  that  gave  Old Took a pair of magic diamond studs that fastened themselves and never came  undone  till  ordered?  Not  the  fellow  who  used  to  tell  such  wonderful  tales  at  parties, about dragons and goblins and giants and  the rescue of princesses and  the  unexpected  luck  of  widows'  sons?  Not  the  man  that  used  to  make  such  particularly  excellent  fireworks!  I  remember  those!  Old  Took  used  to  have  them  on  Midsummer's  Eve.  Splendid!  They  used  to  go  up  like  great  lilies  and  snapdragons and laburnums of fire and hang in the twilight all evening!\" You will  notice already that Mr. Baggins was not quite so prosy as he liked to believe, also  that  he was  very  fond  of  flowers. \"Dear me!\" she went on. \"Not  the Gandalf who  was  responsible  for so many quiet  lads and  lasses going off  into  the Blue  for mad  adventures.  Anything  from  climbing  trees  to  visiting  Elves  -  or  sailing  in  ships,  sailing  to other  shores! Bless me,  life used  to be quite  inter  - I mean, you used  to  upset things badly in these parts once upon a time. I beg your pardon, but I had no  idea you were still in business.\"  \"Where else  should  I be?\"  said  the wizard.  \"All  the  same  I am pleased  to  find  you  remember  something about me. You seem  to  remember my  fireworks kindly,  at any  rate,  land  that  is not without hope.  Indeed  for your old grand-father Took's  sake, and for the sake of poor Belladonna, I will give you what you asked for.\"  \"I beg your pardon, I haven't asked for anything!\"  \"Yes, you have! Twice now. My pardon. I give it you. In fact I will go so far as  to  send  you  on  this  adventure.  Very  amusing  for  me,  very  good  for  you  and  profitable too, very likely, if you ever get over it.\"  \"Sorry!  I  don't  want  any  adventures,  thank  you.  Not  today.  Good  morning!  But please come to tea - any time you like! Why not tomorrow? Come tomorrow!  Good-bye!\"  With  that  the hobbit  turned and  scuttled  inside his  round green door, and  shut  it as quickly as he dared, not to seen rude. Wizards after all are wizards.  \"What on earth did I ask him to tea for!\" he said to him-self, as he went to the  pantry. He had only  just had break  fast, but he  thought a cake or  two and a drink  of  something  would  do  him  good  after  his  fright.  Gandalf  in  the  meantime  was  still  standing  outside  the  door,  and  laughing  long  but  quietly.  After  a  while  he  stepped  up,  and  with  the  spike  of  his  staff  scratched  a  queer  sign  on  the  hobbit's  beautiful  green  front-door.  Then  he  strode  away,  just  about  the  time  when  Bilbo   ####-was  finishing  his  second  cake  and  beginning  to  think  that  he  had  escape  adventures very well.  The  next  day  he  had  almost  forgotten  about  Gandalf  He  did  not  remember  things  very  well,  unless  he  put  them  down  on  his  Engagement  Tablet:  like  this:  Gandalf մa Wednesday. Yesterday he had been too flustered to do anything of the  kind. Just before tea-time there came a tremendous ring on the front-door bell, and  then he remembered! He rushed and put on the kettle, and put out another cup and  saucer and an extra cake or two, and ran to the door.   \"I am so sorry  to keep you waiting!\" he was going  to say, when he saw  that  it  was not Gandalf at all. It was a dwarf with a blue beard tucked into a golden belt,  and  very  bright  eyes  under  his  dark-green hood.  As  soon a  the door was opened,  he pushed inside, just as if he had been expected.  He hung his hooded cloak on the nearest peg, and \"Dwalin at your service!\" he  said with a low bow.   \"Bilbo  Baggins  at  yours!\"  said  the  hobbit,  too  surprised  to  ask  any  questions  for  the  moment.  When  the  silence  that  followed  had  become  uncomfortable,  he  added:  \"I  am  just  about  to  take  tea;  pray  come  and  have  some with me.\" A  little  stiff  perhaps,  but  he  meant  it  kindly.  And  what  would  you  do,  if  an  uninvited  dwarf came and hung his things up in your hall without a word of explanation?  They had not been at table long, in fact they had hardly reached the third cake,  when there came another even louder ring at the bell.  \"Excuse me!\" said the hobbit, and off he went to the door.   \"So  you  have  got  here  at  last!\" was what  he was  going  to  say  to Gandalf  this  time.  But  it  was  not  Gandalf.  Instead  there  was  a  very  old-looking  dwarf  on  the  step with a white beard and a scarlet hood; and he too hopped inside as soon as the  door was open, just as if he had been invited."
}