{
  "id": "68c06b376bc5e83094265758b9f19246cc8cda1b",
  "text": " Some  had  gone north beyond the  springs of the Hoarwell into the Ettenmoors;  and others had gone west,  and   with the help of Aragorn and the Rangers had searched the lands far down the  Greyflood, as far as Tharbad, where the old North Road crossed  the river by  a ruined town. Many had gone east and south; and some  of these had  crossed  the Mountains and entered Mirkwood, while others had climbed the pass at the  source of the Gladden River, and had come  down into Wilderland and over the  Gladden  Fields  and so at  length had reached the old  home  of Radagast at  Rhosgobel. Radagast was not there; and they had  returned over the high pass  that was called the Dimrill Stair. The sons of Elrond, Elladan and  Elrohir,  were the  last  to return;  they had  made a great journey, passing down the   ####-Silverlode into  a strange country, but of their errand they would not speak  to any save to Elrond.       In no region had the messengers discovered any signs or tidings  of the  Riders  or other  servants of the  Enemy. Even from the Eagles of the  Misty  Mountains they had learned no fresh news. Nothing had been seen  or heard of  Gollum; but the wild wolves were still gathering, and were hunting again far   up the Great River. Three of the black horses had been found at once drowned  in  the flooded Ford.  On  the  rocks  of  the  rapids  below  it  searchers  discovered the bodies of five more, and also a long black cloak, slashed and  tattered. Of the Black Riders no other trace was to be seen, and nowhere was  their presence to be felt. It seemed that they had vanished from the North.        'Eight  out of the Nine are  accounted for at least, ' said Gandalf. 'It  is  rash  to  be  too  sure,  yet I think that  we  may hope  now  that  the  Ringwraiths  were  scattered,  and  have been obliged to return as best they  could to their Master in Mordor, empty and shapeless.        `If that  is so,  it wi ll be some time before they  can begin the  hunt  again. Of course the Enemy has other servants, but they will have to journey  all the way to  the borders of Rivendell before they can pick  up our trail.  And  if we are  careful that  will be  hard to find.  But  we  must delay no  longer.'       Elrond  summoned the hobbits to him.  He looked gravely  at Frodo. 'The  time has  come,' he said.  `If the Ring is to set out, it  must go soon. But  those who go with it must  not  count on their  errand being aided by  war or  force.  They  must pass into the domain of  the Enemy far from  aid. Do  you   still hold to your word, Frodo, that you will be the Ring-bearer?'       'I do,' said Frodo. `I will go with Sam.'       `Then  I cannot help you  much, not even with counsel,' said Elrond. `I   can foresee very little of your road; and how your task is to be achieved  I  do not know. The  Shadow has  crept now  to the  feet  of the Mountains, and  draws nigh even  to  the  borders of Greyflood; and  under the Shadow all is  dark to me. You will meet many foes, some open, and some disguised; and   you  may find friends upon your way when you  least look for it. I will send  out  messages, such  as I can contrive, to  those  whom I know in the wide world;   but so  perilous are the  lands now become that some  may well  miscarry, or   come no quicker than you yourself.        `And I will choose you companions to go with  you, as far as  they will   ####-or fortune  allows. The number must be  few, since your hope is in speed and  secrecy. Had  I a host of Elves  in armour of the Elder Days, it would avail  little, save to arouse the power of Mordor.       `The Company of the Ring  shall be Nine;  and the Nine Walkers shall be  set  against  the  Nine Riders  that are  evil. With you and  your  faithful  servant, Gandalf will go;  for this shall be his  great task,  and maybe the  end of his labours.        `For  the  rest, they  shall represent the  other  Free Peoples  of the  World:  Elves, Dwarves, and  Men. Legolas  shall be for the Elves; and Gimli  son of Gluin for the Dwarves. They are willing to go at least  to the passes  of the  Mountains,  and maybe beyond. For men you shall have  Aragorn son of  Arathorn, for the Ring of Isildur concerns him closely.'       `Strider!' said Frodo.       'Yes,' he  said  with  a  smile.  `I ask  leave  once again to be  your  companion, Frodo.'       `I would have begged you to come,' said Frodo, 'only I thought you were  going to Minas Tirith with Boromir.'       `I am,' said  Aragorn. `And the Sword-that-was-Broken shall be reforged  ere I  set out to  war. But your road  and our  road  lie  together for many  hundreds  of  miles. Therefore Boromir  will also be in the Company. He is a  valiant man.'       'There remain  two more  to  be  found,'  said  Elrond.  \"These  I will  consider. Of my household I may find some that it seems good to me to send.'       `But  that will leave  no place for  us!'  cried Pippin in  dismay. `We  don't want to be left behind."
}