{
  "id": "69119b534bf463e591831ba876be8e292dbcf256",
  "text": " For  Treebeard is Fangorn, and  the eldest and chief of the  Ents, and when you speak with him you will hear   the speech of the oldest of all living things.'       'I  will come with you,' said  Thjoden. 'Farewell, my hobbits!  May  we  meet again in my house! There  you shall sit beside me and tell  me all that  your hearts desire: the deeds of your grandsires,  as far as  you can reckon  them; and we will speak also of Tobold the Old and his herb-lore. Farewell!'       The hobbits bowed low. 'So that  is the King of Rohan!'  said Pippin in  an undertone.  'A fine old fellow. Very polite.'   ####-   Chapter 9. Flotsam and Jetsam            Gandalf and the King's  company rode away, turning eastward to make the  circuit of the ruined  walls of Isengard.  But  Aragorn, Gimli,  and Legolas  remained behind. Leaving Arod and Hasufel to  stray in search of grass, they  came and sat beside the hobbits.       'Well, well! The hunt is over, and we meet again at last, where none of  us ever thought to come,' said Aragorn.       'And now  that the  great ones have gone to discuss high matters,' said  Legolas,  'the hunters  can  per haps learn the  answers  to  their own small  riddles. We tracked you  as  far  as  the forest, but there  are  still many  things that I should like to know the truth of.'       'And there is a great deal, too, that we want to  know about you ' said  Merry.  'We have learnt a few things through Treebeard, the Old Ent, but that  is not nearly enough.'       'All  in good time,' said Legolas. 'We were the hunters, and you should  give an account of yourselves to us first.'       'Or  second,' said Gimli. 'It would  go better after a meal. t  have  a   sore head; and it is past mid-day. You truants might make  amends by finding  us some of the plunder that you spoke  of. Food and drink would pay off some  of my score against you.'       'Then you shall  have  it,' said Pippin.  'Will you have it here, or in  more  comfort in what's left of Saruman's guard-house--over  there under the  arch? We had to picnic out here, so as to keep an eye on the road.'       'Less than an eye!' said Gimli. 'But  I will not go into  any orc-house  nor touch Orcs' meat or anything that they have mauled.'       'We wouldn't  ask  you  to,' said Merry. 'We have had  enough  of  Orcs  ourselves to last a life-time. But there  were  many other folk in Isengard.  Saruman  kept enough wisdom not  to  trust his Orcs. He had Men to guard his  gates:  some of his  most faithful  servants,  I  suppose. Anyway  they were  favoured and got good provisions.'       'And pipe-weed?' asked Gimli.       'No,  I  don't  think  so,' Merry laughed. 'But that  is another story,  which can wait until after lunch.'       'Well let us go and have lunch then!' said the Dwarf.   ####-     The hobbits led the way; and they  passed under the arch  and came to a   wide  door upon the  left, at  the  top of a stair. It opened  direct into a   large chamber,  with other smaller  doors  at the far end,  and a hearth and  chimney at one side. The chamber was hewn out of the stone; and it must once  have  been dark, for its windows looked out only into the  tunnel. But light  came in now through the broken roof. On the hearth wood was burning.       'I  lit a  bit of fire,' said Pippin. 'It cheered us up  in  the  fogs.   There were few faggots about, and  most of the  wood we could find was  wet.  But  there  is  a great draught in  the  chimney:  it seems  to wind away up  through the rock, and fortunately it has not been blocked. A fire  is handy.  I  will  make you some toast. The bread is  three  or four days  old,  I  am  afraid.'       Aragorn and his  companions sat  themselves down at  one  end of a long  table,  and  the  hobbits  disappeared  through  one  of  the  inner  doors.  'Store-room  in there,  and above  the woods, luckily,' said Pippin, as they  came back laden with dishes, bowls, cups, knives, and food of various sorts.        'And  you need not  turn up your nose at the provender,  Master Gimli,'  said Merry. 'This is  not orc-stuff, but  man-food, as  Treebeard calls  it.  Will you have wine or beer? There's a barrel  inside there -- very passable.  And this is first-rate salted pork. Or  I can cut you  some rashers of bacon  and  broil them,  if you like.  I am  sorry there  is no  green  stuff:  the  deliveries have been rather interrupted in the last few days! I cannot offer   you  anything  to follow  but butter and  honey  for  your  bread.  Are  you   content?'       'Indeed yes,' said Gimli. 'The score is much reduced.'       The  three  were  soon  busy  with  their meal;  and the  two  hobbits,  unabashed,  set  to  a second time. 'We  must keep our guests company,' they   said.       'You  are full of courtesy this  morning,' laughed Legolas.  'But maybe.  if  we  had  not arrived, you  would already have been keeping  one  another   company again.'       'Maybe; and why not?' said Pippin. 'We had foul fare with the Orcs, and  little enough for days before that."
}