{
  "id": "6c0be23e78dc3bff23443d5001a36dbff6657845",
  "text": "  Elenya.  The little girl did a quick curtsy.  Rollam Westerling, my squire.  The boy started to kneel, saw no one else was kneeling, and bowed instead.   The honor is mine,  Catelyn said. Can Robb have won the Crag’s allegiance? If so, it was no wonder the Westerlings were with him. Casterly Rock did not suffer such betrayals gently. Not since Tywin Lannister had been old enough to go to war…  The maid came forward last, and very shy. Robb took her hand.  Mother,  he said,  I have the great honor to present you the Lady Jeyne Westerling. Lord Gawen’s elder daughter, and my… ah… my lady wife.   The first thought that flew across Catelyn’s mind was, No, that cannot be, you are only a child.  The second was, And besides, you have pledged another.  The third was, Mother have mercy, Robb, what have you done?  Only then came her belated remembrance. Follies done for love? He has bagged me neat as a hare in a snare. I seem to have already forgiven him. Mixed with her annoyance was a rueful admiration; the scene had been staged with the cunning worthy of a master mummer… or a king. Catelyn saw no choice but to take Jeyne Westerling’s hands.  I have a new daughter,  she said, more stiffly than she’d intended. She kissed the terrified girl on both cheeks.  Be welcome to our hall and hearth.    Thank you, my lady. I shall be a good and true wife to Robb, I swear. And as wise a queen as I can.   Queen. Yes, this pretty little girl is a queen, I must remember that. She was pretty, undeniably, with her chestnut curls and heart-shaped face, and that shy smile. Slender, but with good hips, Catelyn noted. She should have no trouble bearing children, at least.  Lady Sybell took a hand before any more was said.  We are honored to be joined to House Stark, my lady, but we are also very weary. We have come a long way in a short time. Perhaps we might retire to our chambers, so you may visit with your son?    That would be best.  Robb kissed his Jeyne.  The steward will find you suitable accommodations.    I’ll take you to him,  Ser Edmure Tully volunteered.   You are most kind,  said Lady Sybell.   Must I go too?  asked the boy, Rollam.  I’m your squire.   Robb laughed.  But I’m not in need of squiring just now.    Oh.    His Grace has gotten along for sixteen years without you, Rollam,  said Ser Raynald of the seashells.  He will survive a few hours more, I think.  Taking his little brother firmly by the hand, he walked him from the hall.   Your wife is lovely,  Catelyn said when they were out of earshot,  and the Westerlings seem worthy… though Lord Gawen is Tywin Lannister’s sworn man, is he not?    Yes. Jason Mallister captured him in the Whispering Wood and has been holding him at Seagard for ransom. Of course I’ll free him now, though he may not wish to join me. We wed without his consent, I fear, and this marriage puts him in dire peril. The Crag is not strong. For love of me, Jeyne may lose all.    And you,  she said softly,  have lost the Freys.   His wince told all. She understood the angry voices now, why Perwyn Frey and Martyn Rivers had left in such haste, trampling Robb’s banner into the ground as they went.   Dare I ask how many swords come with your bride, Robb?    Fifty. A dozen knights.  His voice was glum, as well it might be. When the marriage contract had been made at the Twins, old Lord Walder Frey had sent Robb off with a thousand mounted knights and near three thousand foot.  Jeyne is bright as well as beautiful. And kind as well. She has a gentle heart.   It is swords you need, not gentle hearts. How could you do this, Robb? How could you be so heedless, so stupid? How could you be so… so very… young. Reproaches would not serve here, however. All she said was,  Tell me how this came to be.    I took her castle and she took my heart.,’ Robb smiled.  The Crag was weakly garrisoned, so we took it by storm one night. Black Walder and the Smalljon led scaling parties over the walls, while I broke the main gate with a ram. I took an arrow in the arm just before Ser Rolph yielded us the castle. It seemed nothing at first, but it festered. Jeyne had me taken to her own bed, and she nursed me until the fever passed. And she was with me when the Greatjon brought me the news of… of Winterfell. Bran and Rickon.  He seemed to have trouble saying his brothers’ names.  That night, she… she comforted me, Mother.   Catelyn did not need to be told what sort of comfort Jeyne Westerling had offered her son.  And you wed her the next day.   He looked her in the eyes, proud and miserable all at once.  It was the only honorable thing to do. She’s gentle and sweet, Mother, she will make me a good wife.    Perhaps. That will not appease Lord Frey.    I know,  her son said, stricken.  I’ve made a botch of everything but the battles, haven’t I? I thought the battles would be the hard part, but… if I had listened to you and kept Theon as my hostage, I’d still rule the north, and Bran and Rickon would be alive and safe in Winterfell."
}