{
  "id": "6ddbc3627d83dc2699704d01c8fe87e3536724ee",
  "text": " But they will not fail. My father knew the worth of Howland Reed.  Robb rolled up the map, and only then looked at Catelyn.  Mother.   She tensed.  Do you have some part in this for me?    Your part is to stay safe. Our journey through the Neck will be dangerous, and naught but battle awaits us in the north. But Lord Mallister has kindly offered to keep you safe at Seagard until the war is done. You will be comfortable there, I know.   Is this my punishment for opposing him about Jon Snow? Or for being a woman, and worse, a mother? It took her a moment to realize that they were all watching her. They had known, she realized. Catelyn should not have been surprised. She had won no friends by freeing the Kingslayer, and more than once she had heard the Greatjon say that women had no place on a battlefield.  Her anger must have blazed across her face, because Galbart Glover spoke up before she said a word.  My lady, His Grace is wise. It’s best you do not come with us.    Seagard will be brightened by your presence, Lady Catelyn,  said Lord Jason Mallister.   You would make me a prisoner,  she said.   An honored guest,  Lord Jason insisted.  Catelyn turned to her son.  I mean no offense to Lord Jason,  she said stiffly,  but if I cannot continue on with you, I would sooner return to Riverrun.    I left my wife at Riverrun. I want my mother elsewhere. If you keep all your treasures in one purse, you only make it easier for those who would rob you. After the wedding, you shall go to Seagard, that is my royal command.  Robb stood, and as quick as that, her fate was settled. He picked up a sheet of parchment.  One more matter. Lord Balon has left chaos in his wake, we hope. I would not do the same. Yet I have no son as yet, my brothers Bran and Rickon are dead, and my sister is wed to a Lannister. I’ve thought long and hard about who might follow me. I command you now as my true and loyal lords to fix your seals to this document as witnesses to my decision.   A king indeed, Catelyn thought, defeated. She could only hope that the trap he’d planned for Moat Cailin worked as well as the one in which he’d just caught her.      Samwell   Whitetree, Sam thought. Please, let this be Whitetree. He remembered Whitetree. Whitetree was on the maps he’d drawn, on their way north. If this village was Whitetree, he knew where they were. Please, it has to be. He wanted that so badly that he forgot his feet for a little bit, he forgot the ache in his calves and his lower back and the stiff frozen fingers he could scarcely feel. He even forgot about Lord Mormont and Craster and the wights and the Others. Whitetree, Sam prayed, to any god that might be listening.  All wildling villages looked much alike, though. A huge weirwood grew in the center of this one… but a white tree did not mean Whitetree, necessarily. Hadn’t the weirwood at Whitetree been bigger than this one? Maybe he was remembering it wrong. The face carved into the bone pale trunk was long and sad; red tears of dried sap leaked from its eyes. Was that how it looked when we came north? Sam couldn’t recall.  Around the tree stood a handful of one-room hovels with sod roofs, a longhall built of logs and grown over with moss, a stone well, a sheepfold… but no sheep, nor any people. The wildlings had gone to join Mance Rayder in the Frostfangs, taking all they owned except their houses. Sam was thankful for that. Night was coming on, and it would be good to sleep beneath a roof for once. He was so tired. It seemed as though he had been walking half his life. His boots were falling to pieces, and all the blisters on his feet had burst and turned to callus, but now he had new blisters under the callus, and his toes were getting frostbitten.  But it was either walk or die, Sam knew. Gilly was still weak from childbirth and carrying the babe besides; she needed the horse more than he did. The second horse had died on them three days out from Craster’s Keep. It was a wonder she lasted that long, poor half-starved thing. Sam’s weight had probably done for her. They might have tried riding double, but he was afraid the same thing would happen again. It’s better that I walk.  Sam left Gilly in the longhall to make a fire while he poked his head into the hovels. She was better at making fires; he could never seem to get the kindling to catch, and the last time he’d tried to strike a spark off flint and steel he managed to cut himself on his knife. Gilly bound up the gash for him, but his hand was stiff and sore, even clumsier than it had been before. He knew he should wash the wound and change the binding, but he was afraid to look at it. Besides, it was so cold that he hated taking off his gloves.  Sam did not know what he hoped to find in the empty houses. Maybe the wildlings had left some food behind. He had to take a look. Jon had searched the huts at Whitetree, on their way north. Inside one hovel Sam heard a rustling of rats from a dark corner, but otherwise there was nothing in any of them but old straw, old smells, and some ashes beneath the smoke hole."
}