{
  "id": "701d2529e86682585bf4c7ffe7f5002f65dde4fc",
  "text": " What did he care about ravens and doves? If the old man had something to say to him, why couldn’t he just say it?   Jon, did you ever wonder why the men of the Night’s Watch take no wives and father no children?  Maester Aemon asked.  Jon shrugged.  No.  He scattered more meat. The fingers of his left hand were slimy with blood, and his right throbbed from the weight of the bucket.   So they will not love,  the old man answered,  for love is the bane of honor, the death of duty.   That did not sound right to Jon, yet he said nothing. The maester was a hundred years old, and a high officer of the Night’s Watch; it was not his place to contradict him.  The old man seemed to sense his doubts.  Tell me, Jon, if the day should ever come when your lord father must needs choose between honor on the one hand and those he loves on the other, what would he do?   Jon hesitated. He wanted to say that Lord Eddard would never dishonor himself, not even for love, yet inside a small sly voice whispered, He fathered a bastard, where was the honor in that? And your mother, what of his duty to her, he will not even say her name.  He would do whatever was right,  he said… ringingly, to make up for his hesitation.  No matter what.    Then Lord Eddard is a man in ten thousand. Most of us are not so strong. What is honor compared to a woman’s love? What is duty against the feel of a newborn son in your arms… or the memory of a brother’s smile? Wind and words. Wind and words. We are only human, and the gods have fashioned us for love. That is our great glory, and our great tragedy.   The men who formed the Night’s Watch knew that only their courage shielded the realm from the darkness to the north. They knew they must have no divided loyalties to weaken their resolve. So they vowed they would have no wives nor children.   Yet brothers they had, and sisters. Mothers who gave them birth, fathers who gave them names. They came from a hundred quarrelsome kingdoms, and they knew times may change, but men do not. So they pledged as well that the Night’s Watch would take no part in the battles of the realms it guarded.   They kept their pledge. When Aegon slew Black Harren and claimed his kingdom, Harren’s brother was Lord Commander on the Wall, with ten thousand swords to hand. He did not march. In the days when the Seven Kingdoms were seven kingdoms, not a generation passed that three or four of them were not at war. The Watch took no part. When the Andals crossed the narrow sea and swept away the kingdoms of the First Men, the sons of the fallen kings held true to their vows and remained at their posts. So it has always been, for years beyond counting. Such is the price of honor.   A craven can be as brave as any man, when there is nothing to fear. And we all do our duty, when there is no cost to it. How easy it seems then, to walk the path of honor. Yet soon or late in every man’s life comes a day when it is not easy, a day when he must choose.   Some of the ravens were still eating, long stringy bits of meat dangling from their beaks. The rest seemed to be watching him. Jon could feel the weight of all those tiny black eyes.  And this is my day… is that what you’re saying?   Maester Aemon turned his head and looked at him with those dead white eyes. It was as if he were seeing right into his heart. Jon felt naked and exposed. He took the bucket in both hands and flung the rest of the slops through the bars. Strings of meat and blood flew everywhere, scattering the ravens. They took to the air, shrieking wildly. The quicker birds snatched morsels on the wing and gulped them down greedily. Jon let the empty bucket clang to the floor.  The old man laid a withered, spotted hand on his shoulder.  It hurts, boy,  he said softly.  Oh, yes. Choosing… it has always hurt. And always will. I know.    You don’t know,  Jon said bitterly.  No one knows. Even if I am his bastard, he’s still my father…   Maester Aemon sighed.  Have you heard nothing I’ve told you, Jon? Do you think you are the first?  He shook his ancient head, a gesture weary beyond words.  Three times the gods saw fit to test my vows. Once when I was a boy, once in the fullness of my manhood, and once when I had grown old. By then my strength was fled, my eyes grown dim, yet that last choice was as cruel as the first. My ravens would bring the news from the south, words darker than their wings, the ruin of my House, the death of my kin, disgrace and desolation. What could I have done, old, blind, frail? I was helpless as a suckling babe, yet still it grieved me to sit forgotten as they cut down my brother’s poor grandson, and his son, and even the little children…   Jon was shocked to see the shine of tears in the old man’s eyes.  Who are you?  he asked quietly, almost in dread.  A toothless smile quivered on the ancient lips.  Only a maester of the Citadel, bound in service to Castle Black and the Night’s Watch. In my order, we put aside our house names when we take our vows and don the collar."
}