{
  "id": "70a8206f3564f2bfff3feff5e42303d19e694ac3",
  "text": " Once he does so, I shall release my own captives taken in the Whispering Wood and the Battle of the Camps, save Jaime Lannister alone, who will remain my hostage for his father’s good behavior.   She studied Theon Greyjoy’s sly smile, wondering what it meant. That young man had a way of looking as though he knew some secret jest that only he was privy to; Catelyn had never liked it.   Lastly, King Joffrey and the Queen Regent must renounce all claims to dominion over the north. Henceforth we are no part of their realm, but a free and independent kingdom, as of old. Our domain shall include all the Stark lands north of the Neck, and in addition the lands watered by the River Trident and its vassal streams, bounded by the Golden Tooth to the west and the Mountains of the Moon in the east.    THE KING IN THE NORTH!  boomed Greatjon Umber, a ham-sized fist hammering at the air as he shouted.  Stark! Stark! The King in the North!   Robb rolled up the parchment again.  Maester Vyman has drawn a map, showing the borders we claim. You shall have a copy for the queen. Lord Tywin must withdraw beyond these borders, and cease his raiding, burning, and pillage. The Queen Regent and her son shall make no claims to taxes, incomes, nor service from my people, and shall free my lords and knights from all oaths of fealty, vows, pledges, debts, and obligations owed to the Iron Throne and the Houses Baratheon and Lannister. Additionally, the Lannisters shall deliver ten highborn hostages, to be mutually agreed upon, as a pledge of peace. These I will treat as honored guests, according to their station. So long as the terms of this pact are abided with faithfully, I shall release two hostages every year, and return them safely to their families.  Robb tossed the rolled parchment at the knight’s feet.  There are the terms. If she meets them, I’ll give her peace. if not —he whistled, and Grey Wind moved forward snarling— I’ll give her another Whispering Wood.    Stark!  the Greatjon roared again, and now other voices took up the cry.  Stark, Stark, King in the North!  The direwolf threw back his head and howled.  Ser Cleos had gone the color of curdled milk.  The queen shall hear your message, my—Your Grace.    Good,  Robb said.  Ser Robin, see that he has a good meal and clean clothing. He’s to ride at first light.    As you command, Your Grace,  Ser Robin Ryger replied.   Then we are done.  The assembled knights and lords bannermen bent their knees as Robb turned to leave, Grey Wind at his heels. Olyvar Frey scrambled ahead to open the door. Catelyn followed them out, her brother at her side.   You did well,  she told her son in the gallery that led from the rear of the hall,  though that business with the wolf was japery more befitting a boy than a king.   Robb scratched Grey Wind behind the ear.  Did you see the look on his face, Mother?  he asked, smiling.   What I saw was Lord Karstark, walking out.    As did I.  Robb lifted off his crown with both hands and gave it to Olyvar.  Take this thing back to my bedchamber.    At once, Your Grace.  The squire hurried off.   I’ll wager there were others who felt the same as Lord Karstark,  her brother Edmure declared.  How can we talk of peace while the Lannisters spread like a pestilence over my father’s domains, stealing his crops and slaughtering his people? I say again, we ought to be marching on Harrenhal.    We lack the strength,  Robb said, though unhappily.  Edmure persisted.  Do we grow stronger sitting here? Our host dwindles every day.    And whose doing is that?  Catelyn snapped at her brother. It had been at Edmure’s insistence that Robb had given the river lords leave to depart after his crowning, each to defend his own lands. Ser Marq Piper and Lord Karyl Vance had been the first to go. Lord Jonos Bracken had followed, vowing to reclaim the burnt shell of his castle and bury his dead, and now Lord Jason Mallister had announced his intent to return to his seat at Seagard, still mercifully untouched by the fighting.   You cannot ask my river lords to remain idle while their fields are being pillaged and their people put to the sword,  Ser Edmure said,  but Lord Karstark is a northman. It would be an ill thing if he were to leave us.    I’ll speak with him,  said Robb.  He lost two sons in the Whispering Wood. Who can blame him if he does not want to make peace with their killers… with my father’s killers…    More bloodshed will not bring your father back to us, or Lord Rickard’s sons,  Catelyn said.  An offer had to be made—though a wiser man might have offered sweeter terms.    Any sweeter and I would have gagged.  Her son’s beard had grown in redder than his auburn hair. Robb seemed to think it made him look fierce, royal… older. But bearded or no, he was still a youth of fifteen, and wanted vengeance no less than Rickard Karstark. it had been no easy thing to convince him to make even this offer, poor as it was.   Cersei Lannister will never consent to trade your sisters for a pair of cousins."
}