{
  "id": "711e1257b9114c8a64e2f681741c8e221676363c",
  "text": " He can rule in Winterfell as he pleases. He can even go on calling himself King in the North if he likes, so long as he bends the knee and does me homage as his overlord. King is only a word, but fealty, loyalty, service… those I must have.    And if he will not give them to you, my lord?    I mean to be king, my lady, and not of a broken kingdom. I cannot say it plainer than that. Three hundred years ago, a Stark king knelt to Aegon the Dragon, when he saw he could not hope to prevail. That was wisdom. Your son must be wise as well. Once he joins me, this war is good as done. We—  Renly broke off suddenly, distracted.  What’s this now?   The rattle of chains heralded the raising of the portcullis. Down in the yard below, a rider in a winged helm urged his well-lathered horse under the spikes.  Summon the king!  he called.  Renly vaulted up into a crenel.  I’m here, ser.    Your Grace.  The rider spurred his mount closer.  I came swift as I could. From Storm’s End. We are besieged, Your Grace, Ser Cortnay defies them, but…    But… that’s not possible. I would have been told if Lord Tywin left Harrenhal.    These are no Lannisters, my liege. It’s Lord Stannis at your gates. King Stannis, he calls himself now.       JON  A blowing rain lashed at Jon’s face as he spurred his horse across the swollen stream. Beside him, Lord Commander Mormont gave the hood of his cloak a tug, muttering curses on the weather. His raven sat on his shoulder, feathers ruffled, as soaked and grumpy as the Old Bear himself. A gust of wind sent wet leaves flapping round them like a flock of dead birds. The haunted forest, Jon thought ruefully. The drowned forest, more like it.  He hoped Sam was holding up, back down the column. He was not a good rider even in fair weather, and six days of rain had made the ground treacherous, all soft mud and hidden rocks. When the wind blew, it drove the water right into their eyes. The Wall would be flowing off to the south, the melting ice mingling with warm rain to wash down in sheets and rivers. Pyp and Toad would be sitting near the fire in the common room, drinking cups of mulled wine before their supper. Jon envied them. His wet wool clung to him sodden and itching, his neck and shoulders ached fiercely from the weight of mail and sword, and he was sick of salt cod, salt beef, and hard cheese.  Up ahead a hunting horn sounded a quavering note, half drowned beneath the constant patter of the rain.  Buckwell’s horn,  the Old Bear announced.  The gods are good; Craster’s still there.  His raven gave a single flap of his big wings, croaked  Corn,  and ruffled his feathers up again.  Jon had often heard the black brothers tell tales of Craster and his keep. Now he would see it with his own eyes. After seven empty villages, they had all come to dread finding Craster’s as dead and desolate as the rest, but it seemed they would be spared that. Perhaps the Old Bear will finally get some answers, he thought. Anyway, we’ll be out of the rain.  Thoren Smallwood swore that Craster was a friend to the Watch, despite his unsavory reputation.  The man’s half-mad, I won’t deny it,  he’d told the Old Bear,  but you’d be the same if you’d spent your life in this cursed wood. Even so, he’s never turned a ranger away from his fire, nor does he love Mance Rayder. He’ll give us good counsel.   So long as he gives us a hot meal and a chance to dry our clothes, I’ll be happy. Dywen said Craster was a kinslayer, liar, raper, and craven, and hinted that he trafficked with slavers and demons.  And worse,  the old forester would add, clacking his wooden teeth.  There’s a cold smell to that one, there is.    Jon,  Lord Mormont commanded,  ride back along the column and spread the word. And remind the officers that I want no trouble about Craster’s wives. The men are to mind their hands and speak to these women as little as need be.    Aye, my lord.  Jon turned his horse back the way they’d come. It was pleasant to have the rain out of his face, if only for a little while. Everyone he passed seemed to be weeping. The march was strung out through half a mile of woods.  In the midst of the baggage train, Jon passed Samwell Tarly, slumped in his saddle under a wide floppy hat. He was riding one dray horse and leading the others. The drumming of the rain against the hoods of their cages had the ravens squawking and fluttering.  You put a fox in with them?  Jon called out.  Water ran off the brim of Sam’s hat as he lifted his head.  Oh, hullo, Jon. No, they just hate the rain, the same as us.    How are you faring, Sam?    Wetly.  The fat boy managed a smile.  Nothing has killed me yet, though.    Good. Craster’s Keep is just ahead. If the gods are good, he’ll let us sleep by his fire.   Sam looked dubious.  Dolorous Edd says Craster’s a terrible savage. He marries his daughters and obeys no laws but those he makes himself. And Dywen told Grenn he’s got black blood in his veins. His mother was a wildling woman who lay with a ranger, so he’s a bas…  Suddenly he realized what he was about to say."
}