{
  "id": "72b31083abe470f0609b07f6cc8474fbe2b29361",
  "text": "  Hodor,  he said, and then,  Hodor hodor hodor hodor.    Well,  said Meera,  if you would hear the rest…    Yes. Tell it.    Five days of jousting were planned,  she said.  There was a great seven-sided mêlée as well, and archery and axe-throwing, a horse race and tourney of singers…    Never mind about all that.  Bran squirmed impatiently in his basket on Hodor’s back.  Tell about the jousting.    As my prince commands. The daughter of the castle was the queen of love and beauty, with four brothers and an uncle to defend her, but all four sons of Harrenhal were defeated on the first day. Their conquerors reigned briefly as champions, until they were vanquished in turn. As it happened, the end of the first day saw the porcupine knight win a place among the champions, and on the morning of the second day the pitchfork knight and the knight of the two towers were victorious as well. But late on the afternoon of that second day, as the shadows grew long, a mystery knight appeared in the lists.   Bran nodded sagely. Mystery knights would oft appear at tourneys, with helms concealing their faces, and shields that were either blank or bore some strange device. Sometimes they were famous champions in disguise. The Dragonknight once won a tourney as the Knight of Tears, so he could name his sister the queen of love and beauty in place of the king’s mistress. And Barristan the Bold twice donned a mystery knight’s armor, the first time when he was only ten.  It was the little crannogman, I bet.    No one knew,  said Meera,  but the mystery knight was short of stature, and clad in ill-fitting armor made up of bits and pieces. The device upon his shield was a heart tree of the old gods, a white weirwood with a laughing red face.    Maybe he came from the Isle of Faces,  said Bran.  Was he green?  In Old Nan’s stories, the guardians had dark green skin and leaves instead of hair. Sometimes they had antlers too, but Bran didn’t see how the mystery knight could have worn a helm if he had antlers.  I bet the old gods sent him.    Perhaps they did. The mystery knight dipped his lance before the king and rode to the end of the lists, where the five champions had their pavilions. You know the three he challenged.    The porcupine knight, the pitchfork knight, and the knight of the twin towers.  Bran had heard enough stories to know that.  He was the little crannogman, I told you.    Whoever he was, the old gods gave strength to his arm. The porcupine knight fell first, then the pitchfork knight, and lastly the knight of the two towers. None were well loved, so the common folk cheered lustily for the Knight of the Laughing Tree, as the new champion soon was called. When his fallen foes sought to ransom horse and armor, the Knight of the Laughing Tree spoke in a booming voice through his helm, saying, ‘Teach your squire honor, that shall be ransom enough.’ Once the defeated knights chastised their squires sharply, their horses and armor were returned. And so the little crannogman’s prayer was answered… by the green men, or the old gods, or the children of the forest, who can say?   It was a good story, Bran decided after thinking about it a moment or two.  Then what happened? Did the Knight of the Laughing Tree win the tourney and marry a princess?    No,  said Meera.  That night at the great castle, the storm lord and the knight of skulls and kisses each swore they would unmask him, and the king himself urged men to challenge him, declaring that the face behind that helm was no friend of his. But the next morning, when the heralds blew their trumpets and the king took his seat, only two champions appeared. The Knight of the Laughing Tree had vanished. The king was wroth, and even sent his son the dragon prince to seek the man, but all they ever found was his painted shield, hanging abandoned in a tree. It was the dragon prince who won that tourney in the end.    Oh.  Bran thought about the tale awhile.  That was a good story. But it should have been the three bad knights who hurt him, not their squires. Then the little crannogman could have killed them all. The part about the ransoms was stupid. And the mystery knight should win the tourney, defeating every challenger, and name the wolf maid the queen of love and beauty.    She was,  said Meera,  but that’s a sadder story.    Are you certain you never heard this tale before, Bran?  asked Jojen.  Your lord father never told it to you?   Bran shook his head. The day was growing old by then, and long shadows were creeping down the mountainsides to send black fingers through the pines. If the little crannogman could visit the Isle of Faces, maybe I could too. All the tales agreed that the green men had strange magic powers. Maybe they could help him walk again, even turn him into a knight. They turned the little crannogman into a knight, even if it was only for a day, he thought. A day would be enough.      Davos   The cell was warmer than any cell had a right to be.  It was dark, yes."
}