{
  "id": "7307572ef38ded7e0b6594623a423e0e8c1128ae",
  "text": " \"I know, I know - it's not quite as good as winning Witch Weekly's Most Charming-Smile Award five times in a row, as I have - but it's a start, Harry, it's a start.\" He gave Harry a hearty wink and strode off. Harry stood stunned for a few seconds, then, remembering he was supposed to be in the greenhouse, he opened the door and slid inside. Professor Sprout was standing behind a trestle bench in the cen ter of the greenhouse. About twenty pairs of different-colored ear muffs were lying on the bench. When Harry had taken his place between Ron and Hermione, she said, \"We'll be repotting Man drakes today. Now, who can tell me the properties of the Man drake?\" To nobody's surprise, Hermione's hand was first into the air.  s1  \"Mandrake, or Mandragora, is a powerful restorative,\" said Hermione, sounding as usual as though she had swallowed the textbook. \"It is used to return people who have been transfigured or cursed to their original state.\"  \"Excellent. Ten points to Gryffindor,\" said Professor Sprout. \"The Mandrake forms an essential part of most antidotes. It is also, however, dangerous. Who can tell me why?\"  Hermione's hand narrowly missed Harry's glasses as it shot up again.  \"The cry of the Mandrake is fatal to anyone who hears it,\" she said promptly.  \"Precisely. Take another ten points,\" said Professor Sprout. \"Now, the Mandrakes we have here are still very young.\"  She pointed to a row of deep trays as she spoke, and everyone shuffled forward for a better look. A hundred or so tufty little plants, purplish green in color, were growing there in rows. They looked quite unremarkable to Harry, who didn't have the slightest idea what Hermione meant by the \"cry\" of the Mandrake.  \"Everyone take a pair of earmuffs,\" said Professor Sprout.  There was a scramble as everyone tried to seize a pair that wasn't pink and fluffy.  \"When I tell you to put them on, make sure your ears are completely covered,\" said Professor Sprout. \"When it is safe to remove them, I will give you the thumbs-up. Right - earmuffs on.\"  Harry snapped the earmuffs over his ears. They shut out sound completely. Professor Sprout put the pink, fluffy pair over her own ears, rolled up the sleeves of her robes, grasped one of the tufty plants firmly, and pulled hard.  *92*  Harry let out a gasp of surprise that no one could hear.  Instead of roots, a small, muddy, and extremely ugly baby popped out of the earth. The leaves were growing right out of his head. He had pale green, mottled skin, and was clearly bawling at the top of his lungs.  Professor Sprout took a large plant pot from under the table and plunged the Mandrake into it, burying him in dark, damp compost until only the tufted leaves were visible. Professor Sprout dusted off her hands, gave them all the thumbs-up, and removed her own earmuffs.  \"As our Mandrakes are only seedlings, their cries won't kill yet,\" she said calmly as though she'd just done nothing more exciting than water a begonia. \"However, they will knock you out for several hours, and as I'm sure none of you want to miss your first day back, make sure your earmuffs are securely in place while you work. I will attract your attention when it is time to pack up.  \"Four to a tray - there is a large supply of pots here - compost in the sacks over there - and be careful of the Venemous Tentacula, it's teething.\"  She gave a sharp slap to a spiky, dark red plant as she spoke, making it draw in the long feelers that had been inching sneakily over her shoulder.  Harry, Ron, and Hermione were joined at their tray by a curly-haired Hufflepuff boy Harry knew by sight but had never spoken to.  \"Justin Finch-Fletchley,\" he said brightly, shaking Harry by the hand. \"Know who you are, of course, the famous Harry Potter... And you're Hermione Granger - always top in everything\"  * 9%  (Hermione beamed as she had her hand shaken too) \"- and Ron Weasley. Wasn't that your flying car?\"  Ron didn't smile. The Howler was obviously still on his mind.  \"That Lockhart's something, isn't he?\" said Justin happily as they began fiIling their plant pots with dragon dung compost. \"Awfully brave chap. Have you read his books? Id have died of fear if Id been cornered in a telephone booth by a werewolf, but he stayed cool and - zap - just fantastic.  \"My name was down for Eton, you know. I can't tell you how glad I am I came here instead. Of course, Mother was slightly disappointed, but since I made her read Lockhart's books I think she's begun to see how useful it'll be to have a fully trained wizard in the family . . . .\"  After that they didn't have much chance to talk. Their earmuffs were back on and they needed to concentrate on the Mandrakes. Professor Sprout had made it look extremely easy, but it wasn't. The Mandrakes didn't like coming out of the earth, but didn't seem to want to go back into it either. They squirmed, kicked, flailed their sharp little fists, and gnashed their teeth; Harry spent ten whole minutes trying to squash a particularly fat one into a pot."
}