{
  "id": "782d701e78f208da37aaa9115d7077c564912da6",
  "text": "  \"Wonder what they'll give us next year?\" said Seamus Finnigan gloomily.  \"Maybe a vampire,\" suggested Dean Thomas hopefully.  It wasn't only Professor Lupin's departure that was weighing on Harry's mind. He couldn't help thinking a lot about Professor Trelawney's prediction. He kept wondering where Pettigrew was now, whether he had sought sanctuary with Voldemort yet. But the thing that was lowering Harry's spirits most of all was the prospect of returning to the Dursleys. For maybe half an hour, a glorious half hour, he had believed he would be living with Sirius from now on... his parents' best friend.... It would have been the next best thing to having his own father back. And while no news of Sirius was definitely good news, because it meant he had successfully gone into hiding, Harry couldn't help feeling miserable when he thought of the home he might have had, and the fact that it was now impossible.  The exam results came out on the last day of term. Harry, Ron, and Hermione had passed every subject. Harry was amazed that he had got through Potions. He had a shrewd suspicion that Dumbledore might have stepped in to stop Snape failing him on purpose. Snape's behavior toward Harry over the past week had been quite alarming. Harry wouldn't have thought it possible that Snape's dislike for him could increase, but it certainly had. A muscle twitched unpleasantly at the corner of Snape's thin mouth every time he looked at Harry, and he was constantly flexing his fingers, as though itching to place them around Harry's throat.  Percy had got his top-grade N.E.W.T.s; Fred and George had scraped a handful of O.W.L.s each. Gryffindor House, meanwhile, largely thanks to their spectacular performance in the Quidditch Cup, had won the House championship for the third year running. This meant that the end of term feast took place amid decorations of scarlet and gold, and that the Gryffindor table was the noisiest of the lot, as everybody celebrated. Even Harry managed to forget about the journey back to the Dursleys the next day as he ate, drank, talked, and laughed with the rest.  As the Hogwarts Express pulled out of the station the next mornIng, Hermione gave Harry and Ron some surprising news.  \"I went to see Professor McGonagall this morning, just before breakfast. I've decided to drop Muggle Studies.\"  \"But you passed your exam with three hundred and twenty percent!\" said Ron.  \"I know,\" sighed Hermione, \"but I can't stand another year like this one. That Time-Turner, it was driving me mad. I've handed it in. Without Muggle Studies and Divination, I'll be able to have a normal schedule again.\"  I still can't believe you didn't tell us about it,\" said Ron grumpily. \"We're supposed to be your friends.\"  \"I promised I wouldn't tell anyone,\" said Hermione severely. She looked around at Harry, who was watching Hogwarts disappear from view behind a mountain. Two whole months before he'd see it again....  \"Oh, cheer up, Harry!\" said Hermione sadly.  \"I'm okay,\" said Harry quickly. \"Just thinking about the holidays.\"  \"Yeah, I've been thinking about them too,\" said Ron. \"Harry, you've got to come and stay with us. I'll fix it up with Mum and Dad, then I'll call you. I know how to use a fellytone now --\"  \"A telephone, Ron,\" said Hermione. \"Honestly, you should take Muggle Studies next year....\"  Ron *ignored her.  \"It's the Quidditch World Cup this summer! How about it, Harry? Come and stay, and we'll go and see it! Dad can usually get tickets from work.\"  This proposal had the effect of cheering Harry up a great deal.  \"Yeah... I bet the Dursleys'd be pleased to let me come... especially after what I did to Aunt Marge....\"  Feeling considerably more cheerful, Harry joined Ron and Hermione in several games of Exploding Snap, and when the witch with the tea cart arrived, he bought himself a very large lunch, though nothing with chocolate in it.  But it was late in the afternoon before the thing that made him truly happy turned up....  \"Harry,\" said Hermione suddenly, peering over his shoulder. \"What's that thing outside your window?\"  Harry turned to look outside. Something very small and gray was bobbing in and out of sight beyond the glass. He stood up for a better look and saw that it was a tiny owl, carrying a letter that was much too big for it. The owl was so small, in fact, that it kept tumbling over in the air, buffeted this way and that in the train's slipstream. Harry quickly pulled down the window, stretched out his arm, and caught it. It felt like a very fluffy Snitch. He brought it carefully inside. The owl dropped its letter onto Harry's seat and began zooming around their compartment, apparently very pleased with itself for accomplishing its task. Hedwig clicked her beak with a sort of dignified disapproval. Crookshanks sat up in his seat, following the owl with his great yellow eyes. Ron, noticing this, snatched the owl safely out of harm's way.  Harry picked up the letter. It was addressed to him. He ripped open the letter, and shouted, \"It's from Sirius!\"  \"What?\" said Ron and Hermione excitedly."
}