{
  "id": "7a09f1c79f3f33ec725bce9a216676c4d68deea8",
  "text": " Later, when he was older, he had been ashamed of those dreams. Winterfell would go to Robb and then his sons, or to Bran or Rickon should Robb die childless. And after them came Sansa and Arya. Even to dream otherwise seemed disloyal, as if he were betraying them in his heart, wishing for their deaths. I never wanted this, he thought as he stood before the blue-eyed king and the red woman. I loved Robb, loved all of them… I never wanted any harm to come to any of them, but it did. And now there’s only me. All he had to do was say the word, and he would be Jon Stark, and nevermore a Snow. All he had to do was pledge this king his fealty, and Winterfell was his. All he had to do…  …was forswear his vows again.  And this time it would not be a ruse. To claim his father’s castle, he must turn against his father’s gods.  King Stannis gazed off north again, his gold cloak streaming from his shoulders.  It may be that I am mistaken in you, Jon Snow. We both know the things that are said of bastards. You may lack your father’s honor, or your brother’s skill in arms. But you are the weapon the Lord has given me. I have found you here, as you found the cache of dragonglass beneath the Fist, and I mean to make use of you. Even Azor Ahai did not win his war alone. I killed a thousand wildlings, took another thousand captive, and scattered the rest, but we both know they will return. Melisandre has seen that in her fires. This Tormund Thunderfist is likely re-forming them even now, and planning some new assault. And the more we bleed each other, the weaker we shall all be when the real enemy falls upon us.   Jon had come to that same realization.  As you say, Your Grace.  He wondered where this king was going.   Whilst your brothers have been struggling to decide who shall lead them, I have been speaking with this Mance Rayder.  He ground his teeth.  A stubborn man, that one, and prideful. He will leave me no choice but to give him to the flames. But we took other captives as well, other leaders. The one who calls himself the Lord of Bones, some of their clan chiefs, the new Magnar of Thenn. Your brothers will not like it, no more than your father’s lords, but I mean to allow the wildlings through the Wall… those who will swear me their fealty, pledge to keep the king’s peace and the king’s laws, and take the Lord of Light as their god. Even the giants, if those great knees of theirs can bend. I will settle them on the Gift, once I have wrested it away from your new Lord Commander. When the cold winds rise, we shall live or die together. It is time we made alliance against our common foe.  He looked at Jon.  Would you agree?    My father dreamed of resettling the Gift,  Jon admitted.  He and my uncle Benjen used to talk of it.  He never thought of settling it with wildlings, though… but he never rode with wildlings, either. He did not fool himself; the free folk would make for unruly subjects and dangerous neighbors. Yet when he weighed Ygritte’s red hair against the cold blue eyes of the wights, the choice was easy.  I agree.    Good,  King Stannis said,  for the surest way to seal a new alliance is with a marriage. I mean to wed my Lord of Winterfell to this wildling princess.   Perhaps Jon had ridden with the free folk too long; he could not help but laugh.  Your Grace,  he said,  captive or no, if you think you can just give Val to me, I fear you have a deal to learn about wildling women. Whoever weds her had best be prepared to climb in her tower window and carry her off at swordpoint…    Whoever?  Stannis gave him a measuring look.  Does this mean you will not wed the girl? I warn you, she is part of the price you must pay, if you want your father’s name and your father’s castle. This match is necessary, to help assure the loyalty of our new subjects. Are you refusing me, Jon Snow?    No,  Jon said, too quickly. It was Winterfell the king was speaking of, and Winterfell was not to be lightly refused.  I mean… this has all come very suddenly, Your Grace. Might I beg you for some time to consider?    As you wish. But consider quickly. I am not a patient man, as your black brothers are about to discover.  Stannis put a thin, fleshless hand on Jon’s shoulder.  Say nothing of what we’ve discussed here today. To anyone. But when you return, you need only bend your knee, lay your sword at my feet, and pledge yourself to my service, and you shall rise again as Jon Stark, the Lord of Winterfell.       Tyrion   When he heard noises through the thick wooden door of his cell, Tyrion Lannister prepared to die.  Past time, he thought. Come on, come on, make an end to it. He pushed himself to his feet. His legs were asleep from being folded under him. He bent down and rubbed the knives from them. I will not go stumbling and waddling to the headsman’s block.  He wondered whether they would kill him down here in the dark or drag him through the city so Ser Ilyn Payne could lop his head off. After his mummer’s farce of a trial, his sweet sister and loving father might prefer to dispose of him quietly, rather than risk a public execution."
}