{
  "id": "7b6b4517368549d69adfbd651bc5b8c61c3ff08f",
  "text": "      HOUSE TYRELL  The Tyrells rose to power as stewards to the Kings of the Reach, whose domains included the fertile plains of the southwest from the Dornish marches and Blackwater Rush to the shores of the Sunset Sea. Through the female line they claim descent from Garth Greenhand, gardener king of the First Men, who wore a crown of vines and flowers and made the land bloom. When King Mern, last of the old line, perished on the Field of Fire, his steward Harlen Tyrell surrendered Highgarden to Aegon Targaryen, pledging fealty. Aegon granted him the castle and dominion over the Reach. The Tyrell sigil is a golden rose on a grass-green field. Their words are Growing Strong    MACE TYRELL, Lord of Highgarden, Warden of the South, Defender of the Marches, High Marshal of the Reach,  —his wife, LADY ALERIE, of House Hightower of Oldtown,  —their children:    —WILLAS, their eldest son, heir to Highgarden,  —SER GARLAN, called the Gallant, their second son,  —SER LORAS, the Knight of Flowers, their youngest son,  —MARGAERY, their daughter, a maid of fourteen years,    —his widowed mother, LADY OLENNA of House Redwyne, called the Queen of Thorns,  —his sisters:    —MINA, web to Lord Paxter Redwyne,  —JANNA, wed to Ser Jon Fossoway,    —his uncles:    —GARTH, called the Gross, Lord Seneschal of Highgarden,    —his bastard sons, GARSE and GARRETT FLOWERS,      —SER MORYN, Lord Commander of the City Watch of Oldtown,  —MAESTER GORMON, a scholar of the Citadel,    —his household:    —MAESTER LOMYS, counselor, healer, and tutor,  —IGON VYRWEL, captain of the guard,  —SER VORTIMER CRANE, master-at-arms,    —his knights and lords bannermen:    —PAXTER REDWYNE, Lord of the Arbor,    —his wife, LADY MINA, of House Tyrell,  —their children:      —SER HORAS, mocked as Horror, twin to Hobber,  —SER HOBBER, mocked as Slobber, twin to Horas,  —DESMERA, a maid of fifteen,      —RANDYLL TARLY, Lord of Horn Hill,    —SAMWELL, his elder son, of the Night’s Watch,  —DICKON, his younger son, heir to Horn Hill,      —ARWYN OAKHEART, Lady of Old Oak,  —MATHIS ROWAN, Lord of Goldengrove,  —LEYTON HIGHTOWER, Voice of Oldtown, Lord of the Port,  —SER JON FOSSOWAY,      Principal houses sworn to Highgarden are Vrywel, Florent, Oakheart, Hightower, Crane, Tarly, Redwyne, Rowan, Fossoway, and Mullendore.      HOUSE GREYJOY  The Greyjoys of Pyke claim descent from the Grey King of the Age of Heroes. Legend says the Grey King ruled not only the western isles but the sea itself, and took a mermaid to wife.    For thousands of years, raiders from the Iron Islands—called  ironmen  by those they plundered—were the terrors of the seas, sailing as far as the Port of Ibben and the Summer Isles. They prided themselves on their fierceness in battle and their sacred freedoms. Each island had its own  salt king  and  rock king.  The High King of the Isles was chosen from among their number, until King Urron made the throne hereditary by murdering the other kings when they assembled for a choosing. Urron’s own line was extinguished a thousand years later when the Andals swept over the islands. The Greyjoys, like other island lords, intermarried with the conquerors.    The Iron Kings extended their rule far beyond the isles themselves, carving kingdoms out of the mainland with fire and sword. King Qhored could truthfully boast that his writ ran  wherever men can smell salt water or hear the crash of waves.  In later centuries, Qhored’s descendants lost the Arbor, Oldtown, Bear Island, and much of the western shore. Still, come the Wars of Conquest, King Harren the Black ruled all the lands between the mountains, from the Neck to the Blackwater Rush. When Harren and his sons perished in the fall of Harrenhal, Aegon Targaryen granted the riverlands to House Tully, and allowed the surviving lords of the Iron Islands to revive their ancient custom and choose who should have the primacy among them. They chose Lord Vickon Greyjoy of Pyke.    The Greyjoy sigil is a golden kraken upon a black field. Their words are We Do Not Sow.    BALON GREYJOY, Lord of the Iron Islands, King of Salt and Rock, Son of the Sea Wind, Lord Reaper of Pyke.  —his wife, LADY ALANNYS, of House Harlaw,  —their children:    —{RODRIK}, their eldest son, slain at Seagard during Greyjoy’s Rebellion,  —{MARON}, their second son, slain on the walls of Pyke during Greyjoy’s Rebellion,  —ASHA, their daughter, captain of the Black Wind,  —THEON, their sole surviving son, heir to Pyke, a ward of Lord Eddard Stark,    —his brothers:    —EURON, called Crow’s Eye, captain of the Silence, an outlaw, pirate, and raider,  —VICTARION, Lord Captain of the Iron Fleet,  —AERON, called Damphair, a priest of the Drowned God,      Lesser houses sworn to Pyke include Harlaw, Stonehouse, Merlyn, Sunderly, Botley, Tawney, Wynch, Goodbrother.      HOUSE MARTELL  Nymeria, the warrior queen of the Rhoyne, brought her ten thousand ships to land in Dorne, the southernmost of the Seven Kingdoms, and took Lord Mors Martell to husband."
}