{
  "id": "7d2f99b6413f5f90a9f2f05ab8beebe2a1375f45",
  "text": " \"She was here in my time,\" said Mrs. Weasley.  \"She gave me such a telling off one night when I got back to the dormitory at four in the morning -\" \"What were you doing out of your dormitory at four in the morning?\"  said Bill, surveying his mother with amazement. Mrs. Weasley grinned, her eyes twinkling. \"Your father and I had been for a nighttime stroll,\" she said.  \"He got caught by Apollyon Pringle - he was the caretaker in those days - your father's still got the marks.\" \"Fancy giving us a tour, Harry?\"  said Bill. \"Yeah, okay,\" said Harry, and they made their way back toward the door into the Great Hall.  As they passed Amos Diggory, he looked around. \"There you are, are you?\" he said, looking Harry up and down. \"Bet you're not feeling quite as full of yourself now Cedrics caught you up on points, are you?\" \"What?\" said Harry. \"Ignore him,\" said Cedric in a low voice to Harry, frowning after his father.  \"He's been angry ever since Rita Skeeters article about the Triwizard Tournament - you know, when she made out you were the only Hogwarts champion.\" \"Didn't bother to correct her, though, did he?\"  said Amos Diggory, loudly enough for Harry to hear as he started to walk out of the door with Mrs. Weasley and Bill.  \"Still, . . you'll show him, Ced. Beaten him once before, haven't you?\" \"Rita Skeeter goes out of her way to cause trouble, Amos!\"  Mrs. Weasley said angrily. \"I would have thought you'd know that, working at the Ministry!\" Mr. Diggory looked as though he was going to say something angry, but his wife laid a hand on his arm, and he merely shrugged and turned away. Harry had a very enjoyable morning walking over the sunny grounds with Bill and Mrs. Weasley, showing them the Beauxbatons carriage and the Durmstrang ship.  Mrs. Weasley was intrigued by the Whomping Willow, which had been planted after she had left school, and reminisced at length about the gamekeeper before Hagrid, a man called Ogg. \"How's Percy?\"  Harry asked as they walked around the greenhouses. \"Not good,\" said Bill. \"He's very upset,\" said Mrs. Weasley, lowering her voice and glancing around.  \"The Ministry wants to keep Mr. Crouch's disappearance quiet, but Percy's been hauled in for questioning about the instructions Mr. Crouch has been sending in.  They seem to think there's a chance they weren't genuinely written by him.  Percy's been under a lot of strain.  They're not letting him fill in for Mr. Crouch as the fifth judge tonight.  Cornelius Fudge is going to be doing it.\" They returned to the castle for lunch. \"Mum - Bill!\" said Ron, looking stunned, as he joined the Gryffindor table.  \"What're you doing here?\" \"Come to watch Harry in the last task!\"  said Mrs. Weasley brightly.  \"I must say, it makes a lovely change, not having to cook.  How was your exam?\" \"Oh . . . okay,\" said Ron. \"Couldn't remember all the goblin rebels' names, so I invented a few.  It's all right,\" he said, helping himself to a Cornish pasty, while Mrs. Weasley looked stern, \"they're all called stuff like Bodrod the Bearded and Urg the Unclean; it wasn't hard.\" Fred, George, and Ginny came to sit next to them too, and Harry was having such a good time he felt almost as though he were back at the Burrow; he had forgotten to worry about that evening's task, and not until Hermione turned up, halfway through lunch, did he remember that she had had a brainwave about Rita Skeeter. \"Are you going to tell us - ?\" Hermione shook her head warningly and glanced at Mrs. Weasley. \"Hello, Hermione,\" said Mrs. Weasley, much more stiffly than usual. \"Hello,\" said Hermione, her smile faltering at the cold expression on Mrs. Weasley's face. Harry looked between them, then said, \"Mrs. Weasley, you didn't believe that rubbish Rita Skeeter wrote in Witch Weekly, did you?  Because Hermione's not my girlfriend.\" \"Oh!\" said Mrs. Weasley \"No - of course I didn't!\" But she became considerably warmer toward Hermione after that. Harry, Bill, and Mrs. Weasley whiled away the afternoon with a long walk around the castle, and then returned to the Great Hall for the evening feast.  Ludo Bagman and Cornelius Fudge had joined the staff table now.  Bagman looked quite cheerful, but Cornelius Fudge, who was sitting next to Madame Maxime, looked stern and was not talking. Madame Maxime was concentrating on her plate, and Harry thought her eyes looked red. Hagrid kept glancing along the table at her, There were more courses than usual, but Harry, who was starting to feel really nervous now, didn't eat much.  As the enchanted ceiling overhead began to fade from blue to a dusky purple, Dumbledore rose to his feet at the staff table, and silence fell. \"Ladies and gentlemen, in five minutes' time, I will be asking you to make your way down to the Quidditch field for the third and final task of the Triwizard Tournament.  Will the champions please follow Mr. Bagman down to the stadium now.\" Harry got up.  The Gryffindors all along the table were applauding him; the Weasleys and Hermione all wished him good luck, and he headed off out of the Great Hall with Cedric, Fleur, and Viktor."
}