{
  "id": "81ee1374d795e4babf0f85c70501c2d327cf32e4",
  "text": " Long before they were upon it, he knew that it stood abandoned, its weathered stones overgrown with climbing roses.  When the wind shifted, Ser Cleos helped the big wench run up the sail, a stiff triangle of striped red-and-blue canvas. Tully colors, sure to cause them grief if they encountered any Lannister forces on the river, but it was the only sail they had. Brienne took the rudder. Jaime threw out the leeboard, his chains rattling as he moved. After that, they made better speed, with wind and current both favoring their flight.  We could save a deal of traveling if you delivered me to my father instead of my brother,  he pointed out.   Lady Catelyn’s daughters are in King’s Landing. I will return with the girls or not at all.   Jaime turned to Ser Cleos.  Cousin, lend me your knife.    No.  The woman tensed.  I will not have you armed.  Her voice was as unyielding as stone.  She fears me, even in irons.  Cleos, it seems I must ask you to shave me. Leave the beard, but take the hair off my head.    You’d be shaved bald?  asked Cleos Frey.   The realm knows Jaime Larmister as a beardless knight with long golden hair. A bald man with a filthy yellow beard may pass unnoticed. I’d sooner not be recognized while I’m in irons.   The dagger was not as sharp as it might have been. Cleos hacked away manfully, sawing and ripping his way through the mats and tossing the hair over the side. The golden curls floated on the surface of the water, gradually falling astern. As the tangles vanished, a louse went crawling down his neck. Jaime caught it and crushed it against his thumbnail. Ser Cleos picked others from his scalp and flicked them into the water. Jaime doused his head and made Ser Cleos whet the blade before he let him scrape away the last inch of yellow stubble. When that was done, they trimmed back his beard as well.  The reflection in the water was a man he did not know. Not only was he bald, but he looked as though he had aged five years in that dungeon; his face was thinner, with hollows under his eyes and lines he did not remember. I don’t look as much like Cersei this way. She’ll hate that.  By midday, Ser Cleos had fallen asleep. His snores sounded like ducks mating. Jaime stretched out to watch the world flow past; after the dark cell, every rock and tree was a wonder.  A few one-room shacks came and went, perched on tall poles that made them look like cranes. Of the folk who lived there they saw no sign. Birds flew overhead, or cried out from the trees along the shore, and Jaime glimpsed silvery fish knifing through the water. Tully trout, there’s a bad omen, he thought, until he saw a worse—one of the floating logs they passed turned out to be a dead man, bloodless and swollen. His cloak was tangled in the roots of a fallen tree, its color unmistakably Lannister crimson. He wondered if the corpse had been someone he knew.  The forks of the Trident were the easiest way to move goods or men across the riverlands. In times of peace, they would have encountered fisherfolk in their skiffs, grain barges being poled downstream, merchants selling needles and bolts of cloth from floating shops, perhaps even a gaily painted mummer’s boat with quilted sails of half a hundred colors, making its way upriver from village to village and castle to castle.  But the war had taken its toll. They sailed past villages, but saw no villagers. An empty net, slashed and torn and hanging from some trees, was the only sign of fisherfolk. A young girl watering her horse rode off as soon as she glimpsed their sail. Later they passed a dozen peasants digging in a field beneath the shell of a burnt towerhouse. The men gazed at them with dull eyes, and went back to their labors once they decided the skiff was no threat.  The Red Fork was wide and slow, a meandering river of loops and bends dotted with tiny wooded islets and frequently choked by sandbars and snags that lurked just below the water’s surface. Brienne seemed to have a keen eye for the dangers, though, and always seemed to find the channel. When Jaime complimented her on her knowledge of the river, she looked at him suspiciously and said,  I do not know the river. Tarth is an island. I learned to manage oars and sail before I ever sat a horse.   Ser Cleos sat up and rubbed at his eyes.  Gods, my arms are sore. I hope the wind lasts.  He sniffed at it.  I smell rain.   Jaime would welcome a good rain. The dungeons of Riverrun were not the cleanest place in the Seven Kingdoms. By now he must smell like an overripe cheese.  Cleos squinted downriver.  Smoke.   A thin grey finger crooked them on. It was rising from the south bank several miles on, twisting and curling. Below, Jaime made out the smouldering remains of a large building, and a live oak full of dead women.  The crows had scarcely started on their corpses. The thin ropes cut deeply into the soft flesh of their throats, and when the wind blew they twisted and swayed.  This was not chivalrously done,  said Brienne when they were close enough to see it clearly."
}