{
  "id": "82533f50533204554c9000239a0be5d4d31c0188",
  "text": " Beneath that would be boiled leather and a layer of quilting. A flat-topped greathelm was bolted to his gorget, with breaths around the mouth and nose and a narrow slit for vision. The crest atop it was a stone fist.  If Ser Gregor was suffering from wounds, Tyrion could see no sign of it from across the yard. He looks as though he was chiseled out of rock, standing there. His greatsword was planted in the ground before him, six feet of scarred metal. Ser Gregor’s huge hands, clad in gauntlets of lobstered steel, clasped the crosshilt to either side of the grip. Even Prince Oberyn’s paramour paled at the sight of him.  You are going to fight that?  Ellaria Sand said in a hushed voice.   I am going to kill that,  her lover replied carelessly.  Tyrion had his own doubts, now that they stood on the brink. When he looked at Prince Oberyn, he found himself wishing he had Bronn defending him… or even better, Jaime. The Red Viper was lightly armored; greaves, vambraces, gorget, spaulder, steel codpiece. Elsewise Oberyn was clad in supple leather and flowing silks. Over his byrnie he wore his scales of gleaming copper, but mail and scale together would not give him a quarter the protection of Gregor’s heavy plate. With its visor removed, the prince’s helm was effectively no better than a halfhelm, lacking even a nasal. His round steel shield was brightly polished, and showed the sun-and-spear in red gold, yellow gold, white gold, and copper.  Dance around him until he’s so tired he can hardly lift his arm, then put him on his back. The Red Viper seemed to have the same notion as Bronn. But the sellsword had been blunt about the risks of such tactics. I hope to seven hells that you know what you are doing, snake.  A platform had been erected beside the Tower of the Hand, halfway between the two champions. That was where Lord Tywin sat with his brother Ser Kevan. King Tommen was not in evidence; for that, at least, Tyrion was grateful.  Lord Tywin glanced briefly at his dwarf son, then lifted his hand. A dozen trumpeters blew a fanfare to quiet the crowd. The High Septon shuffled forward in his tall crystal crown, and prayed that the Father Above would help them in this judgment, and that the Warrior would lend his strength to the arm of the man whose cause was just. That would be me, Tyrion almost shouted, but they would only laugh, and he was sick unto death of laughter.  Ser Osmund Kettleblack brought Clegane his shield, a massive thing of heavy oak rimmed in black iron. As the Mountain slid his left arm through the straps, Tyrion saw that the hounds of Clegane had been painted over. This morning Ser Gregor bore the seven-pointed star the Andals had brought to Westeros when they crossed the narrow sea to overwhelm the First Men and their gods. Very pious of you, Cersei, but I doubt the gods will be impressed.  There were fifty yards between them. Prince Oberyn advanced quickly, Ser Gregor more ominously. The ground does not shake when he walks, Tyrion told himself. That is only my heart fluttering. When the two men were ten yards apart, the Red Viper stopped and called out,  Have they told you who I am?   Ser Gregor grunted through his breaths.  Some dead man.  He came on, inexorable.  The Dornishman slid sideways.  I am Oberyn Martell, a prince of Dorne,  he said, as the Mountain turned to keep him in sight.  Princess Elia was my sister.    Who?  asked Gregor Clegane.  Oberyn’s long spear jabbed, but Ser Gregor took the point on his shield, shoved it aside, and bulled back at the prince, his great sword flashing. The Dornishman spun away untouched. The spear darted forward. Clegane slashed at it, Martell snapped it back, then thrust again. Metal screamed on metal as the spearhead slid off the Mountain’s chest, slicing through the surcoat and leaving a long bright scratch on the steel beneath.  Elia Martell, Princess of Dorne,  the Red Viper hissed.  You raped her. You murdered her. You killed her children.   Ser Gregor grunted. He made a ponderous charge to hack at the Dornishman’s head. Prince Oberyn avoided him easily.  You raped her. You murdered her. You killed her children.    Did you come to talk or to fight?    I came to hear you confess.  The Red Viper landed a quick thrust on the Mountain’s belly, to no effect. Gregor cut at him, and missed. The long spear lanced in above his sword. Like a serpent’s tongue it flickered in and out, feinting low and landing high, jabbing at groin, shield, eyes. The Mountain makes for a big target, at the least, Tyrion thought. Prince Oberyn could scarcely miss, though none of his blows was penetrating Ser Gregor’s heavy plate. The Dornishman kept circling, jabbing, then darting back again, forcing the bigger man to turn and turn again. Clegane is losing sight of him. The Mountain’s helm had a narrow eyeslit, severely limiting his vision. Oberyn was making good use of that, and the length of his spear, and his quickness.  It went on that way for what seemed a long time. Back and forth they moved across the yard, and round and round in spirals, Ser Gregor slashing at the air while Oberyn’s spear struck at arm, and leg, twice at his temple."
}