{
  "id": "83093e887e9484c56268351230241715b8182e30",
  "text": " `We  are tired, but we shall rest better  when we are outside,' he said. `I think   that none of us will wish to spend another night in Moria.'       `No indeed! '  said Boromir. `Which way shall we take?  Yonder eastward  arch?  '       'Maybe,' said  Gandalf. `But  I du not know yet exactly  where  we are.  Unless I am quite astray, I guess that  we are above and to the north of the  Great Gates; and it may not be easy to find the right road down to them. The  eastern arch will probably prove to be the way that we must take; but before  we make up our minds we ought to look about us. Let us go towards that light  in the north door. If we cou ld find a window it would help,  but I fear that  the light comes only down deep shafts.'       Following  his  lead the Company  passed under the  northern arch. They  found themselves in a wide corridor. As they went along it the  glimmer grew  stronger, and they saw that it came through a doorway on their right. It was  high and flat-topped, and the stone door was still upon its hinges, standing  half open.  Beyond it was a large square  chamber. It was  dimly lit, but to  their eyes, after so long  a time in the dark, it seemed dazzlingly  bright,  and they blinked as they entered.       Their  feet  disturbed  a deep dust upon the floor,  and stumbled among  things  lying in the doorway whose shapes they could not at first  make out.  The chamber was lit  by a  wi de shaft high in the  further  eastern wall; it  slanted  upwards and, far  above,  a small square patch of blue sky could be  seen. The light of the  shaft fell directly  on a table in the middle of the  room:  a single  oblong block, about two  feet high,  upon  which was laid a   great slab of white stone.       `It  looks  like  a tomb,' muttered  Frodo,  and  bent forwards with  a   curious  sense  of foreboding,  to  look more  closely  at it.  Gandalf came  quickly to his side. On the slab runes were deeply graven:   ####-       'These  are Daeron's Runes,  such as were used  of  old in Moria,' said  Gandalf. 'Here is written in the tongues of Men and Dwarves:        balin son of fundin       lord of moria.'       'He  is  dead then,' said  Frodo. `I feared it was  so.' Gimli cast his  hood over his face.     ####-   Chapter 5. The Bridge of Khazad-dym            The Company  of the Ring stood silent beside the  tomb of  Balin. Frodo  thought  of  Bilbo  and his long friendship with the  dwarf,  and of Balin's  visit to the  Shire long  ago. In  that dusty  chamber  in the mountains  it  seemed a thousand years ago and on the other side of the world.       At length they stirred and looked up, and began  to search for anything  that would give them tidings of Balin's fate, or show what had become of his  folk. There was another smaller door on the other side of the chamber, under   the shaft.  By both the doors they could now see that many bones were lying,  and among  them  were  broken swords and axe-heads,  and cloven  shields and  helms. Some of the swords were crooked: orc-scimitars with blackened blades.        There were many recesses cut in the rock of the walls, and in them were  large iron-bound chests  of  wood. All had  been  broken and plundered;  but  beside the shattered lid of one there lay the remains of a book. It had been  slashed  and stabbed and partly burned, and it was so stained with black and  other  dark  marks like old blood that little of  it could be  read. Gandalf  lifted it carefully, but the leaves crackled and broke as he laid it  on the  slab.  He  pored over it  for  some time  without  speaking. Frodo and Gimli  standing  at his side could see, as he gingerly turned the leaves, that they  were  written by many different hands, in runes, both of Moria  and of Dale,   and here and  there in Elvish script.       At last Gandalf looked  up. 'It seems to be a record of the fortunes of  Balin's folk,' he said. `I guess  that it began with their coming to Dimrill  Dale nigh on thirty years ago: the  pages seem to have numbers referring  to  the years  after their arrival. The top page is marked  one -- three, so  at  least two are missing from the beginning. Listen to this!        'We drove out orcs from the great gate and  guard --  I think; the next  word is blurred and burned; probably room -- we slew many in the bright -- I   think -- sun in the dale. Flui was killed by  an arrow.  He slew the  great.  Then there is a blur followed by Flui under grass near Mirror mere. The next  line or two I cannot  read. Then comes We have taken the twentyfirst hall of  North end  to  dwell in. There is I cannot read what. A shaft is  mentioned.  Then Balin has set up his seat in the Chamber of Mazarbul. '       'The Chamber of  Records,' said Gimli. `I  guess that is  where we  now   ####-stand.'       `Well, I can read no more for a long way,'  said  Gandalf, 'except  the  word  gold , and Durin's Axe and something  helm. Then  Balin is now  lord of  Moria . That seems to  end a  chapter."
}