{
  "id": "830f9b047c8b2cfc8be067557b36addd31366ed1",
  "text": " The goat was seated by a cookfire eating a half-cooked bird off a skewer, grease and blood running down his fingers into his long stringy beard. He wiped his hands on his tunic and rose.  Kingthlayer,  he slobbered.  You are my captifth.    My lord, I am Brienne of Tarth,  the wench called out.  Lady Catelyn Stark commanded me to deliver Ser Jaime to his brother at King’s Landing.   The goat gave her a disinterested glance.  Thilence her.    Hear me,  Brienne entreated as Rorge cut the ropes that bound her to Jaime,  in the name of the King in the North, the king you serve, please, listen—   Rorge dragged her off the horse and began to kick her.  See that you don’t break any bones,  Urswyck called out to him.  The horse-faced bitch is worth her weight in sapphires.   The Dornishman Timeon and a foul-smelling Ibbenese pulled Jaime down from the saddle and shoved him roughly toward the cookfire. It would not have been hard for him to have grasped one of their sword hilts as they manhandled him, but there were too many, and he was still in fetters. He might cut down one or two, but in the end he would die for it. Jaime was not ready to die just yet, and certainly not for the likes of Brienne of Tarth.   Thith ith a thweet day,  Vargo Hoat said. Around his neck hung a chain of linked coins, coins of every shape and size, cast and hammered, bearing the likenesses of kings, wizards, gods and demons, and all manner of fanciful beasts.  Coins from every land where he has fought, Jaime remembered. Greed was the key to this man. If he was turned once, he can be turned again.  Lord Vargo, you were foolish to leave my father’s service, but it is not too late to make amends. He will pay well for me, you know it.    Oh yeth,  said Vargo Hoat.  Half the gold in Cathterly Rock, I thall have. But firth I mutht thend him a methage.  He said something in his slithery goatish tongue.  Urswyck shoved him in the back, and a jester in green and pink motley kicked his legs out from under him. When he hit the ground one of the archers grabbed the chain between Jaime’s wrists and used it to yank his arms out in front of him. The fat Dothraki put aside his knife to unsheathe a huge curved arakh, the wickedly sharp scythe-sword the horselords loved.  They mean to scare me. The fool hopped on Jaime’s back, giggling, as the Dothraki swaggered toward him. The goat wants me to piss my breeches and beg his mercy, but he’ll never have that pleasure. He was a Lannister of Casterly Rock, Lord Commander of the Kingsguard; no sellsword would make him scream.  Sunlight ran silver along the edge of the arakh as it came shivering down, almost too fast to see. And Jaime screamed.      Arya   The small square keep was half a ruin, and so too the great grey knight who lived there. He was so old he did not understand their questions. No matter what was said to him, he would only smile and mutter,  I held the bridge against Ser Maynard. Red hair and a black temper, he had, but he could not move me. Six wounds I took before I killed him. Six!   The maester who cared for him was a young man, thankfully. After the old knight had drifted to sleep in his chair, he took them aside and said,  I fear you seek a ghost. We had a bird, ages ago, half a year at least. The Lannisters caught Lord Beric near the Gods Eye. He was hanged.    Aye, hanged he was, but Thoros cut him down before he died.  Lem’s broken nose was not so red or swollen as it had been, but it was healing crooked, giving his face a lopsided look.  His lordship’s a hard man to kill, he is.    And a hard man to find, it would seem,  the maester said.  Have you asked the Lady of the Leaves?    We shall,  said Greenbeard.  The next morning, as they crossed the little stone bridge behind the keep, Gendry wondered if this was the bridge the old man had fought over. No one knew.  Most like it is,  said Jack-Be-Lucky.  Don’t see no other bridges.    You’d know for certain if there was a song,  said Tom Sevenstrings.  One good song, and we’d know who Ser Maynard used to be and why he wanted to cross this bridge so bad. Poor old Lychester might be as far famed as the Dragonknight if he’d only had sense enough to keep a singer.    Lord Lychester’s sons died in Robert’s Rebellion,  grumbled Lem.  Some on one side, some on t’other. He’s not been right in the head since. No bloody song’s like to help any o’ that.    What did the maester mean, about asking the Lady of the Leaves?  Arya asked Anguy as they rode.  The archer smiled.  Wait and see.   Three days later, as they rode through a yellow wood, Jack-Be-Lucky unslung his horn and blew a signal, a different one than before. The sounds had scarcely died away when rope ladders unrolled from the limbs of trees.  Hobble the horses and up we go,  said Tom, half singing the words. They climbed to a hidden village in the upper branches, a maze of rope walkways and little moss-covered houses concealed behind walls of red and gold, and were taken to the Lady of the Leaves, a stick-thin white-haired woman dressed in roughspun."
}