{
  "id": "85e3240c6c102c5756fca03052a1d10c03c39e79",
  "text": "   Osha scooped him up in her bony arms. She was very tall for a woman, and wiry strong. She bore him effortlessly to his bed.   This will give you dreamless sleep,  Maester Luwin said as he pulled the stopper from the jar.  Sweet, dreamless sleep.    It will?  Bran said, wanting to believe.   Yes. Drink.   Bran drank. The potion was thick and chalky, but there was honey in it so it went down easy.   Come the morn, you’ll feel better.  Luwin gave Bran a smile and a pat as he took his leave.  Osha lingered behind.  Is it the wolf dreams again?   Bran nodded.   You should not fight so hard, boy. I see you talking to the heart tree. Might be the gods are trying to talk back.    The gods?  he murmured, drowsy already. Osha’s face grew blurry and grey. Sweet, dreamless sleep, Bran thought.  Yet when the darkness closed over him, he found himself in the godswood, moving silently beneath green-grey sentinels and gnarled oaks as old as time. I am walking, he thought, exulting. Part of him knew that it was only a dream, but even the dream of walking was better than the truth of his bedchamber, walls and ceiling and door.  It was dark amongst the trees, but the comet lit his way, and his feet were sure. He was moving on four good legs, strong and swift, and he could feel the ground underfoot, the soft crackling of fallen leaves, thick roots and hard stones, the deep layers of humus. It was a good feeling.  The smells filled his head, alive and intoxicating; the green muddy stink of the hot pools, the perfume of rich rotting earth beneath his paws, the squirrels in the oaks. The scent of squirrel made him remember the taste of hot blood and the way the bones would crack between his teeth. Slaver filled his mouth. He had eaten no more than half a day past, but there was no joy in dead meat, even deer. He could hear the squirrels chittering and rustling above him, safe among their leaves, but they knew better than to come down to where his brother and he were prowling.  He could smell his brother too, a familiar scent, strong and earthy, his scent as black as his coat. His brother was loping around the walls, full of fury. Round and round he went, night after day after night, tireless, searching… for prey, for a way out, for his mother, his littermates, his pack… searching, searching, and never finding.  Behind the trees the walls rose, piles of dead man-rock that loomed all about this speck of living wood. Speckled grey they rose, and moss-spotted, yet thick and strong and higher than any wolf could hope to leap. Cold iron and splintery wood closed off the only holes through the piled stones that hemmed them in. His brother would stop at every hole and bare his fangs in rage, but the ways stayed closed.  He had done the same the first night, and learned that it was no good. Snarls would open no paths here. Circling the walls would not push them back. Lifting a leg and marking the trees would keep no men away. The world had tightened around them, but beyond the walled wood still stood the great grey caves of man-rock. Winterfell, he remembered, the sound coming to him suddenly. Beyond its sky-tall man-cliffs the true world was calling, and he knew he must answer or die.      ARYA  They traveled dawn to dusk, past woods and orchards and neatly tended fields, through small villages, crowded market towns, and stout holdfasts. Come dark, they would make camp and eat by the light of the Red Sword. The men took turns standing watch. Arya would glimpse firelight flickering through the trees from the camps of other travelers. There seemed to be more camps every night, and more traffic on the kingsroad by day.  Morn, noon, and night they came, old folks and little children, big men and small ones, barefoot girls and women with babes at their breasts. Some drove farm wagons or bumped along in the back of ox carts. More rode: draft horses, ponies, mules, donkeys, anything that would walk or run or roll. One woman led a milk cow with a little girl on its back. Arya saw a smith pushing a wheelbarrow with his tools inside, hammers and tongs and even an anvil, and a little while later a different man with a different wheelbarrow, only inside this one were two babies in a blanket. Most came on foot, with their goods on their shoulders and weary, wary looks upon their faces. They walked south, toward the city, toward King’s Landing, and only one in a hundred spared so much as a word for Yoren and his charges, traveling north. She wondered why no one else was going the same way as them.  Many of the travelers were armed; Arya saw daggers and dirks, scythes and axes, and here and there a sword. Some had made clubs from tree limbs, or carved knobby staffs. They fingered their weapons and gave lingering looks at the wagons as they rolled by, yet in the end they let the column pass. Thirty was too many, no matter what they had in those wagons.  Look with your eyes, Syrio had said, listen with your ears.  One day a madwoman began to scream at them from the side of the road."
}