{
  "id": "88ac6ee641039c64afda79566475e6ea587385bc",
  "text": "  They didn't need telling twice. Hermione, gasping for breath, her lip bleeding, scrambled aside, snatching up her and Ron's wands. Ron crawled to the four-poster and collapsed onto it, panting, his white face now tinged with green, both hands clutching his broken leg.  Black was sprawled at the bottom of the wall. His thin chest rose and fell rapidly as he watched Harry walking slowly nearer, his wand pointing straight at Black's heart.  \"Going to kill me, Harry?\" he whispered.  Harry stopped right above him, his wand still pointing at Black's chest, looking down at him. A livid bruise was rising around Black's left eye and his nose was bleeding.  \"You killed my parents,\" said Harry, his voice shaking slightly, but his wand hand quite steady.  Black stared up at him out of those sunken eyes.  \"I don't deny it,\" he said very quietly. \"But if you knew the whole story.\"  \"The whole story?\" Harry repeated, a furious pounding in his ears. \"You sold them to Voldemort. That's all I need to know.\"  \"You've got to listen to me,\" Black said, and there was a note of urgency in his voice now. \"You'll regret it if you don't.... You don't understand....\"  \"I understand a lot better than you think,\" said Harry, and his voice shook more than ever. \"You never heard her, did you? My mum... trying to stop Voldemort killing me... and you did that... you did it....\"  Before either of them could say another word, something ginger streaked past Harry; Crookshanks leapt onto Black's chest and settled himself there, right over Black's heart. Black blinked and looked down at the cat.  \"Get off,\" he murmured, trying to push Crookshanks off him.  But Crookshanks sank his claws into Black's robes and wouldn't shift. He turned his ugly, squashed face to Harry and looked up at him with those great yellow eyes. To his right, Hermione gave a dry sob.  Harry stared down at Black and Crookshanks, his grip tightening on the wand. So what if he had to kill the cat too? It was in league with Black.... If it was prepared to die, trying to protect Black, that wasn't Harry's business.... If Black wanted to save it, that only proved he cared more for Crookshanks than for Harry's parents....  Harry raised the wand. Now was the moment to do it. Now was the moment to avenge his mother and father. He was going to kill Black. He had to kill Black. This was his chance....  The seconds lengthened. And still Harry stood frozen there, wand poised, Black staring up at him, Crookshanks on his chest. Ron's ragged breathing came from near the bed; Hermione was quite silent.  And then came a new sound -  Muffled footsteps were echoing up through the floor -- someone was moving downstairs.  \"WE'RE UP HERE!\" Hermione screamed suddenly. \"WE'RE UP HERE -- SIRIUS BLACK - QUICK!\"  Black made a startled movement that almost dislodged Crookshanks; Harry gripped his wand convulsively -- Do it now! said a voice in his head -- but the footsteps were thundering up the stairs and Harry still hadn't done it.  The door of the room burst open in a shower of red sparks and Harry wheeled around as Professor Lupin came hurtling into the room, his face bloodless, his wand raised and ready. His eyes flickered over Ron, lying on the floor, over Hermione, cowering next to the door, to Harry, standing there with his wand covering Black, and then to Black himself, crumpled and bleeding at Harry's feet.  \"Expelliarmus!\" Lupin shouted.  Harry's wand flew once more out of his hand; so did the two Hermione was holding. Lupin caught them all deftly, then moved into the room, staring at Black, who still had Crookshanks lying Protectively across his chest.  Harry stood there, feeling suddenly empty. He hadn't done it. His nerve had failed him. Black was going to be handed back to the dementors.  Then Lupin spoke, in a very tense voice.  \"Where is he, Sirius?\"  Harry looked quickly at Lupin. He didn't understannd what Lupin meant. Who was Lupin talking about? He turned to look at Black again.  Black's face was quite expressionless. For a few seconds, he didn't move at all. Then, very slowly, he raised his empty hand and pointed straight at Ron. Mystified, Harry glanced around at Ron, who looked bewildered.  \"But then...\" Lupin muttered, staring at Black so intently it seemed he was trying to read his mind, \"... why hasn't he shown himself before now? Unless\" -- Lupin's eyes suddenly widened, as though he was seeing something beyond Black, something none of the rest could see, \"-- unless he was the one... unless you switched... without telling me?\"  Very slowly, his sunken gaze never leaving Lupin's face, Black nodded.  \"Professor,\" Harry interrupted loudly, \"what's going on --?\"  But he never finished the question, because what he saw made his voice die in his throat. Lupin was lowering his wand, gazing fixed at Black. The Professor walked to Black's side, seized his hand, pulled him to his feet so that Crookshanks fell to the floor, and embraced Black like a brother.  Harry felt as though the bottom had dropped out of his stomach."
}