{
  "id": "8996563a34fd863d126e74de8b94a9815c331fb7",
  "text": "  \"Miss Granger, five points will be taken from Gryffindor for this,\" said Professor McGonagall. \"I'm very disappointed in you. If you're not hurt at all, you'd better get off to Gryffindor tower. Students are finishing the feast in their houses.\"  Hermione left.  Professor McGonagall turned to Harry and Ron.  \"Well, I still say you were lucky, but not many first years could have taken on a full-grown mountain troll. You each win Gryffindor five points. Professor Dumbledore will be informed of this. You may go.\"  They hurried out of the chamber and didn't speak at all until they had climbed two floors up. It was a relief to be away from the smell of the troll, quite apart from anything else.  \"We should have gotten more than ten points,\" Ron grumbled.  \"Five, you mean, once she's taken off Hermione's.\"  \"Good of her to get us out of trouble like that,\" Ron admitted. \"Mind you, we did save her.\"  \"She might not have needed saving if we hadn't locked the thing in with her,\" Harry reminded him.  They had reached the portrait of the Fat Lady.  \"Pig snout,\" they said and entered.  The common room was packed and noisy. Everyone was eating the food that had been sent up. Hermione, however, stood alone by the door, waiting for them. There was a very embarrassed pause. Then, none of them looking at each other, they all said \"Thanks,\" and hurried off to get plates.  But from that moment on, Hermione Granger became their friend. There are some things you can't share without ending up liking each other, and knocking out a twelve-foot mountain troll is one of them.   CHAPTER ELEVEN  QUIDDITCH  As they entered November, the weather turned very cold. The mountains around the school became icy gray and the lake like chilled steel. Every morning the ground was covered in frost. Hagrid could be seen from the upstairs windows defrosting broomsticks on the Quidditch field, bundled up in a long moleskin overcoat, rabbit fur gloves, and enormous beaverskin boots.  The Quidditch season had begun. On Saturday, Harry would be playing in his first match after weeks of training: Gryffindor versus Slytherin. If Gryffindor won, they would move up into second place in the house championship.  Hardly anyone had seen Harry play because Wood had decided that, as their secret weapon, Harry should be kept, well, secret. But the news that he was playing Seeker had leaked out somehow, and Harry didn't know which was worse -- people telling him he'd be brilliant or people telling him they'd be running around underneath him holding a mattress.  It was really lucky that Harry now had Hermlone as a friend. He didn't know how he'd have gotten through all his homework without her, what with all the last-minute Quidditch practice Wood was making them do. She had also tent him Quidditch Through the Ages, which turned out to be a very interesting read.  Harry learned that there were seven hundred ways of committing a Quidditch foul and that all of them had happened during a World Cup match in 1473; that Seekers were usually the smallest and fastest players, and that most serious Quidditch accidents seemed to happen to them; that although people rarely died playing Quidditch, referees had been known to vanish and turn up months later in the Sahara Desert.  Hermione had become a bit more relaxed about breaking rules since Harry and Ron had saved her from the mountain troll, and she was much nicer for it. The day before Harry's first Quidditch match the three of them were out in the freezing courtyard during break, and she had conjured them up a bright blue fire that could be carried around in a jam jar. They were standing with their backs to it, getting warm, when Snape crossed the yard. Harry noticed at once that Snape was limping. Harry, Ron, and Hermione moved closer together to block the fire from view; they were sure it wouldn't be allowed. Unfortunately, something about their guilty faces caught Snape's eye. He limped over. He hadn't seen the fire, but he seemed to be looking for a reason to tell them off anyway.  \"What's that you've got there, Potter?\"  It was Quidditch Through the Ages. Harry showed him.  \"Library books are not to be taken outside the school,\" said Snape. \"Give it to me. Five points from Gryffindor.\"  \"He's just made that rule up,\" Harry muttered angrily as Snape limped away. \"Wonder what's wrong with his leg?\"  \"Dunno, but I hope it's really hurting him,\" said Ron bitterly.  The Gryffindor common room was very noisy that evening. Harry, Ron, and Hermione sat together next to a window. Hermione was checking Harry and Ron's Charms homework for them. She would never let them copy (\"How will you learn?\"), but by asking her to read it through, they got the right answers anyway.  Harry felt restless. He wanted Quidditch Through the Ages back, to take his mind off his nerves about tomorrow. Why should he be afraid of Snape? Getting up, he told Ron and Hermione he was going to ask Snape if he could have it.  \"Better you than me,\" they said together, but Harry had an idea that Snape wouldn't refuse if there were other teachers listening."
}