{
  "id": "8a4a11955aa514a15b6b9f23e59e4b26f9561d35",
  "text": "  He took the horn, upended it, belched, wiped his mouth.  I am sorry for your girl, Ned. Truly. About the wolf, I mean. My son was lying, I’d stake my soul on it. My son… you love your children, don’t you?    With all my heart,  Ned said.   Let me tell you a secret, Ned. More than once, I have dreamed of giving up the crown. Take ship for the Free Cities with my horse and my hammer, spend my time warring and whoring, that’s what I was made for. The sellsword king, how the singers would love me. You know what stops me? The thought of Joffrey on the throne, with Cersei standing behind him whispering in his ear. My son. How could I have made a son like that, Ned?    He’s only a boy,  Ned said awkwardly. He had small liking for Prince Joffrey, but he could hear the pain in Robert’s voice.  Have you forgotten how wild you were at his age?    It would not trouble me if the boy was wild, Ned. You don’t know him as I do.  He sighed and shook his head.  Ah, perhaps you are right. Jon despaired of me often enough, yet I grew into a good king.  Robert looked at Ned and scowled at his silence.  You might speak up and agree now, you know.    Your Grace…  Ned began, carefully.  Robert slapped Ned on the back.  Ah, say that I’m a better king than Aerys and be done with it. You never could lie for love nor honor, Ned Stark. I’m still young, and now that you’re here with me, things will be different. We’ll make this a reign to sing of, and damn the Lannisters to seven hells. I smell bacon. Who do you think our champion will be today? Have you seen Mace Tyrell’s boy? The Knight of Flowers, they call him. Now there’s a son any man would be proud to own to. Last tourney, he dumped the Kingslayer on his golden rump, you ought to have seen the look on Cersei’s face. I laughed till my sides hurt. Renly says he has this sister, a maid of fourteen, lovely as a dawn…   They broke their fast on black bread and boiled goose eggs and fish fried up with onions and bacon, at a trestle table by the river’s edge. The king’s melancholy melted away with the morning mist, and before long Robert was eating an orange and waxing fond about a morning at the Eyrie when they had been boys.  …had given Jon a barrel of oranges, remember? Only the things had gone rotten, so I flung mine across the table and hit Dacks right in the nose. You remember, Redfort’s pock-faced squire? He tossed one back at me, and before Jon could so much as fart, there were oranges flying across the High Hall in every direction.  He laughed uproariously, and even Ned smiled, remembering.  This was the boy he had grown up with, he thought; this was the Robert Baratheon he’d known and loved. If he could prove that the Lannisters were behind the attack on Bran, prove that they had murdered Jon Arryn, this man would listen. Then Cersei would fall, and the Kingslayer with her, and if Lord Tywin dared to rouse the west, Robert would smash him as he had smashed Rhaegar Targaryen on the Trident. He could see it all so clearly.  That breakfast tasted better than anything Eddard Stark had eaten in a long time, and afterward his smiles came easier and more often, until it was time for the tournament to resume.  Ned walked with the king to the jousting field. He had promised to watch the final tilts with Sansa; Septa Mordane was ill today, and his daughter was determined not to miss the end of the jousting. As he saw Robert to his place, he noted that Cersei Lannister had chosen not to appear; the place beside the king was empty. That too gave Ned cause to hope.  He shouldered his way to where his daughter was seated and found her as the horns blew for the day’s first joust. Sansa was so engrossed she scarcely seemed to notice his arrival.  Sandor Clegane was the first rider to appear. He wore an olive-green cloak over his soot-grey armor. That, and his hound’s-head helm, were his only concession to ornament.   A hundred golden dragons on the Kingslayer,  Littlefinger announced loudly as Jaime Lannister entered the lists, riding an elegant blood bay destrier. The horse wore a blanket of gilded ringmail, and Jaime glittered from head to heel. Even his lance was fashioned from the golden wood of the Summer Isles.   Done,  Lord Renly shouted back.  The Hound has a hungry look about him this morning.    Even hungry dogs know better than to bite the hand that feeds them,  Littlefinger called dryly.  Sandor Clegane dropped his visor with an audible clang and took up his position. Ser Jaime tossed a kiss to some woman in the commons, gently lowered his visor, and rode to the end of the lists. Both men couched their lances.  Ned Stark would have loved nothing so well as to see them both lose, but Sansa was watching it all moist-eyed and eager. The hastily erected gallery trembled as the horses broke into a gallop. The Hound leaned forward as he rode, his lance rock steady, but Jaime shifted his seat deftly in the instant before impact. Clegane’s point was turned harmlessly against the golden shield with the lion blazon, while his own hit square."
}