{
  "id": "8bf93fcd836056f7263174188977040e95bbe138",
  "text": "  Castles and courtesies will not appease him, he must have blood. Well, I am of a mind to grant his wish.    Your Grace, I see no need for battle here,  Lord Mathis Rowan put in.  The castle is strongly garrisoned and well provisioned, Ser Cortnay Penrose is a seasoned commander, and the trebuchet has not been built that could breach the walls of Storm’s End. Let Lord Stannis have his siege. He will find no joy in it, and whilst he sits cold and hungry and profitless, we will take King’s Landing.    And have men say I feared to face Stannis?    Only fools will say that,  Lord Mathis argued.  Renly looked to the others.  What say you all?    I say that Stannis is a danger to you,  Lord Randyll Tarly declared.  Leave him unblooded and he will only grow stronger, while your own power is diminished by battle. The Lannisters will not be beaten in a day. By the time you are done with them, Lord Stannis may be as strong as you… or stronger.   Others chorused their agreement. The king looked pleased.  We shall fight, then.   I have failed Robb as I failed Ned, Catelyn thought.  My lord,  she announced.  If you are set on battle, my purpose here is done. I ask your leave to return to Riverrun.    You do not have it.  Renly seated himself on a camp chair.  She stiffened.  I had hoped to help you make a peace, my lord. I will not help you make a war.   Renly gave a shrug.  I daresay we’ll prevail without your five-and-twenty, my lady. I do not mean for you to take part in the battle, only to watch it.    I was at the Whispering Wood, my lord. I have seen enough butchery. I came here an envoy—    And an envoy you shall leave,  Renly said,  but wiser than you came. You shall see what befalls rebels with your own eyes, so your son can hear it from your own lips. We’ll keep you safe, never fear.  He turned away to make his dispositions.  Lord Mathis, you shall lead the center of my main battle. Bryce, you’ll have the left. The right is mine. Lord Estermont, you shall command the reserve.    I shall not fail you, Your Grace,  Lord Estermont replied.  Lord Mathis Rowan spoke up.  Who shall have the van?    Your Grace,  said Ser Jon Fossoway,  I beg the honor.    Beg all you like,  said Ser Guyard the Green,  by rights it should be one of the seven who strikes the first blow.    It takes more than a pretty cloak to charge a shield wall,  Randyll Tarly announced.  I was leading Mace Tyrell’s van when you were still sucking on your mother’s teat, Guyard.   A clamor filled the pavilion, as other men loudly set forth their claims. The knights of summer, Catelyn thought. Renly raised a hand.  Enough, my lords. If I had a dozen vans, all of you should have one, but the greatest glory by rights belongs to the greatest knight. Ser Loras shall strike the first blow.    With a glad heart, Your Grace.  The Knight of Flowers knelt before the king.  Grant me your blessing, and a knight to ride beside me with your banner. Let the stag and rose go to battle side by side.   Renly glanced about him.  Brienne.    Your Grace?  She was still armored in her blue steel, though she had taken off her helm. The crowded tent was hot, and sweat plastered limp yellow hair to her broad, homely face.  My place is at your side. I am your sworn shield…    One of seven,  the king reminded her.  Never fear, four of your fellows will be with me in the fight.   Brienne dropped to her knees.  If I must part from Your Grace, grant me the honor of arming you for battle.   Catelyn heard someone snigger behind her. She loves him, poor thing, she thought sadly. She’d play his squire just to touch him, and never care how great a fool they think her.   Granted,  Renly said.  Now leave me, all of you. Even kings must rest before a battle.    My lord,  Catelyn said,  there was a small sept in the last village we passed. If you will not permit me to depart for Riverrun, grant me leave to go there and pray.    As you will. Ser Robar, give Lady Stark safe escort to this sept… but see that she returns to us by dawn.    You might do well to pray yourself,  Catelyn added.   For victory?    For wisdom.   Renly laughed.  Loras, stay and help me pray. It’s been so long I’ve quite forgotten how. As to the rest of you, I want every man in place by first light, armed, armored, and horsed. We shall give Stannis a dawn he will not soon forget.   Dusk was falling when Catelyn left the pavilion. Ser Robar Royce fell in beside her. She knew him slightly—one of Bronze Yohn’s sons, comely in a rough-hewn way, a tourney warrior of some renown. Renly had gifted him with a rainbow cloak and a suit of blood red armor, and named him one of his seven.  You are a long way from the Vale, ser,  she told him.   And you far from Winterfell, my lady.    I know what brought me here, but why have you come? This is not your battle, no more than it is mine.    I made it my battle when I made Renly my king.    The Royces are bannermen to House Arryn.    My lord father owes Lady Lysa fealty, as does his heir."
}