{
  "id": "8c096b6aa1e6b2caf4248a7957903434e6058d73",
  "text": "'       'You were less tender  to me,'  said Gluin with  a flash of his eyes as  old memories were stirred  of  his imprisonment in  the  deep places of  the  Elven-king's halls.   ####-     'Now  come!' said Gandalf. `Pray do not interrupt, my good Gluin.  That  was  a regrettable misunderstanding,  long set right. If  all the grievances  that stand between Elves and  Dwarves are to  be brought up  here, we may as  well abandon this Council.'       Gluin  rose and bowed, and Legolas  continued.  'In  the days  of  fair  weather we led Gollum through the  woods; and there was a high tree standing  alone far from the others which he liked to climb. Often we let him mount up  to the highest branches, until he felt the free  wind; but we set a guard at  the tree's foot. One day he refused to come down, and the guards had no mind  to climb  after him: he had learned the trick of clinging to boughs with his  feet as well as with his hands; so they sat by the tree far into the night.       'It was that very night of summer, yet moonless and starless, that Orcs  came  on us at unawares. We drove them off after  some time;  they were many  and  fierce, but they came from over  the mountains, and were unused  to the   woods. When the battle was  over, we  found  that Gollum was  gone, and  his  guards were slain  or taken. It then seemed plain to  us that the attack had  been made for his rescue, and that he knew  of  it beforehand. How that  was  contrived we cannot guess; but Gollum is cunning, and the spies of the Enemy  are many. The dark things that were driven  out in  the year of the Dragon's  fall have returned in greater  numbers, and Mirkwood is again an evil place,   save where our realm is maintained.       `We have failed to  recapture Gollum.  We came on his trail among those  of many Orcs, and it plunged deep into the Forest, going south. But ere long  it escaped our  skill,  and  we  dared not  continue the hunt;  for we  were  drawing nigh to Dol Guldur,  and that  is still a very evil place; we do not  go that way.'       `Well,  well, he  is gone,' said Gandalf. 'We have no time  to seek for   him again.  He must do what he will. But he may play a part yet that neither   he nor Sauron have foreseen.       'And now  I will answer Galdor's other questions. What of Saruman? What  are his counsels to us in this need? This tale I must tell in full, for only  Elrond  has heard it yet, and that in brief, but it will bear on all that we  must  resolve. It is the last  chapter in the Tale of the Ring, so far as it  has yet gone.       'At the  end of June I was in the Shire, but a cloud of anxiety was  on  my mind, and I rode to the southern borders of the little land; for I  had a   foreboding  of some danger, still hidden  from  me but  drawing  near. There   ####-messages reached me telling me of war and defeat in Gondor, and when I heard  of the Black Shadow  a chill smote my heart. But I found nothing  save a few  fugitives  from  the South;  yet  it seemed to me that on them sat a fear of  which they would not speak. I turned then east and north and journeyed along  the Greenway; and  not  far from Bree  I came upon  a traveller sitting on a   bank beside the road with his grazing  horse beside him. It was Radagast the  Brown, who at one time dwelt at Rhosgobel,  near the borders of Mirkwood.  He  is one of my order, but I had not seen him for many a year.       ` \"Gandalf! \" he cried.  \"I was seeking you. But I  am  a  stranger  in  these parts. All I knew was that  you might  be found  in a wild region with  the uncouth name of Shire.\"       ' \"Your information was  correct,\" I said. \"But do not put it that way,  if you meet any of the inhabitants. You are near the  borders of  the  Shire  now.  And what do you want with me?  It must  be pressing.  You were never a   traveller, unless driven by great need.\"       ' \"I have an urgent errand,\" he said. \"My news is evil.\" Then he looked  about him, as if  the hedges  might have ears. \"Nazgyl,\"  he whispered. \"The  Nine are abroad again. They  have  crossed the River secretly and are moving  westward. They have taken the guise of riders in black.\"       'I knew then what I had dreaded without knowing it.       ` \"The enemy must have some great need or purpose,\" said Radagast; \"but  what it is that makes him look to these distant and desolate parts, I cannot  guess.\"       ` \"What do you mean? \" said I.       ` \"I have been told that wherever they go the Riders ask for news  of a   land called Shire.\"       ' \"The Shire,\" I said; but my heart sank. For even the  Wise might fear  to  withstand the  Nine,  when they  are gathered together under  their fell  chieftain. A great  king and sorcerer he was  of  old,  and now  he wields a   deadly fear. \"Who told  you, and who sent you? \" I asked.       ' \"Saruman the White,\"  answered Radagast. \"And  he told me to say that  if you feel the need, he will help; but you must seek his aid at once, or it  will be too late."
}