{
  "id": "8da30041c9007c9d0e97152c94a02da67a4b98b2",
  "text": "  The Plaza of Pride with its great bronze harpy was too small to hold all the Unsullied she had bought. Instead they had been assembled in the Plaza of Punishment, fronting on Astapor’s main gate, so they might be marched directly from the city once Daenerys had taken them in hand. There were no bronze statues here; only a wooden platform where rebellious slaves were racked, and flayed, and hanged.  The Good Masters place them so they will be the first thing a new slave sees upon entering the city,  Missandei told her as they came to the plaza.  At first glimpse, Dany thought their skin was striped like the zorses of the Jogos Nhai. Then she rode her silver nearer and saw the raw red flesh beneath the crawling black stripes. Flies. Flies and maggots. The rebellious slaves had been peeled like a man might peel an apple, in a long curling strip. One man had an arm black with flies from fingers to elbow, and red and white beneath. Dany reined in beneath him.  What did this one do?    He raised a hand against his owner.   Her stomach roiling, Dany wheeled her silver about and trotted toward the center of the plaza, and the army she had bought so dear. Rank on rank on rank they stood, her stone halfmen with their hearts of brick; eight thousand and six hundred in the spiked bronze caps of fully trained Unsullied, and five thousand odd behind them, bareheaded, yet armed with spears and shortswords. The ones farthest to the back were only boys, she saw, but they stood as straight and still as all the rest.  Kraznys mo Nakloz and his fellows were all there to greet her. Other well-born Astapori stood in knots behind them, sipping wine from silver flutes as slaves circulated among them with trays of olives and cherries and figs. The elder Grazdan sat in a sedan chair supported by four huge copper-skinned slaves. Half a dozen mounted lancers rode along the edges of the plaza, keeping back the crowds who had come to watch. The sun flashed blinding bright off the polished copper disks sewn to their cloaks, but she could not help but notice how nervous their horses seemed. They fear the dragons. And well they might.  Kraznys had a slave help her from her saddle. His own hands were full; one clutched his tokar, while the other held an omate whip.  Here they are.  He looked at Missandei.  Tell her they are hers… if she can pay.    She can,  the girl said.  Ser Jorah barked a command, and the trade goods were brought forward. Six bales of tiger skins, three hundred bolts of fine silk. Jars of saffron, jars of myrrh, jars of pepper and curry and cardamom, an onyx mask, twelve jade monkeys, casks of ink in red and black and green, a box of rare black amethysts, a box of pearls, a cask of pitted olives stuffed with maggots, a dozen casks of pickled cave fish, a great brass gong and a hammer to beat it with, seventeen ivory eyes, and a huge chest full of books written in tongues that Dany could not read. And more, and more, and more. Her people stacked it all before the slavers.  While the payment was being made, Kraznys mo Nakloz favored her with a few final words on the handling of her troops.  They are green as yet,  he said through Missandei.  Tell the whore of Westeros she would be wise to blood them early. There are many small cities between here and there, cities ripe for sacking. Whatever plunder she takes will be hers alone. Unsullied have no lust for gold or gems. And should she take captives, a few guards will suffice to march them back to Astapor. We’ll buy the healthy ones, and for a good price. And who knows? In ten years, some of the boys she sends us may be Unsullied in their turn. Thus all shall prosper.   Finally there were no more trade goods to add to the pile. Her Dothraki mounted their horses once more, and Dany said,  This was all we could carry. The rest awaits you on the ships, a great quantity of amber and wine and black rice. And you have the ships themselves. So all that remains is…    …the dragon,  finished the Grazdan with the spiked beard, who spoke the Common Tongue so thickly.   And here he waits.  Ser Jorah and Belwas walked beside her to the litter, where Drogon and his brothers lay basking in the sun. Jhiqui unfastened one end of the chain, and handed it down to her. When she gave a yank, the black dragon raised his head, hissing, and unfolded wings of night and scarlet. Kraznys mo Nakloz smiled broadly as their shadow fell across him.  Dany handed the slaver the end of Drogon’s chain. In return he presented her with the whip. The handle was black dragonbone, elaborately carved and inlaid with gold. Nine long thin leather lashes trailed from it, each one tipped by a gilded claw. The gold pommel was a woman’s head, with pointed ivory teeth.  The harpy’s fingers,  Kraznys named the scourge.  Dany turned the whip in her hand. Such a light thing, to bear such weight.  Is it done, then? Do they belong to me?    It is done,  he agreed, giving the chain a sharp pull to bring Drogon down from the litter."
}