{
  "id": "8e85f662466906313dc60628386a91ebd97474ef",
  "text": " This was the castle where King Sherrit had called down his curse on the Andals of old, where the ’prentice boys had faced the thing that came in the night, where blind Symeon Star-Eyes had seen the hellhounds fighting. Mad Axe had once walked these yards and climbed these towers, butchering his brothers in the dark.  All that had happened hundreds and thousands of years ago, to be sure, and some maybe never happened at all. Maester Luwin always said that Old Nan’s stories shouldn’t be swallowed whole. But once his uncle came to see Father, and Bran asked about the Nightfort. Benjen Stark never said the tales were true, but he never said they weren’t; he only shrugged and said,  We left the Nightfort two hundred years ago,  as if that was an answer.  Bran forced himself to look around. The morning was cold but bright, the sun shining down from a hard blue sky, but he did not like the noises. The wind made a nervous whistling sound as it shivered through the broken towers, the keeps groaned and settled, and he could hear rats scrabbling under the floor of the great hall. The Rat Cook’s children running from their father. The yards were small forests where spindly trees rubbed their bare branches together and dead leaves scuttled like roaches across patches of old snow. There were trees growing where the stables had been, and a twisted white weirwood pushing up through the gaping hole in the roof of the domed kitchen. Even Summer was not at ease here. Bran slipped inside his skin, just for an instant, to get the smell of the place. He did not like that either.  And there was no way through.  Bran had told them there wouldn’t be. He had told them and told them, but Jojen Reed had insisted on seeing for himself. He had had a green dream, he said, and his green dreams did not lie. They don’t open any gates either, thought Bran.  The gate the Nightfort guarded had been sealed since the day the black brothers had loaded up their mules and garrons and departed for Deep Lake; its iron portcullis lowered, the chains that raised it carried off, the tunnel packed with stone and rubble all frozen together until they were as impenetrable as the Wall itself.  We should have followed Jon,  Bran said when he saw it. He thought of his bastard brother often, since the night that Summer had watched him ride off through the storm.  We should have found the kingsroad and gone to Castle Black.    We dare not, my prince,  Jojen said.  I’ve told you why.    But there are wildlings. They killed some man and they wanted to kill Jon too. Jojen, there were a hundred of them.    So you said. We are four. You helped your brother, if that was him in truth, but it almost cost you Summer.    I know,  said Bran miserably. The direwolf had killed three of them, maybe more, but there had been too many. When they formed a tight ring around the tall earless man, he had tried to slip away through the rain, but one of their arrows had come flashing after him, and the sudden stab of pain had driven Bran out of the wolf’s skin and back into his own. After the storm finally died, they had huddled in the dark without a fire, talking in whispers if they talked at all, listening to Hodor’s heavy breathing and wondering if the wildlings might try and cross the lake in the morning. Bran had reached out for Summer time and time again, but the pain he found drove him back, the way a red-hot kettle makes you pull your hand back even when you mean to grab it. Only Hodor slept that night, muttering  Hodor, hodor,  as he tossed and turned. Bran was terrified that Summer was off dying in the darkness. Please, you old gods, he prayed, you took Winterfell, and my father, and my legs, please don’t take Summer too. And watch over Jon Snow too, and make the wildlings go away.  No weirwoods grew on that stony island in the lake, yet somehow the old gods must have heard. The wildlings took their sweet time about departing the next morning, stripping the bodies of their dead and the old man they’d killed, even pulling a few fish from the lake, and there was a scary moment when three of them found the causeway and started to walk out… but the path turned and they didn’t, and two of them nearly drowned before the others pulled them out. The tall bald man yelled at them, his words echoing across the water in some tongue that even Jojen did not know, and a little while later they gathered up their shields and spears and marched off north by east, the same way Jon had gone. Bran wanted to leave too, to look for Summer, but the Reeds said no.  We will stay another night,  said Jojen,  put some leagues between us and the wildlings. You don’t want to meet them again, do you?  Late that afternoon Summer returned from wherever he’d been hiding, dragging his back leg. He ate parts of the bodies in the inn, driving off the crows, then swam out to the island. Meera had drawn the broken arrow from his leg and rubbed the wound with the juice of some plants she found growing around the base of the tower."
}