{
  "id": "944589c95ef79b4e9f93fff7bdda2726eb59b2b7",
  "text": "   Your grandfather has a sour nature,  Marillion said to Catelyn.  I meant to do you honor. An homage to your beauty. In truth, I was made to sing for kings and high lords.    Oh, I can see that,  Catelyn said.  Lord Tully is fond of song, I hear. No doubt you’ve been to Riverrun.    A hundred times,  the singer said airily.  They keep a chamber for me, and the young lord is like a brother.   Catelyn smiled, wondering what Edmure would think of that. Another singer had once bedded a girl her brother fancied; he had hated the breed ever since.  And Winterfell?  she asked him.  Have you traveled north?    Why would I?’ Marillion asked.  It’s all blizzards and bearskins up there, and the Starks know no music but the howling of wolves.  Distantly, she was aware of the door banging open at the far end of the room.   Innkeep,  a servant’s voice called out behind her,  we have horses that want stabling, and my lord of Lannister requires a room and a hot bath.    Oh, gods,  Ser Rodrik said before Catelyn reached out to silence him, her fingers tightening hard around his forearm.  Masha Heddle was bowing and smiling her hideous red smile.  I’m sorry, m’lord, truly, we’re full up, every room.   There were four of them, Catelyn saw. An old man in the black of the Night’s Watch, two servants… and him, standing there small and bold as life.  My men will steep in your stable, and as for myself, well, I do not require a large room, as you can plainly see.  He flashed a mocking grin.  So long as the fire’s warm and the straw reasonably free of fleas, I am a happy man.   Masha Heddle was beside herself.  M’lord, there’s nothing, it’s the tourney, there’s no help for it, oh…   Tyrion Lannister pulled a coin from his purse and flicked it up over his head, caught it, tossed it again. Even across the room, where Catelyn sat, the wink of gold was unmistakable.  A freerider in a faded blue cloak lurched to his feet.  You’re welcome to my room, m’lord.    Now there’s a clever man,  Lannister said as he sent the coin spinning across the room. The freerider snatched it from the air.  And a nimble one to boot.  The dwarf turned back to Masha Heddle.  You will be able to manage food, I trust?    Anything you like, m’lord, anything at all,  the innkeep promised. And may he choke on it, Catelyn thought, but it was Bran she saw choking, drowning on his own blood.  Lannister glanced at the nearest tables.  My men will have whatever you’re serving these people. Double portions, we’ve had a long hard ride. I’ll take a roast fowl—chicken, duck, pigeon, it makes no matter. And send up a flagon of your best wine. Yoren, will you sup with me?    Aye, m’lord, I will,  the black brother replied.  The dwarf had not so much as glanced toward the far end of the room, and Catelyn was thinking how grateful she was for the crowded benches between them when suddenly Marillion bounded to his feet.  My lord of Lannister!  he called out.  I would be pleased to entertain you while you eat. Let me sing you the lay of your father’s great victory at King’s Landing!    Nothing would be more likely to ruin my supper,  the dwarf said dryly. His mismatched eyes considered the singer briefly, started to move away… and found Catelyn. He looked at her for a moment, puzzled. She turned her face away, but too late. The dwarf was smiling.  Lady Stark, what an unexpected pleasure,  he said.  I was sorry to miss you at Winterfell.   Marillion gaped at her, confusion giving way to chagrin as Catelyn rose slowly to her feet. She heard Ser Rodrik curse. If only the man had lingered at the Wall, she thought, if only…   Lady… Stark?  Masha Heddle said thickly.   I was still Catelyn Tully the last time I bedded here,  she told the innkeep. She could hear the muttering, feel the eyes upon her. Catelyn glanced around the room, at the faces of the knights and sworn swords, and took a deep breath to slow the frantic beating of her heart. Did she dare take the risk? There was no time to think it through, only the moment and the sound of her own voice ringing in her ears.  You in the corner,  she said to an older man she had not noticed until now.  Is that the black bat of Harrenhal I see embroidered on your surcoat, ser?   The man got to his feet.  It is, my lady.    And is Lady Whent a true and honest friend to my father, Lord Hoster Tully of Riverrun?    She is,  the man replied stoutly.  Ser Rodrik rose quietly and loosened his sword in its scabbard. The dwarf was blinking at them, blank-faced, with puzzlement in his mismatched eyes.   The red stallion was ever a welcome sight in Riverrun,  she said to the trio by the fire.  My father counts Jonos Bracken among his oldest and most loyal bannermen.   The three men-at-arms exchanged uncertain looks.  Our lord is honored by his trust,  one of them said hesitantly.   I envy your father all these fine friends,  Lannister quipped,  but I do not quite see the purpose of this, Lady Stark.   She ignored him, turning to the large party in blue and grey."
}