{
  "id": "94ab01067c175434b841c5819ae5b044eeef6cc9",
  "text": "  Who’s there?  she cried.  Who is it?  The godswood was dim and dark, and the bells were ringing Joff into his grave.   Me.  He staggered out from under the trees, reeling drunk. He caught her arm to steady himself.  Sweet Jonquil, I’ve come. Your Florian has come, don’t be afraid.   Sansa pulled away from his touch.  You said I must wear the hair net. The silver net with… what sort of stones are those?    Amethysts. Black amethysts from Asshai, my lady.    They’re no amethysts. Are they? Are they? You lied.    Black amethysts,  he swore.  There was magic in them.    There was murder in them!    Softly, my lady, softly. No murder. He choked on his pigeon pie.  Dontos chortled.  Oh, tasty tasty pie. Silver and stones, that’s all it was, silver and stone and magic.   The bells were tolling, and the wind was making a noise like he had made as he tried to suck a breath of air.  You poisoned him. You did. You took a stone from my hair…    Hush, you’ll be the death of us. I did nothing. Come, we must away, they’ll search for you. Your husband’s been arrested.    Tyrion?  she said, shocked.   Do you have another husband? The Imp, the dwarf uncle, she thinks he did it.  He grabbed her hand and pulled at her.  This way, we must away, quickly now, have no fear.   Sansa followed unresisting. I could never abide the weeping of women, Joff once said, but his mother was the only woman weeping now. In Old Nan’s stories the grumkins crafted magic things that could make a wish come true. Did I wish him dead? she wondered, before she remembered that she was too old to believe in grumkins.  Tyrion poisoned him?  Her dwarf husband had hated his nephew, she knew. Could he truly have killed him? Did he know about my hair net, about the black amethysts? He brought Joff wine. How could you make someone choke by putting an amethyst in their wine? If Tyrion did it, they will think I was part of it as well, she realized with a start of fear. How not? They were man and wife, and Joff had killed her father and mocked her with her brother’s death. One flesh, one heart, one soul.   Be quiet now, my sweetling,  said Dontos.  Outside the godswood, we must make no sound. Pull up your hood and hide your face.  Sansa nodded, and did as he said.  He was so drunk that sometimes Sansa had to lend him her arm to keep him from falling. The bells were ringing out across the city, more and more of them joining in. She kept her head down and stayed in the shadows, close behind Dontos. While descending the serpentine steps he stumbled to his knees and retched. My poor Florian, she thought, as he wiped his mouth with a floppy sleeve. Dress dark, he’d said, yet under his brown hooded cloak he was wearing his old surcoat; red and pink horizontal stripes beneath a black chief bearing three gold crowns, the arms of House Hollard.  Why are you wearing your surcoat? Joff decreed it was death if you were caught dressed as a knight again, he… oh…  Nothing Joff had decreed mattered any longer.   I wanted to be a knight. For this, at least.  Dontos lurched back to his feet and took her arm.  Come. Be quiet now, no questions.   They continued down the serpentine and across a small sunken courtyard. Ser Dontos shoved open a heavy door and lit a taper. They were inside a long gallery. Along the walls stood empty suits of armor, dark and dusty, their helms crested with rows of scales that continued down their backs. As they hurried past, the taper’s light made the shadows of each scale stretch and twist. The hollow knights are turning into dragons, she thought.  One more stair took them to an oaken door banded with iron.  Be strong now, my Jonquil, you are almost there.  When Dontos lifted the bar and pulled open the door, Sansa felt a cold breeze on her face, She passed through twelve feet of wall, and then she was outside the castle, standing at the top of the cliff. Below was the river, above the sky, and one was as black as the other.   We must climb down,  Ser Dontos said.  At the bottom, a man is waiting to row us out to the ship.    I’ll fall.  Bran had fallen, and he had loved to climb.   No you won’t. There’s a sort of ladder, a secret ladder, carved into the stone. Here, you can feel it, my lady.  He got down on his knees with her and made her lean over the edge of the cliff, groping with her fingers until she found the handhold cut into the face of the bluff.  Almost as good as rungs.   Even so, it was a long way down.  I can’t.    You must.    Isn’t there another way?    This is the way. It won’t be so hard for a strong young girl like you. Hold on tight and never look down and you’ll be at the bottom in no time at all.  His eyes were shiny.  Your poor Florian is fat and old and drunk, I’m the one should be afraid. I used to fall off my horse, don’t you remember? That was how we began. I was drunk and fell off my horse and Joffrey wanted my fool head, but you saved me. You saved me, sweetling.   He’s weeping, she realized.  And now you have saved me.    Only if you go."
}