{
  "id": "94e8ee504e851995061131f9b4d0843befb27e74",
  "text": "  Professor Trelawney, who had been so pleased with the pair of them when they had been predicting their own horrific deaths, quickly became irritated as they sniggered through her explanation of the various ways in which Pluto could disrupt everyday life. \"I would think,\" she said, in a mystical whisper that did not conceal her obvious annoyance, \"that some of us\" - she stared very meaningfully at Harry- \"might be a little less  frivolous had they seen what I have seen during my crystal gazing last night.  As I sat here, absorbed in my needlework, the urge to consult the orb overpowered me.  I arose, I settled myself before it, and I gazed into its crystalline depths . . . and what do you think I saw gazing back at me?\" \"An ugly old bat in outsize specs?\" Ron muttered under his breath. Harry fought hard to keep his face straight. \"Death, my dears.\" Parvati and Lavender both put their hands over their mouths, looking horrified. \"Yes,\" said Professor Trelawney, nodding impressively, \"it comes, ever closer, it circles overhead like a vulture, ever lower. . . ever lower over the castle. . . .\" She stared pointedly at Harry, who yawned very widely and obviously. \"It'd be a bit more impressive if she hadn't done it about eighty times before,\" Harry said as they finally regained the fresh air of the staircase beneath Professor Trelawney's room.  \"But if I'd dropped dead every time she's told me I'm going to, I'd be a medical miracle.\" \"You'd be a sort of extra-concentrated ghost,\" said Ron, chortling, as they passed the Bloody Baron going in the opposite direction, his wide eyes staring sinisterly.  \"At least we didn't get homework.  I hope Hermione got loads off Professor Vector, I love not working when she is. . . .\" But Hermione wasn't at dinner, nor was she in the library when they went to look for her afterward.  The only person in there was Viktor Krum.  Ron hovered behind the bookshelves for a while, watching Krum, debating in whispers with Harry whether he should ask for an autograph - but then Ron realized that six or seven girls were lurking in the next row of books, debating exactly the same thing, and he lost his enthusiasm for the idea. \"Wonder where she's got to?\" Ron said as he and Harry went back to Gryffindor Tower. \"Dunno . . . balderdash.\" But the Fat Lady had barely begun to swing forward when the sound of racing feet behind them announced Hermione's arrival. \"Harry!\" she panted, skidding to a halt beside him (the Fat Lady stared down at her, eyebrows raised).  \"Harry, you've got to come - you've got to come, the most amazing thing's happened- please -\" She seized Harry's arm and started to try to drag him back along the corridor. \"What's the matter?\"  Harry said. \"I'll show you when we get there - oh come on, quick -\" Harry looked around at Ron; he looked back at Harry, intrigued. \"Okay,\" Harry said, starting off back down the corridor with Hermione, Ron hurrying to keep up. \"Oh don't mind me!\" the Fat Lady called irritably after them.  \"Don't apologize for bothering me!  I'll just hang here, wide open, until you get back, shall I?\" \"Yeah, thanks!\" Ron shouted over his shoulder. \"Hermione, where are we going?\"  Harry asked, after she had led them down through six floors, and started down the marble staircase into the entrance hall. \"You'll see, you'll see in a minute!\"  said Hermione excitedly. She turned left at the bottom of the staircase and hurried toward the door through which Cedric Diggory had gone the night after the Goblet of Fire had regurgitated his and Harry's names.  Harry had never been through here before.  He and Ron followed Hermione down a flight of stone steps, but instead of ending up in a gloomy underground passage like the one that led to Snape's dungeon, they found themselves in a broad stone corridor, brightly lit with torches, and decorated with cheerful paintings that were mainly of food. \"Oh hang on . . .\" said Harry slowly, halfway down the corridor. \"Wait a minute, Hermione. . . .\" \"What?\" She turned around to look at him, anticipation all over her face. \"I know what this is about,\" said Harry. He nudged Ron and pointed to the painting just behind Hermione.  It showed a gigantic silver fruit bowl. \"Hermione!\" said Ron, cottoning on.  \"You're trying to rope us into that spew stuff again!\" \"No, no, I'm not!\" she said hastily. \"And it's not spew, Ron -\" \"Changed the name, have you?\"  said Ron, frowning at her.  \"What are we now, then, the House-Elf Liberation Front?  I'm not barging into that kitchen and trying to make them stop work, I'm not doing it -\" \"I'm not asking you to!\"  Hermione said impatiently.  \"I came down here just now, to talk to them all, and I found - oh come on, Harry, I want to show you!\" She seized his arm again, pulled him in front of the picture of the giant fruit bowl, stretched out her forefinger, and tickled the huge green pear.  It began to squirm, chuckling, and suddenly turned into a large green door handle.  Hermione seized it, pulled the door open, and pushed Harry hard in the back, forcing him inside."
}