{
  "id": "95455bd4aa799b305357b007e67adaa0d3b6b704",
  "text": "\"  They also skated over the accusations of bullying in the report - \"He's a boisterous little boy, but he wouldn't hurt a fly!\" Aunt Petunia had said tearfully. However, at the bottom of the report there were a few well-chosen comments from the school nurse that not even Uncle Vernon and Aunt Petunia could explain away.  No matter how much Aunt Petunia wailed that Dudley was big-boned, and that his poundage was really puppy fat, and that he was a growing boy who needed plenty of food, the fact remained that the school outfitters didn't stock knickerbockers big enough for him anymore.  The school nurse had seen what Aunt Petunia's eyes - so sharp when it came to spotting fingerprints on her gleaming walls, and in observing the comings and goings of the neighbors - simply refused to see:  that far from needing extra nourishment, Dudley had reached roughly the size and weight of a young killer whale. So - after many tantrums, after arguments that shook Harry's bedroom floor, and many tears from Aunt Petunia - the new regime had begun.  The diet sheet that had been sent by the Smeltings school nurse had been taped to the fridge, which had been emptied of all Dudley's favorite things - fizzy drinks and cakes, chocolate bars and burgers and filled instead with fruit and vegetables and the sorts of things that Uncle Vernon called \"rabbit food.\"  To make Dudley feel better about it all, Aunt Petunia had insisted that the whole family follow the diet too.  She now passed a grapefruit quarter to Harry. He noticed that it was a lot smaller than Dudley's.  Aunt Petunia seemed to feet that the best way to keep up Dudley's morale was to make sure that he did, at least, get more to eat than Harry. But Aunt Petunia didn't know what was hidden under the loose floorboard upstairs.  She had no idea that Harry was not following the diet at all.  The moment he had got wind of the fact that he was expected to survive the summer on carrot sticks, Harry had sent Hedwig to his friends with pleas for help, and they had risen to the occasion magnificently.  Hedwig had returned from Hermione's house with a large box stuffed full of sugar-free snacks.  (Hermione's parents were dentists.)  Hagrid, the Hogwarts gamekeeper, had obliged with a sack full of his own homemade rock cakes.  (Harry hadn't touched these; he had had too much experience of Hagrid's cooking.)  Mrs. Weasley, however, had sent the family owl, Errol, with an enormous fruitcake and assorted meat pies.  Poor Errol, who was elderly and feeble, had needed a full five days to recover from the journey.  And then on Harry's birthday (which the Dursleys had completely ignored) he had received four superb birthday cakes, one each from Ron, Hermione, Hagrid, and Sirius.  Harry still had two of them left, and so, looking forward to a real breakfast when he got back upstairs, he ate his grapefruit without complaint. Uncle Vernon laid aside his paper with a deep sniff of disapproval and looked down at his own grapefruit quarter. \"Is this it?\" he said grumpily to Aunt Petunia. Aunt Petunia gave him a severe look, and then nodded pointedly at Dudley, who had already finished his own grapefruit quarter and was eyeing Harry's with a very sour look in his piggy little eyes. Uncle Vernon gave a great sigh, which ruffled his large, bushy mustache, and picked up his spoon. The doorbell rang.  Uncle Vernon heaved himself out of his chair and set off down the hall.  Quick as a flash, while his mother was occupied with the kettle, Dudley stole the rest of Uncle Vernon's grapefruit. Harry heard talking at the door, and someone laughing, and Uncle Vernon answering curtly.  Then the front door closed, and the sound of ripping paper came from the hall. Aunt Petunia set the teapot down on the table and looked curiously around to see where Uncle Vernon had got to.  She didn't have to wait long to find out; after about a minute, he was back.  He looked livid. \"You,\" he barked at Harry.  \"In the living room.  Now.\" Bewildered, wondering what on earth he was supposed to have done this time, Harry got up and followed Uncle Vernon out of the kitchen and into the next room.  Uncle Vernon closed the door sharply behind both of them. \"So,\" he said, marching over to the fireplace and turning to face Harry as though he were about to pronounce him under arrest.  \"So.\" Harry would have dearly loved to have said, \"So what?\" but he didn't feel that Uncle Vernon's temper should be tested this early in the morning, especially when it was already under severe strain from lack of food.  He therefore settled for looking politely puzzled. \"This just arrived,\" said Uncle Vernon.  He brandished a piece of purple writing paper at Harry.  \"A letter.  About you.\" Harry's confusion increased.  Who would be writing to Uncle Vernon about him?  Who did he know who sent letters by the postman? Uncle Vernon glared at Harry, then looked down at the letter and began to read aloud:  Dear Mr. and Mrs. Dursley, We have never been introduced, but I am sure you have heard a great deal from Harry about my son Ron."
}