{
  "id": "95f7c0589c41743e14a20ccb0664d2b47493dcc2",
  "text": " You’re still a girl.    I am not!    Then pull out your cock and take a piss. Go on.    I don’t need to take a piss. If I wanted to I could.    Liar. You can’t take out your cock because you don’t have one. I never noticed before when there were thirty of us, but you always go off in the woods to make your water. You don’t see Hot Pie doing that, nor me neither. If you’re not a girl, you must be some eunuch.    You’re the eunuch.    You know I’m not.  Gendry smiled.  You want me to take out my cock and prove it? I don’t have anything to hide.    Yes you do,  Arya blurted, desperate to escape the subject of the cock she didn’t have.  Those gold cloaks were after you at the inn, and you won’t tell us why.    I wish I knew. I think Yoren knew, but he never told me. Why did you think they were after you, though?   Arya bit her lip. She remembered what Yoren had said, the day he had hacked off her hair. This lot, half o’ them would turn you over to the queen quick as spit for a pardon and maybe a few silvers. The other half’d do the same, only they’d rape you first. Only Gendry was different, the queen wanted him too.  I’ll tell you if you’ll tell me,  she said warily.   I would if I knew, Arry… is that really what you’re called, or do you have some girl’s name?   Arya glared at the gnarled root by her feet. She realized that the pretense was done. Gendry knew, and she had nothing in her pants to convince him otherwise. She could draw Needle and kill him where he stood, or else trust him. She wasn’t certain she’d be able to kill him, even if she tried; he had his own sword, and he was a lot stronger. All that was left was the truth.  Lommy and Hot Pie can’t know,  she said.   They won’t,  he swore.  Not from me.    Arya.  She raised her eyes to his.  My name is Arya. Of House Stark.    Of House…  It took him a moment before he said,  The King’s Hand was named Stark. The one they killed for a traitor.    He was never a traitor. He was my father.   Gendry’s eyes widened.  So that’s why you thought…   She nodded.  Yoren was taking me home to Winterfell.    I… you’re highborn then, a… you’ll be a lady…   Arya looked down at her ragged clothes and bare feet, all cracked and callused. She saw the dirt under her nails, the scabs on her elbows, the scratches on her hands. Septa Mordane wouldn’t even know me, I bet. Sansa might, but she’d pretend not to.  My mother’s a lady, and my sister, but I never was.    Yes you were. You were a lord’s daughter and you lived in a castle, didn’t you? And you… gods be good, I never…  All of a sudden Gendry seemed uncertain, almost afraid.  All that about cocks, I never should have said that. And I been pissing in front of you and everything, I… I beg your pardon, m’lady.    Stop that!  Arya hissed. Was he mocking her?   I know my courtesies, m’lady,  Gendry said, stubborn as ever.  Whenever highborn girls came into the shop with their fathers, my master told me I was to bend the knee, and speak only when they spoke to me, and call them m’lady.    If you start calling me m’lady, even Hot Pie is going to notice. And you better keep on pissing the same way too.    As m’lady commands.   Arya slammed his chest with both hands. He tripped over a stone and sat down with a thump.  What kind of lord’s daughter are you?  he said, laughing.   This kind.  She kicked him in the side, but it only made him laugh harder.  You laugh all you like. I’m going to see who’s in the village.  The sun had already fallen below the trees; dusk would be on them in no time at all. For once it was Gendry who had to hurry after.  You smell that?  she asked.  He sniffed the air.  Rotten fish?    You know it’s not.    We better be careful. I’ll go around west, see if there’s some road. There must be if you saw a wagon. You take the shore. If you need help, bark like a dog.    That’s stupid. If I need help, I’ll shout help.  She darted away, bare feet silent in the grass. When she glanced back over her shoulder, he was watching her with that pained look on his face that meant he was thinking. He’s probably thinking that he shouldn’t be letting m’lady go stealing food. Arya just knew he was going to be stupid now.  The smell grew stronger as she got closer to the village. It did not smell like rotten fish to her. This stench was ranker, fouler. She wrinkled her nose.  Where the trees began to thin, she used the undergrowth, slipping from bush to bush quiet as a shadow. Every few yards she stopped to listen. The third time, she heard horses, and a man’s voice as well. And the smell got worse. Dead man’s stink, that’s what it is. She had smelled it before, with Yoren and the others.  A dense thicket of brambles grew south of the village. By the time she reached it, the long shadows of sunset had begun to fade, and the lantern bugs were coming out. She could see thatched roofs just beyond the hedge. She crept along until she found a gap and squirmed through on her belly, keeping well hidden until she saw what made the smell."
}