{
  "id": "96069962045034de5fccd2f32468df9180a24c5a",
  "text": "   Sam looked at it and puckered his brows.        The next  day the  country on either side began to change  rapidly. The  banks began to rise and grow stony.  Soon they were passing through a  hilly  rocky land, and on both shores there were steep slopes buried in deep brakes  of thorn and sloe, tangled with brambles and creepers. Behind them stood low  crumbling  cliffs, and  chimneys of  grey weathered stone dark with ivy; and  beyond  these again there  rose high ridges crowned with wind-writhen  firs.   They were  drawing near to  the  grey  hill-country of  the  Emyn  Muil, the  southern march of Wilderland.       There were many birds about the cliffs and  the  rock -chimneys, and all  day high in  the  air flocks of  birds  had been circling, black against the  pale sky. As  they  lay  in their  camp that day Aragorn watched the flights  doubtfully, wondering if Gollum had been doing some mischief and the news  of  their voyage was now moving in the wilderness. Later as the sun was setting,  and the Company was stirring and getting ready to start again, he descried a   dark  spot against the  fading light:  a  great bird high  and far  off, now  wheeling, now flying on slowly southwards.       'What is that, Legolas? ' he  asked, pointing to the northern sky.  'Is  it, as I think. an eagle? '       'Yes.' said  Legolas.  `It is an eagle, a hunting  eagle. I wonder what  that forebodes. It is far from the mountains.'       `We will not start until it is fully dark,' said Aragorn.       The eighth night of their journey came. It was silent and windless; the  grey east wind had passed away. The thin  crescent  of the  Moon had  fallen   early into the pale sunset, but the sky was clear above, and though far away  in the South there were great ranges of cloud that still  shone faintly,  in   ####-the West stars glinted bright.       `Come! ' said Aragorn. `We will  venture one more journey  by night. We  are coming to reaches of the River that I do not know well: for I have never   journeyed by water  in these parts before, not between here and the rapids of  Sarn  Gebir. But if I am right in my reckoning, those are  still many  miles  ahead. Still there are dangerous places even before we come there: rocks and  stony  eyots in the stream. We must keep a sharp watch and not try to paddle   swiftly.'       To Sam in  the leading  boat  was given the  task  of watchman. He  lay  forward peering into the  gloom.  The night grew dark,  but the stars  above  were strangely bright, and there was a glimmer On the face of the River.  It  was close  on  midnight,  and they had been drifting for  some while. hardly   using the paddles, when suddenly Sam cried out.  Only a few yards ahead dark  shapes loomed up in the stream and he heard the swirl of racing water. There  was  a swift  current which swung left,  towards the eastern shore where the  channel was clear. As they were swept aside  the travellers could  see,  now  very close, the pale foam of the River lashing against sharp rocks that were  thrust out  far  into the stream like a  ridge of  teeth. The boats were all  huddled together.       `Hoy  there, Aragorn! '  shouted Boromir, as his boat bumped  into  the  leader.  `This is madness! We cannot  dare the Rapids  by night! But no boat  can live in Sarn Gebir, be it night or  day.'       `Back,  back! ' cried Aragorn. 'Turn! Turn if you can!  '  He drove his  paddle into the water, trying to hold the boat and bring it round.       'I am  out of my reckoning,' he said to Frodo.  'I did not know that we  had come so  far: Anduin  fl ows faster  than I thought.  Sarn Gebir must  be  close at hand already.'       With  great  efforts  they  checked  the boats and slowly brought  them  about; but at first they  could make only small headway against the current,  and all  the time they were  carried nearer and  nearer to the eastern bank.  Now dark and ominous it loomed up in the night.       'All together,  paddle!  '  shouted  Boromir. 'Paddle! Or  we  shall be  driven on the  shoals.' Even as  he  spoke  Frodo felt the  keel beneath him  grate upon stone.       At that moment there was a twang of bowstrings: several arrows whistled   over  them, and some fell among them. One smote Frodo between the   shoulders   ####-and he lurched forward with a cry, letting go his paddle: but the arrow fell  back. foiled by his hidden  coat of mail. Another passed  through  Aragorn's  hood; and a  third  stood fast in the gunwale of  the  second boat, close by  Merry's hand. Sam thought he could glimpse black  figures running to and fro  upon the long  shingle-banks that lay under  the eastern shore.  They seemed  very near.       `Yrch!' said Legolas, falling into his own tongue.       `Orcs! ' cried Gimli.       `Gollum's doing, I'll be bound.' said  Sam to Frodo. `And  a nice place  to choose, too. The River seems set on taking us right into their arms! '       They all leaned forward straining at the paddles: even Sam took a hand."
}