{
  "id": "978e7a560feae3a3328f21717910e20cca232dbb",
  "text": "  Despite the hour, the brothel was crowded. Chataya greeted them pleasantly and escorted them to the common room. Bronn went upstairs with a dark-eyed girl from Dorne, but Alayaya was busy entertaining.  She will be so pleased to know you’ve come,  said Chataya.  I will see that the turret room is made ready for you. Will my lord take a cup of wine while he waits?    I will,  he said.  The wine was poor stuff compared to the vintages from the Arbor the house normally served.  You must forgive us, my lord,  Chataya said.  I cannot find good wine at any price of late.    You are not alone in that, I fear.   Chataya commiserated with him a moment, then excused herself and glided off. A handsome woman, Tyrion reflected as he watched her go. He had seldom seen such elegance and dignity in a whore. Though to be sure, she saw herself more as a kind of priestess. Perhaps that is the secret. It is not what we do, so much as why we do it. Somehow that thought comforted him.  A few of the other patrons were giving him sideways looks. The last time he ventured out, a man had spit on him… well, had tried to. Instead he’d spit on Bronn, and in future would do his spitting without teeth.   Is milord feeling unloved?  Dancy slid into his lap and nibbled at his ear.  I have a cure for that.   Smiling, Tyrion shook his head.  You are too beautiful for words, sweetling, but I’ve grown fond of Alayaya’s remedy.    You’ve never tried mine. Milord never chooses anyone but ’Yaya. She’s good but I’m better, don’t you want to see?    Next time, perhaps.  Tyrion had no doubt that Dancy would be a lively handful. She was pug-nosed and bouncy, with freckles and a mane of thick red hair that tumbled down past her waist. But he had Shae waiting for him at the manse.  Giggling, she put her hand between his thighs and squeezed him through his breeches.  I don’t think he wants to wait till next time,  she announced.  He wants to come out and count all my freckles, I think.    Dancy.  Alayaya stood in the doorway, dark and cool in gauzy green silk.  His lordship is come to visit me.   Tyrion gently disentangled himself from the other girl and stood. Dancy did not seem to mind.  Next time,  she reminded him. She put a finger in her mouth and sucked it.  As the black-skinned girl led him up the stairs, she said,  Poor Dancy. She has a fortnight to get my lord to choose her. Elsewise she loses her black pearls to Marei.   Marei was a cool, pale, delicate girl Tyrion had noticed once or twice. Green eyes and porcelain skin, long straight silvery hair, very lovely, but too solemn by half.  I’d hate to have the poor child lose her pearls on account of me.    Then take her upstairs next time.    Maybe I will.   She smiled.  I think not, my lord.   She’s right, Tyrion thought, I won’t. Shae may be only a whore, but I am faithful to her after my fashion.  In the turret room, as he opened the door of the wardrobe, he looked at Alayaya curiously.  What do you do while I’m gone?   She raised her arms and stretched like some sleek black cat.  Sleep. I am much better rested since you began to visit us, my lord. And Marei is teaching us to read, perhaps soon I will be able to pass the time with a book.    Sleep is good,  he said.  And books are better.  He gave her a quick kiss on the cheek. Then it was down the shaft and through the tunnel.  As he left the stable on his piebald gelding, Tyrion heard the sound of music drifting over the rooftops. It was pleasant to think that men still sang, even in the midst of butchery and famine. Remembered notes filled his head, and for a moment he could almost hear Tysha as she’d sung to him half a lifetime ago. He reined up to listen. The tune was wrong, the words too faint to hear. A different song then, and why not? His sweet innocent Tysha had been a lie start to finish, only a whore his brother Jaime had hired to make him a man.  I’m free of Tysha now, he thought. She’s haunted me half my life, but I don’t need her anymore, no more than I need Alayaya or Dancy or Marei, or the hundreds like them I’ve bedded with over the years. I have Shae now. Shae.  The gates of the manse were closed and barred. Tyrion pounded until the ornate bronze eye clacked open.  It’s me.  The man who admitted him was one of Varys’s prettier finds, a Braavosi daggerman with a harelip and a lazy eye. Tyrion had wanted no handsome young guardsmen loitering about Shae day after day.  Find me old, ugly, scarred men, preferably impotent,  he had told the eunuch.  Men who prefer boys. Or men who prefer sheep, for that matter.  Varys had not managed to come up with any sheeplovers, but he did find a eunuch strangler and a pair of foulsmelling Ibbenese who were as fond of axes as they were of each other. The others were as choice a lot of mercenaries as ever graced a dungeon, each uglier than the last. When Varys had paraded them before him, Tyrion had been afraid he’d gone too far, but Shae had never uttered a word of complaint. And why would she? She has never complained of me, and I’m more hideous than all her guards together."
}