{
  "id": "9a3e3d353051ba6eceda6a3b1e0f5c31c034d9ac",
  "text": " Now, as you know, we have laid Thjoden the  Renowned in a tomb in the Hallows, and there he shall lie for ever among the  Kings of Gondor, if you will. Or if you desire it, we will come to Rohan and  bring him back to rest with his own people.'       And Jomer answered: 'Since the day when you rose before me  out of  the  green grass of the downs I have loved you , and that love shall not fail. But  now I must depart  for a while to my own realm, where there is much  to heal  and set in order.  But as for  the Fallen,  when  all is made ready we  will   ####-return for him; but here let him sleep a while.'       And Jowyn  said to Faramir: 'Now I must go back to my own land and look   on it once again, and help my brother in his labour;  but  when  one  whom I   long loved as father is laid at last to rest, I will return.'       So  the  glad days  passed; and on the  eighth day o f May the Riders of  Rohan made ready, and rode off by the North-way, and with them went the  sons  of Elrond. All the road  was lined with people to do them  honour and praise  them, from the Gate of the City  to  the  walls of the  Pelennor.  Then  all  others that dwelt afar went back to their homes  rejoicing; but in the  City  there was  labour of many willing hands to  rebuild  and renew and to remove  all the scars of war and the memory of the darkness.        The hobbits still remained in Minas Tirith, with Legolas and Gimli; for   Aragorn  was  loth for the fellowship  to be dissolved. 'At  last  all  such  things must end,' he said, 'but I would have you wait a little while longer:  for  the end  of the deeds  that you have  shared in has not yet come. A day  draws near that  I have looked for in all the years of my manhood,  and when  it comes I would have my friends beside me.' But of that day he would say no  more.       In those days the Companions of the Ring dwelt together in a fair house  with Gandalf,  and  they went to and fro as  they  wished. And Frodo said to  Gandalf:  'Do you know what this  day is that  Aragorn speaks of? For we are  happy here, and I don't wish to go; but the days are running away, and Bilbo   is waiting; and the Shire is my home.'       'As for  Bilbo,' said Gandalf, 'he is waiting for the same day, and  he  knows what keeps you. And as for the passing of the days, it is now only May  and high summer is not yet in; and though all things may seem changed, as if  an  age of the world had gone by,  yet to the trees and the grass it is less  than a year since you set out.'       'Pippin,' said Frodo, 'didn't you say  that Gandalf was less close than  of old? He was weary of his labours then, I think. Now he is recovering.'       And Gandalf said: 'Many  folk  like to know beforehand what is to be set  on the table; but those who have laboured  to prepare the feast like to keep  their secret;  for  wonder makes the words of  praise  louder.  And  Aragorn  himself waits for a sign.'       There came a day when  Gandalf could not  be  found, and  the Companions   ####-wondered what was going forward. But Gandalf took Aragorn  out from the  City  by night, and he brought him to the  southern feet  of Mount Mindolluin; and  there they found a path made  in ages  past that few now dared to tread. For   it led up on to the mountain to a high hallow where only the kings had  been  wont to go. And they went up by steep ways,  until they came to a high field  below  the  snows that clad the  lofty peaks, and it  looked down  over  the  precipice that stood behind the  City. And standing there they  surveyed the  lands, for the  morning  was come; and they saw the towers  of the  City far  below  them  like white pencils touched by the sunlight, and all the Vale of  Anduin was like a  garden, and  the  Mountains  of Shadow  were veiled in  a  golden mist. Upon the one side their  sight reached  to the grey Emyn  Muil,   and  the  glint of  Rauros was like a star twinkling far  off; and upon  the  other  side they  saw  the River like  a ribbon  laid down to Pelargir,  and  beyond that was a light on the hem of the sky that spoke of the Sea.       And Gandalf said: 'This  is  your realm, and  the heart  of the greater   realm that shall be. The Third Age of the world is ended, and the new age is  begun; and it is your  task to order its beginning  and to preserve what may  be preserved. For though much has been  saved, much must  now pass away;  and  the power  of the Three Rings also is ended. And all the lands that you see,  and those that lie round about them, shall be dwellings of Men. For the time  comes of the Dominion of Men, and the Elder Kindred shall fade or depart.'       'I  know it well, dear  friend,' said Aragorn; 'but I would still  have  your counsel.'       'Not for long now,' said Gandalf. 'The Third Age  was my age. I was the  Enemy of Sauron; and my work  is finished. I shall go soon. The  burden must   lie now upon you and your kindred.'       'But I  shall die,' said Aragorn. 'For  I  am a mortal man, and  though  being what I am and of the race of the West unmingled, I shall have life far  longer than other  men,  yet that is but a little while;  and when those who  are now in the wombs of women are  born and have grown old, I too shall grow  old."
}