{
  "id": "9ff017496b96311c076b9d7986f7ee8604a8b167",
  "text": " \"Go!\"  he hissed at Sirius. \" Go!  There's someone coming!\" Harry scrambled to his feet, hiding the fire - if someone saw Sirius's face within the walls of Hogwarts, they would raise an almighty uproar - the Ministry would get dragged in - he, Harry, would be questioned about Sirius's whereabouts -  Harry heard a tiny pop! in the fire behind him and knew Sirius had gone.  He watched the bottom of the spiral staircase.  Who had decided to go for a stroll at one o'clock in the morning, and stopped Sirius from telling him how to get past a dragon? It was Ron. Dressed in his maroon paisley pajamas, Ron stopped dead facing Harry across the room, and looked around. \"Who were you talking to?\" he said. \"What's that got to do with you?\"  Harry snarled.  \"What are you doing down here at this time of night?\" \"I just wondered where you -\"  Ron broke off, shrugging.  \"Nothing.  I'm going back to bed.\" \"Just thought you'd come nosing around, did you?\"  Harry shouted.  He knew that Ron had no idea what he'd walked in on, knew he hadn't done it on purpose, but he didn't care - at this moment he hated everything about Ron, right down to the several inches of bare ankle showing beneath his pajama trousers. \"Sorry about that,\" said Ron, his face reddening with anger.  \"Should've realized you didn't want to be disturbed.  I'll let you get on with practicing for your next interview in peace.\" Harry seized one of the POTTER REALLY STINKS badges off the table and chucked it, as hard as he could, across the room.  It hit Ron on the forehead and bounced off. \"There you go,\" Harry said. \"Something for you to wear on Tuesday.  You might even have a scar now, if yon're lucky.. . . That's what you want, isn't it?\" He strode across the room toward the stairs; he half expected Ron to stop him, he would even have liked Ron to throw a punch at him, but Ron just stood there in his too-small pajamas, and Harry, having stormed upstairs, lay awake in bed fuming for a long time afterward and didn't hear him come up to bed.  CHAPTER TWENTY - THE FIRST TASK    Harry got up on Sunday morning and dressed so inattentively that it was a while before he realized he was trying to pull his hat onto his foot instead of his sock.  When he'd finally got all his clothes on the right parts of his body, he hurried off to find Hermione, locating her at the Gryffindor table in the Great Hall, where she was eating breakfast with Ginny.  Feeling too queasy to eat, Harry waited until Hermione had swallowed her last spoonful of porridge, then dragged her out onto the grounds.  There, he told her all about the dragons, and about everything Sirius had said, while they took another long walk around the lake.   Alarmed as she was by Sirius's warnings about Karkaroff, Hermione still thought that the dragons were the more pressing problem. \"Let's just try and keep you alive until Tuesday evening,\" she said desperately, \"and then we can worry about Karkaroff.\"  They walked three times around the lake, trying all the way to think of a simple spell that would subdue a dragon.  Nothing whatsoever occurred to them, so they retired to the library instead.  Here, Harry pulled down every book he could find on dragons, and both of them set to work searching through the large pile. \"Talon-clipping by charms. .. treating scale-rot. . .' This is no good, this is for nutters like Hagrid who want to keep them healthy. .. \"Dragons are extremely difficult to slay, owing to the ancient magic that imbues their thick hides, which none but the most powerful spells can penetrate. . .' But Sirius said a simple one would do it.. . \"Let's try some simple spellbooks, then,\" said Harry, throwing aside Men Who Love Dragons Too Much. He returned to the table with a pile of spellbooks, set them down, and began to flick through each in turn, Hermione whispering nonstop at his elbow. \"Well, there are Switching Spells. . . but what's the point of Switching it?  Unless you swapped its fangs for wine-gums or something that would make it less dangerous.. . . The trouble is, like that book said, not much is going to get through a dragon's hide. . . . I'd say Transfigure it, but something that big, you really haven't got a hope, I doubt even Professor McGonagall. . . unless you're supposed to put the spell on yourself?  Maybe to give yourself extra powers?  But they're not simple spells, I mean, we haven't done any of those in class, I only know about them because I've been doing O.W.L. practice papers. . . .\" \"Hermione,\" Harry said, through gritted teeth, \"will you shut up for a bit, please?  I m trying to concentrate.\" But all that happened, when Hermione fell silent, was that Harry's brain filled with a sort of blank buzzing, which didn't seem to allow room for concentration.  He stared hopelessly down the index of Basic Hexes for the Busy and Vexed.  Instant scalping. . . but dragons had no hair. . . pepper breath.. . that would probably increase a dragon's firepower. . . horn tongue. . . just what he needed, to give it an extra weapon."
}