{
  "id": "a29af6bc72bdd993ae857b571fc59e09b1dc985a",
  "text": "  Dany mounted her silver. She could feel her heart thumping in her chest. She felt desperately afraid. Was this what my brother would have done? She wondered if Prince Rhaegar had been this anxious when he saw the Usurper’s host formed up across the Trident with all their banners floating on the wind.  She stood in her stirrups and raised the harpy’s fingers above her head for all the Unsullied to see.  IT IS DONE!  she cried at the top of her lungs.  YOU ARE MINE!  She gave the mare her heels and galloped along the first rank, holding the fingers high.  YOU ARE THE DRAGON’S NOW! YOU’RE BOUGHT AND PAID FOR! IT IS DONE! IT IS DONE!   She glimpsed old Grazdan turn his grey head sharply. He hears me speak Valyrian. The other slavers were not listening. They crowded around Kraznys and the dragon, shouting advice. Though the Astapori yanked and tugged, Drogon would not budge off the litter. Smoke rose grey from his open jaws, and his long neck curled and straightened as he snapped at the slaver’s face.  It is time to cross the Trident, Dany thought, as she wheeled and rode her silver back. Her bloodriders moved in close around her.  You are in difficulty,  she observed.   He will not come,  Kraznys said.   There is a reason. A dragon is no slave.  And Dany swept the lash down as hard as she could across the slaver’s face. Kraznys screamed and staggered back, the blood running red down his cheeks into his perfumed beard. The harpy’s fingers had torn his features half to pieces with one slash, but she did not pause to contemplate the ruin.  Drogon,  she sang out loudly, sweetly, all her fear forgotten.  Dracarys.   The black dragon spread his wings and roared.  A lance of swirling dark flame took Kraznys full in the face. His eyes melted and ran down his cheeks, and the oil in his hair and beard burst so fiercely into fire that for an instant the slaver wore a burning crown twice as tall as his head. The sudden stench of charred meat overwhelmed even his perfume, and his wail seemed to drown all other sound.  Then the Plaza of Punishment blew apart into blood and chaos. The Good Masters were shrieking, stumbling, shoving one another aside and tripping over the fringes of their tokars in their haste. Drogon flew almost lazily at Kraznys, black wings beating. As he gave the slaver another taste of fire, Irri and Jhiqui unchained Viserion and Rhaegal, and suddenly there were three dragons in the air. When Dany turned to look, a third of Astapor’s proud demon-horned warriors were fighting to stay atop their terrified mounts, and another third were fleeing in a bright blaze of shiny copper. One man kept his saddle long enough to draw a sword, but Jhogo’s whip coiled about his neck and cut off his shout. Another lost a hand to Rakharo’s arakh and rode off reeling and spurting blood. Aggo sat calmly notching arrows to his bowstring and sending them at tokars. Silver, gold, or plain, he cared nothing for the fringe. Strong Belwas had his arakh out as well, and he spun it as he charged.   Spears!  Dany heard one Astapori shout. It was Grazdan, old Grazdan in his tokar heavy with pearls.  Unsullied! Defend us, stop them, defend your masters! Spears! Swords!   When Rakharo put an arrow through his mouth, the slaves holding his sedan chair broke and ran, dumping him unceremoniously on the ground. The old man crawled to the first rank of eunuchs, his blood pooling on the bricks. The Unsullied did not so much as look down to watch him die. Rank on rank on rank, they stood.  And did not move. The gods have heard my prayer.   Unsullied!  Dany galloped before them, her silver-gold braid flying behind her, her bell chiming with every stride.  Slay the Good Masters, slay the soldiers, slay every man who wears a tokar or holds a whip, but harm no child under twelve, and strike the chains off every slave you see.  She raised the harpy’s fingers in the air… and then she flung the scourge aside.  Freedom!  she sang out.  Dracarys! Dracarys!    Dracarys!  they shouted back, the sweetest word she’d ever heard.  Dracarys! Dracarys!  And all around them slavers ran and sobbed and begged and died, and the dusty air was filled with spears and fire.      Sansa   On the morning her new gown was to be ready, the serving girls filled Sansa’s tub with steaming hot water and scrubbed her head to toe until she glowed pink. Cersei’s own bedmaid trimmed her nails and brushed and curled her auburn hair so it fell down her back in soft ringlets. She brought a dozen of the queen’s favorite scents as well. Sansa chose a sharp sweet fragrance with a hint of lemon in it under the smell of flowers. The maid dabbed some on her finger and touched Sansa behind each ear, and under her chin, and then lightly on her nipples.  Cersei herself arrived with the seamstress, and watched as they dressed Sansa in her new clothes. The smallclothes were all silk, but the gown itself was ivory samite and cloth-of-silver, and lined with silvery satin. The points of the long dagged sleeves almost touched the ground when she lowered her arms."
}