{
  "id": "a3a2ad5884648adce02b7232668121381ce560e2",
  "text": " \"I'd blow meself up before I set foot in that place. Serves him right, mind you ... after what he did....\"  \"They 'ad a job coverin' it up, din' they, Ern?\" Stan said. \"'Ole street blown up an' all them Muggles dead. What was it they said ad 'appened, Ern?\"  \"Gas explosion,\" grunted Ernie.  \"An' now 'e's out,\" said Stan, examining the newspaper picture of Black's gaunt face again. \"Never been a breakout from Azkaban before, 'as there, Ern? Beats me 'ow 'e did it. Frightenin', eh? Mind, I don't fancy 'is chances against them Azkaban guards, eh, Ern?\"  Ernie suddenly shivered.  \"Talk about summat else, Stan, there's a good lad. Them Azkaban guards give me the collywobbles.\"  Stan put the paper away reluctantly, and Harry leaned against the window of the Knight Bus, feeling worse than ever. He couldn't help imagining what Stan might be telling his passengers in a few nights' time.  \"'Ear about that 'Arry Potter? Blew up 'is aunt! We 'ad 'im 'ere on the Knight Bus, di'n't we, Ern? 'E was tryin' I to run for it....\"  He, Harry, had broken wizard law just like Sirius Black. Was inflating Aunt Marge bad enough to land him in Azkaban? Harry didn't know anything about the wizard prison, though everyone he'd ever heard speak of it did so in the same fearful tone. Hagrid, the Hogwarts gamekeeper, had spent two months there only last year. Harry wouldn't soon forget the look of terror on Hagrid's face when he had been told where he was going, and Hagrid was one of the bravest people Harry knew.  The Knight Bus rolled through the darkness, scattering bushes and wastebaskets, telephone booths and trees, and Harry lay, restless and miserable, on his feather bed. After a while, Stan remembered that Harry had paid for hot chocolate, but poured it all over Harry's pillow when the bus moved abruptly from Anglesea to Aberdeen. One by one, wizards and witches in dressing gowns and slippers descended from the upper floors to leave the bus. They all looked very pleased to go.  Finally, Harry was the only passenger left.  \"Right then, Neville,\" said Stan, clapping his hands, where abouts in London?\"  \"Diagon Alley,\" said Harry.  \"Righto,\" said Stan. \"'Old tight, then.\"  BANG.  They were thundering along Charing Cross Road. Harry sat up and watched buildings and benches squeezing themselves out of the Knight Bus's way. The sky was getting a little lighter. He would lie low for a couple of hours, go to Gringotts the. moment it opened, then set off -- where, he didn't know.  Ern slammed on the brakes and the Knight Bus skidded to a halt in front of a small and shabby- looking pub, the Leaky Cauldron, behind which lay the magical entrance to Diagon Alley.  \"Thanks,\" Harry said to Ern.  He jumped down the steps and helped Stan lower his trunk and Hedwig's cage onto the pavement.  \"Well,\" said Harry. \"'Bye then!\"  But Stan wasn't paying attention. Still standing in the doorway to the bus) he was goggling at the shadowy entrance to the Leaky Cauldron. \"There you are, Harry,\" said a voice.  Before Harry could turn, he felt a hand on his shoulder. At the same time, Stan shouted, \"Blimey! Ern, come 'ere! Come 'ere I\"  Harry looked up at the owner of the hand on his shoulder and felt a bucketful of ice cascade into his stomach -- he had walked right into Cornelius Fudge, the Minister of Magic himself.  Stan leapt onto the pavement beside them.  \"What didja call Neville, Minister?\" he said excitedly.  Fudge, a portly little man in a long, pinstriped cloak, looked cold and exhausted.  \"Neville?\" he repeated, frowning. \"This is Harry Potter.\"  \"I knew it!\" Stan shouted gleefully. \"Ern! Ern! Guess 'oo Neville is, Ern! 'E's 'Arry Potter! I can see 'is scar!\"  \"Yes,\" said Fudge testily, \"well, I'm very glad the Knight Bus picked Harry up, but he and I need to step inside the Leaky Cauldron now...\"  Fudge increased the pressure on Harry's shoulder, and Harry found himself being steered inside the pub. A stooping figure bearing a lantern appeared through the door behind the bar. It was Tom, the wizened, toothless landlord.  \"You've got him, Minister!\" said Tom. \"Will you be wanting anything? Beer? Brandy?\"  \"Perhaps a pot of tea,\" said Fudge, who still hadn't let go of Harry.  There was a loud scraping and puffing from behind them, and Stan and Ern appeared, carrying Harry's trunk and Hedwig's cage and looking around excitedly.  \"'Ow come you di'n't tell us 'oo you are, eh, Neville?\" said Stan, beaming at Harry, while Ernie's owlish face peered interestedly over Stan's shoulder.  \"And a private parlor, please, Tom,\" said Fudge pointedly.  `Bye,\" Harry said miserably to Stan and Ern as Tom beckoned Fudge toward the passage that led from the bar.  \"'Bye, Neville!\" called Stan.  Fudge marched Harry along the narrow passage after Tom's lantern, and then into a small parlor. Tom clicked his fingers, a fire burst into life in the grate, and he bowed himself out of the room.  \"Sit down, Harry,\" said Fudge, indicating a chair by the fire.  Harry sat down, feeling goose bumps rising up his arms despite the glow of the fire."
}