{
  "id": "a3fa1c5efbf369280c764da2a00307cbe7086f68",
  "text": "   \"And what is all this noise about?\" said a soft, deadly voice.   Snape had arrived.  The Slytherins clamored to give their explanations; Snape pointed a long yellow finger at Malfoy and said, \"Explain.\"   \"Potter attacked me, sir -\"   \"We attacked each other at the same time!\"  Harry shouted.   \"- and he hit Goyle - look -\"   Snape examined Goyle, whose face now resembled something that would have been at home in a book on poisonous fungi.   \"Hospital wing, Goyle,\" Snape said calmly.   \"Malfoy got Hermione!\" Ron said. \"Look!\" He forced Hermione to show Snape her teeth - she was doing her best to hide them with her hands, though this was difficult as they had now grown down past her collar.  Pansy Parkinson and the other Slytherin girls were doubled up with silent giggles, pointing at Hermione from behind Snape's back. Snape looked coldly at Hermione, then said, \"I see no difference.\". Hermione let out a whimper; her eyes filled with tears, she turned on her heel and ran, ran all the way up the corridor and out of sight. It was lucky, perhaps, that both Harry and Ron started shouting at Snape at the same time; lucky their voices echoed so much in the stone corridor, for in the confused din, it was impossible for him to hear exactly what they were calling him.  He got the gist, however. \"Let's see,\" he said, in his silkiest voice.  \"Fifty points from Gryffindor and a detention each for Potter and Weasley.  Now get inside, or it'll be a week's worth of detentions.\" Harry's ears were ringing.  The injustice of it made him want to curse Snape into a thousand slimy pieces.  He passed Snape, walked with Ron to the back of the dungeon, and slammed his bag down onto the table.  Ron was shaking with anger too - for a moment, it felt as though everything was back to normal between them, but then Ron turned and sat down with Dean and Seamus instead, leaving Harry alone at his table.  On the other side of the dungeon, Malfoy turned his back on Snape and pressed his badge, smirking. POTTER STINKS flashed once more across the room. Harry sat there staring at Snape as the lesson began, picturing horrific things happening to him. . . . If only he knew how to do the Cruciatus Curse. . . he'd have Snape flat on his back like that spider, jerking and twitching. \"Antidotes!\" said Snape, looking around at them all, his cold black eyes glittering unpleasantly. \"You should all have prepared your recipes now.  I want you to brew them carefully, and then, we will be selecting someone on whom to test one. . .\" Snape's eyes met Harry's, and Harry knew what was coming.  Snape was going to poison him.  Harry imagined picking up his cauldron, and sprinting to the front of the class, and bringing it down on Snape's greasy head - And then a knock on the dungeon door burst in on Harry's thoughts. It was Colin Creevey; he edged into the room, beaming at Harry, and walked up to Snape's desk at the front of the room. \"Yes?\" said Snape curtly. \"Please, sir, I'm supposed to take Harry Potter upstairs.\"  Snape stared down his hooked nose at Colin, whose smile faded from his eager face. \"Potter has another hour of Potions to complete,\" said Snape coldly.  \"He will come upstairs when this class is finished.\" Colin went pink. \"Sir - sir, Mr. Bagman wants him,\" he said nervously.  \"All the champions have got to go, I think they want to take photographs. . .\" Harry would have given anything he owned to have stopped Colin saying those last few words.  He chanced half a glance at Ron, but Ron was staring determinedly at the ceiling. \"Very well, very well,\" Snape snapped.  \"Potter, leave your things here, I want you back down here later to test your antidote.\" \"Please, sir - he's got to take his things with him,\" squeaked Cohn.  \"All the champions...\" \"Very well!\" said Snape.  \"Potter - take your bag and get out of my sight!\"  Harry swung his bag over his shoulder, got up, and headed for the door.  As he walked through the Slytherin desks, POTTER STINKS flashed at him from every direction. \"It's amazing, isn't it, Harry?\" said Colin, starting to speak the moment Harry had closed the dungeon door behind him.  \"Isn't it, though? You being champion?\" \"Yeah, really amazing,\" said Harry heavily as they set off toward the steps into the entrance hall.  \"What do they want photos for, Colin?\" \"The Daily Prophet, I think!\" \"Great,\" said Harry dully.  \"Exactly what I need. More publicity.\" \"Good luck!\" said Colin when they had reached the right room.  Harry knocked on the door and entered. He was in a fairly small classroom; most of the desks had been pushed away to the back of the room, leaving a large space in the middle; three of them, however, had been placed end-to-end in front of the blackboard and covered with a long length of velvet.  Five chairs had been set behind the velvet-covered desks, and Ludo Bagman was sitting in one of them, talking to a witch Harry had never seen before, who was wearing magenta robes. Viktor Krum was standing moodily in a corner as usual and not talking to anybody."
}