{
  "id": "a50d73703da33ef080efd6fef8166318fe2ab381",
  "text": "  The Old Bear stood before the fire with Smallwood, Locke, Wythers, and Blane ranged behind him in a row. Mormont wore a cloak of thick black fur, and his raven perched upon his shoulder, preening its black feathers. This can’t be good. Chett squeezed between Brown Bernarr and some Shadow Tower men. When everyone was gathered, save for the watchers in the woods and the guards on the ringwall, Mormont cleared his throat and spat. The spittle was frozen before it hit the ground.  Brothers,  he said,  men of the Night’s Watch.    Men!  his raven screamed.  Men! Men!    The wildlings are on the march, following the course of the Milkwater down out of the mountains. Thoren believes their van will be upon us ten days hence. Their most seasoned raiders will be with Harma Dogshead in that van. The rest will likely form a rearguard, or ride in close company with Mance Rayder himself. Elsewhere their fighters will be spread thin along the line of march. They have oxen, mules, horses… But few enough. Most will be afoot, and ill-armed and untrained. Such weapons as they carry are more like to be stone and bone than steel. They are burdened with women, children, herds of sheep and goats, and all their worldly goods besides. In short, though they are numerous, they are vulnerable… And they do not know that we are here. Or so we must pray.   They know, thought Chett. You bloody old pus bag, they know, certain as sunrise. Qhorin Halfhand hasn’t come back, has he? Nor Jarman Buckwell. If any of them got caught, you know damned well the wildlings will have wrung a song or two out of them by now.  Smallwood stepped forward.  Mance Rayder means to break the Wall and bring red war to the Seven Kingdoms. Well, that’s a game two can play. On the morrow we’ll bring the war to him.    We ride at dawn with all our strength,  the Old Bear said as a murmur went through the assembly.  We will ride north, and loop around to the west. Harma’s van will be well past the Fist by the time we turn. The foothills of the Frostfangs are full of narrow winding valleys made for ambush. Their line of march will stretch for many miles. We shall fall on them in several places at once, and make them swear we were three thousand, not three hundred.    We’ll hit hard and be away before their horsemen can form up to face us,  Thoren Smallwood said.  If they pursue, we’ll lead them a merry chase, then wheel and hit again farther down the column. We’ll burn their wagons, scatter their herds, and slay as many as we can. Mance Rayder himself, if we find him. If they break and return to their hovels, we’ve won. If not, we’ll harry them all the way to the Wall, and see to it that they leave a trail of corpses to mark their progress.    There are thousands,  someone called from behind Chett.   We’ll die.  That was Maslyn’s voice, green with fear.   Die,  screamed Mormont’s raven, flapping its black wings.  Die, die, die.    Many of us,  the Old Bear said.  Mayhaps even all of us. But as another Lord Commander said a thousand years ago, that is why they dress us in black. Remember your words, brothers. For we are the swords in the darkness, the watchers on the walls…    The fire that burns against the cold.  Ser Mallador Locke drew his longsword.   The light that brings the dawn,  others answered, and more swords were pulled from scabbards.  Then all of them were drawing, and it was near three hundred upraised swords and as many voices crying,  The horn that wakes the sleepers! The shield that guards the realms of men!  Chett had no choice but to join his voice to the others. The air was misty with their breath, and firelight glinted off the steel. He was pleased to see Lark and Softfoot and Sweet Donnel Hill joining in, as if they were as big fools as the rest. That was good. No sense to draw attention, when their hour was so close.  When the shouting died away, once more he heard the sound of the wind picking at the ringwall. The flames swirled and shivered, as if they too were cold, and in the sudden quiet the Old Bear’s raven cawed loudly and once again said,  Die.   Clever bird, thought Chett as the officers dismissed them, warning everyone to get a good meal and a long rest tonight. Chett crawled under his furs near the dogs, his head full of things that could go wrong. What if that bloody oath gave one of his a change of heart? Or Small Paul forgot and tried to kill Mormont during the second watch in place of the third? Or Maslyn lost his courage, or someone turned informer, or…  He found himself listening to the night. The wind did sound like a wailing child, and from time to time he could hear men’s voices, a horse’s whinny, a log spitting in the fire. But nothing else. So quiet.  He could see Bessa’s face floating before him. It wasn’t the knife I wanted to put in you, he wanted to tell her. I picked you flowers, wild roses and tansy and goldencups, it took me all morning. His heart was thumping like a drum, so loud he feared it might wake the camp. Ice caked his beard all around his mouth."
}