{
  "id": "a53e363b3b9783a6bcc92ad20879d61c0d4e7f43",
  "text": "  \"Well, third years at Hogwarts are allowed to visit Hogsmeade, but my aunt and uncle didn't sign the permission form. D'you think you could --?\"  Fudge was looking uncomfortable.  \"Ah,\" he said. \"No, no, I'm very sorry, Harry, but as I'm not your parent or guardian --\"  \"But you I re the Minister of Magic,\" said Harry eagerly. \"If you gave me permission  \"No, I'm sorry, Harry, but rules are rules,\" said Fudge flatly.  'Perhaps You'll be able to visit Hogsmeade next year. In fact, I think it's best if you don't... yes... well, I'll be off Enjoy your stay, Harry.\"  And with a last smile and shake of Harry's hand, Fudge left the room. Tom now moved forward, beaming at Harry.  \"If you'll follow me, Mr. Potter,\" he said, \"I've already taken your things up...\"  Harry followed Tom up a handsome wooden staircase to a door with a brass number eleven on it, which Tom unlocked and opened for him.  Inside was a very comfortable-looking bed, some highly polished oak furniture, a cheerfully crackling fire and, perched on top of the wardrobe -  \"Hedwig!\" Harry gasped.  The snowy owl clicked her beak and fluttered down onto Harry's arm.  \"Very smart owl you've got there, chuckled Tom. \"Arrived about five minutes after you did. If there's anything you need, Mr. Potter, don't hesitate to ask.\"  He gave another bow and left.  Harry sat on his bed for a long time, absentmindedly stroking Hedwig. The sky outside the window was changing rapidly from deep, velvety blue to cold, steely gray and then, slowly, to pink shot with gold. Harry could hardly believe that he'd left Privet Drive only a few hours ago, that he wasn't expelled, and that he was now facing two completely Dursley-free weeks.  \"It's been a very weird night, Hedwig,\" he yawned.  And without even removing his glasses, he slumped back onto his pillows and fell asleep.  CHAPTER FOUR  THE LEAKY CAULDRON  It took Harry several days to get used to his strange new freedom. Never before had he been able to get up whenever he wanted or eat whatever he fancied. He could even go wherever he pleased, as long as it was in Diagon Alley, and as this long cobbled street was packed with the most fascinating wizarding shops in the world, Harry felt no desire to break his word to Fudge and stray back into the Muggle world.  Harry ate breakfast each morning in the Leaky Cauldron, where he liked watching the other guests: funny little witches from the country, up for a day's shopping; venerable-looking wizards arguing over the latest article in Transfiguration Today; wild-looking warlocks; raucous dwarfs; and once, what looked suspiciously like a hag, who ordered a plate of raw liver from behind a thick woollen balaclava.  After breakfast Harry would go out into the backyard, take out his wand, tap the third brick from the left above the trash bit,, and stand back as the archway into Diagon Alley opened in the wall.  Harry spent the long sunny days exploring the shops and eating under the brightly colored umbrellas outside cafes, where his fellow diners were showing one another their purchases ( \" it , s a lunascope, old boy -- no more messing around with moon charts, see?\") or else discussing the case of Sirius Black (\"personalty, I won't let any of the children out alone until he's back in Azkaban\"). Harry didn't have to do his homework under the blankets by flashlight anymore; now he could sit in the bright sunshine outside Florean Fortescue's Ice Cream Parlor, finishing all his essays with occasional help from Florean Fortescue himself, who, apart from knowing a great deal about medieval witch burnings, gave Harry free sundaes every half an hour.  Once Harry had refilled his money bag with gold Galleons, silver Sickles, and bronze Knuts from his vault at Gringotts, he had to exercise a lot of self-control not to spend the whole lot at once. He had to keep reminding himself that he had five years to go at Hogwarts, and how it would feel to ask the Dursleys for money for spellbooks, to stop himself from buying a handsome set of solid gold Gobstones (a wizarding game rather like marbles, in which the stones squirt a nasty-smelling liquid into the other player's face when they lose a point). He was sorely tempted, too, by the perfect, moving model of the galaxy in a large glass ball, which would have meant he never had to take another Astronomy lesson. But the thing that tested Harry's resolution most appeared in his favorite shop, Quality Quidditch Supplies, a week after he'd arrived at the Leaky Cauldron.  Curious to know what the crowd in the shop was staring at, Harry edged his way inside and squeezed in among the excited witches and wizards until he glimpsed a newly erected podium, on which was mounted the most magnificent broom he had ever seen in his life.  \"Just come out -- prototype --\" a square-jawed wizard was telling his companion.  \"It's the fastest broom in the world, isn't it, Dad?\" squeaked a boy younger than Harry, who was swinging off his father's arm.  \"Irish International Side's Just put in an order for seven of these beauties!\" the proprietor of the shop told the crowd."
}