{
  "id": "a7a80eb510a6649d9c3354a46f1dc888638641de",
  "text": "  Tyrion Lannister sat across from him, sniffing at the stew suspiciously.  Barley, onion, carrot,  he muttered.  Someone should tell the cooks that turnip isn’t a meat.    It’s mutton stew.  Jon pulled off his gloves and warmed his hands in the steam rising from the bowl. The smell made his mouth water.   Snow.   Jon knew Alliser Thorne’s voice, but there was a curious note in it that he had not heard before. He turned.   The Lord Commander wants to see you. Now.   For a moment Jon was too frightened to move. Why would the Lord Commander want to see him? They had heard something about Benjen, he thought wildly, he was dead, the vision had come true.  Is it my uncle?  he blurted.  Is he returned safe?    The Lord Commander is not accustomed to waiting,  was Ser Alliser’s reply.  And I am not accustomed to having my commands questioned by bastards.   Tyrion Lannister swung off the bench and rose.  Stop it, Thorne. You’re frightening the boy.    Keep out of matters that don’t concern you, Lannister. You have no place here.    I have a place at court, though,  the dwarf said, smiling.  A word in the right ear, and you’ll die a sour old man before you get another boy to train. Now tell Snow why the Old Bear needs to see him. Is there news of his uncle?    No,  Ser Alliser said.  This is another matter entirely. A bird arrived this morning from Winterfell, with a message that concerns his brother.  He corrected himself.  His half brother.    Bran,  Jon breathed, scrambling to his feet.  Something’s happened to Bran.   Tyrion Lannister laid a hand on his arm.  Jon,  he said.  I am truly sorry.   Jon scarcely heard him. He brushed off Tyrion’s hand and strode across the hall. He was running by the time he hit the doors. He raced to the Commander’s Keep, dashing through drifts of old snow. When the guards passed him, he took the tower steps two at a time. By the time he burst into the presence of the Lord Commander, his boots were soaked and Jon was wild-eyed and panting.  Bran,  he said.  What does it say about Bran?   Jeor Mormont, Lord Commander of the Night’s Watch, was a gruff old man with an immense bald head and a shaggy grey beard. He had a raven on his arm, and he was feeding it kernels of corn.  I am told you can read.  He shook the raven off, and it flapped its wings and flew to the window, where it sat watching as Mormont drew a roll of paper from his belt and handed it to Jon.  Corn,  it muttered in a raucous voice.  Corn, corn.   Jon’s finger traced the outline of the direwolf in the white wax of the broken seat. He recognized Robb’s hand, but the letters seemed to blur and run as he tried to read them. He realized he was crying. And then, through the tears, he found the sense in the words, and raised his head.  He woke up,  he said.  The gods gave him back.    Crippled,  Mormont said.  I’m sorry, boy. Read the rest of the letter.   He looked at the words, but they didn’t matter. Nothing mattered. Bran was going to live.  My brother is going to live,  he told Mormont. The Lord Commander shook his head, gathered up a fistful of corn, and whistled. The raven flew to his shoulder, crying,  Live! Live!   Jon ran down the stairs, a smile on his face and Robb’s letter in his hand.  My brother is going to live,  he told the guards. They exchanged a look. He ran back to the common hall, where he found Tyrion Lannister just finishing his meal. He grabbed the little man under the arms, hoisted him up in the air, and spun him around in a circle.  Bran is going to live!  he whooped. Lannister looked startled. Jon put him down and thrust the paper into his hands.  Here, read it,  he said.  Others were gathering around and looking at him curiously. Jon noticed Grenn a few feet away. A thick woolen bandage was wrapped around one hand. He looked anxious and uncomfortable, not menacing at all. Jon went to him. Grenn edged backward and put up his hands.  Stay away from me now, you bastard.   Jon smiled at him.  I’m sorry about your wrist. Robb used the same move on me once, only with a wooden blade. It hurt like seven hells, but yours must be worse. Look, if you want, I can show you how to defend that.   Alliser Thorne overheard him.  Lord Snow wants to take my place now.  He sneered.  I’d have an easier time teaching a wolf to juggle than you will training this aurochs.    I’ll take that wager, Ser Alliser,  Jon said.  I’d love to see Ghost juggle.   Jon heard Grenn suck in his breath, shocked. Silence fell.  Then Tyrion Lannister guffawed. Three of the black brothers joined in from a nearby table. The laughter spread up and down the benches, until even the cooks joined in. The birds stirred in the rafters, and finally even Grenn began to chuckle.  Ser Alliser never took his eyes from Jon. As the laughter rolled around him, his face darkened, and his sword hand curled into a fist.  That was a grievous error, Lord Snow,  he said at last in the acid tones of an enemy.      EDDARD  Eddard Stark rode through the towering bronze doors of the Red Keep sore, tired, hungry, and irritable."
}