{
  "id": "a9a51b4ec10108ea39c2ffc0c1d47e7bc443bdaa",
  "text": " Ser Flement Brax,      —Morya’s son, ROBERT BRAX, nine, fostered at Casterly Rock as a page,  —Morya’s son, WALDER BRAX, a boy of six,  —Morya’s son, JON BRAX, a babe of three,      —TYTA, called TYTA THE MAID, a maid of twenty-nine,      —by his fifth wife, {LADY SARYA of House Whent}:    —no progeny,      —by his sixth wife, {LADY BETHANY of House Rosby}:    —SER PERWYN, their eldest son,  —SER BENFREY, m. Jyanna Frey, a cousin,      —Benfrey’s daughter, DELLA, called DEAF DELLA, a girl of three,  —Benfrey’s son, OSMUND, a boy of two,      —MAESTER WILLAMEN, in service at Longbow Hall,  —OLYVAR, a squire in the service of Robb Stark,  —ROSLIN, a maid of sixteen,      —by his seventh wife, {LADY ANNARA of House Farring}:    —ARWYN, a maid of fourteen,  —WENDEL, their eldest son, a boy of thirteen, fostered at Seagard as a page,  —COLMAR, promised to the Faith, eleven,  —WALTYR, called TYR, a boy of ten,  —ELMAR, betrothed to Arya Stark, a boy of nine,  —SHIREI, a girl of six,      —his eighth wife, LADY JOYEUSE of House Erenford,    —no progeny as yet,      —Lord Walder’s natural children, by sundry mothers,    —WALDER RIVERS, called BASTARD WALDER,      —Bastard Walder’s son, SER AEMON RIVERS,  —Bastard Walder’s daughter, WALDA RIVERS,      —MAESTER MELWYS, in service at Rosby,  —JEYNERIVERS, MARTYNRIVERS, RYGERRIVERS, RONELRIVERS, MELLARARIVERS, others.      HOUSE GREYJOY  Balon Greyjoy, Lord of the Iron Islands, previously led a rebellion against the Iron Throne, put down by King Robert and Lord Eddard Stark. Though his son Theon, raised at Winterfell, was one of Robb Stark’s supporters and closest companions, Lord Balon did not join the northmen when they marched south into the riverlands.    The Greyjoy sigil is a golden kraken upon a black field. Their words are We Do Not Sow.    BALON GREYJOY, Lord of the Iron islands, King of Salt and Rock, Son of the Sea Wind, Lord Reaper of Pyke, captain of the Great Kraken,  —his wife, LADY ALANNYS, of House Harlaw,    —their children:  —{RODRIK}, slain at Seagard during Greyjoy’s Rebellion,  —{MARON}, slain at Pyke during Greyjoy’s Rebellion,  —ASHA, captain of the Black Wind,  —THEON, a ward of Lord Eddard Stark at Winterfell,    —his brothers:    —EURON, called CROW’S EYE, captain of the Silence, an outlaw, pirate, and raider,  —VICTARION, Lord Captain of the Iron Fleet, master of the Iron Victory,  —AERON, called DAMPHAIR, a priest of the Drowned God,    —his household on Pyke:    —DAGMER called CLEFTJAW, master-at-arms, captain of the Foamdrinker,  —MAESTER WENDAMYR, healer and counselor  —HELYA, keeper of the castle,    —people of Lordsport:    —SIGRIN, a shipwright,    —his lords bannermen,    —LORD BOTLEY, of Lordsport,  —LORD WYNCH, of Iron Holt,  —LORD HARLAW, of Harlaw,  —STONEHOUSE, of Old Wyk,  —DRUMM, of Old Wyk,  —GOODBROTHER, of Old Wyk,  —GOODBROTHER, of Great Wyk,  —LORD MERLYN, of Great Wyk,  —SPARR, of Great Wyk,  —LORD BLACKTYDE, of Blacktyde,  —LORD SALTCLIFFE, of Saltcliffe,  —LORD SUNDERLY, of Saltcliffe.      HOUSE LANNISTER  The Lannisters of Casterly Rock remain the principal support of King joffrey’s claim to the Iron Throne. Their sigil is a golden lion upon a crimson field. The Lannister words are Hear Me Roar!    TYWIN LANNISTER, Lord of Casterly Rock, Warden of the West, Shield of Lannisport, and Hand of the King, commanding the Lannister host at Harrenhal,  —his wife, {LADY JOANNA}, a cousin, died in childbed,    —their children:  —SER JAIME, called the Kingslayer, Warden of the East and Lord Commander of the Kingsguard, a twin to Queen Cersei,  —QUEEN CERSEI, widow of King Robert, twin to Jaime, Queen Regent and Protector of the Realm,  —TYRION, called the IMP, a dwarf,    —his siblings:    —SER KEVAN, his eldest brother,    —Ser Kevan’s wife, DORNA, of House Swyft,      —Lady Dorna’s father, SER HARYS SWYFT,      —their children:  —SER LANCEL, formerly a squire to King Robert, knighted after his death,  —WILLEM, twin to Martyn, a squire, taken captive at the Whispering Wood,  —MARTYN, twin to Willem, a squire,  —JANEI, a girl of two,      —GENNA, his sister, wed to Ser Emmon Frey,    —Genna’s son, SER CLEOS FREY, taken captive at the Whispering Wood,  —Genna’s son, TION FREY, a squire, taken captive at the Whispering Wood,      —{SER TYGETT}, his second brother, died of a pox,    —Tygett’s widow, DARLESSA, of House Marbrand,  —Tygett’s son, TYREK, squire to the king,      —{GERION}, his youngest brother, lost at sea,    —Gerion’s bastard daughter, JOY, eleven,      —his cousin, SER STAFFORD LANNISTER, brother to the late Lady Joanna,    —Ser Stafford’s daughters, CERENNA and MYRIELLE,  —Ser Stafford’s son, SER DAVEN,      —his lord bannermen, captains, and commanders:    —SER ADDAM MARBRAND, heir to Ashemark, commander of Lord Tywin’s outriders and scouts,  —SER GREGOR CLEGANE, the Mountain That Rides,    —POLLIVER, CHISWYCK, RAFF THE SWEETLING, DUNSEN, and THE TICKLER, soldiers in his service,      —LORD LEO LEFFORD,  —SER AMORY LORCH, a captain of foragers,  —LEWYS LYDDEN, Lord of the Deep Den,  —GAWEN WESTERLING, Lord of the Crag, taken captive in the Whispering Wood and held at Seagard,  —SER ROBERT BRAX, and his brother,  —SER FLEMENT BRAX,  —SER FORLEY PRESTER, of the Golden Tooth,  —VARGO HOAT, of the Free City of Qohor, captain of the sellsword company called the Brave Companions,    —MAESTER CREYLEN, his counselor."
}