{
  "id": "aa6db863acf70249bcaa24cdc3181f5b2129d84e",
  "text": "  But  ‘third  time  pays  for  all'  as  my  father  used  to  say,  and  somehow  I don't  think  I  shall  refuse. Perhaps  I have begun  to  trust my  luck more  than I used to in the old days\" – he meant last spring before he left his own house,  but  it  seemed  centuries  ago  –  \"but  anyway  I  think  I  will  go  and  have  a  peep  at  once and get it over. Now who is coming with me?\"  He  did  not  expect  a  chorus  of  volunteers, so he was not disappointed. Fili and  Kili  looked uncomfortable and stood on One  leg, but  the others made no pretence  of offering  –  except  old Balin.  the  look-out man, who was  rather  fond  the hobbit.  He  said  he would  come  inside  at  least  and  perhaps  a bit of  the way  too,  really  to  call for help if necessary.   The most  that  can  be  said  for  the  dwarves  is  this:  they  intended  to  pay  Bilbo  really  handsomely  for  his  services;  they  had  brought  him  to  do  a  nasty  job  for  them,  and  they  did  not  mind  the  poor  little  fellow  doing  it  if  he  would;  but  they  would  all  have  done  their  best  to  get  him  out  of  trouble,  if  he  got  into  it,  as  they  did in the case of the trolls at the beginning of their adventures before they had any  particular  reasons  for  being  grateful  to  him.  There  it  is:  dwarves  are  not  heroes,  but  calculating  folk with  a great  idea of  the value of money;  some  are  tricky  and   ####-treacherous  and  pretty  bad  lots;  some  are  not,  but  are  decent  enough  people  like  Thorin and Company, if you don't expect too much.    The  stars  were  coming  out  behind  him  in  a  pale  sky  barred  with  black  when  the hobbit crept through the enchanted door and stole into the Mountain. It was far  easier going  than he  expected. This was no goblin  entrance, or  rough wood-elves'  cave.  It  was  a  passage  made  by  dwarves,  at  the  height  of  their  wealth  and  skill:  straight  as  a  ruler,  smooth-floored  and  smooth-sided,  going  with  a  gentle  never- varying slope direct-to some distant end in the blackness below.   After a while Balin bade Bilbo \"Good  luck!\" and  stopped where he could still  see the faint outline of the door, and by a trick of, the echoes of the tunnel hear the  rustle  of  the whispering  voices  of  the  others  just  outside. Then  the  hobbit  slipped  on  his  ring,  and warned  by  the  echoes  to  take more  than hobbit's care to make no  sound,  he  crept  noiselessly  down,  down,  down  into  the  dark.  He  was  trembling  with  fear,  but  his  little  face  was  set  and  grim.  Already  he  was  a  very  different  hobbit from the one that had run out without a pocket-handkerchief from Bag-End  long  ago. He had not had  a pocket-handkerchief for ages. He loosened his dagger  in its sheath, tightened his belt, and went on.    \"Now  you  are  in  for  it  at  last, Bilbo Baggins,\"  he  said  to  himself.  \"You went  and put your foot right in it that night of the party, and now you have got to pull it  out and pay for it! Dear me, what a fool I was and am!\" said the least Tookish part  of  him.  \"I  have  absolutely  no  use  for  dragon-guarded treasures, and the whole lot  could  stay  here  for  ever,  if  only  I  could wake up and  find  this beastly  tunnel was  my own front-hall at home!\"  He did not wake up of course, but went still on and on, till all sign of the door  behind  had  faded  away.  He  was  altogether  alone.  Soon  he  thought  it  was  beginning to feel warm. \"Is that a kind of a glow I seem to see coming right ahead  down  there?\"  he  thought.  It was. As  he went  forward  it  grew  and  grew,  till  there  was no doubt about it. It was a red light steadily getting redder and redder. Also it  was  now  undoubtedly  hot  in  the  tunnel. Wisps of vapour  floated up and past him  and he began to sweat. A sound, too, began to throb in his ears, a sort of bubbling  like  the  noise  of  a  large  pot  galloping  on  the  fire,  mixed  with  a  rumble  as  of  a  gigantic  tom-cat  purring.  This  grew  to  the  unmistakable  gurgling  noise  of  some  vast animal snoring in its sleep down there in the red glow in front of him.    It  was  at  this  point  that  Bilbo  stopped.  Going  on  from  there  was  the  bravest  thing he ever did. The tremendous things that happened afterward were as nothing   ####-compared  to  it.  He  fought  the  real  battle  in  the  tunnel  alone,  before  he  ever  saw  the vast danger that lay in wait. At any rate after a short halt go on he did; and you  can picture him coming to the end of the tunnel, an opening of much the same size  and shape as the door above. Through it peeps the hobbit's little head. Before him  lies the great bottommost cellar or dungeon-hall of the ancient dwarves right at the  Mountain's  root.  It  is  almost  dark  so  that  its  vastaess  can  only  be  dimly  guessed,  but  rising  from  the near side of  the  rocky  floor  there  is a great glow."
}