{
  "id": "ac144bc1e321b7c0a512703f635731606acae4fb",
  "text": ".. a tame werewolf --\"  \"You fool,\" said Lupin softly. \"Is a schoolboy grudge worth putting an innocent man back inside Azkaban?\"  BANG! Thin, snakelike cords burst from the end of Snape's wand and twisted themselves around Lupin's mouth, wrists, and ankles; he overbalanced and fell to the floor, unable to move. With a roar of rage, Black started toward Snape, but Snape pointed his wand straight between Black's eyes.  \"Give me a reason,\" he whispered. \"Give me a reason to do it, and I swear I will.\"  Black stopped dead. It would have been impossible to say which face showed more hatred.  Harry stood there, paralyzed, not knowing what to do or whom to believe. He glanced around at Ron and Hermione. Ron looked just as confused as he did, still fighting to keep hold on the struggling Scabbers. Hermione, however, took an uncertain step toward Snape and said, in a very breathless voice, \"Professor Snape -- it it wouldn't hurt to hear what they've got to say, w -- would it?\"  \"Miss Granger, you are already facing suspension from this school,\" Snape spat. \"You, Potter, and Weasley are out-of-bounds, in the company of a convicted murderer and a werewolf. For once in your life, hold your tongue.\"  \"But if -- if there was a mistake --\"  \"KEEP QUIET, YOU STUPID GIRL!\" Snape shouted, looking suddenly quite deranged. \"DON'T TALK ABOUT WHAT YOU DON'T UNDERSTAND!\" A few sparks shot out of the end of his wand, which was still pointed at Black's face. Hermione fell silent.  \"Vengeance is very sweet,\" Snape breathed at Black. \"How I hoped I would be the one to catch you....\"  \"The joke's on you again, Severus,\" Black snarled. \"As long as this boy brings his rat up to the castle\" -- he jerked his head at Ron -- \"I'll come quietly....\"  \"Up to the castle?\" said Snape silkily. \"I don't think we need to go that far. All I have to do is call the dementors once we get out of the Willow. They'll be very pleased to see you, Black... pleased enough to give you a little kiss, I daresay... I --\"  What little color there was in Blacks face left it.  \"You -you've got to hear me out,\" he croaked. \"The rat -- look at the rat --\"  But there was a mad glint in Snape's eyes that Harry had never seen before. He seemed beyond reason.  \"Come on, all of you,\" he said. He clicked his fingers, and the ends of the cords that bound Lupin flew to his hands. \"I'll drag the werewolf. Perhaps the dementors will have a kiss for him too --\"  Before he knew what he was doing, Harry had crossed the room in three strides and blocked the door.  \"Get out of the way, Potter, you're in enough trouble already,\" snarled Snape. \"If I hadn't been here to save your skin --\"  \"Professor Lupin could have killed me about a hundred times this year,\" Harry said. \"I've been alone with him loads of times, having defense lessons against the dementors. If he was helping Black, why didn't he just finish me off then?\"  \"Don't ask me to fathom the way a werewolf's mind works,\" hissed Snape. \"Get out of the way, Potter.\"  \"YOURE PATHETIC!\" Harry yelled. \"JUST BECAUSE THEY MADE A FOOL OF YOU AT SCHOOL YOU WON'T EVEN LISTEN --\"  \"SILENCE! I WILL NOT BE SPOKEN TO LIKE THAT!\" Snape shrieked, looking madder than ever. \"Like father, like son, Potter! I have just saved your neck; you should be thanking me on bended knee! You would have been well served if he'd killed you! You'd have died like your father, too arrogant to believe you might be mistaken in Black -- now get out of the way, or I will make you. GET OUT OF THE WAY, POTTER!\"  Harry made up his mind in a split second. Before Snape could take even one step toward him, he had raised his wand.  \"Expelliarmus!\" he yelled -- except that his wasn't the only voice that shouted. There was a blast that made the door rattle on its hinges; Snape was lifted off his feet and slammed into the wall, then slid down it to the floor, a trickle of blood oozing from under his hair. He had been knocked out.  Harry looked around. Both Ron and Hermione had tried to disarm Snape at exactly the same moment. Snape's wand soared in a high arc and landed on the bed next to Crookshanks.  \"You shouldn't have done that,\" said Black, looking at Harry.  \"You should have left him to me....\"  Harry avoided Black's eyes. He wasn't sure, even now, that he'd done the right thing.  \"We attacked a teacher... We attacked a teacher...\" Hermione whimpered, staring at the lifeless Snape with frightened eyes. \"Oh, we're going to be in so much trouble --\"  Lupin was struggling against his bonds. Black bent down quickly and untied him. Lupin straightened up, rubbing his arms where the ropes had cut into them.  \"Thank you, Harry,\" he said.  \"I'm still not saying I believe you,\" he told Lupin.  \"Then it's time we offered you some proof,\" said Lupin. \"You, boy -- give me Peter, please. Now.\"  Ron clutched Scabbers closer to his chest.  \"Come off it,\" he said weakly. \"Are you trying to say he broke out of Azkaban just to get his hands on Scabbers? I mean...\" He looked up at Harry and Hermione for support, \"Okay, say Pettigrew could turn into a rat -- there are millions of rats -- how's he supposed to know which one he's after if he was locked up in Azkaban?\"  \"You know, Sirius, that's a fair question,\" said Lupin, turning to Black and frowning slightly."
}