{
  "id": "ac3807aee3ae0ab13ab9fd778962ab1eeb177bf5",
  "text": "    That was good of you,  said the singer amiably.  We’ll see that it’s put to good use.   Merrett turned away from Petyr. He could taste the bile in the back of his throat.  You… you had no right.    We had a rope,  said yellow cloak.  That’s right enough.   Two of the outlaws seized Merrett’s arms and bound them tight behind his back. He was too deep in shock to struggle.  No,  was all he could manage.  I only came to ransom Petyr. You said if you had the gold by sunset he wouldn’t be harmed…    Well,  said the singer,  you’ve got us there, my lord. That was a lie of sorts, as it happens.   The one-eyed outlaw came forward with a long coil of hempen rope. He looped one end around Merrett’s neck, pulled it tight, and tied a hard knot under his ear. The other end he threw over the limb of the oak. The big man in the yellow cloak caught it.   What are you doing?  Merrett knew how stupid that sounded, but he could not believe what was happening, even then.  You’d never dare hang a Frey.   Yellow cloak laughed.  That other one, the pimply boy, he said the same thing.   He doesn’t mean it. He cannot mean it.  My father will pay you. I’m worth a good ransom, more than Petyr, twice as much.   The singer sighed.  Lord Walder might be half-blind and gouty, but he’s not so stupid as to snap at the same bait twice. Next time he’ll send a hundred swords instead of a hundred dragons, I fear.    He will!  Merrett tried to sound stem, but his voice betrayed him.  He’ll send a thousand swords, and kill you all.    He has to catch us first.  The singer glanced up at poor Petyr.  And he can’t hang us twice, now can he?  He drew a melancholy air from the strings of his woodharp.  Here now, don’t soil yourself. All you need to do is answer me a question, and I’ll tell them to let you go.   Merrett would tell them anything if it meant his life.  What do you want to know? I’ll tell you true, I swear it.   The outlaw gave him an encouraging smile.  Well, as it happens, we’re looking for a dog that ran away.    A dog?  Merrett was lost.  What kind of dog?    He answers to the name Sandor Clegane. Thoros says he was making for the Twins. We found the ferrymen who took him across the Trident, and the poor sod he robbed on the kingsroad. Did you see him at the wedding, perchance?    The Red Wedding?  Merrett’s skull felt as if it were about to split, but he did his best to recall. There had been so much confusion, but surely someone would have mentioned Joffrey’s dog sniffing round the Twins.  He wasn’t in the castle. Not at the main feast… he might have been at the bastard feast, or in the camps, but… no, someone would have said…    He would have had a child with him,  said the singer.  A skinny girl, about ten. Or perhaps a boy the same age.    I don’t think so,  said Merrett.  Not that I knew.    No? Ah, that’s a pity. Well, up you go.    No,  Merrett squealed loudly.  No, don’t, I gave you your answer, you said you’d let me go.    Seems to me that what I said was I’d tell them to let you go.  The singer looked at yellow cloak.  Lem, let him go.    Go bugger yourself,  the big outlaw replied brusquely.  The singer gave Merrett a helpless shrug and began to play,  The Day They Hanged Black Robin.    Please.  The last of Merrett’s courage was running down his leg.  I’ve done you no harm. I brought the gold, the way you said. I answered your question. I have children.    That Young Wolf never will,  said the one-eyed outlaw.  Merrett could hardly think for the pounding in his head.  He shamed us, the whole realm was laughing, we had to cleanse the stain on our honor.  His father had said all that and more.   Maybe so. What do a bunch o’ bloody peasants know about a lord’s honor?  Yellow cloak wrapped the end of the rope around his hand three times.  We know some about murder, though.    Not murder.  His voice was shrill.  It was vengeance, we had a right to our vengeance. It was war. Aegon, we called him Jinglebell, a poor lackwit never hurt anyone, Lady Stark cut his throat. We lost half a hundred men in the camps. Ser Garse Goodbrook, Kyra’s husband, and Ser Tytos, Jared’s son… someone smashed his head in with an axe… Stark’s direwolf killed four of our wolfhounds and tore the kennelmaster’s arm off his shoulder, even after we’d filled him full of quarrels…    So you sewed his head on Robb Stark’s neck after both o’ them were dead,  said yellow cloak.   My father did that. All I did was drink. You wouldn’t kill a man for drinking.  Merrett remembered something then, something that might be the saving of him.  They say Lord Beric always gives a man a trial, that he won’t kill a man unless something’s proved against him. You can’t prove anything against me. The Red Wedding was my father’s work, and Ryman’s and Lord Bolton’s. Lothar rigged the tents to collapse and put the crossbowmen in the gallery with the musicians, Bastard Walder led the attack on the camps… they’re the ones you want, not me, I only drank some wine… you have no witness."
}