{
  "id": "aeee640aa868d850a7498734c3e91a235623bb31",
  "text": " \"Just hope he's still fine after he's faced this lot,\" said Charlie grimly, looking out over the dragons' enclosure.  \"I didn't dare tell Mum what he's got to do for the first task; she's already having kittens about him. . . .\"  Charlie imitated his mother's anxious voice. \"How could they let him enter that tournament, he's much too young!  I thought they were all safe, I thought there was going to be an age limit!'  She was in floods after that Daily Prophet article about him.  'He still cries about his parents!  Oh bless him, I never knew!\" Harry had had enough.  Trusting to the fact that Hagrid wouldn't miss him, with the attractions of four dragons and Madame Maxime to occupy him, he turned silently and began to walk away, back to the castle. He didn't know whether he was glad he'd seen what was coming or not.  Perhaps this way was better.  The first shock was over now.  Maybe if he'd seen the dragons for the first time on Tuesday, he would have passed out cold in front of the whole school. . . but maybe he would anyway. .. . He was going to be armed with his wand - which, just now, felt like nothing more than a narrow strip of wood -- against a fifty-foot-high, scaly, spike-ridden, fire-breathing dragon.  And he had to get past it.  With everyone watching.  How? Harry sped up, skirting the edge of the forest; he had just under fifteen minutes to get back to the fireside and talk to Sirius, and he couldn't remember, ever, wanting to talk to someone more than he did right now -- when, without warning, he ran into something very solid. Harry fell backward, his glasses askew, clutching the cloak around him.  A voice nearby said, \"Ouch! Who's there?\" Harry hastily checked that the cloak was covering him and hay very still, staring up at the dark outline of the wizard he had hit.  He recognized the goatee. . . it was Karkaroff. \"Who's there?\"  said Karkaroff again, very suspiciously, looking around in the darkness.  Harry remained still and silent.  After a minute or so, Karkaroff seemed to decide that he had hit some sort of animal; he was looking around at waist height, as though expecting to see a dog.  Then he crept back under the cover of the trees and started to edge forward toward the place where the dragons were. Very slowly and very carefully, Harry got to his feet and set off again as fast as he could without making too much noise, hurrying through the darkness back toward Hogwarts. He had no doubt whatsoever what Karkaroff was up to.  He had sneaked off his ship to try and find out what the first task was going to be.  He might even have spotted Hagrid and Madame Maxime heading off around the forest together - they were hardly difficult to spot at a distance. . . and now all Karkaroff had to do was follow the sound of voices, and he, like Madame Maxime, would know what was in store for the champions. By the looks of it, the only champion who would be facing the unknown on Tuesday was Cedric. Harry reached the castle, slipped in through the front doors, and began to climb the marble stairs; he was very out of breath, but he didn't dare slow down. . . . He had less than five minutes to get up to the fire. \"Balderdash!\" he gasped at the Fat Lady, who was snoozing in her frame in front of the portrait hole. \"If you say so,\" she muttered sleepily, without opening her eyes, and the picture swung forward to admit him.  Harry climbed inside.  The common room was deserted, and, judging by the fact that it smelled quite normal, Hermione had not needed to set off any Dungbombs to ensure that he and Sirius got privacy. Harry pulled off the Invisibility Cloak and threw himself into an armchair in front of the fire.  The room was in semidarkness; the flames were the only source of light.  Nearby, on a table, the Support Cedric Diggory! badges the Creeveys had been trying to improve were glinting in the firelight.  They now read POTTER REALLY STINKS.  Harry looked back into the flames, and jumped.   Sirius's head was sitting in the fire.  If Harry hadn't seen Mr. Diggory do exactly this back in the Weasleys' kitchen, it would have scared him out of his wits.  Instead, his face breaking into the first smile he had worn for days, he scrambled out of his chair, crouched down by the hearth, and said, \"Sirius - how're you doing?\" Sirius looked different from Harry's memory of him.  When they had said good-bye, Sirius's face had been gaunt and sunken, surrounded by a quantity of long, black, matted hair - but the hair was short and clean now, Sirius's face was fuller, and he looked younger, much more like the only photograph Harry had of him, which had been taken at the Potters' wedding. \"Never mind me, how are you?\" said Sirius seriously. \"I'm -\"  For a second, Harry tried to say \"fine\" - but he couldn't do it.  Before he could stop himself, he was talking more than he'd talked in days - about how no one believed he hadn't entered the tournament of his own free will, how Rita Skeeter had lied about him in the Daily Prophet, how he couldn't walk down a corridor without being sneered at - and about Ron, Ron not believing him, Ron's jealousy."
}