{
  "id": "b006b11fa44f9e44f49ec33fd6746bce0ff13b6d",
  "text": " \"I can smell the Wood-fires for the cooking.\"  Tired as he was, Bilbo would have liked to stay awhile. Elvish singing is not a  thing  to  miss,  in  June  under  the  stars,  not  if  you  care  for  such  things.  Also  he  would  have  liked  to  have  a  few  private  words  with  these  people  that  seemed  to  know  his  name  and  all  about  him,  although  he  had  never  been  them  before.  He  thought  their  opinion  of  his  adventure might  be  interesting. Elves  know  a  lot  and  are wondrous  folk  for news, and know what  is going on among the peoples of the  land,  as  quick  as water  flows,  or  quicker. But  the  dwarves were  all  for  supper  as  soon  'as  possible  just  then,  and  would  not  stay.  On  they  all  went,  leading  their  ponies, till they were brought to a good path and so at last to the very brink of the  river.  It  was  flowing  fast  and  noisily,  as  mountain-streams  do  of  a  summer  evening, when  sun  has  been  all  day  on  the  snow  far  up  above.  There was  only  a  narrow bridge of stone without a parapet, as narrow as a pony could well walk on;  and  over  that  they had  to go, slow and careful, one by one, each  leading his pony  by  the  bridle. The  elves  had  brought  bright  lanterns  to  the  shore,  and  they  sang  a  merry song as the party went across.   ####-\"Don't dip your beard in the foam, father!\" they cried to Thorin, who was bent  almost on to his hands and knees. \"It is long enough without watering it.\"  \"Mind  Bilbo  doesn't  eat  all  the  cakes!\"  they  called.  \"He  is  too  fat  to  get  through key-holes yet!\"  \"Hush,  hush!  Good  People!  and  good  night!\"  said  Gandalf,  who  came  last.  \"Valleys have ears, and some elves have over merry tongues. Good night!\"  And  so  at  last  they  all  came  to  the  Last  Homely  House,  and  found  its  doors  flung wide.  Now  it  is  a  strange  thing,  but  things  that  are  good  to  have  and  days  that  are  good  to spend are soon told about, and not much to listen to; while things that are  uncomfortable, palpitating, and even gruesome, may make a good tale, and take a  deal of telling anyway. They stayed long in that good house, fourteen days at least,  and  they  found  it  hard  to  leave.  Bilbo  would  gladly  have  stopped  there  for  ever  and  ever-even  supposing  a  wish  would  have  taken  him  right  back  to  his  hobbit- hole without trouble. Yet there is little to tell about their stay.   The  master  of  the  house  was  an  elf-friend-one  of  those  people whose  fathers  came  into  the  strange  stories  before  the  beginning  of History,  the wars  of  the  evil  goblins and the elves and the first men in the North. In those days of our tale there  were  still  some  people who  had  both  elves  and  heroes  of  the North  for ancestors,  and Elrond the master of the house was their chief. He was as noble and as fair in  face  as  an  elf-lord,  as  strong  as  a warrior,  as wise  as  a wizard,  as  venerable  as  a  king  of  dwarves,  and  as  kind  as  summer. He  comes  into. many  tales, but his part  in  the  story  of  Bilbo's  great  adventure  is  only  a  small  one,  though  important,  as  you  will  see,  if  we  ever  get  to  the  end  of  it.  His  house  was  perfect,  whether  you  liked  food,  or  sleep,  or  work,  or  story-telling,  or  singing,  or  just  sitting  and  thinking best, or a pleasant mixture of them all. Evil things did not come into that  valley.   I wish I had  time  to  tell you even a few of  the  tales or one or  two of  the songs  that  they  heard  in  that  house. All  of  them,  the  ponies  as well,  grew  refreshed and  strong  in  a  few  days  there.  Their  clothes  were  mended  as  well  as  their  bruises,  their tempers and their hopes. Their bags were filled with food and provisions light  to  carry  but  strong  to  bring  them  over  the  mountain  passes.  Their  plans  were  improved  with  the  best  advice.  So  the  time  came  to  mid-  summer  eve,  and  they  were to go on again with the early sun on midsummer morning.  Elrond  knew  all  about  runes  of  every  kind. That  day  he  looked  at  the  swords  they had brought from the trolls' lair, and he said: \"These are not troll-make. They  are old swords, very old swords of the High Elves of the West, my kin. They were   ####-made  in  Gondolin  for  the  Goblin-wars.  They  must  have  come  from  a  dragon's  hoard  or  goblin  plunder,  for  dragons  and  goblins  destroyed  that  city  many  ages  ago.  This,  Thorin,  the  runes  name  Orcrist,  the  Goblin-cleaver  in  the  ancient  tongue  of  Gondolin;  it  was  a  famous  blade.  This,  Gandalf,  was  Glamdring,  Foe- hammer that the king of Gondolin once wore. Keep them well!\"  \"Whence  did  the  trolls  get  them,  I wonder?\"  said Thorin  looking at his  sword  with new interest.  \"I  could  not  say,\"  said  Elrond,  \"but  one  may  guess  that  your  trolls  had  plundered other plunderers, or come on the remnants of old robberies in some hold  in  the mountains  of  the North."
}