{
  "id": "b2c943d9e16382551ec16616256ecdb7c1668173",
  "text": " Yet even if his words were incomprehensible, you had only to look at him to know that he was drunk.  Ser Jorah went to him swiftly, whispered something in his ear, and took him by the arm, but Viserys wrenched free.  Keep your hands off me! No one touches the dragon without leave.   Dany glanced anxiously up at the high bench. Khal Drogo was saying something to the other khals beside him. Khal Jommo grinned, and Khal Ogo began to guffaw loudly.  The sound of laughter made Viserys lift his eyes.  Khal Drogo,  he said thickly, his voice almost polite.  I’m here for the feast.  He staggered away from Ser Jorah, making to join the three khals on the high bench.  Khal Drogo rose, spat out a dozen words in Dothraki, faster than Dany could understand, and pointed.  Khal Drogo says your place is not on the high bench,  Ser Jorah translated for her brother.  Khal Drogo says your place is there.   Viserys glanced where the khal was pointing. At the back of the long hall, in a corner by the wall, deep in shadow so better men would not need to look on them, sat the lowest of the low; raw unblooded boys, old men with clouded eyes and stiff joints, the dim-witted and the maimed. Far from the meat, and farther from honor.  That is no place for a king,  her brother declared.   Is place,  Khal Drogo answered, in the Common Tongue that Dany had taught him,  for Sorefoot King.  He clapped his hands together.  A cart! Bring cart for Khal Rhaggat!   Five thousand Dothraki began to laugh and shout. Ser Jorah was standing beside Viserys, screaming in his ear, but the roar in the hall was so thunderous that Dany could not hear what he was saying. Her brother shouted back and the two men grappled, until Mormont knocked Viserys bodily to the floor.  Her brother drew his sword.  The bared steel shone a fearful red in the glare from the firepits.  Keep away from me!  Viserys hissed. Ser Jorah backed off a step, and her brother climbed unsteadily to his feet. He waved the sword over his head, the borrowed blade that Magister Illyrio had given him to make him seem more kingly. Dothraki were shrieking at him from all sides, screaming vile curses.  Dany gave a wordless cry of terror. She knew what a drawn sword meant here, even if her brother did not.  Her voice made Viserys turn his head, and he saw her for the first time.  There she is,  he said, smiling. He stalked toward her, slashing at the air as if to cut a path through a wall of enemies, though no one tried to bar his way.   The blade… you must not,  she begged him.  Please, Viserys. It is forbidden. Put down the sword and come share my cushions. There’s drink, food… is it the dragon’s eggs you want? You can have them, only throw away the sword.    Do as she tells you, fool,  Ser Jorah shouted,  before you get us all killed.   Viserys laughed.  They can’t kill us. They can’t shed blood here in the sacred city… but I can.  He laid the point of his sword between Daenerys’s breasts and slid it downward, over the curve of her belly.  I want what I came for,  he told her.  I want the crown he promised me. He bought you, but he never paid for you. Tell him I want what I bargained for, or I’m taking you back. You and the eggs both. He can keep his bloody foal. I’ll cut the bastard out and leave it for him.  The sword point pushed through her silks and pricked at her navel. Viserys was weeping, she saw; weeping and laughing, both at the same time, this man who had once been her brother.  Distantly, as from far away, Dany heard her handmaid Jhiqui sobbing in fear, pleading that she dared not translate, that the khal would bind her and drag her behind his horse all the way up the Mother of Mountains. She put her arm around the girl.  Don’t be afraid,  she said.  I shall tell him.   She did not know if she had enough words, yet when she was done Khal Drogo spoke a few brusque sentences in Dothraki, and she knew he understood. The sun of her life stepped down from the high bench.  What did he say?  the man who had been her brother asked her, flinching.  It had grown so silent in the hall that she could hear the bells in Khal Drogo’s hair, chiming softly with each step he took. His bloodriders followed him, like three copper shadows. Daenerys had gone cold all over.  He says you shall have a splendid golden crown that men shall tremble to behold.   Viserys smiled and lowered his sword. That was the saddest thing, the thing that tore at her afterward… the way he smiled.  That was all I wanted,  he said.  What was promised.   When the sun of her life reached her, Dany slid an arm around his waist. The khal said a word, and his bloodriders leapt forward. Qotho seized the man who had been her brother by the arms. Haggo shattered his wrist with a single, sharp twist of his huge hands. Cohollo pulled the sword from his limp fingers. Even now Viserys did not understand.  No,  he shouted,  you cannot touch me, I am the dragon, the dragon, and I will be crowned!   Khal Drogo unfastened his belt. The medallions were pure gold, massive and ornate, each one as large as a man’s hand."
}