{
  "id": "b9c3687f386d4903244662c36c90c3d795d77ce5",
  "text": " . . why did this band of wizards never come to the aid of their master, to whom they swore eternal loyalty?\" No one spoke.  No one moved except Wormtail, who was upon the ground, still sobbing over his bleeding arm.   \"And I answer myself,\" whispered Voldemort, \"they must have believed me broken, they thought I was gone.  They slipped back among my enemies, and they pleaded innocence, and ignorance, and bewitchment. . . . \"And then I ask myself, but how could they have believed I would not rise again?  They, who knew the steps I took, long ago, to guard myself against mortal death?  They, who had seen proofs of the immensity of my power in the times when I was mightier than any wizard living? \"And I answer myself, perhaps they believed a still greater power could exist, one that could vanquish even Lord Voldemort. . . perhaps they now pay allegiance to another . . . perhaps that champion of commoners, of Mudbloods and Muggles, Albus Dumbledore?\" At the mention of Dumbledore's name, the members of the circle stirred, and some muttered and shook their heads. Voldemort ignored them. \"It is a disappointment to me ... I confess myself disappointed. . . .\" One of the men suddenly flung himself forward, breaking the circle.  Trembling from head to foot, he collapsed at Voldemort's feet. \"Master!\" he shrieked, \"Master, forgive me!  Forgive us all!\" Voldemort began to laugh.  He raised his wand. \"Crucio!\" The Death Eater on the ground writhed and shrieked; Harry was sure the sound must carry to the houses around. . . . Let the police come, he thought desperately . . . anyone . .. anything. . . Voldemort raised his wand.  The tortured Death Eater lay flat upon the ground, gasping. \"Get up, Avery,\" said Voldemort softly. \"Stand up. You ask for forgiveness?  I do not forgive.  I do not forget.  Thirteen long years ... I want thirteen years' repayment before I forgive you.  Wormtail here has paid some of his debt already, have you not, Wormtail?\" He looked down at Wormtail, who continued to sob. \"You returned to me, not out of loyalty, but out of fear of your old friends.  You deserve this pain, Wormtail.  You know that, don't you?\" \"Yes, Master,\" moaned Wormtail, \"please. Master . . . please ...\" \"Yet you helped return me to my body,\" said Voldemort coolly, watching Wormtail sob on the ground.  \"Worthless and traitorous as you are, you helped me ... and Lord Voldemort rewards his helpers... .\" Voldemort raised his wand again and whirled it through the air.  A streak of what looked like molten silver hung shining in the wand's wake.  Momentarily shapeless, it writhed and then formed itself into a gleaming replica of a human hand, bright as moonlight, which soared downward and fixed itself upon Wormtails bleeding wrist. Wormtail's sobbing stopped abruptly.  His breathing harsh and ragged, he raised his head and stared in disbelief at the silver hand, now attached seamlessly to his arm, as though he were wearing a dazzling glove.  He flexed the shining fingers, then, trembling, picked up a small twig on the ground and crushed it into powder. \"My Lord,\" he whispered. \"Master ... it is beautiful. . . thank you... thank you. ...\" He scrambled forward on his knees and kissed the hem of Voldemort's robes. \"May your loyalty never waver again, Wormtail,\" said Voldemort. \"No, my Lord . . . never, my Lord . . .\" Wormtail stood up and took his place in the circle, staring at his powerful new hand, his face still shining with tears.  Voldemort now approached the man on Wormtail's right. \"Lucius, my slippery friend,\" he whispered, halting before him.  \"I am told that you have not renounced the old ways, though to the world you present a respectable face.  You are still ready to take the lead in a spot of Muggle-torture, I believe?  Yet you never tried to find me, Lucius. . . . Your exploits at the Quidditch World Cup were fun, I daresay. . . but might not your energies have been better directed toward finding and aiding your master?\" \"My Lord, I was constantly on the alert,\" came Lucius Malfoy's voice swiftly from beneath the hood.  \"Had there been any sign from you, any whisper of your whereabouts, I would have been at your side immediately, nothing could have prevented me -\" \"And yet you ran from my Mark, when a faithful Death Eater sent it into the sky last summer?\"  said Voldemort lazily, and Mr. Malfoy stopped talking abruptly.  \"Yes, I know all about that, Lucius. . . . You have disappointed me. ... I expect more faithful service in the future.\" \"Of course, my Lord, of course. . . . You are merciful, thank you. ...\" Voldemort moved on, and stopped, staring at the space - large enough for two people - that separated Malfoy and the next man. \"The Lestranges should stand here,\" said Voldemort quietly.  \"But they are entombed in Azkaban.  They were faithful.  They went to Azkaban rather than renounce me. . . . When Azkaban is broken open, the Lestranges will be honored beyond their dreams.  The dementors will join us ... they are our natural allies ."
}