{
  "id": "baaf9995054943d9333fda0622e3b0016f5f9654",
  "text": "  Ser Vardis held out a gauntleted hand, and his squire placed a handsome double-edged longsword in his grasp. The blade was engraved with a delicate silver tracery of a mountain sky; its pommel was a falcon’s head, its crossguard fashioned into the shape of wings.  I had that sword crafted for Jon in King’s Landing,  Lysa told her guests proudly as they watched Ser Vardis try a practice cut.  He wore it whenever he sat the Iron Throne in King Robert’s place. Isn’t it a lovely thing? I thought it only fitting that our champion avenge Jon with his own blade.   The engraved silver blade was beautiful beyond a doubt, but it seemed to Catelyn that Ser Vardis might have been more comfortable with his own sword. Yet she said nothing; she was weary of futile arguments with her sister.   Make them fight!  Lord Robert called out.  Ser Vardis faced the Lord of the Eyrie and lifted his sword in salute.  For the Eyrie and the Vale!   Tyrion Lannister had been seated on a balcony across the garden, flanked by his guards. It was to him that Bronn turned with a cursory salute.   They await your command,  Lady Lysa said to her lord son.   Fight!  the boy screamed, his arms trembling as they clutched at his chair.  Ser Vardis swiveled, bringing up his heavy shield. Bronn turned to face him. Their swords rang together, once, twice, a testing. The sellsword backed off a step. The knight came after, holding his shield before him. He tried a slash, but Bronn jerked back, just out of reach, and the silver blade cut only air. Bronn circled to his right. Ser Vardis turned to follow, keeping his shield between them. The knight pressed forward, placing each foot carefully on the uneven ground. The sellsword gave way, a faint smile playing over his lips. Ser Vardis attacked, slashing, but Bronn leapt away from him, hopping lightly over a low, moss-covered stone. Now the sellsword circled left, away from the shield, toward the knight’s unprotected side. Ser Vardis tried a hack at his legs, but he did not have the reach. Bronn danced farther to his left. Ser Vardis turned in place.   The man is craven,  Lord Hunter declared.  Stand and fight, coward!  Other voices echoed the sentiment.  Catelyn looked to Ser Rodrik. Her master-at-arms gave a curt shake of his head.  He wants to make Ser Vardis chase him. The weight of armor and shield will tire even the strongest man.   She had seen men practice at their swordplay near every day of her life, had viewed half a hundred tourneys in her time, but this was something different and deadlier: a dance where the smallest misstep meant death. And as she watched, the memory of another duel in another time came back to Catelyn Stark, as vivid as if it had been yesterday.  They met in the lower bailey of Riverrun. When Brandon saw that Petyr wore only helm and breastplate and mail, he took off most of his armor. Petyr had begged her for a favor he might wear, but she had turned him away. Her lord father promised her to Brandon Stark, and so it was to him that she gave her token, a pale blue handscarf she had embroidered with the leaping trout of Riverrun. As she pressed it into his hand, she pleaded with him.  He is only a foolish boy, but I have loved him like a brother. It would grieve me to see him die.  And her betrothed looked at her with the cool grey eyes of a Stark and promised to spare the boy who loved her.  That fight was over almost as soon as it began. Brandon was a man grown, and he drove Littlefinger all the way across the bailey and down the water stair, raining steel on him with every step, until the boy was staggering and bleeding from a dozen wounds.  Yield!  he called, more than once, but Petyr would only shake his head and fight on, grimly. When the river was lapping at their ankles, Brandon finally ended it, with a brutal backhand cut that bit through Petyr’s rings and leather into the soft flesh below the ribs, so deep that Catelyn was certain that the wound was mortal. He looked at her as he fell and murmured  Cat  as the bright blood came flowing out between his mailed fingers. She thought she had forgotten that.  That was the last time she had seen his face… until the day she was brought before him in King’s Landing.  A fortnight passed before Littlefinger was strong enough to leave Riverrun, but her lord father forbade her to visit him in the tower where he lay abed. Lysa helped their maester nurse him; she had been softer and shyer in those days. Edmure had called on him as well, but Petyr had sent him away. Her brother had acted as Brandon’s squire at the duel, and Littlefinger would not forgive that. As soon as he was strong enough to be moved, Lord Hoster Tully sent Petyr Baelish away in a closed litter, to finish his healing on the Fingers, upon the windswept jut of rock where he’d been born.  The ringing clash of steel on steel jarred Catelyn back to the present. Ser Vardis was coming hard at Bronn, driving into him with shield and sword. The sellsword scrambled backward, checking each blow, stepping lithely over rock and root, his eyes never leaving his foe."
}