{
  "id": "bb7a7301abb94fb18a5c51da8a5466cf4dd6f6a4",
  "text": " \"He -brought them back from Hogsmeade last time --\"  \"Indeed? And you've been carrying them around ever since? How very touching... and what is this?\"  Snape had picked up the map. Harry tried with all his might to keep his face impassive.  \"Spare bit of parchment,\" he said with a shrug.  Snape turned it over, his eyes on Harry.  \"Surely you don't need such a very old piece of parchment?\" he said. \"Why don't I just -- throw this away?\"  His hand moved toward the fire.  \"No!\" Harry said quickly.  \"So!\" said Snape, his long nostrils quivering. \"Is this another treasured gift from Mr. Weasley? Or is it -- something else? A letter, perhaps, written in invisible ink? Or -- instructions to get into Hogsmeade without passing the dementors?\"  Harry blinked. Snape's eyes gleamed.  \"Let me see, let me see....\" he muttered, taking out his wand and smoothing the map out on his desk. \"Reveal your secret!\" he said, touching the wand to the parchment.  Nothing happened. Harry clenched his hands to stop them from shaking.  \"Show yourself!\" Snape said, tapping the map sharply.  It stayed blank. Harry was taking deep, calming breaths.  \"Professor Severus Snape, master of this school, commands you to yield the information you conceal!\" Snape said, hitting the map with his wand.  As though an invisible hand were writing upon it, words appeared on the smooth surface of the map.  Mooney presents his compliments to Professor Snape, and begs him to keep his abnormally large nose out of other people's business.\"  Snape froze. Harry stared, dumbstruck, at the message. But the map didn't stop there. More writing was appearing beneath the first.  \"Mr. Prongs agrees with Mr. Moony and would like to add that Professor Snape is an ugle git.\"  It would have been very funny if the situation hadn't been so serious. And there was more....  \"Mr. Padfoot would like to register his astonishment that an idiot like that ever became a professor.\"  Harry closed his eyes in horror. When he'd opened them, the map had had its last word.  \"Mr. Wormtail bids Professor Snape good day, and advises him to wash his hair , the slimeball.\"  Harry waited for the blow to fall.  \"So...\" said Snape softly. \"We'll see about this....\"  He strode across to his fire, seized a fistful of glittering powder from a jar on the fireplace, and threw it into the flames.  \"Lupin!\" Snape called into the fire. \"I want a word!\"  Utterly bewildered, Harry stared at the fire. A large shape had appeared in it, revolving very fast. Seconds later, Professor Lupin was clambering out of the fireplace, brushing ash off his shabby robes.  \"You called, Severus?\" said Lupin mildly.  \"I certainly did,\" said Snape, his face contorted with fury as he strode back to his desk. \"I have just asked Potter to empty his pockets. He was carrying this.\"  Snape pointed at the parchment, on which the words of Messrs. Moony, Wormtail, Padfoot, and Prongs were still shining. An odd, closed expression appeared on Lupin's face.  \"Well?\" said Snape.  Lupin continued to stare at the map. Harry had the impression that Lupin was doing some very quick thinking.  \"Well?\" said Snape again. \"This parchment is plainly full of Dark Magic. This is supposed to be your area of expertise, Lupin. Where do you imagine Potter got such a thing?\"  Lupin looked up and, by the merest half-glance in Harry's direction, warned him not to interrupt.  \"Full of Dark Magic?\" he repeated mildly. \"Do you really think so, Severus? It looks to me as though it is merely a piece of parchment that insults anybody who reads it. Childish, but surely not dangerous? I imagine Harry got it from a joke shop --\"  \"Indeed?\" said Snape. His jaw had gone rigid with anger. \"You think a joke shop could supply him with such a thing? You don't think it more likely that he got it directly from the manufacturers?\"  Harry didn't understand what Snape was talking about. Nor, apparently, did Lupin.  \"You mean, by Mr. Wormtail or one of these people?\" he said. \"Harry, do you know any of these men?\"  \"No,\" said Harry quickly.  \"You see, Severus?\" said Lupin, turning back to Snape. \"It looks like a Zonko product to me --\"  Right on cue, Ron came bursting into the office. He was completely out of breath, and stopped just short of Snape's desk, clutching the stitch in his chest and trying to speak.  \"I -- gave -- Harry -- that -- stuff,\" he choked. \"Bought -- it... in Zonko's... ages -- ago...\"  \"Well!\" said Lupin, clapping his hands together and looking around cheerfully. \"That seems to clear that up! Severus, I'll take this back, shall I?\" He folded the map and tucked it inside his robes. \"Harry, Ron, come with me, I need a word about my vampire essay -- excuse us, Severus --\"  Harry didn't dare look at Snape as they left his office. He. Ron, and Lupin walked all the way back into the entrance hall before speaking. Then Harry turned to Lupin.  \"Professor, I --\"  \"I don't want to hear explanations,\" said Lupin shortly. He glanced around the empty entrance hall and lowered his voice."
}