{
  "id": "bd3546a5905e4091794b3991937f54c25f1d6a97",
  "text": " It was hard to relax with Hermione next to you reciting the twelve uses of dragon's blood or practicing wand movements. Moaning and yawning, Harry and Ron spent most of their free time in the library with her, trying to get through all their extra work.  \"I'll never remember this,\" Ron burst out one afternoon, throwing down his quill and looking longingly out of the library window. It was the first really fine day they'd had in months. The sky was a clear, forget-me-not blue, and there was a feeling in the air of summer coming.  Harry, who was looking up \"Dittany\" in One Thousand Magical Herbs and Fungi, didn't look up until he heard Ron say, \"Hagrid! What are you doing in the library?\"  Hagrid shuffled into view, hiding something behind his back. He looked very out of place in his moleskin overcoat.  \"Jus' lookin',\" he said, in a shifty voice that got their interest at once. \"An' what're you lot up ter?\" He looked suddenly suspicious. \"Yer not still lookin' fer Nicolas Flamel, are yeh?\" \"Oh, we found out who he is ages ago,\" said Ron impressively. \"And we know what that dog's guarding, it's a Sorcerer's St --\"  \"Shhhh!\" Hagrid looked around quickly to see if anyone was listening. \"Don' go shoutin' about it, what's the matter with yeh?\"  \"There are a few things we wanted to ask you, as a matter of fact,\" said Harry, \"about what's guarding the Stone apart from Fluffy --\"  \"SHHHH!\" said Hagrid again. \"Listen - come an' see me later, I'm not promisin' I'll tell yeh anythin', mind, but don' go rabbitin' about it in here, students aren' s'pposed ter know. They'll think I've told yeh --\"  \"See you later, then,\" said Harry.  Hagrid shuffled off.  \"What was he hiding behind his back?\" said Hermione thoughtfully.  \"Do you think it had anything to do with the Stone?\"  \"I'm going to see what section he was in,\" said Ron, who'd had enough of working. He came back a minute later with a pile of books in his arms and slammed them down on the table.  \"Dragons!\" he whispered. \"Hagrid was looking up stuff about dragons! Look at these: Dragon Species of Great Britain and Ireland; From Egg to Inferno, A Dragon Keeper's Guide.\"  \"Hagrid's always wanted a dragon, he told me so the first time I ever met him, \" said Harry.  \"But it's against our laws,\" said Ron. \"Dragon breeding was outlawed by the Warlocks' Convention of 1709, everyone knows that. It's hard to stop Muggles from noticing us if we're keeping dragons in the back garden - anyway, you can't tame dragons, it's dangerous. You should see the burns Charlie's got off wild ones in Romania.\"  \"But there aren't wild dragons in Britain?\" said Harry.  \"Of course there are,\" said Ron. \"Common Welsh Green and Hebridean Blacks. The Ministry of Magic has a job hushing them up, I can tell you. Our kind have to keep putting spells on Muggles who've spotted them, to make them forget.\"  \"So what on earths Hagrid up to?\" said Hermione.  When they knocked on the door of the gamekeeper's hut an hour later, they were surprised to see that all the curtains were closed. Hagrid called \"Who is it?\" before he let them in, and then shut the door quickly behind them.  It was stifling hot inside. Even though it was such a warm day, there was a blazing fire in the grate. Hagrid made them tea and offered them stoat sandwiches, which they refused.  \"So -- yeh wanted to ask me somethin'?\"  \"Yes,\" said Harry. There was no point beating around the bush. \"We were wondering if you could tell us what's guarding the Sorcerer's Stone apart from Fluffy.\"  Hagrid frowned at him.  \"0' course I cant, he said. \"Number one, I don' know meself. Number two, yeh know too much already, so I wouldn' tell yeh if I could. That Stone's here fer a good reason. It Was almost stolen outta Gringotts - I s'ppose yeh've worked that out an' all? Beats me how yeh even know abou' Fluffy.\"  \"Oh, come on, Hagrid, you might not want to tell us, but you do know, you know everything that goes on round here,\" said Hermione in a warm, flattering voice. Hagrid's beard twitched and they could tell he was smiling. \"We only wondered who had done the guarding, really.\" Hermione went on. \"We wondered who Dumbledore had trusted enough to help him, apart from you.\"  Hagrid's chest swelled at these last words. Harry and Ron beamed at Hermione.  \"Well, I don' s'pose it could hurt ter tell yeh that... let's see... he borrowed Fluffy from me... then some o' the teachers did enchantments... Professor Sprout -- Professor Flitwick -- Professor McGonagall --\" he ticked them off on his fingers, \"Professor Quirrell -- an' Dumbledore himself did somethin', o' course. Hang on, I've forgotten someone. Oh yeah, Professor Snape.\"  \"Snape?\"  \"Yeah -- yer not still on abou' that, are yeh? Look, Snape helped protect the Stone, he's not about ter steal it.\"  Harry knew Ron and Hermione were thinking the same as he was. If Snape had been in on protecting the Stone, it must have been easy to find out how the other teachers had guarded it. He probably knew everything -- except, it seemed, Quirrell's spell and how to get past Fluffy."
}