{
  "id": "bd71c49d9abd25f08bd4b3f3c475f7948856262e",
  "text": " Instead of salutes, voices called to her on every side in a babble of tongues. Some of the freedmen greeted her as  Mother,  while others begged for boons or favors. Some prayed for strange gods to bless her, and some asked her to bless them instead. She smiled at them, turning right and left, touching their hands when they raised them, letting those who knelt reach up to touch her stirrup or her leg. Many of the freedmen believed there was good fortune in her touch. If it helps give them courage, let them touch me, she thought. There are hard trials yet ahead…  Dany had stopped to speak to a pregnant woman who wanted the Mother of Dragons to name her baby when someone reached up and grabbed her left wrist. Turning, she glimpsed a tall ragged man with a shaved head and a sunburnt face.  Not so hard,  she started to say, but before she could finish he’d yanked her bodily from the saddle. The ground came up and knocked the breath from her, as her silver whinnied and backed away. Stunned, Dany rolled to her side and pushed herself onto one elbow…  …and then she saw the sword.   There’s the treacherous sow,  he said.  I knew you’d come to get your feet kissed one day.  His head was bald as a melon, his nose red and peeling, but she knew that voice and those pale green eyes.  I’m going to start by cutting off your teats.  Dany was dimly aware of Missandei shouting for help. A freedman edged forward, but only a step. One quick slash, and he was on his knees, blood running down his face. Mero wiped his sword on his breeches.  Who’s next?    I am.  Arstan Whitebeard leapt from his horse and stood over her, the salt wind riffling through his snowy hair, both hands on his tall hardwood staff.   Grandfather,  Mero said,  run off before I break your stick in two and bugger you with—   The old man feinted with one end of the staff, pulled it back, and whipped the other end about faster than Dany would have believed. The Titan’s Bastard staggered back into the surf, spitting blood and broken teeth from the ruin of his mouth. Whitebeard put Dany behind him. Mero slashed at his face. The old man jerked back, cat-quick. The staff thumped Mero’s ribs, sending him reeling. Arstan splashed sideways, parried a looping cut, danced away from a second, checked a third mid-swing. The moves were so fast she could hardly follow. Missandei was pulling Dany to her feet when she heard a crack. She thought Arstan’s staff had snapped until she saw the jagged bone jutting from Mero’s calf. As he fell, the Titan’s Bastard twisted and lunged, sending his point straight at the old man’s chest. Whitebeard swept the blade aside almost contemptuously and smashed the other end of his staff against the big man’s temple. Mero went sprawling, blood bubbling from his mouth as the waves washed over him. A moment later the freedmen washed over him too, knives and stones and angry fists rising and falling in a frenzy.  Dany turned away, sickened. She was more frightened now than when it had been happening. He would have killed me.   Your Grace.  Arstan knelt.  I am an old man, and shamed. He should never have gotten close enough to seize you. I was lax. I did not know him without his beard and hair.    No more than I did.  Dany took a deep breath to stop her shaking. Enemies everywhere.  Take me back to my tent. Please.   By the time Mormont arrived, she was huddled in her lion pelt, drinking a cup of spice wine.  I had a look at the river wall,  Ser Jorah started.  It’s a few feet higher than the others, and just as strong. And the Meereenese have a dozen fire hulks tied up beneath the ramparts—   She cut him off.  You might have warned me that the Titan’s Bastard had escaped.   He frowned.  I saw no need to frighten you, Your Grace. I have offered a reward for his head—    Pay it to Whitebeard. Mero has been with us all the way from Yunkai. He shaved his beard off and lost himself amongst the freedmen, waiting for a chance for vengeance. Arstan killed him.   Ser Jorah gave the old man a long look.  A squire with a stick slew Mero of Braavos, is that the way of it?    A stick,  Dany confirmed,  but no longer a squire. Ser Jorah, it’s my wish that Arstan be knighted.    No.   The loud refusal was surprise enough. Stranger still, it came from both men at once.  Ser Jorah drew his sword.  The Titan’s Bastard was a nasty piece of work. And good at killing. Who are you, old man?    A better knight than you, ser,  Arstan said coldly.  Knight? Dany was confused.  You said you were a squire.    I was, Your Grace.  He dropped to one knee.  I squired for Lord Swann in my youth, and at Magister Illyrio’s behest I have served Strong Belwas as well. But during the years between, I was a knight in Westeros. I have told you no lies, my queen. Yet there are truths I have withheld, and for that and all my other sins I can only beg your forgiveness.    What truths have you withheld?  Dany did not like this.  You will tell me. Now.   He bowed his head.  At Qarth, when you asked my name, I said I was called Arstan."
}