{
  "id": "c1ee981bff0a7d10a0cd9eee0cb51e4066578aea",
  "text": " He thought of the promises that Ser Axell had made on the bridge above the yard. A ship or a shove, what shall it be? But this was Stannis asking.  Your Grace,  he said slowly,  I make it folly… aye, and cowardice.    Cowardice?  Ser Axell all but shouted.  No man calls me craven before my king!    Silence,  Stannis commanded.  Ser Davos, speak on, I would hear your reasons.   Davos turned to face Ser Axell.  You say we ought show the realm we are not done. Strike a blow. Make war, aye… but on what enemy? You will find no Lannisters on Claw Isle.    We will find traitors,  said Ser Axell,  though it may be I could find some closer to home. Even in this very room.   Davos ignored the jibe.  I don’t doubt Lord Celtigar bent the knee to the boy Joffrey. He is an old done man, who wants no more than to end his days in his castle, drinking his fine wine out of his jeweled cups.  He turned back to Stannis.  Yet he came when you called, sire. Came, with his ships and swords. He stood by you at Storm’s End when Lord Renly came down on us, and his ships sailed up the Blackwater. His men fought for you, killed for you, burned for you. Claw Isle is weakly held, yes. Held by women and children and old men. And why is that? Because their husbands and sons and fathers died on the Blackwater, that’s why. Died at their oars, or with swords in their hands, fighting beneath our banners. Yet Ser Axell proposes we swoop down on the homes they left behind, to rape their widows and put their children to the sword. These smallfolk are no traitors…    They are,  insisted Ser Axell.  Not all of Celtigar’s men were slain on the Blackwater. Hundreds were taken with their lord, and bent the knee when he did.    When he did,  Davos repeated.  They were his men. His sworn men. What choice were they given?    Every man has choices. They might have refused to kneel. Some did, and died for it. Yet they died true men, and loyal.    Some men are stronger than others.  It was a feeble answer, and Davos knew it. Stannis Baratheon was a man of iron will who neither understood nor forgave weakness in others. I am losing, he thought, despairing.   It is every man’s duty to remain loyal to his rightful king, even if the lord he serves proves false,  Stannis declared in a tone that brooked no argument.  A desperate folly took hold of Davos, a recklessness akin to madness.  As you remained loyal to King Aerys when your brother raised his banners?  he blurted.  Shocked silence followed, until Ser Axell cried,  Treason!  and snatched his dagger from its sheath.  Your Grace, he speaks his infamy to your face!   Davos could hear Stannis grinding his teeth. A vein bulged, blue and swollen, in the king’s brow. Their eyes met.  Put up your knife, Ser Axell. And leave us.    As it please Your Grace—    It would please me for you to leave,  said Stannis.  Take yourself from my presence, and send me Melisandre.    As you command.  Ser Axell slid the knife away, bowed, and hurried toward the door. His boots rang against the floor, angry.   You have always presumed on my forbearance,  Stannis warned Davos when they were alone.  I can shorten your tongue as easy as I did your fingers, smuggler.    I am your man, Your Grace. So it is your tongue, to do with as you please.    It is,  he said, calmer.  And I would have it speak the truth. Though the truth is a bitter draught at times. Aerys? If you only knew… that was a hard choosing. My blood or my liege. My brother or my king.  He grimaced.  Have you ever seen the Iron Throne? The barbs along the back, the ribbons of twisted steel, the jagged ends of swords and knives all tangled up and melted? It is not a comfortable seat, ser. Aerys cut himself so often men took to calling him King Scab, and Maegor the Cruel was murdered in that chair. By that chair, to hear some tell it. It is not a seat where a man can rest at ease. Ofttimes I wonder why my brothers wanted it so desperately.    Why would you want it, then?  Davos asked him.   It is not a question of wanting. The throne is mine, as Robert’s heir. That is law. After me, it must pass to my daughter, unless Selyse should finally give me a son.  He ran three fingers lightly down the table, over the layers of smooth hard varnish, dark with age.  I am king. Wants do not enter into it. I have a duty to my daughter. To the realm. Even to Robert. He loved me but little, I know, yet he was my brother. The Lannister woman gave him horns and made a motley fool of him. She may have murdered him as well, as she murdered Jon Arryn and Ned Stark. For such crimes there must be justice. Starting with Cersei and her abominations. But only starting. I mean to scour that court clean. As Robert should have done, after the Trident. Ser Barristan once told me that the rot in King Aerys’s reign began with Varys. The eunuch should never have been pardoned. No more than the Kingslayer. At the least, Robert should have stripped the white cloak from Jaime and sent him to the Wall, as Lord Stark urged."
}