{
  "id": "c2377963bafd453a0eef3a202d1799d14592971e",
  "text": " That dear brave loyal old soul. She could almost see him, tugging on his fierce white whiskers.  What of our other people?    The ironmen put many of them to the sword, I fear.   Wordless with rage, Robb slammed a fist down on the table and turned his face away, so the Freys would not see his tears.  But his mother saw them. The world grows a little darker every day. Catelyn’s thoughts went to Ser Rodrik’s little daughter Beth, to tireless Maester Luwin and cheerful Septon Chayle, Mikken at the forge, Farlen and Palla in the kennels, Old Nan and simple Hodor. Her heart was sick.  Please, not all.    No,  said Lame Lothar.  The women and children hid, my nephews Walder and Walder among them. With Winterfell in ruins, the survivors were carried back to the Dreadfort by this son of Lord Bolton’s.    Bolton’s son?  Robb’s voice was strained.  Walder Rivers spoke up.  A bastard son, I believe.    Not Ramsay Snow? Does Lord Roose have another bastard?  Robb scowled.  This Ramsay was a monster and a murderer, and he died a coward. Or so I was told.    I cannot speak to that. There is much confusion in any war. Many false reports. All I can tell you is that my nephews claim it was this bastard son of Bolton’s who saved the women of Winterfell, and the little ones. They are safe at the Dreadfort now, all those who remain.    Theon,  Robb said suddenly.  What happened to Theon Greyjoy? Was he slain?   Lame Lothar spread his hands.  That I cannot say, Your Grace. Walder and Walder made no mention of his fate. Perhaps Lord Bolton might know, if he has had word from this son of his.   Ser Brynden said,  We will be certain to ask him.    You are all distraught, I see. I am sorry to have brought you such fresh grief. Perhaps we should adjourn until the morrow. Our business can wait until you have composed yourselves…    No,  said Robb,  I want the matter settled.   Her brother Edmure nodded.  Me as well. Do you have an answer to our offer, my lord?    I do.  Lothar smiled.  My lord father bids me tell Your Grace that he will agree to this new marriage alliance between our houses and renew his fealty to the King in the North, upon the condition that the King’s Grace apologize for the insult done to House Frey, in his royal person, face to face.   An apology was a small enough price to pay, but Catelyn misliked this petty condition of Lord Walder’s at once.   I am pleased,  Robb said cautiously.  It was never my wish to cause this rift between us, Lothar. The Freys have fought valiantly for my cause. I would have them at my side once more.    You are too kind, Your Grace. As you accept these terms, I am then instructed to offer Lord Tully the hand of my sister, the Lady Roslin, a maid of sixteen years. Roslin is my lord father’s youngest daughter by Lady Bethany of House Rosby, his sixth wife. She has a gentle nature and a gift for music.   Edmure shifted in his seat.  Might not it be better if I first met—    You’ll meet when you’re wed,  said Walder Rivers curtly.  Unless Lord Tully feels a need to count her teeth first?   Edmure kept his temper.  I will take your word so far as her teeth are concerned, but it would be pleasant if I might gaze upon her face before I espoused her.    You must accept her now, my lord,  said Walder Rivers.  Else my father’s offer is withdrawn.   Lame Lothar spread his hands.  My brother has a soldier’s bluntness, but what he says is true. It is my lord father’s wish that this marriage take place at once.    At once?  Edmure sounded so unhappy that Catelyn had the unworthy thought that perhaps he had been entertaining notions of breaking the betrothal after the fighting was done.   Has Lord Walder forgotten that we are fighting a war?  Brynden Blackfish asked sharply.   Scarcely,  said Lothar.  That is why he insists that the marriage take place now, ser. Men die in war, even men who are young and strong. What would become of our alliance should Lord Edmure fall before he took Roslin to bride? And there is my father’s age to consider as well. He is past ninety and not like to see the end of this struggle. It would put his noble heart at peace if he could see his dear Roslin safely wed before the gods take him, so he might die with the knowledge that the girl had a strong husband to cherish and protect her.   We all want Lord Walder to die happy. Catelyn was growing less and less comfortable with this arrangement.  My brother has just lost his own father. He needs time to mourn.    Roslin is a cheerful girl,  said Lothar.  She may be the very thing Lord Edmure needs to help him through his grief.    And my grandfather has come to mislike lengthy betrothals,  the bastard Walder Rivers added.  I cannot imagine why.   Robb gave him a chilly look.  I take your meaning, Rivers. Pray excuse us.    As Your Grace commands.  Lame Lothar rose, and his bastard brother helped him hobble from the room.  Edmure was seething.  They’re as much as saying that my promise is worthless. Why should I let that old weasel choose my bride? Lord Walder has other daughters besides this Roslin."
}