{
  "id": "c2c51197dce7ce62c7cdfece033e17870cdf26bf",
  "text": " Sansa hovered by the door, for once unguarded. The queen had given her freedom of the castle as a reward for being good, yet even so, she was escorted everywhere she went.  Honor guards for my daughter-to-be,  the queen called them, but they did not make Sansa feel honored.   Freedom of the castle  meant that she could go wherever she chose within the Red Keep so long as she promised not to go beyond the walls, a promise Sansa had been more than willing to give. She couldn’t have gone beyond the walls anyway. The gates were watched day and night by Janos Slynt’s gold cloaks, and Lannister house guards were always about as well. Besides, even if she could leave the castle, where would she go? It was enough that she could walk in the yard, pick flowers in Myrcella’s garden, and visit the sept to pray for her father. Sometimes she prayed in the godswood as well, since the Starks kept the old gods.  This was the first court session of Joffrey’s reign, so Sansa looked about nervously. A line of Lannister house guards stood beneath the western windows, a line of gold-cloaked City Watchmen beneath the east. Of smallfolk and commoners, she saw no sign, but under the gallery a cluster of lords great and small milled restlessly. There were no more than twenty, where a hundred had been accustomed to wait upon King Robert.  Sansa slipped in among them, murmuring greetings as she worked her way toward the front. She recognized black-skinned Jalabhar Xho, gloomy Ser Aron Santagar, the Redwyne twins Horror and Slobber… only none of them seemed to recognize her. Or if they did, they shied away as if she had the grey plague. Sickly Lord Gyles covered his face at her approach and feigned a fit of coughing, and when funny drunken Ser Dontos started to hail her, Ser Balon Swann whispered in his ear and he turned away.  And so many others were missing. Where had the rest of them gone? Sansa wondered. Vainly, she searched for friendly faces. Not one of them would meet her eyes. It was as if she had become a ghost, dead before her time.  Grand Maester Pycelle was seated alone at the council table, seemingly asleep, his hands clasped together atop his beard. She saw Lord Varys hurry into the hall, his feet making no sound. A moment later Lord Baelish entered through the tall doors in the rear, smiling. He chatted amiably with Ser Balon and Ser Dontos as he made his way to the front. Butterflies fluttered nervously in Sansa’s stomach. I shouldn’t be afraid, she told herself. I have nothing to be afraid of, it will all come out well, Joff loves me and the queen does too, she said so.  A herald’s voice rang out.  All hail His Grace, Joffrey of the Houses Baratheon and Lannister, the First of his Name, King of the Andals, the Rhoynar, and the First Men, and Lord of the Seven Kingdoms. All hail his lady mother, Cersei of House Lannister, Queen Regent, Light of the West, and Protector of the Realm.   Ser Barristan Selmy, resplendent in white plate, led them in. Ser Arys Oakheart escorted the queen, while Ser Boros Blount walked beside Joffrey, so six of the Kingsguard were now in the hall, all the White Swords save Jaime Lannister alone. Her prince—no, her king now!—took the steps of the Iron Throne two at a time, while his mother was seated with the council. Joff wore plush black velvets slashed with crimson, a shimmering cloth-of-gold cape with a high collar, and on his head a golden crown crusted with rubies and black diamonds.  When Joffrey turned to look out over the hall, his eye caught Sansa’s. He smiled, seated himself, and spoke.  It is a king’s duty to punish the disloyal and reward those who are true. Grand Maester Pycelle, I command you to read my decrees.   Pycelle pushed himself to his feet. He was clad in a magnificent robe of thick red velvet, with an ermine collar and shiny gold fastenings. From a drooping sleeve, heavy with gilded scrollwork, he drew a parchment, unrolled it, and began to read a long list of names, commanding each in the name of king and council to present themselves and swear their fealty to Joffrey. Failing that, they would be adjudged traitors, their lands and titles forfeit to the throne.  The names he read made Sansa hold her breath. Lord Stannis Baratheon, his lady wife, his daughter. Lord Renly Baratheon. Both Lord Royces and their sons. Ser Loras Tyrell. Lord Mace Tyrell, his brothers, uncles, sons. The red priest, Thoros of Myr. Lord Beric Dondarrion. Lady Lysa Arryn and her son, the little Lord Robert. Lord Hoster Tully, his brother Ser Brynden, his son Ser Edmure. Lord Jason Mallister. Lord Bryce Caron of the Marches. Lord Tytos Blackwood. Lord Walder Frey and his heir Ser Stevron. Lord Karyl Vance. Lord Jonos Bracken. Lady Sheila Whent. Doran Martell, Prince of Dorne, and all his sons. So many, she thought as Pycelle read on and on, it will take a whole flock of ravens to send out these commands.  And at the end, near last, came the names Sansa had been dreading. Lady Catelyn Stark. Robb Stark."
}