{
  "id": "c36fc45dc036ccff8705901d2de23559678c75c4",
  "text": "  He looked at Sam again and grinned a big helpless stupid grin.  I still can’t believe you’re here.   Jon Snow had smiled to see him too, but it was a tired smile, like the one he wore now.  You made it back after all,  he said.  And brought Gilly out as well. You’ve done well, Sam.   Jon had done more than well himself, to hear Grenn tell it. Yet even capturing the Horn of Winter and a wildling prince had not been enough for Ser Alliser Thorne and his friends, who still named him turncloak. Though Maester Aemon said his wound was healing well, Jon bore other scars, deeper than the ones around his eye. He grieves for his wildling girl, and for his brothers.   It’s strange,  he said to Sam.  Craster had no love for Mance, nor Mance for Craster, but now Craster’s daughter is feeding Mance’s son.    I have the milk,  Gilly said, her voice soft and shy.  Mine takes only a little. He’s not so greedy as this one.   The wildling woman Val turned to face them.  I’ve heard the queen’s men saying that the red woman means to give Mance to the fire, as soon as he is strong enough.   Jon gave her a weary look.  Mance is a deserter from the Night’s Watch. The penalty for that is death. If the Watch had taken him, he would have been hanged by now, but he’s the king’s captive, and no one knows the king’s mind but the red woman.    I want to see him,  Val said.  I want to show him his son. He deserves that much, before you kill him.   Sam tried to explain.  No one is permitted to see him but Maester Aemon, my lady.    If it were in my power, Mance could hold his son.  Jon’s smile was gone.  I’m sorry, Val.  He turned away.  Sam and I have duties to return to. Well, Sam does, anyway. We’ll ask about your seeing Mance. That’s all I can promise.   Sam lingered long enough to give Gilly’s hand a squeeze and promise to return again after supper. Then he hurried after. There were guards outside the door, queen’s men with spears. Jon was halfway down the steps, but he waited when he heard Sam puffing after him.  You’re more than fond of Gilly, aren’t you?   Sam reddened.  Gilly’s good. She’s good and kind.  He was glad that his long nightmare was done, glad to be back with his brothers at Castle Black… but some nights, alone in his cell, he thought of how warm Gilly had been when they’d curled up beneath the furs with the babe between them.  She… she made me braver, Jon. Not brave, but… braver.    You know you cannot keep her,  Jon said gently,  no more than I could stay with Ygritte. You said the words, Sam, the same as I did. The same as all of us.    I know. Gilly said she’d be a wife to me, but… I told her about the words, and what they meant. I don’t know if that made her sad or glad, but I told her.  He swallowed nervously and said,  Jon, could there be honor in a lie, if it were told for a… a good purpose?    It would depend on the lie and the purpose, I suppose.  Jon looked at Sam.  I wouldn’t advise it. You’re not made to lie, Sam. You blush and squeak and stammer.    I do,  said Sam,  but I could lie in a letter. I’m better with a quill in hand. I had a… a thought. When things are more settled here, I thought maybe the best thing for Gilly… I thought I might send her to Horn Hill. To my mother and sisters and my… my f-f-father. If Gilly were to say the babe was m-mine…  He was blushing again.  My mother would want him, I know. She would find some place for Gilly, some kind of service, it wouldn’t be as hard as serving Craster. And Lord R-Randyll, he… he would never say so, but he might be pleased to believe I got a bastard on some wildling girl. At least it would prove I was man enough to lie with a woman and father a child. He told me once that I was sure to die a maiden, that no woman would ever… you know… Jon, if I did this, wrote this lie… would that be a good thing? The life the boy would have…    Growing up a bastard in his grandfather’s castle?  Jon shrugged.  That depends in great part on your father, and what sort of boy this is. If he takes after you…    He won’t. Craster’s his real father. You saw him, he was hard as an old tree stump, and Gilly is stronger than she looks.    If the boy shows any skill with sword or lance, he should have a place with your father’s household guard at the least,  Jon said.  It’s not unknown for bastards to be trained as squires and raised to knighthood. But you’d best be sure Gilly can play this game convincingly. From what you’ve told me of Lord Randyll, I doubt he would take kindly to being deceived.   More guards were posted on the steps outside the tower. These were king’s men, though; Sam had quickly learned the difference. The king’s men were as earthy and impious as any other soldiers, but the queen’s men were fervid in their devotion to Melisandre of Asshai and her Lord of Light.  Are you going to the practice yard again?  Sam asked as they crossed the yard.  Is it wise to train so hard before your leg’s done healing?   Jon shrugged.  What else is there for me to do? Marsh has removed me from duty, for fear that I’m still a turncloak."
}