{
  "id": "c37916d9dce93ad4cac12b5d4dda3b8058ebd411",
  "text": " With Mormont dead, command would pass to Ser Ottyn Wythers, an old done man, and failing. He’ll be running for the Wall before sundown, and he won’t waste no men sending them after us neither.  The dogs pulled at him as they made their way through the trees. Chett could see the Fist punching its way up through the green. The day was so dark that the Old Bear had the torches lit, a great circle of them burning all along the ringwall that crowned the top of the steep stony hill. The three of them waded across a brook. The water was icy cold, and patches of ice were spreading across its surface.  I’m going to make for the coast,  Lark the Sisterman confided.  Me and my cousins. We’ll build us a boat, sail back home to the Sisters.   And at home they’ll know you for deserters and lop off your fool heads, thought Chett. There was no leaving the Night’s Watch, once you said your words. Anywhere in the Seven Kingdoms, they’d take you and kill you.  Ollo Lophand now, he was talking about sailing back to Tyrosh, where he claimed men didn’t lose their hands for a bit of honest thievery, nor get sent off to freeze their life away for being found in bed with some knight’s wife. Chett had weighed going with him, but he didn’t speak their wet girly tongue. And what could he do in Tyrosh? He had no trade to speak of, growing up in Hag’s Mire. His father had spent his life grubbing in other men’s fields and collecting leeches. He’d strip down bare but for a thick leather clout, and go wading in the murky waters. When he climbed out he’d be covered from nipple to ankle. Sometimes he made Chett help pull the leeches off. One had attached itself to his palm once, and he’d smashed it against a wall in revulsion. His father beat him bloody for that. The maesters bought the leeches at twelve-for-a-penny.  Lark could go home if he liked, and the damn Tyroshi too, but not Chett. If he never saw Hag’s Mire again, it would be too bloody soon. He had liked the look of Craster’s Keep, himself. Craster lived high as a lord there, so why shouldn’t he do the same? That would be a laugh. Chett the leechman’s son, a lord with a keep. His banner could be a dozen leeches on a field of pink. But why stop at lord? Maybe he should be a king. Mance Rayder started out a crow. I could be a king same as him, and have me some wives. Craster had nineteen, not even counting the young ones, the daughters he hadn’t gotten around to bedding yet. Half them wives were as old and ugly as Craster, but that didn’t matter. The old ones Chett could put to work cooking and cleaning for him, pulling carrots and slopping pigs, while the young ones warmed his bed and bore his children. Craster wouldn’t object, not once Small Paul gave him a hug.  The only women Chett had ever known were the whores he’d bought in Mole’s Town. When he’d been younger, the village girls took one look at his face, with its boils and its wen, and turned away sickened. The worst was that slattern Bessa. She’d spread her legs for every boy in Hag’s Mire so he’d figured why not him too? He even spent a morning picking wildflowers when he heard she liked them, but she’d just laughed in his face and told him she’d crawl in a bed with his father’s leeches before she’d crawl in one with him. She stopped laughing when he put his knife in her. That was sweet, the look on her face, so he pulled the knife out and put it in her again. When they caught him down near Sevenstreams, old Lord Walder Frey hadn’t even bothered to come himself to do the judging. He’d sent one of his bastards, that Walder Rivers, and the next thing Chett had known he was walking to the Wall with that foul-smelling black devil Yoren. To pay for his one sweet moment, they took his whole life.  But now he meant to take it back, and Craster’s women too. That twisted old wildling has the right of it. If you want a woman to wife you take her, and none of this giving her flowers so that maybe she don’t notice your bloody boils. Chett didn’t mean to make that mistake again.  It would work, he promised himself for the hundredth time. So long as we get away clean. Ser Ottyn would strike south for the Shadow Tower, the shortest way to the Wall. He won’t bother with us, not Wythers, all he’ll want is to get back whole. Thoren Smallwood now, he’d want to press on with the attack, but Ser Ottyn’s caution ran too deep, and he was senior. It won’t matter anyhow. Once we’re gone, Smallwood can attack anyone he likes. What do we care? If none of them ever returns to the Wall, no one will ever come looking for us, they’ll think we died with the rest. That was a new thought, and for a moment it tempted him. But they would need to kill Ser Ottyn and Ser Mallador Locke as well to give Smallwood the command, and both of them were well-attended day and night… No, the risk was too great.   Chett,  said Small Paul as they trudged along a stony game trail through sentinels and soldier pines,  what about the bird?    What bloody bird?  The last thing he needed now was some muttonhead going on about a bird."
}