{
  "id": "c3cde78dc64be42a21699fc7a4ad20d64dea5b95",
  "text": " But suddenly he felt Ser Garlan’s hand on his sleeve.  My lord, beware,  the knight warned.  The king.   Tyrion turned in his seat. Joffrey was almost upon him, red-faced and staggering, wine slopping over the rim of the great golden wedding chalice he carried in both hands.  Your Grace,  was all he had time to say before the king upended the chalice over his head. The wine washed down over his face in a red torrent. It drenched his hair, stung his eyes, burned in his wound, ran down his cheeks, and soaked the velvet of his new doublet.  How do you like that, Imp?  Joffrey mocked.  Tyrion’s eyes were on fire. He dabbed at his face with the back of a sleeve and tried to blink the world back into clarity.  That was ill done, Your Grace,  he heard Ser Garlan say quietly.   Not at all, Ser Garlan.  Tyrion dare not let this grow any uglier than it was, not here, with half the realm looking on.  Not every king would think to honor a humble subject by serving him from his own royal chalice. A pity the wine spilled.    It didn’t spill,  said Joffrey, too graceless to take the retreat Tyrion offered him.  And I wasn’t serving you, either.   Queen Margaery appeared suddenly at Joffrey’s elbow.  My sweet king,  the Tyrell girl entreated,  come, return to your place, there’s another singer waiting.    Alaric of Eysen,  said Lady Olenna Tyrell, leaning on her cane and taking no more notice of the wine-soaked dwarf than her granddaughter had done.  I do so hope he plays us ‘The Rains of Castamere.’ It has been an hour, I’ve forgotten how it goes.    Ser Addam has a toast he wants to make as well,  said Margaery.  Your Grace, please.    I have no wine,  Joffrey declared.  How can I drink a toast if I have no wine? Uncle Imp, you can serve me. Since you won’t joust you’ll be my cupbearer.    I would be most honored.    It’s not meant to be an honor!  Joffrey screamed.  Bend down and pick up my chalice.  Tyrion did as he was bid, but as he reached for the handle Joff kicked the chalice through his legs.  Pick it up! Are you as clumsy as you are ugly?  He had to crawl under the table to find the thing.  Good, now fill it with wine.  He claimed a flagon from a serving girl and filled the goblet three-quarters full.  No, on your knees, dwarf.  Kneeling, Tyrion raised up the heavy cup, wondering if he was about to get a second bath. But Joffrey took the wedding chalice one-handed, drank deep, and set it on the table.  You can get up now, Uncle.   His legs cramped as he tried to rise, and almost spilled him again. Tyrion had to grab hold of a chair to steady himself. Ser Garlan lent him a hand. Joffrey laughed, and Cersei as well. Then others. He could not see who, but he heard them.   Your Grace.  Lord Tywin’s voice was impeccably correct.  They are bringing in the pie. Your sword is needed.    The pie?  Joffrey took his queen by the hand.  Come, my lady, it’s the pie.   The guests stood, shouting and applauding and smashing their wine cups together as the great pie made its slow way down the length of the hall, wheeled along by a half-dozen beaming cooks. Two yards across it was, crusty and golden brown, and they could hear squeaks and thumpings coming from inside it.  Tyrion pulled himself back into his chair. All he needed now was for a dove to shit on him and his day would be complete. The wine had soaked through his doublet and smallclothes, and he could feel the wetness against his skin. He ought to change, but no one was permitted to leave the feast until the time came for the bedding ceremony. That was still a good twenty or thirty dishes off, he judged.  King Joffrey and his queen met the pie below the dais. As Joff drew his sword, Margaery laid a hand on his arm to restrain him.  Widow’s Wail was not meant for slicing pies.    True.  Joffrey lifted his voice.  Ser Ilyn, your sword!   From the shadows at the back of the hall, Ser Ilyn Payne appeared. The specter at the feast, thought Tyrion as he watched the King’s Justice stride forward, gaunt and grim. He had been too young to have known Ser Ilyn before he’d lost his tongue. He would have been a different man in those days, but now the silence is as much a part of him as those hollow eyes, that rusty chainmail shirt, and the greatsword on his back.  Ser Ilyn bowed before the king and queen, reached back over his shoulder, and drew forth six feet of ornate silver bright with runes. He knelt to offer the huge blade to Joffrey, hilt first; points of red fire winked from ruby eyes on the pommel, a chunk of dragonglass carved in the shape of a grinning skull.  Sansa stirred in her seat.  What sword is that?   Tyrion’s eyes still stung from the wine. He blinked and looked again. Ser Ilyn’s greatsword was as long and wide as Ice, but it was too silvery-bright; Valyrian steel had a darkness to it, a smokiness in its soul. Sansa clutched his arm.  What has Ser Ilyn done with my father’s sword?   I should have sent Ice back to Robb Stark, Tyrion thought. He glanced at his father, but Lord Tywin was watching the king."
}