{
  "id": "c44640e59b815cfaa8bebbd8bb4360a4aafa6bf4",
  "text": "  The  world is changing, you say. Minas  Tirith will fall,  if the Ring lasts. But why?  Certainly, if the  Ring were  with the Enemy. But why, if it were with us? '       'Were you not at the Council?  ' answered Frodo. `Because we cannot use   it, and what is done with it turns to evil.'       Boromir got up and walked about impatiently. 'So you go  on,' he cried.  'Gandalf, Elrond -- all these folk have taught you to say so. For themselves  they may be right. These  elves and half-elves and  wizards, they would come  to grief perhaps.  Yet often I  doubt if they are wise and not merely timid.  But each to his own kind. True-hearted Men, they  will  not be corrupted. We  of Minas Tirith have been  staunch  through long years  of trial. We do  not  desire  the  power  of  wizard-lords,  only  strength  to  defend ourselves,  strength in a just cause. And behold! in our need chance brings to light the  -Ring of Power. It is a gift, I say; a gift to the foes of Mordor. It is mad  not to use it, to  use the power of the Enemy against him. The fearless, the  ruthless, these alone will  achieve victory.  What could not a warrior do in  this  hour, a great leader? What could not Aragorn do? Or if he refuses, why   ####-not Boromir? The Ring would give  me power of Command. How I would  drive the  hosts of Mordor, and all men would flock to my banner!'       Boromir strode up and down, speaking ever more loudly: Almost he seemed  to have forgotten Frodo, while  his talk dwelt on walls and weapons, and the  mustering  of  men;  and he drew  plans  for  great alliances  and  glorious  victories to be; and he cast down Mordor, and became himself  a mighty king,  benevolent and wise. Suddenly he stopped and waved his arms.        'And  they tell  us to throw it away!' he cried. `I do not sa y  destroy  it. That might be  well, if  reason could show any hope of doing so. It does  not. The only  plan that  is proposed  to us  is that a halfling should walk   blindly into  Mordor and offer  the Enemy every chance of recapturing it for   himself. Folly!       'Surely you see it, my friend?' he said, turning  now suddenly to Frodo  again. `You say that you are afraid. If it is so, the boldest should  pardon  you. But is it not really your good sense that revolts?'       'No, I am afraid,' said Frodo.  'Simply  afraid. But I am glad  to have  heard you speak so fully. My mind is clearer now.'       `Then  you  will come to  Minas Tirith? ' cried Boromir.  His eyes were  shining and his face eager.       `You misunderstand me,' said Frodo.       'But you will come, at least for a while? ' Boromir persisted. 'My city  is not far  now;  and it is little further  from  there to  Mordor than from  here.  We have  been long in the  wilderness, and you need  news of what the  Enemy is doing  before you make a move. Come with me, Frodo,' he  said.  `You  need  rest before your venture. if  go you must.' He laid  his  hand on  the  hobbit's  shoulder in friendly fashion;  but Frodo  felt  the hand trembling  with suppressed excitement. He stepped quickly away, and eyed with alarm the  tall Man, nearly twice his height and many times his match in strength.       `Why are you  so unfriendly? '  said Boromir. `I am a true man, neither   thief nor tracker. I  need your Ring: that you know now; but  I give  you my   word  that I do not  desire to keep it.  Will you not at least  let me  make  trial of my plan? Lend me the Ring! '       `No! no! ' cried Frodo. 'The Council laid it upon me to bear it.'       `It is by our own folly that the Enemy will  defeat us,' cried Boromir.  `How it  angers  me!   Fool!  Obstinate fool!  Running wilfully to  death and   ####-ruining our cause.  If any mortals have claim  to the Ring, it is the men of  N®menor, and not Halflings. It is not yours save by unhappy chance. It might  have been mine. It should be mine. Give it to me!  '       Frodo  did not answer, but moved away  till the great  flat stone stood  between them. `Come, come, my friend! ' said Boromir in a softer voice. 'Why  not get rid of it? Why not be free of your  doubt and  fear? You can lay the  blame on me, if you  will.  You  can say that I was too strong and took it by  force. For I am  too strong for you, halfling,' he cried;  and  suddenly  he  sprang  over the stone  and leaped at Frodo. His fair and pleasant face  was  hideously changed; a raging fire was in his eyes.       Frodo dodged aside and again put the stone between them. There was only  one thing he could do: trembling  he pulled  out the Ring upon its chain and  quickly slipped it on his finger, even as Boromir sprang at him  again.  The  Man  gasped, stared for a  moment amazed, and then ran wildly about, seeking  here and there among the rocks and trees.       'Miserable trickster!' he shouted. `Let me  get my  hands on you! Now I  see your mind. You  will take the Ring  to Sauron and  sell us all. You have  only waited  your  chance to  leave  us  in  the  lurch. Curse  you and  all  halflings to death  and darkness! ' Then, catching his foot on  a stone,  he  fell sprawling and  lay upon his face."
}