{
  "id": "c4cf6f6b3559f27bbac67795d763bd345dd50e9c",
  "text": "  They did not speak again until they had reached the end of the tunnel. Crookshanks darted up first; he had evidently pressed his paw to the knot on the trunk, because Lupin, Pettigrew, and Ron clambered upward without any sound of savaging branches.  Black saw Snape up through the hole, then stood back for Harry and Hermione to pass. At last, all of them were out.  The grounds were very dark now; the only light came from the distant windows of the castle. Without a word, they set off. Pettigrew was still wheezing and occasionally whimpering. Harry's mind was buzzing. He was going to leave the Dursleys. He was going to live with Sirius Black, his parents' best friend.... He felt dazed.... What would happen when he told the Dursleys he was going to live with the convict they'd seen on television... !  \"One wrong move, Peter,\" said Lupin threateningly ahead. His wand was still pointed sideways at Pettigrew's chest.  Silently they tramped through the grounds, the castle lights growing slowly larger. Snape was still drifting weirdly ahead of Black, his chin bumping on his chest. And then -  A cloud shifted. There were suddenly dim shadows on the ground. Their party was bathed in moonlight.  Snape collided with Lupin, Pettigrew, and Ron, who had stopped abruptly. Black froze. He flung out one arm to make Harry and Hermione stop.  Harry could see Lupin's silhouette. He had gone rigid. Then his limbs began to shake.  \"Oh, my --\" Hermione gasped. \"He didn't take his potion tonight! He's not safe!\"  \"Run,\" Black whispered. \"Run. Now.\"  But Harry couldn't run. Ron was chained to Pettigrew and Lupin. He leapt forward but Black caught him around the chest and threw him back.  \"Leave it to me -- RUN!\"  There was a terrible snarling noise. Lupin's head was lengthening. So was his body. His shoulders were hunching. Hair was sprouting visibly on his face and hands, which were curling into clawed paws. Crookshanks's hair was on end again; he was backing away --  As the werewolf reared, snapping its long jaws, Sirius disappeared from Harry's side. He had transformed. The enormous, bearlike dog bounded forward. As the werewolf wrenched itself free of the manacle binding it, the dog seized it about the neck and pulled it backward, away from Ron and Pettigrew. They were locked, jaw to jaw, claws ripping at each other.  Harry stood, transfixed by the sight, too intent upon the battle to notice anything else. It was Hermione's scream that alerted him --  Pettigrew had dived for Lupin's dropped wand. Ron, unsteady on his bandaged leg, fell. There was a bang, a burst of light -- and Ron lay motionless on the ground. Another bang -- Crookshanks flew into the air and back to the earth in a heap.  \"Expelliarmus.\" Harry yelled, pointing his own wand at Pettigrew; Lupin's wand flew high into the air and out of sight. \"Stay where you are!\" Harry shouted, running forward.  Too late. Pettigrew had transformed. Harry saw his bald tail whip through the manacle on Ron's outstretched arm and heard a scurrying through the grass.  There was a howl and a rumbling growl; Harry turned to see the werewolf taking flight; it was galloping into the forest --  \"Sirius, he's gone, Pettigrew transformed!\" Harry yelled.  Black was bleeding; there were gashes across his muzzle and back, but at Harry's words he scrambled up again, and in an instant, the sound of his paws faded to silence as he pounded away across the grounds.  Harry and Hermione dashed over to Ron.  \"What did he do to him?\" Hermione whispered. Ron's eyes were only half-closed, his mouth hung open; he was definitely alive, they could hear him breathing, but he didn't seem to recognize them.  \"I don't know....\"  Harry looked desperately around. Black and Lupin both gone... they had no one but Snape for company, still hanging, unconscious, in midair.  \"We'd better get them up to the castle and tell someone,\" said Harry, pushing his hair out of his eyes, trying to think straight. \"Come --\"  But then, from beyond the range of their vision, they heard a yelping, a whining: a dog in pain....  \"Sirius,\" Harry muttered, staring into the darkness.  He had a moment's indecision, but there was nothing they could do for Ron at the moment, and by the sound of it, Black was in trouble --  Harry set off at a run, Hermione right behind him. The yelping seemed to be coming from the ground near the edge of the lake. They pelted toward it, and Harry, running flat out, felt the cold without realizing what it must mean -  The yelping stopped abruptly. As they reached the lakeshore, they saw why -- Sirius had turned back into a man. He was crouched on all fours, his hands over his head.  'Nooo,\" he moaned. 'Nooo... please....\"  And then Harry saw them. Dementors, at least a hundred of them, gliding in a black mass around the lake toward them. He spun around, the familiar, icy cold penetrating his insides, fog starting to obscure his vision; more were appearing out of the darkness on every side; they were encircling them."
}