{
  "id": "c66b0234cc0c28753830fe9a49321045e00e1b1b",
  "text": "  Sandor Clegane had fought his way back to his feet with a reckless counterattack. Not until Lord Beric retreated a pace did the Hound seem to realize that the fire that roared so near his face was his own shield, burning. With a shout of revulsion, he hacked down savagely on the broken oak, completing its destruction. The shield shattered, one piece of it spinning away, still afire, while the other clung stubbornly to his forearm. His efforts to free himself only fanned the flames. His sleeve caught, and now his whole left arm was ablaze.  Finish him!  Greenbeard urged Lord Beric, and other voices took up the chant of  Guilty!  Arya shouted with the rest.  Guilty, guilty, kill him, guilty!   Smooth as summer silk, Lord Beric slid close to make an end of the man before him. The Hound gave a rasping scream, raised his sword in both hands and brought it crashing down with all his strength. Lord Beric blocked the cut easily…   Noooooo,  Arya shrieked.  …but the burning sword snapped in two, and the Hound’s cold steel plowed into Lord Beric’s flesh where his shoulder joined his neck and clove him clean down to the breastbone. The blood came rushing out in a hot black gush.  Sandor Clegane jerked backward, still burning. He ripped the remnants of his shield off and flung them away with a curse, then rolled in the dirt to smother the fire running along his arm.  Lord Beric’s knees folded slowly, as if for prayer. When his mouth opened only blood came out. The Hound’s sword was still in him as he toppled face forward. The dirt drank his blood. Beneath the hollow hill there was no sound but the soft crackling of flames and the whimper the Hound made when he tried to rise. Arya could only think of Mycah and all the stupid prayers she’d prayed for the Hound to die. If there were gods, why didn’t Lord Beric win? She knew the Hound was guilty.   Please,  Sandor Clegane rasped, cradling his arm.  I’m burned. Help me. Someone. Help me.  He was crying.  Please.   Arya looked at him in astonishment. He’s crying like a little baby, she thought.   Melly, see to his burns,  said Thoros.  Lem, Jack, help me with Lord Beric. Ned, you’d best come too.  The red priest wrenched the Hound’s sword from the body of his fallen lord and thrust the point of it down in the blood-soaked earth. Lem slid his big hands under Dondarrion’s arms, while Jack-Be-Lucky took his feet. They carried him around the firepit, into the darkness of one of the tunnels. Thoros and the boy Ned followed after.  The Mad Huntsman spat.  I say we take him back to Stoney Sept and put him in a crow cage.    Yes,  Arya said.  He murdered Mycah. He did.    Such an angry squirrel,  murmured Greenbeard.  Harwin sighed.  R’hllor has judged him innocent.    Who’s Rulore?  She couldn’t even say it.   The Lord of Light. Thoros has taught us—   She didn’t care what Thoros had taught them. She yanked Greenbeard’s dagger from its sheath and spun away before he could catch her. Gendry made a grab for her as well, but she had always been too fast for Gendry.  Tom Sevenstrings and some woman were helping the Hound to his feet. The sight of his arm shocked her speechless. There was a strip of pink where the leather strap had clung, but above and below the flesh was cracked and red and bleeding from elbow to wrist. When his eyes met hers, his mouth twitched.  You want me dead that bad? Then do it, wolf girl. Shove it in. It’s cleaner than fire.  Clegane tried to stand, but as he moved a piece of burned flesh sloughed right off his arm, and his knees went out from under him. Tom caught him by his good arm and held him up.  His arm, Arya thought, and his face. But he was the Hound. He deserved to burn in a fiery hell. The knife felt heavy in her hand. She gripped it tighter.  You killed Mycah,  she said once more, daring him to deny it.  Tell them. You did. You did.    I did.  His whole face twisted.  I rode him down and cut him in half, and laughed. I watched them beat your sister bloody too, watched them cut your father’s head off.   Lem grabbed her wrist and twisted, wrenching the dagger away. She kicked at him, but he would not give it back.  You go to hell, Hound,  she screamed at Sandor Clegane in helpless empty-handed rage.  You just go to hell!    He has,  said a voice scarce stronger than a whisper.  When Arya turned, Lord Beric Dondarrion was standing behind her, his bloody hand clutching Thoros by the shoulder.      Catelyn   Let the kings of winter have their cold crypt under the earth, Catelyn thought. The Tullys drew their strength from the river, and it was to the river they returned when their lives had run their course.  They laid Lord Hoster in a slender wooden boat, clad in shining silver armor, plate-and-mail. His cloak was spread beneath him, rippling blue and red. His surcoat was divided blue-and-red as well. A trout, scaled in silver and bronze, crowned the crest of the greathelm they placed beside his head. On his chest they placed a painted wooden sword, his fingers curled about its hilt."
}