{
  "id": "c99a01c8b059ce866a5a3a5b0f37410662202280",
  "text": "  There was smoke rising from the chimney of the armory, though; only a wisp, almost invisible against the grey northern sky, but it was enough. Jon dismounted and limped toward it. Warmth poured out the open door like the hot breath of summer. Within, one-armed Donal Noye was working his bellows at the fire. He looked up at the noise.  Jon Snow?    None else.  Despite fever, exhaustion, his leg, the Magnar, the old man, Ygritte, Mance, despite it all, Jon smiled. It was good to be back, good to see Noye with his big belly and pinned-up sleeve, his jaw bristling with black stubble.  The smith released his grip on the bellows.  Your face…  He had almost forgotten about his face.  A skinchanger tried to rip out my eye.   Noye frowned.  Scarred or smooth, it’s a face I thought I’d seen the last of. We heard you’d gone over to Mance Rayder.   Jon grasped the door to stay upright.  Who told you that?    Jarman Buckwell. He returned a fortnight past. His scouts claim they saw you with their own eyes, riding along beside the wildling column and wearing a sheepskin cloak.  Noye eyed him.  I see the last part’s true.    It’s all true,  Jon confessed.  As far as it goes.    Should I be pulling down a sword to gut you, then?    No. I was acting on orders. Qhorin Halfhand’s last command. Noye, where is the garrison?    Defending the Wall against your wildling friends.    Yes, but where?    Everywhere. Harma Dogshead was seen at Woodswatch-by-the-Pool, Rattleshirt at Long Barrow, the Weeper near Icemark. All along the Wall… they’re here, they’re there, they’re climbing near Queensgate, they’re hacking at the gates of Greyguard, they’re massing against Eastwatch… but one glimpse of a black cloak and they’re gone. Next day they’re somewhere else.   Jon swallowed a groan.  Feints. Mance wants us to spread ourselves thin, don’t you see?  And Bowen Marsh has obliged him.  The gate is here. The attack is here.   Noye crossed the room.  Your leg is drenched in blood.   Jon looked down dully. It was true. His wound had opened again.  An arrow wound…    A wildling arrow.  It was not a question. Noye had only one arm, but that was thick with muscle. He slid it under Jon’s to help support him.  You’re white as milk, and burning hot besides. I’m taking you to Aemon.    There’s no time. There are wildlings south of the Wall, coming up from Queenscrown to open the gate.    How many?  Noye half-carried Jon out the door.   A hundred and twenty, and well armed for wildlings. Bronze armor, some bits of steel. How many men are left here?    Forty odd,  said Donal Noye.  The crippled and infirm, and some green boys still in training.    If Marsh is gone, who did he name as castellan?   The armorer laughed.  Ser Wynton, gods preserve him. Last knight in the castle and all. The thing is, Stout seems to have forgotten and no one’s been rushing to remind him. I suppose I’m as much a commander as we have now. The meanest of the cripples.   That was for the good, at least. The one-armed armorer was hard headed, tough, and well seasoned in war. Ser Wynton Stout, on the other hand… well, he had been a good man once, everyone agreed, but he had been eighty years a ranger, and both strength and wits were gone. Once he’d fallen asleep at supper and almost drowned in a bowl of pea soup.   Where’s your wolf?  Noye asked as they crossed the yard.   Ghost. I had to leave him when I climbed the Wall. I’d hoped he’d make his way back here.    I’m sorry, lad. There’s been no sign of him.  They limped up to the maester’s door, in the long wooden keep beneath the rookery. The armorer gave it a kick.  Clydas!   After a moment a stooped, round-shouldered little man in black peered out. His small pink eyes widened at the sight of Jon.  Lay the lad down, I’ll fetch the maester.   A fire was burning in the hearth, and the room was almost stuffy. The warmth made Jon sleepy. As soon as Noye eased him down onto his back, he closed his eyes to stop the world from spinning. He could hear the ravens quorking and complaining in the rookery above.  Snow,  one bird was saying.  Snow, snow, snow.  That was Sam’s doing, Jon remembered. Had Samwell Tarly made it home safely, he wondered, or only the birds?  Maester Aemon was not long in coming. He moved slowly, one spotted hand on Clydas’s arm as he shuffled forward with small careful steps. Around his thin neck his chain hung heavy, gold and silver links glinting amongst iron, lead, tin, and other base metals.  Jon Snow,  he said,  you must tell me all you’ve seen and done when you are stronger. Donal, put a kettle of wine on the fire, and my irons as well. I will want them red-hot. Clydas, I shall need that good sharp knife of yours.  The maester was more than a hundred years old; shrunken, frail, hairless, and quite blind. But if his milky eyes saw nothing, his wits were still as sharp as they had ever been.   There are wildlings coming,  Jon told him, as Clydas ran a blade up the leg of his breeches, slicing the heavy black cloth, crusty with old blood and sodden with new."
}