{
  "id": "ca11c34cd2b3f69f24aa334fbf5343e613ca0e42",
  "text": " Finally, as dusk was settling over the north, Jon rolled the empty barrels back into the cage and signaled the winch men to lower him.  The evening meal was almost done by the time he and Ghost reached the common hall. A group of the black brothers were dicing over mulled wine near the fire. His friends were at the bench nearest the west wall, laughing. Pyp was in the middle of a story. The mummer’s boy with the big ears was a born liar with a hundred different voices, and he did not tell his tales so much as live them, playing all the parts as needed, a king one moment and a swineherd the next. When he turned into an alehouse girl or a virgin princess, he used a high falsetto voice that reduced them all to tears of helpless laughter, and his eunuchs were always eerily accurate caricatures of Ser Alliser. Jon took as much pleasure from Pyp’s antics as anyone… yet that night he turned away and went instead to the end of the bench, where Samwell Tarly sat alone, as far from the others as he could get.  He was finishing the last of the pork pie the cooks had served up for supper when Jon sat down across from him. The fat boy’s eyes widened at the sight of Ghost.  Is that a wolf?    A direwolf,  Jon said.  His name is Ghost. The direwolf is the sigil of my father’s House.    Ours is a striding huntsman,  Samwell Tarly said.   Do you like to hunt?   The fat boy shuddered.  I hate it.  He looked as though he was going to cry again.   What’s wrong now?  Jon asked him.  Why are you always so frightened?   Sam stared at the last of his pork pie and gave a feeble shake of his head, too scared even to talk. A burst of laughter filled the hall. Jon heard Pyp squeaking in a high voice. He stood.  Let’s go outside.   The round fat face looked up at him, suspicious.  Why? What will we do outside?    Talk,  Jon said.  Have you seen the Wall?    I’m fat, not blind,  Samwell Tarly said.  Of course I saw it, it’s seven hundred feet high.  Yet he stood up all the same, wrapped a fur-lined cloak over his shoulders, and followed Jon from the common hall, still wary, as if he suspected some cruel trick was waiting for him in the night. Ghost padded along beside them.  I never thought it would be like this,  Sam said as they walked, his words steaming in the cold air. Already he was huffing and puffing as he tried to keep up.  All the buildings are falling down, and it’s so… so…    Cold?  A hard frost was settling over the castle, and Jon could hear the soft crunch of grey weeds beneath his boots.  Sam nodded miserably.  I hate the cold,  he said.  Last night I woke up in the dark and the fire had gone out and I was certain I was going to freeze to death by morning.    It must have been warmer where you come from.    I never saw snow until last month. We were crossing the barrowlands, me and the men my father sent to see me north, and this white stuff began to fall, like a soft rain. At first I thought it was so beautiful, like feathers drifting from the sky, but it kept on and on, until I was frozen to the bone. The men had crusts of snow in their beards and more on their shoulders, and still it kept coming. I was afraid it would never end.   Jon smiled.  The Wall loomed before them, glimmering palely in the light of the half moon. In the sky above, the stars burned clear and sharp.  Are they going to make me go up there?  Sam asked. His face curdled like old milk as he looked at the great wooden stairs.  I’ll die if I have to climb that.    There’s a winch,  Jon said, pointing.  They can draw you up in a cage.   Samwell Tarly sniffled.  I don’t like high places.   It was too much. Jon frowned, incredulous.  Are you afraid of everything?  he asked.  I don’t understand. If you are truly so craven, why are you here? Why would a coward want to join the Night’s Watch?   Samwell Tarly looked at him for a long moment, and his round face seemed to cave in on itself. He sat down on the frost-covered ground and began to cry, huge choking sobs that made his whole body shake. Jon Snow could only stand and watch. Like the snowfall on the barrowlands, it seemed the tears would never end.  It was Ghost who knew what to do. Silent as shadow, the pale direwolf moved closer and began to lick the warm tears off Samwell Tarly’s face. The fat boy cried out, startled… and somehow, in a heartbeat, his sobs turned to laughter.  Jon Snow laughed with him. Afterward they sat on the frozen ground, huddled in their cloaks with Ghost between them. Jon told the story of how he and Robb had found the pups newborn in the late summer snows. It seemed a thousand years ago now. Before long he found himself talking of Winterfell.   Sometimes I dream about it,  he said.  I’m walking down this long empty hall. My voice echoes all around, but no one answers, so I walk faster, opening doors, shouting names. I don’t even know who I’m looking for. Most nights it’s my father, but sometimes it’s Robb instead, or my little sister Arya, or my uncle.  The thought of Benjen Stark saddened him; his uncle was still missing."
}