{
  "id": "ca81bb681d5f1146122eb0e245ad984023bc8509",
  "text": "  Cedric took a deep breath. \"You take it. You should win. That's twice you've saved my neck in here.\" \"That's not how it's supposed to work,\" Harry said.  He felt angry; his leg was very painful, he was aching all over from trying to throw off the spider, and after all his efforts, Cedric had beaten him to it, just as he'd beaten Harry to ask Cho to the ball.  \"The one who reaches the cup first gets the points.  That's you. I'm telling you, I'm not going to win any races on this leg.\" Cedric took a few paces nearer to the Stunned spider, away from the cup, shaking his head. \"No,\" he said. \"Stop being noble,\" said Harry irritably.  \"Just take it, then we can get out of here.\" Cedric watched Harry steadying himself, holding tight to the hedge. \"You told me about the dragons,\" Cedric said.  \"I would've gone down in the first task if you hadn't told me what was coming.\" \"I had help on that too,\" Harry snapped, trying to mop up his bloody leg with his robes. \"You helped me with the egg - we're square.\" \"I had help on the egg in the first place,\" said Cedric. \"We're still square,\" said Harry, testing his leg gingerly; it shook violently as he put weight on it; he had sprained his ankle when the spider had dropped him. \"You should've got more points on the second task,\" said Cedric mulishly.  \"You stayed behind to get all the hostages.  I should've done that.\" \"I was the only one who was thick enough to take that song seriously!\"  said Harry bitterly.  \"Just take the cup!\" \"No,\" said Cedric. He stepped over the spider's tangled legs to join Harry, who stared at him.  Cedric was serious.  He was walking away from the sort of glory Hufflepuff House hadn't had in centuries. \"Go on,\" Cedric said.  He looked as though this was costing him every ounce of resolution he had, but his face was set, his arms were folded, he seemed decided. Harry looked from Cedric to the cup.  For one shining moment, he saw himself emerging from the maze, holding it.  He saw himself holding the Triwizard Cup aloft, heard the roar of the crowd, saw Cho's face shining with admiration, more clearly than he had ever seen it before . . . and then the picture faded, and he found himself staring at Cedric's shadowy, stubborn face. \"Both of us,\" Harry said. \"What?\" \"We'll take it at the same time.  It's still a Hogwarts victory.  We'll tie for it.\" Cedric stared at Harry.  He unfolded his arms. \"You - you sure?\" \"Yeah,\" said Harry.  \"Yeah . . . we've helped each other out, haven't we?  We both got here.  Let's just take it together.\" For a moment, Cedric looked as though he couldn't believe his ears; then his face split in a grin. \"You're on,\" he said. \"Come here.\" He grabbed Harrys arm below the shoulder and helped Harry limp toward the plinth where the cup stood.  When they had reached it, they both held a hand out over one of the cup's gleaming handles. \"On three, right?\" said Harry. \"One - two - three -\" He and Cedric both grasped a handle. Instantly, Harry felt a jerk somewhere behind his navel.  His feet had left the ground.  He could not unclench the hand holding the Triwizard Cup; it was pulling him onward in a howl of wind and swirling color, Cedric at his side.  CHAPTER THIRTY-TWO - FLESH, BLOOD, AND BONE  Harry felt his feet slam into the ground; his injured leg gave way, and he fell forward; his hand let go of the Triwizard Cup at last.  He raised his head. \"Where are we?\" he said. Cedric shook his head.  He got up, pulled Harry to his feet, and they looked around. They had left the Hogwarts grounds completely; they had obviously traveled miles - perhaps hundreds of miles - for even the mountains surrounding the castle were gone.  They were standing instead in a dark and overgrown graveyard; the black outline of a small church was visible beyond a large yew tree to their right.  A hill rose above them to their left. Harry could just make out the outline of a fine old house on the hillside. Cedric looked down at the Triwizard Cup and then up at Harry. \"Did anyone tell you the cup was a Portkey?\" he asked. \"Nope,\" said Harry. He was looking around the graveyard.  It was completely silent and slightly eerie.  \"Is this supposed to be part of the task?\" \"I dunno,\" said Cedric.  He sounded slightly nervous.  \"Wands out, d'you reckon?\" \"Yeah,\" said Harry, glad that Cedric had made the suggestion rather than him. They pulled out their wands.  Harry kept looking around him.  He had, yet again, the strange feeling that they were being watched. \"Someone's coming,\" he said suddenly. Squinting tensely through the darkness, they watched the figure drawing nearer, walking steadily toward them between the graves.  Harry couldn't make out a face, but from the way it was walking and holding its arms, he could tell that it was carrying something.  Whoever it was, he was short, and wearing a hooded cloak pulled up over his head to obscure his face.  And - several paces nearer, the gap between them closing all the time - Harry saw that the thing in the persons arms looked like a baby ."
}