{
  "id": "cbd110d015b008674e6e39d8f3d11380ac5c7aca",
  "text": "    As it happens, you’re wrong there.  The singer turned to the hooded woman.  Milady?   The outlaws parted as she came forward, saying no word. When she lowered her hood, something tightened inside Merrett’s chest, and for a moment he could not breathe. No. No, I saw her die. She was dead for a day and night before they stripped her naked and threw her body in the river. Raymund opened her throat from ear to ear. She was dead.  Her cloak and collar hid the gash his brother’s blade had made, but her face was even worse than he remembered. The flesh had gone pudding soft in the water and turned the color of curdled milk. Half her hair was gone and the rest had turned as white and brittle as a crone’s. Beneath her ravaged scalp, her face was shredded skin and black blood where she had raked herself with her nails. But her eyes were the most terrible thing. Her eyes saw him, and they hated.   She don’t speak,  said the big man in the yellow cloak.  You bloody bastards cut her throat too deep for that. But she remembers.  He turned to the dead woman and said,  What do you say, m’lady? Was he part of it?   Lady Catelyn’s eyes never left him. She nodded.  Merrett Frey opened his mouth to plead, but the noose choked off his words. His feet left the ground, the rope cutting deep into the soft flesh beneath his chin. Up into the air he jerked, kicking and twisting, up and up and up.      Appendix  The Kings And Their Courts      THE KING ON THE IRON THRONE   JOFFREY BARATHEON, the First of His Name, a boy of thirteen years, the eldest son of King Robert I Baratheon and Queen Cersei of House Lannister, — his mother, QUEEN CERSEI, of House Lannister, Queen Regent and Protector of the Realm, — Cersei’s sworn swords: — SER OSFRYD KETTLEBLACK, younger brother to Ser Osmund Kettleblack of the Kingsguard,  — SER OSNEY KETTLEBLACK, youngest brother of Ser Osmund and Ser Osfryd,    — his sister, PRINCESS MYRCELLA, a girl of nine, a ward of Prince Doran Martell at Sunspear,  — his brother, PRINCE TOMMEN, a boy of eight, next heir to the Iron Throne,  — his grandfather, TYWIN LANNISTER, Lord of Casterly Rock, Warden of the West, and Hand of the King,  — his uncles and cousins, paternal, — his father’s brother, STANNIS BARATHEON, rebel Lord of Dragonstone, styling himself King Stannis the First, — Stannis’s daughter, SHIREEN, a girl of eleven,  — his father’s brother, (RENLY BARATHEON), rebel Lord of Storm’s End, murdered in the midst of his army,  — his grandmother’s brother, SER ELDON ESTERMONT, — Ser Eldon’s son, SER AEMON ESTERMONT, — Ser Aemon’s son, SER ALYN ESTERMONT,      — his uncles and cousins, maternal, —his mother’s brother, SER JAIME LANNISTER, called THE KINGSLAYER, a captive at Riverrun,  —his mother’s brother, TYRION LANNISTER, called THE IMP, a dwarf, wounded in the Battle of the Blackwater, — Tyrion’s squire, PODRICK PAYNE,  — Tyrion’s captain of guards, SER BRONN OF THE BLACKWATER, a former sellsword,  — Tyrion’s concubine, SHAE, a camp follower now serving as bedmaid to Lollys Stokeworth,  — his grandfather’s brother, SER KEVAN LANNISTER, — Ser Kevan’s son, SER LANCEL LANNISTER, formerly squire to King Robert, wounded in the Battle of the Blackwater, near death,  —his grandfather’s brother, {TYGETT LANNISTER), died of a pox, — Tygett’s son, TYREK LANNISTER, a squire, missing since the great riot, — Tyrek’s infant wife, LADY ERMESANDE HAYFORD,      —his baseborn siblings, King Robert’s bastards: —MYA STONE, a maid of nineteen, in the service of Lord Nestor Royce, of the Gates of the Moon,  —GENDRY, an apprentice smith, a fugitive in the riverlands; and ignorant of his heritage,  —EDRIC STORM, King Robert’s only acknowledged bastard son, a ward of his uncle Stannis on Dragonstone,      —his Kingsguard: —SER JAIME LANNISTER, Lord Commander,  —SER MERYN TRANT,  —SER BALON SWANN,  —SER OSMUND KETTLEBLACK,  —SER LORAS TYRELL, the Knight of Flowers,  —SER ARYS OAKHEART,    —his small council:  —LORD TYWIN LANNISTER, Hand of the King,  —SER KEVAN LANNISTER, master of laws,  —LORD PETYR BAELISH, called LITTLEFINGER, master of coin,  —VARYS, a eunuch, called THE SPIDER, master of whisperers,  —LORD MACE TYRELL, master of ships,  —GRAND MAESTER PYCELLE,      —his court and retainers: —SER ILYN PAYNE, the King’s Justice, a headsman,  —LORD HALLYNE THE PYROMANCER, a Wisdom of the Guild of Alchemists,  —MOON BOY, a jester and fool,  —ORMOND OF OLDTOWN, the royal harper and bard,  —DONTOS HOLLARD, a fool and a drunkard, formerly a knight called SER DONTOS THE RED,  —JALABHAR XHO, Prince of the Red Flower Vale, an exile from the Summer Isles,  —LADY TANDA STOKEWORTH, — her daughter, FALYSE, wed to Ser Balman Byrch,  — her daughter, LOLLYS, thirty-four, unwed, and soft of wits, with child after being raped,  — her healer and counselor, MAESTER FRENKEN,  —LORD GYLES ROSBY, a sickly old man,  —SER TALLAD, a promising young knight,  —LORD MORROS SLYNT, a squire, eldest son of the former Commander of the City Watch, — JOTHOS SLYNT, his younger brother, a squire,  — DANOS SLYNT, younger still, a page,  —SER BOROS BLOUNT, a former knight of the Kingsguard, dismissed for cowardice by Queen Cersei,  —OSMYN PECKLEDON, a squire, and a hero of the Battle of the Blackwater,  —SER PHILIP FOOTE, made Lord of the Marches for his valor during the Battle of the Blackwater,  —SER LOTHOR BRUNE, named LOTHOR APPLE-EATER for his deeds during the Battle of the Blackwater, a former freerider in service to Lord Baelish,  —other lords and knights at King’s Landing: —MATHIS ROWAN, Lord of Goldengrove,  —PAXTER REDWYNE, Lord of the Arbor, — Lord Paxter’s twin sons, SER HORAS and SER HOBBER, mocked as HORROR and SLOBBER,  — Lord Redwyne’s healer, MAESTER BALLABAR,  —ARDRIAN CELTIGAR, the Lord of Claw Isle,  —LORD ALESANDER STAEDMON, called PENNYLOVER,  —SER BONIFER HASTY, called THE GOOD, a famed knight,  —SER DONNEL SWANN, heir to Stonehelm,  —SER RONNET CONNINGTON, called RED RONNET, the Knight of Griffin’s Roost,  —AURANE WATERS, the Bastard of Driftmark,  —SER DERMOT OF THE RAINWOOD, a famed knight,  —SER TIMON SCRAPESWORD, a famed knight,      —the people of King’s Landing: — the City Watch (the  gold cloaks ), —{SER JACELYN BYWATER, called IRONHAND}, Commander of the City Watch, slain by his own men during the Battle of the Blackwater,  — SER ADDAM MARBRAND, Commander of the City Watch, Ser Jacelyn’s successor,    — CHATAYA, owner of an expensive brothel, — ALAYAYA, her daughter,  — DANCY, MAREI, JAYDE, Chataya’s girls,  — TOBHO MOTT, a master armorer,  — IRONBELLY, a blacksmith,  — HAMISH THE HARPER, a famed singer,  — COLLIO QUAYNIS, a Tyroshi singer,  — BETHANY FAIR-FINGERS, a woman singer,  — ALARIC OF EYSEN, a singer, far-traveled,  — GALYEON OF CUY, a singer notorious for the length of his songs,  — SYMON SILVER TONGUE, a singer."
}