{
  "id": "cd3125bb86ada1212714736da73662be277ae390",
  "text": " . . . \"Then . . . four years ago . . . the means for my return seemed assured.  A wizard - young, foolish, and gullible - wandered across my path in the forest I had made my home.  Oh, he seemed the very chance I had been dreaming of... for he was a teacher at Dumbledore's school... he was easy to bend to my will... he brought me back to this country, and after a while, I took possession of his body, to supervise him closely as he carried out my orders.  But my plan failed.  I did not manage to steal the Sorcerer's Stone.  I was not to be assured immortal life.  I was thwarted . . . thwarted, once again, by Harry Potter. ...\" Silence once more; nothing was stirring, not even the leaves on the yew tree.  The Death Eaters were quite motionless, the glittering eyes in their masks fixed upon Voldemort, and upon Harry. \"The servant died when I left his body, and I was left as weak as ever I had been,\" Voldemort continued.  \"I returned to my hiding place far away, and I will not pretend to you that I didn't then fear that I might never regain my powers. . . . Yes, that was perhaps my darkest hour... I could not hope that I would be sent another wizard to possess . . . and I had given up hope, now, that any of my Death Eaters cared what had become of me. ...\" One or two of the masked wizards in the circle moved uncomfortably, but Voldemort took no notice. \"And then, not even a year ago, when I had almost abandoned hope, it happened at last... a servant returned to me.  Wormtail here, who had faked his own death to escape justice, was driven out of hiding by those he had once counted friends, and decided to return to his master.  He sought me in the country where it had long been rumored I was hiding . . . helped, of course, by the rats he met along the way.  Wormtail has a curious affinity with rats, do you not, Wormtail?  His filthy little friends told him there was a place, deep in an Albanian forest, that they avoided, where small animals like themselves had met their deaths by a dark shadow that possessed them. . . . \"But his journey back to me was not smooth, was it, Wormtail?  For, hungry one night, on the edge of the very forest where he had hoped to find me, he foolishly stopped at an inn for some food . . . and who should he meet there, but one Bertha Jorkins, a witch from the Ministry of Magic. \"Now see the way that fate favors Lord Voldemort.  This might have been the end of Wormtail, and of my last hope for regeneration.  But Wormtail - displaying a presence of mind I would never have expected from him - convinced Bertha Jorkins to accompany him on a nighttime stroll.  He overpowered her ... he brought her to me.  And Bertha Jorkins, who might have ruined all, proved instead to be a gift beyond my wildest dreams ... for - with a little persuasion - she became a veritable mine of information. \"She told me that the Triwizard Tournament would be played at Hogwarts this year. She told me that she knew of a faithful Death Eater who would be only too willing to help me, if I could only contact him.  She told me many things. . . but the means I used to break the Memory Charm upon her were powerful, and when I had extracted all useful information from her, her mind and body were both damaged beyond repair.  She had now served her purpose.  I could not possess her.  I disposed of her.\" Voldemort smiled his terrible smile, his red eyes blank and pitiless. \"Wormtail's body, of course, was ill adapted for possession, as all assumed him dead, and would attract far too much attention if noticed.  However, he was the able-bodied servant I needed, and, poor wizard though he is, Wormtail was able to follow the instructions I gave him, which would return me to a rudimentary, weak body of my own, a body I would be able to inhabit while awaiting the essential ingredients for true rebirth ... a spell or two of my own invention ... a little help from my dear Nagini,\"  Voldemorts red eyes fell upon the continually circling snake, \"a potion concocted from unicorn blood, and the snake venom Nagini provided ... I was soon returned to an almost human form, and strong enough to travel. \"There was no hope of stealing the Sorcerer's Stone anymore, for I knew that Dumbledore would have seen to it that it was destroyed.  But I was willing to embrace mortal life again, before chasing immortality.  I set my sights lower ... I would settle for my old body back again, and my old strength. \"I knew that to achieve this - it is an old piece of Dark Magic, the potion that revived me tonight - I would need three powerful ingredients.  Well, one of them was already at hand, was it not, Wormtail?  Flesh given by a servant. . . . \"My father's bone, naturally, meant that we would have to come here, where he was buried. But the blood of a foe ... Wormtail would have had me use any wizard, would you not, Wormtail?  Any wizard who had hated me ... as so many of them still do.  But I knew the one I must use, if I was to rise again, more powerful than I had been when I had fallen."
}