{
  "id": "cd3dc8e56e6378695218bb1650f82d5ad6fef260",
  "text": "  Lord Steward Bowen Marsh rubbed his plump hands together.  Samwell, you will assist Maester Aemon in the rookery and library. Chett is going to the kennels, to help with the hounds. You shall have his cell, so as to be close to the maester night and day. I trust you will take good care of him. He is very old and very precious to us.   Dareon, I am told that you sang at many a high lord’s table and shared their meat and mead. We are sending you to Eastwatch. It may be your palate will be some help to Cotter Pyke when merchant galleys come trading. We are paying too dear for salt beef and pickled fish, and the quality of the olive oil we’re getting has been frightful, Present yourself to Borcas when you arrive, he will keep you busy between ships.   Marsh turned his smile on Jon.  Lord Commander Mormont has requested you for his personal steward, Jon. You’ll sleep in a cell beneath his chambers, in the Lord Commander’s tower.    And what will my duties be?  Jon asked sharply.  Will I serve the Lord Commander’s meals, help him fasten his clothes, fetch hot water for his bath?    Certainly.  Marsh frowned at Jon’s tone.  And you will run his messages, keep a fire burning in his chambers, change his sheets and blankets daily, and do all else that the Lord Commander might require of you.    Do you take me for a servant?    No,  Maester Aemon said, from the back of the sept. Clydas helped him stand.  We took you for a man of the Night’s Watch… but perhaps we were wrong in that.   It was all Jon could do to stop himself from walking out. Was he supposed to churn butter and sew doublets like a girl for the rest of his days?  May I go?  he asked stiffly.   As you wish,  Bowen Marsh responded.  Dareon and Sam left with him. They descended to the yard in silence. Outside, Jon looked up at the Wall shining in the sun, the melting ice creeping down its side in a hundred thin fingers. Jon’s rage was such that he would have smashed it all in an instant, and the world be damned.   Jon,  Samwell Tarly said excitedly.  Wait. Don’t you see what they’re doing?   Jon turned on him in a fury.  I see Ser Alliser’s bloody hand, that’s all I see. He wanted to shame me, and he has.   Dareon gave him a look.  The stewards are fine for the likes of you and me, Sam, but not for Lord Snow.    I’m a better swordsman and a better rider than any of you,  Jon blazed back.  It’s not fair!    Fair?  Dareon sneered.  The girl was waiting for me, naked as the day she was born. She pulled me through the window, and you talk to me of fair?  He walked off.   There is no shame in being a steward,  Sam said.   Do you think I want to spend the rest of my life washing an old man’s smallclothes?    The old man is Lord Commander of the Night’s Watch,  Sam reminded him.  You’ll be with him day and night. Yes, you’ll pour his wine and see that his bed linen is fresh, but you’ll also take his letters, attend him at meetings, squire for him in battle. You’ll be as close to him as his shadow. You’ll know everything, be a part of everything… and the Lord Steward said Mormont asked for you himself!   When I was little, my father used to insist that I attend him in the audience chamber whenever he held court. When he rode to Highgarden to bend his knee to Lord Tyrell, he made me come. Later, though, he started to take Dickon and leave me at home, and he no longer cared whether I sat through his audiences, so long as Dickon was there. He wanted his heir at his side, don’t you see? To watch and listen and learn from all he did. I’ll wager that’s why Lord Mormont requested you, Jon. What else could it be? He wants to groom you for command!   Jon was taken aback. It was true, Lord Eddard had often made Robb part of his councils back at Winterfell. Could Sam be right? Even a bastard could rise high in the Night’s Watch, they said.  I never asked for this,  he said stubbornly.   None of us are here for asking,  Sam reminded him.  And suddenly Jon Snow was ashamed.  Craven or not, Samwell Tarly had found the courage to accept his fate like a man. On the Wall, a man gets only what he earns, Benjen Stark had said the last night Jon had seen him alive. You’re no ranger, Jon, only a green boy with the smell of summer still on you. He’d heard it said that bastards grow up faster than other children; on the Wall, you grew up or you died.  Jon let out a deep sigh.  You have the right of it. I was acting the boy.    Then you’ll stay and say your words with me?    The old gods will be expecting us.  He made himself smile.  They set out late that afternoon. The Wall had no gates as such, neither here at Castle Black nor anywhere along its three hundred miles. They led their horses down a narrow tunnel cut through the ice, cold dark walls pressing in around them as the passage twisted and turned. Three times their way was blocked by iron bars, and they had to stop while Bowen Marsh drew out his keys and unlocked the massive chains that secured them. Jon could sense the vast weight pressing down on him as he waited behind the Lord Steward."
}