{
  "id": "cd78690ab761d81844da60e0bdacf28552c63787",
  "text": " It was sealed with a small blob of blue wax. Luwin bowed and began to retreat.   Stay,  Ned commanded him. His voice was grave. He looked at Catelyn.  What is it? My lady, you’re shaking.    I’m afraid,  she admitted. She reached out and took the letter in trembling hands. The furs dropped away from her nakedness, forgotten. In the blue wax was the moon-and-falcon seal of House Arryn.  It’s from Lysa.  Catelyn looked at her husband.  It will not make us glad,  she told him.  There is grief in this message, Ned. I can feel it.   Ned frowned, his face darkening.  Open it.   Catelyn broke the seal.  Her eyes moved over the words. At first they made no sense to her. Then she remembered.  Lysa took no chances. When we were girls together, we had a private language, she and I.    Can you read it?    Yes,  Catelyn admitted.   Then tell us.    Perhaps I should withdraw,  Maester Luwin said.   No,  Catelyn said.  We will need your counsel.  She threw back the furs and climbed from the bed. The night air was as cold as the grave on her bare skin as she padded across the room.  Maester Luwin averted his eyes. Even Ned looked shocked.  What are you doing?  he asked.   Lighting a fire,  Catelyn told him. She found a dressing gown and shrugged into it, then knelt over the cold hearth.   Maester Luwin—  Ned began.   Maester Luwin has delivered all my children,  Catelyn said.  This is no time for false modesty.  She slid the paper in among the kindling and placed the heavier logs on top of it.  Ned crossed the room, took her by the arm, and pulled her to her feet. He held her there, his face inches from her.  My lady, tell me! What was this message?   Catelyn stiffened in his grasp.  A warning,  she said softly.  If we have the wits to hear.   His eyes searched her face.  Go on.    Lysa says Jon Arryn was murdered.   His fingers tightened on her arm.  By whom?    The Lannisters,  she told him.  The queen.   Ned released his hold on her arm. There were deep red marks on her skin.  Gods,  he whispered. His voice was hoarse.  Your sister is sick with grief. She cannot know what she is saying.    She knows,  Catelyn said.  Lysa is impulsive, yes, but this message was carefully planned, cleverly hidden. She knew it meant death if her letter fell into the wrong hands. To risk so much, she must have had more than mere suspicion.  Catelyn looked to her husband.  Now we truly have no choice. You must be Robert’s Hand. You must go south with him and learn the truth.   She saw at once that Ned had reached a very different conclusion.  The only truths I know are here. The south is a nest of adders I would do better to avoid.   Luwin plucked at his chain collar where it had chafed the soft skin of his throat.  The Hand of the King has great power, my lord. Power to find the truth of Lord Arryn’s death, to bring his killers to the king’s justice. Power to protect Lady Arryn and her son, if the worst be true.   Ned glanced helplessly around the bedchamber. Catelyn’s heart went out to him, but she knew she could not take him in her arms just then. First the victory must be won, for her children’s sake.  You say you love Robert like a brother. Would you leave your brother surrounded by Lannisters?    The Others take both of you,  Ned muttered darkly. He turned away from them and went to the window. She did not speak, nor did the maester. They waited, quiet, while Eddard Stark said a silent farewell to the home he loved. When he turned away from the window at last, his voice was tired and full of melancholy, and moisture glittered faintly in the corners of his eyes.  My father went south once, to answer the summons of a king. He never came home again.    A different time,  Maester Luwin said.  A different king.    Yes,  Ned said dully. He seated himself in a chair by the hearth.  Catelyn, you shall stay here in Winterfell.   His words were like an icy draft through her heart.  No,  she said, suddenly afraid. Was this to be her punishment? Never to see his face again, nor to feel his arms around her?   Yes,  Ned said, in words that would brook no argument.  You must govern the north in my stead, while I run Robert’s errands. There must always be a Stark in Winterfell. Robb is fourteen. Soon enough, he will be a man grown. He must learn to rule, and I will not be here for him. Make him part of your councils. He must be ready when his time comes.    Gods will, not for many years,  Maester Luwin murmured.   Maester Luwin, I trust you as I would my own blood. Give my wife your voice in all things great and small. Teach my son the things he needs to know. Winter is coming.   Maester Luwin nodded gravely. Then silence fell, until Catelyn found her courage and asked the question whose answer she most dreaded.  What of the other children?   Ned stood, and took her in his arms, and held her face close to his.  Rickon is very young,  he said gently.  He should stay here with you and Robb. The others I would take with me.    I could not bear it,  Catelyn said, trembling."
}