{
  "id": "cdaf93c165a76749d2a75ba98bf663695c385224",
  "text": " His three bloodriders were with him.  Jhiqui helped Dany dismount; she had grown clumsy as her belly grew larger and heavier. She knelt before the khal.  My sun-and-stars is wounded.  The arakh cut was wide but shallow; his left nipple was gone, and a flap of bloody flesh and skin dangled from his chest like a wet rag.   Is scratch, moon of life, from arakh of one bloodrider to Khal Ogo,  Khal Drogo said in the Common Tongue.  I kill him for it, and Ogo too.  He turned his head, the bells in his braid ringing softly.  Is Ogo you hear, and Fogo his khalakka, who was khal when I slew him.    No man can stand before the sun of my life,  Dany said,  the father of the stallion who mounts the world.   A mounted warrior rode up and vaulted from his saddle. He spoke to Haggo, a stream of angry Dothraki too fast for Dany to understand. The huge bloodrider gave her a heavy look before he turned to his khal  This one is Mago, who rides in the khas of Ko Jhaqo. He says the khaleesi has taken his spoils, a daughter of the lambs who was his to mount.   Khal Drogo’s face was still and hard, but his black eyes were curious as they went to Dany.  Tell me the truth of this, moon of my life,  he commanded in Dothraki.  Dany told him what she had done, in his own tongue so the khal would understand her better, her words simple and direct.  When she was done, Drogo was frowning.  This is the way of war. These women are our slaves now, to do with as we please.    It pleases me to hold them safe,  Dany said, wondering if she had dared too much.  If your warriors would mount these women, let them take them gently and keep them for wives. Give them places in the khalasar and let them bear you sons.   Qotho was ever the cruelest of the bloodriders. It was he who laughed.  Does the horse breed with the sheep?   Something in his tone reminded her of Viserys. Dany turned on him angrily.  The dragon feeds on horse and sheep alike.   Khal Drogo smiled.  See how fierce she grows!  he said.  It is my son inside her, the stallion who mounts the world, filling her with his fire. Ride slowly, Qotho… if the mother does not burn you where you sit, the son will trample you into the mud. And you, Mago, hold your tongue and find another lamb to mount. These belong to my khaleesi.  He started to reach out a hand to Daenerys, but as he lifted his arm Drogo grimaced in sudden pain and turned his head.  Dany could almost feel his agony. The wounds were worse than Ser Jorah had led her to believe.  Where are the healers?  she demanded. The khalasar had two sorts: barren women and eunuch slaves. The herbwomen dealt in potions and spells, the eunuchs in knife, needle, and fire.  Why do they not attend the khal?    The khal sent the hairless men away, Khaleesi,  old Cohollo assured her. Dany saw the bloodrider had taken a wound himself; a deep gash in his left shoulder.   Many riders are hurt,  Khal Drogo said stubbornly.  Let them be healed first. This arrow is no more than the bite of a fly, this little cut only a new scar to boast of to my son.   Dany could see the muscles in his chest where the skin had been cut away. A trickle of blood ran from the arrow that pierced his arm.  It is not for Khal Drogo to wait,  she proclaimed.  Jhogo, seek out these eunuchs and bring them here at once.    Silver Lady,  a woman’s voice said behind her,  I can help the Great Rider with his hurts.   Dany turned her head. The speaker was one of the slaves she had claimed, the heavy, flat-nosed woman who had blessed her.   The khal needs no help from women who lie with sheep,  barked Qotho.  Aggo, cut out her tongue.   Aggo grabbed her hair and pressed a knife to her throat.  Dany lifted a hand.  No. She is mine. Let her speak.   Aggo looked from her to Qotho. He lowered his knife.   I meant no wrong, fierce riders.  The woman spoke Dothraki well. The robes she wore had once been the lightest and finest of woolens, rich with embroidery, but now they were mud-caked and bloody and ripped. She clutched the torn cloth of her bodice to her heavy breasts.  I have some small skill in the healing arts.    Who are you?  Dany asked her.   I am named Mirri Maz Duur. I am godswife of this temple.    Maegi,  grunted Haggo, fingering his arakh. His look was dark. Dany remembered the word from a terrifying story that Jhiqui had told her one night by the cookfire. A maegi was a woman who lay with demons and practiced the blackest of sorceries, a vile thing, evil and soulless, who came to men in the dark of night and sucked life and strength from their bodies.   I am a healer,  Mirri Maz Duur said.   A healer of sheeps,  sneered Qotho.  Blood of my blood, I say kill this maegi and wait for the hairless men.   Dany ignored the bloodrider’s outburst. This old, homely, thickbodied woman did not look like a maegi to her.  Where did you learn your healing, Mirri Maz Duur?    My mother was godswife before me, and taught me all the songs and spells most pleasing to the Great Shepherd, and how to make the sacred smokes and ointments from leaf and root and berry."
}