{
  "id": "cfde0ec15d4e7ba0c94a7f2a74838504f9b3ee21",
  "text": " Bilbo stood still and watched-he loved smoke-rings-and then be blushed  to think how proud he had been yesterday morning of the smoke-rings he had sent  up the wind over The Hill.  \"Now for some music!\" said Thorin. \"Bring out the instruments!\"  Kili  and  Fili  rushed  for  their  bags  and  brought  back  little  fiddles; Dori, Nori,  and Ori brought out flutes from somewhere inside their coats; Bombur produced a  drum  from  the  hall; Bifur  and Bofur went  out  too,  and  came  back with  clarinets  that they had left among the walking-sticks Dwalin and Balin said: \"Excuse me, I  left  mine  in  the  porch!\"  \"Just  bring  mine  in  with  you,\"  said  Thorin.  They  came  back with  viols  as  big  as  themselves,  and with  Thorin’s  harp wrapped  in  a  green  cloth.  It was  a  beautiful  gold-en harp, and when Thorin struck it the music began  all  at  once,  so  sudden  and  sweet  that Bilbo  forgot everything else, and was  swept  away  into dark  lands under  strange moons,  far over The Water and very  far  from  his hobbit-hole under The Hill.  The dark came into the room from the little window that opened in the side of  The  Hill;  the  firelight  flickered-it  was  April-and  still  they  played  on,  while  the  shadow of Gandalf's beard wagged against the wall.   ####-The  dark  filled  all  the  room,  and  the  fire  died  down,  and  the  shadows  were  lost,  and  still  they  played  on.  And  suddenly  first  one  and  then  another  began  to  sing  as  they  played,  deep-throated  singing  of  the  dwarves  in  the  deep  places  of  their ancient homes; and this is like a fragment of their song, if it can be like their  song without their music.     Far over the misty mountains cold  To dungeons deep and caverns old  We must away ere break of day  To seek the pale enchanted gold.    The dwarves of yore made mighty spells,  While hammers fell like ringing bells  In places deep, where dark things sleep,  In hollow halls beneath the fells.    For ancient king and elvish lord   There many a gloaming golden hoard   They shaped and wrought, and light they caught  To hide in gems on hilt of sword.    On silver necklaces they strung  The flowering stars, on crowns they hung  The dragon-fire, in twisted wire   They meshed the light of moon and sun.    Far over the misty mountains cold  To dungeons deep and caverns old  We must away, ere break of day,   To claim our long-forgotten gold.    Goblets they carved there for themselves  And harps of gold; where no man delves  There lay they long, and many a song  Was sung unheard by men or elves.    The pines were roaring on the height,  The winds were moaning in the night.  The fire was red, it flaming spread;  The trees like torches biased with light,    The bells were ringing in the dale  And men looked up with faces pale;   ####-The dragon's ire more fierce than fire   Laid low their towers and houses frail.    The mountain smoked beneath the moon;  The dwarves, they heard the tramp of doom.  They fled their hall to dying -fall  Beneath his feet, beneath the moon.    Far over the misty mountains grim  To dungeons deep and caverns dim  We must away, ere break of day,   To win our harps and gold from him!     As they sang the hobbit felt the love of beautiful things made by hands and by  cunning and by magic moving through him, a fierce and jealous love, the desire of  the  hearts  of  dwarves.  Then  something  Tookish  woke  up  inside  him,  and  he  wished  to  go  and  see  the  great  mountains,  and  hear  the  pine-trees  and  the  waterfalls, and explore the caves, and wear a sword instead of a walking-stick. He  looked  out  of  the  window.  The  stars  were  out  in  a  dark  sky  above  the  trees.  He  thought  of  the  jewels  of  the  dwarves  shining  in  dark  caverns.  Suddenly  in  the  wood  beyond  The  Water  a  flame  leapt  up--probably  somebody  lighting  a  wood- fire-and he thought of plundering dragons settling on his quiet Hill and kindling it  all  to  flames. He  shuddered;  and  very  quickly  he was  plain Mr.  Baggins  of  Bag- End, Under-Hill, again.  He got up trembling. He had less than half a mind to fetch the lamp, and more  than  half  a  mind  to  pretend  to,  and  go  and  hide  behind  the  beer  barrels  in  the  cellar,  and  not  come  out  again  until  all  the  dwarves  had  gone  away. Suddenly  he  found that the music and the singing had stopped, and they were all looking at him  with eyes shining in the dark.  \"Where  are  you  going?\"  said  Thorin,  in  a  tone  that  seemed  to  show  that  he  guessed both halves of the hobbit's mind.  \"What about a little light?\" said Bilbo apologetically.   \"We like the dark,\" said the dwarves. \"Dark for dark business! There are many  hours before dawn.\"  \"Of  course!\"  said Bilbo,  and  sat down  in  a hurry. He missed  the  stool  and  sat  in the fender, knocking over the poker and shovel with a crash.  \"Hush!\" said Gandalf. \"Let Thorin speak!\" And this is bow Thorin began."
}