{
  "id": "d3afe545ce530b79b769d246142462fbc6655d70",
  "text": " After me, please ... Riddikulus!\"  \"Riddikulus!\" said the class together.  \"Good,\" said Professor Lupin. \"Very good. But that was the easy part, I'm afraid. You see, the word alone is not enough. And this is where you come in, Neville.\"  The wardrobe shook again, though not as much as Neville, who walked forward as though he were heading for the gallows.  \"Right, Neville,\" said Professor Lupin. \"First things first: what would you say is the thing that frightens you most in the world?\"  Neville's lips moved, but no noise came out.  \"didn't catch that, Neville, sorry,\" said Professor Lupin cheerfully.  Neville looked around rather wildly, as though begging someone to help him, then said, in barely more than a whisper, \"Professor Snape.\"  Nearly everyone laughed. Even Neville grinned apologetically. Professor Lupin, however, looked thoughtful.  \"Professor Snape... hmmm... Neville, I believe you live with your grandmother?\"  \"Er -- yes,\" said Neville nervously. \"But -- I don't want the boggart to turn into her either.\"  \"No, no, you misunderstand me,\" said Professor Lupin, now smiling. \"I wonder, could you tell us what sort of clothes your grandmother usually wears?\"  Neville looked startled, but said, \"Well... always the same hat. A tall one with a stuffed vulture on top. And a long dress... green, normally... and sometimes a fox-fur scarf.\"  \"And a handbag?\" prompted Professor Lupin.  \"A big red one,\" said Neville.  \"Right then,\" said Professor Lupin. \"Can you picture those clothes very clearly, Neville? Can you see them in your mind's eye?\"  \"Yes,\" said Neville uncertainty, plainly wondering what was coming next.  \"When the boggart bursts out of this wardrobe, Neville, and sees You, it will assume the form of Professor Snape,\" said Lupin. \"And You will raise your wand -- thus -- and cry 'Riddikulus' -- and concentrate hard on your grandmother's clothes. If all goes well, Professor Boggart Snape will be forced into that vulture-topped hat, and that green dress, with that big red handbag.\"  There was a great shout of laughter. The wardrobe wobbled more violently.  \"If Neville is successful, the boggart is likely to shift his attention to each of us in turn,\" said Professor Lupin. \"I would like all of you to take a moment now to think of the thing that scares you most, and imagine how you might force it to look comical....\"  The room went quiet. Harry thought... 'What scared him most in the world?  His first thought was Lord Voldemort -- a Voldemort returned to full strength. But before he had even started to plan a possible counterattack on a boggart-Voldemort, a horrible image came floating to the surface of his mind....  A rotting, glistening hand, slithering back beneath a black cloak ... a long, rattling breath from an unseen mouth... then a cold so penetrating it felt like drowning....  Harry shivered, then looked around, hoping no one had noticed. Many people had their eyes shut tight. Ron was muttering to himself, \"Take its legs off \" Harry was sure he knew what that was about. Ron's greatest fear was spiders.  \"Everyone ready?\" said Professor Lupin.  Harry felt a lurch of fear. He wasn't ready. How could you make a dementor less frightening? But he didn't want to ask for more time; everyone else was nodding and rolling up their sleeves.  \"Neville, we're going to back away,\" said Professor Lupin. \"Let you have a clear field, all right? I'll call the next person forward.... Everyone back, now, so Neville can get a clear shot --\"  They all retreated, backed against the walls, leaving Neville alone beside the wardrobe. He looked pale and frightened, but he had pushed up the sleeves of his robes and was holding his wand ready.  \"On the count of three, Neville,\" said Professor Lupin, who was  pointing his own wand at the handle of the wardrobe. \"One two -- three -- now!\"  A jet of sparks shot from the end of Professor Lupin's wand and hit the doorknob. The wardrobe burst open. Hook-nosed and menacing, Professor Snape stepped out, his eyes flashing at Neville.  Neville backed away, his wand up, mouthing wordlessly. Snape was bearing down upon him, reaching inside his robes.  \"R -- r -- riddikulus! \"squeaked Neville.  There was a noise like a whip crack. Snape stumbled; he was wearing a long, lace-trimmed dress and a towering hat topped with a moth-eaten vulture, and he was swinging a huge crimson handbag.  There was a roar of laughter; the boggart paused, confused, and Professor Lupin shouted, \"Parvati! Forward!\"  Parvati walked forward, her face set. Snape rounded on her. There was another crack, and where he had stood was a bloodstained, bandaged mummy; its sightless face was turned to Parvati and it began to walk toward her very slowly, dragging its feet, its stiff arms rising --  \"Riddikulus!\" cried Parvati.  A bandage unraveled at the mummy's feet; it became entangled, fell face forward, and its head rolled off.  \"Seamus!\" roared Professor Lupin.  Seamus darted past Parvati.  Crack! Where the mummy had been was a woman with floorlength black hair and a skeletal, green-tinged face -- a banshee."
}