{
  "id": "d3d485901ac70daed67fe28d2e798149c6ea7283",
  "text": " She leapt a rotten log and swung wide around a monstrous deadfall, jagged with broken branches. Then up a gentle slope and down the other side, slowing and speeding up again, her horse’s shoes striking sparks off the flintstones underfoot. At the top of the hill she glanced back. Harwin had pushed ahead of Anguy, but both were coming hard. Greenbeard had fallen further back and seemed to be flagging.  A stream barred her way. She splashed down into it, through water choked with wet brown leaves. Some clung to her horse’s legs as they climbed the other side. The undergrowth was thicker here, the ground so full of roots and rocks that she had to slow, but she kept as good a pace as she dared. Another hill before her, this one steeper. Up she went, and down again. How big are these woods? she wondered. She had the faster horse, she knew that, she had stolen one of Roose Bolton’s best from the stables at Harrenhal, but his speed was wasted here. I need to find the fields again. I need to find a road. Instead she found a game trail. It was narrow and uneven, but it was something. She raced along it, branches whipping at her face. One snagged her hood and yanked it back, and for half a heartbeat she feared they had caught her. A vixen burst from the brush as she passed, startled by the fury of her flight. The game trail brought her to another stream. Or was it the same one? Had she gotten turned around? There was no time to puzzle it out, she could hear their horses crashing through the trees behind her. Thorns scratched at her face like the cats she used to chase in King’s Landing. Sparrows exploded from the branches of an alder. But the trees were thinning now, and suddenly she was out of them. Broad level fields stretched before her, all weeds and wild wheat, sodden and trampled. Arya kicked her horse back to a gallop. Run, she thought, run for Riverrun, run for home. Had she lost them? She took one quick look, and there was Harwin six yards back and gaining. No, she thought, no, he can’t, not him, it isn’t fair.  Both horses were lathered and flagging by the time he came up beside her, reached over, and grabbed her bridle. Arya was breathing hard herself then. She knew the fight was done.  You ride like a northman, milady,  Harwin said when he’d drawn them to a halt.  Your aunt was the same. Lady Lyanna. But my father was master of horse, remember.   The look she gave him was full of hurt.  I thought you were my father’s man.    Lord Eddard’s dead, milady. I belong to the lightning lord now, and to my brothers.    What brothers?  Old Hullen had fathered no other sons that Arya could remember.   Anguy, Lem, Tom o’ Sevens, Jack and Greenbeard, all of them. We mean your brother Robb no ill, milady… but it’s not him we fight for. He has an army all his own, and many a great lord to bend the knee. The smallfolk have only us.  He gave her a searching look.  Can you understand what I am telling you?    Yes.  That he was not Robb’s man, she understood well enough. And that she was his captive. I could have stayed with Hot Pie. We could have taken the little boat and sailed it up to Riverrun. She had been better off as Squab. No one would take Squab captive, or Nan, or Weasel, or Arry the orphan boy. I was a wolf, she thought, but now I’m just some stupid little lady again.   Will you ride back peaceful now,  Harwin asked her,  or must I tie you up and throw you across your horse?    I’ll ride peaceful,  she said sullenly. For now.      Samwell   Sobbing, Sam took another step. This is the last one, the very last, I can’t go on, I can’t. But his feet moved again. One and then the other. They took a step, and then another, and he thought, They’re not my feet, they’re someone else’s, someone else is walking, it can’t be me.  When he looked down he could see them stumbling through the snow; shapeless things, and clumsy. His boots had been black, he seemed to remember, but the snow had caked around them, and now they were misshapen white balls. Like two clubfeet made of ice.  It would not stop, the snow. The drifts were up past his knees, and a crust covered his lower legs like a pair of white greaves. His steps were dragging, lurching. The heavy pack he carried made him look like some monstrous hunchback. And he was tired, so tired. I can’t go on. Mother have mercy, I can’t.  Every fourth or fifth step he had to reach down and tug up his swordbelt. He had lost the sword on the Fist, but the scabbard still weighed down the belt. He did have two knives; the dragonglass dagger Jon had given him and the steel one he cut his meat with. All that weight dragged heavy, and his belly was so big and round that if he forgot to tug the belt slipped right off and tangled round his ankles, no matter how tight he cinched it. He had tried belting it above his belly once, but then it came almost to his armpits. Grenn had laughed himself sick at the sight of it, and Dolorous Edd had said,  I knew a man once who wore his sword on a chain around his neck like that."
}