{
  "id": "d445e2ebd95eddf6a0e71656c273854f5b7639fb",
  "text": " Lord Jon’s memory will haunt each stone. I know my sister. She needs the comfort of family and friends around her.    Your uncle waits in the Vale, does he not? Jon named him Knight of the Gate, I’d heard.   Catelyn nodded.  Brynden will do what he can for her, and for the boy. That is some comfort, but still…    Go to her,  Ned urged.  Take the children. Fill her halls with noise and shouts and laughter. That boy of hers needs other children about him, and Lysa should not be alone in her grief.    Would that I could,  Catelyn said.  The letter had other tidings. The king is riding to Winterfell to seek you out.   It took Ned a moment to comprehend her words, but when the understanding came, the darkness left his eyes.  Robert is coming here?  When she nodded, a smile broke across his face.  Catelyn wished she could share his joy. But she had heard the talk in the yards; a direwolf dead in the snow, a broken antler in its throat. Dread coiled within her like a snake, but she forced herself to smile at this man she loved, this man who put no faith in signs.  I knew that would please you,  she said.  We should send word to your brother on the Wall.    Yes, of course,  he agreed.  Ben will want to be here. I shall tell Maester Luwin to send his swiftest bird.  Ned rose and pulled her to her feet.  Damnation, how many years has it been? And he gives us no more notice than this? How many in his party, did the message say?    I should think a hundred knights, at the least, with all their retainers, and half again as many freeriders. Cersei and the children travel with them.    Robert will keep an easy pace for their sakes,  he said.  It is just as well. That will give us more time to prepare.    The queen’s brothers are also in the party,  she told him.  Ned grimaced at that. There was small love between him and the queen’s family, Catelyn knew. The Lannisters of Casterly Rock had come late to Robert’s cause, when victory was all but certain, and he had never forgiven them.  Well, if the price for Robert’s company is an infestation of Lannisters, so be it. It sounds as though Robert is bringing half his court.    Where the king goes, the realm follows,  she said.   It will be good to see the children. The youngest was still sucking at the Lannister woman’s teat the last time I saw him. He must be, what, five by now?    Prince Tommen is seven,  she told him.  The same age as Bran. Please, Ned, guard your tongue. The Lannister woman is our queen, and her pride is said to grow with every passing year.   Ned squeezed her hand.  There must be a feast, of course, with singers, and Robert will want to hunt. I shall send Jory south with an honor guard to meet them on the kingsroad and escort them back. Gods, how are we going to feed them all? On his way already, you said? Damn the man. Damn his royal hide.       DAENERYS  Her brother held the gown up for her inspection.  This is beauty. Touch it. Go on. Caress the fabric.   Dany touched it. The cloth was so smooth that it seemed to run through her fingers like water. She could not remember ever wearing anything so soft. It frightened her. She pulled her hand away.  Is it really mine?    A gift from the Magister Illyrio,  Viserys said, smiling. Her brother was in a high mood tonight.  The color will bring out the violet in your eyes. And you shall have gold as well, and jewels of all sorts. Illyrio has promised. Tonight you must look like a princess.   A princess, Dany thought. She had forgotten what that was like. Perhaps she had never really known.  Why does he give us so much?  she asked.  What does he want from us?  For nigh on half a year, they had lived in the magister’s house, eating his food, pampered by his servants. Dany was thirteen, old enough to know that such gifts seldom come without their price, here in the free city of Pentos.   Illyrio is no fool,  Viserys said. He was a gaunt young man with nervous hands and a feverish look in his pale lilac eyes.  The magister knows that I will not forget my friends when I come into my throne.   Dany said nothing. Magister Illyrio was a dealer in spices, gemstones, dragonbone, and other, less savory things. He had friends in all of the Nine Free Cities, it was said, and even beyond, in Vaes Dothrak and the fabled lands beside the Jade Sea. It was also said that he’d never had a friend he wouldn’t cheerfully sell for the right price. Dany listened to the talk in the streets, and she heard these things, but she knew better than to question her brother when he wove his webs of dream. His anger was a terrible thing when roused. Viserys called it  waking the dragon.   Her brother hung the gown beside the door.  Illyrio will send the slaves to bathe you. Be sure you wash off the stink of the stables. Khal Drogo has a thousand horses, tonight he looks for a different sort of mount.  He studied her critically.  You still slouch. Straighten yourself  He pushed back her shoulders with his hands.  Let them see that you have a woman’s shape now."
}