{
  "id": "d51ccd7cf8d8d4d9ba5d6ece0ce9078a5164cae1",
  "text": " Bran glimpsed blind eyes crawling with maggots, a wide mouth full of yellowed teeth. But it was the size of it that made him gasp. It was bigger than his pony, twice the size of the largest hound in his father’s kennel.   It’s no freak,  Jon said calmly.  That’s a direwolf. They grow larger than the other kind.   Theon Greyjoy said,  There’s not been a direwolf sighted south of the Wall in two hundred years.    I see one now,  Jon replied.  Bran tore his eyes away from the monster. That was when he noticed the bundle in Robb’s arms. He gave a cry of delight and moved closer. The pup was a tiny ball of grey-black fur, its eyes still closed. It nuzzled blindly against Robb’s chest as he cradled it, searching for milk among his leathers, making a sad little whimpery sound. Bran reached out hesitantly.  Go on,  Robb told him.  You can touch him.   Bran gave the pup a quick nervous stroke, then turned as Jon said,  Here you go.  His half brother put a second pup into his arms.  There are five of them.  Bran sat down in the snow and hugged the wolf pup to his face. Its fur was soft and warm against his cheek.   Direwolves loose in the realm, after so many years,  muttered Hullen, the master of horse.  I like it not.    It is a sign,  Jory said.  Father frowned.  This is only a dead animal, Jory,  he said. Yet he seemed troubled. Snow crunched under his boots as he moved around the body.  Do we know what killed her?    There’s something in the throat,  Robb told him, proud to have found the answer before his father even asked.  There, just under the jaw.   His father knelt and groped under the beast’s head with his hand. He gave a yank and held it up for all to see. A foot of shattered antler, tines snapped off, all wet with blood.  A sudden silence descended over the party. The men looked at the antler uneasily, and no one dared to speak. Even Bran could sense their fear, though he did not understand.  His father tossed the antler to the side and cleansed his hands in the snow.  I’m surprised she lived long enough to whelp,  he said. His voice broke the spell.   Maybe she didn’t,  Jory said.  I’ve heard tales… maybe the bitch was already dead when the pups came.    Born with the dead,  another man put in.  Worse luck.    No matter,  said Hullen.  They be dead soon enough too.   Bran gave a wordless cry of dismay.   The sooner the better,  Theon Greyjoy agreed. He drew his sword.  Give the beast here, Bran.   The little thing squirmed against him, as if it heard and understood.  No!  Bran cried out fiercely.  It’s mine.    Put away your sword, Greyjoy,  Robb said. For a moment he sounded as commanding as their father, like the lord he would someday be.  We will keep these pups.    You cannot do that, boy,  said Harwin, who was Hullen’s son.   It be a mercy to kill them,  Hullen said.  Bran looked to his lord father for rescue, but got only a frown, a furrowed brow.  Hullen speaks truly, son. Better a swift death than a hard one from cold and starvation.    No!  He could feel tears welling in his eyes, and he looked away. He did not want to cry in front of his father.  Robb resisted stubbornly.  Ser Rodrik’s red bitch whelped again last week,  he said.  It was a small litter, only two live pups. She’ll have milk enough.    She’ll rip them apart when they try to nurse.    Lord Stark,  Jon said. It was strange to hear him call Father that, so formal. Bran looked at him with desperate hope.  There are five pups,  he told Father.  Three male, two female.    What of it, Jon?    You have five trueborn children,  Jon said.  Three sons, two daughters. The direwolf is the sigil of your House. Your children were meant to have these pups, my lord.   Bran saw his father’s face change, saw the other men exchange glances. He loved Jon with all his heart at that moment. Even at seven, Bran understood what his brother had done. The count had come right only because Jon had omitted himself. He had included the girls, included even Rickon, the baby, but not the bastard who bore the surname Snow, the name that custom decreed be given to all those in the north unlucky enough to be born with no name of their own.  Their father understood as well.  You want no pup for yourself, Jon?  he asked softly.   The direwolf graces the banners of House Stark,  Jon pointed out.  I am no Stark, Father.   Their lord father regarded Jon thoughtfully. Robb rushed into the silence he left.  I will nurse him myself, Father,  he promised.  I will soak a towel with warm milk, and give him suck from that.    Me too!  Bran echoed.  The lord weighed his sons long and carefully with his eyes.  Easy to say, and harder to do. I will not have you wasting the servants’ time with this. If you want these pups, you will feed them yourselves. Is that understood?   Bran nodded eagerly. The pup squirmed in his grasp, licked at his face with a warm tongue.   You must train them as well,  their father said.  You must train them. The kennelmaster will have nothing to do with these monsters, I promise you that."
}