{
  "id": "d5653d75fc7715735c8622bc7d53c29d9d9e8ed9",
  "text": " When it came, she knew it would mean death. Hal’s death perhaps… or hers, or Robb’s. No one was safe. No life was certain. Catelyn was content to wait, to listen to the whispers in the woods and the faint music of the brook, to feel the warm wind in her hair.  She was no stranger to waiting, after all. Her men had always made her wait.  Watch for me, little cat,  her father would always tell her, when he rode off to court or fair or battle. And she would, standing patiently on the battlements of Riverrun as the waters of the Red Fork and the Tumblestone flowed by. He did not always come when he said he would, and days would ofttimes pass as Catelyn stood her vigil, peering out between crenels and through arrow loops until she caught a glimpse of Lord Hoster on his old brown gelding, trotting along the rivershore toward the landing.  Did you watch for me?  he’d ask when he bent to bug her.  Did you, little cat?   Brandon Stark had bid her wait as well.  I shall not be long, my lady,  he had vowed.  We will be wed on my return.  Yet when the day came at last, it was his brother Eddard who stood beside her in the sept.  Ned had lingered scarcely a fortnight with his new bride before he too had ridden off to war with promises on his lips. At least he had left her with more than words; he had given her a son. Nine moons had waxed and waned, and Robb had been born in Riverrun while his father still warred in the south. She had brought him forth in blood and pain, not knowing whether Ned would ever see him. Her son. He had been so small…  And now it was for Robb that she waited… for Robb, and for Jaime Lannister, the gilded knight who men said had never learned to wait at all.  The Kingslayer is restless, and quick to anger,  her uncle Brynden had told Robb. And he had wagered their lives and their best hope of victory on the truth of what he said.  If Robb was frightened, he gave no sign of it. Catelyn watched her son as he moved among the men, touching one on the shoulder, sharing a jest with another, helping a third to gentle an anxious horse. His armor clinked softly when he moved. Only his head was bare. Catelyn watched a breeze stir his auburn hair, so like her own, and wondered when her son had grown so big. Fifteen, and near as tall as she was.  Let him grow taller, she asked the gods. Let him know sixteen, and twenty, and fifty. Let him grow as tall as his father, and hold his own son in his arms. Please, please, please. As she watched him, this tall young man with the new beard and the direwolf prowling at his heels, all she could see was the babe they had laid at her breast at Riverrun, so long ago.  The night was warm, but the thought of Riverrun was enough to make her shiver. Where are they? she wondered. Could her uncle have been wrong? So much rested on the truth of what he had told them. Robb had given the Blackfish three hundred picked men, and sent them ahead to screen his march.  Jaime does not know,  Ser Brynden said when he rode back.  I’ll stake my life on that. No bird has reached him, my archers have seen to that. We’ve seen a few of his outriders, but those that saw us did not live to tell of it. He ought to have sent out more. He does not know.    How large is his host?  her son asked.   Twelve thousand foot, scattered around the castle in three separate camps, with the rivers between,  her uncle said, with the craggy smile she remembered so well.  There is no other way to besiege Riverrun, yet still, that will be their undoing. Two or three thousand horse.    The Kingslayer has us three to one,  said Galbart Glover.  ‘True enough,  Ser Brynden said,  yet there is one thing Ser Jaime lacks.    Yes?  Robb asked.   Patience.   Their host was greater than it had been when they left the Twins. Lord Jason Mallister had brought his power out from Seagard to join them as they swept around the headwaters of the Blue Fork and galloped south, and others had crept forth as well, hedge knights and small lords and masterless men-at-arms who had fled north when her brother Edmure’s army was shattered beneath the walls of Riverrun. They had driven their horses as hard as they dared to reach this place before Jaime Lannister had word of their coming, and now the hour was at hand.  Catelyn watched her son mount up. Olyvar Frey held his horse for him, Lord Walder’s son, two years older than Robb, and ten years younger and more anxious. He strapped Robb’s shield in place and handed up his helm. When he lowered it over the face she loved so well, a tall young knight sat on his grey stallion where her son had been. It was dark among the trees, where the moon did not reach. When Robb turned his head to look at her, she could see only black inside his visor.  I must ride down the line, Mother,  he told her.  Father says you should let the men see you before a battle.   ‘Go, then,  she said.  Let them see you.   ‘It will give them courage,  Robb said.  And who will give me courage? she wondered, yet she kept her silence and made herself smile for him."
}