{
  "id": "d6346bad7fd2a025384a91e576e31bf0dedecd2b",
  "text": "  But  among  them  were  several  others  which  had  been  used  for  bringing other stuffs, butter, apples, and all sorts of things, to the king's palace.  They  soon  found  thirteen with  room enough  for a dwarf  in each.  In  fact  some  were  too  roomy,  and  as  they  climbed  in  the  dwarves  thought  anxiously  of  the  shaking and  the bumping  they would get  inside,  though Bilbo did his best  to  find  straw  and  other  stuff  to  pack  them  in  as  cosily  as  could  be  managed  in  a  short  time. At  last  twelve  dwarves were  stowed. Thorin  had  given  a  lot  of  trouble,  and  turned  and  twisted  in  his  tub  and  grumbled  like  a  large  dog  in  a  small  kennel;  while Balin, who came last, made a great fuss about his air-holes and said he was  stifling, even before his lid was on. Bilbo had done what he could to close holes in  the  sides  of  the  barrels,  and  to  fix  on  all  the  lids  as  safely  as  could  be  managed,  and  now  he  was  left  alone  again,  running  round  putting  the  finishing  touches-to  the packing, and hoping against hope that his plan would come off.   ####-It  had  not  been  a-bit too soon. Only a minute or two after Balin's lid had been  fitted  on  there  came  the  sound  of  voices  and  the  flicker  of  lights.  A  number  of  elves  came  laughing  and  talking  into  the  cellars  and  singing  snatches  of  song.  They had  left a merry feast  in one of  the halls and were bent on returning as soon  as  they  could.  \"Where's  old  Galion,  the  butler?\"  said  one.  \"I  haven't  seen  him  at  the tables tonight. He ought to be here now to show us what is to be done.\"  \"I shall be angry  if  the old slowcoach  is  late,\" said another. \"I have no wish  to  waste time down here while the song is up!\"  \"Ha, ha!\" came a cry. \"Here's  the old villain with his head on a jug! He's been  having a little feast all to himself and his friend the captain.\"  \"Shake him! Wake him!\" shouted the others impatiently. Gallon was not at all  pleased at being shaken or wakened, and still  less at being  laughed at.  \"You're all  late,\" he grumbled. \"Here am I waiting and waiting down here, while you fellows  drink  and  make  merry  and  forget  your  tasks.  Small  wonder  if  I  fall  asleep  from  weariness!\"  \"Small  wonder,\"  said  they,  \"when  the  explanation  stands  close  at  hand  in  a  jug! Come  give  us  a  taste  of  your  sleeping-draught before we  fall  to! No need  to  wake the turnkey yonder. He has had his share by the looks of it.\"  Then  they  drank  once  round  and  became  mighty  merry  all  of  a  sudden.  But  they did not quite  lose  their wits. \"Save us, Galion!\" cried some, \"you began your  feasting  early  and  muddled  your  wits!  You  have  stacked  some  full  casks  here  instead of the empty ones, if there is anything in weight.\"  \"Get on with the work!\" growled the butler. \"There is nothing in the feeling of  weight  in  an  idle  toss-pot's  arms. These  are  the ones  to go  and no others. Do  as  I  say!\"  \"Very  well,  very  well,\"  they  answered  rolling  the  barrels  to  the  opening.  \"On  your  head  be  it,  if  the  king's  full  buttertubs  and  his  best  wine  is  pushed  into  the  river for the Lake-men to feast on for nothing!\"     Roll-roll-roll-roll,  roll-roll-rolling down the hole I   Heave ho! Splash plump !  Down they go, down they bump!     So  they  sang as  first one barrel and  then another  rumbled  to  the dark opening  and  was  pushed  over  into  the  cold  water  some  feet  below.  Some  were  barrels  really empty, some were  tubs neatly packed with a dwarf each; but down  they all  went,  one  after  another, with many  a  clash  and  a  bump,  thudding  on  top  of  ones   ####-below,  smacking  into  the water,  jostling against  the walls of  the  tunnel, knocking  into one another, and bobbing away down the current.  It was just at this moment that Bilbo suddenly discovered the weak point in his  plan. Most  likely you  saw  it  some  time  ago  and have been  laughing  at him; but I  don't suppose you would have done half as well yourselves in his place. Of course  he was not  in a barrel himself, nor was  there anyone  to pack him  in, even  if  there  had  been  a  chance!  It  looked  as  if  he  would  certainly  lose  his  friends  this  time  (nearly  all  of  them  had  already  disappeared  through  the  dark  trap-door), and get  utterly left behind and have to stay lurking as a permanent burglar in the elf-caves  for ever. For even if he could have escaped through the upper gates at once, he had  precious small chance of ever finding the dwarves again. He did not know the way  by  land  to  the place where  the barrels were collected. He wondered what on earth  would happen to them without him; for he had not had time to tell the dwarves all  that  he  had  learned,  or what he had meant  to do, once  they were out of  the wood.  While  all  these  thoughts  were  passing  through  his  mind,  the  elves  being  very  merry  began  to  sing  a  song  round  the  river-door."
}