{
  "id": "d885c661a7b3bbfa2ff654b2eba8005219ecc9ce",
  "text": " . . . \"   Harry, Ron, and Hermione squeezed inside. A long line wound right to the back of the shop, where Gilderoy Lockhart was signing his books. They each grabbed a copy of The Standard Book of Spells, Grade 2 and sneaked up the line to where the rest of the Weasleys were standing with Mr. and Mrs. Granger.  \"Oh, there you are, good,\" said Mrs. Weasley. She sounded breathless and kept patting her hair. \"We'll be able to see him in a minute ......  Gilderoy Lockhart came slowly into view, seated at a table surrounded by large pictures of his own face, all winking and flashing dazzlingly white teeth at the crowd. The real Lockhart was wearing robes of forget-me-not blue that exactly matched his eyes; his pointed wizard's hat was set at a jaunty angle on his wavy hair.  A short, irritable-looking man was dancing around taking photographs with a large black camera that emitted puffs of purple smoke with every blinding flash.  \"Out of the way, there,\" he snarled at Ron, moving back to get a better shot. \"This is for the Daily Prophet -\"  \"Big deal,\" said Ron, rubbing his foot where the photographer had stepped on it.  Gilderoy Lockhart heard him. He looked up. He saw Ron  *59*   and then he saw Harry. He stared. Then he leapt to his feet and positively shouted, \"It can't be Harry Potter?\"  The crowd parted, whispering excitedly; Lockhart dived forward, seized Harry's arm, and pulled him to the front. The crowd burst into applause. Harry's face burned as Lockhart shook his hand for the photographer, who was clicking away madly, wafting thick smoke over the Weasleys.  \"Nice big smile, Harry,\" said Lockhart, through his own gleaming teeth. \"Together, you and I are worth the front page.\"  When he finally let go of Harry's hand, Harry could hardly feel his fingers. He tried to sidle back over to the Weasleys, but Lockhart threw an arm around his shoulders and clamped him tightly to his side.  \"Ladies and gentlemen,\" he said loudly, waving for quiet. \"What an extraordinary moment this is! The perfect moment for me to make a little announcement I've been sitting on for some time!  \"When young Harry here stepped into Flourish and Blotts today, he only wanted to buy my autobiography -which I shall be happy to present him now, free of charge-\" The crowd applauded again. \"He had no idea,\" Lockhart continued, giving Harry a little shake that made his glasses slip to the end of his nose, \"that he would shortly be getting much, much more than my book, Magical Me. He and his schoolmates will, in fact, be getting the real magical me. Yes, ladies and gentlemen, I have great pleasure and pride in announcing that this September, I will be taking up the post of Defense Against the Dark Arts teacher at Hogwarts School of Witchcraft and Wizardry!\"  The crowd cheered and clapped and Harry found himself being  60  presented with the entire works of Gilderoy Lockhart. Staggering slightly under their weight, he managed to make his way out of the limelight to the edge of the room, where Ginny was standing next to her new cauldron.  \"You have these,\" Harry mumbled to her, tipping the books into the cauldron. \"I'll buy my own -\"  \"Bet you loved that, didn't you, Potter?\" said a voice Harry had no trouble recognizing. He straightened up and found himself face-to-face with Draco Malfoy, who was wearing his usual sneer.  \"Famous Harry Potter,\" said Malfoy. \"Can't even go into a bookshop without making the front page.\"  \"Leave him alone, he didn't want all that!\" said Ginny. It was the first time she had spoken in front of Harry. She was glaring at Malfoy.  \"Potter, you've got yourself a girlfriend!\" drawled Malfoy. Ginny went scarlet as Ron and Hermione fought their way over, both clutching stacks of Lockhart's books.  \"Oh, it's you,\" said Ron, looking at Malfoy as if he were something unpleasant on the sole of his shoe. \"Bet you're surprised to see Harry here, eh?\"  \"Not as surprised as I am to see you in a shop, Weasley,\" retorted Malfoy. \"I suppose your parents will go hungry for a month to pay for all those.\"  Ron went as red as Ginny. He dropped his books into the cauldron, too, and started toward Malfoy, but Harry and Hermione grabbed the back of his jacket.  \"Ron!\" said Mr. Weasley, struggling over with Fred and George. \"What are you doing? It's too crowded in here, let's go outside.\"  61  \"Well, well, well - Arthur Weasley.\"  It was Mr. Malfoy. He stood with his hand on Draco's shoulder, sneering in just the same way.  \"Lucius,\" said Mr. Weasley, nodding coldly.  \"Busy time at the Ministry, I hear,\" said Mr. Malfoy. \"All those raids ... I hope they're paying you overtime?\"  He reached into Ginny's cauldron and extracted, from amid the glossy Lockhart books, a very old, very battered copy of A Beginner's Guide to Transfiguration.  \"Obviously not,\" Mr. Malfoy said. \"Dear me, what's the use of being a disgrace to the name of wizard if they don't even pay you well for it?\"  Mr. Weasley flushed darker than either Ron or Ginny.  \"We have a very different idea of what disgraces the name of wizard, Malfoy,\" he said."
}