{
  "id": "d9b63d21a86cc49f4aa7e3f893221dc177dde860",
  "text": "    A most, hmmm, loving gesture, my lord. Perhaps instead some few of us might call upon the king at the Red Keep. A small demonstration of our powers, as it were, to distract His Grace from his many cares for an evening. Wildfire is but one of the dread secrets of our ancient order. Many and wondrous are the things we might show you.    I will take it up with my sister.  Tyrion had no objection to a few magic tricks, but Joff’s fondness for making men fight to the death was trial enough; he had no intention of allowing the boy to taste the possibilities of burning them alive.  When at last they reached the top of the steps, Tyrion shrugged out of his shadowskin fur and folded it over his arm. The Guildhall of the Alchemists was an imposing warren of black stone, but Hallyne led him through the twists and turns until they reached the Gallery of the Iron Torches, a long echoing chamber where columns of green fire danced around black metal columns twenty feet tall. Ghostly flames shimmered off the polished black marble of the walls and floor and bathed the hall in an emerald radiance. Tyrion would have been more impressed if he hadn’t known that the great iron torches had only been lit this morning in honor of his visit, and would be extinguished the instant the doors closed behind him. Wildfire was too costly to squander.  They emerged atop the broad curving steps that fronted on the Street of the Sisters, near the foot of Visenya’s Hill. He bid Hallyne farewell and waddled down to where Timett son of Timett waited with an escort of Burned Men. Given his purpose today, it had seemed a singularly appropriate choice for his guard. Besides, their scars struck terror in the hearts of the city rabble. That was all to the good these days. Only three nights past, another mob had gathered at the gates of the Red Keep, chanting for food. Joff had unleashed a storm of arrows against them, slaying four, and then shouted down that they had his leave to eat their dead. Winning us still more friends.  Tyrion was surprised to see Bronn standing beside the litter as well.  What are you doing here?    Delivering your messages,  Bronn said.  Ironhand wants you urgently at the Gate of the Gods. He won’t say why. And you’ve been summoned to Maegor’s too.    Summoned?  Tyrion knew of only one person who would presume to use that word.  And what does Cersei want of me?   Bronn shrugged.  The queen commands you to return to the castle at once and attend her in her chambers. That stripling cousin of yours delivered the message. Four hairs on his lip and he thinks he’s a man.    Four hairs and a knighthood. He’s Ser Lancel now, never forget.  Tyrion knew that Ser Jacelyn would not send for him unless the matter was of import.  I’d best see what Bywater wants. Inform my sister that I will attend her on my return.    She won’t like that,  Bronn warned.   Good. The longer Cersei waits, the angrier she’ll become, and anger makes her stupid. I much prefer angry and stupid to composed and cunning.  Tyrion tossed his folded cloak into his litter, and Timett helped him up after it.  The market square inside the Gate of the Gods, which in normal times would have been thronged with farmers selling vegetables, was near deserted when Tyrion crossed it. Ser Jacelyn met him at the gate, and raised his iron hand in brusque salute.  My lord. Your cousin Cleos Frey is here, come from Riverrun under a peace banner with a letter from Robb Stark.    Peace terms?    So he says.    Sweet cousin. Show me to him.   The gold cloaks had confined Ser Cleos to a windowless guardroom in the gatehouse. He rose when they entered.  Tyrion, you are a most welcome sight.    That’s not something I hear often, cousin.    Has Cersei come with you?    My sister is otherwise occupied. Is this Stark’s letter?  He plucked it off the table.  Ser Jacelyn, you may leave us.   Bywater bowed and departed.  I was asked to bring the offer to the Queen Regent,  Ser Cleos said as the door shut.   I shall.  Tyrion glanced over the map that Robb Stark had sent with his letter.  All in good time, cousin. Sit. Rest. You look gaunt and haggard.  He looked worse than that, in truth.   Yes.  Ser Cleos lowered himself onto a bench.  It is bad in the riverlands, Tyrion. Around the Gods Eye and along the kingsroad especially. The river lords are burning their own crops to try and starve us, and your father’s foragers are torching every village they take and putting the smallfolk to the sword.   That was the way of war. The smallfolk were slaughtered, while the highborn were held for ransom. Remind me to thank the gods that I was bom a Lannister.  Ser Cleos ran a hand through his thin brown hair.  Even with a peace banner, we were attacked twice. Wolves in mail, hungry to savage anyone weaker than themselves. The gods alone know what side they started on, but they’re on their own side now. Lost three men, and twice as many wounded.    What news of our foe?  Tyrion turned his attention back to Stark’s terms."
}