{
  "id": "da940c549b0c262532269119f17e6f4862f742f5",
  "text": "  Hermione gasped and started making suggestions at once, mentioning a number of reference books, and everybody from Albus Dumbledore to Madam Pomfrey, the Hogwarts nurse.  Ron simply looked dumbstruck. \"But - he wasn't there, was he?  You-Know-Who?  I mean - last time your scar kept hurting, he was at Hogwarts, wasn't he?\" \"I'm sure he wasn't on Privet Drive,\" said Harry. \"But I was dreaming about him.. . him and Peter - you know, Wormtail.  I can't remember all of it now, but they were plotting to kill...someone.\" He had teetered for a moment on the verge of saying \"me,\" but couldn't bring himself to make Hermione look any more horrified than she already did. \"It was only a dream,\" said Ron bracingly.  \"Just a nightmare.\" \"Yeah, but was it, though?\" said Harry, turning to look out of the window at the brightening sky.  \"It's weird, isn't it?. . . My scar hurts, and three days later the Death Eaters are on the march, and Voldemort's sign's up in the sky again.\" \"Don't - say - his - name!\"  Ron hissed through gritted teeth. \"And remember what Professor Trelawney said?\"  Harry went on, ignoring Ron. \"At the end of last year?\" Professor Trelawney was their Divination teacher at Hogwarts.  Hermione's terrified look vanished as she let out a derisive snort. \"Oh Harry, you aren't going to pay attention to anything that old fraud says?\" \"You weren't there,\" said Harry. \"You didn't hear her. This time was different. I told you, she went into a trance - a real one.  And she said the Dark Lord would rise again. . . greater and more terrible than ever before. . . and he'd manage it because his servant was going to go back to him. . . and that night Wormtail escaped.\" There was a silence in which Ron fidgeted absentmindedly with a hole in his Chudley Cannons bedspread. \"Why were you asking if Hedwig had come, Harry?\"  Hermione asked.  \"Are you expecting a letter?\" \"I told Sirius about my scar,\" said Harry, shrugging. \"I'm waiting for his answer.\" \"Good thinking!\" said Ron, his expression clearing. \"I bet Sirius'll know what to do!\" \"I hoped he'd get back to me quickly,\" said Harry. \"But we don't know where Sirius is. . . he could be in Africa or somewhere, couldn't he?\" said Hermione reasonably.  \"Hedwig's not going to manage that journey in a few days.\" \"Yeah, I know,\" said Harry, but there was a leaden feeling in his stomach as he looked out of the window at the Hedwig-free sky. \"Come and have a game of Quidditch in the orchard, Harry\" said Ron. \"Come on - three on three, Bill and Charlie and Fred and George will play. .. . You can try out the Wronski Feint... .\" \"Ron,\" said Hermione, in an I-don't-think-you're-being-very-sensitive sort of voice, \"Harry doesn't want to play Quidditch right now... . He's worried, and he's tired. . . . We all need to go to bed...\" \"Yeah, I want to play Quidditch,\" said Harry suddenly.  \"Hang on, I'll get my Firebolt.\" Hermione left the room, muttering something that sounded very much like \"Boys.\"   Neither Mr. Weasley nor Percy was at home much over the following week. Both left the house each morning before the rest of the family got up, and returned well after dinner every night. \"It's been an absolute uproar,\" Percy told them importantly the Sunday evening before they were due to return to Hogwarts.  \"I've been putting out fires all week.  People keep sending Howlers, and of course, if you don't open a Howler straight away, it explodes.  Scorch marks all over my desk and my best quill reduced to cinders.\" \"Why are they all sending Howlers?\"  asked Ginny, who was mending her copy of One Thousand Magical Herbs and Fungi with Spellotape on the rug in front of the living room fire. \"Complaining about security at the World Cup,\" said Percy.  \"They want compensation for their ruined property.  Mundungus Fletcher's put in a claim for a twelve-bedroomed tent with en-suite Jacuzzi, but I've got his number.  I know for a fact he was sleeping under a cloak propped on sticks.\" Mrs. Weasley glanced at the grandfather clock in the corner.  Harry liked this clock.  It was completely useless if you wanted to know the time, but otherwise very informative.  It had nine golden hands, and each of them was engraved with one of the Weasley family's names. There were no numerals around the face, but descriptions of where each family member might be. \"Home,\" \"school,\" and \"work\" were there, but there was also \"traveling,\" \"lost,\" \"hospital,\" \"prison,\" and, in the position where the number twelve would be on a normal clock, \"mortal peril.\" Eight of the hands were currently pointing to the \"home\" position, but Mr. Weasley's, which was the longest, was still pointing to \"work.\"  Mrs. Weasley sighed. \"Your father hasn't had to go into the office on weekends since the days of You-Know-Who,\" she said.  \"They're working him far too hard.  His dinner's going to be ruined if he doesn't come home soon.\" \"Well, Father feels he's got to make up for his mistake at the match, doesn't he?\" said Percy. \"If truth be told, he was a tad unwise to make a public statement without clearing it with his Head of Department first -\" \"Don't you dare blame your father for what that wretched Skeeter woman wrote!\"  said Mrs."
}