{
  "id": "db2c708d0e13ecee224b387c71a8c4a93c15b90c",
  "text": " \"Very good,\" said Voldemort softly, and as he raised his wand the pressure bearing down upon Harry lifted too.  \"And now you face me, like a man . . . straight-backed and proud, the way your father died. . . . \"And now - we duel.\" Voldemort raised his wand, and before Harry could do anything to defend himself, before he could even move, he had been hit again by the Cruciatus Curse.  The pain was so intense, so all-consuming, that he no longer knew where he was. . . . White-hot knives were piercing every inch of his skin, his head was surely going to burst with pain, he was screaming more loudly than he'd ever screamed in his life - And then it stopped. Harry rolled over and scrambled to his feet; he was shaking as uncontrollably as Wormtail had done when his hand had been cut off; he staggered sideways into the wall of watching Death Eaters, and they pushed him away, back toward Voldemort. \"A little break,\" said Voldemort, the slit-like nostrils dilating with excitement, \"a little pause . . . That hurt, didn't it. Harry?  You don't want me to do that again, do you?\" Harry didn't answer.  He was going to die like Cedric, those pitiless red eyes were telling him so ... he was going to die, and there was nothing he could do about it... but he wasn't going to play along.  He wasn't going to obey Voldemort... he wasn't going to beg. . . . \"I asked you whether you want me to do that again,\" said Voldemort softly.  \"Answer me!  Imperial\" And Harry felt, for the third time in his life, the sensation that his mind had been wiped of all thought. . . . Ah, it was bliss, not to think, it was as though he were floating, dreaming ...just answer no ... say no ... just answer no. .. . I will not, said a stronger voice, in the back of his head, I won't answer. . . . Just answer no. . . . I won't do it, I won't say it. ... Just answer no. . . . \"I WON'T!\" And these words burst from Harry's mouth; they echoed through the graveyard, and the dream state was lifted as suddenly as though cold water had been thrown over him - back rushed the aches that the Cruciatus Curse had left all over his body - back rushed the realization of where he was, and what he was facing. . . . \"You won't?\" said Voldemort quietly, and the Death Eaters were not laughing now. \"You won't say no?  Harry, obedience is a virtue I need to teach you before you die. . . . Perhaps another little dose of pain?\" Voldemort raised his wand, but this time Harry was ready; with the reflexes born of his Quidditch training, he flung himself sideways onto the ground; he rolled behind the marble headstone of Voldemort s father, and he heard it crack as the curse missed him. \"We are not playing hide-and-seek, Harry,\" said Voldemort's soft, cold voice, drawing nearer, as the Death Eaters laughed.  \"You cannot hide from me.  Does this mean you are tired of our duel?  Does this mean that you would prefer me to finish it now, Harry?  Come out, Harry . . . come out and play, then ... it will be quick ... it might even be painless ... I would not know... I have never died. . . .\" Harry crouched behind the headstone and knew the end had come.  There was no hope ... no help to be had.  And as he heard Voldemort draw nearer still, he knew one thing only, and it was beyond fear or reason:  He was not going to die crouching here like a child playing hide-and-seek; he was not going to die kneeling at Voldemort s feet... he was going to die upright like his father, and he was going to die trying to defend himself, even if no defense was possible. . . . Before Voldemort could stick his snakelike face around the headstone.  Harry stood up ... he gripped his wand tightly in his hand, thrust it out in front of him, and threw himself around the headstone, facing Voldemort. Voldemort was ready.  As Harry shouted, \"Expelliarmus!\" Voldemort cried, \"Avada Kedavra!\" A jet of green light issued from Voldemorts wand just as a jet of red light blasted from Harry's - they met in midair - and suddenly Harry's wand was vibrating as though an electric charge were surging through it; his hand seized up around it; he couldn't have released it if he'd wanted to - and a narrow beam of light connected the two wands, neither red nor green, but bright, deep gold.  Harry, following the beam with his astonished gaze, saw that Voldemort's long white fingers too were gripping a wand that was shaking and vibrating. And then - nothing could have prepared Harry for this - he felt his feet lift from the ground.  He and Voldemort were both being raised into the air, their wands still connected by that thread of shimmering golden light.  They glided away from the tombstone of Voldemort's father and then came to rest on a patch of ground that was clear and free of graves. . . . The Death Eaters were shouting; they were asking Voldemort for instructions; they were closing in, reforming the circle around Harry and Voldemort, the snake slithering at their heels, some of them drawing their wands - The golden thread connecting Harry and Voldemort splintered; though the wands remained connected, a thousand more beams arced high over Harry and Voldemort, crisscrossing all around them, until they were enclosed in a golden, dome-shaped web, a cage of light, beyond which the Death Eaters circled like jackals, their cries strangely muffled now."
}