{
  "id": "db4a4f776d8aec4c5fe16b29971acf25bef36b42",
  "text": " And he wrote  poetry. He wrote what I have just said.'       'He did  not make it up,' said Strider. 'It  is pan of the lay  that is  called The Fall of Gil-galad, which is in an ancient tongue. Bilbo must have  translated it. I never knew that.'       'There was a lot more,' said Sam,  'all about  Mordor.  I  didn't learn  that part, it gave me the shivers I never thought I should be going that way   ####-myself!'       'Going to Mordor!' cried Pippin. 'I hope it won't come to that!'       'Do not speak that name so loudly!' said Strider.       It was  already  mid-day  when they  drew near the southern end of  the  path, and saw before them,  in the pale  clear light  of the  October sun, a   grey-green bank, leading up like a  bridge on to  the northward slope of the  hill They decided to make for the top at once,  while the daylight was broad  Concealment was no longer  possible,  and they could only hope that no enemy  or spy was observing  them. Nothing  was to be seen  moving  on the hill. If  Gandalf was anywhere about, there was no sign of him.       On the western flank  of Weathertop they  found a  sheltered hollow, at  the  bottom of which  there was  a bowl -shaped dell with grassy sides. There  they left  Sam  and Pippin with the pony and  their  packs and  luggage. The  other three went on. After half an hour's plodding climb Strider reached the  crown  of the hill; Frodo and Merry followed, tired and breathless. The last   slope had been steep and rocky.       On  the top they found,  as  Strider had said,  a wide  ring of ancient  stonework, now crumbling or covered with age-long grass. But in the centre a   cairn of broken st ones had been piled. They were blackened as  if with fire.  About them  the turf  was  burned to the roots and all within the  ring  the  grass was scorched  and shrivelled, as if flames had swept the hill-top; but  there was no sign of any living thing.       Standing upon the  rim of the ruined circle,  they saw all round  below  them a  wide  prospect,  for the most pan of  lands empty  and  featureless,   except for patches of woodland away to the  south, beyond which  they caught  here and  there  the glint of  distant water. Beneath them  on this southern  side there  ran  like  a  ribbon  the Old Road,  coming  out of the West and  winding up and down, until it faded behind a ridge of dark land to the east.  Nothing was moving on it. Following  its line eastward  with their eyes they   saw the Mountains: the nearer foothills were brown and sombre;       behind them stood taller shapes of  grey, and  behind  those again were  high white peaks glimmering among the clouds.       'Well, here we are!' said Merry. 'And very  cheerless and uninviting it  looks! There is no water and no shelter. And no sign of Gandalf. But I don't   blame him for not waiting - if he ever came here.'       'I wonder,' said Strider, looking round thoughtfully. 'Even if he was a   day or two behind us at Bree, he could have arrived here first.  He can ride   ####-very swiftly when need presses.' Suddenly he stooped and looked at the stone  on the top of the  cairn; it was flatter than the others, and  whiter, as if  it had escaped the fire. He picked it up and examined it, turning  it in his  fingers. \"This has been  handled recently,' he said.  'What do you  think of  these marks?'       On  the flat under -side Frodo saw  some scratches: 'There seems to he a   stroke, a dot, and three more strokes,' he said.       'The stroke  on the left  might  be a G-rune  with thin branches,' said  Strider. 'It might be a sign left by Gandalf, though one cannot be sure. The  scratches are fine, and they certainly look fresh. But the  marks might mean  something  quite  different, and have  nothing  to do  with us.  Rangers use  runes, and they come here sometimes.'       'What could they mean, even if Gandalf made them?' asked Merry       'I  should say,' answered Strider, 'that they stood for G3, and  were a   sign that Gandalf was here on  October the third: that is three days ago now.  It would also show that he was in a hurry and danger was at hand, so that he  had no time or  did not dare to write anything longer or plainer. If that is  so, we must be wary.'       'I wish we could  feel  sure that he made  the marks, whatever they may  mean,' said Frodo 'It would be a  great  comfort to  know that he was on the  way, in front of us or behind us.'       'Perhaps,' said  Strider. 'For myself, I believe that he was  here, and  was in danger. There have been scorching flames here; and now the light that  we saw three  nights ago in the eastern sky comes back to  my  mind. I guess  that he was attacked on this hill-top,  but with what result  I cannot tell.  He  is here no longer, and we must now look aft er ourselves and make our own  way to Rivendell, as best we can '       'How far  is  Rivendell?' asked Merry, gazing round wearily. The  world  looked wild and wide from Weathertop.       'I don't know if the Road has  ever  been measured in miles  beyond the  Forsaken Inn, a day's  journey east of Bree,' answered Strider."
}