{
  "id": "db54d61db725743e5139db38fe893daf0bf55fdc",
  "text": " Maester Pycelle said you would be thirsty.   Ned drank. His lips were parched and cracked. The water tasted sweet as honey.   The king left orders,  Vayon Poole told him when the cup was empty.  He would speak with you, my lord.    On the morrow,  Ned said.  When I am stronger.  He could not face Robert now. The dream had left him weak as a kitten.   My lord,  Poole said,  he commanded us to send you to him the moment you opened your eyes.  The steward busied himself lighting a bedside candle.  Ned cursed softly. Robert was never known for his patience.  Tell him I’m too weak to come to him. If he wishes to speak with me, I should be pleased to receive him here. I hope you wake him from a sound sleep. And summon…  He was about to say Jory when he remembered.  Summon the captain of my guard.   Alyn stepped into the bedchamber a few moments after the steward had taken his leave.  My lord.    Poole tells me it has been six days,  Ned said.  I must know how things stand.    The Kingslayer is fled the city,  Alyn told him.  The talk is he’s ridden back to Casterly Rock to join his father. The story of how Lady Catelyn took the Imp is on every lip. I have put on extra guards, if it please you.    It does,  Ned assured him.  My daughters?    They have been with you every day, my lord. Sansa prays quietly, but Arya…  He hesitated.  She has not said a word since they brought you back. She is a fierce little thing, my lord. I have never seen such anger in a girl.    Whatever happens,  Ned said,  I want my daughters kept safe. I fear this is only the beginning.    No harm will come to them, Lord Eddard,  Alyn said.  I stake my life on that.    Jory and the others…    I gave them over to the silent sisters, to be sent north to Winterfell. Jory would want to lie beside his grandfather.   It would have to be his grandfather, for Jory’s father was buried far to the south. Martyn Cassel had perished with the rest. Ned had pulled the tower down afterward, and used its bloody stones to build eight cairns upon the ridge. It was said that Rhaegar had named that place the tower of joy, but for Ned it was a bitter memory. They had been seven against three, yet only two had lived to ride away; Eddard Stark himself and the little crannogman, Howland Reed. He did not think it omened well that he should dream that dream again after so many years.   You’ve done well, Alyn,  Ned was saying when Vayon Poole returned. The steward bowed low.  His Grace is without, my lord, and the queen with him.   Ned pushed himself up higher, wincing as his leg trembled with pain. He had not expected Cersei to come. It did not bode well that she had.  Send them in, and leave us. What we have to say should not go beyond these walls.  Poole withdrew quietly.  Robert had taken time to dress. He wore a black velvet doublet with the crowned stag of Baratheon worked upon the breast in golden thread, and a golden mantle with a cloak of black and gold squares. A flagon of wine was in his hand, his face already flushed from drink. Cersei Lannister entered behind him, a jeweled tiara in her hair.   Your Grace,  Ned said.  Your pardons. I cannot rise.    No matter,  the king said gruffly.  Some wine? From the Arbor. A good vintage.    A small cup,  Ned said.  My head is still heavy from the milk of the poppy.    A man in your place should count himself fortunate that his head is still on his shoulders,  the queen declared.   Quiet, woman,  Robert snapped. He brought Ned a cup of wine.  Does the leg still pain you?    Some,  Ned said. His head was swimming, but it would not do to admit to weakness in front of the queen.   Pycelle swears it will heal clean.  Robert frowned.  I take it you know what Catelyn has done?    I do.  Ned took a small swallow of wine.  My lady wife is blameless, Your Grace. All she did she did at my command.    I am not pleased, Ned,  Robert grumbled.   By what right do you dare lay hands on my blood?  Cersei demanded.  Who do you think you are?    The Hand of the King,  Ned told her with icy courtesy.  Charged by your own lord husband to keep the king’s peace and enforce the king’s justice.    You were the Hand,  Cersei began,  but now—    Silence!  the king roared.  You asked him a question and he answered it.  Cersei subsided, cold with anger, and Robert turned back to Ned.  Keep the king’s peace, you say. Is this how you keep my peace, Ned? Seven men are dead…    Eight,  the queen corrected.  Tregar died this morning, of the blow Lord Stark gave him.    Abductions on the kingsroad and drunken slaughter in my streets,  the king said.  I will not have it, Ned.    Catelyn had good reason for taking the Imp—    I said, I will not have it! To hell with her reasons. You will command her to release the dwarf at once, and you will make your peace with Jaime.    Three of my men were butchered before my eyes, because Jaime Lannister wished to chasten me. Am I to forget that?    My brother was not the cause of this quarrel,  Cersei told the king.  Lord Stark was returning drunk from a brothel."
}