{
  "id": "deab619869affe78116240c9a1816ba7dd3bbeb9",
  "text": " Grenn hotly denied it until he realized what he was saying. He was stocky and thick-necked and strong—Ser Alliser Thorne had called him  Aurochs,  the same way he called Sam  Ser Piggy  and Jon  Lord Snow —but he had always treated Sam nice enough. That was only because of Jon, though. If it weren’t for Jon, none of them would have liked me. And now Jon was gone, lost in the Skirling Pass with Qhorin Halfhand, most likely dead. Sam would have cried for him, but those tears would only freeze as well, and he could scarcely keep his eyes open now.  A tall brother with a torch stopped beside them, and for a wonderful moment Sam felt the warmth on his face.  Leave him,  the man said to Grenn.  If they can’t walk, they’re done. Save your strength for yourself, Grenn.    He’ll get up,  Grenn replied.  He only needs a hand.   The man moved on, taking the blessed warmth with him. Grenn tried to pull Sam to his feet.  That hurts,  he complained.  Stop it. Grenn, you’re hurting my arm. Stop it.    You’re too bloody heavy.  Grenn jammed his hands into Sam’s armpits, gave a grunt, and hauled him upright. But the moment he let go, the fat boy sat back down in the snow. Grenn kicked him, a solid thump that cracked the crust of snow around his boot and sent it flying everywhere.  Get up!  He kicked him again.  Get up and walk. You have to walk.   Sam fell over sideways, curling up into a tight ball to protect himself from the kicks. He hardly felt them through all his wool and leather and mail, but even so, they hurt. I thought Grenn was my friend. You shouldn’t kick your friends. Why won’t they let me be? I just need to rest, that’s all, to rest and sleep some, and maybe die a little.   If you take the torch, I can take the fat boy.   Suddenly he was jerked up into the cold air, away from his sweet soft snow; he was floating. There was an arm under his knees, and another one under his back. Sam raised his head and blinked. A face loomed close, a broad brutal face with a flat nose and small dark eyes and a thicket of coarse brown beard. He had seen the face before, but it took him a moment to remember. Paul. Small Paul. Melting ice ran down into his eyes from the heat of the torch.  Can you carry him?  he heard Grenn ask.   I carried a calf once was heavier than him. I carried him down to his mother so he could get a drink of milk.   Sam’s head bobbed up and down with every step that Small Paul took.  Stop it,  he muttered,  put me down, I’m not a baby. I’m a man of the Night’s Watch.  He sobbed.  Just let me die.    Be quiet, Sam,  said Grenn.  Save your strength. Think about your sisters and brother. Maester Aemon. Your favorite foods. Sing a song if you like.    Aloud?    In your head.   Sam knew a hundred songs, but when he tried to think of one he couldn’t. The words had all gone from his head. He sobbed again and said,  I don’t know any songs, Grenn. I did know some, but now I don’t.    Yes you do,  said Grenn.  How about ‘The Bear and the Maiden Fair’ everybody knows that one. A bear there was, a bear, a bear! All black and brown and covered with hair!    No, not that one,  Sam pleaded. The bear that had come up the Fist had no hair left on its rotted flesh. He didn’t want to think about bears.  No songs. Please, Grenn.    Think about your ravens, then.    They were never mine.  They were the Lord Commander’s ravens, the ravens of the Night’s Watch.  They belonged to Castle Black and the Shadow Tower.   Small Paul frowned.  Chett said I could have the Old Bear’s raven, the one that talks. I saved food for it and everything.  He shook his head.  I forgot, though. I left the food where I hid it.  He plodded onward, pale white breath coming from his mouth with every step, then suddenly said,  Could I have one of your ravens? Just the one. I’d never let Lark eat it.    They’re gone,  said Sam.  I’m sorry.  So sorry.  They’re flying back to the Wall now.  He had set the birds free when he’d heard the warhorns sound once more, calling the Watch to horse. Two short blasts and a long one, that was the call to mount up. But there was no reason to mount, unless to abandon the Fist, and that meant the battle was lost. The fear bit him so strong then that it was all Sam could do to open the cages. Only as he watched the last raven flap up into the snowstorm did he realize that he had forgotten to send any of the messages he’d written.   No,  he’d squealed,  oh, no, oh, no.  The snow fell and the horns blew; ahooo ahooo ahooooooooooooooooooo, they cried, to horse, to horse, to horse. Sam saw two ravens perched on a rock and ran after them, but the birds flapped off lazily through the swirling snow, in opposite directions. He chased one, his breath puffing out his nose in thick white clouds, stumbled, and found himself ten feet from the ringwall.  After that… he remembered the dead coming over the stones with arrows in their faces and through their throats. Some were all in ringmail and some were almost naked… wildlings, most of them, but a few wore faded blacks."
}