{
  "id": "df99c2d2e37b4b62500323cf9082514122e62ce7",
  "text": " There were sweet cakes to eat and honeyed wine to drink, there was singing and dancing, and everyone was warm. When the feast was done he went up to sleep; not to the lord’s bedchamber where his mother and father lived but to the room he had once shared with his sisters. Only instead of his sisters it was Gilly waiting in the huge soft bed, wearing nothing but a big shaggy fur, milk leaking from her breasts.  He woke suddenly, in cold and dread.  The fire had burned down to smouldering red embers. The air itself seemed frozen, it was so cold. In the corner the garron was whinnying and kicking the logs with her hind legs. Gilly sat beside the fire, hugging her babe. Sam sat up groggy, his breath puffing pale from his open mouth. The longball was dark with shadows, black and blacker. The hair on his arms was standing up.  It’s nothing, he told himself. I’m cold, that’s all.  Then, by the door, one of the shadows moved. A big one.  This is still a dream, Sam prayed. Oh, make it that I’m still asleep, make it a nightmare. He’s dead, he’s dead, I saw him die.  He’s come for the babe,  Gilly wept.  He smells him. A babe fresh-born stinks o’ life. He’s come for the life.   The huge dark shape stooped under the lintel, into the hall, and shambled toward them. In the dim light of the fire, the shadow became Small Paul.   Go away,  Sam croaked.  We don’t want you here.   Paul’s hands were coal, his face was milk, his eyes shone a bitter blue. Hoarfrost whitened his beard, and on one shoulder hunched a raven, pecking at his cheek, eating the dead white flesh. Sam’s bladder let go, and he felt the warmth running down his legs.  Gilly, calm the horse and lead her out. You do that.    You—  she started.   I have the knife. The dragonglass dagger.  He fumbled it out as he got to his feet. He’d given the first knife to Grenn, but thankfully he’d remembered to take Lord Mormont’s dagger before fleeing Craster’s Keep. He clutched it tight, moving away from the fire, away from Gilly and the babe.  Paul?  He meant to sound brave, but it came out in a squeak.  Small Paul. Do you know me? I’m Sam, fat Sam, Sam the Scared, you saved me in the woods. You carried me when I couldn’t walk another step. No one else could have done that, but you did.  Sam backed away, knife in hand, sniveling. I am such a coward.  Don’t hurt us, Paul. Please. Why would you want to hurt us?   Gilly scrabbled backward across the hard dirt floor. The wight turned his head to look at her, but Sam shouted  NO!  and he turned back. The raven on his shoulder ripped a strip of flesh from his pale ruined cheek. Sam held the dagger before him, breathing like a blacksmith’s bellows. Across the longhall, Gilly reached the garron. Gods give me courage, Sam prayed. For once, give me a little courage. Just long enough for her to get away.  Small Paul moved toward him. Sam backed off until he came up against a rough log wall. He clutched the dagger with both hands to hold it steady. The wight did not seem to fear the dragonglass. Perhaps he did not know what it was. He moved slowly, but Small Paul had never been quick even when he’d been alive. Behind him, Gilly murmured to calm the garron and tried to urge it toward the door. But the horse must have caught a whiff of the wight’s queer cold scent. Suddenly she balked, rearing, her hooves lashing at the frosty air. Paul swung toward the sound, and seemed to lose all interest in Sam.  There was no time to think or pray or be afraid. Samwell Tarly threw himself forward and plunged the dagger down into Small Paul’s back. Half-turned, the wight never saw him coming. The raven gave a shriek and took to the air.  You’re dead!  Sam screamed as he stabbed.  You’re dead, you’re dead.  He stabbed and screamed, again and again, tearing huge rents in Paul’s heavy black cloak. Shards of dragonglass flew everywhere as the blade shattered on the iron mail beneath the wool.  Sam’s wail made a white mist in the black air. He dropped the useless hilt and took a hasty step backwards as Small Paul twisted around. Before he could get out his other knife, the steel knife that every brother carried, the wight’s black hands locked beneath his chins. Paul’s fingers were so cold they seemed to burn. They burrowed deep into the soft flesh of Sam’s throat. Run, Gilly, run, he wanted to scream, but when he opened his mouth only a choking sound emerged.  His fumbling fingers finally found the dagger, but when he slammed it up into the wight’s belly the point skidded off the iron links, and the blade went spinning from Sam’s hand. Small Paul’s fingers tightened inexorably, and began to twist. He’s going to rip my head off, Sam thought in despair. His throat felt frozen, his lungs on fire. He punched and pulled at the wight’s wrists, to no avail. He kicked Paul between the legs, uselessly. The world shrank to two blue stars, a terrible crushing pain, and a cold so fierce that his tears froze over his eyes. Sam squirmed and pulled, desperate… and then he lurched forward."
}