{
  "id": "e014d7ac2351bb29efe1dcb26d4723fa88d031d4",
  "text": " \"Er - well. . .\" said Bagman, looking suddenly nervous.  \"They ... er ... they're looking for Barty Crouch.\" \"Why are they looking for him here?\" said Harry.  \"He's at the Ministry in London, isn't he?\" \"Er ... as a matter of fact, I've no idea where he is,\" said Bagman.  \"He's sort of... stopped coming to work.  Been absent for a couple of weeks now.  Young Percy, his assistant, says he's ill.  Apparently he's just been sending instructions in by owl.  But would you mind not mentioning that to anyone.  Harry?  Because Rita Skeeter's still poking around everywhere she can, and I'm willing to bet she'd work up Bartys illness into something sinister.  Probably say he's gone missing like Bertha Jorkins.\" \"Have you heard anything about Bertha Jorkins?\" Harry asked. \"No,\" said Bagman, looking strained again. \"I've got people looking, of course ...\" (About time, thought Harry) \"and it's all very strange.  She definitely arrived in Albania, because she met her second cousin there.  And then she left the cousin's house to go south and see an aunt. . . and she seems to have vanished without trace en route.  Blowed if I can see where she's got to ... she doesn't seem the type to elope, for instance . . . but still. . . . What are we doing, talking about goblins and Bertha Jorkins?  I really wanted to ask you\" - he lowered his voice - \"how are you getting on with your golden egg?\" \"Er . . . not bad,\" Harry said untruthfully. Bagman seemed to know he wasn't being honest. \"Listen, Harry,\" he said (still in a very low voice), \"I feel very bad about all this . . . you were thrown into this tournament, you didn't volunteer for it... and if. . .\" (his voice was so quiet now, Harry had to lean closer to listen) \"if I can help at all... a prod in the right direction . . . I've taken a liking to you . . . the way you got past that dragon! . . . well, just say the word.\" Harry stared up into Bagman's round, rosy face and his wide, baby-blue eyes. \"We're supposed to work out the clues alone, aren't we?\" he said, careful to keep his voice casual and not sound as though he was accusing the head of the Department of Magical Games and Sports of breaking the rules. \"Well. . . well, yes,\" said Bagman impatiently, \"but - come on. Harry - we all want a Hogwarts victory, don't we?\" \"Have you offered Cedric help?\" Harry said. The smallest of frowns creased Bagman's smooth face.  \"No, I haven't,\" he said. \"I - well, like I say, I've taken a liking to you.  Just thought I'd offer ...\" \"Well, thanks,\" said Harry, \"but I think I'm nearly there with the egg . . . couple more days should crack it.\" He wasn't entirely sure why he was refusing Bagman's help, except that Bagman was almost a stranger to him, and accepting his assistance would feel somehow much more like cheating than asking advice from Ron, Hermione, or Sirius. Bagman looked almost affronted, but couldn't say much more as Fred and George turned up at that point. \"Hello, Mr. Bagman,\" said Fred brightly. \"Can we buy you a drink?\" \"Er . . . no,\" said Bagman, with a last disappointed glance at Harry, \"no, thank you, boys ...\" Fred and George looked quite as disappointed as Bagman, who was surveying Harry as though he had let him down badly. \"Well, I must dash,\" he said. \"Nice seeing you all. Good luck, Harry.\" He hurried out of the pub.  The goblins all slid off their chairs and exited after him. Harry went to rejoin Ron and Hermione.   \"What did he want?\" Ron said, the moment Harry had sat down. \"He offered to help me with the golden egg,\" said Harry. \"He shouldn't be doing that!\" said Hermione, looking very shocked.  \"He's one of the judges!  And anyway, you've already worked it out - haven't you?\" \"Er . . . nearly,\" said Harry. \"Well, I don't think Dumbledore would like it if he knew Bagman was trying to persuade you to cheat!\"  said Hermione, still looking deeply disapproving.  \"I hope he's trying to help Cedric as much!\" \"He's not, I asked,\" said Harry. \"Who cares if Diggorys getting help?\" said Ron. Harry privately agreed. \"Those goblins didn't look very friendly,\" said Hermione, sipping her butterbeer.  \"What were they doing here?\" \"Looking for Crouch, according to Bagman,\" said Harry. \"He's still ill. Hasn't been into work.\" \"Maybe Percys poisoning him,\" said Ron. \"Probably thinks if Crouch snuffs it he'll be made head of the Department of International Magical Cooperation.\" Hermione gave Ron a don't-joke-about-things-like-that look, and said, \"Funny, goblins looking for Mr. Crouch. . . . They'd normally deal with the Department for the Regulation and Control of Magical Creatures.\" \"Crouch can speak loads of different languages, though,\" said Harry. \"Maybe they need an interpreter.\" \"Worrying about poor 'ickle goblins, now, are you?\"  Ron asked Hermione.  \"Thinking of starting up S.P.U.G. or something?  Society for the Protection of Ugly Goblins?\" \"Ha, ha, ha,\" said Hermione sarcastically.  \"Goblins don't need protection.  Haven't you been listening to what Professor Binns has been telling us about goblin rebellions?\" \"No,\" said Harry and Ron together."
}