{
  "id": "e05f18c3de375abed2d5d95c207119802de9a830",
  "text": " Does as he’s told, and never a word afterward.  He cut a slice off the cheese.  This is fine. Sharp. Give me a good sharp knife and a good sharp cheese and I’m a happy man.   Tyrion shrugged.  Enjoy it while you can. With the riverlands in flame and Renly king in Highgarden, good cheese will soon be hard to come by. So who sent you after the whore’s bastard?   Lord Janos gave Tyrion a wary look, then laughed and wagged a wedge of cheese at him.  You’re a sly one, Tyrion. Thought you could trick me, did you? it takes more than wine and cheese to make Janos Slynt tell more than he should. I pride myself. Never a question, and never a word afterward, not with me.    As with Deem.    Just the same. You make him your Commander when I’m off to Harrenhal, and you won’t regret it.   Tyrion broke off a nibble of the cheese. It was sharp indeed, and veined with wine; very choice.  Whoever the king names will not have an easy time stepping into your armor, I can tell. Lord Mormont faces the same problem.   Lord Janos looked puzzled.  I thought she was a lady. Mormont. Beds down with bears, that’s the one?    It was her brother I was speaking of. Jeor Mormont, the Lord Commander of the Night’s Watch. When I was visiting with him on the Wall, he mentioned how concerned he was about finding a good man to take his place. The Watch gets so few good men these days.  Tyrion grinned.  He’d sleep easier if he had a man like you, I imagine. Or the valiant Allar Deem.   Lord Janos roared.  Small chance of that!    One would think,  Tyrion said,  but life does take queer turns. Consider Eddard Stark, my lord. I don’t suppose he ever imagined his life would end on the steps of Baelor’s Sept.    There were damn few as did,  Lord Janos allowed, chuckling.  Tyrion chuckled too.  A pity I wasn’t here to see it. They say even Varys was surprised.   Lord Janos laughed so hard his gut shook.  The Spider,  he said.  Knows everything, they say. Well, he didn’t know that.    How could he?  Tyrion put the first hint of a chill in his tone.  He had helped persuade my sister that Stark should be pardoned, on the condition that he take the black.    Eh?  Janos Slynt blinked vaguely at Tyrion.   My sister Cersei,  Tyrion repeated, a shade more strongly, in case the fool had some doubt who he meant.  The Queen Regent.    Yes.  Slynt took a swallow.  As to that, well… the king commanded it, m’lord. The king himself.    The king is thirteen,  Tyrion reminded him.   Still. He is the king.  Slynt’s jowls quivered when he frowned.  The Lord of the Seven Kingdoms.    Well, one or two of them, at least,  Tyrion said with a sour smile.  Might I have a look at your spear?    My spear?  Lord Janos blinked in confusion.  Tyrion pointed.  The clasp that fastens your cape.   Hesitantly, Lord Janos drew out the ornament and handed it to Tyrion.   We have goldsmiths in Lannisport who do better work,  he opined.  The red enamel blood is a shade much, if you don’t mind my saying. Tell me, my lord, did you drive the spear into the man’s back yourself, or did you only give the command?    I gave the command, and I’d give it again. Lord Stark was a traitor.  The bald spot in the middle of Slynt’s head was beet-red, and his cloth-of-gold cape had slithered off his shoulders onto the floor.  The man tried to buy me.    Little dreaming that you had already been sold.   Slynt slammed down his wine cup.  Are you drunk? If you think I will sit here and have my honor questioned…    What honor is that? I do admit, you made a better bargain than Ser Jacelyn. A lordship and a castle for a spear thrust in the back, and you didn’t even need to thrust the spear.  He tossed the golden ornament back to Janos Slynt. It bounced off his chest and clattered to the floor as the man rose.   I mislike the tone of your voice, my lo—Imp. I am the Lord of Harrenhal and a member of the king’s council, who are you to chastise me like this?   Tyrion cocked his head sideways.  I think you know quite well who I am. How many sons do you have?    What are my sons to you, dwarf?    Dwarf?  His anger flashed.  You should have stopped at Imp. I am Tyrion of House Lannister, and someday, if you have the sense the gods gave a sea slug, you will drop to your knees in thanks that it was me you had to deal with, and not my lord father. Now, how many sons do you have?   Tyrion could see the sudden fear in Janos Slynt’s eyes.  Th—three, m’lord. And a daughter. Please, m’lord—    You need not beg.  He slid off his chair.  You have my word, no harm will come to them. The younger boys will be fostered out as squires. If they serve well and loyally, they may be knights in time. Let it never be said that House Lannister does not reward those who serve it. Your eldest son will inherit the title Lord Slynt, and this appalling sigil of yours.  He kicked at the little golden spear and sent it skittering across the floor.  Lands will be found for him, and he can build a seat for himself. It will not be Harrenhal, but it will be sufficient."
}