{
  "id": "e0e51e95220cc63715c52aa5d6f642207058eee4",
  "text": "       'Bill Ferny,' said Merry, 'if you don't open that gate in ten  seconds,   you'll regret it. I shall set steel  to you, if you don't obey. And when you   have opened the gates you will go  through  them and never return. You are a  ruffian and a highway-robber.'       Bill  Ferny flinched and shuffled to the gate and unlocked it. 'Give me  the key!' said Merry. But  the ruffian flung it  at his head and then darted  out into the darkness. As he  passed the ponies one of them let fly with his  heels  and just caught him as he ran. He went off with a yelp into the night  and was never heard of again.       'Neat work, Bill,' said Sam, meaning the pony.       'So much for your  Big Man,' said Merry. 'We'll see the Chief later. In  the meantime we want a lodging for the night, and as you seem to have pulled  down the Bridge Inn and built  this dismal place instead, you'll have to put  us up.'       'I am sorry, Mr. Merry,' said Hob, 'but it isn't allowed.'       'What isn't allowed?'       Taking in folk off-hand like and eating extra food, and  all that, said  Hob.       'What's the  matter  with the place?'  said Merry. 'Has it  been a  bad   ####-year, or what? I thought it had been a fine summer and harvest.'       'Well no, the year's been good enough,'  said  Hob. 'We grows a lot  of  food,  but  we  don't  rightly  know what  becomes  of  it.  It's all  these  \"gatherers\" and \"sharers\", I reckon, going round counting and measuring  and  taking off to storage. They do more gathering than sharing, and we never see  most of the stuff again.'       'Oh  come!' said  Pippin yawning.  'This  is all too  tiresome  for  me  tonight.  We've  got food in our bags.  Just give  us a room to lie down in.  It'll be better than many places I have seen.'       The hobbits at the gate still seemed ill  at  ease, evidently some rule  or other was being broken;  but there was no gainsaying four such  masterful  travellers, all armed, and two of them uncommonly  large and strong-looking.  Frodo ordered the gates to be locked again. There was some sense at any rate  in  keeping  a  guard,  while  ruffians  were  still about.  Then  the  four  companions   went  into  the  hobbit  guard-house  and  made  themselves  as  comfortable as they  could. It was a bare and ugly place, with a mean little  grate that would not allow a good fire. In the upper  rooms were little rows  of  hard  beds, and on every wall  there was  a notice and a list  of Rules.  Pippin tore them down. There was no beer and very little food, but with what  the travellers brought and shared out they all made a  fair meal; and Pippin  broke Rule 4 by putting most of next day's allowance of wood on the fire.       'Well now,  what  about a  smoke,  while  you tell  us  what  has  been  happening in the Shire?' he said.       'There isn't  no pipe-weed  now,' said  Hob; 'at  least  only  for  the  Chief's  men. All the stocks seem to have gone. We do hear that waggon-loads  of  it went away down the  old road out of the Southfarthing, over Sarn Ford  way. That would  be the end  o' last year, after you left.  But it  had been  going away quietly before that, in a small way. That Lotho--'       'Now you  shut up, Hob Hayward!' cried several of the others. 'You know  talk o' that sor t isn't allowed. The Chief will hear of it, and we'll all be  in trouble.'       'He wouldn't hear naught, if some of you here weren't sneaks,' rejoined  Hob hotly.       'All right, all right!' said Sam. \"That's quite enough. I don't want to  hear no more. No welcome, no beer, no smoke, and a lot of rules and orc-talk  instead.  I  hoped  to have a rest, but I can see there's work  and  trouble  ahead. Let's sleep and forget it till morning!'   ####-     The new  'Chief' evidently had  means of getting news. It  was  a  good  forty miles from  the Bridge to Bag End,  but someone made the journey  in a  hurry. So Frodo and his friends soon discovered.       They had not made any definite plans, but  had vaguely thought of going   down to Crickhollow together first, and resting there a bit. But now, seeing  what things  were like, they decided to go straight to Hobbiton. So the next  day they  set out  along  the Road and jogged  along  steadily. The wind had  dropped but the sky was grey. The land looked rather sad and forlorn; bu t it  was after all the first of  November and the fag-end of Autumn. Still  there  seemed  an unusual  amount of burning  going  on, and  smoke rose  from many  points  round  about.  A great cloud of  it  was  going up  far  away in the  direction of the Woody End.       As evening fell they were  drawing near to  Frogmorton, a village right  on the Road, about  twenty -two  miles  from the Bridge. There  they meant to  stay  the night; The Floating Log at  Frogmorton was a good inn. But as they   came to the  east  end of the village they met a barrier with  a large  board  saying NO ROAD; and behind it stood a large band of Shirriffs with staves in  their hands  and  feathers in their caps,  looking both important and rather   scared."
}