{
  "id": "e2d7ef58dcd0cec84f735c5fbc089383d57fea43",
  "text": "  It was Nearly Headless Nick, no longer pearly-white and transparent, but black and smoky, floating immobile and horizontal, six inches off the floor. His head was half off and his face wore an expression of shock identical to Justin's.  Harry got to his feet, his breathing fast and shallow, his heart doing a kind of drumroll against his ribs. He looked wildly up and down the deserted corridor and saw a line of spiders scuttling as fast as they could away from the bodies. The only sounds were the muffled voices of teachers from the classes on either side.  He could run, and no one would ever know he had been there. But he couldn't just leave them lying here .... He had to get help .... Would anyone believe he hadn't had anything to do with this?  As he stood there, panicking, a door right next to him opened with a bang. Peeves the Poltergeist came shooting out.  \"Why, it's potty wee Potter!\" cackled Peeves, knocking Harry's glasses askew as he bounced past him. \"What's Potter up to? Why's Potter lurking -\"  *202*  Peeves stopped, halfway through a midair somersault. Upside down, he spotted Justin and Nearly Headless Nick. He flipped the right way up, filled his lungs and, before Harry could stop him, screamed, \"ATTACK! ATTACK! ANOTHER ATTACK! NO MORTAL OR GHOST IS SAFE! RUN FOR YOUR LIVES! ATTAAAACK!\"  Crash - crash - crash - door after door flew open along the corridor and people flooded out. For several long minutes, there was a scene of such confusion that Justin was in danger of being squashed and people kept standing in Nearly Headless Nick. Harry found himself pinned against the wall as the teachers shouted for quiet. Professor McGonagall came running, followed by her own class, one of whom still had black-and-white-striped hair. She used her wand to set off aloud bang, which restored silence, and ordered everyone back into their classes. No sooner had the scene cleared somewhat than Ernie the Hufflepuff arrived, panting, on the scene.  \"Caught in the act!\" Ernie yelled, his face stark white, pointing his finger dramatically at Harry.  \"That will do, Macmillan!\" said Professor McGonagall sharply.  Peeves was bobbing overhead, now grinning wickedly, surveying the scene; Peeves always loved chaos. As the teachers bent over Justin and Nearly Headless Nick, examining them, Peeves broke into song:  \"Oh, Potter, you rotter, oh, what have you done, You're killing off' students, you think it's good fun -\"  \"That's enough Peeves!\" barked Professor McGonagall, and Peeves zoomed away backward, with his tongue out at Harry.  *203*  Justin was carried up to the hospital wing by Professor Flitwick and Professor Sinistra of the Astronomy department, but nobody seemed to know what to do for Nearly Headless Nick. In the end, Professor McGonagall conjured a large fan out of thin air, which she gave to Ernie with instructions to waft Nearly Headless Nick up the stairs. This Ernie did, fanning Nick along like a silent black hovercraft. This left Harry and Professor McGonagall alone together.  \"This way, Potter,\" she said.  \"Professor,\" said Harry at once, \"I swear I didn't -\"  \"This is out of my hands, Potter,\" said Professor McGonagall curtly.  They marched in silence around a corner and she stopped before a large and extremely ugly stone gargoyle.  \"Lemon drop!\" she said. This was evidently a password, because the gargoyle sprang suddenly to life and hopped aside as the wall behind him split in two. Even full of dread for what was coming, Harry couldn't fail to be amazed. Behind the wall was a spiral staircase that was moving smoothly upward, like an escalator. As he and Professor McGonagall stepped onto it, Harry heard the wall thud closed behind them. They rose upward in circles, higher and higher, until at last, slightly dizzy, Harry saw a gleaming oak door ahead, with a brass knocker in the shape of a griffin.  He knew now where he was being taken. This must be where Dumbledore lived.  *204*  C I3 A P T V RR T W E I V  THE POLYJUICE POTION  hey stepped off the stone staircase at the top, and Professor McGonagall rapped on the door. It opened silently and they entered. Professor McGonagall told Harry to wait and left him there, alone.  Harry looked around. One thing was certain: of all the teachers' offices Harry had visited so far this year, Dumbledore's was by far the most interesting. If he hadn't been scared out of his wits that he was about to be thrown out of school, he would have been very pleased to have a chance to look around it.  It was a large and beautiful circular room, full of funny little noises. A number of curious silver instruments stood on spindlelegged tables, whirring and emitting little puffs of smoke. The walls were covered with portraits of old headmasters and headmistresses, all of whom were snoozing gently in their frames. There was also an enormous, claw-footed desk, and, sitting on a shelf behind it, a shabby, tattered wizard's hat - the Sorting Hat.  *205*    Harry hesitated. He cast a wary eye around the sleeping witches and wizards on the walls."
}