{
  "id": "e82017b16ad71d0aeb3293dcca1b2eefa0b2369b",
  "text": " \"So yeh haven't noticed anythin' strange?\"  Yet again, Ronan took a while to answer. At last, he said, \"The forest hides many secrets.\"  A movement in the trees behind Ronan made Hagrid raise his bow again, but it was only a second centaur, black-haired and -bodied and wilder-looking than Ronan.  \"Hullo, Bane,\" said Hagrid. \"All right?\"  \"Good evening, Hagrid, I hope you are well?\"  \"Well enough. Look, I've jus' bin askin' Ronan, you seen anythin' odd in here lately? There's a unicorn bin injured -- would yeh know anythin' about it?\"  Bane walked over to stand next to Ronan. He looked skyward. \"Mars is bright tonight,\" he said simply.  \"We've heard,\" said Hagrid grumpily. \"Well, if either of you do see anythin', let me know, won't yeh? We'll be off, then.\"  Harry and Hermione followed him out of the clearing, staring over their shoulders at Ronan and Bane until the trees blocked their view.  \"Never,\" said Hagrid irritably, \"try an' get a straight answer out of a centaur. Ruddy stargazers. Not interested in anythin' closer'n the moon.\"  \"Are there many of them in here?\" asked Hermione.  \"Oh, a fair few... Keep themselves to themselves mostly, but they're good enough about turnin' up if ever I want a word. They're deep, mind, centaurs... they know things... jus' don' let on much.\"  \"D'you think that was a centaur we heard earlier?\" said Harry.  \"Did that sound like hooves to you? Nah, if yeh ask me, that was what's bin killin' the unicorns -- never heard anythin' like it before.\"  They walked on through the dense, dark trees. Harry kept looking nervously over his shoulder. He had the nasty feeling they were being watched. He was very glad they had Hagrid and his crossbow with them. They had just passed a bend in the path when Hermione grabbed Hagrid's arm.  \"Hagrid! Look! Red sparks, the others are in trouble!\"  \"You two wait here!\" Hagrid shouted. \"Stay on the path, I'll come back for yeh!\"  They heard him crashing away through the undergrowth and stood looking at each other, very scared, until they couldn't hear anything but the rustling of leaves around them.  \"You don't think they've been hurt, do you?\" whispered Hermione.  \"I don't care if Malfoy has, but if something's got Neville... it's our fault he's here in the first place.\"  The minutes dragged by. Their ears seemed sharper than usual. Harry's seemed to be picking up every sigh of the wind, every cracking twig. What was going on? Where were the others?  At last, a great crunching noise announced Hagrid's return. Malfoy, Neville, and Fang were with him. Hagrid was fuming. Malfoy, it seemed, had sneaked up behind Neville and grabbed him as a joke. Neville had panicked and sent up the sparks.  \"We'll be lucky ter catch anythin' now, with the racket you two were makin'. Right, we're changin' groups -- Neville, you stay with me an' Hermione, Harry, you go with Fang an' this idiot. I'm sorry,\" Hagrid added in a whisper to Harry, \"but he'll have a harder time frightenin' you, an' we've gotta get this done.\"  So Harry set off into the heart of the forest with Malfoy and Fang. They walked for nearly half an hour, deeper and deeper into the forest, until the path became almost impossible to follow because the trees were so thick. Harry thought the blood seemed to be getting thicker. There were splashes on the roots of a tree, as though the poor creature had been thrashing around in pain close by. Harry could see a clearing ahead, through the tangled branches of an ancient oak.  \"Look --\" he murmured, holding out his arm to stop Malfoy.  Something bright white was gleaming on the ground. They inched closer.  It was the unicorn all right, and it was dead. Harry had never seen anything so beautiful and sad. Its long, slender legs were stuck out at odd angles where it had fallen and its mane was spread pearly-white on the dark leaves.  Harry had taken one step toward it when a slithering sound made him freeze where he stood. A bush on the edge of the clearing quivered.... Then, out of the shadows, a hooded figure came crawling across the ground like some stalking beast. Harry, Malfoy, and Fang stood transfixed. The cloaked figure reached the unicorn, lowered its head over the wound in the animal's side, and began to drink its blood.  \"AAAAAAAAAARGH!\"  Malfoy let out a terrible scream and bolted -- so did Fang. The hooded figure raised its head and looked right at Harry -- unicorn blood was dribbling down its front. It got to its feet and came swiftly toward Harry -- he couldn't move for fear.  Then a pain like he'd never felt before pierced his head; it was as though his scar were on fire. Half blinded, he staggered backward. He heard hooves behind him, galloping, and something jumped clean over Harry, charging at the figure.  The pain in Harry's head was so bad he fell to his knees. It took a minute or two to pass. When he looked up, the figure had gone. A centaur was standing over him, not Ronan or Bane; this one looked younger; he had white-blond hair and a palomino body."
}