{
  "id": "e99ad624f4c4aa2fdd4c44b8441511cd8f19f770",
  "text": " I saved that bloody crown for him. Tyrion shifted his weight uncomfortably from one foot to the other. He could not stand still. Too much wine. He should have thought to relieve himself before they set out from the Red Keep. The sleepless night he’d spent with Shae was making itself felt too, but most of all he wanted to strangle his bloody royal nephew.  I am no stranger to Valyrian steel, the boy had boasted. The septons were always going on about how the Father Above judges us all. If the Father would be so good as to topple over and crush Joff like a dung beetle, I might even believe it.  He ought to have seen it long ago. Jaime would never send another man to do his killing, and Cersei was too cunning to use a knife that could be traced back to her, but Joff, arrogant vicious stupid little wretch that he was…  He remembered a cold morning when he’d climbed down the steep exterior steps from Winterfell’s library to find Prince Joffrey jesting with the Hound about killing wolves. Send a dog to kill a wolf, he said. Even Joffrey was not so foolish as to command Sandor Clegane to slay a son of Eddard Stark, however; the Hound would have gone to Cersei. Instead the boy found his catspaw among the unsavory lot of freeriders, merchants, and camp followers who’d attached themselves to the king’s party as they made their way north. Some poxy lackwit willing to risk his life for a prince’s favor and a little coin. Tyrion wondered whose idea it had been to wait until Robert left Winterfell before opening Bran’s throat. Joff’s, most like. No doubt he thought it was the height of cunning.  The prince’s own dagger had a jeweled pommel and inlaid goldwork on the blade, Tyrion seemed to recall. At least Joff had not been stupid enough to use that. Instead he went poking among his father’s weapons. Robert Baratheon was a man of careless generosity, and would have given his son any dagger he wanted… but Tyrion guessed that the boy had just taken it. Robert had come to Winterfell with a long tail of knights and retainers, a huge wheelhouse, and a baggage train. No doubt some diligent servant had made certain that the king’s weapons went with him, in case he should desire any of them.  The blade Joff chose was nice and plain. No goldwork, no jewels in the hilt, no silver inlay on the blade. King Robert never wore it, had likely forgotten he owned it. Yet the Valyrian steel was deadly sharp… sharp enough to slice through skin, flesh, and muscle in one quick stroke. I am no stranger to Valyrian steel. But he had been, hadn’t he? Else he would never have been so foolish as to pick Littlefinger’s knife.  The why of it still eluded him. Simple cruelty, perhaps? His nephew had that in abundance. It was all Tyrion could do not to retch up all the wine he’d drunk, piss in his breeches, or both. He squirmed uncomfortably. He ought to have held his tongue at breakfast. The boy knows I know now. My big mouth will be the death of me, I swear it.  The seven vows were made, the seven blessings invoked, and the seven promises exchanged. When the wedding song had been sung and the challenge had gone unanswered, it was time for the exchange of cloaks. Tyrion shifted his weight from one stunted leg to the other, trying to see between his father and his uncle Kevan. If the gods are just, Joff will make a hash of this. He made certain not to look at Sansa, lest his bitterness show in his eyes. You might have knelt, damn you. Would it have been so bloody hard to bend those stiff Stark knees of yours and let me keep a little dignity?  Mace Tyrell removed his daughter’s maiden cloak tenderly, while Joffrey accepted the folded bride’s cloak from his brother Tommen and shook it out with a flourish. The boy king was as tall at thirteen as his bride was at sixteen; he would not require a fool’s back to climb upon. He draped Margaery in the crimson-and-gold and leaned close to fasten it at her throat. And that easily she passed from her father’s protection to her husband’s. But who will protect her from Joff? Tyrion glanced at the Knight of Flowers, standing with the other Kingsguard. You had best keep your sword well honed, Ser Loras.   With this kiss I pledge my love!  Joffrey declared in ringing tones. When Margaery echoed the words he pulled her close and kissed her long and deep. Rainbow lights danced once more about the High Septon’s crown as he solemnly declared Joffrey of the Houses Baratheon and Lannister and Margaery of House Tyrell to be one flesh, one heart, one soul.  Good, that’s done with. Now let’s get back to the bloody castle so I can have a piss.  Ser Loras and Ser Meryn led the procession from the sept in their white scale armor and snowy cloaks. Then came Prince Tommen, scattering rose petals from a basket before the king and queen. After the royal couple followed Queen Cersei and Lord Tyrell, then the bride’s mother arm-in-arm with Lord Tywin. The Queen of Thorns tottered after them with one hand on Ser Kevan Lannister’s arm and the other on her cane, her twin guardsmen close behind her in case she fell."
}