{
  "id": "e9a666e7febdebc4be07254ef81298c3f497414d",
  "text": " He twisted in the water to look up, but there was nothing to see but green darkness and then he spun too far and suddenly he could no longer tell up from down. Panic took hold of him. His hands flailed against the bottom of the river and sent up a cloud of mud that blinded him. His chest was growing tighter by the instant. He clawed at the water, kicking, pushing himself, turning, his lungs screaming for air, kicking, kicking, lost now in the river murk, kicking, kicking, kicking until he could kick no longer. When he opened his mouth to scream, the water came rushing in, tasting of salt, and Davos Seaworth knew that he was drowning.  The next he knew the sun was up, and he lay upon a stony strand beneath a spire of naked stone, with the empty bay all around and a broken mast, a burned sail, and a swollen corpse beside him. The mast, the sail, and the dead man vanished with the next high tide, leaving Davos alone on his rock amidst the spears of the merling king.  His long years as a smuggler had made the waters around King’s Landing more familiar to him than any home he’d ever had, and he knew his refuge was no more than a speck on the charts, in a place that honest sailors steered away from, not toward… though Davos himself had come by it once or twice in his smuggling days, the better to stay unseen. When they find me dead here, if ever they do, perhaps they will name the rock for me, he thought. Onion Rock, they’ll call it; it will be my tombstone and my legacy. He deserved no more. The Father protects his children, the septons taught, but Davos had led his boys into the fire. Dale would never give his wife the child they had prayed for, and Allard, with his girl in Oldtown and his girl in King’s Landing and his girl in Braavos, they would all be weeping soon. Matthos would never captain his own ship, as he’d dreamed. Maric would never have his knighthood.  How can I live when they are dead? So many brave knights and mighty lords have died, better men than me, and highborn. Crawl inside your cave, Davos. Crawl inside and shrink up small and the ship will go away, and no one will trouble you ever again. Sleep on your stone pillow, and let the gulls peck out your eyes while the crabs feast on your flesh. You’ve feasted on enough of them, you owe them. Hide, smuggler. Hide, and be quiet, and die.  The sail was almost on him. A few moments more, and the ship would be safely past, and he could die in peace.  His hand reached for his throat, fumbling for the small leather pouch he always wore about his neck. Inside he kept the bones of the four fingers his king had shortened for him, on the day he made Davos a knight. My luck. His shortened fingers patted at his chest, groping, finding nothing. The pouch was gone, and the fingerbones with them. Stannis could never understand why he’d kept the bones.  To remind me of my king’s justice,  he whispered through cracked lips. But now they were gone. The fire took my luck as well as my sons. In his dreams the river was still aflame and demons danced upon the waters with fiery whips in their hands, while men blackened and burned beneath the lash.  Mother, have mercy,  Davos prayed.  Save me, gentle Mother, save us all. My luck is gone, and my sons.  He was weeping freely now, salt tears streaming down his cheeks.  The fire took it all… the fire…   Perhaps it was only wind blowing against the rock, or the sound of the sea on the shore, but for an instant Davos Seaworth heard her answer.  You called the fire,  she whispered, her voice as faint as the sound of waves in a seashell, sad and soft.  You burned us… burned us… burrrned usssssss.    It was her!  Davos cried.  Mother, don’t forsake us. It was her who burned you, the red woman, Melisandre, her!  He could see her; the heart-shaped face, the red eyes, the long coppery hair, her red gowns moving like flames as she walked, a swirl of silk and satin. She had come from Asshai in the east, she had come to Dragonstone and won Selyse and her queen’s men for her alien god, and then the king, Stannis Baratheon himself. He had gone so far as to put the fiery heart on his banners, the fiery heart of R’hllor, Lord of Light and God of Flame and Shadow. At Melisandre’s urging, he had dragged the Seven from their sept at Dragonstone and burned them before the castle gates, and later he had burned the godswood at Storm’s End as well, even the heart tree, a huge white weirwood with a solemn face.   It was her work,  Davos said again, more weakly. Her work, and yours, onion knight. You rowed her into Storm’s End in the black of night, so she might loose her shadow child. You are not guiltless, no. You rode beneath her banner and flew it from your mast. You watched the Seven burn at Dragonstone, and did nothing. She gave the Father’s justice to the fire, and the Mother’s mercy, and the wisdom of the Crone. Smith and Stranger, Maid and Warrior, she burnt them all to the glory of her cruel god, and you stood and held your tongue. Even when she killed old Maester Cressen, even then, you did nothing."
}