{
  "id": "eaba7168fb855194462bed82d7be52ecbe191309",
  "text": " Ser Kevan told her she was beautiful, Jalabhar Xho said something she did not understand in the Summer Tongue, and Lord Redwyne wished her many fat children and long years of joy. And then the dance brought her face-to-face with Joffrey.  Sansa stiffened as his hand touched hers, but the king tightened his grip and drew her closer.  You shouldn’t look so sad. My uncle is an ugly little thing, but you’ll still have me.    You’re to marry Margaery!    A king can have other women. Whores. My father did. One of the Aegons did too. The third one, or the fourth. He had lots of whores and lots of bastards.  As they whirled to the music, Joff gave her a moist kiss.  My uncle will bring you to my bed whenever I command it.   Sansa shook her head.  He won’t.    He will, or I’ll have his head. That King Aegon, he had any woman he wanted, whether they were married or no.   Thankfully, it was time to change again. Her legs had turned to wood, though, and Lord Rowan, Ser Tallad, and Elinor’s squire all must have thought her a very clumsy dancer. And then she was back with Ser Garlan once more, and soon, blessedly, the dance was over.  Her relief was short-lived. No sooner had the music died than she heard Joffrey say,  It’s time to bed them! Let’s get the clothes off her, and have a look at what the she-wolf’s got to give my uncle!  Other men took up the cry, loudly.  Her dwarf husband lifted his eyes slowly from his wine cup.  I’ll have no bedding.   Joffrey seized Sansa’s arm.  You will if I command it.   The Imp slammed his dagger down in the table, where it stood quivering.  Then you’ll service your own bride with a wooden prick. I’ll geld you, I swear it.   A shocked silence fell. Sansa pulled away from Joffrey, but he had a grip on her, and her sleeve ripped. No one even seemed to hear. Queen Cersei turned to her father.  Did you hear him?   Lord Tywin rose from his seat.  I believe we can dispense with the bedding. Tyrion, I am certain you did not mean to threaten the king’s royal person.   Sansa saw a spasm of rage pass across her husband’s face.  I misspoke,  he said.  It was a bad jape, sire.    You threatened to geld me!  Joffrey said shrilly.   I did, Your Grace,  said Tyrion,  but only because I envied your royal manhood. Mine own is so small and stunted.  His face twisted into a leer.  And if you take my tongue, you will leave me no way at all to pleasure this sweet wife you gave me.   Laughter burst from the lips of Ser Osmund Kettleblack. Someone else sniggered. But Joff did not laugh, nor Lord Tywin.  Your Grace,  he said,  my son is drunk, you can see that.    I am,  the Imp confessed,  but not so drunk that I cannot attend to my own bedding.  He hopped down from the dais and grabbed Sansa roughly.  Come, wife, time to smash your portcullis. I want to play come-into-the-castle.   Red-faced, Sansa went with him from the Small Hall. What choice do I have? Tyrion waddled when he walked, especially when he walked as quickly as he did now. The gods were merciful, and neither Joffrey nor any of the others moved to follow.  For their wedding night, they had been granted the use of an airy bedchamber high in the Tower of the Hand. Tyrion kicked the door shut behind them.  There is a flagon of good Arbor gold on the sideboard, Sansa. Will you be so kind as to pour me a cup?    Is that wise, my lord?    Nothing was ever wiser. I am not truly drunk, you see. But I mean to be.   Sansa filled a goblet for each of them. It will be easier if I am drunk as well. She sat on the edge of the great curtained bed and drained half her cup in three long swallows. No doubt it was very flne wine, but she was too nervous to taste it. It made her head swim.  Would you have me undress, my lord?    Tyrion.  He cocked his head.  My name is Tyrion, Sansa.    Tyrion. My lord. Should I take off my gown, or do you want to undress me?  She took another swallow of wine.  The imp turned away from her.  The first time I wed, there was us and a drunken septon, and some pigs to bear witness. We ate one of our witnesses at our wedding feast. Tysha fed me crackling and I licked the grease off her fingers, and we were laughing when we fell into bed.    You were wed before? I… I had forgotten.    You did not forget. You never knew.    Who was she, my lord?  Sansa was curious despite herself.   Lady Tysha.  His mouth twisted.  Of House Silverfist. Their arms have one gold coin and a hundred silver, upon a bloody sheet. Ours was a very short marriage… as befits a very short man, I suppose.   Sansa stared down at her hands and said nothing.   How old are you, Sansa?  asked Tyrion, after a moment.   Thirteen,  she said,  when the moon turns.    Gods have mercy.  The dwarf took another swallow of wine.  Well, talk won’t make you older. Shall we get on with this, my lady? If it please you?    It will please me to please my lord husband.   That seemed to anger him.  You hide behind courtesy as if it were a castle wall.    Courtesy is a lady’s armor,  Sansa said."
}