{
  "id": "ec93c9af736e5fab5aea6d6f3663d84126a6fccb",
  "text": " She did not want to risk getting food or wine on the new one. I must take it with me to Highgarden. She wanted to look beautiful for Willas Tyrell. Even if Dontos was right, and it is Winterfell he wants and not me, he still may come to love me for myself. Sansa hugged herself tightly, wondering how long it would be before the gown was ready. She could scarcely wait to wear it.      Arya   The rains came and went, but there was more grey sky than blue, and all the streams were running high. On the morning of the third day, Arya noticed that the moss was growing mostly on the wrong side of the trees.  We’re going the wrong way,  she said to Gendry, as they rode past an especially mossy elm.  We’re going south. See how the moss is growing on the trunk?   He pushed thick black hair from eyes and said,  We’re following the road, that’s all. The road goes south here.   We’ve been going south all day, she wanted to tell him. And yesterday too, when we were riding along that streambed. But she hadn’t been paying close attention yesterday, so she couldn’t be certain.  I think we’re lost,  she said in a low voice.  We shouldn’t have left the river. All we had to do was follow it.    The river bends and loops,  said Gendry.  This is just a shorter way, I bet. Some secret outlaw way. Lem and Tom and them have been living here for years.   That was true. Arya bit her lip.  But the moss…    The way it’s raining, we’ll have moss growing from our ears before long,  Gendry complained.   Only from our south ear,  Arya declared stubbornly. There was no use trying to convince the Bull of anything. Still, he was the only true friend she had, now that Hot Pie had left them.   Sharna says she needs me to bake bread,  he’d told her, the day they rode.  Anyhow I’m tired of rain and saddlesores and being scared all the time. There’s ale here, and rabbit to eat, and the bread will be better when I make it. You’ll see, when you come back. You will come back, won’t you? When the war’s done?  He remembered who she was then, and added,  My lady,  reddening.  Arya didn’t know if the war would ever be done, but she had nodded.  I’m sorry I beat you that time,  she said. Hot Pie was stupid and craven, but he’d been with her all the way from King’s Landing and she’d gotten used to him.  I broke your nose.    You broke Lem’s too.  Hot Pie grinned.  That was good.    Lem didn’t think so,  Arya said glumly. Then it was time to go. When Hot Pie asked if he might kiss milady’s hand, she punched his shoulder.  Don’t call me that. You’re Hot Pie, and I’m Arry.    I’m not Hot Pie here. Sharna just calls me Boy. The same as she calls the other boy. It’s going to be confusing.   She missed him more than she thought she would, but Harwin made up for it some. She had told him about his father Hullen, and how she’d found him dying by the stables in the Red Keep, the day she fled.  He always said he’d die in a stable,  Harwin said,  but we all thought some bad-tempered stallion would be his death, not a pack of lions.  Arya told of Yoren and their escape from King’s Landing as well, and much that had happened since, but she left out the stableboy she’d stabbed with Needle, and the guard whose throat she’d cut to get out of Harrenhal. Telling Harwin would be almost like telling her father, and there were some things that she could not bear having her father know.  Nor did she speak of Jaqen H’ghar and the three deaths he’d owed and paid. The iron coin he’d given her Arya kept tucked away beneath her belt, but sometimes at night she would take it out and remember how his face had melted and changed when he ran his hand across it.  Valar morghulis,  she would say under her breath.  Ser Gregor, Dunsen, Polliver, Raff the Sweetling. The Tickler and the Hound. Ser Ilyn, Ser Meryn, Queen Cersei, King Joffrey.   Only six Winterfell men remained of the twenty her father had sent west with Beric Dondarrion, Harwin told her, and they were scattered.  It was a trap, milady. Lord Tywin sent his Mountain across the Red Fork with fire and sword, hoping to draw your lord father. He planned for Lord Eddard to come west himself to deal with Gregor Clegane. If he had he would have been killed, or taken prisoner and traded for the Imp, who was your lady mother’s captive at the time. Only the Kingslayer never knew Lord Tywin’s plan, and when he heard about his brother’s capture he attacked your father in the streets of King’s Landing.    I remember,  said Arya.  He killed Jory.  Jory had always smiled at her, when he wasn’t telling her to get from underfoot.   He killed Jory,  Harwin agreed,  and your father’s leg was broken when his horse fell on him. So Lord Eddard couldn’t go west. He sent Lord Beric instead, with twenty of his own men and twenty from Winterfell, me among them. There were others besides. Thoros and Ser Raymun Darry and their men, Ser Gladden Wylde, a lord named Lothar Mallery. But Gregor was waiting for us at the Mummer’s Ford, with men concealed on both banks."
}