{
  "id": "eed526d028d2ae37dc7a4923031209c0b244d1d9",
  "text": "    A sheepskin cloak!  said Ygritte.  And there’s many a night we dance beneath it, too!   Jarl laughed, and even Harma Dogshead smirked.  Is that the way of it, Jon Snow?  asked Mance Rayder, mildly.  Her and you?   It was easy to lose your way beyond the Wall. Jon did not know that he could tell honor from shame anymore, or right from wrong. Father forgive me.  Yes,  he said.  Mance nodded.  Good. You’ll go with Jarl and Styr on the morrow, then. Both of you. Far be it from me to separate two hearts that beat as one.    Go where?  said Jon.   Over the Wall. It’s past time you proved your faith with something more than words, Jon Snow.   The Magnar was not pleased.  What do I want with a crow?    He knows the Watch and he knows the Wall,  said Mance,  and he knows Castle Black better than any raider ever could. You’ll find a use for him, or you’re a fool.   Styr scowled.  His heart may still be black.    Then cut it out.  Mance turned to Rattleshirt.  My Lord of Bones, keep the column moving at all costs. If we reach the Wall before Mormont, we’ve won.    They’ll move.  Rattleshirt’s voice was thick and angry.  Mance nodded, and walked away, Harma and Sixskins beside him.  Varamyr’s wolves and shadowcat followed behind. Jon and Ygritte were left with Jarl, Rattleshirt, and the Magnar. The two older wildlings looked at Jon with ill-concealed rancor as Jarl said,  You heard, we ride at daybreak. Bring all the food you can, there’ll be no time to hunt. And have your face seen to, crow. You look a bloody mess.    I will,  said Jon.   You best not be lying, girl,  Rattleshirt said to Ygritte, his eyes shiny behind the giant’s skull.  Jon drew Longclaw.  Get away from us, unless you want what Qhorin got.    You got no wolf to help you here, boy.  Rattleshirt reached for his own sword.   Sure o’ that, are you?  Ygritte laughed.  Atop the stones of the ringwall, Ghost hunched with white fur bristling. He made no sound, but his dark red eyes spoke blood. The Lord of Bones moved his hand slowly away from his sword, backed off a step, and left them with a curse.  Ghost padded beside their garrons as Jon and Ygritte descended the Fist. It was not until they were halfway across the Milkwater that Jon felt safe enough to say,  I never asked you to lie for me.    I never did,  she said.  I left out part, is all.    You said—    —that we fuck beneath your cloak many a night. I never said when we started, though.  The smile she gave him was almost shy.  Find another place for Ghost to sleep tonight, Jon Snow. It’s like Mance said. Deeds is truer than words.       Sansa    A new gown?  she said, as wary as she was astonished.   More lovely than any you have worn, my lady,  the old woman promised. She measured Sansa’s hips with a length of knotted string.  All silk and Myrish lace, with satin linings. You will be very beautiful. The queen herself has commanded it.    Which queen?  Margaery was not yet Joff’s queen, but she had been Renly’s. Or did she mean the Queen of Thorns? Or…   The Queen Regent, to be sure.    Queen Cersei?    None other. She has honored me with her custom for many a year.  The old woman laid her string along the inside of Sansa’s leg.  Her Grace said to me that you are a woman now, and should not dress like a little girl. Hold out your arm.   Sansa lifted her arm. She needed a new gown, that was true. She had grown three inches in the past year, and most of her old wardrobe had been ruined by the smoke when she’d tried to burn her mattress on the day of her first flowering.   Your bosom will be as lovely as the queen’s,  the old woman said as she looped her string around Sansa’s chest.  You should not hide it so.   The comment made her blush. Yet the last time she’d gone riding, she could not lace her jerkin all the way to the top, and the stableboy gaped at her as he helped her mount. Sometimes she caught grown men looking at her chest as well, and some of her tunics were so tight she could scarce breathe in them.   What color will it be?  she asked the seamstress.   Leave the colors to me, my lady. You will be pleased, I know you will. You shall have smallclothes and hose as well, kirtles and mantles and cloaks, and all else befitting a… a lovely young lady of noble birth.    Will they be ready in time for the king’s wedding?    Oh, sooner, much sooner, Her Grace insists. I have six seamstresses and twelve apprentice girls, and we have set all our other work aside for this. Many ladies will be cross with us, but it was the queen’s command.    Thank Her Grace kindly for her thoughtfulness,  Sansa said politely.  She is too good to me.    Her Grace is most generous,  the seamstress agreed, as she gathered up her things and took her leave.  But why? Sansa wondered when she was alone. It made her uneasy. I’ll wager this gown is Margaery’s doing somehow, or her grandmother’s.  Margaery’s kindness had been unfailing, and her presence changed everything. Her ladies welcomed Sansa as well. It had been so long since she had enjoyed the company of other women, she had almost forgotten how pleasant it could be."
}