{
  "id": "f14a8bec6be136880b3574355add514a83bbe050",
  "text": "  They left the castle at noon the next day to find a weak silver sun shining down upon the grounds.  The weather was milder than it had been all year, and by the time they arrived in Hogsmeade, all three of them had taken off their cloaks and thrown them over their shoulders. The food Sirius had told them to bring was in Harry's bag; they had sneaked a dozen chicken legs, a loaf of bread, and a flask of pumpkin juice from the lunch table. They went into Gladrags Wizardwear to buy a present for Dobby, where they had fun selecting the most lurid socks they could find, including a pair patterned with flashing gold and silver stars, and another that screamed loudly when they became too smelly. Then, at half past one, they made their way up the High Street, past Dervish and Banges, and out toward the edge of the village. Harry had never been in this direction before.  The winding lane was leading them out into the wild countryside around Hogsmeade.  The cottages were fewer here, and their gardens larger; they were walking toward the foot of the mountain in whose shadow Hogsmeade lay. Then they turned a corner and saw a stile at the end of the lane.  Waiting for them, its front paws on the topmost bar, was a very large, shaggy black dog, which was carrying some newspapers in its mouth and looking very familiar. . . . \"Hello, Sirius,\" said Harry when they had reached him. The black dog sniffed Harry's bag eagerly, wagged its tail once, then turned and began to trot away from them across the scrubby patch of ground that rose to meet the rocky foot of the mountain.  Harry, Ron, and Hermione climbed over the stile and followed. Sirius led them to the very foot of the mountain, where the ground was covered with boulders and rocks.  It was easy for him, with his four paws, but Harry, Ron, and Hermione were soon out of breath.  They followed Sirius higher, up onto the mountain itself.  For nearly half an hour they climbed a steep, winding, and stony path, following Sirius's wagging tail, sweating in the sun, the shoulder straps of Harry's bag cutting into his shoulders. Then, at last, Sirius slipped out of sight, and when they reached the place where he had vanished, they saw a narrow fissure in the rock.  They squeezed into it and found themselves in a cool, dimly lit cave.  Tethered at the end of it, one end of his rope around a large rock, was Buckbeak the hippogriff.  Half gray horse, half giant eagle, Buckbeak's fierce orange eye flashed at the sight of them.  All three of them bowed low to him, and after regarding them imperiously for a moment, Buckbeak bent his scaly front knees and allowed Hermione to rush forward and stroke his feathery neck.  Harry, however, was looking at the black dog, which had just turned into his godfather. Sirius was wearing ragged gray robes; the same ones he had been wearing when he had left Azkaban.  His black hair was longer than it had been when he had appeared in the fire, and it was untidy and matted once more.  He looked very thin. \"Chicken!\" he said hoarsely after removing the old Daily Prophets from his mouth and throwing them down onto the cave floor. Harry pulled open his bag and handed over the bundle of chicken legs and bread. \"Thanks,\" said Sirius, opening it, grabbing a drumstick, sitting down on the cave floor, and tearing off a large chunk with his teeth. \"I've been living off rats mostly.  Can't steal too much food from Hogsmeade; I'd draw attention to myself.\" He grinned up at Harry, but Harry returned the grin only reluctantly. \"What're you doing here, Sirius?\" he said. \"Fulfilling my duty as godfather,\" said Sirius, gnawing on the chicken bone in a very doglike way.  \"Don't worry about it, I'm pretending to be a lovable stray.\" He was still grinning, but seeing the anxiety in Harrys face, said more seriously, \"I want to be on the spot.  Your last letter . . . well, let's just say things are getting fishier.  I've been stealing the paper every time someone throws one out, and by the looks of things, I'm not the only one who's getting worried.\" He nodded at the yellowing Daily Prophets on the cave floor, and Ron picked them up and unfolded them. Harry, however, continued to stare at Sirius. \"What if they catch you? What if you're seen?\" \"You three and Dumbledore are the only ones around here who know I'm an Animagus,\" said Sirius, shrugging, and continuing to devour the chicken leg. Ron nudged Harry and passed him the Daily Prophets.  There were two:  The first bore the headline Mystery Illness ofBartemius Crouch, the second, Ministry Witch Still Missing-Minister of Magic Now Personally Involved. Harry scanned the story about Crouch.  Phrases jumped out at him: hasn't been seen in public since November. . . house appears deserted. . . St. Mungo's Hospital for Magical Maladies and Injuries decline comment. . . Ministry refuses to confirm rumors of critical illness. . . . \"They're making it sound like he's dying,\" said Harry slowly.  \"But he can't be that ill if he managed to get up here."
}