{
  "id": "f1db1da4d315c483b913547839532dcd37b3f7f3",
  "text": "  \"This mirror is the key to finding the Stone,\" Quirrell murmured, tapping his way around the frame. \"Trust Dumbledore to come up with something like this... but he's in London... I'll be far away by the time he gets back....\"  All Harry could think of doing was to keep Quirrell talking and stop him from concentrating on the mirror.  \"I saw you and Snape in the forest --\" he blurted out.  \"Yes,\" said Quirrell idly, walking around the mirror to look at the back. \"He was on to me by that time, trying to find out how far I'd got. He suspected me all along. Tried to frighten me - as though he could, when I had Lord Voldemort on my side....\"  Quirrell came back out from behind the mirror and stared hungrily into it.  \"I see the Stone... I'm presenting it to my master... but where is it?\"  Harry struggled against the ropes binding him, but they didn't give. He had to keep Quirrell from giving his whole attention to the mirror.  \"But Snape always seemed to hate me so much.\"  \"Oh, he does,\" said Quirrell casually, \"heavens, yes. He was at Hogwarts with your father, didn't you know? They loathed each other. But he never wanted you dead.\"  \"But I heard you a few days ago, sobbing -- I thought Snape was threatening you....\"  For the first time, a spasm of fear flitted across Quirrell's face.  \"Sometimes,\" he said, \"I find it hard to follow my master's instructions -- he is a great wizard and I am weak --\"  \"You mean he was there in the classroom with you?\" Harry gasped.  \"He is with me wherever I go,\" said Quirrell quietly. \"I met him when I traveled around the world. A foolish young man I was then, full of ridiculous ideas about good and evil. Lord Voldemort showed me how wrong I was. There is no good and evil, there is only power, and those too weak to seek it.... Since then, I have served him faithfully, although I have let him down many times. He has had to be very hard on me.\" Quirrell shivered suddenly. \"He does not forgive mistakes easily. When I failed to steal the stone from Gringotts, he was most displeased. He punished me... decided he would have to keep a closer watch on me....\"  Quirrell's voice trailed away. Harry was remembering his trip to Diagon Alley -how could he have been so stupid? He'd seen Quirrell there that very day, shaken hands with him in the Leaky Cauldron.  Quirrell cursed under his breath.  \"I don't understand... is the Stone inside the mirror? Should I break it?\"  Harry's mind was racing.  What I want more than anything else in the world at the moment, he thought, is to find the Stone before Quirrell does. So if I look in the mirror, I should see myseff finding it -- which means I'll see where it's hidden! But how can I look without Quirrell realizing what I'm up to?  He tried to edge to the left, to get in front of the glass without Quirrell noticing, but the ropes around his ankles were too tight: he tripped and fell over. Quirrell ignored him. He was still talking to himself. \"What does this mirror do? How does it work? Help me, Master!\"  And to Harry's horror, a voice answered, and the voice seemed to come from Quirrell himself  \"Use the boy... Use the boy...\"  Quirrell rounded on Harry.  \"Yes -- Potter -- come here.\"  He clapped his hands once, and the ropes binding Harry fell off. Harry got slowly to his feet.  \"Come here,\" Quirrell repeated. \"Look in the mirror and tell me what you see.\"  Harry walked toward him.  I must lie, he thought desperately. I must look and lie about what I see, that's all.  Quirrell moved close behind him. Harry breathed in the funny smell that seemed to come from Quirrell's turban. He closed his eyes, stepped in front of the mirror, and opened them again.  He saw his reflection, pale and scared-looking at first. But a moment later, the reflection smiled at him. It put its hand into its pocket and pulled out a blood-red stone. It winked and put the Stone back in its pocket -- and as it did so, Harry felt something heavy drop into his real pocket. Somehow -- incredibly -- he'd gotten the Stone.  \"Well?\" said Quirrell impatiently. \"What do you see?\"  Harry screwed up his courage.  \"I see myself shaking hands with Dumbledore,\" he invented. \"I -- I've won the house cup for Gryffindor.\"  Quirrell cursed again.  \"Get out of the way,\" he said. As Harry moved aside, he felt the Sorcerer's Stone against his leg. Dare he make a break for it?  But he hadn't walked five paces before a high voice spoke, though Quirrell wasn't moving his lips.  \"He lies... He lies...\"  \"Potter, come back here!\" Quirrell shouted. \"Tell me the truth! What did you just see?\"  The high voice spoke again.  \"Let me speak to him... face-to-face...\"  \"Master, you are not strong enough!\"  \"I have strength enough... for this....\"  Harry felt as if Devil's Snare was rooting him to the spot. He couldn't move a muscle. Petrified, he watched as Quirrell reached up and began to unwrap his turban. What was going on? The turban fell away. Quirrell's head looked strangely small without it. Then he turned slowly on the spot."
}