{
  "id": "f494b502d2277b51edb1f7e1a5c927128573ef4f",
  "text": " He wondered what he would be coming out. If I ever do…  The steps seemed longer and steeper than before, or perhaps it was just that he was tired. The Mother never made me for tasks like this. He had risen too high and too fast, and up here on the mountain the air was too thin for him to breathe. As a boy he’d dreamed of riches, but that was long ago. Later, grown, all he had wanted was a few acres of good land, a hall to grow old in, a better life for his sons. The Blind Bastard used to tell him that a clever smuggler did not overreach, nor draw too much attention to himself. A few acres, a timbered roof, a  ser  before my name, I should have been content. If he survived this night, he would take Devan and sail home to Cape Wrath and his gentle Marya. We will grieve together for our dead sons, raise the living ones to be good men, and speak no more of kings.  The Chamber of the Painted Table was dark and empty when Davos entered; the king would still be at the nightfire, with Melisandre and the queen’s men. He knelt and made a fire in the hearth, to drive the chill from the round chamber and chase the shadows back into their corners. Then he went around the room to each window in turn, opening the heavy velvet curtains and unlatching the wooden shutters. The wind came in, strong with the smell of salt and sea, and pulled at his plain brown cloak.  At the north window, he leaned against the sill for a breath of the cold night air, hoping to catch a glimpse of Mad Prendos raising sail, but the sea seemed black and empty as far as the eye could see. Is she gone already? He could only pray that she was, and the boy with her. A half moon was sliding in and out amongst thin high clouds, and Davos could see familiar stars. There was the Galley, sailing west; there the Crone’s Lantern, four bright stars that enclosed a golden haze. The clouds hid most of the Ice Dragon, all but the bright blue eye that marked due north. The sky is full of smugglers’ stars. They were old friends, those stars; Davos hoped that meant good luck.  But when he lowered his gaze from the sky to the castle ramparts, he was not so certain. The wings of the stone dragons cast great black shadows in the light from the nightfire. He tried to tell himself that they were no more than carvings, cold and lifeless. This was their place, once. A place of dragons and dragonlords, the seat of House Targaryen. The Targaryens were the blood of old Valyria…  The wind sighed through the chamber, and in the hearth the flames gusted and swirled. He listened to the logs crackle and spit. When Davos left the window his shadow went before him, tall and thin, and fell across the Painted Table like a sword. And there he stood for a long time, waiting. He heard their boots on the stone steps as they ascended. The king’s voice went before him.  …is not three,  he was saying.   Three is three,  came Melisandre’s answer.  I swear to you, Your Grace, I saw him die and heard his mother’s wail.    In the nightfire.  Stannis and Melisandre came through the door together.  The flames are full of tricks. What is, what will be, what may be. You cannot tell me for a certainty…    Your Grace.  Davos stepped forward.  Lady Melisandre saw it true. Your nephew Joffrey is dead.   If the king was surprised to find him at the Painted Table, he gave no sign.  Lord Davos,  he said.  He was not my nephew. Though for years I believed he was.    He choked on a morsel of food at his wedding feast,  Davos said.  It may be that he was poisoned.    He is the third,  said Melisandre.   I can count, woman.  Stannis walked along the table, past Oldtown and the Arbor, up toward the Shield Islands and the mouth of the Mander.  Weddings have become more perilous than battles, it would seem. Who was the poisoner? Is it known?    His uncle, it’s said. The Imp.   Stannis ground his teeth.  A dangerous man. I learned that on the Blackwater. How do you come by this report?    The Lyseni still trade at King’s Landing. Salladhor Saan has no reason to lie to me.    I suppose not.  The king ran his fingers across the table.  Joffrey… I remember once, this kitchen cat… the cooks were wont to feed her scraps and fish heads. One told the boy that she had kittens in her belly, thinking he might want one. Joffrey opened up the poor thing with a dagger to see if it were true. When he found the kittens, he brought them to show to his father. Robert hit the boy so hard I thought he’d killed him.  The king took off his crown and placed it on the table.  Dwarf or leech, this killer served the kingdom well. They must send for me now.    They will not,  said Melisandre.  Joffrey has a brother.    Tommen.  The king said the name grudgingly.   They will crown Tommen, and rule in his name.   Stannis made a fist.  Tommen is gentler than Joffrey, but born of the same incest. Another monster in the making. Another leech upon the land. Westeros needs a man’s hand, not a child’s.   Melisandre moved closer.  Save them, sire."
}