{
  "id": "f52ba58c7374326a4c6d5b49c81fdbf8a91e237c",
  "text": ".. He was drawing breath with extreme difficulty.  He could feel pain on the sides of his neck again ... he was becoming very aware of how wet the water was in his mouth .. . yet the darkness was definitely thinning now... he could see daylight above him.. .. He kicked hard with his flippers and discovered that they were nothing more than feet...water was flooding through his mouth into his lungs ... he was starting to feel dizzy, but he knew light and air were only ten feet above him ... he had to get there ... he had to ... Harry kicked his legs so hard and fast it felt as though his muscles were screaming in protest; his very brain felt waterlogged, he couldn't breathe, he needed oxygen, he had to keep going, he could not stop - And then he felt his head break the surface of the lake; wonderful, cold, clear air was making his wet face sting; he gulped it down, feeling as though he had never breathed properly before, and, panting, pulled Ron and the little girl up with him.  All around him, wild, green-haired heads were emerging out of the water with him, but they were smiling at him. The crowd in the stands was making a great deal of noise; shouting and screaming, they all seemed to be on their feet; Harry had the impression they thought that Ron and the little girl might be dead, but they were wrong . . . both of them had opened their eyes; the girl looked scared and confused, but Ron merely expelled a great spout of water, blinked in the bright light, turned to Harry, and said, \"Wet, this, isn't it?\"  Then he spotted Fleur's sister.  \"What did you bring her for?\" \"Fleur didn't turn up, I couldn't leave her,\" Harry panted. \"Harry, you prat,\" said Ron, \"you didn't take that song thing seriously, did you? Dumbledore wouldn't have let any of us drown!\" \"The song said -\" \"It was only to make sure you got back inside the time limit!\"  said Ron. \"I hope you didn't waste time down there acting the hero!\" Harry felt both stupid and annoyed.  It was all very well for Ron; he'd been asleep, he hadn't felt how eerie it was down in the lake, surrounded by spear-carrying merpeople who'd looked more than capable of murder. \"C'mon,\" Harry said shortly, \"help me with her, I don't think she can swim very well.\" They pulled Fleur's sister through the water, back toward the bank where the judges stood watching, twenty merpeople accompanying them like a guard of honor, singing their horrible screechy songs. Harry could see Madam Pomfrey fussing over Hermione, Krum, Cedric, and Cho, all of whom were wrapped in thick blankets. Dumbledore and Ludo Bagman stood beaming at Harry and Ron from the bank as they swam nearer, but Percy, who looked very white and somehow much younger than usual, came splashing out to meet them.  Meanwhile Madame Maxime was trying to restrain Fleur Delacour, who was quite hysterical, fighting tooth and nail to return to the water. \"Gabrielle!  Gabrielle!  Is she alive?  Is she 'urt?\" \"She's fine!\" Harry tried to tell her, but he was so exhausted he could hardly talk, let alone shout. Percy seized Ron and was dragging him back to the bank (\"Gerroff, Percy, I'm all right!\"); Dumbledore and Bagman were pulling Harry upright; Fleur had broken free of Madame Maxime and was hugging her sister. \"It was ze grindylows . . . zey attacked me ... oh Gabrielle, I thought... I thought.. .\" \"Come here, you,\" said Madam Pomfrey.  She seized Harry and pulled him over to Hermione and the others, wrapped him so tightly in a blanket that he felt as though he were in a straitjacket, and forced a measure of very hot potion down his throat.  Steam gushed out of his ears. \"Harry, well done!\" Hermione cried.  \"You did it, you found out how all by yourself!\" \"Well -\" said Harry. He would have told her about Dobby, but he had just noticed Karkaroff watching him.  He was the only judge who had not left the table; the only judge not showing signs of pleasure and relief that Harry, Ron, and Fleur's sister had got back safely. \"Yeah, that's right,\" said Harry, raising his voice slightly so that Karkaroff could hear him. \"You haff a water beetle in your hair, Herm-own-ninny,\" said Krum. Harry had the impression that Krum was drawing her attention back onto himself; perhaps to remind her that he had just rescued her from the lake, but Hermione brushed away the beetle impatiently and said, \"You're well outside the time limit, though, Harry. . . . Did it take you ages to find us?\" \"No ... I found you okay....\" Harry's feeling of stupidity was growing. Now he was out of the water, it seemed perfectly clear that Dumbledores safety precautions wouldn't have permitted the death of a hostage just because their champion hadn't turned up.  Why hadn't he just grabbed Ron and gone?  He would have been first back.... Cedric and Krum hadn't wasted time worrying about anyone else; they hadn't taken the mersong seriously. ... Dumbledore was crouching at the water's edge, deep in conversation with what seemed to be the chief merperson, a particularly wild and ferocious-looking female."
}