{
  "id": "f7767cdfea0794900e8a5022da61e817a5f0e601",
  "text": "  His fingers brushed lightly over her budding breasts and tightened on a nipple.  You will not fail me tonight. If you do, it will go hard for you. You don’t want to wake the dragon, do you?  His fingers twisted her, the pinch cruelly hard through the rough fabric of her tunic.  Do you?  he repeated.   No,  Dany said meekly.  Her brother smiled.  Good.  He touched her hair, almost with affection.  When they write the history of my reign, sweet sister, they will say that it began tonight.   When he was gone, Dany went to her window and looked out wistfully on the waters of the bay. The square brick towers of Pentos were black silhouettes outlined against the setting sun. Dany could hear the singing of the red priests as they lit their night fires and the shouts of ragged children playing games beyond the walls of the estate. For a moment she wished she could be out there with them, barefoot and breathless and dressed in tatters, with no past and no future and no feast to attend at Khal Drogo’s manse.  Somewhere beyond the sunset, across the narrow sea, lay a land of green hills and flowered plains and great rushing rivers, where towers of dark stone rose amidst magnificent blue-grey mountains, and armored knights rode to battle beneath the banners of their lords. The Dothraki called that land Rhaesh Andahli, the land of the Andals. In the Free Cities, they talked of Westeros and the Sunset Kingdoms. Her brother had a simpler name.  Our land,  he called it. The words were like a prayer with him. If he said them enough, the gods were sure to hear.  Ours by blood right, taken from us by treachery, but ours still, ours forever. You do not steal from the dragon, oh, no. The dragon remembers.   And perhaps the dragon did remember, but Dany could not. She had never seen this land her brother said was theirs, this realm beyond the narrow sea. These places he talked of, Casterly Rock and the Eyrie, Highgarden and the Vale of Arryn, Dorne and the Isle of Faces, they were just words to her. Viserys had been a boy of eight when they fled King’s Landing to escape the advancing armies of the Usurper, but Daenerys had been only a quickening in their mother’s womb.  Yet sometimes Dany would picture the way it had been, so often had her brother told her the stories. The midnight flight to Dragonstone, moonlight shimmering on the ship’s black sails. Her brother Rhaegar battling the Usurper in the bloody waters of the Trident and dying for the woman he loved. The sack of King’s Landing by the ones Viserys called the Usurper’s dogs, the lords Lannister and Stark. Princess Elia of Dorne pleading for mercy as Rhaegar’s heir was ripped from her breast and murdered before her eyes. The polished skulls of the last dragons staring down sightlessly from the walls of the throne room while the Kingslayer opened Father’s throat with a golden sword.  She had been born on Dragonstone nine moons after their flight, while a raging summer storm threatened to rip the island fastness apart. They said that storm was terrible. The Targaryen fleet was smashed while it lay at anchor, and huge stone blocks were ripped from the parapets and sent hurtling into the wild waters of the narrow sea. Her mother had died birthing her, and for that her brother Viserys had never forgiven her.  She did not remember Dragonstone either. They had run again, just before the Usurper’s brother set sail with his new-built fleet. By then only Dragonstone itself, the ancient seat of their House, had remained of the Seven Kingdoms that had once been theirs. It would not remain for long. The garrison had been prepared to sell them to the Usurper, but one night Ser Willem Darry and four loyal men had broken into the nursery and stolen them both, along with her wet nurse, and set sail under cover of darkness for the safety of the Braavosian coast.  She remembered Ser Willem dimly, a great grey bear of a man, half-blind, roaring and bellowing orders from his sickbed. The servants had lived in terror of him, but he had always been kind to Dany. He called her  Little Princess  and sometimes  My Lady,  and his hands were soft as old leather. He never left his bed, though, and the smell of sickness clung to him day and night, a hot, moist, sickly sweet odor. That was when they lived in Braavos, in the big house with the red door. Dany had her own room there, with a lemon tree outside her window. After Ser Willem had died, the servants had stolen what little money they had left, and soon after they had been put out of the big house. Dany had cried when the red door closed behind them forever.  They had wandered since then, from Braavos to Myr, from Myr to Tyrosh, and on to Qohor and Volantis and Lys, never staying long in any one place. Her brother would not allow it. The Usurper’s hired knives were close behind them, he insisted, though Dany had never seen one.  At first the magisters and archons and merchant princes were pleased to welcome the last Targaryens to their homes and tables, but as the years passed and the Usurper continued to sit upon the Iron Throne, doors closed and their lives grew meaner."
}