{
  "id": "f86766db936bdff6573dbca0de319ca57cffa2d9",
  "text": " As Harry might have told you, the final of the Quidditch World Cup takes place this Monday night, and my husband, Arthur, has just managed to get prime tickets through his connections at the Department of Magical Games and Sports. I do hope you will allow us to take Harry to the match, as this really is a once-in-a-lifetime opportunity; Britain hasn't hosted the cup for thirty years, and tickets are extremely hard to come by.  We would of course be glad to have Harry stay for the remainder of the summer holidays, and to see him safely onto the train back to school. It would be best for Harry to send us your answer as quickly as possible in the normal way, because the Muggle postman has never delivered to our house, and I am not sure he even knows where it is. Hoping to see Harry soon, Yours sincerely, Molly Weasley  P.S.  I do hope we've put enough stamps on.  Uncle Vernon finished reading, put his hand back into his breast pocket, and drew out something else. \"Look at this,\" he growled. He held up the envelope in which Mrs. Weasley's letter had come, and Harry had to fight down a laugh.  Every bit of it was covered in stamps except for a square inch on the front, into which Mrs. Weasley had squeezed the Dursleys' address in minute writing. \"She did put enough stamps on, then,\" said Harry, trying to sound as though Mrs. Weasley's was a mistake anyone could make.  His uncle's eyes flashed. \"The postman noticed,\" he said through gritted teeth. \"Very interested to know where this letter came from, he was.  That's why he rang the doorbell.  Seemed to think it was funny.\" Harry didn't say anything.  Other people might not understand why Uncle Vernon was making a fuss about too many stamps, but Harry had lived with the Dursleys too long not to know how touchy they were about anything even slightly out of the ordinary.  Their worst fear was that someone would find out that they were connected (however distantly) with people like Mrs. Weasley. Uncle Vernon was still glaring at Harry, who tried to keep his expression neutral.  If he didn't do or say anything stupid, he might just be in for the treat of a lifetime.  He waited for Uncle Vernon to say something, but he merely continued to glare.  Harry decided to break the silence. \"So - can I go then?\" he asked. A slight spasm crossed Uncle Vernon's large purple face.  The mustache bristled. Harry thought he knew what was going on behind the mustache: a furious battle as two of Uncle Vernon's most fundamental instincts came into conflict.  Allowing Harry to go would make Harry happy, something Uncle Vernon had struggled against for thirteen years.  On the other hand, allowing Harry to disappear to the Weasleys' for the rest of the summer would get rid of him two weeks earlier than anyone could have hoped, and Uncle Vernon hated having Harry in the house.  To give himself thinking time, it seemed, he looked down at Mrs. Weasley's letter again. \"Who is this woman?\" he said, staring at the signature with distaste. \"You've seen her,\" said Harry. \"She's my friend Ron's mother, she was meeting him off the Hog - off the school train at the end of last term.\" He had almost said \"Hogwarts Express,\" and that was a sure way to get his uncle's temper up.  Nobody ever mentioned the name of Harry's school aloud in the Dursley household. Uncle Vernon screwed up his enormous face as though trying to remember something very unpleasant. \"Dumpy sort of woman?\" he growled finally.  \"Load of children with red hair?\" Harry frowned.  He thought it was a bit rich of Uncle Vernon to call anyone \"dumpy,\" when his own son, Dudley, had finally achieved what he'd been threatening to do since the age of three, and become wider than he was tall. Uncle Vernon was perusing the letter again. \"Quidditch,\" he muttered under his breath. \"Quidditch - what is this rubbish?\" Harry felt a second stab of annoyance. \"It's a sport,\" he said shortly. \"Played on broom- \" \"All right, all right!\"  said Uncle Vernon loudly.  Harry saw, with some satisfaction, that his uncle looked vaguely panicky.  Apparently his nerves couldn't stand the sound of the word \"broomsticks\" in his living room.  He took refuge in perusing the letter again.  Harry saw his lips form the words \"send us your answer ... in the normal way.\"  He scowled. \"What does she mean, 'the normal way'?\"  he spat. \"Normal for us,\" said Harry, and before his uncle could stop him, he added, \"you know, owl post. That's what's normal for wizards.\" Uncle Vernon looked as outraged as if Harry had just uttered a disgusting swearword. Shaking with anger, he shot a nervous look through the window, as though expecting to see some of the neighbors with their ears pressed against the glass. \"How many times do I have to tell you not to mention that unnaturalness under my roof?\"  he hissed, his face now a rich plum color.  \"You stand there, in the clothes Petunia and I have put on your ungrateful back -\" \"Only after Dudley finished with them,\" said Harry coldly, and indeed, he was dressed in a sweatshirt so large for him that he had had to roll back the sleeves five times so as to be able to use his hands, and which fell past the knees of his extremely baggy jeans."
}