{
  "id": "f93f3998e2bb2739ce84aad5aa19cd5c447d4a7d",
  "text": "  Harry fell to the ground on all fours as the spider released him. Ron and Fang thudded down next to him. Fang wasn't howling anymore, but cowering silently on the spot. Ron looked exactly like Harry felt. His mouth was stretched wide in a kind of silent scream and his eyes were popping.  Harry suddenly realized that the spider that had dropped him was saying something. It had been hard to tell, because he clicked his pincers with every word he spoke.  \"Aragog!\" it called. \"Aragog!\"  And from the middle of the misty, domed web, a spider the size of a small elephant emerged, very slowly. There was gray in the black of his body and legs, and each of the eyes on his ugly, pincered head was milky white. He was blind.  \"What is it?\" he said, clicking his pincers rapidly.  \"Men,\" clicked the spider who had caught Harry.  \"Is it Hagrid?\" said Aragog, moving closer, his eight milky eyes wandering vaguely.  \"Strangers,\" clicked the spider who had brought Ron.  \"Kill them,\" clicked Aragog fretfully. \"I was sleeping ......  \"We're friends of Hagrid's,\" Harry shouted. His heart seemed to have left his chest to pound in his throat.  *216*  Click, click, click went the pincers of the spiders all around the hollow.  Aragog paused.  \"Hagrid has never sent men into our hollow before,\" he said slowly.  \"Hagrid's in trouble,\" said Harry, breathing very fast. \"That's why we've come.\"  \"In trouble?\" said the aged spider, and Harry thought he heard concern beneath the clicking pincers. \"But why has he sent you?\"  Harry thought of getting to his feet but decided against it; he didn't think his legs would support him. So he spoke from the ground, as calmly as he could.  \"They think,, up at the school, that Hagrid's been setting a a - something on students. They've taken him to Azkaban.\"  Aragog clicked his pincers furiously, and all around the hollow the sound was echoed by the crowd of spiders; it was like applause, except applause didn't usually make Harry feel sick with fear.  \"But that was years ago,\" said Aragog fretfully. \"Years and years ago. I remember it well. That's why they made him leave the school. They believed that I was the monster that dwells in what they call the Chamber of Secrets. They thought that Hagrid had opened the Chamber and set me free.\"  \"And you ... you didn't come from the Chamber of Secrets?\" said Harry, who could feel cold sweat on his forehead.  \"I!\" said Aragog, clicking angrily. \"I was not born in the castle. I come from a distant land. A traveler gave me to Hagrid when I was an egg. Hagrid was only a boy, but he cared for me, hidden in a cupboard in the castle, feeding me on scraps from the table. Hagrid  2Y  is my good friend, and a good man. When I was discovered, and blamed for the death of a girl, he protected me. I have lived here in the forest ever since, where Hagrid still visits me. He even found me a wife, Mosag, and you see how our family has grown, all through Hagrid's goodness ......  Harry summoned what remained of his courage.  \"So you never - never attacked anyone?\"  \"Never,\" croaked the old spider. \"It would have been my instinct, but out of respect for Hagrid, I never harmed a human. The body of the girl who was killed was discovered in a bathroom. I never saw any part of the castle but the cupboard in which I grew up. Our kind like the dark and the quiet ......  \"But then ... Do you know what did kill that girl?\" said Harry. \"Because whatever it is, it's back and attacking people again -\"  His words were drowned by a loud outbreak of clicking and the rustling of many long legs shifting angrily; large black shapes shifted all around him.  \"The thing that lives in the castle,\" said Aragog, \"is an ancient creature we spiders fear above all others. Well do I remember how I pleaded with Hagrid to let me go, when I sensed the beast moving about the school.\"  \"What is it?\" said Harry urgently.  More loud clicking, more rustling; the spiders seemed to be closing in.  \"We do not speak of it!\" said Aragog fiercely. \"We do not name it! I never even told Hagrid the name of that dread creature, though he asked me, many times.\"  Harry didn't want to press the subject, not with the spiders  * 2-V8 *  pressing closer on all sides. Aragog seemed to be tired of tamng. He was backing slowly into his domed web, but his fellow spiders continued to inch slowly toward Harry and Ron.  \"We'll just go, then,\" Harry called desperately to Aragog, hearing leaves rustling behind him.  \"Go?\" said Aragog slowly. \"I think not ......  \"But - but -\"  \"My sons and daughters do not harm Hagrid, on my command. But I cannot deny them fresh meat, when it wanders so willingly into our midst. Good-bye, friend of Hagrid.\"  Harry spun around. Feet away, towering above him, was a solid wall of spiders, clicking, their many eyes gleaming in their ugly black heads.  Even as he reached for his wand, Harry knew it was no good, there were too many of them, but as he tried to stand, ready to die fighting, a loud, long note sounded, and a blaze of light flamed through the hollow."
}