{
  "id": "fa8e73e2d6628aecfbbf3bb7f1682b79ea90ccdb",
  "text": " She even smells red. The scent reminded him of Mikken’s forge, of the way iron smelled when red-hot; the scent was smoke and blood. Kissed by fire, he thought, remembering Ygritte. The wind got in amongst Melisandre’s long red robes and sent them flapping against Jon’s legs as he stood beside her.  You are not cold, my lady?  he asked her.  She laughed.  Never.  The ruby at her throat seemed to pulse, in time with the beating of her heart.  The Lord’s fire lives within me, Jon Snow. Feel.  She put her hand on his cheek, and held it there while he felt how warm she was.  That is how life should feel,  she told him.  Only death is cold.   They found Stannis Baratheon standing alone at the edge of the Wall, brooding over the field where he had won his battle, and the great green forest beyond. He was dressed in the same black breeches, tunic, and boots that a brother of the Night’s Watch might wear. Only his cloak set him apart; a heavy golden cloak trimmed in black fur, and pinned with a brooch in the shape of a flaming heart.  I have brought you the Bastard of Winterfell, Your Grace,  said Melisandre.  Stannis turned to study him. Beneath his heavy brow were eyes like bottomless blue pools. His hollow cheeks and strong jaw were covered with a short-cropped blue-black beard that did little to conceal the gauntness of his face, and his teeth were clenched. His neck and shoulders were clenched as well, and his right hand. Jon found himself remembering something Donal Noye once said about the Baratheon brothers. Robert was the true steel. Stannis is pure iron, black and hard and strong, but brittle, the way iron gets. He’ll break before he bends. Uneasily, he knelt, wondering why this brittle king had need of him.   Rise. I have heard much and more of you, Lord Snow.    I am no lord, sire.  Jon rose.  I know what you have heard. That I am a turncloak, and craven. That I slew my brother Qhorin Halfhand so the wildlings would spare my life. That I rode with Mance Rayder, and took a wildling wife.    Aye. All that, and more. You are a warg too, they say, a skinchanger who walks at night as a wolf.  King Stannis had a hard smile.  How much of it is true?    I had a direwolf, Ghost. I left him when I climbed the Wall near Greyguard, and have not seen him since. Qhorin Halfhand commanded me to join the wildlings. He knew they would make me kill him to prove myself, and told me to do whatever they asked of me. The woman was named Ygritte. I broke my vows with her, but I swear to you on my father’s name that I never turned my cloak.    I believe you,  the king said.  That startled him.  Why?   Stannis snorted.  I know Janos Slynt. And I knew Ned Stark as well. Your father was no friend of mine, but only a fool would doubt his honor or his honesty. You have his look.  A big man, Stannis Baratheon towered over Jon, but he was so gaunt that he looked ten years older than he was.  I know more than you might think, Jon Snow. I know it was you who found the dragonglass dagger that Randyll Tarly’s son used to slay the Other.    Ghost found it. The blade was wrapped in a ranger’s cloak and buried beneath the Fist of the First Men. There were other blades as well… spearheads, arrowheads, all dragonglass.    I know you held the gate here,  King Stannis said.  If not, I would have come too late.    Donal Noye held the gate. He died below in the tunnel, fighting the king of the giants.   Stannis grimaced.  Noye made my first sword for me, and Robert’s warhammer as well. Had the god seen fit to spare him, he would have made a better Lord Commander for your order than any of these fools who are squabbling over it now.    Cotter Pyke and Ser Denys Mallister are no fools, sire,  Jon said.  They’re good men, and capable. Othell Yarwyck as well, in his own way. Lord Mormont trusted each of them.    Your Lord Mormont trusted too easily. Else he would not have died as he did. But we were speaking of you. I have not forgotten that it was you who brought us this magic horn, and captured Mance Rayder’s wife and son.    Dalla died.  Jon was saddened by that still.  Val is her sister. She and the babe did not require much capturing, Your Grace. You had put the wildlings to flight, and the skinchanger Mance had left to guard his queen went mad when the eagle burned.  Jon looked at Melisandre.  Some say that was your doing.   She smiled, her long copper hair tumbling across her face.  The Lord of Light has fiery talons, Jon Snow.   Jon nodded, and turned back to the king.  Your Grace, you spoke of Val. She has asked to see Mance Rayder, to bring his son to him. It would be a… a kindness.    The man is a deserter from your order. Your brothers are all insisting on his death. Why should I do him a kindness?   Jon had no answer for that.  If not for him, for Val. For her sister’s sake, the child’s mother.    You are fond of this Val?    I scarcely know her.    They tell me she is comely.    Very,  Jon admitted.   Beauty can be treacherous. My brother learned that lesson from Cersei Lannister."
}