{
  "id": "fd2dd41955ab1eeafdb2823e47161e5667daa991",
  "text": "  No true knight would condone such wanton butchery.    True knights see worse every time they ride to war, wench,  said Jaime.  And do worse, yes.   Brienne turned the rudder toward the shore.  I’ll leave no innocents to be food for crows.    A heartless wench. Crows need to eat as well. Stay to the river and leave the dead alone, woman.   They landed upstream of where the great oak leaned out over the water. As Brienne lowered the sail, Jaime climbed out, clumsy in his chains. The Red Fork filled his boots and soaked through the ragged breeches. Laughing, he dropped to his knees, plunged his head under the water, and came up drenched and dripping. His hands were caked with dirt, and when he rubbed them clean in the current they seemed thinner and paler than he remembered. His legs were stiff as well, and unsteady when he put his weight upon them. I was too bloody long in Hoster Tully’s dungeon.  Brienne and Cleos dragged the skiff onto the bank. The corpses hung above their heads, ripening in death like foul fruit.  One of us will need to cut them down,  the wench said.   I’ll climb.  Jaime waded ashore, clanking.  Just get these chains off.   The wench was staring up at one of the dead women. Jaime shuffled closer with small stutter steps, the only kind the foot-long chain permitted. When he saw the crude sign hung about the neck of the highest corpse, he smiled.  They Lay With Lions,  he read.  Oh, yes, woman, this was most unchivalrously done… But by your side, not mine. I wonder who they were, these women?    Tavern wenches,  said Ser Cleos Frey.  This was an inn, I remember it now. Some men of my escort spent the night here when we last returned to Riverrun.  Nothing remained of the building but the stone foundation and a tangle of collapsed beams, charred black. Smoke still rose from the ashes.  Jaime left brothels and whores to his brother Tyrion; Cersei was the only woman he had ever wanted.  The girls pleasured some of my lord father’s soldiers, it would seem. Perhaps served them food and drink. That’s how they earned their traitors’ collars, with a kiss and a cup of ale.  He glanced up and down the river, to make certain they were quite alone.  This is Bracken land. Lord Jonos might have ordered them killed. My father burned his castle, I fear he loves us not.    It might be Marq Piper’s work,  said Ser Cleos.  Or that wisp o’ the wood Beric Dondarrion, though I’d heard he kills only soldiers. Perhaps a band of Roose Bolton’s northmen?    Bolton was defeated by my father on the Green Fork.    But not broken,  said Ser Cleos.  He came south again when Lord Tywin marched against the fords. The word at Riverrun was that he’d taken Harrenhal from Ser Amory Lorch.   Jaime liked the sound of that not at all.  Brienne,  he said, granting her the courtesy of the name in the hopes that she might listen,  if Lord Bolton holds Harrenhal, both the Trident and the kingsroad are likely watched.   He thought he saw a touch of uncertainty in her big blue eyes.  You are under my protection. They’d need to kill me.    I shouldn’t think that would trouble them.    I am as good a fighter as you,  she said defensively.  I was one of King Renly’s chosen seven. With his own hands, he cloaked me with the striped silk of the Rainbow Guard.    The Rainbow Guard? You and six other girls, was it? A singer once said that all maids are fair in silk… But he never met you, did he?   The woman turned red.  We have graves to dig.  She went to climb the tree.  The lower limbs of the oak were big enough for her to stand upon once she’d gotten up the trunk. She walked amongst the leaves, dagger in hand, cutting down the corpses. Flies swarmed around the bodies as they fell, and the stench grew worse with each one she dropped.  This is a deal of trouble to take for whores,  Ser Cleos complained.  What are we supposed to dig with? We have no spades, and I will not use my sword, I—   Brienne gave a shout. She jumped down rather than climbing.  To the boat. Be quick. There’s a sail.   They made what haste they could, though Jaime could hardly run, and had to be pulled back up into the skiff by his cousin. Brienne shoved off with an oar and raised sail hurriedly.  Ser Cleos, I’ll need you to row as well.   He did as she bid. The skiff began to cut the water a bit faster; current, wind, and oars all worked for them. Jaime sat chained, peering upriver. Only the top of the other sail was visible. With the way the Red Fork looped, it looked to be across the fields, moving north behind a screen of trees while they moved south, but he knew that was deceptive. He lifted both hands to shade his eyes.  Mud red and watery blue,  he announced.  Brienne’s big mouth worked soundlessly, giving her the look of a cow chewing its cud.  Faster, ser.   The inn soon vanished behind them, and they lost sight of the top of the sail as well, but that meant nothing. Once the pursuers swung around the loop they would become visible again.  We can hope the noble Tullys will stop to bury the dead whores, I suppose."
}