{
  "id": "fd4c252fe9a55c3eec47c0472daa5a89fa671a7d",
  "text": "  \"Here's something... there was a case in 1722... but the hippogriff was convicted -- ugh, look what they did to it, that's disgusting --\"  \"This might help, look -- a manticore savaged someone in 1296, and they let the manticore off -- oh -- no, that was only because everyone was too scared to go near it.\"  Meanwhile, in the rest of the castle, the usual magnificent Christmas decorations had been put up, despite the fact that hardly any of the students remained to enjoy them. Thick streamers of holly and mistletoe were strung along the corridors, mysterious lights shone from inside every suit of armor, and the Great Hall was filled with its usual twelve Christmas trees, glittering with golden stars. A powerful and delicious smell of cooking pervaded the corridors, and by Christmas Eve, it had grown so strong that even Scabbers poked his nose out of the shelter of Ron's pocket to sniff hopefully at the air.  On Christmas morning, Harry was woken by Ron throwing his pillow at him.  \"Oy! Presents!\"  Harry reached for his glasses and put them on, squinting through the semi-darkness to the foot of his bed, where a small heap of parcels had appeared. Ron was already ripping the paper off his own presents.  'Another sweater from Mum... maroon again... see if you've got one.  Harry had. Mrs. Weasley had sent him a scarlet sweater with the Gryffindor lion knitted on the front, also a dozen home-baked mince pies, some Christmas cake, and a box of nut brittle. As he moved all these things aside, he saw a long, thin package lying underneath.  \"What's that?\" said Ron, looking over, a freshly unwrapped pair of maroon socks in his hand.  \"Dunno...\"  Harry ripped the parcel open and gasped as a magnificent, gleaming broomstick rolled out onto his bedspread. Ron dropped his socks and jumped off his bed for a closer look.  \"I don't believe it,\" he said hoarsely.  It was a Firebolt, identical to the dream broom Harry had gone to see every day in Diagon Alley. Its handle glittered as he picked it up. He could feel it vibrating and let go; it hung in midair, unsupported, at exactly the right height for him to mount it. His eyes moved from the golden registration number at the top of the handle, right down to the perfectly smooth, streamlined birch twigs that made up the tail.  \"Who sent it to you?\" said Ron in a hushed voice.  \"Look and see if there's a card,\" said Harry.  Ron ripped apart the Firebolt's wrappings.  \"Nothing! Blimey, who'd spend that much on you?\"  \"Well,\" said Harry, feeling stunned, \"I'm betting it wasn't the Dursleys.\"  I bet it was Dumbledore,\" said Ron, now walking around and around the Firebolt, taking in every glorious inch. \"He sent you the Invisibility Cloak anonymously....\"  \"That was my dad's, though,\" said Harry. \"Dumbledore was just Passing it on to me. He wouldn't spend hundreds of Galleons on me. He can't go giving students stuff like this --\"  \"That's why he wouldn't say it was from him!\" said Ron. \"In case some git like Malfoy said it was favoritism. Hey, Harry\" -- Ron gave a great whoop of laughter -- \"Malfoy! Wait till he sees you on this! He'll be sick as a pig! This is an international standard broom, this is!\"  \"I can't believe this,\" Harry muttered, running a hand along the Firebolt, while Ron sank onto Harry's bed, laughing his head off at the thought of Malfoy. \"Who -?\"  \"I know,\" said Ron, controlling himself, \"I know who it could've been -- Lupin!\"  \"What?\" said Harry, now starting to laugh himself \"Lupin? Listen, if he had this much gold, he'd be able to buy himself some new robes.\"  \"Yeah, but he likes you,\" said Ron. \"And he was away when your Nimbus got smashed, and he might've heard about it and decided to visit Diagon Alley and get this for you --\"  \"What d'you mean, he was away?\" said Harry. \"He was ill when I was playing in that match.\"  \"Well, he wasn't in the hospital wing,\" said Ron. \"I was there, cleaning out the bedpans on that detention from Snape, remember?\"  Harry frowned at Ron.  \"I can't see Lupin affording something like this.\"  \"What're you two laughing about?\"  Hermione had just come in, wearing her dressing gown and carrying Crookshanks, who was looking very grumpy, with a string of tinsel tied around his neck.  \"Don't bring him in here!\" said Ron, hurriedly snatching Scabbers from the depths of his bed and stowing him in his pajama pocket.  But Hermione wasn't listening. She dropped Crookshanks onto Seamus's empty bed and stared, open-mouthed, at the Firebolt.  \"Oh, Harry! Who sent you that?\"  \"No idea,\" said Harry. \"There wasn't a card or anything with it.\"  To his great surprise, Hermione did not appear either excited or intrigued by the news. On the contrary, her face fell, and she bit her lip.  \"What's the matter with you?\" said Ron.  \"I don't know,\" said Hermione slowly, \"but it's a bit odd, isn't it? I mean, this is supposed to be quite a good broom, isn't it?\"  Ron sighed exasperatedly.  \"It's the best broom there is, Hermione,\" he said.  \"So it must've been really expensive."
}