{
  "id": "fde3c8cbc6bb6513e00c3c11e2dc4599cabf582d",
  "text": "  I want your leaders,  Dany told them.  Give them up, and the rest of you shall be spared.    How many?  one old woman had asked, sobbing.  How many must you have to spare us?    One hundred and sixty-three,  she answered.  She had them nailed to wooden posts around the plaza, each man pointing at the next. The anger was fierce and hot inside her when she gave the command; it made her feel like an avenging dragon. But later, when she passed the men dying on the posts, when she heard their moans and smelled their bowels and blood…  Dany put the glass aside, frowning. It was just. It was. I did it for the children.  Her audience chamber was on the level below, an echoing high-ceilinged room with walls of purple marble. It was a chilly place for all its grandeur. There had been a throne there, a fantastic thing of carved and gilded wood in the shape of a savage harpy. She had taken one long look and commanded it be broken up for firewood.  I will not sit in the harpy’s lap,  she told them. Instead she sat upon a simple ebony bench. It served, though she had heard the Meereenese muttering that it did not befit a queen.  Her bloodriders were waiting for her. Silver bells tinkled in their oiled braids, and they wore the gold and jewels of dead men. Meereen had been rich beyond imagining. Even her sellswords seemed sated, at least for now. Across the room, Grey Worm wore the plain uniform of the Unsullied, his spiked bronze cap beneath one arm. These at least she could rely on, or so she hoped… and Brown Ben Plumm as well, solid Ben with his grey-white hair and weathered face, so beloved of her dragons. And Daario beside him, glittering in gold. Daario and Ben Plumm, Grey Worm, Irri, Jhiqui, Missandei… as she looked at them Dany found herself wondering which of them would betray her next.  The dragon has three heads. There are two men in the world who I can trust, if I can flnd them. I will not be alone then. We will be three against the world, like Aegon and his sisters.   Was the night as quiet as it seemed?  Dany asked.   It seems it was, Your Grace,  said Brown Ben Plumm.  She was pleased. Meereen had been sacked savagely, as new-fallen cities always were, but Dany was determined that should end now that the city was hers. She had decreed that murderers were to be hanged, that looters were to lose a hand, and rapists their manhood. Eight killers swung from the walls, and the Unsullied had filled a bushel basket with bloody hands and soft red worms, but Meereen was calm again. But for how long?  A fly buzzed her head. Dany waved it off, irritated, but it returned almost at once.  There are too many flies in this city.   Ben Plumm gave a bark of laughter.  There were flies in my ale this morning. I swallowed one of them.    Flies are the dead man’s revenge.  Daario smiled, and stroked the center prong of his beard.  Corpses breed maggots, and maggots breed flies.    We will rid ourselves of the corpses, then. Starting with those in the plaza below. Grey Worm, will you see to it?    The queen commands, these ones obey.    Best bring sacks as well as shovels, Worm,  Brown Ben counseled.  Well past ripe, those ones. Falling off those poles in bits and pieces, and crawling with…    He knows. So do I.  Dany remembered the horror she had felt when she had seen the Plaza of Punishment in Astapor. I made a horror just as great, but surely they deserved it. Harsh justice is still justice.   Your Grace,  said Missandei,  Ghiscari inter their honored dead in crypts below their manses. If you would boil the bones clean and return them to their kin, it would be a kindness.   The widows will curse me all the same.  Let it be done.  Dany beckoned to Daario.  How many seek audience this morning?    Two have presented themselves to bask in your radiance.   Daario had plundered himself a whole new wardrobe in Meereen, and to match it he had redyed his trident beard and curly hair a deep rich purple. It made his eyes look almost purple too, as if he were some lost Valyrian.  They arrived in the night on the Indigo Star, a trading galley out of Qarth.   A slaver, you mean. Dany frowned.  Who are they?    The Star’s master and one who claims to speak for Astapor.    I will see the envoy first.   He proved to be a pale ferret-faced man with ropes of pearls and spun gold hanging heavy about his neck.  Your Worship!  he cried.  My name is Ghael. I bring greetings to the Mother of Dragons from King Cleon of Astapor, Cleon the Great.   Dany stiffened.  I left a council to rule Astapor. A healer, a scholar, and a priest.    Your Worship, those sly rogues betrayed your trust. It was revealed that they were scheming to restore the Good Masters to power and the people to chains. Great Cleon exposed their plots and hacked their heads off with a cleaver, and the grateful folk of Astapor have crowned him for his valor.    Noble Ghael,  said Missandei, in the dialect of Astapor,  is this the same Cleon once owned by Grazdan mo Ullhor?   Her voice was guileless, yet the question plainly made the envoy anxious."
}